[
    {
        "name": "Axis & Allies Europe 1940",
        "description": "Axis &amp; Allies Europe 1940, a deluxe edition of Axis & Allies: Europe, includes neutral countries which can be invaded. There are true neutrals as well as pro-axis and pro-allied neutrals. Mechanized infantry and tactical bombers are included. Mechanized infantry is represented by half-tracks. France (blue) and Italy (brown) have national tokens and dedicated units of their own. The board measures 35 inches wide by 32 inches high (89 x 81 cm).&#10;&#10;This game is designed to be joined with Axis & Allies Pacific 1940 to create a six-player game on a map measuring 70 inches wide by 32 inches high (178 x 81 cm). This variant of the game is described in the Europe 1940 manual as Axis &amp; Allies Global 1940.&#10;&#10;Integrates with:&#10;&#10;    Axis & Allies Pacific 1940&#10;&#10;&#10;&#10;&#10;",
        "artist": "Blake Beasley"
    },
    {
        "name": "Disney Apples to Apples",
        "description": "Featuring Disney images on every Red Apple card!&#10;&#10;Take a trip through the Wonderful World of Disney with Disney Apples to Apples!  Players both young and old will delight in the hillarious comparisons that result as they relive their favorite Disney moments...and kids will have fun expanding their vocabulary and thinking skills at the same time.&#10;&#10;It's as easy as comparing &quot;apples to apples.&quot;  Just select the card from you hand that you think is most like the card played by the judge.  If the judge picks your card, you win that round.  And everyone gets a chance to be the judge!&#10;&#10;Each round is filled with surprising comparisons from a wide range of people, places, things and events.  Fast moving and refreshing. Disney Apples to Apples is easy to learn and fun to play - the perfect game for the whole family!&#10;&#10;",
        "artist": "John Kovalic"
    },
    {
        "name": "Río de la Plata",
        "description": "In 1536 Pedro de Mendoza founded the city of Buenos Aires along the river Rio de la Plata. After 5 years the settlers were forced to leave the city, exhausted by the difficulties and by the continuous attacks of the indigenous Querandies. The city was destroyed by the natives some weeks after.&#10;&#10;Almost fifty years later Juan de Garay leads a new expedition and founds a new city. As before, resources are low and the natives are angry! &#10;But not only that: now the Corsairs paid by the English Crown threaten the new Spanish settlement!&#10;&#10;Rio de la Plata is a strategy game where players represent the chiefs of the families of Spanish settlers of Buenos Aires. They must work together to defend and develop the city, but also look to gain sufficient prestige for themselves to take the most important political offices. At the end only one will be the new Governor! Will it be you?&#10;&#10;First game needs about 3-4 hours.&#10;Normal game needs about 150 minutes (4 players).&#10;&#10;Essen 2010 Release.&#10;&#10;",
        "artist": "Lamberto Azzariti"
    },
    {
        "name": "Circus Train (First Edition)",
        "description": "Circus Train, by designer Tom Decker, is a 1-5 player game in which you are the owner and operator of a small circus train in prohibition-era America. In this game, you and your opponents are vying to employ the best talent while putting on the most magnificent show each month. While touring the country by train, you will have the opportunity to perform while adding talent to your show through hiring the performers stranded in cities by defunct circuses. Just remember to keep an eye on your wages, because your talent definitely will.&#10;&#10;Through clever card hand management, you control the movement of your train around the American northeast, making strategic business decisions about talent, performances and payroll in this fast-paced strategy game. Each turn represents one week of real time, and after six months, the circus season closes for the year and the game ends with one player declared as having The Greatest Show on Earth.&#10;&#10;Inspired by Sara Gruen&rsquo;s novel, Water for Elephants, Circus Train Second Edition includes thematic elements such as improving your show&rsquo;s reputation by picking up alcohol for your talent and staff (legally, in Canada), the high costs of supplying big cats and elephants, and the ability to &ldquo;red light&rdquo; (firing by throwing off the train) disgruntled talent or talent that has simply become too expensive to maintain. These elements are blended into the game&rsquo;s mechanics, keeping it all simple while adding layers of depth and strategy.&#10;&#10;",
        "artist": "Tim Allen,Chris Taylor"
    },
    {
        "name": "Aspern-Essling 1809",
        "description": "On April 24, 1809, Napol&eacute;on had proclaimed at Ratisbon, &laquo; We will be in Vienna in less than a month ! &raquo;. Although he did seize the Austrian capital on May 13, the Danube still separated the Emperor from the army of the Archduke Charles. To pull off a decisive victory, he now had to force a crossing of the river and defeat the Austrians as swiftly as possible. On May 20 in mid-afternoon 200 skirmishers of Molitor&rsquo;s division crossed the backwater which separated the island of Lobau from the left bank of the Danube. By the next day, a beautiful Pentecost Sunday, the French were on the left bank with 30,000 men, including 6,000 cavalry, and were ready for battle. Grounded on the villages of Aspern and Essling and covered on the wings by the river, their base was solid. For his part, the Archduke Charles decided to go over to the attack quickly so as to destroy the troops who had just crossed the Danube. He had over 60,000 men available, organized into five columns, and before long the Austrians would have 90,000. After the battle had begun, several of the bridges over the Danube were temporarily broken, preventing the French from receiving the reinforcements necessary for victory. During the two days of May 21 and 22 the divisions on the ground, commanded by Mass&eacute;na and Lannes, would have to resist heroically as the enemy launched a series of massive assaults. The victory was delayed until later : in less than three months, that would be Wagram !&#10;&#10;Aspern-Essling 1809 is the 26th battle of the series Jours de Gloire, launched in 1997 with Rivoli 1797 (Vae Victis n&deg;18). The game covers the two days of the battle (May 21 and 22, 1809), with special rules dealing with the command situation of the French army (Lannes and Mass&eacute;na). The bridges between the island of Lobau and the left bank of the Danube also hold an important place in the simulation.&#10;&#10;Aspern-Essling 1809 includes :&#10;a 59 x 40 cm map,&#10;216 double-sided die-cut counters and markers,&#10;a color rulebook with scenarios and a player aid.&#10;&#10;Units : Regiments and brigades&#10;Map scale : 330 m/hex.&#10;Turn : 90 minutes&#10;Complexity : 6 / 9&#10;&#10;French or English Rules and Charts.&#10;&#10;",
        "artist": "Christophe Camilotte,Pascal da Silva"
    },
    {
        "name": "Dominant Species",
        "description": "Game Overview&#10;90,000 B.C. &mdash; A great ice age is fast approaching. Another titanic struggle for global supremacy has unwittingly commenced between the varying animal species. &#10;Dominant Species is a game that abstractly recreates a tiny portion of ancient history: the ponderous encroachment of an ice age and what that entails for the living creatures trying to adapt to the slowly-changing earth. &#10;Each player will assume the role of one of six major animal classes&mdash;mammal, reptile, bird, amphibian, arachnid, or insect. Each begins the game more or less in a state of natural balance in relation to one another. But that won&rsquo;t last: It is indeed &quot;survival of the fittest&quot;.&#10;Through wily action pawn placement, players will strive to become dominant on as many different terrain tiles as possible in order to claim powerful card effects. Players will also want to propagate their individual species in order to earn victory points for their particular animal. Players will be aided in these endeavors via speciation, migration, and adaptation actions, among others. &#10;All of this eventually leads to the end game&mdash;the final ascent of the ice age&mdash;where the player having accumulated the most victory points will have his animal crowned the Dominant Species. &#10;But somebody better become dominant quickly, because it&rsquo;s getting mighty cold...&#10;&#10;Game Play&#10;The large hexagonal tiles are used throughout the game to create an ever-expanding interpretation of earth as it might have appeared a thousand centuries ago. The smaller tundra tiles will be placed atop the larger tiles&mdash;converting them into tundra in the process&mdash;as the ice age encroaches.&#10;The cylindrical action pawns (or &quot;AP&quot;s) drive the game. Each AP will allow a player to perform the various actions that can be taken, such as speciation, environmental change, migration, or glaciation. After being placed on the action display during the Planning Phase, an AP will trigger that particular action for the owning player during the Execution Phase.&#10;Generally, players will be trying to enhance their own animal&rsquo;s survivability while simultaneously trying to hinder that of their opponents&rsquo;&mdash;hopefully collecting valuable victory points (or &quot;VP&quot;s) along the way. The various cards will aid in these efforts, giving players useful one-time abilities or an opportunity for recurring VP gains.&#10;Throughout the game, species cubes will be added to, moved about in, and removed from the tiles in play (the &quot;earth&quot;). Element disks will be added to and removed from both animals and earth. &#10;When the game ends, players will conduct a final scoring of each tile&mdash;after which the player controlling the animal with the highest VP total wins the game.&#10;&#10;Reimplemented by&#10;&#10;    Dominant Species: The Card Game&#10;&#10;&#10;&#10;&#10;",
        "artist": "Chad Jensen,Rodger B. MacGowan,Chechu Nieto,Eric Williams (I)"
    },
    {
        "name": "Urban Sprawl",
        "description": "From the publisher's website]:&#10;&#10;Game Overview:&#10;&#10;Urban Sprawl is a game for 2&ndash;4 players. Urban Sprawl abstractly models the growth of a town into a teeming metropolis.&#10;&#10;Players assume the roles of entrepreneur, tycoon, and politician&mdash;each helping in the development of a hypothetical &quot;Anywhere, USA.&quot; Wealth and Prestige will be earned and spent throughout the game. Buildings will rise only to later be demolished for better and larger fare.&#10;&#10;Throughout the game players will gather valuable Permits. These will result in either a wealthy Investment or the foundation of a new building Contract. Players will strive to become dominant in one or more building Zones in order to acquire beneficial political offices.&#10;&#10;All of this eventually leads to the end game&mdash;a vibrant metropolis that is revered around the world&mdash;when the player with the most Prestige will be crowned the winner.&#10;&#10;Game Play:&#10;&#10;The grid of streets on the board provides the framework for building the small town. The buildings will be placed within the grid and identified with control markers (wooden cubes) to show each player's contribution to the growing urban area. Each building's value is determined by the cumulative Wealth and Prestige values of the block in which is it constructed.&#10;&#10;At the start of a player's turn he may discard one or more Building Permit cards from hand as &quot;Investments,&quot; gaining Wealth in doing so. Next that player gets 6 &quot;Action Points&quot; (APs) with which to spend on any of the the following activities:&#10;&#10;&bull; Acquiring new Building Permit cards from those available to choose;&#10;&bull; Constructing new buildings from those currently available;&#10;&bull; Acquiring a &quot;Favor&quot;&mdash;a Building Contract that only that player can build.&#10;&#10;Each activity carries with it a variable cost in APs, depending on where the chosen card lies on the board.&#10;&#10;Once a player has spent his APs it's time for a quick reset phase in readiness for the next player's turn. It is during this phase that events can occur, elections can be held for the various political offices, and players receive payouts in Wealth and Prestige. Wealth payouts provide funding for new buildings while Prestige payouts provide victory points.&#10;&#10;Generally, players will be trying to build in areas that provide better payouts. Players are also looking to construct more buildings of a particular &quot;zone&quot;&mdash;Government, Residential, Industrial, or Commercial&mdash;in order to help them win an election, as the politicians each confer a special ability to the player holding the office. Many of the buildings also provide a one-time bonus as they are built, and players can benefit from construction in the right neighborhoods.&#10;&#10;Throughout the game, the values of the buildings will generally increase as the town grows into a city and then a large metropolis. Neighborhoods that were once valuable can become run down and new city centers spring up as the urban areas sprawl out across the grid.&#10;&#10;When the game ends, players will conduct a final scoring of each Prestige row, earn points based on accumulated Wealth, and score bonus points for political offices held&mdash;after which the player with the highest Prestige total wins the game.&#10;&#10;",
        "artist": "Chad Jensen,Rodger B. MacGowan,Chechu Nieto,Eric Williams (I)"
    },
    {
        "name": "Commands & Colors: Napoleonics",
        "description": "Commands &amp; Colors: Napoleonics allows you to re-fight epic battles of the Napoleonic era. In this core volume, the focus is on the French and the British, two bitter rivals in the struggle for European preeminence during the time of Napoleon.&#10;&#10;As with other games in the Commands &amp; Colors genre, units in both armies can only move and fight when ordered. The command playing cards supply those orders, providing an element of luck that creates a fog of war and presents players with both challenges and opportunities. You must maximize your opportunities by playing your command cards judiciously. How well you handle the diverse units, their weapons, and the terrain, will determine victory.&#10;&#10;",
        "artist": "Pierre Benigni,Pascal da Silva,Donal Hegarty,Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "Infidel",
        "description": "(from GMT website:)&#10;&#10;Infidel focuses on the major battles of the early Crusades era between the Christians and the Muslims. This is a period that saw cavalry reign supreme, and pitted the European heavy cavalry &ndash; armored &ldquo;knights&rdquo; - system against the Eastern/Turkish light cavalry tactics.&#10;&#10;Infidel is designed for quick learning and easy play. Game rules are short, there are no &ldquo;turns&rdquo; - play is Continual, with ample opportunities to steal play from your opponent - and combat resolution is a single dieroll.Playing time is about 1-2 hours, per battle.&#10;&#10;Infidel is also GMT&rsquo;s gift to the gamer who enjoys playing solitaire. The system is designed for both individual and face-to-face play without any loss in insight or Fun. Each game is a &quot;paper time machine&quot; that allows players to see what happened in these famous battles and why.&#10;&#10;The battles include:&#10;&#10;&#10;     Dorylaeum (1097): The Crusader line of march, including the people&rsquo;s Crusade and Peter the hermit, as well as all the great 1st Crusade Leaders, are &ldquo;ambushed&rdquo; by Kilij Arslan and his crack Seljuk cavalry.&#10;     Antioch (1098): The exhausted, starving and depleted Crusaders &ndash; they had few horses left &ndash; have just taken Antioch and are now faced with a large Turkish army, under Kerbogha, sent to retake the city.&#10;     Ascalon (1099): The Crusaders, having seized Jerusalem, turn south to fend off the suddenly active large army of The Fatimids, with their crack Mamluk heavy cavalry.&#10;     Harran (1104): Baldwin II of Edessa seeks to maintain control of his little kingdom in northern Syria, something Soqman, atabeg of Damascus, is not happy to allow. One of the first major Crusader defeats.&#10;     Montgisard (1177): Saladin attempts to destroy a small army from the Kingdom of Jerusalem with an army more than five times its size. Though there are only 400 knights, the Crusaders are led by the remarkable Baldwin IV, The Leper King. The outcome - one of the greatest Crusader victories. See if you can carry off this stunning upset!&#10;     Arsuf (1191): The classic battle between Richard I Lionheart and the Ayyubid Army of Saladin highlighting the major facets of each army in an unusual moving battle.&#10;&#10;&#10;Each game includes:&#10;&#10;     Two 22&rdquo; x 32&rdquo;game-maps, backprinted&#10;     2 countersheets&#10;     Rules Booklet&#10;     Battle Book&#10;     Charts and Play Aids&#10;     2 ten-sided dice&#10;&#10;&#10;&#10;&#10;DESIGNER Richard H. Berg&#10;DEVELOPER Ralph Shelton&#10;ART DIRECTOR Rodger B. MacGowan&#10;MAP ART Charles Kibler&#10;COUNTER ART Mike Lemick, Charles Kibler, &amp; Rodger B. MacGowan&#10;&#10;",
        "artist": "J. J. Dassy,Mike Lemick,Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "Iron and Oak",
        "description": "Iron and Oak is game of ship-to-ship combat set during the American Civil War. As a tactical representation of naval warfare, each of the ships is accurately modeled for offensive capability including gunnery, ramming and spar torpedoes; for defensive capability including damage and five distinct armored or wooden hit locations; and for maneuverability, crew size and draft.&#10;&#10;You command 70 famous ships of the era, including the Union: Onondaga, Tecumseh, Winnebago, Monitor, Osage, Minnesota, Brooklyn, Hartford, Essex, Carondolet, Kearsarge, Ossipee, Queen of the West, Iroquois, Spuyten Duyvil; and the Confederate: Tennessee, Virginia, Atlanta, Palmetto State, Arkansas, Albemarle, Alabama, Florida, General Beauregard, Sumter; and many more.&#10;&#10;Many of the 14 scenarios, in this easy-to-learn game, are playable in an hour or less. Included are 13 historical and 1 hypothetical engagements featuring Hampton Roads, Mobile Bay, Trent&rsquo;s Reach, Wassaw Sound, the duel between Alabama and the Kearsarge, and the saga of the Arkansas, which may be played as three individual scenarios or as a linked mini-campaign.&#10;&#10;In addition, forts bristling with guns make their appearance to challenge the will of the ship captains. If that was not enough to heat things up, scenario based optional rules add a few interesting &lsquo;what if&rsquo; situations to expand on play.&#10;&#10;If you are interested in commanding your own fleet, Iron and Oak includes a standalone campaign module where player selected forces fight it out in the many rivers, bays, inlets and costal areas. The campaign game recreates the brown water actions, typical of the period, in a series of randomly generated battles. As play progresses, the players do not know the exact length of the campaign or the specific mix of the battles. Players must not only manage the unfolding battles, but must also strategically allocate resources and repair and refits their ships. The 16 card Navy Yard deck is used to plot a course through and influence the challenges of the campaigns.&#10;&#10;Two or more players battle it out on an 22&rdquo; x 34&rdquo; map that features an area movement grid. This simple approach controls ship movement as well as all combat action. Gone are the long periods of inaction, typical of ACW tactical naval games, as these early steam-era ships struggled to maneuver into battle.&#10;&#10;This innovative game system places the emphasis on quick action and tactical decision making. The 50 Action Cards are used to assist and enhance play, not drive it. Each time you battle it out, whether in a scenario or campaign game, the action unfolds in a very different manner. Do you wish to employ hot shot or incendiary shells? Is now the best time to rapid fire or is it wise to maneuver and ram? Should you allocate part of the crew as a repair party? Is that enemy ship going to maneuver into your torpedo (mine) field? These and many other possibilities exist through the play of the action cards. Or, you may decide to not play any action cards at all and just maneuver and shoot. You control how and when the action will unfold.&#10;&#10;At its core Iron and Oak is a naval simulation. It accurately models the close-range slugging matches typical of the period. You have the opportunity to play out the various battles to their conclusion. Will history repeat itself, or will a new account be written? Will the Monitor&rsquo;s 11&rdquo; Dahlgren smoothbores blast through Virginia&rsquo;s armor plating or will their battle again end in a stalemate? Will the powerful Tennessee win out against Admiral David Farragut&rsquo;s Union fleet or again fall to his superior numbers? Will the Atlanta defeat the two Union monitors in kind or again slip aground and strike her colors. This time, you get to determine the outcome. You are not bound by history&rsquo;s stories.&#10;&#10;",
        "artist": "Charles Kibler,Rodger B. MacGowan,Louis Prang"
    },
    {
        "name": "Labyrinth: The War on Terror, 2001 – ?",
        "description": "2001: The &ldquo;American Century&rdquo; had closed with a single Cold War superpower standing and a pause in conflict that some at the time dubbed &ldquo;The End of History&rdquo;. It wasn&rsquo;t.&#10;&#10;In the Middle East and South Asia, an Islamic revival was underway. Resentments bred in part of US support for the regions&rsquo; anti-Soviet tyrannies soon erupted into a new struggle against the West. Wealthy Saudi fanatic Usama bin Ladin issued a declaration of holy war against America in 1996 and then fired the first shots with spectacular terrorist attacks on US targets in East Africa in 1998 and the Arab Peninsula in 2000.&#10;&#10;Bin Ladin&rsquo;s al-Qaeda organization plotted securely under the protection of the Taliban, a fundamentalist movement in Afghanistan born of the anti-Soviet &ldquo;Bear Trap&rdquo; of the 1980s. By 2001, al-Qaeda had set in motion even more devastating strikes &mdash; this time within the US Homeland &mdash; that Bin Ladin hoped would light off a global Muslim uprising. Uprising or not, the Western response to those September 11th attacks would reshape international affairs from London to Jakarta and from Moscow to Dar es Salaam.&#10;&#10;Labyrinth takes 1 or 2 players inside the Islamist jihad and the global war on terror. With broad scope, ease of play, and a never-ending variety of event combinations similar to GMT&rsquo;s highly popular Twilight Struggle, Labyrinth portrays not only the US efforts to counter extremists&rsquo; use of terrorist tactics but the wider ideological struggle &mdash; guerrilla warfare, regime change, democratization, and much more.&#10;&#10;From the award-winning designer of Wilderness War and later Andean Abyss, Cuba Libre, A Distant Plain, and Fire in the Lake, Labyrinth combines an emphasis on game play with multifaceted simulation spanning recent history and near future. In the 2-player game, one player takes the role of jihadists seeking to exploit world events and Islamic donations to spread fundamentalist rule over the Muslim world. The other player as the United States must neutralize terrorist cells while encouraging Muslim democratic reform to cut off extremism at its roots. With the game&rsquo;s solitaire system, a single player as the US takes on ascending levels of challenge in defeating al-Qaeda and its allies.&#10;&#10;The jihadists must operate in a hostile environment &mdash; staying below the authorities&rsquo; radar while plotting terrorist attacks and building for the Muslim revolution. Will Iran&rsquo;s Shia mullahs help or hinder the Sunni jihadists? Will the gradual spread of Islamist rule bring final victory &mdash; or will it be a sudden strike at the United States with an Islamic weapon of mass destruction?&#10;&#10;The United States has the full weight of its military force and diplomacy at the ready &mdash; but it can&rsquo;t be everywhere: will technological and material superiority be enough? US forces can invade and topple Islamist regimes, but how will the Muslim &ldquo;street&rdquo; react? And if quagmire results, how will the US find its way out?&#10;&#10;Labyrinth features distinct operational options for each side that capture the asymmetrical nature of the conflict, while the event cards that drive its action pose a maze of political, religious, military, and economic issues. In the parallel wars of bombs and ideas, coordinated international effort is key &mdash; but terrorist opportunities to disrupt Western unity are many. The Towers have fallen, but the global struggle has only just begun.&#10;&#10;&ldquo;Let&rsquo;s roll!&rdquo;&#10;&#10;",
        "artist": "Donal Hegarty,Rodger B. MacGowan,Leland Myrick,Volko Ruhnke,Mark Simonitch"
    },
    {
        "name": "Cornucopia",
        "description": "In Cornucopia, your goal is to fill your basket with a bountiful collection of fruits and vegetables, while at the same time correctly predicting how long it will take you to fill your basket.&#10;&#10;You can try to assemble a basket with only one type of fruit or vegetable, which is difficult to do; or you can try to collect the entire range of harvest products. In either case, you want to complete your harvest as efficiently as possible to earn the most coins.&#10;&#10;Players can bet and win more coins by correctly predicting the outcome (success or failure) of their opponents&rsquo; efforts to assemble their harvest, so players stay involved and engaged in the game even when it is not their turn!&#10;&#10;",
        "artist": "Charlie Bink"
    },
    {
        "name": "Mâamut",
        "description": "The game is set in a pre-historic era and the players need to control the spirits of animals...the player with the best control of the mammoth can lead the tribe in their search for food&#10;&#10;The hunters take turns to choose an action: playing a card to move, creating a trap, destroying a trap or passing their turn.&#10;&#10;Players cannot directly attack the mighty mammoth, it will flee if it sees them and they must dodge aside if it stampedes at them. Instead, they must lay traps along the paths it will take and chase it into their own traps while avoiding those set by the other players.&#10;&#10;",
        "artist": "Fabrice Bovy"
    },
    {
        "name": "Viewpoint",
        "description": "Viewpoint in a non-collectible card game produced by the Australian game design company 93 Made Games.  The game contents consist of a deck of 70 cards, each illustrated in a &lsquo;70s/&lsquo;80s retro art style, and a rule sheet, attractively packaged in a small black cardboard box.  Most of what you need to know is printed on the cards themselves and makes picking up and getting into the game very easy.  The use of icons on the cards, representing different aspects of the game (e.g. the discard pile, the play area and your hand of cards), makes the game even easier to understand.&#10;&#10;The game is designed for 2 to 6 players of ages 7 and up.  Games can take as little as 5 minutes or as long as 30 minutes to play - depending on the experience of players and the number of players in each game.&#10;&#10;The objective of the game is to be the first player with 100 points down on the table, which isn&rsquo;t as easy as it sounds.  Players have cards that can steal cards you have tabled or send them to the discard pile.  So you need to be able to judge the best time to put cards on the table and how to defend your cards once they are down.&#10;&#10;Game-play is highly interactive and the base rules are simple to follow to make it accessible to casual and non-gamers as well as dedicated gamers.  At the start of play, each person is dealt a hand of five cards.  These cards each have values clearly printed on them, ranging from negative amounts to a maximum of 20 points.  They also have actions printed on them, along with a graphic (which features some pun on vision such as &lsquo;wink&rsquo; or &lsquo;blind spot&rsquo;).  The action associated with an individual card is usually executed as you attempt to put the card face up into your play area (known as your Field of View).  There are a few cards (such as Spectacles) that allow you to play the card as a reaction to other players trying to affect your cards.&#10;&#10;While your first few games of Viewpoint might not appear to involve a high degree of skill for winning, you will soon discover that you need to be much more strategic about how and when you play your cards, as well as keeping a careful eye on what people have got down on the table.  Simply placing cards into your Field of View won&rsquo;t win you the game, as other players will start targeting you as you hit a score of around 80+. You need think &lsquo;out of the box&rsquo; and bluff your opponents, by sitting on a &lsquo;non-threatening&rsquo; score, while searching for cards that will let you steal cards or take multiple turns, allowing you to suddenly win the game by coming from behind.&#10;&#10;The design of the game system provides an entertaining and interactive experience encouraging replayability.  The games system also provides the opportunity to release future expansion packs of cards to add to the mischief already present in the base deck.&#10;&#10;",
        "artist": "Anthony Condos"
    },
    {
        "name": "Funglish",
        "description": "There&rsquo;s no time to lose&hellip; so grab some clues! Can you get the other players to guess the word KANGAROO? You can&rsquo;t talk or act&mdash; but you can find, grab and play just the right clues from 120 descriptive tiles as everyone shouts out their guesses. You play living, wild, and tall. Is it a Redwood? A giraffe? A basketball player? Nope. Keep playing tiles like furry, brown and bouncy. Once another player yells out KANGAROO, try a new word before time runs out! That&rsquo;s the funny, noisy, unique, entertaining, magical, fast-moving fun of FUNGLISH!&#10;&#10;The word-guessing game that lets you express it and guess it with piles of tiles!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Jump Gate",
        "description": "Explore far-away planets.  Discover what resources and surprises they hold. Be the first to set foot on a new planet and claim it as your own. Collect resources to gain fortune and fame. All of this comes courtesy of: the Jump Gate.&#10;&#10;Players are spaceship captains that are competing to be the best at claiming new planets and collecting the resources found at those planets.  Points are scored at the end of the game based on the number of planets they scanned and claimed, and their combination of resources collected.  Each type of resource has a different method for being scored -- so, collecting sets of the same resource is encouraged ... and disrupting other players&rsquo; collection plans is good strategy.&#10;&#10;Gameplay Summary (1st &amp; 2nd Editions)&#10;Eight planets are set in a circle around the Jump Gate and Black Hole Boards.  Resource cards are distributed:  1 face-up to each player, 1 face-up to each planet, and the rest are distributed face-down amongst the planets.&#10;&#10;Players are each given 5 NavComp cards and the rest of the NavComp cards are set as a draw deck in the middle of the table.  Each NavComp card contains 2 codes (used to take some of the standard actions) and possibly a special action.&#10;&#10;Players take turns around the table.  On a player's turn, he/she takes 2 actions in any order, and may select from the following actions:  Research (refill hand), Fly (move to neighboring planet), Jump (use the Jump Gate to move to another Planet), Scan (reveal a resource at a planet), Land &amp; Claim (claim a planet and reveal all resources there), Harvest (collect a resource), and Special Action.  Special actions include being able to scan a far-away planet, harvest extra resources, swap locations with another player, etc.&#10;&#10;When players &quot;Jump&quot;, they add one of their markers to the Jump Gate Board.  The player with the most markers on the Jump Gate Board at the end of the game gains an extra 5 points.  If a player collects a Resource that has a &quot;Black Hole&quot; icon on it, a marker is added to the Black Hole Board.  If too many markers get added to that board, the game ends and the player with the most markers on the Black Hole Board loses some of his/her collected Resources.  The game can also end when all non-Black-Hole Resources have been collected from all of the planets.&#10;&#10;Scoring is done at the end of the game, and players are awarded points for Scanning and Claiming Planets, as well as for the combination of Resources they had collected.  Each type of Resource has a different method for scoring -- but all encourage a player to collect as much of that Resource as possible.  The player with the most total points is the winner.&#10;&#10;3rd Edition Gameplay Changes&#10;The 3rd Edition, published in a smaller box with artwork and player component updates, also included a number of design changes:&#10;&#10;    Max. Players is reduced to 5&#10;    New &quot;Sand&quot; resource replaces the &quot;Nothing&quot; cards from earlier editions&#10;    Setup changes include giving players two or three hidden resource cards (as opposed to a single face-up card) and not every resource getting used in the game&#10;    In-game changes include cleaner, more thematic scanning and harvesting rules&#10;    The Black Hole only has 7 marker spaces on it, and triggering the end game via the Black Hole results in the player with the most markers on the Black Hole losing their hidden resources they received during setup instead of randomly-chosen resources&#10;    No points are scored for scanning or the Jump Gate ... only the resources collected and Planets claimed&#10;&#10;&#10;&#10;&#10;",
        "artist": "Josh Cappel,Ariel Seoane,Gary Simpson,Scott Slomiany,Matt Worden"
    },
    {
        "name": "Tumblin-Dice Medium",
        "description": "A dexterity dice game consisting of four sets of colored dice one either slides, rolls, or flicks down a stepped surface. Usually one slides the die for better accuracy. After each person has slid their 4 dice, points are scored. You score the die roll times a multiplier of either 1&times;, 2&times;, 3&times;, or 4&times; depending on which area of the board the die is on. (Dice which land in the 0&times; region are immediately removed from play.) High scoring rolls are targets for opponents. Four rounds are played and the player with the most points win.&#10;&#10;Tumblin-Dice is the original and largest version of the game.&#10;&#10;Tumblin-Dice Jr. is the &quot;travel&quot; version.&#10;&#10;Tumblin-Dice Medium is smaller than the original game, but larger than the Jr version.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "JAB: Realtime Boxing",
        "description": "JAB is a skill-centric strategic boxing card game. In JAB, you get direct control over your boxer's fists, providing an experience as close as possible to real boxing without getting punched in the face. JAB is played in real-time, meaning there are no turns.&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Winning the game&#10;&#10;To win the game, get a knockout by throwing staggering haymakers at your opponent until he eats canvas, or strategically win more rounds than your opponent by impressing the judges with your beautiful technique.&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;How is JAB different?&#10;&#10;JAB attempts to innovate the real-time genre by challenging a player to be constantly making decisions, rather than simply recognizing patterns or performing calculations. The game also measures your ability to calmly manage your focus in a chaotic situation.&#10;&#10;",
        "artist": "Gavan Brown"
    },
    {
        "name": "Zombie Dice",
        "description": "Eat brains. Don't get shotgunned.&#10;&#10;In Zombie Dice, you are a zombie. You want braaains &ndash; more brains than any of your zombie buddies. The 13 custom dice are your victims. Push your luck to eat their brains, but stop rolling before the shotgun blasts end your turn! Whoever collects 13 brains first wins. Each game takes 10 to 20 minutes and can be taught in a single round.&#10;&#10;Each turn, you take three dice from the box and roll them. A brain symbol is worth one point at the end of the round, while footsteps allow you to reroll this particular dice. Shotgun blasts on the other hand are rather bad, cause if you collect three shotgun blasts during your turn, it is over for you and you get no points. After rolling three dice, you may decide if you want to score your current brain collection or if you want to push your luck by grabbing new dice so you have three again and roll once more.&#10;&#10;",
        "artist": "Alex Fernandez (I)"
    },
    {
        "name": "None But Heroes",
        "description": "from MMP's website:&#10;&#10;In September of 1862 after months of uninterrupted and spectacular successes, Robert E. Lee's Army of Northern Virgina was poised to win the war.&#10;&#10;Lee has beaten back McClellan's Army of the Potomac from the gates of Richmond, routed Pope's Army of Virginia, and built a reputation of invincibility.&#10;&#10;Meanwhile, Lincoln had already penned the Emancipation Proclamation which would recast the war from one of a political disagreement over Federal control to a moral crusade which just could not be argued away. He just needed a victory to cast the entire war in an a new strategic light.&#10;&#10;All could very well be decided by what happens in the western part of Maryland over a few days.&#10;&#10;McClellan fought Lee's army back to the banks of the Antietam creek near the town of Sharpsburg. There both armies stood to fight the bloodiest single day battle in American history. The final decision is in your hands.&#10;&#10;None but Heroes is a game about that terrible day. Players tackle each other head-on. Can you do better than McClellan? Can you fight McClellan off like Lee? The stakes couldn't be higher!&#10;&#10;None but Heroes is the first game in the new Line of Battle Series. While drawing on the lessons of over 20 years of ACW design work of its two ancestor series, LoB represents the next generation of ACW game design. No stone was left unturned in making this system the best gaming experience possible. All the unit rosters and paperwork that interfered with the fighting is gone. The typical (and time consuming) multiple fire phases have all been integrated into movement so the action is non-stop.&#10;&#10;For the first time, the rat fight feel of the ACW open battlefield comes alive. The historical units (generally regiments of infantry and batteries of cannon) actually show the combined arms interactions and tactics available at the time. Old hands will see the history in a new light as they explore the implications of more recent research.&#10;&#10;Representing many years of original research, the game contains information not available anywhere else regarding the strength, equipment, location, capabilities, and order of battle of both armies. Extensive historical notes layout just some of the myriad of details included in the units, scenarios, and map.&#10;&#10;As one small example, it explores the frequently overlooked &quot;Green&quot; units at the battle (units which have been in the army for a few weeks or even less). The Green units will make you look at McClellan's strength in a whole new way. This is a level of &quot;greenness&quot; well beyond the usual sense of &quot;not having been in combat, yet&quot;. These are enthusiastic men, but some of whom have not yet been taught to load their muskets.&#10;&#10;The Union player is only mildly inhibited by his McClellan persona; you can try a lot of different approaches to cutting the Rebels down to size. You are equipped with the same heavy guns and infantry with just as much grit and determination as he was.&#10;&#10;The Confederate player will need to use his thin forces wisely, but cannot fail to counterattack as needed to blunt Union advances. You must use your troop's elan to make up for their limited numbers.&#10;&#10;The game features four two-map scenarios which allow players to pick up the action at various times during the day and the morning of the next. The ability to start play the day after the battle allows players a chance to explore the options available on that day. Each of the other three scenarios can alternatively be played as a two day campaign game.&#10;&#10;In addition to the large scenarios above, there are four smaller scenarios involving only portions of one map. One is a very short learning scenario showing the charge of Hood's Texans into the Cornfield. The other three isolate key actions of the battle: The compete Cornfield fight, the Battle for the Sunken Road, and the final attack by Burnside to take Sharpsburg and the counterattack by A.P. Hill's Division.&#10;&#10;",
        "artist": "Nicolás Eskubi"
    },
    {
        "name": "The Barbarossa Campaign",
        "description": "You, Alone, and The Russian Front&#10;&#10;The Barbarossa Campaign recalls the titanic struggle on the Russian Front of World War II as no other wargame has presented it before &ndash; as a story filled with drama and pathos using a novel new solitaire gaming system that puts you, the Axis Player, in command facing momentous events &ndash; some- times history&rsquo;s master, and at other times its pawn.&#10;&#10;Featuring a dynamic game engine, where you must attempt to collapse the Soviet Union against all odds &ndash; where the cunning strategies you devise while directing your panzer thrusts eastward or offering fanatical resistance as the Red Army pushes relentlessly back, you will bask in a fresh, new retelling of this epic story each time the game is played.&#10;&#10;Plumb the possibilities offered in The Barbarossa Campaign where myriad historical &ldquo;What ifs?&rdquo; are constantly explored and where you will be swept away by the ebb and flow of vast battles that can be swiftly mastered after encountering rules of only moderate difficulty. It is time to revel in your hobby again with this fast-moving, innovative Russian Front wargame built for fun and enjoy the &ldquo;story&rdquo; in history afresh every time you play it.&#10;&#10;Game Data:&#10;&#10;Number of Players: 1&#10;Ages: 14 and up&#10;Playing Time: scenarios are approximately 35 minutes each; a full campaign game takes approximately 3-4 hours&#10;Complexity: 5.5 on a 9 scale&#10;Solitaire Suitability: 9 on a 9 scale&#10;Scale: Each unit is 1 to 2 Axis Corps or 1 to 2 Soviet Armies; each hex is 90 miles and each turn is 1 season (3 months) of real time&#10;&#10;Game Components:&#10;&#10;&bull;    One 16-page, color instructions booklet&#10;&bull;    One 2-page sample game turn&#10;&bull;    One 11&quot; x 25.5&quot; color map&#10;&bull;    5 Scenario set up displays&#10;&bull;    3 Economic display mats&#10;&bull;    1 Events table card&#10;&bull;    100 color, die-cut two-sided 1/2&quot; square pieces&#10;&bull;    40 color, die-cut 5/8&quot; square pieces&#10;&bull;    90 color, die-cut 1/2&quot; round pieces&#10;&bull;    56 color, die-cut 5/8&quot; round pieces&#10;&bull;    40 Event cards&#10;&#10;Credits:&#10;&#10;Game Design: Gary W. Graber&#10;Additional Design and Development: Alan Emrich with Carl Paradis&#10;Graphics: Alan Emrich&#10;Map: Tim Allen&#10;Documentation Layout: Alan Emrich&#10;Playtesting: Paul Aceto, Terry Colman, Vince DeNardo, David Ells, Tully McKinley, Kim Meints, Mick Mickelsen, Peter Rixon, and Norm Stweart&#10;Proofreading: Bill Barrett, Judy Krauss, Jon Matthews, and Gary Sonnenberg&#10;&#10;",
        "artist": "Tim Allen,Alan Emrich"
    },
    {
        "name": "Alchemicus",
        "description": "Transformation of metals into gold? &#10;It&rsquo;s possible &ndash; any physicist will say nowadays. In the 16th century, alchemists made attempts to do that in their laboratories, aspiring to gain wealth and never-ending fame. Some, as Edward Kelley, thanks to royal sponsors, achieved all that, nevertheless they never succeeded in transmutation of metals&hellip; In this magical game that you are holding it&rsquo;s very simple. &#10;Build a laboratory and collect the necessary components. And transformation of metals? If you manage to adjust to the changing moods of the Spirit of Transmutation, then it&rsquo;s really not complicated at all. So, what is the game about? You have competition in your town &ndash; other alchemists who also know the right technology. Only the one of you who is the most efficient will win recognition and fame. It will surely last until the next game, or, who knows, perhaps eternally&hellip;&#10;&#10;Players will try to be the most effective alchemist.&#10;To achieve that they will need to build buildings, represented by cards. In these buildings, they will acquire resources, transform them into gold and finally sell them for victory points or cards. Selling gold isn't only way to win the game.&#10;&#10;Game is using Rondel mechanic to pick an action by players and hand management, where cards represent buildings, currency and resources.&#10;&#10;Alchemicus was designed as a family game with little negative interaction. Requests planning but also concentrating on other players movements and predicting them. Many beginners forget it, being focused on their own technology structure, so very often they fall behind. We think that this game style can be useful for teaching young players to think beyond their own needs. Anyway, the game is not for kids. The youngest of our testers who was able to win the play against his father was 12 years old (consider that his father is lawyer, so probably he is quite smart ;))) hahaha one of them. Father or son. we are not sure which one :D).&#10;Because the factor of negative interaction is not very strong the play goes ahead in a nice atmosphere which is fun for family play.&#10;Older players can play a bit differently, by using the position of The Transmutation Ghost to foil your opponents' plans. This strategy can be counteracted by defending yourself with buildings and goods in circulation which are resistant to your opponents' actions.&#10;&#10;",
        "artist": "Radosław Jaszczuk,Paweł Klus,Sandra Kochanowska"
    },
    {
        "name": "Patrol: Lost!",
        "description": "Patrol: Lost! is a Public Domain game system.  It describes a board game, its rules and components but does not contain any theme of its own.&#10;&#10;The game builds the board as it progresses by placing and removing hexagon tiles.  It's for two players, one takes control of the &quot;Good Guys&quot; and the other player controls the &quot;Bad Guys&quot;.&#10;&#10;Players move their pawns around the board, one player trying to reach the End tile and the other trying to eliminate the opponents pawns before they reach the End tile.&#10;&#10;Combat is resolved by rolling D6's with modifiers being applied.&#10;&#10;It can be played solo if the player wishes.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Leviathans",
        "description": "In 1878 the Polish genius Rychnowski isolated an electrical fluid with remarkable lifting capabilities &ndash; a single, pivotal event that would change the world. The smartest military minds of the coming generation &ndash; Zeppelin, Jellico, Fisher and others &ndash; diverted their attention to the glorious new technological revolution and sea-going battleships were abandoned around the world. In their place, armored giants took to the skies.&#10;&#10;In 1906, Great Britain launched the HMS Leviathan, the first of the &quot;super air ships&quot;, sparking an arms race around the world. By 1910 the most powerful nations boasted large High Fleets, and the start of small skirmishes left the world uneasy... Welcome to Leviathans!&#10;&#10;Leviathans is a game published by Catalyst Game Labs that simulates combat between warships that have taken to the air in an alternate history 1910. The king leviathans, the battleships, are the largest vessels. Maneuvering in support are the smaller ships of light cruisers, destroyers, and others ships. Will you captain your fleet for king and country, expanding your nation's power and becoming legend? Or will you fall from the sky, forgotten?&#10;&#10;You will determine the outcome!&#10;&#10;",
        "artist": "Doug Chaffee"
    },
    {
        "name": "Zombie Ninja Pirates",
        "description": "Zombies, Ninjas, and Pirates, how Mad!&#10;&#10;Zombies are cool! Ninjas are cool! Pirates are cool! Mad Scientists are also cool! But the coolest thing is a card game where you get to play all four types while scoring points and getting nifty objects in your chest that make you cooler and help you win.&#10;&#10;Zombie Ninja Pirates is a quick 20-30 minute card game for 2-6 players ages 13 and up.&#10;&#10;In Zombie Ninja Pirates you try to become four different types of people -- Zombies, Ninjas, Pirates, and Mad Scientists. During the game you can collect objects to help you or hurt your opponents. At the end of the game, a fast-paced lightning round can make or break the winner.&#10;&#10;Integrates with:&#10;&#10;    Vampire Werewolf Fairies&#10;&#10;&#10;&#10;&#10;",
        "artist": "Neko Pilarcik"
    },
    {
        "name": "Space Hulk (second edition)",
        "description": "Space Hulk is a game of tactical combat between Imperial Space Marines and alien creatures known as Genestealers.  The combat takes place on derelict, alien infested space vessels know as space hulks.&#10;&#10;Combat is action point driven and resolved through the use of dice.  The marines have a finite number of figures to use in combat against endless hoards of Genestealers.  The object is to accomplish given missions within their parameters or die trying.&#10;&#10;There were significant differences between the 1st edition and this one.  The first being that this version or revision was by Dean Bass and Chris Colston and based on the original game by Richard Halliwell and Paul Murphy.  The most significant difference in this version was the removal of the sand timer and thus the requirement for the marines to accomplish their turn in a limited real-time period. Also the rules of the 2nd edition did not allow the player of the Space Marines to perform actions by using command points in the turn of the Genestealer player.  Another change was the addition of combat specific dice to resolve weapons fire and a special die to resolve gun jams.  A few other minor changes were made to the rules and board graphics as well.&#10;&#10;This version contains the initial six missions found in the first edition and adds an additional 12 missions which were different than those in the 1st edition of the Deathwing and Genestealer expansions.&#10;&#10;Digitally redeveloped into Alien Assault&#10;&#10;",
        "artist": "Wayne England,David Gallagher,Mark Gibbons,Geoff Taylor,Richard Wright"
    },
    {
        "name": "Corporation",
        "description": "In CORPORATION up to 4 players try to take control of the corporation by promoting their own men to the Board Of Directors, in the Boardroom at the top of the building, before their opponents.&#10;&#10;Initially conceived as &quot;LAWMAKERS&quot;; a highly abstract race game of a novel type in which the printed rules are immutable, but players manipulate the laws governing how pieces move.&#10;&#10;Later themed and renamed by N&eacute;stor Romeral Andr&eacute;s to &quot;Eric Solomon's CORPORATION&quot;.&#10;&#10;",
        "artist": "Mireia Muntes"
    },
    {
        "name": "Undermining",
        "description": "In Undermining, players dig for resources on an alien world, making the best of the actions available to them to achieve short term goals (such as obtaining particular resources) while upgrading their Universal Mining Vehicles&mdash;UMVees&mdash;and fulfilling contracts in the long term. To win, you need to earn more &quot;star bucks&quot; than anyone else, and you earn those by completing contracts, upgrading vehicles, finding alien technologies and having resources on hand at the end of the game.&#10;&#10;Upgrading your UMVee also provides it with special abilities that can come in handy throughout the game.&#10;&#10;Undermining is a highly interactive game, with player actions sometimes benefiting and sometimes impacting the future actions of others. Competition for resources is important, of course, but using open tunnel spaces to get where you need to go&mdash;and blocking those spaces from opponents&mdash;is also key. Players can still move through other UMVees, but doing so costs battery power, and managing your batteries&mdash;which allow extra actions&mdash;is another important aspect of playing well.&#10;&#10;Undermining comes with a double-sided game board, with player interaction being significantly different from one side to the other. With a random layout of resources, UMVee upgrades, contract variability, and one-off special bonuses from the finding of alien technology, no two games of Undermining are ever the same.&#10;&#10;",
        "artist": "Gavan Brown"
    },
    {
        "name": "1817",
        "description": "1817 is a railroad operations and share trading board game in the 18xx series with a distinct financial flair. It is named after the year the New York Stock Exchange opened at 40 Wall Street in New York.&#10;&#10;1817 differentiates itself from other 18xx games with its sophisticated financial mechanics that simulate the laissez faire capitalism of early America. While all the familiar mechanics of an 18xx game are present, such as placing tiles, purchasing tokens, and running trains, the game is won or lost based on the financial decisions you make.&#10;&#10;1817 includes financial mechanics seen in other 18xx games such as mergers, friendly takeovers, and conversions to different share structures. Beyond these basics, 1817 introduces several additional financial mechanics such as short selling, market driven interest rates, hostile takeovers, and corporate liquidations. The most unique is selling stock short. Short selling is the practice of selling stock you don&rsquo;t own with the intention of buying the stock back at a later date. You hope to profit from a decline in the price of the stock between the sale and the repurchase. Conversely, you will incur a loss if the price of the stock increases before the repurchase. You are also liable for dividends paid while holding the short position.&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "Three-Dragon Ante: Emperor's Gambit",
        "description": "Theme&#10;The theme of this game is similar to the original Three Dragon Ante. You are sitting in a bar in a fantasy world, playing cards for gold. The setting is a typical Dungeons &amp; Dragons style bar and the game may be played as a sub-plot of a D&amp;D game if desired.&#10;&#10;Goal&#10;The goal is to have the most gold at the point where the first player runs out of gold. In a two player game, you just have to bankrupt your opponent, but in a larger game, you may have to prop up another player until you become the richest.&#10;&#10;Gameplay&#10;A game is played over a series of hands until the end-condition is reached (above). A hand typically consists of playing one of your cards into the centre as an 'Ante' card, then three rounds of card-playing, attempting to play the best set (or 'Flight') of cards. The highest value Ante card determines the amount of gold that every player must contribute to the pot this round. The player who played the highest value Ante card starts the first round. Subsequent rounds are started by the player who played the highest value card in the previous round. Each card has both a numerical value and a power (or ability). However, the power is only triggered if the card has a lower or equal value to the card just played.&#10;&#10;The game is a balance between playing high cards to win the pot of gold in the Ante and playing lower cards to trigger their abilities and improve your hand for a later round.&#10;&#10;This game can be played by itself, or in combination with the original Three-Dragon Ante card set.&#10;&#10;From WoTC site:&#10;This fun card game updates the popular Three-Dragon Ante card game, adding new cards and new ways to foil your opponents! Designed for 2&ndash;6 players, Three-Dragon Ante: Emperor&rsquo;s Gambit showcases dragons and iconic character archetypes from the D&amp;D world. Easy to learn and play, this game is great for everyone, from dedicated D&amp;D gamers to poker fans to casual card players. D&amp;D characters can also play Three-Dragon Ante: Emperor&rsquo;s Gambit within the context of any D&amp;D campaign.&#10;&#10;In addition to the added cards and rules, this game also contains complete rules for the original Three-Dragon Ante card game.&#10;&#10;Integrates with:&#10;&#10;    Three-Dragon Ante.&#10;&#10;&#10;&#10;&#10;",
        "artist": "Craig Phillips,Emi Tanji"
    },
    {
        "name": "Spot it!",
        "description": "Spot it!, a.k.a. Dobble, is a simple pattern recognition game in which players try to find an image shown on two cards.&#10;&#10;Each card in Spot it! features eight different symbols, with the symbols varying in size from one card to the next. Any two cards have exactly one symbol in common. For the basic Spot it! game, reveal one card, then another. Whoever spots the symbol in common on both cards claims the first card, then another card is revealed for players to search, and so on. Whoever has collected the most cards when the 55-card deck runs out wins!&#10;&#10;Rules for different games &ndash; each an observation game with a speed element &ndash; are included with Spot it!, with the first player to find a match either gaining or getting rid of a card. Multiple versions of Spot it! have been published, with images in each version ranging from Halloween to hockey to baseball to San Francisco.&#10;&#10;The game is sold as Spot it! in the USA and Dobble in Europe, with slight differences between the two editions.&#10;&#10;",
        "artist": "Denis Blanchot,Peyo,Igor Polouchine"
    },
    {
        "name": "Anima: The Twilight of the Gods",
        "description": "And existence shivered...&#10;&#10;They had failed. That day, despite the combined efforts of the major powers of Ga&iuml;a, nobody could prevent the arrival of the final horror. The nameless nightmare had taken shape, altering the very foundations of reality. Deities fell, ancestral powers rose and the whole world was dragged to the brink of destruction...&#10;&#10;Now the entity has begun to feed off the power of dead gods, devouring their extinct essences to consume the whole world and create a new reality in his own image and likeness.&#10;&#10;Time is running out. Foreseeing the final danger, those strong enough to oppose him have been raised in the shadows. Is in your hands to embody such individuals, control their incredible skills and stop he who should not exist.&#10;&#10;It is time for the final struggle. The Twilight of the Gods...&#10;&#10;Anima: The Twilight of the Gods' is the final part of the trilogy begun in Anima: Shadow of Omega and continued in Anima: Beyond Good and Evil. In this standalone game you will embody a group of exceptional individuals and control their magical powers and abilities of Ki with the aim of fulfilling a series of missions that will allow you to stop the end of Existence. But beware, other players will take part in the story, using cards of plot against you to stop your progress and ensure their own victory.&#10;&#10;Play this box as a separate game altogether independently or in combination with either of the two previous cases to further increase the fun of your game.&#10;&#10;(translated from publisher's site)&#10;&#10;Integrates with:&#10;&#10;    Anima: Shadow of Omega&#10;    Anima: Beyond Good and Evil&#10;&#10;&#10;&#10;&#10;",
        "artist": "Wen Yu Li"
    },
    {
        "name": "Chocolatl",
        "description": "Chocolatl is a game based on the fascinating history of the Aztecs, the legend of Quetzalquatl (=Chocolatl) and of course, Cacao: the fruit of the gods.&#10;&#10;Each player starts the game with an identical deck of numbered bidding cards, which they will use to blind bid at 6 different board locations each turn.  Each board location will gain you a certain benefit, ranging from scoring points, to upgrading you bidding deck, to allowing you to alter your blind bids.  In addition, the type of blind bidding may vary from round to round depending on the leader's position on the score track.  Some rounds you may bid all 12 of your cards on the 6 locations (2 cards per location) all simultaneously, others you may do each location one at a time, and others you may bid one card at each location, reveal them, and then bid the rest of your cards once you've seen everyone's first bids.&#10;&#10;In the end, the player that is able to outguess his opponents and best manage his cocoa sacrifices will win the game!&#10;&#10;Components:&#10;Game board&#10;10 Dice&#10;51 Wooden cubes&#10;77 Cards&#10;6 Player boards&#10;2 Game figures&#10;7 bonus chips&#10;Rulebook&#10;&#10;",
        "artist": "Ryan Laukat"
    },
    {
        "name": "Lupus in Tabula",
        "description": "Werewolves haunt the secluded village known as Tabula: every night some villagers turn into werewolves and slaughter an innocent victim to satisfy their hunger.&#10;Surviving villagers gather every day to discuss the problem: at the end of the discussion, they lynch one person among them, thinking he could be a werewolf.&#10;Can you survive the massacre? Can you solve the mystery of the full moon?&#10;&#10;A game for large groups that is already a classic.&#10;To win you need the intuition of a detective... or your best poker face!&#10;The new edition includes:&#10;&#10;     Deluxe oversized cards featuring original characters&#10;     Updated high quality game components&#10;     Special Ghost rules that allow everyone to play until the mystery is solved&#10;     A new 8-player moderator-free variant&#10;     And, of course... The Werehamster!&#10;&#10;&#10;&#10;&#10;Lupus takes inspiration from Werewolf, introducing several new and original rules, including the possibility to play a third faction other than werewolves and villagers. The box contains the classic cards representing the werewolves, the seer and the villagers, but it also adds some unique characters such as a werehamster and a medium. Players are not eliminated during the game, but keep playing as 'ghosts'.&#10;&#10;",
        "artist": "Gianpaolo Derossi"
    },
    {
        "name": "The Manhattan Project",
        "description": "From the back of the box:&#10;&#10;Global Power Struggle Begins&#10;Which nation will take the lead and become world's dominant superpower?&#10;&#10;The Manhattan Project makes you the leader of a great nation's atomic weapons program in a deadly race to build bigger and better bombs. You must assign your workers to multiple projects: building your bomb-making infrastructure, expending your military to protect it, or sending your spies to steal your rival's hard work!&#10;&#10;You alone control your nation's destiny. You choose when to send out your workers&ndash;and when to call them back. Careful management and superior strategy will determine the winner of this struggle. So take charge and secure your nation's future!&#10;&#10;Additional description:&#10;&#10;The Manhattan Project is a low-luck, mostly open information efficiency game in which players compete to build and operate the most effective atomic bomb program. Players do not &quot;nuke&quot; each other, but conventional air strikes are allowed against facilities.&#10;&#10;The game features worker placement with a twist: there are no rounds and no end-of-round administration. Players retrieve their workers when they choose to or are forced to (by running out).&#10;&#10;An espionage action allows a player to activate and block an opponent's building, representing technology theft and sabotage.&#10;&#10;",
        "artist": "Viktor Csete,Clay Gardner,Sergi Marcet"
    },
    {
        "name": "11 nimmt!",
        "description": "From BoardgameNews.com:&#10;&#10;As you can tell from the name, this game is an off-shoot of the 6 nimmt! family. The cards are numbered 1-100, and each card has a number of bullheads on it. Each player starts with ten cards in hand and is trying to discard those cards to win the round. The player who goes out scores zero points, while everyone else loses points equal to the number of bullheads on their cards.&#10;&#10;Instead of playing cards on multiple rows, however, players play onto a single discard stack, with the played card being higher than the top card of the stack but not more than ten higher; if you can&rsquo;t play a card within this ten point range, you have to pick up the discard pile. Ergo, &quot;11 takes&quot;. You then start two new stacks by revealing cards from the top of the deck. The number of piles keeps growing throughout the game.&#10;&#10;Each time you take a stack with more than three cards, you get a bull card. For each bull card you have, you can play an additional card on your turn as long as all the cards fall within that ten point spread.&#10;&#10;",
        "artist": "Oliver Freudenreich"
    },
    {
        "name": "Hotel Samoa",
        "description": "Samoa. A popular vacation resort, where groups of tourists arrive every week. The hotel owners&rsquo; only care is to give these tourists the stay of their life - and of course to rid them of as much money as possible.&#10;&#10;Each round, new tourists of various nationalities will arrive at the island, and new upgrades in the form of build tiles will be available to buy for your hotel. Players will simultaneously choose one of their price cards to play, which indicates both your bid for building a hotel upgrade, and the price you set on your hotel rooms. The tourists will of course seek out the cheapest hotels first, so you must carefully plan when to demand sky high prices, and when to drop prices low in order to attract the tourists right under your opponents' noses. All the tourists have different personalities and abilities - so be sure to get the ones that benefit you the most. And of course you can enhance your hotel by building extra rooms, a swimming pool, or perhaps a luxury suite? &#10;In the end, it's the cash that counts.&#10;&#10;This is a fast and varied game of medium-light complexity, and as most decicions are made simultaneously by the players, the game has very little down time.&#10;&#10;",
        "artist": "Harald Lieske"
    },
    {
        "name": "The World Cup Card Game 2010",
        "description": "The greatest single sports show on earth takes place in South Africa this year (2010). The World Cup Card Game allows players to play through the whole tournament in around 75mins.&#10;The game consists of 65 cards. 32 of these represent all the national teams taking part. Another 32 cards are Action cards which are used to create the scorelines for each match. The final card is a summary list of what the Action cards can be used for.&#10;&#10;All the teams are randomly divided between the players. These are kept face-down on the table in front of the player until required.&#10;&#10;Each group is played match by match. The players controlling the four teams in Group 1: South Africa, Mexico, Uruguay and France now reveal those Team cards.&#10;&#10;Each team card is coloured according to the national football team strip, it also shows the national flag and a note stating their best performance ever achieved in any World Cup tournament. There is also a grey rectangle with the number of cards that team receives in the group stage - this is always 7 or 8. There is also a 2 Goal and 3 Goal symbol, sometimes covered by a cross. Any crossed symbol means that this particular team cannot use that type of card to it's full potential e.g, Argentina have the 3 Goal symbol crossed but the 2 Goal symbol uncrossed, therefore Argentina can only play a 3 Goal card as a 2 Goal card.&#10; The number of cards and the status of the 3 and 2 goal symbols distinguishes the better teams from the lesser teams. Brazil, for example, have 8 cards and no crossed symbols which gives them the maximum options; New Zealand have 7 cards and both symbols are crossed which gives them the fewest options. Despite the small difference between the various teams, the better teams generally have a better chance. However, the differences are not as great as in The World Cup Board Game.&#10;Play continues with the first group games being played in the order on the tournament format in the rules. The first game is South Africa v. Mexico, so each player controlling those teams play from 1 to 4 cards out of that teams' hand. The number of cards should be kept secret until both players have chosen, then they are both revealed. Goals are scored for that team in that match, Defences, Fouls and Offsides can reduce goals whereas Penalties and multiple Attacks add goals. Any spare Attacks and penalties require a card draw from the unused deck to see if they can be turned into goals.&#10;&#10;Each match is resolved in the same way. All scores from all games are recorded - best to use the pre-formatted scoresheet on the www.gamesfortheworld.co.uk/Downloads web page.&#10;&#10;The KO stages are played differently, more akin to the Board game. The Round of 16 is split into 2 sessions with 3 cards dealt to each player involved, irrespective of the number of teams. Cards can be played on any active team until the deck is exhausted and all cards played.&#10;&#10;From the Quarter-Finals onwards all games are played in each round simultaneously.&#10;Draws are resolved by card draws to determine if goals have been scored.&#10;&#10;Easy to play and a great sequel to the Board game.&#10;&#10;",
        "artist": "Shaun Derrick"
    },
    {
        "name": "Mr. Madison's War: The Incredible War of 1812",
        "description": "In June of 1812 Napoleon invaded Russia, meanwhile on the other side of the world the young republic of the United States declared war on Great Britain. It was one of America's most unpopular wars and &ldquo;Mr. Madison's War - The Incredible War of 1812&rdquo; is a strategy game based on the US campaigns to take Canada in the years 1812 - 1814.&#10;&#10;The map board measures 35&rdquo;x24&rdquo; and covers the the northern part of the states of New York, Pennsylvania, Ohio and the Canadian provinces of Upper and Lower Canada, the area where most of the battles were fought. The game features over 203 counters that feature the named regiments and battalions that fought the war including militia and Indian units. Also included are named individual Schooner, Brigs and Frigates that fought the naval war on the great lakes. The principal leaders of the war are included such as Major General Isaac Brock, Sir George Prevost, Major General Hull and many others.&#10;&#10;The game utilizes the new 'card driven system' which enable players to perform their actions on the game board and score automatic points for the playing of a card as an historical event. The colorful cards include historical information, the year the event took place and a detailed description of the function of the card. There are 110 individual cards in the game.&#10;&#10;The illustrated Rule Book is approximately 20 pages long, and there are 5 player aid sheets that contain the Combat Results Table along with cards to set up the various reinforcements.&#10;&#10;The objective of the game is to gain Victory Points by invading your enemy's territory while maintaining your own. In complexity the game would be rated as average and would appeal to any student of the Napoleonic Wars in general. It is at present the most comprehensive treatment of the War of 1812 yet offered to the public.&#10;&#10;The publisher, GMT Games, also produced a mounted map for this game which was sold separately.&#10;&#10;",
        "artist": "Knut Grünitz,Charles Kibler,Rodger B. MacGowan,Peter Rindlisbacher"
    },
    {
        "name": "Seeland",
        "description": "Seeland plays in the golden era of the Netherlands (17th century). In this time the province Seeland (Zeeland) gains ever more power, prosperity and significance. The object of the game is to expand and extract more land surface from the sea. Players live as a respected burgher in this time and take part in the land reclamation.&#10;&#10;The game board shows 3 main sections - the scoring track around the edge, a rondel where you gather seed tiles and windmill tiles, and the land area where you place and/or reveal tiles for scoring. Setup includes randomly placing &quot;island&quot; tiles on spaces designated in the land area. At the beginning of the game, you place one of your 4 windmill pawns in the special starting area indicated in approximately the center of the land area.&#10;&#10;The rondel uses a unique method for determining which tiles are available in the inner ring of the market. If you select a seed tile, (cabbage, rapeseed, or tulips) you must place it on an empty space adjacent to one of your windmill pawns. If you choose a windmill tile, you place it on an empty space adjacent to a space already containing a tile. All tiles have a victory point number (some are zero). When you surround a windmill, you total the adjacent tiles and score that amount on the track, if you have at least 2 types of seed amongst the adjacent tiles. If all tiles are of the same type, no points are scored. If all 3 types are present, add 5 points to the total.&#10;&#10;If you place a windmill next to one or more island tiles, you flip them over to reveal their type. They may be seeds or a farm. If you reveal a farm, you get a coin which can be used to take an immediate second turn.&#10;&#10;When either the supply of windmill tiles or of seed tiles is exhausted, the game will soon end. (The exact end time depends on the movement within the rondel.)&#10;&#10;If you are playing with the set of rules that allow for end game bonus points, score them, and the player with the most points wins.&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Word on the Street Junior",
        "description": "Word on the Street Junior uses the same game play as 2009&rsquo;s Word on the Street: Players are presented with a category, choose a word that fits that category, then move the letters in that word toward their side of the street. If a player or team moves eight letters off their side of the board, they win the game. Word on the Street Junior differs from its parent in that it includes categories appropriate for younger players (ages 8 and up instead of 12 and up) and the complete alphabet instead of only 17 letters. Including the vowels will likely make the game easier for younger players as they won&rsquo;t have to strain to think of words with little used consonants.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Shake 'n Take",
        "description": "Shake 'n Take is a fast-playing game from Keith Meyers in which players try to capture aliens, but the alien-fighting resources are scarce, so they must compete for them constantly. Those resources, by the way, are an erasable pen and a die; on a player's turn, she rolls the die, then circles any aliens that match the image on the die, which might show a triangle or other such figure. She keeps rolling and circling until the next player in turn order rolls a certain symbol on the die that he has; when he rolls this symbol, he snatches the pen and die from the current player, while the next player grabs the &quot;turn order&quot; die.&#10;&#10;With six or more players, two pens are used, so they both circle the table; if a player ends up with two pens, she can circle twice as quickly (while rolling the die with her toes) until they are snatched away!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Irondale",
        "description": "Irondale is a Pure Card game from Small Box Games.&#10;&#10;In Irondale, players help to build new structures in the city of Irondale.  In this mix of a tile laying and city building game, players build new structures next to prexisting structures.&#10;&#10;Each building scores points based on what has already been built and/or what it is built next to.  Additionally, each building grants the builder, and anyone building next to it, special abilities.&#10;&#10;Each card represents one building belonging to one of four building types, in addition to having a master plan.  Players score additional points by building structures according to a master plan.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Innovation",
        "description": "This game by Carl Chudyk is a journey through innovations from the stone age through modern times.  Each player builds a civilization based on various technologies, ideas, and cultural advancements, all represented by cards.  Each of these cards has a unique power which will allow further advancement, point scoring, or even attacking other civilizations.  Be careful though, as other civilizations may be able to benefit from your ideas as well!&#10;&#10;To win, you must score achievements, which you can attain by amassing points or by meeting certain criteria with the innovations you have built.  Plan your civilization well, and outmaneuver your opponents, and with some luck you will achieve victory!&#10;&#10;",
        "artist": "Carl Chudyk,Cara Judd,Anders Olausson,Robin Olausson,Christophe Swal,Cyril Van Der Haegen"
    },
    {
        "name": "Shave a Sheep",
        "description": "Part of the LEGO Games family.  Every player has one sheep made out of Lego bricks.  The player who shears the most wool from their sheep wins.  To shear your sheep you have to roll the Lego die.  But look out so the bad wolf won't scare your sheep.  As the game is made from Lego bricks you can alter the game and dice as you like.  Also included in the game are alternate rule suggestions.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Magma Monster",
        "description": "You are an explorer who have entered the middle of the earth to explore. Suddenly you encounter a terrible Magma monster. Can you escape the monster over the burning lava river? Place LEGO bridges over the burning lava by rolling the dice.&#10;&#10;A title in the LEGO&copy; game series. All parts are made out of LEGO, even the dice.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Pirate Plank",
        "description": "The pirate captain has forced four pirates to walk the plank and jump into the shark-filled water. In this game you build the die and try to push your comrades into the water - and keep your own pirate standing on the plank. Last man standing wins the game in what one might call a reversed race...&#10;&#10;A title in the LEGO Games series, where you build the game with Lego bricks, even the die. The set also includes suggestions for alternate rules.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Operation Jubilee: Dieppe, August 1942",
        "description": "Portrays the disastrous Commonwealth raid against the German-held French port city of Dieppe in 1942. The game uses a simplified version of the D-Day at Omaha Beach system.&#10;&#10;&#10;&#10;(from Publisher website :)Operation Jubilee: Dieppe, August 1942 (OJ) is a purpose-designed solitaire game, by John Butterfield, simulating the disastrous Commonwealth raid against the German-held French port of Dieppe on 19 August 1942. It uses an evolution of his well-liked system from our earlier boxed game release: D-Day on Omaha Beach.&#10;Historically, a mixed force of Canadian troops and tanks and British Commandos landed on several beaches along a 16-mile stretch of coast, with a variety of objectives. While the commando raids on the flanks met with some success, the major action against Dieppe was a costly failure. It didn&rsquo;t come close to achieving its objectives, and over 75 percent of that landing force were killed or captured. You control the CW forces assaulting the beaches and struggling to achieve their objectives against intense German resistance. The game system controls the German forces that oppose you.&#10;&#10;The overall 34x22&rdquo; large-hex map, which is cut in half and reassembled into a 17&quot;x42&quot; play area, consists of three sector maps: the main map showing the French port of Dieppe and surrounding areas, and two smaller maps portraying coastal areas east and west of the main map. The main map is divided into four areas: Blue Beach, Dieppe town, Green Beach and Rear. Each hex represents 400 meters (438 yards) across; each game turn equals 20 minutes. Units of maneuver are companies and batteries; there are 176 large-size NATO-style and iconic counters in the mix.&#10; Rules cover such things as: coastal battery fire, random events, unit depth, command-control and communication, air attack, &ldquo;what if&rdquo; variants, amphibious warfare and much more. The game can be completed in about three to four hours. The turn sequence is as follows.&#10;&#10;I. CW Amphibious Transport Phase&#10;1. Unit Transport&#10;2. Landing Check&#10;II. Operations Phase&#10;III. Commonwealth Action Phase&#10;1. Beach Landings or Evacuation.&#10;2. CW Actions&#10;3. Recovery&#10;IV. End of Turn Phase&#10;&#10;",
        "artist": "Joe Youst"
    },
    {
        "name": "Lasalle",
        "description": "Lasalle is a game for two or more players, and is the first game in the HONOUR series. Players take the role of a brigade or division commander in the Napoleonic Wars.&#10;&#10;The game is small-scale and tactical in nature, focusing on the movement of individual battalions and regiments of cavalry. The player will manage a small force of roughly a dozen units as he tries to complete some specific mission assigned to him, such as &ldquo;Hold the village and our bridgehead at all costs!&rdquo; or: &ldquo;Drive the French from Plancenoit!&rdquo;&#10;&#10;From the publisher's website:&#10;&#10;Lasalle is ideal for a small gaming table, and it plays in real-time with most battles lasting 2-3 hours. It is perfect for pick-up games or tournament play. It therefore includes sample army lists enabling players to collect and paint typical small forces from a large number of possible nationalities.&#10;&#10;If you have a club, or a larger collection and gaming area, Lasalle can also be used to simulate historical battles of the Napoleonic Wars, such as Quatre Bras, Albuera, Saalfeld, or Eggm&uuml;hl. In these cases, multiple players with multiple forces and a larger table will allow your group to simulate the excitement of a significant battle.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Level X",
        "description": "In Level X, each player has six playing pieces that he tries to place at the end of the movement tracks on the game board in order to score victory points (VPs). The tracks are labeled 5-10, and they are 2-4 spaces long.&#10;&#10;On a turn, you roll four six-sided dice, then place them into groups of 1-4 dice with each group ideally totaling from 5 to 10. If you make such a group, you can either place one of your playing pieces on the first space of the track matching that number or advance your playing piece on that track until you reach the final space: the X. Whenever you first land on an X, you take a VP token worth a number of points equal to that track's number. If you are already on an X and roll that number again, you take another token. Only one playing piece can be on an X; if someone else lands on an X that you occupy, you remove your playing piece from the board and can start down that track again later.&#10;&#10;If you collect one token of each value (5-10), you take a bonus card, with the first being worth 15 VPs and the others worth 12, 9 and 6. When all the bonus cards have been claimed or three of the VP token stacks are empty, the game ends. Whoever has scored the most points wins!&#10;&#10;",
        "artist": "Dennis Lohausen"
    },
    {
        "name": "Rowboat",
        "description": "Contains 61 cards, sand timer, and instruction booklet. Deal cards face up until an oar, a wave, a shell, and a map are showing. This is called the Tide. Deal each player the same number of cards that are in the Tide. Then, predict how many rounds you will win. Navigate your way through the Tide with the cards in your hand. Make your bid and score points. Fall short and lose points.&#10;&#10;",
        "artist": "Sophie Kittredge"
    },
    {
        "name": "The Logo Board Game",
        "description": "The game's theme is based on answering questions relating to popular advertising logos and brands.  Players move their pawns around a spiraling board for answering questions correctly relating to a logo, until they get to the Winning Zone at the centre of the board.  Movement depends on the successful answering of questions to proceed to the next coloured area on the board.&#10;&#10;Different countries have different versions of the game, with many local brands represented in each edition.&#10;&#10;There are 400 cards with 4 questions on each card - blue, green, yellow and red.&#10;&#10;The winning player is the first person to get around the board by answering the most questions correctly.  They then win by answering all the questions on a card (blue, green, yellow and red question) whilst in the Winning Zone.&#10;&#10;Game play alternates as players take it in turn to ask questions and move around the board.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Richard Scarry's Busytown: Eye found it! Game",
        "description": "This is a cooperative game appropriate for preschoolers, combining a race across Busytown, with a mechanic of looking for specific objects on the map (flags, ladders, etc.).  The game board is over six feet long.&#10;&#10;(from the rules sheet)&#10;Drive across Busytown toward the ferry that will take you to Picnic Island.  On your way, you will help Goldbug find hidden objects all around town.  The more you find, the faster you move! Will you make it to Picnic Island before Pig Will and Pig Won't eat all the food?&#10;&#10;",
        "artist": "Richard Scarry"
    },
    {
        "name": "SWAT!",
        "description": "Description: Those pesky bugs just keep coming at you! Your job is to SWAT them right when they score the most points. But be quick or your fellow players will SWAT them first.&#10;&#10;SWAT! is about capturing cards. A dealer turns over cards one-by-one, until someone decides he wants the exposed cards and hits the colorful &quot;SWAT!&quot; board. That player then becomes the dealer and the same process continues until all players have &quot;swatted&quot; three times or the deck runs out. Your challenge is to remember what you have already swatted and decide how far you can push your luck before another player swats the stack. The artwork is fun, imaginative and might get a little bit under your skin!&#10;&#10;",
        "artist": "Charlie Bink,Maureen Wingrove"
    },
    {
        "name": "Star Wars R2-D2 is in Trouble",
        "description": "Help Anakin Skywalker and C-3PO race around the chamber to save R2-D2 from the force field!  Give the bubble a pop to get Artoo on his feet!  With Artoo's help, you can fly around the board at galactic speed, bring out another pawn to help you, or bump one of your opponents' back before they do it to you!  Be the first member of the Republic to get all four of your players to the finish area - and you win!&#10;&#10;DIFFERENCE FROM CLASSIC TROUBLE:  The dice bubble contains a small figure of R2-D2 which acts as an extra dice with a value of &quot;6&quot; if Artoo is standing after the &quot;roll&quot;.  This can be used in conjunction with the regular die in the bubble.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Wampum",
        "description": "Players are merchants in the colonial U.S., trading wares such as maize, tobacco, animal pelts, weapons and alcohol with Native American villages.  In some villages, you trade your wares for other wares.  In other villages, for your wares, you receive wampum--bands of shells and beads used as currency by American Indians--and subsequently the white European settlers as well. The types of wares you are trading and the types in the village where you are trading determine whether you will get wares or wampum.&#10;&#10;Clever trading in the right village at the right time is the key to collecting the most wampum and winning the game.&#10;&#10;The game won second prize in the 2009 Hippodice Game Design Competition.&#10;&#10;",
        "artist": "Dennis Lohausen"
    },
    {
        "name": "Sticht oder Nicht",
        "description": "Sitcht oder nicht is a trick-taking game with two things that differentiate it from other titles in the genre: (1) The game uses four piles of special cards, with one card being revealed randomly from each pile. These cards provide bonuses or penalties for collecting the fewest tricks, cards of a particular color, whether the round has a trump, and so forth. However, only two of the four cards will be used in the round, with players choosing which ones. (2) Each player has a single +2/-2 card that can be played at the same time as another card to beat trump or dodge a trick you don't want.&#10;&#10;",
        "artist": "Tom Thiel"
    },
    {
        "name": "Schweinebande",
        "description": "Schweinebande (literally &quot;Gang of Pigs&quot;) was published in February 2010 by Hans im Gl&uuml;ck.&#10;&#10;The board depicts a cattle market, on which pigs, goats, donkeys, chickens, and other animals are offered for sale. Each player tries to position his farmers strategically in order to obtain the most favorable prices, or to block his competitors. Once animals are acquired, they must be fed every round. As soon as a player possesses 4 of the same animals, he can sell his herd to gain victory points. Naturally, a set of 4 donkeys is worth more than 4 chickens.&#10;&#10;",
        "artist": "Doris Matthäus"
    },
    {
        "name": "Splut!",
        "description": "&quot;Rock the Wizard&quot;&#10;&#10;Splut! is an abstract strategy boardgame. It has a fantasy theme and the looks of a chessgame.&#10;&#10;2 To 4 players compete in an arena where they each control a team consisting of one large Troll and one Dwarf, led by a Sorcerer as coach.&#10;&#10;During your turn you have three moves to make with your pawns. Try to get your Troll to a Rock (four Rocks are provided in the arena) and let him throw it onto an opposing Sorcerer. This will eliminate that team.&#10;&#10;By moving your pawns ingeniously around the board, you must take out all other players' Sorcerers. Push other pawns with your Dwarf, levitate Rocks into place with your Sorcerer and throw Rocks around the arena with your Troll. Mind your head!&#10;&#10;",
        "artist": "Tommy De Coninck"
    },
    {
        "name": "Moongha Invaders: Mad Scientists and Atomic Monsters Attack the Earth!",
        "description": "It's just another day, get up, wash, go to work. What's different is that today the Earth has been invaded by aliens &ndash; it's just that nobody knows it yet. Deep underground mad scientists are raising monsters from the planet Moongha. Once fully formed they will emerge to spread terror and destruction. Cities will be laid waste to, and the human race will be hunted to extinction.&#10;&#10;Through the sewers oozes the Bloob, quietly growing in size. The Drakoor, alien vampires, stalk the night, feeding off the unwary. Meanwhile, the strongest of the Moongha invaders, Mechoor, sucks in energy from the earth. Once sated it will rise to destroy whole cities with its heat ray. These are just a few of the monsters that will terrorise the people of Earth.&#10;&#10;It can only be hoped that just as in the movies there's a hero around who can thwart their evil plans; otherwise there will be no more &quot;just another day&quot;s for anybody! But who's behind those evil plans? You! You are one of those sadistic, power-thirsty, psycho nerds, eager for revenge after a whole life of study, disregarded by everyone. All of you have received a visit from a mysterious flying saucer, carrying strange alien machinery &ndash; an engine that finally brought you POWER! And now you are ready to fight your insane struggle to be the first in destroying the human race. This time no &quot;Klaatu barada nikto!&quot; will stop you...&#10;&#10;Moongha Invaders: Mad Scientists and Atomic Monsters Attack the Earth! is for three to four players and should take about ninety minutes to play. You have control of a number of different types of Moongha monsters. When you sit down to play, the side of the board closest to you is your monster display. There you will see the seven different types of monster. You will place your monster counters in these boxes. Note that some monster types have more than one counter.&#10;&#10;The game lasts either eight or nine turns, depending on the number of players, although it may end before then if a player manages to get down all twenty of their damage cubes.&#10;&#10;At the start of each turn a random number of actions are made available. Three of these actions relate to the monsters and allow you to create, attack, and move them. These actions are represented by orange, white, and purple tokens. There are three human action boxes, one that allows you to place a hero, the other two allow you to place military counters.&#10;&#10;To create a monster you have to place a certain number of orange tokens in the monster box. Once the monster has been created you place it in one of the twelve cities on the board. When you do so, you place the monster on its hidden side. The monster is alive but as yet the world does not know of its presence. While hidden a monster is safe from attack and can build up its strength so that when it does attack it will cause carnage. Another player may attempt to reveal your monster by placing a hero counter in the same city.&#10;&#10;Military units will try to destroy monsters. When you place a military unit or a hero, you can then attack with all military counters in that city. When a monster attacks a city, armor units will attack it first, then after that attack has been completed, any surviving infantry units will attack. All combat involves rolling dice and in all cases a roll of four or more is successful.&#10;&#10;Each monster type has its own special abilities. Only three monsters are powerful enough to destroy entire cities; these are the Bloob, Mechoor, and Moogre. When you attack a city, you mark the damage you do with your colored cubes. At the end of the game, players score victory points depending on how many damage cubes they have in each city. Players also score points for the cities that were randomly assigned to them at the beginning of the game, depending on how much damage they have suffered. Points can also be scored for having vampires on the board and for killing other monsters with your Moogre monster.&#10;&#10;",
        "artist": "Tim Huesken,Luca Zamoc"
    },
    {
        "name": "Yahtzee Hands Down Card Game",
        "description": "Official Description:&#10;&#10;It's the &quot;Yahtzee Hands Down&quot; Card Game!  Keep your wits about you and your eye on the cards!  Collect dice cards to make classic combinations - 3 of a kind, 4 of a kind, small straight, full house and YAHTZEE!  Re-roll by discarding cards you don't need and taking a chance on new ones!  But here's the twist... pit your hand against another player's.  Score high and win the Combo card points!  Great Yahtzee fun in a card game!&#10;&#10;Contents:&#10;&#10;12 Combo Cards&#10;12 Chance Cards&#10;84 Dice Cards&#10;1 Starter Card&#10;1 Reminder Card&#10;1 Combo Sheet &#10;1 Set of Instructions&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "Formule Dé",
        "description": "Formule D&eacute; is a fast-paced racing game in which the cars' top speeds are limited by having to end a certain number of turns in each curve of the racetrack.  This can be tricky, because although players can regulate their speeds by choosing which gear to be in and each gear allows a certain range of movement, the exact amount is determined randomly.   Great fun for a big group.&#10;&#10;The base game came with:&#10;&#10;     a d20 dice&#10;     Ten plastic cars (2 blue, 2 red, 2 white, 2 green, 2 yellow, one in each colour with a black heck spoiler)&#10;     one circuits 1&amp;2 (Monaco, Hockenheim or Silverstone)&#10;     Rulebook&#10;     Racing sheets&#10;     Ten gear markers (2 blue, 2 red, 2 white, 2 green, 2 yellow)&#10;&#10;&#10;&#10;&#10;This was the first release of a game of the family Formule D&eacute;/Formula D&eacute;/Formula D.&#10;&#10;Formule D&eacute; was released 1991 by Ludod&#195;&#169;lire. In 1997, the second release Formula De came from Descartes Editeur. And the newest release from Asmodee came in 2008.&#10;&#10;Ludod&eacute;lire published 13 courses for Formule D&eacute;, 1 World Championchip expansion and a mini Variant (called Formula D).&#10;&#10;Expanded by: (Ludod&#195;&#169;lire Expansions)&#10;&#10;    Formule D&#195;&#169; Circuit &#226;&#132;&#150; 1: Grand Prix de MONACO  (included in french edition)&#10;    Formule D&#195;&#169; Circuit &#226;&#132;&#150; 2: FRANCE &#226;&#128;&#147; Circuit de Nevers Magny-Cours&#10;    Formule D&#195;&#169; Circuit &#226;&#132;&#150; 3: GRAN PREMO D'ITALIA &#226;&#128;&#147; Autodromo Nazionale Monza&#10;    Formule D&#195;&#169; Circuit &#226;&#132;&#150; 4: GROSSER PREIS VON DEUTSCHLAND &#226;&#128;&#147; Hockenheim Ring  (included in german edition)&#10;    Formule D&#195;&#169; Circuit &#226;&#132;&#150; 5: GRAND PRIX DE BELGIQUE &#226;&#128;&#147; Circuit de Spa &#226;&#128;&#147; Francorchamps&#10;    Formule D&#195;&#169; Circuit &#226;&#132;&#150; 6: GRANDE PREMIO DE PORTUGAL &#226;&#128;&#147; Circuito do Estoril  (included in portuguese edition)&#10;    Formule D&#195;&#169; Circuit &#226;&#132;&#150; 7: BRITISH GRAND PRIX &#226;&#128;&#147; Silverstone Circuit  (included in british edition)&#10;    Formule D&#195;&#169; Circuit &#226;&#132;&#150; 8: GRAN PREMIO DE ESPA&#195;&#145;A &#226;&#128;&#147; Circuit de Catalunya&#10;    Formule D&#195;&#169; Circuit &#9;&#226;&#132;&#150; 9: GRAND PRIX DU CANADA &#226;&#128;&#147; Circuit Gilles Villeneuve&#10;    Formule D&#195;&#169; Circuit &#9;&#226;&#132;&#150; 10: GRANDE PREMIO DE BRASIL &#226;&#128;&#147; Circuito do Interlagos&#10;    Formule D&#195;&#169; Circuit &#226;&#132;&#150; 11: JAPAN GRAND PRIX &#226;&#128;&#147; Suzuka Circuit&#10;    Formule D&#195;&#169; Circuit &#226;&#132;&#150; 12: SOUTH of AFRICA GRAND PRIX &#226;&#128;&#147; Kyalami Circuit&#10;    Formule D&#195;&#169; Circuit &#226;&#132;&#150; 13: SAN MARINO &#226;&#128;&#147; Autodromo Enzo & Dino Ferrari&#10;    Formule D&#195;&#169;: World Championship&#10;&#10;&#10;&#10;&#10;Re-implemented by:&#10;&#10;    Formula D&#195;&#169;&#10;    Formula D&#10;&#10;&#10;&#10;&#10;",
        "artist": "Bernard Bittler"
    },
    {
        "name": "Hexenflug",
        "description": "You are teaching witches how to fly at Blocksberger Flugschule. Only the most talented witches are admitted there.&#10;&#10;You have to let five witches fly as high and far as possible. Every witch that succeeds will give you a spellbook. The player with the most spellbooks wins.&#10;&#10;",
        "artist": "Barbara Spelger"
    },
    {
        "name": "10 Days in the Americas",
        "description": "The Unpredictable Game of Making Connections&#10;&#10;Gather your sunglasses, snowshoes and mosquito spray - it&rsquo;s time to travel to new destinations with the 10 Days Series - the Americas!&#10;&#10;Players use destination and transportation tiles to chart a course through North, Central and South America and the Caribbean - touring by airplane, cruise ship or on foot. With a little luck and clever planning, you just might outmaneuver your fellow travelers and be the first to make connections for a complete ten day journey!&#10;&#10;Gameplay&#10;Players begin by filling their tile holders, drawing and placing tiles into 10 spaces. Each space is a day of a player's trip. Each tile shows a country, a plane, or a ship. Tiles are drawn and placed one at a time, and cannot be moved once placed. Once all players' holders are full, a face-down draw pile is made of the remaining tiles, as well as three face-up discard piles. On his or her turn, a player either takes a face-down tile from the draw pile, or a face-up tile from the top of a discard pile. He or she then decides whether to exchange the new tile with an old one. The tile not being kept is then discarded.&#10;Players are attempting to have all 10 days of their trip connect, either by foot, by plane, or by ship. To connect by foot, countries must be adjacent or connected. To connect by plane, a plane of a certain color must be placed between two countries of the same color. To connect by ship, the ship must be placed between countries adjacent to that ocean/sea (or one ship can connect to another). The first person to build a fully connected trip wins.&#10;Contains:&#10;40 destination tiles&#10;23 transportation tiles&#10;8 tile holders&#10;Map game board&#10;Rules&#10;&#10;",
        "artist": "John Kovalic,Cathleen Quinn-Kinney"
    },
    {
        "name": "Sorry! Revenge Card Game",
        "description": "Win the race to flip all your pawn cards home and sweet revenge is yours!&#10;&#10;Take turns to play number and action cards to change the play pile's total.  Get the pile to 21 without going bust to get one of your pawn cards home.  But watch out - someone could play a SORRY! card and steal your win.&#10;&#10;Portable, playable, speedy SORRY! fun for the whole family &#10;(from the back of the game box)&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Asteroyds",
        "description": "Asteroyds is a racing and pre-program game similar to RoboRally but with enough significant differences to make it stand out as its own design.&#10;&#10;Each player takes on the role of a famous Shuttle Racer Pilot and they have been drawn to a deadly event put on by a mega-rich entrepreneur that has recently bought the Ujitos system.&#10;&#10;The aim of Asteroyds is to navigate the highly dangerous asteroid field and pass through four gates. What sets the game apart from other games of this design is that almost everything in the race zone can move position, so the players need to plan with that in mind.&#10;&#10;So each round begins with the rolling of three dice; red, white and blue. These relate to coloured asteroids of the matching colour and each rock has a set of numbers from 1-6 printed on them. This gives every pilot the information they need to know where each object will most likely move to (the value rolled for each dice determines which direction the object moves in) using the hex based board.&#10;&#10;The trick is that some objects move a differing number of spaces and objects react differently when collisions occur, thus a player's best laid plans may not pan out due to mistakes.&#10;&#10;Mistakes introduces the other unique aspect of Asteroyds. The players only get a given amount of time to work out their best flight path and then plan their moves on their planning board. A minute is recommended and 30 seconds for experts. This real-time tension in the planning is tense and helps the game to stick to a good play length.&#10;&#10;Asteroyds also offers advanced rules such as shooting, special pilot powers and also varied play modes such as; Shooting, Targets and drones. Some of these allow for team play.&#10;&#10;",
        "artist": "Nicolas Fructus"
    },
    {
        "name": "Road Kill Rally",
        "description": "From the publisher: &quot;Think Car Wars meets Death Race 2000.&quot;&#10;&#10;From the developer: &quot;Road-Kill Rally simulates the fast paced action of futuristic motorized death sports where superstar drivers in weapon-laden cars race through the streets of America in search of blood, fame and fortune.  Points are scored by killing pedestrians, destroying competing drivers and racing across the finish line first.  The surviving driver with the highest number of points at the end of the race is the winner.&quot;&#10;&#10;2035 - The Road Kill Rally becomes a worldwide phenomenon, attracting contestants from throughout the world. Ratings exceed three billion for the Rally Cup Finals, making it the most watched spectacle in human history.&#10;&#10;As a driver in the Road Kill Rally, you are racing against opponents eager to destroy you with guns, rockets and flame throwers. But the big points come from scoring pedestrians: running them over or blasting them out of the road. After all, you have three billion viewers to satisfy.&#10;&#10;",
        "artist": "Edward Artinian,Karim Chakroun,Chris Quilliams,Daisuke Shimizu"
    },
    {
        "name": "Forbidden Island",
        "description": "Forbidden Island is a visually stunning cooperative board game. Instead of winning by competing with other players like most games, everyone must work together to win the game. Players take turns moving their pawns around the 'island', which is built by arranging the many beautifully screen-printed tiles before play begins. As the game progresses, more and more island tiles sink, becoming unavailable, and the pace increases. Players use strategies to keep the island from sinking, while trying to collect treasures and items. As the water level rises, it gets more difficult- sacrifices must be made.&#10;&#10;What causes this game to truly stand out among co-op and competitive games alike is the extreme detail that has been paid to the physical components of the game. It comes in a sturdy and organized tin of good shelf storage size. The plastic treasure pieces and wooden pawns are well crafted and they fit just right into the box. The cards are durable, well printed, and easy to understand. The island tiles are the real gem: they are screen-printed with vibrant colors, each with a unique and pleasing image.&#10;&#10;With multiple levels of difficulty, different characters to choose from (each with a special ability of their own), many optional island formats and game variations available, Forbidden Island has huge replay value. The game can be played by as few as two players and up to four (though it can accommodate five). More players translates into a faster and more difficult game, though the extra help can make all the difference. This is a fun game, tricky for players of almost any age. Selling for under twenty dollars, oddly, Forbidden Island is a rare game of both quality and affordable price.&#10; For those who enjoy Forbidden Island, a follow-up project by Gamewright titled Forbidden Desert was released in 2013.&#10;&#10;From the publisher's website:&#10;&#10;Dare to discover Forbidden Island! Join a team of fearless adventurers on a do-or-die mission to capture four sacred treasures from the ruins of this perilous paradise. Your team will have to work together and make some pulse-pounding maneuvers, as the island will sink beneath every step! Race to collect the treasures and make a triumphant escape before you are swallowed into the watery abyss!&#10;&#10;",
        "artist": "C. B. Canga"
    },
    {
        "name": "Connect 4 (Revised Edition)",
        "description": "From Hasbro.com:&#10;&quot;Challenge a friend to checker-dropping fun with CONNECT 4! There are three ways to play, so choose your game:&#10;&#10;Original: Drop in your checkers and be the first to get 4-in-a-row to win.&#10;&#10;Pop Out: Get 4 in a row by popping a checker out instead of dropping one in!&#10;&#10;Pop 10: Pop checkers out of the grid. If your checker is part of a 4-in-a-row, you get to keep it. The first player to get 10 checkers wins.&#10;&#10;When you're done playing, tote your game around with a convenient carrying handle. The checkers store inside the grid so you're ready to play anytime!&quot;&#10;&#10;Contents:&#10;42 checkers (21 yellow, 21 red)&#10;Grid with checker catcher base/handle&#10;Instructions&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "Cyrano",
        "description": "Description from BoardgameNews.com:&#10;&#10;While Cyrano de Bergerac was a real person, Cyrano is based on the play Cyrano de Bergerac, written more than two hundred years after Cyrano&rsquo;s death. In both the play and the game, Cyrano writes poetry to woo a woman for another man. The game Cyrano lasts a number of rounds, and each round starts with a player revealing a theme card and two rhyme cards (&quot;-aid&quot;, &quot;-ed&quot; and so on with homonyms being acceptable). Each player then composes a quatrain (a poem of four lines) with two of the lines ending with one of the rhymes and the other two ending with the other rhyme. Players read their poems and score points Boggle-style, with each unique ending word being worth one point; these points are recorded by blacking out squares on a ladder, which represents the lover&rsquo;s climb toward his object of affection.&#10;&#10;Everyone then secretly votes on which poem he or she most appreciated, whether for its beauty, adherence to theme, or some other artistic qualification. Players reveal their votes simultaneously, and for each player who voted the same way you did, you receive one point, with these points being recorded by the maiden&rsquo;s descent from the tower. Whichever player first brings the loves onto the same floor of the tower wins, with ties being broken by a rhyming duel.&#10;&#10;",
        "artist": "Pierô"
    },
    {
        "name": "Tanto Cuore",
        "description": "Tanto Cuore is a Japanese deck-building card game which has a mechanism similar to Dominion.&#10;&#10;Each player plays as the Lord of a mansion and hires maids to fill out their house to become the King of Maids! The end goal is simple enough, the player who has the most Victory Points at the end of the game wins! Players acquire Victory Points by employing a variety of maids and &quot;Love&quot; cards that allow for different strategies. You can even employ Private Maids that stick around to use their special powers each per turn! Some give you a bonus, or affect your opponents in a negative way. But beware, your opponents can make your maids sick or give them bad habits, affecting your maids in negative ways and decreasing your Victory Points!&#10;&#10;The game art is in the Japanese anime style and uses the theme of maids commonly seen in anime! All of the cards, dividers and manual fit into an easy to transport box so you can easily take the game with you wherever you want.&#10;&#10;",
        "artist": "Tohru Adumi,CARNELIAN,COMTA,Takahito Ekuchi,Takuya Fujima,Takehito Harada,Akira Hayase,Kira Inugami,Ishigaa,kawaku,KEI,Souji Kusaka,Misa Matoki,Rin Minase,Miki Miyashita,Misoka Nagatsuki,Nana,Aoi Nanase,Hiroki Ozaki,Poyoyon Rock,Ruchie,Satoru Satou,Mushimaro Tachikawa,Yuiko Tokui,Ofuu Yamadori"
    },
    {
        "name": "Napoleon's War:  The 100 Days",
        "description": "The Napoleon's War Series are games that give players the French Army of Napoleon against the foes of France from 1796 -1815. Each game will include battles that have their own custom game boards, plastic figures representing the infantry, artillery, and cavalry with counters representing the special units, leaders, etc. Each battle within the game are playable in 1 to 2 hours. The game uses the Hold the Line command action point (CAP) system.&#10;&#10;The first game in the series is Napoleon's War: The 100 Days with custom game boards of Quatre Bras, Ligny, Wavre, and Waterloo. 120 plastic pieces in blue, red, and gray portray the French, British, and Prussian armies.&#10;&#10;",
        "artist": "Sean Cooke"
    },
    {
        "name": "Flash Duel",
        "description": "Flash Duel is a simple, fast card game that simulates a duel between two Fantasy Strike characters. There are 10 characters to choose from (all included), each with three different special abilities. Landing just one hit wins a round, and a game is best three out of five rounds. Games take only a few minutes to play.&#10;&#10;The duel takes place along an 18-space linear track. Players draw from a common deck of 25 of numbered cards (five copies of each number 1 through 5), and use these cards to move, attack, dashing strike, block, and push. Each character's special ability cards add a new dimension to the base gameplay, and create 45 different character matchups.&#10;&#10;Flash Duel was designed and balanced by David Sirlin, the multiplayer balancer of Street Fighter HD Remix, Puzzle Fighter HD Remix, Kongai, Yomi, and Puzzle Strike. The core gameplay was inspired by Reiner Knizia's game En Garde.&#10;&#10;This game has received a follow-up in Flash Duel: Second Edition, which adds 10 new characters, slight balance changes to the original characters, support for up to 5 players, and new gameplay modes&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Nuns on the Run",
        "description": "In Nuns on the Run, most of the players are novices who are eager to secretly explore the grand abbey at night in order to fulfill their &ldquo;secret wish.&rdquo; They sneak through corridors searching for keys and treasures. (What treasures could a novice be searching for? Forbidden cookies? A soft mattress? Or narcotics? Or a book of witchcraft?)&#10;&#10;While sneaking through the abbey, the novices must remain watchful for the Abbess or Prioress, who are on patrol to ensure that pure novices remain that way. These characters are controlled by other players who want to nab the novices before they can make it back into bed.&#10;&#10;Players play either as a novice, or as the Abbess or Prioress. The novices move in secret and avoid being seen or heard by the Abbess or Prioress. The goal is to make it to the location on the board where the novice can get her &quot;secret wish&quot; and return to their room without being detected.  All of the novices move in secret by marking their movement and locations on hidden sheets. The Abbess and Prioress move on regulated paths around the board, but can diverge and chase down novices that they see or hear. The player or players who complete their secret wishes and return to their rooms win, or the Abbess and Prioress win if they catch a certain number of novices.&#10;&#10;",
        "artist": "Jared Blando,Jacob Chabot"
    },
    {
        "name": "Ablaze!",
        "description": "Ablaze! includes three separate games:&#10;&#10;Wild Fire! - re-works the original Feurio! design, in which players are firefighters trying to contain a spreading wildfire. The fire is created turn by turn as players reveal tiles and place each new tile next to what&rsquo;s currently the hottest part of the fire. Players use their firefighters to cover as much area as possible, while also staying connected to a water source.&#10;&#10;Volcano! - re-implements Vulkan!, which is played with the components of Feurio!. Ablaze! also includes new airplane and volcano tiles. Players control air tankers to drop water in order to extinguish or isolate sections of a fire created by a volcano. Save the most land, and you&rsquo;ll be the hero.&#10;&#10;On the Run! - is played with the same components as the other two games, but with different rules. Lightning has started a brush fire in the forest, and wildlife is fleeing to avoid being fricasseed. Save more animals than anyone else to win.&#10;&#10;",
        "artist": "Franz Vohwinkel,Christopher Wozniak"
    },
    {
        "name": "Defenders of the Realm",
        "description": "&ldquo;Our Liege is in desperate hour! From what grievous cause have these accursed races arisen? Orcs, Dragons, Demons and the Dead make haste towards Monarch City. The King and Countryside of Monarch City is in need of valiant Heroes!&rdquo;&#10;&#10;Will you answer the King's call?&#10;&#10;In the ancient Citadel of Monarch City, the King calls to arms the finest Heroes to defend against a Darkness that engulfs the land. You and your allies must embark on a journey to defend the countryside, repair the tainted lands, and defeat the four creature factions before any of them enter the City. And they approach from all sides! Fast populating Orcs! Fierce Dragons! Undead that bring Fear! And Demons! All tainting the land in their wake. There are several paths to defeat, but only one path to victory, and only the most valiant Hero will be named King's Champion.&#10;&#10;Defenders of the Realm is a cooperative fantasy board game in which 1-4 players take a role as one of the King&rsquo;s Champions (Choose from Cleric, Dwarf, Eagle Rider, Paladin, Ranger, Rogue, Sorcerer and Wizard). You, as one of the King's Heroes make use of strategy, special abilities, cooperation, card play and a little luck in Defenders of the Realm for a unique experience every adventure. But be forewarned! There is never time to rest. As each Enemy General is struck down in battle, the remaining dark forces only grow more difficult to vanquish and their march to Monarch City gets faster with each Hero victory!&#10;&#10;",
        "artist": "Larry Elmore"
    },
    {
        "name": "The Ares Project",
        "description": "In The Ares Project, 2-4 players are competing to see which of their factions will lead mankind into the future. Each faction has its own deck of cards, buildings, upgrades, attacks, special powers, and a screen behind which a player will play cards. Your opponents do not know what you are building. When a player lays down an attack card, he chooses an opponent, the players drop their screens, and they battle for control of the Frontier, i.e. the center of the table. Whoever controls the Frontier scores points and also has the ability to attack player bases directly. Eliminate your opponent to win instantly, or have the most points when the game ends.&#10;&#10;",
        "artist": "Jason Greeno,Michael N. Jackson,Gary Simpson"
    },
    {
        "name": "Sounds Like a Plan",
        "description": "From the publisher's website:&#10;&#10;What's the best plan for climbing Mt. Everest? How about the worst plan for making a million bucks? Find out in this party game that's all about giving outrageous advice! Select a card containing a piece of advice that best fits the judge's chosen activity. Score points if the judge takes your advice, but keep in mind that plans change with the roll of a die&hellip; You might have to give out bad advice, your grandma's advice, or even advice from a psychic! Take our advice and play today!&#10;&#10;",
        "artist": "Lisa Goldstein"
    },
    {
        "name": "Sumo Ham Slam",
        "description": "From the publisher's website:&#10;&#10;Step into the fierce and furry world of full-contact Sumo hamster wrestling! Using magnetic force, maneuver your Sumo hamster and try to knock your opponent out of the ring. It's a contest of bulk as much as brawn, so feed your hamster every chance you get! Win the most rounds and claim the title of Sumo Ham Slam Grand Champ!&#10;&#10;",
        "artist": "Dean MacAdam"
    },
    {
        "name": "Order's Up!",
        "description": "From the publisher's website:&#10;&#10;It's rush hour at the Ring-a-Ding Diner and you must hurry to serve a table full of hungry customers! Roll the die to add dishes to your tray. Roll a Free Meal or snag the Special of the Day to help fill your order. And if you roll a bell, it's a mad dash to grab your grub before another player beats you to the lunch! Be the first to complete all your orders and - DING! - you're the winner!&#10;&#10;",
        "artist": "Lee Calderon"
    },
    {
        "name": "Take the Cake",
        "description": "From the publisher's website:&#10;&#10;A batch of yummy cupcakes is fresh out of the oven and it's time to decorate! Shake the sprinkle shaker and see what colorful shapes pour out. If any match a cupcake, add them to the card. Collect the most cards and winning is a piece of cake!&#10;&#10;",
        "artist": "Russell Benfanti"
    },
    {
        "name": "Hornet Leader: Carrier Air Operations",
        "description": "&quot;If the US Navy has it, so do you! &quot;&#10;&#10;Hornet Leader &ndash; Carrier Air Operations is a huge game based on the material seen in our Vassal/PDF games. We have also further enhanced the game systems and weapon values to make them fully consistent with the new systems seen in Phantom Leader.&#10;&#10;Hornet Leader spans all aspects of US naval aviation throughout the service life of the F/A-18 Hornet from 1983 to the present day.&#10;&#10;The game places you in command of the pilots and aircraft of a squadron of U.S. Navy strike aircraft in hostile campaigns around the world. The aircraft and weapons available for each campaign are historically accurate.&#10;&#10;A major part of the game is mission planning. You decide how to arm your aircraft and which pilots are best for the mission. Pilots are rated for skill level. Deciding which pilots to fly each mission is a major consideration. Your pilots will become fatigued with every mission. If you fly a pilot too often, his skills will degrade. Your pilots also gain experience with every mission flown. This makes for some great decision-making. Should you keep flying the top pilots and further fatigue them to get the job done, or fly the new guys to prep them for the tough missions ahead?&#10;&#10;See also: Leader series games by Dan Verssen&#10;&#10;",
        "artist": "Wan Chiu"
    },
    {
        "name": "Flicochet",
        "description": "The play-anywhere game of flicking fun!&#10;&#10;Flicochet is a simple yet strategic dexterity flicking game that can be played on any table or flat surface.&#10;&#10;Try and flick your discs as close as possible to the jack, while hitting your opponent's discs out of the way!&#10;Late in the round, you may move the jack itself to improve your position. Take aim and watch it ricochet across the table! But don't knock it off, or you'll pay a heavy price!&#10;&#10;For 2 players or 3-6 players in teams.&#10;&#10;",
        "artist": "Phil Walker-Harding"
    },
    {
        "name": "Jäger und Sammler",
        "description": "J&auml;ger und Sammler is set in the Stone Age. Every player has control over a tribe of 4 hunter/gatherers. The game consists of two main phases: The summer phase and the winter phase. The aim of the game is to collect as many tiles as possible. Players have two movement points per turn and are only allowed to move to untaken tiles. When a player leaves a tile he gets to take it and place it in front of him. Food and artifacts are kept face down, but weapons and mammoths are kept face up. Whoever hunts down the biggest mammoth in the summer phase will start the winter phase.&#10;&#10;Players also have to visit the four winter camps during the summer to store supplies for the upcoming winter. If a player is not able to visit all four camps during summer, he will have fewer hunters in the winter phase.&#10;&#10;There are a lot of different tiles:&#10;- Food tiles score 1 to 3 points at the end of the game, depending on the type of food.&#10;- Rare and valuable artifact tiles increase in value depending on the number of identical tiles you collected.&#10;- Weapons are used to hunt down mighty mammoths.&#10;- Path-tiles remain on the board and guarantee a minimum amount of maneuverability.&#10;- Caves are connected with each other and may be used to cover big distances while moving.&#10;&#10;This game is based on the same prototype as Zombiegeddon.&#10;&#10;",
        "artist": "Claus Stephan"
    },
    {
        "name": "Hamunaptra: Aventures dans la Grande Pyramide",
        "description": "If you've ever read Belgian or French ligne claire adventure comics, then the artwork in this game will look very familiar to you. In fact, the spirit of the game itself comes across like one of those stories, with the players being adventurers in the early twentieth century who are entering an enormous Egyptian pyramid in order to discover the riches that lie in wait. Alas, the adventurers' presence sets off a series of 3,000-year-old traps and they become separated inside a lethal maze.&#10;&#10;Turns out that the maze is of their own creation, though, as players take turns laying down tiles that show corridors, monsters, traps or equipment. They must reach a staircase exit in order to gain their freedom, possibly facing off against monsters while doing so and using the strengths of their four characteristics to survive.&#10;&#10;NB: Currently only in French, Spanish and Italian&#10;&#10;",
        "artist": "Alejandro Villen"
    },
    {
        "name": "Bumbesi",
        "description": "In Himmel, A... und Zwirn! players take turns playing one card at a time, with the card being higher than what's out there but lower than the target card. The gap of playable cards narrows quickly, and if you can't fill the gap, you have to take the cards and pile up the negative points. The theme is, well...wildlife posteriors.&#10;&#10;",
        "artist": "Klaus Kreowski,Michael Menzel"
    },
    {
        "name": "Dragon's Ordeal",
        "description": "A fantasy adventure game played on a modular board created from various of locations. The goal is to kill Dragon hidden at end of board. On the way there will be many traps and monsters to defeat. During game play each player will develop their characters, discover new areas and fight against monsters drafted from story cards for spells, equipment and powerful artifacts!&#10;&#10;",
        "artist": "Marta Stawrowska"
    },
    {
        "name": "Cthulhu Dice",
        "description": "Serving Cthulhu is fun... except for all those other cultists out to get you. So get them first!&#10;&#10;Cthulhu Dice lets you drive your rivals mad... Very, very quickly. Players take turns rolling the big, beautiful, custom 12-sided die, embossed with tentacles, Elder Signs, and more. Destroy your opponents' sanity! Better yet, steal it. But watch out for Cthulhu &ndash; when he comes up, he takes sanity from everyone! Eighteen glass Sanity marbles are included. Lose all your marbles and you're mad. The last sane cultist wins... Unless everyone goes mad together. Then Cthulhu wins!&#10;&#10;",
        "artist": "Alex Fernandez (I)"
    },
    {
        "name": "Masques",
        "description": "As the head of an ambitious Venetian family in Intrigo (a.k.a. Masques) &ndash; which won the 2009 Concours de cr&eacute;ateurs under the title St Beno&icirc;t &ndash; you have sent your most influential representatives to mingle at the Doge's masquerade ball. By cleverly positioning these guests (and by manipulating the guests of your opponents), you'll vie for the attention of Venice's elite guild masters, ensuring the most political power for your family.&#10;&#10;Gameplay revolves chiefly around the clever use of guest cards with varying levels of influence. Each player receives a hand of guest cards, and each guest card has an influence value and its own power, e.g., the peddler, the assasin and the gondolier. The higher the influence, the greater that guest's clout at court. Each player's hand consists of a mix of cards representing members of any of the families currently in play. Use a rival family's guest cards against them, and watch for chances to set up your own house for success.&#10;&#10;Each of the rooms of the Doge's palace offer tokens representing a guild's favor or valuable ducats to be won by ambitious nobles. The spaces between each card that represents a room in the palace are the hallways of the Doge's estate &ndash; the areas in which guest cards are placed to compete for adjacent resources.&#10;&#10;",
        "artist": "Miguel Coimbra,Édouard Guiton,Goulven Quentel"
    },
    {
        "name": "London",
        "description": "London was Treefrog's 2010 Essen release.&#10;&#10;(Inspired by the history of the city from just after the Great Fire until 1900, the game has evolved since the description originally listed on the Treefrog website).&#10;&#10;London is a 2-4 player game with a playing time of aproximately 90 minutes.  Players select cards with varying powers of cashflow, victory points, and poverty penalties, and compete to manage them most efficiently.&#10;&#10;&quot;London lies devastated after the Great Fire of 1666. This is your opportunity to build a new city on the ashes of the old. It is up to you how you employ the talents of the people of London to this end. Will you favour the business classes, who will earn you money? Or would you prefer to spend more money than you can rightly afford on grand monuments and sumptuous palaces? You must also deal with the problem of rising poverty and how to employ the many paupers of the city. Throughout the game you will be forced to make tough decisions. To achieve one aim you must sacrifice another, which may open an opportunity for a competitor.&quot;&#10;&#10;Nearly 250 years of progress is glimpsed in this game. Famous buildings and monuments of the era as well as engineering developments such as streetlights are illustrated on the cards.&#10;&#10;The publisher calls London &quot;a relatively simple game that can be played easily within ninety minutes.&quot;&#10;&#10;Description below is quoted from Kris Hall's BGN interview with Martin Wallace:&#10;http://www.boardgamenews.com/index.php/boardgamenews/comments/kris_hall_the_martin_wallace_2010_preview_interview &#10;(Note: Some elements of the game described below have changed as shown in the final rulebook available online)&#10;&#10;As with a lot of games, London is about scoring the most VPs.  Players manage their hand, selecting cards to play into their building display by laying them out in a line.  At some point a player will choose to run his city. They can activate their buildings in whatever order they prefer.  The resulting actions can generate money and VPs, reduce poverty or have some other effect specified on the card.  Some cards have an entry cost which must be paid before the action can be performed.&#10;&#10;",
        "artist": "Mike Atkinson,Peter Dennis,Simon Jannerland"
    },
    {
        "name": "Dweebies",
        "description": "Meet the Dweebies! These uniquely colorful characters are out to capture your heart, but you must capture them first! Round up Dweebies by matching cards on both ends of any row. Seems simple at first... but Dweebies can be tricky, and some will disappear before they've met their match! Collect the most cards and consider yourself the Dweebie-in-Chief!&#10;&#10;Dweebies all have names related to a profession or hobby that they are passionate about (ie, Super Dweebie, Dr. Dweebie, Fix-it Dweebie). Players play cards out in rows and try to capture Dweebies by matching the same Dweebie on both ends of a row, collecting all the cards in that row. So try not to let any line get too long!&#10;&#10;Microbadge: &#10;&#10;",
        "artist": "Christopher Lee"
    },
    {
        "name": "Seven Card Samurai",
        "description": "Description from BoardgameNews.com:&#10;&#10;In Seven Card Samurai, 2-8 players try to protect the rice in their villages from bandits and ninjas while simultaneously building a strong collection of samurai. Each turn, a player draws two cards, then plays two &ndash; raiding an opponent&rsquo;s rice supply with a bandit, placing samurai and ronin in your village to provide protection, using a ninja to attack another player&rsquo;s hand or enable your bandit to bypass samurai, calling on a shogun to use its special powers.&#10;&#10;When a player collects seven samurai in only one or two colors &ndash; whether on the table or combined with the cards in hand &ndash; the round ends, with that player scoring 7-20 points depending on the color distribution of his samurai. Each player also scores one point for each rice marker he holds, and the player with the most points after five rounds wins.&#10;&#10;",
        "artist": "Chris Montecalvo"
    },
    {
        "name": "Age of Industry",
        "description": "Martin Wallace's streamlined redesign of Brass: Lancashire.&#10;&#10;Players are tycoons in the early days of the Industrial Revolution; a time when traditional craftsman were being rapidly replaced with steam-powered machines. Players invest in the production of raw materials, the manufacture of goods, and the transportation networks needed to connect them to their markets.&#10;&#10;Like Brass, the strategic space is vast, and player decisions are limited by cards. In Age of Industry, however, cards are color-coded to regions rather than specific cities, allowing the players to be more flexible with their plans, while at the same time continuing to limit the decisions available. The color-coded region cards will also support expansion maps.&#10;&#10;In addition, the original Brass rules were simplified by eliminating the canal period; there is only one period, the railway era. There is also a new, non-specific industry, which will change with each map.&#10;&#10;According to Wallace, &quot;You can now play something with the depth of Brass, but in half the time. The game will have a double-sided map, with Germany on one side and southern New England on the other.&quot;&#10;&#10;",
        "artist": "Peter Dennis"
    },
    {
        "name": "Mystery Express",
        "description": "In Mystery Express, players board the famous Orient Express in Paris just as a murder occurs. The rest of the trip - through Strasbourg, Munich, Vienna, Budapest, and Istanbul - is consumed with determining the who, what, when, where, and why of the crime. This game explores the more analytical side of the &quot;whodunit&quot; genre, rewarding a logical and more precise approach to solving the crime.&#10;&#10;Players use their special powers of deduction, information gleaned from other passengers (and the conductor) in the train cars, and investigative actions to determine the exact circumstances of the murder. The player who correctly identifies the most elements of the crime by the time the train reaches Istanbul wins the game.&#10;&#10;",
        "artist": "Cyrille Daujean,Julien Delval"
    },
    {
        "name": "The Blitzkrieg Legend: The Battle for France, 1940",
        "description": "The Blitzkrieg Legend simulates Case Yellow, the German offensive in May of 1940 that shocked the world. In less than a month's time it made quick work of Belgium and Holland, shattered the armies of France, and pushed the British Expeditionary Force (BEF) into the sea at Dunkirk. This twelfth game in the Operational Combat Series (OCS) game from Multi-Man Publishing and departs from its established norms in using a ground scale of 3 miles per hex and a time scale of two-day turns, and as such is similar to Sicily. The chosen scale lets this lightning campaign unfold a bit more slowly, and gives the densely-packed armies more room to maneuver.&#10;&#10;Case Yellow achieved the largest pocket ever to be created in the war, with the largest number of captured soldiers as well. This result is sometimes looked upon by gamers and historians alike as a foregone conclusion, but Manstein's daring strike through the Ardennes was a gamble that might easily have gone awry. Hindsight suggests the fighting could have gone much differently.&#10;&#10;A range of historical problems confront the player directing the Allies in this game. His French, Belgian, Dutch, and BEF combat units have not yet mastered the faster pace of action in WWII, and therefore are slow and don't fight at full Action Rating when in Move Mode. The Allies are also forced to adopt the historical Dyle Plan (when not playing the what-if version of the campaign), which leaves the French with inadequate reserves behind the Ardennes and too many of their best forces committed to shielding Antwerp and Brussels. Because history tells us the headlong rush into Belgium was primary cause of the quick Allied defeat, an &quot;If I Was in Charge...&quot; version of the campaign is presented to allow both sides to explore some different initial deployments.&#10;&#10;A simple set of campaign objectives are presented, with Victory Point awards centered on the following:&#10;&#10;&bull; The French must vigilantly protect Paris, which is the ultimate German objective. Two more cities along the map's south edge, Verdun and Metz, are also worth points (so the French cannot just abandon the Maginot Line).&#10;&#10;&bull; The possible surrender of Holland is triggered by German armor moving adjacent to any of the three Dutch major cities. Surrender chances are modified if the French and BEF are supporting Holland (which is why French 7th Army initially moved north of Antwerp).&#10;&#10;&bull; The possible surrender of Belgium and BEF Evacuation are triggered when the Germans drive a wedge between the Belgian coast and Paris. Surrender chances are modified, however, if the French and BEF are supporting Belgium (another nod toward the historical rationale of the Dyle Plan).&#10;&#10;&bull; The Germans also win points for battering the BEF, so the Allies are encouraged to keep this force intact.&#10;&#10;The game's special rules are judiciously chosen to evoke the full flavor of the campaign. For instance, the Maginot Line is given its historical due, shown as a strong right shield that can unfortunately be outflanked through the Ardennes. Rules for special operations are something new to OCS, and these can capture enemy bridges and forts (but just on 10 May unless playing an optional rule). As mentioned above, the BEF can get isolated or mauled as part of the victory conditions, and if this happens a ragtag assemblage rides to the rescue: RN Destroyers, special Evacuation Ports, elite Irish and Welsh battalions, and even some Spitfires finally appear to provide some top-cover. Mix in the occasional Pause &mdash; an event that tugs sharply on the panzers' leash &mdash; and you've the kind of chrome that make The Blitzkrieg Legend a tremendous tool for historical study and an exciting source of gaming  pleasure.&#10;&#10;The Blitzkrieg Legend is also a game with tremendous replay value. Presented are 7 scenarios and 3 campaigns. The longest is just 13 turns; the largest fits on a standard 4' x 6' table.  Series veterans know the depth of the model can lead to some long and complex turns, but here at last we have an entire campaign that can easily be played to the finish!&#10;&#10;Scenarios&#10;&#10;1. South.  The first 4 turns on the southern half of Map B. Covers the fighting at Sedan as well as the crossings of the Meuse further downstream by 6th and 8th Panzer.&#10;   2. Center. The first 4 turns on the northern half of Map B. Covers the fighting at Gembloux Gap as well as the crossings of the Meuse by 5th and 7th Panzer.&#10;   3. North. The first 4 turns on Map C. Covers the air landings and surrender of Holland.&#10;   4. Mini-Campaign. Links the first three scenarios into a short campaign using two maps.&#10;   5. Sedan. Lasts just 2 turns and uses just a small portion of Map B. Covers the French counterattack and German breakout.&#10;   6. Arras. Lasts just 1 player turn. A teaching scenario covering the Allied counterattack.&#10;   7. Dynamo. Lasts 8 turns. Plays like a campaign game, using just Map A to cover the important events during the last half of the campaign.&#10;&#10;Campaigns&#10;&#10;1. &quot;No Holland&quot; Version. Doesn't include the fighting in Holland, which is &quot;automatic&quot; and not under player control. Uses two maps, the full 13 turns.&#10;   2. &quot;With Holland&quot; Version. Uses all three maps, the full 13 turns.&#10;   3. &quot;If I Was in Charge...&quot;  Several variations on either of the two campaigns are offered.&#10;&#10;Components:&#10;&#10;&#10;     OCS Series Rulebook&#10;     TBL Game Specific Rulebook&#10;     Two Charts and Tables Booklets&#10;     Full Color Game Map (two 22x34, one 28x15)&#10;     1,960 Counters (7 counter sheets)&#10;     One 8.5x11 Play Aid&#10;     10 Scenarios (3 of them are Campaign Scenarios)&#10;     Box and Dice&#10;&#10;&#10;",
        "artist": "Nicolás Eskubi,Dean Essig"
    },
    {
        "name": "Don Quixote",
        "description": "The land noble Don Quixote arranges his own small principality in such a way in his fantasy as he considers it correct: Knights protect its castles and borders; roads connect windmills and churches. Not all will connect in a logical way but that doesn't matter to him. He has his own image of the reality.&#10;&#10;Every player has an identical set of 24 tiles which they will place in their own, at the start empty, principality. The order of the locations to fill is also identical.&#10;&#10;The player who can fill his principality the best with roads and protects its castles and borders with knights will get the most points and win the game.&#10;&#10;",
        "artist": "Oliver Freudenreich"
    },
    {
        "name": "Scary Tales: Prince Charming vs. Hansel",
        "description": "Prince Charming vs. Hansel is the third game in the Scary Tales series of two-player games pitting common fairy tale characters against each other. Here's more about the two characters in this game from the publisher:&#10;&#10;&quot;Atop his noble steed, this handsome prince is every girl's dream...or is he your worst nightmare? It should be easy for Prince Charming to defeat a young boy, except that Hansel has an equally sinister sister, Gretel, and together they form an eerily unstoppable duo. It will take all of their tricks to win control of the Kingdom, but who will be victorious?&quot;&#10;&#10;The setting for Scary Tales is a kingdom, where a battle awaits as the king has died, leaving no heir. While the enchanted forest is feared and the castle is covered in dark clouds, corruption has affected the town and only those with the utmost abilities in Strength, Wisdom, Magic and Luck will be able to collect enough relics from the stories of long ago to prove themselves worthy of being the new leader. The challengers are sharp, indomitable, and devious - and with each match-up, it is uncertain who will win the crown.&#10;&#10;Each character comes with its own unique ability which may be used once per game and a color coded set of dice. A set of power cards and fortune cards, a fairy card and a die associated with said fairy comprise the contents of the game. To win, a player needs to obtain seven points worth of relics, and hold on to them until the beginning of their next turn.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Rivals for Catan",
        "description": "The Rivals for Catan is a reimplementation of Catan Card Game.&#10;&#10;The Rivals for Catan was released in German in September of 2010, on the 15th anniversary of the original card game. An English edition was released in the fourth quarter of 2010. The designer of the game, Klaus Teuber, has stated that he completely reworked many of the original card game's mechanics to make it easier for newcomers to play the game.&#10;&#10;Each player portrays a prince for Catan, developing their individual provinces and competing to build a more successful province than the other.  The basic mode of play is similar to the original Catan Card Game, where players expand their provinces by building settlements connected by roads.  Players may also build expansions in their settlements that aid them in various ways, or upgrade their settlements to cities to allow more expansions to be built.  They build these additions by using resources that they accumulate each turn, which are determined by the roll of a die.  Cards are drawn on each turn to replenish the players' hands.  The players may also use action cards that directly affect either their own province or their opponent's province.&#10;&#10;The Rivals for Catan features a reduced pool of cards, without the more aggressive style of action cards found in the original Catan Card Game.  Therefore, all action cards will be able to be used from the beginning of the game unlike in the original card game.&#10;&#10;Ways to Play:&#10;The Introductory Game focuses on the basics of the card game, featuring gameplay that is more appropriate for newcomers.  This game is played to 7 victory points and includes 36 Expansion Cards in four stacks.  This play style should take beginner players 25 to 30 minutes to play.&#10;&#10;Three Theme Games add more rules, expansions, and aggressive cards.  These Theme Games may be played individually or combined to play a variant called &quot;The Duel of the Princes.&quot;  Each Theme Game adds 24 Expansion and Event Cards to the cards from the Introductory Game, which are placed in two stacks separately from the cards from the Introductory Game.  When playing a Theme Game, playtime should be around 45 to 60 minutes.&#10;&#10;As with the original Catan Card Game, players can also play the Tournament Game, in which each player chooses specific cards to build their deck ahead of time from which they draw from during the game.&#10;&#10;Theme:&#10;The theme of The Rivals for Catan is no longer restricted only to the feudal era of the Middle Ages like the original Catan Card Game.  The Introductory Game portrays the very early years of the world of Catan, while each Theme Game takes place in progressively later eras.  These eras are known as &quot;The Era of Gold,&quot; &quot;The Era of Turmoil,&quot; and &quot;The Era of Progress.&quot;&#10;&#10;Belongs to the Catan Series.&#10;&#10;",
        "artist": "Michael Menzel"
    },
    {
        "name": "Industry",
        "description": "In each round a different player is the auctioneer and auctions off, primarily, factories with a unique bidding mechanism. Factories bring points and produce raw materials. Building factories themselves cost money and raw materials. But they are in short supply, so you need to manage your resources well. Linked factories and other improvements bring in extra points at the end of the game.&#10;&#10;Revision of Industria.&#10;&#10;",
        "artist": "Stéphane Poinsot"
    },
    {
        "name": "The Lost Cause",
        "description": "The Lost Cause:&#10;The American Civil War: 1861 - 1865 (States of Siege #4)&#10;&#10;from the publishers website:&#10;After the election of Abraham Lincoln in 1860, State after State in America&rsquo;s &ldquo;Deep South&rdquo; seceded from the Union that the North felt must be preserved. In the ensuing war, brother fought brother as the Confederacy resisted with all its might for over four years in The Lost Cause.&#10;&#10;This States of Siege solitaire game puts you in the shoes of Jefferson Davis and the Confederate High Command as the Union armies close in from five different directions. With famous Generals like Lee and Johnston leading armies for their new nation, much of the conflict also takes place on the waterways and in the halls of power of foreign governments.&#10;&#10;Told through the use of Headline and Broadsheet Event cards, history unfolds before your eyes as you direct the Southern war effort on land, sea, the diplomatic and home fronts, in an effort to secure independence and survive as a nation. Can you organize the Confederacy and devise the plans necessary to secure victory? Can you make the best use of scarce Southern resources, allocating them at the right place and time to preserve the Confederacy? Or will relentless Union pressure make it all a Lost Cause?&#10;&#10;Game Data:&#10;&#10;Number of Players: 1&#10;Ages: 14 and up&#10;Playing Time: approx. 1 (Basic Game) to 1 1/2 hours (Advanced Game)&#10;Complexity: 3.5 (Basic Game) or 5 (Advanced Game) on a 9 scale&#10;Solitaire Suitability: 9 on a 9 scale&#10;Scale: Each unit is one Union Army or Civil War Leader, and each turn is one month&#10;&#10;Game Components:&#10;&bull;    One 11&rdquo; x 17&rdquo; color Basic game map&#10;&bull;    One 11&rdquo; x 17&rdquo; color Advanced game map&#10;&bull;    One 8-page, color Basic Game Rules booklet&#10;&bull;    One 6-page, color Advanced Game Rules booklet&#10;&bull;    32 color, die-cut 5/8&rdquo; mounted game pieces&#10;&bull;    24 color, die-cut 3/4&rdquo; mounted game pieces&#10;&bull;    48 (total) &lsquo;Headline&rsquo; and 'Broadsheet' cards&#10;&bull;    One 8.5&rdquo; x 5.5&rdquo; color player aid mat&#10;&bull;    One page of designers notes and extensive examples of play&#10;&#10;",
        "artist": "Tim Allen"
    }
]