[
    {
        "name": "Halloween Party",
        "description": "A game of outrageous bluffing, honest haggling, and crafty negotiation. It's Halloween! Time to don your scariest costume and run through the neighborhood shouting &quot;Trick or Treat!&quot;. Collect costume and treat cards, and you're on your way to winning Halloween Party. But beware - your opponents may play tricks on you!&#10;&#10;Simple enough. But is it? Halloween Party has a ghoulish Twist - You can't play your own cards! You must trade with your opponents, playing the cards they give you, and letting them play your cards. Can you trust them to trade the cards you want? Probably not. But that's where the fun begins...&#10;&#10;A winner of the 2000 Concours International de Cr&#195;&#169;ateurs de Jeux de Soci&#195;&#169;t&#195;&#169;.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Murder, She Wrote",
        "description": "One player is secretly and randomly chosen to be the murderer, the rest are detectives (Jessica Fletcher) trying to determine which player is the murderer.  The murderer player wins if he/she can murder five witnesses and escape off of the game board before he/she is discovered.  A detective player wins by being the first to correctly deduce the identity of the murderer, before the murderer escapes.  Players mark which locations they have visited and in which order.  This information, along with the living or dead status of the witnesses, is used by the detective players to deduce who is the murderer player.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "MotorChamp",
        "description": "From the folks who brought you TurfMaster, comes an auto racing game with the same high production standards. The game includes three double-sided boards, which can be used to create 12 different tracks, eight teams consisting of 2 Formula One cars each, and eight sets of three dice matching the colors of each of the teams.  Movement is controlled by the dice, with the number of dice rolled being dependant on the car's position on the track.  The game boards are beautifully rendered, and the cars are simply the best available in any racing game on the market.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Carrier Strike!",
        "description": "This game pits two aircraft carrier task forces against each other; each player has two carriers loaded with 6 torpedoes and 4 aircraft.  Pilots are represented by ratings which are embarked on the aircraft when launched.  The carriers move with a special die which gives each carrier a 50-50 chance of either moving forward one or turning 60 degrees.  The aircraft move with a normal d6.  If they manage to manoeuvre at torpedo run distance from an enemy carrier (6 hexes), drop their torpedoes.  These move inexorably one space per turn so the only defence is manoeuvring.  If the aircraft get within dogfight distance of each other (4 hexes), they may engage in a dogfight, which uses cards (a better pilot rating gives you extra cards) --it also forces the torpedoes to be dropped, so sacrifice dogfights are a viable tactic.  If you run out of torpedoes, you may kamikaze your aircraft.&#10;&#10;An amusing tactical simulation, very simple and fast-playing, with nice bits to boot.&#10;&#10;Remade in to Mission Command Sea.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Chopper Strike",
        "description": "In this game, each player manoeuvres a fleet of helicopters and a fleet of jeeps (equipped with AA guns), trying to gain air or ground superiority.  That is to say, you win by wiping out all of your opponent's choppers or all of his jeeps.&#10;   A d3 indicates how many pieces you will move, and a d6 how far each one will move.  Choppers move on the elevated &quot;air&quot; board, whilst jeeps stick to the ground.  Terrain obstacles complicate matters for the jeeps at the players' &quot;border&quot;.  Choppers take choppers out by jumping over them (&agrave; la checkers); they can also take jeeps out by bombing them (stopping right above them).  Jeeps take jeeps out by landing on them; they can also take choppers out using their AA guns (stopping right below them).&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "World War II: European Theater of Operations",
        "description": "The WORLD WAR grand strategic game covers the European Theater of Operations and the Middle East from 1939 to 1945, with special scenarios for the blitzkrieg in Poland, France, and Russia. The game provides special rules for armored attack, air and naval operations, strategic warfare, production, and army group command. The WORLD WAR II game captures the epic sweep of national fortunes on a month-by-month basis. Sharp reversals of fortune are possible at any point as the operational initiative shifts from player to player. A multi-player option creates tension between the partners on each side. Optional rules re-create political situations faced by the major powers.&#10;&#10;Components:&#10;&#10;    2 22&quot; x 34&quot; maps&#10;    32 pg rule booklet&#10;    2 Player aids cards&#10;    800 die-cut counters&#10;&#10;&#10;&#10;&#10;Ages 12 through adult.&#10;PLAYING TIME: 4 to 50 HOURS&#10;&#10;(source: back of TSR edition)&#10;&#10;",
        "artist": "Jeff Easley"
    },
    {
        "name": "Jenga",
        "description": "A tower building game.&#10;&#10;Jenga is played with 54 wooden blocks; each block is 3 times as long as it is wide, and slightly smaller in height than in width. The blocks are stacked in a tower formation; each story is three blocks placed adjacent to each other along their long side, and each story is placed perpendicular to the previous (so, for example, if the blocks in the first story are pointing north-south, the second story blocks will point east-west). There are therefore 18 stories to the Jenga tower. Since stacking the blocks neatly can be tedious, a plastic loading tray is included.&#10;&#10;Once the tower is built, the person who built the tower moves first. Moving in Jenga consists of taking one and only one block from any story except the completed top story of the tower at the time of the turn, and placing it on the topmost story in order to complete it. Only one hand at a time may be used to remove a block; both hands can be used, but only one hand may be on the tower at a time. Blocks may be bumped to find a loose block that will not disturb the rest of the tower. Any block that is moved out of place may be left out of place if it is determined that it will knock the tower over if it is removed. The turn ends when the next person to move touches the tower, although he or she can wait 10 seconds before moving for the previous turn to end if they believe the tower will fall in that time.&#10;&#10;The game ends when the tower falls in any significant way -- in other words, any piece falls from the tower, other than the piece being knocked out to move to the top. The loser is the person who made the tower fall (i.e. whose turn it was when the tower fell); the winner is the person who moved before the loser.&#10;&#10;The same game concept was published in 1984 by Fagus under the name &quot;Hoppla - eins zuviel!&quot;&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "Blokus",
        "description": "Blokus (officially pronounced &quot;Block us&quot;) is an abstract strategy game with transparent, Tetris-shaped, colored pieces that players are trying to play onto the board.  The only caveat to placing a piece is that it may not lie adjacent to your other pieces, but instead must be placed touching at least one corner of your pieces already on the board.&#10;&#10;There is a solitaire variation where one player tries to get rid of all the pieces in a single sitting.&#10;&#10;Components:&#10;Blokus Game Board (400 squares)&#10;84 game pieces (four 21-piece sets of red, green, blue, and yellow)&#10;Each color inlcudes:&#10;&#10;     1 one-square piece&#10;     1 piece with 2 squares&#10;     2 pieces with 3 squares&#10;     5 pieces with 4 squares&#10;     12 pieces with 5 squares&#10;&#10;&#10;&#10;&#10;Goal of the Game:&#10;&#10;Each player has to fit as many of his/her 21 pieces on the board as possible.&#10;&#10;How to Play:&#10;1.  Each player chooses a color and places that set of 21 pieces in front of his/her side of the board.  The order of play is as follows: blue, yellow, red, and then green.&#10;&#10;2.  The first player (blue) places any of his/her pieces in a corner square.  Play proceeds clockwise around the board (yellow, red, and green), each player putting their first piece down in one of the corner squares.&#10;&#10;3.  Play continues as each player lays down one piece during a turn.&#10;&#10;Each new piece must touch at least one other piece of the same color, but only at the corners.&#10;&#10;No flat edges of same color pieces can touch.&#10;&#10;There are no restrictions on how pieces of different colors can touch one another.&#10;&#10;4.  Whenever a player is unable to place one of his/her remaining pieces on the board, that player must pass his/her turn.&#10;&#10;End of Game:&#10;The game ends when all players are blocked from laying down any more of their pieces.  This also includes any players who may have placed all of their pieces on the board.  Scores are tallied, and the player with the highest score is the winner.&#10;&#10;Scoring:&#10;Each player counts the number of unit squares in his/her remaining pieces (1 unit square = -1 point).&#10;&#10;A player earns +15 points if all his/her pieces have been placed on the board plus 5 additional bonus points if the last piece placed on the board was the smallest piece (one square).&#10;&#10;There are unauthorized versions of the game published under various names, including The Strategy Game, Tetris, Blok&aacute;d (unofficial Hungarian version with cardboard pieces) and The Family Chess Game.&#10;&#10;",
        "artist": "Alan D. Hoch"
    },
    {
        "name": "India Rails",
        "description": "Another edition of Mayfair's crayon rail games, this one set in India. Players start with enough money to build a small section of track and earn more money by picking up and delivering commodities for a given price. The first player with 250M dollars and all major cities connected wins.&#10;&#10;Integrates with:&#10;&#10;    Nuclear War (using Nuclear War Bonus Pack #2: Expansion to India Rails and Nuclear War)&#10;&#10;&#10;&#10;&#10;",
        "artist": "Peter Y. Bromley,David Cherry,Drew Perkett,Louis Rexing,Chris Vande Voort"
    },
    {
        "name": "The Hobbit: The Defeat of Smaug",
        "description": "Game description from the publisher:&#10;&#10;In The Hobbit, embark on a great adventure based on J.R.R. Tolkien's legendary novel, The Hobbit. Try to safely navigate your way to the Lonely Mountain and reclaim all the treasure that the evil dragon Smaug is hiding &ndash; but beware as the treasure is fiercely guarded and must be won in battle! Will you trade your jewels for adventure points? Can you successfully answer the riddles or recite the songs? Do you have the courage to steal a jewel right from under Smaug's nose?&#10;&#10;On this adventure you'll travel through the Edge of the Wild, the Misty Mountains, the Carrock, Mirkwood, Long Lake, and finally confront the Desolation of Smaug. Each terrain will yield magical encounters and valuable treasure. All your wit, luck and skill will be tested. Are you up to the challenge to be crowned King Under the Mountain?&#10;&#10;",
        "artist": "Ted Nasmith"
    },
    {
        "name": "Torpedo Run!",
        "description": "This huge box (88 x 44 x 7 cm) was part of MB's Floor Wars Series.  Indeed, it is playable only on a floor --unless you have something large to put it on, like Ping-Pong tables.&#10;&#10;This game is an introduction to naval miniatures of sorts; each player has four very large miniatures of WWII vintage ships (a battleship with its three escort ships) which manoeuvre about the large board.  The players also have a &quot;torpedo launcher&quot; shaped like a submarine which fires discs that glide along the playing surface.  The players aim at specific places along the ship waterlines.  There, slots allow the discs to slide under the ship and trip a rubber-band mechanism which sends part of the ship's superstructure (or gun turrets) flying, simulating damage.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Battle Cattle: The Card Game",
        "description": "Like Car Wars: The Card Game, Battle Cattle: The Card Game will be a standalone game, with everything you need in one package. And the two games will be completely compatible, allowing you to take your souped-up hot rods out gunning for Bessie... but this time, Bessie shoots back!  Six Cow cards and 112 Moo-ve cards, all full-color, and a rules sheet.&#10;&#10;",
        "artist": "Alex Fernandez (I),Sanford Greene"
    },
    {
        "name": "Scavenger Hunt",
        "description": "The object of this game is to find and bring back Home four randomly designated objects (out of a possible selection of 16), in sequence, as in a Scavenger Hunt.&#10;&#10;The objects are deployed on the board using a semi-random method.  Then play begins.  You use dice to move your pawn, but cards are required to move through house rooms --otherwise you're confined to the sidewalks (without the right cards, you may also end up &quot;trapped in a garage&quot;, the only room that does not have a direct exit to the sidewalk).  Pairs of cards can also be traded in for extra turns.  Additionally, there are two dogs roaming the sidewalks, which are obstacles and controlled by card play.&#10;&#10;",
        "artist": "Jack Burton Davis"
    },
    {
        "name": "Swords & Sorcery",
        "description": "This fantasy wargame is really two games in one. The Army game uses SPI zones-of-control and a combat results table. Forces include elves, dwarves, orcs, spiders, swamp creatures and a host of others set in a fictional valley on a fictional world. Some of the more exotic inclusions are memorable for their pun value:  Unamit Ahezredit, Logarithm Son of Algorithm; places such as the Evelyn Woods and the Stream of Consciousness, as well as the notorious Hills of Avalon; and peoples such as the Corflu (Correction Fluid) Cultists, the (communist) Orcish Revolutionary Council, and the dreaded Killer Penguins.  X the Unknown could potentially conjure the SS Wiking Division. The Quest game is concerned exclusively with characters and is akin to a role-playing game.&#10;&#10;Credited developer is Eric Goldberg.&#10;&#10;The game appeared with two covers: a blue box with a Tim Kirk illustration and a red box with a John Butterfield illustration. The games are otherwise identical.&#10;&#10;",
        "artist": "John H. Butterfield,Tim Kirk,Redmond A. Simonsen"
    },
    {
        "name": "The Extraordinary Adventures of Baron Munchausen",
        "description": "This not-quite-a-role-playing-game requires players to sit around telling fantastic (but completely true!) stories. Players may attempt to trip up another player's story by wagering a token (&quot;But the Prussian Army had dissolved by that time, m'lord, so you could not have possibly fought it single-handedly&quot;), whereas the storyteller must counter with another token (and an excuse) or swallow their pride and incorporate it into their story (with another excuse). There are also a few, minor details, mostly used to get boring storytellers to stop. The game is won after each player has told one story. Each player, in turn, gives *all* their tokens to another player they believe has told the best story--so collecting the most tokens doesn't make you the winner, it makes you be able to choose the winner. Of course, the best story-telling wins the game.&#10;&#10;Re-published 2002 (starting at Essen) by Krimsus KrimsKrams-Kiste as Die unfasslichen Abenteuer des Freiherrn von M&uuml;nchhausen.&#10;&#10;Is also listed on RPGGeek as The Extraordinary Adventures of Baron Munchausen&#10;&#10;",
        "artist": "Andrea Boekhoff,Gustave Doré"
    },
    {
        "name": "Zombies!!!",
        "description": "Players take on the role of a survivor amid city streets sprawling with Zombies. Movement is determined by dice roll as is combat when the player's piece is in the same square as a Zombie. Players must conserve bullets and protect their life counters. At the end of the turn a dice roll directs the player to move a number of Zombies one square (because they are the slow George Romero type).&#10;&#10;First player to reach the center of the Helipad tile and kill the Zombie there, or kill a total of 25 Zombies wins. When a player is killed they move back to the starting tile and lose half their Zombie kills.&#10;&#10;Zombies!!! is the original game in the Zombies!!! series.&#10;&#10;",
        "artist": "Dave Aikins,Kurt Miller"
    },
    {
        "name": "Grave Robbers From Outer Space",
        "description": "A fast-paced, humorous look at B-rated science-fiction movies. Players create bad horror and sci-fi films using cards that represent characters, props, locations, creatures and special effects. Creatures are used to attack characters. Props and locations can strengthen characters against creatures. Whoever has the strongest characters in play when the credits roll wins the game.&#10;&#10;Part of the B-Movie Series of card games.&#10;&#10;Online Play&#10;&#10;&#10;     Ludoholic (no longer available)&#10;&#10;&#10;",
        "artist": "Steve Bryant,Jason Millet"
    },
    {
        "name": "Industrial Waste",
        "description": "Industrial Waste is a fast but deep game designed by J&#195;&#188;rgen Strohm in which the players are running factories. Players buy materials, complete orders and invest money in technology improvements to earn VPs, but they need to keep an eye on their waste output. If players have too much waste in their factory dump they are liable to suffer an environmental disaster and have to pay hefty cleanup costs. Development of technological improvements requiring less waste, fewer resources, and reduced workforce are the key to this game.&#10;&#10;The game features bidding for resources, hand management and some drafting of cards to gain actions. The first player to grow their factory to a value of twenty triggers the end and the player with the most points wins.&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Quirks",
        "description": "From the back of the box:&#10;&#10;Create strange plants and animals - QUIRKS of nature.  Struggle to keep your creations alive in a world of rapidly changing climates.  Strive to be the first player to make three dominant QUIRKS.  Match wits against opponents who threaten your survival.  But BEWARE!  If three of your QUIRKS become extinct, you've lost the game.&#10;&#10;In Quirks, players build unusual plants, herbivores, and carnivores by combining cards that show one of three segments of that plant or creature. Each card is of a particular quirk: a distinctive trait that may give a bonus. Players attempt to create the dominant species of Plant, Herbivore, and Carnivore in the current niche for that turn's climate type -- Ocean, Forest, Plains, Desert and Jungle.&#10;&#10;Included are rules for solitaire play, but otherwise Quirks is good for 2-4 players using the standard game.  There are also simplified rules for Quirklings, a streamlined version of the game designed for children of ages 7-11, which can handle 2-6 players.&#10;&#10;",
        "artist": "Linda Bound"
    },
    {
        "name": "Tribes",
        "description": "Tribes is a role-playing game that plays a lot like a board game and simulates the way our ancestors lived long ago. The players are cave men and women. They hunt and gather food, make their tribal laws, and deal with natural disasters, but the object of the game is simple: Look after the children! In this game, the way to win is to have the most kids and do whatever you have to do to make sure they survive to adulthood. The players must know when to cooperate, and when to cut their losses and protect their own families. Players can re-create &ndash; and change &ndash; the earliest human societies by instituting their own laws and social patterns, and see what effects the rules of society have on their ability to survive and reproduce.&#10;&#10;With several copies of the game and a referee, it's possible to have several tribes playing at once, competing, trading, exchanging members, and even making war on each other.&#10;&#10;",
        "artist": "Donna Barr,Alain H. Dawson,Alex Fernandez (I)"
    },
    {
        "name": "Zaxxon",
        "description": "The galaxy is in peril! The evil robot Zaxxon and its legion of followers have conquered an asteroid belt! It's your job to ward off this threat before it's too late.&#10;Published in 1983, the Zaxxon Board Game was one of Milton Bradley&rsquo;s numerous attempts to translate video games to board games.&#10;&#10;HOW TO PLAY THE GAME: &#10;1. ROLLING THE DIE: both players roll their die AT THE SAME TIME. Reroll the die if there is a tie. On EACH turn, the player rolling the Lower Number on the die ALWAYS plays first. Then the player rolling the Higher Number plays second. &#10;2. USING THE SPINNER: the player rolling the Lower Number spins the spinner. The spinner controls enemy fire directed at fighter planes from missile silos and gun turrets (later in the game the spinner will also control the movement of Zaxxon). When RED is spun, any plane that is in or enters a missile silo area CONTAINING A MISSILE SILO is shot down and returned to its home base. When BLUE is spun, any plane that is in a gun turret area CONTAINING A GUN TURRET is shot down and returned to its home base. If a missile silo or a gun turret has been shot and removed from the board, there is no enemy fire from that area so any planes in that area are safe. Notice that the missile silo areas are surrounded by a red border and the gun turret areas are surrounded by a blue border. See Figures 5A and 5B for locations. When WHITE is spun, all planes are safe. Please Note: if your plane is shot down by a missile silo or gun turret in the inner fortress, return it to a RESTART space in your outer fortress. &#10;3. ORDER OF PLAY: after spinning the spinner, the player who rolled the Lower Number moves his or her plane or planes according to the die count just rolled. Then the player who rolled the Higher Number moves his or her plane or planes according to the die count just rolled. You can move one of your planes the full amount on the die or move both of your planes, splitting the die count between them in any combination&#10;4. HOW A FIGHTER PLANE MOVES: a fighter plane can move from one space to any adjacent space by die count as shown in Figure 6. A plane can change direction or land on the same space more than once on the same turn. A plane cannot pass over or land on a space occupied by another plane. A fighter plane can &quot;fly&quot; at High Altitude or Low Altitude by raising or lowering it on its base. Each change in altitude (either High to Low or Low to High) counts as ONE on your die count. Your plane must be at Low Altitude to shoot a target and at High Altitude to cross a wall.&#10;&#10;HOW TO WIN THE GAME: &#10;Be the first player to destroy your enemy targets and shoot Zaxxon with both of your fighter planes.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Viking Gods",
        "description": "A wargame simulating the battle of Ragnar&ouml;k between Odin and the other Gods of Asgard and Loki and the Forces of Chaos.&#10;&#10;",
        "artist": "James Holloway"
    },
    {
        "name": "Journey Through Europe",
        "description": "A travelling game.  Each player has a home city and draws 6 cards for other cities that they must visit by a combination of land, sea and air travel. A die is used to move, but players choose their routes. The limitation of using only one mode of transportation per turn increases the analysis and decisions a bit more. The first player to visit all their cities and return home wins.&#10;&#10;",
        "artist": "Gerhard Schmid"
    },
    {
        "name": "Why",
        "description": "&quot;Alfred Hitchcock presents...The Game of Why&quot;&#10;&#10;Once upon a time, six people on their way to a costume party took shelter from a storm in a haunted house...And were never seen alive since.  But they still haunt the house.  You must try to find out who was murdered, by what means and why.&#10;&#10;The cards include Motive cards, No Clue cards and a single &quot;It's a Mystery to Me&quot; card.  In addition, there are cards that can be assembled side by side to form larger pictures: the six guests (Cleopatra, Napoleon, etc. --they were costumed, you see; in four pieces), four weapons (also in four pieces) and Alfred Hitchcock (in six pieces).  Seven cards are dealt to each player, the rest into the house's rooms.  You enter a room by exact count, except that a 7, 11 or doubles allows you to go directly to the spot of your choice.  When you reach a room, you pick up the top card there and discard either it or another card from your hand to the &quot;Lawn&quot; --off the board.  These cards are laid face down without overlapping each other but are shown to the other players as they're laid down.  Later, you may try to recover a Lawn card by showing a card from your hand of the appropriate type (a piece of a guest, for example) and then pointing to a Lawn card and picking it up.  If you remembered right, you may repeat the procedure.  You can also claim cards from other players by meeting them in the house and &quot;accusing them&quot; of withholding a particular card (this is what the No Clue cards are defence for).  Once the rooms are empty, everyone gathers in the hall and play is speeded up.&#10;&#10;First player to assemble a Ghost, Weapon and Motive OR Alfred and &quot;It's a Mystery to Me&quot; wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Doctor Faust",
        "description": "Players are devils vying for Dr. Faust's soul in this beautifully-produced (winning the SdJ Special Award for Beautiful Game) and fairly abstract game.&#10;&#10;",
        "artist": "Klaus Albrecht,Torsten Schöps,Reinhold Wittig"
    },
    {
        "name": "Hispania",
        "description": "January 1st, 1492 AD: With the fall of Grenada, the last remaining Islamic stronghold in Spain, 2000 years of an highly eventfull epic are ended. Time and again, large-scale invasions from Africa or France had aimed at ousting or submitting the tribes and peoples already settled there.&#10;&#10;Hispania gives four to five players a chance to re-enact this dramatic period of history, setting out fom Carthage in the fourth century BC, following the footsteps of Roman, Germanic, Byzantine and Muslim conquerors, and finally taking part in the early reconquista when the Christian kingdoms of Castile, Leon and Aragon, won Spain back from the &quot;Infidels&quot;.&#10;&#10;Hispania takes the basic system of Britannia and re-locates it to Ancient and Medieval Spain, adding and changing some rules along the way. The actual time period covered is 320 BC to 1220 AD. &#10;&#10;In Hispania, the players try to outbid each other in an auction for up to 30 different tribes and peoples. The auction system guarantees that each game is quite unlike the previous one. each time the players lead different peoples and adjust to their respective victory conditions, all of which have been modeled on historical requirements.&#10;&#10;Special unit types include Knights, Castles and Elites. Several nations undergo transformations, for example the Romans becoming Hispano-Romans. Naval invasions are allowed for some powers. &#10;&#10;The game includes:&#10;&#10;    640 counters (4 countersheets)&#10;    1 map (84 x 59 cm - 33 x 23.2 in) - map has two versions: 1994 and 1996 editions&#10;    1 rule booklet (24 pages)&#10;    5 scenarios:&#10;        320 BC to 961 AD (13 turns)&#10;        205 BC to 1030 AD (12 turns)&#10;        205 BC to 1100 AD (16 turns)&#10;        320 BC to 1100 AD (19 turns)&#10;        320 BC to 1220 AD (21 turns)&#10;    &#10;    4 player's aids&#10;    2 dices (10 sided)&#10;&#10;&#10;&#10;&#10;(source: back of the box, Azure Wish edition and user's description)&#10;&#10;",
        "artist": "Andreas Steding"
    },
    {
        "name": "Boggle Bowl",
        "description": "In this quick and fun word game, players roll cupfuls of letter-dice and race to solve various word challenges.  When the timer runs out, whoever has used the most letters gets to move the common marker closer to his area of the board.  The farther along the marker is when the player scores, the more points he gets.  The position of the marker on the board also determines the nature of the next contest.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Saloon",
        "description": "Premiering at Essen 2001, a card game of brawling in a Saloon of the Old West. The attacker plays his cards and the defender responds.  The first noninvolved player to get a card to the table can throw in a punch as well.  If any of the attack gets through, the defender takes some knock out points.  But if he's not yet in Dreamland, now he gets the turn to strike back, or does he find a new target?  Plenty of warping effects on these easy-to-explain rules and interesting flavor are added by cards such as the roundhouse, whiskey bottle, flying through the window, beer barrel, piano player, Oopsadaisy and the dreaded bartender (he comes with a club).  Players gradually get knocked out until there is only one brawler left standing, the winner.&#10;&#10;Components include 6 Schl&auml;ger [&quot;Brawler&quot;] cards (one for each player), 54 Saloon cards (24 Attack cards, 8 Item cards, 6 Hit cards, 3 Help cards, 8 Defense cards, 5 Event cards).&#10;&#10;",
        "artist": "Lutz Winter"
    },
    {
        "name": "Equate",
        "description": "&quot;Scrabble with math&quot; is how this game is generally described, and the description is apt.  The board is much like a Scrabble board, including spaces equivalent to &quot;double-word score&quot; and &quot;triple-letter score&quot;.  The difference is that, instead of placing words formed of letters, players of Equate place equations formed of numbers and symbols on the board.  The beginners game (consisting mostly of addition and subtraction of integers) is pretty simple, but the standard game, bringing in multiplication, division, and fractions, can be something of a brain-burner.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Global Survival",
        "description": "This game features players buying countries based on where their pawns land on a Monopoly-style board.  A large deck of cards describes various world events that either help or hinder owners of the affected countries.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Godsfire",
        "description": "Space  conquest game with politics, government and production rules. Three dimensional movement is simulated by showing multiple levels within each hex, a system later used by Holy War.&#10;&#10;Published by Metagaming in two versions, the first in a ziplock bag and the second in a box. Later re-published by Task Force Games.&#10;&#10;Has counters for up to 8 players in the Metagaming version (the TFG version has counters for 4, but more were available as an expansion). The rules accommodate up to 15 players.&#10;&#10;",
        "artist": "R. Vance Buck,Allen D. Eldridge,Robert E. Manns,Ben Ostrander,Rick Sternbach"
    },
    {
        "name": "Liberté",
        "description": "Libert&eacute; covers the French Revolution from 1789 and the meeting of the Estates General to the Directory and Bonaparte&rsquo;s coup d&rsquo;&eacute;tat in 1799. &#10; The game is played in four turns. In each turn there will be a variable number of rounds, followed by an election to see which faction becomes the government. There are three factions, the Radicals (red), the Moderates (blue), and the Royalists (white).  The most common action is for a player to place faction blocks on the board.  He shows he controls these blocks by placing one of his tokens on top of the stack.&#10;&#10;The cards are divided into two sets, set 'A' and 'B'.  The 'A' deck is used first and tends to favor the moderates and Royalists.  Once this deck has been exhausted the 'B' deck comes into play, which tends to favor the radicals.&#10;&#10;The election is triggered when all of one type of faction block has been exhausted.  The faction blocks will determine which faction forms the next government.  Players are attempting to score victory points by having the most influence in the government and opposition.  Points can also be picked up in later turns for being the general in charge at a victorious battle, and for winning elections in specific provinces.&#10;&#10;Normally the player with the most victory points will win.  However, there are two sudden death game end conditions that may alter the outcome.  The first is a radical electoral landslide, triggered by the red faction gaining 17 or more votes.  The second is  successful Royalist counter-revolution, precipitated by Royalist control of seven counter-revolutionary provinces.  In both cases, victory is determined by a different set of criteria, in which accrued victory points do not count.  The player who is ahead on points must be aware that one mistake could lead to defeat at the hands of the Jacobins or Royalists!&#10;&#10;It is likely that you will never have played a game quite like this one and you may find yourself wondering what strategies to employ.  Do not despair!  Once you have completed your first game you will realize that amongst the apparent chaos of the game there are many opportunities for long-term planning.&#10;&#10;Libert&eacute; is #6 in the Valley Games Classic Line&#10;&#10;",
        "artist": "Peter Dennis,Kurt Miller,Mark Poole"
    },
    {
        "name": "Playboss",
        "description": "Playboss is an exciting board-game that simulates the many real-life business situations in which directors and managers make their decisions. Each player in this game is a businessman who has the opportunity of buying machines and raw materials, selling his products, paying taxes, raising loans or introducing rationalization schemes, and generally experiencing the ups and downs of everyday business life.&#10;&#10;Before starting, players agree the duration of the game. The player with the greatest net assets at the end of the game is the winner.&#10;&#10;The board comprises a circuit of 42 spaces of 5 different types: decision spaces on which the player can choose to buy raw material, purchase capital equipment, manufacture goods or sell goods, research &amp; development spaces which allow investment for productivity improvement or risk reduction, risk spaces which require the drawing of a risk card, additional cost spaces, and depreciation spaces.&#10;&#10;Each player has a factory card on which are placed machines, computers, raw materials and finished goods. At the start of the game, priced slots in the center of the board are filled with the goods: these slots are emptied and filled as goods are bought as raw material and sold as finished goods. The buying and selling price is determined by the next available filled or empty slots, though players can bid competitively for the purchase or sale.&#10;&#10;The Economy Game uses the basic mechanism and many features.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Sherlock Holmes Consulting Detective: The Thames Murders & Other Cases",
        "description": "Have you ever had the desire to walk the streets of Victorian London with Sherlock Holmes in search of Professor Moriarty? To search the docks for the giant rat of Sumatra? To walk up Baker Street as the fog is rolling in and hear Holmes cry out, &quot;Come, Watson, come! The game is afoot!&quot;? Now you can! You can enter the opium den beneath the Bar of Gold, but beware, that may be Colonel Sebastian Moran lurking around the corner. You can capture the mystery and excitement of Holmes' London in this challenging and informative game. You, the player, will match your deductive abilities against your opponents and the master sleuth himself, Sherlock Holmes.&#10;&#10;In Sherlock Holmes Consulting Detective, you are presented with a mystery to solve, and it is then up to you to trace the threads of evidence through the byways and mansions of nineteenth century London. You will interview suspects, search the newspapers for clues, and put together the facts to reach a solution.&#10;&#10;Why were two lions murdered in Hyde Park? Who is responsible for the missing paintings from the National Gallery? Who murdered Oswald Mason and why? These are just a few of the cases that will challenge your ingenuity and deductive abilities.&#10;&#10;This is not a board game: No dice, no luck, but a challenge to your mental ability. The game has been thoroughly researched for Holmesian and Victorian accuracy so as to capture a feeling of that bygone era.&#10;&#10;",
        "artist": "Arnaud Demaegd,Nils Gulliksson,Neriac,Stefan Thulin"
    },
    {
        "name": "Man O' War",
        "description": "Man O' War is the game of Raging Sea Battles in the Warhammer World. As an admiral of an ocean-going war fleet you must command your ships - which can be either  squadrons of Ships of the Line or heavily armored Men O' War, in the battle for supremacy of the high seas.&#10;&#10;Players choose fleets from the multitude of races of the Warhammer world. Every ship is represented by a template showing individual areas, each with a description of the items (masts, cannons etc.) in those areas - as well as the damage that they can take before being destroyed. Each location has a value that must be rolled to hit that area when attacked, along with another value that can be rolled by the defending player to possibly prevent any damage that might occur. Ships are classified as Ship of the Line (SOL) - which are designed to move as a group of three (each moving and fighting to completion before continuing on with the next ship in the squadron), a Man O' War (MOW)- which are single ships that are much larger, more powerful and crewed by larger numbers than a single SOL classed ship, or finally as an Independent (IND) - which are used individually like a Man O' War but are more in line in strength and abilities to that of a Ship of the Line.&#10;&#10;At the beginning of each turn, players determine Initiative by each rolling a die which determines either who will go 1st in each phase - if the numbers are different, or how the wind direction changes if they both roll the same number. If the wind changes, the initiative roll and resolution is repeated until one player wins the die roll.&#10;&#10;Players then conduct the Magic Phase with each Admiral having his Wizard make one spell attempt if desired. If a spell is successful, the other player can try and dispel that cast spell if they have a corresponding type of magic to make the attempt.&#10;&#10;Next comes the Battle phase which is based on the previously determined initiative roll and players alternate between phases of Movement/Combat, each choosing a single MOW, IND or SOL Squadron and then conducting movement and making attacks before passing the turn sequence back to their opponent. This process continues until all ships have moved on both sides. Once that has occurred, the turn is over and a series of quick turn ending/record keeping events occurs before moving to the next turn. Game play continues for a predetermined time or until one side is destroyed, surrenders or flees the battlefield.&#10;&#10;There were two separate expansions to the main game. The first was Plaguefleet which added rules and templates for the Chaos fleets of Khorne, Slaanesh, Tzeentch and Nurgle (collectively known as a Plaguefleet), the Skaven and finally the Chaos Dwarfs. This expansion effectively doubled the number of available fleets for the game. This expansion also included color templates for the original 6 races as well (Imperial, Bretonnian, Dwarf, High Elf, Dark Elf and Orc).&#10;&#10;The 2nd expansion Sea of Blood mainly introduced new rules for Airpower, Sea Monsters &amp; Beasts and Allies as well as new ships for the Dwarfs and Imperial fleets. The inclusion of the Norse fleet wrapped up the content for this expansion.&#10;&#10;Finally, complete rules for an Undead fleet - as well as some expansion rules for a few of the other races, were included in several of the issues of Game Workshop's Citadel Journal magazine.&#10;&#10;A wide variety of miniatures were produced to represent the many ships detailed in the main game and expansion sets but no miniatures were ever officially made for the Undead fleet. Assembling and painting the miniatures gave the game a feeling of being &quot;collectible&quot; as well as being a hobby in itself. Many players have created customized ships and new ships (and even complete fleets) including rules, ships templates and completed miniatures. The largest collection of these creations is housed at the Yahoo group Sea of Claws.&#10;&#10;",
        "artist": "Dave Andrews,John Blanche,Wayne England,David Gallagher,Geoff Taylor"
    },
    {
        "name": "Ulcers",
        "description": "This game's theme is fairly unique: you are trying to assemble a full staff of personnel (two secretaries, two salesmen, one sales manager, one vice-president and one president) to run your company.  The problem is there aren't enough available in total for more than one company to achieve that goal.  You win by assembling a full staff and making it safely around to a New Fiscal Year (the &quot;Go&quot; square, in other words).&#10;&#10;As you move about the (bilingual, two-sided) board, you'll have opportunities to hire or raid competing companies.  You must decide how much to pay your people --not enough and they'll switch companies, too much and your company will go bankrupt.  Managing your money is an important aspect of the game but it isn't the victory condition.&#10;&#10;Amusingly, the early editions had all-female secretaries and all-male higher personnel; later editions kept the illustrations but shuffled them throughout the positions.&#10;&#10;From Waddington ad: &quot;Ulcers is the big business game that recognizes an important business fact: PEOPLE are among a company's most valuable assets. And people are why executives get ULCERS. Suppose you had to form a company and had to hire a staff of executives, managers,salesmen and secretaries. You probably think it would be easy but it isn't. ULCRES puts you in the owners chair. You form the company, hire the staff and you try to keep them.&quot;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Quicksand",
        "description": "The object of the game is to be the first player to get your adventurer around the board from START to the finish line back at CAMP.&#10;&#10;Along the way, you&rsquo;ll encounter Mudslides that may set you back and hanging vines that may swing you ahead.  You&rsquo;ll try to grab onto Handholds and land on Safe Rocks to keep your man high and dry.  Because all along the track, Quicksand pits lie in wait to suck your adventurer down, down, down --piece by piece by piece!  And you&rsquo;ll always keep an eye out for the sneaky Alligator that lurks in the swamp --and on the special Quicksand die-- ready to scare an unlucky player backwards on the track.&#10;&#10;The player pawns represent a mustachioed archetypical British explorer, and they're in parts.  To represent your sinking into the quicksand, you remove his feet, then his waist, and so on until only the pith helmet remains!&#10;&#10;You actually start already partially mired (by an initial die roll); every turn you move forward a number of spaces given by your height, plus an optional movement die.  You can never sink more than hat-deep (so you cannot be eliminated).&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Renegade Legion: Interceptor",
        "description": "Renegade Legion: Interceptor is a space battle game played on a large hex map and features unique playing pieces that are space ships made &quot;3d&quot; by being printed on little 1&quot; cardboard boxes.&#10;&#10;Players can choose from a variety of ships each of which have their pros and cons, and ships fight it out with &quot;standard&quot; battle systems that include thrust movement, targeting, and variable weapons damage.&#10;&#10;FASA also attempted to include some optional role-playing aspects into the game.&#10;&#10;",
        "artist": "Dana Andrews,Jeff Laubenstein,Todd F. Marsh,Tom Peters,Erik Van der Palen,Steve Venters"
    },
    {
        "name": "Nexus",
        "description": "Players place cards in a basket-weave pattern to form Nexuses out of the nodes that are printed on the cards.  Players also mark nodes in an attempt to control the Nexuses.  When a card is placed which closes a Nexus, the player with the strongest control on that Nexus scores points equal to the strength of all open nodes on the Nexus.  First player to 10 points wins.&#10;&#10;Nexus is part of the Hip Pocket Games series.&#10;&#10;Awards&#10;&#10;    2002 Listed in GAMES Magazine's GAMES 100&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "StarForce 'Alpha Centauri': Interstellar Conflict in the 25th Century",
        "description": "From the box:&#10;&#10;The game is a simulation of events within a conjectural future history. It is played on a map which displays 74 star sytems in a three-dimensional &quot;sphere&quot; of space measuring roughly 40 light years in diameter, with our home system at the center. A grid of hexagons printed over the map is used to regulate movement and position of pieces.&#10;&#10;The pieces in the game represent groups of four interstellar spaceships (StarForces) and space stations (StarGates). Each Player maneuvers his pieces (via Stellar Shifting) to engage those of the enemy. Battles take place when units are in the same three-dimensional position. The total variable strengths of the involved units are compared. The attacking Player consults a simple probability table to determine the outcome of each battle. Movement is plotted and executed simultaneously. The game proceeds this way (for a specified number of turns) as the players try to achieve the objectives set forth in the rules. No prior knowledge is required to play the game - just a little ingenuity and common sense.&quot;&#10;&#10;&#10;Part of the StarForce Trilogy box set, along with Outreach and StarSoldier. There are also special rules to use Starsoldier as a tactical game for StarForce.&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "Flat Top",
        "description": "Flat Top is a board game of high complexity that covers the battles of the Solomon Seas between the United States and Japan in 1942. It is very well researched and covers all aspects of naval and air combat as it existed in 1942. The system depicts weather, air searches, air combat, surface combat, carrier operations, submarines, air bases, supplies, and much more. The game requires intense planning and searching since movement is covert and the map is pretty huge.&#10;&#10;The units are individual ships and submarines with each air point representing three aircraft. Hexes are twenty miles, and each turn represents one-hour.&#10;&#10;The game includes thirteen hundred counters, 4 maps to create a 44&quot; x 28&quot; map of the South Pacific, four Allied/Japanese operations cards, three player aid cards, and two log sheets.&#10;&#10;",
        "artist": "Rodger B. MacGowan"
    },
    {
        "name": "Valley Of The Four Winds",
        "description": "A two player fantasy wargame which pits the forces of good (humans, elves &amp; dwarves) against an evil legion of undead. Sounds old hat but VOTFW is very easy to learn, challenging and fun to play. A Lew Pulsipher classic.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Kupferkessel Co.",
        "description": "In Kupferkessel Co. (Copper Kettle, or since it's about witches, Copper Cauldron Co.) we imagine witches or wizards shopping for ingredients for their magic potions.  Your token moves around the perimeter of an array of cards (ingredients) and you pick one from the row or column where you stop.  The number on the card you pick dictates how many spaces you move on your next turn.  You try to collect sets of four matching ingredients and get penalty points if you have only one of a particular ingredient.  The scoring rules can be made more complicated if the players desire, but for most the basic rules are satisfying.  A touch of memory is involved since you can see only the last ingredient you picked up on your stack of cards.&#10;&#10;&#10;Game Summary&#10;Create a 6x6 grid of ingredient cards (numbered 1-4, 14 ingredient types; 2 each in 5 colors, and the player colors black and white) minus the corners. Place the 2 player pawns on opposite corners. Each player gets a random card (not of their color) in front of them. For the advanced game, players also get 2 recipe cards = bonus points at end of game if you meet the conditions (e.g., at least 3 cards of both ingredients in a color; fewer 4s than the other player, etc.).&#10;&#10;On your turn, move clockwise as many spaces around the grid as the number showing on your card stack, then take a card in that row and place on top of your stack (may never look through your stack) -- if land on corner, get nothing. Place the top card from the draw deck in the empty spot. If you drew a card with a magic hat/wand icon, take a second turn (max 2 consecutive turns). If you got a card with an exploding icon, the other player places their top card on the bottom of the draw deck (if deck empty, remove card from game instead).&#10;&#10;The game ends when any row is empty. Then sort your cards by ingredient type and score according to number of each type:&#10;- 1 = negative points&#10;- 2 = 0&#10;- 3 = sum&#10;- 4 = sum + 5 (i.e., 15 VP)&#10;- then, if in your own color, double the value&#10;- score any bonus points from end-game recipes.&#10;Most points wins!&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Valley of the Mammoths",
        "description": "While fleeing from starving wolves and wild sabretooth tigers, will your tribe of cavemen manage to survive in, let alone conquer, the merciless Valley of the Mammoths? Will it escape the stampeding woolly rhinoceroses and the massive mammoths, only to be reduced to pat&eacute; under the heavy clubs of their rival tribes? In these chaotic times, man must fight for everything, his adversaries are without pity, and nature herself is in a state of violent upheaval.&#10;In Valley of the Mammoths, you must contend not only with rival tribes (the other players) but also with wild, untamed, unpredictable nature. To feed themselves, your tribe will have to devote themselves to hunting, gathering and fishing. They may even attempt to innovate by developing agriculture... But all is not peaceful in the Valley, opposing tribes will attempt to hunt YOUR bison &amp; mammoths, to gather YOUR fruits &amp; roots, to fish YOUR rivers &amp; lakes... and to even steal YOUR WOMEN! You will have to fight them off, and protect your food supply... all the while keeping a watchful eye on the smoldering volcanoes - after all, one never knows.&#10;&#10;Originally published only by Ludodelire in French. Re-published in both French and English with some updates 2001 by Descartes.&#10;&#10;A winner of the 1989 Concours International de Cr&#195;&#169;ateurs de Jeux de Soci&#195;&#169;t&#195;&#169;.&#10;&#10;Expanded by:&#10;&#10;    La Vall&#195;&#169;e des Mammouths: L'extension&#10;&#10;&#10;&#10;&#10;",
        "artist": "Bernard Bittler,Copik Buntz,Gérard Mathieu"
    },
    {
        "name": "Vabanque",
        "description": "A party meets for a game in the casino. After the players determine how much money can be won at the casino tables they play their character cards and move their pawns to a casino table. The payout can be multiplied or lost to card sharks.&#10;In the beginning the stakes are low but they increase from round to round. If you carefully watch the others, and guess their bluffs, you can win a lot.&#10;&#10;Online Play&#10;&#10;&#10;     BrettspielWelt (real-time)&#10;&#10;&#10;",
        "artist": "Marcel-André Casasola Merkle"
    },
    {
        "name": "Draco & Co",
        "description": "Draco is the king of all rogues and bandits. He gets his name, not because of his fierce temper, but because of his terrible breath! Draco's &quot;Company&quot; is the feared &quot;Round Table Gang&quot;, a band of brigands who scour the kingdom's roads for loot and plunder. Every night, Draco and the gang gather together at the Shady Dragon Tavern to divide up the day's loot.&#10;In addition to his breath, Draco is famous for his drinking. He loves a good party! And when he starts to get &quot;happy&quot; he starts handing out treasure. Whenever someone proposes a toast, Draco gives rewards to the group of thieves on his good side. However, Draco does love his money, so he makes any player on his bad side give up some of their treasure at the same time.&#10;With the aid of drink and furious fawning and elbowing, all the gang members try to stay on Draco's good side and avoid his bad. All in an effort to gain the bandit King's favor, and consequently get a bigger part of the loot.&#10;&#10;Rerelease of Die Tafelrunde.&#10;&#10;",
        "artist": "Julien Delval"
    },
    {
        "name": "Viceroys",
        "description": "This wargame details the worldwide European explorations and colonizations of the 15th and 16th centuries.&#10;The map is directly based on a &quot;wrong&quot; historical map. Event cards seem to cover just about every dimension of the period. The underlying game system also offers opportunity for strategy and negotiation as well as chaos. The seagoing players, Portugal, Spain, England, France, and the Dutch, each have national differences and advantages/disadvantages.  This is also true for Russia and Turkey which can colonize overland. There is also provision for general European war.  Multiple scenarios are provided. Also included are rules for 1 or 2 players which permit Spain and Portugal to participate as non-players.&#10;&#10;One interesting dimension of the game is the idea that each player also has a &quot;job&quot; within the game, from which he occasionally earns a little income.  One of them was even The Rules Lawyer, in charge of resolving any disputes!&#10;&#10;In 1992, expanded to support 8 players, including China, with the Columbus expansion kit commemorating the 500th anniversary of Columbus' initial voyage.&#10;&#10;",
        "artist": "Kevin Zucker"
    },
    {
        "name": "Urland",
        "description": "In Urland, players compete to get their creatures on land. One player selects which land area is scored in a turn while other players use a number of actions to move their creatures around. At certain intervals on the scoring track, gene modifications are auctioned which offer additional actions to the players.&#10;&#10;",
        "artist": "Doris Matthäus"
    },
    {
        "name": "Beest",
        "description": "Werewolf meets Carpenter's Thing. In this game, players are antartic explorers lost in a cave, not all players though... One of them is the Beest. Players take turns adding a tile to each opponent's cave system. Players meet if the cave system of two players are open at the same time. Meeting players swap DNA profiles. If one of these players is the Beest then the other player becomes a minion to the Beest and his new objective is to get other people to also meet the Beest. The Beest wins the game if all players have become minions, the other player win if they meet all players but the Beest.&#10;&#10;",
        "artist": "Herman Haverkort,Tamara Jannink,Bianca van Duijl"
    },
    {
        "name": "Cosmic Cows",
        "description": "from translation:&#10;OBJECT:&#10;First player to advance three (3) pawns into his win zone&#10;&#10;PLAY:&#10;&#10;(the dice rolling for all practical purposes follows standard &ldquo;yahtzee&rdquo; format)&#10;Player rolls all five dice, then may set aside any of them to establish any of the NINE zones (chance, 1, 2, 3, Kniffell, 4, 5, 6, straights)&#10;Player may set aside, pick up, re-roll any dice up to THREE rolls while trying to create the best combination of dice to move a pawn(s). To move a pawn, one of the following dice combinations must be created:&#10;Pair (zwilling) Move the pawn two (2) spaces towards player rolling dice,&#10;i.e. a pair of 4&rsquo;s = move the #4 pawn two spaces.&#10;Triples (drilling) Same as above, but move three (3) spaces.&#10;Four of a kind (Vierling) Same as above, but move pawn four (4) spaces&#10;Two Pair (doppell zwilling) Move each corresponding pawn two (2) spaces&#10;Full House Move corresponding pawns three (3) spaces / two (2) spaces&#10;NOTE: Two Pair &amp; Full House are the ONLY combos that allow a player to move TWO PAWNS in one turn&#10;Five of a kind (Kniffel) Move the center pawn (Kniffel) all the way to player&rsquo;s back win zone. If pawn is in opponent&rsquo;s back win zone, move to center. Player MUST move the Kniffel pawn, when possible. Only when player has Kniffel pawn in his win zone, may he then move the corresponding dice # five spaces towards his win zone.&#10; Straights (Stra&szlig;e) A small (kleine) straight (4 dice in sequence) moves pawn three (3) spaces, a large (gro&szlig;e) straight, moves pawn four (4) spaces.&#10;Chance Total all dice. Total = 10 - 12 OR 23 - 25, move pawn three (3) spaces.&#10;Total = 5 - 9 OR 26 - 30, move pawn four (4) spaces.&#10;Player MUST choose one of these options to move a pawn. He may not combined them, i.e., small straight w/ a pair. 1, 2, 3, 4, 3. After the third roll, if player has no options to move a pawn, he forfeits his roll. Players do NOT need an exact count to move pawn back to its last line in his win zone. Excess moves are lost.&#10;Pawns are neutral, regardless of their location on the board. A pawn in a player&rsquo;s WINZONE can be moved out with the proper dice roll by his opponent.&#10;Game ends immediately when either player has THREE pawns in his win zone.&#10;&#10;Redevelopment of:&#10;&#10;Quadwrangle&#10;&#10;From the publisher, Playroom Entertainment:&#10;It's time for the Annual Extraterrestrial Cow-Pulling Contest, and aliens from all over the galaxy have come to watch the event!  Go head to head with your cross-cosmos rival to see who can abduct three Cosmic Cows&trade; first!&#10;&#10;Roll different combinations on the dice to choose which tractor beam to use in order to abduct the cows.  With a good mix of strategic offensive and defensive maneuvers, decide which combination of the unknowing bovines to pull toward your spaceship or away from your opponent's!  The player that pulls three cows into their Danger Zone wins, in this dicey game of alien tug-of-war!&#10;&#10;For 2 Players or Teams, 20 Minute Playing Time, Ages 8 to Adult&#10;&#10;Designer: Maureen Hiron&#10;&#10;Contents: Gameboard, 10 Dice, 10 Cow Pawns and Instructions in English, Spanish &amp; French&#10;&#10;",
        "artist": "Design Edge,Elisa Teague"
    },
    {
        "name": "Gargon",
        "description": "Contents - one deck of 102 Gargon cards in 6 suits, plus 18 bonus cards. One rulebook.&#10;&#10;Gargon is fantasy themed card game for 3-5 players. There are 6 suits of Gargon cards, each representing a fantasy creature, with values 0 to 15. The cards also show amulet symbols, with the low value cards having more, the highest value cards having none. At the end of the game, the player who has won the most cards in each suit gets a bonus card worth ten points, or five points if tied - this is what the 18 bonus cards are for. Each amulet is also worth one point. The zero value cards have no amulets themselves, but double the amulet count for that suit, or quadruple them if both 0 value cards in that suit have been won.&#10;&#10;Ten cards are dealt to each player, and the rest are split into two equal draw piles, face down, in the center of the board. The draw piles are spread out so that the backs can be seen, showing the color of the suits. Players must also hold their cards so that the backs are visible.&#10;&#10;Each round the start player plays up to three cards face down, (but never three of the same suit), and the other players must follow in turn with the same number of cards in the same distribution, or pass. There is no requirement to follow suit in general, but if, for example, the start player puts down three cards in three different suits, the other players must also play three cards in three different suits. The last player is restricted to suits that have already been played. Anybody who passed draws 1-3 cards from the two draw piles in the center. A battle is then resolved for each suit that has been played, with the highest card winning the battle and going into its owner&rsquo;s stash of Gargon cards to be scored at the end. The losing cards are discarded and the players draw replacements.&#10;&#10;If anybody played two cards of a suit, a second battle is fought with the weakest of the pair.&#10;&#10;The game ends when one of the draw piles is exhausted, and the current round is played out, then the totals are scored.&#10;&#10;",
        "artist": "Oliver Freudenreich"
    },
    {
        "name": "Pompeji",
        "description": "Players build the city of Pompeii in a 7x7 grid using cards that each show various building types, numbers and colors. The same building types and colors may never be placed horizontally or vertically adjacent. During placement, horizontal, vertical and diagonal &quot;streets&quot; emerge, and players score points when they place cards with elements that match other cards along a street. Thus, with each placement, a player has the potential to score points along 4 different streets - 2 diagonal, 1 vertical and 1 horizontal. If a card's color matches others in a street, the player scores points equal to the highest-valued card of that color. If a card's building matches others in a street, the player receives the total sum value of all the matching buildings. Players receive a 7-point bonus for placing the 7th building in a road. Players also receive one special building permit card that allows an extra or out-of-turn play and one statue card, which acts as a wild card. The game ends when the second of two volcano cards in the deck is revealed.&#10;&#10;",
        "artist": "Dennis Lohausen,Jürgen Martens"
    },
    {
        "name": "Contigo",
        "description": "This game in the 3M Bookshelf Series is a cross between Mancala (a.k.a. Warri, Oh-Wah-Ree) and more traditional Checkers-like games.  It is played by four players according to the original rules, but can be adpated to be played by just two (the three-player game would be unbalanced).&#10;&#10;The 6x6 board is surrounded by Mancala-like pits, where pebbles are moved.  The number of pebbles in a row/column/diagonal's pits controls how the pawns on the board move.&#10;&#10;Two sets of rules are supplied: the Alignment game, where you are trying to be the first to align four of your pawns in any six-space row --either horizontally, vertically or diagonally-- without opposing pawns between them, and the more advanced Capture game, where you're trying to capture your opponents' key pawns (kings, really).&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Auf Fotosafari in Ombagassa",
        "description": "Players are on safari and are given 'photo cards' with a group of animals on. Each player tries to move the animals around the water holes to match the animals on their cards while at the same time trying to move their jeep into a photo taking position. Players also have the chance to take photos from two of their opponents' jeeps as well. First player to snap all their photos wins.&#10;&#10;",
        "artist": "Matthias Wittig"
    },
    {
        "name": "Vom Kap bis Kairo",
        "description": "Players attempt to be the first to build a railway route from Cape to Cairo through various terrain types in Africa. Players begin with 100 pounds, which is used to bid on terrain cards and purchase missing tracks necessary to cross terrain. Each turn, a number of terrain cards equal to the number of players in the game are auctioned off and placed before the appropriate player's train, representing the next space to be crossed. Terrain cards show a number of tracks ranging from 0 to 3 and require from 6 to 10 tracks to cross depending on the type of terrain. In turn order, players flip additional terrain cards, and decide whether to build (cross terrain) or pass. When a terrain is crossed, the card is flipped face down and the player who completed the crossing receives back a number of pounds as indicated on the card. The track-building phase continues until one player has no terrain cards lying in front of their train, at which time a new set of terrain cards are auctioned. The first player to complete the crossing over eight terrain segments is the winner.&#10;&#10;",
        "artist": "Jürgen Martens"
    },
    {
        "name": "Castle Risk",
        "description": "Each player starts out with one castle on the game board. Your objective is to capture all your opponents' castles, so that you are the last player remaining in the game.&#10;&#10;This game in the Risk family of games is markedly different than the original Risk. The combat mechanism is the same but players receive armies at the end of the turn, not the beginning (the sole exception being playing a Reinforcements card). The game has no territory cards, and one does not get armies based on the total number of individual territories. One gets armies for regions controlled and banners in one's castle only. Each player starts with a single banner in his castle but also takes the banners of any captured castles.&#10;&#10;The cards act as die modifiers (General and Marshall), allow attacks one would not normally be able to make (Admiral), get armies at the start of a turn (Reinforcements), force temporarily non-aggression pacts (Diplomats) and look at another player's cards, discarding one in the process (Spy). The Spy card can also be used to defend against another Spy.&#10;&#10;",
        "artist": "Tim Hildebrandt"
    },
    {
        "name": "Blockade",
        "description": "Described on-box as &quot;the Beat the Barrier&quot; strategy game. Players each have 2 pawns, 9 green walls (which are placed vertically), and 9 blue walls (placed horizontally). Pawns start on the color matching them, which are 4x4 squares in on each of the four corners of the 11x14 board. The object is simple: to get one of your pawns to a starting spot of your opponent. Each turn players can move one pawn up to two spaces, and also place one wall, useful for blocking off their opponent's move. Walls always cover two squares worth of area, and must be placed according to their color (vertically or horizontally). Once players are out of walls, they keep moving pawns until one wins.&#10;&#10;This game is one of a series of 2 player strategy games by Lakeside from the 1970s.&#10;&#10;Another version by the same Designer:&#10;&#10;    Quoridor&#10;&#10;&#10;&#10;&#10;Re-implemented By:&#10;&#10;    Pinko Pallino&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Samurai & Katana",
        "description": "In the XVIth century, during a Japanese civil war, you are a Da&iuml;myo (samourai clan chief) and are attempting to end the civil war by becoming Shogun.  Only an honourable Da&iuml;myo can hope to obtain that title.&#10;&#10;You will organise spectacles, marriages, build castles, trade with China, obtain the loyalty of minor clans, raze sectarian monasteries, call on demons, ronins and even the infamous ninjas during battle.&#10;&#10;You will try to dishonour and weaken your adversaries, but beware of shifting alliances, treason and assassination...&#10;&#10;Game Box:&#10;&#10;1   map of the game that represents the Japan of the XVI century&#10;55  cards&#10;120 pieces &quot;samurai&quot; (20 each player)&#10;18  pieces &quot;castle&quot; (3 each player) &#10;19  pieces &quot;city&quot; (minor and major)&#10;24  koku (1, 2 and 5 koku coin)&#10;6   cards &quot;clan&quot;&#10;1   Shogun shape with its base &#10;1   Emperor shape with its base&#10;&#10;",
        "artist": "Thierry Masson"
    },
    {
        "name": "Hot Dog",
        "description": "Theme&#10;Players attempt to earn the most money by selling their hot dog cards as quickly as possible and for the best price at carefully selected tables.&#10;&#10;Goal&#10;Having the most dollars after three games.&#10;&#10;Game play&#10;Each player gets 10 hot dog cards in one color, 2 or 3 (depending on player number) table cards in the same color, and 3 one dollar cards.&#10;&#10;The neutral table cards are placed at the center of the table: with 2 or 3 players, there are 2 neutral table cards (with values 5 and 7), with 4 or 5 players, there are 3 neutral table cards (values 5, 7, 9). The table value determines how many hot dogs can be sold at that table.&#10;The remaining dollar cards are sorted according to value (1, 5, 10 $) and also placed on the table. The start player gets the ketchup/mustard card.&#10;&#10;All players simultaneously decide at which table and how many hot dogs they want to sell. Each player puts the corresponding table and hot dog cards on the table, face down. They can also put down dollar cards to reduce the price of their hot dogs.&#10;When all players have made their decision, the cards are revealed and tallied up, beginning with the lowest table. &#10;When several players want to sell at the same table, the player who wants to sell the lowest number of hot dogs at this table puts them next to the table first, followed by the player who wants to sell the second lowest number at that table etc. Once the number of hot dogs from the players' cards has reached the maximum specified on the table, no other players can sell hot dogs there and any unsold hot dog cards are returned to that player's hand. Dollar cards are used to indicate that a player sells his/her hot dogs cheaper, and this changes the order in which players are allowed to sell (e.g. a player with 5 hot dogs minus $ 2 is allowed to sell before a player with 4 hot dogs because his/her total of 3 is lower than the other player's 4). If hot dog prices are equal, the player with the ketchup/mustard card goes first.&#10;As soon as a table is full, each player receives one dollar for each hot dog he/she has at this table.&#10;At the end of the round, each player takes back the table card he/she played and the ketchup/mustard card is passed on to the next player.&#10;A new sales round starts.&#10;When someone plays out his/her last hot dog card(s), he has to announce this by saying &quot;last hot dog&quot;, otherwise he may not sell them. When one player has sold all of his/her hot dogs, the game ends. If tables have become full that round, there is a last payout.&#10;Then all players count their dollars and write down their points. After three games, the richest player wins.&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Die Erbtante",
        "description": "Aunt Mary is single, rich, has lots of money, relatives and boyfriends. She wishes to leave some of her great wealth to her relatives, but none are allowed to receive more than she herself inherited long ago - 50 heirloom points (in furniture, jewelery, clocks, etc.) That is the limit that each player (Aunt Mary's relatives) may acquire - unless, of course, Aunt Mary marries one of her 9 boyfriends. Should that happen, Aunt Mary is distracted and players may grab for as much loot as they wish!&#10;&#10;",
        "artist": "Michael Schacht"
    },
    {
        "name": "Who Stole Ed's Pants?",
        "description": "An overview from the rules:&#10;&#10;Who Stole Ed's Pants? is a friendly game of fraud, treachery and injustice. You'll play two rounds of the game, and after each one, every player will accumulate points based on how guilty they look and add it to their running total. At the end of the second round, a winner and a loser will be decided. The game centers on the three factual categories of the game:&#10;&#10;When: The time of the theft&#10;Where: The location of the crime&#10;Who: A partial description of the thief&#10;&#10;Because no one has bothered to ask Ed about the details of the crime, police have nothing but wild rumor and rampant speculation to go on. You'll be able to change the alleged facts of the case and alter the focus of the investigation in each of these three crime categories.&#10;&#10;At the same time you'll plant evidence on other players. If a round ends while the case facts match up with the evidence planted on you, the police will grow suspicious. Too much incriminating evidence after each round will land you in the big house for the theft of Ed's pants.&#10;&#10;In a 4-player game, players sitting across from each other are on the same team and you will win or lose together as accomplices. In a 3-player game, it's everyone for themselves.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Pick Picknic",
        "description": "&quot;A corn, please!&quot; is the cry heard from many fowl mouths at the cold buffets in the many poultry yards. Game hens, pheasants, ducks, geese, and turkeys seem to be always hungry - never getting enough to eat. In Pick Picknic, a real feast awaits them! The fox is also always hungry and ready to eat, but from a somewhat different menu,... Chickens, geese, and ducks, become happily plump when they are able to eat well and often. Such is not different for the clever fox, who will eat all manner of incautious fowl... At the end of the game, the player who has gotten the plumpest poultry and the most nutritious corn is the winner!&#10;&#10;Stefan Dorra's remake of Razzia with the theme centered around chickens and their quest for corn.  But watch out, there are foxes out there trying to get to the chickens.&#10;&#10;One of those &quot;children's games&quot; that adults find fun as well.  Features artwork by Doris Matth&auml;us.&#10;&#10;This game is part of The Chicken Family of Zoch.&#10;The Dutch edition is part of the Jakkie &amp; Bak Collection&#10;&#10;Re-implements&#10;&#10;    Razzia&#10;&#10;&#10;&#10;&#10;Microbadges:   (Buy One)&#10;&#10;",
        "artist": "Doris Matthäus"
    },
    {
        "name": "Atlantic Star",
        "description": "This is a remake of db Spiele's Premiere and Queen Games' Show Manager. The theme has been changed to cruising: here the players are travelling by sea. The mechanics are otherwise almost identical.&#10;&#10;",
        "artist": "Christof Tisch"
    },
    {
        "name": "Rivers, Roads & Rails",
        "description": "This matching game is a close relative of Dominoes. Each tile has two sides, and each side contains at most one road, one river, and one rail. You can only play a new tile adjacent to a played tile if the sides match. The act of playing tiles creates a map of an intricate twisting transportation network. The tile illustrations are very pleasing to both young and old alike. Only two of the tiles are branching, so the game is mostly played at both ends of the tiles already laid down.&#10;&#10;Several variants are supplied in the rules. You can play this game competitively like Dominoes, or cooperatively like a free-form jigsaw puzzle.&#10;&#10;First published in 1969 by James Galt and Company, Limited, Cheadle/Cheshire.&#10;Then in 1970 as 'Connect' (in French as 'Contact') by Ravensburger.&#10;Re-released 1984 by Ravensburger as 'Rivers, Roads and Rails' (in Europe still as 'Contact').&#10;&#10;",
        "artist": "Josef Löflath"
    },
    {
        "name": "Classic Warlord",
        "description": "Originally self published by Mike Hayes in 1974 as \"The Warlord\" - this edition came in a red box.  It was reprinted by Mike in 1978 as \"Warlord\" and came in a blue box.  It was released by Games Workshop in 1980 in a smaller version (only western half of the Warlord board) as \"Apocalypse\".&#10;&#10;As of October 2012, the game is now available again as Classic Warlord, a limited edition in a gold box, with two sets of rules and an FAQ booklet, counters in pouches for up to seven players and a single large D6, along with the full eight-section mapboard. This version sees the game revert back to the original Warlord with new rules to reflect over thirty years of play.&#10;&#10;Objective - to dominate the board and destroy opponents.&#10;&#10;Mechanics - similar to Risk, you get more armies for the more territories you hold. Allocation is on basis of territory held: city, industrial or agricultural.  Mountainous, waste, and sea spaces gain you no armies.&#10;&#10;Gaining territories through combat is an elegant use of cunning and bluff.  Instead of rolling dice, the attacker simply chooses with a single D6 how many pieces they wish to attack with (subject to restrictions based on terrain).  The D6 is then concealed and the defender attempts to guess it.  If they guess correctly the attacker loses that number of armies; if they guess wrongly one defender is lost, and if the territory is now left unoccupied the selected number of attacking pieces or greater are advanced into the territory to capture it.&#10;&#10;Alliances are allowed (and can be broken at will).&#10;&#10;A-bombs and the more devastating H-bombs are used in the game.  A-bombs are a reward for successful combat, and H-bombs are gained as a result of launching an A-bomb.  These can be placed to act as deterrents against other players, and can be launched to clear enemy territory prior to an advance.  Nuclear damage however will render map spaces impassable for the remainder of the game.&#10;&#10;",
        "artist": "Mike Hayes,Tony Roberts"
    },
    {
        "name": "Phase 10 Dice",
        "description": "You win the game by being first to get through the 10 Phases with the highest overall score.&#10;&#10;Six of the dice contain all the high numbers.  Each of these is numbered 5 through 10 in the four colours.  The other four dice contain the low numbers and the Wild (W) faces.  Each of these dice is numbered 1, 2, 3, 4, W, W in the four colours.&#10;&#10;In a turn, the player starts by rolling all ten dice.  The player may then set aside any dice he wishes to keep.  He makes a second roll with the remaining dice.  He may set aside some of these dice, adding them to those already set aside; he may also take back some of the dice previously set aside.  Then he makes a third and final roll, scores and ends his turn.&#10;&#10;Each phase specifies which dice are needed (sets, runs, flushes), so this is sort of sequential Yahtzee.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Arctic Front",
        "description": "Arctic Front: Battle for Norway:&#10;Arctic Front, the third game of the Third World War series, uses the same rules as its predecessors but presents a very different gaming situation.&#10;The Soviet Leningrad Front, with its special airborne, amphibious, and arctic-equipped contingents, assaults Norway, reinforced with a few elite units from the U.S., Britain, Canada, and other NATO nations.&#10;Norway presents a constricted front to offensive operations. Along the Soviet border, the relatively open terrain in conjunction with possible outflanking moves through Finnish Lappland allows a rapid Soviet advance. The rest of the Norwegian Arctic is mountainous and can be a formidable barrier if well defended. The Soviet player must make full use of his airmobile, airlanding, and marine forces to penetrate this region, while guarding against raids from U.S. marines and British commandos.&#10;The complex relations between the Soviet Union and the neutral Scandinavian nations - Finland and Sweden - has its effects in the game. Soviet forces may attempt to pass through the Finnish Arctic, and Finland may allow violation of its neutrality or offer limited or full resistance. Sweden will always defend its territory, but its effort may not be total. Also, Sweden may volunteer an expeditionary force to join NATO in Norway even if Sweden neutrality is not violated. Finally, the Soviet high command may mandate a general offensive in Scandinavia rather than just operations against Norway, providing additional forces from the strategic reserve for combat in Finland and Sweden.&#10;Additional rules allow Arctic Front to be combined and played with The Third World War and Southern Front, thus covering all the European war zones of the Third World War. Players can reinforce one front with forces from the others, requiring a host of new decisions on the strategic level. One or two new divisions or air units sent to Norway can turn the tide there for either side, but at what cost to the central or southern front, where every unit is desperately needed?&#10;&#10;Game Components:&#10;&#10;    240 die-cut counters&#10;    two 17&quot; x 22&quot; maps&#10;    one rules booklet&#10;    one briefing/background sheet &#10;    one set of game charts&#10;    two dice&#10;&#10;&#10;&#10;&#10;&#10;    Third World War series&#10;&#10;&#10;Microbadges&#10;&#10;&#10;      The Third World War fan - Mushroom Cloud&#10;&#10;&#10;",
        "artist": "Rich Banner,William H. Keith, Jr."
    },
    {
        "name": "Persian Gulf: Battle for the Middle East",
        "description": "Persian Gulf: Battle for the Middle East:&#10;Persian Gulf uses the same rules as the other games in the Third World War series to show a different aspect of modern warfare operations in the deserts and mountains of the middle east.&#10;Persian Gulf includes a special &quot;game within a game&quot;, covering the diplomatic, political, and military maneuvers by the Soviet Union and the United States in the Middle East before - and leading to - the general outbreak of the Third World War. Both sides try to gain control of the various Iranian factions and influence the other Middle Eastern nations. As the superpowers' confrontation continues, fighting breaks out between committed factions. Either side can decide to send troops to support their factions; the U.S. may send the Rapid Deployment Force while the Soviet Union may use its forces along its southern borders and in Afghanistan. Each move, however, escalates the conflict until the superpowers are directly fighting one another in the Middle East and their alliances in Europe are mobilizing for war.&#10;The four game maps cover the Persian Gulf region in detail. Centered on Iran and Iraq, the maps include bordering areas of Turkey, Saudi Arabia, the USSR, and Afghanistan. Mountains and sand dominate this area of the world, and wilderness rules show the effects of the scarcity of roads on military operations. &#10;Vying for control of the nations on these maps are the regional forces and those of the superpowers. These forces range greatly in capabilities: from the poorly-equipped and trained Iranian Revolutionary Guards and Soviet-controlled Afghan Army to the capable Turks to the elite Israeli and Jordanian intervention contingents. The Soviets have large forces available in their southern border regions and in Afghanistan. The small but strong U.S. RDF is on hand, and they can call on B-52 strikes for support.&#10;The rules cover the special political and military situations of the Middle East and the various Arab and Arab-Israeli rivalries are shown. Victory conditions take account of the oil resources of the Gulf. Additional rules allow Persian Gulf to be combined and played with the other three games in the Third World War series.&#10;&#10;Game Components:&#10;&#10;    360 die-cut counters&#10;    four 17&quot; x 22&quot;&#10;    one rules booklet&#10;    one briefing/background sheet &#10;    one set of game charts&#10;    one combined-game rules folder&#10;    two dice&#10;&#10;&#10;&#10;&#10;&#10;    Third World War series&#10;&#10;&#10;Microbadges&#10;&#10;&#10;      The Third World War fan - Mushroom Cloud&#10;&#10;&#10;",
        "artist": "Rich Banner,William H. Keith, Jr."
    },
    {
        "name": "Catch Phrase!",
        "description": "Quick, rattle off as many clues until somebody on your team yells the word or phrase you want to hear.  Get as physical as you want.  Gesture. Say anything you want.  Just keep talking.  And keep passing.  'Cause if the buzzer goes off while you're holding the disk, the other guys get the point in CATCH PHRASE... the fast-passing, fast-talking game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "18GA",
        "description": "18GA is a shorter 18xx game set in Georgia and designed by Mark Derrick. It is currently available as a free print-and-play game or as a partially assembled kit from John David Galt.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Code Name: Sector",
        "description": "The computer game of submarine pursuit&#10;&#10;     Use a real computer to track an unseen sub.&#10;     Be in command of the combat information center.&#10;     Plot you ship's course on a nautical chart.&#10;     Avoid costly collisions.&#10;     Aim and fire torpedoes at the sub.&#10;     Miss the target and the sub retaliates.&#10;&#10;&#10;&#10;&#10;The board game where you match wits with a computer&#10;&#10;Decades ago -- when computers were first developed -- a computer would cost over a million dollars and would fill an entire room.  Now, after extensive research with a leading electronics company, Parker Brothers brings you a powerful computer designed strictly for family fun.  The CODE NAME: SECTOR computer is capable of making thousands of calculations per second.  Its solid-state memory keeps track of players positions at all times.  And its logic circuitry instantly detects collisions, counter-attacks, misfires, and hits.  A combat information center contains all the controls needed to navigate within range of the sub and fire.  An electronic readout, made up of light-emitting diodes, automatically displays information supplied by the computer.  The computer works with you as you track down an enemy sub on a nautical chart.  Being the first to sink it isn't easy.  With over 3000 possible underwater locations, the sub is unlikely to be in the same place twice.&#10;&#10;&#10;     An electronic display provides players with complete combat information during the course of the game.&#10;     A ship's direction is shown on a lighted compass.&#10;     A steering capability allows players to change course from left or right to close in on the sub.&#10;     A pair of speed controls allow destroyers to travel at 9 different speeds.&#10;     An evasive sub option makes the game more challenging for experienced players.&#10;     A programmed learning sequence teaches the play quickly and easily.&#10;     A sonar control area is used to determine range information and to aim and fire torpedoes.&#10;&#10;&#10;The game comes complete with:&#10;&#10;     Computer console&#10;     Nautical playing/plotting surface&#10;     Marking crayons (4 total)&#10;     Crayon sharpener&#10;     Parallel rule&#10;     Replica submarines for scoring (8 total)&#10;     Reusable erasing cloth&#10;&#10;&#10;&#10;&#10;9 VOLT BATTERY NOT INCLUDED.  ALKALINE BATTERY RECOMMENDED FOR BEST RESULTS.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Winhard",
        "description": "With winter approaching, Winhard the squirrel and his bushy-tailed friends set out to collect a supply of nuts to tide them through the cold season. It's not always easy - many nuts are hollow and must be tossed into the wastebin. By the time the last gust of cold wind comes, heralding the onset of winter, the hidden food pantry should be well stocked with tasty nuts.&#10;&#10;",
        "artist": "Jürgen Martens"
    },
    {
        "name": "Pass the Pigs",
        "description": "This very portable beer &amp; pretzels game comes as a pocket travel case containing 2 pig dice, two pencils and a scoring booklet that also includes the scoring table. The pigs are actual pig miniatures, with a dot on their right flanks.&#10;&#10;The object is to be the first to score 100 points using &quot;pigs&quot; as dice. On your turn, you throw the pigs and hope they end up in a scoring position such as a &quot;snouter,&quot; &quot;trotter,&quot; or &quot;leaning jowler&quot; (ranging in value from 1 to 60 points); if they do, you decide whether to &quot;cash&quot; the points (pass the pigs to the next player) or to roll again. If you roll a non-scorer (&quot;pig out&quot; - one pig on the right flank, the other on the left flank; a fairly frequent result), you lose any as-yet-uncashed points. If you throw an &quot;oinker&quot; (both pigs touching each other), you lose your entire accumulated score. If you throw a &quot;piggyback&quot; (one pig on top of the other), you're altogether eliminated!&#10;&#10;The variant Hog Call rules allow the other players to risk predicting the outcome of the throw; if predicted successfully, the hog caller earns twice the value of the position *and* deducts that same amount from the roller's score!&#10;&#10;Schweinerei, the German edition, was released by Milton Bradley in 1984; Milton Bradley in 1996; Winning Moves Games (USA) Deutschland in 2001.&#10;&#10;Online Play&#10;&#10;&#10;    http://www.fontface.com/games/pigs/ (Java)&#10;&#10;&#10;Similar to:&#10;&#10;    Chicken Chit-Chat&#10;    Heave The Heffers&#10;    Tequila Pigs&#10;    Woof Woof&#10;    Bullies&#10;&#10;&#10;&#10;&#10;",
        "artist": "Design Edge,Steven Strumpf"
    },
    {
        "name": "Villa Paletti",
        "description": "From the rules:&#10;&#10;An architectural rush to the skies for 2 - 4 budding architects with a good head for heights from 8 years old.&#10;&#10;In the land where the Lemons bloom, there once lived a wise old sage, whose friends called him &quot;Paletti&quot; He only had one goal in life, to finish the wonderful castle in the sky that his grandfather had begun to build many years before, but which had been left unfinished when the ducats ran out. Paletti too had little money, but instead he had a marvelous plan. Why buy new columns when he could re-use the old ones that his Grandfather had built?  All he needed to do was remove some of those holding up the first floor, of which there were far too many in any case, and rebuild them further up, so that they could support new floors,  reaching up towards the skies!&#10;&#10;&quot;Excellent, Paletti&quot; shouted his friends, and they quickly started to work.  Soon they had a marvelous building in front of them, the &quot;Villa Paletti&quot;. Nowadays, no one knows what it was caused the collapse of the Vila Paletti, perhaps a puff of wind, or a slight earth tremor, but all the experts are united on one point, that Paletti,  far ahead of his time, was the first to discover something whose full importance is only now starting to become clear to us, the Euro pallet!&#10;&#10;Re-implemented by:&#10;&#10;    Palazzo Paletti&#10;&#10;&#10;&#10;&#10;",
        "artist": "Victor Boden"
    },
    {
        "name": "Jurassic Park III Island Survival Game",
        "description": "Based on the third movie, of course.  Besides the board, this time you have 7 cardboard character pawns, life chips (each character's &quot;hit points&quot;), cards, special dice and dinosaurs (our old friend T. Rex, three velociraptors, six pteranodons and two spinosaurus).&#10;&#10;The 30 cards are sorted into five piles: Jaw to Jaw, Raptor Rumble, Pteranodon Terror, Spino's Revenge and Race To The Rescue.  The dinosaurs (taxonomically, pteranodons aren't dinosaurs; they belong to a different order, the pterosaurs) start in designated places around the board, as do the humans except for little Eric (who appears as a result of a card draw).&#10;&#10;The object, for the humans, is to make it across the island to the exit (rescue spot); the dinosaurs try to prevent this, of course.  There will always be one dinosaur player, the other players sharing the humans.  Movement is die-based for both dinosaurs and humans.  One human moves at a time, but there is a die face that moves a group of up to 3 at once.  The dinosaurs are restricted to separate zones of the board and only act whilst humans are on their territory.  Like with the humans, only one dinosaur moves per turn, except that a die face allows *all* dinosaurs to move 1 space.  There are some board spaces usable only by humans and vice-versa.&#10;&#10;Combat is dice driven as well.  Pteranodons have a nasty tendency to snatch characters and bring them to their nests, where the character must escape or eventually be eaten.  Humans have the option of burning hit points to get extra turns -- a risky gamble.&#10;&#10;The humans win by reaching the far beach and drawing the WIN card from the Race To The Rescue deck.&#10;&#10;From the same film series:&#10;&#10;    Jurassic Park Game&#10;    The Lost World Jurassic Park Game&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Tank Battle",
        "description": "The object of this game (a distant relative of Stratego) is to destroy your opponent's six tanks before he does the same to you.  In addition to your tanks, you deploy an Ammo Dump, a Fuel Dump, your HQ and five Anti-Tank guns (which do not move).&#10;&#10;Your tanks are numbered but the opponent knows not which is which.  You also deploy (by writing their coordinates on a scrap of paper) two land mines.&#10;&#10;On a turn, you first plot secretly (using a peg board) where you think your opponent's tanks will end their move.  Once you're ready, he moves.  If you guessed correctly, the tanks are killed.  (You get six such shots each turn)  You also have five special shots which can be fired only once each --they may be added piecemeal during any turn.  You lose a special shot whenever you lose an AT gun.&#10;&#10;You have 6 moves each turn, no more than 3 per tank (unless down to two or fewer tanks).  Tanks can only go sideways or forward but those that reach the opponent's starting row are marked with a flag and can now move backward.&#10;&#10;Tanks attack each other by orthogonal proximity, in Stratego fashion (higher numbered tank wins).  Tanks attack AT guns using a spinner.  The installations are destroyed by being overrun.  Losing the HQ clears your mines; losing the Ammo Dump means you only use as many pegs as you have tanks remaining; losing the Fuel Dump reduces your movement points from six to four.  Tanks die if they end up on an enemy mine square.&#10;&#10;Remade in to Mission Command Land&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Valkenburg Castle",
        "description": "Valkenburg Castle is a fantasy game of adventure and combat in the depth of an ancient dungeon.  It was one of the Task Force Games Pocket Games.&#10;&#10;Players may use heroic leaders, fighting men, clever burglars and mysterious magic users to explore and eventually capture the castle from evil orcs, trolls, banshee and drogs.  It includes 5 scenarios and a campaign.&#10;&#10;",
        "artist": "Alvin Belflower,R. Vance Buck,Allen D. Eldridge"
    },
    {
        "name": "Gods",
        "description": "2001:  Limited edition tile laying game of gods competing for worshippers.  &#10;Printed on card stock and needs to be cut out.&#10;&#10;2005: Rereleased as a boxed, professionally printed version with slightly different rules.&#10;&#10;Online Play&#10;&#10;&#10;     http://www.boardgames-online.net (turn-based)&#10;     http://www.mabiweb.com/ (turn-based)&#10;&#10;&#10;Implementation of the 2005 edition rules.&#10;&#10;",
        "artist": "Hans-Jörg Brehm,Design/Main,Michael Schacht"
    },
    {
        "name": "Solitaire for Two",
        "description": "Solitaire for Two includes two games: one called Six-Suit Solitaire that was originally released as Indochine 2000, and a second titled Solitaire for Two that (despite the title) can be played with 2-4 players.&#10;&#10;Six-Suit Solitaire is a modified version of the solitaire game Klondike, with six suits in the game instead of four as well as three jokers (one in each color). As in Klondike, players try to remove all tiles from play by creating stacks from Ace to King, but unlike in Klondike players have an incentive to keep Aces in play rather than removing them; if a player has one Ace in play, then he can move Queens to empty columns in addition to Kings, and with two or more Aces in play he can also move Jacks to empty columns. A player can place only the rightmost tile in the &quot;talon&quot; &ndash; the row of exposed tiles from the stock &ndash; but if he cashes in a joker, he can move any tile in the talon to the rightmost position.&#10;&#10;Solitaire for Two plays similarly to Six-Suit Solitaire, but the players take turns drawing tiles from the stock &ndash; three at a time &ndash; and trying to place them in the layout and score as many tiles as possible. Players score points for each tile they lay off; for playing all three tiles drawn; for moving columns of five, seven, nine or eleven tiles; and for other specialized situations. The player with the highest score wins.&#10;&#10;",
        "artist": "Zane Quincy Kansil,Pixel Productions Inc."
    },
    {
        "name": "The Lord of the Rings Trading Card Game",
        "description": "A tradeable card game covering the events of the Lord of the Rings movies. Frodo and his companions journey from Bag End to the destruction of the Ring at Mount Doom. The coverage of the cards is largely loyal to the movies, but it does take some of its lore from the book, and make references to certain atmospheres within the book. Some card sets, such as the Expanded Middle Earth Draft collection, have actors playing roles that were not seen in the movie, replete with costume. This allows for Tom Bombadil and Ghan Buri Ghan (among others) to be considered part of the card game. Nonetheless, they are rare, and typically you feel as if you are playing the movie rather than the book.&#10;&#10;The game will be fairly familiar to veteran CCG players with a couple of important exceptions: firstly, combat is magic-like in execution but more incremental in resolution: each &quot;lost&quot; combat results in only a wound, not elimination as in Magic, L5R, Star Wars, or most other CCGs. Each character can suffer a limited number of wounds before being eliminated, but this &quot;health&quot; rating is also expended for card special actions - there is no &quot;tapping&quot;. Also importantly, this is not a &quot;draw one&quot; game but a &quot;hand-filling&quot; game, which results in a very different dynamic. Lastly, like ICEs Middle-Earth CCG that came before, cards are either &quot;hero&quot; or &quot;shadow&quot; cards; when you play Free Peoples cards in your turn, you effectively pay their cost in Twilight Points to your opponent, who then turns around and uses those points to play Shadow Cards to attack you.&#10;&#10;As a final comment, Decipher finally saw the light and put a 4-card cap on every card during deck building (and this includes variations; so there is an Aragorn: Ranger of the North and an Aragorn: King in Exile; you can only have total of 4 combined). Additionally, there is a much more sane rarity distribution than previous Decipher products (many - in fact most - familiar characters are common or uncommon, or at least have common or uncommon variations that are no less powerful than the rare versions).&#10;&#10;This game &quot;ended&quot; when Decipher ran into financial difficulties and let the license expire.  The following sets were released:&#10;&#10;1 Fellowship of the Ring&#10;2 Mines of Moria&#10;3 Realms of the Elf-Lords&#10;4 The Two Towers&#10;5 Battle of Helm's Deep&#10;6 Ents of Fangorn&#10;7 Return of the King&#10;8 Siege of Gondor&#10;9 Reflections&#10;10 Mount Doom&#10;11 Shadows (Starting with this Set, Minion Cultures were re-formatted)&#10;12 Black Rider&#10;13 Bloodlines&#10;14 Expanded Middle Earth&#10;15 The Hunters&#10;16 Wraith Collection&#10;17 Rise of Saruman&#10;18 Treachery and Deceit&#10;19 Ages' End&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Compatibility",
        "description": "Play is in teams of two. Each person has a deck of picture cards. Each deck has the same set of pictures. There is also a deck of word cards with words like &quot;marriage&quot;, &quot;de facto&quot;, and &quot;pimple&quot;.&#10;&#10;A word is chosen and each player chooses 2-5 cards from his/her deck. Teams score points for choosing the same pictures, and score extra points for putting the pictures in the same order (from most to least important).&#10;&#10;The board is used to keep track of the score, and to dictate how many pictures a team may select. First team to the end wins.&#10;&#10;Re-implemented by:&#10;&#10;    Compatibility 15th Anniversary Edition&#10;&#10;&#10;&#10;&#10;",
        "artist": "Stéphane Gantiez,Stivo,Alexandra Violet"
    },
    {
        "name": "King Oil",
        "description": "This MB game comes with a plastic &quot;board&quot;.  Its size is dictated by the three randomizing discs embedded in its base, which are used to generate a new playing area every time (there are 1,728 (12^3) different setups possible).&#10;&#10;You buy properties, drill for oil, link properties with pipelines so as to collect royalties and try to be the richest player.  Event cards complicate matters.  Drilling is resolved with a little rig whose plunger is pushed up if it doesn't go through the hidden disc; if it pushes through all three, the well is dry.  Deeper holes cost more, of course.&#10;&#10;Pipelines can be bought once you have 4 producing oil wells on a property; they reach across that property's boundary to another player's property, and are used to siphon royalties from him every turn.  This is a clever mechanic that accelerates bankruptcy and keeps total playing time within reasonable limits.&#10;&#10;Once all players but one are pushed into bankruptcy, the remaining one is the winner.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Kardinal & König: Das Kartenspiel",
        "description": "Kardinal &amp; K&ouml;nig - Das Kartenspiel is the card game based on the &quot;Kardinal &amp; K&ouml;nig&quot; boardgame from Goldsieber Spiele (also issued as &quot;Web of Power&quot; by Rio Grande Games).  &#10;  &#10;Idea of the game  &#10;Europe, the center of power in the 12th century. Influential Orders struggle for supremacy. By collecting Land cards, you can establish cloisters, bring advisors to council meetings, and improve your network of roads.  According to which cards you choose, you can earn different amounts of victory points. At the end of the game, the player with the most victory points wins.&#10;&#10;Rereleased by Ravensburger with different rules as the two player game Richelieu.&#10;&#10;",
        "artist": "Hans-Jörg Brehm,Michael Schacht"
    },
    {
        "name": "The HellGame",
        "description": "The latest in Infernal Entertainment.&#10;&#10;The HellGame is a board game of diplomacy and intrigue among the daemons of Hell. Each player assumes the role of a triumvirate of daemons on a quest for power and notoriety and the winner is the first player to claim control of one of Hell&rsquo;s circles and have his claim recognized as just by Lucifer Morningstar, Ruler of Hell.&#10;&#10;The HellGame can be played by two to six players and takes between two and four hours to play. It has been described as a cross between Diplomacy and Magic as it uses board and counters to show how the struggle for Hell&rsquo;s Circles rages back and forth, while cards are used for such things as spells and dirty tricks.&#10;&#10;The HellGame is wicked fun and will bring out the best and worst in the players. It will feature stunning graphics as well as the most bewildering cast of characters and creatures ever seen in a board game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "18AL",
        "description": "18AL is a shorter 18xx game set in Alabama and designed by Mark Derrick.  It is currently available as a free print-and-play game from John David Galt.&#10;&#10;6 Companies&#10;&#10;     ABC - Atlanta, Birmingham and Coast Railroad&#10;     ATN - Alabama, Tennessee and Northern Railroad&#10;     L&amp;N - Louisville and Nashville Railroad&#10;     M&amp;O - Mobile and Ohio Railroad&#10;     TAG - Tennessee, Alabama and Georgia Railway&#10;     WRA - Western Railway of Alabama&#10;&#10;&#10;&#10;&#10;5 Private Companies&#10;&#10;     Tuscumbia Railway&#10;     South and North Alabama Railroad (coal field token)&#10;     Brown and Sons Lumber Company (lumber terminal tile)&#10;     Memphis and Charleston Railroad (train name chits)&#10;     New Decatur Yards (half-price train purchase)&#10;&#10;&#10;&#10;&#10;",
        "artist": "Mark Derrick,John David Galt,Cory Williamson"
    },
    {
        "name": "Intruder",
        "description": "&quot;IT'S LOOSE!!!&quot;&#10;&quot;Lab, this is command. WHAT'S loose?&quot;&#10;&quot;It broke out of the lab! It killed Jones!&quot;&#10;&quot;What is it? WHAT killed Jones?&quot;&#10;&quot;I don't know, but it's headed your way!&quot;&#10;&#10;The Intruder is an alien being of unknown power. During the course of the game the Intruder will move through the space station as both the hunter and the hunted. One or more players must cope with a monster that moves rapidly and changes continuously as it undergoes metamorphosis into a more powerful being, and possibly divides into two or more clones.&#10;&#10;The game includes 54 multi-color die-cut playing pieces representing the crew and their weapons, lab animals (which confuse the search) and the Intruder. The playing map shows in detail the interior of deep space station 'Prometheus'. The map also contains special charts to record the development of the Intruder.&#10;&#10;Intruder is an exciting game of terror and suspense for one, two, or more players.&#10;&#10;Task Force Games Pocket Game #6&#10;&#10;Reimplemented as Hidden Intruder -- same design but with improved graphics and modern manufacturing methods.&#10;&#10;",
        "artist": "Alvin Belflower,R. Vance Buck,Stephen V. Cole,Allen D. Eldridge,Gary Simpson"
    },
    {
        "name": "Das Pferd von Troja",
        "description": "from the translation:&#10;&#10;Just as in the ancient saga of the Trojan War, brave Greek heroes hide in the belly of a gigantic horse. The playing figures slip into the horse from above and leave it from below, in order to occupy the individual districts of Troy. Cunning and malice in dealing with the Trojan Horse lead to victory - in the mythical story as well as in this game!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Poisson d'Avril",
        "description": "Don't Panic&#10;&#10;East German game of Wizardry and Magic. Uses simultaneous action, dynamic tension, spells, special powers, line-of-sight and hidden identities in a peculiar mix that defies description but inspires awe in those who've experienced it. Feige Spiele's warehouse burnt down in early 1983, just before distribution of Willi Sonderling's masterpiece was to be shipped. Only a handful of reviewer copies survived.&#10;&#10;Shortly thereafter there was a very small print run (fewer than a couple hundred) of the German version, das Verschwinden.  In the mid to late 80s, the Starducks promotional version was released in certain regions of the United States.  (The Starducks version was released in two parts - a base game and expansion - but both parts are really needed to play the game.)&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Ramses II",
        "description": "The immensely rich but unfortunately somewhat scatter-brained Pharaoh had, during his life, collected treasures from throughout his kingdom.  He decided to hide them in his pyramid to prevent then from being stolen.  Unfortunately he is no longer sure where he has buried what.  With luck you will be able to help him find his treasure again. The player that finds the most of the Pharaoh's treasures and thereby collects the greatest number of search cards is the winner.&#10;&#10;After chips have placed in the game board, pyramids placed on top and the board spun around a few times in the hopes the players won&rsquo;t know where treasure chips are located, the first player chooses a treasure card which assigns the number or points that the treasure will be worth would the player find it. The treasure cards have been separated into three piles marked 1, 2 and 3. Once pile 1 is exhausted, game continues with pile 2, etc. Then the player slides a pyramid into an empty space on the board. If no treasure chip is found, the player moves another pyramid. If the chip does not match his card, their turn is over. If the treasure is found, the player keeps the treasure card but the token stays where it is.&#10;&#10;Mixed in with the treasure cards are event cards as follows:&#10;&#10;Sandstorm: Turn the board through 180 degrees and take the next pile from the card.&#10;&#10;Gift: Move to one of the twelve treasures.  Each player that has one or more search cards depicting this treasure must give you one of them.&#10;&#10;Risk: Nominate two treasures that are not currently displayed on the board.  Move first to one and then to the other.  If you succeed - well done!  If you don't then you must give one of your opponents' one of your search cards.&#10;&#10;Mirage: You draw a search card from your right hand neighbor's collection.  If you are able to move to this treasure without making a mistake then you may keep the card.  If you do not manage it then you must give your right hand neighbor one of your cards.&#10;&#10;Desert Poker: A player of you choice must try to find a treasure that you nominate.  If he succeeds then he can take one of your search cards.  If he fails then you can take one of his.&#10;&#10;End Game: The Pharaoh is happy because all the treasure has been found.  As soon as this (Pile 3 only) card is turned over the game ends and the players total up the points that are shown on their search cards.&#10;&#10;After each player has found a treasure the board is rotated through 90 degrees in a chosen direction.&#10;&#10;Once all the search cards from the second pile are used up then pile &quot;3&quot; is used.  In this final round all the treasures on the search cards are worth 4 points and anyone who has not yet been particularly successful can, with brains and luck, overtake all the others.&#10;&#10;When a player finds a treasure chip that is not the one that he was looking for he is out of the game.  The remaining players continue.  Play continues until all the players are eliminated or the End Game Card is turned over.&#10;&#10;All the players total up the points that they have showing on the search cards they have collected.  The player with the greatest number of points is the winner.&#10;&#10;",
        "artist": "IDL,Walter Pepperle,Peter Rauter"
    },
    {
        "name": "Dog",
        "description": "Dog has similarities to the Pachisi / Sorry! family of games, but with a few noticeable twists. The game mechanics is similar to TAC, Super Tock 4, Super Tock 6, Tock 6, and Super Tock 8.&#10;&#10;The object of the game is to move your tokens from home to the target area as quickly as possible, moving them in a clockwise direction along the course according to the value of the cards. Whichever team first places all eight of its tokens in the target area wins.&#10;&#10;The first twist in Dog is that play is based on a hand of cards held by each player, with the start player and the quantity of cards cycling on successive hands from six cards to two, then resetting to five, then progressing back to two. Card values range from 1-13, with a number of special actions represented.&#10;&#10;The second twist is that Dog is a partnership game, with the players winning or losing as a team, which adds a significant level of strategy and tactics to the game. Partners trade one card at the beginning of each round, and once one player from a partnership has completed his group, his plays now assist his partner.&#10;&#10;Compact Dog is a travel version of Dog that's limited to four players instead of allowing for play with either four or six players, as in the full game.&#10;&#10;Dog shares many similarities with Partners, which can be described as a simplified version of Dog.&#10;&#10;",
        "artist": "Dennis Lohausen,Renate Matthews,Markus Zuber"
    },
    {
        "name": "Rome At War I: Hannibal at Bay",
        "description": "First game in the Rome at War series.&#10;&#10;Tactical wargame of moderate complexity that focuses on Hannibal (Carthage) versus Rome. Units are rated for combat strength and morale. Rules cover cavalry, elephants, facing, assaults, missile fire, legion/phalanx movement, and recovery. Activation system for leaders. Generally need a 6 roll to score hits. Small map (which is mounted) is not hex based, but divided into numbered areas. Five scenarios (historical commentary included) are provided; all can be completed in an hour or less. Excellent graphics.&#10;&#10;",
        "artist": "Brien J. Miller,Guy Riessen"
    },
    {
        "name": "Clash of Giants",
        "description": "Two game set covering pivotal World War One battles of Tannenberg and The Marne.&#10;&#10;Low-complexity for a wargame. Player's units are grouped into armies which have variable movement rates (based on a die roll) each turn. Units are rated for strength and efficiency. Special rules for artillery, supply, victory point hexes, fortified zones, forts, and strategic movement.&#10;&#10;Rated very high for solitaire play.&#10;&#10;Nominee for the 2001 Charles S. Roberts awards for Best Pre-World War II Boardgame (Charles S. Roberts Awards).&#10;&#10;The series is continued in Clash of Giants II.&#10;&#10;",
        "artist": "Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "Panzer Leader",
        "description": "(from the back of the box: )&#10;&#10;Panzer Leader lets you re-create all of the fast, furious action of tactical armored combat on the western front during World War II.  Rules of play consider aspects of tactical armored warfare such as gun ranges, target elevation, indirect artillery fire, fortifications, roadblocks, minefields, close air support, naval support fire, engineer demolition, and opportunity fire.&quot;&#10;&#10;Avalon Hill Complexity Rating - 7&#10;&#10;Sister game to PanzerBlitz and The Arab Israeli Wars.&#10;&#10;&#10;Components&#10;&#10;      384 (including 7 blanks) British, US, and German counters&#10;      4 geomorphic boards&#10;      20 scenarios&#10;      Terrain Effects Chart (two-sided)&#10;      Combat Results Chart&#10;      Rules of Play and Designer's Notes booklet&#10;      1 six-sided die&#10;&#10;&#10;&#10;&#10;",
        "artist": "W. Scott Moores,Randall C. Reed"
    },
    {
        "name": "Babylon 5 Collectible Card Game",
        "description": "Based on J. Michael Straczynski's popular SF series (including the short-lived spin-off, &quot;Crusade&quot;), this CCG with a story-telling flavor deserves its fan following. Precedence lost the rights from Warner Brothers and Crusade was their final expansion set; the game was produced from 1997 until 2001 and is still supported by numerous fan web sites.&#10;&#10;The Babylon 5 CCG is for two to five players (or more, using the alternate faction rules). Each player chooses a different Race (Narn, Centauri, Minbari, Human, etc.) and is in control of the ambassador of this race. With this ambassador you will build a Faction, then set an Agenda for your Faction to pursue. By fulfilling your Faction's Agenda and accumulating Power, you will lead your race to a position of dominance and win the game. You may recruit allies (character cards) from among the other races, or try to rely only on your own people.&#10;&#10;Will you use diplomacy, intrigue or military conquest as your stepping stones to power? Will you rise to dominance on your own merits, or will you seek the aid of an elder race, like the Shadows? If you do, beware, for there may be a price! Choose your actions wisely Your decisions decide the fate of the Galaxy.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Barbarian, Kingdom & Empire",
        "description": "Players represent barbarian hordes who sweep down from the steppes to overwhelm the remnants of the Roman Empire and then build strong expansionistic kingdoms among the ruins.  These kingdoms grow into empires which become rich, corrupt, and the target of new waves of barbarian invaders.  Being defeated is not the end of the game, as players may return to the fringes of civilization to amass a new horde of Huns or Germans.  The unique play mechanism allows players to enter or exit at any time without disrupting the play or the victory conditions.  Players may create their own history or play one of the many included historical scenarios set in the ancient and early medieval Mediterranean world.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Prize Property",
        "description": "This is a game of land development and litigation.  Each player is assigned an area of the board, containing three land sections and building lots of different colours (red, yellow, orange or blue).  The object of the game is to be the first to build all of your nine buildings.&#10;&#10;On your turn, you gamble for income.  The income die is rolled; if it comes up on its red dot face, you don't get any money.  Otherwise, you get the amount indicated and may roll again --but if you roll the red dot, you lose any income for the turn!  Income is doubled once you've completed all three buildings of one of your land sections, tripled once you've completed two sections.&#10;&#10;Next, you draw an Opportunity card and resolve it.  You may buy a Town Meeting card; these cards are either Legal Action or Defence cards (this is kept secret until used).  Finally, you may improve a property (from its undeveloped state), or build a resort on it (once improved) --if you have the money.  The properties have varying degrees of risk associated with them (the Opportunity cards) and consequently varying building costs.&#10;&#10;When you complete a building, the other players may play Legal Action cards (up to five), each of which places a red marble in the gavel device.  You automatically get a green marble, and may add up to four more by using your Defence cards.  The gavel is then shaken and then held up so marbles roll into the handle; a window at the handle's end reveals who won.  If the opponents win, the builder does not get his building (and has lost the money) and the opponents get money from the bank for their trouble.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Spider Wars",
        "description": "This abstract game cleverly exploits its theme of warring spiders to introduce children to thinking games.  The board represents a web with two nests at opposite ends, and stands up between the players.  Each player uses his side of the board to move his spiders on (three small ones and a large one).  Each spider has two long flexible legs with which it steps over the web; each leg ends in a peg which fits into holes in the web.  The catch is that if you insert your peg in a hole occupied by an opponent's spider, it pushes his peg out.  A spider hanging by only one leg is a &quot;dangler&quot; and is in danger of being pushed off the web altogether (and out of the game) should the opponent push its other leg out.  Re-attaching a dangler uses up one's entire turn.&#10;&#10;The object of the game is either to eliminate all of the opponent's spiders or put a leg in his nest.&#10;&#10;On your turn, you move two different legs, belonging to the same or two different spiders.  The small spiders' leg span confines them to adjacent holes.  The big spider, the Daddy Long Leg, has a greater span and can use holes two spaces apart.  A move consist of detaching a leg, pivoting around the other, and plugging the free leg back in.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Power Grid",
        "description": "Power Grid is the updated release of the Friedemann Friese crayon game Funkenschlag. It removes the crayon aspect from network building in the original edition, while retaining the fluctuating commodities market like Crude: The Oil Game and an auction round intensity reminiscent of The Princes of Florence.&#10;&#10;The objective of Power Grid is to supply the most cities with power when someone's network gains a predetermined size.  In this new edition, players mark pre-existing routes between cities for connection, and then bid against each other to purchase the power plants that they use to power their cities.&#10;&#10;However, as plants are purchased, newer, more efficient plants become available, so by merely purchasing, you're potentially allowing others access to superior equipment.&#10;&#10;Additionally, players must acquire the raw materials (coal, oil, garbage, and uranium) needed to power said plants (except for the 'renewable' windfarm/ solar plants, which require no fuel), making it a constant struggle to upgrade your plants for maximum efficiency while still retaining enough wealth to quickly expand your network to get the cheapest routes.&#10;&#10;Power Grid FAQ - Please read this before posting a rules question!  Many questions are asked over and over in the forums... If you have a question about a specific expansion, please check the rules forum or FAQ for that particular expansion.&#10;&#10;",
        "artist": "Antonio Dessi,Lars-Arne \"Maura\" Kalusky,Prapach Lapamnuaysap,Harald Lieske"
    },
    {
        "name": "Wise and Otherwise",
        "description": "Aptly described as Confucius plays Balderdash.&#10;&#10;One player is designated as the Reader each round. That player reads the first part of an old saying or proverb to the group, and states the country of origin for that proverb. The remaining players must secretly write an ending for the proverb and pass it to the Reader, who collects all possible endings.&#10;&#10;The Reader shuffles the submissions, and then reads each ending aloud for the group.  Players must then vote for the ending they think is authentic. A player gets 2 points for each vote that their submission receives, and an additional 2 points if they vote for the correct ending. If no player votes for the real ending then the Reader is awarded 3 points.&#10;&#10;Once a player has earned 20 points, the game is over. If there is no winner at the end of a round, then the next player becomes the Reader and this process repeats.&#10;&#10;&quot;All the Wit of the World... is Not in One Head&quot;&#10;&#10;With 2500 sayings from across the world, creative wordplay and careful use of dialect are just as important in this game as the metaphors that you create.&#10;&#10;&quot;The Beginning is... Half the Whole&quot;&#10;&#10;Below are a few sample proverbs from one of the cards in the game.&#10;&#10;    There's an old Tibetan saying: &quot;It is no use trying to tug a...&quot;&#10;    There's an old Zambian saying: &quot;A small thing is not noticed...&quot;&#10;    There's an old Dutch saying: &quot;For the sake of the grease the cat licks...&quot;&#10;    There's an old English saying: &quot;Cheese and money should always...&quot;&#10;    There's an old Croatian saying: &quot;Those who eat porridge...&quot;&#10;&#10;&#10;&#10;&#10;Only the first half of the proverb is shown here - if you want to find out how the proverb ends, you'll have to play the game!&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "Survive: Escape from Atlantis!",
        "description": "Survive is a cutthroat game where players seek to evacuate their pieces from an island that is breaking up, while remembering where their highest-valued pieces are located to maximize their score.&#10;&#10;An island made up of 40 hex-tiles is slowly sinking into the ocean (as the tiles are removed from the board). Each player controls ten people (valued from 1 to 6) that they try and move towards the safety of the surrounding islands before the main island finally blows up. Players can either swim or use boats to travel but must avoid sea serpents, whales and sharks on their way to safety.&#10;&#10;Survive is very similar to Escape from Atlantis with some key differences.&#10;&#10;Survive was reprinted as &quot;Survive: Escape from Atlantis!&quot; by publisher Stronghold Games and hit store shelves in February, 2011.   The reprint contains the game Survive, as well as all the extra pieces needed in order to play the game as &quot;Escape from Atlantis&quot;.&#10;&#10;&quot;Survive: Escape from Atlantis!&quot; is game #2 in the Stronghold Games &quot;Survivi Line&quot;.&#10;&#10;Expanded by:&#10;&#10;    Survive!: The Giant Squid&#10;    Survive: Escape from Atlantis! 5-6 Player Mini Expansion&#10;    Survive: Escape from Atlantis! Dolphins & Dive Dice Mini Extension&#10;&#10;&#10;&#10;&#10;",
        "artist": "David Ausloos,Jean Brice Dugait"
    }
]