[
    {
        "name": "Deadlands: Doomtown Range Wars",
        "description": "Doomtown: Range Wars is a customizable disc game.  Each of the boxed sets contains 8 sheets of die-cut discs which may contain an assortment of combat markers, weapons and ammo, spells, cowboys, supernatural adversaries, terrain, buildings, and more. The starter set also includes a rulebook, and everything needed to play.  These sets were produced in 2000 by Fantasy Flight Games, and are set in the Deadlands game world of the wild west (but there are other themes that use the same disc mechanism).&#10;&#10;This game uses full-color illustrated discs to represent the cowboys, supernatural beings, buildings, and other accessories used in the game.  The discs are used to wage gunfights and large-scale western battles.  The discs each have game stats such as: pistol/rifle skill, hand-to-hand combat, movement, leadership, wounds, and special abilities which can help or hinder combat. This game is similar in style to many military wargames, except that the counters are much larger (1.5 to 4 inches in diameter!), allowing for amazing full-color unit illustrations, and detailed special abilities like those seen in fantasy card games.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Shipwrecked",
        "description": "You are Shipwrecked... to survive, you must compete head-to-head in a bid for food, shelter, water, and friends. These entertaining contests require strategy, intuition, and nerve to determine who survives and who doesn't.&#10;   &#10;This is an auction bidding game. Each round, the lead off player flips over a card from the deck which will then be auctioned off. There are also Hidden Resource cards in the deck. When one comes up, players bid for the next card in the deck without knowing what it is!  Each player has 6 bid markers: 3 Pass, 2 Stop, and 1 Strike. Each round of each auction, a player must place one of these markers face down. The first round, the markers are placed in the '5 position'. This means if the auction is stopped at this position, the winner pays 5 for the item. If no one stops the auction, players place a marker in the '4 position'. Once again, if the auction is stopped, the winner pays 4 for the item. These rounds continue until the auction is stopped, or until the auction moved to the last '0 position'. Once the auction for that item is complete, the deck passes to the next player. Each time the deck comes to a player, he collects income as listed on each item card he owns. He may then choose to place an item sold back to the bank up for auction, or draw one from the deck to be auctioned. One thing that makes Shipwrecked stand out from other auction games is that you can't 'not bid'. You must participate in the auction, even if you really don't want the item.&#10;&#10;",
        "artist": "John Kovalic"
    },
    {
        "name": "Bosworth",
        "description": "Bosworth is essentially a chess variant for up to 4 players.  The pieces are the same as chess (8 pawns, 2 knights, 2 rooks, 2 bishops, a king, and a queen), but they are represented as disks so that they can be drawn randomly from a pile.&#10;&#10;Players begin the game with 4 pawns in their edge of the board or &quot;field camps&quot; and four pieces from their draw pile as their hand.&#10;&#10;On each turn, a player must move or capture with one piece, fill empty spaces in their field camp with a piece from their hand, and then draw to bring their hand up to four pieces.&#10;&#10;Pieces move and capture just like in chess, except for pawns, which can move sideways and capture in any diagonal direction, and kings, which can capture their own pieces to escape check.  As in chess, the object is to checkmate all opponent's kings.&#10;&#10;Online Play&#10;&#10;&#10;     GameTable Online (real-time)&#10;&#10;&#10;",
        "artist": "John Kovalic"
    },
    {
        "name": "Pirate's Plunder",
        "description": "Pirate's Plunder is a card and dice game in which players take on the roles of pirates and engage in a life of swashbuckling adventure on the high seas.&#10;&#10;The game is played in turns.  At the start of the game, each player starts off in a lifeboat.  They have to steal a pirate ship (based on the result of a dice roll), otherwise, they are stuck in the lifeboat and have to skip their turn.  When they have a ship, players draw Playing Cards into their hand.  These cards offer maps for treasures, events to modify a pirate's guns and crews, and other ways to bend the rules of the game.&#10;&#10;A pirate's score is reflected by his treasure, which comes from the wealth-laden ships, loot, and hostages in the form of Treasure Cards.  These cards are drawn from their deck when a pirate plays a map in hand, or by making a successful &quot;Sail Ho!&quot; dice roll during their turn.  Pirates can bury their treasure to keep them safe, although they have to dig it up for it to be counted as score.&#10;&#10;Some Treasure Cards, however, are perils in the forms of deadly pirates (such as Blackbeard) and naval warships.  Players can play perils on fellow pirates, forcing them to engage in combat.  Players can also engage other players in battle as well during a successful &quot;Sail Ho!&quot; dice roll if they choose to do so instead of drawing Treasure Cards.  Such battles are resolved by comparing dice rolls, which are added to the player's number of guns or crew.  The loser's ship is sunk and the player has to start his or her subsequent turns in a lifeboat.  The winner also takes the loser's unburied treasure.&#10;&#10;The game ends when a pirate has 3,000 or more pieces of eight worth of unburied treasure and makes a successful dice roll to &quot;Sail Home&quot;, thus becoming the winner.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Mystick Domination",
        "description": "From user review:&#10;&#10;In Mystick, players become &quot;Mysticks&quot;, powerful beings who must compete for the domination of the physical world by using the magic of their Tarot to manipulate, deceive, and destroy the pawns of Earth. To succeed, a Mystick must control the most power or be the last Mystick capable of wielding the magic of her Tarot.&#10;&#10;Integrates with:&#10;&#10;     Mystick Companion&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Vox Populi",
        "description": "Players are Arena-Fight managers who compete for the job of Overall Arena-Fight manager in Rome. They can get this job by supporting the right candidate for becoming Emperor.&#10;&#10;Organizing Gladiator fights and entertaining the crowd will win the players money and the candidate they support Popularity Points. Whether a fight was a commercial success or not depends on the supporters of the Gladiator teams,  because they get to vote after each fight (thumbs up or down) and losing supporters/gladiators will be ejected from the game.&#10;&#10;Colorful counters, good subject, eventful and interactive game.&#10;&#10;",
        "artist": "Pascal Bernard,Jean-Paul Krassinsky"
    },
    {
        "name": "Thieves of Bagdad",
        "description": "Players assume the roles of the famous Arabian characters like Sinbad and Scheherezade and try to move merchants, assassins, magi etc through the bazaar. By accumulating resource cards and selling them, players get more merchants, move them around, driving out lower ranking people and buying gems. The aim is to reach the palace with a diamond in your pocket, and pass it to the Vizier.&#10;&#10;But the rules allow several winning conditions and players can even steal from your bag of gems, making you buy fake gems to protect your diamond. The different roles make the resources have different values, so Scheherazade prefers silks to weapons, but Sinbad values weapons more.&#10;&#10;",
        "artist": "Greg Cervall,Thierry Masson,Thierry Ségur"
    },
    {
        "name": "Fairy Meat",
        "description": "Fairy Meat is Kenzer &amp; Company's acclaimed actual-size miniatures wargame of cannibal fairy combat. The once peaceful fairy folk have become addicted to fairy flesh, and their world has plummeted into violent anarchy. Players control a warband of bloodthirsty fairies, hunting and killing for the flesh and blood of their own kin.&#10;&#10;Fairy Meat is a very multi-player game, for two or more mature gamers who want something different. The full-color rulebook includes cardstock fairy status cards, counters, and stand-up fairy miniatures; a deck of cards and a ruler are all that's required for a lifetime of fairy-butchering fun!&#10;&#10;Expanded by:&#10;&#10;    Fairy Meat: Clockwork Stomp&#10;    Fairy Meat: Sugar and Vice&#10;    Fairy Meat: Wicked Things&#10;    Fairy Meat: WAR&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Zero",
        "description": "How low can you go? In Zero, you want to score as few points as possible, but to do that you need to collect the right cards in hand.&#10;&#10;The deck consists of 56 cards, with cards numbered 1-8 in seven colors. Each player starts with nine cards in hand, and five, seven or nine cards start face-up on the table depending on the number of players. On a turn, you either knock on the table to pass or you swap one card in hand for one card on the table. After the second knock, whether from the same player or a different one, all players other than the second knocker have one final chance to swap, after which they reveal and score their hands. If you have five or more cards of the same color or number in hand, then those cards score 0 points. For each other number you have, no matter how many copies, you score points equal to that card's value. Thus, having one to four 7s in hand is worth 7 points.&#10;&#10;If, however, you manage to collect both five cards of a color and five cards of a number in hand (with one card fitting in both sets), then you can declare &quot;Zero!&quot; and end the round immediately, with everyone else scoring points as usual.&#10;&#10;After a number of rounds equal to the number of players, whoever has the lowest score wins!&#10;&#10;",
        "artist": "Ernst Solèr"
    },
    {
        "name": "Shit!",
        "description": "It is a game where everyone simultaneously plays a unique number face down card a la 6 nimmt! (6 Nimmt).&#10;&#10;There are 5 suits arranged in a circular pattern. The idea is you score the points based on the first person to hit their number traveling clockwise after the current number, e.g. if the colors are Green, Blue, Red, Yellow, Orange, Green, Blue, etc. and the current target card is Orange 6, then the first number after orange 6 wins a number of points equal to the interval. For example, orange 7 would win 1 point, but if it were not there and Green 1 were next closest, it would win 5 points. If the next closest card were orange 5 (unlikely but possible), it would score 49 points.&#10;&#10;Each player also always has in hand a Shit! card which cannot score, but playing it is the only way to get another card in hand. Strategy comes from watching when people play cards and how many they have left. Time it right and you can play while everyone else is drawing for monster points.&#10;&#10;It's a fun 20 minutes. The rules are in English.&#10;&#10;",
        "artist": "Jürgen Martens"
    },
    {
        "name": "Castle",
        "description": "Bruno Faidutti revisits the medieval setting of Ohne Furcht und Adel with the card game Castle. Players are given a set of square cards which are to be played onto the table, which has a cardboard castle battlement layout. Cards are played into one of four regions: in the courtyard, on the battlements, on the towers, or outside the castle. And when played, the cards will usually allow you to take some sort of special action, which is unique to the card you played. The first player to rid himself of all his cards wins, which can be a tricky proposition at best.&#10;&#10;A winner of the 2000 Concours International de Cr&#195;&#169;ateurs de Jeux de Soci&#195;&#169;t&#195;&#169;.&#10;&#10;",
        "artist": "Emmanuel Roudier"
    },
    {
        "name": "Münchhausen",
        "description": "A pure bluffing game. Each player gets a set of cards numbered 1 to 8 and a playing mat, which goes in front of him or her. The starting player is the Baron and the other players in turn offer him a card face down from their hand, stating the value. Each player must offer an equal or higher value card than the last and the Baron must take the highest card offered or choose between equal offers. The Baron must then decide to Accept or Reject the offer. If he accepts, the Baron puts the card face down on his mat and the turn passes to the next player. But if the Baron decides the player was lying and Rejects the offer, he turns the card over. If the offer was False, the player takes it back to their hand and the Baron gets to dump one of his cards onto his mat. But if it was True, The Baron must take the card into his hand and the player dumps a card face down. When a player's hand is empty, the game is over and you total the value of the cards on your mat, subtracting any left in your hand. Highest score wins. A simple game of pure bluff, it works incredibly well. Very funny and requires some thought. Baron Muenchausen is a famous character from German folklore, a notorious liar who lived a fantastical life. The game mats show illustrations and stories from his life in German, but this has nothing to do with the actual game play and non-German readers can play the game easily.&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Riffifi",
        "description": "From session report:&#10;A card game. The deck consists of five  different colored sets of cards, each set numbered 1 - 8. There are  also five matching sets of wooden disks, 10 of each color.&#10;&#10;The cards are dealt out equally to the players and they alternate playing one card face-up to the table. Unlike a trick-taking game, there is no need to follow suit; players may play any card they desire. If a player lays a card of the same color and a LOWER value as a previously laid card that round, the higher card is turned over and is out of play. When play returns to a player who still has his card face-up in front of him, he collects a number of chips from the stockpile which matches the number and color of the card he played. If his card is face-down, however, he does not collect any chips. In either case, he plays another card and the cycle continues until the players have played all of their cards.&#10;&#10;When collecting chips, if the stockpile of a certain color is depleted, the player then steals the required number and color of chips from the opponent who currently possesses the most chips of that color. Thus, each player's collection of chips is constantly in danger of being confiscated by their opponents.&#10;&#10;The basic rules call for a number of rounds equal to the number of players, with the player collecting the greatest cumulative total of chips over those rounds being the victor.&#10;&#10;",
        "artist": "Klaus Pōkel"
    },
    {
        "name": "Where's Bob's Hat?",
        "description": "A form of estimation whist, with three colored suits (cards from 1 to 20), and the possibility of trumps or no-trumps.   You have to bid for which suit (or suits) you think you will capture most cards of, or you can bid to capture fewer cards than anyone else.   Get it right, you score; get it wrong, you take a penalty.   The number of cards per hand increases round by round, and the number of rounds depends on the number of players.&#10;&#10;From the Box:&#10;Where's Bob's Hat? is best with 3 or 4 players. Over several hands, players bid to take the most cards in one or more of the three suits, each a different kind of hat. Players who feel they will take few, if any, tricks may bid to take the fewest cards in tricks played during each hand. Players score points for making their bids and lose points for missing their bids.&#10;&#10;Several cards picture Bob's Hat in addition to the hat of their suit. When a player wins a trick containing a card with Bob's Hat on it, the player takes the Bob's Hat card (worth plus or minus 10 points). The player with the card at the end of the hand add (or subtracts) 10 points to his score. The player with the most points at the end of the game is the winner!&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Quackshot",
        "description": "Similar to the often maligned Loopin' Louie, this game features a battery-powered central drum, which spins color-coded targets around its perimeter.  Each of the players has a little color-coded archer character that shoots plastic darts at the central drum.  If you aim well, you'll hit one of the targets and a spring-loaded mechanism will make the target pop out of the drum.  The object of the game is to be the last person with any of your colored targets left.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Sternenhimmel",
        "description": "Each player vies for control of the constellations which are worth victory points. There are 12 constellations and players use &quot;Stars&quot; to bid for the control. Each star is worth some amount of control over the constellation, and there is a &quot;Double&quot; star and a &quot;Black Hole&quot; star thrown into the mix. There is some aspect of bluff in the game since some of your stars may be placed face up or down.&#10;&#10;",
        "artist": "Thomas Kley"
    },
    {
        "name": "Plague & Pestilence",
        "description": "A light card game involving the build-up and destruction of medieval towns. In the Prosperity phase players attempt to build up their populations via stealing from other players or via improvements. Then the Death Ship arrives bearing the plague! In the Plague phase players attempt to kill off other players by playing war, pestilence or other deadly attacks. The cards contain illustrations reminiscent of medieval woodcuts featuring the Grim Reaper.&#10;&#10;",
        "artist": "Paul Dale"
    },
    {
        "name": "Starship Troopers",
        "description": "Starship Troopers is based upon the popular novel of the same name written by the dean of science fiction writers, Robert A. Heinlein. In the novel, Heinlein describes a futuristic war involving homo sapiens from our Earth (Terrans) against a Humanoid race (nicknamed the 'Skinnies' for obvious physical attributes) and their cobelligerents, the totally alien Arachnids. Since this is a story of future wars and future advances in technology, much is changed in the fields of weaponry and tactics and strategy. One thing remains the same, however; the fighting still rests on the shoulders of the individual infantryman. Although great starships has shuttle men between the distant solar systems and the power of individual weapons has risen to awesome heights, wars still cannot be won unless men venture onto the face of alien planets and fight the enemy on their home ground. As Juan Rico, the protagonist of the novel, relates:&#10;&#10;&quot;We are the boys who go to a particular place, at H-Hour, occupy a designated terrain, stand on it, dig the enemy out of their holes, force them then and there to surrender or die. We're the bloody infantry, the doughboy, the duckfoot, the foot soldier who goes where the enemy is and takes him on in person.&quot;&#10;&#10;Although the mission remains the same, future inventiveness has changed the method considerably. In a galaxy-wide war, manpower is at a premium. Platoons fight where entire armies once tred. But these platoons possess the firepower equivalence of a Twentieth-Century mechanized division. More importantly, each man in the platoon is provided with a piece of hardware that allows him to fight and survive in the holocausts of future combat&mdash;his powered armor suit. As Rico describes it:&#10;&#10;&quot;A suit isn't a spacesuit &mdash; although it can serve as one. A suit is not a space ship but it can fly&mdash;a little . . . Suited up, you look like a big steel gorilla, armed with gorillasized weapons. But the suits are considerably stronger than a gorilla. If a Mobile Infantry man in a suit swapped hugs with a gorilla, the gorilla would be dead, crushed; the man and the suit wouldn't be mussed . . . The real genius in the design is that you don't have to control the suit, you just wear it, like your clothes, like skin . . . Even riding a bicycle demands an acquired skill, very different from walking. But a suit you just wear.&quot;&#10;&#10;With the suit and the incredible array of weaponry that go with it, the Mobile Infantry soldier is an exceedingly formidable opponent. He had better be. The enemies he faces are the most awesome adversaries in the galaxy. Of the two extraterrestrial races fighting the Terrans, the Humanoids are the least revolting. Rico describes them as&#10;&#10;&quot; . . . humanoid, eight or nine feet tall, much skinnier than we are and with a higher body temperature; they don't wear any clothes and they stand out in a set of 'snoopers' like a neon sign.&quot;&#10;&#10;In early scenarios they are fighting on the side of the Arachnids.  In later scenarios, after successful negotiations with Earth, they switch over to the Terran side. They're only effective fighters within the confines of their small city terrain and strong points on the board.&#10;&#10;But the 'Skinnies' were mild looking in comparison to the Arachnids:&#10;&#10;&quot;The 'Bugs' are not like us. The Pseudo-Arachnids aren't even like spiders. They are arthropods who happen to look like a madman's concept of a giant, intelligent spider, but their organization, psychological and economic, is more like that of ants or termites; they are communal entities, the ultimate dictatorship of the hive . . . But don't make the mistake of thinking that they act purely from instinct . . . their actions are as intelligent as ours (stupid races don't build spaceships!) and were much better coordinated. It takes a minimum of a year to train a private to fight and to mesh his fighting with his mates; a Bug warrior is hatched able to do this ...&quot;&#10;&#10;As the Arachnid Player, uses an Alien Control Pad sheet to record the placement of his underground central Hive cell complex and the attached tunnels radiating outward. Tunnels are used to move the Warrior units, along with Worker units mixed in as expendable decoys, to locations where they can pop up to the surface through a breach hole and attack the Terran units.  Completely unseen, and only paper recorded, Engineer units are used to create the breaches and, later, to extend the tunnels.&#10;&#10;The game is set up in a &quot;Programmed Instruction&quot; system of scenarios to slowly introduce the game concepts. Scenarios range from Scenario I, which starts players off with a basic MI raid on a Skinny city (just like the book. &quot;Flores died on the way up&quot;) to Scenario VII, The Battle of Klendathu: the final Terran assault on the Arachnid Homeworld.&#10;&#10;Warfare in the Twenty-second Century is the ultimate test of survivability of the human race. It was a very near thing.&#10;&#10;Avalon Hill Complexity rating - 5&#10;&#10;",
        "artist": "George Goebel,Richard Hamblen,Looking Glass Photographics,Emily March,Randall C. Reed"
    },
    {
        "name": "Bull Run",
        "description": "Bull Run is a tactical combat game of the first battle of Bull Run.&#10;&#10;The game is played on a map of the area over which the battle was fought overlaid with a hexagonal grid. Units are infantry, cavalry, and artillery, with brigade, division, and army leaders. Each turn is 30 minutes, and each hex represents 1000 ft. Units are basically regiments and batteries. Some infantry regiments with their brigade leader are capable of forming brigades, increasing offensive power at the expense of movement. Batteries can be limbered for increased movement at the expense of firepower, or unlimbered with full firepower and limited movement.&#10;&#10;Combat is a modified version of the classic system adopted by the earlier Avalon Hill games.  However, rules for leader command activation, infantry screening of artillery, and infantry forming brigades to prevent soak-off attacks, ranged artillery, rally of losses are give the game a unique flavour.&#10;&#10;The major terrain obstacle is Bull Run which provides the Confederate with defensive advantages and hinders Union movement. &#10; The game begins with the Union troops approaching partially hidden, unsuspecting Confederate forces.  As the Union attack develops, additional Confederate leaders and combat units are activated and are rushed to stem the Union advance.  The Union player wins if he is able to capture any of three objective hexes by the end of the game or takes Manassas at any time.  The Confederate player wins if he takes Centreville at any time or prevents the Union player from holding any of objective hexes at the game end.&#10;&#10;The game consists of a 32&quot; by 22&quot; mapboard, 260 counters, various charts, a 12 page rulebook and 1 die.&#10;&#10;&#10;Magazine References:&#10;&#10;The GENERAL Index  Article List:&#10;&#10;&#10;    The GENERAL Vol.20,No.5&#10;        Series Replay - Bull Run, Rex A. Martin, Paul O'Neil, Richard Hamblen&#10;        Bull Run &ndash; &ldquo;West Point's Finest, The Commanders at Bull Run&rdquo; (Historical) A. Blumberg &amp; Richard Hamblen&#10;        Bull Run &ndash; &ldquo;Rebel Yell, Opening placement for Confederate Players&rdquo; (Strategy) Rex A. Martin&#10;        Bull Run &ndash; &ldquo;First Blood, The Battle of First Bull Run&rdquo; (Historical) Michael Craighead&#10;        The Question Box - Bull Run&#10;        Contest #117 - Bull Run&#10;    &#10;    The GENERAL Vol.20,No.6&#10;        Series Replay - Bull Run, Rex A. Martin, Paul O'Neil, Richard Hamblen&#10;    &#10;    The GENERAL Vol.25,No.5&#10;        Bull Run &ndash; &ldquo;Risky Business -A designer's look at Bull Run&rdquo; (Designer notes) Richard Hamblen &#10;    &#10;&#10;&#10;",
        "artist": "Dale Sheaffer,Chris White (I)"
    },
    {
        "name": "Star Traders",
        "description": "from user review:&#10;Each player assumes the role of a intra-galactic merchant, traveling from planet to planet in a future where wars are unheard of and &quot;Traders&quot; are the heroes of the cosmos. The board shows 36 planets: six clustered together in the center of the board, six more in each of five arms of the galaxy. Planets are connected by &quot;jump lines&quot;: you can jump to an adjacent planet on an orange line, to a planet halfway down a galaxy arm on a purple line, and from one galaxy arm to another via green lines. The length of the jump line also indicates the difficulty of the jump, so to successfully complete an &quot;orange' jump you must roll a 2 or better on a single die, a purple jump requires a 4 or better, and the green jumps necessitate a 6.&#10;&#10;As the players scurry about the galaxy, they can pick up and deliver cargoes, which pay both in money and in &quot;Prestige.&quot; These &quot;contracts&quot; vary throughout the game, and only one player can fulfill any given contract. This isn't to say that multiple players can't pick up the named cargo, though. But only the first player to arrive at the contract's destination gets the payoff for a contract; everyone else with the cargo is now just stuck with unwanted junk, and may have to pay a penalty to dump it. Players can also build bases on the various planets as they move around. Building bases earns the players Prestige, and when a player tries to make a jump to a planet with a base, the jump is an automatic success if the player has the owner's permission. Traders obviously have permission to jump to their own bases, but if they want to jump to an opponent's, they will probably have to pay a fee. And since only one player can have a base on any given planet, bases rapidly become lucrative investments.&#10;&#10;",
        "artist": "Mark Chandler,Frank Kelly Freas,C. Bradford Gorby,Denis Loubet"
    },
    {
        "name": "J.U.M.P. Into the Unknown",
        "description": "Space combat game where players expand their empire to achieve the most build points.  Build points are gathered by sending diplomatic fleets to charted, but unexplored worlds.  Diplomacy results in the development of allies..or the gaining of enemies.  Combat between the individual players (or enemy worlds) is conducted by deploying fleets of ships.   The system offers variant game play, endings and even a solitaire format.&#10;&#10;From the publisher:&#10;&#10;Introducing Evil Polish Brother's, LLC flagship title, JUMP: Into the Unknown, the new standard in space conquest board gaming.&#10;&#10;The object: dominate the galaxy through conquest and diplomacy.&#10;&#10;Up to 4 players can Justify their Use of Military Power and rules are provided for true solo play.&#10;&#10;Easy to learn game mechanics and fog-of-war adds to JUMP's addictive game play that will please the most avid wargamer and hook beginning gamers.&#10;&#10;With moveable map tiles, flexible map board configuration, random generation tables and variant victory conditions, no game ever plays the same way twice.&#10;&#10;JUMP: Into the Unknown is also ideal as a campaign setting for players of tactical space miniature combat games to stage their battles.&#10;&#10;Each game comes with 3 map boards, 6 clear map tiles, 200 foil stamped game pieces on solid black cardboard, 40 plastic stands, reference cards, record sheets, 2 six-sided dice, and 1 rule book.&#10;&#10;Designed as a Core System, planned expansions include races, leaders, event cards, new map tiles, special map boards, additional pieces to accommodate 4 more players, modules, special encounters, advanced JUMP rules and more.&#10;&#10;",
        "artist": "Alan Gutierrez"
    },
    {
        "name": "4th Dimension",
        "description": "4th Dimension is a very spacey-looking game with a small circular board divided into sectors each track of which has twice as many spaces as the one closer to the center. Each player get 6 warriors, 3 rangers, 2 guardians, and one time lord. Guardians can capture warriors and rangers; rangers can capture warriors; the time lord can capture rangers and guardians; but the lowly warriors are the only ones who can capture the time lord and win the game. Captures are made by moving next to rather than on top of enemy pieces. Each piece can move only one space at a time but they can also &quot;warp&quot; by leaving the board and leaving a 4-D marker behind. The piece can then stay in the warp zone for up to three turns or warp back onto the board up to two spaces away from the 4-D marker. This game has an inconveniently small gameboard and plastic pieces that look like little futuristic chairs.&#10;&#10;The game was self-published (as J. A. Ball &amp; Co.) in the UK and was licensed by TSR in the US.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Would You Rather...?",
        "description": "Before they can roll and move, players must pick a card and present the rest of the players with a nasty choice between two thoroughly unpleasant hypotheticals in categories such as pain, embarrassment, ethics, and ingestion. If the player guesses the majority preference, he gets to move otherwise he must pass. Some spaces allow the player to invent their own awful hypothetical choice. The other players vote secretly on their choice in this case. If the vote is not unamimous, the player can move or send someone else back. Players roll a six-sided die and there are only 10 spaces to the goal so games go very quickly. Typical choices on the cards include, &quot;Would you rather lie naked in a bathtub full of live roaches or dive head first into a pool of tobacco spit?&quot; The answer &quot;neither&quot; is NEVER allowed.&#10;&#10;Variant:&#10;The 2003 version of this game &quot;Would You Rather?&quot; appears to have quite different rules to the above described game. There is a new simpler square board with more spaces. Unlike the 20 minutes of the above game, 1-2 hours is recommended by the manufacturer. Players roll a dice, then move and depending where they land, draw cards with dilemmas to pose to the rest of the other players. The current player must try to secretly predict the result of the other players' subsequent open discussion and consensus view. No-one is penalised for an inability to reach consensus, the game encourages one option picked at random perhaps by flipping a coin, to keep the game moving. If the current player predicted correctly, they get a bonus turn.&#10;&#10;Typical questions include &quot;Would you rather ... On senior prom night, have to take your parent -OR- your 12 year old sibling?&quot;&#10;&#10;Every so often players get the opportunity to take a difficult challenge with the winner being the first person to complete their third challenge.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Minion Hunter",
        "description": "Minion Hunter is the simplified board game version of GDW's Dark Conspiracy RPG.&#10;&#10;Players move around the outer edge of the board trying to build up their cash, weaponry, equipment and four categories of ability points. In the middle of the board is a map of the USA and a progression track of Dark Minion plots represented by cards, which have city names on the backs and monster names and attack scores on the fronts.&#10;&#10;Once players are strong and rich enough, they can enter the map and fight the enemies shown on the cards that are currently on the track. The enemy cards move down the track after every player turn. If they reach completion, the corresponding Dark Minion (Nukid, ETs, Morlocks, or Fey) gains points toward taking over America.&#10;&#10;Players must boost their own success scores while also cooperating to keep the Dark Minions from snatching victory from all players.&#10;&#10;Expanded by:&#10;&#10;    Minion Nation&#10;&#10;&#10;&#10;&#10;",
        "artist": "Larry Elmore"
    },
    {
        "name": "Quarto",
        "description": "Quarto! has a 4&times;4 board and 16 pieces. Each piece has four dichotomous attributes &ndash; color, height, shape, and consistency &ndash; so each piece is either black or white, tall or short, square or round, and hollow or solid. The object is to place the fourth piece in a row in which all four pieces have at least one attribute in common. The twist is that your opponent gets to choose the piece you place on the board each turn.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Monopoly: The Card Game",
        "description": "Rummy for Monopoly fans! Every property on the board has a card for you to collect to form at least one complete set. There are also house, hotel and token cards to multiply the value of your sets. Mr. Monopoly and GO! Cards provide quick points and help fill out the 10-card hand in a 4-player game. Instead of a discard pile, each player has his own trade pile. Players can draw from the deck or exchange their trade piles with other players (whether they like it or not). A stack of money is included but is unnecessary since cash is only used to keep score and cannot be spent or exchanged.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Dr. Jekyll & Mr. Hyde",
        "description": "An interesting little game that uses a miniscule deck of 28 cards, consisting of 2 identical suits of Sun and Moon cards. Each partnership takes the part of either the Sun or Moon cult, and plays cards only of its designated suit. An interesting mechanic is that since the cards are dealt randomly, it is often necessary and even prudent to have an opponent play a card for you. The object of the game is to collect souls (of either cult) and temples of your own suit (which serve as a multiplier). Rounds move quickly, and points can add up dramatically.  (Description from original incarnation, named 'Twilight')&#10;&#10;",
        "artist": "Carsten Fuhrmann,Robert Korschofski,Wolfgang Werner"
    },
    {
        "name": "Cabale",
        "description": "In this beautiful wooden game, players use runners to move on the board. On a turn, a player moves his runner, making one turn and placing a block on the turning space. If he can, the player may also capture enemy blocks. The player may also place one blockade. Players score points for captured blocks and for the value of the spaces their blocks occupy. The player with the most points wins.&#10;&#10;Re-implements:&#10;&#10;    Winkeladvokat&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Manchu",
        "description": "This game is included as an insert game in Strategy &amp; Tactics magazine #116; errata appears in S&amp;T #117.&#10;&#10;Manchu is a two player wargame covering the Taiping Rebellion that occurred in Manchu China between 1850 and 1868.  The game is strategic in scale, and units are generic strength points representing Taiping rebels, Manchu banner troops, provincial army troops, bandits and Mongolian cavalry.  The game map represents Manchu China.&#10;&#10;The Taiping player starts at an advantage in troops and leaders and seeks to conquer enough of the country to force a collapse of the Manchu government.  The Manchu player seeks to survive the Taiping onslaught, and gains strength as the provincial forces are brought to bear.  However, over-reliance on provincial forces will cause a reduction of Imperial authority, and that in itself may cause the game to be lost.&#10;&#10;The game consists of a map, playing counters, rules and numerous charts.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Singapore",
        "description": "Singapore is a two player wargame covering the Japanese invasion of the British Malaya in World War 2.  The game is operational in scale, with units representing brigades and regiments.  The mapsheet consists of two maps, a large scale map of Malaya as well as a more detailed map of Singapore island.  The earlier turns of the game takes place on the larger Malayan map, and play moves to the smaller Singapore map only towards the end of the game, when the Japanese prepare to assault the island.&#10;&#10;Game components consist of one mapsheet, 100 counters, rules and game charts.&#10;&#10;",
        "artist": "Ivor M. Janci,Dave LaForce,Jerry Tiritilli"
    },
    {
        "name": "Timbuktu",
        "description": "In this game each player takes the role of a caravan leader. The number of camels within a caravan depends on the number of players. Each camel is loaded with a lot of goods, and the goal of the game is to carry all the goods from the starting position to the final oasis: Timbuktu.&#10;&#10;However, during the course of this journey, the caravans stop at other oases. Once all camels arrive at an oasis, and night falls, thieves attack the caravan and steal different goods. While moving from one oasis to another, players receive different clues about the nature of the thefts. Each player has a different clue, and although clues are passed around, only one player receives three of the total five clues. From the actions of the other players (caravan leaders), the clues have to be guessed and camels have to be relocated, in order to save all the goods from the thieves.&#10;&#10;The next morning, the caravan continues it's way towards Timbuktu, and players are challenged with different clues again. The object of the game is to be the trader left with the most value in goods when they arrive at Timbuktu.&#10;&#10;",
        "artist": "Jo Hartwig"
    },
    {
        "name": "Wizard Kings",
        "description": "Wizard Kings is an exciting fantasy battle game with armies of elves, dwarves, orcs, undead, and three human armies (feudal, barbarian, amazon). Players customize their armies and fight for control of strategic cities and terrain on geomorphic maps. Wizard Kings 2nd edition is a re-release of the sold-out 1st edition.&#10;&#10;Wizard Kings can play in as little as one hour or be used as part of a miniatures campaign for months. Victory conditions vary with the many possible scenarios. The new version is multi-player out of the box. A collectible expansion blockset has been released at the same time.&#10;&#10;Wizard Kings 2nd edition includes 4 new maps, which are compatible with existing maps from the first edition. There are many new unit types and artwork, although first edition units remain valid for play.&#10;&#10;Expanded By:&#10;&#10;    Wizard Kings: Expansion Armies&#10;    Wizard Kings: Expansion Maps&#10;&#10;&#10;&#10;&#10;",
        "artist": "Laryn Bakker,Edward Beard, Jr.,Heather Bruton,Joel Burslem,Nicole Cardiff,Christopher Moeller,Joe Veen"
    },
    {
        "name": "Fibonacci",
        "description": "This abstract strategy doesn't really use the Fibonacci sequence (1,1,2,3,5,8,13...), but it's pretty cool nonetheless.  The first player starts off with one move, the second player takes two, first player takes three, and so on up to a maximum of six moves.  The object of the game is to surround your opponent's base with your six strike pieces.  Everytime you get a strike piece adjacent to your opponent's base they lose 1 move point.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Big Idea",
        "description": "The Big Idea is a quick and easy card game (Cheapass style) where the players represent venture capitalists creating companies (from a noun card and an adjective card - &quot;Erotic Pants&quot;) to take through the process of an IPO. You automatically gain a share in companies you create, and later you have opportunities to secretly invest in a company and publicly buy a share in a company. Finally, you roll a die to see which companies go public in a round: equal to or lessor than the shares issued in the company. And the pay out: based on the number of shares issued and the number of cards used in forming the company times the die roll.  The game is fairly simplistic, but it's lots of fun to create names of products like &quot;Mentholated Chicken&quot;, while agonizing over helping your opponent because their product will net you the biggest gain.&#10;&#10;Expanded by:&#10;&#10;    The Big Idea: More Cards! (compatible only with Semi-Deluxe edition)&#10;&#10;&#10;&#10;&#10;Re-implemented by:&#10;&#10;    The Big Idea&#10;&#10;&#10;&#10;&#10;",
        "artist": "Damon S. Brown"
    },
    {
        "name": "Conspiracy",
        "description": "There are four capitals, four bankbooks, one top secret briefcase and eight greedy spies that anyone can control. The object is to move the briefcase to your headquarters. Players can either secretly pay off or openly move a spy one space on their turn. Each player has an account of $10,000 and can bribe spies in increments of at least $100. If you move a spy, another player may challenge the move. The two players then slowly reveal how much money they each have on the spy in question. If the challenger wins, the move is rescinded. If the defender wins, the move stays and the challenger loses his next turn. Players need to cooperate against whichever player is closest to victory. You can conspire openly to swipe the case or murder a spy and turn the tables on a player who is a mere one space away from winning. No dice, no cards, no luck involved. Learn to work together or games will end in a hurry.&#10;&#10;Amigo version (Casablanca) published 1991 supports 8 players.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Gother Than Thou",
        "description": "A satire of the &quot;gothic&quot; lifestyle, in which players try to accumulate twenty &quot;Goth Points&quot; while giving their opponents cards that subtract Goth points. &quot;Infection Points,&quot; which limit hand size, and &quot;Money,&quot; which limits draws, also come into play along with Goth points, so most of the cards are a mixed bag.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "HeroQuest",
        "description": "HeroQuest is Milton Bradley's approach to a Dungeons &amp; Dragons-style adventure game.  One player acts as game master, revealing the maze-like dungeon piecemeal as the players wander.  Up to four other players take on a character (wizard, elf, dwarf, or barbarian) and venture forth into dungeons on fantasy quests.  Plastic miniatures and 3-D furniture make this game very approachable.  Expansions were also released for this system.&#10;&#10;The HeroQuest series consists of the main game and a number of expansions.&#10;&#10;This game was made in cooperation with Games Workshop who designed the miniatures and helped in many of the production details including background world and art in the rule book and scenario book.&#10;&#10;Additional material which is generally missed since it is not technically an expansion was published in the HeroQuest: Adventure Design Kit which did feature one more Heroquest adventure: A Plague of Zombies.&#10;&#10;Other sources of HeroQuest supplements which are available (in some cases online.)&#10;&#10;&#10;     Adventures Unlimited # 05 &quot;The Inn of Chaos&quot;&#10;     Vindicator Vol 1,    # 02 &quot;Review: Quest Pack for the Elf&quot; &quot;HeroQuest Hall of Foes I&quot;&#10;     Vindicator Vol 1,    # 03 &quot;Review: Barbarian Quest Pack&quot; &quot;HeroQuest Hall of Foes II&quot;&#10;     Vindicator Vol 1,    # 04 &quot;HeroQuest Variants&quot;&#10;     Vindicator Vol 1,    # 5a &quot;The Rogue&quot;&#10;     Vindicator Vol 2,    # 03 &quot;HeroQuest Treasure Cards&quot;&#10;     Fractal Spectrum     # 13 &quot;HeroQuest: A Notch Above&quot;&#10;     Fractal Spectrum     # 17 &quot;HeroQuest Hall of Foes III&quot;&#10;     White Dwarf          #115 &quot;The Eyes of Chaos part 1&quot;&#10;     White Dwarf          #134 &quot;The Halls of Durrag-Dol&quot;&#10;     White Dwarf          #145 &quot;The Eyes of Chaos part 2&quot;&#10;     Marvel Comic         Marvel Winter Special &quot;Revenge of the Weatherman&quot;&#10;     The Screaming Spectre by Dave Morris: &quot;Running the Gauntlet&quot;&#10;     The Tyrant's Tomb by Dave Morris: &quot;A Growl of Thunder&quot;&#10;     The Alchemist's Bench&#10;     Drag&atilde;o Brasil #3 : Contains an article/preview of the board game by Roberto De Moraes.&#10;     Drag&atilde;o Brasil #4 : Contains the 5-quest pack &quot;A CIDADE ESCRAVA&quot; (The Slave City) by Roberto De Moraes.&#10;     Drag&atilde;o Brasil #6 : Contains the 3-quest pack &quot;O RESGATE&quot; (The Rescue) by Roberto De Moraes (signing as &quot;Di'Follkyer&quot;).&#10;     Drag&atilde;o Brasil #8 : Contains the 3-quest pack &quot;ATAQUE AO MAGO DORMINHOCO&quot; (Attack on the Sleeping Mage) by Roberto De Moraes.&#10;     Drag&atilde;o Brasil #12 : Contains information about four new HeroQuest heroes; Minotaur, Fairy, Amazon, Centaur.&#10;     Drag&atilde;o Dourado #5 : Contains the quest &quot;O RESGATE DA PRINCESA&quot; (The Rescure of the Princess) by Unknown.&#10;     S&oacute; Aventuras #1 : Contains the 3-quest pack &quot;CACADA A CRIATURA&quot; (Creature Hunt) by Roberto De Moraes.&#10;     The Universe of RPG #1 : Contains a presentation of the board game by Marcos Mulatinho.&#10;&#10;&#10;",
        "artist": "Gary Chalk,Les Edwards"
    },
    {
        "name": "Battle Masters",
        "description": "Battle Masters is a fantasy miniatures battle game by Milton Bradley, presumably licensed from Games Workshop.  The sizeable game box comes stuffed with tons of plastic miniatures, a deck of combat cards and some dice.  Players move and fight their armies based upon what card is turned over from the deck.  Combat is held on a large vinyl mat 4.5 ft square (Actual Measurements: 55 inches by 57 inches).&#10;&#10;From the back of the box:&#10;&#10;Welcome to the world of Battle Masters - the epic game where you command mighty armies locked in a legendary conflict of good versus evil!&#10;&#10;The noble Imperial Army is ready to meet the Forces of Chaos. You and your opponent must strategically guide 25 army units, featuring over 100 finely-detailed figures, across the gigantic 4 1/2' X 5' Battle Mat. Beware! Ditches, marshes, river fords and the great Border Tower lie before you.&#10;&#10;The battle unfolds as each turn of a Battle card tells which army units can move and which can attack. Will your army be victorious, or will your opponent destroy you? Who will survive the battle and win the game? The fate of the Empire is decided by you, the Battle Masters!&#10;&#10;Card Deck:&#10;3 Goblins and Orcs&#10;1 Goblins, Beastmen and Wolf Riders&#10;2 Goblins and Wolf Riders&#10;5 Champions of Chaos and Wolf Riders&#10;2 Champions of Chaos Charge&#10;1 Chaos Archers and Champions of Chaos&#10;2 Beastmen, Orcs and Goblins&#10;1 Goblins, Champions of Chaos and Beastmen&#10;4 Choaos Warriors, Champions of Chaos and Chaos Archers&#10;1 Choaos Warriors, Beastmen, Orcs, Chaos Archers and Goblins&#10;5 Wolf Riders Double Move&#10;1 Whole army move (Chaos)&#10;5 The Ogre Champion&#10;&#10;4 Imperial Knights&#10;2 Lord Knights&#10;2 Imperial Archers&#10;6 Imperial Knights and Lord Knights&#10;1 Men-at-Arms and Imperial Archers&#10;4 Men-at-Arms, Crossbowmen and Imperial Archers&#10;4 The Mighty Cannon&#10;1 Whole Army Move (Imperial)&#10;1 Lord Knights and Imperial Knights Charge&#10;1 Lord Knights Charge&#10;&#10;Ogre Champion cards:&#10;3 Ogre Moves&#10;3 Ogre Attacks&#10;&#10;Mighty Cannon Tiles:&#10;1 target tile&#10;4 flying cannon ball&#10;3 bouncing cannon ball&#10;2 explosion&#10;&#10;",
        "artist": "Chris Baker"
    },
    {
        "name": "A House Divided",
        "description": "from Mayfair Games website:&#10;&#10;A House Divided simulates the epic struggle of the American Civil War that was fought over the twin issues of slavery and state's rights. The period from 1840 to 1861 saw these issues brought to a boil, and in 1861 the nation became tangled in a terrible war that lasted four long years.&#10;&#10;The game depicts the war between North and South from the First Battle of Bull Run (or Manassas Junction) to Lee's surrender at Appomattox Courthouse &ndash; or Grant's surrender at Harrisburg... Each player leads one of these two nations and makes the strategic decisions which determine the outcome of the war.&#10;&#10;The game board represents the United States, north and south and from the Atlantic coast to just west of the Mississippi. [...] The play map contains a number of boxes, each representing a city, town or locations important to the war. These boxes are connected by transportation lines &ndash; blue for rivers, tan for roads and black for railroads &ndash; which provide the paths to victory or defeat.&#10;&#10;Can you keep the Union whole or force the separation of the United States?&#10;&#10;",
        "artist": "Frank Chadwick,Rich Hasenauer,Jason Juta,William H. Keith, Jr.,Franz Vohwinkel"
    },
    {
        "name": "Wabbit Wampage",
        "description": "One player is Farmer Brown, others play Wabbits. All players battle for points: plowing fields in Spring (even the Wabbits!), stockpiling carrots in Summer, whomping enemies in Fall, and destroying buildings in Winter. Think Elmer Fudd and Bugs Bunny fighting over the operation of a farm.  Just like in the cartoons, players can mail away for items to help them in squashing the other players.&#10;&#10;Followed by:&#10;Wabbit's Wevenge&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Roman Civil War",
        "description": "Roman Civil War is a two player wargame covering the battles between Pompey and Julius Caesar. The game is strategic in scale, with units representing legions, fleets and allied units on both sides. The mapsheet, overlaid with a hexagonal grid, covers the important areas of the Roman empire, including Italy, Greece, Asia and Egypt. Off-board areas represent surrounding areas such as Spain, Gaul and Syria.&#10;&#10;Game components consist of a mapsheet, counters, rules and game charts.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Montgolfiere",
        "description": "Each player tries to fly his balloon as high as possible. For this, he is equipped with ballast which can be dumped at the right opportunity, grappling hooks for linking to other balloons, soporific gas for knocking out balloons below, and a super motor. Players can also use tempest cards to reverse the game play.&#10;&#10;Extrapolated From Balloning Games: Each player starts with an identical set of cards, chooses a random subset and adds one card each turn. The higher the card played, the more likely one is to move up, but there are other interesting plays such as grappling onto another balloon, using soporific gas on lower balloons or storms which defeat the leaders. It can be especially interesting to compete against the non-player Black Baron who has been known to win the game from time to time, even playing randomly.&#10;&#10;",
        "artist": "Dominique Ehrhard"
    },
    {
        "name": "Caesar in Gallia",
        "description": "Caesar in Gallia is a two player wargame covering Julius Caesar's conquest of Gaul. The game is strategic in scale, with units representing Roman legions, fleets, barbarian warbands and allied troops. The mapsheet, overlaid with a hexagonal grid, covers an area corresponding approximately to Britain. France, Belgium, Switzerland, Spain and parts of Africa.  An off-board box is used to represent the Italian homeland.&#10;&#10;Game components consist of a mapsheet, counters, rules and game charts.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Frederick the Great",
        "description": "Frederick the Great is an operational level wargame on the Seven Years War between Frederick the Great's Prussia (and allied Hanover) and the anti-Prussian coalition consisting of France, Austria, Russia and a host of European countries.&#10;&#10;There are seven scenarios, each covering one year of campaigning.&#10;&#10;The game consists of a map covering most of central Europe, rules and counters depicting the important leaders and generic strength points representing armies.&#10;&#10;",
        "artist": "Rodger B. MacGowan,Redmond A. Simonsen"
    },
    {
        "name": "When Tigers Fight",
        "description": "When Tiger Fight: The War in Asia, 1944, is a strategic level wargame of the battles that were fought on the Chinese front during the latter stages of World War 2. The map covers a large portion of mainland China and parts of Burma.&#10;&#10;Game Scale:&#10;Turn: 1 month&#10;Map: 37.2 miles / 60 km per hex&#10;Unit: Regiment to Army&#10;&#10;Game Contents:&#10;One 22 x 34&quot; map&#10;Two countersheets (100 5/8&quot; dual-side printed counters - 81 of them are errata for other games)&#10;One 32 page rulebook&#10;One Player Aid Card (2-sided)&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Holy War: Afghanistan",
        "description": "Holy War: Afghanistan is a two-player wargame covering the war in Afghanistan between the communist regime supported by Soviet troops and equipment, and the Afghan Resistance. The game is strategic in scale, with units representing divisions and brigades. Aspects of the war covered in the game include conventional and guerilla warfare, politics and the possibility of foreign intervention.&#10;&#10;The game includes a campaign and several shorter scenarios. Game components include 22&quot; by 17&quot; map, 200 unit counters, and a rule booklet.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Dragons of Glory",
        "description": "Dragons of Glory is a simple wargame set in the fantasy world of the Dragonlance fantasy series.  Players take the roles of the the evil Dragon Highlords who try to conquer the nations of Ansalon, or the Whitestone forces, who try to stop the Dragon Highlords.  Game consists of four scenarios and a campaign game.&#10;&#10;The game system is built around the standard wargame, with a hexgrid overlaid mapsheet, counters representing the armies and fleets of both sides and the leaders who led them, combat charts.  The turn sequence is the standard you-move-I-move kind.  One interesting thing about the game is that both players start with minimal forces (The Whitestone player actually starts with none!), and try to activate allied nations as the game progresses.&#10;&#10;Game component consists of one mapsheet depicting the continent of Ansalon in the fantasy world of Krynn, counters,  rules and numerous charts.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Snit's Revenge",
        "description": "One player assumes the role of a single Bolotomus, fighting off an infestation of Snits.  The other player commands the Snit onslaught, attempting to ravage the Bolotomus's internal organs.  The battles are between the Bolotomus' immune system and the Snits. &#10; Originally published in ''The Dragon Magazine'', Issue #11. &#10; Republished with Snit Smashing 27 years later (2004) by Steve Jackson Games in a single reprint entitled &quot;Snits&quot; &#10;&#10;&#10;",
        "artist": "Tom Wham"
    },
    {
        "name": "Elfenroads",
        "description": "Before Elfenland there was Elfenroads.  Players attempt to travel from city to city on the map using the resources of cards, gold, and transportation chits.  The player best able to juggle the three resources and visit the most cities by game's end wins.&#10;&#10;Re-implemented by:&#10;&#10;    Elfenland&#10;&#10;&#10;&#10;&#10;",
        "artist": "Doris Matthäus"
    },
    {
        "name": "Blood Bowl (Third Edition)",
        "description": "Blood Bowl is a game of Fantasy Football.  The basic game features a match between a human team and an orc team.  Ostensibly the teams are playing football.  In fact each team takes turns moving, blocking and advancing the football down the field.  The game comes with plastic miniatures.&#10;&#10;This game is a part of the Blood Bowl Series&#10;&#10;",
        "artist": "Wayne England,David Gallagher,Richard Wright"
    },
    {
        "name": "Nuclear War",
        "description": "Satirical game in which each player represents a &quot;major world power&quot; and attempts to gain global domination (or annihilation) through the strategic use of propaganda or nuclear weapons...&#10;&#10;Integrates with:&#10;&#10;    Nuclear Proliferation&#10;    Nuclear Escalation&#10;    Weapons of Mass Destruction&#10;    India Rails (using Nuclear War Bonus Pack #2: Expansion to India Rails and Nuclear War)&#10;&#10;&#10;&#10;&#10;The latest reprint of the game features new artwork on the cards and two new cards:&#10;&#10;    Mars Probe (Secret): Take 1 million people from the discard pile.&#10;    Advanced Recycling (Special): Pick one used carrier or warhead from the discard pile.&#10;&#10;&#10;&#10;&#10;",
        "artist": "Steven S. Crompton,Gary Freeman,Brian McCrary"
    },
    {
        "name": "Talisman",
        "description": "The game board represents a fantasy land.  Players chose a character from a list of semi-standard fantasy types: Barbarian, Wizard, Monk, etc.  The objective of the game is to travel through the land encountering event cards and gathering strength along the way.  Hopefully players will eventually become powerful enough to travel to the center of the board, endure the trials there and take the Crown of Command for the victory.  There were also several expansions released for this game, which add new character choices and new places to travel.&#10;&#10;Part of the Talisman series of games and expansions published by Games Workshop Ltd..&#10;&#10;The first edition differs from the second only in the box cover art and the cards, which were printed in black and white (same artwork as the second edition, though). The first edition had no expansions.&#10;&#10;Expanded by:&#10;&#10;    Talisman Expansion Set&#10;    Talisman: The Adventure&#10;    The Talisman Dungeon&#10;    Talisman Timescape&#10;    Talisman City&#10;    Talisman Dragons&#10;&#10;&#10;&#10;&#10;Also by:&#10;&#10;    The Jewel in the Crown&#10;    Talisman (second edition): White Dwarf #115 Cards&#10;&#10;&#10;&#10;&#10;Re-implemented by:&#10;&#10;    Talisman (third edition)&#10;    Talisman (Revised 4th Edition)&#10;&#10;&#10;&#10;&#10;",
        "artist": "Christos Achilleos,Gary Chalk"
    },
    {
        "name": "Escape from Colditz",
        "description": "One player takes the part of the German Guards, whilst the others play &quot;Escape Officers&quot; who are responsible for organizing escape attempts by their team of prisoners.  Generally, the winner will be the Escape Officer who achieves the most successful escapes; but it might be the German Forces, if they are able to limit the number of escapes.&#10;&#10;The game has been reedited in 2006 by Devir in Spain, with a totally new graphic design and a rewritten rulebook based in the original edition by Gibsons Games . This new edition has been supervised and approved by the original designer, Brian Degas.&#10;&#10;",
        "artist": "Antonio Catalán,Peter Dennis"
    },
    {
        "name": "Pizza Party",
        "description": "Pizza Party is a quick and simple variation of Memory for children which becomes much more adult and exciting when money is wagered on the outcome. Each player gets a color coded pizza slice with six slots used to hold ingredient discs. There are six discs of four different toppings placed face down on the table along with two &quot;switch&quot; one for each color. Players flip one over on their turn and add it to their slice if it matches the topping they already have. If a &quot;switch&quot; one is revealed, the player trades his or her slice with the player of the corresponding color or with any player if his or her own color is revealed.&#10;&#10;Ages 4 to 8&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Galaxy: The Dark Ages",
        "description": "This is the much-awaited sequel to AH's Titan: the Arena.  Originally, this game was Knizia's Grand National Derby, but two successive changes in theme have added much chrome to the design.  The basic idea remains intact: there are eight alien races, and at the end the only three will remain; bet on the aliens you think will make it to the end.  Numbered cards, starships in this case, are played below the alien homeworld cards.  As soon as each alien has a ship card and there is a definitive loser, said loser alien race is removed and a new round starts.  Several of the alien powers differ from those of TtA.  This version of the game adds further detail by calling the betting chips &quot;starbases&quot;, which may be targeted by opponents' ships to lower their value.&#10;&#10;",
        "artist": "Rodger B. MacGowan,Kurt Miller,Mark Simonitch"
    },
    {
        "name": "Tyranno Ex",
        "description": "Players attempt to shepherd their chosen dinosaurs through an ever-changing environment.  Each player attempts to alter the environment during every game round.  Extinction looms for those who can not survive in the current environment.  Even those that can survive the environment need to survive a round of combat from opposing player's dinosaurs.&#10;&#10;",
        "artist": "Jean Baer,Dave Dobyski,Charles S. Jarboe, Jr.,Charles Kibler,Michael Präpasser"
    },
    {
        "name": "Fast Food Franchise",
        "description": "Players compete with each other to start fast food corporations, open new markets, launch advertising campaigns, and build nationwide chains of restaurants.  The winner is the first player to make a million dollars, or be the only player left in the game if all other players go bankrupt.&#10;&#10;",
        "artist": "Jennifer Angerman,Armand Cabrera,Thomas Lehmann"
    },
    {
        "name": "X-Men Alert",
        "description": "Each player starts with two of eighteen X-Men superheroes each with its own strength, endurance, intelligence and cheater power. Three battle zones on the board are populated with cards that show either villains to fight or heroes to recruit. Special dice determine whether players give or take hits in each battle. The goal of the game is to build up your team of superheroes and use them to defeat villains for points to win. The game includes detailed plastic figures for each of the X-Men.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Chill: Black Morn Manor",
        "description": "Players lay tiles to build Black Morn Manor, where an evil Master resides.  Most players take on the roles of Envoy, who need to discover the Master's identity, find the item to which he is vulnerable, and destroy the Master.  One player starts as a Minion, who attempts to find the influence item and remove it from the grounds.&#10;&#10;",
        "artist": "Andria Hayday,Oliver Schlemmer,Stephen Sullivan"
    },
    {
        "name": "Breakout: Normandy",
        "description": "Breakout: Normandy is a complex two-player wargame on the Allied invasion of France in World War 2.  The game concentrates on the initial landings and the subsequent breakout attempts.  The German player tries to prevent the a successful Allied landing, and if that fails, to contain the beachhead.  The Allied player wins by establishing a beachhead, or (better) by successfully breaking out of the landing area.&#10;&#10;The mapboard depicts the Normandy area where the initial landings took place.  Units are regiments and brigades, representing infantry, airborne, armour artillery, anti-tank and anti-aircraft units.&#10;&#10;The game uses the area-impulse system used in Storm over Arnhem, Thunder at Cassino and Turning Point: Stalingrad.&#10;&#10;",
        "artist": "Charles Kibler,Art Lupinacci"
    },
    {
        "name": "Escape from New York",
        "description": "&quot;Snake, I thought you were dead!&quot; This modest board game, based on the John Carpenter movie, casts each player as Snake Plissken, an ex-con sent on a rescue mission into a giant prison once known as New York City. Players begin with weapons and equipment cards used to help fight enemies and find clues. Cards can be lost in fights or gained at landmark spaces. Turn in matching clue cards at the corresponding location to rescue the president or his important tape. To escape, you still need to find a glider or a map to the mine fields.&#10;&#10;Fans of the movie will enjoy the chance to encounter Slag, Brain, Cabbie, Maggie, the Duke, and Romero with the opporutnity to gain them as allies during the game. Players win by obtaining the Tape first and foremost, failing that - the President himself. The game is very faithful to the movie and players will find that they can mirror many scenes of the movie in the game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "San Francisco",
        "description": "The game is set in San Francisco after the great earthquake, and players are charged with rebuilding the city.  The board is a fairly straightforward affair with the matrix randomly populated with building tiles.  Players compete in various auctions for the right to place possession rods around the tiles and when a clear plurality is established the tile is scored by that player.  There are a number of different auctions: sequential money bidding (akin to High Society), by blind bidding one of the three building types with clashes determined by money bids (akin to Basari), blind influence point bidding with like bids cancelling (akin to Raj/Hols der Geier).  After a set number of turns which see a building erected, the player with the highest point total wins.&#10;&#10;",
        "artist": "Oliver Freudenreich"
    },
    {
        "name": "Trajan",
        "description": "Trajan is a two player wargame covering the military campaigns of Roman Emperor Marcus Ulpius Nerva Trajan from 114 to 117 AD. The game is strategic in scale, with units representing Roman and Parthian forces, and their allies. The mapsheet, overlaid with a hexagonal grid, covers an area corresponding approximately to modern day Iraq, Iran and Kuwait.&#10;&#10;Game components consist of mapsheet, counters, rules and game charts.&#10;&#10;",
        "artist": "Eric Brune,Callie Cummins,Mark Simonitch"
    },
    {
        "name": "Germania",
        "description": "Germania is a two-player wargame covering Roman campaigns in Germania. The game is strategic in scale, with units representing Roman legions, barbarian war bands and allied troops. The mapsheet, overlaid with a hexagonal grid, covers the area of operation.&#10;&#10;Game consists of a 22 x 34 map, 280 counters, 13 pages of rules and 1 random events chart.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "War of Resistance",
        "description": "War of Resistance is a detailed, operational level game which cronicles the second Sino-Japanese Conflict starting on July 7, 1937. Often touted as the true beginning of World War II, this 8 year war is the culmination of a decade of aggressive Japanese policy in northern and central China. The game covers the conflict through Pearl Harbor on December 7, 1941.&#10;The Chinese theatre is neither trivial nor inconsequential to the progress and outcome of World War II on a global scale. Over one million soldiers on each side perished. It is estimated that another 7.5 million Chinese civilians died. Over 40 million Chinese were left homeless. The vast majority of Japanese ground combat and support soldiers were engaged in China, preventing their use against the western Allies in the Pacific. America's material dominance may have been the decisive factor contributing to the Japanese demise, but Japan was already doomed to failure in the Chinese quagmire. This is essential to the greater understanding of the war in the Pacific.&#10;Western nations tend to ignore and forget the Chinese contribution to the war effort. It is an indication of western arrogance that World War II is considered to have started on September 1, 1939 and not July 7, 1937. The Chinese war effort was far from stellar, but it was enormous. The immensity of the conflict sapped the Japanese war machine to exhaustion.&#10;War of Resistance is a two-player game, with one player representing the military high command of the Japanese forces and their puppet allies, and the other the fractured Chinese military forces. The Japanese player must force the collapse of the Chinese national will to resist. The Chinese player must cling to survival until the entry of the western nations into the Pacific war ensures ultimate victory over the Japanese invaders. Both sides maneuver their forces and conduct combat in an attempt to achieve these goals.&#10;&#10;Game Components:&#10;&#10;    One rules booklet.&#10;    Two Orders of Battle booklets. One for the Japanese and one for the Chinese orders of battle.&#10;    A Battle Scenarios Booklet&#10;    Four &quot;full-sized&quot; maps (Maps G1 thru G4) and 2 &quot;half&quot; maps (Maps G5 and G6).&#10;    Two map overlays&#10;    8 counter sheets (CS G1 - CS G7)&#10;    A set of charts &#10;    Two six-sided die&#10;&#10;&#10;&#10;&#10;",
        "artist": "Winston Hamilton,Darla Hamilton"
    },
    {
        "name": "The Game of France, 1940: German Blitzkrieg in the West",
        "description": "France 1940 is an operational level simulation of the German invasion of France in 1940.  Units are corps and divisions, with important regiments and brigades represented. The map covers the German-Franco border, from the parts of the Maginot Line to the English Channel.&#10;&#10;The game consists of standard rules, advanced rules incorporating more complexity and realism and an Idiot's Rule, simulating the initial inflexibility of the Allied command. Six German and eleven Allied orders of battle allow players to experiment with game balance as well as explore various &quot;What ifs&quot;.&#10;&#10;The game comes with detailed designer's notes, giving insight into both game design and the actual campaign.&#10;&#10;The first incarnation of the game appeared as an insert in Strategy &amp; Tactics magazine #27(1971), and was subsequently republished by Avalon Hill in 1972.&#10;&#10;224 counters (includes the 27 blanks) = Boxed Edition&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Bitter Woods",
        "description": "Bitter Woods is a mid-complexity wargame on the last great German offensive in Dec 1944, commonly known as the &quot;Battle of the Bulge&quot;.  The map depicts the area of operations, the Ardennes area at the borders of Germany, France, Belgium, and Luxemberg.  Prominent features like roads, rivers and cities are depicted.  A hexagonal grid is superimposed over the map to regulate game play.  Each hexagon is 2 miles across, unit size is brigade and regiments.  Each turn represents 12 hours of real time.&#10;&#10;Game features include morale, prominent leaders, blitzkrieg tactics, German army boundaries, initial surprise, Allied air power and much more.&#10;&#10;Game components include one 22 x 32&quot; unmounted map, 320 counters including markers, 16-page rulebook.&#10;&#10;",
        "artist": "Mark Simonitch"
    },
    {
        "name": "Trax",
        "description": "from the Trax site:&#10;&#10;Trax is a two player abstract strategy game of loops and lines. It can be played on any flat surface (no board). The square tiles have straights on one side and curves on the other.&#10; The rules of TRAX are simple: place tiles adjacent to those already in play such that the colours of the tracks match. The objective is to get a loop or line of your colour while attempting to stop your opponent in their colour. What gives Trax its strategic depth is the forced play rule which allows (or even requires) multiple tiles to be played in a turn.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Minos",
        "description": "from rules:&#10;4,000 years ago, Crete was ruled by Minos, son of Zeus and Europa.  It was from his name that the current civilization was called &ldquo;Minoan&rdquo;.  It was the first advanced civilization in Europe.&#10;&#10;The game Minos takes you back in time; build your own trading empire by crossing the Mediterranean Sea with your ships and founding new settlements and trading centers.&#10;&#10;Aim of the Game&#10;&#10;The game ends when all the city sites have been settled and at least two full cities have been built.  The winner is the player with the highest income at this point, as marked on the scale around the edge of the board.  A tie is resolved in favor of the player with the most cash in hand.&#10;&#10;",
        "artist": "J. C. Sohier"
    },
    {
        "name": "Maul of America",
        "description": "Maul of America is a beer-and-pretzels boardgame about shoppers trying to escape a zombie-infested shopping mall.  One player controls all zombies while each of the other players control shoppers trying to escape the mall.&#10;&#10;Game includes 4 doublesided 11&quot; by 17&quot; mapboard, 25 zombie and 5 shopper pieces, 3 decks of cards (12 sheets; 9 cards per sheet), 3 sheets of stickers (20 stickers per sheet), 2 dice and rules.&#10;&#10;Deck Breakdown: Search = 45; Shopper = 36; Zombie = 27&#10;&#10;Online Play&#10;&#10;&#10;     Ludoholic (no longer available)&#10;&#10;&#10;Expanded by:&#10;&#10;    Chopping Maul&#10;    Raid on the Mall&#10;&#10;&#10;&#10;&#10;",
        "artist": "Steve Bryant"
    },
    {
        "name": "Panzerkrieg",
        "description": "Panzerkrieg is a simple-mid complexity operational level game of the military operations in Southern Russia during World War 2.  The game is played on a map depicting southern Russia from its western border with Rumania and Poland in the west to the Caucasus mountains in the east.  Units are basically German divisions and Russian corps, with multiple units being able to merge to form German corps and Russian armies.  Each game turn represents approximately 1 week of real time.&#10;&#10;Game rules include armoured exploitations, leaders, supply, combat reserves, rail and naval movement, air power,  and Axis satellites.  The game consists of 9 separate scenarios, each depicting an important operation.  There is no campaign game.&#10;&#10;The game comes with rules, 22&quot; by 32&quot; mapboard, 520 counters, charts and a detailed scenario folder.&#10;&#10;Note: The OSG edition comes with 500 counters&#10;&#10;",
        "artist": "Rodger B. MacGowan,Masahiro Yamazaki"
    },
    {
        "name": "Domain",
        "description": "Domain is a simple game played on a 9x9 square grid.  Players take turn placing coloured plastic pieces onto the board.  The pieces have different areas and shapes.  The aim of the game is to have the largest area at the end of the game.&#10;&#10;When pieces are placed, they may cause adjacent pieces on the board to flip over, depending on the variant played.  In one variant, only the opponent's pieces are turned over.  In another, all adjacent pieces are turned over.  In yet another variant, the pieces are divided up equally before starting, instead of players drawing from a standard pool.&#10;&#10;Game consists of rules, a 9x9 board and 26 plastic pieces, coloured on both sides.&#10;&#10;Online Play&#10;&#10;&#10;     BoardSpace.net known as Phlip there; (real-time, AI option)&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Thunder at Cassino",
        "description": "Thunder at Cassino is a mid-complexity wargame on the Third Battle of Monte Cassino during the Second World War. The game uses the area-impulse system first used in Storm over Arnhem, and to be used subsequently in Turning Point: Stalingrad and Breakout: Normandy.&#10;&#10;The game depicts the battle from 15 Mar 1944 to 23 Mar 1944. The Allied attackers consisted of elements of the 2nd New Zealand Corps, comprising the New Zealand 2nd Division, the Indian 4th Division and the British 78th Division. The German defenders are mainly from the elite 1st Fallschirmj&auml;ger Division. The game map depicts the town of Cassino, its renowned monastery and the surrounding environs, divided into areas to facilitate movement and combat. Units are mainly infantry platoons, armor platoons depicted.&#10;&#10;The game comes with two introductory scenarios, a end-of-battle scenario and a campaign game featuring the entire battle. Playing time varies from 60 minutes to 360 minutes depending on scenario chosen.&#10;&#10;Game consists of a 22&quot; by 24&quot; mounted map, 478 unit counters, rules and charts.&#10;&#10;",
        "artist": "Charles Kibler,George I. Parrish, Jr."
    },
    {
        "name": "Black Vienna",
        "description": "In this thinly-themed game, players seek to uncover the three spies who have their identities hidden.  There are twenty-seven possible suspects, represented by twenty-seven lettered cards (with the umlauted O).  Three of the cards are removed, as they are the spies.  The remainder are dealt out to the players.  Then players take turns 'asking' each other for information by playing a card with three letters in front of the informant.  He must then look at his cards and place either zero, one, two, or three chips on the card, depending on how many of those letters are part of his secret collection.  The first player to correctly identify the three missing spies (letters) is the winner.&#10;&#10;",
        "artist": "Jim Ferreira,Martina Irion,Steve Sisk"
    },
    {
        "name": "Lunatix Loop",
        "description": "Described by the Publisher/Designer:&#10;&#10;In Lunatix Loop players attempt to be the first racer to complete three laps around a patchwork track of asphalt and dirt while attempting to keep their cars in one piece.&#10;&#10;Each racer straps himself in for the harrowing ride of his life, his little plastic shell of a car the only thing protecting him from the rams of his opponents. Each racer becomes his own worst enemy as he pushes the limits of his car and his psyche. The stresses of racing life and curves taken too fast are more than enough to justify the nickname, &quot;Lunatix&quot;, that the racers have earned.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Turning Point: Stalingrad",
        "description": "Turning Point: Stalingrad is mid-complexity wargame on the battle of Stalingrad during World War 2. Attackers from the German 6th Army must dislodge the Russian 62nd Army and take the city of Stalingrad before the commencement of Operation Uranus. If the city could be taken, German troops could then be re-deployed to reinforce the Italian and Rumanian formations holding the flanks of along the Volga. The fiasco at Stalingrad can then be prevented.&#10;&#10;The game is an operational level treatment of the actual streetfighting. Each turn is a day comprising of a variable number of daylight and night impulses. Units are battalions and armoured units representing AFVs in platoon and company strength. The map is on a scale of 1 inch to 500 metres, depicting the city of Stalingrad and its western approaches, divided into 74 areas divided according to terrain features, and rated for defensive suitability. Victory is determined by the number of objectives captured by the German player each week. If it exceeds the requirements for the week, he wins. If not the Russian player wins. If it is equal to the victory requirement, the game is extended by another week, with a different(higher) victory objective requirement.&#10;&#10;Game comprises two 22&quot; by 16&quot; mounted mapboards, counters, rules and charts.&#10;&#10;The game uses the area-impulse system used in Storm over Arnhem, Thunder at Cassino and Breakout: Normandy.&#10;&#10;",
        "artist": "Charles Kibler,George I. Parrish, Jr."
    },
    {
        "name": "Battle Line",
        "description": "Two opponents face off across a 'battle line' and attempt to win the battle by taking 5 of 9 flags or 3 adjacent flags. Flags are decided by placing cards into 3 card poker-type hands on either side of the flag (similar to straight flush, 3 of a kind, straight, flush, etc). The side with the highest 'formation' of cards wins the flag.&#10;&#10;This is a rethemed version of Schotten Totten with different graphics and wooden flag bits in place of the boundary stone cards.  Game play is identical, except the cards run from 1 to 10 (not 9), you hold seven cards in your hand (not 6), and the rule that stones may only be claimed at the start of your turn is presented as an &quot;advanced variant&quot;. Also the tactics cards were introduced by Battle Line; these cards were only added to later editions of Schotten-Totten.&#10;&#10;Some have reported that the production quality of the cards is inferior to the Schotten Totten cards, however, for most readers Battle Line will be much easier to find in stores.  In the second edition of GMT's Battle Line the card quality is higher.&#10;&#10;",
        "artist": "Roland MacDonald,Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "The Great Brain Robbery",
        "description": "Welcome to the Old West, Zombie style. The undead line cooks at Friedey's Chuck Wagon are fed up with having only one Brain to pass around. So they've decided to take matters into their own hands and rob a speeding train full of Brains. They'll bring home the best Brain they can find, and then pass that around instead. Hey, no-one said it was a good plan.&#10;&#10;This is the fourth game in the Friedey's series, and the first Cheapass board game to come in a sturdy cardboard box. The &quot;board&quot; is composed of eight double-sided Train Cars, and the Train grows and shrinks throughout the game. New cars appear in the front as players move forward, and old cars fall off the back, well, sort of randomly. To win the game, you need to find the Brain with the highest IQ before the Train comes to a stop, and defend it from all the other Zombies who'd rather beat you up than find a better Brain on their own. A splendid and imaginative adventure for 3-7 players, illustrated as always by lovable Zombie artist Brian Snoddy.&#10;&#10;",
        "artist": "Brian Snoddy"
    },
    {
        "name": "Mad Gab",
        "description": "From the game box:&#10;&#10;Read a group of simple words aloud, like &quot;ASK RUDE ARRIVE HER&quot;.  Do you &quot;hear&quot; the answer?  Try saying them again.  Sound familiar?  Quick, the timer's tickin'.  Did you hear yourself say &quot;A Screwdriver&quot;?!&#10;&#10;You and your teammates have 30 seconds to sound out three puzzles.  Guess right and snatch that card!  Miss it and the other team can steal the point!&#10;&#10;O.K., the timer is set, the card flipper is loaded, and everyone's ready for a laugh riot!  Just remember, that when it comes to scoring points in MAD GAB...&#10;&#10;&quot;It's Not What You SAY, It's What You HEAR!&quot;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Space Walk",
        "description": "A mancala-like game with victory points awarded to surviving space ships. The board consists of a loop of &quot;black holes&quot; each separated by 6 intermediate spaces. A move consists of picking up all the space ships of one space and sowing them in a mancala fashion around the board. Ships that fall into a &quot;black hole&quot; are lost forever. The game ends when one person has lost all ships.&#10;&#10;Several rules twists help make this more than a simple mancala knock off. For one, ships come in 3 sizes (victory points of 4, 3, and 1), and there is a requirement that the bigger ships are sown first. Second, each player has 3 chips that allow an extra move, but are worth 2 victory points if unused. The strategy comes in figuring out how to use your opponent's ships as sacrifices in getting your ships around the black holes.&#10;&#10;Awards&#10;&#10;1999 Vuoden Perhepeli&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Regatta",
        "description": "The object of the game is to be the skipper of the yacht that crosses the finish line first. You decide when to tack, and when to put up your powerful spinnaker for the downwind leg. You try to take advantage of unexpected wind shifts and blanket your opponents sails. All the facets of real sailboat racing are included.&#10;&#10;The 1968 version includes three islands and 24 cards.  The 1970 version includes a single island and 18 cards.  The suggested courses also vary between editions.&#10;&#10;Originally released as part of the 3M Sports Games line.&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "Keytown",
        "description": "Described by the Publisher/Designer:&#10;&#10;Keytown is a game for two to five players lasting approximately 60 to 75 minutes. Each player controls a team of townsfolk, which they promote as the new leaders of Keytown. In the &lsquo;olden days&rsquo; (in the game Keydom), these teams specialized in different activities: mining, fishing, forestry, brewing, and farming. With the passing of time, the townsfolk became skilled in each of these activities. They then aspired to gain further skills and experience as churchmen, councillors, and tradesmen. With these new skills came seniority, prestige, and high standing amongst their peers.&#10;&#10;In the game, the townsfolk and their seniority are represented by numbered tiles. Keytown is played over four rounds. Each round represents a generation in the lives of the townsfolk, during which the townsfolk may work or study in the resource locations, gain new skills in the church, council, or market, or start a family in a cottage. After four generations, one of these teams is destined to emerge as the new leaders of Keytown. The winner of the game is the player whose townsfolk are collectively held in the most esteem at the end of round four.&#10;&#10;Like Keydom, contents include full colour board, printed counters, and wooden cubes. Rules and components are in English and German.&#10;&#10;Keytown is Richard Breese's third game in the key series.&#10;&#10;",
        "artist": "Juliet Breese"
    },
    {
        "name": "Star Trek Red Alert",
        "description": "A Diskwars variant for fighting space battles in the Star Trek universe. Cardboard disks are used as miniatures to represent space ships, crew, and technology.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Loot",
        "description": "The cards show trading ships and pirate ships, with pirates and an admiral. Players send a trading ship of value on a voyage in which it must survive a round of attacks from other player's pirate ships. You defend your traders with your own pirates and collect the spoils of your attacks elsewhere.&#10;&#10;Description for the Heidelberger release:&#10;&#10;Essen release, 2002. In the nice small black box, with embossed lettering. An improved version of Buccaneer. This game has 25 Trade ships worth different amounts of gold (from 2 to 8), 48 Pirate ships, 12 each in 4 colors. The Pirate ships are worth 1-4 skulls (the player with the most skulls played on a trade ship captures it if the lead is kept for one full pass around the table). There are 4 Pirate Captains (1 of each color) to help win the battles and 1 Admiral to help defend the trade ships. The game is playable with 2-5 players individually. With partners it can be played with up to 6 or 8.&#10;&#10;2005 Mensa Select&#10;&#10;Buy Microbadges&#10;&#10;Loot Fan&#10; &#10;&#10;",
        "artist": "Gary Locke,Chechu Nieto,Pierre-Louis Puaud,Franz Vohwinkel"
    },
    {
        "name": "Kings and Castles",
        "description": "The last English King (as opposed to King of England) died in 1066. This game is about what happened next. The men who occupied the throne for the next 400 years were a particularly unpleasant bunch, whose main thought was of personal aggrandisement. Having deprived the English of the right of self-government, the more energetic of them set about trying to do a similar job on their neighbours. In Kings &amp; Castles the players take the part of these men as they pursue their ambitions at home and abroad. The treatment is broad-brush and fairly abstract: there is a map and the counters carry pictures of castles and soldiers, but you don't have to start worrying about dice and combat results; this is not a wargame.&#10;&#10;Players take turns to conquer as many regions as possible with their own and opponents forces - an intriguing mechanic - then decide whether to tax the hard working peasants or not. Plenty of decision making and room for tactics with a different player/king sequence every time you play.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Ausbrecher AG",
        "description": "Seven criminals are escaping from the prison island Monte Ganovo and must reach the 4 small boats waiting for them. But the first boat is a sinking wreck whilst the fourth boat is a modern speedboat, so the seven must time their run down the path to be last, not first. The players start by writing down their prediction of the finishing order of the prisoners, then use the matching colored dice to move the prisoners forward or backward along the path to the boats. The boats are numbered 1 to 4, so the better your prediction, the more points you score. A very funny but simple dice roller, which works better with more players. The game is re-issued in 1998 by Simba as Tr&ouml;deln, where the children want to be last into class so they sit at the back.&#10;&#10;Reimplemented by:&#10;&#10;     Tr&#195;&#182;deln&#10;&#10;&#10;&#10;&#10;",
        "artist": "Heinz-Peter Fothen"
    },
    {
        "name": "Beim Zeus!",
        "description": "In this auctioning game, players bid to buy plots of land and build temples (requiring 1, 2, or 3 plots to build). &#10;The cost(s) of the plot(s) also determines the cost of the temple that will be later built on the plot(s).&#10;&#10;In the final scoring, players receive a variable score for each temple: a base score depending on the temple size (10, 30, and 150 for a size 1, 2, or 3 temple, respectively) multiplied by the number of temples of that size. The player's remaining money, plus bonus points for building on the different islands shown on the game board, are added to his/her score.&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Tabloid Teasers",
        "description": "Fictionary applied to tabloid headlines.  A partial headline (such as &quot;Man's Brain Kept Alive _______&quot; is read, and each player turns in a headline that fills in the blank.  The moderator then reads all the headlines, including the real one.  Players vote on which one they think is correct, and get points if they pick the right one, or if someone picks their fake answer.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Win, Place & Show",
        "description": "A race meeting consisting of 6 races, each with 6 horses of varying power and characteristics.  Board shows an oval track of six lanes, straightforward in straights but graduated on the curves.  Although dice play a part in the game there is plenty of room for skillful maneuvering in the course of each race, which can be from 5 furlongs to 1 1/4 miles.  An important part of the game is provided by certain marked squares: if you can get your horse to stop on one of these it can overtake one horse ahead of it in the same line, which can be vital considering that only two swerves are permitted in each turn (only one if the jockey is an apprentice).  Every horse has a distinctive racing pattern (slow or fast starter, stayer or fader etc.) represented by a set of numbers, one for each turn.  These numbers are added to a single dice throw (common to all the horses), so that the speed of each race can vary substantially.  There are many other interesting factors too numerous to describe in a short review.  Odds on each horse are pre-set and depend largely on the number patterns described above.&#10;&#10;Originally released as part of the 3M Sports Games line.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Letter Head",
        "description": "From a review:&#10;&#10;Actually many games (14) in the same box. Equipment is a set of cards each showing one letter and a point value (there are also wild cards).&#10;&#10;You have a hand of up to 10 cards (you can draw as many as you like until you reach 10 - you start with 5). On your turn, you play a word to the table, with as many cards as you like face down. You announce the word, and everyone gets a chance to doubt you. You then show all the cards - if no one doubted you, you get the points for what you played (which could be QXZV, for a huge number of points). If someone did, you score if you were honest, with a bonus for each doubter. If you lied, the doubters get a bonus. You also get a bonus depending on your hand size and how many cards you played.&#10;&#10;",
        "artist": "Nicolas Gluesenkamp,J. Scott Reeves,Jeff Tidball"
    },
    {
        "name": "Discretion",
        "description": "A game of real estate development and speculation.  Players develop plots of land with different types of buildings (identified by color).  Building types will pay off periodically depending on card draws - with the amount determined by the number of contrasting adjacent colors.  Since expenses accrue every turn, but revenues are unpredictable, risky play can be very expensive, forcing players to take out loans - sometimes with pricey loan sharks who can send a player into a death spiral.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Dog Eat Dog",
        "description": "In this decidedly politically un-correct game, players control corporations which are plundering the environment  to produce assorted products, all for the sake of the almighty dollar.  Each of the companies produces a slightly different product, which is made by combining two different raw materials.  The raw materials come from various parts of the center of the board.  When a company harvests these materials, they can choose to either take one, which retains the environment's purity, or they can take multiples, which can turn the area into an ecological wasteland.  Players must balance a work force which is used to collect and process the raw materials, and they must then try to get the best price for the finished product in a randomly adjusted market.  Typically in games of this nature, the corporation who makes the most money is the winner, but in this morally corrupt environment, it's the CEO who makes the most money who's deemed the winner.  And the only way to make money is by embezzling from your company...&#10;&#10;",
        "artist": "Lori Walls"
    },
    {
        "name": "Maxi Bour$e",
        "description": "Maxi Bour$e is a game that examines the world of stock holding.  Players move around a game board bearing the names of forty (real) international corporations (i.e., PepsiCo, IBM, Peugot, etc.), buying and selling stocks in each.  Stock prices change according to supply and demand.  Event and Rumor cards add uncertainty to the game, and the winner is the player who can gain control of an industry (by having more than half the stock of three of the four companies within an industry) or build a conglomerate (by having more than half the stock of five companies, each in a different industry).&#10;&#10;Won the Internal Correspondence 1989 Gaming Flop of the Year.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Palermo",
        "description": "This game is divided into two sub-games.  The first part has players laying out street/business tiles.  Each tile has one business on it and a colored chip corresponding to the player who placed it.  Once the board is filled, play moves to the next stage.  Each player has a pawn next to the fountain at the center of the board.  The object is to visit each of the businesses that you laid out in the first phase.  Each successive business you visit gives you more movement points, but the real goal of the game is to score the most points.  Points are scored by forgoing remaining movement when you arrive at your businesses.  In addition to a scoring pawn, players are each given a police token which can be used to hamper other players' movements.  Players who have completed their circuit wait at the fountain until all players have finished, but finishing quickly gives you a point bonus for each turn you wait.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Tales of the Arabian Nights",
        "description": "&#10;&#10;&#10;    &#10;        This entry is for the West End Games version and other printings.  For the 2009 Z-Man Games version, go to Tales of the Arabian Nights&#10;&#10;    &#10;&#10;&#10;Tales of the Arabian Nights is actually several games in one.&#10;&#10;In the standard game, the players are characters living in the 1001 Nights universe, wandering about the map and having adventures. These adventures are designed in a sort of paragraph system, with the player to your left reading what happens to you and exposing the choices you have - choices that then lead to other paragraphs or outcomes. The characters evolve during their adventures, acquiring skills of various degrees of advancement to open up new options and various &quot;statuses&quot; (such as married, despondent, cursed, etc) which also affect play.  The object is to become rich and come back to Baghdad.&#10;&#10;Other variants of the standard game include the Quest game, which forces you to roam the map looking for quests to fulfill.  There's also a Merchant game, where your adventures give you arrow tokens which are used on a little separate board to simulate the progress of your caravans.&#10;&#10;The German edition, Geschichten aus 1001 Nacht, was published in 2000 and contained a revised Book of Tales along with some extra adventures.&#10;&#10;Re-implemented by:&#10;&#10;    Tales of the Arabian Nights&#10;&#10;&#10;&#10;&#10;",
        "artist": "Larry Catalano,Stephen Crane,Ingmar Drewing,Larry Elmore,Jens Haupt,Christopher T. Miller,Steve Weiss"
    },
    {
        "name": "Focus",
        "description": "Focus (or Domination) is a Sid Sackson abstract strategy game in which players attempt to make moves and capture pieces in such a manner that their opponent(s) have no moves remaining.&#10;&#10;On a turn a player may move a piece or stack of pieces based on the number of pieces that comprise it as well as the number of pieces to be moved (e.g. 1-piece = 1 space, 3 piece stack = 3 spaces.)  When a stack grows over five pieces, pieces from the bottom of the stack are removed to bring the stack back down to five.  Pieces of a player's own color that are taken by that player are reserved to re-enter the game at a later time; pieces of the opponent's color are kept as captured.  Reserved pieces can be entered on a turn in any space on the board in place of making a move of pieces; strategic use of reserved pieces can make the game by utilizing them to capture stacks controlled by opponent(s).&#10;&#10;Sackson includes the game In his 1969 book, A Gamut of Games.  The book  makes a reference to the Whitman Publishing  Company production of 1965, along with reporting that the two-handed version was first described in the October 1963 issue of Scientific American Magazine.&#10;&#10;Re-implemented by:&#10;&#10;    Stacked&#10;&#10;&#10;&#10;&#10;",
        "artist": "Marion Pott"
    },
    {
        "name": "Terra Turrium",
        "description": "from translation&#10;&#10;Each player builds towers and whoever is the first to place his six flagpoles on 6 towers of different heights ( 6 blocks high, 5 blocks high and so on down to 1 block high ) is the winner.&#10;&#10;",
        "artist": "Tilman Michalski"
    },
    {
        "name": "Löwendynastie",
        "description": "from a session report:&#10;&#10;In essence it&rsquo;s a round-and-round trick game, combining Frank&rsquo;s Zoo with Hattrick. 4 suits valued 1-10. High beats low. Net (or joker) beats 10. A 1 (or joker) beats Net. And then we&rsquo;re back into the numbers and round we go again. The trick is won when everyone passes.&#10;&#10;7&rsquo;s, 8&rsquo;s and 9&rsquo;s each have a sex. When one is played, if a player can play the same rank but of an opposite sex, a second trick is formed a la Hattrick. It&rsquo;s a powerful play, because the round then ends the moment either trick gets back to whoever played a currently winning card, improving the odds of you winning a trick. And causing all sorts of calculations as to what the best play is.&#10;&#10;Winning a trick with a net, or someone playing their last card induces a new deal. If you have a crappy hand, let a net win, concede and get a new hand. Otherwise, kick-start it again with a 1.&#10;&#10;In the round that someone wins their tenth trick (you start with 1, so it&rsquo;s actually the ninth trick), the last player to win their tenth trick in that same round wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Yahtzee Deluxe Poker",
        "description": "Last Chance is contract Yahtzee with side betting. Each player starts with a stake of chips. One of seven cards is overturned which shows a combination a player must roll on five dice. The tougher the combo, the more the cards are worth if won. Players bid on the chance to roll for the card. Those who don't win the bid can bet for or against the roller. If the roller makes the combo, he gets his bid back plus the card's stated value plus any bets made against him. If he fails, he loses his bid money. Any dice he applied to the combo stay on the card and players bid again on the partially completed card. If a player is low on cash, he can call &quot;last chance&quot; during bidding to win the bid automatically. Failure to make the combo will cost that bidder the game, however. Whoever has the most chips and at least one card by the end of the short card stack wins the game.&#10;&#10;",
        "artist": "Comicon S.L."
    },
    {
        "name": "Foil",
        "description": "Foil is a word card game in which players draw and discard letter cards until one player can make words using all the cards in his or her hand.  All players then shuffle the letters of words they have made and then have five minutes to unscramble the words of their opponents.  Players score for words they have made, opponents' words unscrambled, and for forming words that no opponent unscrambles.&#10;&#10;Belongs to both the 3M Bookshelf Series and the 3M Gamette Series&#10;&#10;",
        "artist": "NA"
    }
]