[
    {
        "name": "Popular Front",
        "description": "&quot;Over all of Spain, the sky is clear.&quot;&#10;&#10;On July 17, 1936, this phrase was broadcast throughout Spain, signaling the beginning of the Spanish Civil War, one of the bloodiest civil wars of the modern era, and what could be considered the beginning of World War II. Within a day, one third of Spain was under the control of Nationalist forces attempting to stage a military coup. Over the next three years, what began as a military rebellion evolved into the physical battle lines of the much larger ideological conflict spreading across Europe between Fascism and Communism.&#10;&#10;Popular Front recreates this conflict in 90-minute strategy game form, leading players to compete against their ideological counterparts not only for military positioning, but for political victory. Players must be concerned about the position of their forces on the board, but the composition of a player's hand will affect their success in combat more often than not. Plays with two, four, or six players split into two teams. Players each have an identical 20-card deck (with unique, original propaganda posters actually used in the war) that results in the use of your cards being more important than the luck of the draw. Strategic thinking, trickery, teamwork, and a dash of courage are what lead to victory in Popular Front.&#10;&#10;",
        "artist": "Nick Bonamy,Patrick Stevens,Orlando Villagran"
    },
    {
        "name": "12 Realms",
        "description": "Siegfried, Snow White, D'Artagnan, Red Riding Hood, and the other heroes of the twelve realms are being reunited for one last great adventure. The Dark Lords have joined forces to completely conquer and subjugate all the known Lands, and only the combined efforts of all the greatest heroes can halt their nefarious plan.&#10;&#10;12 Realms is a fast, lighthearted cooperative miniature game for 1 to 6 players. All players must band together to stop the Dark Lords' overwhelming hordes from pillaging the 12 Realms. Individual invaders can be defeated by using each hero's different talents, but to vanquish the Dark Lords you must claim a powerful artifact.&#10;&#10;In their quest to stop the invasion, the heroes can travel together between different lands, or they can try to single-handedly defend a Realm. Each of the 12 Realms is an individual land, with different treasures and events, and populated by unique creatures.&#10;&#10;",
        "artist": "Michael Andresakis,Marvin Aure,Ignazio Corrao,Jerome Jacinto,Ginny Rosales,Carlo Rosales"
    },
    {
        "name": "Storming the Reich",
        "description": "(from Compass Games website:)&#10;&#10;Storming the Reich is a game about the World War II Allied campaign to liberate Northwest Europe from Nazi occupation. It is a game of brutal attrition and slashing advances. Opening on the evening of D-Day, with the Allies on the beaches and the Germans reacting (albeit belatedly) to the landings, the game covers the full campaign through to the battle of the Ruhr Pocket in April of 1945.&#10;&#10;With plenty of armor, paratroop divisions, naval gunfire, air superiority and even the 79th Funnies, the Allies will break out from the beaches and race across France toward the Seine River. To keep pace with operations they will face difficult logistical decisions including the grounding of units and Red Ball Express in favor of other operations, a surprisingly thin infantry leash, and whether to give Monty the lead in offensive operations over Patton (or vice-versa)&hellip; For the Allies there&rsquo;s a chance at an early auto-victory for breaking out of the landing areas ahead of schedule, but they can quickly lose the game if they don&rsquo;t cross the Seine on schedule.&#10;&#10;The German player will need to counter the Allied push with a healthy dose of reinforcements (admittedly of low quality), but with very limited replacements. They will need to take advantage of opportunities to thwart the Allies such as when Monty looks the other way at Antwerp, and they can even win the game, although not the war, by launching a successful Counteroffensive (aka. The Bulge). Careful use of Panzer Brigades and Tiger Battalions in offense and defense will play a key role in stopping the Allies.&#10;&#10;Storming the Reich is a two-map game with units portrayed mostly at division level (with some armored brigades and battalions). Each hex is about 8 miles across (or about 13km). Each turn represents a month of operations accept during summer where each turn is 2 weeks. For players of Red Storm over the Reich, there are many similarities such as the variable movement allowances for both sides (a key feature for fog of war, variability, replay value, and solitaire play) and the same basic combat engine. A key difference is the elimination of the Redeployment Phase.&#10;&#10;There are 3 scenarios included. Scenario one is the full 15-turn campaign using both maps, beginning on D-Day and ending in April of 1945. The second is a one-map &ldquo;Normandy Breakout&rdquo; scenario &ndash; at only 4 turns it is a perfect learning scenario covering the initial desperate fighting following the landings. Lastly is a one-map &ldquo;Bulge to Victory&rdquo; scenario where both players really get to flex their gaming muscles.&#10;&#10;&#10;Ted Raicer's game on the campaign for Northwest Europe, using a variation of his Red Storm Over the Reich system. &#10;It does not link up with Red Storm Over the Reich.&#10;&#10;",
        "artist": "Todd Davis"
    },
    {
        "name": "Enemy Action: Ardennes",
        "description": "Enemy Action: Ardennes is the first in a series of card-driven war games on pivotal operations and campaigns in World War II, from John Butterfield, designer of RAF, D-Day at Omaha Beach, Ambush! and Hell&#226;&#128;&#153;s Highway. Each game in the series allows for play by two players or one player, playing either side in the conflict.&#10;&#10;Enemy Action delivers fun, tense wargaming with a focus on command and capabilities:&#10;- Low complexity with constant decision points for both sides;&#10;- Two-player competition;&#10;- Solitaire play of either side with an innovative system governing enemy command and tactics;&#10;- Card-driven impulse system, with multi-purpose cards that can be played to activate formations, implement command events, or gain tactical advantages in combat.&#10;- Diceless and chartless combat system &ndash; players draw combat chits that build a narrative of each combat.&#10;&#10;EA: Ardennes portrays the German offensive against the western Allies in December 1944 -- the Battle of the Bulge. Each player controls the German or Allied (US and British) side. If playing solo, the game system controls the other side.&#10;- Map scale: 2.5 miles per hex. Hexes are oversized for easy counter handling.&#10;- Unit Scale: Regiments, brigades and divisions&#10;- Time scale: One day per turn, with several impulses in each turn.&#10;&#10;BGG wiki page with many clarifications and hints and errata:&#10;Enemy Action: Ardennes German Solo FAQ&#10;&#10;",
        "artist": "Knut Grünitz,Timothy Schleif"
    },
    {
        "name": "Tanto Cuore: Expanding the House",
        "description": "Tanto Cuore: Expanding the House, both a standalone game and the first expansion for Tanto Cuore, brings a garden theme to the world of maid-collecting, with construction cards such as &quot;Garden&quot;, &quot;Lily Garden&quot; and &quot;Leaving&quot;.&#10;&#10;This is a Japanese deck-building card game which has a mechanism similar to Dominion.&#10;&#10;Each player plays as the Lord of a mansion and hires maids to fill out their house to become the King of Maids! The end goal is simple enough, the player who has the most Victory Points at the end of the game wins! Players acquire Victory Points by employing a variety of maids and &quot;Love&quot; cards that allow for different strategies. You can even employ Private Maids that stick around to use their special powers each per turn! Some give you a bonus, or affect your opponents in a negative way. But beware, your opponents can make your maids sick or give them bad habits, affecting your maids in negative ways and decreasing your Victory Points!&#10;&#10;The game art is in the Japanese anime style and uses the theme of maids commonly seen in anime! All of the cards, dividers and manual fit into an easy to transport box so you can easily take the game with you wherever you want.&#10;&#10;Tanto Cuore: Expanding the House includes 280 cards, with artwork from 27 artists.&#10;&#10;",
        "artist": "COMTA,Takahito Ekuchi,Takuya Fujima,Kira Inugami,Ishigaa,KEI,Souji Kusaka,Misa Matoki,Rin Minase,Miki Miyashita,Misoka Nagatsuki,Poyoyon Rock,Ruchie,Mutsumi Sasaki,Satoru Satou,Mushimaro Tachikawa,Yuiko Tokui"
    },
    {
        "name": "Boots on the Ground",
        "description": "Boots on the Ground is the new Worthington Games series that puts you in the middle of the action. Start your mission as the Team leader of an elite group of shooters. Your team consist of a Demo expert, Heavy Weapons Expert, Medic, Scout, Sniper and you, the leader. During your briefing you are told your objectives and known intel on the area. As always, intel always changes once the Boots are on the ground. Move your force through the urban area facing an unknown number of insurgents coming from you at all angles. As the team leader you decide if you stay as a group or send out your specialist to eliminate the enemy with their special skills. Also come on the field with another team, you and another player can fight the insurgents together as Alpha and Bravo team, while the insurgents move and engage both teams with equal resolve race to see which team can complete the objectives first.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Flee The Scene",
        "description": "You've hit the museum and jumped the train! But don't stay long. You've gotta be quick in this steal and deliver race game for 2-5 players.&#10;&#10;Flee The Scene is a fast-paced game of robbing museums across the Mediterranean. Players use trains, trucks and ships to steal antiquities and fence them off. Players can carry only three antiquities at a time and must optimize their movement to edge ahead of the competition.&#10;&#10;The aim of Flee the Scene is to steal and deliver the most rewarding antiques before the time runs out. Each delivered antiquity scores points. Once 1 player scores 13 or more points, all other players have 1 last turn before the game ends. The player with the highest score is the winner!&#10;&#10;",
        "artist": "Krzysztof Maziarz,Shem Phillips"
    },
    {
        "name": "Aether",
        "description": "Abstract strategy game in the world of ancient elements&#10;&#10;Aether is a tile placement game with simple rules but packed with deep and strategical game play. In Aether, players use the four primary elements - earth, air, water and fire - in the battle over the mystical fifth element Aether. Are you up to the challenge? Will you be the next ruler of the elemental planes?&#10;&#10;In the game of Aether, players place element tiles and elementals on the gameboard in pursuit of gaining control of the aether tiles. On his turn, a player must place an element tile on any empty hexagonal on the board. In addition, player may place an elemental on top of the tile he/she just placed.&#10;&#10;Each elemental on the board has its type defined by the type of element it is placed on. The elemental gains power from this type of element tiles: from the one it is sitting on as well as the ones surrounding it. In addition, each element has its counter element and all counter element tiles touching the elemental reduce its power.&#10;&#10;The player with the most elemental power surrounding an aether tile wins it for him/herself. At the end end of the game, the player score points for each won Aether tile as well points for elemenentals left unused. The player with the most points is the winner.&#10;&#10;",
        "artist": "Brian Kolodziejski,Jussi Kurki,Alvin Madden"
    },
    {
        "name": "Arvuutin",
        "description": "Arvuutin is a new kind of trivia/estimation game from Onni Games!&#10;&#10;The main idea is that players answer to each question by playing number cards from their hands. On his turn, a player chooses a question from one of the question categories. After the question has been read out loud, all players choose their answer by playing cards face down on the table. All answers are revealed simultaneously. Each question has an answer between 1-100 and player's answer is the sum of the numbers he played. The player whose answer is closest to the correct answer, wins the question card for himself/herself but loses the number cards he/she played. Players may also play 'pass'-card and skip the question, but get to draw new number cards instead.&#10;&#10;At the end of the game, players calculate their scores: players get points from won question cards and from hidden score cards that are dealt in the beginning of the game. During the game, players may influence what is the value of each question category at the end of the game - category's value depends on how many questions has been asked from that category. The game comes with eight question categories, from which five are chosen for each game. The player with the most points at the end of the game, is the winner!&#10;&#10;Arvuutin offers a fast paced and fun trivia-experience for all people! Arvuutin will be published in Finnish and is available fall 2010 in Finland.&#10;&#10;&#10;Arvuutin on kone, joka tiet&auml;&auml; vastauksen kaikkeen!&#10;&#10;P&auml;ivitt&auml;in pitk&auml; jono kansalaisia k&auml;y kyselem&auml;ss&auml; Arvuuttimelta mit&auml; kummallisimpia kysymyksi&auml;. Koneen vastaukset putoilevat numerokortteina vastauslaatikoihin ja tuppaavat menem&auml;&auml;n pahasti sekaisin. Pelaajat ovat Arvuuttimen ty&ouml;ntekij&ouml;it&auml;, joiden teht&auml;v&auml;n&auml; on setvi&auml; koneen antamat vastaukset.&#10;&#10;Arvuutin on uudenlainen tietopeli, jossa pelaajat arvioivat oikeita vastauksia kysymyksiin ja esitt&auml;v&auml;t arvauksensa pelin aikana k&auml;teen ker&auml;tt&auml;vill&auml; numerokorteilla. Pelin mukana tulee kahdeksan erilaista kysymyskategoriaa, joista pelaajat valitsevat kullekin pelikerralle viisi haluamaansa. Peliss&auml; ei menesty pelk&auml;ll&auml; kovalla tiedolla, sill&auml; sopivien numerokorttien ker&auml;&auml;minen on my&ouml;s t&auml;rke&auml;&auml;. Arvuutin tarjoaakin hauskan ja nopeatempoisen pelikokemuksen kaikille visailupelien yst&auml;ville!&#10;&#10;Kaupoissa syksyll&auml; 2010!&#10;&#10;",
        "artist": "Sampo Sikiö"
    },
    {
        "name": "Toledo 1085",
        "description": "On May 25, 1085, Alfonso VI conquered Toledo after four years of siege.&#10;&#10;Al-Qadir surrendered the city to Alfonso VI who guaranteed to protect persons and their goods, whatever their religion was. This started a period of pacific cohabitation between the three major religions (Christian, Jewish and Muslim) in the city.&#10;King Alfonso VI was particularly supportive of this coexistence and even tried to encourage him. To this end, he promised a special place in his court to all noble who would promote the harmony between the three religions.&#10;&#10;Each player is a noble of the city that will try to develop his city through science, culture and trade while paying attention to the cultural diversity and mixture of Toledo.&#10;&#10;Will you be the one chosen by the King to make Toledo the city of three cultures?&#10;&#10;[From the publisher's website]&#10;&#10;",
        "artist": "Antonio Bravo,María Corredera,Javier Jésus Domínguez Cruz,Esther Sanz"
    },
    {
        "name": "Cadwallon: City of Thieves",
        "description": "Get rich or die trying.&#10;&#10;It's more than a motto for the thieves of Cadwallon: it's their way of life. You have joined the ranks of the infamous Guild of Thieves, seeking your own path to wealth and glory. Your tiny gang has been chosen to relieve the fat merchants of the city from a portion of their, ahem, &quot;excess&quot; wealth. But there are many factions within the Guild, and yours is not the only band working in the district tonight! In fact, your greatest challenge may not be the militiamen who guard the streets...&#10;&#10;Cadwallon: City of Thieves is a fast-paced board game of cunning thievery and ruthless skulduggery in a fantasy city steeped in magic and intrigue. Two to four players each control their own gang of four thieves, competing to amass the greatest haul of loot from the many carefully locked chests scattered about the board. This is no friendly competition, however, and there is little loyalty among thieves in Cadwallon! The most successful players are as likely to claim their loot from the other gangs as they are to do the time-consuming legwork themselves...&#10;&#10;Get ready for a deviously fun battle for treasure! Good fortune in the Guild of Thieves is a double-edged sword that cuts to the bone; other thieves will want your loot, and they have no qualms about drawing your blood to get it. The result is a fast and furious brawl for control of the best treasures in the city. Precious jewels change hands rapidly, and you'll quickly find yourself positioning your gang to not only grab the loot, but defend it desperately.&#10;&#10;",
        "artist": "Miguel Coimbra,Nicolas Fructus,Édouard Guiton,Florent Maudoux,Paolo Parente,Marc Simonetti"
    },
    {
        "name": "Next War: Korea",
        "description": "Sixty years of tense, uneasy peace are shattered as the Korean Peninsula erupts in renewed warfare. One historically, ethnically, and culturally homogeneous people polarized and separated by superpower politics and economics hurl men, weapons, and material into the maelstrom of modern combat in an attempt to settle their arbitrary division once and for all.&#10;&#10;From Pyongyang in North Korea to Busan in the South, the war rages. In a scene reminiscent of the first attack by the In Min Gun in 1950, the North Korean People&rsquo;s Army surges across the Demilitarized Zone and penetrates deep into South Korea.&#10;&#10;Special Operations Forces from both sides conduct raids, interdiction, and reconnaissance missions behind enemy lines while airborne, air assault, and amphibious forces strike far behind those lines attempting to outflank the main army forces of both sides. In the air, both sides wage a heated campaign in an effort to establish superiority over the skies of Korea. With rough terrain and the full ferocity of modern armor, airmobile, airborne, and marine warfighting capabilities, there is no safe haven in the lethal cauldron of battle which has engulfed the Korean Peninsula.&#10;&#10;While North and South battle for a quick, decisive victory, the world awaits the response of the two military superpowers in the region: the United States of America and the People&rsquo;s Republic of China. Will the United States, stung by high casualties among the soldiers of its 2nd Infantry Division near the DMZ during the surprise artillery barrages and initial assaults on the first day of the war, be able to reinforce the South quickly enough, and, if so, how and in what strength? Will the Communist Chinese again react (or pre-emptively intervene) to a massive US response and join the fray, thus widening the conflict? As the situation evolves, choices are made, forces are committed, and the security of Japan and the future of the two Koreas hangs in the balance.&#10;&#10;Next War: Korea, the first of a planned series of Next War games, allows players to fight a near future war on the Korean peninsula. In this updated and improved version of the previously-released Crisis: Korea 1995, players have access to virtually all military assets of North and South Korea, as well as large forces from the USA and the PRC. The integrated, easy to learn air-land combat system allows for unit efficiency, armor effects, light infantry, attack helicopters, Close Air Support, Cruise Missiles, and the particularly tough terrain of Korea.&#10;&#10;Make no mistake: Next War: Korea is not an Introductory wargame. Rather, we have intended herein to create a system (and a series) that will allow detailed study of modern warfare in various venues as well as engaging gameplay. That said, the Standard Game rules encompass a fairly straightforward ruleset that will, we think, be considered pretty &quot;easy to learn&quot; by experienced wargamers. So players who choose to play Standard Game scenarios can have a relatively quick game when that's what suits them. The real flavor of a war in the theatre, though, comes through in the Advanced Game, where you get much more control over airpower and can more clearly see each side's strengths and weaknesses. For players who want a &quot;mini-monster game&quot; experience, playing the Advanced Game Campaign Scenarios with some or all of the optional rules will definitely &quot;deliver.&quot;&#10;&#10;So our hope is that we have created a game with enough variety and scaling of complexity that you can find an engaging and maybe even enlightening experience whether you want to play a fast two-player game, a longer monster game, or an ongoing solitaire study. We intend to provide tools for online game play as well (a Vassal module is being created now for use during playtesting) so that this game can be played in either real-time or over longer periods on the internet.&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Units&#10;&#10;Ground units in Next War: Korea represent primarily divisions and brigades of armies of North and South Korea, The United States and her Allies, and the People's Republic of China. All ground units are rated for their attack and defense strengths, movement capabilities, and unit efficiency.&#10;&#10;Air units represent fighter, bomber, and attack squadrons of the major combatants and are rated for All-Weather Capabilities as well as their range, average pilot skill, and their abilities in Air-to-Air Combat, Close Air Support, and Strike missions.&#10;&#10;Naval units and capabilities are abstracted somewhat in the Next War series. A &quot;Sea Control&quot; mechanism reflects the results of the surface and sub-surface battles, while the game's naval unit counters represent the major Aircraft Carrier Battle Groups and Amphibious Ready Groups of the US Navy. Additional amphibious capabilities are represented by the Special Forces capabilities of each side.&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Maps and Terrain&#10;&#10;The game's two maps present a portion of modern-day Korea at a scale of roughly 7.5 miles per hex. The maps cover the entire peninsula east-to-west and stretch from about 30 miles north of Pyongyang in the North to Taegu in the south. Hexes are larger than the standard 1/2&quot; hex found in Crisis Korea: 1995, allowing us to use larger 9/16&quot; counters in this game and make it a bit easier for players to move game pieces in the congested areas around the DMZ.&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Game System&#10;&#10;As in Crisis: Korea 1995, there are two types of game turns: Initiative turns (longer turns where the side with the Initiative has more opportunities to move and attack) and Contested turns (shorter turns where neither side has the initiative but each is trying to muster the resources to regain the initiative). Thus the inherent &quot;initiative player advantage&quot; built into the game system incents each player to always be thinking about how to seize and maintain the battlefield initiative.&#10;&#10;A Standard game turn is composed of:&#10;&#10;    Weather Determination. Bad weather can severaly hamper air and naval operations activity and can significantly slow ground operations.&#10;    Initiative Determination&#10;&#10;&#10;&#10;&#10;an Air/Naval Phase, wherein air superiority levels and air availability are determined and Sea Control is established or modified.&#10;&#10;    One or more Movement and Combat Phases that allow both sides to move, react, and fight, with an advantage to the Initiative player on non-Contested turns&#10;    Arrival of Reinforcements and Replacements&#10;    Victory Determination&#10;&#10;&#10;&#10;&#10;Combat resolution examines not only unit strengths but also unit efficiency (representing training, doctrine, and morale), as well as the terrain where the combat takes place. The CRT tends to be very bloody, reflecting both what we believe will be a degree of attritional warfare early on in light of the massive artillery concentrations near the DMZ as well as the lethality of modern weapons. As in many games, casualties represent not only actual combat losses, but also losses of unit cohesion brought about by the rapidity and pace with which modern armies are able to engage and exploit on the battlefield.&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Scenarios&#10;&#10;There are several Standard Game scenarios. The first three one mappers, &quot;Seoul Train,&quot; &quot;Uijong Blues,&quot; and &quot;East Coast Highway&quot; (North Map only) cover the first week of the war by dividing the DMZ into roughly three equal sections. These focus on the initial assaults to break the South Korean lines and introduce players to the basic mechanics of the system, while giving them insight into attack and defense strategies for the &quot;big game.&quot; Players can also play the entire DMZ front scenario, &quot;Militarized Zone,&quot; (North Map only) for the first week (basically, combining the three scenarios above). In addition, players can add the South Map and play the entire Standard Campaign game, &quot;All In.&quot; Two other scenarios are provided which examine the U.S. Amphibious landing. &quot;Inchon Again&quot; and the battle for Taejon, &quot;Spearhead.&quot; In addition, a scenario, &quot;They Did What?&quot; is provided for players to experiement with a South Korean attack on North Korea without, however, the help of the United States.&#10;&#10;The Advanced Game Scenarios come in three flavors &agrave; la NATO: The Next War in Europe: Strategic Surprise, Tactical Surprise, and Extended Buildup. This offers the players the ability to game out a variety of &quot;At Start&quot; war scenarios based on varying levels of readiness.&#10;&#10;There is also an International Posture Matrix &agrave; la Flashpoint: Golan to allow players to experiment with a variety of intervention options for the non-Korean players in the region.&#10;&#10;In Next War: Korea, the Korean Peninsula is on fire with two of the world's most well-prepared, antagonistic forces arrayed against each other. Can you, as the North Korean People&rsquo;s Army commander, conquer the South in 3 weeks before the full might of the U.S. can be brought to bear? Can you, as the Republic of Korea&rsquo;s Army commander, hold out against the renewed Communist assault until help arrives? And what will China do? There&rsquo;s only one way to find out...&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Components&#10;&#10;&#10;    2 22x34&quot; maps&#10;    4 9/16&quot; counter sheets + 1 Errata and Expansion Bonus 1/2 sheet (1026 counters)&#10;    2 rulebooks (Standard + Advanced Rules and Game Specific Rules)&#10;    5 8.5x11&quot; Player Aids&#10;    2 11x17&quot; Player Aids&#10;    1 10-sided die&#10;&#10;&#10;The 2012 version and the 2016 ziplock version contain the same game components; except the 2012 version is packaged in a box, while the 2016 version is in a ziplock bag.&#10;&#10;Game Design and Development: Mitchell Land&#10;Original System Design: Gene Billingsley&#10;&#10;TIME SCALE  3.5 days per turn&#10;MAP SCALE  7.5 miles per hex&#10;UNIT SCALE  Division / Brigade  / Battalion&#10;NUMBER OF PLAYERS  One or two (can be played in teams)&#10;&#10;",
        "artist": "Charles Kibler,Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "Bloody April, 1917: Air War Over Arras, France",
        "description": "(from GMT website:)&#10;&#10;Bloody April is a standalone game using a similar format to Elusive Victory/Downtown, modified to cover the unique aspects of air combat during World War 1. The game covers the pivotal air combat over the Arras sector, France from March until the end of May 1917. Players take on the roles of Royal Flying Corps commander or German Imperial Air Service commander for their respective sides and will have a multitude of taskings available to accomplish and complete their objectives. Bloody April will include both single mission scenarios and multi-mission/multi-day campaigns to allow players to play out large scale battles in a manageable timeframe.&#10;&#10;Bloody April recreates entire air raids in detail. Each player will have many unique tactical challenges to overcome. Both players will have numerous taskings available such as Bombing, Recon, Artillery Cooperation, Contact Patrols, Balloon Busting, Offensive Patrols, Line Patrols and Trench Strafing. Players will also have Anti-Aircraft systems available such as different caliber &quot;Archie&quot;, AA guns and &quot;Flaming Onions&quot; incendiary weapons to hinder their opponent&rsquo;s movements. The map covers a significant portion of the Arras sector from Bethune and Lens in the North to Cambrai in the South. All the major aerodromes in this theatre of operations are displayed on map with a scale of 1nm per hex and 2 minutes per game turn. Each detailed aircraft counter will represent anywhere from 1 to 5 aircraft.&#10;&#10;The Royal Flying Corps (RFC) player will be on the offensive during this timeframe and have a plethora of diverse aircraft types ranging from obsolete but workhorse B.E.2 2-seaters to brand new aircraft that would become legendary as the war went on such as the SE-5 scout and Bristol F.2a 2-seater. In all the RFC player will have over 15 different types of scout and 2-seater aircraft at their disposal. Pusher type F.E.2b/d and D.H.2 aircraft and the Sopwith Triplane will help fill your arsenal. Sopwith Pups and 1 &frac12; Strutters, Nieuport 17s and SPAD VIIs are some of the other types available. R.E.8s and F.K.8s will help augment your 2-seater fleet and will begin to replace the heavily attrited B.E.2 fleet.&#10;&#10;The German Imperial Air Service player takes on the role of Jagdstaffeln (Jasta) commander utilizing Ace pilots such as the legendary &quot;Red Baron&quot;, Manfred von Richthofen and his Jasta 11 comrades flying Halberstadt and Albatros scout aircraft that terrorized the British 2-seaters during this period. The German player will also have his own 2-seater aircraft such as the Rumpler and Albatros C-class 2-seaters to provide Recon, Bombing and Artillery Cooperation. The battle for the skies over Arras in France 1917 is under your control. Will it be another Bloody April ?&#10;&#10;DESIGNER: Terry Simo&#10;MAP, CHARTS &amp; COUNTER ART: Ian Wedge&#10;&#10;",
        "artist": "Rodger B. MacGowan,Ian Wedge"
    },
    {
        "name": "Wobble",
        "description": "Wobble - Roll to the hole!&#10;&#10;Content: wobble playing board, 20 wooden discs, 4 big pawns,&#10;a ball, dice, 4 sticks and the rules.&#10;&#10;Try to roll the ball in the right hole by balancing the game board. On your turn you roll the dice and get as many action points as you rolled. With an action point you can drop a disc on the edge of the playing board to make the board (in)balance the board in the direction of your hole. You can also toss a disc from the board.&#10;&#10;First one to successfully roll the ball in 4 different holes is the winner.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "High Five!",
        "description": "A boardgame using elements from Yahtzee and Poker. A specially designed board allows players to place their tiles (showing a regular deck of cards) and make combinations. The better the combination (ie: Full House, Flush, etc.), the more points you score.&#10;&#10;Play continues until the tiles run out or the board is full. The player with the most points wins the game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Show Business",
        "description": "Show business is the economical-tactic game for 2 to 5 players aged 13+ with play time 45 min &ndash; 2 hours. You act as manager of music group playing one of 5 major music styles: rock, pop, black (e.g. rap, soul, R&amp;B), jazz, club (electronic dance music) and compete with other managers to gain fame and money for you and your musicians.&#10;&#10;Employ best musicians and motivate them to write popular songs. Forecast market trends and influence media to have songs of your group on top of charts. Use your contacts in branch and hire professionalists available on the market to support your group as well as to sabbotage successes of your competition. Contract most lucrative concerts and travel with your tournees around Europe. Take care of highest possible satisfaction within a group in order to have your musicians as long as possible with you. It is one year time for you to lift up your debutants on top of popularity. Gain fame and money greater than your competitors.&#10;&#10;",
        "artist": "Maciej Hajnrich,Yuri Schipakin"
    },
    {
        "name": "Operation Dauntless: The Battles for Fontenay and Rauray, France, June 1944",
        "description": "Operation Dauntless: The Battles for Fontenay and Rauray, France, June 1944, is a wargame that covers the actions of the British 49th Infantry Division (a.k.a &quot;The Polar Bears&quot;) near Caen during Operation Martlet (called Operation Dauntless by the British at the time of the battle).  Opposing these lads are elements of the 12th SS Panzer Division &quot;Hitlerjugend&quot; (Hitler Youth) and Panzer Lehr&mdash;elite panzergrenadier units.  The goal of the British division is to seize the town of Fontenay, then press onward to secure the high ground near Rauray in time for the impending Operation Epsom, to be launched the next morning.&#10;&#10;The game by designer Mark Mokszycki uses the same system as Red Winter, his game on the Battle of Tolvaj&auml;rvi  from the Russo-Finnish Winter War of 1939.  Scale is grand tactical: 90 minutes per game turn, 425 yards per hex, and mostly company sized infantry units with platoon sized armor units. Gone are the Winter War specific rules such as ski movement and night raids, and in their place we have a more detailed armor/anti-tank subsystem.  There are lots of tanks on both sides in this one!&#10;&#10;Rules for Operation Dauntless include the 12th SS Fanatical Defense Table, British sabot ammo, tank destroyers, self-propelled infantry guns and artillery, combat engineers, troop transport, British air strikes, German nuisance raids (night bombings), infantry anti-tank weapons, German ammo shortage, and abstracted effects of the immense British opening barrage by 650 guns.&#10; Terrain is a mixture of corn and wheat fields, orchards, woods, heavy and light bocage, and small stone farm houses and villages.  The Germans begin the game dug in, and they may place a limited number of fortifications during setup.&#10;&#10;The game includes a multi-day campaign as well as several shorter scenarios. The Germans are on the defensive overall, but they are armed to the teeth with many powerful panzer formations&mdash;including Panzer IVs, Panthers, and Tigers&mdash;and will find themselves able to counterattack frequently and effectively. Some of the shorter scenarios feature the Germans on the offensive to recapture lost ground.&#10;&#10;The game was designed for two players, but works very well solitaire.&#10;&#10;Game Scale:&#10;Turn: 90 minutes&#10;Map: 425 yards per hex&#10;Unit: Platoon to Company&#10;&#10;Game Contents:&#10;Three counter sheets of 528 5/8&quot; counters (roughly 2 sheets of unit counters and 1 sheet of markers)&#10;One 22 x 34&quot; map&#10;One 36 page Rule Book&#10;One 28 page Play Book (includes full-color illustrated examples of play, Comparisons to Red Winter, Tips &amp; Strategies, and counter manifest)&#10;One 56 page Scenario Book (includes 11 tutorials, ~15 scenarios, and optional rules)&#10;One 48 page Reference Book (includes designer's notes and complete Order of Battle)&#10;Two Identical Player Aid Cards (foldout, 4 sided)&#10;One Player Air Card 2 (Optional rules)(1 sided)&#10;One British Reinforcement Card (8.5 x 11&quot;, 1 sided)&#10;One German Reinforcement Card (11 x 17&quot;, 1 sided)&#10;One Flowchart card (double-sided with LOS and Armor Reaction Cycle aids)&#10;One Campaign Game Setup &amp; Vehicle Identification Card (2 sided)&#10;One Turn Track Card (Turn Track A: June 16-18 on front, Turn Track B: June 25-27 on back)&#10;One Information &amp; Turn Phase Track Card (1 sided)&#10;One Tutorial Getting Started #1: Infantry Card (2 sided)&#10;One Tutorial Getting Started #2: Armor Card (2 sided)&#10;Three 6-sided dice&#10;Three 10-sided dice&#10;&#10;Complexity: Medium (similar to Red Winter or a tad more complex)&#10;Solitaire Suitability: High&#10;&#10;",
        "artist": "Charles Kibler,Rodger B. MacGowan,Mark Mahaffey"
    },
    {
        "name": "Nuklear Winter '68",
        "description": "The former German territory, transformed into a wasteland by the nuclear holocaust that ended the Second World War in 1946, is the hostile setting of a new conflict between old enemies clenched in a struggle for the future of mankind.&#10;&#10;Surviving Nazi leaders and Wehrmacht forces resurface in 1968 from underground shelters to rebuild an empire from the ashes of the world. Oblivious of the climatic, technological and political changes inflicted by more than 20 years of nuclear winter, they are about to face the mysterious Black Hand - elusive, abhorrent masters of the wastes, and the combined might of the modern, highly mechanized and versatile NATO alliance.&#10;&#10;Units represent platoons of vehicles like T64 or King Tiger tanks, infantry, or helicopters. The platoons are grouped into formations and lead by a commander. The formations are activated by chit draw, and better-trained, better-led units can activate more than once in a turn, moving, shooting, and fighting in each activation. On the flip side of a coin, there is no guarantee that a formation will activate even once.&#10;&#10;This game was originally released as the DTP game Nuklear Winter '78.&#10;&#10;",
        "artist": "Petre Tutunea"
    },
    {
        "name": "Guardians of Graxia",
        "description": "The fantasy world of Graxia is a shattered world of floating continents high in the sky. Each continent is connected by portals, the primary gateways between city-states that reside on these continents. Warlords command Guardians to lead armies through the portals on quests to conquer and control each other's lands.&#10;&#10;The many continents are filled with races of all types, from Orcs, Goblins, Dwarves, Skeletons, Elves, Humans, as well as new races, such as the Celethreals and Boneshadows. While once in harmony with each other, the peace of the countryside has since been destroyed as portals open with armies pouring in from unknown continents.&#10;&#10;What Guardians will protect your lands?&#10;&#10;Guardians of Graxia will be released this summer as both a board game and a PC online-downloadable version. The game features dynamic strategic gameplay using more than 240 unique and spell cards, figurines, and map tiles in a fantasy-based environment. Heroes of Graxia is being released at the same time and is a Deck-Building Card Game version of the Graxia world.&#10;&#10;Guardians of Graxia will support both single and multiplayer gameplay as well.&#10;&#10;",
        "artist": "Kerem Beyit,Gary Cox,Lynne Gura"
    },
    {
        "name": "IRONDIE",
        "description": "IRONDIE uses combinations of nine different types of dice, each available in eight different colors, which allows for endless possibilities in terms of personalized sets so that you can surprise your friends with new tactics and combinations. IRONDIE dice are beautifully crafted and can also be used with existing board games, roleplaying games, or miniatures wargames.&#10;&#10;IRONDIE dice are made of silver-plated Zamac (an alloy with a base metal of zinc and alloying elements of aluminium, magnesium and copper; the first limited edtion was made of white metal) and covered with a colored translucent paint to highlight their metal luster. Their mass is much more substantial than any plastic or resin die resulting in a better gaming feel and experience.&#10;&#10;IRONDIE is not a difficult game, but the difference between playing and mastering it lies in the player's experience. A champion will have well-composed sets of dice and know how best to make use of them.&#10;&#10;",
        "artist": "Davide Averara"
    },
    {
        "name": "Perpetual-Motion Machine",
        "description": "They said it couldn't be done.&#10;&#10;They were right.&#10;&#10;Nonetheless, you've been enlisted to help inventor extraordinaire Ted Alspach put the finishing touches on his Perpetual-Motion Machine. Your job is to make the machine as efficient as possible, so that you might fool the unsuspecting public long enough to make Mr. Alspach incredibly rich before he's chased out of town by a crazed mob of very cranky investors.&#10;&#10;You're pitted against one to three other players who are also looking to get as famous as possible by riding Mr. Alspach's coattails. You'll need cunning, foresight and a bit of luck in order to beat your opponents.&#10;&#10;Perpetual-Motion Machine is a game of set collection, skill-tree building, and long and short term strategy. Race against other players to build the most efficient machine possible using limited resources. As you build, you'll choose which areas to focus on to ensure victory.&#10;&#10;Reimplemented by&#10;&#10;&#10;    Kniffel: Das Kartenspiel&#10;&#10;&#10;",
        "artist": "Ted Alspach"
    },
    {
        "name": "Kalua",
        "description": "On the tropical island of Kalua, five religions compete to become the one and only. You will take the role of one of the five Gods that the Kaluans follow and will reward your followers with good harvests, nice weather and general well-being &ndash; or, if they don't pray to you enough, punish them with famine, epidemics, floods, earthquakes and other disasters. Don't forget though that with four other Gods on the island, the Kaluans can't distinguish where all their bad luck is coming from...&#10;&#10;Make your religion the one and only by converting followers from other religions to your own. The game of Kalua continues until this condition is met.&#10;&#10;",
        "artist": "Gary Simpson"
    },
    {
        "name": "Panic Station",
        "description": "Panic Station is a paranoia-driven partly cooperative game in which you control two characters in the Extermination Corps sent out by the government to investigate the presence of fiendish alien life forms.&#10;&#10;Players need to move both their Androids and Troopers through the base, exploring and gathering equipment that will help them to complete their mission: to find and destroy the Parasite Hive hidden somewhere in the inner depths of this hell. When a player manages to get his Trooper into the Hive location and play three gas can cards to fuel his Flamethrower, he wins the game for the humans.&#10;&#10;However, one of the players is a Host. He must keep this identity secret, infecting as many team members as possible to gain allies and prevent the humans from completing their mission. Only players who carefully watch the behavior of team members and find a good balance between cooperation and paranoia will stand a chance against the infected players and roaming parasites.&#10;&#10;The game uses a unique exponential traitor-system and combines tactical play with a compelling psychological mindgame amongst players.&#10;&#10;Panic Station is a game of growing paranoia in which no one can truly trust anyone. Can you maintain your sanity and destroy the source of this evil?&#10;&#10;",
        "artist": "David Ausloos,Hans-Georg Schneider"
    },
    {
        "name": "Buzz It!",
        "description": "Buzz It! is a card game with a electronic timer.&#10;&#10;The players all receive 3 cards which each have 2 questions on them.  Each at their turn can ask one of the two questions to the others.  When the questions is asked each of the other players must give an answer to the question within a time limit.  The players must keep on giving answers until one player can't answer or can't answer quickly enough.  This player then receives the question card as a negative point.&#10;&#10;The timer is handed over to the next player and he/she reads one of the questions on his/her card.&#10;&#10;The game stops when all the players have used their own question cards and the player with the fewest received cards wins the game.&#10;&#10;The timer can be set on 5 or 8 seconds and makes a buzzing sound (hence the name)&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Get Nuts",
        "description": "Get Nuts is a fast-playing tactical card game for 3-6 players that puts you in the role of a determined squirrel, trying to get hold of a stack of nuts to get through the cold winter. But other enemy rodents will do anything they can to stop you from climbing that tree and snatching those precious snacks.&#10;&#10;To claim a nut card in Get Nuts, a player must move his squirrel down a trail composed of four cards in order to reach the nut stash in the center of the table. Squirrels don't just saunter down shady paths, however, so you need to play tree cards on the path to give the squirrel a way to navigate toward the nuts. On a turn, a player has four action points available, with which he can play cards from his hand (which cost 0-4 points) or advance his squirrel down the trees on his trail, with each space costing a point. At the end of a player's turn, he can discard any number of cards he wants, then refill his hand to five cards.&#10;&#10;Cards can either help you or attack opponents. Use a sacred tree to provide a safe haven that others can't destroy, and place the Divine Nut on your path, a special treat that can be claimed only after taking a nut from the stash. Take chainsaws and flamethrowers to opponents' trees, or send a bullzoer up their trail to demolish trees one by one over several turns. If your squirrel sits in a tree that's felled, it moves back down the trail and will remain injured until you take the time to administer first aid and get the little guy up and running once again.&#10;&#10;If you claim a nut, your squirrel scampers back to the start of the trail, and you must remove trees from your trail equal to the value of that nut. (Trees wither from loneliness when they lose their nuts.) The game ends once the last nut card has been claimed, and the player with the most valuable stash wins.&#10;&#10;",
        "artist": "David Ausloos"
    },
    {
        "name": "1880: China",
        "description": "An 18xx game by Helmut Ohley and Lonny Orgler set in China. As usual, players are railroad capitalists and operate in a stock market buying and selling shares, opening companies and trying not to go bankrupt.&#10;&#10;It's a big game even by 18xx standards, with a few innovations added to the system:&#10;&#10;- turn order for companies not changing with the evolving stock prices: it is set along with the par price when a player opens a company&#10;&#10;- A player-manipulated ratio of stock rounds and operation rounds: for an example, a new stock round occurs when the last of a type of train is bought.&#10;&#10;Released in Essen 2010&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Phase 10: Das Brettspiel",
        "description": "As in other Phase 10 versions, the players try to collect sets of cards in ten different phases which have to be collected in order. Only when one phase is completed, the player can start collecting the next one. &#10;In this board game version, players move along a circular track on the board. For this, they roll two dice and choose one of them for their movement. The field they land on contains instructions on how to draw or replace cards or even request them from others. Afterwards, phases can be laid out or added to. At the end of each player's turn, a card has to be discarded. A player who has no cards left after this moves forward two phases, the other players who have completed the current phase move forward to the next phase, all others have to try the current phase again in the next round. The first player to complete phase 10 is the winner.&#10;&#10;(User summary by HilkMAN)&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Scrabble Trickster",
        "description": "In this twist on the classic word game, Scrabble, players use their seven drawn letter-tiles to form words on the gameboard. The twist is that now, proper names such as cities or celebrity names will now be allowed.  Other twists include &quot;playing words backwards or playing words unconnected to others on the board,&quot; Mattel said.  The game is a limited edition and will not replace the original Scrabble.&#10;&#10;Just like regular Scrabble, each word laid out earns points based on the commonality of the letters used, with certain board spaces giving bonuses. But a word can only be played if it uses at least one already-played tile or adds to an already-played word. This leads to slightly tactical play, as potential words are rejected because they would give an opponent too much access to the better bonus spaces.&#10;&#10;Not all precise details are known yet as Scrabble Trickster is due out in July in the U.K. only.&#10;&#10;Source from The Detroit News: http://www.detnews.com/article/20100408/NATION/4080379/1013/BIZ04#ixzz0kWXKGfJ4&#10;(This is now a pay-only link.)&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Panzer General: Russian Assault",
        "description": "Panzer General: Russian Assault is a sequel to the hit title Panzer General: Allied Assault and is a quick playing game of WWII tactical / operational combat using a unique blend of cards, miniatures, and a board game.&#10;&#10;New to the Panzer General game system with this sequel are 80 plastic miniatures depicting tanks, infantry and artillery. There are also over 100 new Action Cards, Units, and Abilities.&#10;&#10;The game provides 12 solo and two-player scenarios depicting combat situations between the German and Russian forces in such battles as Stalingrad, Kursk, Moscow, Leningrad and many others.&#10;&#10;The game will support both solo and 2-Player gameplay.&#10;&#10;Published by Petroglyph and under license from Ubisoft&reg;.&#10;&#10;",
        "artist": "Gary Cox"
    },
    {
        "name": "Polis: Fight for the Hegemony",
        "description": "Polis: Fight for the Hegemony is a two-player civ-lite game set in the beginning of the conflict between the two major poleis of the 5th century B.C: Athens and the Delian League against Sparta and the Peloponnesian League. The winner will be the Empire with more population and prestige at the end of the game.&#10;&#10;With a growing empire, feeding your people is the main goal. Wheat was scarce in Greece, so both players must secure other goods supply and the route to five markets in order to trade them for wheat. Each territory may give you different amount of wood, metal, wine, olive oil, silver and some wheat; these two last ones are hard to get but precious. It&rsquo;s up to you if you want to get more of only one good or less from several of them. Every turn you get goods from a territory you must have some population there (supporting your Empire) but in the end they also have to be fed.&#10;&#10;Fighting for the control of the territories and the sieges of the polis will be the job of your hoplites, your triremes will struggle to secure the routes to Egypt, Persia...so you can trade with them when the price is low, and a good use of your Diplomatic may convince a Polis to join your League easily.&#10;&#10;A Polis may be your ally, but they are very proud of their independence, so you will have to create some Projects (statues, temples, artists, philosophers, games...) in order to gain Prestige which is needed for all your military manoeuvres.&#10;&#10;",
        "artist": "Fran Diaz,Ivan Escuder,Marek Rutkowski,Hans-Georg Schneider,Walter Velez"
    },
    {
        "name": "Good Help",
        "description": "You have just finished your evil doctorate. Now it's time for you to return to a castle on the outskirts of the town where you grew up, to begin your tyranny in the name of revenge. Every bully that gave you a wedgie in school and every cutie who laughed at your advances will feel the wrath of the monster you are about to create...&#10;&#10;Your goal in Good Help is to create the best monster that you can, then unleash it on the public &ndash; but don't take too long as the first player to have his monster destroy five buildings in town wins. Alternatively, you can set your monster on those of the other players, and if you have the last monster standing, you win.&#10;&#10;To assist you in your goal &ndash; and to preserve your reputation in town &ndash; you'll hire assistants, then send them out to collect body parts, buy supplies and earn money. Your assistants can confront those of other doctors to try to steal away the gold, supplies or limbs they carry. Each assistant has at least one vice, however, and when moving about town they might be lured away by the prospect of beer, jewelry, dresses or sausage, selling or dropping everything they have to get their fix. Good help is indeed hard to find!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Ascension: Deckbuilding Game",
        "description": "Ascension: Deckbuilding Game &mdash; originally released as Ascension: Chronicle of the Godslayer &mdash; is a fast-paced deck-building game designed by Magic: The Gathering Pro Tour champions Justin Gary, Rob Dougherty, and Brian Kibler, with artwork by Eric Sabee.&#10;&#10;Ascension is a deck-building game in which players spend Runes to acquire more powerful cards for their deck. It offers a dynamic play experience where players have to react and adjust their strategy accordingly. Each player starts with a small deck of cards, and uses those cards to acquire more and better cards for their deck, with the goal of earning the most Honor Points by gaining cards and defeating monsters.&#10;&#10;",
        "artist": "Eric Sabee"
    },
    {
        "name": "Aliens: This Time It's War",
        "description": "The Company has colonised the planet LV-426. Contact with the &quot;Shake and bake&quot; colony is lost. The Company sends a team of Colonial Marines, with Ripley as &quot;Advisor&quot;, to find out what has happened at Hadley's Hope.&#10;&#10;Aliens: This Time it's War is an unauthorised, non-profit and non-collectable card game set within the boundaries of the hugely influential 1986 sci-fi film, Aliens.&#10;&#10;Consisting of two balanced 60-card decks, the game pits two players against each other in a life or death struggle. One player takes the role of the Colonial Marines, and his opponent assumes control of the hordes of deadly xenomorphs.&#10;&#10;At their disposal, the Colonial Marines - very tough hombres - have a roster of high-tech, state-of-the-art weaponry.&#10;&#10;The Alien player's objective is to eliminate all the Marines, before they escape the planet and &quot;Nuke the entire site from orbit.&quot;&#10;&#10;The game has an asymmetrical design, with both decks featuring different cards and abilities. Aliens: This Time it's War is played using a 5-column system, representing consecutive melees. Gameplay is quick and bloodthirsty with Marines butchered frequently, and aliens destroyed by the well-placed use of cards.&#10;&#10;Numerous tricky decisions must be made throughout. For instance, the Colonial Marine player could choose to deploy the Powerloader during the Reactor Chamber battle, but the resources that this would require make it a very risky, but rewarding, play. Similarly, the Alien player can deploy the Alien Queen at any time during the conflict - she's free to play aboard the Sulaco, but hugely expensive if used during the APC Withdrawal, for instance.&#10;&#10;Primarily a combat-driven card game, each player must manage his deck of cards effectively to win. In addition to simple, unique abilities, each card also has two values: power and cost. No icons are used.&#10;&#10;Aliens: This Time it's War can trace its parentage back to San Juan, Magic: The Gathering, Battle Line, BattleTech CCG, and Iliad.&#10;&#10;Victory Conditions:&#10;&#10;&#10;     The Colonial Marine player wins if she manages to &quot;Nuke the entire site from orbit&quot;.&#10;     The Colonial Marine player wins if she reaches and survives the Sulaco Loading Bay battle.&#10;     The Alien player wins if Ripley and all the Colonial Marines are either killed or cocooned.&#10;&#10;&#10;",
        "artist": "Sean Chick,Daniel Chick,Viktor Csete"
    },
    {
        "name": "Ticked Off",
        "description": "In each round of Ticked Off, players are shown a category, then take turns making claims of how many items they could list in that category.&#10;&#10;Seems straightforward &ndash; but naturally there's a twist! Once all but one person has passed on increasing the target bid, a second category is revealed and each player then lists as many items as possible &ndash; but from only one of the two categories. Players then compare answers and mark out duplicates, scoring one point for each unique answer; the bidder scores two points for each unique answer, but only if he meets his bid. In addition, each player scores additional points if he listed more answers than the number bid.&#10;&#10;",
        "artist": "Jennifer Vargas"
    },
    {
        "name": "Arriala: Canal de Garonne",
        "description": "from publisher's site&#10;&#10;In the reign of Louis XIV, Pierre-Paul Riquet, Superintendent of the Army and a brilliant engineer, proposed the idea of a canal system using water from the Montagne Noire in the Massif Central.  Between 1665 and his death in 1680, Riquet was completely anbsorbed by the planning, financing and construction of his canal system.  Sections of it, including the Canal de Garonne, remained unfinished until the 19th century.&#10;&#10;You can relive the adventure of building the canal, section by section, between Grisolles and Valence d'Agen in the heart of the Tarn-et-Garonne. Each player is an engineer who must use their best workers to build the greatest length of the Arriala (cannal in the Occitan language of southern France). You can move all workers, but only those on your team will gain you fame points for completing sections. The placement of your workers when construction is completed is critical.  Your aim is to have the most workers on a stretch of canal when it is completed.  Ties are broken in favour of the player placed third. It is also possible to build locks to alter sections of the canal and create new ones. However, the number of points awarded depends on the length of the section: a lock may win you a majority, but at what price?&#10;&#10;Points can also be scored for building structures, though this sacrifices a worker (five maximum per player) for the rest of the game. What's more, your expertise also extends to cultivating the  vines that make this region famous and will bring you valuable points when the game ends.&#10;&#10;",
        "artist": "Paul Filippi"
    },
    {
        "name": "Ora et Labora",
        "description": "In Ora et Labora, each player is head of a monastery in the Medieval era who acquires land and constructs buildings &ndash; little enterprises that will gain resources and profit. The goal is to build a working infrastructure and manufacture prestigious items &ndash; such as books, ceramics, ornaments, and relics &ndash; to gain the most victory points at the end of the game.&#10;&#10;Ora et Labora, Uwe Rosenberg's fifth &quot;big&quot; game, has game play mechanisms similar to his Le Havre, such as two-sided resource tiles that can be upgraded from a basic item to something more useful. Instead of adding resources to the board turn by turn as in Agricola and Le Havre, Ora et Labora uses a numbered rondel to show how many of each resource is available at any time. At the beginning of each round, players turn the rondel by one segment, adjusting the counts of all resources at the same time.&#10;&#10;Each player has a personal game board. New buildings enter the game from time to time, and players can construct them on their game boards with the building materials they gather, with some terrain restrictions on what can be built where. Some spaces start with trees or moors on them, as in Agricola: Farmers of the Moor, so they hinder development until a player clears the land, but they provide resources when they are removed. Clever building on your personal game board will impact your final score, and players can buy additional terrain during the game, if needed.&#10;&#10;Players also have three workers who can enter buildings to take the action associated with that location. Workers must stay in place until you've placed all three. You can enter your own buildings with these workers, but to enter and use another player's buildings, you must pay that player an entry fee so that he'll move one of his workers into that building to do the work for you.&#10;&#10;Ora et Labora features two variants: France and Ireland.&#10;&#10;",
        "artist": "Klemens Franz"
    },
    {
        "name": "Long Live The Revolution!",
        "description": "The Revolutionaries against the Royalists. Which side will prevail and which side are you on?&#10;&#10;The game is played over several rounds. Each player selects one card from his hand and revealed simultaneously. Now determine which side win the dominant color, then which player win the round.&#10;&#10;The game ends when either the Revolutionaries or the Royalists have won four stacks. This defines the victorious colour and then count their points. The player with the most points wins the game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "King of Tokyo",
        "description": "In King of Tokyo, you play mutant monsters, gigantic robots, and strange aliens&mdash;all of whom are destroying Tokyo and whacking each other in order to become the one and only King of Tokyo.&#10;&#10;At the start of each turn, you roll six dice, which show the following six symbols: 1, 2, or 3 Victory Points, Energy, Heal, and Attack. Over three successive throws, choose whether to keep or discard each die in order to win victory points, gain energy, restore health, or attack other players into understanding that Tokyo is YOUR territory.&#10;&#10;The fiercest player will occupy Tokyo, and earn extra victory points, but that player can't heal and must face all the other monsters alone!&#10;&#10;Top this off with special cards purchased with energy that have a permanent or temporary effect, such as the growing of a second head which grants you an additional die, body armor, nova death ray, and more.... and it's one of the most explosive games of the year!&#10;&#10;In order to win the game, one must either destroy Tokyo by accumulating 20 victory points, or be the only surviving monster once the fighting has ended.&#10;&#10;",
        "artist": "Gabriel Butik,Romain Gaschet,Igor Polouchine,Benjamin Raynal,Jean-Baptiste Reynaud,Jonathan Silvertre,Régis Torres,Anthony Wolff"
    },
    {
        "name": "Duel of the Giants: Eastern Front",
        "description": "From the designer of Duel in the Dark, comes tank battles on the Eastern Front. Russians vs Germans. As the German player, are you prepared to defend your section of the front against the endless Red hordes? Or, as the Soviet player, are you going to be able to break through the Fascist lines and continue the advance towards Berlin?&#10;&#10;&quot;Duel of the Giants&quot; allows you to recreate the great tank battles on the Eastern Front in 1943. As the German player, you must plan your moves carefully to anticipate the Soviet advance. The Soviet player can take chances with his many tanks to overwhelm the limited German defenses.&#10;&#10;Good planning, preparation, and skill will be required to carry the day. Onward to victory - you now must begin the fight of your life...&#10;&#10;Comes with 11 plastic minis - 10 tanks and one Stuka plane.&#10;&#10;",
        "artist": "Friedemann de Pedro"
    },
    {
        "name": "Conan: el juego de cartas",
        "description": "From Boardgame News:&#10;&#10;Edge says that it wants to reflect every aspect and character of the Hyborean Age in the game. The game will be an easy to play but challenging, with many details of the fantastic sword-and-sorcery world imagined by Robert E. Howard.&#10;&#10;In the game, you will be an adventurer searching for gold and glory. Traveling around the different Hyborean cities and locations, you will probably meet with Conan &ndash; he can be present in many ways, from barbarian to king. Try always to be his friend, as it will be better for you.&#10;&#10;",
        "artist": "David Baldeon,Simon Bisley"
    },
    {
        "name": "Super Comics",
        "description": "In Super Comics, each player plays the part of a super hero of his choice, whether known or imaginary. Each player receives challenge cards to be carried out; these challenges are based on dexterity or mental abilities such as being the first super hero who takes off his socks and puts them back on, the first to turn in a circle five times, the first to calculate the sum of the ages of all players. Once the challenge cards are in hand, a player challenges another super hero. They mix their cards, draw one randomly, then try to achieve the challenge. The one who wins keeps the card.&#10;&#10;At the end of the game, when players have played all of their challenge cards, the one with the most cards is declared the strongest super hero in the world!&#10;&#10;",
        "artist": "Ian Fortin"
    },
    {
        "name": "Globall",
        "description": "No need to know football to enjoy GloBall!&#10;A game for those who love Football, as well for those who hate it!&#10;&#10;When you play Globall, you live the excitement of an International Football Tournament as you bet on matches winners in order to score points : The player who collected most points when the competition is achieved will be the game's winner.&#10;&#10;16 National Teams are provided, which drawn two by two will reveal at the same time the encounter programm, and the half-time score. During the second half-time, players will have the opportunity to favour or penalize one of the challenging teams by playing covered their referee cards before placing a bet.&#10;&#10;What do other players plan, as each of them has a secret favorite for the final victory ? Which weapons do they still hold, as every referee card can be played only one time in the game ?&#10;&#10;Even if you are not a football fan, you may find good fun playing this party game full of happening, quick to learn and set up.&#10;&#10;Order here: http://www.callaogames.com/boutique.htm FREE SHIPPING WORLDWIDE!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Luna",
        "description": "&quot;The end of her regency is nigh. It's time to clear the way for a new bearer of the burden. She will keep a wary eye on the novices representing their Orders and trying to win her favor. Eventually, she will have to come to a decision. Which Order will prove itself worthy to decide on her successor? There will be a new Moon Priestess and she will bear the title: LUNA.&quot;&#10;&#10;&quot;LUNA&quot; is the title of the Moon Priestess, and before her very eyes, each of the up to four Orders competes for the right to decide on her successor. The players are the heads of the Orders who try to convince the Priestess of themselves. Over the course of six rounds, they need to collect as many influence points as possible by skillfully placing their novices to achieve that goal.&#10;&#10;The players move their novices over seven islands surrounding a temple island. The novices are placed according to the &quot;worker movement&quot; principle, i.e. they aren't placed at the beginning of a round, but instead start where they ended the round before. Thus, novice movement is an important part of a round: Only if you're in the right place at the right time, you'll gain the deciding influence points. You'll have to build new shrines, work at the temple, and participate in the Priestess' divine services. But don't forget to recruit additional novices or win the favor of the local Priests; these are vital means to prepare and combine the diverse actions.&#10;&#10;LUNA: In the Domain of the Moon Priestess is a challenging tactical game with strategic and interactive elements that takes about 20-25 minutes per player. The different placement of the islands and novices at the beginning of the game creates a different feeling each time you play and opens up new strategies.&#10;&#10;",
        "artist": "Klemens Franz"
    },
    {
        "name": "Cruel Necessity",
        "description": "A States of Siege (TM) game.&#10;&#10;This solitaire game, suitable for group and classroom cooperative game play, tells the story of the English Civil Wars (1640-53) through its key events and decision points. You attempt to stop the advance of four armies bent on destroying Parliament and Puritanism, whom you represent; simply holding on to London is not enough.&#10;&#10;Each of the three English Civil Wars are replayed through the use of separate card decks that recreate the historical military and political events that could spell doom to the Parliamentarian forces. There are civil wars going on not just in England, but in Scotland and Ireland too; and each will have varying impact on the play of the game at different times.&#10;&#10;The title comes from the purported response to the beheading of King Charles by his implacable foe, Oliver Cromwell, who remarked that this act of regicide was a &ldquo;cruel necessity.&rdquo;&#10;&#10;Note: Cruel Necessity is our first Gold Banner wargame to exclude a mounted map inside. Because of all the gameplay real estate in Cruel Necessity, mounting the boards using our print-on-demand publishing model would have raised the Retail Price to $55.00 (i.e., a $15 increase), and that just seemed like too much. We hope our vaunted wargame customers can soldier on with our sturdy paper maps as the great wargames of yore have long provided.&#10;&#10;What's in the box:&#10;&#10;&bull; One full color 22-page Rulebook (Designer's Notes included)&#10;&bull; One 22&rdquo; x 17&rdquo; paper game map (in two sections)&#10;&bull; One 11&rdquo; x 17&rdquo; Battle Display Mat&#10;&bull; 75 cards&#10;&bull; 98 thick, two-sided, multi-shaped game pieces&#10;&bull; One 2-sided player aid&#10;&bull; One blue (Parliamentary) 6-sided die&#10;&bull; One red (Royalist) 6-sided die&#10;&bull; One bright red, 9&quot; x 11 7/8&quot; Deluxe cardboard VPG game box&#10;&bull; One beautiful box cover sleeve&#10;&bull; One &quot;Wipes-A-Lot&quot; napkin&#10;&bull; One charcoal desiccant packet&#10;&#10;",
        "artist": "Tim Allen,Vinh Ha"
    },
    {
        "name": "Tonkin: The Indochina war 1950-54 (second edition)",
        "description": "(from Legion wargames website:)&#10;&#10;Tonkin is a two player game that covers the crucial period of the French-Indochina War fought between the Viet Minh and France from 1946 -1954.&#10;&#10;The game focuses on the intensive years from 1950 - 1954 in  the northern part of Vietnam, called Tonkin, and Laos. It is a game of high interactive play where both players have a set of ten operation points and a number of supply dumps. &#10;By spending operations points you will be able to perform different, mostly non-combat, actions. By expending a supply dump you will also be allowed to perform combat missions. But there will be a limited number of supply dumps to expend and they will also be needed to keep units in supply. When you spend operation points you will only be allowed to spend one, two or three points in a row before it is your opponents turn to spend his.&#10;&#10;This creates a game where you, in the long term, will have to plan and save supply and at the same time be prepared to react to your opponent's actions. &#10;In the short term you will be forced you make decisions based upon the number of operation points you have been given to spend in a row and the missions you need to accomplish.&#10;&#10;Contents:&#10;&#10;    22&quot; x 34&quot;  map    &#10;    352 each .6&quot; Game Counters&#10;    24 pages rulebook&#10;    4 ea. 8 1/2&quot; x 11&quot; Charts&#10;    3 ea. 8 1/2&quot; x 11&quot; Information&#10;&#10;&#10;&#10;&#10;5 Scenarios + Campaign Game&#10;&#10;Map Scale:    12.5 miles per hex&#10;Unit Size:    Regiments / Battalions&#10;Time Scale:    1 month per turn&#10;&#10;",
        "artist": "Kim Kanger,Randy Lein,Brandon Pennington"
    },
    {
        "name": "Trollland",
        "description": "From Bruno Cathala:&#10;&#10;Trolls used to live happily and merrily in the nice troll country. At night, sitting around the fire, they ate troll meals, told old troll legends, and played traditional troll games. Alas ! this golden age is past. Everything has changed for the worse since aliens, jealous of the troll wealth and culture, have settled in. The Trollland is now infested with Men, who ate cooked meat, Elves with dubious habits, Gobs who played barbarian music and hardworking Dwarves who steal the trolls jobs. As a result, Trollland is now in full decadence.&#10;&#10;The Troll king has decided to set it straight and put things back in order. As a troll governor, your mission is to arrest and send back home, in carriages or in dragon charters, as many unwanted aliens as possible. The trick of the game is that each charter scores point only for the player who placed the last alien in it. At the end of the game, the winner will be rewarded by the troll king and promoted as minister of national hideousity.&#10;&#10;Trollland&rsquo;s theme is in no way tacky, nasty or vulgar. It&rsquo;s the policy the game is rightly mocking which is tacky, nasty and vulgar.&#10;&#10;As for the game systems, Trollland (with three ls) is a very good filler card game . It&rsquo;s light, nasty and clever, in the line of many German style card games such as Coloretto, Mow or Take 5.&#10;&#10;",
        "artist": "Olivier Fagnère"
    },
    {
        "name": "Monopoly: Nintendo Collector's Edition",
        "description": "From USAopoly.com:&#10;&#10;Now You&rsquo;re Playing With Power!&#10;&#10;No controllers are necessary as you join forces with Mario, Luigi, Link, Zelda, Kirby and your other favorite characters on a quest to defeat your opponents and own it all. The most recognizable and coveted characters in the video game industry have teamed up to bring you the Nintendo Collector&rsquo;s Edition of the world&rsquo;s most popular board game, MONOPOLY.&#10;&#10;Now you can buy, sell and trade your favorite Nintendo characters in an effort to own and control the most popular Nintendo video game franchises. From everyone's favorite character, Mario, to barrel-tossing Donkey Kong and cute Yoshi, they're all up for grabs in this exciting, fun-filled adventure.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Smash Monster Rampage!",
        "description": "A huge monster, taller than the highest skyscraper, is attacking your city! Work together to mobilize your troops and exterminate the beast before every building becomes a heap of rubble.&#10;&#10;In Smash Monster Rampage!, players work together to defeat an attacking monster before the town is destroyed or too many survivors are lost. The &quot;Monster Die&quot; generates random actions for the Monster, making the beast unpredictable and dangerous. It sets buildings ablaze, creates devastating quakes, and destroys everything in its path. Taking turns to move their tank and helicopter units, players get into position to attack the Monster. They can win &quot;Monster Hit&quot; cards by successfully firing at the Monster and fulfilling the conditions on the cards.&#10;&#10;If the city is flattened before the Monster is defeated, the Monster wins!&#10;&#10;",
        "artist": "Derek Bacon,Mike Swindall"
    },
    {
        "name": "UNO MOD",
        "description": "From the publisher: The ultra-popular card game gets a modern makeover with bold graphics and a sleek, portable case, making it a great gift idea! It's still the classic race to get rid of all your cards by matching colors and numbers - but has been enhanced with an exclusive MOD card. When you're down to your last card, don't forget to yell &quot;UNO!&quot; For ages 7+.&#10;&#10;--&#10;&#10;This game is almost the same as regular UNO but introduces the MOD card which does add some rules to the base game of UNO. When playing a MOD card you name a color and then pass, in turn order, all cards you have of that color to the other players.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Rockband Manager",
        "description": "Game description from the publisher:&#10;&#10;Bring together an epic band and rock to the top in Rockband Manager!&#10; In this card game for three to six players, take the role of band manager, assemble a group, and guide them to stardom. Use your talented stars to record killer albums, book sweet gigs, perform sold-out shows, and gain decibels to win the game. Bid for new gear and opportunities to improve your group's sound. Throw a cheap shot at your rivals by engaging in some hijinks. There are multiple roads to glory in this game, so you must develop a plan to rise above the competition. Are you ready to rock?&#10;&#10;",
        "artist": "Raúl Castellanos"
    },
    {
        "name": "Hanabi & Ikebana",
        "description": "From the author's web site:&#10;&#10;Flower arrangements or fireworks? The choice is yours! This box proposes you two colorful games: &#10;&#10;     Hanabi, a cooperative game in which the players realize together colored fireworks. &#10;     Ikebana, a competitive game in which the players compete to compose blazing bouquets.&#10;&#10;&#10;&#10;&#10;The games use the same material, a set of 55 cards and some colored tokens to propose two completely different rules.&#10;&#10;The theme arises from two arts of the Japanese culture: fireworks (Hanabi) and flower arrangement (Ikebana).&#10;&#10;Microbadge: &#10;&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Hanabi&#10;&#10;Hanabi is a cooperative game in which the players realize together colored fireworks.&#10;&#10;They are going to try to recompose suites of colored cards (maps): 1, 2, 3, 4, 5 the problem being that every player holds his hand of cards back to front, that is each player can see the cards of the others but not his...&#10;&#10;Mechanisms: Communication, Deduction&#10;&#10;Hanabi is the Japanese word for &quot;fireworks&quot;. It consists of both ideograms &quot;Flower&quot; and &quot;Fire&quot;.&#10;&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Ikebana&#10;&#10;Ikebana is a competitive game in which the players compete to compose blazing bouquets.&#10;&#10;Alternately, they are going to be able to dig up cards or buy back those left aside by their opponents to compose a bouquet of 5 cards and mark points according to represented combinations (pair, three of a kind, suite, etc.)&#10;&#10;Mechanisms: Combination, Risk-taking&#10;&#10;Ikebana is the Japanese word for &quot;flower arrangement&quot;. It consists of both ideograms &quot;Life&quot; and &quot;Flower&quot;.&#10;&#10;",
        "artist": "Albertine Ralenti"
    },
    {
        "name": "Takenoko",
        "description": "A long time ago at the Japanese Imperial court, the Chinese Emperor offered a giant panda bear as a symbol of peace to the Japanese Emperor. Since then, the Japanese Emperor has entrusted his court members (the players) with the difficult task of caring for the animal by tending to his bamboo garden.&#10;&#10;In Takenoko, the players will cultivate land plots, irrigate them, and grow one of the three species of bamboo (Green, Yellow, and Pink) with the help of the Imperial gardener to maintain this bamboo garden. They will have to bear with the immoderate hunger of this sacred animal for the juicy and tender bamboo. The player who manages his land plots best, growing the most bamboo while feeding the delicate appetite of the panda, will win the game.&#10;&#10;",
        "artist": "Nicolas Fructus,Picksel,Yuio"
    },
    {
        "name": "Evolution: The Origin of Species",
        "description": "In Evolution: The Origin of Species, players do the work of nature, putting animals into play and evolving them trait by trait to help them survive and thrive. Each player starts with a hand of six cards that feature an animal on the back and one or two traits on the front.&#10;&#10;Each round consists of four phases. During Development, players take turns playing one card from their hand either as an animal (face-down) or as a trait on one of their existing animals (face-up and tucked under the animal). Traits include Carnivorous, Camouflage, Sharp Vision, Swimming, Poisonous and Communication; if a card has two traits, the player chooses which trait the animal acquires, hiding the other trait under the animal. Once a player passes during this phase, he can no longer play cards.&#10;&#10;During Food Bank Determination, a player rolls 1-2 dice (possibly adding two to the total) to determine the amount of food available for the round.&#10;&#10;During Feeding, players take turns acquiring one food cube and &quot;feeding&quot; one of their animals. Some traits give animals special abilities that can be used during Feeding or at other points during the game. Animals can also be carnivorous, allowing them to attack one other animal to feed &ndash; although that animal might have a defense like High Body Weight or Tail Loss that allows it to survive. An animal can't take more food than it needs unless it has fat tissue, which allows it to store food for future rounds.&#10;&#10;During Extinction and Draw, any animal not fully fed dies; the owner takes that animal and all traits and stacks them in his personal discard pile. Each player then receives new cards in hand equal to one plus the number of live animals that player has.&#10;&#10;When the deck runs out, the players conduct one final round, then score points. Each live animal is worth 2 VP, and each trait on a live animal worth 1 VP; some traits (Carnivorous and Parasite) provide bonus VPs, but make it tougher to keep an animal alive. The player with the most VPs wins.&#10;&#10;By combining two sets of Evolution, you can have up to eight players in a game.&#10;&#10;",
        "artist": "Dmitry Knorre"
    },
    {
        "name": "DungeonQuest (third edition)",
        "description": "DungeonQuest is a re-imagining of the classic board game of dungeon exploration for 1-4 players. Set in the vibrant fantasy realm of Terrinoth (first popularized by Runebound), DungeonQuest retains the peril, tension, and brutality of the beloved original game while updating both mechanical and thematic elements. Players take on the roles of courageous (or foolish) heroes willing to brave the legendary dangers of Dragonfire Dungeon. Fortune awaits those able to venture into the dragon&rsquo;s lair...&#10;&#10;Legends say that the doors of Dragonfire Dungeon open every sunrise, welcoming brave adventurers into its depths. But once the sun sets, the doors close and seal the fates of those who lingered too long. Only a few have ever returned from Dragonfire Dungeon, and those who have usually come back near death. But they return as heroes nonetheless.&#10;&#10;In DungeonQuest, players must guide their heroes through the twisting halls of Dragonfire Dungeon in pursuit of unimaginable riches hoarded by the Dragonlord Kalladra. Whoever can amass the most wealth and make it out of the dungeon before the closing of the doors seals their doom will emerge victorious. However, merely surviving the harrowing dungeon is a feat all its own...&#10;&#10;While many similar games rely on a player to control the machinations of the dungeon, DungeonQuest is unique in that the dungeon essentially runs itself. No one at the table knows what lies around the corner, creating a new play experience every time. Additionally, DungeonQuest also includes rules for solo play, so you can even challenge Kalladra&rsquo;s keep on your own!&#10;&#10;Great riches and everlasting glory await if you can survive Dragonfire Dungeon. The Dragonlord Kalladra has challenged all heroes of Terrinoth to test themselves against the most dangerous dungeon in all the realms.&#10;&#10;Dare you face the dragon&rsquo;s challenge?&#10;&#10;",
        "artist": "Felicia Cano,Jesper Ejsing,Louis Frank,Jacob Glaser,John Goodenough,Rafał Hrynkiewicz,Henning Ludvigsen,Andrew Navaro,Ben Prenevost,WiL Springer,Tim Uren,Frank Walls"
    },
    {
        "name": "Expedition: Northwest Passage",
        "description": "In 1845, Sir John Franklin led an expedition on behalf of the British Royal Navy to find and explore the last portion of the Northwest Passage, regardless of the cost. The Royal Navy gave Franklin two heavy Ships (HMS Terror and HMS Erebus) filled with scientific equipment, 1000 books, a crew of 128 men, and enough food to last for three years. They left England in May and encountered whalers along the west coast of Greenland in August. There, they waited for more favorable weather conditions for the crossing of the Lancaster Sound. Once the weather improved, they sailed into unknown waters, and no one ever heard from them again...&#10;&#10;Their disappearance provoked a great deal of turmoil in public opinion, and numerous British and American expeditions attempted to find their trail. As leaders of these expeditions in Expedition: Northwest Passage, players must venture into these hazardous Arctic waters in order to discover Franklin's fate and succeed where he failed &ndash; by finding the Northwest Passage. Players allocate their crewmen in their ship or in their sled to perform various actions such as exploring, moving, or gathering clues on the whereabouts of the Franklin expedition.&#10;&#10;As the game progresses, the seasons will pass and parts of the sea will be frozen, blocking the way for the ships. Players acquire victory points by gathering clues, mapping the area, and &ndash; of course &ndash; discovering the Northwest Passage. However, in order to claim victory, one has to come back home to the Greenland on time!&#10;&#10;",
        "artist": "Stéphane Poinsot,Yves Tourigny"
    },
    {
        "name": "Ingenious Challenges",
        "description": "Created by renowned game designer Reiner Knizia, Ingenious Challenges contains three games of mental dexterity for 2-4 players. Retaining the spirit of its predecessor board game Ingenious, the games in Ingenious Challenges challenge players to score as many points as possible in each color/symbol while also forcing them to score points in all colors/symbols in order to do well. Four scoreboards with colored pegs and tracks for each color are used in each game, while the dice, cards and single-symbol tiles are used separately in their particular games.&#10;&#10;&bull; In the Card Challenge (published separately as Einfach Genial: Das Kartenspiel), a player receives a hand of six cards, with one card placed face-up in front of him. On a turn, he plays one of his hand cards and scores as many points for each symbol on the played card as there are symbols lying in front of all players. These points are marked in the matching color track on a player's individual scoring board, and the first player to have seven or more points in all colors wins. Progress is complicated by three barriers on the scoring tracks, which cannot be passed unless all colors have been bumped to a certain level of points &ndash; thereby forcing players to push their colors evenly.&#10;&#10;&bull; In the Dice Challenge (Einfach Genial: Das W&uuml;rfelspiel), players roll dice up to three times, then score as many points for each symbol on the rolled dice as there are symbols on the dice in front of the other players. Players record these points on their scoring boards, with the barriers causing hiccups on the way, and the first player to move all colors to seven points wins.&#10;&#10;&bull; In the Tile Challenge (Einfach Genial: Wer zu viel riskiert, verliert!), all 126 tiles (21 of each color/symbol) are shuffled face down, then three are placed face up in a shared pool. On a turn, a player reveals a tile. If the tile doesn't match one in the pool, he adds all tiles revealed this turn to the pool and ends his turn; if it does match, the player can collect all tiles revealed this turn and all matching tiles in the pool, or take another turn. If you're the first player to collect seven tiles of each color, you win. If a player has a single color with fewer tiles in it than all other colors and a tile of that color is in the pool, the player can take one such tile and end his turn; this rule allows players to work toward that final color they need, while also pushing other players to try to remove that color from the pool.&#10;&#10;Incorporates:&#10;&#10;    Einfach Genial: Das Kartenspiel&#10;    Einfach Genial: Das W&#195;&#188;rfelspiel&#10;    Simply Ingenious &#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Hornet",
        "description": "Hornet is an area control game with simultaneous action selection and a dual-layered resource system. The game board is a modular board built of hex tiles representing a landscape with fields of flowers and hornet nests of various sizes. The players have an identical deck of action cards and each card can be used multiple times. Each game turn, players secretly pick an action card that is revealed simultaneously with the other players. The actions are resolved in the numerical order of the action cards, with each player allocating the action to either one of their hornets on the game board. The hornets compete to collect nectar from the flower fields that is in turn used to produce honey in the nests. The winner of each hornet nest is resolved in a pre-determined order, with the winner being the player with the most honey in the nest. The game is won immediately by conquering three nests or by having won two nests by the end of the game with the highest aggregate amount of honey produced. The nature of the various action cards ensures high player interaction, causes a need for pre planning a number of turns ahead and allows the execution of cunning tactical moves. The easily comprehensible rules, variable game set-up and eye catching artwork with a cheerful theme facilitate an enduring and pleasant gaming experience.&#10;&#10;Box back text:&#10;Hornet is a stinging tactical boardgame for the entire family in which players need to anticipate the moves of their opponents and at times also bluff a bit. Each player controls a pair of hornets swiftly flying about in flower fields collecting nectar and producing as much honey as they possibly can. The buzziest honey maker will win the game!&#10;&#10;",
        "artist": "Ossi Hiekkala,Paul Laane"
    },
    {
        "name": "CUPONK",
        "description": "This game is for one to as many people want to play.  As described in the rules there are 2 CUPONK (Ping Pong with graphics) balls and a 30 Card &quot;Trick Deck&quot; that the player draws from, it illustrates a specific trick to attempt and the number of tries to complete it.&#10;&#10;If the player completes the trick in the amount of tries given they collect the card and the next player draws a new trick.  If the player fails to complete the trick in the number of tries, then the next player attempts the same trick.  Follow the same rules for completing the trick.  If all players fail, then discard the trick and move on to the next trick card, it would now be the original first player's turn again.&#10;&#10;You can play until any preset goal you want, first to three tricks, five tricks, or until the deck is gone and count up the totals.  The game even recommends combining 2 or more trick cards into &quot;Expert&quot; tricks.&#10;&#10;Each of the three versions has their own trick deck, so if you purchased all three you can combine them into one 90 card deck.  Also included are blank cards for making up your own.&#10;It's actually way more fun than you would think, and the cup lights up and makes sound effects unique to the version you purchased.  The cards are really just stepping stones to making your own even more elaborate tricks.&#10;&#10;-----From the Box-----&#10;&#10;What exactly is CUPONK? The object: sink your ball into the cup and light it up. Get it in and you&rsquo;ll hear the sweet sounds of victory, YEAH! You rock. Miss the shot and your friends get the chance to one-up you. When playing CUPONK your entire home can become a legitimate playing field. Tables, walls, chairs &ndash; IT&rsquo;S ON! Test out sick trick shots like Door Jam, Stairing Contest and Wall Banger. What you don&rsquo;t like the names? Okay tough guy, make up your own! &#10;Show your skill and sink sick shots. Features lights and crazy (gorilla / wild wrestling / killer zombie) sounds! Includes 1 CUPONK cup, 2 CUPONK balls, 30 trick cards, a ramp accessory and instruction guide. &#10;Requires 3 AAA batteries (not included). For 1 or more player(s). Ages 9 and up. &#10;[Taken from HASBRO Site]&#10;&#10;There are three versions in the first wave: Gorillanator, El Campeon, Let it R.I.P.&#10;&#10;The second wave includes three versions: Boomshakalaka, Monsterosity, King of L.A.&#10;&#10;A deluxe edition, Le Flush Royale,was released alongside the second wave. It includes a cup with a plastic lid/backboard, Cuponk head band, five stickers, six balls, a set of thirty cards and instructions.&#10;&#10;There are also two different sets of extra balls. They each include seven new balls and five stickers.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Kuni Tori!",
        "description": "Kuni Tori! is a deck-building card game which uses mechanisms similar to Dominion. That is, during the course of the game the players purchase cards from an open card pool to build their own deck. And like Dominion, the goal is to collect victory points, which at the end of the game will decide the winner. The main difference is you can attack other players with your armies to gain land.&#10;&#10;The players take the roles of daimyos - local warlords - during &quot;Sengoku jidai&quot; (warring states period in Japanese history). While holding a balance between fighting the other warlords and control of their own realm, the players strive to become the most powerful warlord under the heavens of Japan. Are you going to use your resources to build castles, armies or cannons? Or do you establish a town of fine arts?  Famous generals from the Sengoku jidai period will have an appearance, with the only slight difference being that they appear as cute girls.&#10;&#10;Integrates with:&#10;&#10;    Kunitori! Is the World on Fire?&#10;&#10;&#10;&#10;&#10;",
        "artist": "Tohru Adumi,CARNELIAN,Akira Hayase,Kinoshita Ichi,Ko~Cha,Souji Kusaka,Akiyoshi Miina,Rin Minase,Miki Miyashita,Nishida,Fujii Rino,Toshihisa Tanaka,Ofuu Yamadori,Tokumi Yuiko"
    },
    {
        "name": "Charon Inc.",
        "description": "In the year 2288, off-world mining is now controlled by a few mega-corporations. It is no longer just people or nations that are subject to exploitation, but entire planets and moons. As the CEO of one of these mega-corporations, in Charon, Inc. you will vie against CEOs of other corporations as you exploit the planet&rsquo;s resources and colonize Charon, the largest moon of the dwarf planet Pluto.&#10;&#10;You will stake claims to the various mining regions of Charon, acquire resources for building facilities, use special actions (fair and unfair) to gain advantages over other CEOs, and build your empire to achieve victory in this fast-paced game of planetary domination!&#10;&#10;&#10;&#10;Game Summary&#10;The board shows Charon divided into several regions. Each round, seed the regions with a mix of gems. Players start with a hand of building cards: at the start of each round, everyone puts one into a common pool. At the end of each round, you get additional cards.Players' bidding flags start out 1 in each of the special power areas. Go around bidding till each player has just one flag unspent. Bid by moving a flag from its space to a location on the board -- in a region, on a border btwn 2 regions, or on an intersection (corner) touching 2-4 regions. After all bids placed, use the special power where your last flag stands -- that is a pretty cool twist, where you have to decide which special power you want to try for (but you only get it if you're alone on that power; or if there's 2 of you in a 5er game!). Then resolve each region: the player with the most flags in/around it wins all the gems. Ties broken by seniority, where a flag is more &quot;senior&quot; if it affects fewer regions (center then edge then corner).&#10;&#10;After all gems collected, players (in turn order) use their gems to build cards from common pool and/or their hand (but may never build cards with same number). May trade gems (3:1?) to get the colors you need, and may only save a limited number of gems from turn to turn. Some special powers change trade ratio and holding limit.&#10;&#10;After 5 rounds, player who built the highest sum of buildings wins.&#10;&#10;",
        "artist": "Charlie Bink"
    },
    {
        "name": "Wok Star",
        "description": "Wok Star is a cooperative real-time game where players take on different roles to help grow a Chinese restaurant in a tycoon style game. The clientele of customers is represented by a deck of cards with various Chinese dishes on them. Customers are served one at a time while a 20-second sand timer is running. If they are not served in time, they eat free.&#10;&#10;Each order requires a combination of ingredients to make. The board is used for tracking the levels of ten prepared ingredients in the kitchen. To prepare more ingredients, players spend dice in different combinations. All players are in charge of different tasks and all working simultaneously because the timer is running!&#10;&#10;At the end of each round, players pool their money and invest in different options to grow their business: new recipes, upgrade preparation cards, or advertise to get more customers. The players must have a certain level of profit by the last round to keep the restaurant open and win!&#10;&#10;",
        "artist": "Ryan Goldsberry"
    },
    {
        "name": "After Pablo",
        "description": "The bloody saga of Mexican and Colombian cartels following Pablo Escobar's death.&#10; It's 1994.  Pablo Escobar has been killed, and the Colombian Medellin cartel has been dismantled: a short lived victory for the DEA.  The Mexican cartels now see an opening to establish a new organized trade.  Power shifts from Colombia and now centers on Mexico as the primary distributor of narcotics.  &quot;After Pablo&quot; tells the story of the the Mexican and Colombian cartels in the time following Escobar's death.  Each player controls a cartel and must establish leadership and control of the drug market while maintaining the business of his/her operations.  After several seasons, the cartel which has taken the greatest command of the narco trade will gain the trust of the market and fill the gap left by Escobar's death.&#10;&#10;The Serpent has many heads.&#10;&#10;",
        "artist": "Mat Brinkman,Nate Hayden,Wendy Weibert"
    },
    {
        "name": "Yggdrasil",
        "description": "Yggdrasil is a co-operative game in which players are different gods of the Norse mythology: Odin, Thor, Tyr, Frey, Heimdall and Freyja. Monsters, the wolf Fenrir, the huge serpent Jormungand, the Fire Giant Surt, the Goddess of the Dead Hel, the traitor Loki and the cosmic dragon Nidhogg are moving forward in Asgard inescapably and announce the impending coming of chaos and destruction on the world tree Yggdrasil. Together the players have to resist to the impending coming of the Evil forces in Asgard, the gods' world.&#10;&#10;Game flow&#10;During his turn, the active player first draws an Enemy card, corresponding to one of the six Evil creatures. The corresponding counter is moved one space forward in Asgard and the associated effect applies. Then the active player performs three different actions among the nine at his disposal in order to resist to the advance:&#10;&#10;&#10;    Ask for the Elves' help&#10;    Get a Weapon from the Dwarves&#10;    Send the Valkyries looking for Vikings' souls on the mankind world Midgard&#10;    Fight the Giants and try to gather the parts of a magic rune&#10;    Negotiate with the Vanir&#10;    Get rid of the Fire Giants who invade Midgard&#10;    Get the Vikings back from Hel's world&#10;    Exchange forces with another god&#10;    Fight against the Enemies in Asgard&#10;&#10;&#10;Each player, depending on the god he plays, has a specific power that allows him to perform some actions better. All of these actions have to be used in the right moment or the victory will be unreachable. The players will need cleverness, calm and team spirit to challenge the game.&#10;&#10;",
        "artist": "Pierô"
    },
    {
        "name": "Back to the Future: The Card Game",
        "description": "Now you can jump into the action of the Back to the Future movies, with this ingenious new time travel card game! Play as the descendants of Marty McFly, Biff Tannen, Doc Brown and others, as you travel back to the events depicted in the movies. Your mission is to make sure pivotal events are not changed by other time travelers before time travel itself gets un-invented. Using a unique, patented game mechanism for simulating time travel, Andrew Looney now puts you in the driver&rsquo;s seat of the famous DeLorean!&#10;&#10;",
        "artist": "Derek Ring"
    },
    {
        "name": "Space Hulk: Death Angel – The Card Game",
        "description": "A cooperative game where the players attempt to clean out an infestation of hostile aliens from a derelict spaceship. Set in the Warhammer 40,000 universe, players take on the roles of Space Marines pitted against hordes of Genestealers.&#10;&#10;Players choose from six different combat teams, each consisting of two Space Marines with different abilities. Each player receives three Action cards for each of his combat teams. After all of the Space Marines have fallen into formation, prepare for the first wave of Genestealers.&#10;&#10;Game play is quick and easy to learn. Each game is played over a series of rounds, broken up into phases. During the Choose Actions Phase, each player must secretly determine which of the following Action cards they wish to play on their Space Marines: Support, Attack, or Move + Activate. You can't pick the same Action card next round, so choose wisely.&#10;&#10;Action resolution keeps all players involved while the overwhelming odds inspire them to work together to survive. The Action Resolution Phase consists of each player revealing and carrying out their chosen Action. The lowest number card goes first, which means Attacks are resolved after Supports. Support tokens enable Space Marines to re-roll, so make sure to cover your fellow Blood Angels.&#10;&#10;The Genestealer Attack Phase happens after all the Actions have been resolved, so hopefully you thinned out the swarms since you have to roll higher than the number of Genestealers in the swarm to successfully defend. Finally, an Event card is drawn to spawn more alien adversaries. Once all the Genestealers have emerged from the darkness, its time to move forward, drawing a new location card. And then it's back into the fight!&#10;&#10;",
        "artist": "Matt Bradbury,Kevin Chin,Víctor Pérez Corbella,John Gravato,Zach Graves,Nick Ingeneri,Héctor Ortiz,Brad Rigney,WiL Springer,Daniel Xio"
    },
    {
        "name": "Onirim",
        "description": "You are a Dreamwalker, lost in a mysterious labyrinth, and you must discover the oneiric doors before your dreamtime runs out &ndash; or you will remain trapped forever!&#10;&#10;You may wander through the chambers of dreams, hoping that chance will reveal the doors, or you can linger in each type of room. In both cases, you will have to deal with the slithering Nightmares, which haunt the hallways of the labyrinth.&#10;&#10;Onirim is a solo/cooperative card game. You (and a partner) must work (together) against the game to gather the eight Door cards before the deck runs out; you can obtain those Door cards either by playing cards of the same color three turns in a row, or by discarding (under specific circumstances) one of your powerful Key cards. In both cases you will have to decide the best use of each card in your hand and carefully play around the Nightmares. Those cards are hidden in the deck and will trigger painful dilemmas when drawn...&#10;&#10;Basic Deck:&#10;&#10;     8 Door cards - two each of red, blue, green and brown&#10;     10 Nightmare cards&#10;     58 Labyrinth cards:&#10;         16 red chambers:     3 keys, 4 moons, 9 suns&#10;         15 blue chambers:    3 keys, 4 moons, 8 suns&#10;         14 green chambers:   3 keys, 4 moons, 7 suns&#10;         13 brown chambers:   3 keys, 4 moons, 6 suns&#10;    &#10;&#10;&#10;&#10;&#10;Three mini-expansions, all standalone and compatible with one another, are included with the basic game:&#10;&#10;&#10;    &quot;The Towers&quot; introduces a new type of card that allows more searching and deck manipulation, while also imposing an additional victory condition.&#10;&#10;&#10;&#10;    &quot;Happy Dreams and Dark Premonitions&quot; adds evil time bombs that will impede your progress at predictable moments of your quest as well as helpful but unreliable allies.&#10;&#10;&#10;&#10;    In &quot;The Book of Steps Lost and Found&quot;, you must find the eight Door cards in a randomly given order and may remove discarded cards from the game to cast powerful spells that will help you complete this difficult task.&#10;&#10;&#10;",
        "artist": "Élise Plessis"
    },
    {
        "name": "The Hunger Games: Training Days",
        "description": "From the best selling book comes the Hunger Games Training Days, A Game of Strategy.  Coinciding with the final book in the trilogy being released this fall, the Training Days game allows 2-6 players to follow in the footsteps of their favorite Tributes.&#10;&#10;User review: Each player chooses a district to represent and a gender. The players take the appropriate Tribute Card. Each Tribute Card gives the players ratings from one (low) to eight (high) in four attributes: strength, ability, cunning, and charm. The Challenge deck is shuffled and a player is chosen to go first. The players will take their turns in clockwise order.&#10;&#10;The first player reveals a number of Challenge cards equal to the number of players. Each player has three effort tokens: one (low), three (medium), and six (high). Each player, in turn, will assign one effort token face down to any Challenge card. After all the players have assigned their effort tokens, the events on the Challenge cards are resolved. One Challenge card at a time, the effort tokens are revealed and the winner of the event is determined. Each player total one&rsquo;s own Effort tokens plus the Attribute rating called for by the card, plus alliance bonuses (from Tribute cards not already in play) plus a die roll. The player with the highest total wins the event and the approval rating associated with the event.&#10;&#10;Three End of Day cards were shuffled into the Event deck at the beginning of the game. When ever an End of Day card is revealed, then all the event cards are shuffled with the End of Days cards. Before the game began the players determine how many days the will last. When that number of End of Day cards has been revealed, then the game is over and the player who has the highest approval rating is the winner.&#10;&#10;",
        "artist": "Brian Roll,Mark Shabunia"
    },
    {
        "name": "Conquest of Planet Earth: The Space Alien Game",
        "description": "A fast paced game of terrifying alien invaders, futile human resistance, and 50's SciFi Movie Action. Players each take on the role of a different alien Race, all part of invading armada, but each with their own unique abilities and ambitions. Unleash waves of flying saucers to blast human resistance into submission with death rays and terrifying weapons of war as you unleash powerful alien technologies on earth (and other alien races if they get in your way). But beware these pitiful humans are not defenseless. They will fight to the last to defend their planet, aided by countless platoons of army soldiers, powerful human heroes, and their most deadly weapon, the dreaded atomic bomb.&#10;&#10;Featuring a modular game board, 10 different alien races to play (such as the Orzax, master of technology, or the Venezian Matriarchy, beautiful but deadly space amazons) a host of Human resistance to battle, and four game types - competitive, cooperative, team game, and Solo Play. Conquest of Planet Earth is a strategic game of maneuvering, backstabbing, and fantastic battles for alien conquest.&#10;&#10;Main Features :&#10;&#10;     Features a collection of beautifully illustrated artwork including over 100 unique images.&#10;     Over 25 detailed plastic miniatures of alien saucers to conquer the world&#10;     Games come with an original CD soundtrack to set the mood for alien conquest&#10;     Four game types - race against friend in competitive or team play, and be the first to conquer earth to impress your alien overseers, or cooperate as complete alien armada to sweep over the world and defeat human resistance. Also this game may be played Solo.&#10;     No two games are ever the same! There are many alien races to play and large decks of game cards, giving a great variety of gameplay.  By rearranging the different boards each game along with the amount of human resistance to battle the aliens, there is a high level of re-playability.&#10;     Fast Paced games with easy to learn rules allow players to jump right into the action while strategic depth and strong cooperative/competitive play keep player coming back for more.&#10;     Excellent bridge between simple family games and deeper, more advanced board games. Easy enough for casual gamers/non gamers to enjoy, while exciting and strategic enough for hardcore gamers to love.&#10;     Expandable Design allows for many expansions and strong web support to create a loyal fan base/community.&#10;&#10;&#10;&#10;&#10;Source: product summary&#10;&#10;Note:  The summary is a little out of date, the game contains 16 alien saucers and 4 allied models.  They are however all detailed and of a high quality.&#10;&#10;",
        "artist": "Jack Scott Hill"
    },
    {
        "name": "Na Grunwald: rycerze króla Jagiełły",
        "description": "Grunwald: The Knights of King Jagie&#197;&#130;&#197;&#130;o is a eurogame about the preparation for one of the biggest battles of Middle Ages. On July 15th 1410, an army of Poles and Lithuanians met the Teutonic Order forces on the fields near the village of Grunwald (Tannenberg).&#10;&#10;The game is about the preparations for war. Each player is a king's officer. His task is to find the best knights, equip them and lead them to the king. The game is published on the 600th anniversary of the battle, which is an important historical event in Poland.&#10;&#10;",
        "artist": "Maciej Szymanowicz,Marek Szyszko"
    },
    {
        "name": "Castaways",
        "description": "You've been shipwrecked on a deserted isle. Do you have the wits to survive until a rescue ship arrives? To make it, you'll need to build a camp and explore the interior to reach the summit. From there, you will scan the horizon for sign of a nearby ship. Only then will you be able to make a signal and get rescued! If you are rescued, your tale will be told around the world &mdash; but only if you have the best tale to tell! Of course, if you are not rescued, no one will hear your story...&#10;&#10;N&aacute;ufragos (a.k.a. Castaways) is a competitive collaboration game about four castaways who are stranded on a small island. They must collaborate to improve their shelter, gather food to eat and wood to keep the campfire burning, and figure out how to advance to the interior of the island, as only from the vantage point of the highest spot on the island will they have a view of the vast ocean &ndash; and even more importantly, a view of the ship on the horizon that promises rescue! The players must manage their time in order to deliver a signal to this passing vessel &ndash; but even if they're all rescued, in the end only one player will win, that being the one who writes the best story at the end of the game, the one who lives and retells the greatest adventure from all the survivors, the one who has collected the most story points.&#10;&#10;",
        "artist": "Siscu Bellido"
    },
    {
        "name": "Ports of Europe: Antwerpen",
        "description": "ANTWERPEN&#10;&#10;Antwerpen is the second game in the PORTS OF EUROPE series from The Game Master. The first game in the series is Rotterdam. The new harbour game Antwerpen is a stand alone new boardgame with some specific game mechanics which differ from Rotterdam. The game play is more compact and dynamic and the variance in scoring is more diverse.&#10;&#10;Belgians are worldwide known to enjoy life, thanks to the delicious products of their fatherland. The best chocolate, beer of high fermentation and of course the real Flemish French fries. But without cocoa no pralines, without potatoes no fries! In the Antwerp port the necessities for an enjoyable life are brought together from all parts of the world: cocoa, barley and potatoes, but also containers filled with games and toys.&#10;&#10;The players are owners of a fleet who must compete on the busy channels in the Schelde. They need to find their way in the network of locks and bring their cargo safe in the inland harbour! Each player has several special assignments which they try to accomplish. The planning in Antwerpen is easier than in Rotterdam since the product cards available are visible from the beginning. And also exchanging products could be very helpful to get the right combination of products needed to score your bonus points.&#10;&#10;Characteristics of the game:&#10;&#10;&bull; Sort of game: tactical family game&#10;&bull; No. of players: 2-4 players&#10;&bull; Age: 8 years and up&#10;&bull; Duration: 60 minutes&#10;&#10;Antwerpen is being released in September 2010 in a multi lingual version with English, German, French and Flemish rules.&#10;The game can be played and will be available at SPIEL'10 at The Game Master's stand 12-42.&#10;&#10;",
        "artist": "Wim Euverman"
    },
    {
        "name": "Crows",
        "description": "Crows are smart, but they have a weakness for shiny objects. You have a shiny object. The problem is, so do your friends. There are too many shiny objects and too few crows!&#10;&#10;Players take turns placing tiles and then positioning their shiny objects to attract the most crows. Crows flock to the shiny objects based on simple rules. It&rsquo;s going to take some wits if you&rsquo;re going to attract the most birds!&#10;&#10;When all tiles have been placed, the player who has attracted the most crows wins.&#10;&#10;This was one of Valley Games' 2010 Essen releases.&#10;&#10;Crows is #7 in the Valley Games Modern Line&#10;&#10;",
        "artist": "Patrick LaMontagne"
    },
    {
        "name": "Tori",
        "description": "Helsinki Market square, July 19, 1952 &ndash; excitement is in the air. The market is sprawling with tourists from all over the world on the advent of the Helsinki Summer Olympics. The players represent stand holders who have come to the Helsinki Market Square from different provinces. Sell miniature replicas of the Paavo Nurmi statue, lemonade, ice cream, and of course Baltic herrings straight from the fishing boats! Do not be afraid of tough competition, even if the other players are trying to steal your customers!  Use clever tactics to collect the best paying customers to your stands. Hop in to the nostalgic ambiance of the Market Square of the 1950s!&#10;&#10;Tori is a hand management and a tile placement game that simulates the function of the markets as every player competes for the same customers. Customers' consumption needs change constantly, so you have to be aware of where the customers are heading next!&#10;&#10;Tori, published on June 12, 2010 in Finland by Competo / Marektoy, continues Kimmo Sorsamo's Helsinki Game Trilogy, as the first part, murder mystery game Ep&#195;&#164;illyt (The Suspects), was released in 2009.&#10;&#10;Reimplemented by:&#10;&#10;    Kairo&#10;&#10;&#10;&#10;&#10;",
        "artist": "Tim Foley"
    },
    {
        "name": "Caravelas",
        "description": "The game theme is the Portuguese Discoveries in the 15th and 16th century, and their contribution to Portuguese wealth, symbolized in the Jer&oacute;nimos Monastery. It is an historic fact that the spices trade, brought by the Caravelles, had to pay a tax of 5% in Lisbon, and this tax was used to pay for the monastery construction.&#10;&#10;The goal is to achieve the highest possible number of victory points (VPs). The game ends when the last piece of Jeronimos is bought by any player.&#10;&#10;The boardgame is the world map with 32 ports / destinations marked around the world (Americas, Africa, Asia and Indic Islands). In 8 of them you can collect the respective merchandise from that port. The board has also marked the real sea currents that the Caravelles followed at the time. It is surprising that often the fastest way is not the shortest, and the game reveals that perfectly.&#10;&#10;Each player has a card representing 3 ships, and indicating the player's ability to travel (translated into 9 navigation discs) and the cargo capacity (translated into 6 different merchandise spaces).&#10;&#10;The players place their wood ship piece in the board in Lisbon and start navigating. If they follow the sea currents marked in the board, they can do it &quot;free of charge&quot; and endlessly. But they wouldn't go very far. Every time a player wants to go in a different direction than the one indicated by the sea current, he has to use a navigation disc from his player card. When all the navigation discs are used, the player turn stops. So, in each turn, a player can go against the currents at most 9 times, thus determining how far he can go.&#10;&#10;During navigation, players arrive in ports. If they are the first to get there, that is, if they are the ones that discover that local, they can place their coloured marker in that port and register the number of VPs marked for that port. If the port is a &quot;trade port&quot; (there are 8), the player can also collect the respective merchandise and place it in his player card.&#10;&#10;But there are also some possible surprises. When navigate, players can pass by special marked cells which force them some kind of effect:&#10;&#10;- &quot;Event&quot; cells: for each round, players have 5 &quot;Event&quot; cards in their hand; when they pass over these cells, they must choose a card from their hand. These cards can be of 3 types: &quot;Storm Card&quot;, &quot;Dead Calm Sea Cards&quot; and &quot;Good Wind Cards&quot;, thus having negative or positive effects in their navigation. But they also have an effect on other players, but for these the effect is always positive. This creates interest during players downtime. &#10;- &quot;Pirate Cells&quot;: when passing over these cells, players lose immediately 1 of their navigation discs. they can only enter the cell if they have the necessary disc available to pay.&#10;- &quot;Sinking Cells&quot;: when passing over these cells, players must take their chance with a 50/50 dice - worse can happen is they lose 1 of the 3 ships they have (or 4 - see below), and the corresponding cargo space. They will only get it back when they arrive in Lisbon.&#10;&#10;After some time of navigation, of discovering new ports and collecting one each of the possible 6 merchandises that his player card can carry, the player returns to Lisbon.&#10;&#10;In Lisbon the player can:&#10;- trade merchandises per VPs (5 each)&#10;- specifically, the merchandise &quot;pepper&quot; can be traded for 1 piece of the Jeronimos Monastery which worths 10 VPs, which are immediately registered&#10;- the player can also trade 15 VPs for a 4th ship - this 4th ship gives him 3 more navigation discs (increasing it's navigation autonomy from 9 to 12) and 2 more merchandise space cargo.&#10;&#10;At the beginning of the game, each player receives a number of Objective Cards with specific Ports. If they are the first player to get to that port, they will receive 5 extra VPs per each at the end of the game. These VPs can be decisive in the victory decision.&#10;&#10;",
        "artist": "Gil d'Orey,João Menezes"
    },
    {
        "name": "Dragon Rampage",
        "description": "Dragon Rampage, a competitive fantasy game by Richard Launius, is a strategic dice game for 3 to 5 players. Each player takes the role of one of the adventurers (all with different abilities) and the goal is to score the most points at the end of the game by fighting against or running from (or some combination of the two) the dragon you just woke up, and tallying up the treasure and gold you obtain in the dungeon. Players roll seven specially designed dice and choose whether to focus on grabbing treasure (from the dragon or from another player), fighting the dragon, protecting themselves (and their treasure), or running for the exit. Try not to draw the dragon's attention as you make your way, and note that your fellow adventurers may hinder (or aid) you in your strategy and the final scoring varies depending on how the game ends, so watch your step!&#10;&#10;The contents of Dragon Rampage is:&#10;&#10;1 rulebook&#10;&#10;1 game board&#10;6 character mats&#10;&#10;30 hero wound tokens (red crystals)&#10;1 first player token&#10;1 re-roll token&#10;8 dice&#10;&#10;72 dragon wound cubes (12 per player)&#10;54 hero action tokens (9 per player)&#10;6 player movement tokens (1 per player)&#10;&#10;128 cards:&#10;&#10;     24 dragon rampage cards&#10;     32 treasure cards&#10;     72 hero character cards (12 per hero)&#10;&#10;&#10;&#10;&#10;50 coin tokens:&#10;&#10;     20 5-value coins&#10;     30 1-value coins&#10;&#10;&#10;&#10;&#10;",
        "artist": "Cyril Van Der Haegen"
    },
    {
        "name": "Alien Uprising",
        "description": "Tensions have been high with the alien &quot;bug&quot; races of the galaxy &ndash; the Zothren &ndash; and your ship has crash landed on the planet Hive IV, one of the more renegade &quot;bug&quot; planets. You quickly set up perimeter force fields and begin surveying the surrounding terrain for debris from your ship, only to find it scattered everywhere. Then you see them &ndash; at first only a few &quot;bug&quot; scouts, but then the numbers begin to increase all around you: archers, slashers, and even the monstrous brutes. This is more than a scouting party; this is a war party! They begin to attack the shields as the crew starts to retrieve debris. The SOS has been sent and a ship in the sector has responded, but can it get to you before the &quot;bugs&quot; overwhelm your crew? Can you repair parts of the ship and use it as a defense? Can you repair the hull and fire up the engine to lift off? It's all in the hands of the crew &ndash; your hands.&#10;&#10;In Alien Uprising, the player crew must either hold off the Zothren attacks until the rescue ship arrives, or repair the ship and lift off from the hostile planet before being destroyed. To achieve either of these goals, the crew must work together, using their unique skills and chosen actions to perform a number of tasks, defend themselves, and retrieve and repair equipment and the ship.&#10;&#10;To establish the actions available each turn, the first player rolls custom dice, then each player chooses an action for the turn, starting with the first player. The available actions include combat, engineering, reload/recharge first aid, scout, and wild; the dice also have an alien icon that shows the speed of the enemy while limiting the actions that players have available to them. Players also have unique character skills, and the game can be set to higher levels of difficulty for more experienced players.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "CO₂",
        "description": "In the 1970s, the governments of the world faced unprecedented demand for energy, and polluting power plants were built everywhere in order to meet that demand. Year after year, the pollution they generate increases, and nobody has done anything to reduce it. Now, the impact of this pollution has become too great, and humanity is starting to realize that we must meet our energy demands through clean sources of energy. Companies with expertise in clean, sustainable energy are called in to propose projects that will provide the required energy without polluting the environment. Regional governments are eager to fund these projects, and to invest in their implementation.&#10;&#10;If the pollution isn't stopped, it's game over for all of us.&#10;&#10;In the game CO&#226;&#130;&#130;, each player is the CEO of an energy company responding to government requests for new, green power plants. The goal is to stop the increase of pollution, while meeting the rising demand for sustainable energy &mdash; and of course profiting from doing so. You will need enough expertise, money, and resources to build these clean power plants. Energy summits will promote global awareness, and allow companies to share a little of their expertise, while learning still more from others.&#10;&#10;In CO&#226;&#130;&#130;, each region starts with a certain number of Carbon Emissions Permits (CEPs) at its disposal. These CEPs are granted by the United Nations, and they must be spent whenever the region needs to install the energy infrastructure for a project, or to construct a fossil fuel power plant. CEPs can be bought and sold on a market, and their price fluctuates throughout the game. You will want to try to maintain control over the CEPs.&#10;&#10;Money, CEPs, Green Power Plants that you've built, UN Goals you've completed, Company Goals you've met, and Expertise you've gained all give you Victory Points (VPs), which represent your Company's reputation &ndash; and having the best reputation is the goal of the game ... in addition to saving the planet, of course.&#10;&#10;",
        "artist": "Paula Simonetti,Giacomo Tappainer"
    },
    {
        "name": "Bridgetown Races",
        "description": "Each year, the International Bridge Racing Association selects a city with lots of bridges to host its annual Bridgetown Race. This year they have chosen Portland, Oregon USA.&#10;&#10;Players - using bicycles, motorcycles, taxis, buses, automobiles, the street car and sometimes their own two feet - try to be the first to cross each bridge and capture its flag. Be the first to capture a flag from every bridge, and you win the race!&#10;&#10;Each round, players arrange for transportation by placing coordinators on the transportation mode or special action of their choice. Next, the players choose a transportation mode and move their racer through the streets, trying to be the first to cross a bridge and pick up its flag. The flag is placed on the player&rsquo;s Bridge Completion card and the first person to collect all eight flags wins the race.&#10;&#10;",
        "artist": "Ryan Laukat,Marco Primo,Ryan Stark"
    },
    {
        "name": "Totemo",
        "description": "TOTEMO - A colourful, 3D building game for Braves, Squaws and Papooses from Surprised Stare Games (Summer, 2010)&#10;&#10;Players place custom-designed blocks into a restricted playing area to construct Totem Poles, for which they score victory points.&#10;&#10;Blocks must be placed according to their colour, and the colours of the blocks they may touch in three dimensions - for example, a purple block may be placed on its own OR adjacent to purple, red or blue blocks. The more blocks it touches, the higher your score for placing.&#10;&#10;Bonus placements (and scoring) are possible if you land exactly on special spaces on the score track (these spaces are randomly determined at the start of the game).&#10;&#10;Totemo is bright, colourful, tactile and heap big fun!&#10;&#10;(Source: Surprised Stare Games Ltd)&#10;&#10;",
        "artist": "Vicki Dalton"
    },
    {
        "name": "Mr. Jack Pocket",
        "description": "From Bruno Faidutti's site:&#10;&#10;It has been found again by Bruno Cathala and Ludovic Maublanc with Mr.Jack Pocket, the small card game derived from Mr. Jack. The board is replaced by a square grid made of nine street cards. The suspects, and among them Mr.Jack, are pictured on the cards. Holmes, Watson and a dog are turning around the grid, a system already used by Bruno Cathala in several games, and can &ldquo;look&rdquo; at the streets in a row or column. Every round, like in Mr.Jack, four actions are available. The first player selects one, his opponent two, and the first player then uses the last remaining action. Actions allow moving a detective one or two spaces clockwise around the grid, turning a card in order to change the view of the streets, swapping two street cards or drawing an alibi card. At the end of the round, Mr.Jack states if he can be seen by one of the detectives. Of course, the detectives must identify Jack, who must stay hidden long enough to escape.&#10;&#10;",
        "artist": "Jean-Marie Minguez"
    },
    {
        "name": "Le Lion et l'Epée",
        "description": "(from VaeVictis website:)&#10;&#10;On his way to the Holy Land, Richard Coeur de Lion (the Lionheart) arrived at Cyprus. The ruler of the island, Isaac Dukas Comnenus, tried unsuccessfully to repel the Crusaders&rsquo; landing before falling back to Nicosia to regroup his forces. Once assured of the safety of his fleet, Richard set off into the interior of the island. Isaac marched against him, hoping to confront him in a vast plain favorable to the maneuvers of the redoubtable Byzantine cavalry. The clash occurred near the village of Tremithousa on May 21, 1191. The cavalry charges were horrendous and for a time the issue was in doubt, but the Anglo-Normans&rsquo; heavy knights finally prevailed. Isaac was captured, and this caused the Greeks to rout. Richard, now in control of Cyprus, could resume his journey to the Holy Land.&#10;He joined Philip Augustus at Saint Jean d&rsquo;Acre, which fell on July 12. When Philip returned to France, Richard gained sole command of the Crusader army. He marched south with the intention of liberating Jerusalem, but on September 7, 1194, Saladin attacked the Christians as they made their way down the coast. Showered with arrows, the Hospitaliers launched a premature charge, forcing Richard to give the signal for a general attack. After a violent counterattack, Saladin&rsquo;s troops were finally vanquished by one last charge of the Crusaders. Richard the Lionheart soon reconquered the coastlands, after which he negotiated an agreement with Saladin which allowed pilgrims free access to Jerusalem.&#10;&#10;Tremithousa and Arsuf 1191 are the 31st and 32nd battles of the series Au fil de l&rsquo;&eacute;p&eacute;e / By the Edge of the Sword, launched in issue 26 of the magazine Vae Victis. The game includes two battles won by Richard the Lionheart during the course of the Third Crusade, the first battle being fought on Cyprus against Isaac Comnenus and the second in the Holy Land against Saladin.&#10;&#10;Le Lion et l'Ep&eacute;e / The Lion &amp; the Sword includes :&#10;&#10;    two 59 x 40 cm maps (one sheet backprinted), &#10;    216 double-sided die-cut counters and markers, &#10;    rules and scenarios booklet &#10;    player-aid card in color.&#10;&#10;&#10;&#10;&#10;Units : 1 strength point per 100 combatants&#10;Map scale : 250 m/hex.&#10;Turn : 30 minutes&#10;Complexity : 6/9&#10;&#10;&#10;Battles: Tremetousia (Cyprus, May 21 1191) and Arsuf (Holy Land, September 7 1191).&#10;&#10;",
        "artist": "Christophe Camilotte,Pascal da Silva"
    },
    {
        "name": "The Networks",
        "description": "In The Networks, you and your opponents are new television networks, and you need new programming. For this, you&rsquo;ll need Shows, Stars, and Ads.&#10;&#10;Shows need Stars and Ads. Stars give you bonus viewers (points), and Ads give you extra money. You&rsquo;ll need everything you can get; you'll have a small amount of resources and time, and you must grab the latest hot show before your opponents.&#10;&#10;And some Stars will give their best effort only if you put them on in the proper conditions. For example, some Stars only want to be put on dramas. Other Stars want to be the only Star on the show. And your Ads will give you the most money only if you put them on in the correct time slot.&#10;&#10;Finally, Shows age and viewers lose interest, so you have to keep your line-up fresh by canceling shows and sending them into reruns. Fortunately, you can get viewers from your reruns, and you'll get bonuses if you get a lot of shows of the same genre throughout the game.&#10;&#10;If you need a special push, Network Cards can give you special powers &mdash; but will a Network Card be better than another action? You'll have to make that call.&#10;&#10;The player with the most viewers after five seasons wins!&#10;&#10;",
        "artist": "Heiko Günther,Travis Kinchy"
    },
    {
        "name": "R-Eco Recycle",
        "description": "This game is a sequel of R-Eco.&#10;Each player is a company that does the trash separation and recycling. By carrying trash to corresponding storage places, a player gets points. However if you carry too much, you must throw trash away illegally! &#10;The trash which cannot recognize contents is dumped in many cases. A player needs to perceive the bluff of other players, or to entrap other players, applying a bluff.&#10;&#10;",
        "artist": "Susumu Kawasaki"
    },
    {
        "name": "Braggart",
        "description": "A game of heroes, lies and unfortunate fish.&#10;&#10;Publisher description:&#10;You sit in The Heroes Return, a tavern famed for its heroic client&egrave;le. You're not a hero, but you talk a good game. You and your friends are holding court, regaling the crowds with your tales of derring-do. Can you fight your way through a drunken haze to concoct the best boast? The most believable? Or at least ones that are funny? Or will you be called out as the liar you are?&#10;&#10;In Braggart, each round players play cards from their hand which each contain a part of their story to combine them into a compelling tale. Stories are by turns hilarious or awe-inspiring and other players can accept them or accuse them of lying, downgrading their boast into something much less impressive (though usually much funnier!).&#10;&#10;Winner 'Best Card Game' UK Games Expo 2011&#10;&#10;",
        "artist": "Vicki Dalton"
    },
    {
        "name": "Trivial Pursuit: Bet You Know It",
        "description": "From the back of the box:&#10;&#10;Bet You Know It brings high stakes to Trivial Pursuit. On each turn you'll bet whether your opponent knows the answer. Guess correctly and you can use your winnings to buy wedges, or earn your wedges on your turn by answering questions. In Bet You Know It, you don't have to know all the answers to win... but you'd better know your friends!&#10;&#10;Bet on your opponents to earn chips and buy wedges&#10;&#10;Everyone plays on every turn&#10;&#10;More than 1,780 questions on 297 topic cards&#10;&#10;A chance for a wedge on each turn -- victory is much closer&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "Into the Bastards!: First tank battle",
        "description": "Into the Bastards! - First Tank Battle, retraces the second battle of Villers-Bretonneux on 24 and 25 April 1918. The game allows players to simulate the last German attempt to take Amiens, as part of the Michael Offensive. This bitter battle takes its place in history above all because it saw the first tank action between the two belligerents. However this historical detail should not obscure all other facts which mark out this battle, where successive attacks and counter-attacks succeeded each other: massive commitment of German tanks A7V, employment in the two camps of elite troops, attack at night,...&#10;&#10;April 1918 - The German Michael offensive, launched in Picardy, is peaking. Reaching the gates of Amiens, the Kaiser's troops threaten to definitively breakthrough the Allied Lines.&#10;On 24 April, the Germans captured the last defensive bastion in front of Amiens, the village of Villers-Bretonneux, during a battle that featured the first engagement between tanks. But that same night, Australian soldiers entered the line and prepared to repulse the enemy in an intense night attack. Their objective was as simple and terrible as their war cry: &quot;Into the Bastards!&quot;&#10;&#10;Into the Bastards! is a low complexity game recreating this battle, from the initial German offensive to the Australian counter-attack.&#10;Each player has elite troops at his command, represented at battalion scale: the German Guard Division, the french Moroccan Division, an Australian Brigade, and, of course, British and German tanks.&#10;&#10;Game Scale:&#10;Game Turn: 2 - 3 hours&#10;Hex: 219 yards / 200 meters&#10;Units: Battalion&#10;&#10;Game Inventory:&#10;One 17 x 22&quot; full color map&#10;One dual-side printed countersheet (160 1/2&quot; counters)&#10;One 6-page Into the Bastards! rulebook&#10;&#10;Solitaire Playability: Medium&#10;Complexity Level: Medium&#10;Players: 2 or more&#10;Playing Time:&#10;&#10;",
        "artist": "Olivier Revenu"
    },
    {
        "name": "Trollhalla",
        "description": "Game Description&#10;You and your hideous troll-friends have decided that it&rsquo;s time for a career change. You are tired of guarding bridges and shaking down weary travelers all for the sake of a few clinking coins! Tolls are down, bandits are up, and besides, living under your bridge is damp and uncomfortable-&mdash;and breathing all that crumbling bridge mortar is taking a toll on your lungs...&#10;&#10;It&rsquo;s time to venture forth and find some fresh sea air! In Trollhalla, you join forces with your fellow trolls to sail the seas in search of islands filled with pillage and plunder. Crunchy livestock, nervous monks, panicked princesses, piles of gold, and casks of grog await you! But watch out for Billy Goats--if you&rsquo;re not careful they will knock parts of your precious stolen cargo out of your boat!&#10;&#10;With so many goodies lying about on these islands, it feels like you&rsquo;ve died and gone to troll heaven, or perhaps someplace even better -- Trollhalla!&#10;&#10;Object&#10;Players take turns placing trolls on the board. Trolls emerge from below each ship&rsquo;s deck ready to plunder and scout the seas of Trollhalla! Trolls placed on ships claim plunder from nearby islands when a ship sails. Trolls placed in the sea will scout for destinations and determine where these ships sail, and also award players cards that perform special actions. The player who uses his trolls to fill his private boat with the most valuable collection of plunder wins the game!&#10;&#10;",
        "artist": "Ryan Laukat"
    },
    {
        "name": "Heroes of Graxia",
        "description": "Heroes of Graxia is a deck building game for 2-6 players that features dynamic gameplay using cards in a fantasy strategy-based environment.&#10;&#10;The game uses cards to represent forces on the gameplay table. Starting with a small deck of 12 cards, players build their empire by buying the best cards to prepare them to out-smart and out-maneuver other players to obtain trophies and prestige in the World of Graxia.&#10;&#10;The game will contain more than 240 unique cards at release, as well as miniatures. Buy for your deck the best Weapons, Armor, Spells, Armies, Henchmen, and Mercenary cards. Conquer enemies by playing these cards on the gameplay table in a sequence of turns with other players.&#10;&#10;As Players defeat Units and Heroes of opposing Legions, they gain Prestige by taking the appropriate Prestige Point cards and placing them in their Loot Pile. These points are tallied the end of the game to determine the winner. Player&rsquo;s may examine the Loot Pile of each other at any time.&#10;&#10;The fantasy world of Graxia is filled with mysteries designed for players to discover and solve. Why are there huge continents floating in the sky? Why is there such a wide variety of races living on each of these continents when travel between these lands is only accomplished through the use of Guardian created magical portals?&#10;&#10;Only selecting your favorite Guardian, exploring the world, and commanding your armies in battle, provides the answers to some of the Graxian mysteries.&#10;&#10;Heroes of Graxia is not a CCG. It is a deck building card game based on the Graxia universe and Guardians of Graxia board game published by Petroglyph.&#10;&#10;",
        "artist": "Kerem Beyit,Gary Cox"
    },
    {
        "name": "Exile Sun",
        "description": "Game Play Description&#10;&#10;Exile Sun combines some of the most compelling strategic mechanics in a way that delivers a streamlined, integrated, and fast-paced game of competition and conflict. Simplified deck building, hand management, simultaneous hidden worker placement, a card draft, 6 unique player advantages, and a revolutionary zero-luck combat resolution system ensure that playing Exile Sun is like no other game. Private and public card-based objectives give players options for points, but they must choose carefully when allocating their limited resources. The player with the most points accumulated at the end of three game cycles wins.&#10;&#10;A Game Round&#10;&#10;The game simply consists of cycles where each player in turn makes four fleet moves and then ends their turn by moving a pawn on the 'Timer Track'. The 'Timer Track' triggers events like 'Supply' and 'Battle' that effect all players simultaneously. Once each event is resolved, the player turns continue.&#10;&#10;&#10;            Moves - These moves can be regular movement, scanning an enemy fleet, launching a decoy fleet, and initiating a battle.  &#10;            Events - The battle and supply events are resolved with a mechanic that may be best described as simultaneous hidden worker placement. This unique mechanic involves the use of a control card with 10 sliding tabs. The resulting game play is tense, intuitive, and intensely competitive. &#10;        &#10;    &#10;&#10;&#10;&#10;Theme Overview&#10;&#10;Far off and forgotten, orbiting the Exile star, a fragmented group of Colonial powers is struggling to exist in the harsh environment of their foreign home.  Having been unexpectedly cut off from contact with Earth over two hundred years ago, the process of gaining some economic recovery has been slow and arduous.  With dissension rising among the populace, these leaders must compete to gain military, economic, and technological advantages over each other in a race to lead the united colonies in a mission to contact Earth. Time is short. While an outright planetary assault could express dominance in military power, perhaps luring out and destroying an opposing Flagship or Construction Shipyard can have the same effect using fewer resources. Or hit and run assaults with fleets of strike craft can be equally effective. But be warned, leaders dare not neglect their own colony resources, or their supporters will lose faith in them and they&rsquo;ll fall quickly out of the race.&#10;&#10;",
        "artist": "Eric J. Carter"
    },
    {
        "name": "Rattenkrieg",
        "description": "This is the first game in the TPS line of the Pocket Battle Games series from LPS, Inc.&#10;&#10;A solitaire postcard game of the intense fighting for the Tractor Factory in the Battle for Stalingrad. The player takes the role of the Germans as he maneuvers panzers, infantry, and elite pioneers into the ruins to hunt down the Soviets. Ambushes, snipers, and tough decisions await the Germans as they push deeper into the city.&#10;&#10;The longer the game lasts the more Soviet Reinforcements infiltrate through the ruins to surround and cut off the attackers. To win the player will have to master warfare in the most brutal of all WWII battlefields&#10;&#10;Rattenkrieg is literally &quot;War of the Rats&quot; and is the name given to irregular and deadly city fighting. Brought published by Turning Point Simulations and designed by Steven Cunliffe who also made The Hell of Stalingrad.&#10;&#10;",
        "artist": "Craig Grando"
    },
    {
        "name": "Perplexus",
        "description": "Perplexus is a 3-D maze game where players must maneuver a small marble around challenging barriers inside a transparent sphere.&#10;&#10;Unlike traditional flat-surface mazes that are composed of one path, Perplexus houses various exhilarating tracks with 100 barriers and provides a three dimensional experience. Players select which track they would like to attempt, and then must work with gravity and carefully shift, flip, and twist the sphere to guide the marble.&#10;&#10;",
        "artist": "Michael McGinnis"
    },
    {
        "name": "Mijnlieff",
        "description": "Imagine noughts and crosses (tic-tac-toe) but with the need to think several moves ahead and with each piece having a particular power and control over your opponent. This is Mijnlieff (Pronounced &quot;Mine-leaf&quot;). Try to create the most lines of 3 counters in your colour.&#10;&#10;The game has four two by two boards. These are formed into a larger four by four board or, in a variant, arranged in different ways. Each Player has eight pieces with two of four different symbols. Each piece when played determines where your opponent can play their next piece.&#10;&#10;In Mijnlieff each piece you play instructs your opponent to play in a straight line (either othogonally or diagonally) from the piece just played, to play away from or to play adjacent to the piece just played. The aim is to form lines of 3 but with your opponent controlling where you can play this is harder than it sounds. If you can play so your opponent is unable to go you get a free play anywhere on the board.&#10;&#10;UK Games Expo best abstract game winner.&#10;&#10;",
        "artist": "Andy Hopwood"
    },
    {
        "name": "SmileyFace",
        "description": "SmileyFace is a card game of face-to-face family fun for four to eight players.&#10;&#10;Over the seven short rounds of the game, each player tries to collect the highest total face value of cards of a single type. Each round brings new surprises as the values of cards change and the wacky Mischief cards come into play. Only the player with the highest score for a round (and perhaps the player who lent him a helping hand) will win points!&#10;&#10;&quot;A King's Life&quot;: Intriguingly the designer reports that originally the game had a very different theme, being called &quot;A King's Life&quot; and concerned with a royal court and its attempts to cheer up a bored king. The retheme was recommended by the publisher.&#10;&#10;",
        "artist": "Antonio Dessi,Ben Prenevost"
    },
    {
        "name": "RoadZters",
        "description": "RoadZters is a flicking game, very much like Bisikle, also from CEPIA Games. The whole concept is in the ZBall, a marble with a unique internal mechanism. Very easy to control, you can spin it in different ways to do high precision shots. The goal of the game is to flick your way to the finish line as fast as possible. Players have to compete on a 13ft track with obstacles in order to win the car race - but if you fall off track, you lose your turn! No cards or electrical devices are involved.&#10;&#10;In RoadZters, the cars are also jumping ramps - so be bold and use your opponents to fly past them! The challenge is to control the effects of the ZBall and show a lot of self-control in challenges (slopes, fences, jumps, mouseholes, etc.). Will you manage to deal with pressure?&#10;&#10;Contents:&#10;1 Z-ball&#10;4 placeholder cars&#10;10 straight track parts&#10;16 curved track parts&#10;10 pillars&#10;10 fences&#10;1 jump&#10;1 mousehole&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Saustall",
        "description": "A body was found in the picturesque mountain village. Players try to guess the murderer and the motive behind the murder as well, as completing their own tasks (see below).&#10;&#10;During the game players &quot;bet&quot; on the characteristics of the murderer. In their turn, they play an action that allows them to give a suspect an alibi. Some alibis can be made invalid through other actions. Its also possible to lower or rise the chances of a suspect being the murderer. It does also contain an deduction element, because the clues that identify the murder cannot be changed. Finding out the clues that are in the game is vital. In the end one of the clues in the game will be drawn to identify the murderer.&#10;&#10;The game also contains a take-that element: Players can hinder the player taking his turn by giving him a task that he is obliged to fulfill instead of taking his turn, or risk negative points.&#10;&#10;In the end, players score positive points for the correct suspect, motivation and clues and negative points for the unfulfilled private tasks.&#10;&#10;",
        "artist": "Victor Boden"
    },
    {
        "name": "Kill the Overlord",
        "description": "It's good to be the Overlord. You have minions to grovel at your feet, limitless wealth, and absolute power over all the lands &ndash; but you know that your subjects are plotting. They envy your wealth and hope to steal it for themselves, specifically by removing you from the picture.&#10;&#10;So you've decided to secure your power and eliminate these individuals by sending your executioner out with orders to kill the first person he meets. Unfortunately, your executioner is a gullible fellow who's extremely enthusiastic about his job &ndash; easy to dissuade and misdirect, if you're clever enough.&#10;&#10;Who will be the first player with no excuse to miss his own funeral? Once the axe starts swinging, not even the Overlord is safe!&#10;&#10;Kill the Overlord is a fun, fast-paced game of political murder for 4 to 8 players that can be played in about twenty minutes. The goal of the game is simple: Eliminate other players by sending the Overlord's executioner after them, while at the same time saving your own skin. Each time a player dies, his survivors climb another rung up the political ladder, taking the deceased's title and all the wealth and power that comes with it. The player who can secure enough wealth and the title of Overlord first will become the True Ultimate Supreme Overlord (and win the game).&#10;&#10;",
        "artist": "Victoria Parker"
    },
    {
        "name": "Asara",
        "description": "In Asara, you take on the role of a wealthy builder competing to bring the most prestige to your name through constructing the largest and most ornate towers in the city.   The game is played over 4 rounds (years), during which you will be acquiring the pieces for your towers and assembling them.&#10;&#10;Players are given a hand of cards with different colors.  On their turn, players play a card from their hand to an action space on the board.  These spaces allow players to acquire tower pieces, get money, build a portion of their towers, etc.  Once a card has been played in one of the action spaces on the board, all subsequent cards played in that area have to follow the original card&rsquo;s color.  Turns continue around the table until all players are out of cards for that round.&#10;     &#10;Scoring happens at the end of each round based on the number of towers a player has and the ornamentation present on those towers.  After the scoring at the end of round 4, a final scoring occurs and bonus prestige points are given to the players with the largest towers of each color, the most towers, and the largest tower overall. The player with the most prestige points is the winner.&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Olympus",
        "description": "In the Ancient Greece, the poleis (city-states) thrived increasing their population and culture, occasionally waging war against each other, erecting buildings and celebrating ceremonies to get the favour of the deities abiding on Mount Olympus. The players will lead one of these city-states (like Athens, Sparta, Corinth, Thebes, Argos and others) expanding it and worshipping the various gods in order to become the hegemonic power of the Peloponnesus!&#10;&#10;Olympus is a deterministic (i.e., non-random) strategy game, based on worker-placement, resource management and building an efficient engine to score victory points (VPs). It also features a few more aggressive options than the average game based on the same premises (but the savvy player knows how to defend against them, if he prefers to quietly develop his own position).&#10;&#10;Each player leads a city-state that is defined by six values representing population, culture, military and productivity of the three resources (grain, venison and fish). During your turn, you send one of your three priests to worship one of the ten deities (Zeus, Hera, Demetra, Artemis, Poseidon, Athena, Aphrodite, Ares, Hephaestus or Apollo). Each opponent can now send one of his priests to celebrate the ceremony with you. After that, the deity grants his favor to whoever has sent a worshipper: the favor is larger for the leading priest (the one of the active player) and smaller for all the others (for example, Athena boosts culture by two points for the city of leading priest and by one point for the others; of course no boost is given to those who refused to send a priest to worship her). That deity cannot be chosen again in the current turn.&#10;&#10;Since almost all deities are specialized in a certain field, the players must choose which ones they prefer to worship sooner (also guessing which ones may be of interest for the opponents and which ones are safer to skip as they will not be chosen until later) and when it is better to get a smaller benefit following the priest of another player rather than saving a priest to get a greater boon but in a field that may not interest them as much (sort of quality over quantity).&#10;&#10;The resources your city produces (worshipping the correct deities) can be spent (worshipping other deities) to create buildings giving a variety of effects (and VPs), thus offering a lot of different strategic approaches to the game. Victory can be achieved with a plethora of buildings but also with very few ones. There are 45 different buildings: 33 can be built by anyone (even if someone else already did), while the other 12 are unique as only one copy of each can exist (introducing another element of contention between the players). You can also wage war to steal the resources of the other cities (if they were so foolish to keep their warehouses full and their military underdeveloped, it's just what they deserve) or invoke a terrible plague to decimate their population.&#10;&#10;All the actions (development, production, building, war, scoring, etc.) are done by worshipping the proper deity (and some gods give you a choice like &quot;do you develop your grain productivity &ndash; thus receiving more grain the next time you will produce it &ndash; or do you produce it now even if you won't get much?&quot;, adding crucial tactical decisions to the game).&#10;&#10;When all the priests have been used, there's a brief upkeep to check some simple conditions (e.g., players with more than five unused resources must discard those in excess) and then a new turn begins (all priests return home and all deities can be worshipped again).&#10;&#10;Being the first to reach the maximum value in a certain field (e.g. culture 10) gives you an award worth two VPs. When four of these awards are claimed, the game ends. Each player receives bonus points based on how developed his city is and the highest score wins.&#10;&#10;",
        "artist": "Antonio Dessi"
    },
    {
        "name": "Earth Reborn",
        "description": "After 500 years, two factions emerge from their underground cities into a new world, an Earth reborn from nuclear disaster.&#10;&#10;12 highly detailed miniatures represent the two factions which are:&#10;&#10;NORAD: military in thinking and origins. Scientists, engineers, add to their strength.&#10;&#10;SALEMITES: occultists working with cadavers, bringing the dead to life.&#10;&#10;Soon after emerging, these two factions meet - and it is determined that they cannot live together in peace.&#10;&#10;Earth Reborn offers nine scenarios that take you through missions of rescue, retrieval, and escort through areas of labs, mansions, towns, and more. Each scenario builds upon the rules of a new chapter: the game system is built like a tutorial. There are core rules to start the game, and each chapter offers 1-3 new rules along with a scenario that uses these new rules.&#10;&#10;The game also contains the innovative S.A.G.S. (Scenario Auto Generating System), where 2-4 players can make their own maps and mission objectives for near infinite replayability!&#10;&#10;Other features include:&#10;&#10;        A Tetris-like board construction using polyomino floor tiles.&#10;        An order tiles system to give commands to your miniatures.&#10;        Interrupt Duels with Bluff, betting command points to interrupt an enemy character and act during another player's turn.&#10;        The I.P.S. (Iconographic Phrasing System) that allows almost any effect to occur with icons, totally language independent.&#10;        Colored base arcs on miniatures to simplify Line of Sight, shooting, and close combat. It also multiplies characters&rsquo; variations and possibilities.&#10;        The Search rule, giving a visceral feeling to searching in rooms to find equipment.&#10;        A Mission Points track that also serves as a Morale Points track. &#10;        Radio Scrambling to mess with your opponents' orders.&#10;&#10;&#10;&#10;&#10;",
        "artist": "Christophe Boelinger,David Goujard,Paul Mafayon,Thierry Masson,Jean-Charles Mourey,Antoine Racano"
    },
    {
        "name": "Hecho",
        "description": "Hecho is Spanish for &quot;made&quot; or &quot;done&quot;. In this fast-paced trading game, contractors are pitted against one another competing for various construction projects. Use materials from the community scrapyard and trade with one another for the right combination of cards to complete available projects. The turnless, free-form nature of the game-play makes for a quick and chaotic fiesta for the whole family.&#10;&#10;",
        "artist": "Brent Knudson"
    }
]