[
    {
        "name": "Crimson Skies",
        "description": "Crimson Skies is a character-based board game of dogfighting and dive bombing in an aviation-dominated world; a simple, fast-playing game of pulp-fiction-style air combat.  It is a game about the men and women who pilot flying nightmares, the metal-sheathed birds of prey that spit death from the sky.&#10;&#10;In Crimson Skies, you are at the top of the aviation food chain - a fighter pilot, one of the fearless men and women who take to the skies each day for honor or profit.  Each player generates a minimum of two characters, a pilot and his or her wingman.  If your characters survive from mission to mission, they gain experience that can translate into better skills, and thus even better chances for future survival and success.  While this is a combat board game, not a roleplaying game, telling tales about your characters will invest the game with action, drama and humor, making the game-playing experience even more enjoyable.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Wordsearch",
        "description": "Wordsearch - for 2 to 4 players Ages 8 and up&#10;&#10;COMPONENTS&#10;Wordsearch gameboard and 96 wood letter tiles&#10;&#10;SETUP&#10;Randomly place the letter tiles, face up on every gray circle. The four red circles in the center of the board are left empty. Choose a player to go first. Score with paper and pencil (not included)&#10;&#10;PLAYING&#10;The active player slides one or more letters to make a word according to the following rules:&#10;A) Each letter must be moved in a straight line - horizontally, vertically or diagonally - one or more spaces. A letter must not jump over another letter or change directions.&#10;B) Each letter MUST form part of the word being made. A letter may not be moved out of the way to let another letter through.&#10;C) The word formed may include letters which the players has not moved.&#10;D) The word formed may read forwards or backwards, horizontally, vertically, or diagonally.&#10;E) Only one word may be formed or scored on a turn.&#10;&#10;SCORING&#10;After forming the word, players add up the values of the letters in the word formed and multiply by the number of letters in the word.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Mechwarrior: Dark Age",
        "description": "Mechwarrior: Dark Age is Wizkids Games continuation of the BattleTech property.  Jordan Weisman has tasked his design team with using the click-dials used in Mage Knight/Mage Knight Dungeons/Hero Clix to present a system of combined arms warfare in the BattleTech universe.  The system encourages use of Battlemechs, vehicles, and infantry to conquer your opponent.  The vehicles and infantry have dials similar to Mage Knight figures, with some new symbols to indicate new game mechanics.  Vehicles have long bases, like the mounted units.   Battlemechs use larger dials and include a heat dial which modifies three of the stats as the mech performs more actions.  The final result, while similar to Mage Knight is much more, using the simple action based system and dials, and bringing a new form of wargaming to the table.&#10;&#10;",
        "artist": "Sandra Garavito,Ethan Pasternack,Kevin Perrine"
    },
    {
        "name": "The Hammer of Thor: The Game of Norse Mythology",
        "description": "Probably the most comprehensive mythology game ever made, certainly about Norse myths. There are 365 cards, each one a different character from Norse mythology (which is why the game says that 365 people can play!)&#10;&#10;Play evolves along two phases: adventures in the wilderness to gather forces for Ragnarok, the final battle between good and evil. The player who is on the winning side of this battle who has the highest Reputation wins the game. Beyond the 365 character cards, there are card sets representing Offspring, Shape Changing, Magic Items, Forged Magic Items, Fates, Runes, and Predictions. There is also a color map, sheets of charts, sheets for character tracking, counters and a rulebook.&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "7 Ages",
        "description": "7 Ages is a game of world history from 4000 BC/E to 2000 AD/CE. Players represent dynasties that decide the fate of the world across the millennia.&#10;&#10;You, as a dynastic head of one or more empires must guide your empires through history gaining glory points for historical, scientific, religious and cultural advances as you increase their health, wealth and prestige. All the leading figures of history are included, as they attempt to influence events and their society through their great words and deeds.&#10;&#10;Players can play multiple civilizations simultaneously (though the counter set limits the total number of civilizations that can be in play), but the first civilization card played determines the time frame in which the game starts, restricting which additional civilizations may actually be played and/or what historical leaders civilizations in play may use. This makes the secret bids to get the first move important to all players.&#10;&#10;The game features playing cards that represent either a historical civilization, an action, or a civilization advance, depending on the context in which the card is played. Each card also has a numeric value, used for making bids and trading. The game also features a system of a limited number of action options per player based on chits secretly selected by players each turn -- for example, if you are playing more than one civilization, only one can declare war, only one can take production, etc. There is a &quot;wild&quot; chit each player can use to let two of his or her civilizations take the same action, but the civilization using the wild chit pays a penalty.&#10;&#10;Victory points and civilization levels are plotted using an on-board scoring area. Game play can be quite long with more than two or three players, so most games end at a predetermined time or turn with the player with the most victory points from all his or her civilizations combined winning.&#10;&#10;",
        "artist": "Rob Armstrong,Bullseye Graphics,Chris Denton,Michael Fisher"
    },
    {
        "name": "Ultimate Mastermind",
        "description": "Ultimate Mastermind has an extra code peg which brings it to another dimension. The code-maker selects arranges any 5 pegs in the compartment right in front of him or her, which is hidden from the code breaker. The code-breaker then has to make guesses as to what the code is by filling in rows of 5 pegs using the feedback from the code-maker (correct color/correct position, correct color/incorrect position, or nothing). There are ten chances to break the code. If the code-breaker cracks the code in 6 tries, that is how many points are given to the code-maker. Players alternate as code-maker and code-breaker for as many rounds as they would like to play. The player with the lowest point total after the predetermined number of rounds are played, is the winner.&#10;&#10;This is a more advanced version of the original Mastermind game. This version includes 5 holes (versus 4 in the original).&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "4th Reich",
        "description": "This super-obscure game by Task Force Games is secretly based on the SF-novel &quot;The Iron Dream&quot; by the Jewish author Norman Spinrad. This very controversial novel describes a parallel world in which Hitler wasn't successful with his &quot;Kampf&quot; in Germany and became a successful SF-pulp-novelist in the US. The main part of the book is the actual text of Hitler's &quot;Iron Dream&quot;, a pulp-tale about &quot;Ubermenschen&quot; conquering a future world filled with mutant &quot;scum&quot;. The idea of Spinrad's novel was to expose fascist tendencies in 50's American literature. The TFG designers transported this &quot;theme&quot; into a board game which plays like a wargame: future Nazis against future mutants. The names of all protagonists have been changed to avoid copyright infringement, but the game clearly takes its slightly tongue-in-cheek approach directly from the book. One asks why this bittersweet parody has actually to be played as a game, but everybody can decide for him/herself I guess...&#10;&#10;",
        "artist": "Dana Lombardy,Bruce Weigle"
    },
    {
        "name": "Full Thrust",
        "description": "From the Second Edition back cover:&#10;THE Tactical Starship Combat Rules!&#10;Simple, fast-play rules that can be used with any size of starfleet! Basic rules of play can be learned in just a few minutes! No referring to charts or tables required during play!&#10;&#10;This new edition gives you all the fun of the original plus much more:&#10;&#10;    Many new optional rules&#10;    Complete ship contsruction and costing rules&#10;    Campaign rules and battle scenarios&#10;    Fully photo-illustrated&#10;    Background detail and expanded ship statistics&#10;&#10;&#10;&#10;&#10;Recommended Additions:&#10;&#10;    More Thrust: The Full Thrust Supplement &ndash; very useful supplement for the game&#10;&#10;&#10;&#10;&#10;Related to:&#10;&#10;    Dirtside II &ndash; sci-fi ground vehicle combat&#10;    Stargrunt II &ndash; sci-fi ground infantry combat&#10;&#10;&#10;&#10;&#10;",
        "artist": "Paul Copeland,Dave Garnham,Barrie Quin"
    },
    {
        "name": "Brilliant Lances",
        "description": "From the Box:&#10;In space combat, you never see your opponent until it's all over, if even then.  With acquisition and tracking ranges measured in tens of thousands of kilometers, to human eyes the people that are trying to kill you are not even a speck.  But they can hurt you, even though you can't see them.  Precise laster arrays and big particle accelerators, honed by centuries of engineering, can reach out without warning to slit your hull like the belly of a fish, spilling life--oxygen, heat, and fuel--into the hard vacuum.  That's why space combat is a game of cat and mouse.  Keep yourself wrapped in the mantle of space--cold, dark, silent.  Keep your thrust burns to a minimum--they blaze like miniature suns for all to detect.  Rig your passive sensors to greedily absorb data, but remain quiet yourself--give nothing away.  Keep your weapons ready, in case&hellip; There!  A faint trace of mid-wavelength infrared betrays a meneuver drive.  Bring up the ladar dishes while the big passive array builds up a targeting solution.  The moments seem endless while every crewmember shares the same thought: &quot;Have they seen us?&quot; It is the unseen enemy at this moment doing the same thing that you are?  You might never know the answer.  If you beat him, maybe you'll find out.  But what if you hadn't seen him first?  Some questions must remain unasnwered when death, unbidden, comes scorching toward you as silent, brilliant lances.&#10;&#10;From the box:&#10;Brilliant Lances - Traveller Starship Combat&#10;Brilliant Lances includes:&#10;-Vector-based movement&#10;-Detailed hit location and damage resolution&#10;-Lasers, particle accelerators, meson guns, detonation laser missiles, and the systems that defend against them&#10;-Extensive ship ratings, including New Era and pre-Collapse warships, from the swift Rampart fighter up to large naval and merchant vessels&#10;-Complete starship design rules, usable both with this game and with Traveller: The New Era roleplaying game&#10;&#10;",
        "artist": "Rob Caswell,Robert Lazzaretti,Kirk Wescom"
    },
    {
        "name": "Silent Death",
        "description": "Silent Death is a space combat game, normally played with miniatures. Most ships are fighter and heavy-fighters in size, but there are expansions to include gunboats and small capital ships. Each ship has a control sheet to make all bookkeeping (mostly damage and ammo when necessary) easier. The game is normally played in 10 turns, each player alternate moving all ships before making attacks.&#10;&#10;From designer's notes:&#10;Silent Death is an attempt to produce a fun and fast-moving game that is simple to learn. The mix of design trade-offs (detail for playability) in the Standard Game feels about right, but since you can't satisfy all of the people all of the time, we piled in a bunch of optional rules so players can find their own optimum mix; either simpler or more complex.&#10;&#10;Re-implemented in:&#10;&#10;    Silent Death: The Next Millennium Deluxe Edition&#10;&#10;&#10;&#10;&#10;",
        "artist": "William Hyde,Angus McKie,Darrell Midgette,Raymond  Rubin"
    },
    {
        "name": "Sturm Nach Osten",
        "description": "This strategic level game covers the East Front from June 1941 to May 1945 with one-month turns. The game has variable victory conditions reflecting the historical ebb and flow. Main units are fronts, armies and corps; also units for static garrisons and Soviet factories (need to move eastward by rail before capture); markers for fortification, artillery, overrun/blitz and dispersal are all provided. Weather, terrain, supply and ZOC rules are used. Victory is measured by control of key cities at key moments.&#10;&#10;The rules provide for several &quot;scenarios&quot; (different start and end dates) for shorter playing times and there is also a simplified version using less units and stripped down rules.&#10;&#10;&#10;First published as a Game Kit by the designer with color copied counters on blue &amp; red paper and a B&amp;W map that you could color in.&#10;The Wargamer Magazine Vol.I, #19 is the 2nd edition of the game&#10;&#10;",
        "artist": "Masahiro Yamazaki"
    },
    {
        "name": "Dr. Seuss Green Eggs and Ham Game",
        "description": "From the box&#10;Do you like green eggs and ham?&#10;If you'll eat them on a boat, and if you'll eat them with a goat, then your family will enjoy this delightful board game.&#10;The Green Eggs and Ham Game is easy to learn, and designed so that children and parents can have fun playing together.  Just use your memory to match cards to spaces on the board &mdash; make three matches and you're ready for a taste of green eggs and ham.&#10;The game helps kids practice early reading skills and lets you and your children enter the fun and exciting world of Dr. Seuss.&#10;&#10;",
        "artist": "Theodor Seuss Geisel"
    },
    {
        "name": "Harry Potter: Diagon Alley Board Game",
        "description": "The object is to visit all of the shops on the board and purchase one of each item for your wizard's trunk.  The first player to fill their trunk and return to the Leaky Cauldron wins.&#10;&#10;You have to pass by Gringott's Wizard Bank several times to get enough money (plastic galleons, sickles and knuts) to purchase everything. Hogwart's school supply list includes potion bottles, cauldrons, robes, wands, books and owls.  The shops don't have enough for everyone, so you must hurry. Spell and havoc cards let you take items, move using floo powder, close shops and more. There is also always the danger that you'll be sent to Knockturn Alley by rolling double cauldrons.&#10;&#10;The game includes simplified rules for younger players. These include stocking shops with enough items for everyone, changing the &quot;take a card&quot; spaces to &quot;roll again&quot; spaces, and no being sent to Knockturn Alley.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Splat!",
        "description": "In this otherwise typical children's path-race game, instead of sending your opponents' play-dough pawns back to start, you smash them.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Street Illegal",
        "description": "8 track cards (from a total of 48 cards) are used to build a track.&#10;Each player gets 5 tempo cards.&#10;All players play tempo cards simultaneously and try to get in front of the field.&#10;6 cars are NON-player cars - these are called &quot;Alte Hasen&quot; (old pros) and are controlled by a rule mechanism - the same rules are used when playing this race alone - there are always seven cars in the race (one old pro for example when 6 players are playing)&#10;The chips are earned for good maneuvering and may be used in bluffing when attacking other cars.&#10;&#10;",
        "artist": "David Bardin,Benjamin Barnett,William W. Connors,Andrea Jaccarino,Enrico Spies"
    },
    {
        "name": "Smart Mouth",
        "description": "Two letter tiles appear when one player slides the top of a plastic device back and forth (the device resembles a credit card imprint machine).  The first player to shout out a word of five letters or more that starts with the first letter and ends with the second wins the tiles.  Whoever wins the most tiles wins the game.  Many other variations are included in the rules.&#10;&#10;2002 Mensa Select&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Elefant Hunt",
        "description": "A Tom Wham game appearing in Dragon (Issue 88 - Aug 1984). Move your hunter on the board and capture animals to bring back to port. Players hire hunters and collect supplies for an expedition to the interior. When they feel they are ready, they set out to hunt wild game and bring back lots of animals - alive. First one to 100 points wins.&#10;&#10;",
        "artist": "Tom Wham"
    },
    {
        "name": "Mare Nostrum",
        "description": "In the Ancient World, civilizations are built upon 3 foundations: Commerce, Construction, and Expansion. As a leader of an ancient Mediterranean Power, each player will need to master all 3 roads to power in order to lead their civilization to dominance and victory.&#10;&#10;Mare Nostrum is all about the expansion of one's lands, the construction of new cities, and the dispatching of caravans to take advantage of rare commodities that can either be traded or exploited to build constructions and eventually wonders of the world.&#10;&#10;But diplomacy and trade are but one path to greatness. The expansion of your navy and armies can take what should be rightfully yours. Hiring great leaders will further expand your boundaries in quick time.&#10;&#10;Controlling a combined total of 4 Wonders and/or Leaders or being the first to build the Pyramids will assure victory. But there are many hurdles to overcome to achieve such heights.&#10;&#10;Mare Nostrum allows for up to 5 players and offers a basic and advanced game in which players can customise their starting civilisation. For a game of such scope, it is quite amazing to think that the game only requires 2 pages of rules.&#10;&#10;Mare Nostrum is a winner of the 2001 Concours International de Cr&#195;&#169;ateurs de Jeux de Soci&#195;&#169;t&#195;&#169;.&#10;&#10;",
        "artist": "Franck Dion"
    },
    {
        "name": "Interplay",
        "description": "The game is a Go-Moku elaboration; players must get five pieces in a row. However, there are narrow pieces and wide pieces, and winning requires making one of three patterns (e.g., N-W-N-W-N).&#10;There are three different types of pieces: a narrow cylinder, a wide cylinder, and a wide tube. The narrow cylinder will fit inside the wide tube, and so those two pieces can share the same space - but only if they belong to opposite players.&#10;Pieces may also be moved, once there are no more new ones to be placed.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Bowling Dice",
        "description": "from the box: &quot;All the fun of lane bowling without the gutter balls&quot; and &quot;The bowling game you can play anywhere, anytime!&quot;&#10;&#10;Roll the dice, score the points as in bowling, pass the dice to the next player.&#10;&#10;Comes with 10 dice and scoring pad.&#10;&#10;Similar games:&#10;&#10;    Spare Time Bowling&#10;    Bowl and Score&#10;    Bowl-A-Strike&#10;&#10;&#10;&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "The Art of Siege",
        "description": "From the publisher:&#10;&#10;Four great siege battles:&#10;&#10;    Acre - Richard the Lionhearted's arrival signals the end of the two year defense by Saracens in the Third Crusade. &#10;    Tyre - Alexander the Great undertakes the first large-scale amphibious assault in history. &#10;    Lille - the greatest star fortress in France is taken by the Anglo-Dutch-German Confederation. &#10;    Sevastopol - Ingenious Russian fortifications in the Crimean War require one year of continuous bombardment before the city is taken. &#10;&#10;&#10;&#10;&#10;Each battle in The Art of Siege is simulated on its own comprehensively illustrated map portraying the actual siege areas and fortifications. Colorful cardboard playing pieces move, position, and engage according to the nuances of each game's system of movement. Simple probability charts reveal each combat's outcome.&#10;&#10;&#10;The Strategy &amp; Tactics magazine game The Siege of Constantinople is considered by some to be the &quot;fifth quad&quot; game of this set.&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "The Siege of Constantinople",
        "description": "Published in Strategy &amp; Tactics magazine #66.&#10;&#10;Historical simulation of the fall of Constantinople to the Ottoman Turks in 1453. There are rules for two games included; one which covers the final assault, in which most of the action occurred (~2 hrs), and one which covers the entire siege (~4 hrs).&#10;&#10;Considered to be the &quot;fifth quad&quot; game from The Art of Siege set.&#10;&#10;Scale:&#10;Level of Complexity = Moderate&#10;Average Playing Time = 5 hours&#10;Suitability for Solitaire Play = Moderate&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "Dragonriders of Pern",
        "description": "Dragonriders of Pern presents the struggle among the Leaders of the six different Weyrs to be recognized as leader of Pern.  Each player vies with the others for the support of the Lord Holders while simultaneously keeping Pern free of Thread.  If the northern continent of Pern has been so Threaded that it cannot support life, then all the players lose, along with Pern.&#10;&#10;",
        "artist": "David B. Bromley,Jim Clouse,Tim Hildebrandt,Michael Whelan,Robin Wood"
    },
    {
        "name": "Forbidden Bridge",
        "description": "A motorized adventure game in which explorers attempt to bring back gems from a lost civilization.  The game is in two halves: moving across a static river, climbing a short cliff and then moving one's explorer across the forbidden bridge.  The &quot;angry idol&quot;, when depressed, will shake the bridge in an attempt to knock the crossing explorers onto the river below.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Cannibal Pygmies in the Jungle of Doom",
        "description": "The second game in the B-Movie Series of card games.  This game has a jungle adventure theme with homagesto   Tomb Raider, Indiana Jones, and cliches from various other adventure movies.&#10;&#10;Throughout the game the players create a movie by playing characters, props, and locations.  There are also creature cards that target other players' movies and Special FX cards that perform various actions such as modifying attacks or hindering other players.  The goal of the game is to have the movie with the most points when the &quot;Roll the Credits&quot; card is played or when the draw deck runs out.&#10;&#10;From the publisher:&#10;&#10;&quot;From the Producer and Director of Grave Robbers from Outer Space comes a New Low in B-Movies: Cannibal Pygmies in the Jungle of Doom.  Swing into adventure as the Jungle Queen and Skippy the Wonder Dog.  Come face to face with Dinosaurs, Nazis, and Dancing Haitian Voodoo Zombies!  Will the Great White Hunter escape the clutches of the Native Chieftans' Daughter?  Will he?  WILL HE?!?  120 card stand-alone game for 2 - 6 players.  100% Compatible with Grave Robbers from Outer Space --- just shuffle them together!  Easy to learn, fun to play.  Running time: 20 to 40 minutes.  This game is rated PG-13.&quot;&#10;&#10;",
        "artist": "Steve Bryant,Tommy Castillo,Jason Millet"
    },
    {
        "name": "Baseball Strategy",
        "description": "The two players select their lineups from imaginary players or actual players by converting their stats to the game's parameters. (This is easily done from mlb.com on the net.)&#10;&#10;The Defensive team is the manager and catcher, selecting pitch types (Fast Ball, Off Speed, Pitch out, etc. )to get batters out.&#10;&#10;Offensive managers and batters must then select a type of offense/ball in play strategy (Steal, Bunt, Hit and Run, Long Ball, etc.)The defensive team commits first with a &quot;Pitch&quot; card.  The offensive team then orally calls its strategy. The results of the two choices are found by cross indexing them on a result matrix table. This is classic matrix game theory where one player is trying to minimize his opponent's results while maximizing his own.&#10;&#10;Players can decide on the size of ballpark before the game.&#10;There are rules for series play in order to give proper rest to pitchers.  The game even has injury possibilities.&#10;&#10;Great baseball action.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "BANG!",
        "description": "&quot;The Outlaws hunt the Sheriff. The Sheriff hunts the Outlaws. The Renegade plots secretly, ready to take one side or the other. Bullets fly. Who among the gunmen is a Deputy, ready to sacrifice himself for the Sheriff? And who is a merciless Outlaw, willing to kill him? If you want to find out, just draw (your cards)!&quot; (From back of box)&#10;&#10;The card game BANG! recreates an old-fashioned spaghetti western shoot-out, with each player randomly receiving a Character card to determine special abilities, and a secret Role card to determine their goal.&#10;&#10;Four different Roles are available, each with a unique victory condition:&#10;&#10;     Sheriff - Kill all Outlaws and the Renegade&#10;     Deputy - Protect the Sheriff and kill any Outlaws&#10;     Outlaw - Kill the Sheriff&#10;     Renegade - Be the last person standing&#10;&#10;&#10;&#10;&#10;A player's Role is kept secret, except for the Sheriff. Character cards are placed face up on table, and also track strength (hand limit) in addition to special ability.&#10;&#10;There are 22 different types of cards in the draw deck. Most common are the BANG! cards, which let you shoot at another player, assuming the target is within &quot;range&quot; of your current gun.  The target player can play a &quot;MISSED!&quot; card to dodge the shot.  Other cards can provide temporary boosts while in play (for example, different guns to improve your firing range) and special one-time effects to help you or hinder your opponents (such as Beer to restore health, or Barrels to hide behind during a shootout). A horse is useful for keeping your distance from unruly neighbors, while the Winchester can hit a target at range 5. The Gatling is a deadly exception where range doesn't matter: it can only be used once, but targets all other players at the table!&#10;&#10;Information on the cards is displayed using language-independent symbols, and 7 summary/reference cards are included.&#10;&#10;",
        "artist": "Alessandro Pierangelini"
    },
    {
        "name": "Songburst: 70's & 80's Edition",
        "description": "&quot;The Complete-the-Lyric Game&quot;&#10;&#10;Two or three teams attempt to complete lyrics from popular songs. Players are given the year, the artist, the song title and the first two or three words; if nobody can get it, then more words are revealed.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Snapshot",
        "description": "From the introduction:&#10;Snapshot is a game of close-action combat between individuals.  It's primarily inside starships of the far future. Snapshot is an adaptation and more detailed rendition of the personal combat rules from in Traveller, the science-fiction role playing game. &#10;Components include 120 die-cut counters, detailed ship plans, rules, and scenarios making the game playable with or without Traveller.&#10;&#10;",
        "artist": "Rich Banner,Richard Hentz,Jennell Allyn Jaquays,Chris White (I)"
    },
    {
        "name": "The Succession Wars",
        "description": "The Succession Wars is a grand strategic game set in the BattleTech universe. The game  system is not overly complex, but does feature money (taxing and expenditures), technology levels, and leaders (characters from the BattleTech continuity, who have multiple uses).&#10;&#10;Note that despite what the box copy below implies, all five Houses are always in play. Playing with fewer than five players requires at least some players to play multiple Houses.&#10;&#10;Furthermore, there are in fact only two scenarios provided in the box, one for the Third (or possibly Fourth) Succession War, starting in 3025, and one for the First, starting in 2786.&#10;&#10;From the back of the box:&#10;&#10;For over 200 years, the five Successor States of the near-legendary Star League have warred among themselves for dominion over the whole Inner Sphere. There have been three Succession Wars to date, but no victor. The cost of war is high. The leaders of the Successor States must weigh each maneuver to see whether the gain in territory is worth the loss of 'Mechs. Only the most ruthless and brilliant leader will emerge as the next Star Lord.&#10;&#10;The Succession Wars is a 2- to 5-player game, where each player assumes the role of a House leader. All the most famous and infamous regiments of the BattleTech universe are at your command - the elite Kurita Sword of Light, the Davion Guards, and the mercenary unit Wolf's Dragoons. The game allows players to fight any Succession War, including the fourth, toward which the Inner Sphere is now building. The game system is simple and fast allowing strategy - not the rules - to be the deciding factor.&#10;&#10;",
        "artist": "Dana Andrews,Charles Bernard,James Holloway,Jeff Laubenstein,Todd F. Marsh"
    },
    {
        "name": "Battlefleet Gothic",
        "description": "A space battle game set in the Warhammer 40,000 universe.  BFG uses a variety of spaceship miniatures that are moved and fired by distance measuring.  Battles have a Age-of-Sail-in-Space feel to them with more emphasis on broadside attacks than on 'air' superiority.  The core rules contain scenarios along with campaign rules.&#10;&#10;The starter box was out of print for couple of years, but due to popular demand (or a large surplus of miniatures in their warehouse), Games Workshop re-released it.&#10;&#10;The starter box set is now OOP.  The rules have been revised, and are available in book format and free PDF downloadable files.&#10;&#10;As of 2013, the ships are no longer available from Games Workshop or Forgeworld.&#10;&#10;The game is expanded by Battlefleet Gothic Armada Armada supersedes the BFG rulebook, often referred to as 'the blue book.'&#10;&#10;",
        "artist": "Dave Andrews,John Blanche,Alex Boyd,Wayne England,Talima Fox,Des Hanley,Neil Hodgson,Nuala Kennedy,Paul Smith,John Wigley,Richard Wright"
    },
    {
        "name": "BattleTech Science Fiction Combat Book Game",
        "description": "Based on the fantasy Lost Worlds game books (but incompatible with the Lost Worlds series). Each player uses a book and a stat sheet that represent their 'mech. By giving your opponent your book, and taking theirs, you get to see the actual first person view in the combat.&#10;&#10;Books in the series include:&#10;&#10;GRF-1N Griffin&#10;LCT-1S Locust &#10;RFL-3N Rifleman&#10;SHD-2H Shadow Hawk &#10;WHM-6R Warhammer &#10;WSP-1A Wasp&#10;&#10;",
        "artist": "Doug Shuler"
    },
    {
        "name": "Catan: Portable Edition",
        "description": "Settlers of Catan Travel Edition is, as the name says, a Travel Edition of The Settlers of Catan. &#10;The rules of the game are the same, but there are some changes between the two editions: &#10;&#10;    No Expansions: In the Travel Edition it is not possible to add any expansions to the regular game, so it is a 3 or 4 players game only. &#10;    Pre-determined Desert location: The hex containing the Desert is always in the middle of the board. &#10;    Pre-determined numbers: The numbers for production are in fixed locations on the board. That is a natural follow up to the previous item. &#10;    Pre-determined port location: Although the type of port at a given location may vary, the port sites themselves are in fixed locations. So the numbers for production, where a port exists, are always the same, and there is never a port near the Desert. &#10;    Snap in bits: The roads, villages and cities are all snapped into the board during game play, so it is difficult to mess with the board. The Robber, however, sits freely on the board, and, as you need somewhere to throw the dice, you may prefer a table upon which to play the Travel Edition (although the box top or box insert could be used as a dice tray).&#10;&#10;&#10;&#10;&#10;Belongs to the Catan Series.&#10;&#10;",
        "artist": "Volkan Baga,Tanja Donner,Harald Lieske,Stephen Graham Walsh"
    },
    {
        "name": "Footmania",
        "description": "A French game about soccer.&#10;You don't have to play soccer, but to make money with it ! You will buy or send players, arrange matches, ...&#10;A good French touch by Ludod&eacute;lire.&#10;&#10;",
        "artist": "Pascal Labory"
    },
    {
        "name": "Strong Stuff!",
        "description": "Bruno the Bear is ravenously hungry, so hungry that he's prone to grabbing honey jars recklessly and taking off for the woods. But will you be able to help him carry his ever-growing pile of honey jars without knocking them over?&#10;&#10;Strong Stuff! &ndash; previously published by Goldsieber with slightly different rules as B&auml;renstark &ndash; is a dexterity game in which players move Bruno, represented by a wooden bear, across a series of meadow tokens. Each turn, the active player rolls the die then either moves Bruno a number of spaces equal to the number of dots on the die or leaves him in place; when moving Bruno, a player cannot touch the tray he holds or any honey jars already balanced on his head. In either case, the player ends his turn by stacking a new honey jar on the highest jar on Bruno's tray.&#10;&#10;The honey jars come in six sizes, making stacking tricky; should any jar fall while a player moves Bruno, that player loses one of two honey drops he was given at the start of the game. Once a player loses both honey drops, the game ends and whoever has the most honey drops in hand wins.&#10;&#10;The HABA edition of Strong Stuff! includes a special die for experienced players in which you're challenged to spin Bruno in place or move him only with your right or left hand. (Note: The HABA edition is for 2-6 players, while Goldsieber's B&auml;renstark was labeled for 2-4 players.)&#10;&#10;",
        "artist": "Felix Scheinberger"
    },
    {
        "name": "Wabanti",
        "description": "Each player tries to move the existing structure of game stones in the direction of his side of the board.  If a game stone touches the outside of the game field, then the player to whom this side belongs has won. If a corner of the game field is reached, the two players to whom the adjoining sides belong share the win.&#10;&#10;",
        "artist": "Matthias Wittig"
    },
    {
        "name": "Tahiti",
        "description": "A quirky auction game played on a delightfully eye-catching roll-up board with large colored marbles and stylized wooden sailboats.&#10;&#10;The colored marbles are designated &quot;pearls,&quot; and you buy spots for them on the board in two steps, taken in either order:  First (or second), buy a pearl of a particular color.  Second (or first), buy the right to place it in a row or column labeled with a particular letter.  There's an auction on each player's turn where one choice in both these possibilities goes on sale at the same time.  So, perhaps the auction is for B, or a blue pearl.  If you win the auction and you've already got a pearl, you immediately have to choose a spot for it somewhere in row or column B; if you've already got your letter bought, you get the blue pearl and immediately choose a spot for it; if you've got neither, you can take either one and await getting the other in a later auction.&#10;&#10;Ultimately your scores are determined by how many pearls of the same color are clustered together and the number of empty spaces surrounding the cluster, and whether you have more pearls than anyone else in the cluster.&#10;&#10;Tahiti is an excellent choice if you enjoy auctions, area majorities, and that &quot;Acquire&quot; kind of feeling you get from watching squares fill in and grow into scoring groups.&#10;&#10;",
        "artist": "Ralf E. Kahlert"
    },
    {
        "name": "Crisis: Korea 1995",
        "description": "Forty years of tense, uneasy peace are suddenly shattered as the Korean Peninsula erupts in renewed warfare. Two peoples -- historically, ethnically, and culturally homogeneous, but polarized by politics and economics -- hurl men, weapons, and materials into the fray in an attempt to settle their division once and for all.&#10;&#10;From Pyongyang in North Korea to Pusan in South Korea, the battle rages. While the front line surges east to west across the peninsula, both sides commit airborne and seaborne Special Forces and Marines as well as their Air Forces to deep penetrations into enemy territory. With skilled infiltration capabilities, and the strategic mobility of armor, airmobile, paratroop, and marine forces, there is no safe haven throughout the length or breadth of Korea.&#10;&#10;While the North and South battle for a quick, decisive victory, the world awaits the response of the two military superpowers in the region, the United States of America and the People's Republic of China. Will the United States reinforce the South, and if so, how, when, and in what strength? Will the Communist Chinese again intervene into the Korean conflict as they did in 1950? As the situation evolves, choices are made, forces are committed, and the security of Japan and the future of the two Koreas hangs in the balance.&#10;&#10;Crisis: Korea 1995 allows players to fight a near-future war on the peninsula. Players have access to virtually all available military assets of North and South Korea, as well as large forces from the USA and the PRC. The integrated, easy-to-learn air-land combat system allows for unit efficiency, armor effects, tunnels, light infantry, attack helicopter, Close Air Support, Cruise Missiles, and particularly tough terrain of Korea.&#10;&#10;",
        "artist": "Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "Battle for Germany",
        "description": "Battle for Germany game is small, it only takes about three to four hours to play for players of normal skill and luck. The game starts in December of 1944 with the Ardennes Offensive (a variant allows the German player to skip this and save his strength). As a two-player game, it is interesting in that each player plays both an Allied army (Western Allies or Soviet Union) AND a German army (Western Front or Eastern Front). This forces each player to play offense and defense. The player playing the Western Allies and Eastern Germans has a very challenging task. The Western Germans have good defensive terrain (the Rhine river and Westwall defenses), while the Eastern Germans have weak units, a long front, very poor defensive terrain and they face a large Soviet and Yugoslav army. The only real advantage enjoyed by the East German player is the lack of victory points to be gained in the East, and the slow Soviet replacement rate. The Western Alllied units are very fast moving, but they don't usually get a chance to exploit this until the very end of the game (at best).&#10;&#10;The map is the same size as most SPI Quadrigames or folio games and has similar graphics. Cities are rated as 1 or 2 victory points, with Berlin worth 10. A line down the middle of Germany cannot be crossed (in the 2-player game), which makes Berlin the only city which can be captured by the Western Allies or the Soviets (ahistorical, but essential to the game's concept). Units are corps for the Germans and Western Allies and corps, armies, or fronts for the Soviet player. Each unit is rated for attack, defense and movement. Combat is decided by an odds-based combat results table and a die roll. Combat results include various combinations of retreat and elimination (there are no step losses, disruption or anything like this). Eliminated units can be replaced, but very slowly and (for some players) with the weakest available unit coming back first.&#10;&#10;The game includes variants for 3- and 4-player versions where the Germans are played by 1 or 2 players, and a &quot;red star/ white star&quot; scenario where the Western Allies and Soviets fight it out with some help from the remnants of the German army.&#10;&#10;",
        "artist": "Christine Lockwood,David McElhannon,Mark Simonitch,Redmond A. Simonsen"
    },
    {
        "name": "Fact or Crap",
        "description": "Basic trivia game where players try to figure out if a statement is a Fact, or just a load of Crap.&#10;&#10;The players take turns being the Reader in a clockwise direction.&#10;&#10;After the Reader has read the first question, the other players have to decide as fast as they can whether the answer is Fact or Crap.  The players indicate their answer by putting face down either their Fact Answer card or Crap Answer card.  The Reader then determines which player was the first to put their Answer card down.  Once all of the Answer cards are down, the player who was first to answer turns over their Answer card.  If the answer is correct, they receive 2 tokens from the middle pile.  The Reader will then ask everyone to turn their Answer cards over.  All other players with the correct answer will receive 1 token.  All players with the wrong answer (including the player who puts their Answer card down first) will have to put 1 token back in the middle pile.&#10;The Reader&rsquo;s turn is complete when all 3 questions have been read.  The Question card is then returned, face down, to the bottom of the Question card pile.&#10;&#10;During the game you will randomly draw Rush Hour cards.  The Reader who picks up a Rush Hour card may nominate any player to answer the Rush Hour questions.  Once the nomination has been made, the egg timer is turned over and the Reader begins to read the questions.  The aim is to have all 5 questions asked and answered within the time limit so that both Reader and the answering player have a chance to win as many extra tokens as possible.&#10;&#10;There are two ways to win Fact or Crap.&#10;- The game ends when all tokens from the middle pile are gone.  Players then count up their tokens.  The player with the most tokens is the winner, proving they know the most Fact or Crap!&#10;- In the event that all players but 1 have lost their tokens, the remaining player is deemed the winner.&#10;If at any time during the game a player loses all of their tokens, s/he is then out of the game.&#10;&#10;Re-implemented as:&#10;&#10;    SpongeBob SquarePants Fact or Fishy DVD Game&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Advanced Tobruk",
        "description": "So what's NEW in the new TOBRUK ? Plenty! The map presentation is entirely new. Instead of being 'locked' into a small map area, you'll now receive two 22&quot; x 34&quot; geomorphic mapsheets that can be connected on any side. &#10;  &#10;The terrain presentation includes sand and scrub on each mapsheet. Card stock overlays are provided for hills, wadis, deirs and sand dunes to allow for the customization of the map required in many scenarios. And a random overlay generator is also part of the kit, to enhance replay value between play sessions. &#10;  &#10;The counters have the overhead view of AFVs and vehicles debuted in wargaming with TOBRUK. Vehicles and guns now come on a 3/4&quot; counter, infantry on a 5/8&quot; and markers remain on a 1/2&quot; square. New, four color art is provided to keep things bright, and information for the use of the units depicted on the counters is provided...on the counters...to replace tedious table look-ups during play. &#10;  &#10;Speaking of counters, a wide array of units not found in the original TOBRUK are provided in the new edition. including various armored cars and more new units are provided to allow you to game myriad situations from 1940-1943. &#10;  &#10;A new card-based scenario presentation combines the historical synopsis with the orders of battle, map requirements and any special rules. All the information needed for play is found on one card to make setting up and keeping track of the action faster and easier.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Necromancer",
        "description": "Necromancer is a fantasy game for two players. Each player becomes a Necromancer - a powerful wizard controlling the forces of the undead. As their skeletons and zombies battle, the Necromancers use their powers to take control of enemy units! The goal: to find the mystic Jewels of Power - and destroy the enemy Necromancer.&#10;&#10;A unique combat system varies the power of a player's troops according to the number of units he controls; the more undead you control, the weaker each unit is. All counters are back-printed, since any unit may change sides.&#10;&#10;(from the back of the box)&#10;&#10;Originally published in The Space Gamer #55, September 1982.&#10;&#10;",
        "artist": "John Borkowski,Jeffrey D. George,Denis Loubet,Dave Martin"
    },
    {
        "name": "Fortune",
        "description": "In Fortune, each player makes money by buying plants, fuel and computers with which to produce goods.  Such goods are distributed by one of a number of distributors, depending on how much you are selling.  Players may also make money by becoming major shareholders in any of the distribution or service firms around the board.  Special dice are used for takeovers.  Players may also buy insurance, consultancy and advertisement to insure against any loss, improve their sales or assist their business's effectiveness.&#10;&#10;The winner is decided by predetermined conditions; either playing for a set time or reaching a monetary target.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Space Marine",
        "description": "Space Marine is a miniatures wargame set in the Warhammer 40,000 universe. This game in both its editions was the flagship of Games Workshop Ltd.'s Epic scale (6 mm) miniatures games until they were replaced by Warhammer Epic 40,000 which worked at the same scales but had all new mechanics. Both first and second editions were sold as box sets which contained rules, scenery and enough miniatures for two armies.&#10;  &#10;First edition subtitled Epic Battles in the Age of Heresy was set in a much earlier time period than Warhammer 40,000. It featured Space Marines versus Space Marines in a civil war. The game could be combined with the previous published Adeptus Titanicus which featured Titans, giant robots, in the same 6 mm scale. Ork and Eldar models were also released, with rules for them in the Codex Titanicus expansion.&#10;&#10;Second edition was subtitled Epic Conflict in the War Torn Universe of the 41st Millenium and brought the setting into the standard era of Warhammer 40,000. It was radically revised but still fundamentally the same system, unlike the latter version of the Epic range. The new edition included Orks, Eldar and Titans in the base rules. These and other new races were greatly expanded in latter supplements.&#10;&#10;First Edition expansions and compatible games:&#10;&#10;    Adeptus Titanicus (1988) - also a stand alone game.&#10;    Codex Titanicus&#10;&#10;&#10;&#10;&#10;Second Edition expansions and compatible games:&#10;&#10;    Armies of the Imperium: Space Marines and Imperial Guard (1991)&#10;    Renegades: Eldar and Chaos Armies for Space Marine (1992)&#10;    Ork and Squat Warlords (1992)&#10;    Space Marine Battles (1993)&#10;    Titan Legions (1994) - also a stand alone game.&#10;    Hive War:Tyranids (1995)&#10;&#10;&#10;&#10;&#10;Later Editions of the Epic system:&#10;&#10;    Warhammer Epic 40,000 - 3rd Edition  (1998)&#10;    Epic Armageddon - 4th Edition (2004)&#10;    NetEpic - unofficial continuation of 2nd Edition (1997)&#10;    Heresy - unofficial rules in same scale and setting, designed to be a grittier wargame.&#10;&#10;&#10;&#10;&#10;",
        "artist": "Dave Andrews,Paul Bonner,Jim Burns,Gary Chalk,Mark Craven,Wayne England,Jes Goodwin,Gary Harrod,Tony Hough,Colin Howard,Martin McKenna,Bob Naismith,Russ Nicholson,Bill Sedgwick,Adrian Smith,Stephen Tappin,Kevin Walker,Richard Wright"
    },
    {
        "name": "Harry Potter and the Sorcerer's Stone Quidditch Card Game",
        "description": "Catch the Golden Snitch, Score and Match.  The Card game tries to recreate the Quidditch matches that appeared in the Harry potter series.  The game contains three decks, the blue Pitch Deck, the red Gryffindor Team Deck and green Slytherin team Deck.  Through the cards, a ball is pitched into play.  To win a ball, the players must play a card with a higher number on it.  There are also some special card that change the game play a little.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Cobra",
        "description": "From the introduction:&#10;&#10;Cobra - Game of the Normandy Breakout , is a regimental/divisional scale simulation of the allied break-out from the Normandy peninsula in the summer of 1944, which culminated in the encirclement of some 160,000 German troops in the &quot;Falaise Pocket.&quot; Each game-turn is equivalent to three days of real time, and each hex represents a distance (across) of 3.2 kilometers.&#10;&#10;",
        "artist": "Larry Elmore,Nicolás Eskubi,Ivor M. Janci,Redmond A. Simonsen,Masahiro Yamazaki"
    },
    {
        "name": "Breitenfeld",
        "description": "Breitenfeld is one of the Thirty Years War Quadrigames. This one appeared in Strategy &amp; Tactics magazine #55, March/April 1976.&#10;&#10;From the introduction:&#10;The Thirty Years War game system is an operational simulation of warfare in Europe during the fist half of the seventeenth century. Each game in the system is based on one of the more significant and interesting battles of the period. The playing pieces represent the armies which took part in the battles, and the map represents the terrain over which those armies fought.&#10;&#10;(Ok, so it doesn't give away any secrets...)&#10;&#10;turn: 45 minutes&#10;hex: 175 meters&#10;strength point: 75-100 men&#10;Leaders are represented by separate units.&#10;&#10;The map has starting locations printed on the map for each unit. Terrain includes lane, marsh, road. town, forest, river, and crest.&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "Jerusalem",
        "description": "Jerusalem is the boardgame of the 1948 conflict in which Israel established itself as a nation. The tactical battle has the Jewish forces attempting to keep open or bypass with a new road, the only source of food for the city.&#10;&#10;In Jerusalem, the players do not merely move, but conduct an operation. This creates a unique flow of play which gives a true feel for the disjointed and desperate battle of the Jews to keep open the one road to the Holy City. Included are units for all the invading armies, Arab guerrillas, el Katub (the mad bomber), the Palmach, Haganah, Irgun, and Stern Gangs. The Israeli player even has the option of building the now famous road in this amazingly accurate and exciting simulation of the nearly aborted birth of the Israeli nation&#10;&#10;1st edition published in 1975 by SDC (Simulations Design Corporation).&#10;2nd edition published in 1982 by Mayfair Games.&#10;3rd edition published in 2007 by Cool Stuff Unlimited. This edition includes a new Latrun Road scenario.&#10;&#10;",
        "artist": "Jim Clouse"
    },
    {
        "name": "Dawn Patrol",
        "description": "Dawn Patrol recreates the thrilling dogfights and air battles fought during The Great War.  Each player controls an airplane in a fiery test of his or her skill and nerve.  (32 pages of rules and 32 pages of charts, but none too difficult.)&#10;&#10;There is a role-playing element to the game, as if a pilot survives a mission, the next time a player flies the same aircraft, the player may use that now experienced pilot, who has some advantages over rookie pilots.  These advantages grow if the pilot survives more missions and claims more kills.&#10;&#10;Dawn Patrol is an update of the earlier Fight in the Skies.&#10;&#10;The game has an active club, The Fight in Skies Society, which hosts one or two weekends of play in the Midwest each year and publishes The Aerodrome two to four times each year.&#10;&#10;Fight in the Skies/Dawn Patrol is the only game to have been played at every GenCon and is a featured event at GaryCon.&#10;&#10;Re-Implements:&#10;&#10;    Fight in the Skies&#10;&#10;&#10;&#10;&#10;",
        "artist": "R. Anderson,Darlene,Mike Hagel,Harry Quinn,Stephen Sullivan"
    },
    {
        "name": "Race For Tunis",
        "description": "In November of 1942, the Anglo-Allied 1st Army had landed in French Northwest Africa, deep behind the front lines of the struggle then raging between the AFRIKA KORPS and the British 8th Army. The two combatants clashed in northern Tunisia in a race to take Tunis the main supply port. &#10;These were unusual battles, fought by handfuls of troops. The AXIS won the race but only barely and the Allies let an opportunity to capture all of North Africa slip in a single blow.&#10;&#10;(11 pages of rules + a history of the battle).&#10;&#10;Can be linked with GDW's Bloody Kasserine.&#10;&#10;A standard scenario starts November 17 and ends December 24 in 1942.&#10;&#10;",
        "artist": "LaMont Fullerton,Kirk Wescom"
    },
    {
        "name": "Road to Richmond",
        "description": "Road to Richmond is an extra Blue and Gray Civil War Quad game, first published in Strategy &amp; Tactics magazine #60. Also released in Folio format&#10;&#10;From the introduction:&#10;&#10;Road to Richmond is a simulation of the engagement between Robert E. Lee's Army of Nortern Virginia and George B. McClellan's Army of the Potomc during its change of base to the James River in June and July, 1862. During the union withdrawal, Robert E. Lee proved his strategic genius and generalship in spite of the heavy losses to both sides. Richmond had been threatened by a superior force of Federal troops and now they, not the Confederates, were withdrawing to a defensive position. Soon after the campaign, Lee would move north causing the subsequent Federal withdrawal to Washington.&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "Frag Deadlands",
        "description": "It's Frag, the fast-moving &quot;first-person shooter&quot; boardgame... mutated into the Weird West!&#10;&#10;This is a complete game combining the award-winning Deadlands background with the fast, fun Frag rules. Play as one of six characters, including the magic-using Huckster, the undead Harrowed Gunslinger or a Mad Scientist... frag your foes on the main street of Doomtown and hang them on the gallows!&#10;&#10;Usable as a stand-alone boardgame or a fully compatible expansion to Frag, Frag Deadlands has everything you need for hours of violent fun!&#10;&#10;Integrates with:&#10;&#10;    Frag&#10;&#10;&#10;&#10;&#10;",
        "artist": "Alex Fernandez (I)"
    },
    {
        "name": "Man Bites Dog",
        "description": "It's the hilarious headline card game! This game is a little different: you're dealt a hand of cards with words on them, each with a point value. When it's your turn, construct the headline that earns the highest points... and often the biggest laughs! The first player to get to 500 points wins. If more than one player earns 500 points when the hand's points are totaled, the highest score wins.&#10;&#10;Each round, players are dealt 5 cards. They may discard and replace up to 3 three of them, and then each one makes a sensible headline with the cards in their hand. The value of the headline is doubled for anyone using an &quot;Exclusive&quot; card. The first player to reach 500 points is declared the winner.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Anzio Beachhead",
        "description": "Anzio Beachhead is an operational level simulation game of the allied invasion of the Italian mainland near Rome during WWII. The invasion began January 22, 1944, under the code name Operation Shingle. It had the Alban Hills and the isolation of the German army as its objective. Failing in this, Allied troops would have to hold until relieved. Here Hitler recognized Germany's great chance to destroy an Allied invasion. Had his troops succeeded in destroying the beachhead, the war in Europe could well have been lengthened.&#10;&#10;Anzio Beachhead is a two-player game in which one player controls the German forces while his opponent controls the Allied forces.&#10;&#10;Game Scale:&#10;Turn: 24 Hours&#10;Hex: .9 mile / 1.34 km&#10;Unit: Company/Battalion/Regiment/Brigade&#10;&#10;Game Inventory:&#10;One 17&quot; x 22&quot; Map&#10;One counter sheet (100 1/2&quot; counters)&#10;One 8 page rule booklet&#10;&#10;This first appeared in Strategy &amp; Tactics magazine #20 in December 1969, along with Bastogne. SPI later released it in white box and black formats during the 1970s. In 1990 it reappeared, with minor revision, in S&amp;T #134 (May/June 1990).&#10;&#10;Per Jim Dunnigan:&#10;&#10;&quot;AB was seen as another situation like the Bulge, where the attacker had a rapidly declining edge. The original American commander was not bold, and lost. So the idea with AB was to explore the what if's. At that time, I had been working on designing games for about eight years (since I first discovered the AH games.) Before that, I was always interested in the details of history, and how they were connected. AH wargames were the first time I saw someone else thinking the same way, and doing it in a novel way.  I was always building on that.&quot;&#10;&#10;&quot;I had been designing a similar game, called Italy, which incorporated the rest of the Italian theater, with a smaller scale map of the Anzio area (ie, two interrelated games, one strategic and the other operational). But when Dave's game came in I thought it did a better job of the Anzio section. We had come up with some of the same solutions, and his game  was more compact and suitable for the magazine.&quot;&#10;&#10;(e-mails with Neopeius, 9/5-6/11)&#10;&#10;",
        "artist": "Ted Koller"
    },
    {
        "name": "Raid!",
        "description": "Raid!: Commando Operations in the 20th Century, is a tactical-level simulation of commando tactics and operations from World War II to the near future.&#10;&#10;First appeared in Strategy &amp; Tactics magazine #64 (September/October 1977).&#10;&#10;From the introduction:&#10;&#10;Raid!   The game is played by scenario. There are several historical scenarios as well as provisions for the players to make up their own.&#10;&#10;The map is a 3-color map. Units are two- or four-man fire teams, with individual tanks, truck, command centers, helicopters, etc. depicted.  There are extensive and rational command control rules.&#10;&#10;Game Scale:&#10;Game Turn: 2 minutes&#10;Hex: 27 yards / 25 meters&#10;Units: 2 to 4 soldiers&#10;&#10;Game Inventory:&#10;One 22 x 34&quot; six color maps&#10;One dual-side printed countersheet (200 1/2&quot; counters)&#10;One 12-page Raid! rulebook&#10;One 6-sided dice (not included in magazine version)&#10;&#10;Solitaire Playability: Medium&#10;Complexity Level: Medium&#10;Players: 2 or more&#10;Playing Time: .5-4 hours&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "Tri-Ominos",
        "description": "Triominos is a game to Dominoes, in that players are laying tiles that match up to other tiles in the play area, with the goal to get points and be rid of tiles. In Triominoes, the pieces are triangles with numbers that mat are matched on each side. Each triangle has 3 numbers at the points, so to place a piece next to it, it must match two numbers on the side.&#10;&#10;Pressman also released Quad-Ominos.&#10;&#10;Goliath released a 6 player version with 20 additional unique stones as Triominos Gold.&#10;&#10;",
        "artist": "Bernd Dümler,Heidemarie Rüttinger"
    },
    {
        "name": "Across 5 Aprils",
        "description": "A game covering five battle of the ACW: Bull Run, Pea Ridge, Shiloh, Gettysburg, and Bentonville.&#10;&#10;Each battle is a separate game unto itself, with its own set of counters and map, however the basic system applies to all the battles. Players pull a chit to activate certain formations which can then move. If the &quot;Combat&quot; chit is pulled, then all combats are resolved. Formations and Unit size varies from game to game, ranging from division to corp for formations and regiment to brigade for units.&#10;&#10;",
        "artist": "Charles Kibler,Don Troiani"
    },
    {
        "name": "War of the States: Gettysburg, 1863",
        "description": "On a quiet Pennsylvania summer morning, Confederate General Robert E. Lee gambled his new nation's hopes on a climactic battle at a crossroads town no one really wanted to capture. His troops stood at their peak: battle-tested, used to victory, and eager to end the war. Opposing him, Union General George Meade knew that he could save American unity with a victory. After two years of war, Meade understood that simply avoiding defeat would not satisfy the American people.&#10;&#10;The Origins Award winning designers of Rome At War, and Eagles Of The Empire bring you the ultimate struggle &amp; sacrifice to preserve a nation.&#10;&#10;Renowned wargame designer Dave Powell makes his Avalanche Press debut with this exciting game of the battle that decided America's destiny. A smooth-playing game with large, beautiful counters and a stunning map in the tradition of our popular Rome At War series. No combat charts, no markers - just an evening's gaming fun!&#10;&#10;",
        "artist": "Peggy Gordon,Brien J. Miller,Keith Rocco"
    },
    {
        "name": "Hammer's Slammers",
        "description": "A board game based on the classic novel by Dave Drake.  &quot;The Hovertank is amazingly silent for its fusion powered bulk.  Even the hiss of the main laser turret would seem quiet to an ancient tank commander.&quot;  Artillery, tanks, infantry, shells from the sky, etc.  &quot;Soon the enemy will know that Colonel Alois Hammer's Slammers have landed.&quot;&#10;&#10;The map represents various battlefield and terrain the mercenaries fought over the latter half of the 3rd Millennium.  It has the usual roads, forest, slopes, clear, lake, city, swamp, hill, river, bridge, fortress and rubble terrain.  Hammer's Slammers is a basic hex-based wargame in the Panzerblitz tradition with CRT's, terrain modifiers, and fairly easy rules (7 pages of actual rules).&#10;&#10;",
        "artist": "Paul Alexander,Jim Clouse,H. N. Voss"
    },
    {
        "name": "Fortress Europa",
        "description": "Fortress Europa recreates the Allied campaign in Western Europe from D-Day to March 1945. The Allied player must select an invasion site and make a successful landing, breakout of the beachhead, drive across France and push deep into Germany. The German player must prevent the Allied Invasion or else conduct and orderly withdrawal across France, constantly delaying the Allies, and then counter attacking in the winter.&#10;&#10;Fortress Europa is the successor to Avalon Hill&rsquo;s highly acclaimed Russian Campaign...The basic game is 37 turns long, but several scenarios are provided for those wishing a shorter game. In addition, Sudden Death Victory Conditions are included which shorten the basic game ...&#10;&#10;Fortress Europa  comes in an 8.5&rdquo; x 11.5&rdquo; x 2&rdquo; game box with three part mounted 22&rdquo; x 24&rdquo; map board; 520 double-sided die cut cardboard counters; a 16-page rule booklet with rules for play, optional rules and scenarios; several cardstock player aids including German &amp; Allied Order of Battle charts, Aircraft Mission and Replacement Chart and a Time Record Chart; and one six sided die.&#10;&#10;Avalon Hill also published a Play By Mail (PBM) kit for Fortress Europa including two-page, pink instructions and double sided pages for the German and Allied Order of Battle Charts used for tracking play.&#10;&#10;",
        "artist": "John Edwards,Charles Kibler,Rodger B. MacGowan,Alan R. Moon,Dale Sheaffer"
    },
    {
        "name": "Star Wars: Trading Card Game",
        "description": "The fate of the galaxy is in your hands.&#10;&#10;An epic struggle between good and evil continues, and now you must take a side - the light side or the dark side. The Star Wars trading card game lets you and a friend engage in full-scale battles. You can choose to embrace the power of the Sith Lords or to align yourself with the Jedi Knights and use the Force for a higher purpose.&#10;&#10;Star Wars: Trading Card Game is not all that different from Magic:TG. Like many TCGs, Star Wars comes in two player starter packs, individual deck starters, and the obvious booster packs. Cards include characters, ships, devices, and all of the original, first edition decks deal with Star Wars Episode II: Attack Of The Clones.&#10;&#10;To play your first real game you will need to collect (or print out) two decks of 60 cards, a set of six sided dices, a set of damage counters, two force meters and a playmat with 3 battle zones(space, ground and character areas).&#10;&#10;",
        "artist": "Rick Achberger,Sean Glenn"
    },
    {
        "name": "Chaos Progenitus",
        "description": "Chaos Progenitus is a trading dice game for 2 or more players where you create a fiend, represented by 13 dice which fall into two categories: items and body parts. The fiends battle until one is defeated. Different combinations of dice and ink color represent different breeds of fiends, and each fiend must contain at least one body part. The object of the game is to be the last player that is able to roll at least one body part die at the beginning of his or her turn -- if you fail to do so, you lose the game.&#10;&#10;The basic turn consists of the following actions: applying &quot;minuses&quot; that your foe rolled in the previous turn, rolling your dice that are still in play, setting aside &quot;minuses&quot; to apply against your foes next turn, select your defenses against your foes attacks, array your own attacks against your opponent, recovering from stuns and wounds, and finally, suffering stuns and wounds from your opponents attacks.&#10;&#10;The advanced game adds breed abilities, &quot;counting coup&quot; (winning player selects a wounded die to keep as a trophy), and multi-player rules.&#10;&#10;Chaos Progenitus is expanded by Plague Beasts.&#10;Every Plague Beasts Booster Pack contains eight more six-sided dice to build your fiends. Six are randomly selected from the three new breed colors, and the other two from the five breeds already presented in the Starter Set.&#10;&#10;Each booster has 3 Fester fiend dice, 2 Rot fiend dice, 1 Stench fiend die, and 2 random dice from the starter races.&#10;&#10;",
        "artist": "William W. Connors,James Holloway,Lester Smith"
    },
    {
        "name": "Undead",
        "description": "This is an attempt to recreate the legendary battles of Van Helsing and the vampire hunters against Dracula, in Victorian London. The game is based on the books, not on the movies, so many things are different to what Vampire-fans are used to (Dracula CAN move during the day for example, although it tires him). The game takes two forms: a two player game and a simplified roleplaying game.  A game master is helpful, but optional.&#10;&#10;",
        "artist": "Denis Loubet"
    },
    {
        "name": "Swap!",
        "description": "A relative of Uno.  Players try to get rid of their cards by playing matching colors; special cards change the color or require players to swap hands or slap the discard pile.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Rats!",
        "description": "Kid's game of pure luck.  Cards are dealt face down to all players.  Turn up cards in rotation and put them in the center; if you turn up a Big Fat Rat (rather than a Random Rat), you get all the cards in the center, unless the next player can also turn up a BFR.  Object is to collect all the cards.&#10;&#10;This is one of the Big Deal series of games by Patch Products.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Management Material (General Office Edition)",
        "description": "Management Material is a card game with a corporate theme where the players try to win by avoiding being promoted to management. This is done by playing Excuse cards to avoid the Project cards and passing the Project to the next player. Other players may also play Recognition cards on you, which make it more difficult to get out of the project with an Excuse. Ultimately, some player will end up completing the Project, and that player adds the card to their completed projects, pushing them closer to the 30 points necessary to be identified as Management Material and losing the game. The last player that avoids being promoted to management wins the game. Event cards provide an additional randomizing element.&#10;&#10;Stand-alone expansion: Management Material: Information Technology Edition&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Who Wants to Be a Millionaire",
        "description": "Players answer multiple-choice trivia questions of increasing difficulty, with the option of quitting with their winnings up to that point. This adaptation has makeshift versions of the TV show's &quot;Ask the Audience&quot; and &quot;Phone a Friend&quot; lifelines. Players rotate as host, and after everyone has taken a turn as host, winnings are totaled.&#10;&#10;Based on the original ABC version of the world-famous game show, hosted by Regis Philbin from 1999-2002.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "What's My Word?",
        "description": "From the game box&#10;My Word! is a fascinating battle of wits for two people&#10;&#10;How My Word! is played&#10;You attempt to discover your opponent's Gamewords by using Guesswords with letters that not only appear in the Gameword, but that also fall in matching position. By the last turn of each round, if you are clever enough, you will be able to correctly name your opponent's Gameword and score a special bonus. You are the winner in My Word! if you have the higher score at the end of two rounds of play.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Can't Stop the Turtles",
        "description": "A variant version of Sackson's Can't Stop. It uses cards, chips, and a scoresheet instead of a board and markers to keep score.&#10;&#10;It comes in a small hard plastic case, similar to Pass the Pigs.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Alamo",
        "description": "&quot;183 grim-faced Texans volunteer for certain death to delay and decimate a besieging force of 2,000 highly trained Mexican regular infantry under the command of the ferocious Santa Anna.&quot; A fun fast paced game. What could be better, Travis, Crockett, Bowie and their fellow Texans vs. a horde of Mexicans. As the Texans you know you are going to be wiped out, the question is how many Mexicans can you take with you?&#10;&#10;",
        "artist": "Robert Jenkins Onderdonk,Redmond A. Simonsen"
    },
    {
        "name": "Leningrad",
        "description": "Leningrad: The Advance of Army Group North, Summer 1941, re-creates one of the most crucial campaigns of the Second World War - the drive by German forces to capture the Baltic seaport of Leningrad and trap the Soviet fleet.&#10;&#10;An easy-to-learn rules format allows players to get right into the action: based on the award-winning Panzergruppe Guderian game system.&#10;&#10;Game Scale:&#10;Game Turn: 1 week&#10;Hex: 20 miles / 32 kilometers&#10;Units: Divisions&#10;&#10;Game Inventory:&#10;One 11 x 17&quot; four color mapsheet&#10;One dual-side printed countersheet (100 1/2&quot; counters)&#10;One 8-page Leningrad rulebook&#10;One 6-sided die&#10;&#10;Solitaire Playability: High&#10;Complexity Level: Low&#10;Players: 2 or more&#10;Playing Time: 2-15&#10;&#10;",
        "artist": "Chris Dickson,Larousse,Rodger B. MacGowan,Lise Patterson,Redmond A. Simonsen,Alan Wykes"
    },
    {
        "name": "Napoleon at Bay: The Campaign in France",
        "description": "Napoleon at Bay is a division level, two-player simulation of the Campaign of 1814 which was one of Napoleon's finest. he conducted this campaign with subtlety and lightning speed against heavy odds, attacking isolated enemy forces on advantageous terms. This game shows Napoleon's skill in a classic use of interior lines, shifting to engage the combined armies of Russia, Prussia and Austria.&#10;&#10;GAME SYSTEM: CAMPAIGNS System - Series 1X = 3,200m/hex, 1,000 men/SP, 2 days/turn.&#10;1983 Edition: 260 counters (includes 18 blanks)&#10;&#10;",
        "artist": "Theodore Gericault,Kevin Zucker"
    },
    {
        "name": "1812",
        "description": "Two versions are included, using separate maps covering most of Russia. The strategic game is area driven, while the tactical version covers the game scope but using hex mechanics.&#10;&#10;There is an earlier version of the box that is NOT plastic, it is a completely cardboard box. Many of the early SPI games came in these cardboard boxes until someone bright decided that the plastic ones would be cheaper and more easily manipulated for advertising.&#10;&#10;400 Counters&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "2nd Fleet",
        "description": "2nd Fleet is a refinement of Victory Games (I) popular Sixth Fleet game system, and examines the strengths and weaknesses of the Soviet Red Banner Northern Fleet and the US Second Fleet and its NATO allies in future conflict for control of the North Atlantic and Arctic Oceans. Players are placed in command of the opposing superpower fleets. The mighty aircraft carriers and escorting capital ships must be protected from the devastating firepower of modern missiles, torpedoes, and bomb attacks. Attack submarines threaten the enemy task forces and replenishment convoys while searching out their submerged rivals. Limited air assets must be carefully assigned to combat air patrols, long-range strategic missions and attack strikes. 2nd Fleet, with its multitude of options and strategies, is one of today's most realistic recreations of modern naval warfare on the high seas.&#10;&#10;Each 8 hour game turn is broken into 3 distinct phases (sub, surface, and air) and each player takes turns choosing which phase they wish to conduct. Ex. if the US player chooses &quot;Air&quot;, they conduct all bombing, shipping strikes, anti-sub, and interception actions for all their aircraft.&#10;Players also use their units to attempt to &quot;detect&quot; enemy forces so that an attack can be made. Ships and aircraft are always detected once a unit moves close enough to them, but players have to roll to try to detect subs.&#10;Optional rules include nuclear weapons and logistics.&#10;About 10 scenarios are included which range from about 60 minutes (for Introductory Scenarios) to 3 to 6 hours (for Intermediate Scenarios) to 20 or more hours (for the Advanced Scenario).&#10;&#10;Part of Victory Games Fleet Series.&#10;&#10;",
        "artist": "Ted Koller,James Talbot"
    },
    {
        "name": "Adeptus Titanicus",
        "description": "Adeptus Titanicus was the first game introducing the Epic system. You control a number of Imperial Battle Titans, while your opponent controls some Chaos Titans. You reenact battles from the Horus Heresy. The Titans are modular in design and so you could adapt the armaments of the Titans to suite the battle you will be fighting.&#10;&#10;This was added to with Space Marine, which added infantry to the system. Articles also appeared in White Dwarf which allowed you to use the war machines of other races. The final expansion for this, the first edition of Epic, Codex Titanicus finalized the rules first introduced in Adeptus Titanicus &amp; Space Marine Ed 1.&#10;&#10;",
        "artist": "Tony Ackland,John Blanche,Paul Bonner,David Gallagher,Jes Goodwin,Gary Harrod,Tony Hough,Ian Miller,Aly Morrison,Russ Nicholson,Tim Pollard,Wil Rees,Tony Roberts,Stephen Tappin,Kevin Walker,Richard Wright"
    },
    {
        "name": "wordXchange",
        "description": "Stealing is legal in wordXchange, the all-new anagram game that pits you against your rivals and against the clock in an all-out battle to make and keep words.  The winner is the first to make and line up six words.  The catch?  No word is safe!  You can steal words made by your opponents, add one or more letters and reshuffle them into one of your own.  As the words multiply, the possibilities are endless.  Plus, wordXchange &quot;ain't over 'till it's over,&quot; as any player can come from behind by stealing his opponents' words.  And the game is lightning fast.  You can play an entire round in less than thirty minutes.  wordXchange takes strategy and quick thinking.  wordXchange is simply...a battle to the last word!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Star Munchkin",
        "description": "The Munchkins are back &ndash; but now they're Mutants, Androids, and Cat People in space, grabbing Lasers, Vibroswords, and Nova Grenades and fighting Fanged Fuzzballs, Bionic Bimbos, and the Brain In A Jar. Star Munchkin is a complete game using the best-selling Munchkin rules (with a few new twists like Sidekicks), and it can be combined with any other Munchkin items.&#10;&#10;Part of the Munchkin series.&#10;&#10;Munchkin is a satirical card game based on the clich&eacute;s and oddities of Dungeons and Dragons and other role-playing games. Each player starts at level 1 and the winner is the first player to reach level 10. Players can acquire familiar D&amp;D style character classes during the game which determine to some extent the cards they can play.&#10;&#10;There are two types of cards - treasure and encounters. Each turn the current players 'kicks down the door' - drawing an encounter card from the deck. Usually this will involve battling a monster. Monsters have their own levels and players must try and overcome it using the levels, weapons and powers they have acquired during the game or run away. Other players can chose to help the player or hinder by adding extra monsters to the encounter. Defeating a monster will usually result in drawing treasure cards and acquiring levels. Being defeated by a monster results in &quot;bad stuff&quot; which usually involves losing levels and treasure.&#10;&#10;Note: The 2012 edition of Star Munchkin from Pegasus Spiele includes the first expansion, Star Munchkin 2: The Clown Wars.&#10;&#10;",
        "artist": "Wayne Barrett,John Kovalic,Len Peralta,Philip Reed,Gabby Ruenes"
    },
    {
        "name": "Nodwick: The Card Game",
        "description": "A fast-playing and chaotic trading game descended from Pit.&#10;&#10;This year's Hench Games has been interrupted, and all of the Henchmen are somewhat mutil...disassemb...sick. You need to use Piffany's powers of healing to put a henchman back together. With mostly the same parts he started out with.&#10;&#10;To do this, you will need to collect healing ingredients and trade with other players for body parts and healing items. In real time.&#10;&#10;This game was prototyped under the title Evil Geniuses, which received an honorable mention in the 1999 Hippodice Spieleautorenwettbewerb.&#10;&#10;Online Play&#10;&#10;&#10;     CCG Workshop (no longer available)&#10;&#10;&#10;",
        "artist": "Aaron Williams"
    },
    {
        "name": "Age of Steam",
        "description": "Steam-belching iron horses roar across the wild plains! Age of Steam relives the era when pioneering U.S. railroads built the tracks that transformed America's economy. The cut-throat action is centered on the industrial powerhouses of the growing nation: Pittsburgh, Cincinnati, Chicago, and beyond.&#10;&#10;Challenges that await you:&#10;&#10;&#10;     Can you finance both the most extensive track network and the most powerful locomotives?&#10;     Which routes will give the best returns on their costs?&#10;     Can you beat the opposition to the most lucrative shipments?&#10;     Will you make enough money to pay your aggressive creditors?&#10;&#10;&#10;Competition is brutal, with the game usually going to the player who plans most carefully.&#10;&#10;Each self-contained phase in the game keeps players constantly involved in making vital decisions and interacting with other players. Age of Steam also allows towns to be developed into cities, ensuring that no two games are exactly the same.&#10;&#10;",
        "artist": "Sean Brown,Peter Dennis,Paul Niemeyer"
    },
    {
        "name": "Keythedral",
        "description": "A Keythedral is being built in the fields near Keytown, in the middle of the Keydom. The inhabitants of Keyland will gather the resources with which to build the Keythedral from the surrounding fields.&#10;&#10;The Keythedral will be built in five stages, and each stage will require different building materials. In the early stages, simple materials will be needed, and as the building nears completion, more specialized materials will be needed. Throughout the development period, the builders will require food and water, and, if they are lucky, the builders will also receive some wine.&#10;&#10;In the game, each player starts with five cottages. Each cottage houses a worker. Each turn, every worker will try to move into one of the fields adjacent to their cottage in order to gather resources from the land. These resources are required for building the Keythedral.&#10;&#10;Problems, however, are at hand. Firstly, no one is ever quite sure what the building requirements for the next stage of the Keythedral will be until the previous stage is completed. Secondly, once more workers arrive, the fields will become crowded, and some of the workers will be idle. Players may choose to fence off some of the fields in order to keep out their opponents' workers. However, the workers are quite partial to the odd tipple, and for a couple of barrels of wine, they can be persuaded to remove any one of the fences that a player has taken offense to!&#10;&#10;Good luck in your endeavors to keep your workers productive and to get the right building materials at the right time.&#10;&#10;Keythedral is Richard Breese's fourth game in the key series.&#10;&#10;",
        "artist": "Juliet Breese"
    },
    {
        "name": "Europa Universalis",
        "description": "In this monster game of diplomacy, territorial expansion, trade, military technology, economic development, and war you play the part of kings as you relive 300 years of world history (1492-1792). The grand campaign game can keep 6 players occupied for a long, long time, but one of the beauties of this game is that you can play a shorter campaign game or a mini campaign that requires fewer player and less space and time and you can even re-fight one of 20 battle scenarios, or play a solitaire scenario.&#10;&#10;The game includes:&#10;&#10;    2 color maps (Europe &amp; Rest of the World), 80cm x 60cm each&#10;    1412 counters (armies, fleets, leaders, detachments, colonies, trading posts, etc) - Countersheets #1 to #6&#10;    1 rulebook (72 pages)&#10;    1 scenarios book (52 pages)&#10;    1 annexes book (48 pages)&#10;    6 player's aids &amp; record sheets&#10;    2 ten-sided dice&#10;&#10;&#10;&#10;&#10;&#10;43 scenarios&#10;&#10;Solitaire scenarios:&#10;&#10;    Cortes &amp; Magellan - 1520-1614&#10;    Da Gama &amp; Albuquerque - 1495-1559&#10;    Coen &amp; Heyn - 1590-1664&#10;    Yermak - 1560-1664&#10;    Washington - 1775-1784&#10;&#10;&#10;&#10;&#10;Battle scenarios:&#10;&#10;    The Battle of the Boyne - 1690&#10;    The Battle of Lepanto - 1571&#10;    The Battle of Mohacs - 1526&#10;    The French &amp; Spanish Campaigns in Italy - 1525&#10;    The Campaign of Zenta - 1697&#10;    Turenne's Franche-Comte &amp; Alsace Campaigns - 1674&#10;    The Turkish Siege of Vienna - 1683&#10;    The Struggle for Azow - 1689&#10;    The Anglo-Dutch War - 1666-1667&#10;    The English Civil War - 1642-1653&#10;    The War of the Spanish Succession - 1702-1713&#10;    The Thirty Years War - 1618-1648&#10;    The Seven Years War - 1756-1763&#10;    The War of the League of Augsburg - 1688-1697&#10;    The War of the Austrian Succession - 1744-1748&#10;    The Great Northern War - 1700-1721&#10;    The Wars of Religion in France - 1562-1598&#10;    The Russo-Turkish War - 1770-1792&#10;    The Veneto-Turkish War - 1640-1667&#10;    The Campaigns of the Sun King - 1687-1699&#10;&#10;&#10;&#10;&#10;Campaign scenarios:&#10;&#10;    1492-1519&#10;    1520-1559&#10;    1560-1614&#10;    1615-1664&#10;    1665-1699&#10;    1700-1759&#10;    1740-1792&#10;&#10;&#10;&#10;&#10;Grand Campaign 1492-1792&#10;&#10;",
        "artist": "Bruno de Scorraille"
    },
    {
        "name": "The Wheel of Time Collectible Card Game",
        "description": "The Wheel of Time CCG is based on the novels of the same name, penned by Robert Jordan, and later, Brandon Sanderson. One player takes the side of the light and the Dragon Reborn, while another takes the side of the shadow and the Forsaken, in a struggle for control of the Pattern, the ultimate fabric and destiny of the universe.&#10;&#10;Each player requires his or her own Hero or Villain deck to play. Each deck features a major character from the Wheel of Time book series. The light side player chooses a hero to play with while the shadow player uses a villain deck. Characters in the side of light include series protagonists Rand al'Thor, Matrim Cauthon, Perrin Aybara, and the other characters of good found within the books. Characters for the shadow include dark friends, as well as Rahvin and the other chosen.&#10;&#10;The players attempt to sway the Pattern to their side and amass the might needed to defeat his or her opponent in the final Pattern challenge and win the game. Along the way players will engage in politics, marshaling of armies, magic, and intrigue in an effort to bring characters, troops, and entire kingdoms onto their side.&#10;&#10;The core of the Wheel of Time CCG involves rolling dice. Characters and troops, each have different stats corresponding to their skill in politics, intrigue, combat and the one power. These stats translate into dice rolls, used to win challenges and to generate resources.&#10;&#10;Every turn, players commit their characters and troops into challenges. Challenges are done via playing challenge cards or initiating the pattern challenge, which is the ultimate objective for both the light and shadow. Unassigned characters and troops can be used to generate resources which in turn, can summon more allies or to attach buffs called advantages.&#10;&#10;Players then contest challenges by comparing dice rolls of their committed characters and troops. The attacking player attempts to roll swords in the in-game custom dice, while the defending player attempts to roll shields. Winning challenge cards grant advantages based on card text, while winning the Pattern challenge may place Pattern tokens toward the side of the victorious player.&#10;&#10;End game triggers upon both players having a total of twenty Pattern tokens, together with any neutral tokens generated during play. The game then proceeds to the final challenge, where the players fight for dominance, again rolling the dice generated by their characters and troops, but this time, adding their Pattern tokens toward their success rolls.&#10;&#10;",
        "artist": "Ran Ackels,David Hewitt,James Holloway,Mike Hummel,Stephanie Pui-Mun Law,John Myler"
    },
    {
        "name": "Moderne Zeiten",
        "description": "Modern Times takes place in the USA during the Roaring Twenties. Business is booming and industrial magnates are in a worldwide arms race. It is the era of industrialism and great speculative deals in the stock market.&#10;&#10;As successful businessmen and -women, will the players invest in the expanding branches? The objective is to gain worldwide majority of stocks in the industries: Shipping, Aviation, Construction, Automobile manufacturing and Telecommunication. But caution is advisable! Irresponsible pursuit of profit may quickly lead to devastating results when the stock market collapses.&#10;&#10;Reimplemented by:&#10;&#10;    Batavia&#10;&#10;&#10;&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Hang in There!",
        "description": "The board consists of motorized trees with rotating tops. By using your levers, you can raise and lower the treetops, catching your animals and moving them across the jungle and onto the beach.&#10;&#10;However, you and your opponents can also use the treetops to knock animals off, sending them back to the start.&#10;&#10;The first player to get five animals to the beach wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "X-Men Trading Card Game",
        "description": "In the ever-evolving and chaotic world of the X-Men Trading Card Game, one thing is certain: You control the action. By opening this box, you unleash the might of the X-Men and the mayhem of their enemies. Featuring characters based on the feature film, the X-Men trading card game takes you right into the action, where the stakes are high and the battles incredible. Are you ready?&#10;&#10;Games are won by eliminating two of the four shared villains in the center of the table, or by having the last remaining team of heroes left.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Tigers in the Mist",
        "description": "Tigers in the Mist, Ardennes Offensive, The Battle of the Bulge, December 16 - 22, 1944, this game simulates the early stages of the German offensive in the Ardennes section of Western Europe (Germany, France, Belgium, and Luxembourg) in December of 1944. Historically, the Germans planned to break through the thin American defenses in this area, cross the Meuse River, and seize the port of Antwerp in Holland. The German high command hoped that success would force a political settlement on the Western Front, thus allowing Germany to direct its full attention to defeating the Russians. In order to win the game, the German player will almost certainly have to get some units across the Meuse River&#10;&#10;The Ardennes, a thickly wooded area on the borders of Germany, Belgium, and Luxembourg, where battle weary U.S. divisions were sent to rest and replace losses, or units freshly arrived from the United States were given their first taste of front line duty. At 5:30am, December 16, 1944, this 85-mile-long sector erupted into what would be the largest, most costly campaign on the Western Front in WWII. The Battle of the Bulge had begun.&#10;&#10;During the first week of the battle, three German armies attacked vigorously and relentlessly in an attempt to reach the Meuse River, the major geographical obstacle between them and the great port of Antwerp on the northern coast of Belgium. Stubborn resistance by outnumbered American forces in the difficult terrain of the Ardennes canceled out much of the initial material advantages and surprise the Germans enjoyed. On December 22, Patton's Third Army began attacking the German southern flank north of Arlon, and on the 23rd, the weather finally cleared, allowing Allied air supremacy to be re-asserted over the battlefield.&#10;&#10;As the German player, can you break through the American player's front lines and get sufficient forces across the Meuse River before the Allies can bring enough reinforcements to the threatened sector to stop the Ardennes Offensive? Play Tigers in the Mist and discover what might have been.&#10;&#10;From the GMT website:&#10;An impulse based movement and combat system which forces both sides to hoard reserves to respond to both opportunity and disaster on the battlefield.&#10;&#10;Four scenarios playable in one-to-five hours, including an introductory scenario, two tournament scenarios of three hour duration, and a campaign scenario which covers the first week of the battle.&#10;&#10;Rules, charts, and examples are organized for ease of use. The game system is logical and clean, making it very easy to quickly learn the mechanics of play.&#10;&#10;An unpredictable combat system which results in heavy attrition for both sides and reflects the erosion of combat power that sustained battle has on units engaged in heavy fighting day after day.&#10;&#10;Truly meaningful chrome including combined arms effects, German special forces, supply, bridge demolition and repair, entrenchments, first day surprise restrictions, and reserve division release conditions.&#10;&#10;Areas are irregularly-shaped spaces on the map. Each area represents a city, town, or crossroads. Each area is named and identified by a unique number. The area numbering system may be used to facilitate PBM or PBEM play as well as to aid in locating a particular area. The system is set up such that a numbered area is always adjacent to consecutive areas in the numbering sequence, ie. 75 is adjacent to 74 and 76. Areas are connected by roads. Brown lines are minor roads. Gray lines are major roads. Units move from area to area along roads. Units may not move to an adjacent area unless it is connected to the area moved from by a road.&#10;&#10;Republished in Command Magazine Japan #62 in 2005.&#10;&#10;Game Scale:&#10;Turn: 1 day (broken into three 8 hour impulses)&#10;Area: 1&quot; = 4 miles &#10;Units: Battalion to Brigade&#10;&#10;Game Inventory:&#10;One 22&quot; X 34&quot; mapsheet&#10;Two countersheets (352 5/8&quot; counters)&#10;One 16 page rules booklet&#10;Five Scenario Cards&#10;One Player Aid Card&#10;Four 10 sided sided die&#10;&#10;",
        "artist": "Rodger B. MacGowan,Mark Simonitch,Sawshun Yamaguchi"
    },
    {
        "name": "Slide 5",
        "description": "You and your opponent alternately slip chips into the slotted gameboard. Whoever is the first person to get 5 of their color in a diagonal, vertical or horizontal row wins the game. But be careful, Slide 5 can be your downfall, for the gameboard is very changeable... if a row is filled with 5 chips (not all of the same color), a player may insert another chip into that row causing the others to slide down into new positions and to force out the bottom chip. So look every which way before you Slide 5!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Challenge Yahtzee",
        "description": "A fast paced poker dice Yahtzee variant. All players build their point scores from common rolls of the dice, but use their own judgment for possible combinations and scoring. It's a natural for game players who love to win by out-thinking their opponents.&#10;&#10;Includes 25 dice (5 red; 20 white), dice cup, scorepad, game tray, and instructions.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "King's Court",
        "description": "The family card game with a ROYAL TWIST!&#10;&#10;This game plays similarly to UNO, but with more complex &quot;wild&quot; cards.  For example, the Wizard allows you to choose the color, skip or change the direction, have the next player (after the skip or direction change) draw 5 cards, and also play an extra card!  The Magic Potion  dissolves all your &quot;scroll card&quot; points when someone else goes out (scroll cards are cards with special abilities who's values range from 20 to 50).  The Royal Decree reverses any draw card back onto the one who played it.  The Magician can become any scroll card in the deck.  Etc.&#10;&#10;King's Court is currently out of print.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Road to the Rhine",
        "description": "This is a simulation of the post-Normandy campaigns from September 1st, 1944 to April 1945 on the West front. The game covers the initial attempts by the Allies to maintain the pace of their advance in the face of a rapidly deteriorating logistical situation, the German recovery culminating in the Battle of the Bulge, and the final Allied drive across the Rhine.&#10;&#10;Scale is &quot;grand operational&quot; with division and brigade/regiment-size ground units and air wings. Hexes are 7 miles across, turns are weekly.&#10;&#10;Combat mechanics are quite standard and typical for a game of this era, but the sequence of play is very flexible and arguably far ahead of its time - multiple impulses within each player turn triggered by supply expenditure, and interspersed with reserve movement and combat phases. There are also rules for airborne assaults, commandos, air support, specialized armor and many more.&#10;&#10;Combat is odds-based with shifts and strength modifiers but no DRMs. Logistics are very important in play, with port capacity driving how many units you can operate at full capacity.&#10;&#10;There are 5 scenarios including the full campaign game.&#10;&#10;480 counters, 2 22x28&quot; maps, 22 pages rulebook, 4 player aid cards.&#10;&#10;Medium complexity, low stacking, some book-keeping, suitable for solitaire play and 3 players.&#10;&#10;",
        "artist": "Rodger B. MacGowan"
    },
    {
        "name": "Electronic Battleship",
        "description": "The same game as &quot;classic&quot; Battleship, but instead of your opponent telling you whether you have hit or missed, you enter the coordinates for your shot into the computer and it either flashes a red light and makes an explosion sound if you hit or a whistling sound if you missed.&#10;&#10;Later versions added a &quot;code book&quot; with 100+ different ship layouts to speed up the initial setup of the game (in the original version you had to program in the coordinates for all of your ships manually).&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Gambler",
        "description": "Players move around the board conducting various games of chance (horse racing, lottery, lucky number, etc.) in order to win money.  The first person to reach a certain money level wins the game.  The centerpiece of the game is a unique dice shaker that randomizes the dice and has them fall into the handle so that players can bet on the order that the dice fall in (where the highest die will be located, for example).&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Punic Wars",
        "description": "The Punic Wars appeared in Strategy &amp; Tactics magazine #53, Nov-Dec 1975.&#10;&#10;It simulates the Roman-Carthage wars from 264-146BC. The game is a strategic simulation, each turn representing an entire year. Counters depict army, naval, and leader units.&#10;&#10;",
        "artist": "Henri-Paul Motte,Redmond A. Simonsen"
    },
    {
        "name": "Dixie",
        "description": "Dixie appeared in Strategy &amp; Tactics magazine #54, Jan-Feb 1976 as well as a folio edition.&#10;&#10;From the introduction:&#10;Dixie is a brigade/division/corps level simulation of an alternate-history conflict. Dixie posits that the Confederate States of America had successfully waged the first American Civil War and survived as an independent political/economic entity. The game further posits that these two independent countries wage a modern war during the late 1930s.&#10;&#10;Variant counters and rules were published in Strategy &amp; Tactics magazine #226 - Jan/Feb 2005.&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "Arne",
        "description": "The concept of Arne is new. Arne is cheeky, creative, and chaotic. And always spiced with the most unexpected turns. As a player, you change the direction of the game, take over someone&rsquo;s turn, protect your own cards, steal someone else&rsquo;s and wreck the strategy of your opponents. Your luck can turn at any moment: Arne literally goes every which way.&#10;&#10;Arne is suitable for all ages. A few practice games, and children from the age of seven start playing seriously. Boys and girls mainly enjoy the high tease factor of the game. But the countless combination possibilities make the game just as much fun for adults. You don&rsquo;t have to know Arne inside out to score well: luck plays an important part. Parents, children, grandparents &hellip; everybody&rsquo;s chances for winning are the same.&#10;&#10;There are no words printed on the Arne cards. So the game is universal: people of various mother tongues can play together perfectly well. Another great advantage is that the game does not take long to play: a round of Arne takes ten minutes, a quarter of an hour at the most. However, you will not know who is winning until the last cards have been played. Those who have saved plenty of points can be sent back to the beginning by just one card. And those who were not doing well can snatch victory at the very last minute.&#10;&#10;How ARNE Works!&#10;&#10;Whoever collects most points wins. Each player first chooses a color and then goes and tries to collect as many points of that color as possible. The other players try to do the same. The point of the game is to sabotage their attempts as much as possible. You do this by making use of the teaser cards. In order to make the game even more fun, there are two sorts of cards:&#10;&#10;White cards which you may only play when it is your turn &#10;Black cards which you may play whenever you want to&#10;&#10;In practice, all players can play cards at the same time. This means that the tease factor is very high indeed.&#10;&#10;Re-implemented by:&#10;&#10;    Arne Total&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Rommel's Panzers",
        "description": "MicroHistory #1 in the Metagaming MicroHistory series.&#10;&#10;A game of Tactical Unit combat in North Africa. In 1941 Erwin Rommel arrived in North Africa to save the collapsing Italian empire. Among the units under his command was the Deutches Afrika Korps. With the Afrika Korps Rommel wreaked havoc and exercised such military ingenuity that he would thereafter be known as &quot;The Desert Fox&quot;.&#10;&#10;From back of the box:&#10;&#10;PANZER ROLLEN IN AFRIKA VOR...&#10;&#10;1/28/42 - Benghazi: Our Panzer III column growls forward at the British six-pounder, dug-in on the next shimmering sand dune.  On our left a Matilda lumbers in, guns blasting.  Our battle is gritty and hard.  But, I know the men of the Afrika Korps will be victorious.  We have become crafty 'rats' of the desert.  We have the will and genius of General Rommel as our sustaining guide.  Heil!&#10;&#10;ROMMEL'S PANZERS is Metagaming's historical Micro-Game.  Tactical unit combat in North Africa was perhaps the ultimate example of armored warfare.  You command the tanks and fight the battles int he fast moving simulation.  The fun and playability of micros is now history.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Spy Web",
        "description": "Espionage game of clue giving , eavesdropping and finger-pointing. Each player has a board with nine locations and chooses where his spies will reside. Winner is the one who discovers the crime boss and his location.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Guess Who?",
        "description": "The mystery face game where you flip over a collection of faces with different color hair, eye color, hair, hats, glasses etc.  to deduce who the secret person is that your opponent has chosen. You flip over the hooked tiles as you narrow your choices by asking characteristic questions.&#10;&#10;Awards&#10;&#10;1989 &#195;&#133;rets B&#195;&#184;rnespil, Childrens Game of the Year Denmark&#10;&#10;",
        "artist": "(Uncredited),Theora Design"
    },
    {
        "name": "Arcola: The Battle for Italy, 1796",
        "description": "By November of 1796, Napoleon Bonaparte was eight months into a brilliant campaign in northern Italy which was removing any Austrian threats to the French Republic's southern flank. The fighting that month, north of the besieged city of Mantua, proved to be one of the first great challenges in the young General Bonaparte's career. Two Austrian forces under Marshal Alvinczy and Lt. General Davidovitch threatened to converge on the French from the north and east, join together at Verona, and march southwards to raise the siege. Bonaparte's task was to make use of his interior lines around Verona to unite his scattered and out-numbered troops, and defeat the separate wings of the Austrian &quot;pincers&quot; in detail.&#10;&#10;BATTLE for ITALY is Avalon Hill's new strategy game for two players which recreates the critlcal period of November. 1796. During a typical game turn, both players attempt to move their brigades by normal and forced marches. Combat occurs when opposing forces move adjacent to each other. and is resolved by a die roll on the Combat Results Table. Important leaders on both sides are represented in play, and their Individual attributes are critical to each players success. Game victory depends on how well the Austrians do in defeating the French and exiting units off of the map to break the siege.&#10;&#10;BATTLE for ITALY contains a colorful map of northern Italy around Verona, 100 playing pieces, and a short rules booklet.&#10;&#10;Playing Time: 1 1/2 hours&#10;&#10;Complexity Rating: 4&#10;&#10;(from 1-10, 10 the highest)&#10;&#10;source: back of the box&#10;&#10;",
        "artist": "Larry Catalano,Jacques-Louis David"
    },
    {
        "name": "Barrel of Monkeys",
        "description": "Did you know that this is not just a children's toy, but also a game?&#10;&#10;Try to hook a chain of monkeys until you stop or your chain falls apart. You score one point for every monkey in the chain at that point. First to 12 points wins!&#10;&#10;The U.S. federal trademark registration for BARREL OF MONKEYS by LAKESIDE INDUSTRIES, INC., W. HARTFORD, CT 06110 was filed on Wednesday, July 14, 1965. The USPTO trademark serial number was 72223317.&#10;&#10;",
        "artist": "NA"
    }
]