[
    {
        "name": "Trivial Pursuit: Book Lover's Edition",
        "description": "Trivial Pursuit with a book theme.&#10;&#10;Categories are: &#10;Children's, Classics, Non-Fiction, Book Club, Authors, and Book Bag.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Contrario",
        "description": "1320 terms from diverse domains such as music, cinema, literature, geography, history, and many others have been twisted by using synonyms, antonyms and logically related words to form a new expression called a Contrario. Players will need to use their lateral thinking ability and general knowledge to outsmart their friends. Virtually all the original expressions are familiar. It's obvious . . . . . once you've got it. Each Contrario comes with two clues to nudge players in the right direction. Now, can your mind handle the twist?&#10;&#10;",
        "artist": "Mathieu Beaulieu,Cyril Saint Blancat"
    },
    {
        "name": "La Bataille de la Moscowa",
        "description": "(from the pre-order flyer:)&#10;&#10;&quot;The Grande Arm&eacute;e before tbe gates of Moscow&quot;&#10;&#10;DESCRIPTION: &#10;In time for the 200th Anniversary of Napoleon's ill-&shy;fated invasion of Russia, Frank Chadwick has joined forces with Clash of Arms Games to bring the &#10;classic La Bataille de la Moscowa home to this venerated series. Newly researched and developed from the latest French, German, &#10;Italian, Polish and Russian sources, we have dressed this edition with the superb artwork grognards have come to expect when someone mentions ... &quot;La Bataille !&quot;&#10;&#10;COMPONENTS for GDW 1st edition: &#10;&#10;    Featuring the simplified &quot;Marie-Louise&quot; rules     &#10;    54 pages of scenarios. special rules and historical commentary&#10;    4 -22&quot; x 34&quot; full color period style maps&#10;    Over 1000+ (1440 to be exact - including blanks) full color counters&#10;    2 Organizational Displays&#10;    Multiple cardsrock Cham and Tables for play. &#10;    Two six-sided dice&#10;&#10;&#10;&#10;&#10;SCALE: Tactical - 100 yds per hex. 20 minute turns. Infantry battalions, cavalry regiments and artillery batteries&#10;&#10;&#10;&#10;(BGG user description:)La Bataille de la Moscowa (la Moscowa=the Moscow River) is a simulation, on the regimental/battalion level of the Battle of Borodino, fought between Napoleon`s Grand Arm&eacute;e and the Russian First and Second West Armies under Prince Kutusow on September 7, 1812. The game provides six short scenarios and a grand battle game.&#10;&#10;The game contains over 1400 counters (1440 to be exact - including blanks) and four maps. &#10;scale = 100 m/hex; &#10;time = 20 min/GT; &#10;strength = 50-100 men/SP (Regimental/Brigade Size)&#10;&#10;",
        "artist": "Rich Banner,John Harshman"
    },
    {
        "name": "Law & Order Game",
        "description": "[From box]&#10;&#10;Law &amp; Order, one of the most popular and critically acclaimed series in television history, is now a game you can play at home!&#10;&#10;Players become detectives, and compete to solve realistic cases as they travel around the board. Interview witnesses, interrogate suspects, gather evidence and collect clues as you try to unravel the case. First player to correctly identify the suspect wins!&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "R-Eco",
        "description": "A local city has a problem of un-separated trash left by citizens. Each player is a company that does the trash separation and recycling. By carrying trash to corresponding storage places, a player gets points. However if you carry too much, you must throw trash away illegally! Well, after all, your aim is to get money... (from the description of the game)&#10;&#10;",
        "artist": "Klemens Franz,Péter Szábo Gabór,Susumu Kawasaki,Yoshihiro Koyama"
    },
    {
        "name": "Halli Galli Extreme",
        "description": "Here is a description of the game from Erwin Broens of Bordspel.com:&#10;&#10;This is a &quot;complex&quot; version of the Halli Galli game. In this version the cards also show animals (monkeys, elephants and pigs). You have to hit the bell when two similar fruit cards are visible, or an elephant without strawberries, or a monkey without lemons or pig.&#10;&#10;",
        "artist": "Oliver Freudenreich"
    },
    {
        "name": "Palazzo",
        "description": "Who will build the most magnificent palace? In the game of Palazzo, set in the age of the late renaissance, the players slip on the roles of wealthy landowners, who compete against each other to build the most valuable palaces. As their constructions grow, the players must choose from the available palace modules from the quarries, so they can add to their palaces. Of course, none of this building can be done without money, so sometimes players must take time out to earn some money so they can afford to continue their building projects.&#10;&#10;This game is #2 in the Alea medium box series.&#10;&#10;",
        "artist": "Claus Stephan"
    },
    {
        "name": "Nexus Ops",
        "description": "Nexus Ops is a light-medium science fiction war game. The game boasts a hexagonal board that is set up differently every time, as well as (in the Avalon Hill edition) cool &quot;glow&quot; miniatures and lots of combat. Players control competing  futuristic corporations that battle each other for control of the moon's Rubium Ore. By winning battles and fulfilling Secret Missions, you can obtain victory points.&#10;&#10;Units are composed of various alien races and have stats similar to those used in the Axis & Allies series. Combat is also similar. Players who lose battles are compensated with Energize cards which grant them special powers later. Players can also obtain Energize cards by controlling the Monolith, a raised structure in the center of the grid. The first person to reach the required number of victory points wins the game.&#10;&#10;",
        "artist": "Christopher Burdett,Henning Ludvigsen,Scott Okumura,Anthony Waters,Peter Whitley"
    },
    {
        "name": "Vegas Showdown",
        "description": "Players compete to build the most famous hotel/casino. Room tiles representing slot machines, lounges, restaurants, and other casino-related places appear on a central board and the players hold auctions to win the rights to have those rooms in their building, garnering them income, population, or fame. Bidding wars escalate, values fluctuate, and designers renovate until finally the hotel/casinos are put to the test to determine whose garners the most fame.&#10;&#10;",
        "artist": "David Hudnut,Scott Okumura,Peter Whitley"
    },
    {
        "name": "The Devil's Cauldron: The Battles for Arnhem and Nijmegen",
        "description": "Devil's Cauldron is a company level simulation of the Northern two drop zones in Operation Market Garden. It is loosely based on an old Victory Games game called Panzer Command.&#10;&#10;Command and control is emphasized in this system and the game includes extensive documentation and historical background.&#10;&#10;Components include 4 linking maps (for the grand campaign) and three smaller gamettes (on Arnhem, the Island and Groesbeek Heights - each with its own rules and map). 1600 counters (of which roughly 700 are actual combat units) and attendant documentation.&#10;&#10;Play time for the various games range from one hour all the way up to 50 or so for the grand campaign.&#10;&#10;Contents:&#10;&bull;4 23.5&quot;x35.5&quot; map-sheets 3 of which are back-printed w/scenario maps&#10;&bull;3 9&quot;x12&quot; map extensions (adding useful areas which were &quot;just off&quot; the area covered by the 4 map-sheets)&#10;&bull;11 sheets of 5/8&quot; die-cut full-color counters&#10;&bull;1 counter-sheet of 1&quot; die-cut full-color counters&#10;&bull;Series Rulebooks (1 detailed; 1 &quot;quick start&quot;)&#10;&bull;TDC exclusive rulebook&#10;&bull;Historical booklet&#10;&bull;8 full-color divisional displays&#10;&bull;2 CRT/TEC Charts and Tables&#10;&bull;1 Game Turn Chart&#10;&bull;4 10-sided dice&#10;&#10;",
        "artist": "Nicolás Eskubi,Mark Mahaffey,Steve Paschal"
    },
    {
        "name": "Pass the Bomb Junior",
        "description": "An association game. Draw a card with a word eg. a beach. name something on a beach an then it's the next players turn. You lose if you fail to come up with a word when the bomb explodes.&#10;&#10;Similar to its older sibling Pass the Bomb this version is for younger players.  Children will easily recognize the familiar scenes on each card.&#10;&#10;In turn, each player has to think of an object that might be found in the picture on the card:  for instance, if the scene is a beach, then perhaps 'sandcastle,' or &lsquo;bucket,&rsquo; or even &lsquo;whale&rsquo; might be good answers.&#10;&#10;What makes this game a fun challenge is a time bomb which is passed to each player on their turn.  Be quick, because the bomb goes off at a random interval somewhere between 10 seconds and 1 minute. If you are holding the bomb when it 'explodes', you have to keep the card. The player with the least number of cards is the winner!&#10;&#10;Educational and great fun for kids.  2 or more players. Ages 5 and up&#10;&#10;CONTENTS: 55 Game Cards, Rules, Electronic Bomb (Batteries Included).&#10;&#10;NOTE: This Junior version is significantly different than the Regular version in that the Junior version does not have a randomizing die and it features picture cards rather than letter cards.&#10;&#10;",
        "artist": "Patrick Fix,Jean-Marie Renard"
    },
    {
        "name": "Linkity",
        "description": "Every player starts with 7 cards and each card has a letter. The first player plays a card and announces a word that starts with that letter. Then any player can throw down another card as long as they can announce a word that starts with the letter on their card AND that has some relationship to the card previously played.&#10;&#10;Poor associations can be challenged and players vote on the acceptance of the explanation. If the explanation is valid, the challenger takes two cards from the discard pile. If it is voted down, the player that played the card picks up two cards.&#10;&#10;Once a player is out of cards, the round ends and each player scores the number of cards remaining in their hand. After three rounds, the player with the lowest score wins.&#10;&#10;WHAT THEY'LL LEARN: Vocabulary, Quick Thinking, Word Association&#10;&#10;",
        "artist": "Damon S. Brown"
    },
    {
        "name": "TATATA!",
        "description": "TATATA! is a simple, funny, complete card game that allows 8 crazy pilots to fly for victory in a &quot;dogfighting race&quot; where many weapons and strange tools may be found in the cards that form the circuit in the sky.&#10;Memorize the circuit due the race is on 3 laps, stop in the good cards, avoid the bad ones and mostly avoid to stop in front of the guns of another plane or it will TATATA! you! &#10;Basic Rules are good also for younger gamers and children. Complete Rules allow to use one of the 4 numbers at your choice on each Deck Card.&#10;Choose how many cards play with the &quot;Action&quot; value, then Move, Fly, Looping and... TATATA!&#10;&#10;",
        "artist": "Angelo Porazzi"
    },
    {
        "name": "Walk the Dogs",
        "description": "&quot;From the SimplyFun website&quot;&#10;&#10;Walk the Dogs&trade;&#10;Unleash 63 Miniature Dogs That Won't 'Flea' From Your Table&#10;&#10;Grab a leash and get ready to Walk the Dogs! Each player collects dogs from the front or back of a long line by drawing and playing cards. But, beware of the dog catcher who may steal some of your favorite dogs. To win, collect five of the same breed in a row, or have the most dog points in your own line. Woof!&#10;&#10;What breeds come in the game?&#10;Poodle, Pug, Brittany Spaniel, Shitzu, Scottish Terrier, Golden Retriever, and Pomeranian...and they're all rescue dogs!&#10;&#10;Includes:&#10;63 Miniature Dogs in 7 different breeds&#10;53 Cards - 18 red, 18 green, 6 yellow, 3 dog catchers, 5 bones and 3 leashes &#10;1 &quot;Doggie Bag&quot;&#10;2 Score Sheets&#10;1 Instruction Booklet&#10;1 FunMemories&trade; Booklet&#10;&#10;WHAT THEY'LL LEARN: Counting &amp; Early Multiplication, Risk &amp; Reward&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Trivial Pursuit: Globetrotter",
        "description": "The six categories are now replaced with six regions:&#10;&#10;    North American&#10;    Latin American (includes Mexico and South America)&#10;    Oceania&#10;    Africa&#10;    Europe&#10;    Asia&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Starship Troopers Miniatures Game",
        "description": "From publisher:&#10;Stand by for the hottest action in 30mm science fiction gaming. Released in late March, Starship Troopers will bring the action of the novel, film and TV series straight to your tabletop in a fast-to-learn wargame.&#10;&#10;Do you want to know more?&#10;&#10;Collect armies of the Mobile Infantry, Arachnids and Skinnies (and that is just for starters - there are far more aliens out there in the galaxy!) and compete for the very survival of your species.&#10;&#10;Written by Andy Chambers, the all new Starship Troopers miniatures game is a full blown sci-fi slaughter fest pitting the rugged Mobile Infantry against the full weight of the Arachnids. This box set provides everything you need to get started in the Starship Troopers game and includes;&#10;&#10;A complete rulebook detailing both basic and advanced rules, as well as background material on the universe of Starship Troopers.&#10;&#10;20 plastic Arachnid Warrior Bugs, a good start to any full size Arachnid army.&#10;&#10;2 Squads of 8 Mobile Infantry Cap Troopers each with full weapon options including Javelin missile launcher Triple Thud grenade launcher, Hel infantry flamer, CC-176ER shock stick and, of course the trust Moritas rifle.&#10;&#10;More punch out templates than you can shake a dead Hopper Bug at! Includes Tunnel Markers, Bug Nests, Lethal Zones and complete air support, such as Flamberge support missiles, Viking transports and TAC Fighters.&#10;&#10;A complete card Bunker, ready to protect your MI in defensive missions. You will come to value this structure dearly. . .&#10;&#10;Full army lists detailing everything we plan on releasing for both Arachnids and Mobile Infantry this year. You will not have to wait for an update to start using units such as Marauders, Tanker Bugs, SICON Observers, Hopper Bugs and many others.&#10;&#10;It's a battle for the species - whose side are you on?&#10;&#10;",
        "artist": "Vincent Dutrait"
    },
    {
        "name": "Kokkelimonke Jubileum",
        "description": "&quot;Balderdash Double&quot; is basically two games in one box; the Tactic editions of Beyond Balderdash and original Balderdash. Questions and answers have been shifted to the same side of the cards to make room for 5 words and definitions on the other side, to be played with the original Balderdash rules; one side of the board is exactly the same as in Tactic's previous version of Absolute/Beyond Balderdash, while the other side has simply 17 empty spaces and a start space for original Balderdash scoring. The spinner provided now has two sectored circles, one for use with Beyond/Absolute, the other with original. Includes 4800 questions.&#10;&#10;Re-implements:&#10;&#10;    Balderdash&#10;    Beyond Balderdash&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Zombiaki",
        "description": "Polish card game for two players. One of the players is the Zombies, the second one - humans. Objective of the Zombies is to eat the people, but people want to save their own lives, which is possible if they survive until the sunrise. Game with humor and strategy.&#10;&#10;",
        "artist": "Agnieszka Bemke,Krystian Bemke,Mateusz Bielski,Paweł Miedźwiński,Oliver Schlemmer"
    },
    {
        "name": "The Last Straw",
        "description": "Bimbado, Packesel, or The Last Straw is an stick stacking game on top of a wooden animal.&#10;&#10;The elephant, donkey, or camel is placed in the middle of the play area and the game starts with each player receiving the sticks of own color.&#10;&#10;Each turn, players place 1 stick on the back of the animal. It is not necessary to stack it &quot;on top&quot; of the other sticks. When a player knocks sticks off of the animal, they all go to that players collection.&#10;&#10;The first player who stacks all of his or her sticks wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Scene It? Movie Deluxe",
        "description": "Scene It? is a trivia game based on movies.  Roll the dice, move around the board, and answer trivia about anything from movie slogans to the romantic lives of actors.  Two categories, however, allow you to watch questions presented on a DVD.  Some questions let you watch a movie clip, then answer questions about the clip, the movie, or the actors/directors involved.  Other questions have everyone racing to fill in the blanks of a movie title, guess the actor by his voice, or figuring out image puzzles to find the name of the movie (Fish Hair King = The Fisher King).  The deluxe edition comes with 6 playing pieces opposed to the 4 included in the regular game.  It also comes with a 2nd DVD, doubling the amount of DVD-based questions you can play with.  A DVD player is required to play this game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Tower of Babel",
        "description": "Together, the players use cards to try to build the eight wonders of the ancient world. The number they build varies, but can't be more than seven. (Hence the subtitle of the game, &quot;...or why the eighth wonder was never built.&quot;) While building together, each tries to provide the majority of the components for each wonder and collect scoring disks (in four suits). When it's someone else turn, you offer cards to the active player, and by good offers, can earn points (or sometimes even the disk).  So a feature of &quot;Tower of Babel&quot; is that players always perform actions and can earn points during another's turn. Card trade offers, collecting disk sets, and building wonders are the three ways to earn victory points. The game ends when a player takes the last disk of any one of the four suits, so players have some influence on the game's end moment.  And, the victory points determine the winner at game end. Typical game length is less than an hour.&#10;&#10;&#10;     Reiner Knizia Variant--some recommend against using the action cards because the publisher rather than Reiner Knizia added them and because they damage the game balance. To play with this variant, simply leave the action cards in the box. There is no bonus to the person who completes the final stage of a wonder.&#10;&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Fjords",
        "description": "Between the 8th and 11th centuries, the Vikings had the world holding their breath. Always on the lookout for new land, they aren't above fighting their own countrymen. In this game, two clan leaders fight each other, using the right tactics, for a fruitful plot of land along Norway's coast. They quickly build up villages at strategic locations and fight with anything they can to ensure the larger portion of the region for their clan. Fjords: the tactical battle for the best land!&#10;&#10;The above is the description of the game from Hans im Gl&uuml;ck.&#10;&#10;The game is played in two phases: the first phase, placing tiles and farms, mixes luck and skill; the second phase, claiming fields, has a Go-like enclosure dynamic that is all skill.&#10;&#10;",
        "artist": "Jörg Asselborn,Christof Tisch"
    },
    {
        "name": "Diamant",
        "description": "Diamant &mdash; also published as Incan Gold &mdash; is a quick, fun press-your-luck game. Players venture down mine shafts or explore paths in the jungle by turning up cards from a deck and evenly sharing the gems they find on the way, with any leftover gems being placed on the card. Before the next card is revealed, you have the chance to leave the mine and stash your holdings, including any gems you get on the way out.&#10;&#10;Why would you leave? Because the deck also contains hazards: scorpions, snakes, poison gas, explosions and rockfalls. When a particular hazard is revealed for the second time (e.g., a second scorpion), anyone still in the shaft or on the path has to drop all the gems they've collected that round and flee for safety. The trick is that as more players leave each turn, your share of the pie grows larger, which will perhaps inspire you to explore deeper &mdash; but at the risk of ending up with nothing.&#10;&#10;All editions of Incan Gold and later editions of Diamant include five artifact cards that are shuffled into the deck of gem and hazard cards, either one per round or all at once. When an artifact card is revealed, no on can take this card and it's placed on the path. If exactly one player leaves at the end of a turn, they collect not only all gems that remain on the path, but the artifact as well, which is worth points at the end of the game.&#10;&#10;",
        "artist": "Jörg Asselborn,Paul Mafayon,Claus Stephan,Christof Tisch"
    },
    {
        "name": "Trivial Pursuit: DVD – The Lord Of The Rings Trilogy Edition",
        "description": "In this version of Trivial Pursuit, players use cards and 2 DVDs to answer 2400 questions about The Lord of the Rings movie trilogy. The game includes Frodo, Galadriel, Gandalf and Aragorn playing pieces (the category wedges are inserted into the bases). Hear the voice of Gollum (Andy Serkis) when he asks the game-winning question.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Kreta",
        "description": "Players use different character cards to bring in and move pieces around Kreta which give them influence in the provinces on the island. One of the cards triggers scoring in all the provinces adjacent to a place, and each province gives various Victory Points (VPs) to the 1st and 2nd most influence. At any time, you only know the next two places that will score, so if you cannot gain influence the current place, you can prepare for the next scoring.&#10;&#10;Each player has an identical set of characters, and each character controls certain pieces which have different abilities and limitations in the game. By smart use of your characters and clever timing, you can try to have the scoring occur when you have the most influence, and gain more VPs than the other players.&#10;&#10;But influence changes swiftly, the others can quickly conspire to block your control, and the scoring places can jump from one end of the island to the other, leaving you controlling worthless provinces. Can you make the right choices to gain influence in the right place at the right time, or will you be left watching as someone else takes power in Kreta?&#10;&#10;From the publisher, Goldsieber: &quot;Settle the most important Cretan provinces with your followers. Build booming cities and increase your influence by building massive towers. Locate your fleet carefully but also try to harvest as many grapes and olives as possible. Only he who best places his Admiral, King, Farmers and Castellan will end up winning the race for power and prestige!&quot;&#10;&#10;Online Play&#10;&#10;&#10;     http://www.mabiweb.com (turn-based)&#10;&#10;&#10;",
        "artist": "Rotraud Meiler"
    },
    {
        "name": "Gangster",
        "description": "Each player is a big time gangster boss in &quot;the big city&quot;. You are all competing to become the first one to score enough money to be able to retire on a far away tropical island.&#10;&#10;This is accomplished by recruiting gang members, taking over the more shady businesses in town, robbing the more honorable businesses, bribing the right people and above all staying out of jail and the hospital while putting your competitors there.&#10;&#10;",
        "artist": "Tony Berglund"
    },
    {
        "name": "Egyptian Ratscrew",
        "description": "Description by Wikipedia.org&#10;&#10;&quot;Egyptian Ratscrew, commonly abbreviated as ERS and also known as Egyptian Rhapsody, Egyptian Rattrap, Slap, Bloodystump, Nuclear Holocaust, Egyptian Rat Race, and Egyptian War, is a card game of the accumulation family, reminiscent of Slapjack and Beggar-My-Neighbour, but more complex. The game is played with a standard 52-card deck (or with multiple standard decks shuffled together with large numbers of players).&#10;&#10;Each player takes an even share of the deck as their face-down pile. Players take turns laying a single card from the top of their pile. If a face card is played, the player after the player who laid the card has a number of chances to play another face card (J=1, Q=2, K=3, A=4). If they succeed play continues as usual; If they fail, the player who played the last face card claims the entire pile. If, at any time, certain &quot;sets&quot; appear in the pile (usually pairs and sandwiches, but not limited to triples, runs, etc) ANY player may SLAP the pile and claim all the cards.  Even a bystander may do this and jump into the game. The game ends when one player has all the cards.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "N-Tropy",
        "description": "The object of the game is to balance all of your wooden sticks on a continually evolving structure without making it topple over.  Each player takes a turn to roll the die which will show a 1 or 2.  The die roll determines how many other sticks the one that you place may touch.  If you make any sticks fall off then you have to pick them up and add them to your own.&#10;The winner is the first to have placed all of their sticks or the player preceding the one to make the whole structure fall over.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Game of Life: Card Game",
        "description": "This is the card game version of &quot;The Game of Life&quot;. There are four types of cards: Career cards, Student/Married cards, Early Life cards, and Later Life Cards. First you must draw a Career card. You may also choose to attend college which allows you to pick a higher paying career, but you also lose three turns. Your Career card lists how much time and money you can spend on each turn. On your turn, you may play cards from your hand, but only if you have enough time or money to pay for them (some cards, like &quot;Lucky Lottery&quot; allow you to add your two scores together). The cards you play feature life goals that are worth points. You may also get married and have children which costs you time but earns you bonus points. When the Early Life cards are used up, play proceeds with the Later Life cards. This deck also has the Letter cards &quot;L&quot; &quot;I&quot; &quot;F&quot; and &quot;E&quot;, and when all four of these cards are drawn the game ends. The players add up their scores and the one with the highest point total wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "MidEvil",
        "description": "Per the box:&#10;&#10;This is a standalone game and IS NOT compatible with the original Zombies!!! board game.&#10;&#10;MidEvil is the first game to be based on, and an extension of, the award winning Zombies!!! system from Twilight Creations. Players have escaped the modern-day zombie hoard only to find themselves transported back in time and faced with a whole new set of problems!&#10;&#10;Game play is fairly straightforward.  Players start at the well and their objective is either to kill 25 points worth of skeletons or to collect the Necromicon from the graveyard and return with it to the Altar.  The various skeletons are worth different points, White are worth 1, Red are worth 2, and Blue are worth 3.&#10;&#10;Players start by drawing a tile and placing it on the board anywhere it will fit.  They then place a number of skeletons and villagers as shown on the tile.  They then roll a six-sided die (d6) for movement.  Movement is orthogonal and limited to the tiles currently in play.  If you encounter a villager you can collect it; skeletons you encounter must be overcome.  At the end of your turn you again roll the d6 to move that many skeletons 1 space each.&#10;&#10;Players can collect up to 5 villagers who can be sacrificed if they lose a fight.  Combat is simple - enter a square with a skeleton and on a 4 or better on a d6, you win.  If the roll is less than 4, you can either sacrifice a villager or pay skeletons to reach 4 or better.  There is no change, so if you roll a 3 and only have reds, you now have a 5.&#10;&#10;Some of the cards also require specific colors of skeletons be used in order to power them and many require that you kill skeletons in order to play them.&#10;&#10;Once a player reaches the Graveyard and grabs the Necronomicon, the other players can attack him during their turns to try to steal it away from him.  The game ends when someone takes the Necronomicon to the center tile of the Altar or collects 25 points worth of skeletons.&#10;&#10;This Zombies!!! sized box contains 30 map tiles, 50 event cards,  6 pawns, 50 sculpted life counters (little gray dudes), rules and 100 HEAVILY ARMED AND ANGRY SKELETON WARRIORS!!! The whole game is done with the same realistic but very tongue-in-cheek style you have come to expect from Twilight Creations.&#10;&#10;Part of the MidEvil/Zombies!!! series&#10;&#10;Expanded by:&#10;&#10;    Midevil II: Castle Chaos&#10;    MidEvil III:  Subterranean Homesick Blues!&#10;&#10;&#10;&#10;&#10;",
        "artist": "Dave Aikins,Ed Bourelle,Paul Herbert,Jeremy McHugh"
    },
    {
        "name": "Hidden Conflict",
        "description": "For when you're lookin' for a fight!&#10;&#10;While mankind has fought with itself, the forces of evil have gathered and prepared for one final, apocalyptic assault. Each group has fine tuned their forces and stands ready to fight for ultimate control of the earth.&#10;&#10;You are the leader of one of these groups, and you alone will determine who has control of the earth for now...&#10;&#10;Hidden Conflict is an innovative, tile-based, skirmish game that allows players to fight for global domination as either the forces of good or one of the many evil groups vying for control. Players build an army from the beautifully illustrated tiles and face off against their foes. The game plays equally well with two to six players.&#10;&#10;This large box contains 240 &quot;Army&quot; tiles, complete rules and 6 player &quot;cheat&quot; cards.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Knowing Me Knowing You",
        "description": "A game based on guessing what your friends really think about you and your opinions.&#10;&#10;Knowing me, knowing you (ah-haa)&#10;There is nothing we can do&#10;Knowing me, knowing you (ah-haa)&#10;We just have to face it, this time were through&#10;(this time were through, this time were through&#10;This time were through, were really through)&#10;Breaking up is never easy, I know but I have to go&#10;(I have to go this time&#10;I have to go, this time I know)&#10;Knowing me, knowing you&#10;Its the best I can do&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Manila",
        "description": "Barges, freight and profits are what it's all about in Manila, a speculative contest for 3-5 players. Goods shipments, intended for transport along sea routes, are in danger of gathering dust in the warehouses or being lost at sea in a storm. While the players speculate about success and failure, the ultimate fate of the ships will be determined by the dice.&#10;&#10;There are four shipments that need to get to Manila - jade, ginseng, silk and nutmeg. A round begins with an initial auction to become harbour master. If you win, you'll be allowed to buy a share of one of the shipments, choose which three shipments you'd like to take down river and how likely they are to make it to their destination in the harbour. If they make it to Manila, their share price will increase. The aim of the game is to bet on the outcome of these shipments, with dice ultimately determining their fate. How many of the three boats will make it and which ones? Would you like to provide insurance against possible failed ships or perhaps you think pirates will snatch a chance to take control? Manila is a fun family game that takes minutes to learn and brings the river boats of the Philippines to life!&#10;&#10;",
        "artist": "Victor Boden"
    },
    {
        "name": "Pickomino",
        "description": "Two to seven players, ages 8 and up try to obtain fried worms for their chickens, so that they don't go hungry. Of course, anyone who doesn't manage to grab a worm off of the grill can help himself to those of his opponents. This fast-paced game by Reiner Knizia is, like Hick Hack im Gackelwack, a gambling game in the finest chicken tradition.&quot;&#10;&#10;Each turn players roll their dice and set aside all those matching any single value. The remaining dice are rolled and any value is set aside again until the player stops and takes a tile or busts and puts their last tile back. When a player busts and fails to take a tile they must also turn the highest tile face-down.&#10;&#10;Interestingly, the German edition from Zoch has English rules in the box.&#10;&#10;The Dutch edition is part of the Jakkie &amp; Bak Collection&#10;The German edition is part of The Chicken Family of Zoch.&#10;&#10;",
        "artist": "Doris Matthäus"
    },
    {
        "name": "Triumph of Chaos",
        "description": "Similar to other card driven strategic games, players assume role of political and military commander of their respective (RED and WHITE) forces in this epic struggle of the Russian Civil War.&#10;&#10;Three phases in a turn: Political, Action and Logistics.&#10;&#10;During the Political Phase, players try to gain control of the 18 factions (Finland, Estonia, Latvia, Lithuania, Poland, Belarus, West Ukraine, Ukraine, Makhno, Transcaucasia, Asktrakhan, Khiva, Turkistan, Central Powers, Czech Legion, Britain, France, USA) using Political Cards. Players are forced to make difficult trade-offs between expending resources in the Political Phase vs the Action Phase and attempting to influence one faction at the expense of others. Players utilize a shared deck of 66 Political Cards.&#10;&#10;During the Action Phase, players use Action Cards to conduct operations (activating a space for combat or movement), take replacements, place reinforcements, make strategic moves, seize initiative in combat, gain diplomatic traction with the factions or implement special operations. Leaders have these capabilities including exploitation, reinforcing battles, withdrawing, counter-attacking and conducting multi-space attacks. Players are forced to make difficult decisions thwarting threats and capitalizing on opportunities. Each player has their own deck of 55 Action Cards. Additionally, a deck of 44 Leader Cards (for a combined total of 220 ToC Cards) provide historical details regarding the various personalities in the game.&#10;&#10;During the Logistics Phase, players rebuild/repair units, determine if various factions withdraw from the combat, check for the effect of In-Fighting within the RED and WHITE camps, check for attrition, purchase political influence, buy leaders and check for victory.&#10;&#10;",
        "artist": "Terry Leeds"
    },
    {
        "name": "Blitzkrieg Commander",
        "description": "BlitzkriegCommander is an exciting wargame that allows you to re-create battles of the Second World War and Spanish Civil War using miniatures on a tabletop. Command anything from a company right up to a division and get a result in 2-3 hours without becoming bogged-down in detail. Suitable for any scale miniatures from 2mm right up to 20mm and no re-basing required.&#10;&#10;The rules come as a 120-page A4-sized perfect bound book with over 50 full color pictures that illustrate how to play the game. These feature real miniatures as you see them on the gaming table not diagrams that belong in a physics textbook! You also get two double-sided A4-sized quick reference sheets - one for each player.&#10;&#10;The main features of the game include:&#10;&#10;&#10;     Command system that emphasizes the fog of war in a simple but effective manner.&#10;     The same mechanism for casualty resolution throughout.&#10;     Rules for infantry, tanks, recce, artillery, aircraft, engineers, fortifications &amp; weather.&#10;     Flexible figure ratio meaning a base of infantry represents either a section or a platoon&#10;     Minimal set-up time - simply assemble your forces and play.&#10;     Unique points system that allows for unequal forces but an equal chance of victory.&#10;     43 well-presented army lists for 18 nations covering 15 theatres of war.&#10;     15 generic scenarios suitable for any nation &amp; theatre plus a simple campaign system.&#10;     Suitable for solo, 2-player &amp; multi-player games at home, club, or tournament.&#10;     Two double-sided quick reference sheets included - one for each player.&#10;     No supplements - all you need to play in one book.&#10;&#10;&#10;",
        "artist": "Peter Andrew Jones"
    },
    {
        "name": "Scene It? Disney",
        "description": "Disney Scene It is a nice game for the Disney Enthusiast or Disney lovers.  The game comes with 2 sets of trivia cards.  50 cards for children or younger players and 110 cards for the adults.  The game comes with a DVD containing remastered clips of several Disney films on which questions are based.&#10;&#10;The game has a turn method that allows for a smooth progression through the game and does not require answering a question to move.  This is good for younger players allowing an equal chance to win without having to answer every question.  An alternate rule can be added for adults to make the game more challenging and require more correct answers for movement.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Bonaparte at Marengo",
        "description": "On 14 June 1800, the French army under Napoleon Bonaparte was taken by surprise and attacked by the Austrian army under General Melas. Outnumbered and out-gunned, the French were defeated and forced to retreat. But later that same day, French reinforcements arrived under General Desaix, and in what amounted to a second battle the French counter-attacked and won, taking thousands of prisoners and driving the Austrians from the field.&#10;&#10;Thus was won the battle of which Napoleon was always the most proud &ndash; Marengo.&#10;&#10;Bonaparte at Marengo recreates that dramatic battle. The game is simple and fast-playing, departing from almost all of the standard conventions of wargaming in order to achieve the look and feel of nineteenth century linear warfare.&#10;&#10;In the summer of 2007, a sequel with a modified system was released: Napoleon's Triumph&#10;&#10;",
        "artist": "Denis Auguste Marie Raffet"
    },
    {
        "name": "Fantomen",
        "description": "This game is based on the comic book of The Phantom, The Ghost Who Walks. The storyline of the game is that the players, all in the role of The Phantom, must free president Luaga who is being held captive at a secret location by the Singh Pirates.&#10;&#10;",
        "artist": "Seymour Barry,Özcan Eralp,Rolf Gohs"
    },
    {
        "name": "The Hollywood! Card Game",
        "description": "The Hollywood Card Game is a fast and simple card game from Bruno Faidutti and Michael Schacht, designers of such games as Citadels, Coloretto and Fist of Dragonstones. This exciting and unique card game invites players to compete to get the best directors and most famous actors for their films. With an easily accessible theme, and simple but deep gameplay, The Hollywood Card Game appeals as much to casual gamers as it does to hardcore strategists.&#10;&#10;The game plays over 3-4 rounds (the same number as the number of players), with each player having one turn to play first. Each round a new Hollywood Area is created by shuffling 3 Star cards and 11 Movie cards together and dealing them out into 4 columns. Players take turns either placing a marker on the bottom card of a column (pushing the preceding markers up the column), or playing one of their Studio cards (Skip a turn, or take two turns in a row). Each studio card can only be used once per game. Once each card in a column has a marker on it, that column is closed, and no more markers have been played in this column.&#10;&#10;Once all players have run out of markers, the round is over, and cards are allocated to players based on the marker on the card, and starting from the TOP left corner. Cards are allocated one at a time, and must be used on a Project immediately. Film cards must be allocated to a Project of the same genre (Horror, Action, or Romantic Comedy), or allocated to a new project if the player does not already have a Project of that genre. Star cards must be allocated to any project, however this will immediately complete a Movie, which no more cards can be added to. If a Star card cannot be allocated to a project, they cannot be held to add to a later project. Movies score points for the number of Film cards in them (with Award Film cards counting twice), multiplied by the number of stars on the Star card. Blockbuster cards stand alone and are worth 2 points each. Additionally, each player scores one point for each Film card in their largest unfinished project (no ties allowed). The player with the most points wins. If players are tied, the player with the single most valuable movie is the winner.&#10;&#10;The Hollywood Card Game contains 64 cards, 16 film reel chips, and a rule sheet. The game is suitable for three to four players Ages 8 and up&#10;&#10;",
        "artist": "Daniele Bigliardo,Szucs Gregory"
    },
    {
        "name": "San Ta Si",
        "description": "Players play metal tubes of varying sizes onto one of three building spaces. Added in are six thin wooden columns, which only remain visible when their tips can still be seen over the topmost edge of the metal tubes. Each player has components in a single color, but both players can use the tubes and columns of his opponent. See and be seen - only that counts at the end of the game. The player whose building materials can be seen the most at the end of the game is the winner.&#10;&#10;San Ta Si is a spatial hide-and-seek game for thinkers who love to build.&#10;&#10;",
        "artist": "Claus Danner"
    },
    {
        "name": "Wings of War: Burning Drachens",
        "description": "Wings of War: Burning Drachens is the third set in the Wings of War collection. It includes some of the most used airplanes of the WWI as the Nieuport 17-23, the Albatros D.III, the Pfalz D.III/D.IIIa. It also includes optional altitude rules, anti-aircraft guns and machineguns. Other additional rules are proposed for a more intriguing and varied simulation of WWI air combat, even if the basic system is the same, simple one of the first two sets.&#10;&#10;Huge cardboard observation balloons are the targets in solitaire and 2 players scenarios in which to use incendiary bullets or the famous Le Prieur air-to-air rockets. Other scenarios will include 1 and 2 players trench strafing missions.&#10;&#10;The set is totally independent, but it can be mixed in the others in the collection for larger scenarios.&#10;&#10;",
        "artist": "Vincenzo Auletta,Dario Calì,Fabio Maiorana"
    },
    {
        "name": "Conquest of Paradise",
        "description": "Empire Building in Polynesia, 500 A.D. &#10;From the Developer, Fred Schachter:&#10;Conquest of Paradise is a game of empire building in the &quot;Polynesian Triangle&quot; of the central Pacific Ocean for two, three, or four players. Players explore the unknown ocean around them, hoping to discover the most lucrative island groups, and colonize them. They build canoes and train warriors to create a force to defend their empire, while forging lines of communication with their developing discoveries. Resources are scarce; using them wisely is a key to victory. Investing in exploration widens your empire. Building warriors strengthens your empire. Investing resources into cultural innovations can yield unexpected dividends, like tattooing, hula dancing, surfing, or even the giant moai statues of Easter Island fame.&#10;&#10;Conquest of Paradise is a well-tested, fast-playing design geared to appeal to players who enjoy games like New World, Civilization, and Conquistador. You can learn the game in 10-15 minutes and finish a complete game in 60-90 minutes.&#10;&#10;Conquest of Paradise is a game of exploration and empire building, but also (as you'd expect from a GMT game) CONFLICT. Choosing when to build those expensive warriors, and when and where to fight, given limited resources, is key to your success.&#10;&#10;",
        "artist": "Rodger B. MacGowan,Leland Myrick,Mark Simonitch"
    },
    {
        "name": "Blood Bowl: Living Rulebook",
        "description": "Blood Bowl is the game of Rugby slash Football as imagined in a fantasy world of orcs, elves, beastmen and many other fantasy creatures. The game truly shines in a League format, where players gain experience and learn new skills as they play.&#10;&#10;The latest rules are now version 6.0. The biggest change is the new Inducement system that does an infinitely better job of balancing teams of different experience. All of the team rosters have also been tweaked, with the previous runaway leaders toned down to everyone else's level. And as a great benefit to teams feeling the need to start over after a first bad game, the Journeyman system ensures you will always have 11 players on the field.&#10;&#10;This game is a part of the Blood Bowl Series&#10;&#10;",
        "artist": "Carl Critchlow,Wayne England,David Gallagher,Pete Knifton,Richard Wright"
    },
    {
        "name": "1825 Unit 3",
        "description": "The final unit in Francis Tresham's 1825 series. This one covers the north of England &amp; Scotland. Unusual for an 18xx game it is designed for two players. This is a stand alone game, although it can also be used in conjunction with Unit 2 (Midlands) and Unit 1 (Southern England).&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "1825 Unit 2",
        "description": "The second unit in the 1825 series covering the Midlands (of England). This can be played standalone or in conjunction with 1825 Unit 1 (southern England) &amp; 1825 Unit 3 (Scotland). Designed by Francis Tresham this is another of many games based on the same underlying mechanics, known as 18xx.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Cranium Whoonu",
        "description": "Your dad likes poodles more than pickles? Your best friend likes bubblegum more than museums? Whoonu! In Cranium Whoonu, you're sure to have unforgettable fun as you reveal your favorite things, share hilarious stories, and bond over surprising connections. You'll be amazed at what you'll learn about your friends and family ? especially those you think you know best!&#10;&#10;Cranium Whoonu is easy to learn and quick to play, so it's the perfect game for any occasion. And best of all, it's just as fun to play with people you've known for 5 minutes as it is with people you've known forever. For 3 to 6 players, Ages 8 and up&#10;&#10;What's in the box? 300 game cards, 36 scoring tokens, and a secret envelope.&#10;Note: The 2008 edition comes with 400 game cards&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Merlin",
        "description": "Parker Brothers' Merlin was a hand held electronic game following in the footsteps of Simon, which had been introduced a year earlier by rival game company, Milton Bradley. Many of us who were kids in the seventies will remember its distinctive red plastic, telephone-shaped appearance. Although less colorful than Simon, Merlin featured six different games, namely tic-tac-toe, music machine, echo, blackjack 13, magic square, and secret number. It was even possible to save games and select your level of difficulty on a scale of 1-9. In 1999, Merlin became available once again on the internet as a free download for your PC.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Star Wars Electronic Galactic Battle",
        "description": "A long time ago in a galaxy far, far away.....&#10;It is a time of civil war.  Brave freedom-fighters of the Rebel Alliance struggle against the tyranny of the Galactic Empire.  Though they have won several small victories, the Alliance is outnumbered and outgunned by the technological might of the Empire.  Gathering their forces, the Rebels launch a last, desperate attack against the imperial fleet...&#10;&#10;Welcome to Galactic Battle, the strategic space combat game of the Star Wars galaxy.  As commander of either the Rebel Alliance or the Empire, an entire fleet of starships awaits your command.  The fate of the galaxy is in your hands!&#10;&#10;Ages 5 and up&#10;&#10;Re-implements:&#10;&#10;    Battleship&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Champions of the Galaxy",
        "description": "Champions of the Galaxy is a card game combining sci-fi and wrestling into an all-action game! It's Star Wars meets the WWE! You'll enter the Future of Wrestling in the GWF!&#10;&#10;Champions of the Galaxy is a card and dice game that features playing cards for 24 galactic wrestling legends! The playing cards have a drawing of the wrestler on the front and game information on the back. Champions of the Galaxy features a fast-action game system that allows matches to take place in real time. You can play alone or with friends.&#10;&#10;",
        "artist": "Darryl Banks,Brian Michael Bendis,Chuck Carter,Hannibal King,Werner Mueck,Scott Rosema,Larry Snelly,Jeremy Su"
    },
    {
        "name": "Fredericus",
        "description": "Fredericus, by Eligio Cazzato, is a board game for 2-4 falconers at the court of Kaiser Frederik II in Castel del Monte. The box includes 118 cards (43x66mm), an illustrated game board, and a falcon, hawk, and betting coin for each player. The goal of the game is to catch as many mythological beasts as possible. After each capture, the catches of the other players can be bet on and the Kaiser can award prizes to the players.&#10;&#10;",
        "artist": "Stefano de Fazi"
    },
    {
        "name": "Geisterwäldchen",
        "description": "Michelle Schanen is continuing to play with her successful ghosts - but this time with new figures, new scenery and a completely different game principle. In Geisterw&auml;ldchen (Ghost Forest), the old ghost that the children wanted to scare is now after the children themselves. The children have hidden themselves in the mysterious woods near the old ruined castle in which the ghost lived. He circles the woods, while the children try not to get caught. Magnets in the figures play a major role. A tense chase game that's not just for kids!&#10;&#10;Ages 5 and up.&#10;&#10;",
        "artist": "Rolf Vogt"
    },
    {
        "name": "Fruit Spy",
        "description": "Fancying themselves spies like those in the movies, a group of little animal rascals have decided to sneak into Farmer Papa's neighboring orchard to gather gardening intelligence (i.e., fruit) they can use on their own farm. Competing with both open and hidden information, they must identify bluffing and beware of the others' weapons. The player who can obtain the most yummiest fruit will be recognized as the best fruit spy!&#10;&#10;In Fruit Spy, six farmhouse boards are arranged in a circle in a random order, with 2-4 fruit tokens (valued 1-7) placed randomly upon them. Two stand-up figures &mdash; Farmer Papa and Daly &mdash; are placed on their respective starting farmhouses.&#10;&#10;Each player has eight spy cards in hand &mdash; trick cards valued 1-7 and one tool card &mdash; and on a player's turn, they place one card face down on a farmhouse of their choice. If another face-down card is already there, the player turns it face up; if the revealed card is a tool card, then both the new card and the tool card are discarded. When cards are played on the farmhouse where one (or both) of the figures stands, that figure is moved &mdash; clockwise for Daly, counterclockwise for Farmer Papa. The game ends when one of the figures reaches its starting farmhouse or when all players have played all of their cards.&#10;&#10;Fruit tokens are then awarded in order of the players' total strength on each farmhouse: the strongest player takes the fruit token with the highest Yum-yum value, the second-strongest player takes the next highest-valued token, and so on. Any remaining fruit tokens go to the strongest player. Daly is scored as a fruit token of value 10 while Farmer Papa kicks everyone out of the farmhouse where he stands at the end of the game empty-handed. The player with the highest Yum-yum value total wins!&#10;&#10;Earlier versions of Fruit Spy were titled Dead Man's Treasure, with players fighting for treasure chests in exactly the same manner as Fruit Spy.&#10;&#10;",
        "artist": "Design Edge,Tomasz Jedruszek,Ricky Ru,Arthur Wagner"
    },
    {
        "name": "Up And Down",
        "description": "The exciting mole search.&#10;&#10;Where are the cheeky moles hiding? In pairs, they dig hither and yon through the grass, peek out of their holes and then disappear again. To pull the right moles out of their holes, the players carefully note the different mole colors. Then they can collect many task cards and collect the most shovels.&#10;&#10;Thematically similar to The Mole in the Hole.&#10;&#10;",
        "artist": "Walter Pepperle"
    },
    {
        "name": "Labyrinth Treasure Hunt",
        "description": "Part of the Ravensburger Labyrinth Games series.&#10;&#10;Simultaneously through the labyrinth - the speed game.&#10;&#10;All players speed through the labyrinth with the eyes at the same time. Which paths will lead to the treasure? And which are dead ends? On your treasures - ready, set, go!&#10;&#10;",
        "artist": "Becker Studios,Joachim Krause"
    },
    {
        "name": "Target Arnhem: Across 6 Bridges",
        "description": "International Game Series game from Multi-Man Publishing.&#10;&#10;Target Arnhem is a Japanese wargame that simulates the battle of Arnhem in 1944. It was published in Old Game Journal Magazine #43.&#10;&#10;This game is currently being published by Multi-Man Publishing under the title Target Arnhem: Across 6 Bridges, and was distributed free at Origins 2005.&#10;&#10;",
        "artist": "Nicolás Eskubi"
    },
    {
        "name": "König Salomons Schatzkammer",
        "description": "From The GameWire's Preview on the Spielemesse in N&uuml;rnberg:&#10;&#10;&quot;Titled 'Moria', this game won author Alessandro Saragosa 2nd place in the 2004 Premio Archimede game design competition. The Venice Connection team edited the game into production-ready form, and it is now being released as K&ouml;nig Salomons Schatzkammer (King Solomon's Mine).&quot;&#10;&#10;A description of the game from Spielbox:&#10;&#10;The game is set in an as-yet undiscovered archaeological dig location in the south of Sudan. Here, a research team stumbles upon unimaginable riches, but also magic objects and curses. The archaeological finds lie next to and above each other within the dig site. Digging cards determine where digging may be carried out - naturally the digging starts at the top and works down. Finds can be exchanged for profit immediately or used as protection against curses. The most successful treasure hunter is the winner.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Gracias",
        "description": "The deck contains 6 kinds of cards.  On each turn a player will take a stack of 3 cards (1 hidden and 2 visible) and keep one hidden and one visible card.  The second visible card will be given to another player.  At the end of the round, the player with the largest stack of cards in each color will not score points for those cards, while all other players will score points for those cards.&#10;&#10;",
        "artist": "Sebastian Coenen"
    },
    {
        "name": "Modern Battles: Four Contemporary Conflicts",
        "description": "The &quot;Modern Battles Quadrigame&quot; consists of four completely separate games, each with its own 17&quot; x 22&quot;, three-color map, unit counters and Exclusive Rules.  The Standard Rules are common to all four games.&#10;&#10;Game scale is one mile per hex and 12 hours per game turn.  Unit sizes range from battalion to Brigade.  Design is a simple IGO-UGO sequence of play utilizing rigid Zones of Control and a differential based CRT.  Artillery units can participate in combat from non-adjacent hexes in attack and defense.&#10;&#10;The games included in this quad are:&#10;&#10;&#10;    Chinese Farm - covers the combat between the Israeli and Egyptian force around the Suez Canal, during the latter half of the Yom Kippur War, October 15 to 21, 1973.&#10;&#10;&#10;&#10;    Wurzburg - (Hypothetical) A vital communications center, dominating the route of Soviet invasion into West Germany, which would be the site of a clash between Soviet Mechanized Rifle Divisions and the American Third Mechanized Infantry Division.&#10;&#10;&#10;&#10;    Golan - On October 5, 1973, the Syrians launched an offensive with the objective of driving the Israelis off the Golan Heights.  They came close to success, but were eventually hammered back to the outskirts of Damascus.&#10;&#10;&#10;&#10;    Mukden - (Hypothetical) Mukden is a great industrial center which lies at the edge of the vast Manchurian plain.  It would be a vital objective in a Soviet invasion, and would be hotly contested as the first threatened Chinese city.&#10;&#10;&#10;A follow up set of four new games was later published as Modern Battles II: Four Contemporary Conflicts.&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "Modern Battles II: Four Contemporary Conflicts",
        "description": "The &quot;Modern Battles II&quot; Quadrigame consists of four contemporary games.  These games are completely new and individual and are sold separately and as a complete set.&#10;&#10;The games included in this Quadrigame are:&#10;&#10;&#10;    Bundeswehr - Northern Germany, late 1970's (Hypothetical)&#10;&#10;&#10;&#10;    Yugoslavia - The battles for Zagreb, 1979  (Hypothetical, but eerily prescient of a civil war between the Serbs and the Croats.)&#10;&#10;&#10;&#10;    Battle for Jerusalem - a fierce and bloody battle fought between Israeli and Jordanian forces during the Six Day war of 1967.&#10;&#10;&#10;&#10;    DMZ - The Battle for South Korea, late 1970s  (Hypothetical)&#10;&#10;&#10;The game mechanics used in this series are similar to those found in other Quadrigames. The Standard Rules are identical to those used in the first Modern Battles (Quad).  In this new series the same scale is used (one mile per hex and 12 hours a turn). Units range in size from companies to brigades.  Artillery units have the ability to add to the defensive strength of friendly units being attacked. Artillery has various ranges, some in excess of ten hexes.&#10;&#10;Also included (in various games) are rules for Untried units, special river conditions, other special terrain, airpower, ammuniton depletion, B-52 and B-1 bomber attacks, commandos, paratroopers, stacking, garrison units, bridge destruction, militia, artillery suppression, command control, helicopters, replacements and international cooperation.&#10;&#10;Movement is sequential and single-phased. Zones of Control are rigid, and combat is mandatory between adjacent units. The Combat Results Tables (there are two, representing different doctrines) use a differential system.  The &quot;Active Combat Results Table&quot; is very bloody, with a large possibility of exchange and elimination, even at low odds. The other table, the &quot;Mobile Combat Results Table&quot; is a bloodless CRT, offering mostly retreat results.&#10;&#10;Terrain varies from flat, open plains to some of the most rugged in the world. The terrain effects on combat are taken into account by a system whereby the combat differential is actually altered (column sifts) by the terrain the defending unit occupies.&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "War II",
        "description": "War II is a new implementation of War, the Brazilian Risk-like game. Received expanded rules, that includes air strikes, new missions...&#10;&#10;Re-implements:&#10;&#10;    War&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Sword and Sail",
        "description": "Downloadable free games:  Big Little games is now a subsidiary of JasterMedia.com&#10;&#10;Game Background&#10;It's the dawn of a new era, new lands are waiting to be explored... armies are growing in power by constructing ships... small tribes are now becoming empires.  Who will be the first to succeed where someday others will follow?&#10;&#10;The object of the game is to be the first to control an entire empire by having your armies or navies (the small tokens) on every region of an empire.  Armies and navies are placed on the game board by playing action cards.&#10;&#10;Beautiful full color map and components are ready to download.&#10;Donations are accepted.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Carcassonne: The Discovery",
        "description": "The Discovery is a stand-alone Carcassonne game.&#10;&#10;The inhabitants of Carcassonne have discovered a new region far away from their homeland - one that consists of meadows, mountains and seas. The followers, of which each player only has four (with a fifth for the scoring track) get placed as robbers (in the mountains), seafarers (on the seas) or explorers (on the meadows). On a player's turn, they must place a tile and may then place a follower on it.&#10;&#10;As in the original game, tiles may only be placed so that identical landscape types match up. A follower may only be placed when no other follower has been placed there yet. When the follower is removed, however, then the size of the region in which the follower is located brings points - regardless of whether the region has been closed off or not, although closed off regions score considerably more points. There's also an additional rule that lets mountainous regions increase in value, even if they've already been completed.&#10;&#10;This is a distinctly simpler version of Carcassonne than the original. This was the goal during the development of the game. It should have simpler rules, but offer greater strategic depth. What is interesting about the game is that regions aren't scored automatically any more (when they are closed off), this is a decision left to the player (the removing of the follower). Since the regions can only get more valuable, this ensures many agonizing decisions.&#10;&#10;(From Gamewire and Spielbox)&#10;&#10;This game is part of the Carcassonne series.&#10;&#10;",
        "artist": "Stefano Mondini,Fabio Visintin"
    },
    {
        "name": "Gone Fishing!",
        "description": "Who is the best angler?&#10;&#10;One player takes the role of the two anglers and tries to catch as many fish as possible. The other player takes the role of the fish and with bluff and skill tries to hinder the anglers from catching fish. The angler player decides where to fish, but must do so in the dark (that is, he cannot really see where the fish are), as the fish cards are placed face down. Because of this, he does not know whether he is catching a fish or garbage. Also, when he is lucky enough to catch a fish, he will not know until he lands it how valuable it is. With clever movement of his fish, the fish player tries to get garbage and small fish onto the anglers hooks.&#10;&#10;After one game, the players switch roles. After two games, the player with the most points is the winner.&#10;&#10;Gone Fishing! is part of the Kosmos two-player series.&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Montanara",
        "description": "Montanara is a tactical 2-player card game in which dwarves search for crystals in the heart of the mountains. The rock cliffs determine where it is the most fruitful to dig.&#10;&#10;Re-implements:&#10;&#10;    Tracer 2&#10;&#10;&#10;&#10;&#10;",
        "artist": "Guido Hoffmann"
    },
    {
        "name": "Trans Europa",
        "description": "Now it is time to go railroading in Europa. Just like TransAmerica, players work together building a railroad network, but this time it is across Europe instead of the United States. The first to have their five cities connected wins the round - the others lose points for being too slow! After 3-4 rounds, the player with the most points wins the game!&#10;&#10;The Lufthansa branded version of this game is called Fly Europe&#10;&#10;TransEuropa+ includes Vexation.&#10;&#10;Re-implements:&#10;&#10;    TransAmerica&#10;&#10;&#10;&#10;&#10;Expanded by:&#10;&#10;    Vexation&#10;&#10;&#10;&#10;&#10;",
        "artist": "Ossi Hiekkala,Claus Stephan"
    },
    {
        "name": "No Trumpets No Drums",
        "description": "Issued with The Wargamer Magazine #22.&#10;&#10;Campaign game (The War In Vietnam 1965 - 1975), plus the following 6 scenarios of the Vietnam War:&#10;&#10;1968: Tet Offensive&#10;1975: The End&#10;1972: The Easter Offensive&#10;1965-1968: The American Build-Up&#10;Peace With Honour (1969-1972)&#10;The Vietnam War: 1973-1975&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Bonnie and Clyde",
        "description": "Number 5 in the Mystery Rummy series&#10;&#10;Welcome to the 5th in a series of Mystery Rummy games, all created by Mike Fitzgerald!&#10;&#10;Bonnie Parker and Clyde Barrow were notorious outlaws who robbed banks throughout the central United States between 1931 and 1935. Their exploits and charisma made them famous, and their story has been made into books and movies. Ted Hinton was the FBI agent charged with capturing them.&#10;&#10;You are an FBI agent competing against other agents to see who can catch Bonnie and Clyde. The object of the game is to be the first to score 100 or more points.&#10;&#10;There are two types of cards used in this game: Evidence (Location) cards and the Ted Hinton card. The game is played like the classic Rummy card game, with players playing melds and layoffs of Evidence cards to score points. The Ted Hinton card adds a strategic element to the game not found in traditional Rummy. After each hand, you total your points, and if no one has 100 or more points, you play another hand.&#10;&#10;",
        "artist": "Martin Hoffmann,Claus Stephan"
    },
    {
        "name": "The Difference Between Women & Men",
        "description": "Fun about stereotypes and truths.&#10;&#10;&quot;Why men lie and woman always buy shoes&quot; - Who doesn't know these stereotypes? In this party game, the players note their Top-5 on a specific man-and-woman theme. This theme is either determined through a random card or made up by the players (with a picture as inspiration).&#10;The items on Top-5's of the players are compared. Items that appear on the lists of several players are worth victory points. Therefore, while playing the game, you should try to expect what other players will put on their Top-5 list. What can women do better than men? What do men always have in the refrigerator? During scoring, fun surprises are guaranteed.&#10;&#10;",
        "artist": "Bernd Wagenfeld"
    },
    {
        "name": "Hula Hippos",
        "description": "In Maus nach Haus, the members of a mice family race to jump into the mouse hole before the other families can &ndash; but they're stymied in their efforts by a mouse hole that never stands still! Each round, one player spins a wooden ring, making it rotate on the table; before the ring slows and falls to the table, players simultaneously flick their mice tokens with their fingers to try to place them inside the &quot;mouse hole&quot; when it lands. Any mouse in the ring is removed from the game, and the first player to bring all his mice home wins.&#10;&#10;Hula Hippos features the same game play as Maus nach Haus, but this time players have circus hippos that they're encouraging to leap through the hoop. The first player to be hippoless wins.&#10;&#10;",
        "artist": "Monika Broeske,Dave Clegg"
    },
    {
        "name": "Funny Friends",
        "description": "Each player plays a character who starts the game as a teenager and then must choose the cards that will make his life take shape. He can repeat a school year and get new friends, start smoking, take part in a Bible discussion group and have his first sexual intercourse during Oktoberfest &ndash; all very realistic. Every event in the life of a character has some effect on his main characteristics - tobacco addiction, alcohol addiction, drug addiction, wealth, health, sadness, spirituality and wisdom. Excess comes at a price, though, and when a characteristic gets too high, it cancels another one &ndash; if you smoke too much, you get thin; if you get too fat, you must stop drinking; if you drink too much you lose your wisdom, and so on &ndash; once more, very realistic. During game, you can get friends, and often more, with other player&rsquo;s characters. This is an important feature in the game, since what happens to you usually affects, in good or bad, your friends, and this is one of the main interaction aspects of the game.&#10;&#10;Description from Bruno Faidutti's ideal game library.&#10;&#10;",
        "artist": "Lars-Arne \"Maura\" Kalusky"
    },
    {
        "name": "Das Kleine Gespenst",
        "description": "Kai Haferkamp is developing into a specialist in converting children's literature into games. After 'The Little Prince' comes this year's The Little Ghost, based on the book by Otfried Preussler. The game picks up the storyline about the players, on the stroke of midnight, spending the witching hour flitting through the dark halls of Castle Eulenstein with the little ghost. Whenever the great clock in the city hall marks the passing of another hour, a picture shows up in one of the viewing windows. Whatever is shown on the picture is what the children must now find behind the closed doors of the castle. They accomplish this with the help of a mysterious magnetic set of keys that, as if through the hand of a ghost, opens the doors of the old castle. For each correctly-opened door one receives a gleaming cannonball. How many of these balls will be required for victory is decided only by the final dexterity game in the knight's hall.&#10;&#10;Ages 5 and up&#10;&#10;",
        "artist": "Bluguy,F. J. Tripp"
    },
    {
        "name": "Techno Witches",
        "description": "Heinrich Glumpler is well-known for his original game ideas. With Zauberstauber (Magic Duster), he's tackled witches - but not the kind of witches that are known to most, that is, wrinkled old crones that fly about on dusty broomsticks. His new generation of witches are totally hip and savvy, and they use high-tech vacuum cleaners to take to the skies - those would be the Magic Dusters. The complicated magical duster technology makes special demands of its pilots. In the good old days, you could simply sit on your broomstick and fly off. But now, the flight pattern of the duster must first be properly programmed into the machine. No surprise then, that witches who aren't yet completely familiar with the new technology often end up on the wrong track while programming their flight routes.&#10;&#10;",
        "artist": "Michael Menzel,Anke Pohl,Thilo Rick"
    },
    {
        "name": "3D Tic Tac Toe",
        "description": "Trimula appears to be an implementation of 3D Noughts and Crosses. It looks from the box that it was released sometime in the early 70s. The contents consists of a clear plastic 3D game board which can be assembled and disassembled at will, and a more than adequate number of large glass marbles in two colours. However whilst it is a game in a 3 x 3 x 3 matrix, it has very different win conditions to Tic Tac Toe in that the player with the most row of 3, when the pawns are all played, wins.&#10;&#10;There are a number of other such games where the players use 3 boards arranged to yield 27 playing positions.&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "Blokus Duo",
        "description": "Travel Blokus is the smaller, 2-player verson of Blokus. It is an abstract strategy game with transparent, tetris-shaped, colored pieces that players are trying to play onto the board. The only caveat to placing a piece is that it may not lie adjacent to your other pieces, but instead must be placed touching at least one corner of your pieces already on the board.&#10;&#10;The tiles in the Blokus To Go version are made with square holes cut into them that allow them to be snapped onto square-shaped &quot;nubs&quot; on the playing field. There are also two storage trays that hold the tiles for travel. These trays cover the board when the game is not being played and fold open in order for players to access the tiles.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Hasch mich!",
        "description": "One player becomes the cat, while the others are mice. The cat rolls a die with six different colors on it, and then attempts to catch the corresponding player's mouse with a little wooden cup. (In order to avoid smooshing of little fingers, each mouse is connected to a cord!)&#10;&#10;Similar to:&#10;&#10;    3 Blind Mice&#10;    Carla Cat&#10;    Nopea veto&#10;&#10;&#10;&#10;&#10;",
        "artist": "Martina Leykamm"
    },
    {
        "name": "Monstertorte",
        "description": "The monster bakers are hard at work in the kitchen &ndash; but to be honest, they're all terrible bakers, filled more with enthusiasm and drive than baking talent. Thus, you need to help them assemble the ingredients they need in order to complete the cakes on order!&#10;&#10;To set up Monstertorte, place all of the ingredients &ndash; wooden balls in six colors - in the mixing bowl, that is, the box bottom. On a turn, one player reveals a cake card, then all the assistant chefs use their wooden spoons to scoop out the proper ingredients and assemble them in their individual bowl. The first player to do this wins the card, and the first player to collect five cards wins.&#10;&#10;",
        "artist": "Jutta Neundorfer,Felix Scheinberger"
    },
    {
        "name": "General Quarters",
        "description": "These two rulebooks contain the original General Quarters rules for naval miniatures.  Although first published in the 1970s, their realistic and elegant game mechanics are still usable today.  Somewhat counterintuitively, GQI covers World War 2, and GQII covers World War I (plus some optional enhancements for World War II).  May be used with any scale naval miniatures.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Dungeoneer: Dragons of the Forsaken Desert",
        "description": "This is the fifth Dungeoneer game, a wilderness set with a desert theme.&#10;&#10;From The Publisher's press release:&#10;&#10;&quot;Long ago the sorcery of the Eldritch Lords transformed fertile plains into a desolate waste. Now the crumbling ruins of a great civilization litter the landscape, and only the remnants of the people known as the Drakan survive the harsh desert. But the mighty Dragon King has summoned legions of his kind and their lizard-men minions to lay claim to the desert. Can you defend the villages of the Drakan and defeat the vile dragon horde?&#10;&#10;&quot;Dragons of the Forsaken Desert is a two- to four-player Dungeoneer card game. Your character explores a wilderness that you build with map cards, while fighting monsters, completing quests, and leveling up along the way. Each Dungeoneer set can be played as a stand-alone card game, or combined with other decks for more dungeon-delving fun. Dragons of the Forsaken Desert features 110 new Dungeoneer cards, including dragon-themed monsters and Six new heroes for your Dungeoneer game: Arcanist, Barbarian, Cleric,&#10;Defiler, Dragonslayer, Priestess.&quot;&#10;&#10;Part of the Dungeoneer Series.&#10;&#10;",
        "artist": "Thomas Denmark"
    },
    {
        "name": "POG The Game",
        "description": "POG The Game is based on the early 90's craze that had its origins at the Haleakala Dairy in Maui, Hawaii.  Back then the 'milkcaps' from the Dairy bottles were used, but thanks to companies like the now nonexistent World POG Federation, the simple game became an overnight fad that spawned an entire industry for years.&#10;&#10;The game basically consists of taking a slammer and slamming it down onto a stack of Pogs that are stacked on a mat.  You do this until either your or your opponent's Pogs have all been flipped over.  There are variations to the rules, but these are the basics of it.&#10;&#10;The game is simple and rather fun.  POG The Game is a nice packaging of the game, with all the components needed to play it according to World POG Federation rules and with their official merchandise.&#10;&#10;Reimplements: Pogs&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Roma",
        "description": "Rome is in a state of emergency, the Senate and the Guard are embroiled in fierce arguments, the people are divided. Many roads lead to Rome, whether you decide to use powerful cards such as the Tower and the Praetorian Guard to protect the power and victory points you have, or instead prefer to use the Consul and the Tribune to skilfully pull the strings behind the scenes. Whoever succeeds in using their connections and manages to play their cards cleverly will at the end deserve their victor's laurels.&#10;&#10;Roma features unique card and dice play.  Players place cards at &quot;dice stations&quot; numbered 1-6.  The player uses dice rolled each turn to activate dice stations to use the card that has been placed at a station.  Card effects guide your tactical actions in the game through manipulating cards in play, providing money or granting victory points.&#10;&#10;In each game of Roma, there are a fixed amount of victory points in play, once all victory points have been collected, the player who has the most victory points wins the game.&#10;&#10;Can be combined with its sequel game, Arena: Roma II, with varying play options.&#10;&#10;Integrates with:&#10;&#10;&#10;     Arena: Roma II&#10;&#10;&#10;",
        "artist": "Michael Menzel"
    },
    {
        "name": "Rat Hot",
        "description": "Two spice dealers share a storehouse with a number of hungry rats, who want to put them out of business.  The two dealers want to store spices so that they know where everything is, but they also have to keep the rats at bay.  Stack your crates, keep your spices together, and cover up the rats.&#10;&#10;&#10;Rat Hot is a two-player game developed from Michael Schacht's Dschunke: Das Legespiel on his own label Spiel aus Timbuktu, which in turn was developed from his game Dschunke, also published by Queen. The Rat Hot tile distribution differs slightly from Dschunke: das Legespiel but you can very nearly use the Dschunke: das Legespiel rules with a Rat Hot set.&#10;&#10;All the games use the clever mechanism of stacking long 3x1 tiles so that the upper tiles obscure some parts of the tiles underneath. In Rat Hot, the two players simply take turns to draw 2 tiles from a face down pile, and add them to the existing layout.&#10;&#10;The tiles are all 1x3 and show a combination of rats, spices or empty crates. Each player has four different types of spice in their player colour which they are trying to form into large groups. Many of the tiles have spices of both colours.&#10;&#10;The game is scored with grey and yellow chips which represent 1 and 2 points. Each time you place a tile, you and your opponent can score points from groups created or changed by that tile. Whenever a group of two of the same spice is formed, the owning player receives one point, or two points for groups of three or more. Beware! If there are three rats of your own colour visible at the end of your turn, you instantly lose.&#10;&#10;When the draw pile is exhausted and the tiles all placed, the board is scored once more for all players, so trying to preserve existing groups also counts.&#10;&#10;The real trick in the game comes in the tile placement. Tiles must be adjacent by at least one square. Tiles can placed on top of other tiles, so that stacks build up. But a tile can not sit exactly on top of another, so there must always be some offset, and all three squares of a tile must be supported by other tiles, or the table.&#10;&#10;Rat Hot can be very tricky. You want to keep your opponent's rats exposed in awkward places, so they have to spend both their moves trying to keep the rats covered. But you also want to set up scoring positions, and cover your own rats, and avoid giving your opponent points as well. There's a good mental challenge here, as you puzzle over the best use and arrangement of your tiles. Do you dare leave two of your rats open, because your opponent may draw more of your rats and make it impossible for you to finish your next turn with less than three showing. Can you get a good group of spices going and also break up your opponent's groups? Tricky problems for tricky minds.&#10;&#10;Rat Hot is a quick, fun game and is a good addition to Queen's line of small 2-player games. The wood chips make it easy to see who is leading, the tiles are nicely made, the graphics are fun, and the game plays quickly and fairly. You can be stuffed by unlucky tile draws, but perhaps your low score is more to do with your choices, or maybe the other player is just smarter than you. Fast play, easy rules, and the risk of sudden death give Rat Hot a high replay value.&#10;&#10;",
        "artist": "Jörg Asselborn,Hans-Jörg Brehm,Michael Schacht,Christof Tisch"
    },
    {
        "name": "Inka",
        "description": "A Queen game by Harald Lieske.  Explore the labyrinth in search of gold.&#10;&#10;Players move around a room with sliding floor tiles, trying to collect 3 treasures at the center first. The board has a pattern of triangles, some are solid floor, the rest is empty space across which you cannot walk. Players start by laying floor tiles on the board. These tiles are rhomboid (diamond-shaped) and have snakes and walls to make things tricky.&#10;&#10;On your turn, you may spend 3 action points sliding tiles, rotating tiles, walking over snakes, or teleporting, all in an attempt to reach the treasures at the center. Each player also has a blocking marker they can place at turn end which prevents movement. First player to pick their three treasures up and get back to the doors wins.&#10;&#10;",
        "artist": "Harald Lieske"
    },
    {
        "name": "Architekton",
        "description": "A tile laying game somewhat like Carcassonne / Fjorde where you are placing landscape tiles to gain points.&#10;&#10;Tiles are laid out in an alternating pattern, kind of like a chess board. Tiles alternate between building tiles on one diagonal and landscape tiles on the other. As soon as a building with your house is surrounded, you get 1 point if all the landscapes match, but you lose 1, 2, or 3 points if 1, 2, or 3 of the surrounding landscapes do not match. You can remove your house to reduce this loss, but at the end of the game, you get 1 point per house on your longest diagonal group of houses.&#10;&#10;Reimplementation of:&#10;&#10;    Contra&#10;&#10;&#10;&#10;&#10;(With different rules.)&#10;&#10;",
        "artist": "Michael Menzel"
    },
    {
        "name": "Highland Clans",
        "description": "Take charge of your clan from the Scottish high country. In each round, a player first builds up his clan and landholdings, and then optionally conducts a raid on an opponent.&#10;&#10;You start by pulling six cubes from a bag. With green cubes you increase your ministers and potential to gain VPs at the end of a round. Yellow cubes attract warriors and permit you to hold more battle cards. The blue cubes are &quot;pipers&quot; used for combat support or possible VP generation. A blue cube can also be played as a &quot;bard&quot; to lure away opponents' followers. Finally, there are the red cubes, which represent cattle and generate VPs. You also use cubes to create new estates, where you can deposit cattle and groups of cubes (which are safer than those not on an estate).&#10;&#10;Raids are resolved simply. In three battle-rounds a card of value one to four is played by the two opponents; this value can be increased by a single blue cube. The one who wins the most battle-rounds wins the fight. The loser will then lose cubes while the victor gains a VP or two.&#10;&#10;After each round there is a valuation, in which the VPs are determined based on number of cubes. For example, the player with the most green cubes gets 3 VPs, while second most gets 2 VPs; if two players are tied for most, each gets only 1 VP. Another example: each red cattle tile is worth a VP, but if one player has the most he gets a 2 VP bonus.&#10;&#10;The estate tiles contain a number on the back. After each round a panel is turned. If the leading player has at least as many points as the number of the tile, the game ends.&#10;&#10;Bottom line: a fast game offering something for everyone: luck, tactics, and lots of interaction with your fellow players.&#10;&#10;",
        "artist": "Hans-Jörg Brehm"
    },
    {
        "name": "Domination",
        "description": "From the publisher's press release (the game is scheduled to be introduced at The American International Toy Fair in New York City, February 17-23, 2005, and should be in stores by June 2005.&#10;&#10;You&rsquo;ve never played Dominoes like this before ... it&rsquo;s strategic, challenging and suspenseful, while at the same time, classic in its simplicity. Play dominoes on their corresponding spaces on the game board. As you complete squares, you conquer territories and claim them as your own. Dominate the game board and you win! For ages 8 and up.&#10;&#10;From a review in &quot;Games Quarterly&quot;, Winter 2005:&#10;&#10;The Domination board is a seven-by-seven grid of squares with sets of numbers that resemble half a domino at each corner. Each player starts with seven dominoes. When it's your turn, you lay down a domino along one edge of a square so that the numbers on both corners match your domino. Then you draw another domino.&#10;&#10;If your play closes off the fourth side of a square, you put a poker chip in the center of that square to claim it. You keep playing until all the dominoes are used, which fills up the entire board. At that point, the player with the most chips on the board wins the game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Advanced Tobruk System Basic Game 1a: Screaming Eagles",
        "description": "A new Basic Game to replace the Basic Infantry Game that quickly went out of print.  This one feature four scenarios covering action in Normandy involving the 101st Airborne Division.  There is a new Basic Game map for this game as well as complete Basic Game rules.  Several scenarios have two versions, one for those who only own this game and another that provides extra units (tanks, jeeps, MGs) for owners of Against All Odds.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "UNO: H2O",
        "description": "From the publisher:&#10;&#10;Ever played UNO underwater? Now you can, with UNO H20. Waterproof cards and carrying case let you take this easy, fast-paced family game to the pool, beach or anyplace that's wet.&#10;&#10;For 2 to 10 players, Ages 7 and up&#10;&#10;--&#10;&#10;UNO H20 includes two new cards: Wild Downpour 1 and Wild Downpour 2. When played, all other players must draw 1 or 2 cards, respectively. The player of the card also determines the new color.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Tumblin-Dice",
        "description": "A dexterity dice game consisting of four sets of colored dice one either slides, rolls, or flicks down a stepped surface. Usually one slides the die for better accuracy.  After each person has slid their 4 dice, points are scored.  You score the die roll times a multiplier of either 1&times;, 2&times;, 3&times;, or 4&times; depending on which area of the board the die is on.  (Dice which land in the 0&times; region are immediately removed from play.)  High scoring rolls are targets for opponents.  Four rounds are played and the player with the most points win.&#10;&#10;Tumblin-Dice Jr. is the &quot;travel&quot; version.&#10;&#10;The 2008 edition from Ferti Games states is for 2-6 players.&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "Mall of Horror",
        "description": "&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Back of the Box&#10;&#10;In Mall of Horror, each player takes control of three character: a blonde, a bad boy and a brute, trapped in a mall invaded by hundreds of hungry zombies. There is only one way to survive: find a temporary safety in areas where the zombies aren't yet, and forget about values such as solidarity and humanity. Better them than you!&#10;&#10;Who will be thrown at the zombies for the survival of the rest of the gang? Who will take over the security H.Q.? who will look for some first aid material? No room for the weak, you will negotiate, lie, ally, betray, in one word, you will try to survive!&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Overview&#10;&#10;The goal is not to kill the greatest number of zombies but simply to survive. You must flee from place to place while zombies try to devour the inhabitants of the mall.&#10;&#10;Each player controls 3 characters, each with a different ability and worth a certain number of points at the end of the game if they survive.&#10;&#10;Each place in the mall has different characteristics. They may contain varying numbers of characters and may give some bonus items which will help your survival. When enough zombies arrive at a location, the players there must vote for who will get eaten. Players may also vote for who will become the new chief of security and who will search the van with its valuable goods, giving players a chance to negotiate and strike up deals, perhaps even making good on them.&#10;&#10;",
        "artist": "Aleksi Briclot,Ben Carre"
    },
    {
        "name": "Second World War at Sea: Strike South",
        "description": "&quot;Strike South&quot; is a &quot;Second World War at Sea&quot;-series game based on the Japanese efforts in early World War 2 to seize the rich assets of the Dutch East Indies. There are 140 &ldquo;long&rdquo; playing pieces, depicting the major fleet units of both sides: battleships, aircraft carriers, cruisers and fleet destroyers. There are also 280 square playing pieces, half the size of the ship pieces, mostly depicting aircraft but also smaller warships and markers.&#10;&#10;The game comes with two operational maps, covering the South China Sea and the East Indies, and these maps overlap with the maps in the &quot;Eastern Fleet&quot; product.&#10;&#10;As with all &quot;Great War at Sea&quot;/&quot;Second World War at Sea&quot; games, the tactical map is a generic field of blue hexagons that ships and aircraft move to when fleets meet on the operational maps.  Combat is simple - roll 1d6 for every 'factor' the ship has, with a result of '6' equaling a hit.  Compare the weapon that hit (primary gun, secondary gun, tertiary gun, torpedo, or bomb) vs the armor of the area hit to determine if penetration occurred.  If it did, mark off a damage box.&#10;&#10;&quot;Strike South&quot; includes 15 scenarios, of which 8 of these are limited &quot;Battle Scenarios&quot;, that just use the tactical map.  The larger 'Operational Scenarios' can take some time to play out - sometimes a whole evening, although Avalanche Press tries to focus them on a 2-hr timeframe - and include such actions as the last mission of the British Battleship Prince of Wales, the Battle of the Java Sea, the Battle of Sunda Strait, and the Japanese invasion of the Philipines.&#10;&#10;Strike South includes: &#10;&#10;     Two 32&quot;x22&quot; strategic maps &#10;     11&quot;x17&quot; tactical map &#10;     420 game pieces &#10;     12-page rulebook &#10;     12-page scenario book &#10;     2 player aid cards &#10;     1 organizational card &#10;&#10;&#10;&#10;&#10;",
        "artist": "Shannon Brown,Terry Moore Strickland"
    },
    {
        "name": "Panzer Grenadier: Eastern Front",
        "description": "&quot;Eastern Front&quot; is a reprint of the original &quot;Panzer Grenadier&quot; game by Avalanche Press.  However, it's much more than just a reprint, with the game expanded noticeably and a new revision of the rules, taking lessons learned throughout the series.  Art has also seen a major update, along with a number of other improvements:&#10;&#10;&#10;     The new maps will use the style Terry Moore Strickland showed so well with Beyond Normandy. &#10;&#10;&#10;&#10;     There&rsquo;s twice as much playing area from which to choose, as there has been a move from four to eight maps&#10;&#10;&#10;&#10;      In addition to infantry, the Germans also now have two full squadrons of cavalry. &#10;&#10;&#10;&#10;     A new concept is added for the first time to the series, the vehicles known as prime movers. These are tracked or semi-tracked vehicles like the Soviet Komsomolets or the German SdKfz-7. They have better performance off the road than the game&rsquo;s standard trucks, but cannot carry infantry. &#10;&#10;&#10;&#10;     The Soviets received a much greater overhaul than the Germans. New artillery pieces include the 107 mm cannon and 76.2 mm mountain gun. A new &ldquo;mixed&rdquo; type of infantry is available, anti-tank rifle platoons. There are two new flavors of armored car: the FAI and Ba6 in addition to the Ba10m found in the first edition. The stable of tanks is vast.&#10;&#10;&#10;&#10;     The Romanian army is now represented&#10;&#10;&#10;&#10;     All 50 scenarios from the original Panzer Grenadier have been included, as well as 62 new scenarios, for a total of 112.&#10;&#10;&#10;This game is part of the Panzer Grenadier series&#10;&#10;Re-implements:&#10;&#10;    Panzer Grenadier: The East Front&#10;&#10;&#10;&#10;&#10;Expanded by:&#10;&#10;    Panzer Grenadier: Arctic Front Deluxe Edition&#10;    Panzer Grenadier: Blue Division&#10;    Panzer Grenadier: Campaigns and Commanders Vol 1 &#226;&#128;&#147; War in the East&#10;    Panzer Grenadier: Edelweiss&#10;    Panzer Grenadier: First Axis&#10;    Panzer Grenadier: Fronte Russo&#10;    Panzer Grenadier: Iron Curtain&#10;    Panzer Grenadier: Iron Wolves&#10;    Panzer Grenadier: March on Leningrad&#10;    Panzer Grenadier: North Wind&#10;    Panzer Grenadier: Red Warriors&#10;    Panzer Grenadier: Siege of Leningrad&#10;    Panzer Grenadier: Sinister Forces&#10;    Panzer Grenadier: South Africa's War&#10;    Panzer Grenadier: War on the Equator&#10;    Panzer Grenadier: White Eagles&#10;&#10;&#10;&#10;&#10;",
        "artist": "Peggy Gordon"
    },
    {
        "name": "Panzer Grenadier: Road to Berlin",
        "description": "A game in the &quot;Panzer Grenader&quot; series, this covers the late-war armored battles with Germany on the defensive.&#10;&#10;From the AP website:&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;&#10;&#10;Road to Berlin is loaded with heavy gear, featuring 825 pieces.&#10;&#10;The Germans get Royal Tiger tanks for the first time in the Panzer Grenadier series, plus giant lumbering vehicles like the Hunting Tiger with its 128mm gun and the Hunting Panther. There are the fast Hetzer tank destroyers, too. Road to Berlin has both regular army and Waffen SS pieces, including SS cavalry. There are also pieces for the German home-defense militia called out in the last days of the Thousand-Year Reich.&#10;&#10;The Red Army of Workers and Peasants is also loaded with powerful weapons: The JS-1 and JS-2 heavy tanks lead the way, but there are also all sorts of vehicles not seen before by Panzer Grenadier fans: T-34/85, T-70 and KV-85 tanks; SU-76, SU-85, SU-100, SU-122, SU-152 and JSU-152 assault guns. There&rsquo;s also 122mm artillery for the first time, and Ba64 armored cars.&#10;&#10;Returning to the Panzer Grenadier system are the Soviet Guards, the elite of the Soviet armed forces. They bring the modern weapons of 1944 and 1945 plus rocket launchers and a full array of ground forces. We first debuted these in Heroes of the Soviet Union, which will be retired when the last copies are sold, but this is a much fuller treatment.&#10;&#10;Just as Eastern Front includes the Armata Romana, so does Road to Berlin bring the Royal Honvedseg, Hungary&rsquo;s army. The Hungarians have excellent cavalry and a number of Hungarian-made armored vehicles that are, well, less than excellent: Turan and Toldi tanks and Nimrod and Zrinyi assault guns.&#10;&#10;As for playing surface, Road to Berlin features eight of the semi-rigid mapboards of the type found in Airborne and Eastern Front. These are new to players of the series, with art by Terry Moore Strickland.&#10;&#10;And as will be true for all games in the series, there are plentiful replay opportunity: 75 scenarios drawn from the battles of 1944 and 1945 on the Eastern Front. &#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;&#10;&#10;This game is part of the Panzer Grenadier series&#10;&#10;Expanded by:&#10;&#10;    Panzer Grenadier: Arctic Front Deluxe Edition&#10;    Panzer Grenadier: Blue Division&#10;    Panzer Grenadier: Campaigns and Commanders Vol 1 &#226;&#128;&#147; War in the East&#10;    Panzer Grenadier: Edelweiss&#10;    Panzer Grenadier: First Axis&#10;    Panzer Grenadier: Fronte Russo&#10;    Panzer Grenadier: Iron Curtain&#10;    Panzer Grenadier: Iron Wolves&#10;    Panzer Grenadier: March on Leningrad&#10;    Panzer Grenadier: North Wind&#10;    Panzer Grenadier: Red Warriors&#10;    Panzer Grenadier: Siege of Leningrad&#10;    Panzer Grenadier: South Africa's War&#10;    Panzer Grenadier: War on the Equator&#10;    Panzer Grenadier: White Eagles&#10;&#10;&#10;&#10;&#10;",
        "artist": "Shannon Brown,Beth Donahue,Peggy Gordon,Susan Robinson"
    },
    {
        "name": "Swipe",
        "description": "Swipe is a specialty dice-rolling game. Each of the game's ten dice are marked with five different symbols - a red circle, a blue square, a red circle with an inscribed &quot;S&quot; (for Swipe), a blue square with an inscribed &quot;S&quot; and a black square with an inscribed &quot;X&quot;. There are two red circles on each die.&#10;&#10;Players (from 2-6) begin with two dice, and two red chips. Remaining dice and chips (of which there are a total of 50) are placed in the center of playing space. Youngest player rolls dice and acts according to symbols, as follows:&#10;&#10;&#10;    Blue Square - take a die from center. &#10;    Blue Square with inscribed &quot;S&quot; - take (Swipe) a die from any opposing player. &#10;    Red circle - take a chip from center. &#10;    Red circle with inscribed &quot;S&quot; - take a chip from any opposing player. &#10;    Black square with inscribed &quot;X&quot; - lose a die to center&#10;&#10;&#10;A special rule is the Super Swipe, where all dice rolled end up as a Black X.  In this case, the player gets to take a die from all opposing players and then takes another turn.&#10;&#10;Winner is the player with most red chips when center pile of chips is completely depleted.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Kaboodl",
        "description": "Kaboodl is played with 103 cards. The object is to collect the 12 'Kaboodl' cards from the centre and have the most at the end of play. Each Kaboodl card has a creature, a background colour and one, two or three dots on it. You can collect a Kaboodl card from the centre by matching colour, creature and dot cards from your hand. Special cards also allow you to steal another players Kaboodl card or stop them from stealing it.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Dividends",
        "description": "From the publisher website :&#10;&quot;Make your fortune on the volatile stock market through stock buying to earn dividend payouts or selling for profits (capital gains). The key to success in this game lies in a player&rsquo;s ability to make the most money from each stock purchase (maximizing return on investment) while taking into consideration the effects of supply and demand on stock prices (market economics). While being the first-mover confers tremendous advantage, exercising major shareholder influence on dividend payouts can perhaps give a player the added edge towards financial victory!&quot;&#10;&#10;",
        "artist": "Eve Brunner"
    },
    {
        "name": "Super Munchkin",
        "description": "&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Publisher's Description&#10;&#10;Fly through the city. Smash the villains. Backstab your teammates and grab their gadgets.&#10;&#10;Munchkin has parodied the classic dungeon, the kung-fu warrior, the space epic, and the creatures of the night. Now, it's the superheroes' turn!&#10;&#10;Be a Mutant, an Exotic, a Mystic, or a Techno. The higher your Level, the more Powers you can have. Battle dastardly masterminds, devastating monsters, and invading aliens from the next dimension - from the wimpy Triplicate Twit all the way up to Big Ol' Planet Eater Guy himself - and TAKE THEIR STUFF! With the Aura Helmet, the Telezapinator, and the (jet-powered) Pogo Stick, no foe can stand before you.&#10;&#10;Super Munchkin is a stand-alone game, which (of course) can be combined with other Munchkin games. Designed by Steve Jackson (I) and illustrated by John Kovalic, this one is destined to RULE THE WORLD! Mwahahaha!&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Other&#10;&#10;Part of the Munchkin series&#10;&#10;Munchkin is a satirical card game based on the clich&eacute;s and oddities of Dungeons and Dragons and other role-playing games. Each player starts at level 1 and the winner is the first player to reach level 10. Players can acquire familiar D&amp;D style character classes during the game which determine to some extent the cards they can play.&#10;&#10;There are two types of cards - treasure and encounters. Each turn the current players 'kicks down the door' - drawing an encounter card from the deck. Usually this will involve battling a monster. Monsters have their own levels and players must try and overcome it using the levels, weapons and powers they have acquired during the game or run away. Other players can chose to help the player or hinder by adding extra monsters to the encounter. Defeating a monster will usually result in drawing treasure cards and acquiring levels. Being defeated by a monster results in &quot;bad stuff&quot; which usually involves losing levels and treasure.&#10;&#10;",
        "artist": "Art Baltazar,Steve Jackson (I),John Kovalic,Gabby Ruenes"
    },
    {
        "name": "Gelb gewinnt!",
        "description": "Gelb gewinnt! is based on the Italian game Scopa; Kosmos described it as Scopa in German style.&#10;&#10;The game consists of two deck of cards, each consisting of 10 yellow cards and 30 blue cards, valued 1-10. In addition, 80 victory point chips are included.&#10;&#10;Each round is played as follows: the dealer will deal each player three cards. Four cards are played on the table, open. The players now take turns playing cards. On each turn, a player can play exactly one card. A player can use this card to capture a number of cards on the table. Cards can be captured if the sum of those cards is equal to the card played (i.e. you can capture a six and a two by playing an eight). If a player cannot capture any cards, he has to add a card to those open on the table. A player gets one point for capturing all cards on the table.&#10;&#10;The round lasts until all players have played their three hand cards. Now, each player receives points: One point for the player who has captured the yellow seven, one point for the player who has captured the most yellow cards and one point for the player who has captured the most cards.&#10;&#10;The play continues for a couple of rounds (either six rounds for two or three players, or a number of rounds equal to the number of players if there are four or more players. In the end, the player who has collected the most points wins.&#10;&#10;",
        "artist": "Michaela Kienle"
    },
    {
        "name": "Ubongo",
        "description": "In Ubongo, players compete to solve individual puzzles as quickly as they can to get first crack at the gems on hand for the taking.&#10;&#10;Original edition:&#10;The game board consists of six rows, with twelve gems (of various colors) placed in these rows. At the start of play, each player places his pawn in front of one of those rows. Each player also takes twelve polyominoes &mdash; that is, pieces consisting of 2-5 squares in some configuration; players use these pieces each round to try to recreate shapes.&#10;&#10;At the start of a round, each player receives a puzzle card that depicts a shape created by some number of squares; one side of this card depicts six rows of 3 pieces, the other side depicts six rows of 4 pieces, for a more difficult puzzle. When everyone is ready, someone rolls a die to determine which row of pieces each player can use to recreate the shape on their individual card. The race is timed by a sand timer, and the outcome of this race determines the action on the main playing board.&#10;&#10;Whoever first solves their puzzle in time gets to move their pawn up to three rows left or right, with the second player to finish moving two rows and the third player only one row. Players then collect two gems from the front of the row where their pawn is located, which means that the more rows you can move, the more control you have over which color gems you can collect. After collecting gems, each player receives a new puzzle card, and a new round begins.&#10;&#10;After nine rounds, the game ends and whoever has collected the most gems in a single color wins! If players tie, then those players compare who has the most gems in a second color, and so on.&#10;&#10;2015 edition:&#10;The puzzle-part of the game remains the same, but the scoring track and system has been greatly changed, to be the same as in Ubongo Extreme. There are no pawns anymore, but instead the winner takes a 3-point gem plus a random gem, the second-place player takes a 1-point gem plus a random gem, and others who finish within time take just a random gem. Whoever scores the most gem-points after nine rounds, wins the game.&#10;&#10;",
        "artist": "Nicolas Neubauer"
    },
    {
        "name": "Khet: The Laser Game",
        "description": "Khet (a.k.a. Deflexion) is a chess-like board game that has two built in lasers and movable Egyptian-themed game pieces that have embedded mirrors that can be positioned to bounce the laser light around the board and hit opponent pieces.&#10;&#10;To play, players alternate moving their pieces around the board. Some pieces have mirrors and some do not. Bounding the board is a raised frame into which are built two low-power lasers, one for each player. The game pieces include a &quot;pharaoh&quot;, obelisks, and pyramids with mirrors. After each move, a player must press the button on his/her laser. The beam bounces from mirror to mirror around the playing field. The challenge is to protect one's own pharaoh while maneuvering to &quot;light up&quot; the opposing player's pharaoh.&#10;&#10;Reimplemented by&#10;&#10;    Khet 2.0&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    }
]