[
    {
        "name": "RÖK",
        "description": "Box text: Throughout the ages the mysterious power of the Runes have held man in awe.  With R&Ouml;K you can learn how to harness this power and defeat your rivals!  The secret is in throwing the Runes, concentrate before you release them to experience the pleasure of handling these superb stones..&hellip;then be sure to keep a keen eye and move at lightening speed to emerge the winner!&#10;&#10;R&Ouml;K is a game played in a mythical atmosphere - with bouts of mayhem.&#10;&#10;Contents : 49 runes: 1 Rune of Destiny (with a dot), and 48 runes in three colours, each engraved with a runic symbol (there are 8 pairs of runes per colour) ; 1 bag; Rules of the game.&#10;&#10;Description: Basically all players drop heavy stones with carved runes on the table - then everyone tries to find matching pairs and pick them up as fast as possible - before the others do it. And do not let others pick your very own &quot;home rune&quot; first - the punishment will be really terrible!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Jackal",
        "description": "In Jackal the players take command of pirate bands disembarking on Treasure Island. Each player may move their selected pirate once per round. The players explore the island in search of treasure to load on board their ships, while trying to recapture treasure from each other at the same time. The object of the game is to load more gold onto your ship than any other player.&#10;&#10;The Jackal game board consists of squares with elements for an island map: jungles, gold chests, pointers for movement, crocodiles, forts, bullets, and so on. The board is initially set up in a random order, which means every game is its own unique and interesting adventure.&#10;&#10;Contents: 117 tiles, 4 ship-tiles, 12 pirates, 37 coins, rules&#10;&#10;",
        "artist": "Tatiana Maifat"
    },
    {
        "name": "Mi Tierra",
        "description": "Mi Tierra (My Land) is a worker placement game where the players represent farmers that try to labor their land in the best way possible. They will have to sow and work the land and take care of their animals so they can produce goods and sell them in the different available markets.&#10;&#10;",
        "artist": "Cristián González"
    },
    {
        "name": "Arcane Legions",
        "description": "Description:&#10;In the year 42BCE, a mysterious magical force was unleashed upon an unsuspecting world. The miasmic shockwave of pure otherworldly magic spread outward from a point somewhere in the middle east, and in a few short hours plunged the entire globe into chaos. In those terrible moments, human civilization changed forever. &#10;&#10;Magic infused their very bones, manifested in their children, came unbidden to the fingertips of their women, and plagued their countryside in uncontrolled bursts of power. Ordinary beasts of the wilderness were turned by these bursts into fanciful creatures of legend. Entire tribes of humans from all corners of the world were altered by the flood of uncontrolled magic, changing before the very eyes of their friends and neighbors into elves, dwarves, orcs, trolls, centaurs, and even minotaurs. Creatures that normally existed between our reality and others were shunted into this one, leaving ghosts, faeries, and other magical creatures stranded in our world in ways they were never intended to be. Even remnants of the Old World, gods of the ancients and their ken, were awakened from their immortal slumber through this great cataclysm to trouble mankind once more.&#10;&#10;The world had changed forever.&#10;&#10;The year is now 37BCE and the middle-east sits at the center of a vast struggle to control humanity&rsquo;s fate. Three powerful nations have harnessed the power unleashed by the day of chaos, and they struggle to claim dominance over the known world. Their arcane legions are now yours to control.&#10;&#10;Gameplay:&#10;If you ever wondered what happened to the guys from WizKids just take a look at this game and you will know what they have been doing with the downtime after WizKids closed their doors.&#10;&#10;Players each field &quot;bases&quot; of variable sizes (Sortie/small and Formation/large) with individual figures inserted into starting positions on the base. The goal is to control victory point areas and inflict losses on the opponent. Movement and battle resolution are conducted through a unique formation management mechanic that allows players to move figures around on the unit bases to increase either movement/melee/ranged combat at the cost of losing capabilities in the other areas.&#10;&#10;Currently wrapping up play-testing as of May 2009. Arcane Legions will be available in September of 2009. Initially, look for 3 different factions (Egyptians, Romans, and Han Dynasty).&#10;&#10;Figures are highly detailed true 25mm made from PVC 105. Common figures are unpainted with colored tempo prints on banners and shields, while all the uncommon, rare and Commander figures (Booster Pack contents) are fully pre-painted. The game is designed to use both types. There are 9 different unpainted common figures for each faction and at least 20 different fully painted premium figures for each faction. If you buy a legion bundle of a faction you receive around 70 prepainted figures, whereas buying one of each army pack gets you about 54 unpainted figures.&#10;&#10;With more than 110 figures, the Starter Pack includes small armies for all three factions and enough formation bases, sortie bases and base cards for a complete two player game.  The Army Packs contain 40 common soldiers.  The Cavalry Packs contain 15 mounted figures.  The Booster Packs contain 5-10 (depending on the size) Leader / special figures and their associated base cards, plus five additional formation base cards for use with figures from the Army and Cavalry Packs.&#10;&#10;All Arcane Legions products (with the exception of the Starter) can be purchased faction specific.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Iconica",
        "description": "Set in the fictional world of Rynaga, Iconica is a game that blends turn-based strategy with a twist of chance for a unique card game experience.&#10;&#10;The object of Iconica is to eliminate all of your opponents Character Cards from play. Winning the game is accomplished by dealing damage to a character&rsquo;s Health Meter. Once a character&rsquo;s health is exhausted, it is eliminated from play. Different game elements such as Final Acts, make for exciting turns of events and give players a chance to win, even if victory seems unlikely.&#10;&#10;",
        "artist": "Eric Torres"
    },
    {
        "name": "Lock 'n Load: Heroes of the Gap",
        "description": "From the publisher...&#10;&#10;Heroes of the Gap is a complete Lock &lsquo;n Load module (you need nothing else to play) which brings the Lock &lsquo;n Load system to the environs of Eisenbach, Germany, on the first day of World War III. No, this is NOT a World at War series game, but it does take place in the universe created by World at War. This is pure, impulse-driven, tanks vs. tank, squad vs. squad, leader vs. leader, RPD vs. M60, Lock &lsquo;n Load system gaming.&#10;&#10;You&rsquo;ll command a bucket of 1985-era weaponry on a Marc von Martial-drawn, mounted 22&quot; x 34&quot; historical map of Eisenbach and its immediate surroundings, including Bergengipfel and Klappebruck. Defend West Germany with Abrams tanks, ITOW anti-tank vehicles, Cobra attack helicopters, squads of American soldiers, leaders, snipers, heroes, M60 machine guns, Dragon guided missiles, A-10 attack aircraft, and much more. All rendered with the precision we have all come to expect from David Julien.&#10;&#10;Or, if you chose, attack the capitalists with T-80, T-72, T-64, and T-55 tanks (okay, you won&rsquo;t get far with the T-55s, but we had to include them), Hind helicopters, Soviet infantry, paratroopers, BMPs, and all their accoutrements of war - RPGs, RPKs, RPDs, you are free to do so.&#10;&#10;Included are rules for anti-tank guided missiles (ATGM), which are easily depleted, advanced armor, advanced sights (thermal and night), fixed wing air support, and much more. Yet, despite the new rules, we believe we have held true to our company&rsquo;s mantra of &quot;more game, less guff.&quot;&#10;&#10;Fight nine Mark H. Walker-designed scenarios that recount the first day of the war, from the first probes by Soviet infantry to the ultimate, desperate clash for the Eisenbach Bridge. This is the game for those of you who have wanted to get down on the streets, in the buildings, on the deck of the tanks, and fight the battles of Red Army, Red Storm Rising, Team Yankee, or even World at War: Eisenbach Gap.&#10;&#10;&#10;     A 34&quot; x 22&quot; mounted game map, depicting the city of Eisenbach, the Eisenbach River, and the nearby towns of Klappebruck and Bergengipfel.&#10;&#10;&#10;&#10;     Three sheets of counters, including over 100 vehicles...the most vehicles ever crammed into a Lock 'n Load game box.&#10;&#10;&#10;&#10;     Complete LnL rules, module rules, player aid cards, and nine scenario cards.   &#10;&#10;&#10;&#10;     Dice...always the dice. &#10;&#10;&#10;&#10;     An awesome box that keeps the inside in. Once again... this is a complete, ready to play Lock 'n Load module. You don't need to own anything else, you don't need to know how to play Lock 'n Load. Just stop by the office. We'll teach you.&#10;&#10;&#10;",
        "artist": "Pete Abrams,Kwanchai Moriya,Guillaume Ries,Kiki \"Challenger\" Snell,Marc von Martial"
    },
    {
        "name": "Opera",
        "description": "In 1607 Monteverdi&rsquo;s Opera La Favola d&rsquo;Orfeo had its worldwide premiere. Over the following centuries, Europe was taken over. In the board game Opera, the players bring Opera to the public. In Venice, Vienna, Berlin, London, Paris and Milan great Opera houses arise. Opera leads the players through the periods of Baroque, Classicism and Romanticism. The epic music of six famous composers H&auml;ndel, Monteverdi, Mozart, Beethoven, Wagner and Verdi will bring the public to their Opera houses.&#10;&#10;Clever budgeting is essential to gain control and be the master of your own success. Each round the players determine their budget level to influence the order of play and to activate the characters in the game. The players build new Opera Houses, scout for new Operas of popular composers and try to earn some money. Sometimes they choose to cash in at the Palazzo where the Signora pays them well, but in the long term music are one of the key fundamentals to build your empire. The elegant Maestro brings the performance of an Opera to a higher level and the Critico can make or break a composer. Do not overvalue the three counting rounds with progressively growing value, because a well timed appearance of the Esperto might just bring you the victory in Opera. Ducats and capacity are key elements to facilitate the growth of your empire and influence, but in the end wealth is just an instrument to attain higher ends.&#10;&#10;In Opera the players must plan well. Introducing an Intermezzo from time to time might be helpful to seize the initiative on a decisive moment in the game. Opera takes place over 9 rounds of play, divided in 3 episodes. Each episode consists of three playing rounds and a counting round. The player with the highest number of victory points after the third and last counting round will be the victor.&#10;&#10;Opera has been succesfully launched on October 21st, 2009. Complete rules are available in the English, Dutch and German language. Also a FAQ and an introductionary video to understand the basic rules of Opera can be found at http://www.thegamemaster.nl/en/games-opera.htm.&#10;&#10;",
        "artist": "Volkan Baga,Arenea Kunkeler"
    },
    {
        "name": "Gears of War: The Board Game",
        "description": "Game description from the publisher:&#10;&#10;For a time, the humans of Sera knew peace...then Emergence Day came. The Locust horde arrived without warning, and countless horrors spilled forth from their underground burrows. The Coalition of Organized Governments (COG) struggled to fend off the subterranean threat, but their defenses were quickly crushed. With billions dead, humans turned their weapons of mass destruction on their own cities to deny the enemy control. Now the long struggle against overwhelming odds approaches one final, desperate stand.&#10;&#10;Gears of War: The Board Game, designed by Corey Konieczka, is based on the wildly popular third-person shooter by Epic Games. One to four players take on the roles of COG soldiers cooperating to destroy the Locust horde, and must work together to complete missions against an ingeniously challenging and varied game system. In Gears of War: The Board Game, you&rsquo;ll relive classic moments from Gears of War and Gears of War 2 &ndash; Roadie Run into cover, spray your enemy with blind fire, or rip him in half with your Lancer's chainsaw!&#10;&#10;In Gears of War: The Board Game you must fulfill one of seven randomly constructed missions and support your fellow COGs as your team engages an unflinching enemy in furious, white-knuckle firefights! Only through teamwork and communication will you gain a tactical advantage, completing your mission and striking a blow for humanity.&#10;&#10;You'll need every soldier you can get if you hope to send the Locust horde back to their holes. Leave no man behind!&#10;&#10;ERRATA&#10;- In the Roadblocks mission level 3, use tile 12A instead of 3A.&#10;- In the rules, under Component List, the following three entries are incorrect:&#10;-- 23 Wound/Dropped Weapon Markers, should be 22&#10;-- 12 Grenade Tokens, should be 14&#10;-- 36 Ammo Tokens, should be 44&#10;&#10;",
        "artist": "Edge Studio,Christopher Hosch,Adam Taubenheim,Ben Zweifel"
    },
    {
        "name": "What Price Glory?",
        "description": "International Game Series game from Multi-Man Publishing.&#10;&#10;A new Area/Impulse game and Card Driven Game (although not in the standard way) on the Western Front in World War One.&#10;&#10;Units are approximately corps-sized, and each of the ten turns represents half a year. Each side alternates activating units to move or fight by card play, either as a &quot;simple&quot; action or by using the text on the cards for additional or enhanced actions, including play of card combinations. Players choose their hand of cards from their entire pool of available cards at the start of each turn, which rewards good planning and anticipation of opponent's plans. One Event card is added to the pool each turn starting on the third; these handle high-level options like submarine warfare or USA entry.&#10;&#10;What Price Glory? can be taught and played to completion in three or four hours. Experienced players can shave an hour off that time.&#10;&#10;",
        "artist": "Nicolás Eskubi"
    },
    {
        "name": "Restaurant Row",
        "description": "On a quiet little street in the next up and coming neighborhood in New York, there are a number of restaurateurs who each want to become known as the culinary ruler of the neigh&shy;borhood.  But running a restaurant is not easy.  You have to get good ingredients, make good hires, improve your restaurant space, and watch your bottom line.  And after all that hard work, one bad review from a critic might kill you!  The comp&shy;etition is fierce, but if you can avoid the culinary slings and arrows, you might just survive and rule over Restaurant Row.&#10;&#10;Object of the Game&#10;To become the most well-regarded restaurant on Restaurant Row by the time the neighborhood&rsquo;s reputation for food matures.  To do this you need to be the dominant restaurant in the qualities that this neighborhood&rsquo;s restaurants become best known for by the end of the game.&#10;&#10;",
        "artist": "Scott Starkey"
    },
    {
        "name": "Trenches of Valor",
        "description": "Where did the great commanders of World War 2 get their start? Fighting in the trenches of World War 1, of course!&#10;Many recall the stalemated trench lines opposing each other for years of futile mass-assaults, but there were daring and heroic action to be found in the small unit trench raids led by rising young officers such as Erwin Rommel. Crossing &quot;No Man&rsquo;s Land,&quot; cutting the barbed wire, and sneaking in under the cover of darkness while a box barrage guarded the raider&rsquo;s flanks, small parties of soldiers would risk all in an effort to keep the enemy off-balance and prepare the way for future actions.&#10;&#10;These quick raids of maneuver and destruction caused panic and pulse-pounding excitement for their brief durations, serving as the stuff of heroic legend for a generation whose nations fought so tragically. Can you lead or defend against a surprise raid among the trenches? Can you keep steady as troops arrive and nerve-wracking bombs go off seemingly from nowhere? Will you triumph among confusion amid the Trenches of Valor?&#10;&#10;Complexity: 2.5 on a 9 scale&#10;&#10;Solitaire Suitability: 6.5 on a 9 scale&#10;&#10;Scale: Each unit is 2 to 10 soldiers, each hex &asymp; 50 meters across, and each turn is about 30 to 60 seconds of real time.&#10;&#10;Game Components:&#10;&gt; One 4-page, color Rules booklet&#10;&gt; 42 color, die-cut 3/4&quot; mounted pieces&#10;&gt; One 11&quot; x 17&quot; color game map with tables&#10;&gt; 1 BATTLESSON(TM) sheet&#10;&gt; Part of an introductory wargame series!&#10;&#10;",
        "artist": "Alan Emrich"
    },
    {
        "name": "The Isle of Doctor Necreaux",
        "description": "From the publisher:&#10;&#10;Build a Character... Infiltrate the Island... Defeat Necreaux&rsquo;s Minions... Find the Scientists... And before time runs out... Escape!&#10;&#10;The Isle of Doctor Necreaux is a cooperative card game for 1 to 5 players fighting the diabolical mad scientist Doctor Necreaux. You&rsquo;ll find yourself wondering what in the world is worth saving when the world itself is held hostage.&#10;&#10;Components:&#10;110 cards, dice, turn board and counters&#10;&#10;",
        "artist": "jim pinto,Scott Purdy,Kevin Wasden"
    },
    {
        "name": "Pocket Battles: Celts vs. Romans",
        "description": "A war game that fits in the pocket!&#10;&#10;When pressed for time and table space and the hankering for battle hits, this is the perfect remedy - and it is portable!&#10;&#10;Tiles represent troops and troops make up units in your army: just determine the size of the battle and create your own army from a pool of existing troops.&#10;&#10;Each tile hits on certain rolls, and some can only melee while others can shoot. Some tiles also have special traits which can affect their whole unit or their whole army.&#10;&#10;Armies fight in three sectors - the battlefield. The goal is to eliminate at least half the value of your opponent's army.&#10;&#10;Celts vs. Romans is the first in the Ancients line and also the first in the Pocket Battle series. Each Pocket Battles game will feature two armies from a particular era or genre (yes, fantasy and sci-fi, we are looking at you).&#10;&#10;The basic rules of the game are fairly simple; two armies face each other in battle. The armies are split into three columns and two rows. Players must decide, at the start of the game, how many points they will give to their armies, determining how many points it will take to defeat the opponents army. (At least half of the points).&#10;&#10;On you turn; you have to choose which faction of your army you will send off to battle! Attacks are made by using Order Tokens. If no Order Tokens are present on a unit, it costs just 1 token to issue orders to that unit. Issuing orders to the same unit in the same Battle Round would cost you the number of tokens present on the unit, plus 1. (So if there is one existing token on your unit, it would cost you two additional tokens to activate; if you had three tokens on the unit, it would cost you four additional tokens, and so on).&#10;&#10;After a round of battle, you may choose to redeploy you units. (Units may move from the back of the row to the front of the same row, from the back of a row to the back of another row, or from the front of a row to the front of another row). Redeployment will not cost you any Order tokens.&#10;&#10;The battle is over when one army defeats the other.&#10;&#10;Contents:&#10;60 tiles, 6 dice, 20 wound/order tokens, 2 player aids, 1 set of rules.&#10;&#10;Romans: 1 aquilifer, 5 archers, 4 auxiliares, 1 ballista, 3 cataphracts, 3 cavalry, 1 centurion, 1 imaginifer, 1 imperator, 5 legionaries, 1 onager, 3 praetorians and 1 scorpio.&#10;&#10;Celts: 1 champion, 1 chariot, 1 druid, 2 gaesatae, 1 hero, 3 horsemen, 4 javelinmen, 3 noblemen, 3 noble cavalry, 4 slingers, 5 warband, 1 warchief and 1 warrior queen.&#10;&#10;",
        "artist": "Karim Chakroun"
    },
    {
        "name": "Attandarra",
        "description": "This game was self-produced by the designer Horst Rokitte.&#10;The game is about rebuilding the city of Attendorn (first named Attandarra in 1072 AD). Every player has got a personal board where he builds some of the known buildings of Attendorn (like Hospital, Church, Castle, Abbey, Townhall,... 18 in total). On the central board you'll find a resource-market where the resources wood, clay, stone and glass can be bought (in order to build the 18 buildings) as well as a point-counter and a 'coordination-field'. &#10;On this field citizen- and/or money-tokens can be bought in order to put them on buildings that were built on the personal board. A building with a token on it, gets more value at the end of the game.&#10;&#10;Further details, pictures and the rules (in German) could be found on the publisher's homepage www.spiele-idee.de (now turned off).&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Peloponnes",
        "description": "Players take control of the civilizations of ancient Greece. Through auctions in each of the 8 rounds, the players develop their civilizations, adding territory through Land Tiles and prestigious buildings through the Building Tiles.  These increase the civilizations' inhabitants, luxury, wealth and power.  Luxury goods allow flexibility in providing for a player's population, while some tiles also offer protection against the many disasters that happen during the game.  Only through a balance of inhabitants, land and buildings can a player claim victory and join the heroes of Peloponnesian history.&#10;&#10;&#10;Los jugadores controlan civilizaciones en la antigua Grecia.&#10;A trav&eacute;s de subastas en cada una de las 8 rondas, los jugadors desarrollar&aacute;n sus civilizaciones a&ntilde;adiendo territorios y edificios. &#10;Esto incrementa la poblaci&oacute;n, el lujo, poder y riqueza.&#10;S&oacute;lo con una proporci&oacute;n adecuada de poblaci&oacute;n, territorios y edificios un jugador podr&aacute; reclamar la victoria y convertirse en un h&eacute;roe de la historia del Peloponeso.&#10;&#10;",
        "artist": "Matthias Catrein"
    },
    {
        "name": "UNO Moo!",
        "description": "(from back of box)&#10;Match colors or animals to get the critters back in the barn!&#10;&#10;The farm animals have come out of their barn to play Uno! Round them up by matching colors or animals. Is there a blue pig on the barn door? Match it with any blue animal or any color pig. You can also play a farmer--he's wild and matches anything! The first player to get all of their figures back in the barn wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Martian Rails",
        "description": "Martian Rails is a railroad building game set on a fictional planet Mars.  Simultaneously, the game allows a world of canals and noble savages, a cold high altitude desert globe, a nearly airless planet, terraforming, nanotech cyberpunk and everything in between from 100+ years of science fiction stories set on Mars.  The game further captures the mood of those stories and the feel of the planet.  The game uses a further refinement of the wrap-around mechanism used in Lunar Rails to simulate travel across a 3D  opposed to a 2D map.  Having to think in 3D wraparound mode adds additional &quot;brain-burn&quot; to the Empire Builder franchise... sometimes the shortest distance between two points isn't the obvious straight line.&#10;&#10;See crayon rail games for more crayon fun.&#10;&#10;",
        "artist": "Mark Zug"
    },
    {
        "name": "Invasion from Outer Space: The Martian Game",
        "description": "Invasion From Outer Space, The Martian Game is a fast-paced game of fiendish Martians, Big Top Heroes, and SciFi Movie Action. Players  take on the role of either the Carnival Heroes, using their special talents and working together to fight off the Martian Invasion; or as the invaders themselves, waves of Martian Soldiers and Flying Saucers, blasting Humans with Ray Guns and unleashing their vile alien technologies upon the Earth.&#10;&#10;Featuring a modular game board, eight Carnival Heroes to choose from (such as the Fire Breather, Strongman, or Jo Jo, the dancing Bear), an army of Martians to start the invasion (including Martian Champions such as the dreaded Zard Beast), and several different Scenarios to play that drastically change the game; Invasion From Outer Space is designed to create a cinematic feel as the story and game unfolds.&#10;&#10;Also, as Invasion From Outer Space is built using the Last Night on Earth game engine, the two games are fully compatible. With ease, players can now have their Martians invade the small town of Woodinvale, Zombies attack the Carnival, or even play a massive game with up to three independent factions (Heroes, Zombies, and Martians). The possibilities are endless.&#10;&#10;So drop those roasted peanuts, strap on your jumpsuit, and step into the spotlight...the Martians are Coming and the Invasion From Outer Space has begun!&#10;&#10;Features:&#10;&#10;&#10;     Uses the 'Last Night on Earth' game engine, allowing for interconnectivity between the games.&#10;     The same Martians also make an appearance in ''Conquest of Planet Earth: Apocalypse''.&#10;     Photographic Artwork for Immersive Horror/SciFi Movie Action&#10;     28 Highly detailed plastic 28 mm Miniatures&#10;     Game comes with an Original CD Soundtrack to creep its way into the players' subconscious and raise tension and excitement&#10;     No two games are ever the same! Many Heroes, Scenarios, Game Cards, and a Modular Game Board offer limitless combinations.&#10;&#10;&#10;",
        "artist": "Jack Scott Hill"
    },
    {
        "name": "Pressure Matrix",
        "description": "Welcome to the Pressure Matrix &mdash; a futuristic game show where the contestants fight for their very lives. Trapped into a four walled arena, each runner moves to score the most points, while simultaneously pinning opponents into the corners of the Pressure Matrix, where they cannot move. As the game goes on, the pressure mounts as the runners move faster and faster, with fewer and fewer options. The game ends immediately when any runner is &quot;frozen&quot; (out of control markers at the start of the runner's turn).&#10;&#10;Pressure Matrix is a fast-paced, clever strategy game for 2 to 5 players. With multiple levels of play, random tile placement, and sinister opponents, there is no end to the Pressure Matrix.&#10;&#10;",
        "artist": "Greg Lambrakis,Hal Mangold"
    },
    {
        "name": "Hagoth: Builder of Ships",
        "description": "Hagoth: Builder Of Ships&#10;&#10;Players compete in an effort to design, build, and sail ships to the Land Northward. Through these efforts players are awarded Victory Points. The first player to obtain 25 Victory Points wins the game.&#10;&#10;Cards are used to design, build, and sail ships. Players start the game with a hand of 5 cards. On their turn they can do one of the following:&#10;&#10;1. Play or discard 2 cards (or one of each)&#10;2. Choose to perform one action in lieu of using cards for their turn.&#10;&#10;There are 5 types of cards&#10;1. Ship pieces cards, used to design ships; &#10;2. Go Wooding cards; used to obtain wood to build the ship once they are fully designed;&#10;3. Build cards used to build ships; &#10;4. Sail cards used to progress built ships for more victory points; and &#10;5. Adversity cards, used to hinder opponents' progress with cards such as Sabotage and Delay.&#10;&#10;",
        "artist": "Scott Wakefield"
    },
    {
        "name": "Myth: Pantheons",
        "description": "From the Publisher:&#10;&#10;In Myth, each player takes the role of a mythic deity, vying to gain the worship of the ancient world&rsquo;s great cities and gain the most followers. One player may have a goddess of the harvest and fertility, multiplying her followers, as another player with a trickster deity steals away valuable wealth and rewards. Will you declare war on your enemies, send sickness to decimate their followers, smite them with lightning, or see the future in the stars and outplan your foes?&#10;&#10;Myth is a stand-alone card game with a deck for mortal affairs, unique deity cards allowing each of twelve ancient gods to wield their influence in a different manner, tokens for the godly powers, and a deck of 30 different cities each bringing different rewards to the deity who can claim them.&#10;&#10;Will you be the one to rule the cosmos?&#10;&#10;",
        "artist": "Nate Barnes,Gonzalo Ordoñez,Rodney Saenz"
    },
    {
        "name": "Blitz! A World in Conflict",
        "description": "Blitz! A World in Conflict is an army-level adaptation of the internationally award winning global World War II wargame World in Flames.  Blitz! covers the entire globe on one large (approx 910mm x 560 mm/36&quot;x22&quot;) map of the world with area-based movement covering every theater of the war (Europe, N Africa, Pacific, E. Asia, N Atlantic, etc.)&#10;&#10;Blitz! A World in Conflict is a stand-alone boxed game. It includes almost 400 two-sided counters providing all the armies, air wings, and fleets for all the major combatants and many other countries, selected commanders, plus game markers. It plays in a fraction of the time needed for most historically-accurate World War II campaign games (2 hours for Barbarossa, 5 to 8 hours for the entire global war) while still giving players the opportunity to cover the entire war. Rules include various options so you can tailor the game to your preferences and experiment with &quot;what if&quot; situations,&quot; including revising the politics of the 1930s before the war begins.&#10;&#10;At last you can re-fight with all WW2 WiF style in less than a lifetime.&#10;Contents&#10;&bull; 1 large map (559mm x 864 mm)&#10;&bull; 396 two-sided full colour counters&#10;&bull; 1 Rule book&#10;&bull; 8 two-sided Weapons Development Charts&#10;&bull; 2 x 6-sided dice&#10;&#10;",
        "artist": "Knut Grünitz,Dave LeLacheur"
    },
    {
        "name": "Hansa Teutonica",
        "description": "The players act as traders trying to get victory points for building a network of offices, controlling cities, collecting bonus markers or for other traders using the cities they control. After controlling a line between two cities with your pawns you can decide to build an office (and maybe also establish control and/or get a bonus marker) or to get a skill improvement from some of the cities.&#10;&#10;Players have to improve their traders' &quot;skills&quot; for the following effects: getting more VP from offices in their network, getting more available action points, increasing the number of available pawns, and getting the right to place pawns and get more special pawns.&#10;&#10;This game appeared originally as Wettstreit der H&auml;ndler at the Hippodice competition.&#10;&#10;",
        "artist": "Dennis Lohausen"
    },
    {
        "name": "Yomi",
        "description": "Yomi is a card game that simulates a fighting game. It tests your ability to predict how your opponents will act and your ability to judge the relative value of cards from one situation to the next. Also, it lets you do fun combos and be a panda. There are 10 characters to choose from, each with their own deck, abilities, and style. Each deck also doubles as a regular deck of playing cards with beautiful artwork (the complete game features a whopping 120 different character illustrations).&#10;&#10;Yomi is the Japanese word for &ldquo;reading&rdquo;, in this case as in reading the mind of your opponent. Yomi: Fighting Card Game is a simple competitive card game that simulates a fight between two characters. Each deck in Yomi represents one character, with 10 decks in the first release.&#10;&#10;Champion fighting game tournament player and tournament organizer David Sirlin designed the game to test the skills of Valuation and Yomi. Valuation refers to your ability to judge the relative value of moves (or cards) as they change over the course of the game. Yomi, the game's title, refers to your ability to guess which moves your opponent will make. There is more to it than guessing, though: some players have the uncanny ability to &ldquo;guess&rdquo; right almost every time, no matter the game.&#10;&#10;The core mechanic is a paper-rock-scissors guessing game between attack, throw, and block/dodge (sometimes modified by special ability cards). Attacks and throws usually let you follow up with combo cards from your hand, while blocks let you draw a card. While it first seems &quot;just random,&quot; you soon discover that the unequal and uncertain payoffs in this guessing game allow you really read what the opponent will do. Yomi captures the kind of mind games that occur during the high level in fighting game tournaments.&#10;&#10;Reimplemented by:&#10;&#10;     Yomi (second edition)&#10;&#10;&#10;&#10;&#10;",
        "artist": "Concept Art House,Genzoman,Udon Crew,Long Vo"
    },
    {
        "name": "Polizei-Alarm!",
        "description": "One player is the band of thieves, attempting to break into safe deposit boxes. The other player is the police, trying to hunt them down before they escape. While the police scoots around a magnetic board looking for the thieves, the criminal rolls the dice attempting to break open the safe deposit boxes.&#10;&#10;Polizei-Alarm! is an action/dexterity game for 2-4 players (although only two sides play against each other).One side plays a gang of safe-crackers who try to throw the correct combinations for the safes with some special dice under time-pressure.&#10;&#10;The other side is the Police, who try to find the the hideout of the gangsters. In order to achieve this they steer a police car through a labyrinth-like city plan on the game board by holding the board at an angle, so that the the police car slides on the surface (similar to the classic wooden labyrinth-games where you have to navigate a metal ball through a maze with holes in it - but without the holes). When they find the correct hideout before the safe-crackers succeed with the combination, the latter walk off empty-handed.&#10;&#10;",
        "artist": "Thies Schwarz"
    },
    {
        "name": "Black Stories Movie Edition",
        "description": "How could that have happened? Black Stories are fiddly, morbid and mysterious riddles for teenagers and adults. The players try to reconstruct the crime by asking, guessing and fiddling about. Only yes/no answers are allowed. A spooky card game just right for any party. This version of the black stories has events from various movies.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Chaos in the Old World",
        "description": "Chaos in the Old World makes you a god. Each god&rsquo;s distinctive powers and legion of followers grant you unique strengths and diabolical abilities with which to corrupt and enslave the Old World.&#10;&#10;     Khorne, the Blood God, the Skulltaker, lusts for death and battle. &#10;     Nurgle, the Plaguelord, the Father of Corruption, luxuriates in filth and disease. &#10;     Tzeentch, the Changer of Ways, the Great Conspirator, plots the fate of the universe. &#10;     Slaanesh, the Prince of Pleasure and Pain, the Lord of Temptations, lures even the most steadfast to his six deadly seductions. &#10;&#10;&#10;&#10;&#10;Yet, as you and your fellow powers of Chaos seek domination by corruption and conquest, you must vie not only against each other, but also against the desperate denizens of the Old World who fight to banish you back to the maelstrom of the Realm of Chaos.&#10;&#10;Chaos in the Old World features three ways to win, and gives you an unparalleled opportunity to reshape the world in your image. Every turn you corrupt the landscape, dominating its inhabitants, and battle with the depraved followers of rival gods. Each god has a unique deck of gifts and abilities, and can upgrade their followers into deadly foes. Summon forth living manifestations of Chaos, debased and hidden cultists, and the horrifying greater daemons - beings capable of destroying near everything in their path.&#10;&#10;",
        "artist": "Tim Arney-O'Neil,Kevin Childress,Andrew Navaro,Brian Schomburg,WiL Springer"
    },
    {
        "name": "Chunky Fighters",
        "description": "In Chunky Fighters, humorous characters fight it out in an all-or-nothing brawl. Players choose their fighters, then roll them to determine hit points and weapons. Each fighter is composed of four dice &mdash; head, body, legs, and weapon &mdash; along with a unique special ability card. Combat involves rolling damage and hit location dice. As fighters take damage, you rotate their body parts to show the remaining hit points until they're finally destroyed.&#10;&#10;In addition to the standard attack, players can choose to change weapons, perform first aid, disarm an opponent, or make called shots for increased damage. Be the last fighter standing to win the game!&#10;&#10;",
        "artist": "Pascal Boucher,Nick Hayes"
    },
    {
        "name": "Assyria",
        "description": "In Assyria, players represent tribes living in Mesopotamia, trying to develop on the desert and a limted fertile area located between two rivers that divide the board. In their quest for power (points), players build Ziggurats (permanent outposts), wells, make sacrifices to gods and try to get along with nobles of Assur - the capital of Assyria. The game is a light-weight eurogame, built around the short-term rapid point gains vs long-term investments dilemma. General flow of play is as follows:&#10;&#10;Phase 1: Players get resources for expansion and decide on play order&#10;&#10;In this phase, players pick cards with resources that enable expansion on the board. In general he/she who gets most food, plays last. First player expands with least food.&#10;&#10;Phase 2: Players expand on the board to earn points or money.&#10;&#10;Players begin to form strings and/or clusters of huts and pay for placing them with their food cards. Depending on where huts are placed, they either score points or earn camels (money).&#10;&#10;Phase 3: Players spend money/camels on various investments.&#10;&#10;A player either goes for one-time bonuses from the nobles of Assur, or makes long-term investments by offerings to gods and building Ziggurats.&#10;&#10;The game lasts for three eras, made up of 2-3 of such cycles. After each era comes the flood: the board is partially cleaned up, but players also capitalize on their investments from phase 3. Each round, players also score points for huts (those built on fertile land between the two rivers bring more points) and ziggurat tiles.&#10;&#10;In comparison to other games from Ystari's series - Assyria is lighter than Caylus, Olympos, Ys or Sylla (in terms of complexity, available choices - represented by numerous tiles, cards, icons, cards etc. that need to be remembered and can be combined during play), but heavier than Yspahan, Mykerinos or Metropolis.&#10;&#10;",
        "artist": "Arnaud Demaegd"
    },
    {
        "name": "Scrappers",
        "description": "Following the success of their critically acclaimed family card game, Infernal Contraption, Privateer Press is pleased to announce Scrappers, a family board game for 2-4 players ages 9 and up. In Scrappers players take on the role of lively goblin mechanics as they race around a factory trying to pull parts off a constantly moving conveyor belt in order to be the first to complete their contraptions. Featuring stunning full-color artwork from Privateer Press Artist Chris Walton, Scrappers is scheduled to release world-wide in September 2009.&#10;&#10;&ldquo;The game features fast, intuitive game play that takes only minutes to learn, but presents a strategic depth that will challenge both new young players and seasoned veterans alike,&rdquo; said Privateer Press Chief Creative Officer Matt Wilson when asked about the new Bodgers game, &ldquo;Add to that the maniacal and zany cast of the Bodgers goblin mechanics and Scrappers is a game everyone will want to play again and again.&rdquo;&#10;&#10;",
        "artist": "Chris Walton"
    },
    {
        "name": "White Stories",
        "description": "How could that have happened? White Stories is a game similar to the Black Stories game series. The players try to reconstruct an obscure event by asking, guessing and fiddling about. Only yes/no answers are allowed. This version of the black stories has mysteries related to various spooky things - ghosts, apparitions, witches, phantoms, and more.&#10;&#10;Announced for Essen 2009&#10;&#10;",
        "artist": "Andrea Köhrsen"
    },
    {
        "name": "Yalu: The Chinese Counteroffensive in Korea: November 1950-May 1951 (second edition)",
        "description": "In November of 1950, the United Nations counteroffensive against the North Koreans seemed to be in the final stages of a mop-up. Everywhere the Inmun Gun (the North Korean Army) was in full retreat toward the Chinese border, closely pursued by the victorious Allies.&#10;&#10;Chinese intervention in the war had been considered and dismissed as a bluff by the UN Command. Thus, the UN forces were badly overextended when the bluff materialized as a force of thirty divisions, having infiltrated into the Korean mountains.&#10;&#10;UN forces were sent reeling back to the 38th Parallel in confusion, attempting to reestablish a front line. The Communists followed relentlessly, infiltrating deep into UN positions. They attacked without caution, accepting high casualties in order to sustain momentum.&#10;&#10;Units in Yalu are mostly divisions, with some regiments and battalions. Ground scale is 10 miles per hex and turns are weekly. Weather plays a predominant role, influencing movement and combat options for both sides. Yalu, like no other game, effectively shows the differences in the opposing sides' Rules of Engagement - the two sides simply feel and play differently.&#10;&#10;This is the second edition of Yalu; the first was published in GDW's Conflict Games line in 1977. The 2009, Second Edition of Yalu will be a fully updated version of the game with all new graphics, all known errata included and some additional rule updates.&#10;&#10;Both &quot;New-Look&quot; and &quot;Retro-Look&quot; components. Second Edition Yalu has both &quot;New-Look&quot; and &quot;Retro-Look&quot; map and counters to provide some replay variability. The 1977 rules and the new rules will also be featured.&#10;&#10;&#10;Re-implements:&#10;&#10;     Yalu: The Chinese Counteroffensive in Korea, November 1950 to May 1951&#10;&#10;&#10;&#10;&#10;",
        "artist": "Todd Davis"
    },
    {
        "name": "Balance of Power",
        "description": "Game description from the publisher:&#10;&#10;It is 1815 and the world has been turned upside down. Napoleon Bonaparte has finally been defeated after nearly conquering all of Europe through years of devastating warfare. Now the Great Powers must deal with the chaos left behind. As each nation eagerly tries to grow, a careful balance of governmental, military and economic interests must be maintained.&#10;&#10;In Balance of Power, players carefully create and move Kings, Generals and Bankers as they capture territories and expand their empires. A player&rsquo;s skill and strategy are all that stand between him and ultimate victory!&#10;&#10;",
        "artist": "Brent Knudson"
    },
    {
        "name": "Caesar's Gallic War",
        "description": "Caesar's Gallic War is a two-player game that covers Julius Caesar's conquest of Gaul from 58 to 51 BC. One person plays the side of the Romans, while the other plays the side of the Germans, with both players vying for control of the various Gallic tribes.&#10;&#10;The game uses blocks and area movement. Players use cards to collect allies, move units and attack or play events. Certain leaders are represented in the game, including Julius Caesar, Vercingetorix and Ariovistus.&#10;&#10;As the Germans you will start with fewer and weaker units, but you you'll have an easier time recruiting other tribes to your side. Eventually Vercingetorix will appear to help you. Will you confront the Romans directly? Or will you play defensively, and rely on raiding tactics and political maneuvering?&#10;&#10;As the Romans you start with six legions, with four more on the way. Your units are stronger and faster. But you'll have a more difficult time recruiting tribes onto your side, and you'll not only have to worry about rebellions, but watch your supplies as well.&#10;&#10;",
        "artist": "Sean Cooke,Lionel-Noël Royer"
    },
    {
        "name": "The BoardGameGeek Game",
        "description": "The BoardGameGeek Game (TBGGG) was published to celebrate the tenth anniversary of the BoardGameGeek website, the gaming community&rsquo;s most indispensable database!&#10;&#10;Ernie (the famous BoardGameGeek mascot) has gone on holiday to meet his English cousins and fellow geeks in the quaint Cotswold town of Boardway.  In TBGGG players take on two roles:&#10;&#10;Firstly, players represent one of the six game publishers: Eggertspiele, Hans im Gl&uuml;ck, Queen, R&amp;D, Treefrog or Ystari, supplying their company&rsquo;s games to the games shops of Boardway.  Geek Gold (GG) is earned for each game they sell.  Secondly, each player has a team of three &lsquo;dicey&rsquo; geeks who are trying to collect sets of games to meet their gaming group&rsquo;s requirements.  At the end of the game GG is awarded to record the player&rsquo;s success in acquiring these games.  The player accumulating the most GG is the winner.&#10;&#10;TBGGG is a fast paced, tactical, fun game for 3 to 6 players (with &lsquo;geeky English start player&rsquo; option), which takes around 60 to 75 minutes to play.&#10;&#10;",
        "artist": "Richard Breese,Ryan Johnson"
    },
    {
        "name": "Neuroshima Hex! Duel",
        "description": "Duel is the second expansion to the game Neuroshima HEX. Just as the first line of supplements, Duel includes two new armies, and something special - this time it is intended to be a unique board games for two players. Duel is both an expansion and a stand-alone game - the game does not need base Neuroshima HEX to play.&#10;&#10;The first army in the expansion is Vegas, an army of people who grew up in gambling. Its special feature is the ability to control the enemy of man and machine by means of special units - agitators. They can bribe any enemy unit that is adjacent to Vegas's HQ to make it attack another unit. If your units attack Vegas HQ, you can not be sure when they will stop attacking Vegas and turn to attack you!&#10;&#10;The other army is a SMART, spreading fear the army of half machines, half-mutants, the experimental hybrids are transported in sealed combat transporters to battlefield where they emerge and destroy everything that moves. These are an extremely deadly force. Every ally adjacent to Smart's HQ has the ability to move. It makes this army very flexible and dangerous.&#10;&#10;Integrates with:&#10;&#10;    Neuroshima Hex!&#10;&#10;&#10;&#10;&#10;",
        "artist": "Sławomir Maniak"
    },
    {
        "name": "Pocket Rockets",
        "description": "Each player is an astronaut who is building rockets. An &quot;assembly plant&quot; circle is formed from six special cards, and the the astronaut pawns move along the circle choosing different actions. At each location the player can perform a particular task, such as: draw the face-up card there (cards show a rocket base, fuselage or tip in one of three different colors), add a part to a rocket, take fuel tokens, change direction of rotation, etc. Some rocket tips grant special privileges, and the first fuel that's taken is more valuable than the last. When fuel reserves are exhausted, the winner is determined by comparing the astronauts' completed rockets - most fuselages wins.&#10;&#10;",
        "artist": "Marie Cardouat,Nicolas Fructus,Christophe Madura,David Rakoto"
    },
    {
        "name": "Baltimore & Ohio",
        "description": "With a bright Peep from the whistle, a full Chuff from the pistons and a powerful Clank from the drivers, America's first steam locomotive moves down the steel rails of the Baltimore &amp; Ohio Railroad in Baltimore in 1830. This strategic railroad game extends from the first of America's railroads through the golden age of steam, where pioneering rail barons knit together the fledgling United States with iron roads, realizing the full power of the nation's mighty heartland. Each player takes the roles of railroad presidents and their wealthy investors, betting that their capital gambles will pay off handsomely. Baltimore and Ohio is not a game of luck or chance, but a competitive struggle of wits, savvy and guile. With the resources at hand, should you focus on further expansion, technological breakthroughs or emerging markets? This modern classic has all the challenges faced by the empire building capitalists that created a superpower.&#10;&#10;Eddie Robbins' Baltimore &amp; Ohio is a no luck, no auctions, 3+ hour, grand strategic economic slugfest of a train game, for 3-6 players. It was part of the Winsome Games' 2009 Essen Set, has been licensed to Eagle Games and will be released by Eagle in 2010.&#10;&#10;The railroads in the game are:&#10;Baltimore &amp; Ohio&#10;Boston &amp; Maine&#10;Chesapeake &amp; Ohio&#10;Erie&#10;Illinois Central&#10;New York Central&#10;New York, Chicago &amp; Saint Louis (aka Nickel Plate)&#10;New York, New Haven &amp; Hartford&#10;Pennsylvania&#10;Wabash&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Tomb: Cryptmaster",
        "description": "Once again, it is time to assemble a party and delve into the dangers of the Tomb! Tomb: Cryptmaster is a stand-alone expansion to the 2008 game Tomb, a dungeon adventure game in which each player recruits a unique party and races to clear more of the dungeon than any other player. Tomb: Cryptmaster introduces two new boards, 80 new characters, 400 new cards, more spells, items, prayers, and tactics, and a new deck: the Cryptmaster deck, which contains cards you can use to terrorize your opponents when they foolishly enter a crypt with surprises you have prepared.&#10;&#10;The game is playable on its own, or it can be used in conjunction with the original Tomb game. Featuring a revised and expanded rulebook, players may try new variations such as Overlords and Player vs. Player action. Other new features include Henchmen you can hire out to other parties for a share of their loot and hideous Curses you can use to torment other parties foolish enough to get in your way. As with the original game, Tomb: Cryptmaster includes a basic board, this one specially designed for normal or player vs. player action, and an advanced board designed to test the hardiest adventurer!&#10;&#10;Recruit a party. Kill the monsters. Take their stuff.&#10;&#10;Integrates with:&#10;&#10;    Tomb&#10;    INVALID OBJECT ID=67350, type=thing&#10;&#10;&#10;&#10;&#10;",
        "artist": "Nate Barnes,Thomas Denmark,Carl Frank,Michael Komarck,Rodney Saenz,Franz Vohwinkel"
    },
    {
        "name": "Austerlitz 20",
        "description": "With the Danube campaign over and the Austrian capital of Vienna occupied by French troops, Napoleon requires a decisive battlefield victory to secure his gains. At the end of a long line of communication back to Paris, the Grande Arm&eacute;e feigns weakness in the cold and fog of an early December morning in 1805. Now Austerlitz 20 presents the story of desperation and destiny as three Emperors clash to resolve the fate of Europe. With its myriad scenarios and variations, students of history can explore a plethora of &quot;What if?&quot; possibilities as Allied greatness clashes with French glory at the dawn of the &quot;Sun of Austerlitz.&quot;&#10;&#10;This game features only modest complexity and a focused scope employing low unit density on the map (20 pieces or less) and dramatic, fast playing turns. It is the addition of &lsquo;story-driven&rsquo; random event cards and night game turns that provide the operational pauses and &quot;friction of war&quot; that give players a great feel for the parry-and-thrust of a Napoleonic grand battle as the armies close to bayonet-point to see which will break first!&#10;&#10;Complexity: 4 on a 9 scale&#10;Solitaire Suitability: 6 on a 9 scale&#10;Scale: Each unit is 1 corps or division, each hex is about 800 meters, and each turn is roughly 3 daylight hours (or 10 night hours).&#10;&#10;2009 Charles S. Roberts(CSR) Award Nominee for Best Desktop Published/Print and Play&#10;&#10;",
        "artist": "John R. Cooper"
    },
    {
        "name": "Kung Fu",
        "description": "Kung Fu is a fast and exciting real-time party game. The players are young adepts of Kung Fu who take their final exam in the Shaolin monastery in front of their masters to prove whose Kung Fu is the best...&#10;&#10;",
        "artist": "Iwo Widulinski"
    },
    {
        "name": "Kansas Pacific",
        "description": "David V. H. Peters' Kansas Pacific is a no-luck tactical train game that was released as one of the games in the Winsome Games 2009 Essen Set.  In this game, players are purchasing auctioned shares to run or share in the profits of one of six railroads that begin on the Eastern edge of Kansas. The railroads gain income by passing through a variety of Kansas cities and towns, with sizable income available for those that go through Wichita or Topeka.  There is an additional mechanism and incentive for furthering the railroads westward: the Western quarter of the state is a 'land grant' area where the railroads can gain additional track cubes, and rail lines that reach the Colorado border receive a sizable income bonus.  When the game ends, the player with the most cash on hand is the winner.&#10;&#10;",
        "artist": "Harald Lieske"
    },
    {
        "name": "Cubiko",
        "description": "Bounce the ball onto the 3x3 grid--where it lands you will put your marker.  Knock out your opponents and make 3 in a row or 3 in a square to win!  Careful though, if the ball knocks markers around the board the situation can change in an instant.&#10;&#10;&quot;In November 2008 I had the inspiration for Cubiko.  I was sitting on the floor of my parent's house with my four year old son.  He was playing with his toys and I was rolling a ball onto his toy box.  Over time and with much help from family and friends Cubiko evolved into what it is today.&quot; -- Gavin Birnbaum, author of Cubiko&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Castle Panic",
        "description": "The forest is filled with all sorts of monsters. They watched and waited as you built your castle and trained your soldiers, but now they've gathered their army and are marching out of the woods. Can you work with your friends to defend your castle against the horde, or will the monsters tear down your walls and destroy the precious castle towers? You will all win or lose together, but in the end only one player will be declared the Master Slayer!&#10;&#10;Castle Panic is a cooperative, light strategy game for 1 to 6 players ages 10 and up. Players must work together to defend their castle, in the center of the board, from monsters that attack out of the forest at the edges of the board. Players trade cards, hit and slay monsters, and plan strategies together to keep their castle towers intact. The players either win or lose together, but only the player with the most victory points is declared the Master Slayer. Players must balance the survival of the group with their own desire to win.&#10;&#10;",
        "artist": "Justin De Witt"
    },
    {
        "name": "Politix",
        "description": "The game description in Finnish:&#10;&#10;&quot;Politix on satiirisella otteella politiikan maailmaa k&auml;sittelev&auml; korttipeli, joka tarjoaa sinulle tilaisuuden kokea ennenn&auml;kem&auml;t&ouml;n vaalitaistelu aitiopaikalta. Pelin aikana pelaajat houkuttelevat edustamansa puolueen taakse &auml;&auml;nest&auml;ji&auml; kuudesta eri kansanryhm&auml;st&auml;. &Auml;&auml;nten kalasteluun on tarjolla erilaisia politikointikeinoja: siin&auml; miss&auml; blondien hurmaus on helppoa, tehoaa angstisiin nuoriin paremmin murahtelu. Ja jos keinot tuntuvat loppuvan, voi &auml;&auml;nest&auml;ji&auml; yritt&auml;&auml; voidella perinteiseen tyyliin tarjoamalla vaikka pullakahvit!&#10;&#10;Erilaiset poliittiset tapahtumat salarakkaista dopingskandaaliin s&auml;&auml;telev&auml;t pelin kulkua. N&auml;it&auml; tapahtumia hy&ouml;dynt&auml;en puolueet pyrkiv&auml;t ker&auml;&auml;m&auml;&auml;n suurimman &auml;&auml;nest&auml;j&auml;kunnan ja t&auml;ss&auml; parhaiten onnistunut puolue voittaa pelin.&#10;&#10;Onnea &auml;&auml;nten mets&auml;stykseen!&quot;&#10;&#10;A short description of the game in English:&#10;&#10;&quot;Politix is a satirical card game about the Finnish political scene. Each player plays one of the famous politicians and tries to gather voters to support his/her party. At the end of the game, the party that has gathered the widest support, wins the game!&quot;&#10;&#10;The game includes rule sets in Finnish, English and Swedish. Politix is coming out Fall 2009.&#10;&#10;",
        "artist": "Jussi Kurki,Ossi Lehtinen"
    },
    {
        "name": "Germantown",
        "description": "The Battle of Germantown took place on October 4, 1777, outside the city of Philadelphia and less than a month after the British victory at the Battle of the Brandywine Creek (September 11.)&#10;&#10;GMT is pleased to offer the latest in Mark Miklos' popular and critically acclaimed Battles of the American Revolution Series: Volume VII, Germantown, 1777.&#10;&#10;",
        "artist": "Alonzo Chappel,Rodger B. MacGowan"
    },
    {
        "name": "World Without End",
        "description": "Die Tore der Welt / World Without End is based on the novel by Ken Follett, a sequel to his bestselling The Pillars of the Earth. This is the 2009 game in the Kosmos line of literature-based games.&#10;&#10;World Without End shares the Kingsbridge location of the earlier novel, but occurs 200 years later. Similarly, the game shares many themes but is a new standalone game.&#10;&#10;As citizens of Kingsbridge, players need to take care of the following areas: Building, Trading, Religion, Feeding, and Medical Knowledge. Each turn an event card is flipped that defines available player actions. Victory points can be won in numerous ways, e.g. by creating  buildings or taking care of sick people.&#10;&#10;",
        "artist": "Michael Menzel"
    },
    {
        "name": "Party Alias",
        "description": "Party Alias is a standalone update of Alias.&#10;&#10;Party Alias features four major updates to the original game in terms of gameplay--these are all in terms of categories on the cards:&#10;&#10;Book: Here, players must tell a story using all the words on the card&#10;Smiley: Here the players must explain the words depicting a specific feeling (e.g. embarrassed, angry, happy, crying, afraid, drunk, depressed, and hysterical)&#10;Pose: Here the player must create unusual poses&#10;Camera: Here the player must try to describe a celebrity&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Friday",
        "description": "Friday, the second game in the Friedemann Friese Freitag-Project, is about Robinson Crusoe and Friday (Freitag). You play as Friday and must help Robinson Crusoe survive the island and prepare him to defeat the pirates.&#10;&#10;Friday is a solitaire deck-building game in which you optimize your deck of fight cards in order to defeat the hazards of the island and two pirate ships. During a turn the player will attempt to defeat hazard cards by playing fight cards from their deck. If defeated, a hazard will become a fight card and is added to the players deck. If failed the player will lose life tokens but also get the opportunity to remove played cards from their fight deck. Finally the player will use their optimized fight deck to defeat two evil pirate ships allowing Robinson Crusoe to escape the island!&#10;&#10;",
        "artist": "Harald Lieske,Marcel-André Casasola Merkle"
    },
    {
        "name": "Monster Chase",
        "description": "Monster Chase is a cooperative memory game for players 3 to 7 years old. In the game, monsters creep out from under the bed and try to surround it. Each monster is only afraid of one toy that will banish it to the closet amongst the ten that are available to be found. If the players successfully send all the monsters to the closet before they can close the circle around the bed, they win! Otherwise, the monsters are declared victorious.&#10;&#10;In game terms, face-down cards are placed on the table with tiles then placed around these cards. To start, a card is revealed that depicts a monster and the toy it's afraid of. In turn order, each player must now find the toy that scares off this monster, with the toy being hidden in the face-down tiles. If players make three mistakes when searching for this toy, a new monster appears with a different toy needed to scare it away. Once all the monsters are out, you have only three chances to win by getting rid of all the monsters.&#10;&#10;The rules offer different difficulty levels to adapt to player experience and/or maturity, such as one tile that shuffles the other tiles around and one tile that instantly brings out a new monster.&#10;&#10;",
        "artist": "Le Mille-Pattes,Nikao,Maciej Szymanowicz"
    },
    {
        "name": "Delve: The Dice Game",
        "description": "You have a party of four adventurers, each with unique abilities - a Fighter, a Rogue, a Wizard and a Cleric. They will face 6 groups of monsters in order.  You fight battles one round at a time, rolling for your adventurers first. For your adventurer's attack, roll 6 dice up to 3 times, setting aside any you want to keep. After the rolls, determine which attacks you will make, based on your surviving characters abilities.  For the monsters attack, roll a six sided die for every point of health they have left.  The goal of the game is to destroy all of the monsters, and to finally slay the Dragon, with at least one surviving adventurer.&#10;&#10;",
        "artist": "A. Tran"
    },
    {
        "name": "Delve the Card Game",
        "description": "Goal:&#10;&#10;Make it through the entire dungeon with a surviving hero.&#10;&#10;Rules:&#10;&#10;Pick one of the four heroes that you will use for the game.  Your starting vitality is shown on the card.  This is used for both your health and your attack value.  Damage will drop your vitality and if it ever reaches zero the game is over.  Items will modify your attack value when determining the outcomes of battles, but they do not add to your health.  For example, if your base vitality is 5, and you have taken 4 damage, 1 more damage will end the game even if you have a weapon that adds 2 to your attack.&#10;&#10;Pick one non-epic item to start the game with.  Unless otherwise specified, your hero can only carry two items.  Shuffle the remaining non-hero cards.  This is the draw deck.&#10;&#10;Start turning over the cards in the draw deck, one at a time and resolving them until you either reach the end of the deck and have won, or your hero is dead.&#10;&#10;",
        "artist": "A. Tran"
    },
    {
        "name": "18Ardennes",
        "description": "18Ardennes is an 18xx game set in northwestern Europe, including northern and eastern France, Belgium, the&#10;southern part of the Netherlands, and the Rhine-Ruhr basin of Germany. Designed by David Hecht, the game has a one-dimensional stock market with 22 different companies: 6 public ones, 15 minor ones and a special one used only for 4-player games.&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "The Adventurers: The Temple of Chac",
        "description": "The publisher says: &#10; The Adventurers features a fast-paced thrilling run through the Temple of Chac, the Mayan rain god. As your intrepid adventurers delve through the ruins, they will face deadly traps guarding the ancient relics they prize.&#10;&#10;User Summary:&#10;&#10;A very light dice-roller, basically a fun simulation of Indiana-Jones-style temple robbers. Players move through a Mayan temple, risking constant death while trying to get to the exit, carrying as much treasure as they dare. The more treasure cards you have, the fewer actions you might get this round. If your character gets killed, a second one can drop in and you may still get enough treasure and escape to win.&#10;&#10;The temple starts with a room of crushing walls, leading into a winding passage that takes you past a lava pit and locked alcoves. The passage goes on, with two short-cuts that might save you time; a fast river or a rickety wooden bridge. You must balance attempts to grab treasure from the rooms, as you pass through, with staying ahead of a massive boulder, tumbling down the passage after you. If you have to let the boulder pass or be crushed to death, then you're forced to jump in the river and risk drowning just to get ahead. Otherwise, the boulder reaches the exit before you, blocking it and you're trapped forever.&#10;&#10;A mix of very basic lucky dice-rolling, lucky card draw for the treasure, and some decision-making about possible risks. Beautifully produced, with 12 small but detailed plastics miniatures, and an exotic and deadly temple. Adults may tire from repeats of The Adventurers, but kids will get lots of thrills.&#10;&#10;",
        "artist": "Guillaume Blossier,Miguel Coimbra,Édouard Guiton,Frédéric Henry,Goulven Quentel"
    },
    {
        "name": "Jenga Max",
        "description": "Jenga Max is a dexterity game similar to but different from Jenga.  Players take turns attaching plastic pieces to the top of a tower.  There are different ways of attaching pieces together, and if an added piece disturbs the balance of the tower, it will fall down and the player loses.  The winner is the last play who successfully placed a playing piece.&#10;&#10;",
        "artist": "Edison Girard"
    },
    {
        "name": "Trivial Pursuit: Team Edition",
        "description": "Players work in teams in this edition of Trivial Pursuit.  The game consists of four rounds of six types of questions: Multiple Choice, Name Six, Go for Broke, Reference, More or Less, and &quot;Are You the Expert?&quot;.  Instead of answers simply being right or wrong, answers are worth 1 to 6 points, depending on how correct the answer is or whether it was answered correctly on the first try.  The team with the most points at the end of the game wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Power Grid: Factory Manager",
        "description": "Power Grid: Factory Manager is the new stand-alone game in the world of Power Grid. It was released at Spiel '09 in Essen, Germany.&#10;&#10;Each player owns a factory and tries to earn the most money during the game. To be successful, each player must use his workers to buy the best machines and robots at the market and to run the machines most effectively in his factory. Because of increasing energy prices, the players must be careful to check the energy consumption of their factories and to avoid using only energy-consuming machines. Otherwise, their profit will suddenly vanish, the worst fear of a good businessman.&#10;&#10;Power Grid: Factory Manager uses a clever market mechanism for choosing the supply of factory tiles in the market.&#10;&#10;",
        "artist": "Lars-Arne \"Maura\" Kalusky"
    },
    {
        "name": "Ninja Burger: Secret Ninja Death Touch Edition",
        "description": "Now you can join the elite Ninja Burger delivery team! You will learn to deliver tasty burgers and fries anywhere. You will bring honor to your franchise. Failure is not an option. &#10; Based on the popular website at www.ninjaburger.com, this hilarious card game, designed by Steve Jackson, pits you against your fellow trainees in a new Ninja Burger store. Learn the secrets of stealth, swordsmanship, and customer service. Fight for honor, respect, big tips, and that coveted promotion . . . &#10; This new, deluxe edition combines the original Ninja Burger with the cards from the supplement, Sumo-Size Me!; and adds counters for tracking honor and money. It's fast-moving. It's fun. You get to be a ninja. What more can you ask from a game? &#10; No matter how secure your office, how deep your bunker, how dedicated your guards . . . we deliver your burger in 30 minutes or less. &#10; Boxed game with 216 oversized cards, 3 black ninja dice, counters, and a rulesheet. &#10; &#10;Reimplements:&#10;&#10;    Ninja Burger&#10;    Ninja Burger 2: Sumo-Size Me!&#10;&#10;&#10;&#10;&#10; &#10; Reimplemented by:&#10;&#10;    Control-Alt-Hack&#10;&#10;&#10;&#10;&#10;",
        "artist": "Greg Hyland"
    },
    {
        "name": "Beer & Pretzels",
        "description": "In Beer &amp; Pretzels, players throw coasters onto a table. And then they get money. And then they throw more coasters. And then they get more money. This very complex and detailed process repeats until the end of the game at which point the player with the most money wins, just like in real life. At that point the winner will claim that Beer & Pretzels is the best game ever, and the losers will claim that the game is fundamentally flawed, and most likely broken.&#10;&#10;Just by coincidence, each coaster has an image of either pretzels or beer on it. Different pretzels have different values. Beer doubles your money. Players only score for items that are completely visible... items entirely or partially obscured by other coasters don&rsquo;t count. There tends to be name calling, bragging, self-high-fiving and the occasional brawl during the game, all of which add to the rich atmosphere and theme.&#10;&#10;&#10;WARNING: Beer &amp; Pretzels should be played with caution. Unmitigated use of this game could result in anxiety, agitation, panic attacks, lapsing into inconsistent foreign accents, irritability, hostility, aggressiveness, double vision, drooling, impulsivity, restlessness, extreme hyperactivity, unusual changes in behavior, kidney problems, long term memory loss, narrow angle glaucoma, itching, right upper belly pain, insomnia, fever, an inability to line up buttons properly on dress shirts, dark urine, yellow skin/eyes, unexplained flu-like symptoms, anal leakage, dizziness, yodeling, hive clusters, nausea, fainting upon standing, stiff muscles, uncontrollable cravings for onion rings, confusion, severe liver problems, barking, high fever, increased frequency of toe stubbing, dry mouth, constipation, sudden uncontrollable left-handedness and decreased appetite. This is not a complete list of potential side effects. Ask your doctor if Beer &amp; Pretzels is right for you.&#10;&#10;",
        "artist": "Jordana Gonzálas"
    },
    {
        "name": "Who Would Win",
        "description": "In Who Would Win? two players each draw one character card, then turn up an event card. Each player then has 20 seconds to argue why his character would win whatever event is presented. Why would Albert Einstein beat Darth Vader in a gardening contest? Why would Donald Trump prove to be a better figure skater than William Shakespeare? You tell me!&#10;&#10;The other players serve as the jury and vote on which player had the better argument; that player receives the event card. The first player to win five event cards wins the game.&#10;&#10;",
        "artist": "Mathieu Beaulieu"
    },
    {
        "name": "Picket Duty: Kamikaze Attacks against U.S. Destroyers – Okinawa, 1945",
        "description": "By the time of the invasion of Okinawa in April 1945, the US Navy devised a plan to help ward off the expected kamikaze attacks during the battle for the island. In order to provide an early warning system for impending kamikaze attacks, the US Navy established 16 radar picket stations around the island  Picket Duty is a solitaire game where you - as the captain of a Fletcher Class destroyer - fend off kamikaze attacks while performing picket duty off Okinawa. The game covers the time period from late March 1945 to late June 1945. Your goal is simple - survive.&#10;&#10;The game comes with a basic game, advanced game, six historical scenarios, two hypothetical scenarios, a mini-campaign and a full campaign. Optional rules are also included. Each game turn is divided into three phases, each depicting an eight hour period. Key crew members are depicted with certain functions, as well damage control teams. 27 types of Japanese planes are represented. Some planes have special attack capabilities.&#10; Game features include: Weather - Damage Control - Ammo and Fuel Consumption - Ship Trim and Listing - Land and Ship Radar - Air and Surface Fire Support - Ohka attacks, and more.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Agricola Express",
        "description": "The game takes place over 3 harvests, with 3, 2, and 1 round each. In each round, you get 2 actions base, plus an extra action for each baby you have. An action consists of rolling all the dice and picking one set to use.&#10;&#10;You can choose occupations, which help you manipulate the dice before you select your set of dice to use. You may build improvements, which help you score points or convert produce or animals into food. You may improve your farm by extending your house, plowing fields, or building pastures. You may gather Produce (food, grain, or vegetables), Resources (reed, wood, brick, or stone), or Animals (sheep, boars, or cattle). And, of course, you can have babies--but only if you have room in your house.&#10;&#10;After each harvest, you score points based on how well you've done. You might lose points. The person whose total score across all 3 harvests is the highest wins.&#10;&#10;This game was created for the Print &amp; Play Dice Contest as a fan homage to Agricola by Uwe Rosenberg and Lookout Games, and is posted for non-commercial use with the permission of Lookout Games.&#10;&#10;Some icons on the dice are re-used from Agricola; new icons were created by the designer.&#10;&#10;Microbadges:&#10;&#10; - Agricola Express Fan&#10;&#10; - Agricola Express Fan&#10;&#10;",
        "artist": "Jesse McGatha"
    },
    {
        "name": "Arcana",
        "description": "Game description of the 2011 revised edition from the publisher:&#10;&#10;Welcome to Cadwallon, an infamous city known for the chicanery of its artful guilds! Can your guild sweep through its districts and gain power through recruiting influential citizens and acquiring valuable relics?&#10;&#10;The revised edition of Arcana is a card game of recruitment and resource gathering for 2-4 crafty leaders. Command a guild of loyal agents during a series of district encounters against your opponents. Score the most prominent citizens, advantageous locations, and valuable treasures through bribery and power struggles. Collect the highest amount of victory points to become the master guild of Cadwallon!&#10;&#10;This vibrant game creates a fantastical atmosphere for players to enjoy while they attempt to best their opponents through strategic card play. Make your guild the most influential by winning Stake cards and strengthening your deck with impressive Personalities, advantageous Locations, or tempting Relics to use in bribery.&#10;&#10;The revised edition of Arcana introduces two new guilds to choose from, the Guild of Fortune-tellers and the Guild of Architects, as well a variety of optional rules that players can utilize to enhance their experience. Players can customize their guild, fulfill objectives, recruit Militia, invoke the ability of their Guild Masters, affect game play through random events, or optimize tactical strategy through card discards. Which variant will you use in your game?&#10;&#10;Summary of Play&#10;&#10;Arcana is played over a series of rounds that are comprised of two phases, the Intrigue phase and the Resolution phase. Send Agents from your unique guild deck to any of Cadwallon&rsquo;s districts to claim control of Stake cards: Personalities, Locations, and Relics, all of which award victory points.&#10;&#10;During these district encounters players gain control of Stake cards by playing their Agent cards. Stake cards are won through meeting or exceeding the card&rsquo;s main arcanum: either Military, Political, Spiritual, or Financial. Whichever Agent has the highest matching arcanum type wins the current revealed Stake card in that district.&#10;&#10;Of course if the Stake card you are after is a Personality card you can choose to bribe them with a Relic Card instead, immediately ending the phase and wresting the victory points from your opponents should you succeed.&#10;&#10;Players can increase the mystery of the final outcome through bluffing. Players control two friendly distracts (piles of Stake cards) in which they can place their Agents facedown. Will your opponent chance opposing you when he is uncertain of your arcanum value?&#10;&#10;",
        "artist": "Paul Bonner,Gary Chalk,Miguel Coimbra,Nicolas Fructus,Édouard Guiton,Florent Maudoux,Paolo Parente,Goulven Quentel"
    },
    {
        "name": "Dungeon Lords",
        "description": "In Dungeon Lords, you are an evil dungeonlord who is trying to build the best dungeon out there. You hire monsters, build rooms, buy traps and defeat the do-gooders who wish to bring you down.&#10;&#10;From the publisher's webpage:&#10;&#10;Have you ever ventured with party of heroes to conquer dungeons, gain pride, experiences and of course rich treasure? And has it ever occurred to you how hard it actually is to build and manage such underground complex filled with corridors and creatures? No? Well now you can try. Put yourself in role of the master of underground, summon your servants, dig complex of tunnels and rooms, set traps, hire creatures and try to stop filthy heroes from conquering and plundering your precious creation. We can guarantee you will look on dark corners, lairs and their inhabitant from completely different perspective!&#10;&#10;Each turn, players use a hand of cards to choose where to place their worker.  Actions vary from mining gold, hiring monsters, buying traps etc.  Each action has three spots available - with each spot having different effects (e.g. mining gold lets you mine more gold in each spot).&#10;When using the cards, two cards will become locked and will not be able to be used next turn.&#10;&#10;There are 4 turns to place actions for each game &quot;year&quot; and two game years in a whole game.&#10;Each turn is identified as a &quot;season&quot;.  Each season, players will get to see the heroes and events to come in the following season.  Thus allowing them to prepare.&#10;&#10;At the end of each season (after the first), heroes will be allocated to each player according to their level of evil.  Heroes range from mighty heroes to sneaky thieves.  Each hero has their own power for which the player needs to prepare for.&#10;Finally, at the end of each year, the heroes will travel down into the dungeon to fight.&#10;&#10;Scoring in the game is based upon what you have built, the monsters you have hired and the heroes you have captured.&#10;&#10;",
        "artist": "David Cochard"
    },
    {
        "name": "Alcazar",
        "description": "New game from KOSMOS, for the end of 2009.&#10;&#10;The game is about building castles and villas. The bigger the better. The bigger your building is, the more people who can live inside and the more valuable they get. But watch out - the more you build, the more space you need - so it can be possible that your small building will be 'eaten' by an opponent's big castle or villa. Your landlords will lose their house and furniture except if they are sold for enough, at the right moment, to get some hidden silver instead. The winner will be the player with the biggest buildings and the most money.&#10;&#10;(Found on KOSMOS-Homepage - free translation from German)&#10;&#10;This game seems to be the game that Altura should have become.&#10;&#10; Re-implements: &#10;&#10;&#10;     Big Boss&#10;&#10;&#10;",
        "artist": "Eckhard Freytag"
    },
    {
        "name": "Alhambra: Big Box",
        "description": "One big box containing the Alhambra base game plus all five of its current expansions. Its packaging is designed to store the expansions separately.&#10;&#10;Expansions Included:&#10;&#10;    Alhambra: The Vizier's Favor&#10;    Alhambra: The City Gates&#10;    Alhambra: The Thief's Turn&#10;    Alhambra: The Treasure Chamber&#10;    Alhambra: Power of the Sultan&#10;&#10;&#10;&#10;&#10;",
        "artist": "Hans-Jörg Brehm,Jo Hartwig,Christof Tisch"
    },
    {
        "name": "Carcassonne: Wheel of Fortune",
        "description": "Carcassonne: Das Schicksalsrad (English: Wheel of Fortune) is both a full replacement for the base game of Carcassonne and an expansion to the original base game. It includes 72 tiles, consisting of 63 tiles released in the original base game, 6 from Inns & Cathedrals, 1 from Traders & Builders and 2 from King & Scout. It also includes a special replacement start tile which depicts the Wheel of Fortune, a new mechanic unique to this edition of the game. The new start tile is the size of 16 tiles, arranged in a 4&times;4 square and is built using some of the tiles removed from the base game.&#10;&#10;Nineteen tiles from the game have numbers printed on them allowing players to randomly spin the Wheel of Fate (between 1 and 3 spaces around the wheel). Otherwise, a player may choose to place a follower on the wheel if they decline placing a follower that turn. The results of the Wheel vary depending on which of the sixths of the wheel the pig lands on. Results vary from forcing all players to remove a follower from the board to rewarding the player who moves the pig with three bonus points. There are six outcomes in all.&#10;&#10;Play of this game does not require ownership of any Carcassonne base game. All expansions are compatible with this game. This game can also be played with the base game as an expansion, using its wagon wheel watermark to differentiate it from the base game.&#10;&#10;The German edition of this game includes a book Carcassonne -&nbsp;Das Schicksalsrad by Helene Luise K&ouml;ppel.&#10;&#10;The English edition of the game was released in October 2009 by Rio Grande Games.&#10;&#10;Part of the Carcassonne series.&#10;&#10;",
        "artist": "Doris Matthäus"
    },
    {
        "name": "Stronghold",
        "description": "Stronghold is a game telling the story of a siege. Players take opposite sides, one has to defend the stronghold, the other has to break into the castle as soon as possible. As time passes, defenders get Victory Points every turn for their efforts on the walls.&#10;&#10;The game board represents the stronghold itself as well as the surrounding terrain, where enemy forces are placed and whence they proceed to the walls.&#10;&#10;The defender has a small number of soldiers manning the walls, while the invader has an infinite legion of attacking creatures. A desperate fight is taking place every single turn. The invaders build war machines, equip their soldiers, train them and use black magic rituals to achieve victory. Meanwhile, defenders repair walls, build cannons, train soldiers, and do everything they can to hold the castle as long as possible.&#10;&#10;",
        "artist": "Mariusz Gandzel,Tomasz Jedruszek,Michał Oracz"
    },
    {
        "name": "A Brief History of the World",
        "description": "A Brief History Of The World is just that: a sweeping ride through the history of mankind in the space of just a few hours. The game features fifty of the mightiest Empires ever known, from the dawn of Civilisation through to the Twentieth Century - Egypt, Assyria, Persia, Greece and Imperial Rome, the Huns and Mongols, the Arabs and the Ottoman Turks, the dynasties of China and kingdoms of India, Incas and Aztecs, Portugal and Spain, France, Britain, and Germany. Can you take on the mantle of Alexander or Caesar, Genghis Khan or Napoleon? Can you write your name into the pages of history and lead your Empires to victory?&#10;&#10;Components include:&#10;&#10;Giant Map Board&#10;180 plastic playing pieces&#10;130 card counters&#10; - 32 Area Values&#10;    * 5 x Epoch 1&#10;    * 2 x Epoch 2&#10;    * 3 x Epoch 3&#10;    * 4 x Epoch 4&#10;    * 4 x Epoch 5&#10;    * 11 x Epoch 6&#10; - 30 City/Capitals&#10; - 20 Monuments (4 types x 5)&#10; - 20 Forts&#10; - 18 Bonus tokens (1's, 2's 3's - 6 of each)&#10; - 6 Gold Markers (1 in each player colour)&#10; - 4 Fleets&#10;42 Empire cards (6 epochs, 7 cards per epoch) &#10;54 Event cards (6 epochs, 7 cards per epoch, plus 12 initial events)&#10;6 Epoch maps&#10;6 Six sided dice&#10;4 Plastic Stands&#10;1 Epoch chart&#10;1 Array&#10;&#10;This is a significantly revised version of History of the World.&#10;&#10;Re-implements:&#10;&#10;     History of the World&#10;&#10;&#10;&#10;&#10;",
        "artist": "Peter Dennis"
    },
    {
        "name": "Свинтус",
        "description": "From publisher:&#10;&#10;Svintus is a simple and exciting card game for any group of people. It is based around a deck of numbered cards in four different colors. To start the game, each player receives 8 cards and the goal is to get rid of them as soon as possible.&#10;&#10;The fun of the game lies in the special Pig cards that make the game unpredictable and exciting. You can force your opponent to miss their turn (Pigass), draw 3 additional cards (Greedypig), change the direction of play (The Pig-go-round), change the color of the card in front of you (Pigameleon), forbid any talking at the table (Silent-Pig), or check the reaction time of your friends (Lightning-Pork). Finally, it will be up to you to steal your friends&rsquo; turns right from under their noses, or sick the Pig cards on them. All in all, you&rsquo;ll have to be a real pig to your friends.&#10;&#10;Re-implemented by:&#10;&#10;    Swintus 2.0&#10;&#10;&#10;&#10;&#10;",
        "artist": "Timofey Bokarev,Sergey Dulin"
    },
    {
        "name": "Time's Up! Academy",
        "description": "Time's Up! Academy is a charades-based party game for teams of two or more players (and is best with teams of two). Before the game begins, each player looks at several cards featuring old TV series, music and movies and chooses some of them. Each player's cards and shuffled to form a deck, and this deck is used for each of the game's three rounds.&#10;&#10;In each round, team members take turns trying to get their teammates to guess as many names and titles as possible in 30 seconds. In round 1, almost any kind of clue is allowed, and the cluegiver cannot pass on a card. In round 2, no more than one word can be used in each clue (but unlimited sounds and gestures are permitted); the cluegiver can pass on any card he likes, and the teammates can give only a single answer. In round 3, the cluegiver can use no words at all and can pass as often as he likes; again, teammates are allowed only a single guess. Give good physical clues in round 1, and they'll pay dividends down the road when you need to keep your mouth shut and gesture like a maniac before time's up!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Telestrations",
        "description": "From the publisher's press release:&#10;&#10;&quot;Each player begins by sketching a TELESTRATIONS word dictated by the roll of a die. The old fashioned sand timer may limit the amount of time they get to execute their sketch, but it certainly doesn't limit creativity! Time's up! All players, all at the same time, pass their sketch to the next player, who must guess what's been drawn. Players then simultaneously pass their guess -- which hopefully matches the original word (or does it??) -- to the next player who must try to draw the word they see -- and so on.&quot;&#10;&#10;&quot;Telestrations contains eight erasable sketchbooks and markers, a die, a 90 second sand-timer and 2,400 words to choose from.&quot;&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "Campaign Manager 2008",
        "description": "Campaign Manager 2008 challenges players to develop a winning political strategy within the tumultuous context of the 2008 presidential campaign. Employing a new take on card driven game systems, each player will create a unique deck that represents their advice to their candidate. The players will struggle to influence voters in the critical swing states from this election, while targeting key constituencies that just might put them over the top. Players will try to define the key issue in the states. Will McCain dominate the national security debate, or can Obama play on people's fears over the economy? As the campaign manager of a national presidential campaign, you will either identify the road to the White House, or the road to irrelevance.&#10;&#10;User review: The object of the game (and it is a game, not a simulation) is to lead your candidate, John McCain or Barack Obama, to victory by getting 270 electoral votes. Twenty battleground states are up for grabs in this game of cardplay.&#10;&#10;Each player has a deck of forty five Campaign Strategy cards; only fifteen can be used in the game. (The rules suggest a selected fifteen cards for novices.) Each player also has a deck of ten battleground state tiles. Each player will select two of their states to put into play. (again, the rules make a suggestion for novices.)&#10;In turn, a player either plays a card from one's own hand and follows the instructions on it or draws a card if fewer than five are already held.&#10;&#10;To win a state, a player must get complete support from the state's voters in the issue which has more support of the people. Each state also has two key demographics. A shift in which demographic takes precidence also may affect the effect of a player's cards.&#10;&#10;Some cards require players to go &quot;negative.&quot; These cards require the opponent to roll a die and the result may give the opponent an unintended benefit.&#10;&#10;Whenever a player wins a state, the electoral votes are added to that candidate's tally. A state is brought into play by the winning manager and chance card is put into effect.&#10;&#10;The game is over when one manager scores 270 electoral votes. That player is the winner. A tie, resulting in winner, is possible.&#10;&#10;",
        "artist": "Josh Cappel"
    },
    {
        "name": "Warlords of Europe",
        "description": "An Area movement, epic strategy game of medieval warfare set in 13th century Europe. Players compete to militarily dominate the fiefs and castles of Europe and thus be crowned Emperor by the Pope.&#10;&#10;Warlords of Europe features nine major kingdoms of the time period, each subdivided into vassal fiefs. Each fief has its own terrain that affects its economic and defensive value. The Pope, Merchant, and Conquest decks of cards keep the action unpredictable. But, good fortune is no replacement for solid strategy, cautious planning and an excellent sense of timing. Players may start in any of the nine kingdoms making each play a unique experience.&#10;&#10;So, pick up your swords and charge into Warlords of Europe!&#10;&#10;The game set comes with:&#10;24&quot;x30&quot; full color game board&#10;212 detailed plastic pieces&#10;12 page color rulebook&#10;115 mini poker chips&#10;12 dice&#10;94 cards&#10;4 player aides&#10;72 punch-outs&#10;&#10;",
        "artist": "Mark Churms,Ken Griffin,Nathan Hood,Russ Rupe,Travis Tye"
    },
    {
        "name": "High Noon Saloon",
        "description": "Game description from the publisher:&#10;&#10;On a windin' desert road in the middle of nowhere lies a town with no name. In this town you'll find a place where no slight goes unanswered and no fight stays private, the roughest, toughest waterin' hole in the Old West &ndash; the High Noon Saloon. If you're lookin' for a fight, you've come to the right place.&#10;&#10;In the action-packed game High Noon Saloon, you are a combatant in an all-out brawl fought in an Old West Saloon. Shoot it out from a distance or get in close and beat on your opponents directly. Move between different parts of the saloon to get the upper hand. Whatever you do, make sure to keep your guard up &ndash; if you're not careful, you'll get beaten to a bloody pulp, shot full of holes, or both! The last one standin' wins, and there ain't no prize for second.&#10;&#10;High Noon Saloon also includes special rules and cards for playing the game in teams.&#10;&#10;",
        "artist": "Beth Trott"
    },
    {
        "name": "Ubongo 3D",
        "description": "Newest addition to the Ubongo series. This time players place wooden tiles over two layers in 2-sided puzzle cards, one side for beginner players and one for more advanced ones. Players collect gemstones for their performance and player with the most valuable gem collection at the end wins the game.&#10;&#10;",
        "artist": "Karl-Otto Homes,Nicolas Neubauer"
    },
    {
        "name": "Schinderhannes",
        "description": "Schinderhannes is a deduction game based on the mechanisms of Old Town.&#10;&#10;The story is about the (in)famous robber Johannes B&uuml;ckler, widely known as &quot;Schinderhannes&quot;. He robbed, stole and murdered in Germany in the 18th/19th century for (only!) about 5 years, before he was beheaded in Mainz in 1803.He was one of the most famous executees (at that court) and his execution was watched by thousands. Nevertheless, not much about the man is known.&#10;&#10;In the game the players have to find out, where Schinderhannes' crimes took place .They play cards (&quot;rumours&quot; or &quot;police files&quot;) with information like &quot;In the Autumn of 1798, Schinderhannes and Peter Petrie tried to steal a donkey in one of these places: Antes M&uuml;hle, B&auml;renbach, Hundsbach, Meddersheim&quot; or &quot;The Livestock theft took place in the South&quot; or &quot;The Donkey Theft was in the neighbouring district, next to the Arrest&quot;. For each clue marker a player removes due to this, he receives one point. If all crimes are defined (only one place left for each crime), the game ends and the player who has gathered the most points wins.&#10;&#10;",
        "artist": "Christian Opperer"
    },
    {
        "name": "Nostra City",
        "description": "New-York, sometime in the 90's.&#10;&#10;War rages between organized crime and the Feds. After years of procedure, surveillance and undercover work, Johnny Gota, the Godfather of the biggest crime syndicate in the &ldquo;Big Apple&rdquo; has been arrested and faces 246 charges ranging from simple extortion to homicide.&#10;&#10;After what promises to be an explosive trial, the Don will probably end up in a locked subterranean cell for 23 hours a day for the rest of his life.&#10;&#10;He's made it known to his faithful lieutenants that if he gets off scot-free, he'll retire and leave his place to whoever takes the best care of the Family's business while he is away...&#10;&#10;For the Made Men, the message is clear: corrupting the jury, bumping off witnesses, and bribery will decide the verdict of the trial! Not only that, the race for honor has also begun!&#10;&#10;But to some, power isn't earned &ndash; it's taken!&#10;&#10;The players play the role of the Boss' lieutenants, who are supposed to manage the Family's business and plot to get their leader cleared. But turncoats hide among them, people who want the Boss to be found guilty just so that they can lay claim to the Family by force, or because it's their job as undercover FBI agents!&#10;&#10;Nostra City is a fictional-reality game starring a New-York crime syndicate as it appears in Gangster movies: a cruel and violent world where, under the cover of a tradition of silence and loyalty, everything is allowed.&#10;&#10;",
        "artist": "Nicolas Fructus"
    },
    {
        "name": "The Red Dragon Inn: Gambling? I'm In!",
        "description": "From the publisher:&#10;&#10;The Red Dragon Inn: Gambling I'm In! is a game about the games that the heroes play when they gamble at the Red Dragon Inn. Now, players of The Red Dragon Inn, The Red Dragon Inn 2, The Red Dragon Inn 3, and The Red Dragon Inn 4 can play out an actual round of gambling when they play the &quot;Gambling? I'm In!&quot; card! Even better, the gambling games also can be played on their own as standalone games, or as part of your RPG, or LARP. The game will come with a 93 card Rogues and Warriors Deck, a bunch of 6 sided dice, coin tokens, debt and loan tokens and rules for at least 7 games! Some of the games use dice. Some of the games use cards from the Rogues and Warriors Deck, and some of the games use dice and cards.&#10;&#10;This card deck was developed as a stand-alone game as well as a possible replacement to the gambling component in Red Dragon Inn 1 and 2.&#10;&#10;The deck consists of 90 cards. The deck is broken down into three colors (rust, green, and blue) with 6 different symbols. The card faces feature 1 Knight, 2 Ladys, 3 Bards, 4 Merchants, and 5 Rogues per card symbol. There is a die symbol on each card with a number of pips equal to the number of cards of its type and a set of symbols on the right that denote character superiority in certain game variations. Some games with this deck involve 6 D6 dice (not included).&#10;&#10;There are five base games included and are as follows:&#10;&#10;&#10;     Rogues and Warriors - Similar to two card poker, each player is dealt two cards. You compare these two cards to the symbols on the right to determine how powerful your hand is.&#10;     Threes - Uses all dice, no cards. &#10;     Jack of All Trades - Uses 5 dice and only the Rogue and Warrior cards. The theme is putting your workers to work and using the cards and dice to complete jobs.&#10;     Den of Thieves - No dice. Hands are dealt and players use the special abilities of each character to influence hand weight and scoring.&#10;     The Wheel (and The Clock) - No dice. Players try to guess what cards others are collecting in order to gain points and win the round.&#10;&#10;&#10;When combined with The Red Dragon games, when a player plays the &quot;Gambling, I'm in!&quot; card, the player may decide to choose any game from the list to play instead of the normal gambling rules. Special rules are included for each variation when combining this with the normal game.&#10;&#10;There will be other variations available as Slugfest has invited players to create their own games with the deck and the ones deemed best will be included in later rules updates.&#10;&#10;",
        "artist": "Kennon James"
    },
    {
        "name": "Ratuki",
        "description": "Ratuki (a.k.a. Ligretto Crazy) plays much like the card game Ligretto in which each player wants to get rid of her pile of cards first. Each player starts with a deck containing the same cards; each card shows a value from 1-5, sometimes as a numeral, sometimes with fingers on a hand, sometimes spelled in various languages, and so on.&#10;&#10;Everyone plays at the same time. Players take three cards in hand, then all try to play cards to the center of the table, starting with 1s, then 2s, etc. The number of card piles in play can't exceed the number of players. When playing a card, a player can lay down a card that's one higher or one lower than the top card on a pile. As soon as a player lays down a 5, she claims the pile, placing it in her score pile. Players can discard cards as they like, but they lose 1 point for each card discarded.&#10;&#10;As soon as a player runs out of cards, she can end the round. Everyone scores 1 point for each card in their individual score pile, then loses 1 point for each card discarded, each card in hand, and each card still in their pile. Players then sort the cards and start a new round. When one player has totaled 100 or more points, she wins!&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "1914: Offensive à outrance",
        "description": "(from GMT website:)&#10;&#10;1914, Offensive &agrave; outrance, The Initial Campaigns on the Western Front in WWI realistically covers the battles fought in Belgium, France, and Germany during the first months of World War One.&#10;&#10;1914, Offensive &agrave; outrance (translation: Offensive to excess) is a comprehensively researched model that explores this fascinating set of campaigns with an accurate order of battle and detailed game map. The map encompasses the entire theater of war from the English Channel to the Swiss Border. The game system used is a streamlined derivative of the 1914, Twilight in the East system, modified to speed play, with care not to lose focus on those aspects of warfare that made the opening stages of WWI so unique. This game system, in conjunction with the accurate map, allows the German advance to be conducted along historical routes with the eminent &ldquo;Open Flank&rdquo; present (instead of units strung out from map edge to map edge). The Allied player has an opportunity to recreate a &ldquo;Miracle of the Marne&rdquo; type victory or to stop the Germans earlier. Likewise, the German player has a chance to change history and defeat the Allies&rsquo; armies in 1914.&#10;&#10;The Grand Campaign scenario covers the period from the fall of Liege on August 16th to exhaustion at Ypres in mid-November. Two shorter scenarios, The Battle for Lorraine (a learning scenario) and From the Marne to Stalemate are also provided.&#10;&#10;1914, Offensive &agrave; outrance is a playable &ldquo;Monster Game&rdquo; designed with the expressed goal that the majority of the game can be completed by four dedicated players in one five-day long Expo. The 24-page rules booklet is concise, well written and organized. The game is exciting and gives wonderful insights into one of the most important campaigns of the twentieth century. The result is that 1914, Offensive &agrave; outrance is a game that the &ldquo;WW1 enthusiast&rdquo; must have and that a gaming connoisseur will enjoy.&#10;&#10;Time Scale: Game turns vary between two and four days in length.&#10;Map Scale: Eight kilometers per hex.&#10;Unit Scale: Division/Brigade.&#10;Number of Players: one to many (well suited for four players).&#10;&#10;Game Designer: Michael Resch&#10;Research and Design Assistance: Rian van Meeteren&#10;Developed by: Dick Vohlers&#10;Map Design Assistance: S. G. Stewart&#10;&#10;",
        "artist": "Rodger B. MacGowan,Michael Resch"
    },
    {
        "name": "Pirate Code",
        "description": "Who can be the most cunning pirate of them all? Guess the other players&rsquo; secret codes before they discover yours and become the pirate captain. A game of logic and luck, secrets and treasures for 2 to 4 players.&#10;&#10;Pirate Code is similar to the game Mastermind (where you try to crack your opponent's secret color code of pegs). First you build the game itself from the provided Lego components, then 2-4 people can play the code game.  Once the game is assembled, players set up their own secret code by placing 4 of the colored jewels inside their treasure chest. Players then take turns rolling the die, selecting colored jewels to 'guess' the codes of the other players. Similar to Mastermind, jewel placement is confirmed as correct/right place, correct/wrong place, or not correct at all. Play continues until all the codes have been cracked; last person standing is the winner.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Race 3000",
        "description": "Do you have what it takes to cross the finish line first and win the trophy? Use shortcuts, overtake or turbo boost past your opponents to get in front and change lanes to avoid the oil slicks in your way. The LEGO Dice brings a new twist on a classic racing game for 2 to 4 players.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Lava Dragon",
        "description": "Prove you are the bravest knight of all by being the first one to summon the dragon from the top of the volcano. Avoid the lava and block your opponents as you climb to victory. With the LEGO Dice no two games of Lava Dragon are ever the same.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Monster 4",
        "description": "Night has fallen in the graveyard and the monsters have come out to play with the skeletons.&#10;&#10;First the graveyard is built from Lego. The graves are divided into four sections. Two sections are light grey and the other two are darker.&#10;At their turn the players throw the die. When the grey color shows up, the player may place its monster on a grave corresponding to the grey color. If the four colors shows up, a player can change its monster with another player. If the black field shows up, the spider comes into play to scare the zombies away. A skeleton is placed when the white field has thrown. A skeleton can be used by all the players.&#10;&#10;The first to get four of their monsters in a row wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Magikus",
        "description": "Be the first to cast the magic spell in the cauldron! To prepare the game, build the shelf, ingredients, and special die from Lego pieces and place the 16 ingredients (4 ingredients for each of the four colours) on the shelf. On your turn, place the owl above a column or beside a row of the shelf, then roll the special die to see which ingredient you can take from the owl's column or row. If you roll black, steal an ingredient from an opponent. The first player to acquire ingredients in all 4 colours casts the magic spell and wins.&#10;&#10;The game comes with a few optional rules and encourages players to make their own rules.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Robo Champ",
        "description": "There is a contest at the robot factory. The first to build a robot with all the correct colour parts will win this year&rsquo;s trophy and be named the Robo Champ. If someone takes a part you need you may have to steal it back to achieve victory.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Rush n' Crush",
        "description": "From the Publisher:&#10;First the players choose a driver from among six armed and dangerous psychopaths. They hop aboard futuristic, armoured and over-equipped vehicles. And the race begins. The goal is to be the first across the finish line, as only first place counts. No matter the game mode used, Arcade or Overdrive, the race is always a deadly obstacle course around a track made of ten reversible tiles, which can be assembled to build many different racetracks. Fire your engines, buckle your helmet, and be ready for the armed racing game!&#10;&#10;",
        "artist": "Mauro dal Bo,Jean-Baptiste Guiton,Matthias Haddad,Mathieu Harlaut,Paolo Parente,Goulven Quentel"
    },
    {
        "name": "Tensão Total",
        "description": "&#10;&#10;&#10;    &#10;         Risco Total is essentially Diamant/Incan Gold, with the exception that it was a non-authorized production of the game. According to game designer Bruno Faidutti, Grow Jogos e Brinquedos did not have license to produce this game, thus it was set apart from the official entries of Diamant/Incan Gold. An agreement has since been made between the authors and the publisher. Then, the licensed version was renamed to Tens&atilde;o Total, without any other changes except author credits.&#10;&#10;    &#10;&#10;&#10;All players play with a group of divers looking for treasures in deep sea.&#10;&#10;Every round a player need to decide if he will dive more or will go back to the surface. A card is turned, if it is a treasure the players who stay diving will take the gold coins, but if you find a shark... look out, your oxygen can finish or you can find other threats in the deep sea.&#10;&#10;The diver with the most successfully retrieved money wins the game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Infinite City",
        "description": "A rich new world has opened up. Resources are plentiful, the economy is booming, and the capital city of this new world is expanding like never before! Even though many corporations scramble to stake a claim in the exploding prosperity, only one can claim ownership! Who will take over the Infinite City?&#10;&#10;Will you place the capital next to the port, claiming both as your own? Will you use the transit station to move another player&rsquo;s military base out of the way, or place your embassy to steal his temple? Will you try for a greater area under your control, or move to capture key buildings?&#10;&#10;Infinite City is a standalone tile game in which players become the leaders of corporations building an ever-sprawling city, maneuvering to control the largest districts while holding on to the most valuable buildings.&#10;&#10;Infinite City uses tiles to represent buildings, and colored pegs to represent control by players.  The tiles are mixed, five tiles are dealt to each player, and five tiles are placed face down in the shape of a cross at the center of the play area.  On their turns, players play a tile face up adjacent to one of the five starting tiles or a previously played tile, play one of their colored pegs on the tile, and follow the instructions on the tile.  These instructions may lead to playing additional tiles, drawing tiles, moving tiles previously played, turning face down tiles face up, taking tiles from opponents, preventing actions or even exchanging hands of tiles with other players.  When players finish their turns, if they have less than five tiles in their hands, they draw additional tiles so that they end their turn with at least five tiles.&#10;&#10;The game ends when one player places the last of his colored pegs, or the fifth Power Station tile is played.  Each player is awarded points for contiguous groups of at least three tiles controlled by him at a rate of one point per tile.  Some tiles have a point value number in the corner; players receive the number of points indicated for such tiles that they control.  Also, some tiles have silver rings; the player controlling the most of these receives one point per such tile.&#10;&#10;The player with the most points wins.&#10;&#10;",
        "artist": "Charles Urbach"
    },
    {
        "name": "Square Shooters",
        "description": "Square Shooters is a complete deck of playing cards printed on nine dice. The dice layout is a special, patented sequence which makes it possible to roll every straight flush, royal flush, and four-of-a-kind. With this patented layout, the dice can be used to turn many popular card games into dice games, including poker and rummy!&#10;&#10;The Square Shooters game set designed by Heartland Consumer Products includes a feature game to introduce the dice. Instructions for seven more games are included with the game set. Game versions available include a basic set (dice, game cards, scorekeeping chips, and a storage pouch) and a deluxe set (same as basic set but adds a dice cup, scorepad, and a deck of traditional playing cards while dropping the pouch).&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Gambit 7",
        "description": "&#10;&#10;&#10;    &#10;         Gambit 7 has been separated from Wits & Wagers based on game rule differences and at the request of the designer and publisher. &#10;&#10;    &#10;&#10;&#10;Gambit 7 is a new kind of trivia game - you don't need to know the answer to win! In Gambit 7, all players simultaneously write their answer to the same question and place it face-up on the Betting Board. All questions have a numerical answer, so even players that don't know the subject matter at hand can make a guess!&#10;&#10;Players then have a limited time to either bet on themselves or bet on another player's answers. The winning answer is the one that is closest to being correct, but no higher! Players earn points for either getting the winning answer or for betting on the player who does. The one with the most points after 7 rounds of questions is the winner!&#10;&#10;Gambit categories include: Business &amp; Economy; Art &amp; Literature; Geography &amp; Nature; History &amp; Government; Pop Culture; Science; Sports &amp; Leisure; and Wild Card. The set of questions in Gambit 7 were designed to be culturally appropriate for each specific language version.&#10;&#10;While Gambit 7 can be played with as few as 3 players, the more friends and family you gather, the more fun and excitement you will experience! With more than 7 players, simply split into teams of 2 or 3 and work together to answer the questions and decide how to bet.&#10;&#10;A german mini edition was published in 2008 for promotional use under the name &quot;Gambit 7 Das mini Spiel&quot;. It contains 7 cards and a ruleset printed on a seperate card.&#10;&#10;",
        "artist": "(Uncredited),Cyrille Daujean"
    },
    {
        "name": "High Frontier",
        "description": "In the near future, nanofacturing techniques will allow incredible new materials to be built atom by atom. But they can only be built in the zero-gravity and high-vacuum conditions in space. Various private and government enterprises race to establish a buckytube mechanosynthesis factory on a suitable carbonaceous asteroid. To do so, they accumulate tanks of water in orbiting fuel depots, to be used as rocket propellant. Also needed are remote-controlled robonauts to do the grunt work.&#10;&#10;The key to success is water in LEO (low Earth orbit). At first, water will be expensively supported out of the deep gravity well of Earth. But for a third the fuel and energy, water can be supplied from Luna, the moons of Mars, or other nearby hydrated objects.  Extracting resources at the work site is called In-Situ Resource Utilization (ISRU). Whoever develops ISRU technology able to glean water from space rather than Earth will gain the strategic high ground to make money through exoglobalization.&#10;&#10;In High Frontier, players are Earth governments which are racing to put together a functioning space program to extract resources and colonize the other planets, moons, and asteroids in our solar system.  Players use water in LEO as currency to bid on space-related patents for thrusters, refineries, and robotics.  Putting together a functional craft is not easy, as the heavier the craft becomes, the less maneuverable it is and the more fuel (also water in LEO) the craft will require, so players have to balance useful heavy parts with lighter, less functional parts.  Victory points are awarded for successful mineral extractions, and for being the first to reach key technologies and exploration points in the solar system.&#10;&#10;Now in its second edition.&#10;&#10;",
        "artist": "Phil Eklund"
    },
    {
        "name": "Win, Lose, or Banana",
        "description": "A super-light card game from Asmadi Games that made a minor splash at Origins in 2009. Players draw one of three cards, and whoever draws the &quot;Win&quot; card wins.&#10;&#10;The &quot;Who's the Banana?&quot; variant requires the winning player to guess which of the other two players has the &quot;Banana&quot; card.&#10;&#10;",
        "artist": "Cara Judd"
    },
    {
        "name": "Shootin' Ladders: Frag Fest",
        "description": "Another 'Good Game Gone Bad' from Smirk and Dagger Games.  This builds upon the same type of cookie carnage in &quot;Run for your Life, Candyman!&quot; but is totally amped up in a whole NEW game that parodies Chutes and ladders with delicious mayhem.&#10;&#10;From the box:&#10;&#10;The gingerbread men have left the confines of their sugar-frosted land and let their rage spill over into yet another family favorite board game, where total carnage has its &lsquo;ups and downs&rsquo;. The board&rsquo;s original slides and ladders once helped teach kids about morality. But in &quot;SHOOTIN&rsquo; LADDERS: Frag Fest&quot;, you&rsquo;ll more likely learn a lesson in &lsquo;mortality&rsquo; and that everyone gets their just desserts.&#10;&#10;So sling your M&amp;M16, load your Dessert Eagle and get ready to blast the other cookies to bits as you climb and slide your way to victory!&#10;&#10;Includes 7 ACTION-PACKED SCENARIOS&#10;with Team Play &amp; Free-For-All Modes:&#10;The Quick and the Crumbed &bull; Candyman Flag Capture  &bull;  Trophy Room&#10;Head Hunter  &bull;  Crumble Zone &bull; The Guns of Tobleronne &bull; The Dirty Half Dozen&#10;&#10;",
        "artist": "Curt Covert"
    },
    {
        "name": "Elemental Clash: The Basic Set",
        "description": "In ancient times long gone by, when the veil between the world of the humans and the realm of magic was thinner, allmighty wizards battled each other in epic duels to determine who was the master of sorcery and arcane wisdom. Armed with a Spellbook and with the aid of the enchanted Element-Stones, the sorcerers summoned fantastic Creatures and magical Spells. A wizard who had no more pages left in his Spellbook would eventually have lost the magical battle of wits.&#10;&#10;The aim of the game is to reduce the cards in your opponent&rsquo;s card-deck (or Spellbook) to zero by using the Spells and Creatures in your Spellbook. Players take turns that always follow the same structure. For each point of damage a Player receives through Creatures or Spells, he or she puts the top card of his or her deck on his or her Discard Pile (or Archive). Is a player unable to draw a card, he or she loses immediately.&#10;&#10;",
        "artist": "Douglas Harvey,Sven Nemet,Andreas Propst,Michael Rasmussen"
    },
    {
        "name": "Warhammer: Invasion",
        "description": "Warhammer: Invasion The Card Game is a two-player card game of intense warfare, clever kingdom management, and epic questing. Players must carefully allocate their resources as they seek to build their kingdom, complete quests, and attack the enemy&rsquo;s capital.&#10;&#10;Set in the rich and diverse Warhammer universe, player's can choose different factions that each have their own style. Will you play the indestructible grudge-bearing Dwarfs, the shrewd and manoeuvrable Empire, the savage and destructive Orcs, or the entropic and mutating forces of Chaos. Or will you cleverly craft an alliance, playing the combined might of the forces of either Order or Destruction?&#10;&#10;Warhammer: Invasion follows a similar model to that of Magic: The Gathering. Players will construct a deck of cards to their liking that they will use to battle against each other by drawing cards and using resources to play them. Cards can consist of monsters or heroes, one-off spells or abilities, and permanent structures, devices, or equipment. However, there are many differences which make W:I very different from Magic. Two of the main differences are in the release model and the ordering of the gameplay area.&#10;&#10;Rather than a blind collecting model, W:I follows Fantasy Flight Games' LCG model. Each expansion or chapter pack is released with the full contents known to the purchaser. Rarity is not a factor.&#10;&#10;Rather than playing your cards into the same area and relying on card draws for resources or extra cards, each player has a 3-zoneCapitol that they must protect and those sides are generally where cards are played. If an opponent causes enough damage to a section of your capitol it is &quot;burned.&quot; If two sides of your capitol are burned you lose. Depending on which side of your capitol you put a card into it will be able to different things. Units and buildings in the Kingdom Zone contribute to your available resource pool while ones in your Quest Zone cotribute to your card draws. Cards played into the Battlefield are used to attack opponents. Also, units in a zone being attacked by an opponent can be used to defend that zone from damage. This adds a large amount of tactical decisions when it comes to playing your cards. You must carefully balance building your economy with the ability to attack and defend.&#10;&#10;Warhammer Invasion LCG Core Set contains:&#10;&#10;* 1 Rulebook&#10;    * 220 Cards representing 4 factions&#10;    * 4 Capital Boards&#10;    * 35 Resource Tokens&#10;    * 60 Damage Tokens&#10;    * 4 Burning Tokens&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Battle Pack Expansion Cycles:&#10;&#10;&#10;&#10;&#10;    &#10;        &#10;1) The Corruption Cycle:&#10;&#10;    The Skavenblight Threat&#10;    Path of the Zealot&#10;    Tooth and Claw&#10;    The Deathmaster's Dance&#10;    The Warpstone Chronicles&#10;    Arcane Fire&#10;&#10;&#10;2) The Enemy Cycle:&#10;&#10;    The Burning of Derricksburg&#10;    The Fall of Karak Grimaz&#10;    The Silent Forge&#10;    Redemption of a Mage&#10;    The Fourth Waystone&#10;    Bleeding Sun&#10;&#10;&#10;&#10;&#10;&#10;        &#10;3) The Morrslieb Cycle:&#10;&#10;    Omens of Ruin&#10;    The Chaos Moon&#10;    The Twin Tailed Comet&#10;    Signs in the Stars&#10;    The Eclipse of Hope&#10;    Fiery Dawn&#10;&#10;&#10;4) The Capital Cycle:&#10;&#10;    The Inevitable City&#10;    Realm of the Phoenix King&#10;    The Iron Rock&#10;    Karaz-a-Karak&#10;    City of Winter&#10;    The Imperial Throne&#10;&#10;&#10;&#10;&#10;&#10;        &#10;5) The Bloodquest Cycle:&#10;&#10;    Rising Dawn&#10;    Fragments of Power&#10;    The Accursed Dead&#10;    Vessel of the Winds&#10;    Portent of Doom&#10;    Shield of the Gods&#10;&#10;&#10;6) The Eternal War Cycle:&#10;&#10;    Days of Blood&#10;    Oaths of Vengeance&#10;    Battle for the Old World&#10;    Glory of Days Past&#10;    The Ruinous Hordes&#10;    Faith and Steel          &#10;&#10;&#10;&#10;&#10;&#10;        &#10;7) Deluxe Expansions:&#10;&#10;    Assault on Ulthuan&#10;    March of the Damned&#10;    Legends&#10;    Cataclysm&#10;    Hidden Kingdoms&#10;&#10;&#10;&#10;    &#10;&#10;&#10;",
        "artist": "Kevin Childress,Paul Dainton,Andrew Navaro,Brian Schomburg,Adrian Smith,WiL Springer"
    },
    {
        "name": "Yikerz!",
        "description": "Yikerz! is a game of magnet mayhem. Place your Yikerz! pieces down on the board and try to avoid attracting the other pieces already played.&#10;&#10;The object is to get rid of all your pieces. If Yikerz collapse together, those pieces are yours to add to your stack. Stand the Yikerz upright to make your opponent&rsquo;s next move even trickier! But beware, that play could backfire on your next turn.&#10;&#10;Yikerz has a unique 4-piece interchangeable game board, which allows for many different configurations that create a variety of challenges and suits different skill levels. Using the 4 included game boards, choose from over 20 different game layout configurations that suit your skill level. The closer together the mats are, the more challenging the gameplay will be.&#10;&#10;Includes a convenient travel pouch for portable fun- anywhere, anytime!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Soul Hunters",
        "description": "Souls are the most valuable commodity in the universe and by ancient laws the one who possesses the most souls, is declared the ruler of all.&#10;&#10;Your task is to use powerful characters to lure souls on your side. Choose your alignment, play your cards right and you just may become the sovereign ruler of the universe.&#10;&#10;",
        "artist": "Julianna Heimoranta,Antti Löytynoja,R. Rapo"
    },
    {
        "name": "Acqua Dolce",
        "description": "Description: The Acqua Dolce Aquarium needs to be rich of fish, plants, decorations and colours.&#10;&#10;Will you be able to make it beautiful using all your resources at your best and before your game opponents? Or maybe it's better you come back and play only when you have gold fish?!&#10;&#10;Acqua Dolce is a simple card game really easy to learn. It's quick and at the same time requires some thinking and strategy.&#10;&#10;The winner is the first player to get rid of all his cards and who meets the requirements of the Objective Cards. These cards show the aquarium&rsquo;s requirements: minimum number of fish, colours, ornament type etc.&#10;&#10;Game can improve his complexity and intensity, if players want it, increasing Objective numbers.&#10;&#10;",
        "artist": "Paula Simonetti,Davide Tombino"
    }
]