[
    {
        "name": "Pocket Battles: Elves vs. Orcs",
        "description": "A war game that fits in the pocket!&#10;&#10;When pressed for time and table space and the hankering for battle hits, this is the perfect remedy - and it is portable!&#10;&#10;Tiles represent troops and troops make up units in your army: just determine the size of the battle and create your own army from a pool of existing troops.&#10;&#10;Each tile hits on certain rolls, and some can only melee while others can shoot. Some tiles also have special traits which can affect their whole unit or their whole army.&#10;&#10;Armies fight in three sectors - the battlefield. The goal is to eliminate at least half the value of your opponent's army.&#10;&#10;Pocket Battles: Elves vs. Orcs is the second game in the series of &quot;Pocket Battles&quot;, after Pocket Battles: Celts vs. Romans.&#10;&#10;The series is designed to have each army fully compatible with any other, so it will be possible, for example, to fight with orcs against Romans, or to have a mixed army of elves and Celts.&#10;&#10;The basic rules of the game are fairly simple; two armies face each other in battle. The armies are split into three columns and two rows. Players must decide, at the start of the game, how many points they will give to their armies, determining how many points it will take to defeat the opponents army. (At least half of the points).&#10;&#10;On your turn; you have to choose which faction of your army you will send off to battle! Attacks are made by using Order Tokens. If no Order Tokens are present on a unit, it costs just 1 token to issue orders to that unit. Issuing orders to the same unit in the same Battle Round would cost you the number of tokens present on the unit, plus 1. (So if there is one token on your unit, it would cost you two more tokens; if you had three, it would cost you four tokens, and so on).&#10;&#10;After a round of battle, you may choose to redeploy you units. (Units may move from the back of the row to the front of the same row, from the back of a row to the back of another row, or from the front of a row to the front of another row). Redeployment will not cost you any Order tokens.&#10;&#10;When one army has eliminated half of the other's original deployment value, that battle round concludes the game, and the player who has defeated the greatest total point-value of opposing units is the winner.&#10;&#10;",
        "artist": "Karim Chakroun"
    },
    {
        "name": "Keltis: Das Orakel",
        "description": "The second stand-alone big box Keltis game, Keltis - Das Orakel plays on a single track spiraled gameboard, on which lay differently colored stones. This re-development has new rules that open entirely new options of strategy: big leaps with the aid of golden colored clover tiles, repositioning a pawn any distance backwards with the aid of spiral tiles, thus being able to gather more wishing stones, and also the new leaf clover tiles, and Oracle tiles, which allow for more point bonuses.&#10;&#10;A player now has the ability to move back and forth, when on specific fields. There are new bonuses, for instance when the three pawns of a player form a specific formation, or when a new figurine, the oracle lady, is moved. Because a player can choose to move any of his three pawns in a turn, the game offers more flexibility - but this also requires more planning.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Q•bitz",
        "description": "In Q&bull;bitz players use their special blocks to recreate patterns, claim cards and win the game.&#10;&#10;In the first round, someone reveals a Q&bull;bitz card (out of a deck of 100 cards), then players race to assemble their specially colored blocks in the pattern shown on that card; the first player to do so claims the card. In the second round, players must roll their blocks like dice to find the iamges that they need to recreate the pattern on the card. In the third round, all players look at the card for ten seconds to try to memorize the pattern, then they work on recreating that pattern by memory; the round ends when someone calls for it to end, with the player who successfully recreated more of the pattern than anyone else claiming the card.&#10;&#10;After three sets of three rounds, the player who claimed the most cards wins the game.&#10;&#10;Contents:&#10;&#10;     120 Q-bitz Cards&#10;     4 Wooden Trays&#10;     4 Sets of 16 Cubes&#10;     Rules&#10;&#10;&#10;&#10;&#10;See also:&#10;Q&#226;&#128;&#162;bitz 100 Card Expansion Pack&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Zooloretto Junior",
        "description": "Zooloretto Mini is the little brother to the 2007 Spiel des Jahres-winning Zooloretto, and as in that game each player is the zoo director of a small zoo. They must bring new animals into their zoos and arrange landscape tiles on the grounds. Points are awarded at the end of the game for both. Zooloretto Mini is a standalone game with simpler rules, shorter game length and fewer components.&#10;&#10;Zooloretto Junior, released in 2016, is identical to Zooloretto Mini except for a few changes: different cover art, no bag to hold the tiles, and the inclusion of a panda disc instead of a panda figurine.&#10;&#10;",
        "artist": "Design/Main,Christian Fiore"
    },
    {
        "name": "Le Donjon de Naheulbeuk",
        "description": "&quot;Le Donjon de Naheulbeuk&quot; is a cooperative game in which the players try to recover the last of Gladeulfeurha's statuettes.&#10;Players embody adventurers in this dungeon-crawling quest, each with a different class, skill and personality: there're the stupid barbarian, the belching ogre, the haughty sorceress, the dumb elf, the coward thief, the ever-singing bard, the cranky dwarf and the ranger who wishes he were a leader&hellip; (all the characters and elements of the game are inspired by the audio and comics saga by the same name, parodies of Fantasy RPG &mdash; &agrave; la Munchkin).&#10;&#10;In each game, the group must go through 14 of the 56 available dungeon rooms in order to defeat the powerful sorcerer Zangdar. In every room, players will face choices, skill checks or battles, and maybe rewards (as xp, gold or loot cards)&#10;&#10;There're 8 kind of skill checks, and each checks can slightly differ from the others of the same kind (number of players involved, special rule, etc.). Most of the skill checks use Destiny Tiles (which are 16 thick cards, which also represents monsters) and a special timer (with 3 difficulty levels)&#10;&#10;     Balance Check: the player must put a Destiny Tile on the top of his head, walk/run around and sit down again without letting the tile fall.&#10;     Climbing Check: the player must put a Destiny Tile on the top of his head, stand up on his chair, then sit down again without letting the tile fall.&#10;     Dexterity Check: the player must build a house of cards using Destiny Tiles.&#10;     Speed Check: the player must put a Destiny Tile on the edge of the table, then slap it up the air and catch it before it falls back down.&#10;     Precision Check: a player stands 3 steps from the table, holding the game box, and the others must throw Destiny Tiles into the box from the other side of the table.&#10;     Intelligence Check: players play a memory game with the 16 Destiny Tiles&#10;     Coordination Check: players stands a step from the table, and must circle all the Destiny Tiles around the table, throwing them from one player to the next.&#10;     Stamina Check: the player must stand on one leg, with a Destiny Tile on his other knee and another one on both of his forefingers, without dropping down either one.&#10;&#10;&#10;&#10;&#10;The battles are also timed and are played with Letter Cards, that can be exchanged one by one between 2 players. They are used to spell special words (several different words for each character) as blows to the enemy. Every time a player plays cards to spell a word, he draw 3 new cards and keep on playing. At the end of the battle, if there're enough blows, the enemy is defeated. For instance, the sorceress can cast a spell by spelling &quot;wazaaa&quot; with any number of a's at the end, wounding the enemy for every extra a's. The barbarian can misspell a letter in each of his word. The bard and the ranger can make other players draw cards. And so on&hellip; For every 3 cards played with a punch symbol on it, a player takes one wound him/herself.&#10;&#10;Using gold and/or xp, characters can level up (up to level 3) and gain access to more powerful attacks or skills. The party can rest up to 3 times a game to recover from one wound each. If a player dies, he shuffles his character sheet with the other available sheets and pick one : if it's the same, he  recovers all his health and keep all his loot, gold and xp; if it's another one, he dies, loses everything, and continues the game as a totally new character.&#10;&#10;If the players defeat Zangdar the Sorcerer in the 14th room (4 tiles with different rules so every game doesn't end the same way), they win the game.&#10;&#10;",
        "artist": "Marion Poinsot"
    },
    {
        "name": "Mystery Rummy: Escape from Alcatraz",
        "description": "Alcatraz Island is home to one of the most formidable federal prisons ever conceived. In its history, no one was ever acknowledged as having escaped from the prison. As guards, it's your job to foil escape attempts by gathering information on plans and capturing the ringleaders.&#10;&#10;Mystery Rummy: Escape from Alcatraz, game #5 in the &quot;Mystery Rummy&quot; series from Mike Fitzgerald, consists of 129 cards in two decks: the Plans Deck of 84 escape plan cards and 14 escapee cards, and the Action Deck of 31 action cards. The goal of the game is to earn points by helping foil escape plans. Players gather information by melding matching plan cards or playing off an existing plan. When players collect eight matching plan cards and identify the plan's mastermind, they can foil the escape plan, capture the culprit, and score points.&#10;&#10;The first player to reach 100 or more points at the end of a round wins.&#10;&#10;",
        "artist": "Joe Boginski"
    },
    {
        "name": "Dragonheart",
        "description": "Dragons, knights, trolls, princesses, dwarves, and other fantasy characters make up the world of Dragonheart. Dragons are searching for treasure, of course, but they're being pursued by dragon hunters, and those are the two sides that face off in this game. On a turn, a player plays one or more cards with the same motif, then refills his hand to five cards. The cards are always played onto the part of the game board that has the same motif. By laying out cards, a player collects point cards that are already present. This is how the dragon collects treasure cards, for example, but the third dragon hunter defeats the dragon, while a second knight protects the princess. Other combinations await the players, and whoever collects the most points wins.&#10;&#10;",
        "artist": "Michael Menzel"
    },
    {
        "name": "Fresco",
        "description": "In Fresco, players are master painters working to restore a fresco in a Renaissance church.&#10;&#10;Each round begins with players deciding what time they would like to wake up for the day. The earlier you wake up, the earlier you will be in turn order, and the better options you will be guaranteed to have. Wake up early too often, however, and your apprentices will become unhappy and stop working as efficiently. They would much rather sleep in!&#10;&#10;Then, players decide their actions for the turn, deploying their apprentice work force to various tasks. You'll need to buy paint, mix paint, work on painting the fresco, raise money (which you'll need to buy the aforementioned paint!) by painting portraits, and perhaps even send your apprentices to the opera in order to increase their happiness. Points are scored mostly by painting the fresco, which requires specific combinations of paints, so you'll need to buy and mix your paints wisely, in addition to beating other players to the paints and fresco segments you would like to paint.&#10;&#10;Fresco includes several expansion modules, so you can play without expansions for a lighter family game or add in expansions to vary play and increase the decision-making and difficulty, resulting in a very flexible game with a high replay value.&#10;&#10;",
        "artist": "Oliver Schlemmer"
    },
    {
        "name": "New York",
        "description": "New York has the same game play as Dirk Henn&#226;&#128;&#153;s Spiel des Jahres-winning Alhambra, but with the Spanish architecture being replaced by the skyscrapers of Manhattan. As in the original game, players collect four types of currencies and use those funds to purchase tiles that they assemble into their own mini-metropolis, connecting the paved street edges on the tiles to create a coherent network of roads. The building tiles come in six colors, and players score for their holdings three times during the game, earning points for having the most of a color as well as for their longest road.&#10;&#10;Aside from the theme change and the associated new artwork, the gameboard is now larger with spots for both face-down and face-up tiles and a scoretrack that circles the edge of the board instead of zigzagging back and forth.&#10;&#10;Re-implements:&#10;&#10;    Alhambra&#10;&#10;&#10;&#10;&#10;",
        "artist": "Harald Lieske"
    },
    {
        "name": "It Happens..",
        "description": "Anton, the adventurous anteater, is out looking for food.  Nosy as he is, he sticks his long nose into every termite hill he comes across, and it&rsquo;s not just edible things that he turns up either.  His main objective, however, is the termite queen and her general.  They earn the most points at the end.&#10;&#10;A dice game where players have to place dice one by one onto certain columns of different anthills in order to attain the majority and score the most victory points.  Majorities are not all the players must think about, however, as players will also want to place their dice on certain spaces to collect various items, forming sets that are also worth points at the end of the game.  The player that is best able to balance attaining majorities while also collecting items will likely be the winner.&#10;  &#10;The funny background illustrations show the Anton the anteater in trouble with the ants and termites as he explores their homes.&#10;&#10;",
        "artist": "Michael Menzel"
    },
    {
        "name": "U-Build Monopoly",
        "description": "This version contains variable Hexes to create different courses for each individual game. Additionally, this makes for different durations from 30 up to 90 minutes. Modern 3D-Buildings like Skyscrapers, stadiums or parks are built on the hexes to create a &quot;real&quot; miniature city.&#10;The rules are mostly similar to Monopoly. But with notable changes such as the hazard locations, and the skyscrapers.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Monopoly Revolution",
        "description": "Monopoly with a circular board. No paper money is used, instead it uses a credit card setup with an electronic device that also substitutes chance cards and produces sound effects and music according to the events of the game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Samarkand: Routes to Riches",
        "description": "As members of merchant families in Samarkand: Routes to Riches, the players marry into other wealthy merchant families. They expand the trading routes of these families and establish trade relationships with other families. The player who gains the most victory points with relationships and goods will be the winner at the end of the game.&#10;&#10;Each turn, the players either marry into a merchant family or expand the trading route of a family they are already married into.&#10;&#10;To marry into a family, the player pays the cost of the family. Only two players may marry into each family. To expand the trading route of a family, the player must be married into the family and may pay for the route with the money of the family. The goal is to meet other families not met before (gaining trade relationship markers) and to reach goods spaces first (gaining goods tokens).&#10;&#10;When all families have established at least one trade relationship or one family has established five trade relationships, the game ends. Each player scores their goods cards with the corresponding goods markers they have acquired, the trade relationship markers they have collected, and their money.&#10;&#10;This entry has been split from the Winsome Games publication Age of Scheme: Routes to Riches. As the rules have been altered, number of players differs, and updates to the artwork have been made, the two games are regarded as separate entities.&#10;&#10;",
        "artist": "Jo Hartwig"
    },
    {
        "name": "Galapagos",
        "description": "The Pacific Ocean, 1835. The ship &bdquo;HMS Beagle&ldquo; arrives at the Gal&aacute;pagos islands. On board is the young biologist Charles Darwin, who is later to become famous throughout the world for his revolutionary ideas of evolution and natural selection. However, before this, he spent much of his time collecting and examining a variety of different species. In this game, the players are biologists walking in the footsteps of Darwin. They go on expeditions on the Gal&aacute;pagos islands in order to discover rare species, and create exhibitions to score exhibition points. The player with the most exhibition points when the game ends wins the game&#10;&#10;",
        "artist": "Hans-Georg Schneider"
    },
    {
        "name": "Dungeons & Dragons: Wrath of Ashardalon Board Game",
        "description": "From Wizards of the Coast website:&#10;&#10;A cooperative game of adventure for 1-5 players set in the world of Dungeons &amp; Dragons.&#10;&#10;A heavy shadow falls across the land, cast by a dark spire that belches smoke and oozes fiery lava. A cave mouth leads to a maze of tunnels and chambers, and deep within this monster-infested labyrinth lurks the most terrifying creature of all: a red dragon!&#10;&#10;Designed for 1-5 players, this boardgame features multiple scenarios, challenging quests, and cooperative game play.&#10;&#10;Each player selects a hero; a rogue, thief, warrior, cleric, or wizard. On their turn, each player can explore further into the dungeon (turn over new tiles), move through the already explored parts of the dungeon, and fight monsters. When a new dungeon tile is revealed, there is typically an encounter of some sort, and new monsters to fight are added. Slain monsters reward the players with treasure, and experience points, allowing them to level up and increase their skills during play. Players must cooperate to stay alive, slay the monsters, and achieve the goal of their quest. Each scenario has a different goal - from retrieving a relic, to slaying a vampire lord.&#10;&#10;",
        "artist": "Jesper Ejsing,Jason Engle"
    },
    {
        "name": "Glen More",
        "description": "Each player represents the leadership of a 17th century Scottish clan looking to expand its territory and its wealth. The success of your clan depends on your ability to make the correct decision at the opportune time, be it by establishing a new pasture for your livestock, growing grain for the production of whisky, selling your goods on the various markets, or investing in the cultivation of special places such as lochs and castles.&#10;&#10;Glen More offers a unique turn mechanism. Players take territory tiles from a rondel. Picking a tile has not only influence on the actions you get by the surrounding tiles in your territory, it also determines when you'll have your next turn (and how many turns you will have in the game). But having a lot of turns is not always the best strategy for a successful chieftain.&#10;&#10;Glen More is 6 in the Alea medium box series, and is rated a 4 on the alea complexity level.&#10;&#10;",
        "artist": "Loïc Billiau,Harald Lieske"
    },
    {
        "name": "The Crow and the Pitcher",
        "description": "The Crow and the Pitcher is a trick-taking game based on the Aesop fable of the same name. Players must play off one another in order to gain points, but the highest suited card is not always the one that takes the trick, so one must be as clever as the Crow in Aesop's fable to score points and not perish from thirst.&#10;&#10;The deck consists of three colored suits of stone cards (numbered 2-10) and one set of black &quot;thirst&quot; cards (also numbered 2-10); a separate deck of pitcher cards has values from 6 to 13, with some duplicates, and one pitcher is revealed each trick. One player leads the first trick with a stone card, and other players must follow suit, if possible. If a player cannot follow suit, she can play a thirst card instead, and from the next round thirst cards can lead the trick. Whoever wins a trick leads the next trick, so winning tricks helps you dictate play.&#10;&#10;If the sum of the colored cards is less than the pitcher value, then the lowest card matching the lead wins; this player gets all cards played (positive points for colors, negative for thirst) and the Pitcher card (worth -5 points). If the sum of the colored cards is equal to or greater than the pitcher value, then the highest card matching the lead wins, and this player gets all cards played (again, positive points for colors, negative for thirst). In all cases, cards valued higher than the trick's pitcher card do not count toward determining whether the pitcher is full.&#10;&#10;If the trick is led by a thirst card, the highest thirst card wins, and that player takes all thirst cards played &ndash; so make sure you hold onto your low value thirst cards to avoid winning a thirst-led trick!&#10;&#10;After three rounds, the player with the high score wins.&#10;&#10;",
        "artist": "Phil Kilcrease,Sean MacDonald"
    },
    {
        "name": "Dungeon Run",
        "description": "A tale of teamwork and betrayal!&#10;&#10;The mole ogre howled out as it collapsed into a bloody pile of rent flesh and broken bone. The aging knight bent over, panting heavily, and gave his dwarven peer an approving nod. It had taken great effort between them both to slay the beast, and they had each taken their share of wounds. But in the end their cooperation had paid off and they both knew it. And then their eyes found the treasure chest sitting in the corner of the room.&#10;&#10;They looked at each other. They looked back at the treasure... and then the real fight began.&#10;&#10;The game where YOU are the final boss!&#10;&#10;Dungeon Run is an exciting dash through a dungeon packed with monsters and traps. Each player controls a unique hero capable of great feats, and whose powers and abilities are upgradable and customizable throughout the game. Players can work together to overcome the perils of the dungeon, or they can betray and sabotage each other as they see fit. Because in the final room of the dungeon lurks a powerful boss with the ultimate treasure - a treasure that turns its owner into the most powerful warrior they can become! Slay the boss, steal the treasure, and then run for your life as your friends try to cut you down.  In Dungeon Run only one hero can escape with the fabled Summoning Stone. Don't crawl - run!&#10;&#10;Dungeon Run features a randomly assembled dungeon that changes each time you play, as do the monsters you face and the treasures you find. Eight different heroes each with unique options for customization further add to a wealth of game play options. Choose the vicious Tundra Orc and bash your way through everything that stands in your path. Play as the cunning Grounder Wizard and use your magic to cheat the laws of nature. Select the Guild Dwarf adventurer and lay traps to ensnare your friends. There are many paths to victory in Dungeon Run. Win by working with your friends or against them - just win!&#10;&#10;",
        "artist": "John Ariosa,Michael S. Kelly,Sergi Marcet"
    },
    {
        "name": "Souvlaki Wars",
        "description": "In Souvlaki Wars, players are owners of Greek restaurants serving traditional greek fast food like &quot;souvlaki&quot; and &quot;gyros&quot;. They try to attract new customers, making sure they can serve them in time, increasing their fortune and fame at the same time.&#10;&#10;Of course, this is easier said than done as many things can go wrong while trying to serve a customer: People change their minds, orders go wrong and restaurant owners try to sabotage each other.&#10;&#10;Can you become the most successful Greek restaurant owner?&#10;&#10;Souvlaki Wars is a light family card game for 2-4 players. Players draft new customers and try to serve them with food cards they draw at the beginning of each turn. This way they earn the money and the reputation each customer represents. However, before they have a chance to do so, cards with &quot;Unforeseen Events&quot; are played by every player, affecting the game in many different ways like altering the order in lines, adding more customers, decreasing the opponent's reputation etc. And of course, each player has to take into consideration that the customers are served on a first-come basis. If someone's order can't be fulfilled, everyone behind him will have to wait another turn...&#10;&#10;The first player to reach a certain level of money and reputation is declared the winner.&#10;&#10;The game is going to be published by the Greek company &quot;Kaissa Chess &amp; Games&quot; during 2011. It is going to be bilingual, having text both in Greek and English. Its international debut will be at the 2011 Spiel Essen fair.&#10;&#10;- Winner of BGG's Greek Guild's 1st Game Design Contest in the category: &quot;Best Game&quot;&#10;&#10;",
        "artist": "Panayiotis Lyris,Dimitris Vasiadis"
    },
    {
        "name": "Mad Zeppelin",
        "description": "From Publisher:&#10;&#10;At the height of the industrial revolution, the Great Empire is about to take delivery of many secret crates from its colonies. These crates contain all the Emperor needs to strengthen his rule on the Empire: steel, coal, ore, and above all: gold! For security reasons, the Emperor himself has hand-picked the crew of the Nostria, one of the armored zeppelins of the imperial fleet. However, neighboring nations are organizing the resistance, and traitors are secretly boarding the airship to thwart the Emperor&rsquo;s plans.&#10;&#10;Mad Zeppelin is a fast-paced card game of sabotage, as you use your traitors to throw the most cargo off the Nostria and ruin the Emperor's plans.  The player who destroys the most cargo wins, but you must assure you properly bribe the guards each turn, or your chances of sabotage may end at the point of a bayonet!&#10;&#10;Contains: 14 Traitor cards - 100 Cargo cards of different categories - 10 Journey cards, used to mark the course of the voyage - 3 special dice - 30 tokens representing gold pieces.&#10;&#10;",
        "artist": "Miguel Coimbra,Édouard Guiton,Florent Maudoux"
    },
    {
        "name": "The Speicherstadt",
        "description": "The Speicherstadt is an auction card game. Players compete for victory points, which come mainly from contracts (sets of resources) and special cards (like a collected set of 1-4 identical &quot;counting offices&quot;, the port rewarding collected ship cards etc.). The game is build on two core concepts:&#10;&#10;1. Players bid for cards by building &quot;towers&quot; with their meeples over them. Each meeple in a tower increases the cost of a card - but only for players &quot;below&quot; it. This is the main mechanic of the game - players must consider WHEN to bid (place their meeple) over a certain card and when to use their meeples to make others pay more. This is important, because a player can make only three bids during a round.&#10;&#10;2. Players are punished by negative points for not collecting firemen cards. Thus, ignoring security may cost a player a victory. By many players, the &quot;punishing&quot; mechanic is considered a trademark of the author - Stefan Feld.&#10;&#10;The deck is divided into four seasons - winter, spring, summer and autumn. In later seasons, more powerful cards appear, so players need to think ahead in managing their resources.&#10;&#10;---- Promotional blurb from the publisher ----&#10;&#10;Hamburg around 1900 - the gate to the world. Within the harbour there stretches a unique complex of storehouses: Speicherstadt. The network of canals and bridges houses a terminal for spices, coffee, tea and carpets from all over the world.&#10;&#10;As one of Hamburg&acute;s wholesaler at the heyday of the Speicherstadt you acquire shiploads for the storehouses, not too expensive, of course, as you like to make a profit selling them. Who makes the best deals within a year and supplies his clients with the right goods will be the winner of the game. But beware! Sudden fires cause heavy losses. You might be advised to invest in fire protection early.&#10;&#10;Playing Speicherstadt you will be thrilled by the simple and original mechanism of acquiring desired action cards.&#10;&#10;",
        "artist": "Harald Lieske,Michael Menzel,Andreas Resch"
    },
    {
        "name": "Queen's Ransom",
        "description": "From Z-Man's page:&#10;&#10;The queen has been captured and is held for ransom!&#10;&#10;You and your friends are detectives enlisted by the king. Who will be the first to determine who captured her and where she is being held captive.&#10;&#10;A fun deductive-type game.&#10;&#10;Queen's Ransom is a deduction card game for 2-5 players.  The players are inspectors enlisted by the king to investigate the Queen's kidnapping (the king can't afford the ransom!)&#10;The first player to find out who captured the queen and where she is being held wins the game. A player may buy information cards using money cards, or use special cards.&#10;&#10;Contents: 90 cards, rules&#10;&#10;",
        "artist": "Gary Simpson"
    },
    {
        "name": "The Red Dragon Inn 3",
        "description": "From the Publisher's Website:&#10;&#10;You and your ever-expanding party of adventuring companions have spent another day slogging through the dungeon, killing monsters and taking their stuff. Now you're back in town, healed up, cleaned up, and ready once again to party at the Red Dragon Inn.&#10;&#10;Drink, gamble, and roughhouse with your friends. But don't forget to keep an eye on your Gold. If you run out, you'll have to spend the night in the stables. Oh... and try not to get too beaten up or too drunk. If you black out, your friends will continue the party without you... after they loot your body for Gold of course!&#10;The Red Dragon Inn 3 &#10; The last conscious adventurer with Gold wins the game!&#10;&#10;The Red Dragon Inn 3 introduces four new adventurers, each with a unique game mechanic to add new strategies to the original game. The Red Dragon Inn 3 may be played alone or in combination with other versions of The Red Dragon Inn to allow games of up to 12 players!&#10;&#10;&#10;     Wizgille the Tinkerer : Wizgille is a Gnomish Artificer. Her brilliance with gadgets is surpassed only by her enthusiasm for tinkering with them--often with disastrous results. When Wizgille tests a new device, watch out! It could do something impressive, or it could blow up in everyone's faces!&#10;&#10;&#10;The Good: Many of her creations are legendary among the Gnomish Inventors Guild and have been featured in Adventurer's Gazette.&#10;The Bad: She thinks that a crowded tavern is an appropriate place to test new prototypes.&#10;&#10;&#10;     Brewmaster Phrenk : Phrenk is a Troll Alchemist. His skill as a potionmaster is unmatched, but he's not above using his skills for the &quot;lowly&quot; art of creating specialty drinks for his friends. He is a laid-back, live-and-let-live kind of a guy. But don't make him angry, because he is, after all, a troll.&#10;&#10;&#10;The Good: He's more than capable of brewing enough healing potions to keep his companions on their feet.&#10;The Bad: He's just as capable of brewing enough drinks to knock them all back down.&#10;&#10;&#10;     Kaylin the Renegade : Kaylin is a tiny Pixie Enchanter with a big chip on her shoulder. The whole cutesy pixie thing didn't suit her, so she left The Grove and set out on her own. Wulfric is a wolf who is neither tiny, nor has a chip on his shoulder. Between her magical skills and his brute strength, they are a match for any dungeon's monsters.&#10;&#10;&#10;The Good: Wulfric is a noble companion who always helps his friends.&#10;The Bad: Kaylin isn't always so noble.&#10;&#10;&#10;     Serena the Pious : Serena would have died if she hadn't been such a cute baby. The Paladins who found her could not bring themselves to slay her as they did the other Orcs in her village. Seeing no other option, they took her in and tried to raise her as one of their own. Even with her training, she is always at risk of succumbing to her chaotic Orcish instincts, so she must be ever-vigilant to stay on the righteous path.&#10;&#10;&#10;The Good: With her holy blade at her side, she lives to smite evil.&#10;The Bad: Carousing in a tavern isn't exactly the best way for Serena to stay on that righteous path...&#10;&#10;",
        "artist": "Rose Besch,Cold FuZion Studios,Kennon James,Doug Kovacs,Beth Trott"
    },
    {
        "name": "Odin's Table",
        "description": "Join the Gods of Asgard in the game of strength and wisdom.&#10;&#10;Mindwarrior Games Ltd. releases the second title this year after Atlantic Triangle. Based on the Viking mythology, the game is illustrated and designed by Mindwarrior Games, god illustrations done by Teemu Karjalainen.&#10;&#10;Odin&rsquo;s Table is a strategic board game where two players struggle for victory with the assistance of the ancient Viking gods. Players try to move their game tokens to the enemy fort. The winner is the player who first gets three game tokens of their own into the enemy fort.&#10;&#10;Use the superior power of Odin, the wit of Loki and the powers of 8 other gods to win in this strategical game of tactics and bluff!&#10;&#10;",
        "artist": "Teemu Karjalainen"
    },
    {
        "name": "GOSU",
        "description": "In a fantasy world dominated by goblins, when the blood moon rises in the sky, a new war begins and new warlords raise their armies.&#10;&#10;GOSU plays like a hybrid of Race for the Galaxy and Magic: The Gathering with each player trying to recruit an army of goblins made up of soldiers, heroes, magicians, and other classes &ndash; then swing it into action against the other players. Five clans of goblins are represented on the game cards, with goblins in one of three ranks. To build an army, a player must first recruit level I goblins, then build on those goblins with level II and finally level III. Those higher level goblins can be played only if a lower level goblin is of the same clan, and since goblins of the same clan have similar abilities or powers that mesh well, players tend to specialize in who they recruit to their ranks.&#10;&#10;Each turn, a player can play a new goblin, activate a goblin, draw cards, or pass. To activate a goblin or draw cards, players need to spend 1-2 activation tokens, with them having only two at the start of each battle. Many goblins have special powers that come into play when they're recruited, attacked, removed from play, placed with other goblins, and so on.&#10;&#10;Once all players have passed, the player with the most powerful army wins the battle. Players keep cards in hand from one battle to the next, so laying out all your forces at once can leave you with little to do but get hit in later battles. The first player to win three battles wins the game.&#10;&#10;Reimplemented as:&#10;&#10;    GOSU 2: Tactics&#10;&#10;&#10;&#10;&#10;",
        "artist": "Bertrand Benoit,Romain Gaschet,Ian Parovel"
    },
    {
        "name": "Wits & Wagers Family",
        "description": "Wits &amp; Wagers Family is the family version of the most award winning party game in history.&#10;This edition is more simple, has less down time, and is more portable than the original Wits & Wagers.  It also removes the &quot;gambling&quot; element and has questions that are appropriate for kids and the whole family.  Most importantly, Wits &amp; Wagers Family makes use of the beloved Meeple playing piece!&#10;&#10;How to Play&#10;1) A question is asked.&#10;2) Everyone writes down a guess.&#10;3) The guesses are placed face-up on the table and ordered smallest to largest.&#10;4) Place your Meeples on the guess that you think is closest to the right answer.&#10;&#10;Feeling confident?  Place a Meeple on your guess.&#10;Think your kids knows better?  Place your Meeples on their guess.&#10;Have no idea?  Bet on any guess and hope you get lucky!&#10;&#10;Scoring&#10;You can score up to 4 points on each question:&#10; 1 point for correctly placing the Small Meeple&#10; 2 points for correctly placing the Large Meeple&#10; 1 point if your guess is closest&#10;&#10;The first player to 15 points wins.&#10;&#10;Contents&#10;125 Question Cards (150 in first edition)&#10;5 Dry Erase Boards&#10;5 Dry Erase Pens&#10;1 Permanent Answer Board (with a &quot;1&quot;)&#10;5 Large Meeples (worth 2 points)&#10;5 Small Meeples (worth 1 point)&#10;1 Dry Erase Score Board&#10;1 Full-color Rules&#10;&#10;",
        "artist": "Jacoby O'Connor,Shawn Wilson (I)"
    },
    {
        "name": "Navegador",
        "description": "This game is inspired by the Portuguese Age of Discoveries in the 15th-16th century. Players take actions such as contracting men, acquiring ships and buildings, sailing the seas, establishing colonies in discovered lands, trading goods on the market, and getting privileges.&#10;&#10;Each player starts with only two ships and three workers and tries to expand his wealth.&#10;&#10;There are several undiscovered lands that allow players, once discovered, to found some colonies there. Colonies exist in different places where sugar, gold and spices are available and can be sold to the market to make some money. Money is used to build ships, erect buildings such as factories, shipyards and churches, and to get workers. Workers are necessary to found colonies or to acquire  buildings and privileges, which exist in five categories and therefore encourage players to follow different strategies competing with each other.&#10;&#10;At the end of the game the player who is most successful in combining his privileges with his achievements (colonies, factories, discoveries, shipyards, and churches) is the winner.&#10;&#10;",
        "artist": "Marina Fahrenbach,Mac Gerdts"
    },
    {
        "name": "Just4Fun Colours",
        "description": "Players play cards to occupy coloured fields on a map. A player wins by owning 4 directly adjacent fields horizontally, vertically or diagonally. If no player wins after 20 rounds, the player who owns the largest contiguous area (number of horizontally and vertically related fields) is declared the winner.&#10;&#10;",
        "artist": "Mirko Suzuki"
    },
    {
        "name": "Killer Bunnies and the Ultimate Odyssey",
        "description": "Killer Bunnies and the Ultimate Odyssey is a new take on the collectible non-collectible KB line, with Jeffrey Neil Bellinger once again putting the rabbits through the grinder. Six new starter decks Animals, Crops, Elementals, Energy, Land and Technology will be available, and players can construct personalized decks of no less than 60 cards, with the cards from any deck.&#10;&#10;When the insatiable appetite of Killer Bunnies game fans demanded more, Playroom looked to Killer Bunnies creator and game designer Jeffrey Neil Bellinger to coordinate the development of, like other games in the Killer Bunnies family, a non-collectible game that can offer variations through different color nick-named deck options. However, this time a new desire expressed by the huge Killer Bunnies fan-base has been fulfilled: Killer Bunnies now has a constructable game variation. Though still not collectible or random, players can now buy starter decks and booster expansions for Killer Bunnies and the Ultimate Odyssey and then use any combination of those cards to form their own constructed decks to play against opponents. Unlike in Killer Bunnies and the Quest for the Magic Carrot, where up to eight players play with the same deck of cards, all sharing the same draw pile, Killer Bunnies and the Ultimate Odyssey has players each draw only from their own constructed deck of 60 cards. There are not any random packs, so players will always know which cards they are purchasing in a deck and they can buy the right products for their planned deck. For Killer Bunnies and the Ultimate Odyssey  six brand new starter decks (red, violet, blue, yellow, green, or orange) allow players to construct a personalized deck with any of the cards of any deck.&#10;&#10;The setting for the new game is an ultimate race to build a bunny society on planet Earth. Killer Bunnies and the Ultimate Odyssey pits players against each other as they struggle to gain Civilization Points, by building cities and increasing their bunny populations. Players gain points by developing their own civilizations or by using zany weapons and hilarious scenarios to destroy their opponents.&#10;&#10;Killer Bunnies and the Ultimate Odyssey is the latest in the family of Killer Bunnies games which features, Killer Bunnies and the Quest for the Magic Carrot, Killer Bunnies REMIX, Kinder Bunnies: Their First Adventure and Killer Bunnies and the Journey to Jupiter.&#10;&#10;&#10;In addition to individual starter decks (A-decks) and expansion decks (B-, C-, D- and E-decks), the following products are offered.  Each of the combination decks come with a promo card for each deck included.&#10;&#10;     Heroic and Azoic (Violet, Red, and Blue A-decks)&#10;     Lively and Spry (Green, Orange, and Yellow A-decks)&#10;     Elementals vs. Animals (Violet and Orange A- and B-decks)&#10;     Energy vs. Crops (Red and Green A- and C-decks)&#10;     Technology vs. Land (Blue and Yellow A- and D-decks)&#10;&#10;&#10;&#10;&#10;Killer Bunnies: Heroes vs. Villains &#226;&#128;&#147; Blue Starter Deck includes (in fact, consists of) the Blue, Green, and Yellow E-decks.&#10;&#10;",
        "artist": "Matthew Holliday,Jonathan Young"
    },
    {
        "name": "Two by Two",
        "description": "The floodwaters are rising and the animals need to board the ark!&#10;&#10;In this deceptively simple game, players move their boats around a steadily deteriorating landscape, matching pairs in order to rescue stranded animals.&#10;&#10;Animals that are rare at the end of the game are worth more points than those that are common.&#10;&#10;Two by Two is #6 in the Valley Games Modern Line.&#10;&#10;Awards&#10;&#10;&#10;     Games 100 - Runner-up for Best Family Game (2012)&#10;&#10;&#10;Online Play&#10;&#10;&#10;     Yucata (turn-based)&#10;&#10;&#10;",
        "artist": "Patrick LaMontagne,Mark Poole"
    },
    {
        "name": "Titania",
        "description": "In Titania players place ships on the map of Titania, collect shells, and try to rebuild towers and refurbish them with starfish. The towers are built by placing the ships next to the towers and paying with different colored shells.&#10;&#10;Each turn players have to decide whether to take cards or place ships by playing those cards; the cards are color-coded to match the ships being placed. The map shows a hex grid with all kind of symbols, showing the reward you get for building and spaces where you can build the towers.&#10;&#10;",
        "artist": "Michael Menzel"
    },
    {
        "name": "Grave Robbers III: Suburban Slashers from Sunnydale Street",
        "description": "Build the ultimate bad movie!  Fill the cast with stereotypical Characters, give your Characters Props, set your film (or somebody else's) in a Location, and attack other movies with Creatures.  Spice things up with Special Effect cards.  If your movie is worth the most points when the Credits are rolled (or at the end of the deck), you win!&#10;&#10;Grave Robbers III is an expansion and sequel to Grave Robbers From Outer Space and Grave Robbers II: Skippy's Revenge, but can also be played on its own.  Gameplay remains identical to the previous games in the B-Movies seres, except for the addition of the &quot;Neighborhood&quot; trait.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Uncle Chestnut's Table Gype",
        "description": "In his Autobiography, G.K. Chesterton mentions &quot;the well-known and widespread national game of Gype&quot; which he and H.G. Wells invented.&#10;&#10;Specifically, Chesterton mentions &quot;I myself cut out and coloured pieces of cardboard of mysterious and significant shapes, the instruments of Table Gype; a game for the little ones.&quot;&#10;&#10;Almost 100 years later, Eternal Revolution has published Table Gype as an abstract strategy game with a random element.&#10;&#10;Players try to move their pieces from their home row to the row directly opposite. They may jump their own pieces or those of their opponents, but every jump randomizes the playing pieces that were jumped over.&#10;&#10;Uncle Chestnut's Table Gype is played with a cloth gameboard and 32 playing pieces in 4 colors. Each piece, a six-sided die, can represent any of 6 &quot;mysterious and significant shapes&quot; that move differently.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Recicle: Tempos de Crise",
        "description": "Recycle, Critical Times is a new game based on the original Recicle. Several changes were implemented, from the rules to the art design. Now, players may hire designers and merchants to improve their Cooperative, may buy collecting trucks for organic material and install new kinds of recycling equipment giving the game a new strategy felling. Players begin without money and loans are permitted, although times are critical and the interests are high. &#10;The basics of the original are kept. Collectors move around the board collecting from paper, plastic, UHT, metal and glass tiles. They must take them to the Cooperative. In the new game, the street Collectors may also sell tiles to a public Warehouse where they can make some money before the Cooperative gets the materials to recycle.&#10;&#10;At first, the game was self-published and handmade.&#10;In 2011 published by brazilian company Gal&aacute;pagos Jogos.&#10;&#10;",
        "artist": "Luish Moraes Coelho,Renato Silva Sasdelli"
    },
    {
        "name": "Sumoku",
        "description": "Sumoku is a crossword-style game with colored number tiles that can be played five different ways. In all Sumoku games, game play starts with the roll of a die to create a &quot;key number&quot; &ndash; either 3, 4 or 5. The digits in all groups of tiles placed in rows and columns must sum to a multiple of this key number. A tile is one of six colors, and a color cannot be repeated in a connected set of tiles.&#10;&#10;In the main game, players draw eight tiles to start the game. On a turn, a player adds a single row or column of tiles to the playing area to create valid plays &ndash; that is, the sum of the tiles played and all rows or columns added to during that turn sum to a multiple of the key number. The player scores the sum of the tiles played, and the sum of tiles in any row or column added to during that turn. If you finished a row or column of six tiles &ndash; that is, one with all six colors &ndash; you take another turn immediately before refilling your hand to eight tiles. The game ends when no one can play, and numbers in hand count against a player's score. High score wins.&#10;&#10;Other games include &quot;Speed Sumoku&quot; in which players each have ten tiles and try to create a crossword-style grid in which all sets of tiles sum to a multiple of the key number before anyone else. &quot;Team Sumoku&quot; plays similarly, but with each team creating one grid. &quot;Spot Sumoku&quot; has players trying to spot four tiles that sum to a multiple of the key number rolled from a public array of ten tiles. &quot;Solo Sumoku&quot; tasks a player with drawing 16 tiles and creating a legal grid from them, then drawing ten more tiles and adding them to the existing grid in a legal manner, then doing this with another ten tiles, and so on through all 96 tiles.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Space Infantry",
        "description": "Official website&#10;&#10;http://zak965.it/spaceinfantry/index.html&#10;&#10;Summary&#10;&#10;Space Infantry (SI) is a solitaire game of squad-level combat in the future. In Space Infantry you control a team of 4/8 soldiers on a series of missions that can be played individually or as a campaign. &#10;Each mission takes about 20 minutes to be completed.&#10;&#10;SI is a modular game; the overall structure of SI will make it possible to easily add new features to the game (missions, enemies, equipment): this means that in the future additional components will add new options to the existing missions, increasing the lifetime of SI.&#10;&#10;SI started as a free game, and has now been published by Lock'n Load games - go to http://locknloadgame.com/ for more details&#10;&#10;Game Includes:&#10;&#10;&#10;     Rulebook&#10;     4 Mission Maps (double-sided)&#10;     12 Hive Sector Tiles&#10;     18 Unit Cards&#10;     4 Enemy Sheets/Time Tracks (double-sided)&#10;     2 Squad Rosters&#10;     2 Campaign Logs&#10;     158 Die-cut Counters&#10;&#10;&#10;",
        "artist": "Blackwell Hird"
    },
    {
        "name": "Heckmeck Junior",
        "description": "Kids have been waiting for this a long time: Eventually, the fun the older players are having with Pickomino is now also available for the younger ones &ndash; in a charming, funny, and perfectly age-based dice game: Heckmeck Junior.&#10;&#10;The player, who can roll the tastiest ingredients for his Mac Heck burger on the six dice, becomes &ldquo;Worm King of the Day&rdquo;. Cucumbers, cheese, and ketchup make the chicken wings of our young poultry flutter for joy. If you manage to acquire many different delicacies throughout your dice rolls you may put a lot of tasty roast worms onto your plate. In case your desired treat has already been taken from the grill, though, you may of course also eat from your opponents&rsquo; plates.&#10;&#10;The main difference between Pickomino and the junior version is that besides the inevitable worms, the dice have different food symbols (cheese, ketchup, rolls) on them instead of numbers, and the tiles have one-digit numbers that are easier to count.&#10;&#10;",
        "artist": "Doris Matthäus"
    },
    {
        "name": "Heckmeck Barbecue",
        "description": "On the highest fun level, &quot;Heckmeck BBQ&quot; features thrilling dice-rolling for roast worms. The game board (newly introduded to the world of Pickomino) invites the players to 14 different BBQ sites. In order to conquer those desired sites, a player puts aside all identical symbols from his dice roll and continues rolling the remaining dice. As soon as his dice roll result reaches the value of an empty BBQ site, he may broil and eat his worms there. However, the opponent players may also establish themselves at the same site (it's another difference from Pickomino) and claim the tasty worms. And only at very precious BBQ sites players can find the latest BBQ trend: roast snails.&#10;&#10;Packed in an attractively styled &quot;BBQ Dice&quot;, the game not only fascinates worm-loving Pickomino fans. The new dimension of the &quot;Worm Universe&quot; in &quot;Heckmeck BBQ&quot; also lets players who haven`t tried any tasty worms yet discover their desire for roast snails.&#10;&#10;",
        "artist": "Doris Matthäus,Eva Paster"
    },
    {
        "name": "Kraken-Alarm",
        "description": "With their research ship each player looks to discover animals in the sea. But look out for the big kraken because he will try to entangle your ship in his arms. The game features an innovating tilting mechanism (this is activated when a ship gets caught by the kraken). The player who discovers as many different animals as possible wins the game.&#10;&#10;",
        "artist": "Michael Menzel"
    },
    {
        "name": "1862: Railway Mania in the Eastern Counties",
        "description": "1862: Railway Mania in the Eastern Counties is an 18xx game set in East Anglia, England. It features a company-packed board, where 16 of 20 companies are randomly selected for use on a board containing only 37 hexes. Major features of the game are:&#10;&#10;&#10;     Petitioning parliament as a means of floating your preferred company&#10;     a mixture of full and partial capitalisation for companies&#10;     three train types with differing objectives and building requirements&#10;     company mergers and re-floatation&#10;     1860-style semi-linear stock-market featuring multiple stock jumps.&#10;&#10;&#10;",
        "artist": "Mike Hutton"
    },
    {
        "name": "Safranito",
        "description": "From the publisher Zoch:&#10;&#10;&ldquo;Safranito&rdquo; is an extraordinary action-filled game that challenges skillful tactics as well as tactical dexterity.&#10;&#10;Like no other game before, &ldquo;Safranito&rdquo; is a combination of dexterity and tactics providing the game with a new, superb playing experience. At an Indian spice booth, the players bargain for the precious ingredients they need for their exquisite meals. Thereby, everyone throws their Indian coins face-down onto the bowls depicted on the game board. The players may bluff and push the opponents&rsquo; coins aside. A clever coin thrower is able to arrange the coins on the game board in a way that allows him to do both: sell his spices at a high price and purchase cheap spices as well. Eventually, the first player wins who has been able to acquire the spices needed to serve the maharajah his desired meal.&#10;&#10;",
        "artist": "Michael Menzel"
    },
    {
        "name": "Schlag den Raab: Das Spiel",
        "description": "&quot;Schlag den Raab - Das Spiel&quot; is a board game based on a German TV show.&#10;The players have to compete in different &quot;mini-games&quot;, where they have to demonstrate knowledge and motor skills.&#10;&#10;Among those 36 &quot;mini-games&quot; there is one, where players have to point to cities as exactly as possible on an empty map. In another game, you have to drop an egg and catch it. A third game is about answering rather easy questions, that are really tricky if you have no time to think about it. So for example: How many vertex has a cube? A lot of people will answer 6 instead of 8.&#10;&#10;The &quot;mini-games&quot; are chosen randomly. The players score points in all these games. After the chosen number of &quot;mini-games&quot; is played, the one with the highest score is the winner.&#10; ",
        "artist": "NA"
    },
    {
        "name": "The Dark Valley",
        "description": "(from GMT website:)&#10;&#10;The Dark Valley is a new game from award-winning designer Ted Raicer, focusing on the entire East Front campaign in World War II. The game components feature a beautiful map from Mark Mahaffey, stretching from Leningrad in the north to the Caucasus Mountains in the south, and around 600 counters representing every major unit that appeared during the course of the conflict. Initially most Soviet infantry are divisions, but as the game progresses these are replaced by armies and corps, so that players are not overwhelmed by the increasing Soviet Order of Battle.  All German mechanized divisions are present in the game, while their infantry is a mix of division and corps.&#10;&#10;Although the game is a semi-monster, and covers the entirety of the conflict from the launch of Barbarossa to the end of the war, the game system emphasizes playability rather than rules overhead, allowing the players to concentrate on strategy choices rather than rules minutiae.&#10;&#10;The core of the game system is a &ldquo;chit-pull&rdquo; activation system. Each turn a variety of action chits are drawn, in a random order, from the Action Chit Pool, and it is this that determines the exact flow of operations on that turn. [...]&#10;&#10;This chit-pull system imposes constant uncertainty upon the player and introduces considerable tension into the game. [...]&#10;&#10;The Axis supply network, which imposed crucial restraints upon the effectiveness of the offensive, is represented using supply depot units.[...]&#10;&#10;Besides the full campaign game, TDV features scenarios for Barbarossa, Case Blue, Kursk, and the Destruction of Army Group Center. Scenario start dates can also be used to explore shorter versions of the campaign.&#10;&#10;The Dark Valley is designed to be playable and exciting, modeling the tension of the campaign elegantly and simply. The game also plays very well in solitaire mode due to the underlying chit-pull system. From the German blitzkrieg in 1941 to the blazing ruins of Berlin, The Dark Valley provides a truly new look at this much-gamed theater.&#10;&#10;TIME SCALE: 1 or 2 months per turn&#10;MAP SCALE: 20 miles per hex&#10;UNIT SCALE: Divisions/Corps/Armies&#10;&#10;COMPONENTS:&#10;&#10;    Two 22x34&quot; maps&#10;    Three sheets of 1/2 &quot; counters&#10;    Four Player Aid Cards&#10;    Two 6-sided dice&#10;    Rules Booklet&#10;    Players Booklet &#10;&#10;&#10;&#10;&#10;DESIGNER: Ted S. Raicer&#10;DEVELOPER: Paul Marjoram&#10;MAP ART: Mark Mahaffey&#10;COUNTER ART: Charles Kibler&#10;&#10;",
        "artist": "Charles Kibler,Rodger B. MacGowan,Mark Mahaffey,Mark Simonitch"
    },
    {
        "name": "Dizios",
        "description": "Created By MindWare, Dizios is the bright, bold and brain-bending domino game with a dizzying twist! Two or more players take turns placing tiles into the grid by matching up edges, and earn points according to the pieces on the board that your tile touches. Includes 71 glossy, thick chipboard game tiles.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Last of the Independents",
        "description": "Ever wonder what happened to Studebakers, Packards, Ramblers, and all the rest of the &ldquo;orphan&rdquo; brands? Last of the Independents is a Euro-styled resource management game that simulates the building, engineering, and promotion of cars by the smaller independent American automobile companies in the post-WWII era. It depicts some of the difficult challenges executives faced as they vied against each other and the &ldquo;Big Three.&rdquo; Design, engineer, and advertise your way to commercial success in the wide-open car market of the Golden Age of automobiles.&#10;&#10;",
        "artist": "Patrick Stevens,Orlando Villagran"
    },
    {
        "name": "Boomerang",
        "description": "&quot;Choose your area, start your boomerangs, capture the animal ... and beware of other players.&#10;&#10;Auction game of bluff. Players use cards with animals of two colors to win majorities and win the animal cards. A simple mechanism but players need a good self-control to get opponents to make mistakes.&#10;&#10;",
        "artist": "Dominique Ehrhard,Michel Lalet"
    },
    {
        "name": "MERCS",
        "description": "MERCS is a skirmish game of miniature combat taking place in the future. Games consist of two squads of 5, which have all special equipment and skills. The miniatures act simultanously, using a system of initiative and reaction to determine the exact order of turns.&#10;&#10;MERCS uses unique cards as both reference and a means to measure. This streamlined approach means games are faster, with less rule-lawyering, providing a dynamic feel with combat that ebbs and flows. It also means that a game of MERCS is flexible; it can be played just about anywhere with any number of people. All that is needed is 1 fi g, 1 card, and 1d10.&#10;&#10;The game board can use 3D terrain, but is equally dynamic with the provided 2D terrain cards.&#10;&#10;",
        "artist": "Keith Lowe"
    },
    {
        "name": "VeloCity",
        "description": "A tactical dice game. Each player manages a team of bicycle messengers and tries to get as many of his own riders as possible to the goal.&#10;&#10;When rolling a die to move one of your messengers you can land on three different types of fields on the board:&#10;- most fields have no special effect&#10;- some give an energy boost (a vitamin drink)&#10;- some are obstacles which require you to use a vitamin drink, or slow you down.&#10;&#10;Vitamin drinks can be played for other benefits in the game.&#10;&#10;Instead of selecting a single messenger, one can also roll multiple dice for an entire group of riders. This allows a player to choose the most beneficial result, but in turn means that opponents' riders will also move.&#10;&#10;The game ends as soon as all 3 messengers on a team reach the goal or eight total messengers have reached the goal. The team that has the most messengers at the goal wins. In the case of a tie, the player whose messenger crossed last wins. This is important, since during the end phase players may hold back messengers to avoid reaching the goal too soon.&#10;&#10;",
        "artist": "Harald Lieske"
    },
    {
        "name": "Charly",
        "description": "The game comes with: &#10;- Plastic honey drops of which each players gets 15 at the beginning of the game&#10;- Cards with one or more animals (dogs, monkeys, rabbits, mice and pigs)&#10;- Cards with the animals favourite food on them&#10;&#10;Except for the pigs, all animals are quite choosy and will only eat their favourite food. Pigs can be used to steal opponents food.&#10;&#10;Game-play has two phases: First, each player is dealt some random animal cards and tries to optimize his hand by discarding and drawing new cards. Then each player must feed all his animals. If a player doesn't have enough food, he has to substitute honey drops to console his animals. The game ends when there's no food left. Whoever has the most honey drops left wins.&#10;&#10;",
        "artist": "Christian Fiore"
    },
    {
        "name": "Tank on Tank",
        "description": "From the publishers website:&#10;&#10;&quot;June 6, 1944.&#10; The Allies land in Normandy to liberate France from German rule. The liberation however, won&rsquo;t be an easy road. From D-Day at Omaha Beach, through the battle for Normandy, the Allies will fight the Germans tooth and nail, bayonet and rifle, tank on tank.&quot;&#10;&#10;Tank on Tank is a new Peter Bogdasarian design. A smaller game that can be learned in less than five minutes and played during a lunch break, Tank on Tank depicts tactical ground combat in Europe in the latter years of World War II.&#10;&#10;&#10;     The scale? It doesn&rsquo;t really matter in Tank on Tank, let&rsquo;s just call it tactical.&#10;     The units? Tank on Tank includes Shermans, Wolverines, Priests, Tigers, Mark IVs, as well as the infantry and anti-tank guns that fought alongside them.&#10;     If you&rsquo;ve been looking for a simple game to scratch that tactical itch, or something to introduce a young tactician to war gaming, Tank on Tank might be the answer.&#10;&#10;&#10;This game is out of print. and the latest editions can be found below.&#10;&#10;&#10;     Tank on Tank: West Front&#10;     Tank on Tank: East Front&#10;&#10;&#10;",
        "artist": "Marc von Martial"
    },
    {
        "name": "Frutti di Mare",
        "description": "At the fish market there are five stalls, each specializing in a different type of Seafood and the stall keepers try to do good business. During the day the prices  rise and fall according to demand. No one should be left with the Seafood whose price has crashed!&#10;&#10;Winner of &quot;Best Card Game&quot; prize at &quot;Premio Archimede&quot; 2008 with the name &quot;Portobello Road&quot;&#10;&#10;",
        "artist": "Cristiana Giuriato"
    },
    {
        "name": "Ultimate Werewolf: Compact Edition",
        "description": "Ultimate Werewolf: Compact Edition is &quot;Ultimate Werewolf in your pocket,&quot; with 40 cards, dozens of roles and a comprehensive set of rules. Fully compatible with Ultimate Werewolf: Ultimate Edition (if you need extra cards for more players) and Ultimate Werewolf: Classic Movie Monsters. While compact, this version of Ultimate Werewolf plays up to 34 players at one time!&#10;&#10;Ultimate Werewolf: Compact Edition Roles:&#10;Apprentice Seer&#10;Bodyguard&#10;Cupid&#10;Diseased&#10;Hunter&#10;Idiot&#10;Lycan&#10;Mason (2)&#10;Mayor&#10;Old Hag&#10;P.I.&#10;Pacifist&#10;Prince&#10;Seer&#10;Spellcaster&#10;Villager (12)&#10;Witch&#10;Sorcerer&#10;Werewolf (5)&#10;Wolf Cub&#10;Cursed&#10;Cult Leader&#10;Tanner&#10;Lone Wolf&#10;&#10;",
        "artist": "Sanjana Baijnath"
    },
    {
        "name": "Water Lily",
        "description": "From the Publisher: &#10;Princess Water Lily and her sisters are to be wed! Frogs from all the Kingdom have heard the news and want to take part in the Royal Race, because the winners will marry them and become Princes!&#10;But it's a tricky race: hopping forward too fast will get you only a few points, and arriving too late no points!&#10;Water Lily is a suspenseful short race game from acclaimed designer Dominique Ehrhard (Marrakech, MacGregor, Crazy Circus, Serenissima, Condottiere...), a blend of bluff, tactical moves and some luck.&#10;&#10;",
        "artist": "Vincent Dutrait"
    },
    {
        "name": "Tikal II: The Lost Temple",
        "description": "From the Publisher:&#10;Tikal was discovered and explored during a very successful expedition led by Profs. Kramer and Kiesling. A decade later, a scroll is found that hints of a lost temple near the first site. This rumor rekindles their passion for Tikal and the two scientists start to discuss the prospect of another expedition to Central America. In the midst of their planning they encounter Profs. Braff and Pauchon at an international archaeology conference in Geneva, who want to know the truth about the enticing rumour.&#10;&#10;Later that day, sitting in front of a roaring fire after a fine meal finished off with Cuban cigars and a few brandies, the two Swiss scientists listen enthralled by the unfolding plans of their German colleagues. To a man they clamour their unanimous assent and it is decided to join forces and go back to Tikal. Appointments are made, patrons are found, equipment is assembled, notes are compared, and then they are off.&#10;&#10;An uneventful journey takes them to Guatemala, and then on to the old site. Not too long after, they discover that there is indeed an undisturbed temple in an adjacent valley. As it belonged to a long-forgotten king, the temple promises many surprises and much, much gold. And so the adventure begins...&#10;&#10;&#10;Tikal II: The Lost Temple is a sequel to 1999 Spiel des Jahres winner Tikal, from world-famous duo Kramer-Kiesling.&#10;&#10;Actions points have given way to two actions per turn :&#10;1) move part of your expedition around the board to choose an action tile, and then&#10;2) move your head scientist within the temple to explore new rooms and find gold.&#10;&#10;There are many ways to score. Collecting and delivering treasures is one, and having the majority in some rooms or exploring the main temple as well as an outer secret chamber, are others.&#10;&#10;Tikal II calls for careful planning, as your scientist can't move freely within the temple without specific items, and tension, as the actions around the board grow scarce. A game consists of two rounds, each concluded by a scoring. In the end, the player with the most gold is declared winner.&#10;&#10;",
        "artist": "Vincent Dutrait"
    },
    {
        "name": "PIX",
        "description": "You know how to draw? Good, then PIX is a game for you as it offers a new challenge: drawing with pixels!&#10;&#10;You don't know how to draw? Good, then PIX is a game for you as you'll draw just as well as anyone with pixels!&#10;&#10;That's the publisher's come-on for the party game PIX, in which your &quot;drawing&quot; skills will be put to the test. During set-up, you'll receive a magnetic board, twenty black square &quot;pixels&quot; and one red pixel; one or two other players will have the same color magnetic board as you. On a round, the players holding one color of boards will be challenged to create a pixellated image of a secret word.&#10;&#10;Once the drawing time has run out, each player will reveal her artwork in the hopes that someone will guess what the image is. Both the correct guesser and the player who created that image score points &ndash; but here's the catch: Drawings are revealed according to the number of pixels used, so the fewer pixels you use, the more likely you are to show your image first, but the less likely other players are to guess what it is. Well, maybe &ndash; perhaps you're an 8-bit wizard and others will decipher your creations instantly...&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Sobek",
        "description": "From the Publisher:&#10;Spring/Summer 2010&#10;Pitch: Ancient Egypt... The temple of Sobek is being built and the market place is thriving. Loads of goods arrive by ship for the construction site and it is a race to pick the best items in order to sell them with the most profit.&#10;&#10;Of course, with so much at stake, not all the moves are legal, corruption is everywhere and cordiality scarce. Because in the end there can be only one winner!&#10;&#10;---&#10;&#10;Famous Bruno Cathala's (Cyclades, Dice Town, Shadows Over Camelot, Mr. Jack, MOW...) latest design is a fast paced card game well suited for the whole family, with tactical choices, luck, and a bit of cunning.&#10;&#10;Each turn you have to choose if you want to take a goods card, play a character with a special power or display a set of matching goods cards.&#10;While taking a profitable card, you often collect corruption points, which add up in a pile in front of you. &#10;During each each round five sets of nine cards are put at the players' disposal. When all cards are gone, there is a scoring for all displayed cards, but beware, the player with the most corruption sigils sees his income almost cut down in half.&#10;&#10;The game ends after 3 rounds or if a player has reached a hundred points.&#10;&#10;",
        "artist": "Mathieu Beaulieu"
    },
    {
        "name": "The Coming Storm",
        "description": "From the Publisher:&#10;&#10;These four games explore the major battles of 1806-07, where the French Army encountered two different opponents with different capabilities, from the leadership-challenged Prussians in Saxony to the chaotic battle conditions in winter against the Russians. Based on OSG's Special Studies, which provide a turn by turn narrative of the four battles. Each game shows the approach to the battlefield on the day before battle. The Jena-Auerst&auml;dt game has both battlefields on one map and allows both sides to re-deploy before battle. Set at the scale of Napoleon's Last Battles-525 yards per hex and one hour turns-the game retains the Command System of Commanders and Corps Officers.&#10;&#10;BATTLES SIMULATED&#10;JENA-AUERST&Auml;DT-13-14 October 1806&#10;PULTUSK/GOLYMIN-24-25 December 1806&#10;EYLAU-7-8 February 1807&#10;FRIEDLAND-13-14 June 1807&#10;&#10;DESCRIPTION&#10;Napoleon's Last Battles system, following Four Lost Battles: 525 yards (480 meters) per hex, 1 hour per turn, 500-800 men per strength point. Each game lasts about 40 turns.&#10;&#10;COMPONENTS&#10;Four 22 x 34&quot; full-color maps&#10;Two Rulebooks (36 pages and 24 pages)&#10;One 2&quot; game box&#10;Two counter sheets = 560 units&#10;Three player aid sheets&#10;Four player aid cards&#10;Two decks of 50 playing cards = 100 cards&#10;&#10;GAME SYSTEM &#10;Napoleon's Last Battles (NLB-Series) &#10;- scale = 480m/hex, &#10;- time = 1hour/GT,&#10;- strength = 500-800 men/SP.&#10;&#10;",
        "artist": "Knut Grünitz,Charles Kibler,Mark Simonitch,Robert Tunstall,Joe Youst"
    },
    {
        "name": "Catan Histories: Settlers of America – Trails to Rails",
        "description": "Catan is off the island and in America.  Fans of Catan are eagerly anticipating the next release in the Catan Histories line.&#10;&#10;The 19th Century has arrived, and Americans are heading west. Wagon trains are forming up and heading out to settle new lands and build new cities. These new cities will need railroad lines to bring in new people and necessary goods. Some head west for the adventure, some to start a new life, still others to find work.&#10;&#10;Look west to make your fortune. As the population grows, resources will dwindle, and the smart money seeks new sources and new markets. Finance your settlers as they head west to build the cities of tomorrow. Link these cities with rails of steel and operate your railroad to supply the townsfolk with goods. To the west lie lands to settle and fortunes to be made!&#10; Settlers of America: Trails to Rails uses the familiar Catan hex-tile grid to present a map of the United States. Players collect and trade resources in order to purchase, migrate and build settlements, forge railroads, and acquire locomotives. Railroads are used to distribute goods to the interconnected cities. As westward locations are settled, old sources of resources deplete. The addition of gold adds to the depth of play and increases options for the players.&#10;&#10;",
        "artist": "David Cochard,Pete Fenlon,Harald Lieske,Mark Zug"
    },
    {
        "name": "Warmachine Prime Mk II",
        "description": "Step into a world forged of iron and tempered by war.&#10;&#10;In WARMACHINE, the very earth shakes during fierce confrontations where six-ton constructs of iron and steel slam into each other with the devastating force of a locomotive, where lead-spewing cannons chew through armor plating as easily as flesh, and where bold heroes set the battlefield ablaze with a tempest of arcane magic as they forge the fates of their unyielding nations in the fires of destruction.&#10;&#10;WARMACHINE Prime: Mk II is the core rulebook for the second edition of the award-winning tabletop wargame WARMACHINE. The popular game now plays faster, easier, and more aggressively than ever before. Prime Mk II includes the rules for the game; detailed profiles and game stats for powerful characters, warjacks, and soldiers; histories of the nations of the Iron Kingdoms; and an instructional hobby guide that will help bring your tabletop battlefield to life.&#10;&#10;",
        "artist": "Kris Aubin,Daren Bader,Matt Dixon,Brian \"Chippy\" Dugan,Kimberly Goddard,Ilich Henriquez,Andrew Hou,Imaginary Friends Studio (IFS),Sean Jones,David Kidd,Luke Mancini,Josh Manderville,Sławomir Maniak,Karl Richardson,Brian Snoddy,Stuart Spengler,Greg Staples,Andrea Uderzo,Chris Walton,Eva Widermann,Matt Wilson,Drew Wolf"
    },
    {
        "name": "Armorica",
        "description": "(by the designer, partially adapted from the publisher's website)&#10;&#10;It is 100 AD and the Celtic nation of Armorica (Brittany) has been conquered by the Roman Empire. Now, the administrators of Armorica try to increase their prestige by attracting wealthy Romans immigrants. However, Roman Patricians have expensive tastes, and it will take a lot of development to make a barbaric province like Armorica appealing.&#10;&#10;Armorica is the third game in Vainglorious Games' Celtic Nations series.  It is a challenging card-drafting game, in which players must anticipate the likely choices of their opponents in order to win.  Each turn, players select cards from face up displays and add them to their personal tableaus.  Icons in player's personal tableaus increase the range of cards from which they can select, allow them to retain more cards in their tableaus, and provide different sources of victory points.&#10;&#10;",
        "artist": "Eric B. Vogel"
    },
    {
        "name": "Hey Waiter!",
        "description": "Hey Waiter! is the first published design from Tichu fan extraordinaire Anthony Rubbo, and while it's not a trick-taking game, it is a game with tricky card play. Each player is a waiter trying to deliver his stack of dishes before anyone else, with the dishes being represented by a stack of colored chips on a face-down card.&#10;&#10;Players each have a hand of cards, a few of which might be special action cards while the majority will be divided into two narrow rectangles. To play these cards, the player chooses two cards and uses the right half of one card and the left half of the other. Thus with a handful of cards, each half of a card can be combined in up to a half-dozen ways. The cards let you take actions like moving a token from one stack to another, with the primary action being to deliver food. When you deliver a dish, however, everyone with that type of dish on top of his stack gets to deliver it, so ideally you can first place a token on the opponent&rsquo;s stack in order to lock down that dish.&#10;&#10;You can also split your stack into two or more stacks, thereby giving you more opportunities to deliver dishes &ndash; but doing so reduces your hand size and limits the chances that you'll be able to do what you want!&#10;&#10;",
        "artist": "Jennifer Vargas"
    },
    {
        "name": "Rails of New England",
        "description": "Description from BoardgameNews.com:&#10;&#10;Players in New England Rails each represent a particular state during the 19th century &ndash; Connecticut and New Hampshire with two players, with Vermont added for three players, and so on &ndash; and start with two or three businesses in play under their control. Your goal in NER is to have more assets than other players at game end, as determined by cash in hand, cost of businesses owned, special routes completed and state subsidies acquired.&#10;&#10;The game lasts at most 16 rounds. Each round players forecast the upcoming economic condition &ndash; depression, normal or prosperity &ndash; for a future turn, then take care of any events that occur, such as &quot;Improved Bridge Building Techniques&quot; that allow players to build across estuaries or &quot;Sheep Boom Goes Bust&quot; which represents the decreased demand for wool from New England farmers as the century progressed. Four of the first five events are fixed and represent historical activities, while the other events &ndash; including devastating floods, snow, and an improved business climate &ndash; are randomized into a face-down deck. Players then each draft a business or action card, with the option to play it immediately (thereby gaining a free action) if they choose to pay the cost.&#10;&#10;During the subsequent development phase, players take two actions in turn order, either building twice, playing cards twice, or doing each action once. Players want to build depots that connect their businesses to one of the major markets in the area: New York, Boston or Montreal; to do so, they need to pay the track costs as well as the cost of the depots themselves. Players can build multiple depots in the same action, but the cost is higher since they're doing more work in the same amount of time. Once a business is connected, it earns the owner more income each turn since it's now supplying a larger, richer market. The cards allow players to start new businesses, play special actions, claim a special route (which generates income), claim one of the six state mail contracts, or collect a state subsidy, which provides special benefits like a free depot.&#10;&#10;As the game progresses, the players pass through time time periods, with different businesses being available in each. The first period focuses on crafts and farms, for example, while the second introduces more industrial businesses such as shoe and textile production. When passing from one period to another, players must choose to make some of their existing businesses obsolete. Since a player can manage only eight businesses, however, you'll likely want to make room for more profitable ventures anyway.&#10;&#10;If all mail routes, state subsidies and special routes are claimed by the end of any round, the game ends at that point; otherwise the game ends after round 16, with the richest player winning New England Rails.&#10;&#10;",
        "artist": "Ryan Laukat"
    },
    {
        "name": "Monsterpocalypse: Voltron – Defender of the Universe Battle Game",
        "description": "Press Release:&#10;Expected release: July 2010 - Date subject to change.&#10;&#10;Voltron: Defender of the Universe battle game includes everything two players need to stage epic battles between the forces of Voltron and the Galaxy Alliance and Prince Lotor and his robeast Lo-tron of the fiendish Drule Empire.&#10;&#10;Includes 22 pre-painted plastic figures, including Voltron, 5 Voltron Lions, 5 Galaxy Garrison Cruisers, Lo-Tron, 1 Prince Lotor&rsquo;s Command Ship, 4 Robeasts, and 5 Lo-Tron Force Skull Ships. The game will also include 1 double-sided play mat, 24 specialty dice, 4 status counters, and a full-color rulebook. Completely compatible with all current Monsterpocalypse series.&#10;&#10;--&#10;Kakaris Maelstrom adds:&#10;Voltron: Defender of the Universe is a standalone game in the Monsterpocalypse game world, targeted at gamers who were hoping to see more &quot;name brand&quot; monsters in the game. The Voltron box offers players an excellent (and complete) way to get into the game but with some characters you're likely already familiar with. The game is also fully compatiable with other Monsterpocalypse miniatures and maps, so you'll no doubt start to see Terra Kahn vs. Voltron and such.&#10;&#10;Voltron (and his nemesis Lo-Tron) are morphers, a type of monster whose Alpha form is made up of a series of unit-sized pieces. Voltron is unique in that previous morpher's Alpha forms were made up of 4 units, whereas Voltron and Lo-Tron are both 5 units.  In addition, the battles are fought in space rather than on a traditional Monsterpocalypse city block.&#10;&#10;Monsterpocalypse is a unexpectedly strategic CMG. Based in the world of kaiju (loosely translated from Japanese as &lsquo;giant monster&rsquo;), you'll control a monster and a legion of support units. You'll vie for control of critical board positions as you try to optimize your die pools. Then unleash your fury against your opponent's monster using a variety of power attacks, destroying a city block or two along the way.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Harry Potter Hogwarts",
        "description": "Description from BoardgameNews.com:&#10;&#10;Players in Hogwarts must navigate the castle's shifting staircases and secret passages &ndash; something in the book and movie that's represented in the game by small square path pieces that can change their locations in a central grid. To win, players need to collect the homework from their classes and return to the common area.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Caveman Curling",
        "description": "On an icy lake, two clans of prehistoric men clash in a match of Kairn, better known as Caveman Curling, this being an ancestor to the modern sport of curling. Players compete as individuals or are grouped into two clans, and they try to land their stones the closest to a target each round. On a player's turn he takes two actions:&#10;&#10;&bull; He launches a stone across the ice, flicking it with his finger toward the target on the other end of the game board.&#10;&#10;&bull; To improve the positioning of his stone or the chances of it staying in place, he can choose to use either a small or large hammer or a totem. With a hammer, the player moves the stone according to the size of the hammer. As for the totem, the player sets it on top of the stone; if the totem falls off the stone, the player can shoot it again on a later turn.&#10;&#10;If your player or clan has one or more stones closer to the center of the target than the other clan, you score points. The first player/clan to collect six points wins.&#10;&#10;A note about the different editions.&#10;&#10;Caveman Curling (2012)&#10;Kairn (2010)&#10;&#10;There are significant production differences between Kairn and Caveman Curling, though the game play is almost identical between the two versions. Kairn (200 copies) was designed and self-published by Daniel Quodbach in 2010. Blackrock Editions and Scorpion Masque produced 1000 copies of Kairn and released it at Essen in 2011. Gryphon Games version of the game has yet to be produced, pending the conclusion of a current Kickstarter campaign that was organized to gauge demand for its version. Caveman Curling is scheduled for mass production in January, 2012, and to be released in late February, 2012. The first and only production copy of the Gryphon version will arrive in the US on December 14, 2011 and a video will be made showing the differences between Kairn and Caveman Curling.&#10;&#10;",
        "artist": "David Boniffacy"
    },
    {
        "name": "Bubble Talk",
        "description": "In the party game Bubble Talk, the active player each round presents one of 150 images included in the game to the other players; these players then each choose one of the caption cards in their hands, and the active player decides which caption fits the image best, awarding the image card to the player who submitted that caption. Bubble Talk includes 300 different caption cards, with the captions presented in word balloons, aka, &quot;bubble talk&quot;.&#10;&#10;",
        "artist": "Stéphane Gantiez"
    },
    {
        "name": "Battles of Westeros",
        "description": "Unfurl the banners of the Great Houses of Westeros! To secure power in the Seven Kingdoms and to ensure the survival of their lines, the Houses of Westeros each follow very different paths. Some forge strategic alliances, some create complex political intrigues, and still others use deceit and betrayal. But there is no more direct or lasting path to power than taking to the field of battle.&#10;&#10;In Battles of Westeros, two players recreate the military conflicts set in George R.R. Martin&rsquo;s A Song of Ice and Fire series, taking part in battles directly from the books... or designing their own. In this epic board game of battlefield tactics, players control either House Stark, the wards of Winterfell who have called their hearty allies to defend their honor and lands, or House Lannister, an aggressive force funded by Casterly Rock&rsquo;s endless supply of gold.&#10;&#10;Battles of Westeros is played over one of several included scenarios, called battles. Each of these has a battle plan that dictates the formation of the map (called the battlefield), starting positions of each House&rsquo;s units, starting resources, special rules, and victory conditions for the game session. A battle is played over several rounds, with each round consisting of alternating player turns. The goals a player needs to accomplish to win a game of Battles of Westeros can vary (some battles require players to earn a certain number of victory points, while other battles require a player to take and hold strategic positions on the battlefield), but this collection of available scenarios, along with the ability to make your own exciting battles with the double-sided map board and over thirty map overlays, gives Battles of Westeros a wealth of replayability!&#10;&#10;Battles of Westeros also offers plenty of strategic complexity, resulting in a satisfying number of compelling choices in every game. For example, each player has a special randomized Leadership Deck, consisting of unique tactics and abilities; this deck will change based on the scenario being played and characters present. Is Jaime Lannister on the battlefield? If you draw the appropriate Leadership Card, he can order nearby troops to aggressively rush their opponents! Is Eddard Stark guiding his forces into battle? Special flanking maneuvers enter your Leadership Deck, to potentially be drawn into your hand.&#10;&#10;Battles of Westeros also features a level of realism that immerses you in the most significant conflicts of the War of the Five Kings. Each plastic figure base, which holds your infantry, archer, cavalry, and kennelmaster units, has a slot for a banner pole &ndash; a small flag-bearing attachment. The plastic banners that attach to each unit bear the crest of that unit&rsquo;s house, and their orientation on the pole indicates at a glance whether that unit has been ordered yet. In addition to the intuitive and useful game effect this provides (differentiating the units you&rsquo;ve activated from those you haven&rsquo;t), the sight of your army&rsquo;s banners spread impressively across the gorgeously designed game board will give you the sense that you are the clever Tywin Lannister, Lord of Casterly Rock... or the stoic Robb Stark, with his direwolf Grey Wind at his side!&#10;&#10;",
        "artist": "Tomasz Jedruszek,Henning Ludvigsen"
    },
    {
        "name": "Die Säulen der Erde: das Kartenspiel",
        "description": "This card game version of Pillars of the Earth is a trick-tacking game with a twist.&#10;The player whose colour is the highest card wins the trick, regardless of who played it.&#10;Your aim is to score victory points by winning the tricks containing your own workers and utilising them to convert resources found on other cards. &#10;Diverse Character cards are adding options to influence the gameplay further.&#10;&#10;",
        "artist": "Michael Menzel,Anke Pohl,Thilo Rick"
    },
    {
        "name": "D-Day at Tarawa",
        "description": "Based on John Butterfield's groundbreaking D-Day at Omaha Beach system, this solitaire game presents the critical days of fighting at platoon and company scale. You command the invading American forces against dug-in Japanese defenders, which are controlled by the game system. Tarawa covers the landings on Betio Island in November 1943, and the operations of the US 2nd Marine and 27th Infantry Divisions to clear it -- the first heavily contested landing of the Pacific War. The battle for the tiny Island raged for four days and, when it was finally over, fewer than 200 of the 5,000 Japanese defenders remained alive. One map, two counter-sheets and 55 cards.&#10;&#10;",
        "artist": "Larry Hoffman,Joe Youst"
    },
    {
        "name": "D-Day at Peleliu",
        "description": "D-Day at Peleliu focuses on the landings by the US 1st Marine Division in September 1944, and the bitter two-day struggle to capture the airfield on the southern end of the island. A longer campaign scenario allows the player to extend the action to the rugged terrain of &quot;Bloody Nose Ridge.&quot;  Opposed by the reinforced Japanese 14th Infantry Division, the battle resulted in the highest US casualty rate of any in the Pacific war. Like D-Day at Omaha Beach, D-Day at Peleliu features landing hazards, variable enemy positions, fields of fire encoded onto the map, US weapon types versus Japanese defensive preparations, and a random-event-driven narrative. Plus new features unique to the Pacific Theater, such as: US naval and aerial bombardment, flamethrowers, offshore reefs and defensive positions, Japanese tank attacks, tunnel network movement and Banzai charges. One map, one counter-sheet and 55 cards.&#10;&#10;",
        "artist": "Chris Dickson,Howard David Johnson,Lise Patterson"
    },
    {
        "name": "Way of the Dragon",
        "description": "This is the ultimate race between the five elements. The earth dragons, the water tortoises, the metal tigers, the fire birds and the wood dragons cross the way of the Great Celestial Dragon to gain immortality.&#10;&#10;The goal of the game is to get your five pieces as far as possible through the five paths when the game ends. This happens when at least one of the players has reached the end of the five paths.&#10;&#10;",
        "artist": "Carlos Aliaga,Néstor Romeral Andrés"
    },
    {
        "name": "Scrabble Flash",
        "description": "Description from the publisher:&#10;&#10;The object of Scrabble Flash is to slide, swap and shuffle the five electronic tiles to create as many three-, four- or five-letter words as possible in sixty seconds. This fast-paced word-building game uses &quot;SmartLink Technology,&quot; which allows the five electronic tiles included in the game to &quot;talk&quot; to each other. When the Scrabble Flash tiles are lined up to create a new word, the tiles will light up and beep. Scrabble Flash tiles also keep time and score. This groundbreaking technology allows players to compete individually against the game and try to earn the highest score possible.&#10;&#10;Three unique games can be played with Scrabble Flash. In the &quot;Flash&quot; game, players try to find as many three- to five-letter words as possible using the letters shown on the tiles. Five seconds are added to the play clock for every five-letter word formed. &quot;Five Letter Flash&quot; has players rushing to find the one five-letter word that uses the letters shown on the tiles. The game continues if the correct word is unscrambled. Play Scrabble Flash with a group in &quot;Pass Flash&quot; where players take turns forming five-letter words.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Offerings",
        "description": "It is 430 B.C, the era of the Peloponnes war. Hit by famine and plague, the different cities of Greece tries to gain the favor of the Gods and Goddesses of Olympus by offering them the most attractive sumptuous ritual sacrifice.&#10;&#10;The game consists of three phases.&#10;Firstly : the bidding phase. Players would have to recruit different offerings/materials necessary for the ritual of sacrifice through bidding. Players will need to out-bid each other to obtain the materials/offerings.&#10;&#10;Secondly : the corruption phase. The corruption phase is another way of obtaining the most important offerings/materials needed for your ritual by stealing them from your opponents.&#10;&#10;Last but not least : the ritual sacrifice. This is your time to gain the favor of the Gods and Goddesses of Olympus. During the ritual sacrifice, you honor the Olympus Gods by offering them the most sumptuous sacrifice and gain devotion points from them.   But beware, towards the end of the game, as the number of altars available in the temple becomes less&hellip; players will need to out-wit their opponents to gain the favors of the Gods by offering the most sumptuous ritual sacrifice they can possibly offer before all of the altar runs out. And only one will gain the favor of the Gods.&#10;&#10;",
        "artist": "Pierô"
    },
    {
        "name": "Nab-It!",
        "description": "Description from BoardgameNews.com:&#10;&#10;Nab-It! is reminiscent of the word game Upwords in that players can stack letter tiles on existing letter tiles in order to create new words, but there are three differences: (1) the game includes no board, (2) each player has her own set of tiles in a particular color, and (3) the player who has the highest or most tiles in a word scores one point for that word (no matter how long) once the game ends.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Piou Piou",
        "description": "Panic in the hen house, the fox is on the prowl and the eggs have not yet hatched ... [back of the box]&#10;&#10;When it his turn to play, the players chooses : &#10;&#10;     to throw a card into the pot&#10;     or to carry out one of the game actions : lay an egg (by presenting the 3 cards - hen, rooster, nest, the player make take an egg card. He places in front of him, egg side up), give birth to a chick (the player presents 2 &quot;hen&quot; cards whilst imitating a hen's cry. He then turns over one of his &quot;eggs&quot; to make a newborn chick appear.) or take an egg from another player (the player presents a &quot;fox&quot; card to an advesary, and ask him for an &quot;egg&quot; card (not a chick). The adversary may counter-attack by presenting 2 &quot;rooster&quot; cards)&#10;&#10;&#10;&#10;&#10;The winner is the first to manage to get 3 chicks.&#10;&#10;",
        "artist": "Frédéric Pillot"
    },
    {
        "name": "Anomia",
        "description": "Anomia plays off the fact that our minds are positively brimming with all sorts of random information: things to eat, pop songs, websites, etc... Sure, under normal circumstances, it's easy to give an example of a frozen food or a dog breed, but you'll find that your brain works a little differently under pressure!&#10;&#10;To play, draw and reveal a card from the center pile. Does the symbol on your card match one on another player's card? If so, you must quickly face-off with the other player by giving an example of the person, place, or thing on his card before he can do the same for yours. If you blurt out a correct answer first, you win his card and the drawing continues.&#10;&#10;Sounds simple, right? Wrong! Wild cards allow unlike symbols to match, increasing the number of things to which you must pay attention. Cascading face-offs can occur when you hand over a lost card, thereby revealing a new top card on your play pile.&#10;&#10;",
        "artist": "Paul Laane,Peter Wocken"
    },
    {
        "name": "Dungeon Crawler",
        "description": "Dungeon Crawler is an adventure card game that is playable alone or with friends. You get to choose Adventurers, equip them, design your own Quests to conquer, seek out the evils that terrorize the lands, and save the Damsel. This intelligently designed game pulls together extraordinary art and fantasy flavor that can keep you spellbound in epic adventure.&#10;&#10;The creators of Dungeon Crawler pit your Adventurers against a series of perilous encounters deep within the domain of vile adversaries and insidious plot combinations, which they must strategically overcome.  This collectible starter includes 2 decks that support single player gaming. You can also use the starter in competitive and co-operative formats (provided that you or your friends have enough cards to support the format you have chosen to play). One is a 65 card grey-tone deck, known as the Dungeon deck. The other deck bears a similar logo with a blue backing. This deck is known as the Crawler deck which serves as a &ldquo;bag of tricks&rdquo; for your Adventurers.&#10;&#10;Source: Gifted Vision (Publisher)&#10;&#10;",
        "artist": "Daniel Alexander,David Bezzina,Ricardo Boronat,Steve Brigantino,Simon Buckroyd,Lauren K. Cannon,Amy Cater,Brian Curtis,Jennifer Duczmal,Mikael Dupuy,Priscila Fernandes,Falk Hansel,Neil LaPointe,Jey Legarie,Alex Li,Claudio Pozas,Kira Santa,Nicolas Tribehou,Manny Vega,Jared von Hindman,Vanessa Walsh"
    },
    {
        "name": "Lords of Scotland",
        "description": "&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Introduction&#10;&#10;The throne lies empty and the clans are restless. As a lord of Scotland with land, men and money at your disposal, now is the time to lay your claim. But you are not alone. Your rivals have been waiting for just such an opportunity themselves and they are poised to act. With the clans of Scotland ready to follow the strongest leader, it is up to you to win the loyalty of the clans first. If you can demonstrate your prowess in battle to enough clans, then the rest will fall in line behind you. Do you have the audacity and cunning it takes to be crowned king?&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;How to Play&#10;&#10;You acquire the support you need to win the game by winning skirmishes against your rivals. A skirmish is five consecutive rounds of play. During each round of a skirmish, you have the opportunity to either build up your army by playing cards from your hand or recruit clans to fight for you by drawing cards from the recruit pile. At the end of the five rounds, each lord gets to claim a supporter in order of highest strength army to lowest. Then you discard all the clans you mustered and begin a new skirmish.  The game ends when one lord reaches forty or more points worth of supporters and claims the throne. If you hope to be the one to do so, you will need to know when to commit your forces to battle and when to regroup to fight another day.&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Design Notes&#10;&#10;Lords of Scotland borrows design elements of Three-Dragon Ante, Condottiere and Havoc: The Hundred Years War and sets the action in the interregnum period of Scottish history surrounding the wars for Scottish Independence.  The gameplay is broken up into five-round skirmishes which are conducted in a turn based clockwise fashion.  During each skirmish, the ability to activate more special card powers by going first is balanced by the knowledge of what strength card you need to play to win by going last.  Throughout the game there is a general pressure to use resources to make immediate attacks of opportunity, balanced against the need to collect resources for long-term strategic advantage.  Lords of Scotland scales well to the number of players with most victories being determined in the final skirmish.&#10;&#10;",
        "artist": "Gabrielle Levion,Chris Quilliams"
    },
    {
        "name": "Mini FITS",
        "description": "Travel or mini FiTs is a smaller version of FiTs.  The differences are&#10;&#10;&#10;    There are only 52 cardboard vs 64 plastic game tiles &#10;    There are only 13 vs 16 building cards &#10;    There are only 4 vs 8 game boards printed on both sides&#10;    The 2nd board allows players to score bonus points if three of the same symbols are exposed.&#10;    The height of the board is 10 vs 12 rows.&#10;    There are no ramps or plastic covers just a place to mount the game boards.&#10;    The box is so much smaller.&#10;&#10;&#10;Other than those differences the game-play is the same as FiTs.  Each player has a board on which they place different polyominoes, with three, four, or five squares. Cards are drawn from a pile to tell the players which piece to take. But as every player has a different start tile to place first, the players will need different tactics to maximise their points.  The pieces may be rotated and reversed before they slide down the board.  Scoring is based on quantity and configuration of squares left uncovered.&#10;&#10;Reimplements:&#10;&#10;&#10;     FITS &#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Colonialism",
        "description": "Colonialism is a game of 19th Century imperialistic struggle. In this game, each player assumes the role of a nondescript colonial power. Players proceed to struggle for influence in the unindustrialized regions of the world, and the subsequent resources such influence entails.&#10;&#10;Each turn is divided into action phases and colonization phases. During action phases, players use cards to secretly bid influence in the six regions of the game board. During colonization phases, all cards in play are revealed, the placement of influence is resolved, and conflict occurs.&#10;&#10;Whenever all native influence is eliminated from a region, that region's resources are collected. The amount of resources collected by each player depends on each players' influence in the region. At the end of the game, the player who collects the most resources wins.&#10;&#10;",
        "artist": "Harald Lieske"
    },
    {
        "name": "The Message",
        "description": "Chinese-themed card game created by Qian Qi Animation.&#10;&#10;The card game uses the theme of the Chinese Movie The Message.&#10;&#10;3 Kinds of Cards&#10;Identity: x9&#10;Characters: x18&#10;Function: x81&#10;&#10;Its rules are similar to Shadow Hunter combined with Coach Ride To Devil's Castle.&#10;&#10;Initially, each player randomly select one of the three identities - Underground, Army, Passby.  In addition, each player has one character out of 18 difference one to get difference special character ability.&#10;&#10;All function cards divided into three information - Red, Blue or Black (false information).  Besides, all function cards can be used for its special function.&#10;&#10;During each round, each player draws two function cards.  Then, the player transmit one of his function cards to other player as an information.  Others player try to collect his requested information while avoid any False information (black).  Apart from acting as an information card, function cards can be used for their special function to interrupt information, burnt away false information etc.  Any player has received three black information will be dead.&#10;&#10;Underground will wins if he collects three Red information cards while Army wins if he collects three Blue information.  Passby needs to achieve their special mission based on his characters in order to win.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Puzzle Strike",
        "description": "Puzzle Strike: Bag of Chips is all that and a bag of chips!&#10;&#10;Puzzle Strike is a card game played with cardboard chips instead of cards that simulates a puzzle video game called puzzle fighter that, in-turn, simulates the fighting game street fighter that is emulated in puzzle fighter&#10;&#10;If you don&rsquo;t understand any of that, that&rsquo;s ok! Puzzle Strike is a complete game in a box that has the fun of a customizable card game without the marketing scheme of selling you parts of the game in random packs. You build your deck *as* you play the game. Every game is different because the bank starts with a different set of chips each game. Also, there are 10 characters to choose from, each with different gameplay. Between all that, there are over 411 MILLION starting conditions in a 4-player game.&#10;&#10;A built-in comeback mechanic means that when you're on the edge of losing, you're also able to do even more combos than usual.&#10;&#10;Shuffling cards takes too long and is boring, so in Puzzle Strike you just put your cardboard tokens in a bag and shake them up to shuffle! Plus, it&rsquo;s pretty ballin&rsquo; to play a game with chips. Play it on your yacht, impress potential mates, etc.&#10;&#10;Though the game is fun even if you're terrible at it, it's also balanced for high level play by veteran asymmetric game balancer David Sirlin (Street Fighter HD Remix, Puzzle Fighter HD Remix, Kongai, Yomi, and Flash Duel.)&#10;&#10;Puzzle Strike contains:&#10;&#10;    Almost 350 cardboard chips&#10;    4 cloth bags&#10;    8-page full color rulebook&#10;    Colorful box with inside designed to separate the chips by type, for storage&#10;&#10;&#10;&#10;&#10;Online play: http://www.fantasystrike.com&#10;&#10;Re-implemented by:&#10;&#10;&#10;     Puzzle Strike (Third Edition)&#10;&#10;&#10;",
        "artist": "Long Vo"
    },
    {
        "name": "Workshop of the World",
        "description": "Description from BoardgameNews.com:&#10;&#10;The Ragnar Brothers return to canal-building in this new game set during the Industrial Revolution, which will be produced in an edition of 1,000 copies. Here's a game description from the back of the box:&#10;&#10;&quot;For a brief period the Industrial Revolution burned so bright that Britain was known as the 'Workshop of the World.' This Ragnar Brothers' game recreates that dramatic time. Players establish their position on the map-board by investing in ports, heavy industries, textiles, light industries and crafts. Canal networks are built to connect the thriving towns. Expenditure is vast, but capital gains are greater. Next the railways are built and each player seeks to strengthen their industrial base. By game end, towns are linked from London to Wales, Scotland to the Channel ports. Wealth decides the winner.&quot;&#10;&#10;And here's the game play described in more detail:&#10;&#10;&bull; The game lasts two eras &ndash; the Canal Era and Railroad Era &ndash; with players earning money at the end of each era.&#10;&#10;&bull; Before starting an era, players each reveal one of their two demand tokens to show which towns (ports, textile locations, etc.) have special value.&#10;&#10;&bull; Each era lasts a number of rounds, and in each round players reveal town cards equal to the number of players, then hold an auction for turn order. Players choose towns in turn order, placing an Industry marker on that location, then optionally building links from that town, ideally forming a network of links that connects their Industries.&#10;&#10;&bull; Once the town cards run out, the era ends. Players (may) reveal their second demand token, then they collect money equal to their revenue (earned by connecting Industries with links), the demand value of their Industries, and the value of their largest network of links, with token payment for any remaining links.&#10;&#10;&bull; Between eras, the game is reset Amun-Re-style, with revenues being zeroed out and all links being cleared from the board. Players' Industries remain in place, letting them build on their holdings in the second era, which otherwise plays out nearly identical to the first.&#10;&#10;",
        "artist": "Oscar Eaton"
    },
    {
        "name": "Conflict of Heroes: Guadalcanal – The Pacific 1942",
        "description": "In 1942, the Japanese empire exploded across the Pacific, conquering everything before them. The only large land mass still held by the Allies was Australia, which they desperately needed as a staging area for a planned U.S. led counter-attack. The Japanese knew of the importance of Australia, but lacked the resources to conquer it, so they decided on the next best thing: Isolate Australia from the United States by building an airfield on the island of Guadalcanal, from which planes could disrupt the Allied supply lines.&#10;&#10;The United States, ill-prepared as it was for any offensive actions, immediately attacked with the 1st Marine Division under the command of Major General Alexander A. Vandegrift, caught the Japanese by surprise and easily took control of the airfield. The Japanese 17th Army, under the command of Lt. Gen. Harukichi Hyakutake, counterattacked with an ever-increasing number of troops. For the next four months a titanic struggle took place in the air, on land and on sea as the isolated Marines and U.S. Army fought for their lives to hold their tiny perimeter around the airfield against the might of the Japanese Empire.&#10;&#10;Conflict of Heroes: Guadalcanal &ndash; Pacific Ocean 1942 recreates this struggle on your tabletop and includes gorgeous beach and jungles maps of the South Pacific, amphibious landing craft, the USMC, Japanese Banzai Charges, night combat, and much more.&#10;&#10;",
        "artist": "Pavlos Germidis,Steve Paschal"
    },
    {
        "name": "Gold Mine",
        "description": "Strike it rich with this exciting mining-themed board game!&#10;&#10;Gold Mine is a unique tile-laying game in which players build a maze of mine tunnels and control miners that traverse the mine collecting gold nuggets. Players race to be the first to collect enough gold to exit the mine and stake a claim. It may sound easy, but the greedy miners have several tricks up their sleeves in order to gain an advantage&mdash;including sneaking through secret passages, fighting for gold, and scaring away other miners with bats.&#10;&#10;With a different game board every time, a great balance of luck and strategy, and the addition of optional rules, this game is bound to be a family favorite for years to come!&#10;&#10;",
        "artist": "Andy Kurzen"
    },
    {
        "name": "Isla Dorada",
        "description": "In the middle of the 1930s, an expedition of treasure hunters crashes its zeppelin in the middle of an unknown and mysterious island where legends tell that several old and powerful civilizations have left many sumptuous treasures.&#10;&#10;Each player is one of these brave explorers who joined the expedition with old maps giving clues on where some of these treasures can be found. However, it is clear that the land is barely known and dangerous, so, all explorers decide to travel together, in one solid group by hiring beasts of burden and exotic items in the native villages while trying to avoid the many dangers of the inhospitable land of Isla Dorada...&#10;&#10;Which one of these brave explorers will find the most valuable treasures, avoid the numerous curses and accomplish it's rewarding destiny?&#10;&#10;In Isla Dorada, players will have to move a unique pawn portraying the expedition of explorers. Each player will collect cards of different kinds (movements, actions, destinations, curses, destinies, bonus or malus cards) and will have to build the best hands turn after turn (time is limited to a certain number of game turns) to be able to chose the expedition destinations in a succession of bids and negotiations. Doing so, the players will try to put their hands on treasures while avoiding their cursed destinations and trying to block other player's objectives.&#10;&#10;The very easy rules can be learned in a few minutes whilst the rich and elegant game play assure an always renewed experience.&#10;&#10;",
        "artist": "Georges Bouchelaghem,Xavier Gueniffey Durin"
    },
    {
        "name": "Toe-to-Toe Nu'klr Combat with the Rooskies",
        "description": "This is it, Boys, we're going in...&#10;&#10;The &ldquo;Go Code&rdquo; has been received and the war plan decoded; it is time to turn your B-52 into Soviet air space, and head for your primary target. You&rsquo;ve got 50,000 lbs. of fuel, two H-bombs, a crew looking to you for leadership, and a mission that your country needs you to fulfill.&#10;&#10;Toe-to-Toe Nu&rsquo;klr Combat with the Rooskies is a fast-playing solitaire game. You decide the payload, pick your targets and must then challenge the Soviet Union's defenses.&#10;&#10;SAMs (surface-to-air missiles) and Soviet Air Defense fighter/ interceptors will find you as you cross &ldquo;The Big Board.&rdquo; Events will relentlessly dog you and your crew as the fate of America, even the world, rests on your shoulders. A single mission can be accomplished in about 15 minutes, or take an hour for the whole campaign game. Take a darkly humorous trip in a less-than-serious game exploding with atomic fun.&#10;&#10;BATTLESSON&#226;&#132;&#162; Game #8.&#10;&#10;Game Data:&#10;Complexity: 2.5 on a 9 scale&#10;Solitaire Suitability: 9 on a 9 scale&#10;Scale: Fly a B-52 across the Soviet Union. Each turn represents approximately 30 minutes.&#10;&#10;Game Components:&#10;&bull; One 4-page, color Rules booklet with 4 scenarios and Advanced Rules included&#10;&bull; 28 color, die-cut 5/8&rdquo; round mounted pieces&#10;&bull; One 8.5&rdquo; x 11&rdquo; color &quot;Big Board&quot; game map with flight controls&#10;&bull; One 5.5&quot; x 4.25&quot; color player aid mat&#10;&bull; 20 Event cards&#10;&bull; 1 BATTLESSON&#226;&#132;&#162; sheet&#10;&bull; Part of an introductory wargame series!&#10;&#10;",
        "artist": "Tim Allen"
    },
    {
        "name": "Levée en Masse",
        "description": "The Wars of the French Revolution, 1789-1802&#10;&#10;States of SiegeTM #5&#10;&#10;This solitaire game, suitable for group and classroom cooperative game play, tells the story of the French Revolution through its key events and decision points. You must stop the advances of foreign armies and the counter-revolutionary forces within France itself to defend the virtues of Republicanism.&#10;&#10;Can you suppress the forces of Monarchy and Despotism to maintain the Republican spirit in France? Can you export the revolution by liberating neighboring states and granting them their liberty? Will you be able to keep order in Paris as it suffers from riot after riot? Enlist today, grab your musket and a banner, and join the Lev&eacute;e en Masse!&#10;&#10;Game Data:&#10;Complexity: 3 on a 9 scale&#10;Solitaire Suitability: 9 on a 9 scale&#10;Scale: Each unit is one Army, each turn represents a variable number of weeks&#10;&#10;Game Components:&#10;&bull; One 6-page, color Game Rules booklet&#10;&bull; 12 color, die-cut 3/4&rdquo; square game pieces&#10;&bull; Five 5/8&ldquo; round game markers&#10;&bull; 48 Headline cards (2&quot; x 3&quot;)&#10;&bull; One 11&rdquo; x 17&rdquo; color game map&#10;&bull; Designers Notes&#10;&bull; Optional Rules&#10;&#10;",
        "artist": "Tim Allen,Alan Emrich"
    },
    {
        "name": "Catchup",
        "description": "Catchup is a simple abstract game with a devilish dynamic. The goal is to have the largest group of stones on the board when the board is full of stones, but as you get closer to winning, your opponent gets more powerful. Whereas most stone-placement games are about position, Catchup is about timing, position, and the interplay between them.&#10;&#10;Rules:&#10;&#10;1. One player owns the white stones and the other owns the black. White begins by placing 1 stone on any empty space. &#10;&#10;2. From then on, starting with black, players take turns. On your turn you may play 1 or 2 stones; 3 if the opponent has just &quot;improved&quot;. An &quot;improvement&quot; is taking the lead, extending the lead, or catching up with your opponent's previously leading score.&#10;&#10;3. After taking your turn, if the size of your largest group changed, move your pawn to the corresponding spot on the scoring track.&#10;&#10;4. The game ends when the board is full. The player with the largest group wins. If the players&rsquo; largest groups are the same size, compare their second-largest groups, and so on, until you come to a pair which aren&rsquo;t the same size. Whoever owns the larger of the two wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Fabula",
        "description": "Fabula (previously known as Grimm) is a story-telling game where players must fill in parts of a story. One of them is the teller, who read (or imagine) the beginning of a short tale &mdash; his/her current draft. Each other player incarnates a tentative hero (a gnome, a princess, a little boy, etc.) who tries to be the main character of the teller's tale. 3 times during the game, the teller asks the other players how they think things happened at that time of the story. They must choose an item depicted on one of the cards laying at the center of the table and use it to continue the story. Depending on how convincing they are to the teller, and how well they integrated their character and the item to the current twist, they get points in the shape of &quot;quill&quot; markers. Each item can only be used once by any player, who keeps it afterwards, and who puts his/her markers on top of the card.&#10;&#10;At the end of the three turns, the two players with the most quill markers are selected to compete in the epilogue. The teller reads (or makes up) an idea of an ending to the story. Now, each finalist in turn has 30 seconds to present a relevant proposal for including his character and both items figured on the two remaining cards on the table into the ending. (A sand timer is included.) Both players have to use the same two objects, but the second one speaking cannot use them in the same way than the first (more or less compensating the fact he had more time to prepare his part).&#10;&#10;Eventually, the teller decides which of the two finalists wins, depending on the relevance of their proposals.&#10;&#10;The game comes with two proposed variants :&#10;- &quot;Experienced players&quot; : all the players tell the same tale, each one adding an element to the same storyline and bound to continue using the plot of the former speakers.&#10;- &quot;Collective&quot; : there are no quill markers and appraisal given by the teller. Every player takes part in the epilogue, and there's no winner.&#10;&#10;",
        "artist": "Mélanie Fuentes"
    },
    {
        "name": "Railways of the World: The Card Game",
        "description": "Railways of the World The Card Game is a fast paced card game adaptation of the popular Railways of the World board game series. In Railways of the World The Card Game players use track cards and city cards to build a series of railroad routes and deliver goods!&#10;&#10;As the game progresses, players work to connect more cities, upgrade their engines for larger carrying capacity and deliver goods through a network of routes across the table.&#10;&#10;Railways of the World The Card Game provides two versions of rules: one the whole family can play, which is also a great way to introduce them to Railways of the World, and one for more experienced fans of the Railways of the World series.&#10;&#10;",
        "artist": "Carey Grayson,David Oram"
    },
    {
        "name": "The Mines of Zavandor",
        "description": "In this third game in Lookout's Zavandor fantasy setting, it's all about dwarves. And mining. And gemstones. And other enhancements for the mines that need to get developed further during the game to have full effect.&#10;&#10;4 different gems are the currencies in this game. However, when collecting income you draw cards from 4 different mines (card stacks) with each having its own distribution! The number of gems you earn depends on the upgrade level of your dwarves. Gems are used to either win new objects for their mine through simultaneous 4-way auctions, or to enhance their mines, objects, and victory point count. Another innovative part is that each object has to be upgraded to fully use its benefits, e.g. a level 1 dwarf only gives you 1 income per round, some level 3 dwarves give you 3 income.&#10;&#10;On the King's way through the mountain, the requirements for upgrading some special cards always change, and only the player who wins the sapphire auction knows where the next turn will lead to. There are shorter and longer paths to the Coronation Chamber, where the game ends. The game lasts between 10 to 12 rounds.&#10;&#10;",
        "artist": "Klemens Franz"
    },
    {
        "name": "Objective: Kiev",
        "description": "The Advance of Army Group South:&#10;June - August, 1941&#10;&#10;When the Germans launched Operation Barbarossa on 22 June 1941, they faced both their greatest expanse of territory to capture and the greatest concentration of Soviet armor south of the Pripet marsh in Ukraine. Army Group South launched its multi-national forces (including Rumanians, Hungarians and Italians) with their principal target defined &ndash; Objective: Kiev.&#10;&#10;Facing them was the Red Army weakened from the recent purges of its officers by Stalin. Still, the Soviets put together a strong counter-attack early in the campaign, but their advantages in numbers of tanks committed could not overcome the German's superiority of skill when employing their veteran panzer units. The Axis forces advanced eastward to the Dnieper River and south toward Odessa, but as the front kept expanding, forces were spread thinner to cover the front line.&#10;&#10;Objective: Kiev is a new historical board game from renowned game designer Frank Chadwick, iterating the classic Battle for Moscow game system used in The Arduous Beginning, combining ease of learning and design elegance with the kind of dramatic gameplay that Frank has long been famous for. Featuring countless opportunities and variations, Objective: Kiev presents an endlessly fascinating series of puzzles and is a game that you're going to want to play again and again.&#10;&#10;Published in C3i magazine #26.&#10;&#10;Game Scale:&#10;Game Turn: 1 - 2 weeks&#10;Hex: 31 miles / 50 kilometers&#10;Units: Corps to Army&#10;&#10;Game Inventory:&#10;One 11 x 17&quot; full color map&#10;One dual-side printed countersheet (40 1/2&quot; game counters - 28)&#10;One 6-page Objective Kiev foldout rules booklet&#10;One single-side printed Play Aid card&#10;&#10;Solitaire Playability: High&#10;Complexity Level: Medium-Low&#10;Players: 2 or more&#10;Playing Time: 4-15&#10;&#10;",
        "artist": "Alan Emrich,Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "Loot and Scoot",
        "description": "He Who Dies with the Most Loot&#10;Probably Ran into the Dragon&#10;&#10;Dungeons are for looting. Every good adventurer knows that. Unfortunately, there are those pesky monsters to take care of before the real work can begin &ndash; counting all the loot.&#10;&#10;Loot and Scoot is a fast-playing game of dungeons, dragons and running faster than the hirelings when the going gets too tough. Two to four players construct dungeons, recruit adventuring groups, and loot the most treasure before the Dungeon Boss is found... and killed.&#10;&#10;Money is earned by looting dungeon rooms. Those valuable coins are then used to buy more retainers, upgrade your training facilities, recruit more adventurers (from four different classes), and train Squires into Knights (or Level 1 Priests into Level 2 Bishops, you get the idea). In the end, the player who successfully looted the most difficult dungeon rooms is the winner and gets to gloat over their friends back at the Inn.&#10;&#10;Game Data:&#10;Complexity: 2.5 on a 9 scale&#10;Solitaire Suitability: 4 on a 9 scale&#10;Scale: Individual heroes vs. individual or groups of monsters&#10;&#10;Game Components:&#10;&bull; One illustrated, color 2-page Rules sheet&#10;&bull; 80 color, die-cut 5/8&quot; square playing pieces&#10;&bull; 56 color, die-cut 5/8&quot; round game makers&#10;&bull; 4 Dungeon player mats&#10;&#10;",
        "artist": "Tim Allen,Scott Everts,Chris Taylor"
    },
    {
        "name": "FAB: Sicily",
        "description": "From GMT's web site:&#10;&#10;The Fast Action Battle (FAB) games, designed by Rick Young (Europe Engulfed, Asia Engulfed, and FAB: The Bulge), takes you to the Allied invasion of Sicily for volume II of the series.&#10;&#10;As the Allied player, you will choose your invasion beaches after seeing where the Axis player has deployed his units. Do you choose Montgomery&rsquo;s historical &lsquo;Husky&rsquo; plan, Patton&rsquo;s alternate plan, or a hybrid plan of your own?&#10;&#10;In this game you will find a few new unit and asset types, and also new challenges for both sides. For the attacker, the challenge is the tough Sicilian terrain; and for the defenders, it&rsquo;s the worsening Italian morale.&#10;&#10;Each victory area and functioning port that the Allies secure adds a &lsquo;Fading Italian Morale&rsquo; Event Chit into the selection cup, and as each of those are drawn, worsening effects on Italian units are felt along the entire front.&#10;&#10;If one side has not secured an automatic victory by the end of turn 9, the Axis player receives bonuses, both for German units that have exited off the island through Messina and also for areas on Sicily that are still Axis-controlled, so there is pressure on both sides to fight for every area.&#10;&#10;Event Chits include:&#10;&#10;&#10;     Replacements&#10;     Fading Italian Morale,&#10;     the Patton Soldier Slap, and&#10;     flanking battalion-sized invasions.&#10;&#10;&#10;",
        "artist": "Knut Grünitz,Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "No Retreat! The Russian Front",
        "description": "(from GMT's website:)&#10;&#10;No Retreat: The Russian Front is a new deluxe edition of the  two-player Victory Point Games 2008 CSR Award Nominee wargame that retells the story of the titanic struggle between the invading armies of Nazi Germany versus Communist Russia during WW2 at a player-friendly and manageable level of scope and difficulty.  This edition combines both the original game and its two extensions (Na Berlin! and No Surrender!) using deluxe components of &ldquo;Twilight Struggle Deluxe Edition&rdquo; quality. With only 40 Army/Front sized counters for the Tournament game, and 70 for the whole campaign, and with very low stacking, it&rsquo;s a quick-playing yet realistic affair that favours the strategic and offensive-minded player.&#10;&#10;Each turn is alight with intriguing on-board challenges plus the surprise of card hand Events as players vie to win in one of three different ways.&#10;&#10;In a skillfully blended collation of classic hex-based wargaming and modern card-driven simulations, No Retreat: The Russian Front  stays truly story-centric, providing the proper feel of sweeping maneuvers, exploitation and encirclements across the vast steppes and forests of Russia. With a simple-yet-innovative economic model, players will also feel the growing might and sophistication of the Russian&rsquo;s Red Army, and the degradation of the once-invincible German Wehrmacht, over the epic four year sweep of time that this merciless campaign was fought.&#10;&#10;Neither side can afford the disgrace of yielding an inch of ground to their hated foe, so your orders are: &ldquo;No Retreat!&rdquo;&#10;&#10;Components:&#10;&#10;     One Standard size mounted map&#10;     Two Counter Sheets&#10;     One deck of 55 Playing Cards&#10;     Rule booklet&#10;     Scenario booklet&#10;     Player Aid Cards&#10;     Two 6-sided dice (1 black and 1 white)&#10;&#10;&#10;&#10;&#10;TIME SCALE: 2 months per turn&#10;MAP SCALE: 100km / 60 miles per hex&#10;UNIT SCALE: Armies and Fronts&#10;NUMBER OF PLAYERS: 2&#10;&#10;DESIGNER: Carl Paradis&#10;DEVELOPER: Alan Emrich &amp; Carl Paradis&#10;COUNTER ART: Mark Simonitch &amp; Carl Paradis&#10;MAP ART: Mark Simonitch&#10;&#10;",
        "artist": "Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "Tell Tale",
        "description": "Tell Tale is an improv game based only on picture cards, with four different game rules:&#10;&#10;&bull; Questions/Answers: Each player get eight cards and alternately asks another player a question based on a random picture card, and answers another player's question using another card.&#10;&bull; Debate: Draw a random card to get a topic to debate; both players use five random cards to imagine convincing (?) points to support their side.&#10;&bull; Tell me a Story: Both players alternately imagine a very short story (one sentence per card) using five random cards each.&#10;&bull; Same and Again: Same as the previous rule, except both players use the same set of five cards (shuffled between each player's story).&#10;&#10;For all of these rules, the winner of the round is designated by the other players.&#10;&#10;",
        "artist": "Hervé Gourdet"
    },
    {
        "name": "Trenchzone",
        "description": "Across the muddy no-man's land, your troops advance to victory, in this strategic game of attack and counter attack set in the trenches of World War One. &#10;Winning is achieved in two ways, a bloody victory though assaults driving your opponent from one of their trench sectors, or secondly by the eroding of morale from the constant pounding  of artillery, gas attacks and machine gun fire on the trenchzone front.&#10;The game encourages a commander to plan strategically, however commanders will have to alter their battle plans as resources become available through placement of cards into a sector or as a result of your opponent&rsquo;s actions. &#10;After your initial set up of Artillery Positions, Pillboxes, Barbed Wire and Squads, your sectors are reinforced or reduced by your orders or your opponents actions in each sector. It's your choice as the commander to wait for reinforcements or to take the initiative and advance across no man&rsquo;s land.&#10;Who will advance to victory?&#10;&#10;(Blurb, Designer)&#10;&#10;Contents:&#10;&bull;1 Trenchzone Board&#10;&bull;1 Rules&#10;&bull;Rules Reference Card with Victory Tracker&#10;&bull;90 Command Cards&#10;&bull;6 Dice&#10;&#10;Player A&#10;&ndash;10 x10 strength squads&#10;&ndash;20 x5 strength squads&#10;&ndash;20 x 1 strength squads&#10;Player B&#10;&ndash;10 x10 strength squads&#10;&ndash;20 x5 strength squads&#10;&ndash;20 x 1 strength squads&#10;&#10;&bull;6 Artillery Positions&#10;&bull;12 Pill Boxes&#10;&bull;6 MG Positions&#10;&bull;10 Wire sections&#10;&bull;1 Mud token&#10;&bull;4 Gas tokens&#10;&bull;1 Victory token&#10;&#10;",
        "artist": "Glen Kehoe"
    },
    {
        "name": "Eminent Domain",
        "description": "Survey the galaxy to expand your civilization &ndash; will you colonize nearby planets, or take them over by force? Harvest resources for trade, and do research to improve your technology. Build the best civilization and win the game!&#10;&#10;Eminent Domain is a civilization-building game in which your civilization's abilities are based on a deck of Role cards. At the beginning of the game each player has the same deck of cards, with just two cards for each Role in it. Every turn you must choose a Role to execute (and like Glory to Rome or Puerto Rico, your opponents will get a chance to follow suit), and in doing so you will add one of those Role cards to your deck. When executing a Role, you can boost its effect by playing cards out of your hand matching the Role you have chosen. For example, the more you Research, the better you get at Researching (because you'll have more Research cards in your deck).&#10;&#10;",
        "artist": "Gavan Brown,Eric J. Carter,Christine Conrad,Jeremy Deveraturda,Ryan Johnson,Patrick McEvoy,Hans-Georg Schneider,James Wolf Strehle"
    },
    {
        "name": "7 Wonders",
        "description": "You are the leader of one of the 7 great cities of the Ancient World. Gather resources, develop commercial routes, and affirm your military supremacy. Build your city and erect an architectural wonder which will transcend future times.&#10;&#10;7 Wonders lasts three ages. In each age, players receive seven cards from a particular deck, choose one of those cards, then pass the remainder to an adjacent player. Players reveal their cards simultaneously, paying resources if needed or collecting resources or interacting with other players in various ways. (Players have individual boards with special powers on which to organize their cards, and the boards are double-sided). Each player then chooses another card from the deck they were passed, and the process repeats until players have six cards in play from that age. After three ages, the game ends.&#10;&#10;In essence, 7 Wonders is a card development game. Some cards have immediate effects, while others provide bonuses or upgrades later in the game. Some cards provide discounts on future purchases. Some provide military strength to overpower your neighbors and others give nothing but victory points. Each card is played immediately after being drafted, so you'll know which cards your neighbor is receiving and how his choices might affect what you've already built up. Cards are passed left-right-left over the three ages, so you need to keep an eye on the neighbors in both directions.&#10;&#10;Though the box of earlier editions is listed as being for 3&ndash;7 players, there is an official 2-player variant included in the instructions.&#10;&#10;",
        "artist": "Miguel Coimbra"
    }
]