[
    {
        "name": "Nosferatu",
        "description": "In 1887, a vampire wakes up and seeks to quench his thirst for blood. Brave men and women ally to destroy him &ndash; but to do so, they will have to thwart the plot of Renfield, his faithful servant.&#10;&#10;Nosferatu is a card game mixing tactics, bluffing, and team play, with the vampire and Renfield facing off against the vampire hunters. At the start of the game, everyone knows who Renfeld is, and Renfield knows which of the hunters is actually a vampire (as he chooses how to distribute the character cards), but the vampire's identity is hidden from everyone else. The hunters must identify the vampire and kill him with the ancestral stake before he can play five bite cards; if the hunters accidentally stake one of their own, then demoralized and weakened they lose the game.&#10;&#10;Each player other than Renfield starts with two cards from the library, which is comprised of rumors, incantations, bites and night cards. Five ritual cards &ndash; silver mirror, 2x blood transfusion, holy water and time distortion &ndash; are placed face-up on the table. Renfield creates a &quot;clock&quot; by taking one night card for each player and shuffling it with a dawn card.&#10;&#10;The game lasts a number of rounds, with the rounds continuing until one of the winning conditions is met. At the start of a round, players take turns doing the following: Drawing two cards from the library, discarding one card face-up, placing one card face-down in an action pile, then drawing a card from the clock. As soon as a player draws the dawn card or each player has played once, this part of the round ends.&#10;&#10;Renfield shuffles all the cards in the action pile, then reveals them. If the pile contains only incantations, the player holding the stake chooses one of the rituals, takes its action, then turns the ritual face-down. Once all five rituals have been used, the hunters win the game, but their main goal is to kill the vampire. If the deck contains bite cards, then Renfield applies the bites to the hunters, with a hunter losing one card in his stock for each bite; a hunter can have at most two bites. Night cards in the pile are added to the clock, thereby giving the vampire more time to work in future rounds, while making it tougher for players to achieve rituals.&#10;&#10;If the dawn card was revealed, the holder of the ancient stake can stab someone, thereby ending the game with victory for one side or the other, or pass the stake to another player. (If dawn didn't break, then the stake passes to another player with no opportunity for stabbing.)&#10;&#10;",
        "artist": "Ismaël Pommaz"
    },
    {
        "name": "Augustus",
        "description": "In Augustus, you vie with your fellow players to complete &quot;objective&quot; cards for special powers and ultimately for victory points. Each card has 2-6 symbols which you must populate with legionnaire meeples in order to complete the card. These symbols are drawn one at a time from a bag, with all players gaining the benefit equally, but interestingly, the bag contains more of some symbols than others.&#10;&#10;So the pivotal skill you'll deploy is in making your choice of which three objectives you'll start the game with (you're dealt six) &mdash; balancing potential difficulty of completion against value of the reward &mdash; and then which of five available objectives you'll add to your plate each time you complete one of your three. The game ends when someone completes seven objectives.&#10;&#10;",
        "artist": "Vincent Dutrait"
    },
    {
        "name": "Cube Quest",
        "description": "Cube Quest is a dexterity game in which lightweight hollow cubic dice are flicked across custom rubber mats. Cubes that leave the mats are defeated. Play alternates until someone wins by defeating the enemy king. Cubes also risk defeat in enemy territory; if they land &quot;shadow&quot; side up, they have been captured and must be rolled, like dice, to determine whether they escape.&#10;&#10;The cubes have different strengths and special abilities, such as taking extra flicks, immobilizing enemy cubes, reviving lost cubes, and hiding before strategic re-positioning.&#10;&#10;The game allows for custom army building using a simple point system. Pre-battle setup involves a tactical selection of cubes worth a total of 40 points maximum to fight alongside their king. Each player also chooses how to position their cubes, creating individual attack and defense formations and structures!&#10;&#10;",
        "artist": "Jonathan Kirtz"
    },
    {
        "name": "Archer: The Danger Zone! Board Game",
        "description": "Game description from the publisher:&#10;&#10;Channeling the action, adventure and danger that comes with everyday life in the Archer animated series, Archer: The Danger Zone! Board Game lets fans play as their favorite secret agent or staffer and compete against other players. The object of the game is to gain the Upper Hand over your opponents by insulting them, doing well on missions (quite the ego boost), and encountering random guest stars and secondary characters from the show. Each player starts with five Upper Hand, and the first player to have 20 Upper Hand wins.&#10;&#10;Each player chooses one of the following characters to play: Archer, Lana, Malory, Cyril, Pam, Cheryl, Ray or Dr. Krieger. The insults and dirty tricks you deliver to the other players are based on actual quotes from the show that your character makes. The cards in your unique deck of twenty cards give you the ability to hurl insults, &quot;come on&quot; to another character, or say something that builds up your character's own ego. Naturally you'll have plenty of opportunities to belittle your co-workers while in the office and out in the field. Doing so will knock them down a peg or two on the Upper Hand track.&#10;&#10;The action takes place at the ISIS Headquarters, though spy missions send the gang off to exotic locales each round of play. The game features six important office locations within ISIS, but you (typically) play with around four of them, making each game play out very differently since the &quot;Office Map&quot; varies from game to game. Each location does something different, but only the first person to go to each location each round gets the benefit listed on that location. Surely there will be no name calling when another player beats you to the punch!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Princess Bride: Prepare to Die",
        "description": "A party game in which players fill in the famous phrase &quot;&#10;Hello.  My name is Inigo Montoya.  You killed my father.  Prepare to die.&quot;' with ridiculous names and activities:&#10;&quot;Hello.  My name is Mandy Patinkin.  You drank my milkshake.  Prepare to die.&quot;&#10;Players use two decks - the My Name Is deck and the Prepare to Die deck - to construct these combinations, with the goal being to please the whims of the round's judge.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Via Appia",
        "description": "Game description from the publisher:&#10;&#10;Via Appia, the most famous road of the Roman Empire, is under construction. Be a part of this historic event and finish the road that connects Rome and Brindisi. Prove your intuition in the quarry to get the best stones. Whoever builds the most valuable sections and reaches the different cities early will be victorious and the most famous builder in all of Rome.&#10;&#10;Goal of the Game (from the Rules)&#10;Rome needs a connection to Brundisium, and the players have been tasked with building the Via Appia in order to allow for fast travel between the two cities. To create the road, they&rsquo;ll need to break off stone tiles in the quarry, then travel to Brundisium, laying out the tiles and creating the path that all will follow in the years ahead. This travel costs sesterces, but will bring crucial victory points and glory from Rome in return.&#10;&#10;",
        "artist": "Marko Fiedler,Claus Stephan"
    },
    {
        "name": "Templar: The Secret Treasures",
        "description": "Templar: The Secret Treasures is an exciting family game in which the players help the Knights Templar to get their treasures to a secret abbey and hide them inside. Each player can use the different members of the abbey to help them hide the treasures &ndash; but every character is different and needs to be used wisely. Whoever hides the most treasures wins!&#10;&#10;Each player has a hand of ten character cards and a starting supply of treasure: one book, one chalice, and a handful of signet rings that come in three types. A harbor with six storehouses is stocked with additional treasures, and three characters &ndash; Abbot Remigius, Vitus, and Prior Severus &ndash; are placed in the 13-room abbey.&#10;&#10;For the first round of the game, each player secretly chooses a character card, then they all reveal them simultaneously, with players then carrying out the actions on those cards in player order. Some characters represent monks who help you move through the abbey and hide treasure, others allow you to take treasure from the harbor, open a locked door while closing off another passage, or move treasure that another player has already stashed, among other things. When a player moves Abbot Remigius, the Abbot rewards all players who have stashed treasure in the room in which he ends his movement, with all of the treasure then being marked as scored &ndash; other than duplicate signet rings, which can score again should the Abbot return. (Vitus, who isn't controlled by a card, follows the Abbot closely to spy upon him, thus keeping the Abbot from returning to the most recent room he entered.) If the Prior Severus is in a room, though, the Abbot can't do his thing as Severus would then discover the treasure and learn of the Knights' actions.&#10;&#10;After the initial round, a player must play a character card that doesn't match the top character card on any player's discard pile &ndash; which means that you (and others) play both offense and defense with the same character card, restricting the action of others while ideally making good use of the character yourself. When a player lays down The Bells card, he picks up all of his played cards, then restocks the harbor based on the number of his previously played character card.&#10;&#10;When the harbor can no longer be filled properly or when a player has placed at least one treasure in each room, the final round is triggered, then players have a final scoring for their rings still in the abbey and for the number of rooms that hold their treasure. Whoever scores the most points wins!&#10;&#10;",
        "artist": "Oliver Schlemmer,Claus Stephan"
    },
    {
        "name": "Pixel Tactics 2",
        "description": "Pixel Tactics 2 is a head-to-head game of tactical combat for two players. Each player has an identical deck of 25 cards, from which they draft a leader. The leader's abilities alter vastly the strategy and playability of every other card in the deck, making the game playable in 25 different ways.&#10;&#10;In the game, players take turns placing cards and attacking. Each card can activate in various ways, taking on offensive capabilities in the front rows of the unit, or support powers in the back rows. Cards can also be played as orders &ndash; powerful single-time effects that can turn the tide of battle.&#10;&#10;Play continues until either player's leader is defeated. A typical game is best of three or five rounds.&#10;&#10;Pixel Tactics 2 takes place in the same world and uses many of the characters from Level 99 Games' BattleCON: War of Indines, but its gameplay is entirely unrelated.&#10;&#10;",
        "artist": "Fábio Fontes"
    },
    {
        "name": "Gold am Orinoko",
        "description": "Game description from the publisher:&#10;&#10;Gold fever at the Orinoco river! Deep in the heart of the jungle explorers have discovered the ruins of an ancient culture on the shores of this mysterious river. The brave teams of adventurers immediately set off from the legendary rocky knoll, Guarda &ndash; the guardian of the gold &ndash; in search of treasure amongst the ruins. The gold, however, lies on the other shore of the raging river, and the river can be crossed only by leaping from trunk to trunk, as the tree trunks float dangerously downstream.&#10;&#10;In Gold am Orinoko, the players need the right amount of luck and tactics to get their adventurers over the tree trunks to the other side of the river because, as they shift and jump over the tree trunks, they always have to keep an eye on the drifting trunks and the other players. The one who proves to be extremely brave and who brings his adventurers safely and surely across the Orinoco will be able to collect the most gold, thus winning the game.&#10;&#10;",
        "artist": "Michael Menzel"
    },
    {
        "name": "Breaking the Chains: War in the South China Sea",
        "description": "publisher's description&#10;&#10;Breaking the Chains (BtC) simulates a hypothetical future military conflict over the South China and East China Seas around the year 2021. Conflicting claims of sovereignty have roiled those &quot;near seas&quot; since the Cold War. After decades of patient diplomacy, Beijing's new navy could offer military options for finally asserting sovereignty over prizes within the First Island Chain - that string of islands which runs from the Ryukus south through Taiwan, the Philippines and then curls back to the mainland via Malaysia. BtC presumes that China comes to blows with a Southeast Asian country in a conflict that could expand to possibly include: Australia, India, Japan, the United States as well as a variety of Southeast Asian nations. However, beyond China and one South East Asian nation, the exact composition of opposing coalitions is not predetermined but rather a function of the decisions players make as the game unfolds.&#10;&#10;Two or more people play BtC with two reference cards, dice, and about 350 counters on a 22&quot; X 34&quot; map where each hex spans about 70 nautical miles (80 land miles) and each turn represents one day of real time. Players alternate maneuvering air, ground and naval units for up to 14 nations to resolve battles with a universal &quot;strike&quot; mechanism that applies across all types of combat; missile defense capabilities are central to survival. Air units represent from 30-90 aircraft each, most ground units are regiments, and naval units are small groups of surface ships/submarines or individual aircraft carriers. Specialized chit play simulates black ops, cyber warfare and various political developments.&#10;&#10;BtC is solitaire friendly. The naval operations which dominate play are based on a roll-to-evade model rather than search-to-find model. That means, owing to a battle space awash in electromagnetic emissions, enemy positions - except for motionless submarines - are assumed to be known unless a last-minute dice roll determines a potential target has evaded detection. So there is no &acirc;&#194;&#128;&#194;&#156;hidden movement&acirc;&#194;&#128;&#194;&#157; to stifle solitaire play; and the &acirc;&#194;&#128;&#194;&#156;hidden placement&acirc;&#194;&#128;&#194;&#157; of submarines can be forgone. Finally, the special chits that govern black ops can be played at random to further enable solo game play.&#10;&#10;",
        "artist": "Mark Mahaffey"
    },
    {
        "name": "Gothic Invasion",
        "description": "Gothic Invasion is a card-driven wargame depicting the Gothic Wars from 377 to 382 A.D. Each player takes the roles of the Goth leaders (Fritigern, Alatheus and Saphrax) and the Roman leaders (Valens, Theodosius I, Gratian and Flavius Richomeres). The Goth player's objective is to plunder nine cities of the East Roman empire between 377-382 A.D., while the Roman player must defend the imperial cities and slow them down as best as he can until the spring of 382 A.D.&#10;&#10;Gothic Invasion is a &quot;cat and mouse&quot; tactical defensive game from the Roman point of view while from the Gothic side it's a &quot;race against time&quot; aggressive war.&#10;&#10;",
        "artist": "Antonis Papantoniou,Giota Vorgia"
    },
    {
        "name": "Story War",
        "description": "It&rsquo;s a card game for 3-to-8 players that combines storytelling and combat! It&rsquo;s more about creativity and alluding to pop culture (or just regular culture) than it is about math or numbers. It takes about 30 minutes to play a full game, even with an 8 person game.&#10;&#10;Players choose a Warrior card (like Medusa or Puss In Boots) from their hand to represent them in battle, then multiple players must work together as a team to defeat the players on the other side of the table. They also use Item cards (like Excalibur or Flying Carpet) to get them out of a tight spot and turn the battle around! Each battle is also set on a Battlefield (like Beanstalk or Sleepy Village) and players can use the terrain to their advantage.&#10;&#10;The actual battle is conducted by players describing their character's action to the judge, who has final ruling on all matters. If it convinces the judge, it's fair game! After each battle, the role of the judge passes to the player on the current judge's left.&#10;&#10;",
        "artist": "Vondell Swain"
    },
    {
        "name": "The Road to Cheren",
        "description": "The road to Cheren is our new game covering the Eritrea campaign in East Africa in 1941. The campaign featured British and French forces versus the Italians in a wild and mountainous country. Cheren is a game where the movement of each piece is critical. After movement your opponent may react but with only a few units, making player decisions difficult; do I go to the aid of a unit likely to be attacked or use my reaction to push troops forward in an area where I am on the offensive. After combat there is exploitation movement. Only motorized infantry, tanks and cavalry may exploit and are scarce in this campaign. In addition there is a very nice chit pull system to give both sides some special abilities and keep the enemy guessing as to what comes next. Finally some Italian native units may decide to join the Allies, or they may stay loyal, which creates extra tension in the game&#10;&#10;",
        "artist": "Kim Kanger"
    },
    {
        "name": "Level 7 [Omega Protocol]",
        "description": "Game description from the publisher:&#10;&#10;LEVEL 7 [Omega Protocol] picks up right where LEVEL 7 [ESCAPE] left off. The Subterra Bravo facility has been thrown into chaos through the players actions in [ESCAPE], and now the government has sent in a top-secret, highly-trained special forces unit to shut down the facility and eliminate everything remaining in the base.&#10;&#10;In [Omega Protocol], one player takes on the role of the Overseer while two to five other players take on the role of the elite Special Ops team. The Overseer's role in the game is to control all of the alien denizens and challenges the players face throughout the game. The players are trying to achieve specific scenario-based objectives by exploring a map that's laid out at the start and fighting off the hordes of aliens that the Overseer sends their way.&#10;&#10;Gameplay is based around adrenaline, which is the currency that the soldier players use to perform actions. They generate adrenaline to do things such as move, attack, and perform special actions like activating an objective space. That generation also has a negative effect for them, as that adrenaline transfers to the Overseer player, who then uses it to spawn aliens, create new threats, and hurt the soldiers' chance of success during the scenario. The more actions the Special Ops players take, the more resources the Overseer player has to work with.&#10;&#10;Characters in [Omega Protocol] are represented by miniatures, and each Special Ops and alien character has different attributes, powers, and customizable skills and equipment.&#10;&#10;",
        "artist": "Richard Anderson,Matt Ferbrache,Laine Garrett,Adrian Majkrazk,Josh Manderville,Marco Mazzoni,Nestor Ossandon,Kevin Prangley,Mike Vaillancourt"
    },
    {
        "name": "What's He Building in There?",
        "description": "Now that you've got some experience as an Evil Doctor, it's time to move onward and upward. Where's the place to be in the Evil Doctoring World of the late 1800s? London. What's your plan? Find a cheap warehouse somewhere to build your Doomsday Machine. Scotland Yard is on your trail, however, so in addition to your Doomsday Machine, you'll have to build an Escape Plan.&#10;&#10;In the worker-placement style game What's He Building in There?, players use their Doctors and three henchmen to acquire resources at the available shops, acquire gold, visit the black markets, provide the &quot;Genius at Work&quot; labor (GAW), provide &quot;Manual Labor&quot; (ML), improve the Doctor's social standing, and invent things. You must complete both a Doomsday Machine and an Escape Plan, with higher level Doomsday Machines and Escape Plans garnering more victory points, and you need to do it quickly. Scotland Yard is getting suspicious, after all, so you have to do what you need to do in 15 turns. Players can earn additional victory points for fitting in with society, eccentricity, security and inventions.&#10;&#10;Play time is approximately 25-30 minutes per player.&#10;&#10;",
        "artist": "Sean Scott Garrity,James Van Niekerk"
    },
    {
        "name": "Gearworld: The Borderlands",
        "description": "The Sky People retreated above the clouds and left the Borderlands to crumble and decay. The old machines are rusted and broken and the scavengers of Gearworld live off scraps from the past and refuse from the Sky People's flying cities. The scavengers' only hope for a better life is to build great towering skyworks and gain the favor of the World Above, allowing them to outlast and outlive their rival scavenger gangs. In the Borderlands, survival is an exception.&#10;&#10;Gearworld: The Borderlands is a game of conquest and survival in a post-apocalyptic world for 2-4 players who must gather resources and use them wisely. Players need those resources in order to strengthen their military might, to enhance their transport capabilities, and to reach the final goal of building the skyworks. Resources can be produced in areas with resource tokens, traded with other players, and taken by force. To build a development &ndash; e.g., weapons, transport vehicles or skyworks &ndash; all of the required resources have to be located in the same space on the map. This makes effective transport an important issue in the game. At the same time players must be strong enough to protect their resources from the other players while investing resources in their skyworks in order to win the game.&#10;&#10;Seize territory, marshal resources and defend yourself from your rivals. Reclaim the machines of old to build powerful weapons and enormous skyworks. Can you forge a new future from the rusted remnants of the past?&#10;&#10;Microbadges:&#10;  &#10; Gearworld: The Borderlands fan&#10;&#10;",
        "artist": "Anders Finér,Peter Wocken"
    },
    {
        "name": "Tessen",
        "description": "Tessen is a card game featuring simultaneous real time play. Players take animal cards from their decks and play them in up to five groups in front of them. Players may save sets of three or more, but beware! The opponent may use a warrior card to &quot;attack&quot; forcing the player to give up the attacked animal cards. The attacking player may then take the cards for his own. Also, warriors may be used to &quot;defend&quot; and nullify an opponent's warrior.&#10;&#10;Tessen is easy to learn, plays in minutes, and is great fun for both the casual and serious gamer.&#10;&#10;",
        "artist": "Wayne O Connor"
    },
    {
        "name": "Praetor",
        "description": "It's the year AD 122, and the Roman Empire is at the peak of its glory. Caesar Hadrian is no longer waging war against the barbarians, but building cities and fortifications to ensure a lengthy domination of the Roman culture and wealth.&#10;&#10;The southern part of Britain is under Roman domination, and Caesar has already begun the construction of Hadrian's Wall to protect the empire from invasions from the North. Together with the wall, Caesar has ordered the founding of a new city that will remind the locals of the glory of Rome. He has appointed five of his most trusted men to take resources and workers from Rome and to build the city together &ndash; but in the end only one of them will be appointed Praetor and rule the Province in the name of Caesar.&#10;&#10;In Praetor, you will take the role of a Roman engineer, and you will work together with the other players to build a magnificent city. You will manage your limited resources wisely and look for new ones, you will recruit new Workers while your old experienced ones will retire, you will build settlements to keep the population happy, and you will praise the Gods to earn their favor. Caesar will reward you if you give away precious resources to build Hadrian&rsquo;s Wall, thus increasing your chances of becoming Praetor.&#10;&#10;Every turn, you will place your Workers on previously built City Tiles to gain resources, Morale, new Workers, or Favor points. You may also assign Workers to build new City Tiles or spend resources to meet Caesar&rsquo;s demands to gain Favor Points. At the end of each turn, you will have to pay your Workers. Otherwise, the mood in the city will deteriorate.&#10;&#10;Most of the actions your Workers will perform will help them gain experience. They will become increasingly skilled in collecting resources. Your most experienced Workers will eventually retire and bring you additional Favor Points, but you will still have to show solidarity and pay them until the end of the game.&#10;&#10;",
        "artist": "David J. Coffey,Agnieszka Kopera,David Szilagyi"
    },
    {
        "name": "Office 21",
        "description": "In Office 21, players take the role of CEO and try to maximize their profits without going over the governmental set limit of 21K.&#10;&#10;To win, players must figure out how best to play different characters and their special abilities. Players start with three character cards in hand. On a player's turn, she draws back to three cards in hand, then must play one card without exceeding the 21K limit after activating the power of that character; if she can't play a card without busting 21, she's out of the game.&#10;&#10;When a player reaches 21K, all other players have one final turn to stop her &mdash; but if her profit still remains at 21K, she wins. If no more cards remain in the draw deck, whoever has the highest profit total in their play zone and is still in the game wins. There's also a chance that the player with the lowest profit wins...&#10;&#10;",
        "artist": "Guan Chih Huang"
    },
    {
        "name": "Galactic Strike Force",
        "description": "Galactic Strike Force is a cooperative, deck-building game in which two to six players each take control of a ship and a crew in defense of the galaxy! Dangerous opposition forces threaten to overrun the entire galaxy, and the players must not only build up their ships, but also work together tactically to stop them!&#10;&#10;However, this Strike Force is not made up of stalwart defenders, space cops or Volnethian Guardians. In Galactic Strike Force, you play as scoundrels &mdash; members of the galactic underworld! Smugglers, space pirates, gun runners, bounty hunters, and information brokers make up the ranks of the Strike Force which has come together to defend the galaxy!&#10;&#10;Galactic Strike Force takes about an hour to play and all of the players are engaged throughout the entire game. Rather than having individual turns, each player is constantly acting through the phases of the game, and each ship is in constant peril! As the game progresses, players travel from sector to sector, purchasing powerful tech upgrades for their ships and boosts to help them in battle. Then, after installing the techs, the Strike Force ships engage the opposition ships in battle throughout the galaxy!&#10;&#10;",
        "artist": "Adam Rebottaro"
    },
    {
        "name": "EONS",
        "description": "&ldquo;Nothing cannot exist forever.&rdquo; - Stephen Hawking&#10;&#10;After the Big Bang, things moved quickly.  So do you.  Players in the game of Eons take on the roles of universal architects competing to shape the universe on a cosmic scale by gathering elemental building blocks to create stars, planets, and other cosmic phenomenon.  In a strategy game like no other, the architects engage the laws of the cosmos, using stars to forge more complex elements and form other heavenly bodies.&#10;&#10;In EONS, players must spend their own essence to marshal these elements, carefully gauging their resources and the benefits received from their planets and stars, as they guide the formation of their cosmos eon after eon; working to achieve the most victory points through a variety of strategies and hidden agendas to achieve their version of the universe.  Because eventually, the universe will end, and only one player will be victorious...&#10;&#10;Players build stars using elements commonly found in the universe, Hydrogen, Carbon, Oxygen and Iron.  Once they build stars, the stars perform fusion, and can produce resources for the player to use to build additional stars, planets or other cosmic events.  Each cosmic body the player builds is worth Essence, representing the power and influence the Architect has in the universe, and that Essence can be used to purchase more elements from the elemental stockpile to build more items.  Players can also destroy stars and collect resources from the dead stars, and this is where the game turns to strategy and planning.  Every cosmic body that is destroyed will decrease the entropy countdown, and when it reaches 0, the game is over.&#10;&#10;Remaining cosmic bodies that grant victory points are totaled, and the player with the most victory points, wins!  Although the goal is to have the most victory points at the end of the game, you will find that the game is also a resource management game, as if you deny resources that stars need to undergo fusion, they will die and accelerate endgame.  Be prepared, build judiciously and destroy when you must to defend your universe!&#10;&#10;",
        "artist": "Christopher West"
    },
    {
        "name": "Jupiter Rescue",
        "description": "You're a team of lowly maintenance robots built to keep the space station operational and clean so that the colonists can get on with...whatever it is they do. Unfortunately, the station has been invaded by creeps, alien creatures that slowly advance toward food (the colonists) so that they can multiply. The only thing keeping the colonists from being completely wiped out is your knowledge of the station, a couple of specialty tools and abilities unique to each of you, and a little bit of problem-solving code installed so you could do your jobs efficiently.&#10;&#10;Jupiter Rescue is a co-operative strategy game in which players work together to escort 28 colonists to an escape pod before they're converted into alien creeps. Each turn, players may take five actions, choosing from common options &mdash; moving themselves, moving nearby colonists, or killing alien creeps &mdash; and a series of programming cards that grant them special abilities. These cards can be played on the player's turn to activate the ability. Each player also gets to choose one card to be his &quot;core&quot; ability, letting him use it every turn instead of discarding it.&#10;&#10;New creeps are added to the board, which is composed of tiles, at the end of each player's turn by rolling a die; if a tile fills up with creeps, it's destroyed and removed from the game. Players lose if enough colonists get turned into creeps, or if certain key board tiles are all destroyed. Double-sided tiles allow for hundreds of station variations.&#10;&#10;",
        "artist": "Mark Major"
    },
    {
        "name": "Bugs in the Kitchen",
        "description": "There's a pesky little bug in the kitchen! And it's not just any bug - it's a HEXBUG&reg; nano&reg;, scuttling around the game board! Quick - can you catch it in the trap? By turning knives, forks and spoons you can direct the bug into the trap. Throw the die to discover which utensils you can turn. Catch the bug in the trap and earn a token - the first player to collect 5 tokens wins the game.&#10;&#10;",
        "artist": "Janos Jantner,Maximilian Jasionowski"
    },
    {
        "name": "Nada!",
        "description": "In Nada!, you want to claim as many matching dice as possible &ndash; until no matching dice remain, that is, at which point you can yell &quot;Nada!&quot; to claim what's left.&#10;&#10;In each round, you start by taking six white dice and six orange dice, with each die having six different symbols on it. Someone rolls all the dice in the center of the table, then players race to be the first to yell out a symbol that is on at least one white and one orange die. If correct, the player collects all the dice showing this symbol; if not, the player collects nothing and sits out the next turn. Once a player has claimed dice, this player rerolls all the remaining dice. If no match can be found, the first player to yell &quot;Nada!&quot; and cover the dice with her hand claims all the remaining dice. Players tally their scores &ndash; one point for each die collected &ndash; then play another round. Whoever has the highest score after three rounds wins!&#10;&#10;Nada! includes variant rules for two other games. In one, the players use all 36 dice at once, playing as above but most likely scoring more points each time since more dice will be in play. The round ends after all dice of one color have been claimed, and the player who collects the most dice wins.&#10;&#10;In the other variant, players start the game by secretly drawing 8, 12 or 16 dice from the bag (with the number based on the number of players). On a turn, each player chooses 2-4 dice from his stock, then all players roll their dice simultaneously, claiming dice as explained above. The players take back any unclaimed dice, then choose 2-4 dice again for the next turn. Once a player has no more dice in hand, the game ends, and the player who has collected the most dice wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Dicht dran",
        "description": "In Dicht dran, there are cards from 1-100. Each players has 8 cards. Each round there is a target card (e.g. 60) and a gap (e.g. 11-46). Everyone plays one card, face down, then cards are revealed. If you are the closest to the target card, you'll earn positive points. If you are not the closest, but your number fits in the gap, you get rid of negative points. If you can't do both, you have to draw new cards. The round ends as soon as one player has played his last card.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Schmovie",
        "description": "What would you call a horror film about an evil booger? A sci-fi about a gangsta lunch lady? A romantic comedy about a clumsy proctologist?&#10;&#10;In Schmovie, you're trying to convince others that you have the best title ever for whatever concept is being pitched to the producers. What's the actual storyline? Doesn't matter &ndash; the title is what's important, so put your all into making something memorable!&#10;&#10;Each round, you'll roll the genre die (which has sci-fi, rom-com, horror, action, drama and producer's choice), then draw two premise cards, one What? and one Who?. The combination of those three items gives you the concept for the movie. Now you just need to come up with a title. Do a good job, and you'll win a schquid trophy; collect enough trophies, and you'll win the game.&#10;&#10;",
        "artist": "Sara Farber,Bryan Wilson"
    },
    {
        "name": "Geek Dice",
        "description": "GEEK DICE (Dice games) adds Lizard and Spock to the classic game of Rock-Paper-Scissors for an incredibly fun and geeky experience.  Players can try to calculate or analyze all they want, but GEEK DICE comes down to chance... and some old fashioned luck!&#10;&#10;&#10;     Each player receives 1 die and an equal number of chips&#10;     Each player antes up 1 chip at the beginning of each round&#10;     All players roll the dice simultaneously&#10;     Consult the chart to see if there is a clear winner or draw&#10;     When a draw occurs the players involved continue rolling off&#10;     Losers are eliminated until the next round&#10;     The winner is allowed a chance to roll the Atom to claim the pot. If the pot is not won it continues to grow&#10;     A new round begins&#10;     The last player with chips wins the game&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Zombicide Season 2: Prison Outbreak",
        "description": "Zombicide Season 2: Prison Outbreak takes the players to an indoor environment with vicious close-ranged fights, Prison Outbreak contains all the needed material for a new player to enter the Zombicide universe, and lots of content, almost all new, for an existing Zombicide player to expand his game experience. In fact, Prison Outbreak holds even more material than the core game published in 2012 (now nicknamed Season 1)!&#10;&#10;The Prison Outbreak will feature berserker zombies. They&rsquo;re really tied to each other. Prison tiles display tortuous alleys, small rooms and doors everywhere, filled with berserker zombies immune to ranged weapons. You have to think fast, foresee the improbable and jump into melee at every turn. This is like a modern dungeon where levers are replaced with switches to open or lock doors, use security rooms and reach secret areas.&#10;&#10;Prison Outbreak also contains six new survivors with their Zombivor aspects. These survivors are really designed to act as a team, as their skills really complement each other. They&rsquo;re precious assets to any Zombicide team.&#10;&#10;Missions featured in the rulebook form a campaign on their own, as survivors battle to turn a zombie-filled prison into a reliable shelter. Many challenges await them, but they have new tools of the trade: riot shields, automatic shotguns, concrete saws and many more toys. There&rsquo;s even an alternate ending.&#10;&#10;",
        "artist": "Nicolas Fructus,Édouard Guiton,Mathieu Harlaut"
    },
    {
        "name": "WordARound",
        "description": "In WordAround players try to discover and read words written in round cards before their opponents. The players who gueses it correctly gets the card as a point. Whoever has more cards at the end of the game wins.&#10;The game includes 100 cards with 300 words.&#10;&#10;",
        "artist": "Joe Herbert,Dave Herbert"
    },
    {
        "name": "Warmachine: High Command",
        "description": "Game description from the publisher:&#10;&#10;The fires of continent-spanning war engulf western Immoren, forging great leaders in a crucible of conflict. Bold commanders orchestrate grand strategies and daring battlefield tactics, their actions bringing glorious victory&mdash;or the despair of final defeat. Do you have the courage and cunning to lead your forces to ultimate triumph? Take command and muster the military might of an entire nation to conquer the Iron Kingdoms!&#10;&#10;Warmachine: High Command is a deck-building card game for 2-4 players set in the steam-powered fantasy world of the Iron Kingdoms. Leverage your resources, rally your armies, and dominate your foes to set your banner above all of western Immoren!&#10;&#10;This set can be combined with the following other core sets:&#10;&#10;Hordes: High Command &#10;Warmachine: High Command &#226;&#128;&#147; Faith & Fortune&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Hordes: High Command",
        "description": "Game description from the publisher:&#10;&#10;Brutal conflict spreads across the wilds of western Immoren, fought by savage warriors and terrible beasts. Powerful warlords orchestrate grand strategies and daring battlefield tactics, their actions bringing glorious victory &mdash; or the despair of final defeat. Do you have the courage and cunning to guide your forces to ultimate triumph? Take command of the mightiest warriors and beasts to conquer the wilds of Immoren!&#10;&#10;In Hordes: High Command, each player takes control of one faction of the Hordes world &ndash; Skorn, Circle of Orboros, Trollblods or Legion of Eveblight &ndash; leading whole armies of soldiers, Warlocks and mighty Warbeasts to great battles which will shake all of Immoren and change it forever. Each faction has individual decks with faction-specific warbeasts, units, and resources which assure different strategy and gameplay from the other factions. Additionally, before each game, players choose three of the five warlocks specific to their faction. This decision makes every game different and allows for multiple strategies. During the game, players play a whole season of War, trying to build up their strength, then capture strategic locations to earn victory points.&#10;&#10;Hordes: High Command can be combined with the following other core sets:&#10;&#10;Warmachine: High Command.&#10;Warmachine: High Command &#226;&#128;&#147; Faith & Fortune&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Firefly: The Game",
        "description": "Players begin with a ship, and travel from planet to planet, hiring crew, purchasing ship upgrades, and picking up cargo to deliver (jobs) all in the form of cards. Some crew and cargo are illegal, and can be confiscated if your ship is boarded by an alliance vessel. Travelling from planet to planet requires turning over &quot;full burn&quot; cards, one for each space moved. Most do nothing, but you can also encounter an Alliance ship, have a breakdown, or even run into Reavers. Completing jobs gets you cash. First player to complete the story goals wins.&#10;&#10;Game description from the publisher:&#10;&#10;In Firefly: The Game &ndash; based on the popular Firefly television series created by Joss Whedon &ndash; players captain their own Firefly-class transport ship, traveling the 'Verse with a handpicked crew of fighters, mechanics and other travelers. As a captain desperate for work, players are compelled to take on any job &mdash; so long as it pays. Double-dealing employers, heavy-handed Alliance patrols, and marauding Reavers are all in a day's work for a ship's captain at the edge of the 'Verse. Firefly: The Game is a high-end thematic tabletop boardgame from Gale Force Nine (GF9) and the first in a series of tabletop hobby board games and miniatures games from GF9 set in the Firefly Universe.&#10;&#10;",
        "artist": "Charles Woods"
    },
    {
        "name": "Huida de Silver City",
        "description": "Huida de Silver City (trad. Escape From Silver City) is the board game about survival, where zombies will hunt you without rest through streets and buildings, where there is no such thing as endless ammo and you never know what could be awaiting round the corner. Embody one of the outbreak survivors and cooperate with your partners so you can manage to leave the city before time runs out. You should be careful, though, because one of them looks a little bit ill and the girl was bitten a while ago&hellip; and she is anxiously staring at that bleeding wound in your arm. Maybe it&rsquo;s just better save her the suffering with a bullet, you can make it yourself after all&hellip; or maybe not&hellip;?&#10;&#10;Includes a large survivor-styled board, 30 personalized standups counters to represent characters and zombies, two dice: one eight-sided and another one six-sided, 93 cards, plenty of items to represent weapons and objects in general, 7 customized characters sheets, comprehensive rulebook with a fair amount of quests aside the main game.&#10;&#10;The approach is simple... we have to flee the city. There are three ways to escape: land, sea and air. The last one is only available if between players is the character of the pilot. The other two are available ... as long as the ship does not leave nor the military blow the bridge to contain the outbreak. Do not forget that the transport may have limited seats.&#10;&#10;And on the way? Zombies, hidden areas which reveal themselves by the survivors approaching. But beware! these areas may contain more zombies or obstacles that force us to get round. Also, there are many common and special buildings that we can loot- Only if we are not eaten- looking for weapons, equipment and medkits. Meanwhile, zombies are surrounding us, they corner us, hit us&hellip; they also bite us so we can get infected!! of course the rest of the team doesn't need to know, right?&#10;&#10;",
        "artist": "Saray García"
    },
    {
        "name": "City Blocks",
        "description": "Metro City is redeveloping an old industrial district for mixed use (residential, commercial and industrial) and the mayor is offering bonuses to two developers for aesthetic completion of key streets. Can you win greater bonuses than your competitor by strategically building homes, offices, stores, courthouses, parks and malls in ways that upset your opponent&rsquo;s plans for the city?&#10;&#10;The city district is a 6 x 5 grid with 11 named streets. Each street has a mayor's bonus associated with it, from $1 to $15, drawn randomly at the start of the game. Players try to develop each street better than their opponent to claim its bonus.&#10;&#10;Each player keeps a hand of 5 Building tiles out of 20 available to them. When placing a tile on an empty city block, if the tile completes a street (a row or column) they compare the value of their Buildings on the street to their opponent's Buildings to determine who wins the bonus. A straightforward comparison simply involves adding the number of each tile: Residential Buildings count from 1 to 5, Commercial Buildings count from 2 to 6 and Industrial Buildings count from 3 to 7. However, four types of special tiles change how the bonus is determined: a Park or Mall prevents either player's Industrial Buildings from counting towards the bonus on a street; a Power Plant or Mall prevents Residential Buildings from counting towards the bonus. Finally, the Courthouse allows the player to switch the bonuses of two streets.&#10;&#10;Instead of placing a tile on an empty block, a player can discard a Currency token and build over a block they have already developed.&#10;&#10;Whoever has the most money wins, and earns a key to the city from the mayor!&#10;&#10;",
        "artist": "Xavier Carrascosa"
    },
    {
        "name": "They Who Were 8",
        "description": "Gods and Goddesses are mercurial beings, given to jealousy and treachery, but they can also possess compassion and valor.&#10;&#10;Who among the pantheon can win enough glory among their believers, so that their story of mythic victory can be passed down through the generations?&#10;&#10;They Who Were 8 is a game for 2-4 players where each player serves two Gods, seeking to praise them for their Glory, and trying to avoid stories of their Infamy.&#10;&#10;The game can be played in two different ways:&#10;&#10;&bull; Titanomachy: &#10; A game for 2-4 players trying to achieve an individual victory.&#10;&#10;&bull; Pantheon: &#10; A partnership game for 4 players, played in two teams of 2.&#10;&#10;In both of these games, the players take actions that represent a bard&rsquo;s retelling of the ancient story of They Who Were 8. They may also call upon the powers of their Gods to control the narrative and establish their version of the saga as the one told for eternity.&#10;&#10;Note: They Who Were 8 was inspired by a cycle of poems by Todd Sanders written in 1999. The poems are fragments of a larger ancient saga, lost to time.&#10;&#10;",
        "artist": "Todd Sanders"
    },
    {
        "name": "Ascension: Rise of Vigil",
        "description": "Ascension: Rise of Vigil is a deck-building game in which players acquire cards from a central pool, then place those cards in their discard pile to be shuffled into their deck for later use; creatures also show up in that shared card pool, and players can combat them to earn victory points (VPs) and possibly other benefits, such as the ability to remove less useful cards from their deck or to banish cards from the pool that others might find useful. The game ends once all the available VPs have been claimed or the shared deck of cards runs out.&#10;&#10;Ascension: Rise of Vigil, part of the Ascension deck-building game series, is both a standalone game for 2-4 players and an expansion that can be combined with any other Ascension game to support up to six players.&#10;&#10;Rise of Vigil introduces treasure cards to the game system, with all treasure cards in this set being &quot;Energy Shard&quot;. When a treasure card is drawn from the shared deck, you place it in the empty space in the shared pool, then continue to draw until you reveal a hero, monster or construct to cover the treasure. When you acquire or defeat that top card, you also gain the treasure, which is added to your deck like hero and construct cards. When you play a treasure from your hand, you immediately draw another card from your deck; more importantly, you can use the energy on these cards to activate special powers on certain heroes, constructs and monsters. (Non-treasure cards can also provide energy, but they are usually worth VPs whereas treasure is worthless aside from the energy.) Energy available on a turn can be &quot;spent&quot; more than once, so if you have, say, two energy, then you can power up all cards with an Energize cost of two or less.&#10;&#10;",
        "artist": "Eric Sabee"
    },
    {
        "name": "Machine of Death: The Game of Creative Assassination",
        "description": "Machine of Death: The Game of Creative Assassination is a storytelling game set in a world in which a machine can predict how a person will die with 100% accuracy with only a small blood sample. However, the machine delights in being vague and twisted. A card reading &quot;Old Age&quot; could mean you die in your sleep at age 120, or it could mean you're run over tomorrow by an elderly driver who forgot to take his pills today. Players of the game take the role of assassins, who must use the various tools at their disposal -- from storytelling to a slew of items available from specialty Black Market shops -- to create a situation in which a target is killed in a way in line with their Death Prediction. The Machine of Death Game uses this basic idea, of assassins working in a world were cause of death is known to create various game modes.&#10;&#10;The General Gameplay of most modes works like this:&#10;&#10;     A target is assigned, and given certain details (including Death Prediction, and extra Intel details, such as things they particularly like or dislike &ndash; to help predict their behavior).&#10;     Players &ndash; assassins &ndash; are given Black Market Gift Cards. These are the items they are allowed to use in order to accomplish their goal: killing the target.&#10;     Players use the Gift Cards to devise a plan. Each Black Market card provides an item to be used in an Action. Three actions should chain together in some way that results in the death of the target. &#10;     The plan is greenlit, either by a Chief player, or via consensus, depending on game mode. &#10;     The timer starts and the plan is put into action. This is represented by dice rolling to beat a &quot;difficulty score.&quot; An unlikely plan hinging on a single item may need to roll a 6 for that Action, but a rock-solid intricate plan may need to only roll a 2 for each card. &#10;     The skull face on the die also adds a frantic element (replacing the 1 face, if the skull is rolled it prompts the flipping of a Fate Coin to add additional randomness). &#10;     In case of failure of any die roll, that Action didn't work, and the plan must be revised. While the timer continues running, the assassins draw a new Black Market item, amending their previous plan and rolling for a new Action. They may also call in &quot;Specialists&quot;, who are characters with special skills (earned in previous rounds).&#10;     If any three Actions are successful before the timer runs out, the target is killed. With the remaining time, the players may roll for Aftermath tasks (such as fleeing the scene or destroying the evidence). Completion of these tasks earns Specialist cards to be used in later rounds. This is the only way to replenish the group's overall Budget of playable cards.&#10;     If the timer runs out before three Actions are completed, the target escapes. This is the end of the round.&#10;     In the published rules, this also ends the game. This rule was subsequently revised, allowing players to make another attempt on the same target, or take the loss and move on to additional targets. Hard-core players may end the game at this point.&#10;     The team wins if they can accomplish four successful kills before their total Budget of Black Market cards are exhausted.&#10;&#10;&#10;&#10;&#10;Game Variants:&#10;&#10;     Chief Mode is where one player takes on the gamemaster role of the Chief, answering questions and deciding on the difficulty of the plan being created by the other players. Groups of 4 or more work best in this mode. In groups of 2-3 players, each player states their opinion, and the hardest value is the one used.&#10;     Psychopath is similar to Cards Against Humanity or Apples to Apples. Each player holds a hand of Death Prediction cards that represent hostages. One psychopath announces a murder weapon (based on a drawn Black Market card), and players each toss in the hostage they believe will be most likely to be killed by that weapon. Designed for 4+ players.&#10;     Speed Round is faster-paced and useful for introducing players to the death prediction concept. One Chief presents the Death Prediction Card of an assassination target, and players rush to play a Black Market or Specialist card that they think can kill the person in the predicted way. The Chief assigns a difficulty value to the fastest player's proposed plan, and the player rolls to see if they can pull it off. If they do, they earn that Death Prediction Card as a point; if they fail, another player may propose a plan. &#10;     Mechanical Chief uses 14 regular playing cards to replace the subjective judgments of the Chief. Each Black Market card is dealt with a playing card, the value of which is kept hidden until the die is about to be rolled. This variant is good for faster play, and directs discussions toward justifying the revealed values within the story, rather than debating the merits of various plans.&#10;     Teams is useful for very large groups. The players split into two rival assassination teams, and alternate attacking targets, with a single Chief moderating. Teams operate under spelling bee elimination rules (one team's failure, followed by the victory of the other, results in the first team's elimination). A target that a team fails to kill must then be attempted by the other team, and a continuous narrative persists throughout the entire game.&#10;&#10;&#10;&#10;&#10;",
        "artist": "Kris Straub"
    },
    {
        "name": "Trains and Stations",
        "description": "Game description from the publisher:&#10;&#10;It is the height of the Steam Age and the whistle of the Iron Horse harkens the boom of small towns across the country into major hubs of transportation and economic growth.&#10;&#10;In Trains and Stations, a new take on train games, players must make deliveries, develop buildings, and profit from their decisions while working with and against other players. Will you focus on establishing mining operations in an attempt to gain a monopoly on coal, silver, and gold? Or perhaps you will focus on laying tracks across the landscape and helping other players move their goods&mdash;taking your cut, of course. Every game will evolve differently with unique twists and turns as you control the movement of goods across the game map!&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Microbadges&#10;&#10; Trains and Stations fan&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Continental Divide",
        "description": "A multi-hour no-randomness economic game somewhat in the mold of Baltimore & Ohio set in the continental USA west of the Appalachians.  Players found companies, determine share distributions and capitalisations, invest in companies they and others have founded, expand the companies across the country, and compete for the most victory points (not net worth) at the end of the game.&#10;&#10;Released as part of the Winsome Games' Essen Collection - 2013.&#10;&#10;",
        "artist": "Eric J. Carter"
    },
    {
        "name": "Galaxy Defenders",
        "description": "Galaxy Defenders is a sci-fi cooperative, tactical battle game in which 1-5 players fight together against an oncoming alien menace. Each player takes control of one or more agents with unique powers to defend the planet from the alien invasion. Gameplay revolves around a tactical combat system, using custom ten-sided dice. Each player sequentially plays his Agent turn and then one Aliens turn. Players carry out their turns [agent and aliens] in clockwise order until the last player finishes his Aliens turn. Once done, the game passes to the Event phase that will bring the players to the next round. Players may choose up to five agents:&#10;&#10;&#10;    Marine: Coming from U.S. Special Forces, the Marine is an excellent soldier who can manage different combat situations, especially multiple enemies.&#10;    Biotech: The Biotech is the most technologically adept agent in service. He can use Nano-Technology to heal wounds or control war drones.&#10;    Infiltrator: A deadly and stealthy agent. This lethal specialist prefers hiding in the shadows. She has fast movement and good short-range combat ability.&#10;    Sniper: A silent sharpshooter and expert in camouflage and ranged combat. The sniper has average movement and excellent long-range firepower.&#10;    Hulk: The Hulk was a successful mercenary and now is one of the best agents; although slow, he enjoys an extraordinary resistance to damage and has high firepower.&#10;&#10;&#10;There is no &quot;Alien player&quot; in Galaxy Defenders; instead, the aliens are controlled by the game system itself, through an artificial intelligence system based on two types of cards:&#10;&#10;&#10;    Alien cards, which define the behavior of each different alien and detail its skills and combat abilities.&#10;    Close Encounter cards, which are used at the beginning of each alien turn to determine which aliens activate.&#10;&#10;&#10;The combination of a unique AI for each alien species and the uncertainty about alien activation in a turn provides a realistic simulation of the chaos of battle and a sophisticated challenge for the players. Since having more agents brings more alien activations for the aliens, the turn structure allows the level of difficulty to scale dynamically based on the number of agents in play. If agents die during the game, the system &quot;recalibrates&quot; the difficulty to a reasonable and enjoyable level, so you still have a chance to complete the mission.&#10;&#10;The battle for Earth will be carried out in a series of twelve missions organized in a completely story-driven campaign. Mission events influence future games in two different ways:&#10;&#10;&#10;    Each mission has multiple endings, and the outcome of any mission will change the flow of the story.&#10;    The agents gain experience during the missions. This experience transforms a good soldier into a perfect Galaxy Defender agent with multiple skills, basic and improved tactics, and the ability to use new devices, improved human weapons, and Alien technology.&#10;&#10;&#10;With the downloadable Galaxy Defenders: Alien Mind variant, you can transform the game into a competitive affair, with one player becoming the alien mastermind and controlling the alien army and the card in play, attempting to thwart each mission undertaken by the Agents. To do this, the alien player completes his own game objectives, obtaining new &quot;alien signals&quot; that can be teleported onto the battlefield. This variant, which allows for play with up to six players, can be used in a single mission or for a whole campaign of Galaxy Defenders. Using Alien Mind may increase the game difficulty and is suggested only for expert players.&#10;&#10;Official FAQ: http://www.galaxy-defenders.com/faq.php&#10;Additional Missions: http://www.galaxy-defenders.com/mission.php&#10;Galaxy Ball: http://www.galaxy-defenders.com/gb-cards.php&#10;&#10;",
        "artist": "Mario Barbati,Fernando Peniche,Simone Romano,Raffaele Stumpo,Nunzio Surace"
    },
    {
        "name": "Robots on the Line",
        "description": "You're one of the lucky robot factory workers invited to an exclusive event. Your job? Picking refurbished or out-of-date parts to build robots that meet eager buyers' requirements. Sell your completed robots to earn points and achieve certain bonuses to earn even more points &mdash; but hurry because other players may be building a robot to sell to the same buyer first.  Can you outsmart your opponents and assemble a four-wheeler robot with two heads, or a robot with six eyes and four hands before they do?&#10;&#10;In Robots on the Line, robot parts move down two conveyor belts. Players take turns pulling robot parts (heads, bases, arms, hands, batteries, antennas and magnets). Not all robot parts can be taken, however. The line you're pulling from must be switched to ON. Robot parts that aren't taken will be discarded onto the junk pile. Players can pay a dollar to go through the junk pile or they can pay a dollar to turn ON/OFF switches. As players take robot parts, they build robots in front of them. Players can build up to four robots in a game. Trading is always allowed.&#10;&#10;To finish a robot it must have a torso, a head, and a base with all other segments off the torso ended with the other parts. While you're building, you'll want to look to the buyers to meet their requirements. A requirement might be a robot with four eyes, or a robot that has no wheels, or a robot with three hands. If you meet a buyer's requirement, you sell it for money. If you meet the bonuses, like medical, war, or cleaning, you get even more money. The game ends when all tiles are off the line or when a player has built 3 robots. The player with the most money wins.&#10;&#10;",
        "artist": "Phil Hunter"
    },
    {
        "name": "Axis & Allies Air Force Miniatures: Bandits High",
        "description": "Axis &amp; Allies Air Force Miniatures is a fast, action-paced game of World War II air combat. Players take the stick of one or more of history's most famous warplanes, taking on their opponent in wild dogfights. Bandits High features aircraft used in the Pacific Theater of Operations and introduces new scenarios, including bombing missions!&#10;&#10;Two-Player Starter Set includes six non-random warplanes, including the exclusive P-38J Lightning Ace, and everything needed to start dogfighting!&#10;&#10;Booster Packs each contain three random warplanes, and there are 31 different planes for players to collect!&#10;&#10;This is a game of aerial combat with WWII aircraft of various nations fought on a hexagonal map. This set represent aircraft primarily from the early years of the war. Players take turns determining initiative, moving their aircraft, and attacking opponents. Victory is determined player elimination or victory point total comparisons. Optional rules allow for clouds, flak fields, barrage balloons, and even night combat.&#10;&#10;A&amp;A Air Miniatures: Bandits High details:&#10;&#10;- Set contains legendary aircraft like the Ju 87 Stuka, Navy F4U Corsair, P-51D Mustang, and IL-2 Sturmovik.&#10;- Prepainted, durable plastic&mdash;assembled and ready to play, right out of the box.&#10;- Abilities and statistics of units based on historical performance in battle.&#10;&#10;",
        "artist": "Ryan Sansaver"
    },
    {
        "name": "Relic Expedition",
        "description": "Relic Expedition is a jungle exploration game with a variable board, hand management, collectible treasures, and dangerous wild animals!&#10;&#10;The game board starts small, with only a few of the tiles revealed. As players explore the jungle, new tiles are revealed and the board grows in unpredictable ways, making for a completely different game each time. Hidden in the jungle, you'll find six different types of treasures made of six different materials. To win, you must collect four matching treasures &mdash; either four of the same type or four of the same material &mdash; and fly away from the jungle to victory.&#10;&#10;If you hope to travel through the terrain and survive the dangers of the jungle to get that treasure, though, you'll also need supplies like machetes, mountain climbing gear, panther traps, tranquilizer darts, vines, and more. You carry treasures and supplies in your backpack, but your backpack space is limited! As the game progresses, you'll have to choose carefully. As you find more treasure, you'll have to make tough decisions about which supplies you have to leave behind.&#10;&#10;",
        "artist": "Nolan Lorch,Tyler Segel"
    },
    {
        "name": "Shift: The Single Card CCG",
        "description": "Shift is an anime themed card game in which players duel using a single card and some coins. Shift cards have stats and Modifiers on all four sides, called Gears. Each card functions like a deck in a traditional CCG, where each Gear is a separate hand. And much like decks in a CCG, each card rewards different strategies and play styles.&#10;&#10;Players take turns attacking or shifting their cards to another Gear. To use a Gear's Modifier, you might have to pay a cost; costs may require flipping a coin, or paying spirit - which is earned by taking damage. The first player to deal six damage to their opponent wins!&#10;&#10;",
        "artist": "Samuel Strick"
    },
    {
        "name": "DC Comics Dice Masters: Justice League",
        "description": "Game description from the publisher:&#10;&#10;The DC Comics Dice Masters: Justice League Starter Set, the fifth starter release for the Dice Masters game, has everything two players need to play and allows players to increase their Dice Masters collection or jump into the game fresh!&#10;&#10;DC Comics Dice Masters: Justice League features fan favorite characters from a variety of Justice Leagues, including Batman, Wonder Woman, Superman, Zatanna, and Martian Manhunter. With gameplay that supports two players in epic dice battles, DC Comics Dice Masters: Justice League lets players build their own version of the Justice League &mdash; or even the Legion of Doom!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Northern Pacific",
        "description": "Northern Pacific is a no luck railroad building game, 3-5 players, lasting about 20 minutes. This game is in the genre of Iron Road/Transamerica and SNCF/Paris Connection.&#10;&#10;On their turns, players have two choices: invest in cities or build track. The line starts in the Twin Cities and once the &quot;Little Nipper&quot; reaches Seattle, the game ends and the wisest investor wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Domus Domini",
        "description": "When in 1122 Petrus Venerabilis starts his job as Abbott of Cluny, he finds a difficult economic situation. This is why he asks the monasteries belonging to Cluny to deliver food.&#10;&#10;In Domus Domini, each player is an abbot who leads such a monastery. Each year (i.e. every round) players produce a yield, then deliver it to Cluny. Petrus Venerabilis uses the revenue from the yields to make life easier for the monks. The player who delivers the highest yield in a round gains the most Glory (victory points). However, he will get the least support (thalers) for further investments. Whoever delivers the lowest yield in a round receives the least Glory, but the most thalers for further investments. Consequently, players need to decide in each round whether they want to earn more thalers in order to invest in the development of their monastery, or to obtain more Glory in order to be the winner in the end.&#10;&#10;But each player pursues his own plans, so every round brings a scramble for the best ranking on the street to Cluny, which might bring unpleasant surprises to some players.&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Flash!",
        "description": "Watch the sparks fly in Flash!, a lightning-fast dice dash. Players race to complete eight challenges of dice combinations while racking up the most points. Best not blink as any player could score in a flash!&#10;&#10;To start, each player receives six dice. Someone picks a challenge for the round: all dice even, three pairs, straight, flash!, etc. On the count of three, everyone starts to roll...and roll, and roll again, keeping the dice they like and trying again with the others until they achieve the combination. Roll a lightning bolt, and you can make it any number you wish. Once you've finished, collect the highest point chip available and write this number on your score pad. Move on to the next challenge and play through all eight rounds. Whoever has the highest score wins.&#10;&#10;If you're feeling like fortune is on your side, play Freestyle Flash and choose your challenge as you go!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Dungeon Roll",
        "description": "The Dungeon lies before you; you&rsquo;ve assembled your party of hearty adventurers and have a few tricks up your sleeve. How far will you go to seek glory and fame? Will you risk losing everything?&#10;&#10;In Dungeon Roll the player's goal is to collect the most experience points by defeating monsters, battling the dragon, and amassing treasure. Each player selects a Hero avatar, such as a Mercenary, Half-Goblin, or Enchantress, which provides them with unique powers. Then players take turns being the Adventurer, who boldly enters the dungeon seeking glory.&#10;&#10;The Adventurer assembles their party by rolling seven Party Dice, while another player serves as the Dungeon Lord and rolls a number of Dungeon Dice based on how far the Adventurer has progressed through the dungeon. The Adventurer uses Champion, Fighter, Cleric, Mage, Thief, and Scroll faces on the Party Dice to defeat monsters such as oozes and skeletons, to claim treasure inside chests, and to revive downed companions with potions. The Adventurer claims treasure by taking a token at random from inside the treasure chest-shaped game box.&#10;&#10;All this fighting in the dungeon is certain to attract the attention of the boss: The Dragon!&#10;&#10;When three or more Dragon faces appear on the Dungeon Dice, the Adventurer must battle the Dragon. Defeating the dragon is a team effort, requiring three different companion types. After three rounds, the players add up their experience points and retire to the inn to celebrate their exploits and to plan their next foray into the next deadly dungeon!&#10;&#10;",
        "artist": "Eric J. Carter,Ryan Johnson,Rob Lundy"
    },
    {
        "name": "LOKA: A Game of Elemental Strategy",
        "description": "LOKA is a fantastically sculpted Chess sets and a brand new take on playing Chess, brought to you by Alessio Cavatore's River Horse and published by Mantic Games.&#10;&#10;LOKA is played with fantasy-inspired Chess pieces, each evoking the powerful imagery of one of the four elements.&#10;&#10;From the kickstarter page 'At its heart, LOKA uses the rules of Chess, and Alessio has some significant twists in mind in the form of new mechanics:&#10;&#10;Choose your army - Each player get to choose which pieces they put onto the board, meaning both players command different armies on the battlefield &ndash; do you field a small but elite force with three Queens, or do you go for a mass horde of Pawns?&#10;&#10;Fantasy Scenery &ndash; Change the shape of the battlefield with movement blocking terrain that alters the path you&rsquo;ll take into combat.&#10;&#10;Dice Driven Combat &ndash; a simple and elegant system using eight sided dice adds some unpredictability to combat, placing extra emphasis on strategy and positioning as pieces build in power with support from their comrades.&quot;&#10;&#10;",
        "artist": "Pete Borlace"
    },
    {
        "name": "Empires of Zidal",
        "description": "Lead your people to greatness by training them in the ways of war, commerce, magic, labor, or entertainment in this fun and original deck building board game.&#10;&#10;The people in the Empires of Zidal require your guidance!  Train the children in your empire to become military workers who can attack other players and take their game resources.  Alternatively you can train your children to become market workers who can manipulate the in game supply and demand driven market to your advantage.  Grow the power of your empire by constructing buildings to give benefits to workers in specific employment branches.  In total, there are 5 different employment branches which children can be trained in (military, market, magic, labor, or entertainment).  Each branch has their own unique effects and strategies for winning.  In the end whichever empire is able to gain the most signets wins!&#10;&#10;Empires of Zidal is a deck building game for 2 to 4 players.  The game is set in the land of Zidal and every player is the ruler of one of Zidal's empires.  The deck you build throughout the game consists of people from within your own empire.  Will you decide to create a military empire and populate your realm with generals, knights, and archers?  Will you take advantage of the market by training your children to be merchants, negotiators, and analysts?  Will you populate your empire with magic, labor, or entertainment workers... or a combination of two or more employment branches?  It's up to you to decide.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Arkham Investigator",
        "description": "Welcome to H.P. Lovecraft's Arkham, the 1920s. There will be many mysteries to uncover in this storytelling game of Lovecraftian terror. Using the provided newspaper, a list of allies, the directory of Arkham residents and a map of Arkham - your job is to follow the clues from location to location, suspect to suspect - to unravel the mystery and answer the questions posed at the end of each scenario.&#10;&#10;Your score will depend upon the number of clues points you needed to visit, the risks you took to your sanity in your investigations and your ability to find the correct answers to the questions.&#10;&#10;Match wits with Armitage's final score the man who has been exposed to the sanity-blasting truth about the existence of the age old evil! Can you beat his score?&#10;&#10;With that in mind it is time to collaborate with Armitage&rsquo;s investigations to complete your training. This is not a typical board game: No dice, no luck, but a challenge to your mental ability.&#10;&#10;Planned cases to appear in print edition (order may change, titles may change):&#10;&#10;Case 1 - A Grain of Evil  &#10;Case 2 - The King Cometh &#10;Case 3 - The Serpent's Vengeance&#10;Case 4 - The Slumbering Solace  &#10;Case 5 - The Vanished Girl &#10;Case 6 - The Liber Mortis &#10;Case 7 - The Faceless Expedition &#10;Case 8 - A Stalker in the Shadows &#10;&#10;Two additional cases are in the works, and they may either appear in the printed box set or as promotional cases. We are keeping them secret for now, so stay tuned and be sure to play the print and play version of Cases 1 &amp; 2.  See below to download.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Ici Londres",
        "description": "Game description from the publisher:&#10;&#10;Ici Londres is a game about the coded messages which were used by the French resistance on Radio Londres during World War II. The objective of the game is to get these messages to the resistance without being caught by the enemy.&#10;&#10;",
        "artist": "Laure Mascarello"
    },
    {
        "name": "Camelot: The Build",
        "description": "Camelot - The Build is a game of medieval interior design with all sorts of dubious stratagems, dirty tricks and subtle ploys designed to challenge all ages and types of players. The game has only three rules, allowing everyone to understand how to play it and win.&#10;&#10;Camelot - The Build &mdash; having only three rules, a playing time of a half-hour, and bright, humorous graphics &mdash; it is the first title in &quot;The Camelot Chronicles&quot;, a series of easy-to-play games with a target of three rules, maximum playing time of one hour, and universal playability and appeal.&#10;&#10;",
        "artist": "Ed Dovey,Dan Peterson"
    },
    {
        "name": "Mascarade",
        "description": "Players in Mascarade start with six coins and a randomly dealt character card. Characters stay face up just long enough for players to more or less memorize them, then are turned face down. Your goal is to be the first player to hold 13 coins, and while you start nearly halfway to that goal, you can go down just as surely as you can go up!&#10;&#10;On a turn you take one of three actions:&#10;&#10;1) Announce your character: Claim the power of a certain character and take the associated action. You don't have to have that character card in front of you to take this action, but if someone else says that they're that character and reveals the card to prove it, that player takes the action instead while you lose one coin to the tribunal.&#10;&#10;2) Swap cards or not: Take another player's character card along with yours, place them under the table, shuffle them around a bit, then give one card back to the other player while keeping one for yourself. You (presumably) know whether you changed characters and can have some idea of who you are now, but that other player might be in the dark.&#10;&#10;3) Secretly look at your character: Look at your character card to make sure of who you are.&#10;&#10;Play continues until one player obtains 13 coins and wins!&#10;&#10;Mascarade includes more character cards than the number of players, so not all characters will be used in each game. The rules suggest that you use certain characters in your first games, but once you know the game, you can try many other distributions. The first edition of Mascarade contains 13 characters. The beggar (woman) has no special ability. Bruno Faidutti says on his blog: &quot;...she has no ability so far. I always like to find blank cards in a game, for which I can imagine my own effects. Here, the card is not blank &ndash; it has a picture and a name, but you can devise its effect, and I'm sure there'll be some prize for the best idea.&quot;&#10;&#10;",
        "artist": "Jérémy Masson"
    },
    {
        "name": "Upon a Fable",
        "description": "In Upon a Fable, players assume the role of a grand ruler in the fairy tale lands and start the game with one Small Realm (the Home Realm) overseen by a loyal Fable subject. During the nine game rounds, each ruler seeks to expand their fortunes through a variety of methods, including: adding more Small Realms to gain the support of more Fables (which in turn, grant additional game actions each round); expanding the size and influence of their realms, from Small to Large to Epic; playing Ever After cards that influence the flow of the game; and gathering the valuable fairy tale Wonders of Magic, Love, Honour, Followers, and Castles. None of these paths to greatness can be ignored, for only the most well-rounded ruler without weakness in any domain shall be granted victory over the others and awarded the title of High Emperor or Empress.&#10;&#10;At the end of the game, the player with the highest total Point value &mdash; accumulated through the variety of different methods outlined above &mdash; is the winner.&#10;&#10;",
        "artist": "Ruth Sanderson"
    },
    {
        "name": "Archon: Glory & Machination",
        "description": "The land of Cardis has been ruled for many years by King Rhodrig. Cardis is a rich and powerful kingdom controlling all neighboring provinces, which provide valuable resources. All this wealth attracts warlords and raiding parties who more than often launch attacks against the kingdom. So far Cardis has stood against such attacks but with heavy casualties. Thanks to the support of wealthy Archons, the kingdom gets rebuilt so that Science and Arts can flourish once again. At the same time new soldiers are recruited and the army prepares for the inevitable moment when the kingdom will need to be defended once again.&#10;&#10;In Archon: Glory &amp; Machination, players are powerful Archons who support Cardis in order to win King's favor. Players use their influence on their Courtiers and on various figures of authority (Magisters).&#10;&#10;Each game consists of three Seasons. For each of these Seasons, the King issues different demands that players must fulfill in order to score Victory Points. Each season consists of 3 rounds during which players use a card-driven worker placement mechanism to perform various actions that will allow them to gather resources and income, recruit soldiers and, rebuild the city, and acquire scoring cards (Science &amp; Arts). They will also have the chance to train Elite Warriors to assist in the city's defense. After nine rounds, the game ends and the player with the most Victory Points wins.&#10;&#10;",
        "artist": "Antonis Papantoniou,Giota Vorgia"
    },
    {
        "name": "Hoplomachus: Rise of Rome",
        "description": "Hoplomachus [ha-ploh-ma-kuss], or &quot;Hoplo&quot; for short, is a hex-based tactical board game set inside a gladiatorial arena. One to three players, each representing an ancient city/civilization thought to have been lost to the world, are now on Rome's doorstep vying for a place in the prestigious arena games.&#10;&#10;Players have a very clear objective: Eliminate the opponent's champion. Champions start the game in the arena but are inactive and defenseless. They will not fight until the crowd is behind them. Each player takes turns drawing, playing and moving gladiators from their &quot;hand&quot; and assisting them with tactic chips.&#10;&#10;Based on opponent's moves and play style, each person will need to adjust their strategies. Defend your champ, take over and hold the crowd favor areas, assault opponent's champion, cover deployment zones, eliminate tacticians to reduce enemy options, fight beasts to gain crowd favor, the list of tactical possibilities is endless.&#10;&#10;Hoplomachus combines combat, tactics, chip (units) management, level progression (though crowd favor system), team play, player vs board, and so much more.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Firefly: Out to the Black",
        "description": "Firefly: Out to the Black   is a quick card game that plays from three to five players.  It&rsquo;s unusual in that the players do not compete against each other, but compete against the game. This is a fairly new style of game called a co-op game or cooperative game. Players take on roles of the crew of Serenity and play through a series of Events. Using their Fightin&rsquo;, Flyin&rsquo;, and Thinkin&rsquo; skills they attempt to successfully complete these Events to earn Credits and Honor. If the players run out of Credits or Honor before the end of the game, they all lose and the game wins! If the players manage to complete the predetermined amount of Events without running out of Credits or Honor, they win the game, and live to fly another day!&#10;&#10;Components:&#10;&#10;Double sized Character Cards &ndash; Contains the Character&rsquo;s Skill numbers and special abilities&#10;&#10;Event Cards &ndash; These are the Events the players must overcome to win the game.&#10;&#10;Serenity Cards &ndash; These are dual use cards. The main use is to help the players overcome Events. It&rsquo;s secondary use is to determine random numbers.&#10;&#10;Alliance Cards &ndash; These are penalty cards that are drawn if the players do not do well at certain Events. Draw too many of these and the players lose the game even if they still have Credits and Honor.&#10;&#10;Gorramit Cards &ndash; These cards modify the Events, generally making them harder.&#10;A Set of Rules &ndash; The rules to the game.&#10;Honor Tokens &ndash; These are used to track the player&rsquo;s Honor.&#10;Credit Tokens &ndash; These are used to track the player&rsquo;s Credits.&#10;&#10;The Character Cards each represent one of the main Characters in Firefly. In addition to having their skills values listed, Each Character has special abilities, which cost a variable amount of Credits or Honor. On a players turn he can choose to spend Credits or Honor on one of these abilities, but it brings them closer to losing, so they need to think about whether they really need to or not.&#10;&#10;A typical turn of the game consists of the active player turning over the top Event card. Each Event card has three challenges, one Fightin&rsquo;, one Flyin&rsquo;, and one Thinkin&rsquo;. Each of these has a number, which the players must equal or exceed  to be successful in the challenge. Characters gain skill two different ways, they may play Serenity cards to gain skill, and, after playing their Serenity cards, they add a random number to determine their final skill. This is added to the Character&rsquo;s base skill number listed on their Character cards. Depending on how many challenges they successfully complete they either gain or lose Credits and/or Honor. The more successful the more they gain.&#10;&#10;Once the event is resolved, the next player starts a new turn, and turns over the next Event card. The game is over once all the Event cards have been drawn and resolved.&#10;    &#10;The Firefly TV show is about surviving with honor. Mal and his crew are continually trying to scrounge up enough credits to keep flying, while maintaining their own personal sense of honor. The game reflects this grand theme with the victory conditions, survive the Event deck without running out of Honor or Credits.  Each Event in the deck is tied to an episode in the show, and is easily recognizable by fans of the show. The Skills needed for each Event are tied to action of the episode featured on the card. A sub theme of the show is escaping notice of the Alliance, and again, with the inclusion of the Alliance deck, Firefly: Out to the Black delivers. The Alliance deck is an ever-present threat looming over the players as they desperately seek to finish the Events in the game.&#10;&#10;",
        "artist": "Zac Pensol"
    },
    {
        "name": "Romolo o Remo?",
        "description": "Central Italy in the year 753 B.C.: Many new villages have been founded in the region of Latium. This land is prosperous and a strong city here can easily control the trades between the Etruscan cities of the North and the Greek colonies of the South. The region is also rich in salt ponds, and the salt in this period is worth more than gold. There doesn't exist a better place for a new city!&#10;&#10;The two grandsons of the King of Albalonga &ndash; the twins Romolo and Remo, descendants of Enea of Troy &ndash; don't want to miss an opportunity to dominate the region and, acting against each other, try to establish two cities close to the Tiber river. Their enterprise is not easy as the King of Antemnae and the King of Crustumerium will also fight to dominate this area! Who will prevail?&#10;&#10;In Romolo o Remo?, players act as Kings of the new cities in the Latium and have to compete with each other in order to gain control of the whole Region. Players must manage their kingdom and their growing settlement. Two aspects are crucial: the citizens, as players act with citizens to take many different actions, and the territory, as players can act only in the territories they are able to control &ndash; excluding when they go to war, of course! If the population grows, they can take more actions, but they must feed all of them as well. Money, resources, trades, city buildings, and specialized characters increase a player's possibilites, and soldiers, mercenaries, and war declarations can change the game's storyline at any moment. Who will able to build the strongest city? Who will be the founder of a new civilization &ndash; or perhaps even an Empire?&#10;&#10;",
        "artist": "Lamberto Azzariti,Paula Simonetti"
    },
    {
        "name": "California Gold",
        "description": "California Gold is a historic simulation of orange grove production in which you represent a co-op for helping orange ranchers receive support and the best prices for their crops. Play hinges around collecting cards that represent orange ranches distinguished by city environs and grouped by counties. Buildings &ndash; such as packing houses and nurseries &ndash; create local support structures, while advertising and railroad contracts increase profits. The object of the game is to have the most ranches (cards) in your co-op by the end of the game. Players acquire cards through an action point allowance, which is limited by packing house distribution. Other buildings help with advertising, leverage, and expansion into other areas of control like Political Lobbying and Amenities.&#10;&#10;",
        "artist": "David Prieto,Patrick Stevens"
    },
    {
        "name": "Dilluvia Project",
        "description": "Planet earth is overpopulated but recent technological developments open new possibilities &ndash; whole cities hovering high in the skies.&#10;&#10;The first sky city was planned and named Dilluvia Project. Will it succeed, will it attract people living detached from their friends in the skies?&#10;&#10;It is an important time for mankind!&#10;&#10;The players are entrepreneurs managing the construction of this first sky-city. During seven game turns the main goal of the players is to attract new inhabitants to the city. Who is building the city most efficiently, who is attracting the most population and winning Dilluvia Project?&#10;&#10;",
        "artist": "Harald Lieske"
    },
    {
        "name": "UGO!",
        "description": "In UGO!, players try to found a mighty kingdom. Eagerly they expand their empire with more and more countries &ndash; but only the areas that are well maintained by farmers shall ensure that a truly flourishing kingdom will be founded.&#10;&#10;UGO! is a trick-taking game. The starting player plays a card from hand, then in clockwise order the other players play a card of the same color, if possible, while playing a different color otherwise. The one who plays the highest card takes all the others. In a tie, the player who follows suit wins. If none of the players followed suit, then the first one wins.&#10;&#10;The winner places the cards on his kingdom cards, starting from left to right and sorted by color. If you have nothing on your kingdom cards yet, you can sort the cards from left to right in any order. However, if you do have cards already on your kingdom, you must place them on top of the other matching colors (countries). As soon as you have placed the cards and started a new game round, you may not change them anymore. The winner of the game round is also the starting player of the next one.&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Emperor's New Clothes",
        "description": "Emperor's New Clothes is a game inspired by the classic Hans Christian Andersen tale.&#10;&#10;In Emperor's New Clothes, players pretend to take on roles, and pretend that each role card indicates the types of resources (and sets of resources) required to score points. Dice are rolled (three rolls per turn) to pretend to acquire resources, and cards may be played by the active player and opponents to affect dice rolls, card plays, etc.&#10;&#10;After each player has had a chance to roll, the roles are revealed and resources are turned in for points.&#10;&#10;",
        "artist": "Heiko Günther,John Kovalic"
    },
    {
        "name": "Superfight",
        "description": "IMPORTANT: Superfight went through a major reprint in late 2014. The rules and about 30% of the cards were refined to improve the game after it sold out of the first five prints in preorders alone. The game is now produced by the folks who created The Walking Dead, and is exploding in popularity. The CAH/Apples mechanic has been replaced by a table vote and one-one one battles, but the battle royale and villain rulesets keep the old single-judge mechanic if the table prefers that.&#10;&#10;Superfight is party game of super powers and super problems.&#10;&#10;The game is all about arguing with your friends about ridiculous fights.&#10;&#10;The core deck contains 500 cards. 170 characters (white cards), and 330 powers and weaknesses (black cards). Players use a hand of three white cards and three black cards, and choose one of each to beat the player next to them. Then they get a random black card before fighting. Players then argue their case for why they should win, and the table votes.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Civility",
        "description": "Rise in status and lead your city to greatness in a unique game that combines wizards with wooly mammoths, thieves with tanks, and the absolute with the archaic. Use your city's exclusive abilities to wage war, make allies, and achieve objectives while gaining power. Fantasy, Early Men, Thief, Modern, Utopian, and Medieval cities are all brought together in a race to victory while vying for the honor to lead this new extraordinary world.&#10;&#10;Will you choose hostility, or be the model of civility?&#10;&#10;Civility is a board game for 2 to 4 players where players get to choose a city to control. There are 6 cities to choose from - Early Men, Fantasy, Modern, Utopian, Thief, and Medieval. Each city has 4 unique abilities and different starting strengths. Different cities will require completely different strategies and planning. The goal of the game is to reach status 5. This is done by claiming status cards that have specific goals associated with them. Each status card is unique so the victory conditions will vary with each play creating a vastly different experience every time.&#10;&#10;",
        "artist": "Andy Iommi,Clint Jackson,Patty Jackson,Max Kreutzer,Daniel Nanni"
    },
    {
        "name": "The Walled City: Londonderry & Borderlands",
        "description": "From empty crossroads to the first signs of a settlement, The Walled City is coming to life!  Your job is to expand this new city, settling citizens loyal to you alone, as both you and your worthy opponents vie to be declared the first mayor.&#10;&#10;Learning to play The Walled City: Londonderry &amp; Borderlands is easy, but the strategies are endless! In the first round you will play cards to build road which divide the city into neighborhoods, then populate them with loyal peasants and nobles who share your view of this new city. In the second round, you will build the walls themselves and choose which nobles will move into the towers to stand guard over the city as Watchmen. Beware, unfinished roads will combine neighborhoods, and gaps in the walls will cause Nobles to flee the city. Scoring is based on area majority: more neighborhoods loyal to you means more votes towards securing your seat on the city council. If you become Mayor, what will your walled city look like?&#10;&#10;There's more to The Walled City than you might have noticed! Inside this box you'll find two complete games, each with its own flavor. Londonderry introduces players to the famous original Guilds of London, each with its own unique power. Just turn the game board over and you'll visit the Borderlands, a completely new map featuring new game mechanics and an extended selection of Guilds. You can even mix Guild cards between maps! This unique quality leads to uncountable combinations to play with, making The Walled City a place you'll want to visit game after game.&#10;&#10;",
        "artist": "Josh Cappel"
    },
    {
        "name": "Rockwell",
        "description": "Each player represents a mining company drilling the Earth to get resources. But drilling often request the help of other players (forced or not). Each one therefore moves four drills on the arcs stratum of the planet to successfully implement his mines and extract maximum resources. The Fame points are acquired by spending materials, filling objectives and having majorities of material and money at the end of the game.&#10;&#10;&#10;Goal of the Game...&#10;&#10;Acquire the most Renown points at the end of the game. There are three ways to achieve this:&#10;&#10;&#10;     accomplish achievements (nine in total),&#10;     make investments,&#10;     get majorities after the game.&#10;&#10;&#10;Gameplay...&#10;&#10;The game is divided into three phases that are repeated as many times as necessary until one of two conditions endgame is met:&#10;&#10;&#10;     a majority of the players have reached the center of the earth with a drill crew&#10;     a player has completed the nine Achievements.&#10;&#10;&#10;Then the current round is completed before determining the winner.&#10;&#10;Preparation for the turn...&#10;&#10;Each player has two vice presidents he will deploy to act in Phase 1, 2, or 3, in order to perform actions. The order in which the players&rsquo; vice presidents are deployed is determined by a closed-fist auction.&#10;&#10;Phase 1...&#10;&#10;This is the main phase. Players will move their drill crews are at a rate of one per round (there are four rounds before Phase 2). Depending on the position of your vice president, if you deployed him to act in this phase, you can corrupt opposing drill crews (in order to attract them to the same tile as your active drill crew) or hire a subcontractor (to increase your drilling power).&#10;&#10;Each tile of the earth's crust has a value indicating its resistance to drilling. If the sum of the drill crews who are present equals or exceeds this value, the tile is excavated and turned over; then draw an Extraction card to see what resources you discovered, which is evenly split between the players who participated in the drilling. The indivisible remainder goes to one of those players (prioritized by whoever has a mine on the tile, then the player who has the greater drilling power, then the one who triggered the drilling).&#10;&#10;Finally, after the four rounds, the mines laid on drilled tiles provide the resources printed on the back of the tile.&#10;&#10;Phase 2...&#10;&#10;Players with a vice president here can perform market transactions, which is to say that they can buy or sell resources.&#10;&#10;Phase 3...&#10;&#10;In this phase, players can make investments to get renown points and improve their drilling conditions in different ways&hellip;&#10;&#10;&#10;     augment the drill crews&rsquo; power (maximum = 4),&#10;     place mines in the game (maximum three mines),&#10;     improve mine safety (in order to avoid wasting resources at extraction time),&#10;     improve the movement of drill crews.&#10;&#10;&#10;",
        "artist": "Yuio"
    },
    {
        "name": "Karesansui",
        "description": "As Grade Two monastery initiates in Karesansui &ndash; the cutthroat game of Zen gardening &ndash; it will be your great honor to tend the Masters' rock gardens. Each morning the Grade Ones arrive with rocks they've gathered, then haul away the rocks that you don't need anymore &ndash; but there aren't enough Grade One initiates to go around, so there will be competition for the best selection of rocks. The Grade Ones will give their new rocks to whoever gives them the fewest old rocks to haul away.&#10;&#10;Keep in mind while creating your garden, however, that certain combinations of rocks must be avoided! Every afternoon, the Feng Shui Masters come by to check your work. You'll receive demerits for any forbidden combinations &ndash; but you'll also receive demerits for your laziness if you don't add new stones each day, so you must find a balance.&#10;&#10;The Masters' final evaluation will come with no advance warning. The Initiate who has the fewest demerits will advance to Grade Three, while the one with the most demerits will be kicked down to Grade One, joining the others in the daily search for new rocks...&#10;&#10;",
        "artist": "Eric J. Carter"
    },
    {
        "name": "Runicards",
        "description": "English:&#10;Fully produced and developed in Brazil by designer Rovalde Banchieri, Runicards is the result of 1 year of hard work, care, playtest and fun!&#10;&#10;In Runicards the participants play cooperatively with heroes against monsters of the deck, following three adventure cards that tell the players a story.&#10;&#10;It is a simplification of RPG in the form of a card game.&#10;&#10;Runicards was first presented to the public during an event of RPG called Moonfest held in S&atilde;o Paulo (Brazil) in October 2012 and led to queues of people excited about the prototype!&#10;&#10;Runicards is a card game unlike anything that has been done in Brazil! It can be cooperative or competitive. It has rules to adjust the duration and difficulty of the game. Also, everyone plays and has a chance to win until the end!&#10;&#10;Portugu&ecirc;s:&#10;Totalmente produzido e desenvolvido aqui no Brasil pelo designer Rovalde Banchieri, Runicards &eacute; o resultado de 1 ano de muito esfor&ccedil;o, carinho, playtest e divers&atilde;o!&#10;&#10;Em Runicards os participantes jogam cooperativamente com her&oacute;is contra os monstros do baralho, seguindo 3 cartas de aventura que contam uma hist&oacute;ria para os jogadores. &#10;&Eacute; uma simplifica&ccedil;&atilde;o de RPG em forma de card-game.&#10;&#10;O Runicards foi apresentado pela primeira vez ao p&uacute;blico no evento de RPG Moonfest de S&atilde;o Paulo (Brasil), em Outubro de 2012 e gerou filas de pessoas empolgadas com o prot&oacute;tipo!&#10;&#10;Runicards &eacute; um jogo de cartas diferente de tudo que j&aacute; foi feito no Brasil! Ele pode ser cooperativo ou competitivo. Possu&iacute; regras pra ajustar o tempo de dura&ccedil;&atilde;o da partida e a dificuldade do jogo. Al&eacute;m disso, todo mundo joga at&eacute; o final e tem chance de vencer at&eacute; o final!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Dragon Teeth Washer",
        "description": "&quot;Brush the dragon's teeth, you who have the courage!&quot;&#10;&#10;In Dragon Teeth Washer, players are brave men who must brush the teeth of dragons. They take turns brushing the teeth of these fearsome beasts, but dragons can't keep their mouths open all day. Occasionally they get tired, though, and must close their mouths. If one does and you happen to be the unlucky soul brushing that dragon's teeth, then...chomp!&#10;&#10;In each turn, the players must brush the teeth of a different dragon. Different dragons have different patience levels, expressed by a number. One player checks the dragon card, makes a statement about it which can be as vague or outright false as s/he wants, and then plays a brushing card with a number. The other players play their cards face-down and reveal simultaneously then. Starting with the smallest number, then counting up, the players check who was successful, who was bitten (whose card was counted when the dragon ran out of patience) and who didn't get his/her turn at all. Successful players get their card values in points, bitten players get negative points, and the others get nothing.&#10;&#10;After eight rounds, the player with the highest total wins the game.&#10;&#10;",
        "artist": "Tomasz Larek"
    },
    {
        "name": "Mythe",
        "description": "Description from the publisher:&#10;&#10;The peaceful kingdom of Mythe has been unexpectedly raided by the evil red dragon and his monster companions! The red dragon has taken away the golden Sacred Cheese, the symbol of the kingdom's prosperity and unity, and the fate of the kingdom is now in peril. The brave young heroes of Mythe must now set out on a desperate journey to the dragon's castle and recover the Sacred Cheese!&#10;&#10;The players in Mythe, as mice heroes, must travel to the castle of the red dragon, where one of them has to defeat the evil creature and recover the Sacred Cheese. The player who does this wins the game! To progress on their journey, players must draw cards from other players' hands, one by one. When a player has decided that they have taken enough cards, they can decide to advance their hero on the game board. However, if a player draws a Obstacle card, then the hero must stop and deal with the mishap, not moving on that turn.&#10;&#10;When a player finishes their turn (whether they advanced or not), they may then redistribute any of their cards to the other players. To win the game, a hero must have one of the legendary cards &mdash; Shield, Sword, or Fairy &mdash; then move onto the Dragon's space to defeat him and save the Sacred Cheese.&#10;&#10;In the original release &mdash; named &#227;&#131;&#158;&#227;&#130;&#164;&#227;&#130;&#185;, which is Japanese for &quot;mice&quot; &mdash; the mice heroes were trying to save a princess from the dragon.&#10;&#10;",
        "artist": "Yoshihiro Arisawa,Sami Laakso"
    },
    {
        "name": "Tasnia",
        "description": "Tasnia is a resource gathering game that also employs tile laying. Players draw resources to form a hand of 6 cards and they spend these resources (Wood, Stone, Iron, Laborer, Carpenter, Mason, and Gold) to purchase portions of a building. These portions come in the form of tiles that can be used to construct medieval buildings. Completed buildings score players points. Incomplete buildings are worth far less.&#10;&#10;In addition there are also special cards that allow players to perform additional actions. These cards include characters such as the Baron, the Scoundrel, and the Merchant.&#10;&#10;",
        "artist": "Jason Glover"
    },
    {
        "name": "MCS",
        "description": "MCS pits 2 or 4 players against each other in this fast-paced simulation of speedway racing. By using three types of cards - riders, laps and racing - team managers will do the following:&#10;- determine their riders' current forms and on their basis assign given riders to particular races;&#10;- figure out the track properties which will reveal in which straights and bends charging opponents will reap greatest profits;&#10;- race opponents by means of cards currently held in their hands. &#10;Racing is the core of the game and its mechanics depends on where it takes place - in straights or bends. The former uses the upper part of each card, while the latter is played with card colours and symbols in the lower section.&#10;The game finishes after 15 or 20 races (depending on the number of players) after which the manager whose riders accrued the biggest number of points wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Robotech RPG Tactics",
        "description": "Prepare for invasion! Robotech RPG Tactics is a tactical miniatures game set in the Robotech universe. While the 1/285th scale game pieces can be used as a companion to the Robotech RPG, the game system is designed to be played as a tabletop miniatures game. Players build armies of multiple squadrons of mecha to fight it out in scenario-driven, objective-based game play. Take command of the fighting forces of the United Earth Defense Force (UEDF) valiantly defending Earth from alien annihilation &ndash; or lead the massive clone armies of the Zentraedi Armada to recover an alien artifact of immense power and enslave humankind. Depending on the faction, and their choice of mecha, a player's army may include anywhere from two game pieces to as many as you desire! The rules are scalable from small skirmishes to mass combat with hundreds per side.&#10;&#10;Robotech RPG Tactics uses a dynamic turn system. Players trade off activating squadrons during each turn, ensuring that a player never has to sit and wait while his opponent moves and attacks with his entire army. By using alternating activation of squadrons, the game's action unfolds at a fast and furious pace, allowing large scale battles to be easily carried out in a single evening. Each player receives a number of Command Points each turn based on the number of mecha they have on the field, and the quality of their officers. Command Points are spent throughout the turn on maneuvers such as boosted movement, devastating weapon salvos, breakneck dodging counterattacks, and potent special abilities.&#10;&#10;The wide variety of mecha in the boxed game bring to bear the myriad and awesome weapon systems from the Robotech universe to lay waste to your foes. Even the battlefield itself can alter over the course of the game as buildings are leveled by destruction unleashed during the battle.&#10;&#10;",
        "artist": "Elmer Damaso,Oliver Nkweti Lefitte,Chester Ocampo,Brian Snoddy,Charles Walton"
    },
    {
        "name": "Star Trek: Attack Wing",
        "description": "Game description from the publisher:&#10;&#10;Star Trek: Attack Wing is a tactical space combat miniatures game, featuring pre-painted ships from the Star Trek Universe.&#10;&#10;By using the FlightPath maneuver system* (licensed from Fantasy Flight Games), players engage in exploration and combat, traversing sprawling Star Trek space maps made available via an in-store Organized Play program. As commander, players have the ability to customize, upgrade, and assign famous crewmembers to their fleets, which feature ships from the series' prominent empires and forces as well as special stats and abilities, and unique maneuvers on separate Combat Dials.&#10;&#10;Star Trek: Attack Wing is a standalone game which uses the core rule set of FFGs' FlightPath game system with a Star Trek twist, but is not compatible with other FlightPath games from FFG. The FlightPath maneuver system used in Star Trek: Attack Wing is based on the original game design by Jason Little.&#10;&#10;",
        "artist": "Christina Gugliada,Chris Raimo"
    },
    {
        "name": "Belle of the Ball",
        "description": "It is the eve of Carnivale on the magical Victorian isle of Ludobel, and you are all invited to the fantastical festivities!&#10;&#10;In the card game Belle of the Ball, players take on the roles of party hosts, seeking the best mix of guests to make their gala the greatest by the end of the night. In order to ensure that they stay one step ahead of the other hosts, players will have to carefully watch the growing line of guests at the door, inviting those in that seem to share passions with partygoers already inside, all the while handing out their precious stash of Regrets to those who should seek refuge elsewhere. Of course, other hosts may find it advantageous to invite a rejected guest inside just to collect their accumulated Regrets for later use.&#10;&#10;Hosts may also choose to ignore the competition for guests and instead try to earn the favor of&nbsp;the Belle of the Ball herself, whose charms&nbsp;can make or break any party.&#10;&#10;",
        "artist": "Jacqui Davis"
    },
    {
        "name": "Brew Crafters",
        "description": "It's a time of regrowth in the old urban center, and the hippest and best beer crafters have gathered both hops and hopes in building the best brewery in the city. It won't be an easy task, as players compete for precious resources such as malt, yeast, fruit and spices in the local markets, all while managing and optimizing their growing bottling empires.&#10;&#10;In Brew Crafters, players assume management of a local craft brewery, working hard to manage resources, use their workers wisely, and develop their brewing line to create the best local brews. Brew Crafters honors the tradition of classic Eurogames such as Agricola and Puerto Rico, but at its heart beats a unique brewery processing system that must be constantly improved, monitored, and manned in order to keep the beloved beverages rolling off the line. Each brewery has access to a variety of equipment upgrades, local farms, markets, and a plethora of specialty workers, ensuring a high level of replayability and strategic avenues. In addition, each player is studiously working to be first to develop several rotating gold-label specialty recipes that will earn them extra points and prestige at the end of year three when the best local brewer will be honored.&#10;&#10;",
        "artist": "Christopher Kirkman"
    },
    {
        "name": "VivaJava: The Coffee Game: The Dice Game",
        "description": "VivaJava: The Coffee Game: The Dice Game &ndash; or, more simply, VivaJava Dice &ndash; is the successor to the well-received 2012 release of VivaJava: The Coffee Game. As in its predecessor, players of VivaJava Dice take on the roles of employees at the VivaJava CoffeeCo., scouring the globe for the best beans to keep the company on top while keeping themselves one step ahead of the rest of the executives.&#10;&#10;Also as in VivaJava, VivaJava Dice has players making the crucial decision between blending beans and research, but with a quick, new twist. Players must now use the dice in their pool to blend &ndash; using the beans to create a best-seller for quick points, then deciding whether to press their luck in subsequent rounds for bigger points but fewer dice as the blends degrade &ndash; or to research, which involves using their valuable beans to gain an ever-changing variety of dice-manipulating abilities, new ways to score, and paths that lead to aiding a competitor for a later payoff or hindering that competitor for immediate gratification. VivaJava Dice also offers a unique system of cooperative dice-rolling that can help you rise to the top, but at the price of someone else riding your coattails.&#10;&#10;With an astounding mix of plug-and-play research abilities, subtle social play in semi-cooperative mode, and the chance to hog all the glory and blend the best for yourself, VivaJava Dice is all about choice, making each game fast and furiously different.&#10;&#10;",
        "artist": "Christopher Kirkman,Jarek Nocoń"
    },
    {
        "name": "Clockwork Wars",
        "description": "Check out our official Clockwork Wars website:  http://clockworkwarsgame.com/index.html&#10;&#10;Game description from the publisher:&#10;&#10;Clockwork Wars is an epic board game of conquest, discovery, and espionage from Eagle-Gryphon Games. In Clockwork Wars, 2-4 players command a unique race of creatures in a tense war set in an alternate universe where magic and steam-era technology collide. Take control of the human &quot;Purebreeds&quot;, or one of three hybrid races (Troglodytes, Rhinochs, and Mongrels). Your goal is to vanquish your foes and accumulate the most victory points through seven turns of play. You earn points by fighting for control of territories that contain valuable natural resources. To win these battles, you need manpower gained by seizing villages and developing them into cities. Invest in research and discover astonishing new technologies, like magical Golems, an Analytical Engine, and the wondrous Spire of the Gods. Position your troops, research powerful discoveries, employ espionage, and conquer your enemies to win the game!&#10;&#10;Clockwork Wars features:&#10;&#10;&#10;     A modular map composed of hexagonal tiles and nine territory types (including manufactories, sorcerer's towers, and citadels) that allows for infinite replayability.&#10;     Four different races to choose from, each with its own unique units.&#10;     Hidden and simultaneous unit deployment that provides constant tension.&#10;     Short turns packed with tough decisions.&#10;     Simple, diceless combat resolution.&#10;     A card-based espionage system.&#10;     A unique &quot;technology tree&quot; that is different for every game. Research discoveries in one of three different disciplines: Sorcery, Science, and Religion.&#10;     Light civilization-building mechanisms, as players upgrade villages into cities and research discoveries through three successive, historical ages.&#10;     Rules for both &quot;free-for-all&quot; play, as well as an official 2 vs. 2 team variant&#10;&#10;&#10;",
        "artist": "Karim Chakroun,Giorgio De Michele,Wen Juinn,Bob Kehl,Alejandro Lee,Terry Maranda,Grzegorz Pedrycz"
    },
    {
        "name": "Cthulhu Wars",
        "description": "Cthulhu Wars is a strategy boardgame in which the players take the part of alien races and gods taken from the Cthulhu mythos created by H. P. Lovecraft. The game is physically large, and includes sixty-four  figurines of the cultists, monsters, aliens, and Great Old Ones that range in height from approximately 20 mm to nearly 180 mm.&#10;&#10;The game takes place on a map of Earth. Each player takes the part of one of four factions included in the base game. At the start of a turn, players Gather Power, then, during a series of Action Rounds, they spend this Power to accomplish various tasks, such as recruiting Cultists, moving units, engaging in battle, summoning monsters, building Gates, casting spells, and Awakening their Great Old One. When all players run out of Power, the Action phase ends and the next turn begins. Victory is determined by accumulating points on the Doom Track. The first player to 30 is the lone victor *if* he has unlocked all six of spell books.&#10;&#10;Driving the strategy are a player's wish to expand his power base, and his need to accomplish six tasks to acquire his faction's spell books. Each faction has a unique set of monsters, spell books, and special abilities, and has different requirements to acquire its spell books. All factions have multiple strategies open to them.&#10;&#10;The base game supports 2-4 players (the map supports 5 players), but with new factions and maps released as expansions it can support up to 8 players.&#10;&#10;",
        "artist": "Rich Fleider,Richard Luong"
    },
    {
        "name": "Fresco: Big Box",
        "description": "In Fresco, players are master painters, working to restore a fresco in a Renaissance church.&#10;&#10;Each round begins with players deciding what time they would like to wake up for the day. The earlier you wake up, the earlier you will be in turn order, and the better options you will be guaranteed to have. Wake up early too often, however, and your apprentices will become unhappy and stop working as efficiently. They would much rather sleep in!&#10;&#10;Then, players decide their actions for the turn, deploying their apprentice work force to various tasks. You'll need to buy paint, mix paint, work on painting the fresco, raise money by painting portraits (which you'll need to buy the aforementioned paint!), and perhaps even send your apprentices to the opera in order to increase their happiness. Points are scored mostly by painting the fresco, which requires specific combinations of paints, so you'll need to buy and mix your paints wisely, in addition to beating other players to the paints and frescos you would like to paint.&#10;&#10;Fresco: Big Box contains all of the material from the original Fresco game, plus all expansions released through the end of 2012 and the all new 2nd expansion (with modules 8, 9, and 10)! You can play without expansions for a lighter family game, or add in expansions &ndash; whether one, two, or all &ndash; to vary play and to increase the decision-making and difficulty, resulting in a very flexible game with a high replay value.&#10;&#10;",
        "artist": "Oliver Schlemmer"
    },
    {
        "name": "Kaosball: The Fantasy Sport of Total Domination",
        "description": "Game description from the publisher:&#10;&#10;Kaosball is a new kind of fantasy sports game, combining rugby-style passing finesse and first person shooter domination-style scoring. The result is a tense game of skill, bluffing, luck, and lethal brutality like you've never played before!&#10;&#10;Brought to you by acclaimed designer Eric M. Lang, Kaosball uses exciting card-based play mechanisms to put players in the role of a coach, managing their unique, game-altering team from scrimmage to sudden death period to outscore their opponents. Players need to balance scoring and killing their opponents, using powerful cheating effects all the while &ndash; as long as you have the money to pay off the ref. No two matches will play the same!&#10;&#10;Kaosball includes multiple modes of play: traditional head-to-head, partnerships-based alliances, and &quot;Maximum Kaos&quot; three- or four-player mode; 30-60 exhibition games complete with a pregame draft for ringers and team upgrades; and league play with up to eight players and upgrades that stay in place from game to game, creating a unique sense of progression.&#10;&#10;",
        "artist": "Andrea Cofrancesco,Mathieu Harlaut"
    },
    {
        "name": "Kingdom Builder: Big Box",
        "description": "In Kingdom Builder, the players create their own kingdoms by skillfully building their settlements, aiming to earn the most gold at the end of the game.&#10;&#10;Nine different kinds of terrain are on the variable game board, including locations and castles. During his turn, a player plays his terrain card and builds three settlements on three hexes of this kind. If possible, a new settlement must be built next to one of that player&rsquo;s existing settlements. When building next to a location, the player may seize an extra action tile that he may use from his next turn on. These extra actions allow extraordinary actions such as moving your settlements.&#10;&#10;By building next to a castle, the player will earn gold at the end of the game, but the most gold will be earned by meeting the conditions of the three Kingdom Builder cards; these three cards (from a total of ten in the game) specify the conditions that must be met in order to earn the much-desired gold, such as earning gold for your settlements built next to water hexes or having the majority of settlements in a sector of the board.&#10;&#10;Each game, players will use a random set of Kingdom Builder cards, special actions, and terrain sectors to build the map!  Kingdom Builder: Big Box ramps up this variability by including all expansions to date, ensuring you'll never play the same game twice!&#10;&#10;",
        "artist": "Michael Schacht,Oliver Schlemmer"
    },
    {
        "name": "Galaxy Trucker: Anniversary Edition",
        "description": "In a galaxy far, far away... they need sewer systems, too. Corporation Incorporated builds them. Everyone knows their drivers&mdash;the brave men and women who fear no danger and would, if the pay was good enough, even fly through Hell.&#10;&#10;Now you can join them. You will gain access to prefabricated spaceship components cleverly made from sewer pipes. Can you build a space ship durable enough to weather storms of meteors? Armed enough to defend against pirates? Big enough to carry a large crew and valuable cargo? Fast enough to get there first?&#10;&#10;In Galaxy Trucker, players will frantically race to build a space-worthy space ship, simultaneously grabbing tiles from a pile of parts in the center of the table.  Players can add engines, phasers, crew modules, cargo modules, shields, and all sorts of parts to their ship.&#10;&#10;Once players finish building their ships, they launch into space.  One at a time, cards are revealed showing a current event in the flight mission.  You'll encounter good things, such as planets full of goods to load, abandoned space ships to commandeer, and decidedly less good things, such as space pirates and asteroid fields.&#10;&#10;The player best able to survive the rigors of these flights (it's not easy, as your ship will repeatedly be tested in its ability to not fall apart) while also earning the most cash will earn the title of Galaxy Trucker.&#10;&#10;Galaxy Trucker: Anniversary Edition is a special release of Galaxy Trucker which includes all expansions to date.  Experienced galaxy truckers will appreciate the increased difficulty (sometimes bordering on insane!) the expansions can provide, while even less experienced truckers will appreciate the game-to-game variety the expansions afford.&#10;&#10;",
        "artist": "Radim Pech"
    },
    {
        "name": "Fantasy Frontier",
        "description": "Fantasy Frontier is a fantasy board game of airships and exploration for 2 to 4 players with a playing time of 45 to 90 minutes. Each player controls a unique airship with a crew of pioneers. Players manage the actions of these pioneers each turn in an effort to scout the land, gather resources, construct townships, and even battle it out in aerial combat. Creating geographic patterns via tile placement, the players will develop a new world each time they play. Players compete to be the first to score the required number of victory points to win the game. Points are scored by building townships, completing geographic patterns, and fighting their rivals in airship battles!&#10;&#10;Every turn, players must carefully manage the actions of five workers, which can be assigned the following tasks:&#10;&#10;&#10;    Piloting the Airship - Moving their airship token around the board.&#10;    Research &amp; Development - Drawing map cards with geographic patterns and discovering development cards to improve their airships.&#10;    Scouting the Land - Drawing terrain tiles to place on the map to expand the community game board.&#10;    Gathering Resources - Landing the airship and exiting the workers to collect food, wood, stone and gold, with these resources being used to improve the performance of workers and to build townships.&#10;    Construct a Township - Landing the airship and disembarking the workers to build a township, which provides a reoccurring resource stream and is worth victory points.&#10;    Aerial Combat - Engaging in airship battles with other players to slow their progress and potentially score victory points.&#10;    Repair Ship Damage - Repairing the damage taken in battle.&#10;&#10;&#10;Fantasy Frontier is a unique gaming experience, blending a peaceful Euro play-style with the optional take-that element of combat, creating a game unlike any other.&#10;&#10;",
        "artist": "Darrell Louder,Naomi Robinson"
    },
    {
        "name": "Fallen",
        "description": "Fallen is a two-player card and dice game with fast and challenging game play, gorgeous art, and plenty of re-playability all wrapped up in an ever-changing story.&#10;&#10;One player chooses a Hero to delve deep within a dungeon, seeking the ultimate evil that waits below. Play as Seroth the Pit Fighter and fight to win at any cost, Merace the Sorceress and cast devastating spells, or Ranek the Thief striking from the shadows.&#10;&#10;Every Hero comes with a unique character card depicting the hero and the special abilities and proficiencies of that particular character. Each hero also comes with nine unique skills to choose from which are divided into three skill trees catering to a particular proficiency. Ten signature Power cards also come with each hero, giving them special abilities that are themed to their style of play.&#10;&#10;The second player takes on the role of the Dungeon Lord, summoning vile creatures and ancient spells to defeat the Hero. Play as the Archivist of Souls weaving dark spells that plague the hero, the Forge Master, part wizard and part machine, filling the dungeon corridors with horribly augmented monstrosities, or as Krogarn the Ogre king sending your primal horde and spirit magic to hunt down the adventurer.&#10;&#10;Similar to the Hero, the Dungeon Lord has a character card that depicts the chosen form as well as showing the special abilities used by that character. In addition, ten signature Power cards come with each Dungeon Lord that are specific to style of villainy.&#10;&#10;Unique Story cards bring the dungeons of Fallen to life. These cards deliver an immersive dungeon experience for players new to gaming, yet have deeper mechanics to keep even die-hard players on their toes.&#10;&#10;After adventuring through the dungeon, the Hero and Dungeon Lord clash in an epic battle between good and evil. The challenges are fast and furious as cards are played and custom dice are rolled.&#10;&#10;This is the game of Fallen.&#10;&#10;Featuring&#10;&#10;- Play as one of three legendary Heroes OR play as one of three sinister Dungeon Lords&#10;- Custom dice&#10;- Story cards that drive the action&#10;- Customizable Heroes&#10;- A full dungeon experience in 90 minutes&#10;&#10;",
        "artist": "Edward Boberg,Jeff Brown (II),Simon Buckroyd,Joshua Calloway,CubeArt,Giorgio De Michele,Tugsbayar Jamts,Michael Mowat,Zagladko Sergei Petrovich"
    },
    {
        "name": "Small World Designer Edition",
        "description": "Small World's Designer Edition is a spare-no-expense version of Small World the board game; this version of the game is true to Philippe Keyaerts' original wooden prototype.&#10;&#10;The Designer Edition will feature: &#10; - 307 deluxe wooden tokens covering all races from the base game and its Cursed!, Grand Dames and Be Not Afraid expansions + the Lost Tribes&#10; - each race comes in its own individual, lavishly illustrated box&#10; - the banners, special powers and markers that complement the deluxe tokens will all be heat-printed on wood, matching the tokens neatly&#10; - the victory coins will all be distinctive metal coins specially forged for Small World&#10; - the maps will be super-sized copies of Small World's 2-5 player maps, and include a new 6 player map specially designed by Philippe Keyaerts&#10; - the Dragon, the Catapult, the 2 Heroes will all be represented by custom resin miniatures&#10; - the new &quot;Pocket Encyclopedia&quot; from the Kickstarter campaign&#10;&#10;The copy purchased by Kickstarter backers will also include a deluxe wooden version of the 3 new Races &amp; Special Powers in the Kickstarter Backers Bonus Pack as well as an engraved plaque.&#10;&#10;The Designer Edition is a true collector's edition. There was a single production run made, with only a limited number of copies for the retail channel.&#10;&#10;",
        "artist": "Miguel Coimbra,Cyrille Daujean"
    },
    {
        "name": "Pandánte",
        "description": "Pand&aacute;nte is a gambling game played by the Pandas of the Pandalands in the Fantasy Strike universe. In this game, lying is okay. (Humans use the softer term &quot;bluffing&quot;.) You can lie about which abilities you have access to, and you can lie about whether your cards are strong enough to win the pot! And if you win a pot by lying, you gain the favor of a Panda Lord. Be careful, though, because other players can call you out on your lies for fun and profit.&#10;&#10;Each round (called a &quot;gambit&quot;), players try to build the best hand they can from their two private cards and five community cards, similar to gameplay in Texas Hold'em Poker. Over the course of a gambit, players bet several times while making claims about how good their hands are and using abilities to influence the game. Each suit gives access to a different ability and if you don't have the one you need, just lie about it and hope you get away with it.&#10;&#10;You can play Pand&aacute;nte as a social game with a definite win condition and no player elimination, or you can play it as an ongoing gambling game in which players are eliminated when they lose their money, like in Poker. You could even play with real money if you're Panda enough.&#10;&#10;",
        "artist": "Jeannie Lee"
    },
    {
        "name": "Pelican Bay",
        "description": "Welcome to PELICAN BAY!&#10;An exotic island world grows turn by turn under the warm sun &ndash; with water, beaches and tropical forests.&#10;&#10;How to play&#10;By placing tiles we enlarge the exotic paradise step by step. Who enlarges areas skillfully and is able to close as many areas as possible to attract blue pelicans has the best chances of winning.&#10;The sun discs offer interesting blockade possibilities.&#10;&#10;",
        "artist": "Rolf Vogt"
    },
    {
        "name": "De Poorters van Nieuwstad",
        "description": "'De Poorters van Nieuwstad' originated from a unique collaboration between a group of about 3000 gamers and 999Games-lovers. Through the project, called &quot;The Perfect Game&quot;, we have tried to create a perfect game. So, everyone could vote for: the game system, duration of the game, number of players, concept, title and artwork. The gamers decided upon the elements and the basis. On this basis, people could send in games concepts, add from those, Tycho van den Broek emerged as the winner. 999Games has developed the concept and the wishes of the voters into a complete game!&#10;&#10;In this exciting board game, players found a new city. This develops through the construction of new buildings, growing the number of Burghers (&quot;Poorters&quot;) that live there. As prosperity increases, the Burghers replace the surrounding forest wuth green pastures and waving fields of grain. In the city, stately mansions are erected and is worked at the City Hall, the Hospice and other community buildings.&#10;&#10;On your turn, you always choose a character, such as the Lumberjack or the Sheriff. THen, all players can perform this character's action. You get a privilege added to this action. You can earn points by placing buildings and selling much needed food. The game includes different specialists such as the Baker, the Fishmonger and the Tavern. As a result, there are infinitely many strategic options. But the Middle Ages were certainly not free of hazards such as crime, wolves plague and the Black Death, which may appear through the playing of cards. If you are the first to score 30 points, you win the game.&#10;&#10;",
        "artist": "Rogier van de Beek,Tycho van den Broek"
    },
    {
        "name": "Convert",
        "description": "Convert is a two player abstract strategy board game. Two opposing players each have a set of 10 differently shaped wooden blocks that are played on a 4x4 board with alternating black and white squares.&#10;&#10;By manipulating pieces to fit on the board, as well as with each other, players attempt to score rows of four while claiming spaces on the board by converting them to their color.&#10;&#10;When a player's piece completes a row of four squares, that player scores one point. When all pieces are played, or when neither player can play a piece, players add the points they scored during game-play to the amount of squares they have claimed on the board.&#10;&#10;The player with the most points at the end of the game is the winner.&#10;&#10;Microbadges&#10;&#10; Convert fan&#10;&#10;",
        "artist": "Ian Reed"
    },
    {
        "name": "Maximum Throwdown",
        "description": "Maximum Throwdown pits up to six players against one another in a battle royale of card-throwing action.&#10;&#10;Each player has an individual deck of cards, and they take turns throwing the cards onto a shared playing area to try to cover up the icons of opponents' cards while keeping their own icons visible. On each turn, you draw one card from your deck and throw one card &ndash; but if you have the right icons in play, you'll draw more cards, throw more cards, steal cards from opponents and dump them in the gutter, break free of the shared playing space in order to keep from being covered, and &ndash; perhaps most important of all &ndash; score points each turn you have enough visible icons in play. After all the cards have been tossed, whoever has the most points wins!&#10;&#10;",
        "artist": "John Goodenough"
    },
    {
        "name": "Clacks: A Discworld Board Game",
        "description": "Clacks: A Discworld Board Game is based on the &quot;Clacks&quot; semaphore messaging system &mdash; the fastest (non-magical) messaging system on the Discworld &mdash; featured in Sir Terry Pratchett's novel Going Postal.&#10;&#10;Using a semaphore system of shuttered lamps on top of high towers, the Grand Trunk Semaphore Company has revolutionized long-distance communications on the Discworld. Their network of towers covers most of the Unnamed Continent, but now the old postal service is fighting back. Driven by the determination of newly &quot;volunteered&quot; Post Master Moist Von Lipwig, the Ankh-Morpork Post Office has challenged the Clacks operators to a race from Ankh-Morpork to Genua.&#10;&#10;Play against your friends and claim the title of Fastest Clacks Operator on the line, or play together as a team to win the race across&#31; the Discworld and prove that Clacks is here to stay. In more detail, Clacks: A Discworld Board Game contains rules for a player vs. player game, a co-operative race game against the Post Office, and a children's introductory game.&#10;&#10;",
        "artist": "Amber Grundy"
    },
    {
        "name": "High Heavens",
        "description": "High Heavens sets the players in the clouds, fighting for ultimate power above the earth.&#10;&#10;High Heavens is a two player, tactical strategy game played on a hex grid, pitting Norse gods against Greek gods. The game is won when either all 12 gods in an entire pantheon is wiped out, or when Asgard or Mt. Olympus is destroyed. Players draw five cards every turn and then are allowed 3 actions. These actions can include Invoking a god, Moving, Attacking, playing a Divine Power card, using a god's Special Ability or Acquiring a dropped bonus chip. Red chips are stacked under each character to represent that characters health. Modifiers such as Attack Bonus, Armor, or Disabled are also represented by different colored chips. No two gods are alike, and their actions and abilities closely correlate to the mythology they were derived from. The luck of the cards you draw forces you to change your strategy from game to game. There is no reshuffling when you are out of cards, so once a god is dead, they're dead. Game play takes about a half an hour to an hour, depending on the players' skill, luck of the draw and the strategies used.&#10;&#10;Created by award-winning video game industry veteran Ryan Lesser (Guitar Hero, Rock Band, Beatles:Rock Band, Dance Central...), High Heavens is a 2-player, expandable board game that utilizes lessons learned from 15 years of video game creation and a lifetime of playing board games.&#10;&#10;",
        "artist": "Ryan Lesser,Sean Andrew \"Muttonhead\" Murray"
    },
    {
        "name": "Carnival Zombie",
        "description": "The ancient manuscripts talk about a Leviathan, a huge creature lying on the silt bed of the lagoon on whose back the city has its foundations. All manuscripts agree on its eternal sleep and they all tell that the beast will wake up one day, shaking the city from its muddy roots, smashing the vitrified stilts on which the city stands, and crashing it into the seething sea where the monster will rise. The ancients say, however, that there will be signs; it is written that the Venetians will feel the tremors, that they would therefore save themselves from the monster, who will recover his freedom by plunging into the waves a deserted city.&#10;&#10;But there were no signs. What ancients did not know is that the Leviathan is not alive. For centuries, the city lived and prospered on the back of a corpse. That corpse, though, is now awakening &ndash; and with it the dead arise from the lagoon...&#10;&#10;In the cooperative game Carnival Zombie, players lead a group of characters who are fleeing on terra firma from the terror that has emerged from the lagoon of Venice. This group of characters must make its way through hordes of rotting &quot;Infected&quot; to leave the city, and players need to rush as the Leviathan upon which the foundations of Venice were built is awakening. Thus, it's only a matter of time before the city sinks in the dark waters of the lagoon.&#10;&#10;Each game is divided into several nights and days. During the nights, players hide in trenches behind the barricades to resist the attacks of the Infected. During the day, players move through the city, which is shaken by tremors. The Infected are drawn by the groans of the Leviathan in the abyss to help their master free itself from the rotting stilts that nail it to the silt bed.&#10;&#10;Players have several ways to get out of town, but little time to do it &ndash; and their path is hindered by the bosses, the most implacable servants of the Leviathan. If the players do make it out, they can assess their skills &ndash; and set a goal for next time &ndash; by counting the points scored during the game.&#10;&#10;",
        "artist": "Jocularis"
    },
    {
        "name": "Assassin's Creed: Arena",
        "description": "Game description from the publisher:&#10;&#10;In Assassin's Creed: Arena &ndash; based on the Assassin's Creed video game series from Ubisoft &ndash; players compete to uncover the best targets for assassination, but before you can go in for the kill, sometimes you have to deal with pesky guards as well as your opponents. Players will collect cards and treasure, move guards, and hide within the city of Constantinople until they find their time to strike. Combat is handled through cardplay, and the player who best manages his cards will have the best chance at victory.&#10;&#10;At the start of each player's turn, he draws an Event card, which can spawn new targets in the outer city, move guards, or allow you to find a tunnel to another section of the city. Moving guards is a great way to get them away from you and place them near your opponents. Targets cannot be assassinated while a guard is nearby, but fortunately the guards can be dispatched if need be.&#10;&#10;Cards in hand drive the action, but they are also your hit points. If you run out of cards in hand, you die &mdash; but just like in a video game, you will soon respawn at your starting area. Moving and attacking targets (or your fellow players) requires playing cards, so doing too much all at once can be risky. Couple that with trying to avoid the guards and you are in for a tension-filled game of cat-and-mouse. To replenish your hand, complete objectives on your movement cards or hide. Hiding in the outer city is easy and grants you lots of extra cards. When you enter the merchant district or the area around the palace, there just aren&rsquo;t as many places to hide and you will not draw many cards.&#10;&#10;Combat is handled through cardplay. No dice are required, although a six-sided die is included to resolve some guard movement. Do you save your best cards for movement or to go in for the kill? He who risks the most has the chance for the most reward!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Ultimate Werewolf: Inquisition",
        "description": "A terrible thing is happening in a local village: Werewolves are responsible for the deaths of many villagers. Unable to determine who amongst themselves are werewolves, they've called in a group of master inquisitors to help sort out this mess before it's too late. That's where you and your team come in. No stranger to werewolf infestations, you know that the best thing to do is to start lynching suspects.&#10;&#10;You no sooner get started on this project when you discover that there's a problem &ndash; Werewolves have also infiltrated your team of inquisitors! Now you're in a serious pickle: You need to save the village while thwarting the werewolves whom are working alongside you...&#10;&#10;Ultimate Werewolf: Inquisition is a standalone game of deduction, secrets and betrayal with no elimination. Part of the fun is figuring out who the werewolves are on your team, but even then, you've still got to outsmart them!&#10;&#10;More specifically, the humans need to rid the town of werewolves in order to win, while the werewolf players need to eliminate human villagers so that the werewolves can overrun the town. To do this, each round players either use the power of a villager's hut or take two votes from the supply. Each player then places one vote on a resident, and the resident with the most votes against him is lynched, with him and his hut being taken out of play. The werewolf players then secretly choose to kill a resident &ndash; but only one of those chosen by the Grand Inquisitor, a role that passes hands each round. Who will live? Who will die? It's in your hands...&#10;&#10;",
        "artist": "Sanjana Baijnath"
    },
    {
        "name": "You Suck",
        "description": "All your life all you've wanted was to have the best, the biggest, and the most awesome tick collection in the world. With You Suck, that dream is close to becoming a reality.&#10;&#10;Using a suited deck, you and your opponents will play cards onto seven different ticks, each with a unique power. Take advantage of these powers to ensure that you'll match your bid and capture even more ticks. You'll score points for bidding correctly and for capturing special bonus point ticks!&#10;&#10;That's right &ndash; it's a tick-taking game, a close cousin of &quot;trick-taking&quot; games, but oh-so-much better because it has cute ticks. And it's more fun.&#10;&#10;",
        "artist": "Ted Alspach,Dustin Evans"
    },
    {
        "name": "Myth",
        "description": "Myth is a fully co-operative fantasy game. Players take on the role of one of 5 different heroes working together to defeat the Darkness. Each hero has a different skill set which represented by a unique deck of cards. Players spend Action Points by using cards. Once a certain amount of Action Points have been spent the Darkness fights back by activating monster lairs, spawning monster captains and eventually the Boss.&#10;&#10;A complete game in Myth is called a Story. Each Story is played over three Acts. Acts can be played sequentially, or can be split up over three different game sessions.&#10;&#10;Players' avatars within a Story are called Heroes. Myth Heroes are clothed in immense power, able to reave all but the mightiest foes. However, this power must be balanced lest the Darkness take too much notice. Players must weigh their actions against the Threat each will bring, with the consequences of awakening more evil and bringing doom on the party's endeavors. And be careful they must, as the Darkness is formidable and eager to snatch glory from the valiant.&#10;&#10;Heroes are controlled through an intuitive Hero Deck (videos for each Hero can be found in the Game Play Videos section below). Each deck plays uniquely and allows players more freedom of action and the ability to truly impact the Story each and every Act. Yet, cooperation is the key to victory and bloody fortune. Players must communicate, interact, and assist each other or surely the Darkness will cover all.&#10;&#10;Myth is a fully cooperative game. There is no player controlling the Darkness. The Darkness is governed by a set of rules unique to each Boss Deck and is activated through Hero actions. If the Heroes get overzealous, then the Darkness pushes back by activating Lairs, spawning Captains, and punishing the Heroes with devious Events. If the Heroes take a more subtle approach, then the Darkness reacts by reducing the potential for treasure and rewards. Without the treasures and equipment to upgrade, the Heroes will find each Act more difficult and eventually fail. The dynamic nature of the Darkness really lends a more fluid feel to the Story. Players aren't being driven by properties out of their control, nor are they being shepherded by a person whose skill has a direct impact on the enjoyment of the game.&#10;&#10;Myth is a fun fantasy romp where players feel truly heroic. In the playing of the game, the players are creating their own mythos. These stories are the ones carried away from the table, becoming myths themselves. And these are the myths, with friends and family, that we carry with us; telling and retelling our endeavors at the mead benches, earning treasured smiles and laughter.&#10;&#10;",
        "artist": "Keith Lowe"
    }
]