[
    {
        "name": "La Guerra Civil Española (1936)",
        "description": "One of the very first wargames ever published in Spain, along with &quot;Rommel y Montgomery&quot;, &quot;La Segunda Guerra Mundial&quot;  or &quot;La batalla del Ebro&quot;, among others. It was published in 1981. NAC published a second range of games a few years later, including &quot;La Guerra de Espa&#195;&#177;a&quot; (1986), which is a different game about the same conflict.&#10;&#10;Components are: a 64 x 88 cms board, 336 counters (Republican Army, International Brigades, National Army, CTV, Condor Legion, etc), rulebook, one dice and several sheets. As any other NAC game, it&acute;s very easy to play.&#10;La Guerra Civil Espa&#195;&#177;ola (1936) Edici&#195;&#179;n 2009 is a remake of the game made by Spanish fans in 2009 with improved components and art counter and both, the original rules of the game and a completely new, alternative version.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Phase 10 Masters Edition",
        "description": "Two major rule changes from the original Phase 10:&#10;&#10;Players pick a phase at the beginning of each hand based on the cards they have.  Phases can be done in any order.&#10;&#10;One card can be saved each hand to be used in a future hand.&#10;&#10;Original Phase 10 description:&#10;A rummy-type card game where players compete to be the first to finish completing all ten phases. Phases include collecting runs of numbers, collecting certain number of a given color cards, etc. The first player to finish completing the 10th phase wins. In case of ties, the player with the least number of points wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Renaissance",
        "description": "This sequel of &quot;Joan of Arc (Montjoie!)&quot; takes place in Italy. The same basic game mechanic with some new twists.&#10;&#10;",
        "artist": "Bertrand Benoit"
    },
    {
        "name": "Seismic",
        "description": "From the Atlas Games website: &quot;The industrious yet short-sighted Seismic Asphalt &amp; Paving Company -- located in the sleepy town of San Andreas, California -- has put you in charge of one of its many road crews. Your job is to build a network of roadways around San Andreas proper. But San Andreas is rather prone to earthquakes, which have a tendency to destroy the beautiful stretches of pavement you've been laying. After all the asphalt is put down, which road crew will end up connecting the most highway in between quakes?&quot;&#10;&#10;In Seismic, players place hexagonal highway tiles to build long, complete sections of highways, scoring points for each tile as well as bonus points for the ending &quot;intersection&quot; tiles in their routes. Scores aren't tallied until the end of the game, because at any time, earthquakes can occur, destroying tiles along the most-built direction leading out from the central &quot;San Andreas&quot; tile. Players constantly need to be claiming as many long roadways as possible while ensuring that their highways aren't the ones that are going to be destroyed if and when an earthquake occurs.&#10;&#10;",
        "artist": "Steven Sanders"
    },
    {
        "name": "Stalin's War",
        "description": "From Ted Raicer the award-winning designer of Paths of Glory and World War II: Barbarossa to Berlin comes a fresh new look at the most titanic and brutal land campaign ever waged, the war between Hitler's Germany and Stalin's Soviet Union.&#10;&#10;Stalin's War is a unique card-driven, hex-based game, a combination that allows players to experience a broad range of strategic and tactical options as they maneuver their forces across a large hex map that stretches from Berlin to the Urals.&#10;&#10;Stalin's War allows player to recreate WWII's greatest battles of encirclement as Axis Armies and Panzer Corps clash with Soviet Fronts and Armies on a front a thousand miles wide. Simple but effective rules allow you to use your mechanized forces to blitz the enemy's front line and exploit deep into your opponent's rear. Can you as the Soviets survive the slashing Panzer attacks of Operation Barbarossa and Case Blue in 1941 and 1942? Can you as the Axis player stand against the crushing Soviet Deep Battle operations that destroyed Army Group Center in 1944? Stalin's War will test both player's operational skills to the limit.&#10;&#10;But there is more to Stalin's War than directing your forces on the map. Both sides have their own deck of 55 cards, needed to launch offensive operations, mobilize their forces, replace losses, introduce new weapons, and deal with the larger strategic context of a World at War. Card Events include combat leaders, weapons (from German Tiger Tanks to patriotic Soviet mice nibbling the electrical wiring of the panzers), the 1944 Warsaw Uprising, Manstein's Backhand Blow, Stalin's and Hitler's meddling, the Battle of the Bulge, and much more.&#10;&#10;Stalin's War allows players to combine the best of WWII operational play with the strategic depth and tactical chrome of a card driven design. A genuine new look the the most important theater of WWII, this is a game you want to play again and again.&#10;&#10;(Taken from rear of the game box)&#10;&#10;Scenarios &#10;In addition to the full campaign game, a shorter tournament scenario is included that comprises 8 game turns and covers the time period of June 1941 through to Winter 1943.&#10;&#10;Link to Stalin's War page on the GMT Website.&#10;An interview on Boardgame News with Ted Raicer regarding the game.&#10;&#10;",
        "artist": "Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "Race the Wind",
        "description": "Race the Wind, sailing cup, is a game by Ghenos faithfully reproducing a regatta (more than 2 boats) or a match race (2 boats) without cards or dice.&#10;&#10;The race course extends on the longest side of the board, between the downwind gate, bounded by the mark and the Committee boat, and the upwind buoy.&#10;&#10;The length of the course can be changed at will by the competitors. At the beginning the wind blows from the upwind buoy (North) towards the downwind gate (South).&#10;&#10;The boats have to perform 7 electrifying starting moves, exit the downwind gate and sail 3 times upwards and 3 times downwind, moving thanks to the wind, but looking out for falls, gusts and changes of wind direction.&#10;&#10;With a precise game strategy and applying the overlap rules and wind shadows&rsquo; tactics, the best player or players (it is possible to play forming crews) will be the first to cross the finishing line and win the yearned for sailing cup.&#10;&#10;To learn to sail through its simple yet ingenious rules means to get on board, to hoist the sails and maneuver the boat as for real, experiencing a series of exciting and unforgettable challenges.&#10;&#10;The alternative name listed, Velagiochiamo, was a prototype by Saverio Robberto and Domenico Troia, the authors.  Ghenos games acquired the rights of the game and developed Race the Wind.  Velagiochiamo does not exist anymore and the only official version of the game exists as Race the Wind.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Combo King",
        "description": "Choose a card from your hand and then try to complete the dice-roll challenge pictured on it.  Depending on the challenge, you get between one and eight dice to roll. Some challenges are single-player, some allow you to challenge an opponent, and some include every player. Different challenges give you three rolls of the dice, or one, or an unlimited number to attempt your challenge. Various cards let you set dice aside and re-roll the remaining ones--while some cards dictate that you only get a single roll. If the dice don't go your way, you can cash in your chips for an extra roll, an extra turn, or perhaps a new card.  The player that successfully completes their challenges--while wisely using their chips and re-rolls--is crowned the &quot;Combo King.&quot;&#10;&#10;",
        "artist": "Dean MacAdam,Rayhle Design"
    },
    {
        "name": "Zombie Rally",
        "description": "From the publisher:&#10;Unbeknownst to most living humans, zombies enjoy the competitive atmosphere of racing. Frequently shown in movies as masses of undead seeking nourishment, these zombies actually depict a group participating in a no-holds-barred zombie marathon. At other times, it's just another example of humans intruding in a private sporting event at a local graveyard - just a couple of zombies trying to improve themselves by reaching the ghoul-line. After all, what self-respecting zombie doesn't dream of becoming a ghoul?&#10;&#10;Zombie Rally depicts zombies at their competitive best.&#10;&#10;Zombie Rally is a non-collectible card game of zombie foot racing to two to six players ages 10 and up. It includes 54 cards and instructions. You will probably need a pen or pencil and some sort of scrap paper to keep score. Games can last from 15 minutes to an hour, depending on players.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Uglydoll Card Game",
        "description": "From the publishers website:&#10;&#10;Join OX, Wedgehead and the rest of the Uglydolls in their first ever fast-action card game. Turn over cards until you spot three matching Uglys. Then race like an Ice-Bat out of Heck to grab a match before they all get snatched. Claim the most cards and you claim the game. Winning isn't always pretty, but it's always fun!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Thing-a-ma-Bots",
        "description": "From the publishers website:&#10;&#10;Gear up for a memory bender in this fast-playing card game of shouting silliness. Turn over a card and give the robot a name: Melvin, Spaghetti Head, GP-450, or whatever you imagine. When it shows up again, be the first to shout its name and you collect the stack of cards. Spot a robot match? Shout out &quot;Thing-a-ma-BOT&quot; and steal an opponent's stack! Collect the most robots to win the game.&#10;&#10;Thing-a-ma-Bots is an easy-to-learn game starring the silliest robots around. Players of all ages will enjoy making up ridiculous names for the colorful characters. The game helps build creativity and memory skills while inspiring giggles and goofiness.&#10;&#10;",
        "artist": "Lance Lekander"
    },
    {
        "name": "Die Siedler von Catan: Das Kartenspiel – 10th Anniversary Special Edition Tin Box",
        "description": "This limited 10th anniversary special edition tin box includes the base game plus the latest expansion from 2006, K&uuml;nstler &amp; Wohlt&auml;ter (which wasn&acute;t released separately before Essen 2006).&#10;&#10;Also included are a nice victory point counter and plastic miniatures of the mill and the knight.&#10;&#10;If you leave out the plastic inlay, it should be possible to fill in all your Catan - The Card Game expansion cards.&#10;&#10;Since this collector&acute;s item won&acute;t see an international release anytime soon (if ever !), you&acute;ll have to live with the German or Dutch tin box, but could you simply put your own cards into the box of course and that should do the trick ;)&#10;&#10;Belongs to the Catan Series.&#10;&#10;",
        "artist": "Tanja Donner,Franz Vohwinkel"
    },
    {
        "name": "Mad Libs Card Game",
        "description": "Players draw 10 cards that have words written on them. Each card has either a noun, a verb, an adjective, an adverb, or is one of two sorts of &quot;wild&quot; cards. The players' object is to create grammatically correct sentences using the words on their cards. A gin-like mechanic has players discarding and drawing cards so they can create their sentences.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Cephalopod",
        "description": "Cephalopod is a dice game that includes no chance.  The dice comprise the playing pieces.  The goal is to fill a board of various sizes with as many of your dice as possible.  This is complicated by a capturing mechanic that keeps the board in constant flux.  The game ends when the board has been completely filled.  As with most Mark Steere games, draws and ties are not possible in Cephalopod.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Legie",
        "description": "Game goal is to place all personal pieces on the board first. &#10;Pieces have special abilities like better attack, attack on long range, better resistance, etc. Only the last placed piece has effect on board situation.&#10;With good piece placement you should be able to exile enemy's pieces, but beware, they can be right back and exile more your pieces.&#10;To avoid cycling, there is also one neutral piece which is placed on the place of the last exiled piece.&#10;&#10;Additional rules include terrain effects and some scenarios.&#10;&#10;Legie is registered by IAGO.&#10;&#10;Legie can be played online at SmartBlue.&#10;&#10;",
        "artist": "Tomáš Kučerovský,Daniel Pienčák"
    },
    {
        "name": "Vroeger of Later",
        "description": "Learn about the history of the Netherlands.&#10;The person who loses his or her cards first, will win.&#10;When it's your turn you put a card on the right place in the line of history. Or, you say the previous player didn't put the card in the right order. The player of the two who was wrong gets more cards.&#10;&#10;Vroeger of later is the only Dutch game in the Anno Domini series.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Tide of Iron",
        "description": "Tide of Iron was released by Fantasy Flight Games in 2007. &#10;Tide of Iron: Next Wave was released under license by 1A Games in 2014.&#10;&#10;Even though Tide of Iron: Next Wave is essentially a second edition of Tide of Iron, things are a bit confusing here on BGG since the two games have separate Board Game Links.&#10;&#10;For more information about the newer 2014 version of Tide of Iron: Next Wave, you can Click Here.&#10;&#10;&#10;Tide of Iron is a game of World War II tactical conflict for two to four players. The components in this base game allow players to simulate the dramatic struggle that took place between American and German forces in Northern Europe during the years 1944 and 1945.&#10;&#10;Tide of Iron is a scenario-based game, with the available forces, objectives, map, and victory conditions being set by each given scenario. It features loads of plastic figures, including soldiers, equipment, heavy weapons, and combat vehicles, cards, dice, cardboard markers, and modular game boards that will represent the customizable terrain of this scenario-based wargame.&#10;&#10;The twelve double-sided map tiles, plus the dozens of included terrain hexes, allow for limitless potential combinations, and each scenario can be enhanced by special rules, objective markers, troop allotments, and other variations. The only limiting factor is your imagination!&#10;&#10;",
        "artist": "Michael Komarck,Kurt Miller,Scott Nicely,Brian Schomburg"
    },
    {
        "name": "Mutant Chronicles Collectible Miniatures Game",
        "description": "54mm scale science fiction collectible miniatures game released in 2 player starter packs and booster packs.  Mutant Chronicles is set in the far future of our own solar system, where Mega-corporations battle each other as well as a dark invader. Power-armored doom troopers, magic, and monsters mix in this exciting dark future space-fantasy setting.&#10;&#10;On June 27, 2008, Fantasy Flight Games Announced that this game will no longer be released in a blind-purchase format.  On April 9, 2009, Fantasy Flight Games Announced that they will discontinue this game.&#10;&#10;",
        "artist": "Tim Arney-O'Neil,Henning Ludvigsen"
    },
    {
        "name": "StarCraft: The Board Game",
        "description": "Publisher blurb&#10;&#10;Including a total of 180 plastic figures and dozens of unit types, Starcraft: The Board Game features an innovative modular board of varying sizes, which guarantees a new experience each and every game. An exciting card driven combat system allows players to modify and upgrade their faction with a wealth of powerful technologies. Players can unleash a Zergling rush, use powerful Protoss shields to halt an enemy invasion, or even send cloaked Ghosts out to guide nuclear missiles to their target.&#10;&#10;Description&#10;&#10;In StarCraft: The Board Game, players battle for galactic domination on a dynamic board of interconnected planets. Planetary setup is already part of the game - every player gets two planets to place, and will place their starting base on one of them. Planets are connected with direct and &quot;Z-Axis&quot; connections that are placed during setup, but can sometimes later be modified during the game, and movement is only possible within planets and through those connections (by means of purpose-built transports).&#10;&#10;Each player controls a faction out of six, that belongs to one race out of three - Humans, Zerg, and Protoss. Each faction has a unique special victory condition, but all factions can also win through victory points that are gained by controlling special areas on some of the planets. Players build units and base upgrades with the resources they gather from the planetary areas that they control, and gain access to additional unit types through those upgrades.&#10;&#10;Each turn is subdivided into first a planning phase, then an execution phase, and finally a regrouping phase (used for cleanup). In the planning phase, players take turns playing a number of order tokens into stacks on each planet, with orders placed later obstructing the ones that were placed before them. This allows players to set up combos of their own, but also to obstruct plans of other players. In the execution phase then, players take turns again, and when a player's turn comes up he can choose one of his order tokens on top of any stack and execute that one - if all of their orders are obstructed, they skip their action and draw an event card instead. The execution phase isn't over until all players executed all of their orders. Possible orders are Build (used for building both units and buildings), Mobilize (used for moving units and attacking enemies) and Research (see below), and orders can always be Standard Orders or Special Orders, with the special orders having prerequisites but stronger effects.&#10;&#10;Players can also research new technologies and thus improve their combat deck in a precursor to more recent deck building mechanisms. Each player is given a combat deck unique for their race at the start of the game, and when they research new technologies then matching cards are added to that deck. This allows the players to customize what cards they will draw; when the last card of the deck is drawn, the deck is reshuffled. Most cards remain in the combat deck once researched, though some researched technologies add effects that are always in play, while some particularly strong combat cards are discarded after one use.&#10;&#10;&quot;Reimplements&quot;&#10;&#10;     StarCraft (video game)&#10;&#10;&#10;&#10;&#10;",
        "artist": "Kevin Childress,Andrew Navaro,Scott Nicely,Brian Schomburg"
    },
    {
        "name": "Trivial Pursuit: DVD",
        "description": "This Trivial Pursuit DVD Popular Culture edition is all about entertainment, gossip and trends of the modern times. The all-new card game questions cover everything from sporting heroes to fasion icons and mainstread media. The included DVD adds an interactive element to the game.&#10;Features 6 categories - Television, Movies, Music,Sports/Games, Buzz, and Fads.&#10;&#10;This was apparently published only outside the United States, and thus likely has different questions (culture specific) than the US Pop Culture DVD game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "War in the Pacific (second edition)",
        "description": "On Sunday, 7 December 1941, the US naval base at Pearl Harbor, Hawaii, was attacked by Japanese aircraft. For the next four years, Allied task forces engaged elements of the Imperial Japanese fleet throughout the ocean. Marines and army units began their program of island-hopping, wresting from the Japanese the empire that they had expanded in every direction.&#10;&#10;War in the Pacific is a multi-level simulation of the Pacific theater of operations during World War II. The game enables players to recreate the entire course of the war, form the opening Japanese attack on 7 December, 1941 to the climatic Allied assaults in the closing days of 1945. Representing some 30% of the globe, the strategic maps let players move and engage in combat on all levels: air, ground and naval. War in the Pacific is not a simple game; there are a number of rules and concepts that will, at first, be unfamiliar to a majority of players. But playing through smaller map sections and scenarios enables the player to become familiar with the mechanics of the game.&#10;&#10;This is a reprint edition which substantially expanded the original's components.  Components: 7 full size (22 x 34&quot;) strategic maps in full color, new tactical maps with nearly 338 individual islands for new ground units to fight over, 32 die-cut counter sheets, nearly 9,000 counters showing all types of units from the Pacific Theater, rule books, chart books and assorted displays and player aid charts&#10;&#10;The rules have undergone significant change with greatly increased emphasis on detail  in combat while removing the detailed logistics system that was the focus of the old game and replacing it with a command point system modeled after Victory Games' &quot;Pacific War.&quot;&#10;&#10;The order of battle is significantly more detailed. Leaders on many levels (and whose combat performance may be unpredictable), often serve to limit players' ability to affect the outcome of every battle to the Nth degree. A player's assignment of the right task force commander (for the right force at the right time), may spell the difference between a tactical victory and defeat.&#10;&#10;The ground combat system has been completely revised, substituting a step-loss system adapted from VG's &quot;Pacific War.&quot; Pitched battles on islands and atolls are now resolved, including maneuver, on expanded tactical maps in six different scales, rather than simply being abstractly represented in a single hex on the strategic maps.&#10;&#10;War in the Pacific's original air and naval systems are retained, in their essence, albeit with substantial modifications and above all added chrome in combat. Thus the game still feels like the original in those two aspects.&#10;&#10;The game comes with the grand campaign and some small introductory battle scenarios.&#10;&#10;Booklets:&#10;&#10;    Rulebook I (rule 1.0 to 25.0)&#10;    Rulebook II (rule 26.0 to 62.0)&#10;    Scenarios &amp; Campaign reinforcements&#10;    Examples of Play, Optional Rules &amp; Designer's Notes&#10;    Chartbook I&#10;    Chartbook II&#10;&#10;&#10;&#10;&#10;",
        "artist": "Tom Willcockson"
    },
    {
        "name": "Connect6",
        "description": "Connect6 is an abstract strategy game similar to Go-Moku. The game emerged on the internet around 1999 and was presented by the team of Professor I-Chen Wu at the 11th Advances in Computer Games Conference in 2005.&#10;&#10;Two players, Black and White, alternately place two stones of their own color, black and white respectively, on empty intersections of a Go-like board, except for that Black (the first player) places one stone only for the first move. The one who gets six consecutive stones first (horizontally, vertically or diagonally) of his or her own wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Feed the Kitty",
        "description": "From the Gamewright website:&#10;&#10;Roll the dice but don't lose your mice! In this fast moving game, try to keep your mice away from the kitty. Roll an arrow and pass one to the left. Roll a sleeping cat and you're lucky to squeak by. But roll a bowl and it's dinner time for kitty! The last player left with mice wins.&#10;&#10;Feed the Kitty is as simple as a cat&rsquo;s life. Mice are on the menu, and as they move from place to place, it&rsquo;s anyone&rsquo;s guess who will end up hungry and who will get to have a full belly. Will you be caught catnapping or will you pounce into the lead? The answer is all in the roll of the dice!&#10;&#10;Ages 4 and up, no reading required.&#10;&#10;",
        "artist": "Russell Benfanti,Catherine Jean DeMello"
    },
    {
        "name": "Luck of the Draw",
        "description": "From the Gamewright website:&#10;&#10;Think you're the next Picasso? Can&rsquo;t draw a stick figure to save your life? No matter the answer, you will have a blast playing this off-the-wall party game where you don't have to be the best artist to win. Pick a card and scramble to scribble a mini masterpiece in 45 seconds. Then, vote on whose drawing best fits one of over 100 creative categories. Will your picture be the squiggliest? The ugliest? The most likely to hang on a refrigerator? Win the most votes and you've got the Luck of the Draw!&#10;&#10;Ages 10 and up.&#10;&#10;",
        "artist": "Bill Ledger"
    },
    {
        "name": "Zeus on the Loose",
        "description": "From Gamewright website:&#10;&#10;Catch Zeus if you can! The great Greek god has bolted from Mount Olympus and it&rsquo;s up to you to nab this dashing deity. Play cards strategically, adding numbers as you climb up the mythic mountain. Grab Zeus when the total reaches a multiple of 10. Better yet, summon the strength of Apollo, Poseidon, or all-powerful Hera to bring Zeus within your grasp. Reach the top of Mount Olympus with Zeus in hand and you&rsquo;re a mortal among the gods. To play is human. To win, divine!&#10;&#10;Did you know that, in addition to their supreme powers, the Greek gods were endowed with the special ability to change the course of card games? Well, at least that&rsquo;s the case in Zeus on the Loose! As you figure out how to harness the strengths of the various gods within, you&rsquo;ll sharpen strategic thinking along with valuable addition and subtraction skills. A quick warning about Hera: Though she may be the most powerful goddess in the game, don&rsquo;t get on her bad side or else she might wind up helping an opponent steal Zeus and win!&#10;&#10;Ages 8 and up.&#10;&#10;",
        "artist": "Tom Breitenfeldt,Klemens Franz,Oliver Freudenreich,Gary Locke,Barbara Scholz"
    },
    {
        "name": "Fields of Fire",
        "description": "From publisher's website:&#10;&#10;Fields of Fire is a solitaire game of commanding a rifle company between World War II and Present Day. The game is different from many tactical games in that it is diceless and card based. There are two decks used to play. The Terrain Deck is based on a specific region and is used to build a map for the various missions your company must perform. The Action deck serves many purposes in controlling combat, command and control, various activity attempts. The units of the company are counters representing headquarters elements, squads, weapons teams, forward observers, individual vehicles or helicopters. A single game is a mission and several missions from a historical campaign are strung together for the player to manage experience and replacements. A mission can be played in about 1 &ndash; 4 hours.&#10;&#10;This game is based on three actual campaigns experienced by units of the 9th US Infantry (Regiment) in World War II, Korea, and Vietnam. &ldquo;Keep Up the Fire&rdquo; is the motto of the 9th Infantry (Regiment), known as the &ldquo;Manchus&rdquo; for their service in the Boxer Rebellion.&#10;&#10;",
        "artist": "Donal Hegarty,Rodger B. MacGowan"
    },
    {
        "name": "Pictureka!",
        "description": "From the designer &amp; publisher:&#10;&#10;Pictureka! is a new kind of game, both in mechanic as in artwork. The mechanic is invigorating with its large square gaming tiles. The game board is composed of 3 by 3 game tiles, so the game board on which is played is a huge square of 63 cm x 63 cm. This is large enough for several players to be able to play the game at the same time. The game board is &ldquo;alive&rdquo;, it is not a static board as the tiles are flipped over, turned and moved. So it is not possible to memory map the board. The mechanic of an ever changing board makes it not only fun; also the challenge is kept into the game all the time.&#10;&#10;A game turn &#10;Players will have to throw a color dice at the beginning of their turn. According to the color thrown (3 possibilities) they must draw a mission card of the same color. There are 3 kinds of missions.&#10;&#10;How to win the game? &#10;Be the first one to have successfully accomplished 10 missions. Each successful mission gives 1 point, so be the first one to get 10 points. &#10;The artwork is something not to be found in &lsquo;standard&rsquo; games. The personal drawing style of the artist Eugene makes this a kind of playing artwork.&#10;&#10;Components&#10;&#10;9  game tiles&#10;1  die (6-sided - standard d6)&#10;1  color die (6-sided - 2 red, 2 green, 2 blue)&#10;55 mission cards&#10;1  sand timer (30 Seconds)&#10;&#10;",
        "artist": "Eugene and Louise (Art Studio)"
    },
    {
        "name": "Dreamblade",
        "description": "From the publishers website:&#10;&#10;In the near future, specially trained psychics called dream lords venture deep into the dreamscape. Here they explore a shifting landscape of ancient archetypes, modern terrors, and mismatched elements of the waking world. This is the shared unconsciousness of humanity, the boundless well of hopes and fears that makes us human. The reality they create in this timeless realm reverberates through the minds of dreamers everywhere. Some dream lords seek to protect it, others to dominate it, and others to destroy it.&#10;&#10;The Dreamblade collectible miniatures game allows you to project your mind into the dreamscape and wage war against an endless sea of rivals. Draw upon psychic energies to create formidable creatures that you control in battle. Confront your opponents, destroy their creations and drive them from the dreamscape!&#10;&#10;Current status : The game has been discontinued as of October 2007, no more new sets will be produced.&#10;&#10;Released Sets:&#10;&#10;Base Set - 96 miniatures&#10;Baxar's War - 60 miniatures&#10;Chrysotic Plague - 60 miniatures&#10;Anvilborn - 60 miniatures&#10;Night Fusion - 60 miniatures&#10;&#10;",
        "artist": "Christopher Burdett,Dan Colavito,Stacy Longstreet,Shauna Wolf Narciso,Scott Okumura,Peter Whitley"
    },
    {
        "name": "Naruto Collectible Card Game",
        "description": "A new CCG based on the extremely popular anime show Naruto.  The game has been released in Japan for a little while now and is making its American debut due to the success of the show. The use of Ninja, Jutsu, and themed Mission cards stay true to the mood of the anime.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Card Football: Premiere Edition",
        "description": "Card Football is a playing card-based board game which follows the basic rules of American football. Players battle to win the down by playing the strongest hand.&#10;&#10;Game play combines elements of classic playing card games to simulate the action on the field. Players must decide how best to play their cards. For instance, cards can be played individually, in pairs, two pair, three-of-a-kind, or five-card poker-style 'Power Hands'. Much like a football coach deciding what play to call, or the quarterback choosing his best option, players must decide whether to play strong card(s) immediately, or to hold back in hopes of using it to put together a stronger hand.&#10;&#10;Other elements of Card Football include team and player chips, game board, a score board, a referee/yard marker and dice that are used for fumble, field goal and injury situations.&#10;&#10;Card Football allows for one, two, three and four-player modes. The single-player game mode is set up so that an individual can take on 'the system' and pick up the basics of the game before challenging friends in an all-out gridiron battle. In addition, the learning curve with Card Football is remarkably low. Typically, the game is learned in two to five minutes, or after a few series of downs.&#10;&#10;If it happens on the field, you'll find it in Card Football. From field goals, punts and extra points, to fumbles, interceptions and last-second heroics, you get it all in four quarters of Card Football action.&#10;&#10;",
        "artist": "Matthew Wellman"
    },
    {
        "name": "Justinian",
        "description": "In Justinian the players try to win the favor of Emperor Justinian. To further their aims and to strengthen their position at court, they bribe influential persons at Justinian&acute;s court.&#10;These bribes are represented by four different colors in the game: At the end of each game turn one color is scored. The players get victory points if their court followers have increased their clout at court. However, only three of the four colors in Justinian are scored!&#10;&#10;Game Microbadges:  (Buy One)&#10;&#10;Designer Leo Colovini Microbadges:   (Buy One)&#10;&#10;",
        "artist": "Harald Lieske"
    },
    {
        "name": "All is lost save Honour",
        "description": "from Europa Simulazioni website:&#10;&#10;&ldquo;All is lost save Honour&rdquo; is a game about the campaigns fought during the Italian Wars (1494-1530), mainly between the Hapsburgs (the Empire) and the Valois (the French kingdom). The first volume is devoted to campaigns between Agnadello (1509) and Pavia (1525)&#10;&#10;All began after reading Taylor&rsquo;s &ldquo;The Art of War in Italy 1494-1529&rdquo;, London, 1920. Soon that period looked extremely interesting to us and nearly neglected by the wargame community.&#10;Our intent was to generate any interest, among &ldquo;aficionados&rdquo; and historians, about that ancient era, when the first applications of modern strategy in the art of war took place.&#10;&#10;This is the time of charges of cavalrymen with the finest gliding armors; of the first use of fire arms and artillery (with some effect); sieges, mercenary troops, treachery, pillaging and all that &ldquo;chrome&rdquo; that may enlighten a wargame.&#10;&#10;Those campaigns were led to bring to &ldquo;the battle&rdquo;, which was often decisive, we decided to bring in a detailed sequence of the main battle (said &ldquo;Major Battle&rdquo;). So in the game, there are three kinds of battle: Major Battle, Skirmish and Siege with the Major Battle involving different tactics played by each side.&#10;&#10;The map represents Lombardy in the XVIth century and the neighbors states. The sources for the maps were new books and old manuscripts and maps, among which a manuscript dated 1520 (!), regarding the state of the roads in the area between Lodi and Piacenza.&#10;Many books have been written about this subject and I think we have read the most important ones.&#10;&#10;We had to make a selection of all those campaigns fought in Italy during the Italian Wars. The five campaigns we have included are:&#10;- Agnadello 1509, Venice defends its Republic against the foes. &#10;- Novara 1513, the Swiss against the French army. The last triumph of the Swiss.&#10;- Marignano 1515, Fran&ccedil;ois I grabs the Duchy of Milan from the Swiss&#10;- Bicocca 1522, the French lose the Duchy of Milan&#10;- Pavia 1525, Fran&ccedil;ois I loses the largest battle and Milan to the Empire&#10;&#10;Game Highlights:&#10;&#10;     new game system, operational-level, devoted to warfare in the XVIth century campaigns&#10;     highly interactive sequence of play, focused on maneuver and careful planning&#10;     various forms of combat: Major Battles, Skirmishes, Sieges&#10;     set of Exclusive Rules and specific rules and events for each campaign&#10;     a 22&quot; x 34&quot; fine-art map , reproducing a part of XVIth northern Italy, based on an accurate study of ancient maps and sources&#10;     gorgeous iconic counters representing all the main Capitani who fought there and the different combat units&#10;     detailed (as it is possible) order of battle, with combat units differentiated by strength, maximum movement, quality and reliability&#10;     very low counter density and limited play time&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Exxit",
        "description": "From a minimal board made up of four hexagonal flagstones, the players must extend their territory by gaining new flagstones.  For that, they each use eight pawns and try to make leave the unfavourable pawns the board in order to imprison them to later release them.  Exxit deploys a simple and original mechanism:  the distribution, which creates astonishingly complex tactical and strategic situations.&#10;&#10;A winner of the 2004 Concours International de Cr&#195;&#169;ateurs de Jeux de Soci&#195;&#169;t&#195;&#169;.&#10;&#10;Online Play&#10;&#10;&#10;     Boardspace.net (real-time, AI option)&#10;     Bo&#195;&#174;te &#195;&#160; jeux (turn-based)&#10;&#10;&#10;",
        "artist": "Néstor Romeral Andrés"
    },
    {
        "name": "Munchkin Impossible",
        "description": "&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Publisher's Description&#10;&#10;The Munchkins are now spies... eliminating the opposition, playing with self-destructing gadgets, and changing loyalties even faster than they change hats.&#10;&#10;Be a Playboy, Tourist, or Assassin. Report to the Americans, Russians, British, or Chinese (it'll change!). Wield gadgets from the subtle Cigarette Dart Gun to the amazingly unsubtle Bazooka with Incendiary Ammo. Eliminate foes, from the pathetic Defective Defector, through the Interro-Gator and the Not So Secret Police, up to the mighty Super Spy himself. And (all together now)... 'Take Their Stuff!'&#10;&#10;You can play Munchkin Impossible by itself, or combine it with any number of other Munchkin games for more shameless silliness.&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Other&#10;&#10;Part of the Munchkin series.&#10;&#10;Munchkin is a satirical card game based on the clich&eacute;s and oddities of Dungeons and Dragons and other role-playing games. Each player starts at level 1 and the winner is the first player to reach level 10. Players can acquire familiar D&amp;D style character classes during the game which determine to some extent the cards they can play.&#10;&#10;There are two types of cards - treasure and encounters. Each turn the current players 'kicks down the door' - drawing an encounter card from the deck. Usually this will involve battling a monster. Monsters have their own levels and players must try and overcome it using the levels, weapons and powers they have acquired during the game or run away. Other players can chose to help the player or hinder by adding extra monsters to the encounter. Defeating a monster will usually result in drawing treasure cards and acquiring levels. Being defeated by a monster results in &quot;bad stuff&quot; which usually involves losing levels and treasure.&#10;&#10;",
        "artist": "John Kovalic"
    },
    {
        "name": "Play Nine",
        "description": "Play Nine is the new card game of golf designed for 2 - 6 players, ages 8 to adult. The object is to shoot the lowest score. After nine holes, the lowest score wins. Card values range from -5 (hole-in-one) to 12 (out of bounds). Golfers and non-golfers alike enjoy Play Nine. The combination of strategy and luck-of-the-draw keeps the fun and challenge alive down to the last hole. Play Nine, the card game of golf, is easy to learn and fun to play so - Let's Play Nine!&#10;&#10;From publisher-&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Mona Lisa Mysteries",
        "description": "(from the web site)&#10;&#10;Do You Have Da Vinci's Masterpiece? Based on the real events from 1911 when the Mona Lisa was stolen from the Louvre. Players act as wealthy art collectors who bid on the services of art &quot;experts&quot; to rate their copy of the Mona Lisa. Through careful strategy and market manipulation, the player with the highest valued Mona Lisa at the end of the game has the &quot;real&quot; Mona Lisa and wins the game.&#10;&#10;Ages:  Teen to adult&#10;Players: 3 to 5&#10;Contents: 5 Mona Lisa player painting boards, 44 expert cards, 56 bid cards, 60 gems, gem bag, value board, card tray and rules.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Risk: 40th Anniversary Collector's Edition",
        "description": "This 40th anniversary collector's edition was published in 1999 to mark the fortieth anniversary of the original game of Risk. Parker Bros describe it as a &quot;deluxe&quot; anniversary edition. It includes a redrawn world map and each gameboard carries a unique number denoting the &quot;limited edition&quot; status of each set. The &quot;battle dice&quot; are a special edition and the armies are die cast miniatures, each army being provided with a drawstring pouch for storage. Each set carries a special certificate of authenticity and there is little doubt that many sets have been purchased as collectors' items rather than for ordinary play.&#10;&#10;Re-Implements:&#10;&#10;    Risk&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Shoot Out",
        "description": "This Knizia 2 player game was originally released in issue 17 of Games Unplugged magazine in June 2002.  Shoot Out was re-released in February of 2012 as a bonus item in the DVD Going Cardboard: A Board Game Documentary.&#10;&#10;It is high noon in Silver City, Texas.&#10;&#10;Your opponent faces you on the other side of the street. Deadly Silence. Step by Step you edge closer towards your foe.  Your hand wavers above your gun-belt.&#10;&#10;The game plays from duel to duel until one player picks up cards with a total value of 14 or more.  On each turn a player may move(closer to his opponent) or shoot(you have 2 guns: a colt and winchester rifle).  Optionally either player may choose to end the duel and retreat(picking up more ammo).&#10;&#10;",
        "artist": "Kazutoshi Hina,Rick Schmitz"
    },
    {
        "name": "Guatemala Café",
        "description": "A game about coffee planting and selling in Guatemala. The game uses two boards, representing plantations and markets. Players try to produce different kinds of coffee to ship to Europe. The market overseer decides where and if players can buy roads, huts, workers or ships or if scoring takes place. The scoring track also has a marker on it which moves ahead. The game ends when a player caught up with the marker on the scoring track.&#10;&#10;",
        "artist": "Matthias Catrein"
    },
    {
        "name": "Dragons of Kir",
        "description": "Dragons of Kir is an exciting, fast-paced, two-player strategy board game. The object of the game is to strategically place tiles that deflect one of the four constantly moving dragons into your opponent's war tent while defending your own.&#10;&#10;Colorful tiles, representing the forces of nature and the forces of man, interact with the dragons and influence their movement. Clever tile play creates an ever-changing landscape where opposite edges of the board connect.&#10;&#10;As quickly as one marauding dragon is deflected another may threaten you. Players must balance both offense and defense in order to succeed.&#10;&#10;The game play is quick and offers a different experience each time you sit down to play.&#10;&#10;Dragons of Kir is a themed version of Darter, which won the 2006 Origins Vanguard&#10;Innovative Game Award at Gama, with some new tiles and different rules.&#10;&#10;4 Player Wood Expansion Set adds rules for 3 and 4 players, wood dragons&#10; and war tents, and introduces the dragon token.&#10;&#10;Re-implements:&#10;&#10;    Darter&#10;&#10;&#10;&#10;&#10;",
        "artist": "Jonathan Stroh"
    },
    {
        "name": "Planet Steam",
        "description": "Welcome, dear Imperialists. It's the year 2415. The interplanetary federation (IPF) has done a great job in the last centuries. All necessary precautions have been taken to conquer this planet named &quot;Steam&quot;. The core of the planet consists of a 6,500&ordm; Celsius hot source containing different resources, including water. It has taken over one hundred years to complete the first block of 42 shafts from the surface to the core.&#10;&#10;But now the time has come. From every shaft surges the hot steam that is the basis of the production of raw materials. To be able to use and process this steam, platforms have to be placed over the shafts. Later, we can use the platforms to connect the water purification tanks. By using several tank extractors, we can harvest other resources like energy, ore, and quartz from the steam. These resources are important. You will need them to grow your steam empires. You will need to increase the capacity of your landing craft to transport your harvested materials off planet. Buy and sell the resources at the Trading terminal for profit, as currency is &ndash; like on earth &ndash; always in short supply on Steam. To help you in your endeavours, the IPF has placed several specialists at your command &ndash; but getting the specialist that you require may not be easy.&#10;&#10;Planet Steam is a board game in which two to five players take the roles of entrepreneurs in a steampunk boomtown, racing to assemble equipment, claim plots of land, extract resources, and accumulate riches. After harvesting resources using tanks and converters, players must buy and sell those resources in a volatile and ever-shifting market. The one who earns the most income will, in the end, be victorious. However, only through shrewd resource management and clever manipulation of supply and demand can a player reign supreme!&#10;&#10;",
        "artist": "Czarnè"
    },
    {
        "name": "Drakon (third edition)",
        "description": "The old dragon Drakon has captured a brave band of adventurers who have sneaked into her lair to steal her gold. But rather than eat them immediately, Drakon has decided to make it a game: Greed shall set one of the adventurers free. She sends the frightened adventurers into her magical, mad vaulted chambers, and the first one to collect ten gold from Drakon&rsquo;s maze gets to go free. The rest get to be lunch.&#10;&#10;Each turn, players must choose one of two options: (1) place a tile from their hand onto the board, expanding the dungeon; or (2) move their Hero to an adjacent tile. Many of the dungeon tiles have an icon that allows players entering that space to take a special action (for example, taking a piece of gold from the dragon's hoard, stealing gold from another player, or destroying a tile that is already in play).&#10;&#10;This is the third edition of Drakon, and includes the following updates:&#10;&#10;    plastic miniatures are used for the heroes and the Drakon&#10;    new tiles are larger (measuring 2.5 by 2.5 inches) and have all new artwork&#10;    tiles include a combination of rooms from Drakon (second edition) and Drakon Expansion 1&#10;    new rules, variants, and player aids are provided&#10;    each gold piece now has a value between 1 and 3&#10;&#10;&#10;&#10;&#10;In the basic game, the first player to earn 10 gold wins the game. Some variants provide different winning conditions.&#10;&#10;Game last between 20 and 60 minutes.&#10;&#10;",
        "artist": "Andrew Navaro,Brian Schomburg"
    },
    {
        "name": "Mag·Blast (Third Edition)",
        "description": "Game description from the publisher:&#10;&#10;The art of renowned cartoonist John Kovalic, coupled with the hilarious &quot;Make a Silly Noise or Miss!&quot; Blast Targeting System, makes Mag&middot;Blast (Third Edition) the perfect card game for two to eight players, ages ten and up. This edition retains all of the fast-paced fun and powerful ships of the previous editions, and it includes eight new flagships, seven ship types, twenty action card types (including fighters and bombers), and three blast card types...including the famous Mag&bull;Blast!&#10;&#10;",
        "artist": "John Kovalic,Scott Nicely,Brian Schomburg"
    },
    {
        "name": "The Da Vinci Code Board Game: The Quest for the Truth",
        "description": "This is a new game inspired by the bestselling novel of the same name and licensed by the film company that is making the movie based on the Da Vinci code book. The game includes 15 different mysteries for players to solve and uses some clever tools that players must employ to solve the mysteries. An instructional DVD that explains the game and shows an example mystery being solved is also included.&#10;&#10;There are 2 phases to the game. In the first phase players roll and move their pieces around the board to visit various sites to look at clue cards so they can figure out the mystery phrase first. Each of these clues require a different mechanism to solve. Some use a mirror to reverse the letters, some use a decoder box that is laid over the card in a certain way to reveal part of the mystery phrase, some cards you line up against a special decoder tool, and some are just riddles or puzzles to solve. Some clues will also require the player to do to the center of the board and visit the library to retrieve a card there with information that will help them solve their clue. Alternately, players might need to visit the Louvre and examine a painting there. When the players visit the Louvre the players only have 30 seconds to find the correct card with the painting that relates to their clue, examine the painting and the information on the card about the painting and hopefully discover the information they need to solve their current clue.&#10;&#10;Players can also discover one of two special types of cards: Taxis which let the player move around board quicker and a computer card that lets you look at another player's notes for 30 seconds.&#10;&#10;Once one player thinks they have solved the Mystery Phrase they go to the center of the board and announce the answer. If they are right then all players score 1 point for each letter (and blank space) they had correct in the Mystery Phrase. The player that got the Mystery Phrase correct gets 5 bonus points.&#10;&#10;This begins Phase 2 of the game as 5 questions are now read from the mystery book. These questions relate to the clues that the players discovered during the game. Each question a player gets right is worth 5 points. If a player gets all 5 questions correct they score another 5 points.&#10;&#10;Players lose points for any Taxi or Computer cards they had left in their hand at the end of the game.&#10;&#10;The player with the highest score wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Gravediggers",
        "description": "Bank&uuml;berfall description: The bank directors want to have more excitement in their lives. So they decide to rob their own banks. &#10;As one of those bank directors, the player can speculate with money transfers, distract policemen with a beautiful women, spy and intrigue against each other.&#10;&#10;Gravediggers description: this game is the 2007 Twilight Creations edition of the same game with a different theme: here gravediggers are competing in robbing graves. Here the special caracters are beautiful women, guards, attendants and bandits (4 of each as the character and card distribution, just like the rules are exactly the same in the two games).&#10;&#10;",
        "artist": "Miguel Coimbra,Arthur Wagner"
    },
    {
        "name": "Game of Games",
        "description": "Slightly higher gaming style than roll and move, players compete in several (14) mini physical games on the main board. These then give scores that allow the pawn to move around the board. Winning is just a first across the line after one circuit.&#10;&#10;Games include - Bar skittles, Bowling, Pool, Shove Ha'penny, Ring Toss, Golf, Word Rummy, Spell 10 and others.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Expedition Altiplano",
        "description": "This is a game for two treasure hunters in ancient Inca ruins. You are both looking for the same relics. But first you put together your exploration team out of archaeologists and soldiers of fortune by drafting cards from the central pile.&#10;During the game you can poach staff members off your adversary or salvage a staffer from deadly traps.&#10;You do all this to meet the required conditions to find those rare treasures. And because they're rare you'd better not miss them.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Clue DVD Game",
        "description": "From the box:&#10;&#10;The usual suspects are wreaking havoc at Tudor Mansion, and Scotland Yard needs your help!  Can you crack these challenging interactive cases, plus unlimited others in the special bonus game?&#10;&#10;The DVD brings you inside Tudor Mansion where Inspector Brown is waiting with information on events of the day.  Ashe the Butler is also there, ready to share some clues of his own.  Remember to stay alert!  You never know what you'll find in a room or run across in a Secret Passage.  Like classic Clue, you'll make Suggestions, but in Clue DVD your Accusations are made secretly using the DVD.  And keep that Red Reader close at hand... there are secrets in these cases and information you'll need to decipher.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Wayfinder",
        "description": "Wayfinder is about four Polynesian tribes who, while voyaging, got mixed up among a group of islands.  Each player plays a Wayfinder (navigator-priest).  The goal for the  Wayfinder is to go on a series of voyages to unite the people of the tribes and form villages.&#10;&#10;On the player's turn, the player must execute a voyage where the wayfinder is located - picking up all the residents of that space and voyaging (mancala like) placing one tribesman on each spot along the way.&#10;&#10;You get points for creating villages (exactly 5 men of one color in a space) - but more points for villages of your own color.  Huts mark created villages - which is used in end game scoring.&#10;&#10;There is a real time part of the game play.  That is, when it's not your turn, you must race to place your Wayfinder to mark the beginning of your next voyage  before the beginning of your next turn.&#10;&#10;The game ends when there are no more moves possible. The player with the highest score wins.&#10;&#10;",
        "artist": "Benjamin Corliss"
    },
    {
        "name": "Gold Thief",
        "description": "Each player has a pool of gold, which everyone else wants to steal. Players have a secret goal of how much gold they need in their pool to win. Playing cards on other players moves gold and cards around, or blocks those actions. A player wins a round by starting their turn with their target amount of gold. The first player to win three rounds wins the game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "\"Oh My God! There's An Axe In My Head.\" The Game of International Diplomacy ",
        "description": "Geneva, 1920: The League of Nations convenes for the first time. Proud to be the host for this august world body, Switzerland invites its champion axe-juggling troupe, &quot;Les Bella Lieben Jolie De Von Giorno&quot;, to entertain the assembled delegates. Unfortunately, halfway through the demonstration, the Troupe goes insane and begins hurling axes into the audience, splitting head after head. The Secretary General calls for calm, but before he can order a recess, his cranium is split as well.&#10;&#10;In &quot;Oh My God! There's An Axe In My Head.&quot; The Game of International Diplomacy, the remaining Great Powers use the confusion to pass the gavel between themselves, conduct international business amidst the chaos, and generally try to shift the balance of world power while escaping a bunch of armed psychopaths.&#10;&#10;",
        "artist": "Chris Adams,David Fooden"
    },
    {
        "name": "Carrousel",
        "description": "Carrousel is a game without turns. The board shows a carrousel with seven spaces in a circle. Placed on this (on five adjacent spaces) are five different-colored horses. The game also contains a deck of cards, each showing three horses in different colors.&#10;&#10;At the start of the game, each player is dealt nine cards and lays them out in front of herself. The object is then to make the three horses at the front of the carrousel be in the same order as on one of one's cards. When this happens, you get a point for that card (put it upside-down in a private score pile) and get to draw a new one.&#10;&#10;There are a number of legal moves to make, like swapping the places of two horses, placing the last one first and so on. To score a card, you must perform a move to make the first three horses match one of your cards. If you make a move and they don't fit, you lose one point. If you're not fast enough, someone else will move something, messing up your plans.&#10;&#10;The game has been illustrated by St&#195;&#169;phane Poinsot.&#10;&#10;From the publisher's website:&#10;&#10;Here's a strange merry go round!  Its wooden horses, joking and mocking, have come to life and nothing can stop them for turning in any direction!  If you want to ride, you'll have to catch them!&#10;&#10;To play Carrousel, you don't have to be a knight, jockey or a cossack.  A little speed and observation will do.  Find the right color combinations and move your horses quickly before your opponents do it for you!&#10;&#10;Carrousel is a game of speed and observation by Max Gerchambeaux who, when he's not cooking one of the best cassoulets in Paris in his restaurant, invents smart games for the whole family!&#10;&#10;",
        "artist": "Stéphane Poinsot"
    },
    {
        "name": "Skybridge",
        "description": "Players try to build the best buildings and take over the city.&#10;&#10;Game contains a wooden board and 44 wooden playing pieces.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Doodle Dice",
        "description": "From Publisher: Create a doodle with a few rolls of the Doodle Dice. There's a different doodle pictured on each card in the deck. When you build a doodle that matches one of the cards, you take that card. Block an opponent's turn or take one of their cards away. Collect one card of each color and you win! It's the fun, challenging way for everyone in your family to be a doodle artist!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Easter Island",
        "description": "Easter Island is a mysterious island in the South Pacific. Its inhabitants have long since vanished without a trace except for the giant Moai. These giant statues are so large and heavy that modern man has had a difficult time recreating them without modern tools. Tools the original inhabitants most certainly couldn't possess.&#10;&#10;This game speculates that the statues were, in fact, beam weapons created by two very powerful wizards. These wizards used the statues in a giant game, with the island itself as the board. You are now one of those wizards...&#10;&#10;Easter Island lets you place your statues and move them into position. Then, when everything is ready, call upon the power of the Sun to topple your opponent's statues and thus your opponent.&#10;&#10;",
        "artist": "Kurt Miller"
    },
    {
        "name": "HeroCard Galaxy",
        "description": "From the Website:&#10;&#10;Do you have what it takes to rule the Galaxy?&#10;&#10;Engage your Hero in the battle for galactic domination! Be the first to explore space, develop technology, and control planets and you will become the Ruler of the Galaxy.&#10;&#10;Galaxy is a two player HeroCard game that can be expanded to a three or four player game with additional decks.&#10;&#10;Expanded by:&#10;&#10;    HeroCard Galaxy Crab Expansion Deck&#10;    HeroCard Galaxy EGG Expansion Deck&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "HeroCard Champion of New Olympia",
        "description": "From the Website:&#10;&#10;The Mayor of New Olympia has just sent out an urgent message to heroes around the globe:&#10;&#10;&ldquo;New Olympia is in dire straits! Villainous gangs wreaking havoc on the citizens! Robotic Invaders destroying the fair city! We need a Hero to discover their plots, foil their plans, and restore order! Be the first and you will be awarded the title- &quot;Champion of New Olympia&quot;!&rdquo;&#10;&#10;Champion of New Olympia is a two player HeroCard game that can be expanded to a three or four player game with additional decks.&#10;&#10;Expanded by:&#10;&#10;    Herocard Champion of New Olympia Ferrion Expansion Deck&#10;    HeroCard Champion of New Olympia Talon Expansion Deck&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "HeroCard Rise of the Shogun",
        "description": "From the website:&#10;&#10;It is the late 12th century. The sun has set on the classical period of Japan. The emperor&rsquo;s power has waned and a new power is growing on the horizon. Now, through alliances, court manipulation, and hand to hand combat, competing factions will battle in an epic struggle for control of feudal Japan.&#10;&#10;Rise of the Shogun is a two player HeroCard game that can be expanded to a three or four player game with additional decks.&#10;&#10;Expanded by:&#10;&#10;    HeroCard Rise of the Shogun Miko Expansion Deck&#10;    HeroCard Rise of the Shogun Prince Expansion Deck&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Cold War Battles: Budapest '56 & Angola '87",
        "description": "The Cold War Battles game system is a grand tactical simulation of battles that were fought&mdash;or could have been fought&mdash;during the Cold War. The playing pieces represent the actual units that participated or could have participated.&#10;&#10;Two games included in this issue are: BUDAPEST 1956, covering the ill-fated rebellion in the Hungarian capital in late 1956; and BLITZKRIEG ANGOLA, the clashes between Cuban and South African mechanized forces in Angola in 1987 and 1988.&#10;&#10;There are two players in each game. In BUDAPEST 1956 one player controls the Hungarian Rebels and possible NATO &quot;what-if&quot; reinforcements, the other controls the forces of the Warsaw Pact. In BLITZKRIEG ANGOLA one player controls the South Africans and their UNITA allies, the other the Cuban and MPLA forces.&#10;&#10;In the Budapest game each hexagon on the map represents half a kilometer across, and each game turn represents one day. Soviet maneuver units are mostly battalions, with regiments for their artillery and assault guns; Hungarian rebel units are ad hoc groups; and NATO intervention, when playing that special alternative history scenario, are represented by US &quot;Pentomic&quot; battlegroups.&#10;&#10;In the Angola game each hexagon on the map represents eight kilometers across, while each turn represents anywhere from one week of intensive combat to four weeks of refitting. Units on both sides are mainly battalions or equivalent groups of irregulars.&#10;&#10;The game system is low-complexity (totaling about 13,000 words) and compares to the one used in last year's Middle East Battles: Suez '56 &amp; El Arish '67. There are 280 NATO-style (with some iconic) half-inch counters. Playing time between two experienced opponents of roughly equal skill levels will be about three hours per game. Designed by Joseph Miranda.&#10;&#10;Cold War Battles: Budapest '56 &amp; Angola '87 was published in Strategy &amp; Tactics magazine #235.&#10;&#10;",
        "artist": "Joe Youst"
    },
    {
        "name": "Conan Collectible Card Game",
        "description": "Collectible Card Game based on Conan.&#10;Artwork and ideas pulled mainly from Robert E. Howard's works with other sources to follow in expansions.&#10;&#10;The goal is to become King of Aquilonia.  Your version of Conan (each player will have one of their own) needs to gain renown by defeating enemies.  These foes come in varying strengths and attempt to flank your Conan card to inflict as many hits as possible.  If your Conan falls to 0 health, you lose.  The choice lies in heaving many weak foes at Conan, or 1 or 2 major enemies.&#10;&#10;The combat mechanic involves the comparison of icons along the sides of the moves and maneuvers performed by Conan and his various foes.  These will determine hits, misses, and blocks.&#10;&#10;The game features new artwork from Dark Horse artist Paul Lee, CCG artists such as Alex Horley and Patrick McEvoy, and legendary fantasy artist, Ken Kelly.  Some art is taken from current Dark Horse comics, as well as some old Savage Sword covers.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Ninja Galaxy",
        "description": "AD 3017 - In the Ninja Galaxy it has been discovered that the four main star systems are becoming unstable. A destructive virus is spreading. The Ninja Elders have decided that only one star system can be saved. The other ones must be quickly neutralized. Which ones? To decide, the four Ninja Clans will battle each other at the Galaxy Power Rings. The winner's star system will be saved.&#10;&#10;Advance RING-LEVELS by going through PORTALS. Sabotage your opponents with PORTAL-BLOCKERS, and VAPORIZE blockers in your way. Battle your opponents up close with LASER SWORDS, or eliminate them with LIGHT STARS. Finally, NEUTRALIZE the other star systems with the very powerful NEGATIVE ENERGY DISCS (NED).&#10;&#10;New Advanced Rules: Use your Ninja Master Card to come into the battle when your ninja is facing elimination. In addition, each ninja has a special ability and on the third hit-point is eliminated. This adds much more strategy to the game and plays in about an hour.&#10;&#10;Ninja Galaxy is a fun Space-Battle Adventure for the whole family and yet serious enough for the &quot;gamer.&quot; A game of strategy, chance and fantastic finishes!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Napoleon at the Crossroads",
        "description": "Napoleon at the Crossroads - The Highways to Leipzig 14 August - 25 October 1813&#10;&#10;Campaigns of Napoleon System &quot;2X.&quot; Very similar to the &quot;1X&quot; Series, 6 km (3.75 miles) per hex, 3 days per turn, 3,000 men per strength point.&#10;&#10;The full Autumn campaign lasts just 24 turns. Scenarios cover the decisive start of the campaign in August 1813, the Crossing of the Elbe at Wartenburg in mid Sept, and the approach to Leipzig starting on October 8th.&#10;&#10;COMPONENTS: one 22 x 34&quot; map; 56 pages of rules including campaign analysis, designers notes and more; 10 player aid cards (Organization Displays, Leader &amp; Unit Manifests, March Set-up Tables that allow set-up on various dates); one box.&#10;&#10;GAME SYSTEM: CAMPAIGNS System - Series 2X = 6,000m/hex, 3,000 men/SP, 3 days/turn.&#10;&#10;",
        "artist": "Knut Grünitz,Mark Simonitch"
    },
    {
        "name": "Pursuit of Glory",
        "description": "(from GMT website:)&#10;Pursuit of Glory: The Great War in the Near East is a sequel to the award-winning Paths of Glory. This game puts you in the driver's seat of the British/Russian alliance or the Ottoman Empire during World War One. Gallipoli, holy war, mutiny, and the Russian Revolution await. Walk in the shoes of men such as Churchill, Lawrence of Arabia, Enver, and Falkenhayn.&#10;&#10;The action stretches from India to the Balkans, from the Black Sea to Suez. Can the Germans inspire a Persian uprising or forge an alliance with Afghanistan? Can the Russians capture a warm water port? Can the British guard the oil that fuels the Royal Navy? Can the Turks capture the Suez Canal and spark a revolt in Egypt?&#10;&#10;In Pursuit of Glory you will constantly feel that you're on the razor's edge - on the verge of impending doom or of breakthrough and total victory. Your hand of 7 cards presents you with a rich array of strategic and operational opportunities. You must decide whether to use each card for its historic event, command points, or resources. You must then commit your forces to a variety of objectives: the Turkish-Russian frontier in Caucasia, the violation of neutral Persia, oil-rich Mesopotamia, the Suez Canal, the Balkans and its vital railroads. You must judge when it is right to invade Serbia or launch a new naval invasion (perhaps on the inset map representing Gallipoli).&#10;&#10;As the British, you must hold on while your Russian allies break through the Turkish lines in Caucasia and you bring your forces to bear through invasion and a gradual build-up of imperial might. As the Turks, your objective is to gain complete victory early, uniting your strength with Germany and crippling the British Empire in Egypt and India or to persevere.&#10;&#10;If you are looking for a game that is relevant, dynamic, fun, tense, and a frantic roller coaster of a game, you will enjoy Pursuit of Glory.&#10;&#10;Game Features&#10;TIME SCALE    Approx. 1 year per hand of cards&#10;MAP SCALE    Point-to-Point&#10;NUMBER OF PLAYERS    One or Two&#10;&#10;COMPONENTS:&#10;Two full color counter sheets&#10;110 full color playing cards&#10;One 22 x 34&quot; full color map&#10;Rule Booklet&#10;Scenario Booklet&#10;Player Aid Cards&#10;Two 6-sided dice&#10;&#10;DESIGNER: Brad Stock &amp; Brian Stock&#10;DEVELOPER: Tony Curtis &amp; Neil Randall&#10;MAP, CARD, &amp; COUNTER ART: Mark Simonitch&#10;&#10;&#10;(BGG description:)&#10;&#10;Pursuit of Glory is a stand alone sequel to Paths of Glory, a card-driven strategy game covering the first World War.  Unlike the original game, which focused on the European theater of World War I, Pursuit of Glory focuses entirely on the Great War in the Middle East.  Pursuit of Glory uses the same card-driven mechanics and point-to-point of the first game, but with some rules changes and modifications to better simulate the conditions of the war in the Middle East.&#10;&#10;It was developed by Brad and Brian Stock with the permission of Ted Raicer, the designer of the original Paths of Glory.&#10;&#10;",
        "artist": "Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "Space Dealer",
        "description": "Space Dealer is played in real time to a 30-minute soundtrack (or timer) with all players playing simultaneously. Players start at their own planet with a power generator and a mine. They race to generate goods and deliver them to each other (earning victory points for both the player and the recipient) or to the neutral planets. They can also do research to improve their abilities and bring new cards into play. Everything &ndash; from generating goods to moving ships,to playing new cards &ndash; requires at least one flip of a sand timer; the catch is that each player has only two timers!&#10;&#10;At the start of the game it seems like you have all the time in the world. Very soon, though, the game becomes a frantic race to make as many deliveries as possible!&#10;&#10;A second copy of Space Dealer can be added to expand the game up to eight players.&#10;&#10;",
        "artist": "Patrick Schoden"
    },
    {
        "name": "Deal or No Deal",
        "description": "Can you beat the odds? In this interactive board game, contestants are encouraged to get the advice of their family and friends, but they have to make the final decision on the potential &ldquo;deal&rdquo;&hellip;. Based upon the international phenomenon of the highly successful Deal or No Deal television show, this game follows the same set of rules. Select a briefcase and either stay with that briefcase or make a deal with the bank for a cash offer in exchange for your briefcase&rsquo;s hidden cash value. Will you end up with $1 million, or $.01? Ages 10 and up, intended for 2-6 players.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Ringgz",
        "description": "Each player has 12 rings (in four sizes)and 3 bases of the same color. These are placed one at a time, in turn, on one of 25 territories laid out in a five X five pattern. You may place a ring:&#10;&#10;i) onto or next to a territory that already has a ring in your color, or&#10;&#10;ii) next to a base of your color.&#10;&#10;You also may place a base next to a territory that already has a ring in your color. Each territory can accommodate up to four rings as long as all the rings are different sizes. The winner of the territory is the player who has placed the most rings on it when the game ends, which occurs when no one can place any more rings on the board. The bases do not count in the scoring but can be placed on a territory to prevent any other player from placing a ring on it.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "1889",
        "description": "1889, an 18xx game in the series originated by Francis Tresham's 1829, is set in Shikoku Japan.  The rules are similar to 1830: Railways & Robber Barons on a smaller and terrain-heavy map.&#10;&#10;In 1889, 2-6 players will use money to purchase shares in railroad companies during Share Dealing Rounds. Between subsequent Share Dealing Rounds, railroad corporations then conduct operations on the game board, with the decisions being made by the player who is the major share holder. The game simulates the progression of railroad development during an historic period on Shikoku. Old trains become obsolete while the revenue earnings from cities grows over time. Players will try to purchase the most profitable shares at the right times of the game to maximize earnings in dividends and stock value gains. In the end, the player with the highest value of personal cash and held stocks is the winner.&#10;&#10;The game was originally available in kit form from Wild Heaven, and is now also being published by Deep Thought Games, LLC.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "WordSpot",
        "description": "A fast-paced word game for two players. The game consists of wooden letter tiles, each with four letters (the Discovery Edition contains 28 tiles and the Wooden Box edition has 32 tiles).  The board starts with 16 tiles and more are added during the game. On a turn, players find words (at least three letters long) on the board. Words can be situated vertically, horizontally, or diagonally. When a player finds a word, they use transparent tokens to highlight the letters in the word.&#10;&#10;Over the course of the game, the board expands beyond the inital 4 x 4 layout, as players earn new letter tiles and add them to the wordsearch field. The first player to use up all of their tokens wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "CooCoo the Rocking Clown!",
        "description": "From the Blue Orange Games website:&#10;&#10;It's show time! Coocoo, the Rocking Clown, just loves to juggle, but his big curved green shoes make him wobble and keep throwing him off balance. Help him juggle the most balls without making any of them fall, and you win!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Mother Sheep",
        "description": "From the Box &amp; Playroom website:&#10;&#10;&quot;They're cute, they're fluffy, and they're on the loose!  Be the first player to fence in Mother Sheep's flock in this exciting game of family fun.&#10;&#10;Each player has a list of five lost sheep they must fence in to return to the Mother Sheep, and only certain types of fences with which to do it. Each piece of fencing is color-coded to match up with other pieces, so you must think strategically when placing them.&#10;&#10;Players must work together at the same time as they compete with one another, in order to build up their fences the fastest. Every piece of fencing can either help or hinder the other players, so it&rsquo;s important to keep track of who else is aiming for your sheep. Will you be the first one to fence in everyone on your list?&#10;&#10;Expanded by:&#10;&#10;    Mother Sheep: The Wolf&#10;&#10;&#10;&#10;&#10;",
        "artist": "Randy Martinez"
    },
    {
        "name": "The World Cup Game",
        "description": "The World Cup Game is a football (soccer) game that is like no other soccer game. This is the first of its kind that closely resembles the current genre of German-style boardgames that have become so popular in recent years. &#10;It is not a quiz game and it is not a single match style soccer game, but it covers two complete tournaments - the 1930 tournament in Uruguay and the 2002 tournament in Korea and Japan. Two games in one box. The 1930 game takes around an hour to play, while the 2002 game takes around 3 hours to play.&#10;&#10;The box is weighty, coming in at just under 2kg, so you get a lot for your money. The components are 2 large boards, 74 National flag tiles, 182 Action tiles, 87 Action cards, 36 Plastic footballs, 4 'blob'dice, 3 score sheets, a rulebook and the box!&#10;&#10;Expanded by:&#10;&#10;    The World Cup Game - Expansion 1 (contains World Cups of 1958, 1962 and 1966, and a sheet of all flags needed for the expansions)&#10;    The World Cup Game - Expansion 2 (contains World Cups of 1934, 1938 and 2006)&#10;    The World Cup Game - Expansion 3 (contains World Cups of 1950, 1986 and 1990 and Euro 2008)&#10;    The World Cup Game - Expansion 4 (contains World Cups of 1974, 1978, 1982 and 1994)&#10;    The World Cup Game - Expansion 5 (contains World Cups of 1954, 1970 and 1998)&#10;    The World Cup Game - Expansion 6 (Contains World Cup of 2010 and the new expansion card set)&#10;&#10;&#10;&#10;&#10;Cardgame version:&#10;The World Cup Card Game 2010&#10;&#10;",
        "artist": "Shaun Derrick,Jan Derrick,Martin Whelan"
    },
    {
        "name": "La vallée de la mort",
        "description": "By the beginning of 1954, both the French and Viet Minh realized that the war in Indochina was nearing an end. Ho Chi Minh had requested cease fire negotiations in Geneva, Switzerland, and the French government was looking for a way out that would give them peace with honor. Both sides felt that a &quot;big win&quot; on the battlefield would finally secure at the peace table what they had been unable to obtain in six and a half years of war.&#10;&#10;The site of this battle would be near a village called, in Vietnamese, &quot;Seat of the Border County Prefecture&quot; located in a distant valley of north western Vietnam near the Laotian border. The French high command, under General Henri Navarre, reasoned that such a remote location could not be successfully attacked. General Vo Nguyen Giap thought the position was nearly impossible to defend. The siege of Dien Bien Phu would be the result.&#10;&#10;La vall&eacute;e de la mort (&quot;Death Valley&quot;) is a simulation of this epic siege that ended the French colonial presence in Asia and marked the beginning of a 21 year struggle for national unification. The game is designed for 2 players, one taking the role of the French commander of the fortress complex at Dien Bien Phu, the other of General Giap, commanding the Viet Minh forces laying siege. The game and scenarios are small enough to be played solitaire, however.&#10;&#10;Each turn of the game represents one week. Each assault impulse represents one day. A point of combat strength represents 150 to 200 men, 6 aircraft, 5 or 6 guns, or a single tank. An inch on the map corresponds to 700 yards.&#10;&#10;",
        "artist": "Craig Grando"
    },
    {
        "name": "Kulikovo 1380: The Golden Horde",
        "description": "Kulikovo 1380 is a game covering the battle between the Golden Horde clan of Mongols and the collected principalities that we know as Russia under the growing leadership of Muscovy, and the Grand Prince of Moscow, Dmitri Ivanovich, later entitled Donskoi for his victory at Kulikovo (which is right near the Don River). For 150 years, Tatar armies had readily destroyed all Russian opposition, and Kulikovo was the first sign that Russia was starting to emerge from Tatar domination. It would take several centuries more.&#10;&#10;Kulikovo is considered a major turning point/battle of the Middle Ages, in that it not only showed that a western-style, &quot;heavy&quot; army could defeat the Mongols, but it was also the first major step in the unification of the various Russian principalities under the leadership of Muscovy.&#10;&#10;Kulikovo is an accessible, fast-playing, fun game of low complexity. Gamers who have played ATO's Suleiman the Magnificent (ATO #9), and/or GMT Games&#226;&#128;&#153;s Men Of Iron should find all of this quite familiar.&#10;&#10;",
        "artist": "Craig Grando"
    },
    {
        "name": "Conquest of Pangea",
        "description": "A fascinating game for dominance set in the distant past when all the world's land masses were joined in a single super-continent: Pangea.  This unique game promotes battle and migration as the world breaks into pieces.  The player-controlled species advance and evolve based on the in-game action.  Featuring satisfying depth and near limitless possibilities, you will discover new facets to game-play each time you join in the Conquest of Pangea.&#10;&#10;Expanded by:&#10;&#10;    Conquest of Pangea: Atlantis&#10;&#10;&#10;&#10;&#10;",
        "artist": "Doug Kovacs"
    },
    {
        "name": "Storm of Steel",
        "description": "Publishers blurb: &quot;STORM OF STEEL is a complete simulation of World War One. The three maps cover Europe from the Pyrenees to the Urals, plus the Middle East. Fighting rages from St. Petersburg to Verdun to Baghdad and beyond. The maps can be combined for one grand game of the Great War, or they may be used separately for theater-level campaigns of the eastern front, the western front and the Middle East. The game rules use a modular approach, which allows players to employ the level of complexity they desire. Turns are quarterly, but players can use special campaign cards to provide additional move-fight impulses, recreating the intensive offensives of the war. There are scenarios for each year and each front of the war, as well as a grand game for the entire war. There is also a &quot;what if&quot; scenario for the war continuing into 1919.&#10;&#10;Units represent land, naval and air forces. Ground forces are portrayed at corps level. Each corps is rated for the number of divisions it includes; so players can concentrate for the offensive or disperse for the defense. Corps include infantry, shock troops, mountain infantry and cavalry. There are also specialized armored car and tank brigades, as well as tank corps for 1919, plus the planned-for American airborne division. Each country has its own unique order of battle so, for example, the Austro-Hungarians have mountain corps, and there are also additional units representing Bolshevik and independent nationalist forces.&#10;&#10;Naval units are at the squadron level for capital ships, and flotillas for cruisers and destroyers. There is also a complete submarine warfare module for attacks on merchant shipping. Air warfare is represented by strategic and tactical wings. A unique feature of the game is players can improve their aerial warfare capabilities by increasing their air doctrine level. As air doctrine improves, players can employ interception, aerial supply and aircraft carrier operations. On the subversive side, players can utilize agents to conduct propaganda and sabotage operations to undermine their foes from within.&#10;&#10;Land combat uses three different combat results tables to model different tactics. Tank and shock troop units can use the much more effective Infiltration CRT. Naval combat requires opposing fleets to first acquire each other, then engage in gunnery. Lighter fleet units become invaluable for recon and screening, while battleships and battlecruiser squadrons close in for the kill. In the air, players can execute a variety of missions, including air superiority and bombardment.&#10;&#10;An industrial production module gives players the capability to produce different types of forces. Production is tied to morale, and winning great battles will enhance your side's output while a disastrous defeat may lead to strikes on the home front. Storm of Steel uses a card system to generate major operations. Campaign cards give players additional move-fight impulses, combat bonuses and extra reinforcements. Players have to carefully choose which campaigns they will implement because some cards, such as the Schlieffen Plan, will provide for more maneuver, while others, such as Verdun, will enhance combat. There are also cards that will grant tactical innovations such as chemical warfare and armored doctrine, as well as bringing into play leaders such as Hindenburg, Brusilov and Lawrence of Arabia.&quot;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Scurvy Musketeers of the Spanish Main",
        "description": "The seventh installment in the B-Movie Series of card games from Z-Man Games -- this time focusing on &quot;Swashbuckling Cinema&quot;. This game can be played independently or mixed together with  any or all of the other B-Movie games.&#10;&#10;A description of this series of card games from the Z-Man Games website: &quot;Players are making a B-Movie by playing Characters, Props, and Locations in their movie and sending Creatures to attack the other players' movies in order to kill off their Characters. SFX cards can modify attacks and do other wacky stuff. When Roll the Credits is played, the player with the most points wins!&quot;&#10;&#10;",
        "artist": "Steve Bryant,Oliver Castañeda,Mike Jackson"
    },
    {
        "name": "Chuck-It Chicken!",
        "description": "Chaos in the chicken house. The cock crept into the barn, onto some bales of straw, and throws eggs on the chickens.&#10;&#10;The players try to move their chickens up a three-dimensional pile of straw (by rolling the dice). They try to hide behind obstacles, like a bucket or a barrel. Each player has several chickens; which one to move depends on the roll.&#10;&#10;When the cock symbol is rolled, the player may use the cock on the top edge of the pile and throw (roll) an egg down, trying to knock the chickens of the other players down the pile. Goal is to reach the top with a chicken.&#10;&#10;Re-implemented by:&#10;&#10;    Mini Chuck-it Chicken!&#10;&#10;&#10;&#10;&#10;",
        "artist": "Christof Herdt,Kinetic"
    },
    {
        "name": "Ahoy Treasures!",
        "description": "A group of pirates has found a treasure map. Now they race to this isle to find the most valuable treasures.&#10;&#10;Players in turn roll a die and move one of their pawns. Pirates that land on the same field are stacked; only the top one may move. You are forced to move if you can, even if this lands you in the water (which sends your pirate back to the start / out of game, depending on the variant used).&#10;&#10;You have to reach the treasure isle with a matching roll. The first one to land there gets the smallest chest (one point), the last one five points. The player with the most treasure (highest sum of points) wins.&#10;&#10;Ages 5+&#10;&#10;",
        "artist": "Marlies Rieper-Bastian"
    },
    {
        "name": "Fiery Dragons",
        "description": "Everyone knows that baby dragons are courageous. But they need also a good memory. And they prove it with a race around the bubbling volcano.&#10;&#10;Each player starts his baby dragon in another cave. The active player tries to uncover a chit with the kind of symbol shown on the field he's standing on. If he fails, his turn is over. If he draws a pirate dragon, he even must move back. If he succeeds, he moves forward up 1, 2, or 3 spaces (depending on the chit), and continues with his turn.&#10;&#10;The first player that completes a round around the board and reaches his cave with an exact move wins the game.&#10;&#10;",
        "artist": "Felix Scheinberger"
    },
    {
        "name": "Monopoly: Spongebob Squarepants",
        "description": "Nickelodeon's Spongebob Squarepants underwater world adapted for the classic Monopoly game.  Some fun changes in the use of pineapples instead of houses, a Krusty Crab restaurant instead of a hotel, Bikini Bottom transportation items instead of railroads, treasure chest and life preserver cards, etc.  Your goal is to collect the most clams.  Fun artwork and tie-ins to the cartoon show.&#10;&#10;Note to the Brazilian Edition: It comes without the plastic miniatures for players markers. It comes with cardboard figures instead.&#10;&#10;",
        "artist": "Stephen Hillenburg"
    },
    {
        "name": "Warriors of God",
        "description": "International Game Series game from Multi-Man Publishing.&#10;&#10;The 100 Years War was a pivotal event in medieval European history. In Warriors of God, Multi-Man Publishing and Game Journal Magazine have joined hands to bring a unique perspective to this conflict.&#10;&#10;As always, playability matched with historical accuracy has been achieved to a remarkable degree. Players move their leaders and units using a unique impulse game system that shows both the strategy and tactics of the period. The game also recreates the massive swings of fortune which were so much a part of the Hundred Years War.&#10;&#10;Even with such a simple and easily learned system, all the special rules necessary to give players a full feel for the period are here: archers, Joan of Arc, and much, much more.&#10;&#10;Warriors of God was designed by Makoto Nakajima, English development was by Adam Starkweather, with graphic design  by Mark Mahaffey and counter illustrations by Niko Eskubi.&#10;&#10;",
        "artist": "Nicolás Eskubi,Jean-Auguste-Dominique Ingres,Mark Mahaffey"
    },
    {
        "name": "Crystal Code",
        "description": "In Crystal Code the players have to use cunning and a bit of luck to arrange chains of pentagons. Arrange the chains fastest, and earn more crystals. Crystals give energy to the mysterious machine from the Renaissance. The player who has built the biggest working machine at the end of the game wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "1805: Sea of Glory",
        "description": "Spring, 1805&#10;Napoleon&rsquo;s Grande Armee&rsquo; is encamped along the shores of the English Channel. Following the teachings of Alexander, the French Emperor seeks to defeat a naval power from the land. He has but to place his 200,000 troops on British soil and France&rsquo;s hereditary enemy will finally fall. To do this, his combined fleet must control the Channel long enough for hundreds of shallow draft boats to ferry his troops to England. Standing in the Emperor&rsquo;s way is the Royal Navy.&#10;&#10;The year 1805, which is punctuated by the British naval victory at Trafalgar, represents one of England&rsquo;s darkest times during the Napoleonic Wars. Her great &ldquo;wooden walls&rdquo; offer the island nation its only defense against a far superior foe.&#10;&#10;1805: Sea of Glory examines the naval war on an operational level during that pivotal year. Although Trafalgar shines through history as the beacon of victory, it is the successful blockade of enemy ports that kept French boats from stepping onto British soil. But 1805: Sea of Glory is more than just a game about blockade duty. It is a game of breakout and pursuit, deception and false leads, husbanding meager resources, striking a blow where your enemy least suspects, and bringing about the decisive battle that defines victory or defeat.&#10;&#10;1805: Sea of Glory focuses on the operational actions of the three great navies. The Allied player (France &amp; Spain) must constantly try to break out of numerous European ports and form a combined fleet. The British player must continuously worry about his ships on station, as wind and weather allow the enemy an opening to slip anchor and set sail. For when Napoleon&rsquo;s fleets take flight, the British are hard pressed to cover all the potential targets and bring the enemy to bear. The British player will find that he never has enough frigates to watch all avenues of escape, and that a clever French player can keep him guessing and ultimately win this game of cat and mouse.&#10;&#10;The game uses blocks to represent the fog of war. The ability to spot and intercept your enemy is paramount. But is that block scurrying across the Mediterranean towards Egypt the French fleet? Or has the Toulon squadron turned west towards the Caribbean? From the French perspective, is the block off the coast of Brest a fleet? Or have the British returned home to repair and refit, leaving only a few frigates to watch the port? Is now the moment to sortie? Or does a large enemy force lay just over the horizon?&#10;&#10;While blocks represent fleets, squadrons, and scouting frigates, traditional counters represent the individual ships of the line. Every ship that could have seen duty, from lowly 64 gunners to the massive Santissima Trinidad, is present. Individual ships are kept on off map organizational charts, so that the exact composition of a fleet or squadron block is not known to your opponent until interception takes place.&#10;&#10;The great naval commanders of the age are present in the game as well. Rosily-Mesros, Villeneuve, Ganteaume, Missiessy, and Gravina for the Allied fleets. Cornwallis, Nelson, Calder, Collingwood, and Strachan for the British. Each admiral is rated for his ability to escape or pursue, as well as, his tactical acumen in combat. Special abilities are also included: from Cornwallis&rsquo; skill as an administrator, to Villeneuve&rsquo;s fatalistic bent, to Gravina&rsquo;s charisma, to Nelson&rsquo;s visionary brilliance brought to life as the &ldquo;Nelson Touch&rdquo;.&#10;&#10;The 22&rdquo; x 34&rdquo; map covers the North Atlantic from the Channel Coast to Africa, and the Mediterranean from the Straits of Gibraltar to Egyptian shores. An insert map covers the West Indies. Each hex represents 50 nautical miles. An Atlantic transit track handles fleets and squadrons sailing from Europe to the Caribbean and back. The major ports of the three belligerents are shown; each rated for harbor facilities and their effect on a fleet&rsquo;s ability to sortie.&#10;&#10;Weather also plays a huge part in the game. Storms and squalls will blow blockading forces off station, allowing the Allied player the opportunity to escape. While at sea, fleets and squadrons are at the mercy of the wind. True to any age of sail game, fleets may become becalmed at the worst possible moment. Prevailing winds are also noted on the map, resulting in interesting strategic options. A player that learns to anticipate and utilize the game&rsquo;s weather system will have the advantage. Beware being caught at sea in the Windward or Leeward Islands during hurricane season.&#10;&#10;Each individual ship is rated for its firepower and morale. The Allied player will cringe as his Spanish ships strike their colors early in a battle, while the steadfast Jack Tars of the Royal Navy will never seem to falter. But despite their superiority at sea, the British are not invincible, and a shrewd French player will find ways to thwart his enemy. Fire high and disable the British so that you can slip away, or stand hull to hull and exchange broadsides?&#10;&#10;A unique tactical combat system rewards fleets that seize the weather gauge. Each player has a selection of tactics chits which represent flag signals sent to his ships during battle. Choose the right combination of maneuver and sail settings to break the enemy line. Take the leeward position and attempt to escape before the windward fleet can close. Or from the leeward, turn and fight, creating a gauntlet of fire an overly aggressive enemy must endure. A Trafalgar sized battle can be fought out in less than 15 minutes.&#10;&#10;Although the game ends immediately in a French victory if the Allied fleet ever controls the English Channel, there is also a set of variable victory conditions. The British Admiralty must watch out for French invasions of Egypt, Malta, Naples, Ireland, or West Indies islands. The British player will quickly learn that he never has enough ships to cover every potential threat.&#10;&#10;A series of random events rounds out the simulation. Napoleon&rsquo;s meddling, British manpower shortages, West Indies fever, Spanish drafts, favorable winds, and Royalist spies are among some of the events that will hinder or help players achieve victory.&#10;&#10;",
        "artist": "Rodger B. MacGowan,Mark Mahaffey"
    },
    {
        "name": "GiftTRAP",
        "description": "GiftTRAP won a special Spiel des Jahres prize in 2009, and was voted &quot;Best Party Game of the Year&quot; by Games Magazine in 2008, proving that while buying real gifts can be traumatic, giving virtual gifts to find out how people really feel is heaps of fun. Be prepared for some surprises!&#10;&#10;It's a conversation starter that will get you and your friends talking about things that matter. Unlike other party games you don't need skills in drawing, acting or trivia, so it works well when you have a crowd of mixed ages/skills.&#10;&#10;GiftTRAP is played over a series of rounds. Each round has the following steps:&#10;&#10;&#10;     DEAL - deal random gifts from one of the 5 packs of gifts. Packs have similar monetary value.&#10;     SHOP - think about how to match these gifts to the players.&#10;     GIVE - give one of these gifts to each player (using gift tokens).&#10;     GET - choose which gifts you want yourself (using get tokens: Ok, Good, Great &amp; No Way).&#10;     REVEAL - show people what you wanted and see what you were given by each player.&#10;     SCORE - the giver and the receiver score for each gift (the giver gets GIVING points, the receiver gets GETTING points). &#10;&#10;&#10;The first to reach the end of both the Giving and Getting tracks is the winner.&#10;&#10;",
        "artist": "Scott E. Davis"
    },
    {
        "name": "Pirates of the Caribbean DVD Treasure Hunt",
        "description": "The Pirates of the Caribbean DVD Treasure Hunt game is the first action/adventure DVD board game. A departure from the traditional trivia-based DVD game, Pirates of the Caribbean has players traveling around a treasure hunt map, battling other pirate ships and completing pirate challenges. Players roll the dice and enter their coordinates on the DVD, which produces all the pirate challenges. At the beginning of the game, players receive a mission card that tells them how much gold, silver and rum they will need to collect for the game. You keep this a secret from the other players. Successfully completing pirate challenges, searching for booty and attacking other pirate ships are the ways you can get the gold, silver and rum you  need to complete your mission and win the game.&#10;The game, based on the hit movie franchise Pirates of the Caribbean, incorporates clips from the films and takes players to recognizable places such as Tortuga Island and Rum Runners Island. However, this is not a movie trivia game. The movie only serves to enhance the action/adventure game play.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Venus Needs Men",
        "description": "In Venus Needs Men! you can play one of the five alien worlds attempting to capture or destroy Earth&rsquo;s population while preventing the other players from doing the same, or else you can play Earth trying to fend off the aliens while getting your population to safety.&#10;&#10;",
        "artist": "Jeff Durham"
    },
    {
        "name": "Gheos",
        "description": "The players are gods at the dawn of time, creating earth's landscape and inhabiting it with people. They can command the creation and destruction of continents and the rise and fall of civilizations.&#10;&#10;As gods, players seek to gain followers among the civilizations. They offer those followers luxuries, and oversee the building of pyramids and temples on their continents. In the end, the god with the most loyal, wealthy, and powerful followers will become ruler of gods, and wins the game...&#10;&#10;Play involves placing triangular tiles to form islands, coastlines and continents. Players can also replace tiles to reform the topography of the planet.&#10;&#10;Each civilization is represented by a color, and once a civilization is &ldquo;born&rdquo; a player can gain worshipers in that civilization, which in turn may score points for that player in various ways.&#10;&#10;The placement or replacement of tiles may result in civilizations migrating, or going to war with other civilizations. These things are resolved by the various icons on the tiles.&#10;&#10;The game is fairly simple, but offers quite a lot of tactical possibilities.&#10;&#10;",
        "artist": "Allan Bednar,Josh Cappel"
    },
    {
        "name": "NHL Ice Breaker: The Card Hockey Board Game",
        "description": "NHL Ice Breaker is licensed by the National Hockey League and features the league&rsquo;s 30 teams plus national teams. You get all the great action of the game on the ice with NHL Ice Breaker. Game play is built around CSE Games' specially-designed 54-card playing deck (52 standard suited cards plus two Jokers). Each action in NHL Ice Breaker is based on the basic principle of high hand wins. Opponents play their card(s) at the same time to battle for puck possession, and the player with the highest hand gets to execute his/her action indicated on the card(s) played.&#10;&#10;As players win hands, the puck is moved up the ice (game board) and toward the opponent's net. Along the way, players may land on special &ldquo;Ice Breaker&rdquo; squares, which can shift momentum in an instant. Ice Breaker actions include penalties, big hits, turnovers or great passes. Once in the Shooting Zone, it's a classic contest of shooter versus goalie. Did you play your cards right?&#10;&#10;NHL Ice Breaker separates itself from other hockey-based games in that it has a true hockey 'feel'. The game is both accurate and fast-paced. Combining elements of popular card games, players must decide how best to play their cards. Cards can be played individually, in pairs, two pair, or three-of-a-kind. It is up to the player to decide which cards to play and how to play them.&#10;&#10;The learning curve of NHL Ice Breaker is remarkably low. Typically, the game is learned within a couple of minutes, aided by the built-in familiarity that the playing deck offers. NHL Ice Breaker is designed for one to four players, ages eight (8) and up.&#10;&#10;For more information, check out www.csegames.com.&#10;&#10;",
        "artist": "Matthew Wellman"
    },
    {
        "name": "Guadalajara",
        "description": "Guadalajara, portrays the operations launched by the Italian CTV (Corpo Truppe Volontarie&mdash;Corps of Volunteer Troops) towards Guadalajara with the ultimate objective of taking Madrid and putting a rapid end to the Spanish Civil War. The unexpected and dogged resistance of the Republican Army, which was fully involved in a deep reorganization, caused the failure of this offensive, forcing the Nationalists to give up trying to storm the capital and making them take the long road by capturing the whole country before being able to declare themselves victorious.&#10;&#10;After the failure of Franco's Nationalist troops to surround and conquer Madrid during the first months of the Spanish Civil War, Spain looked doomed to a long war of attrition.  During this gloomy period, a new force made its appearance -- the motorized Italian Corpo Truppe Volontarie (CTV).  Lavishly equipped and overconfident after its first successful performance in the fall of Malaga, the Italians thought they could quickly and easily end the war.  Spain was not Abyssinia, however, and Madrid was not Malaga.  The new People's Republican Army was no longer the rag-tag mix of militia units that had fought the Nationalists only a few months before.  The Italians were repulsed after a fierce campaign fought under very tough conditions.  Madrid was once again saved for the Republicans, and two more years of war would ensue.&#10;&#10;Special rules regarding tanks, anti-tank defenses, flamethrowers, truck transports, traffic jams, morale, and panic will allow you to recreate the Italian offensive.  Will you succeed where your historical counterparts failed?  Will you break the Republican lines?  Will your volunteers panic as they did in 1937?  Prepare to fight what Ernest Hemingway considered one of the most decisive battles in military history.&#10;&#10;Four scenarios cover the full campaign, the Italian offensive, the Nationalist &quot;side-offensive&quot;, and the Republican counteroffensive which broke the spine of the Italian assault.&#10;&#10;Guadalajara is the twelfth game in the Standard Combat Series (SCS) from series from Multi-Man Publishing.&#10;&#10;Game Scale:&#10;Game Turn: 1-2 days&#10;Hex: .6 mile / 1 kilometers&#10;Units: Company to Battalion&#10;&#10;Game Inventory:&#10;One 22 x 32&quot; full color mapsheet&#10;One dual-side printed countersheet (280 1/2&quot; counters)&#10;One 8-page Standard Combat Series rules booklet, Version 1.7&#10;One 16-page Guadalajara rules booklet&#10;One Player Aid card&#10;Two 6-sided dice&#10;&#10;Solitaire Playability: High&#10;Complexity Level: Medium-Low&#10;Players: 2-3 or more&#10;Playing Time: 2-8&#10;&#10;",
        "artist": "Nicolás Eskubi,Dean Essig"
    },
    {
        "name": "Pieces of Eight",
        "description": "Adventure and glory await you in Pieces of Eight, the rousing combat game of rival buccaneer ships on the high seas. You play the game with a stack of metal pirate coins held in one hand that represents your ship. The coins you choose and the order in which you place them determine your ship's strengths, and you use the special abilities of your coins to destroy your opponent's coins one by one. Your goal is to expose the Captain coin buried deep in the middle of your adversary's ship, then take him out!&#10;&#10;Dare to enter the age of blood and gold with either The Blade or The Maiden's Vengeance ship set. Each set includes all the coins needed for one player to construct his own ship. Your opponents will each need their own ship set to play, but there's no other limit to the number of players who can join in. The coins in each set are not randomized; you can combine ship sets to gain a wider selection of coins and the advantage over your foes.&#10;&#10;From the Atlas Games website.&#10;&#10;",
        "artist": "Jeff Menges,Michelle Nephew"
    },
    {
        "name": "Enemy Chocolatier",
        "description": "Times are great for the Candyman. He's just re-opened his factory, sold millions of nut-covered chocolate logs, and taught the world something about love. But too much is never enough. Now he's looking for a recruit from among his staff to pose as his arch nemesis, the Enemy Chocolatier. If you're good enough, that just might be you!&#10;&#10;Players start at the Chocolate Factory and take over the city, one house at a time. Each neighborhood earns you money and points. What&rsquo;s more, you get a little closer to completing your &ldquo;secret recipe.&rdquo; Enemy Chocolatier is a Euro-style strategy game with colorful, modular boards and lots of backstabbing and strategy!&#10;&#10;",
        "artist": "Cheyenne Wright"
    },
    {
        "name": "Drachenjäger von Xorlosch",
        "description": "The Dragon Academy has prepared 13 difficult Quests, huge challenges that are made up of many single Tasks. Lead your group of dwarfs with skill and cleverness to achieve as many quests and tasks as fast as possible. With every successful quest your group&lsquo;s experience will grow to allow you to solve the later quests with greater skill. The group that fulfills the most tasks will win the game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "1861: The Railways of the Russian Empire",
        "description": "1861 is an 18xx variant set in Russia.  1861's defining characteristics include: 16 minor companies that are put up for auction during stock rounds, minors having the opportunity to merge or convert in to major corporations, and a non-player controlled government railway.&#10;&#10;",
        "artist": "Mike Hutton"
    },
    {
        "name": "Millionen von Schwalben",
        "description": "Millionen von Schwalben is a (fairly satirical) soccer-themed game. Each player manages several soccer teams in a world championship tournament, trying to become rich. Matches are played with cards and die rolling, and different teams have different abilities. The action and country cards allude to many real-life events in soccer.&#10;&#10;Even though team success in the tournament is rewarded, the 'big money' is made through betting on the matches. Interestingly, the referee (another player) places bets, as well...&#10;&#10;The game also contains 54 soccer-themed cards for Anno Domini published independently as Anno Domini: Fussball WM.&#10;&#10;Available microbadge: &#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Dixie: Gettysburg",
        "description": "Gather your armies and fight over 3 positions. Cards represent infantry or cavalry regiments or artillery batteries. The uniform colors and styles are the uniforms that the regiments actually wore (according to the designers). You also have cards representing the participating generals , terrain and the ever present special events.&#10;&#10;Dixie is a collectible card set but with a flat rarity.  This is the third set with 250 cards for the Battle of Gettysburg.&#10;&#10;All artwork and graphics in the Dixie series was created by RPG/Historical artist, Eric Hotz (www.hotzartworks.com).&#10;&#10;",
        "artist": "Eric Hotz"
    },
    {
        "name": "Dixie: Shiloh",
        "description": "Dixie is a collectible card game but with a flat rarity. This is the second set with 400 cards for the Battle of Shiloh.  Complete sets are also available and individual cards may be ordered through the Columbia Games web site.  All artwork and graphics in the Dixie series (each regiment card is drawn with its historical uniform) was created by RPG/Historical artist, Eric Hotz (www.hotzartworks.com).&#10;&#10;The Dixie system is an expanded version of Columbia's tactical battle board system used in such games as Napoleon: The Waterloo Campaign, 1815.  Each unit card shows its unit ID, its Combat Value (CV--the number of dice rolled), and its Firepower (the number needed to hit a target).&#10;&#10;The game is played without a board; the table is divided into three battle line areas for each player (left, center, and right).  Players deploy cards face down into their three battle line areas.  Player's hands act as the Reserve area.  Each turn, every unit may either move or fire.  Movement consists of advancing into the opponent's battle line areas to engage.  Combat consists of rolling dice equal to the unit's CV with hits occurring for each die that is less than or equal to the unit's firepower.  For each hit taken, a unit must make a morale check, rolling equal to or less than their CV or &quot;rout&quot; (i.e., be discarded).&#10;&#10;Play continues until one side is able to occupy unopposed two of the three opponent's battle line areas.  Rules are included for fighting a second day.&#10;&#10;",
        "artist": "Eric Hotz"
    },
    {
        "name": "Hameln",
        "description": "Welcome to the 13th Century town of Hameln (Hamlyn). Townspeople go about the business of living - buying houses, having children, marrying, earning an honest coin and trying to get one up on their neighbors.&#10;&#10;However, their way of life is under threat...a plague of rats has arrived. As the number of rats rise the levels of food and romantic thoughts dwindle.... where is the Pied Piper when you need him ? Beware though, the Pied Piper plays his music at a price and his talents stretch beyond simply charming rats.&#10;&#10;Players score points for houses, influence, money and possession of the cat. Losing children to the Pied Piper is considered bad form and will lose you points.&#10;&#10;",
        "artist": "Gordon Lamont,Fraser Lamont,Judith Lamont"
    },
    {
        "name": "Strange Defeat:  The Fall of France, 1940",
        "description": "From the publisher:&#10;&#10;Strange Defeat is a sequel to Defiant Russia and Red Vengeance. Like those games, it&rsquo;s designed as an easy to learn, fun game. The map portrays the Netherlands, Belgium, western Germany and northern France.&#10;&#10;&#10;Players control the actual units that fought in this campaign; most of them represent army corps with a handful of divisions. The typical Allied unit is as good as the typical German unit, and many of them are better. The German player must play to his or her advantages: an air force designed for tactical support, parachute regiments to assault key points, and concentration of force.&#10;&#10;Like Defiant Russia and Red Vengeance, Strange Defeat isn't a very large game. The map is 34 x 22 inches, divided into very large hexes for ease of play. There are 140 playing pieces, and it comes in a small box that's easy to store. The game plays very quickly, concluding in about 90 minutes, with a minimum of charts and tables to consult. The game uses the same system as Defiant Russia.&#10;&#10;Game Scale:&#10;Game Turn: 1 day&#10;Hex: 15 miles / 24.1 kilometers&#10;Units: Regiment to Corps&#10;&#10;Game Inventory:&#10;One 22 x 34&quot; five color map&#10;One dual-side printed countersheet (140 1/2&quot; counters)&#10;One 16-page Strange Defeat&#10;One Player Aid/Errata Card&#10;Two 6-sided dice&#10;&#10;Solitaire Playability: Medium&#10;Complexity Level: Low&#10;Players: 2 or more&#10;Playing Time: 1-2 Hours&#10;&#10;&#10;",
        "artist": "Shannon Brown,Beth Donahue"
    },
    {
        "name": "Star Wars: Stolen Plans Card Game",
        "description": "Star Wars: Stolen Plans is a fast paced 'Print and Play' Card Game that can be played with 2 players but is best with 3 or more players. &#10;Players will take it in turns to draw a card, or play a card, trying to acquire the droid carrying the stolen plans. Once a player has possession of the stolen plans card they will soon discover that keeping hold of it is a different challenge as their opponents steal, and attack, to gain the advantage.&#10;&#10;This is a free Print and Play game. All of the necessary files can be found in the files section below.&#10;&#10;Star Wars is a copyrighted property. This is an unauthorized, unofficial game produced merely for the entertainment of fans and is non-profit making.&#10;&#10;",
        "artist": "Matthew Meadows"
    },
    {
        "name": "Der schwarze Pirat",
        "description": "The good, honest seafarers sail from one treasure island to the next.  However, Salvador Sea Devil, the Black pirate stays hard on their heels trying to pillage their treasures.  Using his vessel, the &quot;Black Svenja&quot;, Salvador Sea Devil quickly approaches and tries to board the seafarers' boats. The seafarers immediately set sail. Suddenly a strong gust of wind whistles around their heads and as the sails tighten the boat skims across the sea. At the very last moment they escape from Salvador, the Sea Devil.&#10;&#10;The game board shows the sea and various islands. The six islands with harbor are the treasure islands. On each treasure island there is a colored flag. Put a gold coin on each treasure island.&#10;One island shows the flag of the pirate: this is the pirate&lsquo;s island. Put the pirate vessel into the bay of the pirate island.&#10;Each player takes a little bag and a boat of the same color. Place your boat on the ship of the corresponding color shown in the center of the game board.&#10;The remaining gold coins, the bellows and both dice are kept ready next to the game board.&#10;&#10;At sea, there is nearly always a strong wind blowing. Sailing boats use the force of the wind: the big sails gather the wind, which then propels the ships forward. You can provoke strong gusts of wind with the bellows, to move the ships on.&#10;&#10;",
        "artist": "Guido Hoffmann"
    },
    {
        "name": "Metromania",
        "description": "Metromania is a game of placement and connection which allows 2 to 4 players to build a subway network between different cities.&#10;&#10;Each player builds 2 different subway lines, trying to go through the city and connect important places of housing, work, and leisures. After a construction phase, trip-tests verify the best and quickest lines.&#10;&#10;The mechanism is easy: during his turn, a player puts 3 line counters on the board. If his line meets another line, a station is built where the two connect. The subway network is developed through this process. Because the grid on the board and the line counters are triangular, players have some real placement questions.&#10;&#10;The game is very interactive, with players sometimes trying to cooperate and sometimes trying to stop other lines. They also choose, during the construction phase, the start and the end of the final trip-tests. But it's never the same player who places both start and end, so a player must anticipate and guess carefully.&#10;&#10;",
        "artist": "(Uncredited)"
    }
]