[
    {
        "name": "World War II: Barbarossa to Berlin",
        "description": "(from GMT Games:)&#10;&#10;Spring 1941: Nazi Germany is triumphant. Poland has long since vanished from the map. Denmark, Norway, and the Low Countries have been overrun. France, the victor of 1918, has fallen. Greece and Yugoslavia have now been crushed. Britain stands alone, freed from the threat of invasion by the courage and skill of its air force and navy. But Britain is stalked and assaulted by the Nazi wolfpacks, and in North Africa a mixed garrison of British and Commonwealth forces is besieged in Tobruk by Rommel and his Afrika Korps.&#10;&#10;Then, on June 22, Hitler launches Operation Barbarossa, the invasion of Stalin's Soviet Union. As the panzer spearheads slice through the bewildered Russian defenders, it appears that nothing can halt the Nazi tide. But the course of History has just taken a major turn. The Last European War is over; World War II has begun. It will end four years later, in a bunker in the ruins of Berlin.&#10;&#10;World War II: Barbarossa to Berlin covers those four years of epic struggle, from Moscow to Stalingrad, from Tobruk to Tunis, from Sicily to Rome, from D-Day to the Rhine, to the final battles for the Reich. Designed by Ted Raicer as a follow-up to his award-winning WWI strategic game, Paths of Glory, World War II: Barbarossa to Berlin modifies the Paths of Glory systems to capture the strategic and operational dynamics of WWII in Europe.&#10;&#10;As in Paths of Glory, World War II: Barbarossa to Berlin uses a point to point map, this time covering all of Europe from France to the Urals, and from Norway to North Africa. Units are armies and corps (fronts and armies for the Soviets), and each turn represents three months. The movement and combat systems will be familiar to Paths of Glory players, but have been modified to recreate the blitzkrieg campaigns of 1941-45.&#10;&#10;As in Paths of Glory, the heart of the game lies in the 110 Action Cards (55 each for the Axis and Allied players). Each card can be used for operational movement and combat, strategic movement, replacements, or for an Event. Events include:&#10;&#10;&#10;    Individual leaders (Patton, Guderian, or Rommel the Desert Fox) &#10;    Tactical innovations and new weapons (Fortified boxes, Tiger tanks) &#10;    Strategic Warfare (U-boats, Bomber Command, the 8th Airforce) &#10;    Reinforcements (Soviet Mechanized Fronts, PanzerArmee Afrika, Patton's Third Army) &#10;    Allied Invasions, actual or potential (Torch, Sledgehammer, Husky, Overlord) &#10;    Politics and Diplomacy (Hitler Declares War, Casablanca, Yalta, Operation Axis) &#10;    Irregular Warfare (Partisans, the Maquis, Otto Skorzeny)&#10;&#10;&#10;World War II: Barbarossa to Berlin presents both the Allied and Axis players with a wide range of exciting game choices, while illustrating the key historical factors of the war; from the importance of mechanized forces in combat to the importance of oil to fuel them, but without the complexity of other strategic WWII designs. And unlike many of those games, World War II: Barbarossa to Berlin lives up to its title: an Axis player who fails to win the war may still win the game. The winner is often decided on the last turn as the Allied player struggles to extinguish the last traces of the Nazi empire.&#10;&#10;It is June 22, 1941: Will WWII end in German triumph in Barbarossa or collapse in Berlin? As the world holds its breath, the decisions are yours.&#10;&#10;",
        "artist": "Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "Wie Hund und Katz!",
        "description": "A card game where players vie for control of dogs and cats and then fight for points by feeding them.&#10;&#10;The dog and cat cards are placed face up in the middle of the table. On their turn players place &quot;ownership&quot; cubes and then feed the animals with food cards.  Cats like fish and dogs like bones (positive points).  However, you can also feed your opponents dogs some fish and give their cats some bones (minus points)!  Action cards also allow some special actions (e.g. swap ownership cubes, swap food cards, etc.)&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Affenraffen",
        "description": "Players frantically search for pairs among the face down tiles on the table. Both color (gold, green or blue) and animal (ape, zebra, lion, penguin or flamingo) must match to qualify as a pair. The object is to fulfill the conditions on one of four goal tiles, e.g. any three animal pairs with different colors. Players are allowed to use only one hand and can't peek at the pairs they've collected, so not only do they have remember where tiles are on the table, but exactly which pairs they need to finish the goal.&#10;&#10;Is a re-release of Zock! with different rules.&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Gumshoe",
        "description": "The hardboiled detective in the Thirties. Players work as operatives for the Continental Detective Agency entering the exciting, exotic and dangerous underworld of 1934 San Francisco. From Chinatown to Nob Hill, from gambling dens to drawing rooms, from forgery to murder, Gumshoe splendidly captures the rough and tumble world of &lsquo;the hard-boiled detective&rsquo;.&#10;&#10;There is one case to solve each day over a period of nine days from July 3rd to July 11th 1934. The &lsquo;Old Man of the Continental Detective Agency&rsquo; gives out assignments. Everything players need to dig out the clues, search out the suspects and figure out the solutions is here: detailed 1930s maps of San Francisco and the Bay Area, directories alphabetically listing thousands of people and places encountered in investigations, a case book with hundreds of clues to unravel, police mug shots with vital statistics on dozens of known criminals, dated newspapers, a fingerprint file, time sheets for recording the time spent on each clue, and case reports with the solutions to the cases.&#10;&#10;Gumshoe is not a role-playing game or a board game. It is a detective investigation game for the individual or team who work to solve a large number of cases.  Game is from the makers of the innovative and award-winning Sherlock Holmes Consulting Detective.  Gumshoe introduces several new gaming concepts, it continues the traditions of simple rules, elaborate and well-constructed plots, excellent writing and faithfulness to its period style, which made the Consulting Detective series so popular worldwide.&#10;&#10;",
        "artist": "Helen Doward,Gary Grady,William Lamb"
    },
    {
        "name": "John Carter: Warlord of Mars",
        "description": "The Game simulates the legendary world of Edgar Rice Burroughs, Barsoom. Players are involved in Barsoomian epics in the role of one hero or one of his companions, and strive to perform as nobly as those heroes of the past. There are evil villains to be met, Martian wildlife to be tamed, great treasures unique to Barsoom to be gained and lovely lasses to be wooed and won.&#10;&#10;Players do not strive for victory points, but for greater glory, high romance and their attendant acclaim.&#10;&#10;There are two major parts to the game, the Dueling game and the strategic game. Man-to-man combat, and then the campaign type game (Strategic) where players take on the roles of heroes and villains, a delicate blend of negotiation and action is needed to succeed in this sci-fi epic.&#10;&#10;Game Components:&#10;&#10;1 Rules Book with in-depth analysis of Barsoomian society&#10;400 Die-cut cardboard playing pieces&#10;168 Playing cards&#10;One 22&quot; x 34&quot; soft map&#10;Play aids&#10;&#10;",
        "artist": "Don Maitz,Redmond A. Simonsen"
    },
    {
        "name": "Connections",
        "description": "Very large plastic board has alternating studs in red and white. Players place their colored tile with a line between the matching studs to form lines and boxes.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "San Gimignano",
        "description": "San Gimignano uses large hex tiles as a board, each showing three areas with one of four different colors.  A start set of tiles are laid such that no color touches itself on an adjacent tile.  Through the game, tiles are added to the board by the players with this same restriction.&#10;&#10;On your turn, you add a marker to claim one of the colored spots on the board; up to two markers can be placed on a space.  When you have four adjacent markers that are all on different colors, you can place a tower. Once the tower is placed, this spot is no longer usable for any other marker connections. The game ends when no more towers can be placed or when someone manages to place all 10 of their towers.  The player with the most placed towers wins.&#10;&#10;Tile placement and marker placement are both critical, as is where to place your tower so that you don't shut off further growth options.  It is possible to end up with a bunch of uselessly placed markers once all four colors will not be available to any of them.  The game nicely comes with English and German rules.&#10;&#10;A note about the unusual material of the &quot;towers&quot; can be found in a Geeklist thread:&#10;http://www.boardgamegeek.com/geeklist/42582/item/944057?commentid=1098046#comment1098046&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Scrabble Crossword Cubes Game",
        "description": "The game comes with 14 wooden cubes with Scrabble style differing letters and point values on each face. You get a sand timer and dictionary as well. The game components are of top quality.&#10;&#10;In GAME ONE rules, you roll the dice, set the timer and try to form as many words, crossword puzzle style, as you can before time runs out. You score points based upon the letters used. The winner is the first player to get to 200 points (suggested).&#10;&#10;In GAME TWO rules, players alternate 1 roll each. A round is limited to 4 rolls per player. Within each round players try to form a 2, 3, 4, 5, 6, 7, or 8 letter word. Each word length may only be formed once during a round.&#10;&#10;Standard Scrabble rules for word formation, scoring and challenging apply.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "20 Questions",
        "description": "20 Questions is the popular panel game in which the panel ask up to 20 Questions to guess the Person, Place or Thing. This edition should be called 20 Answers because you get 396 cards with 20 answers and the players in turn ask the Reader a number, and from that clue try to guess the answer. For each attempt a chip is paid, when the Guesser gets it correct, the Reader scores the chips paid, the Guesser scores the remainder. So getting it correct early scores you loads, getting it late scores the Reader loads. The board has a scoring track and there is an element of beating the Guesser too.&#10;&#10;",
        "artist": "Rita Åse"
    },
    {
        "name": "The Inventors",
        "description": "Though the base mechanism is Monopoly-like (the object of the game is to amass the most money), the way this game plays is different. The theme of the game is that you are investors in various comically named inventions. The game has a very curious mechanism that does double duty for rolling the dice and applying Patent Claim clips. (The kids love fussing with it.)&#10;&#10;The game board has an outside track, the Invention Track, and an inside track, the Royalty Track. On the Invention Track is where you pick up the various inventions (like buying properties in Monopoly). Instead of building house and hotels, you get a Patent Claim Clip attached to the invention card. This patent clip has a 0, 1, or 2 on it. The number assigned is random. The higher patent clip number, the more your patent makes you come royalty collection time. Eureka Cards can also be played that allow you to do special actions during your turn. The game limit is set by the usage of the Patent Claim clips. When the last one is used, the game ends.  The player with the highest combined total of cash on hand invention value wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Die heisse Schlacht am kalten Buffet",
        "description": "In Die Heisse Schlacht am Kalten Buffet, alternatively released as Kangaroo and Generalowsky, players try to win prize cards from the limited number available to them &mdash; but to win they must lap a circular track that (typically) consists of 21 spaces, and not only must they circle the track, but they have to do so while being top dog, so to speak.&#10;&#10;On a turn, a player rolls 1-3 six-sided dice to determine whether she moves and if so how far she moves. She rolls the dice one by one, stopping when she wishes, and the sum of the dice rolled can't exceed 7. If she rolls only one die, she moves forward by the number rolled; if she rolled two dice, she moves twice the sum of her dice (if the sum &le; 7); and if she rolled three dice, she moves three times the sum (again, if the sum &le; 7). If her sum exceeds 7, she removes her piece from the board and starts the lap from the beginning next turn.&#10;&#10;If one piece lands on another, the bottom piece must carry the top one when it next moves; what's more, the owner of the piece on top dictates how many dice the bottom player must roll &mdash; and if those dice sum to more than seven, then both pieces are removed from the track. Stacks can have any number of pieces, and whoever is on top dictates to the active player how many dice she must roll. When a piece in the middle of a stack moves, it leaves all pieces below it in place.&#10;&#10;When a piece or a stack lands on or passes the final space in the lap, the owner of the topmost piece takes one of the prize cards; each prize has a value on it, and once all the prizes have been claimed, whoever has the highest sum of prize cards wins.&#10;&#10;The 2014 edition of the game, Mah&eacute;, allows for play with up to seven player turtles, who are circling the island while trying to lay their eggs on the beach and receive points for doing a good job.&#10;&#10;",
        "artist": "Fred Bauer,Sybille Engels,Klemens Franz"
    },
    {
        "name": "Stratego: Star Wars",
        "description": "This is what it sounds like: Stratego set in the Star Wars universe. Each player has 40 pieces; teams are divided into the Dark Side and the Force. Characters used come from Star Wars Episodes I, II, IV, V and VI. Some of the characters have special powers, placing this game between original Stratego and Stratego Legends on the complexity scale.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Ivanhoë",
        "description": "Free England from the tyranny of King John! You head the revolt and launch your troops against the castles. The famed knight Ivanho&euml; will join your forces to liberate the land from tyranny. In this family game, each player aims to conquer the largest number of castles, installing his arms in each. But watch out for the other players --they could make your blazon end up in the oubliettes!&#10;&#10;There are three levels of rules: children, family, adults.&#10;&#10;Summary&#10;From the game box: &quot;While King Richard the Lionhearted is away leading the Third Crusade greedy nobles are trying to usurp his throne back in England. His authority diminishes as one castle after another falls. But you, hero, are faithful to King Richard. As a noble knight you retake these castles in order to preserve his legacy. Of course, you are not alone in this quest. Other Chevaliers vie for these same honors. To whom will Richard owe the greatest debt when he returns?&quot;&#10;&#10;Game consists of: &#10;&#10;     66 &quot;soldier&quot; cards (16 knights, 16 foot soldiers, 16 crossbowmen, 16 archers, Ivanhoe and Locksley) &#10;     5 castle boards and one Dungeon board &#10;     6 chips with the names of the castles &#10;     6 Lord boards &#10;     30 banners bearing the coats of arms of all the Lords (6 sets of 5 banners) &#10;     6 &quot;crown&quot; chips (5 Dukes and 1 King)&#10;&#10;&#10;&#10;&#10;",
        "artist": "Emmanuel Roudier"
    },
    {
        "name": "Friends",
        "description": "This is a game invented by the character Ross in episode 12 of the fourth season of the TV program  Friends. It is the same game as played by the characters on the show and as such does not require any knowledge of the TV series itself.&#10;&#10;The players split into two teams - intended to be girls and boys, but this only matters for the bonus questions. Each team takes it in turns to answer yes/no questions about the opposite team in one of four categories:  &quot;Fears and Pet Peeves&quot;, &quot;Ancient History&quot;, &quot;Literature&quot; and &quot;It's all Relative&quot;. This is done by submitting Yes/No cards face down for simultaneous reveal with the correct answer(s) from the other team. Some questions are about one member of the opposite team - in which case all members of the answering team submit a guess - and some questions are of the style &quot;Which of us...?&quot;, in which case the answering team collaborates for a yes/no answer for each member of the opposite team. The goal is to answer the most questions correctly about the other team and have the highest points total at the end of the game.&#10;&#10;There is also a bonus round - and here the gender divide does matter, because the game is designed so that the boys are asking the girls questions that are supposedly hard for the girls to answer but that the boys themselves should easily know the answer to, and vice versa (no answers are provided for the bonus questions). The bonus round is timed and each team answers as many questions correctly as they can within the time limit.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Monopoly: The Simpsons",
        "description": "It's Monopoly with a &quot;Simpsons&quot; twist!  Same as original Monopoly, with all of the board spaces, cards, tokens, etc. done over in a Simpsons theme.  Includes 6 collectible pewter tokens and an offer to purchase 4 more.&#10;&#10;Note to the Brazilian Edition: It comes without the plastic miniatures. The players uses cardboard figures instead.&#10;&#10;",
        "artist": "Matt Groening"
    },
    {
        "name": "Rise and Fall",
        "description": "Rise and Fall of the Roman Empire and the rise of the barbarian states. Players play either Eastern or Western Rome, Persia or a barbarian horde. A strategic game that portrays the last days of Rome. A short campaign game can last 2 hours and a long game can run 6 or more hours. Features include: solitaire rules, rebellions, revolution of troop quality, national characteristics, leaders, and the civilizing of barbarian areas.&#10;&#10;",
        "artist": "Meredith Edwards,Kaarin Engelmann"
    },
    {
        "name": "The Legend of Landlock",
        "description": "In this quick 2-player game, you take turns placing tiles that depict either bridges or streams, ultimately forming a 6x6 square. You score points by connecting your path (or stream) to as many sides of the square as possible, and by isolating your opponent's stream (or path). As you may have to place tiles that not only help you (and hinder your opponent), but also tiles that may hinder you (and help your opponent), there is a depth of strategy that is belied by whimsical art of the cardboard tiles. Similar to Carcassonne and Ta Y&#195;&#188;, but plays more quickly.&#10;&#10;2nd Place 1989 Hippodice Spieleautorenwettbewerb.&#10;2002 Mensa Select&#10;&#10;",
        "artist": "Edith Schlichting,Hala Wittwer"
    },
    {
        "name": "Tin Soldiers",
        "description": "From Game:&#10;&quot;Food Fight!&#10;It's chaos in the kitchen and the cans of food are 'revolting'. Spoiled little peas think nothing of creaming the corn and stewed tomatoes relish in dent-n-run tactics. Pull out the big guns with the Catsup Cannon! Chop, peel and squash your way to victory in this hilarious game of King of the Kabinet.&quot; &#10; Game comes with 55 cards &amp; 1 metal finger of fate in a nice tin container. &#10; A clever trick taking game from Al Newman that many have played as his prototype 'Toy Soldiers'. This is a great partnership game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Lines of Action",
        "description": "Lines of Action is a simple game that uses checkers board and pieces. Its rules were published in Sid Sackson's A Gamut of Games. There are some commercial versions available though.&#10;&#10;The object of LoA is to get all your pieces into a single connected group. A group of pieces is connected if they occupy an unbroken chain of adjacent spaces, horizontally, vertically, or diagonally.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "This Accursed Civil War",
        "description": "This Accursed Civil War is a tactical battle game featuring five battles from the First English Civil War: 1642-1646. It is the first in the GMT Musket &amp; Pike Battle System covering warfare in the 17th Century. The system emphasizes Command and Control and the unique style of combat in that era. Armies are divided into three of four wings. Each wing has an order that limits the types of actions that units of that wing may perform. Wings may change their order, but it is not an easy task to accomplish. Victory goes to the commander who can coordinate the actions of these wings in the heat of battle. Units are infantry brigades, cavalry regiments, and artillery batteries. Rules include Cavalry Charges, use of the Cavalry's pistols to skirmish or use in close combat, artillery grazing fire, Infantry techniques of fire including advancing, retreating, and salvo firing. Play is highly interactive, and a battle can be played through in one sitting.&#10;&#10;The battles included in this game are:&#10;&#10;Edgehill, 23 October 1642&#10;    Is the King beholden to Parliament or is he truly sovereign? King Charles and his army, their way to London barred by the army of Parliament, have drawn up to give battle. Edgehill was the first major battle of the war. Robert Devereax, Earl of Essex, commands the army of Parliament sent to prevent the King's army from reaching London. The fighting is indecisive as the bloodied Royalist foot fall back, but Essex conceded the field despite receiving reinforcements. A major victory for either side could have ended the war here.&#10;&#10;First Newbury, 20 September 1643&#10;    Outmaneuvered, Essex, with the Royalists under King Charles between his army and London, is forced to fight. Essex spies a hill southwest of Newbury and in the early morning occupies it. Hedges line the area and help minimize the King's advantage in Cavalry.&#10;&#10;Marston Moor, 2 July 1644&#10;    The largest battle of the war. It decided the fate of Northern England. An allied army of Scots under the Earl of Leven, the Northern Association under Ferdinando Fairfax, and the Eastern Association under the Earl of Manchester laid siege to the King's Northern Army under the Marquis of Newcastle at York, the key to the North. King Charles dispatched his nephew, the talented Prince Rupert, to effect a relief. The defeat was complete; the Royalist army was utterly destroyed and the North lost to Parliament. A new hero arises here: Cromwell, a name synonymous with the English Civil War and the key player in the later two civil wars.&#10;&#10;Second Newbury, 27 October 1644&#10;    The disaster that precipitated the forming of the New Model Army. Three Parliamentary armies come together and catch the King by surprise just north of Newbury. The most unconventional of all the battles; the superior Parliamentary force attacks from either end, but is short on time. Various options on gaining more time by shortening the flank march give this action high replay value.&#10;&#10;Naseby, 14 June 1645&#10;    The debut of the New Model Army and the battle that broke the back of the King's army. The New Model Army was created by combining the elements of the major armies in the field. While this worked well for the cavalry, there were serious problems in the infantry ranks. The King's army was outnumbered, but it retained its corps of veteran infantry. The final result was a decisive defeat for the King and the end of his military fortunes. Though fighting would last another year, the King would never field a potent army again.&#10;&#10;COUNTERS: 635 full-color die-cut counters.&#10;&#10;MAP: Two 22&quot;x34&quot; full-color back-printed mapsheets&#10;&#10;OTHER: &#10;&#10;    One 10-sided dice&#10;    16-page Rulebook&#10;    24-page Playbook&#10;    2 11x17 Player Aid cards&#10;&#10;&#10;&#10;&#10;DESIGNER: Ben Hull&#10;DEVELOPER: Marty Arsndorf&#10;ART DIRECTOR: Rodger B. MacGowan&#10;MAP &amp; COUNTER ART: Mark Simonitch&#10;&#10;(source: GMT website)&#10;&#10;",
        "artist": "Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "The Napoleonic Wars",
        "description": "From GMT games:&#10;&#10;In The Napoleonic Wars, GMT Games brings you a fast-paced, tension-filled, card-driven wargame with a point-to-point movement system that pushes the envelope in a new direction for a pivotal period of history. Rooted soundly in Mark Herman's award-winning We The People system, The Napoleonic Wars provides refinements that allow two-to-five players to play an exciting game requiring two to ten hours. The majority of your games will easily end in a single evening, thanks to sudden death victory conditions providing variable game lengths that eliminate the &quot;end of the world&quot; phenomenon that plague many games. Often, you'll set 'em up and knock 'em down twice a night, and once in a great while your Campaign game will require two nights of play for the terrific panoramic history to unfold before your eyes.&#10;&#10;Like similar card-driven games, The Napoleonic Wars provides strategy cards that are played as events or to activate leaders, armies or fleets (by play of command points) to move on the map. Players must constantly weight the value of an event or reaction card against the need for its command points. Command points themselves can be played for a wide variety of activities, making play unpredictable and fresh with each sitting. Uncontrolled powers are governed by a diplomatic track which is also affected by play of command points and events.&#10;&#10;Expanded by:&#10;&#10;     Napoleonic Wars: Super Deluxe Map&#10;&#10;&#10;&#10;&#10;Revised by:   &#10;&#10;     The Napoleonic Wars 2008 Update Kit (upgrade to 2nd edition)&#10;&#10;&#10;&#10;&#10;Re-implemented by:&#10;&#10;     Wellington&#10;     The Napoleonic Wars (Second Edition) (aka 2008 reprint Edition)&#10;&#10;&#10;&#10;&#10;",
        "artist": "Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "Drive on Paris",
        "description": "Drive on Paris, is a game simulating the first 100 days of fighting on the Western Front during World War I.&#10;&#10;The mobile campaign of 1914 in the west was the result of more than a generation of staff planning on both sides. The German General Staff had prepared the Schlieffen Master Plan of a giant right hook into France which its namesake had hoped would result in a Cannae-like battle of annihilation of France. The French believing that an attack would always win and that elan would carry the day, prepared to assault the lightly held German lines in Alsalce-Lorraine.&#10;&#10;Both plans failed.&#10;&#10;Drive on Paris allows both sides to execute the historical campaigns or variations on them and are rated for victory on how well their operation succeeds. Players can rearrange their Mobilization Points to change the change the force allocations from the historical ones to reinforce their effort or to better counter the enemy's.&#10;&#10;Both side must rapidly attack and defend at the same time...and you'll never have enough troops and power to do both perfectly, so your allocation of scarce resources will be the key to your success.&#10;&#10;This system uses a two-tracked method of determining victory. It isn't the usual &quot;one side tries something, while the other tries to stop it&quot;. Rather, both sides must strive toward their own goals while putting forth enough effort to stall the enemy. It is possible for both sides to &quot;win&quot; ending the game in a net draw (which is why you'll need to dedicate some effort to stopping the enemy support).&#10;&#10;Drive on Paris is the seventh game in the popular, easy-to-play Standard Combat Series. These games are designed to be easy enough for novice players, yet meaty enough to retain the interest of veterans. It violates two principals of game design at the same time: Easy games are dumb, and the converse that interesting games are hard. The SCS challenges these bogus assertions...and has successfully done so for eight years now.&#10;&#10;Part of the Standard Combat Series by The Gamers.&#10;&#10;Game Scale:&#10;Game Turn: 1/2 week&#10;Hex: 6.2 miles / 10 Km&#10;Units: Brigades to Division&#10;&#10;Game Inventory:&#10;One 22 x 34&quot; full color map&#10;Two dual-side printed countersheet (420 1/2&quot; counters)&#10;One 8-page SCS version 1.6 system rulebook&#10;One 24-page Drive on Paris specific rulebook&#10;Two 6-sided dice&#10;&#10;Solitaire Playability: Medium&#10;Complexity Level: Low&#10;Players: 2 or more&#10;Playing Time: 2-12 hours&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Brandywine",
        "description": "An early morning fog burned off with the dawn, and revealed two long columns of scarlet and blue clad troops. This was His Majesty's Royal Army, commanded by General Sir William Howe. They were marching through the extreme southeastern corner of Pennsylvania and heading toward fledgling America's capital at Philadelphia. Only short weeks earlier this army had disembarked at Head of Elk, Maryland, after a 32-day voyage from New York City aboard the largest armada North America has ever seen. With some 14,000 troops, including crack German mercenaries and elite American Loyalist units, Howe's army was about to execute a flanking maneuver of &quot;Jacksonian&quot; proportions.&#10;&#10;General George Washington, holding interior lines at Morristown, New Jersey, was unsure whether Howe would move north in support of the British invasion from Canada (see Saratoga, 1777), or whether he would move south against the Capital. Once the armada set sail, however, Washington shifted southwest and took up a naturally strong defensive position, on high ground behind Brandywine Creek, astride the main road to Philadelphia. Washington posted his troops advantageously and in depth. Control of the fords of the Brandywine would be the key to his position and although a possible flank attack was discussed, it's likelihood was discounted on the strength of local information.&#10;&#10;Thus the stage was set. Howe, pursuing a strategy of posts, sought European style victory in a sudden taking of the enemy capital. Washington wrote, &quot;Should they push their designs against Philadelphia...they will put the contest on the event of a single battle. If they are overthrown...the war is at an end. One bold stroke will free the land.&quot;&#10;&#10;",
        "artist": "Rodger B. MacGowan"
    },
    {
        "name": "Saratoga",
        "description": "In all the spectacle of war there has seldom been a sight the equal of British General Burgoyne's campaign of 1777. The float and march south from Canada had almost a surreal quality juxtaposed against the Adirondack wilderness. Hundreds of vessels making up an immense inland navy on Lake Champlain transported nearly 9,000 combatants together with 138 cannon. Burgoyne's objective was Fort Ticonderoga and from there, Albany, and a rendezvous with British forces coming from New York City. The strategic purpose of the campaign was nothing short of an end to the American Rebellion.&#10;&#10;The intrigue on the American side lay in the cult of personality. Saratoga was to be Benedict Arnold's greatest victory in a string of successes which rank him among the finest field commanders of the era. Known to all Americans as the great traitor, it is ironic to discover that twice he salvaged the Revolution from certain collapse. It was Arnold's conspicuous gallantry and bold leadership which assured America victory at Saratoga and, by extension, its independence.&#10;&#10;The fighting at Freeman's Farm would be savage. Here no farmer's militia, but rather Continental Regulars (anxious to redeem a recent reputation for retreat), stood toe to toe with Europe's finest. The sanguinary nature of the fighting was summed up best by American Brigadier General John Glover who said, &quot;Both sides seemed determined to conquer or die.&quot;&#10;&#10;It's the 19th of September, 1777. Do you, as the British, attempt to storm the prepared American positions on the high ground at Bemis Heights in order to open up the River Road and the most direct route to Albany? Or do you attempt to turn the American left where intelligence reports the American defenses are incomplete and the ground favors your approach? How will you employ the large number of Hessian mercenaries in your army? Will their performance match their reputation?&#10;&#10;As the Americans do you wait on Bemis Heights for the approach of the enemy as General Gates preferred, or do you sortie and meet the approach of the British in the forests where their artillery will be of little value? Will Generals Gates and Arnold cooperate, or will their feud spell disaster for the American cause? And what of the fog on this chilly Autumn morning? Will it be an ally to the Americans by impeding the progress of the enemy?&#10;&#10;These are only a few of the challenges facing you as you relive one of history's most decisive battles and the turning point of the American Revolution.&#10;&#10;",
        "artist": "Rodger B. MacGowan"
    },
    {
        "name": "Yom Kippur",
        "description": "Oct. 6, 1973: Six years after the decisive Israeli victory in the Six-Day War, Egypt has armed itself again to reclaim undisputed control of the Suez Canal. This time, with better-trained and well-equipped troops (armed with new SAGGER anti-tank missiles), the Egyptians clobber the Israeli Bar-Lev defense line. Israel must once again scramble the valiant IDF and fight for its very survival.&#10;&#10;Yom Kippur - The Battle for the Sinai, October 1973 covers the bitter fighting around the Suez Canal during the 1973 October War. Both players must fight against time to win before a ceasefire is mandated by the world superpowers. The tools of the modern battlefield, incredibly destructive weapons like rocket artillery, SAM missiles and airmobile troops, are at their disposal. But despite the bewildering complexity of such computerized weapons, Yom Kippur itself is a simple-to-play, fast and fluid contest.&#10;&#10;Contents:&#10;&#10;    One map&#10;    280 counters&#10;    Series Rules&#10;    Game Rules&#10;    Two Dice&#10;&#10;&#10;&#10;&#10;Game Details:&#10;&#10;    Unit Scale: Company to Brigade&#10;    Hex Scale: 2 miles / hex&#10;    Number of Players: 2 (also solitaire friendly)&#10;    Playing Time: Varies with scenario played&#10;    Complexity: Low&#10;    Solitaire Suitability: High&#10;&#10;&#10;&#10;&#10;&#10;Part of the Standard Combat Series.&#10;&#10;Also published in Command Magazine Japan #65 in 2005.&#10;&#10;",
        "artist": "Dean Essig,Sawshun Yamaguchi"
    },
    {
        "name": "Fallschirmjaeger",
        "description": "Fallschirmjaeger: The Airborne Assault on Fortress Holland May 10 to 14, 1940, simulates the German May, 1940 capture of Rotterdam and The Hague (Den Haag).&#10;&#10;In the spring of 1940, the German military machine turned west to convert the Phoney War into a real one. Fresh from his victory in Poland, Hitler planned a blow that would knock France out of the war. key to this plan was knife-like attack through the Ardennes to the English Channel which would split the Allied forces moving north to block the expected replay of 1914 and the Maginot Line forces immobile in the south. To add to the trap, the Germans planned the first massive airborne operation of the war. This attack would capture the hinterland of Holland, pave the way for subordinate German Armored thrusts crossing the Maas, and to continue the lure the Allies northward.&#10;&#10;Fallschirmjaeger covers this bait. The German player plops down an airborne invasion force with the goal of fighting off all-comers until relieved by advancing ground forces. The Dutch, all but abandoned by their French and British Allies, put up a fight for the record books. The German air bridge held on by its fingernail. While the main German drive was never in doubt, these scattered paratroopers had the fight of their lives against a small nation unwilling to succumb without giving the fight everything.&#10;&#10;In the end, the Dutch government had to be evacuated along with the Dutch Gold Reserve, to form a government in exile. They would return after liberation.&#10;&#10;The player must do all these things, or smash the German paratroopers before they are rescued by the Panzers, to win. Any German player thinking he'll have an easy time, must be reminded his is not Nazi Germany's main effort and that he must make-do on a shoestring.&#10;&#10;Fallschirmjaeger is the eighth game in the popular Standard Combat Series by The Gamers. Following last year's smash hit of Drive on Paris, Al Wambold returns to show this under-represented battle in great detail, much of which, from original Dutch records...and, yes, Dutch researchers were used to confirm the accuracy of the map!&#10;&#10;Game Scale:&#10;Game Turn: 8 hours&#10;Hex: 0.6 miles / 1 Km&#10;Units: Platoon &amp; Company&#10;&#10;Game Inventory:&#10;One 22 x 34&quot; full color map&#10;Two dual-side printed countersheet (560 1/2&quot; counters)&#10;One 8-page SCS version 1.6 system rulebook&#10;One 16-page Fallschirmjaeger specific rulebook&#10;Two 6-sided dice&#10;&#10;Solitaire Playability: Medium&#10;Complexity Level: Low&#10;Players: 2 or more&#10;Playing Time: 2-12 hours&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Tribulation",
        "description": "In Tribulation, number tiles are laid out in a 7 x 7 grid, similarly to Boggle.  Each tile has a number from 1 to 9 on it (the 9 tile is also used as a 6 in some editions).  Number disks from 1-50 are shuffled, and one is drawn.  Players race to find three tiles whose equation (first times second, plus or minus third, or any other combination of two tiles multiplied and the other added or subtracted) adds to that total.  The first to do so wins the disk.  Whomever has the most disks when they are all claimed wins the game.&#10;&#10;Nominally the game is for 1-6 players, although the upper bound is arbitrary and the rules say nothing about how the game might be played solo. Possible solo challenges involve seeing how many tokens you can claim in a set time (e.g. 10 minutes total) or how many tokens you can claim racing against a countdown timer (e.g. 5-10 seconds per token).&#10;&#10;",
        "artist": "(Uncredited),P. Engelmann"
    },
    {
        "name": "Star Trek: The Game",
        "description": "Players must navigate their way to each of the four planets by correctly answering questions from each of the five categories, obtaining four citations and returning to STARFLEET(tm) Command completely intact and fully functional. The first player to meet these requirements wins the game and is appointed the rank of Admiral.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "StreetSoccer",
        "description": "StreetSoccer is the name in the Netherlands (Dutch: Straatvoetbal) for how soccer is played in parks or squares in cities and villages.&#10;In this game 2 StreetSoccer teams play a 25 'minute' match. &#10;The soccer field is 10 spaces long and 6 wide (plus spaces outside the lines).&#10;The 2 players of this game both are coaches of one team. &#10;Both coaches have 5 StreetSoccer player figures (incl. the goalie). &#10;A die determines your number of spaces to move one of your figures. If you reach the ball you shoot the ball by the unused number of pips on the die plus one, and can make passes between players of your team. &#10;The die makes luck a part of this game. But your choices, like which player you move to which field and where to pass the ball are very important. For the following turns you calculate chances for your opponent and yourself and you try to have your players in good positions for later situations.&#10;&#10;",
        "artist": "Christof Tisch"
    },
    {
        "name": "Fantasy",
        "description": "A simple family card game wherein players try to collect the most fairy-folk in their forest. Each folk has a special effect that triggers when (s)he is played and alters the balance of the game.&#10;&#10;Publisher Blurb:&#10;&#10;Use your spells to become the Grand Master of the Woods!&#10;&#10;The Fantasy forest is in a state of upheaval! Fed up with all the chaos, the inhabitants have decided to elect their own leader. Gathered together in the middle of the forest, dryads, elves, goblins, hobgoblins and leprechauns are engaged in a fierce struggle to see who will become Grand Master of the Woods.&#10;&#10;Each race has its own magical power: dryads can steal cards already played by an opponent, gnomes can take two extra cards... Knowing how to use these spells will be vital for victory! At the beginning of the game, each player receives five creature cards. On their turn, players draw a new card and then play a card from their hand, immediately   applying its effects. In order to win, players will have to get the most creatures on their side.&#10;&#10;Expanded by:&#10;&#10;    Fantasy II&#10;&#10;&#10;&#10;&#10;",
        "artist": "Franck Dion"
    },
    {
        "name": "Blockhead!",
        "description": "This game is a collection of 20 colorful, odd-shaped wooden blocks, plus a bookmark-sized cardboard base. Players take turns choosing a block, and then try to place it on the current tower of blocks. Only the first block placed may touch the base, and no other block can touch the table or the base. You can only use one hand to place a block.  The first time a player causes the pile to tumble he is a SQUARE. The second time he is a CHARACTER. The third time he is a BLOCKHEAD! and is out.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Three Stooges Card Game",
        "description": "This game is very reminiscent of Lunch Money.  You play attack cards on other players from your hand of 5 until either you run out of cards or another player plays a defensive card.  Cards can set up combo's and some can redirect the attack elsewhere.&#10;&#10;Cards have appropriate pictures of the Stooges covering the whole card based on what the card is.  The cards come in the varieties you would expect such as Poke in the Eye, Duck and of course Nyuck! Nyuck! Nyuck!. The cards clearly explain what they are used for so unlike Lunch Money you do not need a cheat sheet when playing.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Golden Deuce",
        "description": "This game is based on the ancient Chinese game of Choi Dai Di (Known as 'Big Two' in English, similar to Pusoy Dos in the Philippines).  This special deck, however, has 60 cards, instead of the standard 52, which changes (for the better) the odds of the game and increases the strategy involved.  Another difference from the classic game, is that the publishers have added a game board for keeping score, adding even more strategy, because players have choices on how to move their pawns.&#10;&#10;The game starts with a round of the Golden Deuce card game - lay down higher tricks than the other players for control of the lead. Be the first player to lay down all the cards in your hand, and you gain points for all the cards left in the other players' hands.&#10;&#10;Moving to the game board, each player strategically moves any of their pawns the number of spaces to match the points earned in the card game round. Players can choose to move all of their pawns around the board at once (and therefore be able to block out opponents) or move one at a time (and capitalize on the amount of spaces moved).&#10;&#10;Once all players have moved, another card game round starts, and the game ends when one player has moved all of their pawns to the finish.&#10;&#10;",
        "artist": "Design Edge"
    },
    {
        "name": "Zwergen Ziehen",
        "description": "Each night, in two neighboring gardens in a sleepy suburb, an astonishing spectacle takes place: Colorful garden gnomes awaken from their statuesque slumber, straining and stretching themselves in order to move their stiff limbs. They form two teams and with the help of a garden hose that they place under a fence, the gnomes organize a Tug-of-War. They shout, moan, swear, and insult each other. Sweat streams down in large drops from under their gnomish hats. They try to pull together at the fence. Squirrels from the neighborhood hurry to gather there. They can&rsquo;t sleep with all the noise and they gather at the garden's edge in order to watch the spectacle.&#10;&#10;Garden dwarves make a &quot;pull the rope&quot; competition. During his turn, each player plays a card which allows him to add a dwarf of a certain color on his side of the rope or to make dwarves of a particular color stronger (or weaker). When dwarves are actually pulling the rope, you slide a part of the cute little board.&#10;&#10;",
        "artist": "François Bruel,Franck Dion,François Moret"
    },
    {
        "name": "HeroClix",
        "description": "Based on the popular Mage Knights system, but utilizing super hero characters from the Marvel and DC Comics Universe.&#10;&#10;The game plays much like a miniatures game, but without the measure-and-move system or the constant consultation of hit charts.  Rather, most of the vital statistical information is directly on the base of the characters, which can be rotated as characters take damage from hits.&#10;&#10;Since we're talking super heroes here, each character has special abilities and powers, which give the game its 'comic' book feel.  While these powers are listed on separate charts, sometimes the interaction of these powers can cause confusion.  Official FAQ can be found at the Wiz Kids website.&#10;&#10;",
        "artist": "Bernard Chang,Sandra Garavito"
    },
    {
        "name": "Emerald",
        "description": "From the box:&#10;&quot;Brand new baby dragon! The news spreads like wildfire! And everyone knows what this means: the mother dragon must have acquired a large hoard of gold and gems for the nest of her brood. All knights in the area want a chance at the treasure and race to her mountain. To protect her young, the mother dragon is looking for those who would attack her baby and her new hoard. If she catches a knight, he will spend the rest of his life polishing gold and then finish by feeding the baby dragon. Those knights that can avoid the mother dragon will carry off their share of gold and gems!&quot;&#10;&#10;Online Play&#10;&#10;&#10;     BrettspielWelt (real-time)&#10;&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Tabula",
        "description": "A version of Ludus Duodecim Scriptorum, the Roman precursor to Backgammon. Players move their stones round the 24 place track, knocking each other off as they go. A nice edition, with a board styled as a Roman mosaic, glass beads as pieces and the dice have Roman numerals.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Major Battles and Campaigns of General George S. Patton",
        "description": "You command the armies (one player plays the Allies forces and one player plays the German forces) during three of the greatest battles of WWII (that Patton participated in, of course). Three complete games are included: Sicily-Invade and capture Italy's southern island fortress, Normandy Breakout-Direct the critical campaign on the sweep to Berlin, and Battle of the Bulge-The daring breakthrough to Bastogne.  A two-sided (19&quot; x 26&quot;) game board is provided.&#10;&#10;The game maps are historically accurate, as well as the initial troop deployments. Troop movement per turn is dictated by 24 troop movement cards. Allied and German units are 112 die cut cardboard pieces. Battles are resolved using 5 red and 5 white battle dice.&#10;&#10;The game plays very well for a wargame of its age. The troop movement card deck works better than one might think. Moving the little cardboard counters is typical of wargames of this era. And the battle resolution based upon rolling multiples of any number seems unbalanced at first, but after a few plays you realize that it too works as well as the troop movement card deck.  Two very innovative wargaming mechanisms that allow for quick movement and battle resolution. Thus the game moves fast, but does not sacrifice battle and movement detail(s).&#10;&#10;Copyright (c) 1973 RGI - Research Games, Inc and ATHOL Game Co., 200 Fifth Ave., New York, NY 10010&#10;&#10;Also see: Major Campaigns of General Douglas MacArthur&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Melee",
        "description": "Microgame #3 in the Metagaming Microgames series is a board game of pre-gunpowder individual combat. On a hex map representing an arena, players fight it out with cardboard counters. Fighters are rated for Strength and Dexterity and can carry weapons and armors of various advantages and disadvantages.&#10;&#10;Included a 32-page booklet (4&frac14;&quot; by 7&quot;, or half-legal size), with a hex map (8&frac12;&quot; by 14&quot;, or &quot;legal&quot; size) and counter sheet.&#10;&#10;Melee was released with three different covers, the first two both appearing in 1977 and the third in 1979. All were released in plastic ziplock bags. In 1981 there was a fourth edition which was boxed with a cover almost identical to the second edition (lettering changed from red to white).&#10;&#10;This system was later developed into Advanced Melee, one of the three books of the The Fantasy Trip role-playing system.&#10;&#10;After Steve Jackson and Metagaming had parted he lost control of his creation. He responded to this by adapting the basic rules into a new system: GURPS, the Generic and Universal Role Playing System.&#10;&#10;Integrates with:&#10;&#10;    Wizard&#10;&#10;&#10;&#10;&#10;Reimplemented by:&#10;&#10;    Legends of the Ancient World (RPG)&#10;    Heroes & Other Worlds (RPG)&#10;&#10;&#10;&#10;&#10;",
        "artist": "Liz Danforth,Trace Hallowell,Pat Hidy,Roger Stine"
    },
    {
        "name": "Black Hole",
        "description": "Microgame #10 in the Metagaming Microgames series. Two space mining cartels battle for control of an alien artifact: a donut-shaped asteroid with a miniature black hole gravitically tethered in the center of the hole.&#10;&#10;",
        "artist": "Gary A. Kalin,Robert E. Manns"
    },
    {
        "name": "WarpWar",
        "description": "Microgame #4 in the Metagaming Microgames series, Warpwar is a fast playing mini-game of interstellar maneuver and combat. You select the tactics and weapon power settings. No chance is involved in the diceless combat system. You must out-think your opponent.&#10;&#10;You design your own spaceships with beams, screens, missile tubes and power drive. Ships move through space or jump along the warp lines connecting stars. To win, you must capture the enemy star bases. Advanced rules introduce system ships and technological advancement, which gives newer ships an advantage.  Includes an introductory level for two players age 12 and up. Includes rules, map and counters.&#10;&#10;",
        "artist": "Russell Ansley,Winchell Chung,Jennell Allyn Jaquays,Gary A. Kalin"
    },
    {
        "name": "Le Mans",
        "description": "The great-grandfather of today's racing games, elements of Le Mans are clearly evident in games like Formula D&eacute;.  Le Mans offers the choice of twelve different car specifications that detail the number of spaces the car travels in each gear and which gears the cars can safely negotiate turns.  Also, the different car types have different braking characteristics.&#10;&#10;The game includes two tracks printed on the same board, Monte Carlo and Le Mans.  Each track is only two lanes wide, and the spaces on the track are only a half-car-length, so a car takes up two spaces at once.&#10;&#10;The cars move in order of track position. Each turn, a car may either remain in the same gear, shift up one gear, or shift down according to the car's specifications.  It must then move the exact number of spaces required by the particular model of car in the specified gear.&#10;&#10;When cornering, if a car exceeds the gear specified for the particular model of car, it must &quot;take a chance.&quot;  The driver must roll the die to determine if the car safely cornered, spun out, crashed, or damaged the car such that a pit stop is required.  If a car spins out, a &quot;wet track&quot; marker is placed on the corner, subsequently requiring all cars to roll for a chance when going through it.&#10;&#10;If a car is blocked and cannot move the entire number of spaces required (and the car has no more hard braking left and cannot down shift enough), the cars collide.  Collisions require that the involved cars make a pit stop for repairs.&#10;&#10;Optional rules include guidelines for slipstreaming, over-revving to move an extra space, and details of team, solo, and timed play, and &quot;Le Mans-style&quot; starts.&#10;&#10;The game is a revised version of Wright-Mudge Enterprises' Grand Prix: A Sports Car Racing Game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Shadowfist",
        "description": "A collectible cardgame based on Kung Fu, sci fi and action movies that pits players against each other in a secret war to control the world's feng shui sites across time.  Based on yet another world created by the venerable Robin D. Laws (Doomtown, On the Edge, etc.), the game stands on the shoulders of Magic: The Gathering and On the Edge, focusing on multi-player rather than two-player games.&#10;&#10;With the &quot;Combat in Kowloon&quot; expansion, this game no longer uses randomized booster packs, instead using a distribution method similar to a Fantasy Flight LCG (called &quot;Dynamic Card Game&quot;).&#10;&#10;",
        "artist": "Melissa Benson,David Fooden,Quinton Hoover,Jesper Myrfors"
    },
    {
        "name": "Shadowrun: DMZ Downtown Militarized Zone",
        "description": "Shadowrun: Downtown Militarized Zone is a 3D game with cardboard miniatures inspired by the homonym role-playing game.&#10;&#10;",
        "artist": "Dana Andrews,Joel Biske,Tim Bradstreet,Sean R. Cannon,Todd Hamilton,Rick Harris,Chuck Harris,Karl Kochvar,Jeff Laubenstein,Larry MacDougall,Jim Nelson,Mike Nielson,John Zeleznik"
    },
    {
        "name": "Past Lives",
        "description": "A roll-and-move game, close to a party game (Avalon Hill!), where players try to go back in the past to find out who they were before reincarnation...&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Armada",
        "description": "A board game with a nicely realized island group, which offers protection for either four nations or four pirate bands (depending on the edition) and indigenous people. Components: 300 plastic markers, 150 tokens, 8 ships made of metal with 2 masts, 55 cards (3rd edition only), 3 six-sided special dice, 1 rules booklet.&#10;&#10;Between the second and third edition, the theme of the game changed. The first and second have a theme of four nations exploring and colonizing new land, while the third edition has a pirate theme. The third edition also adds 55 action cards, resulting in more chaos and - possibly - less strategy (at least that's what is suggested in the rules).&#10;&#10;The board shows an island group composed of five smaller island groups separated by ocean. There is a large island group in the middle and four smaller ones in the corners. The four smaller island groups are the homelands of the four nations in editions 1 and 2 and the pirate bases in edition 3. Nations / pirates set out to explore and conquer the big island group in the middle (or each others' homelands).&#10;&#10;Every round, each nation / pirate group has 10 action points. With these you can accomplish various actions: move, load ships, explore unknown areas, attack your opponents, etc. Most important action is probably exploration, in which you roll two special dice which determine how many natives and how much gold there is in a neighboring, unexplored land. You'll have to fight the natives to conquer that land and get the gold. The gold itself you use to muster new armies / pirates. Conquest ultimately decides the winner.&#10;&#10;In the 3rd edition, you can use special cards to optimize your course or counter the actions of opponents. Thus you have a large freedom of movement, unfortunately your opponents do also.&#10;&#10;A winner of the 1986 Concours International de Cr&#195;&#169;ateurs de Jeux de Soci&#195;&#169;t&#195;&#169;.&#10;&#10;",
        "artist": "Franck Dion,Guillaume Rohmer,Pascal Trigaux"
    },
    {
        "name": "Anno Domini",
        "description": "Anno Domini is a wargame for four players and consists of a map board, a deck of cards, 12 dice, cardboard coins, miniature castles and cathedrals and a rule book.&#10;&#10;Players start by randomly selecting a Pope and proceeding with the random selection of all 36 territories. These are claimed by placing a castle and cathedral on the specified area of the map board.&#10;&#10;Play commences with the Administrative Phase where players collect taxes based on the number of territories and cathedrals they control. Following is the Military phase that is divided into three optional steps. The first is to roll 2d6 for a random event that will cause the player to either gain or lose money, lose cards, lose castles or become the pope. The second option is to build new castles on your territories. The final is an attack on another person's territory.&#10;&#10;Territories can attack adjacent territories or those on the same body of water. The attacking and defensive force are determined by the number of castles on each territory. For each castle on his/her territory, the attacker and defenders each roll a die and apply any modifiers obtained by cathedrals or cards in his/her possession. Results of 6 or over destroy a castle of the opposing side. If all of the defenders castles are lost, the attacker wins the territory, places a castle to claim it and may draw a card at the end of the phase. Cards offer various benefits such as money, attack/defence points or game actions.&#10;&#10;Play continues until one player controls 8 cathedrals.&#10;&#10;... and apparently the castles are cute.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "BattleTech CCG",
        "description": "Set in the Battletech universe, this collectible card game has each player customizing her deck with mechs, vehicles, 5 types of resources, and characters and locations from the BT universe. Play is similar to magic - draw a card, play cards, tap resources and build. Players play resources which they tap to build their units. Once built, units attack the opponents units, resources, or deck. Each point of damage to the deck scraps a card from it. Once a player's deck runs out of cards, he loses the game.&#10;&#10;There were several expansion sets including: Mechwarrior, Counterstrike, Mercenaries, Arsenal, Commanders &amp; Crusade.&#10;&#10;A compendium of the entire card set is downloadable here: Battletech Card List.&#10;&#10;",
        "artist": "Randy Asplund-Faith,Janet Aulisio,Tom Baxa,Stuart Beel,Joel Biske,Doug Chaffee,John Coulthart,Liz Danforth,Charles Gillespie,Mike Jackson,Janine Johnston,Mike Kimble,Tom Kyffin,Clint Langley,Kevin McCann,Christopher Moeller,Pat Morrissey,Ted Naifeh,Mark Poole,Dom  Reardon,Tony Roberts,Romas,Zina Saunders,Doug Shuler,Mark Simpson (II),Ron Spencer,Pete Venters,Matt Wilson,Sam Wood"
    },
    {
        "name": "C-23",
        "description": "A game *very* similar to Magic:the Gathering. The theme has changed to sci-fi, the number of colors and cards reduced, but the mechanics are still there. Tap!&#10;&#10;",
        "artist": "Lee Bermejo,Michael Chang,Mark Irwin,Rich Johnson,Alexander Lozano,John Tighe"
    },
    {
        "name": "Harry Potter Trading Card Game",
        "description": "Collectible card game based on the Harry Potter novels written by J.K. Rowling.&#10;&#10;Each player's 60-card deck is fronted with a wizard or witch &quot;character&quot; card, and contains spells, creatures, items, and the &quot;lesson&quot; cards needed to put them into play.  Damage to the character is tracked by simply discarding off the draw deck, and first person to run out of cards loses.  Damage is dealt with spells or creatures, and can be targeted to other creatures, or directly to the opposing character.&#10;&#10;In addition to the Base Set, there were 4 other expansions for the Harry Potter TCG:&#10;&#10;&#10;     Quidditch Cup&#10;     Diagon Alley&#10;     Adventures at Hogwarts&#10;     Chamber of Secrets&#10;&#10;&#10;As of 2002, this game has been discontinued.&#10;&#10;",
        "artist": "Oriuzio \"Dany Orizio\" Daniele,Kevin Dobler,Dave Dorman,Greg Hildebrandt,Tim Hildebrandt,Monte Moore,Chris Seaman"
    },
    {
        "name": "3-D Chess",
        "description": "First seen in the classic Star Trek television series, Tri-dimensional Chess (a.k.a. Star Trek Chess) was first detailed in Franz Joseph Schnaubelt's book, the Starfleet Technical Manual, published by Ballantine in 1975. A fan, Andrew Bartmess, got in touch with Mr. Schnaubelt and fully fleshed out the rules. It adds a third dimension to the game making chess more difficult. Vertical movement, as well as the tradition horizontal movement, creates many new moves and strategy.&#10;&#10;Reproductions of the original prop were sold by the Franklin Mint for a time.&#10;&#10;Roughly, there are three fixed 4x4 boards staggered so that the lower board's last two rows are under the middle board's first two, and likewise the middle board's last two rows are under the top board's first two. Four 2x2 movable attack boards attach to the corners of the fixed boards, above or under, so that the game actually has a total of seven planes (but only 16 of the 96 extra squares are &quot;in existence&quot; at any one time). The attack boards are also necessary as bridges between the fixed boards. Notation of positions and moves (since now there are sometimes several possible paths between any two starting and ending squares) is initially problematic, but well addressed by Mr. Bartmess.&#10;&#10;The standard set up is uneven, with the lower (white) board's attack boards starting above instead of under as called for by symmetry. This gives an advantage to white since he can reach the neutral board faster than black as a consequence.&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "Super Deck!",
        "description": "Super Deck! is a card game, in which players select a heroic and a villainous champion, and send the two to fight against their opponent's respective villian and hero.&#10;&#10;Players first built up their deck (a minimum of 40 cards) and begin play with a 7-card hand.  They place their selected hero on their left to begin their Hero stack and start their Villian stack on their right.  The hero/villian cards have a base number on the top left, and each turn, players play one card (and replenish their hand) to modify the values of their or their opponent's stacks by multiplication, addition, or subtraction.  Certain cards give effects that negate certain cards or discard an opponent's cards.&#10;&#10;When the values of a player's hero and villian stack are both 10 points greater than their opposing stacks, he or she calls out &quot;Last chance!&quot;  The game ends in victory for the player at this point if the opponent is unable to reduce the deficit by playing a card.&#10;&#10;",
        "artist": "Howard Bender,Brian Michael Bendis,Bill Black,Kent Burles,Steven S. Crompton,Fredd Gorham,Rick Harris,John Mundt,Terry Pallot"
    },
    {
        "name": "By Golly!",
        "description": "A children's memory game. A hand of colorful cards depicting birds, worms, etc are dealt to every player, and around 20 cards that match the cards in the player's hands are scattered face down around the table. Players must match cards from their hand with cards on the table to clear out their hand. First to do this wins.&#10;&#10;This game is part of The Chicken Family of Zoch.&#10;&#10;",
        "artist": "Doris Matthäus"
    },
    {
        "name": "Battle of the Sexes",
        "description": "Players divide into two teams: men vs. women.  The goal is to move your team's pawns across the game board.  Along the way teams will have to answer questions about the opposite sex in order to move.  For example, &quot;How many lugs are on the typical wheel?&quot; or &quot;Where is the Superdome located?&quot; are questions that would be given to the female team.  &quot;How do you stop a run in stockings?&quot; or &quot;What type of nut is used to make marzipan?&quot; would be given to the males.  The first team to move all four of their pawns across the board wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Electronic Stratego",
        "description": "An electronically enhanced version of Stratego from back before personal computers were commonplace.  Game play is the same as the classic board game except for a few interesting twists:&#10;&#10;&middot; When you attack an opponent&rsquo;s piece, the computer tells you whether you have won, lost, or tied.  So you do not know the exact strength of the opposing piece, only its strength relative to your own piece (and so too your opponent does not know the exact strength of the piece you used to attack with).  This feature makes the game quite a bit more interesting than standard Stratego.&#10;&#10;&middot; Instead of moving one of your pieces on your turn, you can &ldquo;probe&rdquo; an opposing piece to find its strength.  You will not be given its exact strength, but instead what &ldquo;class&rdquo; it is in (8-9, 5-7, or all else)&#10;&#10;&middot; Bombs are no longer playing pieces but are hidden features on your side of the board that are programmed into the game.  You secretly select six spaces in which to place the bombs.  Your own pieces can move through these spaces unharmed, but any enemy pieces (except a Miner) landing on these spaces will be destroyed!&#10;&#10;&middot; Scouts can move and strike diagonally, and can strike from a distance.&#10;&#10;The player who finds and captures his opponent's flag first wins the game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Men Are from Mars, Women Are from Venus",
        "description": "A game inspired by the book by John Gray.  Each turn one player draws a card and must answer a multiple choice question.  The other players attempt to guess how that player will answer.  Points are awarded for guessing correctly.  The questions deal with provocative and sometimes sensitive topics (sexuality, values, etc.), so one of the choices that is available to the answerer is &quot;choose not to answer&quot; (called the &quot;cave&quot; for men and &quot;well&quot; for women).&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Option",
        "description": "Option is a Scrabble-like game where players form words crossword-style to score points.  The twist is that instead of tiles the players use prisms that have letters on two sides in two different colors (bonus points are scored for making a word with all one color).  Players can also flip letters already on the board in order to make new words.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Tornado Rex",
        "description": "Similar to Fireball Island, Tornado Rex is a 3D action game where players try to be the first to get their two hikers to the top of the mountain.  Players draw a card to determine what kind of move they can make (forward, backward, switch places, etc.).  The cards also determine when Tornado Rex is released: a spinning top that careens down the mountain trail knocking off any hiker he happens to hit.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Napoleon in Europe",
        "description": "Players take the role of a Napoleonic-era power and move miniature plastic infantry, cavalry and artillery to simulate the campaigns of Napoleon.  Several difficulty levels and scenarios included in the box.  Standard game has a map that offers a grand strategic view of the action, and separate board for battles to reflect tactical realities of the period such as combined arms, infantry square formations, and reserves.  Standard game also includes diplomacy, fleets, and economic system.&#10;&#10;",
        "artist": "Keith Rocco"
    },
    {
        "name": "LCR",
        "description": "This game consists of three dice and a set of poker chips.  Each player starts with three chips and on their turn a player rolls the three dice. For each &quot;L&quot; rolled, they give a chip to the player on their left. For each &quot;R&quot; rolled, they give a chip to the player on their right. For each &quot;C&quot; rolled they put a chip in the middle of the table. For each dot rolled, nothing occurs. The dice are then passed to the next (clockwise) player. If at any point, only one player has all of the chips, that player wins the game.&#10;&#10;Re-implements:&#10;&#10;    Never Say Die&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Decision At Kasserine",
        "description": "Published in The Wargamer Magazine Vol.I, #23, this game covers the German operations called Fruelingswind &amp; Morgenluft which led to the famous battle at Kasserine Pass in Tunisia in 1943. This game feature a rich variety of nationalities (US, British, French, German, and Italian) as well as unit types (motorcyle troops even!) played on a single map. Units are generally companies and battalions, with individual batteries of artillery. Game turns are half a day each and each hex = 2 miles. The game stresses the importance of headquarters units for coordination (particularly of air support) and has some of the best artillery rules ever. The game has since been updated by GMT's Kasserine in 2001. This game would become part of what would be known as the \"Battles for North Africa\" Series.&#10;&#10;It was also released in a boxed format by 3W. A very thin box containing exact reprints of the rules, maps and counters.&#10;&#10;The other games in the \"Battles for North Africa\" Series are: Rommel at Bay,   O'Connor's Offensive, Hellfire Pass,  Patton Goes to War,  Objective: Tunis, and Race For Tunis.&#10;&#10;",
        "artist": "Ina Clausen,Rodger B. MacGowan"
    },
    {
        "name": "Act One",
        "description": "Players are given lines from well known movies or television shows and must act them out in order to get team-mates to guess the film.  The first team to get 35 points wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Iliad",
        "description": "The conflict between the Greeks and Trojans in the four days described in detail by Homer, including Achilles' departure. A turn is 1 hour, 10 turns per day.&#10;&#10;Includes:&#10;26x38&quot; mapboard (5 pieces)&#10;51 counters &#10;10 page instructions in 4 languages: Italian, French, English, German&#10;&#10;Rated Difficulty Level 1 by the publisher.&#10;&#10;",
        "artist": "Enea Riboldi"
    },
    {
        "name": "Priceless",
        "description": "(From the rules card)&#10;&#10;You are a collector of fabulous items.  You start with little money but have 9 precious un-cashed checks.  As you acquire and exhibit your collection, you receive &quot;prize points&quot; that reflect its increased value.  The more valuable your collection, the greater the value of your remaining checks and the easier you will find it to buy even more expensive collector items.  You buy items whose cards you hold in your hand.  But you'll also bid at hotly-contested auctions.  Trading is not only encouraged, it's often essential to build your collection.  When any player buys his 10th item, the game will end.  The wealthiest collector is the winner.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Vampire Hunter",
        "description": "From the rules:  &quot;The Object:  Make your way into Drakus' castle, fighting the monsters as you go.  Find Drakus before his escape ship arrives and defeat him once and for all!&quot;&#10;&#10;This is a simple game targeting pre-teens and teens.  The game itself MUST be played in the dark as the tower lights shift from red to blue, changing the board, dice, and tiles that may or may not reveal creatures of the night.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Return of the Stainless Steel Rat",
        "description": "Ares Magazine #10. Based on Harry Harrison's famous character, Slippery Jim diGriz, aka the Stainless Steel Rat, this solitaire paragraph game pits the SSR against a deadly maze controlled by a computer programmed to kill.&#10;&#10;",
        "artist": "Redmond A. Simonsen,Timothy Truman"
    },
    {
        "name": "Damocles Mission",
        "description": "Ares Magazine #13. On 15 September 1988, a dark spherical object approximately 1.2 kilometers in diameter of unknown origin assumed a geosynchronous orbit over the Galapagos Islands. Upon orders of the president, an investigating shuttle mission was configured (code name Damocles)...&#10;&#10;Damocles Mission is a solitaire paragraph based game to explore the alien craft around the earth. Tiles will allow the player to expand the known area of the craft, and a variable handicap system at the end of each play will allow you to adjust the initial allocation of units for the next time to make it easier/harder.&#10;&#10;",
        "artist": "Tom Mandrake,Redmond A. Simonsen"
    },
    {
        "name": "Arena of Death",
        "description": "Ares Magazine #4. Arena of Death is a game of gladiatorial combat in a fantasy setting. The players take on the role of fighters in the arena, pitting these fighters against each other and against fearsome beasts over the course of a variable number of &quot;combats&quot;. Each combat consists of one or more players' characters entering the arena where they meet one or more characters controlled by other players.&#10;&#10;The combat lasts until only dead or mutually friendly characters remain in the arena.&#10;&#10;[This is the standalone game version of the combat system used in the RPG Dragonquest by SPI]&#10;&#10;",
        "artist": "Joe Jusko,Redmond A. Simonsen"
    },
    {
        "name": "Star Trader",
        "description": "Ares Magazine #12. Star Trader is a game of interstellar economics set in the 24th Century. Each of up to 6 players is master of a fleet of star faring trade vessels, competing with opponents to increase his own profits at the expense of the other players.&#10;&#10;[This game can be used in conjunction with the RPG Universe, also by SPI]&#10;&#10;",
        "artist": "Redmond A. Simonsen,Timothy Truman"
    },
    {
        "name": "Nightmare House",
        "description": "Ares Magazine #15. Nightmare House is a two to five player game of ghost hunting and exorcism. (There are solitaire rules). One player (the House) takes the role of the Evil Entity that has spun its web of power over the Darkholm Manor. The other players (called the Hunters) each represent a ghost hunter who has entered the house one dark night to confront and banish its evil.&#10;&#10;The battle against the House takes place on two planes. On the Astral Plane, the Hunters try to reach and exorcise the Entity hidden in the heart of darkness of the House. The Hunters must advance along the 12 Axes of Power, weakening the House and destroying its web of evil by exorcising the Entity's power from individual rooms in the Manor. The House tries to trap the Hunter's Psyches and cast their Astral bodies adrift on this plane.&#10;&#10;On the Material Plane, the physical manifestation of the House, the Hunters search for discoveries to help them on the Astral Plane, as the House materializes Physical and Psychic Haunts against them through its Foci of Evil. The House tries to take possession of the Hunter's physical bodies, destroy them, and absorb their souls. The Hunters use various tools and strengths to defend themselves against the Haunts.&#10;&#10;",
        "artist": "Kristine L. Bartyzel,Jeff Easley,Kitty Thompson"
    },
    {
        "name": "Tic Tac Chec",
        "description": "Tic Tac Chec is both a chess teaching tool and a clever strategy game.  Each player has four pieces: a knight, a rook, a bishop and a pawn.  The object of the game is to be the first to align your pieces in a vertical, horizontal or diagonal row.  Play starts on an empty 4 x 4 board and players take turns placing a piece on any open square.  Once at least three pieces are placed per player, they may move a piece, capture a piece or place their remaining piece.  Captured pieces are returned to their player and may be replayed on any open square.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Spider-Man",
        "description": "Who doesn't know of Spider-man, the cult comic book superhero?  Who hasn't wished he too could be bitten by a radio-active spider?  The next best thing is this board game, where you get to play the super-hero or a nemesis of his!&#10;&#10;In this war between Good and Evil, the prize is control of New-York.  You can play Spider-man, Doctor Octopus, the Green Goblin, the Rhino, Electro, Venom, Scorpio, the Vulture or the Lizard.  Each Super-Villain has is own unique set of super-powers which he'll use to accomplish missions and terrorize New York.&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "Survival of the Witless",
        "description": "A wild, no holds barred game of tenure politics. Knowledge is nothing. Tenure is everything!&#10;&#10;It's the brutal world of higher education - the misery of sweltering in the rarefied air of that medieval ritual; surviving the politically correct minefield to achieve the ultimate in bourgeois living - Tenure. Face incomprehensible odds in this tongue in cheek, knife in the back card game of Antisocial Darwinism!&#10;&#10;",
        "artist": "Brien J. Miller"
    },
    {
        "name": "Assault on Hoth: The Empire Strikes Back",
        "description": "Released after Return of the Jedi, part of a series of games depicting Star Wars events, this game plays out the battle on Hoth.  The object of the Imperial player is to destroy the Shield Generator at opposite end of the map to Imperial deployment.  The rebels' goal is to forestall Imperial victory until the &quot;Transports&quot; are away.  Setup is limited to certain areas of the map, thus setting up a very accurate scene to play from the film &quot;The Empire Strikes Back.&quot;  Troops, vehicle strength and damage are tracked on the map, using various counters.  One even gets to use Luke on the battlefield and his all important Force ability. Dice are used to determine combat attack and defense.  It's a hex based map, and the counters all have stands.  Low rules learning.  Random card powers throughout game (events.)  VERY little hidden from other player.&#10;&#10;",
        "artist": "Rosaria Baldari,Stephen Crane,Susan Kramer,Teri Micco,Carl Skutsch"
    },
    {
        "name": "Superpower",
        "description": "The object of Superpower is to control as much of the Third World as possible by the end of the game.  The game uses several decks of cards, a roll and move game track, and voting rights based on the number of third world countries 'owned'.  A player chooses between one of four actions on his turn:  Moving his pawn on the board via die roll; military fortification of a previously influenced country; military response to another player's prior coup d'etat against a non-fortified country; or attempt an invasion of a non-fortified country.  The game centers around keeping other players' military influence markers out of strategically valued countries, and installing your own influence and subsequent fortifications in same.  Once a country has military fortifications installed, it is immune from all further actions.  Unfortunately for the warmongers, world opinion is constantly being lowered by hostile actions, and propaganda efforts must be maintained to keep world opinion high enough for successful actions.  Of course, before you can militarily influence anybody, you have to get economic influence going, and the various spaces on the board track take care of giving everybody opportunity for same.&#10;&#10;",
        "artist": "Bryan Ansell,Charles Elliot (I),Albie Fiore,Benny Preuser,Angus Ryall"
    },
    {
        "name": "Close Action",
        "description": "The Age of Fighting sail vol 1&#10;&#10;In the end, Napoleon lost his war with England. Triumphant against all the thrones of Europe, never could he penetrate the walls of oak that surrounded Albion to land an army and deliver the knockout blow.&#10;&#10;Discover the secrets of Britain's superior ship handling in the age of sail with Close Action. Some 25 scenarios, ranging from ship vs. ship (training exercises) to fleet actions (the Nile Campaign) cover a variety of British, French, Russian, Turkish, and Spanish ships throughout the period. In addition to the Napoleonic Wars, there are selected actions from the American War of Independence and the War of 1812.&#10;&#10;Developed for over 10 years by Mark Campbell, Close Action features 70 1&quot;x &frac12;&quot; ship counters, 140 markers and accommodates from two to sixteen players on its two 34&quot;x22&quot; maps. If your interest runs to miniatures, the rules and charts need no changes to adapt to the &quot;big mat.&quot; Can you do better than Nelson? Or, will you do what no one ever did and defeat him in a fleet action? Sail alongside, for it's sure to be a Close Action.&#10;&#10;(source: Clash fo Arms website)&#10;&#10;&#10;Close Action is all about teamwork and out-maneuvering one's enemy by coordinating the movements of a fleet of wooden ships.  You plot movement for your ships, send signals to your friendly captains, and assign crew to various tasks such as changing sails or firing the great guns.  Played on a hex grid, the ships move fairly accurately and historic battles can be recreated with lots of realism.  This games scales extremely well, playing as well if not better with 20 players as with 3, 4 or 5.&#10;&#10;(source: user's description)&#10;&#10;",
        "artist": "Tom Hannah"
    },
    {
        "name": "Quizzard",
        "description": "Quizzard is a trivia game where you not only have to be right, you have to be fast.  The heart of the game is an electronic buzzer device that records who will answer the question first.  Up to 6 players have this buzzer pad in front of them and the first one who hits the button gets to answer.  However, you can lose points for incorrect answers so before you hit the button you'd better know the answer.  The game comes with a book of trivia questions divided into Champion, Master, and Wizard levels of play.  Rules for nine variations of the 3 levels are included in the rules. Quizzard has three game setting labeled Fast Hands, Strategy (machine selects who will answer) and Countdown.  Quizzard runs on 4 AA batteries and has a built-in score track.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Ice War",
        "description": "Microgame #9 in the Metagaming Microgames series, a Soviet invasion of Alaska during the Third World War.&#10;&#10;",
        "artist": "Kenneth Rahman"
    },
    {
        "name": "Ram Speed",
        "description": "MicroHistory #2 in the Metagaming MicroHistory series.&#10;&#10;Naval combat in the Bronze Age.&#10;&#10;From back of the box:&#10;&#10;&quot;The Bodies of the men that died&#10;   The breakers buffet, the billows beat.&#10; Washed with blue of sea-salt tide,&#10;   Rolled in wreackage of shattered fleet.&quot;&#10;&#10;- Aeschylus&#10;&#10;The galley's bronze beak surges forward, curling up two salty sprays.  Sweating muscles strain to lash, pulling heavy oars to rams-speed's gasping beat.  With rending crash and splintered timbers snapping, the metalled beak staves in hull, smashing rowing banks.  Sheaves of arrows flashing out seek soldier flesh to pierce.  Boarding warriors spring to dying deck with ready plunging swords.  One galley lives victorious in heroic glory.  The other is vanquished to Poseidon's grasping waves.&#10;&#10;RAMSPEED is a two-player game recreating the excitement of navel warfare int he Bronze Age.  Each player constructs galleys for his fleet as he chooses, utilizing a point system.  Hulls, rowing banks, missile weapons and boarding parties are all included.  Combat covers ramming, shearing, grappling, boarding and missile attacks.  RAMSPEED is a fast playing game from the age of mythical heroes, a time when gods roamed the earth and mystery veiled the oceans.&#10;&#10;",
        "artist": "Ben Ostrander"
    },
    {
        "name": "Theophrastus",
        "description": "From the Mayfair website:&#10;&#10;At the end of the Renaissance, one alchemist rose above the rest: Theophrastus von Bombast der Hohenheim.&#10;&#10;His skill and knowledge of alchemy and science were legendary. Each year Theophrastus would accept only one new apprentice. This fortunate youth, upon completion of his training, would depart for the luxuries of life in the court of some noble or king.&#10;&#10;But Theophrastus had many applicants. To select his new apprentice, Theophrastus would challenge them with a clever test of their skill and alchemical talent. Only the most promising of these applicants would be chosen as the great alchemist's apprentice.&#10;&#10;Do you have the talent and knowledge to become an apprentice of the great Theophrastus?&#10;&#10;Will you be able to duplicate his experiments with greater skill than your competitors?&#10;&#10;Are you clever enough to overcome the fierce competition?&#10;&#10;Theophrastus provides clues to the nature of his experiments, but he will not share all the knowledge with everyone. Will you combine your limited selection of metals, elements and essentials to create the wondrous concoctions that the wealthiest of princes will envy and desire? Or will these secret combinations elude your every attempt?&#10;&#10;Perhaps, luck, ingenuity, and determination, will make you the alchemist's apprentice!&#10;&#10;Contains&#10;27 Experiment Forms,&#10;3 Blank Experiment Forms&#10;5 Player Experiment Forms&#10;120 Cards&#10;1 Pewter Marker&#10;Rulebook&#10;&#10;",
        "artist": "Robert Carty,Phil R. Chase"
    },
    {
        "name": "The Lord of the Rings: The Fellowship of the Ring",
        "description": "Choose to play the forces of good or evil and recreate some of the most memorable battles on Middle Earth.&#10;&#10;A hobby more than a game much along the lines of Games Workshop's Warhammer Series.  This game is much smaller, simpler, and random than the Warhammer Series.&#10;&#10;Battles are resolved with simple D6 rolls with the highest roll winning, individual stats only used to decide ties.&#10;&#10;Games Workshop supports this game strongly, with a wide miniature range and a large set of expansions.&#10;&#10;The Fellowship of the Ring boxed game contains: One (1) 128 page full-color rulebook, forty-eight (48) highly detailed plastic miniatures: eight (8) Men of Gondor, sixteen (16) High Elf Warriors and twenty-four (24) Moria Goblins with various evil implements of destruction, ruined building scenery, and enough six-sided dice to get you playing right away.&#10;&#10;Re-implemented by:&#10;&#10;    The Lord of the Rings: Strategy Battle Game&#10;&#10;&#10;&#10;&#10;Integrates with:&#10;&#10;    The Lord of the Rings: The Two Towers&#10;    The Lord of the Rings: The Return of the King&#10;&#10;&#10;&#10;&#10;",
        "artist": "John Blanche,David Gallagher,Nuala Kennedy,Markus Trenkner"
    },
    {
        "name": "Mordheim: City of the Damned",
        "description": "Mordheim does to Warhammer Fantasy what Necromunda does to Warhammer 40k. The game mechanics work in classic Games Workshop fashion.&#10;&#10;Instead of playing with hundreds of miniatures, you pick a warband of 1-20 models (most average at 10-12 or so), and fight a skirmish with other warbands. If you play well, your warband gains money, levels, size, and new powers, but play badly and your warband slowly deteriorates as people die or otherwise get dismembered.&#10;&#10;Games actually play very similar to Necromunda but due to the fantasy setting you should see fewer long distance shots, and a lot more hand to hand fighting.&#10;&#10;",
        "artist": "John Blanche,Alex Boyd,Talima Fox,David Gallagher,Nuala Kennedy,Karl Kopinski,Alan Merrett,Paul Smith,Geoff Taylor,John Wigley"
    },
    {
        "name": "Roller Coaster Tycoon",
        "description": "(From the box)&#10;Do you have what it takes to create the heart-pounding excitement of an amusement park?  Compete against your opponents and build the biggest and best park.  Own the rides and attractions, then compete to get the guests on 'em.  If you control the rides and attractions that the guests love you'll collect points every time they take a ride.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Stage II",
        "description": "Trivia game in two stages. First, answer a series of 6 trivia questions: 1 white chip (1 point) for each first correct answer. Secondly, find the theme that links the answers together: 1 maroon chip (5 points) for the first correct answer. Win by having the most points at the end of the game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Chicken Cha Cha Cha",
        "description": "Theme: Chickens are learning to dance (&quot;cha cha&quot;) by completing circuits around the yard.&#10;&#10;Goal: To &quot;cha cha&quot; your chicken past every single other player's chicken, stealing each one's &quot;tail feathers&quot; as you go by them. The first player to collect all of the tail feathers wins.&#10;&#10;Setup: There are two sets of large, thick cardboard tiles.  One set of 12 are shaped as octagons, and the other set of 24 are shaped as eggs. Each octagon shows a different chicken-related image, and the same image appears on two of the eggs. The octagons are spread out randomly on the table, face down. The eggs are then arranged randomly, but face up, in a large circle around the octagons, creating a kind of &quot;pathway&quot; of egg tiles that is encircling the &quot;yard&quot; (of octagons). Each player has a single large wooden chicken in their color, and each chicken has slots on its backside into which wooden &quot;tail feathers&quot; may be stuck. Each chicken begins with only one tail feather, in its color. The chickens are then placed randomly on the egg tiles, with an equal number of unoccupied tiles separating each chicken from the next chicken &quot;ahead&quot; of it on the pathway as separate it from the next chicken &quot;behind&quot; it, with the goal that they be well spread out on the pathway.&#10;&#10;Gameplay: The game is then played in turns, with players attempting to move their chickens clockwise around the pathway. On a player's turn, she looks at the image on the next egg tile in front of her chicken. The player then turns over one of the 12 face down octagon yard tiles. If the tile turned over shows the same image as the egg tile, the player moves forward one space on to that egg tile, turns the octagon back face down, and then repeats the process with the next egg tile. When the player turns over an octagon with an image that does not match the next egg tile in front of her, her turn ends and her chicken goes no farther. If the next tile in front of a player is occupied by someone else's chicken, then the player looks at the image that is on the egg tile in front of the other chicken, and then attempts to turn over the octagon showing *that* image. If the player succeeds, her chicken &quot;leapfrogs&quot; over the chicken in front of her to land on that egg tile, and in the process steals all tail feathers that the other chicken had - including those it stole from other players in the same manner. When one player has all of the tail feathers, that player wins the game.&#10;&#10;In Sum: A creative memory game that ties memory to pawn movement.  The first player to successfully memorize the images on each of the 12 octagon tiles, both from their own turns and from watching other players flip the octagons on their turns, will be able to move their chicken around the yard without stopping, and in doing so will win the game. The placement of the octagons is random, so the challenge is fresh each game.&#10;&#10;This game is part of The Chicken Family of Zoch&#10;&#10;The Zicke Zacke Igelkacke version has the same rules but hedgehogs instead of chicken, and it's in a smaller box.&#10;The Hasbro version has the same rules, but is a Dragon Tales re-theme with large cardboard dragons as player pieces.&#10;&#10;",
        "artist": "Doris Matthäus"
    },
    {
        "name": "Spitfire",
        "description": "Individual aircraft and small group combat during WWII. &#10;Bomber and air superiority missions.&#10;255 Counters&#10;&#10;Planes represented are from the early war in the European theatre. The game's namesake, for example, appears in the Mark 1 and Mark V versions only.&#10;It uses a simplified system for maneuver and combat that emphasizes game play over realism, and is very playable. Realism buffs will want to modify the rules or look for a different game.  Changes in a plane's status are recorded by moving counters rather than using a pencil and paper.  Changes in elevation, for example, are indicated by moving a counter along a looped Climb Progress track (different in length for each plane) until passing the 'top', which means the plane has climbed to the next level. At this point the counter on the board representing the plane is replaced with one showing its new level (numbered 1 - 20). Hits are noted on the speed track, such that the plane's maximum speed is reduced as it takes more hits, until the stall speed is reached, when the plane is considered shot down. Each plane uses a unique firing table printed on its record card.&#10;A plane's maneuverability is characterized by its ratings for turns, barrel rolls, wing-overs, and diving costs, as well as its acceleration.&#10;Play set scenarios, or simply pit your favourite planes against each other in a dog fight!&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "Invasion: America",
        "description": "Invasion: America is a wargame designed by Jim Dunnigan and published by SPI in 1976. It depicted a hypothetical corps-level invasion of North America by a coalition of three invaders: The European Socialist coalition, the South American Union, and the Pan Asiatic League. The game is played on a 35 inch by 42 inch map, with 400 cardboard pieces representing the armed forces in the war. As was typical of wargames of this genre, each piece had numerical combat and movement ratings printed on it. The board is divided up into small hexagons (each of which represented approximately 50,000 square kilometers). On each turn a player can move all of his pieces through a number of hexagon spaces equal to its movement rating. Then pieces in adjacent spaces engage in combat by comparing their combat ratings and rolling dice. The combat ratings and the dice roll are cross-referenced to determine the outcome of the combat. Many spaces on the map also have distinctive terrain features like forests or mountains which affect the ratings of units in those spaces.&#10;&#10;Invasion: America is intended as a four player game; one player is the defender and controlls the forces of the United States and Canada (Mexico and Central America were American-occupied territory). The other three players are the three invaders of the coalition. Each turn of the game represents one month and the game lasts for 60 turns. The North American player wins if he still controls a portion of the continent by the game's end. If the North American player loses, whichever of the invading players holds the most territory is the winner. The result is that the invaders cooperated to an extent in attacking the North American player but ultimately were competing against each other.  Invasion: America was a popular game for SPI and led to a 1978 sequel, Objective Moscow, in which it was the Soviet Union that was being invaded.&#10;&#10;Issued in both box format and flat tray&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "Napoleon at Waterloo",
        "description": "The Battle of Waterloo is perhaps the best known battle in history. The time is 18 June 1815. The Duke of Wellington's armies are drawn to defend the road to Brussels. Napoleon's superior French forces begin their assault. Can the British thin red line hold until the Prussian army arrives to fall upon Napoleon's flanks?&#10;&#10;A simple introductory wargame.&#10;&#10;Expansion:&#10;&#10;    Napoleon at Waterloo Advanced Game Expansion Kit&#10;&#10;&#10;&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "Tank! Armored Combat in the 20th Century",
        "description": "First published in Strategy &amp; Tactics magazine #44.&#10;&#10;Modern tank warfare involving individual tanks, guns, and squads. 100 counters&#10;&#10;One thing that should be mention is that only base game is included in the magazine release. The rules even say that you do not get all the markers in the base game. If you got the game as the Flat-pack, the advanced game was included. Or you could buy the advanced game as a separate add on. So be aware when asking seller about the game.&#10;&#10;Expanded by:&#10;&#10;    Super Tank I&#10;    Tank! Expansion&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Plot to Assassinate Hitler",
        "description": "Appeared in Strategy &amp; Tactics magazine #59. Attempt to assassinate Hitler and seize control of the government.&#10;&#10;Counters = 200 (Boxed Edition)&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "Operation Olympic",
        "description": "Operation Olympic is a hypothetical simulation of the planned invasion of Kyushu, the southernmost of the Japanese Home Islands in November 1945. It was designed to secure a base of operations for the follow-up Operation Coronet, which was scheduled to be launched against the principal Home Island of Honshu in March 1946.&#10;&#10;Units are regiments and brigades, hexes are 6.5 kilometers side to side, a game turn represents one week of real time. There are scenarios for solitaire and two-player games.&#10;&#10;Published in Strategy &amp; Tactics #45 (July-August 1974).&#10;&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "Terrible Swift Sword",
        "description": "Three full days of Gettysburg at a small-unit level including counters for individual leaders and horses. Many short scenarios are available but its appeal is the 125-turn 60+-hour full game. Inspiration for the Great Battles of the American Civil War series of games.&#10;&#10;The name Terrible Swift Sword is taken from the Civil War era song &quot;Battle Hymn of the Republic,&quot; which has in its opening lines &quot;He hath loosed the fateful lightning of his terrible swift sword.&quot;&#10;&#10;&#10;(from first edition,soap box side of box:)&#10;&#10;TERRIBLE SWIFT SWORD: The Three Days of Gettysburg is a grand tactical simulation of one of the most decisive battles of all time: Gettyburg.&#10;&#10;Three days of cataclysmic combat saw 50,000 Americans lost.&#10;The game utilizes colourful cardboard playing pieces that accurately represent the size and strength of all the Union and Confederate units actually involved in the battle.&#10;&#10;The beautifully illustrated map effectively portrays the unusual waves of ridges and scattered forests that criss-cross the battlefield.&#10;&#10;The units move,position,and engage for battle across the map through a super imposed hexangonal grid,which functions like a chessboard's squares.&#10;&#10;Simple probability charts determine each exciting confrontation's outcome.&#10;&#10;Contains: 32 page rules booklet; three 22&quot;x34&quot; soft map sections; 2000 die-cut cardboard playing pieces; and various play aids.&#10;&#10;",
        "artist": "Tom Darden,Larry Elmore,Ivor M. Janci,Redmond A. Simonsen,The West Point Museum"
    },
    {
        "name": "BattleBots: Kickbot Arena",
        "description": "Each player takes turns choosing a team of 5 Bots, selecting one Bot each round to fight an opponent.  Each Bot rolls 2 or 3 dice each of which can be a die that leans toward offense or defense.  Each die can have one of three results.&#10;&#10;A Super Hit destroys one of the opponent's die of your choice.&#10;&#10;A Hit destroys one Damaged die.&#10;&#10;A Damaged die is eliminated by a Hit or Super Hit.&#10;&#10;An Armor is eliminated by a Super Hit only.&#10;&#10;One player rolls his dice then the other player does the same.  After which the dice are compared and all results take place.  If one player is out of dice, his robot is destroyed and he must replace it for the next round along with a fresh bunch of dice.&#10;&#10;The game is the actual throwing of the dice.  There are four holes that the dice can fall through which eliminates them.  When you throw your dice you can use them to knock the opponent's dice into a hole or change their results.  There are also two small areas (representing the Piledriver) that if a die touches allows the opponent to throw a special die to knock another die into a hole or change the results.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Lion of the North",
        "description": "(From the publisher)&#10;The war for minds and souls had been raging for ten destructive years when the vaunted, virtually undefeated Catholic army of the Hapsburg emperor and his allied German states looked across the gentle valley of Breitenfeld directly into the blinding rays of the dawn of modern warfare. By the end of the day, Tilly's lumbering army lay smashed beyond redemption, the victim of rapid-firing artillery, fast-moving infantry and hard-charging cavalry. The prediction had come true: Breitenfeld signaled the ascendancy of Gustavus II Adolphus, King of Sweden, the Lion of the North.&#10;&#10;Lion of the North is the third volume in GMT's heralded Great Battles of History (GBoH) Series. The Thirty Years' War signaled the dawn of modern warfare ... a return to the supremacy of linear tactics, drill and discipline, to what some historians call &quot;the return of the legion.&quot; Lion of the North represents two of the most famous battles of that period:&#10;&#10;&#10;    Breitenfeld, 1631&#10;    Lutzen, 1632&#10;&#10;&#10;Scale:&#10;Time = 30 minutes per turn&#10;Map = 100 yards per hex&#10;Unit = 100 men per strength point&#10;&#10;&#10;This is in the line of GBOH games which include Alexander, SPQR, Caesar: The Civil Wars, Caesar: Conquest of Gaul, and Cataphract.  It won the Best Wargame Graphics in 1993.&#10;&#10;Components:&#10;480 full-color two-sided counters, featuring &#10;-  17 full-color two-sided 1x1/2&quot; counters representing heavy infantry (pikemen) &#10;-  24 full-color two-sided 5/8&quot; counters representing tercios  &#10;One full-color 22x34&quot; mapsheet and one full-color 17x22&quot; mapsheet  &#10;One 6-sided die, one 10-sided die &#10;32-page Rule Book &#10;16-page Scenario Book &#10;Optional Rules Sheet -- including Frenzied Units, Exploding Guns, and the Death of Gustavus &#10;Three different 8.5x11&quot; Player Aid Cards&#10;&#10;",
        "artist": "Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "World War 3",
        "description": "Army/fleet simulation of global conflict in the height of the cold war (1976-1984).&#10;&#10;Rules and map are similar to Dunnigan's (Global War) game.&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "Sorcerer",
        "description": "Sorcerer is a fantasy wargame. Each player has an army consisting of Sorcerers, human infantry, and magical units (trolls, demons, and dragons). Sorcerers specialize in types of magic represented by 7 different colors. Sorcerer adds a twist to the old &quot;combat differential&quot; system (attack strength minus defense strength) by adding a circular system of combat bonuses based upon what colors of magic are attacking each other; Blue/Green/Yellow/Grey/Orange/Red/Purple with each color having a strong advantage over it's neighbor to the right (with Purple circling around to have power over Blue) and a disadvantage against it's neighbor to the left, with lessening combat bonuses the further away the color is from itself. Combat bonuses are also given based on map position as the hexes alternate colors of magic instead of representing physical terrain. Attacking from one's own color is good.&#10;&#10;Several different scenarios are included in the rulebook that range from 1 to 6 players.&#10;&#10;",
        "artist": "Larry Catalano,Gwen England,Manfred F. Milkuhn,Linda Mosca,Redmond A. Simonsen"
    },
    {
        "name": "Sherlock",
        "description": "Sherlock is a children&rsquo;s memory style card game, with one card showing Sherlock and 49 cards showing an image, an arrow, and a number from 1-4. Players lay eight of the 49 cards face-up in a circle, with the draw pile in the middle. Before beginning the game, players take some time to memorize the images on the cards in the circle, after which all the clue cards are turned over.&#10;&#10;At the beginning of a player's turn, s/he places the Sherlock card next to a card, then names the object on the card Sherlock is next to and turns the card over to check. If s/he is correct, s/he moves around the circle, in the direction of the arrow, the number of spaces specified by the number on the card. S/he then guesses the object on that next card; if s/he is incorrect, all the cards are turned over again for the next player. If s/he is correct, however, s/he continues moving the Sherlock card around the circle in the same fashion. If the Sherlock card lands at a card that is already face up, the player takes that card and her/his turn is over. A new card is turned over from the draw pile, everyone takes a moment to memorize it, all cards in the circle are turned over, and play resumes with the next player beginning their turn.&#10;&#10;The first player to collect 6 cards wins.&#10;&#10;",
        "artist": "Oliver Freudenreich"
    },
    {
        "name": "Campaign Trail",
        "description": "Campaign Trail allows players the opportunity to campaign through the length and breadth of the USA, returning, as necessary, to those areas which may need an additional pep talk (and further funding).&#10;&#10;Unlike other American election games, Campaign Trail has a cheery luck factor which does seem an accurate reflection of the largest circus in the world. The chances of moving from state to state and finding your schedule in good shape are as likely as a succinct observation from Neil Kinnock.&#10;&#10;",
        "artist": "Rich Banner,Chris Purcell"
    },
    {
        "name": "Star Wars: Star Warriors",
        "description": "Star Warriors is a science fiction starfighter combat game based in the Star Wars universe. You can fight A-, B-, X- and Y-Wings against Tie Fighters or Interceptors&mdash;there are even rules for fighting against a Star Destroyer.&#10;&#10;Movement is simultaneous and, depending on the number of maneuvers you make and the complexity of the maneuvers, there is a difficulty value.  Your pilot has to roll against that difficulty value to get all maneuvers done.  If you don't get the roll, you blow the hardest maneuver.  The difficulty values work like in West End Games' Star Wars: The Roleplaying Game and, in fact, Star Warriors can be used with SW:TRG.&#10;&#10;",
        "artist": "Susan Kramer,Diane Malz,Kevin Wilkins"
    },
    {
        "name": "Star Wars: Battle for Endor",
        "description": "This game is a solo game that recreates the Star Wars Battle for Endor. The player plays Rebels and Ewoks in a card based movement system like the one used in Assault on Hoth: The Empire Strikes Back (also from West End Games).&#10;&#10;",
        "artist": "Bernadette G. Cahill,Stephen Crane,Jacqueline Evans,Cathleen Hunter"
    }
]