[
    {
        "name": "HeroCard Orc Wars",
        "description": "Deep within the orcish caverns, the drums begin to beat. High in the treetops, the watch sounds the horns of the hunt. The Clans are on the move, the ancient war begins anew. The Elven Champions gather, test their weapons, draw up their resolve.&#10;&#10;Under the earth, the Orcish King rails against the Elves, exhorting his troops to blood-frenzy. The Queen of the Elves bids her heroes to her, impresses upon them the nature of their task. Tonight the battle will rage. A thousand Orcs will come to slaughter, and a handful of Elves will return the favor.&#10;&#10;HeroCard OrcWars is an asymmetrical fantasy game of fierce combat for two players. OrcWars comes as a two player game with the Paladin and Orc King hero decks. It can be expanded to four players with additional HeroCard decks and figures.&#10;&#10;HeroCard OrcWars is expanded by:&#10;&#10;&#10;    HeroCard Orc Wars Ranger Expansion Deck&#10;    HeroCard Orc Wars Sorceress Expansion Deck&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Tumblin-Dice Jr.",
        "description": "A Jr. version of Tumblin-Dice. This game uses 2 sets dice instead of 4. The board is smaller and has only two 4X areas instead of three.&#10;&#10;A dexterity dice game consisting of two sets of colored dice one either slides, rolls, or flicks down a stepped surface. Usually one slides the die for better accuracy. After each person has slid their 4 dice, points are scored. You score the die roll times either 1X, 2X, 3X, or 4X depending on which area of the board the die is on. (Dice which land in the 0X region are immediately removed from play.) High scoring rolls are targets for opponents. Four rounds are played and the player with the most points win.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Inn-Fighting",
        "description": "From the publisher:&#10;&#10;The dice game of champions in the Dungeons &amp; Dragons world.&#10;From the creators of Three-Dragon Ante, the Dungeons &amp; Dragons in-world card game, comes the perfect dice game for D&amp;D players and characters alike. With a roll of the dice, you determine whether to hurl a mug of ale at the warbling bard or smash a chair over the drunken barbarian's back. Treachery and chaos abound, as every game promises a new and hilarious tavern brawling experience. Inside every Inn Fighting box you'll find a rules sheet, a set of 6 special six-sided dice, 1 twenty-sided die, and 52 character cards. Choose a character, trade some dice rolls with your friends, and see who's left standing in the end!&#10;Rob Heinsoo was a Senior Game Designer at Wizards of the Coast, Inc. He co-wrote the Forgotten Realms Campaign Setting, worked on several sets for the Dungeons & Dragons Miniatures Game, and designed the popular Three-Dragon Ante card game.&#10;&#10;Release: October 2007&#10;&#10;",
        "artist": "Attila Adorjany,Michael Martin"
    },
    {
        "name": "Victoria Cross II",
        "description": "Victoria Cross II&#10;&#10;This is a reprint of Victoria Cross with the battles of  Isandlwana, Rorkes Drift, included.&#10;&#10;The game that started it all for Worthington Games. Using the Victoria Cross system that was the first game produced by Worthington Games.&#10;&#10;Two battles, one great game! The game will include the original Victoria Cross updated with counters, updated rules, and new box. As the British player tries to stem the hordes of Zulu warriors with his trusty Martini-Henry rifle (with a bit of guts behind it!). As the Zulu player can you, through mass and guile, drive the British from your land.&#10;&#10;It is up to you to decide!&#10;&#10;",
        "artist": "Sean Cooke,Charles Edwin Fripp,Brandon Pennington"
    },
    {
        "name": "Cowabunga",
        "description": "&quot;Catch a wave in Cowabunga!, the brand-new card game of Surfin' Steer and ups and downs! Ride high on the wave, dodging obstacles as you play number cards to raise or lower the water level. If you can finish the game with the least amount of wipeouts, you'll be the big Cow-huna!&quot;&#10;&#10;Re-implements:&#10;&#10;    Fettnapf... in Sicht&#10;&#10;&#10;&#10;&#10;",
        "artist": "Jessica R. E. Bethke,Design Edge,Randy Martinez,Elisa Teague"
    },
    {
        "name": "Marrakech",
        "description": "In Marrakech each player takes the role of a salesperson who tries to outwit the others. In turn each player rolls the dice and then moves Assam, the market organizer. If Assam stops on an opponent&rsquo;s rug, the player must make a payment to its owner before putting one of their own rugs on an adjacent space. When the last rug has been laid, the total number of visible rugs and the number owned by each salesperson are added up.&#10;&#10;&#10;Game Summary&#10;Everyone starts with 10 coins and the same number of carpets. On your turn, you may rotate Omar 90 degrees. Then roll die and move him forward as many spaces as showing (d6: 1, 2, 2, 3, 3, 4); if gets to edge of board, follow curve and continue moving in now row. If he lands on another player's carpet, pay that player 1 coin per square showing that is contiguous with the landed-on square. Then, place your carpet orthogonally adjacent to Assam (but may not directly overlay another carpet).&#10;&#10;Game ends when all players have played all carpets. Each gets 1 coin per visible square. Player with most coins wins!&#10;&#10;",
        "artist": "Victor Boden,Marie Cardouat"
    },
    {
        "name": "Origins:  How We Became Human",
        "description": "The game traces the development of early human species from 120,000 years ago through to the near-modern era.  Players take the role of Peking Man, Archaic Homo Sapiens, Cro-Magnon, Neanderthal, or Homo Floresiensis, and each attempts to develop instincts and higher cortical brain functioning, such as language traits.  The populations expand and collide, and eventually consciousness, society, and culture are sought after.&#10;&#10;",
        "artist": "Phil Eklund,Tobias Naesborg"
    },
    {
        "name": "Axis & Allies:  Guadalcanal",
        "description": "From Wizards website:&#10;&#10;A sweeping conflict in the South Pacific where naval might leads to air superiority. Axis and Allies: Guadalcanal challenges you to control sea zones and island groups while managing troop and supply transport and directing land, sea, and air forces in one of the decisive campaigns of the Second World War's Pacific Theater.&#10;&#10;&#10;    Created by Larry Harris, designer of the Axis and Allies board game.&#10;    Incorporates crucial elements that were key factors in the historical campaign, such as air strip construction, troop and supply transport, and furious land, sea, and air battles.&#10;    Introduces the Cruiser unit as well as mechanics for land, sea and air combat in the South Pacific using a randomized casualties system.&#10;    Provides fans with the historical counterpoint to the World War II experience offered by Axis and Allies: Battle of the Bulge.&#10;&#10;&#10;Note the following errata from the AH website:&#10;The rulebook states that players get 5 reinforcement points, plus 2 per island they control. This is incorrect due to an error in the rulebook. The correct reinforcement scheme is that each player gets 10 reinforcement, plus 4 per island they control. The game is playable either way, but Avalon Hill recommends playing the correct way (10 and 4 per). We are sorry for any inconvenience this causes.&#10;&#10;",
        "artist": "Tommy Lee Edwards,Scott Okumura"
    },
    {
        "name": "Party & Co: Original",
        "description": "With all the fun of Party & Co games, in 5 categories:&#10;&#10;     Charades&#10;     Taboo&#10;     Trivia&#10;     Lip reading&#10;     Drawing&#10;&#10;&#10;&#10;&#10;The game comes with 2000 new questions, where speed and team play will be the keys of succeeding.&#10;&#10;Ages 14 and up&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Case Blue",
        "description": "(from MMP web site:)&#10;&#10;From 1941 through 1943, Army Group South fought a campaign in southern Russia. Hitler issued goals that ranged from the far oil fields to a city on the Volga by the name of Stalingrad, finally deciding not to decide and ordered the far flung Army Group to divide and go for both.&#10;&#10;Across endless steppe, in the blazing sun and freezing cold, the Axis legions advanced to the edge of Asia and the Caucasus mountains. Some of the oil fields, and most of the city were taken.&#10;&#10;Then the Red Army had its turn...&#10;&#10;Case Blue is a game that covers both the Axis advance (1941 and 1942) as well as the Soviet counterattacks (Nov 42 to Jan 43) and the German counteroffensive at Kharkov (Feb-March 1943) that ended the series of campaigns in the south. The game covers in great detail all the operations from October 1941 until May 1943 on a large play area extending from Voronezh almost to the Turkish border. The full scope and grandiose nature of these operations come to life here.&#10;&#10;Case Blue covers and replaces the 1994 award winning game Enemy at the Gates. Players get to encircle Stalingrad, run their pocket and relief attempts and the many operations that game covered.&#10;&#10;Case Blue is the 10th game in the award winning Operational Combat System and is the result of over 6 years of intensive research and testing. Players control units ranging from battalions through divisions (OK, there are a few very strange companies), making key decisions on the use, objectives, and means of war. The series is based on modern concepts of maneuver warfare and allows players a far more insightful look into how campaigns (large and small) really work.&#10;&#10;Case Blue is designed to be played both separately or linked to the 2001 game Guderian's Blitzkrieg II. The monster linked game allows players to run operations on the entire Eastern Front (except for Leningrad) from the fall of 1941 until mid-1943.&#10;&#10;Multiple scenarios (one map to very large) allow play to be picked up at various key points in the campaign.&#10;&#10;If you want a serious look at these pivotal campaigns while having fun at the same time, this is the game for you.&#10;&#10;Perhaps the Operational Combat System finest hour, this game is huge.&#10;&#10;Game Scale:&#10;Game Turn: Half Week&#10;Hex: 5 miles / 8 Km&#10;Units: Company to Division&#10;&#10;Game Inventory:&#10;Nine 22 x 34&quot; full-color mapsheets (Maps A, B, C, D, E, F, G, H, J, K)&#10;One 14 x 22&quot; full-color mapsheet (Map E)&#10;Ten dual-side printed countersheets (2,660 1/2&quot; Unit counters)&#10;Three dual-side printed countersheets (840 1/2&quot; Marker counters)&#10;One 48-page OCS v4.0 series rules booklet&#10;One 16-page Case Blue game rules booklet&#10;One 80-page Case Blue Scenario Book 1&#10;One 48-page Case Blue Scenario Book 2&#10;One 24-page Case Blue Axis Booklet&#10;One 24-page Case Blue Russian Booklet&#10;Two 4-page two-color OCS v4.0 Charts &amp; Tables booklets&#10;Two 6-sided dice&#10;&#10;",
        "artist": "Nicolás Eskubi,Dean Essig"
    },
    {
        "name": "World of Warcraft: The Adventure Game",
        "description": "Text from the publisher's web site:&#10;World of Warcraft: the Adventure Game is a competitive, quick-moving romp through the world of Warcraft. Taking your character from humble beginnings to the dizzying heights of power, challenging dangerous monsters and the dangers of your fellow players, will you be the one to emerge victorious?&#10;&#10;World of Warcraft: the Adventure Game features high-quality plastic figures and competitive gameplay for 2-4 players.&#10;&#10;&#10;    Multiple playable characters with detailed plastic miniatures representing the races and classes from the World of Warcraft universe.&#10;    Competitive adventure, battling other players and the dangerous denizens of Azeroth.&#10;    Accessible, engaging gameplay. &#10;&#10;&#10;World of Warcraft: the Adventure Game&#10;WC06 $39.95&#10;&#10;The base game includes a Male Dwarf Hunter (Burbonn Fang), Male Orc Warrior (Grumbaz Crowsblood), Female Undead Mage (Sofeea Icecall), and Female Human Warlock (Sandrai Darkshine).&#10;&#10;Text from the Box:&#10;Epic Legends Forged Daily&#10;Long ago, the sorcerer Medivh opened a portal to another world. Through this dark gateway came the Horde - armies of orcs and ogres driven by a simple purpose: war. Since then, the land of Azeroth has not known peace. The Alliance of humans, dwarves, and elves fought two wars against the Horde, then both were nearly destroyed by the arival of the undead Scourge and the demonic Burning Legion.  Now, the land is imperiled by undead, demons, beasts, and brigands.&#10;For those bold enough to adventure, the dangers are great... but so are the opportunities!&#10;World of Warcraft: The Adventure Game is a board game of questing and battle in the world of Azeroth. This fast-paced game pits 2-4 players in a struggle for glory and valor as they travel the Eastern Kingdoms battling monsters, completing quests, and vanquishing each other in their bid for supremacy.&#10;Each player takes on the role of one of four distinct characters, each with his own unique deck of ability cards for battling countless enemies, including other players! A straightforward, but robust combat system keeps the action moving quickly as characters grow in power and accumulate treasure. A wide variety of discoveries, events, and location make every game unique and immersive.&#10;Only one hero can be the greatest adventurer in Azeroth!&#10;&#10;Expanded by:&#10;&#10;    World of Warcraft: The Adventure Game &#226;&#128;&#147; Dongon Swiftblade Character Pack - Male Troll Rogue&#10;    World of Warcraft: The Adventure Game &#226;&#128;&#147; Zowka Shattertusk   Character Pack - Female Orc Shaman&#10;    World of Warcraft: The Adventure Game &#226;&#128;&#147; Brandon Lightstone Character Pack - Male Human Paladin&#10;    World of Warcraft: The Adventure Game &#226;&#128;&#147; Artumnis Moondream Character Pack - Male Night Elf Druid&#10;    World of Warcraft: The Adventure Game &#226;&#128;&#147; Brebo Bigshot Character Pack - Male Gnome Mage&#10;    World of Warcraft: The Adventure Game &#226;&#128;&#147; Shailara Witherblade Character Pack - Female Night Elf Warrior&#10;    World of Warcraft: The Adventure Game &#226;&#128;&#147; Wennu Bloodsinger Character Pack - Female Troll Priest&#10;    World of Warcraft: The Adventure Game &#226;&#128;&#147; Thundershot Character Pack - Male Tauren Hunter&#10;&#10;&#10;&#10;&#10;",
        "artist": "Tim Arney-O'Neil,Kevin Childress,Jesper Ejsing,Zoe Robinson"
    },
    {
        "name": "Beowulf: The Movie Board Game",
        "description": "Beowulf: The Movie Board Game is a reimplementation of Reiner Knizia's Kingdoms. It's also not to be confused with the same author's Beowulf: The Legend. It's an abstract strategy clothed in a theme based on the movie directed by Robert Zemeckis. The players' goal is to score the most victory points by clever tile and figurine placement on the board, composed of squares arranged in a grid. Its layout is changed, as the game is divided into three chapters that feature slightly different sets of tiles that can be drawn. Clever hand management (of tiles and figurines) is also important in the game, as some of them can be used only once throughout the entire game. Gameplay is as follows:&#10;&#10;1. On his or her turn, a player may either place a tile (which can be a negative or a positive number, feature a special power or not) or a figurine on the board. If the player wishes to place a tile, he/she can add one to his/her hand of two and place one of the three tiles. Special powers of these tiles may be: displace a figurine, swap a tile from the board from the one from a player's hand, block other tiles, increase the power of figurines in the same row/column, cancel positive numbers on tiles, swap two tiles on the board.&#10;&#10;2. By placing tiles and figurines, players will form rows and columns. After the board is full, the value of each figurine is calculated. Each figurine has a value of 1-4. This value is multiplied by the sum of values of all tiles from tiles that are in its row and column. Special powers of tiles may apply here (like the increasing of figurines' power or blocking). Players evaluate all their figurines on the board and gain points equal to their value.&#10;&#10;This game differs considerably from its predecessor (not all of these may apply to the third English edition by Fantasy Flight Games released in 2012):&#10;&#10;1. In Kingdoms, all three acts took place on the same board. Here, the board is two-sided, with three varying grids.&#10;2. There are more positive tiles than negative ones in this game, therefore situations when players lose points for their figurines are much less frequent.&#10;3. Here, a player manages a hand of three tiles. In Kingdoms, the players had no hand. Instead, he/she drew a single tile which had to be placed on the board.&#10;4. There are more tiles with special powers. More tiles can be swapped, even figurines can change their position, which didn't happen in Kingdoms.&#10;&#10;",
        "artist": "Kevin Childress"
    },
    {
        "name": "War: Império Romano",
        "description": "War, the Brazilian Risk-like game is making 35 years and to celebrate that they're releasing this new light wargame: War - Imp&eacute;rio Romano takes the same mechanics to a new level. This game focus on shorter game length than its predecessor and allows for less players (3 or 4 in this version, compared to 3 to 6 in the original version).&#10;&#10;From the official rules manual (in portuguese):&#10;The Roman empire was one of the greatest and longest empires in history. It started before the birth of Christ (B.C.) and lasted, in the East, until year 476 A.D. (anno domini) and, in the West, until 1453 A.D. Let us go back to year 140 D.C., when this Empire reached its greatest extension and dominated practically all Europe, part of Asia and northern Africa. Times that were not completely peaceful, for enemies threatened the borders of the empire and the conquered people insurrected against domination, seeking freedom. Go back in time with War: Roman Empire and feel the thrill of defending your borders and advancing your legions, conquering provinces of the roman world in 140 A.D.! Observe, though, that the political division of the provinces adopted in the board objectives to ease the game mechanics, and not portrait the reality of that age. All province and sea names are written in latin. Only the region names are in portuguese. Each players is dealt an objective, that will only be known by himself. The knowledge of this objective by other players will make your conquest harder. It is important for the player to, when reading the rules, try some practical plays, simulating, inclusively, the mentioned examples. This way it will be much easier to understand the mechanisms of WAR.&#10;&#10;Re-implements:&#10;&#10;    War&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Lupusburg",
        "description": "A brief description from BGN's own Andrea &quot;Liga&quot; Ligabue (Boardgame News):&#10;&#10;This game is the sequel to Lupus in Tabula; the Tabula inhabitants have moved into the city, but there is a little problem&mdash;the werewolves have moved there, too! This game keeps the theme and part of the mechanism of the famous party-game precursor, but this time it's for 3-8 players. Note that Lupusburg isn't an expansion, although it is possible to combine parts of the two games.&#10;&#10;",
        "artist": "Gianpaolo Derossi"
    },
    {
        "name": "Würfel Bingo",
        "description": "In W&uuml;rfel Bingo, a.k.a. High Score, each player takes a dry erase marker and a glossy game board with a 5x5 matrix. A round consists of 25 die rolls of two standard six-sided dice. After each die roll, each player places the sum rolled into one of the fields on his game board. After 25 rolls, each player tallies his points; each row and column scores 1-12 points depending on whether it's filled with a pair of matching numbers, a triple, a full house, a straight, a five-of-a-kind, and so on, with points scored along the diagonals being doubled. After three rounds, whoever has the highest cumulative score wins!&#10;&#10;W&uuml;rfel Bingo, unlike High Score, features a double-sided game board with a 6x6 matrix on the reverse. When playing with this side, the game lasts only two rounds.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Last Night on Earth: The Zombie Game",
        "description": "Last Night on Earth, The Zombie Game is a survival horror board game that pits small-town Heroes head-to-head against a horde of Zombies. A team of four heroes is chosen by one set of players, and the Zombies are controlled by 1 or 2 players. Each hero has its own special abilities. The board is modular, which changes the layout of the town and start positions of each hero.  The game comes with several scenarios, which include simple survival, rescue, or escape. Differing combinations of heroes, scenarios, and board configurations offer a lot of replayability.&#10;&#10;A Hero deck and a Zombie deck deliver tactical bonuses to each side. Combat is resolved using 6-sided dice, modified by the weapon cards heroes may be equipped with. Many of the cards include zombie movie tropes to achieve a feel of playing out a horror movie.  All the game art is photographic, enhancing the cinematic feel. The game also comes with a CD Soundtrack of original thematic music.&#10;&#10;Each hero has its own plastic sculpted miniature. The game also has 14 zombies in two colors. Other objects and effects are represented by high-quality cardboard counters.&#10;&#10;",
        "artist": "Jack Scott Hill"
    },
    {
        "name": "Ici, c'est la France! The Algerian War of Independence 1954-62 ",
        "description": "This game covers the French insurgency war against FLN in Algeria during 1954-62. It is a conflict of great drama. It cost the lives of at least half a million Algerians, it brought the tumultuous exodus of one million French settlers from Algeria and it brought France itself to the brink of civil war. But to be portrayed as a game has its difficulties, though. How do you recreate the fact that the side which lost militarily won the war? How do you make it interesting to play when FLN never succeeded in creating an army, like the Viet Minh did in the Indochina war, and therefore was never able to rival the French?&#10;&#10;To address this, the game contains &ldquo;three games&rdquo; within the game: A political, an insurgency and a military game. Politics are driven by chits which alter four parameters: FLN structure; Algerian population; Pied noir feelings (the French settlers in Algeria) and French public/government. Each one will affect the play, in different ways, when it changes. What eventually ends the game is when the French public reaches 0 and calls for a referendum. Then you check each region whether they will vote to stay with France or become independent. If a majority votes pro-France, the French player win and vice versa. It is through different insurgency or counterinsurgency actions that you will make a region pro-FLN or pro-France. Finally, the military part will allow you to contest or control regions. This will affect your ability to mobilize, tax and conduct insurgency/counterinsurgency actions.&#10;&#10;In other words, you will have to fight to control, conduct insurgency/counterinsurgency actions in order to win the hearts and minds of the population and, through politics, see to it that the public in France either supports you or gets fed up with the war. Some things might help you in one way but at the same time give disadvantages in other aspects. Nothing in war is purely a good decision. There is always a cost.&#10;&#10;Each year has four gameturns. You start the game with eight random political chits of 28 possible ones. Each chit may only be played during a certain time span and after you play a chit you will draw a new one.&#10;&#10;The &ldquo;operation points&rdquo; are the main engine in the game. You will receive a certain number of points and with these points you will pay for everything you do, like recruiting or bringing in reinforcements, certain movement, fighting and conducting insurgency/counterinsurgency actions.&#10;&#10;FLN recruitment will depend on how pro-FLN the Algerian population is and how efficient the FLN structure is. It will also depend on population density and whether they control a region or not. The French can bring in new units and replacements, but it will cost operation points and put pressure on the French public. So the reason to attack is to control/contest as much as possible and to force the opponent to spend operation points to replenish his force.&#10;&#10;The counters have no movement points. With a gameturn of three months there is no lack of time to position units anywhere on the map. You follow the road network (as French) but it will cost you operation points when you pass regions which are controlled by the enemy. FLN moves off-road and will have some limitations to whether they may leave a region or not. The numbers represent strength and quality.&#10;&#10;Fighting will include combat chits which in certain combination will affect the combat. My first ambition is to minimize the amount of tables in order to make the game faster to play. You roll a number of dice corresponding with your strength and modify your roll with the difference in quality. You get a hit when you roll 5-6. The complexity and difficulties lies more in what to decide and when to do it.&#10;&#10;Best regards&#10;Kim Kanger&#10;&#10;&#10;",
        "artist": "Kim Kanger,Randy Lein"
    },
    {
        "name": "Rock of the Marne",
        "description": "(from MMP website:)&#10;&#10;Rock of the Marne: The Second Battle of the Marne, 15 July to 25 July, 1918 covers both the final attack of the German army in July 1918, and the Allied counteroffensive that produced the battle known to Americans as the Second Battle of the Marne. The Germans believed they could launch an offensive on both sides of Reims, which would pinch out an Allied salient and draw in Allied reserves, and thus possibly produce a breakout across the Marne leading to the final drive to Paris. Despite gaining their bridgehead across the Marne, the Germans did not expect the fierce resistance offered by the Allies including the American 3rd infantry division-which earned its honorific name &ldquo;Rock of the Marne&rdquo; for its steadfast defense.&#10;&#10;An even bigger surprise awaited the Germans, however, when the Allies attacked them with crushing power from a wholly unforeseen direction three days later. Refusing at first to relinquish the initiative, the Germans showed why they were masters of defensive warfare in World War 1 as they exacted a fearsome toll in casualties from the attackers including the American 1st and 2nd infantry divisions.&#10;&#10;Rock of the Marne shares many of its design features with MMP&rsquo;s earlier game on the 1918 battles - Operation Michael. The Germans&rsquo; striking power consists of the battle-depleted, but still dangerous, stosstruppen. Trained specifically in infiltration tactics, these hard-core infantry units can find a way to pick apart the toughest Allied defensive position. The Germans also have mobile, and deadly, machine-gun units that will wreak havoc on unwary attacking Allied units. The Allies used tanks in record numbers in their initial assault, and these are shown in the game, as well as the six big American divisions that participated including the famous 1st Infantry Div, The Big Red One, the 42nd Infantry Div, the Rainbow Division, as well at the 3rd.&#10;&#10;The air game has been significantly expanded in Rock of Marne as both sides deploy their air assets to bomb bridges, and strafe infantry. Finally, both the Allied and the German player must learn to operate within their constraints and opportunities of the WWI command and control environment, which means you may not automatically get to attack with all the units you had planned!&#10;&#10;Contents:&#10;&#10;    One 22&quot;x34&quot; map&#10;    280 counters (1 countersheet)&#10;    Series Rules&#10;    Rock of the Marne Specific Rules&#10;    Two Dice&#10;&#10;&#10;&#10;&#10;&#10;Part of the Standard Combat Series.&#10;&#10;",
        "artist": "Nicolás Eskubi,Dean Essig"
    },
    {
        "name": "GD '42",
        "description": "GD &rsquo;42: The Battle in the Luchessa Valley, 29 November - 4 December, 1942, covers the desperate battle for survival of the GD Division as it faced down the entire Soviet 3rd Mech Corps (with over 200 tanks) over several days. 25 November, 1942: As part of Operation Mars, the Soviet 238th Rifle Division, supported by tanks of the 49th Tank Brigade, attacked into the Luchessa Valley, trying to create a breach for the waiting 3rd Mech Corps to exploit. For reasons still unknown, right before the attack the German 9th Army ordered three battalions the GD Division to move to the Luchessa Valley as OKH reserve, thus backing up the weak 216th Grenadier Regiment. Because of the presence of the GD, the Soviets were unable to force a breakthrough and decided to commit the 3rd Mech Corps into the meat grinder to force the issue...&#10;&#10;Designer Wig Graves conducted extensive research, combing both German and Soviet sources to create the order of battle. The Soviets begin with seemingly overwhelming force, while the Germans trade space for time and attempt to rush reinforcements to the front to plug inevitable gaps. While the Germans are primarily on the defense, careful counter-attacks against the relatively immobile Soviet formations can prove to be key to victory. And if the Soviets do not preserve their forces carefully, they will end with the historical result: stable German lines and an entire mechanized corps wrecked.&#10;&#10;GD &rsquo;42 uses the new Tactical Combat Series rules. The features of TCS 4.0 rules are:&#10;Vehicle impulses increase operational tempo for tanks&#10;Introduction of spotting ranges&#10;Streamlined assault rules&#10;Combined Area and Point Fire table&#10;Introduction of morale for vehicles&#10;Enhance combined arms effects&#10;Artillery subsystem improved&#10;&#10;Game Scale:&#10;Game turns: 20 minute daylight turns/1 hour night turns&#10;Hex: 125 yards / 20 meter contours&#10;Units: Individual guns/tanks to Platoon size&#10;&#10;GD'42 Contains:&#10;3 22&rdquo;x34&rdquo; maps&#10;3 countersheets (840 &frac12;&rdquo; counters)&#10;1 TCS 4.0 Series Rulebook&#10;2 TCS 4.0 charts&#10;1 GD &rsquo;42 Rulebook&#10;2 Morale Charts&#10;2 Dice&#10;&#10;",
        "artist": "Nicolás Eskubi"
    },
    {
        "name": "Zombie Fluxx",
        "description": "Zombie Fluxx is the zombie uprising card game with ever-changing rules. There is now a new type of card: Ungoal cards (conditions in which everybody loses!)&#10;&#10;Fluxx is a card game where the cards themselves determine the current rules of the game. By playing cards, you change numerous aspects of the game: how to draw cards, how to play cards, and even how to win.&#10;&#10;At the start of the game, each player holds three cards and on a turn a player draws one card, then plays one card. By playing cards, you can put new rules into play that change numerous aspects of the game: how many cards to draw or play, how many cards you can hold in hand or keep on the table in front of you, and (most importantly) how to win the game. There are many editions, themed siblings, and promo cards available.&#10;&#10;Part of the Fluxx series.&#10;&#10;",
        "artist": "Derek Ring"
    },
    {
        "name": "Transformers 3D Battle Card Game",
        "description": "From Wizards' website:&#10;&#10;Based on the film releasing July 4th, with additional favorites from TRANSFORMERS history, the TRANSFORMERS 3D battle-card game lets you take total control of your favorite AUTOBOT and DECEPTICON characters! Crack open a pack and start building your 'bots. Or, build them in their vehicle form using the same set of pieces! Once you've assembled your characters, battle away, because even though they're fun to put together, they're even more fun to play with!&#10;&#10;Each battle pack comes with four randomly inserted constructible cards (enough to build two characters), two stat cards containing character and battle information, a token card, and game rules with assembly diagrams.&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "Inwigilacja",
        "description": "&quot;Inwigilacja&quot; is a game about politicians, who are trying to win support for their parties. They do this by unmasking the opponents' scandals. &quot;Inwigilacja&quot; is a deduction game, similar to &quot;The mystery of the Abbey&quot;, it is a heavy satire on Polish parliament and government.&#10;&#10;The game contains the following components:&#10;&#10;- the deck of 54 files cards&#10;- the deck of 45 action cards&#10;- 10 answer cards&#10;- 10 pawns&#10;- 5 locations&#10;- 1 poll results (victory) track&#10;- 1 die&#10;- notebooks&#10;- the rulebook&#10;&#10;",
        "artist": "Włodzimierz Chołostiakow"
    },
    {
        "name": "Municipium",
        "description": "A prime mechanism of Roman expansion and control in the provinces was the municipium (pronounced MU-ni-KIP-ee-um), the premiere Roman provincial town.  Being granted the status of a municipium brought a town into the Roman orbit and involved both duties to Rome and a gradual extension of the Roman citizenship to the inhabitants.&#10;&#10;This game takes place in one of these municipalities in a western province.  The time is the middle of the 2nd Century AD, when the Empire had reached its greatest territorial extent and was enjoying its longest period of imperial peace.&#10;&#10;Players are each in control of a powerful family and try to strategically place their family members in the various institutions throughout the municipium and gain the support of the citizens: Scholars, Merchants, Soldiers, and Priests.  At various times during the game, if a player has the most influence in an institution, the player can exert the power of that institution and gain the support of certain citizens.  Meanwhile, the praefect moves around the municipium and players strive to have the most influence in the institutions that he visits, thereby earning his favour.  Each of these institutions have unique powers, and players must decide how and when to use them.  The player best utilizing their power will become the most influential family in the municipium.&#10;&#10;Municipium is #2 in the Valley Games Modern Line&#10;&#10;",
        "artist": "Mike Doyle (I)"
    },
    {
        "name": "Castle Knights",
        "description": "The premise here is that all of the players are Knights working together to build three new towers before King Duncan returns home to his castle.&#10;&#10;Unfortunately, your only building tool is a bizarre device made of satin cord, wooden balls, and what appears to be an elastic ponytail holder.  (Clearly, the material culture of the Middle Ages is full of surprises!) You use this device to pick up, move, and deposit various building blocks and the wooden figures of the Prince, the Princess, and the Ghost who top the towers.&#10;&#10;Which towers you are required to build (i.e. what blocks in what order) are determined by drawing cards.  If you succeed in constructing the tower illustrated before the timer runs out, then you keep that card.  If you fail, King Duncan moves forward one space.  Collect three cards before he gets to the castle and you win.&#10;&#10;Ages 5 and up.&#10;&#10;",
        "artist": "Ulrike Fischer"
    },
    {
        "name": "HeroCard Nightmare",
        "description": "Horror in a Small Town. An enchanted camera has drawn you into an ever-shifting nightmare. Your only hope of escape is to maneuver the other players to their deaths before they do the same to you!&#10;&#10;HeroCard Nightmare is a surreal psychological thriller in which the last surviving dreamer wins. Nightmare blends deductive, clue-like gameplay with fast-paced HeroCard dueling, and sets them inside a modular, ever-changing landscape of gothic horror.&#10;&#10;Nightmare is a HeroCard game, and comes complete with four HeroDecks. Nightmare does not have any expansion decks, as all four characters come complete within the Nightmare box.&#10;&#10;Nightmare is compatible with all the other HeroCard games.&#10;&#10;",
        "artist": "Gregor Benedetti"
    },
    {
        "name": "Infernal Contraption",
        "description": "Game description from the publisher:&#10;&#10;An infectiously fun non-collectible card game for 2-4 players, Infernal Contraption pits goblin mechanics against each other in a race to assemble often-backfiring, nigh-uncontrollable magical machines. Through the strategic placement of arcane components like arcantric funnels, chthonic grinders, and entropic processors, these bodgers risk life and limb to overcome the competition with the ultimate Infernal Contraption.&#10;&#10;The second edition of Infernal Contraption includes cards from the Sabotage! expansion and a special promo card for the Bodgers Game Heap.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Tai Chi Chuan",
        "description": "A card containing a letter is turned over. The active player proposes a word starting with this letter then, if he wishes it, turns over a new card and must propose a new word starting with the first turned over letter and containing the new letter. He proceeds, as long as he feels able to include the next letter.&#10;Of course, if you cannot find a word containing all the letters, you do not have to turn a new card over.&#10;If the active player decides to stop, the other players can try to do better while drawing a new letter at their turn...&#10;&#10;When you are the last to propose a word, you gain all cards including the same symbol. When the game ends, the player who has the most cards is declared the Winner.&#10;&#10;",
        "artist": "Arnaud Quere"
    },
    {
        "name": "Tomb",
        "description": "Recruit a Party. Kill the Monsters. Take Their Stuff!&#10;&#10;Tomb pits opponents against one another in a game of monsters, traps, treasures, and spells. Attempts to capture the dungeon crawl experience without hours of preparation. Assemble a crack squad of adventurers and enter the fabled Goldenaxe Catacombs in search of glory and hidden treasure. With Tomb&rsquo;s unique set-up and character recruitment, you&rsquo;ll never play the same game twice.&#10;&#10;Integrates with:&#10;&#10;    Tomb: Cryptmaster&#10;    INVALID OBJECT ID=67350, type=thing&#10;&#10;&#10;&#10;&#10;",
        "artist": "Nate Barnes,Jason Engle,Carl Frank,Jonathan Hunt,Rodney Saenz,Chris Seaman"
    },
    {
        "name": "Stoplights",
        "description": "Stoplights is a game for 2 or 3 players that is easy to learn, quick to play, and fun for all ages.&#10;&#10;Players start with 4 cards each and compete to be the first to line up 5 of their color stoplights horizontally or diagonally.&#10;&#10;On a players turn they may play a card and draw a replacement, cover any card on the table with one from their hand, or draw 2 cards. That's it! It sounds easy, but it is hard to do.&#10;&#10;Games sometimes last only seconds, but most last several minutes. The strategies are deep, but the game is easy enough a 5 year old can win.&#10;&#10;As an educational tool, Stoplights is a great way to help young ones count, and group colors.&#10;&#10;Fans of strategy games will find it a quick, but challenging filler.&#10;&#10;This game is suitable Ages 4 and up&#10;&#10;",
        "artist": "Paul Niemeyer"
    },
    {
        "name": "Scandaroon",
        "description": "Scandaroon is an engaging and quizzical card game for 3 or 4 players played over four rounds. Players are dealt a hand of cards each round, with which they will compete to create their own high scoring row, while seeking to minimize their opponents&rsquo; scores.&#10;&#10;Players are awarded victory points for specific achievements during the game, such as getting the highest score in a single round, and victory points may change as the game develops.&#10;&#10;Scandaroon has a scoreboard, a set of wooden markers for each player and a pack of special cards, each of which has a scoring value, a suit, and an effect or ability that will modify the scoring values of other cards.&#10;&#10;&quot;Scimitar Lusts To Take A Life Away&#10;Subtle Strength Is Gained 'Neath Crescent Moon&#10;Courtly Intrigues Follow Turbans' Play&#10;Cross-Tiles Their Gifts Bestows In Scandaroon&quot;&#10;(extract from 'The Rubiyat of Th&rsquo; Noble Lady yon')&#10;&#10;",
        "artist": "Tony Boydell,Charlie Paull"
    },
    {
        "name": "Okko: Era of the Asagiri",
        "description": "Okko is a miniature game that is played on a board with squares.  It simulates skirmishes between Samurai and other typical Japanese-inspired characters (Ninjas, Geishas !!!) in the empire of Pajan.  Each player controls from 4 to 6 characters&#10;&#10;Okko is released as basis boxes containing the rules, adventure book, 6 double sided modular game boards, 10 special dice and 20 cardboard miniatures.&#10;&#10;There are pewter miniatures (unpainted) to replace the cardboard minis included in this game.&#10;&#10;Okko is inspired from a comic published by &quot;Les Editions Delcourt&quot; (French), &quot;Archaia Studios Press&quot; (English) and &quot;Silvester Strips&quot; (Dutch), &quot;Carlsen Comics&quot; (German)&#10;&#10;",
        "artist": "Hub,François Lecocq,Geoffrey Stepourenko"
    },
    {
        "name": "D-Day at Omaha Beach",
        "description": "Solitaire study of America's most bloody and heroic day in WWII. The player controls the US forces landing along the five mile stretch of Omaha Beach on D-Day and their desperate struggle to establish a viable beachhead. The game covers the entire first day at a time scale that varies from 15 minutes per turn (during the initial landings) to 30 minutes per turn later in the day. Units are companies and include assaulting infantry, engineers and amphibious tanks. The game system controls the hidden German defenders in their &quot;Widerstandsnest&quot; resistance points, revealing the defenders and their reserves as the American survivors of the first landing waves make their way up the bluffs. Rules cover amphibious landings, German fields of fire, artillery, tidal movement, and intangibles such as US leadership under fire and the initiative of the American GI. One map, two counter sheets, 55 cards.&#10;&#10;Additional Notes:&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;=====&#10;&#10;352 counters. Basic unit size is the US infantry company. German units consist of Widerstandsnest crews and reinforcement infantry companies. US tanks, and some US artillery, AA and anti-tank units are also included. US engineers are represented abstractly, clearing beach obstacles early in the game and opening traffic routes off the beach later in the game.&#10;&#10;The 34&quot; x 22&quot; map depicts the entire Omaha invasion area 9km long, going inland 4km, at 250 meters per hex. Hexes are oversized (almost 1&quot;) so that symbology facilitating German placement, fire and actions can be seen without having to pick up units.&#10;&#10;Time scale is 15 minutes per turn from 0600 hours to 1000 hours, shifting to 1/2 hour turns from 1000 to 1800 hours.&#10;&#10;A deck of 55 cards performs triple duty -- determining results of US amphibious landings, determining an event each turn, and determining which German units fire or perform other actions each turn.&#10;&#10;The game's solitaire system is based on that used previously in Operation Jubilee: Dieppe, August 1942.&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;=================&#10;&#10;Decision Games Omaha Beach official url: http://shop.decisiongames.com/ProductDetails.asp?ProductCode=1018&#10;&#10;",
        "artist": "Joe Youst"
    },
    {
        "name": "DICEcapades",
        "description": "Can you stack six dice on top of each other within thirty seconds? Who can be the first person to roll a triple? Can you name as many state capitals as your roll? Know what arachibutyrophobia is? Arachibutyrophobia??? DICEcapades &ndash; which includes a mixture of dice games, physical challenges, artistic creations, and trivia questions &ndash; doesn't involve just the luck of the dice, but also the smarts of the roller!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Robotics",
        "description": "Each player has its own robot production company. In order to build robots in time, players have to acquire, trade and build robot parts. Players sabotage each others production line which can lead to total destruction of an almost finished robot. Some construction parts are illegal and if the inspectors come to your factory they can confiscate your illegal parts.&#10;&#10;Robotics is a crazy construction and trading game for 3-4 players in a not too distant future.&#10;&#10;",
        "artist": "Michael Menzel"
    },
    {
        "name": "Hop Hop Hooray!",
        "description": "Jump contest at the frog lake! Can you jump far enough to reach the lake? But you only get points if you can place three frogs in a row.&#10;&#10;",
        "artist": "Michael Schober"
    },
    {
        "name": "The Very Hungry Caterpillar Game",
        "description": "Players spin the spinner and move their caterpillar box around the board, adding food pieces to their box.  At various points, players must collect enough food to proceed.  First player around the board wins.&#10;&#10;This is a different game from the same-named Very Hungry Caterpillar Game, which is made further confusing because both games have very similar box-fronts, using the same picture from the cover of the book.  This game requires players to move around a board and collect food, meeting certain goals along the way.&#10;&#10;",
        "artist": "Eric Carle"
    },
    {
        "name": "Athens & Sparta",
        "description": "Athens &amp; Sparta is a strategic level block game of the Peloponnesian War, fought from 431BC to 404BC. This war pitted the superior wealth and naval power of Athens against the militarism of Sparta. It was a bloody contest, with many heroic triumphs and great atrocities. Victory by Sparta ended the Golden Age of Greece.&#10;&#10;This game provides insight into why the war was fought the way it was. One player controls the wealthy and sea faring Athenians, the other the powerful armies of the Spartans. The object is to control important city-states that dotted the Grecian landscape.&#10;&#10;In order to create a fog of war, unit blocks are stood up with the backs facing the opponent. In this manner the opponent cannot tell the type or the strength of the units being deployed against him until battle begins. Along the sides of the unit blocks, only visible to the owner until it comes time for combat, are numbers that represent the strength of the unit. The current strength is on top. As the unit takes losses, it is rotated so a lesser value is on top.&#10;&#10;",
        "artist": "Chris Collingwood"
    },
    {
        "name": "Star Fleet Battles: Captain's Edition Basic Set",
        "description": "The lead product of Star Fleet Battles Captain's Edition.  This is the fourth edition in the Star Fleet Battles series, and it is the current edition.&#10;&#10;There have been two major reprintings of the rules, each of which incorporates some errata and cleanup in the rules in 1999 and 2005. These can be identified by a year printed on the lower part of the front cover.&#10;&#10;Re-implements:&#10;&#10;     Star Fleet Battles&#10;     Star Fleet Battles Designer's Edition&#10;     Star Fleet Battles Commander's Edition&#10;&#10;&#10;&#10;&#10;",
        "artist": "Leanna M. Cole,Michael Winterbauer"
    },
    {
        "name": "Monopoly: Tropical Tycoon DVD Game",
        "description": "Tropical Tycoon is a modified version of Monopoly that incorporates new rules, new pieces, and new winning conditions.  It uses a DVD (required) to generate random events.&#10;&#10;New additions include:&#10;&#10;Players have Jobs that give individual advantages.&#10;&#10;In addition to beach houses (houses) and resorts (hotels), properties can be developed with Casinos, Parks, Restaurants, and Piers.  The rent for the Casino is pure luck, but sometimes the owner has to pay out to the visitor.  Parks don't garner much rent, and what rent they gather is based on the weather, which can change with every Chance or Community Chest event (the Park's main benefit is its worth in Fortune Tokens at game end:  A Park on Gentle Sands is the equivalent of four million dollars cash at the end of the game).  Piers' rent depends not only on the weather, but also the presence or absence of a cruise ship, which is also affected by the card events.  Finally, Restaurants' rent is dependent upon the neighboring property improvements.  There are very few of these developments, though, so the competition for them can be fierce!&#10;&#10;Although the basic board layout is the same as a standard Monopoly board, there are no Chance and Community Chest cards; when a player lands on one of those two spots, the DVD determines what happens.&#10;&#10;One of the dice has a TV symbol in place of the 1-pip; when the TV is rolled, a News Broadcast is played on the DVD, which triggers a random event (much like Chance or Community Chest).&#10;&#10;Players collect Fortune Tokens (and earn them at the end of the game through their cash and property holdings).  Play ends when one player goes bankrupt (or, alternately, whenever the players decide to stop).  The player with the most Fortune Tokens at the end of the game wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Munchkin Quest",
        "description": " From the Publisher: &#10;Kill the monster, grab the treasure, stab your buddy. That's what it's all about. Now, Munchkin comes to the boardgame.&#10;&#10;Cooperate with the whole group, adventure with a partner, or strike out on your own. You don't know what's behind a door until you open it . . . then another tile is added to the dungeon. Battle monsters for power and treasure, or send them after your friends. Reach Level 10, and then get out alive if you can!&#10;&#10; Components: &#10;&#10;     200 Cards&#10;     27 Health Tokens&#10;     69 Gold Pieces&#10;     12 Dropped Item Tokens&#10;     15 Move Tokens&#10;     12 Search Result Tokens&#10;     4 Level Counters&#10;     4 Munchkins&#10;     12 Monster Bases&#10;     24 Room Tiles&#10;     1 Entrance Tile&#10;     73 Links&#10;     38 Monster Standies&#10;     8 6-Sided dice, two for each player&#10;     1 10-Sided die&#10;     1 six-colored Monster Die&#10;     1 20-page rulebook&#10;&#10;&#10;&#10;&#10;Part of the Munchkin series&#10;&#10;",
        "artist": "Fox Barrett,Alex Fernandez (I),Richard Kerr,John Kovalic,Will Schoonover"
    },
    {
        "name": "Leaping Lemmings",
        "description": "Leaping Lemmings - The Original Cliff Divers&#10;&#10;Leaping Lemmings is a humorous game for 2-6 players. Each player controls a cloned clan of lemmings that have been specially trained to compete with the other lemming clans, all trying to scurry down a canyon and hurl themselves over a cliff. Distance and style points are important. One lemming diving with style and &eacute;lan is worth as many as five of the more mundane divers. But beware the hungry eagles circling overhead or your lemmings might not even make the cliff edge!&#10;&#10;Objective: The player with the most victory points wins the game. To earn victory points, players dive their lemmings over the cliff edge and/or collect Lemming Chow Pellets.&#10;&#10;The game board is a hex-based map representing the canyon down which up to six separate lemming clans will travel. The canyon ends with the cliff edge hexes, which are the lemmings' ultimate goal. Between the lemmings and their goal there are two eagles circling overhead hoping for multiple lemming snacks.&#10;&#10;Each turn a movement card is revealed which will allow for 2-5 lemming movement points. Card luck is mitigated in that all players use the same card to move that turn. Only the top lemming in each stack is allowed to move, so covering your opponents' lemmings is one tactic that is used to slow them down. The down side is that the top lemming in each stack is the only one in danger of becoming eagle chow.&#10;&#10;Special Actions allow players to briefly alter the normal rules of the game to their advantage or to their opponents' detriment. There are 16 different Special Actions in the game.&#10;&#10;Home Page: http://www.gmtgames.com/p-143-leaping-lemmings.aspx&#10;&#10;",
        "artist": "Rodger B. MacGowan,Leona Preston,Mark Simonitch"
    },
    {
        "name": "Little Italy",
        "description": "Travel back to New York's golden age of gangsters, where you get to take on the role of a crime boss in 1950's Little Italy. Make your rounds about town as you pick up money from different buildings, but watch out for the &quot;heat&quot;!&#10;&#10;Each crime boss shares control of two cars, each with a different opponent. Drive through the streets, timing it right to collect money and avoid the police.&#10;&#10;Play strategically, and you'll be able to drive your opponents straight into a stakeout, costing them big money while you collect the big score. If you don't, you'll find yourself sleeping with the fishes!&#10;&#10;",
        "artist": "Jessica R. E. Bethke,Design Edge,Randy Martinez,Elisa Teague"
    },
    {
        "name": "Cheeky Monkey",
        "description": "The push-your-luck game Cheeky Monkey includes eight sets of animals &ndash; three elephants, four seals, and so on up to ten monkeys &ndash; with a plastic chip representing each animal. To start the game, you place all the chips in a bag.&#10;&#10;On a turn, a player may draw chips until either (1) he chooses to stop or (2) he draws an animal that he has lying in front of him from a previous draw this turn. In this latter case, he returns all chips in front of him from the current turn to the bag, and the next player then takes his turn. In the former case, he stacks the chips in whatever order he wants on top of any chips he's collected in previous turns. (If a player has animals of only a single type, he can tuck them on the bottom of his stack.) Two special rules come into play while the player draws chips:&#10;&#10;&#10;     If a player draws an animal chip that matches the animal on top of an opponent's stack, the player can steal this animal, adding it to the chips currently in front of him. (If he busts for drawing a duplicate animal, this stolen chip is also returned to the bag.)&#10;     If a player draws a monkey, he can either keep the monkey (as with any other animal) or he can swap the monkey for the chip on top of an opponent's stack.&#10;&#10;&#10;When the last chip has been added to a stack, the game ends. Any player who has more chips of an animal type than any other player receives bonus points equal to the total number of that animal in the game. The player with the most points wins.&#10;&#10;",
        "artist": "Bob Haime,Rob Walker"
    },
    {
        "name": "Petits Meurtres & Faits Divers",
        "description": "The inspector is trying to find out the murderer by doing several interrogations. Each player has one minute to explain why he isn't the murderer. He must say three words that are written in his book - all the innocents have the same three words they MUST use, but the murderer has three different words. The murderer is trying to pose as innocent by finding and using their three words, while the innocent players are trying to use the murderer's words to appear guilty.&#10;&#10;",
        "artist": "Ingo Anlauff"
    },
    {
        "name": "Key Harvest",
        "description": "Key Harvest is the fifth game in the key series of games published by R&amp;D Games.&#10;&#10;The object of the game is to score the most points.  Players score points by placing tiles on their own country board.  One point is scored for each field tile in the player's largest group of connected field tiles and two points for each tile in their second largest connected group.&#10;&#10;Points are also scored for the worker tiles a player places on their country board.  The number of points scored for each worker is equal to the number on the worker tile.  Worker tiles do not count as connecting tiles when calculating the largest group of tiles.  When played, a worker enables a player to take a special action.  Each player has their own team of six workers, known as farmhands.  There are also six townsfolk who can be acquired by any player.&#10;&#10;There are usually six field tiles available at any time from the registry.  On their turn a player may bid for up to two tiles using crop counters.  The field tile being bid for and the bid in crop counters are placed in the player's store.  On their turn the other players may match the store owner's bid in both the number and type of crop counters.  If they choose to do so, then they place the field tile on their country board and pay the crop counters to the store owner.  If no other player has matched the store owner's bid, then on their next turn the store owner may place the field tile(s) from their store onto their country board and pay their bid in crop counters to the general stock.&#10;&#10;When deciding how much to bid for a field tile, players will need to consider how important the field tile is to them and whether other players are likely to bid for the tile.  It is usually beneficial for a player to place field tiles into their store as that player will either obtain the field tile or receive additional crop counters.&#10;&#10;When played, a worker tile must be adjacent to at least the number of field tiles as the number on the worker tile.  A worker tile cannot be adjacent to another worker tile.  If a player obtains a field tile for a space where they have already placed a worker tile, they must remove the worker tile.  However, if the worker tile can be replaced immediately (next to the required number of field tiles), then the player can benefit from the worker's ability again.  Getting these extra benefits is one of the keys to doing well in the game.&#10;&#10;Players have two actions per turn.  There are four possible actions.  Each action can only be performed once per turn.  As described above, the actions include placing field tiles from the stores onto their country board - action (c), placing field tiles from the registry into their store - action (d), and placing a worker tile onto their country board - action (b).  Action (c) cannot be performed after action (d).  A player may also harvest crops by turning over some unharvested field tiles on their country board - action (a).&#10;&#10;Field tiles taken from the registry are replaced immediately with field tiles from the bag.  The bag also contains a number of event tiles.  The event tiles, when drawn, affect all of the players, not just the player who drew the event tile.  When the tenth event tile is drawn, the game ends after two further rounds have been played.&#10;&#10;One point is also awarded to the players who have the most of each of the types of crop counters at the end of the game.  No points are awarded for ties.  Points are tallied using the scoring track on the town board.  The player with the most points is the winner.&#10;&#10;Nr. 4 in the QWG Master Print Edition series, as Demetra&#10;&#10;",
        "artist": "Juliet Breese,Mike Doyle (I)"
    },
    {
        "name": "Battle for Baghdad",
        "description": "Battle for Baghdad is a unique multi-player game in which players represent different factions vying for control of the governance of Iraq during US occupation. The game emphasizes the roles and capabilities of the various factions involved, and demonstrates how asymmetric capabilities can be leveraged to generate favorable outcomes.&#10;&#10;The playing surface is constructed from satellite images of the city of Baghdad and each component is carefully researched for authenticity. For three to seven players, the board game is of moderate complexity.&#10;&#10;Complexity: 3 (1 to 10)&#10;Playing Time: 1 to 2 Hours&#10;&#10;Components:&#10;&bull; 280 Die-cut Counters&#10;&bull; 30 Command Cards&#10;&bull; 35 Arab Street Cards&#10;&bull; 63 Arms Bizaar Cards&#10;&bull; Full-Color 22x22 Inch Mounted Map&#10;&bull; Two 20-Sided Dice&#10;&bull; Six Faction Displays&#10;&bull; Rules &amp; Notes Book&#10;&bull; Strategy Guide&#10;&#10;",
        "artist": "Michael Anderson (I)"
    },
    {
        "name": "Barbarossa: Kiev to Rostov, 1941",
        "description": "GMT's fifth epic game in its award-winning series of east front games, Barbarossa: Kiev to Rostov. This is a two-player, or two-team, operational level game depicting the battles of the southern wing of the Axis invasion of the Soviet Union during 1941. This game picks up where an earlier game in this series, Barbarossa: Army Group South, left off. It begins in mid-August and ends in December 1941, historically near the cities Kharkov and Rostov.&#10;&#10;COMPONENTS&#10;&#10;&#10;     Three 22 x 34 inch maps&#10;     One 24 x 34 inch map&#10;     1120 counters&#10;     Series rule book plus a scenarios book&#10;     Various player aid cards for charts and tables&#10;     Set up cards for each scenario&#10;&#10;&#10;THE GAME&#10;&#10;This comprehensive game system was designed at a scale for divisions but it accommodates the many independent brigades, regiments, and special battalions that were also available for this campaign. These include units for rocket artillery, heavy artillery, armored trains, assault guns, engineers, Stukas, Sturmoviks, anti-aircraft guns, NKVD, Stormtroopers, militia, base units, and more. You can tailor your army to fight a lengthy campaign over variable conditions.&#10;&#10;Despite its size we have kept the overall rules within the context of other games in this series thereby leaving nearly all mechanics familiar to veteran East Front Series (EFS) players. Such familiar mechanics include ranged artillery, air units for close support or interdiction, Soviet HQs, retreat or stand orders, weather, reaction movement, railroad movement, strategic movement, overruns, combined arms, fortifications, special supply situations, and more. Veteran players should be able to pick up game play right away. For those who are new to the series, many examples of play will be found in the rules book as well as a Learning scenario to fully illustrate game play and some of the decision making for each battle.&#10;&#10;Note that all games of the Barbarossa, or EFS, series are built to fit together. If space is at a premium for you, please note that four of the eight scenarios here in this game alone require only one map or less.&#10;&#10;Barbarossa: Kiev to Rostov challenges you to balance your attack and defense in each sector of the game map, regardless of scenario. Neither side has sufficient resources in either troops or supplies so the key to winning will be good game play and a sound plan. Can you do better than the titans that struggled for the Ukraine in the summer and fall of 1941?&#10;&#10;THE SCENARIOS&#10;&#10;&#10;     Learning Scenario: Rostov Redeemed. The German 3rd Motorized Corps has just taken Rostov and now attempts to hold it against a massive Soviet counteroffensive. This was the first in what turned out to be a series of disasters that befell the German army during the winter of 1941/42.&#10;     Kiev Pocket. In mid-August the Germans had just cleared the Uman Pocket (the last battle of the Barbarossa: Army Group South game in this series) and looked to exploit their advantage to quickly conquer the rest of the Ukraine. Meanwhile, the Soviets had built a whole new group of armies to the east of the Dnepr River. This campaign resulted in the greatest encirclement battle of the war, perhaps of all time, as the Soviets over-committed to the defense of the river. Yet this was not a sure victory. Play testers have called this scenario the best yet in the entire series of games. You simply must experience this battle, one of the decisive battles of the war in the east.&#10;     Battle on the Sea of Azov. In late September with disaster looming to the north and a German offensive building against the Crimea, the relatively untouched Soviet 9 and 18 Armies in the southern portion of the Dnepr Bend were called upon to act, this time to save their comrades defending the Crimea by striking toward the rear of the German 11th Army. While their attack made but small headway, some Romanian defenders were overwhelmed. The situation could have opened up to destroy the German rear and then threaten the rear of the rest of German Army Group South. Perhaps this offensive could as well reverse the tide of the German advance. Or was someone in the Kremlin just dreaming?&#10;     Battle of Sumy. Some small battles lend themselves wonderfully to focus treatment and this battle at the end of September near the north Ukrainian town of Sumy certainly qualifies. Handled on its own special map this becomes a contest of mobility between a German motorized corps on the one hand and a strong Soviet cavalry corps on the other, with the Soviets getting timely reinforcements from the 1 Guards Motorized Rifle Division. This very balanced situation plays quickly and perhaps is the best introduction in the series to the game system.&#10;     To Kharkov. It has become almost trite to say Russia is vast but for this scenario the German player will declare this many times. Even though the German has just won the Kiev Pocket Battle, now the great industrial city of Kharkov beckons in the distant east. The Soviets have reassembled their armed forces yet again but this time the German has sent his panzers north to Moscow and out of this game (see GMT's Typhoon! Game). German 6th Army, a true hard-luck formation, gets the honor of leading the advance and they now experience their first starvation of the war, similar to that they will suffer at Stalingrad a year later, although without the desperation of that later battle. Even so, the 6th Army is formidable; so will the arrival of mud be the only thing saving the Soviet's behind? Or, will he have finally mastered the art of war against the Nazis?&#10;     To Rostov. The most dramatic moment of the late drive to the east was the drive to Rostov, the gateway to the Caucasus where lay the oilfields the Germans so vitally needed to run their war machine. The Germans have won victory after victory for nearly six months even though the Soviets have set successive armies in their path. Is this perhaps the Soviet last ditch and their last army? Are the Germans truly at the end of their supply line? Will winter stop the Germans? Historically in this near even contest, the panzers actually got into the streets of Rostov; can you?&#10;     Kiev to Rostov. This is the full campaign, mid-August through December, a very full 57 turns over vast distances. The Germans begin in supply difficulty and will have to pick a pause to advance their main bases. The Soviet player will have to take care he does not expend all his effort too far to the west, thereby leaving nothing for the final battles. Neither player has resources to do it all but it can be fun trying. The East Front experience is not complete without playing this full-size scenario. &#10;&#10;&#10;",
        "artist": "Todd Davis,Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "Chang Cheng",
        "description": "More than 2500 years ago, the emperor of the Qin dynasty decided to protect his prolific provinces of northern China from the frequent barbaric invasions, building and joining several fortified fortresses. So he nominated his most faithful imperial officers to oversee the construction, promising riches and honours to the first who would have completed what now represents one of the most remarkable works produced by men: Chang Cheng&trade;, the Great Chinese Wall.&#10;&#10;Take on the role of one of the 4 officers of the emperor and try to increase your reputation in his eyes. Build parts of the Great Wall to defend the Chinese provinces and compete with the other players to gain the reputation that comes from protecting the most important ones. But beware of the threat of the Mongols who hang near the border. . .&#10;&#10;In this game of clever placement, players take turns adding pieces to the Great Wall. On one side of the wall lay the Chinese provinces, each with its own point value. On the other side are the provinces of the Mongol invaders, each with a randomly-assigned negative point value. Since provinces on either side do not directly correspond to each other, the goal is to place your pieces so that you can attain a majority on the Chinese side (for positive points) while avoiding having a majority on the Mongolian side (for negative points). Players also have a set of cards (tiles actually) that give them a few special privileges to help themselves or interfere with other players.&#10;&#10;The game also comes with optional cards that may be used to provide other methods of scoring points.&#10;&#10;",
        "artist": "Giuseppe Rava"
    },
    {
        "name": "Monopoly: Transformers",
        "description": "Transform and Roll Out!&#10;&#10;The Civil War between the Autobots and the evil Decepticons has spilled out of Cybertron and onto this collector&rsquo;s edition of the MONOPOLY&reg; game. In this episode of the Transformers saga, you&rsquo;ll travel the Transformers universe buying, selling, and trading cities, bases, and planets, mining for precious Energon Cubes and Anti-Matter to own and control it all. Decipher Autobot and Decepticon cards using a special Card Decoder. Choose from six collectible tokens. Will you fight for the peace loving Autobots as Optimus Prime, Bumblee, or Jazz or the evil Decepticons as Megatron, Starscream, or Soundwave?&#10;&#10;Your destiny is more than meets the eye. Take the Space Bridge and Advance to GO!&#10;&#10;Collectible pewter tokens include: Optimus Prime, Megatron, Bumblebee, Soundwave, Jazz, and Starscream.&#10;&#10;Special Card Decoder allows players to read the directives on the Chance and Community Chest cards.&#10;&#10;Special Monopoly Doubles rules allows Transformers fans to battle for properties, collect extra money, draw Autobot or Decepticon cards, and take away Energon Cubes.&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "Amyitis",
        "description": "In Amyitis the players are rival architects competing to earn the most prestige building one of the seven wonders of the ancient world: the Hanging Gardens of Babylon. The game is named after the daughter (or granddaughter) of Cyaxares, the king of the Medes, who married King Nebuchadnezzar II, ruler of Babylon. The myth says that Amytis' homesickness for the forested mountains of the Median Empire led to the construction of the Hanging Gardens of Babylon, as Nebuchadnezzar attempted to please her by planting the trees and plants of her homeland.&#10;&#10;The players embody noble Babylonians in quest of prestige. All along the game, they strive to raise their status by building gardens and their irrigation network, and by trading and recruiting. At the end of the game, the player with the highest prestige is the winner.&#10;&#10;In this game the players compete to build gardens, acquire plants, hire craftsmen, build irrigation and trade with ancient cities. Points can also be gained from building your palace and controlling the temples. On a turn the players chose one of the following actions: a) Recruit a craftsman, that grants an action (priest on temple, resource, irrigation or camel) b) Move the caravan (to purchase plant or court card or trade) c) Pass to potentially gain income. It is an interactive game where a player's actions directly affect the other players.&#10;&#10;",
        "artist": "Arnaud Demaegd"
    },
    {
        "name": "König von Siam",
        "description": "Siam 1874: A power struggle has broken out. Siam's king has initiated reforms that have resulted in a clash between the Malays, Lao, and Royalists. The appearance of unity, however, must be preserved or the British might move in and make a colony out of Siam. Will the Siamese succeed in this tightrope walk and maintain the nation of freedom?&#10;&#10;In King of Siam, the players use action cards both to compete for influence on the contending factions and to tip the power struggle in favor of the faction where their own influence is the greatest &ndash; but the players must be careful. Too much conflict will result in a British intervention and new victory conditions are immediately resolved.&#10;&#10;After the initial setup King of Siam has no random elements and no luck. The game is playable by 2-3 players individually or four players in partnerships.&#10;&#10;",
        "artist": "Richard Stubenvoll,Andreas Töpfer"
    },
    {
        "name": "Quinamid",
        "description": "An abstract 2-player game in which the objective is to create a line of 5 counters . The twist here is that the counters are placed in a series of 5 boards of differing size that are formed to make a pyramid, hence the name &lsquo;Quinamid&rsquo;.&#10;&#10;The rules are simple, with any one of  3 options available to the player : &#10;a)    Place a counter in a vacant space&#10;b)    Rotate a board (including those boards &lsquo;above&rsquo; it) through 90 degrees&#10;c)    Move a board (including those boards &lsquo;above&rsquo; it) one &lsquo;position&rsquo; in any orthogonal direction.&#10;&#10;An important rule is that the subsequent player may neither move NOR rotate a board which was moved or rotated by the preceding player.&#10;&#10;Players take it in turns to make their move until one of them reveals a line of 5 counters, this being in a vertical, horizontal or diagonal direction.&#10;&#10;As players use option c) above they will &lsquo;cover&rsquo; boards below, thereby hiding the contents. It follows therefore that there is a bit of memory required to recall what was under the various boards if you are to use it to your advantage.&#10;&#10;A game is often completed in 2 or 3 minutes so replay value is high. It is often better to play a &lsquo;best of 5&rsquo; series to employ different strategies, so that would take around 15 minutes.&#10;&#10;The game should appeal to players aged 8-80. It could be played whilst waiting for a meal to be prepared or as a post-prandial diversion with other players spectating and giving out &lsquo;advice&rsquo; ! Easy until they themselves have a go !!&#10;&#10;Components are sturdy, with the counters and boards being made of good quality wood, and the package comes in a nice wooden presentation box of dimensions 7&rdquo; x 7&rdquo;, making it portable and suitable to be played on the train, the beach or at picnics.&#10;&#10;Online Play&#10;&#10;     Boardspace.net (real time, AI option)&#10;&#10;&#10;&#10;&#10;Home Page: http://www.quinamid.com&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "El Capitán",
        "description": "El Capit&aacute;n, a game that is based upon Tycoon but with many improvements and upgrades.&#10;The game is now playable with 2-5 players (instead of 2-4); it has 11 new groundbreaking rules, and on top of it all, expansions and a whole new exciting look!&#10; All together we have now the following changes/improvements for the basic game:&#10;&#10;     new grouping of the cities on the game board&#10;     new payout table for distribution&#10;     3 new Distribution Cards&#10;     new rules for the forts&#10;     start money is 20 florins instead of 15&#10;     place up 4 multi travel cards instead of 2&#10;     new rule for the loan cards (not allowed in the first round)&#10;     new start player after a payday (a special start player figure is added)&#10;     building up to 12 (instead of only 9) warehouses in a city&#10;     limitation of warehouses in series (limited to 3 now)&#10;     a rule for the first warehouse in a city&#10;&#10;&#10;&#10;&#10; &#10;Also included is the first expansion &quot;Portuguese Powers&quot; with some extra city boards and strategy!!&#10; There are now special rules for 2 or 3 players (extra renovation fields) and a special rule for 2 players (payday and additional warehouses).&#10;&#10;The game was published in October 2007 by QWG Games in the Benelux, by Pro Ludo in Germany, by Ystari Games in France, and by Z-Man Games in USA, Canada, Australia, New Zealand, UK, and Ireland.&#10;&#10;",
        "artist": "Mike Doyle (I)"
    },
    {
        "name": "Solo Dungeon Bash",
        "description": "This game is for anyone who is on their own and fancying a Dungeon Bash. All you need are these rules, a piece of paper (preferably of the graph variety), a pen and a bunch of six sided dice.&#10;&#10;The dungeon is made up of a grid of squares, 9 squares wide and 10 rows deep. There are additional start and end squares in the middle column.&#10;&#10;The objective is to move from the Start square up through the levels of the Dungeon and into the End square where the Big Bad Boss Monster lives and to finally defeat it. Failure to defeat the Big Bad Boss Monster means you have lost.&#10;&#10;Solo Dungeon Bash is a solitaire dungeon crawl. This print-and-play game is available at &#10;http://blackdogofdoom.blogspot.com/2010/09/solo-dungeon-bash.html&#10;&#10;Online version is available at http://is-games.net/en/games/solo-dungeon-bash (free to play)&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Kachina",
        "description": "In the mythology of the Hopi Native American tribe, the world is ruled by kachinas (or spirits) of many different types. Children of the tribe learn about these different spirits through the use of kachina dolls. To illustrate the tension of different spirits in the world, the tribe elders created this game of kachinas vying for dominance. Will the Eagle soar above the Black Ogre? Will the Clown mock the Chief to nothingness? Or maybe the Sun god will outshine all in its radiance?&#10;&#10;In Kachina, you want to be the player who scores the most points by dominating other kachinas.&#10;&#10;Reimplemented as&#10;&#10;    V&#195;&#182;lusp&#195;&#161;&#10;&#10;&#10;&#10;&#10;",
        "artist": "Andy Hopp"
    },
    {
        "name": "Burger Joint",
        "description": "In this two-player game, each player runs a chain of fast-food joints: one specializes in burgers and the other in pizzas. As each expands, he takes on some of the menu items of the other in order to compete for customers. Later, each can open family restaurants and even high-class dining establishments. The most successful chain will win in the end!&#10;&#10;Players alternate  turns as the active player. Each turn consists of five actions.&#10;1.    Production. Where a player draws cubes from a bag (Here the cubes represent different resources.)&#10;2.    Players trade and use special abilities to convert cubes into more helpful combinations.&#10;3.    Spend their resources to build up their fast food empire (by improving their restaurants to diners or by increasing their publicity)&#10;4.    Calculating their current score &ndash; first player to 12 victory points wins.&#10;5.    Discard unused and excess goods in preparation to start the next round.&#10;&#10;",
        "artist": "Christof Tisch"
    },
    {
        "name": "The Aztec Market",
        "description": "This is the first known game designed by Spanish gamer Victor Melo.&#10;&#10;Winner of the &quot;I Board Games Creation Contest&quot; at Granollers (Barcelona),  El Mercado Azteca (The aztec market) is becoming popular inside Spanish gamers' community. The contest is the result of the impulse and work of a great well known Spanish designer: Oriol Comas i Coma.&#10;&#10;The game is almost a pure German Game:&#10;&#10;     Small and easy set of rules&#10;     Fast games&#10;     Attractive theme not too present in the game flow&#10;&#10;&#10;&#10;&#10;It has also an easy Print &amp; Play prototype that you can play just by printing some counters and using some extra components from other games or even from your kitchen (beans,...).&#10;&#10;About the theme:&#10;The game tries to represent the great pre-Columbian market of Tlatelolco (Mexico). The player is a merchant trying to get goods (4 different types) from the sellers while trying to increase their value. To increase your chances of buying you'll need to spend your influence points to adapt the market to your needs. The board is modular and changes every turn. The players can move the board pieces, this being an important part of the strategy.&#10;&#10;This game is winner of the 2007 Concurs Ciutat de Granollers de creaci&#195;&#179; de jocs.&#10;&#10;",
        "artist": "Néstor Romeral Andrés"
    },
    {
        "name": "The Good, the Bad, and the Munchkin",
        "description": "&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Publisher's Description&#10;&#10;Oh, give me a home where the Jackalopes roam&#10;And the Dudes and the Buckaroos play,&#10;I'll slay and I'll loot, give the monsters the boot,&#10;And the dice are not loaded, no way.&#10;&#10;The Good, the Bad, and the Munchkin opens a whole new frontier - the Wild West! Forget dragons and goblins - Jackalopes and Davy Croc have just as much treasure. Those plains may seem wide open, but there's lots of monsters to kill, and lots of stuff to take.&#10;&#10;Become a Cowboy with a Twenty-Gallon Hat, or an Indian on a Catamount. Fight Wild Bill Hiccup, the Killer Jalapeno, and a Barber Shop Quartet. Take The Annual Bath for an extra level. Or just pal around with your sidekick the Greenhorn, until you sacrifice him to distract a monster.&#10;&#10;The Good, the Bad, and the Munchkin is the next stand-alone game in the award-winning Munchkin line. Steve Jackson (I) and John Kovalic have teamed up again to put puns to paper like no one else can. Head 'em up and move 'em out, and get ready to wander the Grim Roper into somebody else's combat and make him &quot;Rootin' Tootin'&quot; for +10...&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Other&#10;&#10;Part of the Munchkin series.&#10;&#10;",
        "artist": "John Kovalic"
    },
    {
        "name": "Inside",
        "description": "Together, players build a pyramid of light brown and dark brown wooden blocks. Anticipate your opponent&rsquo;s moves by playing cubes in their colour... In order to be the winning architect there must be more of your colour on at least 2 faces of the completed pyramid!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Great War in Europe: Deluxe Edition",
        "description": "In 1995 Ted Raicer's game, The Great War in Europe, was published in Command Magazine by the XTR Corporation. The game was well received, and shortly afterward, an expansion, The Great War in the Near East, was also released.&#10;&#10;The Deluxe edition of The Great War in Europe is more than a consolidation of these two games. The rules have be rewritten to include changes that make the game more realistic and yet quicker and easier to play. It also includes scenarios for each front for each year of the war - allowing games to take from as little as two or three hours up to a full weekend for the full campaign game.&#10;&#10;The games comes with three maps (Eastern Front, Western Front and Turkey),  and app. 1500 &frac12; inch counters, THE GREAT WAR IN EUROPE: DELUXE EDITION will update two classic designs in an edition that will provide all the challenges and Great War flavour you've come to expect from the designer of Paths of Glory, Clash of Giants, Reds, and Grand Illusion.&#10;&#10;Despite the scale and size of the game it plays quickly because as one person is having their turn on the Eastern Front the other player can be having their turn on the Western Front and this means very little downtime.&#10;&#10;",
        "artist": "Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "Der Goldene Kompass",
        "description": "&#10;&#10;&#10;    &#10;        Disambiguation: This game is for the Golden Compass book, the game for the movie is located over here.&#10;&#10;    &#10;&#10;&#10;Based on the popular fantasy book that is now becoming a movie, Golden Compass is a story of an orphan girl, Lyra. With her d&aelig;mon Pantalaimon, Lyra is trying to unravel the secret of lost children. Her travels will take her to the cold north, home of the witches and the armoured bears. From there, she must travel to the another world - and that is the goal of the players in this game. Players must use their cards to gather experience, partake in encounters and make their way to the goal, before other players succeed in the same task.&#10;&#10;",
        "artist": "Michael Menzel,Anke Pohl,Thilo Rick,Franz Vohwinkel"
    },
    {
        "name": "Patrician",
        "description": "Patrician takes place in the Middle Ages when men were men and wealthy men were inspired to build magnificent towers in order to show off how prosperous they were. As the old saying goes, the taller the tower, the more influential the family.&#10;&#10;Players are master builders trying to profit from these vanity-driven families. You build these towers floor by floor, ready to take credit for making them look good. From Mayfair&rsquo;s description of the game: &ldquo;You must shrewdly accept the building orders of the patrician families to position yourself in the right place at the right time. Play your cards right, and your name will be famous among the rich and powerful!&rdquo;&#10;&#10;Patrician comes with 149 wooden tower pieces, 55 building cards, 20 prestige tokens, and a double-sided playing board.&#10;&#10;The board represents a number of cities, each of which will have 2 towers when the games ends.  Players have a hand of 3 cards, each indicating one city.  Playing a card allows that player to add a tower piece to the city indicated by the card.  Each city will have a specific number of tower pieces.  When the specified number of pieces are played to the city, the city is complete.  The player with the most pieces in each of the two towers will score points when the city is completed. The player replaces the played card by taking the card from the city where he played a tower piece.  As long as the city in uncompleted, a new card is added to the city to replace the one taken by the player.&#10;&#10;In addition to indicating a city, cards have one of 4 secondary functions.  They can have one or two Portraits from an influential family.  They can add a second tower piece to the same city. they can allow the player to move the top piece from one tower in any other city where the player has at least one tower piece, to the top of the other tower in that same city. Finally, a card may allow the player to take a replacement card from any of the cities, not just the one where the player has added a tower piece.  All cards played are kept by the player.  At the end of the game, additional points are awarded for every complete set of 3 portraits from the influential families.&#10;&#10;The game ends when all cities are completed, which will also be when all cards have been played.&#10;&#10;The goal of the game is to be the most successful builder, indicated by having the most points.&#10;&#10;",
        "artist": "Design/Main"
    },
    {
        "name": "San Quentin Kings",
        "description": "San Quentin Kings is a resource management game based on the economic system of an American prison. Be the leader of your own prison gang directing members through a series of fights that gain control of different aspects of the prison economy. Controlling the economy gets players respect and other important advantages. Gain the most respect and you will be crowned the King of San Quentin.&#10;&#10;The game is played in 3 rounds or 'years'. Each year the players have a number of different actions to choose from. Acquire prison knives, get commissary, recruit new members; each year as leader of your prison gang you will have to decide how to best use your members to win the most fights. The more fights you win the more prison resources you control. The more resources you control the more respect you will gain. Be careful or your members will end up in solitary confinement or worse, in the grave! Even if you find yourself running the most powerful gang in the San Quentin beware of the final riot. Who knows what treachery the other gangs may be planning... You can be sure they seek your demise. At games end the players are scored based on what they managed to control in the prison. The more aspects of the prison economy your gang controls the more power and respect you gain. The player's gang with the most respect wins!&#10;&#10;San Quentin Kings is 3-5 players and runs 90-120 minutes. Ages 14 and up!&#10;&#10;",
        "artist": "Nate Hayden"
    },
    {
        "name": "Five Little Monkeys Jumping on the Bed",
        "description": "From the publisher:&#10;&#10;Five Little Monkeys Jumping on the Bed is a simple-to-learn game that introduces children to counting and strategy while developing fine motor skills. The object of the game is to get all of your monkeys onto the bed. Sounds easy? Well watch out, your monkeys may jump off the bed at any time. When they do, it's time to start over. Surprise, laughter and fun for kids and their parents. Comes with Game Board, Plastic Bed, 24 Monkeys, 20 Punch Out Tokens, Spinner Card and Game Instructions. For 2 or more players. Ages 3 &amp; up.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Bushwhackin' Varmints out of Sergio's Butte",
        "description": "The eighth addition to the B-Movie Series introduces Westerns to the line.  It parodies western movie cliches with 120 cards capable of being used as a stand alone game or being mixed with other B-Movie Series games.&#10;&#10;Players play characters, props, and locations to create their own western themed movies, while also playing creature cards to attack other player's movies.  Special Effects cards can be used to perform extra actions to mix up the standard play or modify creature attacks.  The goal of the game is to have the highest scoring movie when the &quot;Roll the Credits&quot; card is played or when the draw deck is emptied.&#10;&#10;",
        "artist": "Oliver Castañeda,Péter Szábo Gabór,Mike Jackson,Cristian Saksida"
    },
    {
        "name": "Ghost for Sale",
        "description": "Buying castles in Scotland can turn out to be excellent business. Even more so when, at the same time, you can provide tourists with these lands attractions: natural beauties? Oh no, no, rather offering them scary ghost infestations!!! Some eccentric characters fight in an auction to be assigned castles and manors. This, in the hope that presences will not be too numerous! Even if a castle without ghosts may be found useless, on the contrary one which is too &ldquo;populated&rdquo; will end up terrorizing tourists and being valueless...&#10;&#10;Every player, after having seen the various castles, can declare what was seen, by showing his signs &ldquo;picture&rdquo; or &ldquo;ghost&rdquo;.&#10;Were there gloomy presences or only old and powdery family portraits? But beware, not all declarations are reliable: many players could lie... or perhaps all of them?&#10;&#10;In the first phase players must decide whether in that very turn they will lie or tell always the truth.&#10;Mrs Truelight could help everyone to find out actual results of such decisions, but she is greedy and therefore she will reveal precious indications only to best bidders.&#10;&#10;Caution is vital: the ones who pay more money too early will turn out having less funds to offer in the second phase auction for castles. Shall we have enough money to steal best ones to our competitors? Every castle has a score according to the number of ghosts by whom it is haunted.&#10;&#10;The player who succeeds in guessing where ghosts are and their exact number will achieve optimum business, becoming able to buy what he/she wants in a fairly relaxed mode and allowing himself/herself even the luxury to mislead adversaries with fake offers.&#10;&#10;Ghost for sale is a clever deductive game, with a subtle bluffing component, for 3 to 5 players, suitable for all the families, but with a strategy component that will not leave indifferent even most experienced gamers. In the box there are 8 special cards to be used for &ldquo;special auctions&rdquo;, which constitute a set for playing advanced rules games and which, randomly combined to the various castles and manors, guarantee rounds which are always exciting and different.&#10;&#10;English, German and Italian Rules available for download here&#10;&#10;",
        "artist": "Mariano Iannelli,Kawaii Studio"
    },
    {
        "name": "Ca$h 'n Gun$: Live",
        "description": "Ca$h 'n Gun$: Live is a sequel to Ca$h 'n Gun$, not an extension - although it does come with a bonus special power to extend its predecessor.&#10;&#10;8 to 20 players play in a public place where non-players are present. When the referee blows the whistle, all players points their hands (as if they had a gun) towards another player...all this in a public place!&#10;&#10;Of course, players are gangsters sharing a lot of money.&#10;&#10;Though ostensibly a LARP game, and on the cusp of being outside the scope of BGG, it retains inclusion as a group activity not dissimilar from Werewolf.&#10;&#10;The game was released end August 2007.&#10;&#10;",
        "artist": "Gérard Mathieu"
    },
    {
        "name": "Battleground: Crossbows & Catapults War Chest Starter Set",
        "description": "Battleground: Crossbows &amp; Catapults puts you in the middle of a real fantasy battle and can be played on almost any flat surface.&#10;&#10;Carefully place your weapons and warriors to take out your opponent's forces and defenses, Knight or Orc.&#10;&#10;Load up the elastic powered weapons to launch the battle discs to do maximum damage to your opponent's side. Use your moves to strategically place your warriors and weapons to both defend your castle and attack your enemy. Aim for the flags and win bonus lives!&#10;&#10;Be the first to knock over all your enemies to win!&#10;&#10;Includes two complete armies, Knights and Orcs. 80 pieces in total.&#10;&#10;First edition in 1983 as Crossbows &amp; Catapults&#10;&#10;",
        "artist": "Mike Rayhawk"
    },
    {
        "name": "Heartland",
        "description": "West of the Mississippi, the grasslands of Middle America contain some of the richest farm land in the world, producing corn, soybeans, wheat, hay, and livestock. Purchased from France as part of the Louisiana Territory in 1803, the region was divided into square mile plots for the settlers from the east. In this game, players take the role of these settlers, developing the plots of land and establishing farms in America&rsquo;s &ldquo;Heartland.&rdquo;&#10;&#10;The game, entitled &ldquo;Eine Frage der &Auml;hre&rdquo; in German, is a three-dimensional tile-laying game. Each tile contains two types of crops to be planted as well as a certain number of &ldquo;barnyard points.&rdquo; When placing tiles, players must always choose between scoring immediate &ldquo;harvest&rdquo; (victory) points or developing their farms through the barnyard points, which will provide victory points over the longer term. In addition, there is a race to the top of each barnyard point track in order to acquire the most valuable animals for the farm. Players may also &ldquo;rotate crops&rdquo; by using their tiles to cover up fields that bring their opponent&rsquo;s points, possibly expanding their own farms in the process. This translates into an hour-long game aimed at families and gamers with multiple paths to victory. &#10; Source: Jeffrey D. Allers&#10;&#10;",
        "artist": "Tom Thiel"
    },
    {
        "name": "1001 Karawane",
        "description": "1001 Karawane is set in the desert. Players are in search of three magic artifacts - the winning condition of the game. The player who can 'read' the desert best, has the best chance at winning the game.&#10;&#10;Water is of much importance as is protection for your caravans. In cities you'll find gold and gold you can trade with dealers - you might even trade it for a magical artifact.&#10;&#10;",
        "artist": "Dennis Lohausen"
    },
    {
        "name": "Those Pesky Garden Gnomes",
        "description": "Those Pesky Garden Gnomes is a non-partner trick-taking card game with a twist &ndash; in fact, possibly many twists!&#10;&#10;The game uses four suits of different lengths, with cards containing positive and negative point values. While using standard trick-taking rules &ndash; with players needing to follow suit and the highest card in the suit taking the trick and giving the lead &ndash; each player in Those Pesky Garden Gnomes has a different goal in hand each round &ndash; and these change randomly with each new hand. Thus, a player knows only his goal and not those of the other players. A player's score for a hand is based on how close he comes to achieving his goal. The points a player scores are added to his running total, and players in a worse position in later rounds are given more options each round. After a set number of rounds, the player with the lowest score wins!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Perry Rhodan: The Cosmic League",
        "description": "This game is set in the Perry Rhodan universe, a hugely popular German space-opera book series published since 1961. The term &quot;kosmisch&quot; means &quot;cosmic&quot;; &quot;Hanse&quot; refers to the Hanseatic League, a Medieval trade network in Northern Europe. In the american translation of the book series the phrase &quot;Die Kosmische Hanse&quot; was translated as &quot;The Cosmic House&quot;.&#10;&#10;In this game the players take on the roles of traders who transport goods between planets. Occasionally one can carry also passengers, which brings additional yields. Players can invest in cargo space, transmitters or faster drives to improve their spaceships.&#10;&#10;Heinrich Glumpler, the designer of the game, is a fan of Merchant of Venus, as you can see from this comment.&#10;&#10;The artwork is by Swen Papenbrock, one of the illustrators of the Perry Rhodan book series.&#10;&#10;This game is part of the Kosmos two-player series.&#10;&#10;&#10; Game Summary&#10;Place the 6 planet cards in a line. The goods cards are double-sided; randomize them, then place several on each planet grouped by type (but no more than 2/type/planet to start). Players' ships start on planet 1. Each has their own deck, shuffled; draw 5 card hand. The cards are mostly tech cards, which can give you ongoing power; or single-use cards (counter opponent's card by playing matching card yourself). Spend VP to play the cards.&#10;&#10;On your turn, move your ship (costs less energy moving towards sun), pick up stuff (start game with only 1 cargo hold), deliver stuff. When you deliver, you flip the delivered cards over; any resulting matches are removed from game -- works as a game timer! You win by getting to target (70) VP. If goods are gone first,  most VP wins.&#10;&#10;",
        "artist": "Swen Papenbrock"
    },
    {
        "name": "E.T.I.: Estimated Time to Invasion",
        "description": "In E.T.I., players become directors of powerful mega-corporations in the early 1960's with the goal of defending the Earth from a pending alien invasion!&#10;&#10;Players compete to discover increasingly advanced technologies from eight different fields of science and technology.  Completing projects increases the power and influence of your lab facility.&#10;&#10;After a pre-determined number of technologies have been discovered, one of the players will reveal themselves as allied with the aliens!  With this the invasion is near!  The remaining humans labs must use their fantastic discoveries in Earth's final defense!&#10;&#10;Will one of the human facilities have the strength to repel the aliens or will the Earth fall?  It is in your hands...&#10;&#10;",
        "artist": "Mark Anticole"
    },
    {
        "name": "Change Horses",
        "description": "A racing game with a twist.&#10;&#10;Players secretly get a horse (of a particular color) assigned before the game starts. The player with the horse in last place at the end of the game wins.&#10;&#10;On your turn - sequence of play is decided by auction - you play a card that controls two different colored horese. When every player has put down cards, the horses move; but only horses with an odd number of cards on the table! If the number of open cards is even, the horse does not move.&#10;&#10;But, true to the spirit of horse racing, each player has a chance to play a &quot;dirty trick&quot;, including Change Horses.  This can affect the game dramatically.&#10;&#10;The best detailed description of the game is here.&#10;&#10;{This is one of the few multiplayer games that plays equally well with only two}&#10;&#10;",
        "artist": "Alexander Jung"
    },
    {
        "name": "Cuba",
        "description": "Game description from the publisher:&#10;&#10;Cuba prior to the revolution: Under turbulent circumstances, the villages of the island strive for independent wealth and influence. Who can buy and sell his products and goods on the domestic market profitably or take in the most on the trading ships? Who can send the right delegate to parliament in order to influence the government legislative process, or erect distilleries, hotels and banks at the right moment to the benefit of his village?&#10;&#10;Whoever has accumulated the most victory points in Cuba by the end of the game wins. Players earn victory points by shipping merchandise from the harbor, but also by erecting and using buildings, and by abiding by the law.&#10;&#10;",
        "artist": "Michael Menzel,Yvon-Cheryl Scholten"
    },
    {
        "name": "Hamburgum",
        "description": "Hamburg in the 17th century! Mighty walls protect the city against the devastations of the Thirty Years War. Thanks to Protestant refugees, Hamburg has become the biggest and most prosperous city in Germany. From far away, the skyline shows the steeples of huge churches and the masts of mighty trade ships displaying the citizens' pride and prosperity.&#10;&#10;In Hamburgum, players guide the families of Hamburg in the pursuit of wealth and prestige. They produce beer, sugar, and cloth and ship these goods overseas. They compete over the best sites for their buildings and the best berths for their ships in the harbor. Ultimately, they vie for the most prestigious church donations, because neither gold nor goods but only prestige decides the final outcome.&#10;&#10;Expanded by&#10;&#10;    Hamburgum: Lisboa&#10;    Hamburgum: Antverpia&#10;&#10;&#10;&#10;&#10;",
        "artist": "Matthias Catrein"
    },
    {
        "name": "Quao",
        "description": "QUAO is the absolute, supreme ruler of an unruly wasteland at the edge of civilization where attempts at democracy are futile. There is only one law in the land and that law is QUAO (pronounced &lsquo;cow&rsquo;). The mighty and all-powerful bovine of the badlands, QUAO governs the province by sheer antagonism. Only she knows the Rules and she hands them down with iron hoof.&#10;&#10;WHAT&rsquo;S UP WITH THE QUAO YOU ASK? First of all, she&rsquo;s not just a cow, she&rsquo;s a dictator and you better get used to playing by her Rules!&#10;&#10;WHAT DOES IT MEAN TO BE QUAO? When you play this game, being QUAO means you know the Rules and everyone else has to figure them out. You also hand out all the penalties! Use your secret Rules and the help of your loyal subjects Quak, JaQuas and BullyQ to win this game. Just watch out for Cheata&rsquo;, because she could be your downfall!&#10;&#10;OBJECT: Each player is dealt five white cards. Each player has a chance to discard one card during each turn. The person that successfully completes and discards all the cards in their hand first, wins the round and becomes the dictator QUAO. Whoever wins the fifth and final round is the ultimate dictator and the winner!&#10;&#10;HOW TO PLAY: There are four different &lsquo;suits&rsquo; of white cards and each suit is played differently when discarded. During each turn a player may discard one of their cards from their hand to the table.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Antler Island",
        "description": "Players take part in the stag rut on a Scottish island. Each player plays a stag interested in food, fighting and, of course, the opposite sex. The object of the game is to be the stag who has kissed the most doeples and outperformed  rivals in head-to-head combat!&#10;&#10;Who will finish as the dominant stag ?&#10;&#10;The game is medium-lightweight and comes with a quick start-up guide to allow easy play. It is deep enough to offer meaningful decisions and challenges to gamers while still being accessible to non-gamers.&#10;&#10;Fragor's Essen release for 2007.&#10;&#10;",
        "artist": "Clare Hewitt,Judith Lamont"
    },
    {
        "name": "Big Brain Academy Boardgame",
        "description": "From the Publisher:&#10;&#10;Which team has the biggest brain? The new mental fitness game based on the original best-selling Nintendo&trade; DS title. Speed and accuracy count - not smarts - when answering questions at the Big Brain Academy. Challenge your brain in five fun categories: Analyze, Compute, Identify, Memorize and Think. Teams collect chips based on the number of questions they answer correctly. Big Brain Academy keeps minds nimble and players laughing! Your team's goal is to collect the most chips. Game includes 330 cards, dry erase pen, puzzle pieces, red revealer, sand timer, scale, scoring chips and spinner. 2 to 6 Players. Ages 8 and up.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Apples to Apples: British Isles Edition",
        "description": "This edition of the American smash-hit family and party game, Apples to Apples, contains hundreds of new cards specifically designed for players from the British Isles and those familiar with the area, and its cultures and history.&#10;&#10;756 Red Apple Cards &#10;252 Green Apple Cards&#10;&#10;Part of the Apples to Apples Series.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Get Bit!",
        "description": "&quot;You don't have to be faster than the shark, just faster than your friends!&quot;&#10;&#10;Get Bit! is a card game where players are competing to stay alive as the others are being eaten by the shark.&#10;&#10;The order of the swimmers is determined by simultaneously playing cards face-down then revealing the values. The number on each player's card determines position in line (higher numbers in front, lower numbers in back), however ties don't move.  The swimmer at the back loses a limb to the shark and is flung to the front of the line! The process is repeated until only two swimmers remain on the table. When this happens, the swimmer at the front of the line wins the game!&#10;&#10;",
        "artist": "Xavier Collette,Vincent Poulard,Gavin Schmitt"
    },
    {
        "name": "Pandemic",
        "description": "In Pandemic, several virulent diseases have broken out simultaneously all over the world! The players are disease-fighting specialists whose mission is to treat disease hotspots while researching cures for each of four plagues before they get out of hand.&#10;&#10;The game board depicts several major population centers on Earth. On each turn, a player can use up to four actions to travel between cities, treat infected populaces, discover a cure, or build a research station. A deck of cards provides the players with these abilities, but sprinkled throughout this deck are Epidemic! cards that accelerate and intensify the diseases' activity. A second, separate deck of cards controls the &quot;normal&quot; spread of the infections.&#10;&#10;Taking a unique role within the team, players must plan their strategy to mesh with their specialists' strengths in order to conquer the diseases. For example, the Operations Expert can build research stations which are needed to find cures for the diseases and which allow for greater mobility between cities; the Scientist needs only four cards of a particular disease to cure it instead of the normal five&mdash;but the diseases are spreading quickly and time is running out. If one or more diseases spreads beyond recovery or if too much time elapses, the players all lose. If they cure the four diseases, they all win!&#10;&#10;The 2013 edition of Pandemic includes two new characters&mdash;the Contingency Planner and the Quarantine Specialist&mdash;not available in earlier editions of the game.&#10;&#10;",
        "artist": "Josh Cappel,Christian Hanisch,Régis Moulun,Chris Quilliams,Tom Thiel"
    },
    {
        "name": "Good Question!",
        "description": "Players get a card with a list of &quot;answers&quot;. A theme is picked randomly. One player chooses an answer and rings the bell that comes with the game.&#10;He asks a question &quot;in the theme&quot; to the other players, who must answer the correct word. The asking and the answering players earns points. More points are given if some players give the wrong answer before the right one is picked, so the question should not be too easy !&#10;&#10;",
        "artist": "Olivier Fagnère"
    },
    {
        "name": "Eat Poop You Cat",
        "description": "Each player starts with a piece of paper and a pencil. At the top of the paper, each player writes a sentence. Then they pass the papers to their left. The next player &quot;draws&quot; the sentence a la Pictionary, then folds the paper so only the drawing is visible and passes it to their left. The next player looks at the drawing and writes a sentence that they think the drawing represents. This continues until all players have their original paper back. At the end, all players unfold their paper, and much hilarity ensues as &quot;I am the Walrus, koo-koo-ca-choo&quot; becomes &quot;Hitler and I danced the night away in a disco.&quot;&#10;&#10;The game continues until everyone runs out of paper or everyone has added something to each paper, always ending on a sentence.&#10;&#10;Eat Poop You Cat does not comport with the BGG guidelines for what constitutes a game, but is kept in the database by popular demand and administrative fiat.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Rio",
        "description": "Warum Immer Ich (Why Always Me - roughly translated) / Rio is a light game for 2 to 6 players.&#10;&#10;The game consists of a small cylindrical box with 6 numbered holes in the lid; 40 pegs; 1 die and rules.  The 40 pegs are divided evenly among the players,&#10;&#10;The first player rolls the die and places a peg in the numbered hole that matches the number on the die (if you roll a 4, you place a peg in the corresponding hole) - with the goal being to get rid of all your pegs first.  Holes numbered 1 through 5 are only about 1/4 inch deep, and the pegs stand up in them.  The number 6 hole goes all the way through the lid so that any peg placed in it falls into the box and is out of play.&#10;&#10;The player may roll and place a peg for each roll as many times as they wish until rolling a number that is already filled by a peg.  If you roll the number of a hole that is occupied, you must take that peg up into your hand, and your turn ends.&#10;&#10;The game proceeds with players taking turns clockwise and ends when one player has run out of pegs.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Monuments: Wonders of Antiquity",
        "description": "A game of building monuments and historical sources, reporting on these monuments.&#10;&#10;In order to win the game, you not only have to build the monuments, you have to make sure that history will know them - and your fellow gamers will co-decide about it! And there are copyists, who will dispute the glory you've earned for your monuments...&#10;&#10;The game shows monument cards with 12 types of ancient monuments like the Pyramids or the Colosseum (9 per type). The game is played in turns and usually you take a &quot;monument turn,&quot; consisting of 3 actions allowing you to collect cards, to build monuments, and to expand your existing monuments. For example, it takes you one action per card to draw it either from the draw pile or the 3 faceup cards near it.&#10;&#10;If you have some cards showing the same monument, you can use another action to erect this monument in your display. In case you are the first one to build this type of monument, you only need two cards - the second player building this same type of monument must have at least 3 cards. And no third player is allowed to build the same monument! Thus, playing your cards early makes it easier for you to erect the monument. But it saves you actions to collect some cards before displaying it, because regardless of the number of cards used, erecting one monument only counts as one single action.&#10;&#10;Your monuments will receive their eternal fame only, if they are part of history. Each player has 2 (in a 3 player game: 3) historian tokens. In a historian turn, you have no monument action, but only write a history about all of your OPPONENTS' monuments (not your own ones!). Monuments get famous, and the owners receive victory points at the end of the game - the more often your monuments are in such histories, the more points you get. However, only interesting monuments of at least two cards are considered for a history, and by writing a history, the historian takes one card away (removes it from the game)! Thus the monument could be cut down to only one card during the game and will be not interesting to later historians any more. Why should I write a history and make the monuments of my opponents more worthy? If you do not use all of your historian tokens, you will be punished with 12 negative points at the end of the game! And you get additional victory points in the case that you write histories with a lot of monuments mentioned in it.&#10;&#10;You should make your monuments interesting to historians again. During a monument turn, you may use one action (regardless of the number of cards played at the same time) to add cards to a monument that you have already erected.&#10;&#10;In MONUMENTS, timing is important, and you have to decide what the best move to do now is: Should I wait for another Petra card, or shall I display the Petra Monument this turn? Is it advisable to make a historian turn now or is it better to choose a monument turn and draw the faceup cards, which I really need - taking the risk that I cannot write a history next turn and wind up getting negative points!&#10;&#10;Finally, you have to consider that you are not sure about the victory points for your monuments. The points are related to the monument during the game, and if the Akropolis monument is worth 12 Points for example, you will only get 4 points if another player manages to erect an Akropolis monument that is greater than yours. This damn copyist will not only receive all your bad wishes, but 8 of the 12 Akropolis Victory Points - even in the case that his monument was not part of any history. Somehow you will feel that all the glory should be given to you alone!&#10;&#10;",
        "artist": "Harald Lieske"
    },
    {
        "name": "Tammany Hall",
        "description": "&quot;The way to have Power is to take it&quot; - William &quot;Boss&quot; Tweed&#10;&#10;Tammany Hall is a game of backstabbing, corruption, temporary alliances, and taking power at all costs. If you want to rule New York, you are going to need to play the city's growing immigrant populations against one another. Help the immigrant groups who owe you political favors, call in those favors to slander your rivals, and win elections.&#10;&#10;In Tammany Hall, players help immigrants settle in New York, collect political favors from those immigrant groups, send ward bosses into Manhattan to secure votes, and slander political opponents. An election is held at the end of every fourth year, and the player who uses his power base best will be elected mayor. The Mayor's grip on the city is tenuous at best. After every election, the Mayor must pay off his political rivals by placing them in offices that they can wield to try to take control of the city. Every player is your friend, every player is your enemy.&#10;&#10;Tammany Hall was the political machine that dominated New York City politics by organizing the immigrant populations. While the organization's influence spanned from its founding in the 1790s to its collapse in the 1960s, this game is set in lower Manhattan roughly between 1850 and 1870 &ndash; the era of Boss Tweed.&#10;&#10;Contents:&#10;8 page rulebook&#10;1 Game board&#10;5 City Office cards&#10;25 Green Immigrant cubes&#10;25 White Immigrant cubes&#10;25 Orange Immigrant cubes&#10;25 Blue Immigrant cubes&#10;35 Green Political Favor Chips&#10;35 White Political Favor Chips&#10;35 Orange Political Favor Chips&#10;35 Blue Political Favor Chips&#10;20 Red Ward Boss Markers&#10;20 Yellow Ward Boss Markers&#10;20 Purple Ward Boss Markers&#10;20 Black Ward Boss Markers&#10;20 Neutral Ward Boss Markers&#10;15 Slander Chips&#10;2 Council President Markers&#10;1 Year Marker&#10;1 Political Favor Chip Sticker Sheet&#10;1 Drawstring Pouch&#10;&#10;",
        "artist": "Peter Dennis,Bryan Fischer"
    },
    {
        "name": "Rise of Empires",
        "description": "Rise of Empires is an empire-building game in which players develop their ever changing empire from Ancient Age to Modern Age. War, economics, science and diplomacy are to be taken into consideration to successfully win this epic game.&#10;&#10;In Rise of Empires two to five players are building their own civilization from the dawn of history to present times. All players start small and fairly powerless, however, through clever play they try to gain wealth and progress in several areas.  Like many empire building games, it is possible to be wiped from the board one turn, only to return the next in another area.&#10;&#10;Rise of Empires is divided into three eras. Each era consists of two game turns. The core of the game is the Action Display where players conduct various actions during a turn. The first turn in an era is called the A turn, the second one the B turn. In a way, the B turn is a mirror image of the A turn.&#10;&#10;The aim of the game is to have the most victory points at the end. Victory points are scored by building cities, having an empire (area control), developing technology, and trading goods.&#10;&#10;In contrast to some other civilization type games, Rise of Empires plays fairly quickly. A full game can be completed in less than three hours.  It is also more abstract than many civ games, in that cities, towns, and technologies are represented by tiles the players keep, even if their civilization is buried in the sands of time.&#10;&#10;Publisher Blurb:&#10;&#10;Don't just make history-guide it! Take the reins of a developing civilization, choosing the resources and development paths that will lead to the fastest expansion, as you claim and defend territory on a map forging an empire that eventually encompasses whole continents.&#10;&#10;Rise of Empires play is divided into three eras. Choices made early in the era are repeated late, so your decisions must have both short-term and long-term benefits to be successful. This process requires tough decision-making and promotes an atmosphere with nail-biting suspense. Victory points are rewarded for building cities, having an empire, for progress in science, and for trading goods.&#10;&#10;Rise of Empires breathes new life into the civilization games genre! Balance gold and food, war and agriculture, territory and technology to forge an empire that is destined to rise above all other nations!&#10;&#10;Each copy of Rise of Empires contains:&#10;. 1 large game board&#10;. 1 tiles display&#10;. 40 resource discs&#10;. 150 player cubes in 5 colors&#10;. 45 action discs in 5 colors&#10;. 8 empire tiles&#10;. 40 territory tiles&#10;. 48 progress tiles&#10;. 36 city tiles&#10;. 104 gold markers&#10;. 5 alliance pieces&#10;. 5 player aid cards&#10;. 1 rules booklet with illustrated example of play.&#10;&#10;",
        "artist": "Czarnè"
    },
    {
        "name": "Travel Carcassonne",
        "description": "Reise-Carcassonne is, as the name says, a Travel Edition of Carcassonne. &#10;The rules of the game are (mostly) the same, but there are some changes between the two editions: &#10;&#10;    No Expansions: The tiles size of the Travel Edition is smaller than the regular game, so it is not possible to add any expansion for the regular game. EXCEPT The Phantom expansion.&#10;    Le Sac as counting table: The game includes a bag for the tiles that is printed with a counting table. (Le Sac is missing from the 2012 reprint edition, which instead comes with a counting table printed on the back of the box.)&#10;    Third Edition farm scoring: The Rio Grande edition features, for the first time, the current, Third Edition Hans im Gl&#195;&#188;ck farm scoring.&#10;&#10;&#10;&#10;&#10;Belongs to the Carcassonne series.&#10;&#10;",
        "artist": "Doris Matthäus"
    },
    {
        "name": "Johnny Reb",
        "description": "Johnny Reb is a set of miniatures rules from the American Civil War. Units are regiments of 15 to 30 figures divided into 5 bases, with players commanding a division or corps.&#10;&#10;The first edition was published by Adventure Games in 1983. GDW released a 2nd edition with minor changes in 1988, with a scenario book &quot;To the Sound of the Guns&quot; the same year. Johnny Reb III, published by John Hill in 1996 is a very different game, with major changes to the scale (1&quot;:50 vs 1&quot;:40 yards, 1:30 vs 1:20 men, artillery batteries vs sections) and games mechanisms.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Make 'n' Break Extreme",
        "description": "Players race against the clock to copy building plans of various difficulties, each one revealed in turn from a deck of cards. Each completed card is worth a number of points, with harder builds being worth more points. If you spot an error in an opponent's build, call it, and they lose those points. After three rounds, the player with the most points is the champion builder.&#10;&#10;Features 10 new and different shapes from the original Make 'N' Break, leading to new and more challenging tasks to complete.&#10;&#10;",
        "artist": "Kinetic,Henry M. Linder,Walter Pepperle"
    },
    {
        "name": "Surf's Up, Dude!",
        "description": "The game is for 2-6 players. The object of the game is to have as many surfers catch as many big waves as possible in the hopes of picking up more notoriety than the other surfers on the beach.&#10;&#10;",
        "artist": "Jacob Walker"
    },
    {
        "name": "18West",
        "description": "18West is an 18xx design by David G. D. Hecht, published in October 2007 by Deep Thought Games.  18West incorporates a variety of mechanisms into the 18xx framework, including three different types of companies (Granger roads, land grant and public) and subsidized track laying.  Mergers are also involved, in which public companies can acquire Granger roads.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Babylon 5: A Call to Arms (Second Edition)",
        "description": "The eagerly-awaited second edition of the award-winning A Call to Arms Babylon 5 space combat miniatures game is finally arriving. Throughout the station&rsquo;s turbulent history, armed fleets have enacted the harsher policies of their governments. Whether you wish to command an intrepid EarthForce Expeditionary Fleet, a high-tech Minbari taskforce or a cunning Centauri raider group, this rulebook provides you with up-to-date rules to play out your favourite Babylon 5 space battles... or take to the stars and create new legends in the dark.&#10;&#10;The new edition has been carefully honed, based on the comments of A Call to Arms players all around the world - it is faster to play, more comprehensive and finely balanced to portray the very best of space combat in the Babylon 5 universe.&#10;&#10;Inside the covers, you will find new rules for combat, hyperspace, placing Admirals on your ships and a completely revised system for Fighters. As always, scenarios and full campaign rules have been included, making this the most comprehensive release yet for the game.&#10;&#10;This is a rulebook only, the complete fleet lists are in Babylon 5: A Call to Arms (Second Edition) &#226;&#128;&#147; Fleet Lists&#10;&#10;This is a reimplementation of A Call to Arms: Babylon 5 Space Combat&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Song of Blades and Heroes",
        "description": "Song of Blades and Heroes is a fast-play, skirmish-level fantasy miniature system. It uses an action-point system that requires no book-keeping. The rules are designed to be simple, fast and fun so that a mini campaign of several games can be played in a single evening.&#10;&#10;The game uses only 6 sided dice and requires approximately 5-10 models per player. The rules recommend 15 mm figures on a 60x60cm play area, but can be played in other scales. There is nothing scaled in inches or centimetres, three measuring sticks to measure all distances and ranges. Alternatively the game can be played without measuring sticks on a hexgrid.&#10;&#10;The game includes statistics for 180+ monsters and heroes, and details to be able to create your own. Also there are campaign rules where your warband grows more powerful after every battle, and six basic scenarios.&#10;&#10;There are some stand-alone games based on the same system, which could also be used as expansions to the base game:&#10;&#10;&#10;     Song of Arthur and Merlin (2008) - Arthurian supplement featuring sections on the historical Dark Ages king, the Welsh legendary king, and the Hollywood king.  Originally an expansion, in 2011 this was re-released as a stand-alone product.&#10;     Mutants and Death Ray Guns (2008) - a post-holocaust skirmish game.&#10;     Song of the Splintered Lands (2009) - Sourcebook based on the Splintered Light miniatures line.&#10;     Song of Drums and Shakos (2009) - a Napoleonics skirmish game. &#10;     Flying Lead (2010) - a game of gang warfare to Pulp action, from military operations to black-clad assassins.&#10;&#10;&#10;",
        "artist": "Andrea Sfiligoi"
    },
    {
        "name": "Wind & Wetter",
        "description": "In this each player tries to move his 9 pieces to the opposite site. On the board you have several terrain types you can cross or not depending on the weather conditions. But the players can change the weather.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Thebes",
        "description": "Thebes is a game of competitive archeology. Players are archaeologists who must travel around Europe, northern Africa, and the Middle East to acquire knowledge about five ancient civilizations -- the Greeks, the Cretans, the Egyptians, the Palestinians, and the Mesopotamians -- and then must use this knowledge to excavate historical sites in the areas of these civilizations. Through the course of the game, expositions are revealed, and an archaeologist who has treasures from the requisite civilizations may claim the prize (this is a change from the first edition's handling of exhibitions). The archaeologist who learns the most about the civilizations, claims the greatest-valued artifacts, and collects the most exhibitions will win out over his or her colleagues.&#10;&#10;The key element to the game is that it is played out over a period of two (or three) years, and each action a player performs takes a certain amount of time -- traveling is a week between cities, gathering knowledge takes time for the level of the knowledge, and actually digging at a cultural site takes time to yield a certain number of artifact tiles. The game uses a novel mechanism to keep track of this. There is a track of 52 spaces around the outside of the board. Each time a player moves and takes an action, he or she moves their player token forward in time. Players take turns based on being the one who is furthest back in &quot;time&quot;. So, a player can go to an excavation site and spend 10 weeks digging for artifacts, but that will also mean that the other players will likely be taking several actions in the interim while that player waits for the &quot;time&quot; to catch up.&#10;&#10;In addition, the artifact tiles for each civilization are drawn from a bag that also contains dirt.  When a player excavates a site, that player pulls tiles from the bag, but some may only be worthless dirt instead of valuable treasure. That dirt is then returned to the bag, making the first draw more likely to provide useful tiles.&#10;&#10;This is the new entry for the Queen printing of Jenseits von Theben.  As the new game changes several mechanisms of the original, and is available in a much wider release, the two games should be regarded as separate entities.&#10;&#10;Re-implements:&#10;&#10;    Jenseits von Theben&#10;&#10;&#10;&#10;&#10;",
        "artist": "Michael Menzel"
    },
    {
        "name": "Power & Weakness",
        "description": "England in the 5th century; Saxons against Celts!&#10;The players try to gain control over England. Knights and magicians in their service are sent to the provinces to conquer their opponents.&#10;But the methods of magicians and knights are very different. The knights turn to their swords and must slog overland from province to province. Meanwhile, the magicians can make use of the secret magical places and appear by surprise in an area that the knights believe is already secured for their own side. And so the struggle surges to and fro until one side attains power.&#10;What is unique in &lsquo;Power &amp; Weakness&rsquo;, is that two games are played at once; one game for magical control and one game for military control. Each player must decide whether to concentrate on the military or the magical field - or to try to be equally good in both - in order to attain power and gloat over the weakness of the opponent.&#10;&#10;Power and Weakness is played in &lsquo;cycles&rsquo;. There is a Sword cycle and a Magic cycle. Each cycle has slightly different rules. The length of a cycle varies. During a cycle the players take turns alternately &ndash; until the end of the cycle when one of the players will receive a victory point.&#10;At the end of a cycle you check whether one of the players has won. If neither player has won, the next cycle begins.&#10;&#10;Home Page: http://www.mod-games.de/MODGames/Rahmen.html?Main=MUODT.html&#10;&#10;",
        "artist": "Richard van Vugt"
    },
    {
        "name": "Police 07",
        "description": "This game is strongly based on Scotland Yard but the map is of Budapest instead of London.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Lascaux",
        "description": "Lascaux is a game about the French caves containing animal paintings; discovered in 1940 by four teenagers.&#10;&#10;This auction game is based on the bidding mechanism of Michael Schacht's Mogul also implemented in No Thanks!&#10;&#10;The deck consists of 54 cards each representing one of six animals and a combination of two colors. At the beginning of a round, cards are turned face up until all six colors are showing or seven cards are face up. All players secretly decide which color cards they hope to win at the end of the round. On their turn, players bid by placing a stone on the table. If a player passes, he picks up all the stones currently on the table and places his token on top of the token pile. The last player remaining grabs all the cards of the color he had chosen earlier in the round. The second to last player, whose token now sits at the top of the token pile, then picks up all the cards of his chosen color if any cards of that color are left. The same process is repeated for each player when their token is at the top of the token pile. The game ends when all the cards of the deck have been claimed. Players then earn points for each animal for which they have majority.&#10;&#10;Components: 54 cards, 50 stones, 30 markers, rules.&#10;&#10;Released: Essen 2007.&#10;&#10;",
        "artist": "Harald Lieske"
    }
]