[
    {
        "name": "Scuba",
        "description": "In Scuba, two to four players jump from the diving boat to have a fun time diving. While moving and flipping over the tiles on the board, they hope to find spectacular fish, mammals and corals, make combinations and score big points. Or just look at fish other players already discovered... Maybe they will even find treasure! But be careful not to lose your mask or get bitten by an octopus... Make dust so other players can't find any fish that turn. And be wary of currents sweeping all fish around the board. And even more important, keep an eye on your air at all times! If you plan badly and use all your air while still diving, you won't live to tell your stories...&#10;&#10;",
        "artist": "Sebastian Koziner,Shaz Yong"
    },
    {
        "name": "Tunhell",
        "description": "Tunhell is a family card game, epic and fun in which every player is at the head of dwarves' crew and tries to amass more treasures than his opponents. Then recruit, dig at your own risks and fight!&#10;&#10;Beardiest player can begin! Play then proceed clockwise around the table, each player taking one turn at a time until the game ends.&#10;&#10;On his turn, a player must perform one (and only one) of the 2 following actions:&#10;&#10;     Play a Dwarf and apply its effect&#10;&#10;&#10;&#10;&#10;OR&#10;&#10;     Recruit a Dwarf&#10;&#10;&#10;&#10;&#10;A player can play one (and only one) &laquo;Dwarf&raquo; card on his turn. There are 4 kinds of Dwarves : Warriors, Diggers, Scouts and Blasters. Each kind has a different color and a different symbol on the top of the card. Each has a particular effect:&#10;&#10;    A Warrior can fight enemies and make the access to the mine harder for other players.&#10;    A Scout is allowed to see the 3 or 5 first cards of a Mine (depending on his Recon Value) without showing opponents...&#10;    A Digger can, of course, dig in a Mine and tries to find treasures!&#10;    The Blaster makes all the Warriors on a mine run away. All Warriors are discarded.&#10;&#10;&#10;&#10;&#10;To recruit a Dwarf, the active player picks a &laquo;Dwarf &raquo; card available in the &laquo;recruitment center&raquo; and adds it to his hand. Then he immediately puts a replacement card face-up from the deck to have 5 cards in the row again. A player cannot have more than 6 cards in his hand.&#10;&#10;The game ends immediately when 2 of the 3 decks of &laquo;Mine&raquo; cards are empty. Each player adds the Victory points of the cards of his loot, and the trophies he eventually obtained. The player who has the most is the big winner. Well, big&hellip;&#10;&#10;",
        "artist": "Vincent Burger"
    },
    {
        "name": "Panda Head",
        "description": "Description from the publisher:&#10;&#10;What's not to love about pandas?! Panda Head is a trick-taking card game in which the winning panda is the one who stays awake the longest by scoring the fewest points.&#10;&#10;That's right: Points are bad! The more points you score, the drowsier you get, and you don't want to end up a pooped panda. Don't be bamboozled!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "KINMO",
        "description": "Legend says: The one who brings back the 4 stones of the King KINMO's crown will be elected as the new leader of the Order of the Jungle.&#10;&#10;KINMO is a fast and easy to play game, in which you try to form groups of action cards and collect stones of different colors. This is accomplished by taking cards from a single deck, and everyone must choose how much cards to discard in order to take news cards. Also, you can pick up stones, deal damage to your opponents or cure yourself.&#10;&#10;Spanish version: La leyenda dice que aquel que recupere las 4 piedras de la corona del Rey KINMO ser&aacute; erguido como el nuevo l&iacute;der de la Orden Selv&aacute;tica.&#10;&#10;From publisher&#10;&#10;",
        "artist": "Juliana Bernabeu"
    },
    {
        "name": "Risk: Game of Thrones",
        "description": "Description from the publisher:&#10;&#10;Risk: Game of Thrones, based on the epic HBO series, features two ways to play, including factions of noble Houses vying for control of Westeros during the time of The War of the Five Kings, as well as Daenerys Targaryen's rise to power in Essos.&#10;&#10;War and chaos have descended upon the realms of Men. In Westeros, the death of Robert Baratheon has created a power vacuum with rival Houses competing for control of The Iron Throne. Meanwhile, in Essos, Daenerys Targaryen is building an army to contest the rule of the Ghiscari slavers, before returning to reclaim The Iron Throne. There are 3 different ways to play RISK Game of Thrones:&#10;&#10;1. SKIRMISH&#10;Basic version designed as an introduction to RISK Game of Thrones game play. Once you are comfortable, move on to Dominion.&#10;&#10;2. DOMINION&#10;Advanced version of RISK Game of Thrones including Objectives, Characters, and Maester cards, offering more in-depth strategic action.&#10;&#10;3. WORLD AT WAR&#10;Play with both maps and up to seven players using either the Skirmish or Dominion rules.&#10;&#10;RISK Game of Thrones includes two game board maps and seven House armies. Westeros map is for 3-5 player game and Essos map is for 2 player game. There is a deck of territory cards for each map, and these function in a similar way to the original RISK gameplay. When playing Dominion rules, the character cards can grant special abilities to your House, the maester cards can grant tactical advantages during deployment and battles, and objective cards create goals and strategies for earning Victory Points.&#10;&#10;Skirmish rules are most similar to the original RISK rules. There are minor thematic variations to suit the new map. The winner is determined by which player controls the most territories, castles and ports when the end game card is revealed.&#10;&#10;Dominion rules add the additional mechanics and cards described above. Instead of simply trying to control the most territories, castles, and ports you are now trying to achieve specific Objectives to earn Victory Points, furthering your efforts to consolidate power and establish dominion over the rival Houses. Objectives are worth from 1 to 4 Victory Points, based on the difficulty to achieve them. The first player to earn 10 Victory Points while also controlling their Seat of Power wins the game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Dino Twist",
        "description": "Sharp  your claws and fangs, avoid disasters , meteors and gather the strongest dinosaurs!&#10;&#10;Dino Twist is a family game of cards , fast and smart, where players will have to fight the Dinos on the island of Twist, then recover them on their islands to score the most points. But beware to the events that will spice up the battles !!!&#10;&#10;The goal of the game is to have the strongest Dino on our island.&#10;&#10;How to play.&#10;At the begin chose randomly 10 events on the 25, it will give a 10-15 mn game.&#10;At the beginning of each turn, you reveal a event that apply for all players (except the first turn).&#10;All players together, choose Dino from their hand, place it face down and reveal simultaneously.&#10;If you play the same Dino (same species and same strength) you can't attack the Island of Twist and you discard your Dino in the cemetery.&#10;The smaller Dino strike first, attack the Dino on the Island of Twist, and take it back to is own Island.&#10;Each species can only attack their specie.&#10;To attack a Dino, your Dino must be strongest (look at the number of strength)&#10;&#10;At the end of the 10 events, the player with the most point on his island is the winner.&#10;&#10;There is bonus, for the player who finish the Island first, second and third, and the player with the most Dino with big claws).&#10;&#10;In the game, you have two different Island, one for children, initiation and one for adult more advanced game. In the advanced game you will have to respect the territories and species, whereas in the children game, you will be free to put any Dino of any species on your Island.&#10;&#10;",
        "artist": "Stéphane Escapa"
    },
    {
        "name": "Me Want Cookies!",
        "description": "Description from the publisher:&#10;&#10;Me Want Cookies! is a cute family game for 2-5 players in which each monster tries to be the first to find the correct dessert and gain the most points.&#10;&#10;In more detail, you are a nice monster with a big appetite for desserts. For each course of the meal, only one monster can eat a dessert and only the right dessert. Spot it before the others devour it!&#10;&#10;1. Roll the die to set the first dessert.&#10;2. Follow the licorice up to the dessert at the other end.&#10;3. Grab the right dessert!&#10;&#10;",
        "artist": "Ian Fortin"
    },
    {
        "name": "Tail Feathers",
        "description": "Description from the publisher:&#10;&#10;Villainous rats have allied with vicious hunting birds to pillage the humble mouse settlement across Meanderfield. But look! Brave mice, mounted on starlings and blue jays, swoop in to wage war against this evil alliance! The Downwood Militia soars into action against the Vermin Raiders!&#10;&#10;Plaid Hat Games proudly presents Tail Feathers, the exciting new miniature skirmish game by our very own Jerry Hawthorne set in the beloved world of Mice and Mystics. Soar across the table, send your troops on dangerous missions, lock beaks with opposing birds, and defend your nest!&#10;&#10;Featuring the beautiful hand-sculpted miniatures by Chad Hoverter Mice and Mystics fans have come to love, Tail Feathers raises the stakes with 13 dutiful ground troops, 5 headstrong birds that tilt for launching and turning, plus 5 daring pilots. Players will recreate the famous battles for aerial supremacy that shaped the Mice and Mystics world.&#10;&#10;Outwit and outfly your opponent in stand-alone scenarios, or play a full campaign and see your units gain skill from one battle to the next.&#10;&#10;Tail Feathers is a stand-alone game, not a Mice and Mystics expansion, but you can use your Mice and Mystics: Sorrow and Remembrance miniatures in Tail Feathers right out of the box.&#10;&#10;Tail Feathers offers cinematic gameplay and a fresh, whimsical setting for tabletop skirmish gaming. Players must balance the use of both flying and ground units to achieve victory. Here are some highlights:&#10;&#10;&#10;     Compatibility! If you already own Mice and Mystics, you're in luck! Tail Feathers includes cards which allow you to use your Mice and Mystics figures in Tail Feathers! Bam!&#10;     Story driven campaign! Tail Feathers includes a scenario book with story rich scenarios all designed to be played either as both stand-alone experiences or linked together as a campaign.&#10;     Unique and challenging flight system! Tail Feathers includes 5 beautiful bird miniatures that are mounted on a special flight stand that allows the birds to 'tilt'. This tilting is a mechanism used to determine your flight direction, but the skill of effectively maneuvering your birds is up to you!&#10;     Everything you need! No empty box here. Tail Feathers comes with enough content for two players to field fully-realized, battle-ready forces, as well as cards that allow you to utilize your Mice and Mystics: Sorrow and Remembrance figures as Tail Feathers ground troops right away. &#10;&#10;&#10;Tail Feathers expands the Mice and Mystics universe, introducing fans new and old to the battles on birds that secured peace and safety for the Downwood Forest. Tail Feathers' innovative game system will provide hours of fun and excitement in the world of Mice and Mystics.&#10;&#10;",
        "artist": "John Ariosa,Chris Quilliams,David Richards,Brian Valeza"
    },
    {
        "name": "Stellar Conflict",
        "description": "Stellar Conflict is a fast-paced space combat game with real-time elements set in the Among the Stars Universe.&#10;&#10;In this game, which reimplements the James Ernest and Tom Jolly design Light Speed, players take over the role of an alien race taking part on a space battle. Each player has his/her own fleet and based on the size of the battle, he/she chooses which ships will be deployed for combat (deployment phase). Each race has its own power and abilities which grants it different advantages in combat.&#10;&#10;After both players have deployed their forces in this time-limited real-time phase, the combat phase begins.&#10;&#10;The Combat Phase lasts a random number of Rounds based on which ships have been deployed on the battlefield. Each Round, different ships fire their weapons and perform their abilities trying to destroy enemy ships and/or complete objectives.&#10;&#10;Stellar Conflict offers a more advanced, deeper alternative to Light Speed. Each race has its own fleet of different ships and abilities guaranteed to offer lots of replayability.&#10;&#10;",
        "artist": "Jim Francis (II),Konstantinos Kokkinis,Antonis Papantoniou"
    },
    {
        "name": "The Producer: 1940-1944",
        "description": "Imagine living during America's Depression. You live dreaming the life of a film star &mdash; until a telegram announces an unexpected inheritance: two million dollars and the property of a shed on the outskirts of Los Angeles. Will you turn this barren land into the studio of a major film producer &mdash; or squander your fortune fading in the golden dust of the California desert like so many others before you?&#10;&#10;The Producer: 1940-1944 is a board game inspired by the great Hollywood movies. The aim of the game is to score more points by winning awards for actors and film directing, building the structures of their studio, or producing more films of different genres. The player must decide which strategy to follow early in the game based on the script and cast with which depart.&#10;&#10;The game consists of three or five rounds corresponding to three years. Every year, each player will fish and play in turns six cards event that will simulate the intervention of professionals to improve their own films or sabotage others', or the occurrence of historical facts, such as Pearl Harbor, the invention of the computer, the skirmishes between the Mafia and the FBI. For each card played you will place its own &quot;Producer&quot; (worker) to activate areas on your dashboard (the studios) or different locations on the main scoreboard that represent Hollywood.&#10;&#10;You can buy scripts, engage the biggest movie star of the time, young players with a great future and legendary directors. At the time of producing each film, it will extract from a pool of tokens representing the potential audience for that year and the choice of which films produce must be made according to specific strategies to meet the latent demand.&#10;&#10;If the production of the film will procure players the money to expand own activities, the award ceremony at the end of each year will give them the necessary points for the win, making the economic aspect important but not relevant to the final score.&#10;&#10;At the end of the third year in the base game (or in the case of the fifth game to experts), it will award bonuses and the Reckoning will be to determine the winner.&#10;&#10;Every aspect of the game: dynamic production, events, characters, scripts, have been played so historical in order to give movie fans a reproduction as faithful as possible of Hollywood of the 1940s. Every script and character shows in addition to game information, rumors, gossip and curiosity that will delight even the players less competitive.&#10;&#10;",
        "artist": "Maurizio Faleschini"
    },
    {
        "name": "JurassAttack!",
        "description": "In JurassAttack!, two players face off in an epic face-to-face dinosaur battle!&#10;&#10;In the game, each player chooses a dinosaur or pack of dinosaurs of the same type from their hand, then they reveal them simultaneously to compare Ferocity values. The player with the highest total Ferocity wins the round, taking their rival's dinosaurs into their score pile. Different types of dinosaurs are worth varying amounts of victory points, so it's important to plan well and make sure not to give away too many points in the event of a knockout!&#10;&#10;These fierce, prehistoric beasts each have their own special effects as well. Some hunt alone while others may pack with dinos of different types. And sometimes, with a well-placed bluff, players may even be able to sneak some of their precious eggs into their own score pile to protect the future generation.&#10;&#10;",
        "artist": "Shaz Yong"
    },
    {
        "name": "Avalanche at Yeti Mountain",
        "description": "It's a race to the finish when some super-smart, yet somehow clueless, engineering students invent rocket-powered skis and decide to test them out at Yeti Mountain!&#10;&#10;In Avalanche at Yeti Mountain, players play multipurpose cards &mdash; the same cards used to make up the ski slopes of Yeti Mountain &mdash; to determine their speed in a race down the mountain. If players collectively exceed the speed limit, which is determined by the number of players, the fastest players crash, only moving one space forward towards the goal. Players may also activate rocket jumps to overshoot the competition but at the expense of causing an avalanche to begin chasing them down the mountain. If that's not enough tension, rocket jumps are possible only if the Yeti, awoken from his slumber by all of the rocket-powered racket, doesn't attack and deactivate players' rocket-powered skis! The last skier standing, or the skier who makes it to the bottom of Yeti Mountain, wins the game.&#10;&#10;",
        "artist": "Adam P. McIver"
    },
    {
        "name": "Agility",
        "description": "The sky breaks blue and bright over a mouth-watering field of obstacles. You&rsquo;ve adopted, loved, and trained your team of Agility Dogs to share in the joys of a day just like this. Their exuberance is catching as they prepare to breathtakingly weave the poles, sail over hurdles, blast through tunnels, round corners at top speed with fur a-tussle, and harness lightning while waiting for your cue on the trust-testing pause box. Your Husky's glacier blue eyes are clear and focused, your Golden Retriever mirrors the sun with radiant energy, and the feisty little Jack Russell pup is ready to run with the big dogs. Test your wit and instincts in this two-player game of vision and versatility!&#10;&#10;Agility applies a unique mechanic in which cards that supply resources also select actions. On your turn, you play a Training Card that provides one of two types of resources in varying quantities while also granting an action building off of what your opponent just played. This encourages clever planning and timing. Training you need may be at odds with the action you&rsquo;d like, so weighing your options will be crucial. Resources may be used to adopt dogs or to clear obstacles on the three courses you've drafted from the six available each game. Courses can only be claimed once a dog is adopted, so there is a race within a race to snatch up Wonderdogs or Underdogs well suited to the available courses. Then it&rsquo;s nip and tuck as the canine competitors bound over, under, and through to the finish lines!&#10;&#10;",
        "artist": "Vince Dorse"
    },
    {
        "name": "GobbleStones",
        "description": "GobbleStones is a tile-laying game in which players are hungry little goblins who love to eat stones. During play, you gobble up the most valuable stones across the board, and in the end the fattest goblin wins. It's CRUNCH time!!!&#10;&#10;In more detail, players set up the game board by laying nine game boards in a 3x3 square; each game board features 25 spaces on it in a 5x5 array, and each space has both a color (one of five) and a number (one of six). Thus, you'll have a game board that measures 15 spaces on each side.&#10;&#10;Players start with several 1x1 tiles, with each tile being one of the five colors. On a turn, you take exactly five actions, first playing 0-5 tiles, then drawing 5-0 tiles, e.g., playing three tiles, then drawing two. You play tiles onto the game board akin to playing words in Scrabble, with you covering the appropriate colors with your tiles as a single word and scoring the numbers that you cover. One tile-laying restriction: You can't place tiles so that a 2x2 area of the game board is covered.&#10;&#10;",
        "artist": "Tina Bongorno"
    },
    {
        "name": "Fram R'lyeh",
        "description": "This game looks a simple trick-taking game. Each player plays a power card and the player who played the greatest power card wins a treasure.&#10;&#10;However, Victory points of the treasure is revealed to only one player(dealer). Other players have to guess the victory points with the power card played by the dealer. And be careful! The winner's power card becomes negative points as well.&#10;&#10;Winning is not only getting victory points but also getting information. The winner becomes next dealer. Exactly, you may peek at both the treasure you win and the treasure of next round.&#10;&#10;All players with negative VP are attracted to The Abyssuspolis and become cultists of The Old One. If at least one player isn't a cultist, he can call for aid and stop their intrigue. However, if all players do become cultists, THE OLD ONE AWAKENS. In this case, the player(s) with the most negative VP win! The Old One gives favor to people attracted to insanity the most.&#10;&#10;",
        "artist": "Gun_zi"
    },
    {
        "name": "Virus!",
        "description": "Experimental virus outbreaks have escaped the lab and only you can stop them! Face the pandemic and compete to be the first to eradicate the virus by isolating a healthy body. Ethical or not, all means at your reach are valid to achieve victory. Use your wits to boycott your rivals' efforts and win.&#10;&#10;Each turn in Virus! you either play a card or discard any number of cards, then you replenish your hand to three cards. Cards can be:&#10;&#10;&#10;     One of four organs (or the joker organ)&#10;     One of four viruses (specific to each organ or the joker virus)&#10;     One of four pills (specific to each organ or the joker pill)&#10;     A special action card&#10;&#10;&#10;You can play only one of each organs in your player area. Pills and viruses can be played on any player's organs, but only on the same color organ. A second pill on any organ immunizes it against infection. Your goal is to be the first to have four healthy organs in front of you.&#10;&#10;",
        "artist": "David GJ"
    },
    {
        "name": "Villages of Valeria",
        "description": "A village-building card game set in the world of Valeria. Establish resources, construct buildings, and attract adventurers to your Village to be crowned the next capitol city.&#10;&#10;Each player takes a turn taking one action from the following list and all other players may follow the action but with fewer rewards:&#10;&#10;Tax: Take 1 Gold and Draw 1 Card. (Follow: Draw 1 card.)&#10;Harvest: Draw 3 Cards. (Follow: Draw 1 card.)&#10;Develop: Discard 1 card to add a Resource to your village. (Follow: Discard 2 cards to add a Resource to your village.)&#10;Build: Add a building to your village. Draw a card. (Follow: Add a building to your village, but do not draw a card.)&#10;Recruit: Pay 1 Gold to add an Adventurer to your village. (Follow: Pay 2 Gold to add an Adventurer to your village.)&#10;&#10;Building cards can be used for 2 reasons. 1) Pay resources to add it to your village as a building and gain its benefit and VP. 2) Develop it as a Resource and place it under your Castle card.&#10;&#10;When building, use resources you have developed or pay another player 1 Gold to use their resource.&#10;&#10;The game ends when a player has built or recruited 10 buildings/Adventurers.&#10;&#10;",
        "artist": "Mihajlo Dimitrievski"
    },
    {
        "name": "Siggil",
        "description": "Siggils are magical seals where spirits are locked. The players must untie a Siggil and capture the spirits that are escaping!&#10;&#10;Siggil is a card game for 1 to 4 players that contains seven families of seven cards numbered 1 to 7 and seven unique spirits cards, each associated with a family and a number. All cards are thoroughly shuffled, including spirits, then placed level-by-level, overlapping face down and face up, according to a simple form called a Siggil. The game includes description to build several Siggils like: The Pass, The Turtle or The Pyramids.&#10;&#10;On his turn, a player draws a card from the Siggil and takes it in his hand. When a spirit escapes the Siggil, players can capture it by playing the right combination of cards from their hands. The winner is the first player who controls more spirits than the others at the end of the game.&#10;&#10;Siggil also includes rules for a solitary game.&#10;&#10;",
        "artist": "Maud Chalmel"
    },
    {
        "name": "Expo 1906",
        "description": "Milan, early 20th century, the city is in turmoil as more than 200 new buildings are rushed to being completed in time for welcoming the best minds of the planet. The 1906 Universal Exposition is approaching and, as one of the 40 exhibiting nations, you are confident that your engineers and scientists will impress the world. Who will exhibit the most impressive technological advancements? Which energy source will prevail: the majestic power of Steam or the more elegant and efficient Electricity? Can you prevail in prestige and glory against the other competing nations?&#10;&#10;In Expo 1906, players will win by totaling more prestige points at the end of the game than their opponents. Points are awarded for completing Projects which represent historical inventions of the period. To complete a Project, a player must purchase Resources and place them in a proper combinations together with a Project in his Laboratory. This is a challenging task as Projects come in many different shapes and must fit together with their resources in an already tight space. Soon the available room in the Laboratory will reduce and players will face the puzzle solving aspect of the game.&#10; Strategy plays an important role too: to speed up the completion of a Project players can acquire Technologies, which can either reduce the number of Resources required to complete a Project or enhance the type of actions at their disposal. This will require careful management of the available space in their Laboratory too. Also, by registering ideas at the Patents'Office players can become leader in the development of specific Resources and accumulate more prestige points when completing Projects. Setting priorities between all these actions will become critical as players rush to prepare in time for the upcoming World Exposition.&#10;&#10;",
        "artist": "Giorgio De Michele"
    },
    {
        "name": "Rolling America",
        "description": "Rolling America, based on the 2014 release Rolling Japan, is a light &quot;multiplayer solitaire&quot; dice game. Each player has a map of the United States that's divided into fifty (abstractly represented) states, which are then bunched together into six differently colored areas.&#10;&#10;On a turn, a player draws two regular six-sided dice from a bag and rolls them; the bag starts with seven dice, six matching the colors of the areas on the map along with a wild clear die. All players now write down each number rolled on any state of the matching color, i.e., if the blue die shows 4 and the yellow a 2, write a 4 in one blue state and a 2 in one yellow state. If the clear die is rolled, you can place this number in a state of your choice; additionally, three times per game you can choose to use a non-clear die as any color. However, neighboring states can't have numbers with a difference larger than 1; if you can't place a number without breaking this rule, then you must place an X in a state of the appropriate color. (If all the states in an area are filled, you can ignore the die or use one of your three color changes to place the number elsewhere.)&#10;&#10;Rolling America has a few changes from Rolling Japan. The &quot;guard&quot; action allows you to ignore the neighboring number restriction three times during the game, and the &quot;dupe&quot; action allows you to use one of the active dice twice in the same region. As in real life, Alaska and Hawaii are not connected to the continental United States, so you can drop any numbers you want in those states!&#10;&#10;After six dice have been rolled, mark one round as being complete, then return the dice to the bag and start the next round. After eight rounds the game ends, and whoever has the fewest Xs on their map wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Witkacy",
        "description": "In Witkacy, you are going to restore copies of paintings by the famous polish artist Witkacy. In order to get the most of them, you need to look for the right fragments. The player who has the most copies restored wins, but at the same time, popular paintings are more valuable than others.&#10;&#10;Each player starts with one double-sided card and puts it in front of themselves as the start of their collection. In each round players take one card, may play a special action, then add the card to their collection. Each card is divided in three segments and shows only part of a painting &mdash; at least one quarter of it, half at most.&#10;&#10;The aim of the game is to choose which parts of the cards to connect and when and how use the special one-time actions.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Apollo XIII",
        "description": "Apollo XIII tells the whole story of that mission through a card-driven game system. Follow the story and face all of the disasters that plagued that mission!&#10;&#10;To ensure the survival of the crew and get them back to Earth, you need to work together in this cooperative game to manage each setback that the mission faces. Your team must coordinate their actions, or you will not finish the mission! Of course, if you want an even bigger challenge, you can try the optional &quot;competitive mode&quot; to see who is the best mission coordinator!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "OctoDice",
        "description": "The theme of OctoDice is based on Aquasphere, and the game mechanisms recall that board game. On your turn, you roll six dice (three white and three black); two dice (one white and one black) form an action. Every roll you must pick exactly two dice to take out (any colour). In the end you combine the six dice any way you want, no matter in which order you chose to take them out of your rolls beforehand. You can use only two actions on your turn. On your development sheet you enter the actions chosen for this turn and note your points. You can also decide to &quot;expand your lab&quot; which will give you bonus actions or points. Other players may pick any action combination from your dice roll to add to their sheet. Do not forget to fight Octopodes ;) The game ends when each player had 6 turns. Whoever has the most points in the end wins.&#10;&#10;",
        "artist": "Dennis Lohausen,Andreas Resch,Hans-Georg Schneider"
    },
    {
        "name": "RevoltaaA",
        "description": "Revolution is the key word, and the question is which side will prevail? Ducks or robots? Choose your side carefully because in the end it determines how many real points you've won!&#10;&#10;RevoltaaA consists of a 66-card deck, with 7&times;0, 6&times;1, 5&times;2, 5&times;3, 5&times;4, and 5&times;5 cards in both ducks (red) and robots (blue). Each player starts with 11 cards in hand, and 11 cards are placed in a deck on the table. Each round, reveal the top card of the deck; each player then selects one card from hand and reveals them simultaneously. Whichever side - duck or robot &mdash; has the highest sum has won the round, and whoever has played the lowest card of this side wins these cards. (In a tie for lowest, the next lowest card of this side wins; if no cards of the winning side are unique, then the deck wins.) The winner stacks these cards and places a card of the winning side on top of this stack, then a new round begins.&#10;&#10;As soon as a side has won four times, the game ends with this side being victorious. Each player scores one point for each stack in front of them that shows this side and one point for each card of this side still in hand. Whoever has the most points wins! (Alternatively, play a number of games equal to the number of players and sum your points over those games.)&#10;&#10;RevoltaaA includes a &quot;bananas&quot; variant in which the face-down deck is not used and cards aren't played simultaneously. Instead one player leads a card face up, then each player lays down a card in turn, with the winner being chosen the same way and the first player breaking ties. The winner of one round leads the next, and points are scored as in the original game.&#10;&#10;",
        "artist": "Franz Vohwinkel,Imelda Vohwinkel"
    },
    {
        "name": "Warhammer: Age of Sigmar",
        "description": "Warhammer: Age of Sigmar is a skirmish tabletop game for two or more players where you command several armies from a huge range that goes from  Humans, Dwarves, High Elves, Undead Vampires, Orcs, Beastman and lots of races. This book provides you with all the rules you need to play, and guides you through collecting and painting your own army of Citadel miniatures.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Stingy",
        "description": "As a pirate captain, it's hard to steal booty &mdash; but it is even harder to share that booty equally. If you can outsmart your fellow pirates by using your brains and trading skills, you'll probably end up with the most valuable loot!&#10;&#10;Stingy is an interactive booty-swapping game for 2-6 players, with the booty in question being rum, parrots, coins, diamonds, and pirate flags; these first four items come in four colors, with 3-6 tiles of each item in those colors, while the pirate flags come only in black (as you might expect).&#10;&#10;Each player starts with six randomly drawn tiles, with the remainder of the tiles being scattered face down on the table or placed in the included pouch. On a turn, you swap tiles with a fellow player, then draw 1-2 tiles and add them to your collection. When you swap, you choose an opponent, then take all the tiles of one group (matching symbol &amp; matching color) and add it to your collection. Each group has a value, with the values mostly being pyramidal (1 tile = 1, 2 tiles = 3, 3 tiles = 6, etc.). In return, this opponent then takes one or more groups from you that sum at most the same value as what you stole. If it's impossible to take groups this way, that opponent can take groups that sum to a lower value or demand that you hand over groups that sum to a higher value, with you choosing which groups you give up.&#10;&#10;When you collect all the tiles in a group (e.g., four blue parrots), you place those tiles face down to the side. No one can take these tiles from you.&#10;&#10;After the last tile is drawn, each player takes one final turn, then players score points &mdash; but only for the complete groups that they've collected. Whoever has the most points wins.&#10;&#10;Stingy includes two-player rules that introduce a ghost pirate with whom players can trade, a variant in which players also score points for the number of differently colored groups they collect, and a &quot;Captain Sly&quot; variant in which an opponent who can't take tiles worth at most what you took gets nothing. Good luck trying to make those unfair trades!&#10;&#10;",
        "artist": "Roman Kucharski,Franz Vohwinkel,Imelda Vohwinkel"
    },
    {
        "name": "Zena 1814",
        "description": "The events of Zena 1814 take place during the eight months in which Genoa was an independent city, following the end of Napoleonic domination and lasting until the Restoration of the Congress of Vienna. As the city's great families did in reality, you must cooperate with your rivals to reap the rewards of shared commercial ventures and the prestige of successful military victories. But your ultimate goal is to surpass all the others in the race for prestige! Zena 1814 is a game in which cooperation and competition always go hand in hand &mdash; but in the end there can be only one winner!&#10;&#10;The focus point is that is possible to place influence cubes on cards, including the ones played by opponents. This causes a very strong interaction among players and plenty of choices.&#10;&#10;In each round, players can move their pawns through the game areas and play cards from their hand belonging to areas where they have at least a pawn. On each card are spaces that allow others to influence it; the player who played it must influence it, while the others can decide whether to do it or not to obtain the effect of the card. Each time a player chooses to influence a card played by another, this one gains a smaller one-time bonus. This participation aspect reflects what really happened among historically families in those years...&#10;&#10;",
        "artist": "Luigi Berio,Paolo Vallerga"
    },
    {
        "name": "Visby",
        "description": "Visby is a short, but challenging game. Each player has an identical set of eight cards, each of them with a special effect.&#10;&#10;At the beginning of a round, the common supply on the board becomes more attractive by adding seals (victory points) and wares and by improving the ratio to change wares into seals. All players choose one card from their hand simultaneously and place it face down in front of them (two cards in a two- or three-player game). Then the cards are revealed and the effects become active:&#10;&#10;&#10;     Knights and Troops take victory points;&#10;     Blacksmith gets wares for each Knight/Troops played by other players;&#10;     Ships and Fleets get wares; Tollkeeper gets seals for ships and fleets;&#10;     Merchant changes wares into seals;&#10;     Monk gets wares for merchants and number of cards already played.&#10;&#10;&#10;Players with a monk take all cards back to their hand, while others proceed with their remaining cards.&#10;&#10;The specific issue is that the more efficient cards become effective only after those which are not that strong. For example, a fleet gets you three wares, but the ship gets you all the remaining ones. If there are ten wares and one opponent played a fleet, you get the seven remaining wares after he has taken three. If three other players play a fleet and take three wares each, you gain only one for your ship. How effective your card is depends on what the other players do &mdash; but you cannot be sure of what they'll do because all decisions are made simultaneously. Perhaps, though, you remember which cards the others have already played...&#10;&#10;Visby comes in a basic set for two players and can be enlarged with one or two expansion packs that contain material for two additional players each (to the maximum of six players).&#10;&#10;",
        "artist": "Christian Fiore"
    },
    {
        "name": "Dungeon Solitaire: Tomb of the Four Kings",
        "description": "Tomb of Four Kings is a fantasy adventure card game for a single player using a standard 52 deck of playing cards and one joker. With each turn, you defeat monsters, disarm traps, and open doors as you explore a dark dungeon. Along the way you collect treasure, gain skills, even use magic. But death awaits those who linger too long, and if all your torches burn out you will be lost in the dungeon forever. The objective is to find the tomb hoards of four ancient kings, collect as much additional treasure as possible, and make it out alive.&#10;&#10;The spread is the standard layout for the game. At the top of the spread is an area where you play torches (A), as they appear. In the middle of the spread is the dungeon area itself. Turns descending into the dungeon are played in a row from left to right. This row is called the delve. The turns ascending from the depths of the dungeon are played underneath the delve from right to left, with one turn for each turn of the delve except the turn-around point. This is called the retreat. Below the dungeon area, from left to right are a discard area, a hit point counter, and a hand where you collect your treasure, tomb hoards, skill cards, and magic scroll.&#10;&#10;The game is divided into turns. Each turn, you play a series of cards in the dungeon area. The turn represents an encounter as you explore the vast and sprawling dungeon. Layer the cards in a column while the turn is active. When the turn is over, stack those cards face down before moving on to the next turn. Each turn starts by playing cards from the deck until an encounter card appears.&#10;&#10;If you make it out of the dungeon alive, add up all the treasure in your hand.  If you found all four kings and survived, you have won the game, regardless of points. Multiply total points by 100 to calculate the value of your treasure in gold pieces.&#10;&#10;",
        "artist": "Matthew Lowes"
    },
    {
        "name": "Wikipedia: The Game About Everything",
        "description": "Three exciting Wikipedia games to challenge your brain: Wiki-Trivia, Wiki-Ranks and Disambiguation. It's informative, it's collaborative and it's fun! Which of you and your friends know the most about everything?&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Hoard",
        "description": "Can you gather and secure more treasure than your fellow-adventurers from the Hoard of the sleeping dragon? Can you defend yourself from their attacks and perhaps perpetrate a few of your own? And can you end the hunt at the most opportune time, perhaps by actually wakening the fearsome beast?&#10;&#10;Hoard is a dynamic game of hand management, set collection, and press-your-luck. Each turn players take one of four possible actions:  1) roll a custom die and move to take a new card, 2) secure a set of treasures or add to an existing set to score points, 3) affect the dragon, who wakes in stages from his tail to his head, by playing cards that soothe or rouse him, or 4) use a sword on an opponent or capture a used sword with a shield. The board is composed of 12 facedown cards surrounding the dragon.  It changes as players remove and replace the cards. Dice rolls between 1-5 enable clockwise or counterclockwise movement and the special symbol allows access to all but one of the cards, so it is a game that rewards memory.&#10;&#10;Hoard is meant to be played in rounds, with scoring tokens obviating the need for pencil and paper scorekeeping.&#10;&#10;A limited run of Hoard was self-published by Tim Kings-Lynne and Beck Veitch in 2014. They entered into an agreement with Cheeky Parrot Games in order to improve the game play and get Hoard re-published and more widely distributed. Hoard was successfully funded on Kickstarter in mid-2016. The Kickstarted version with deluxe features released into the New Zealand and Australian markets in Q4 2016. A North American edition is now available in that market.&#10;&#10;",
        "artist": "Tim Kings-Lynne"
    },
    {
        "name": "Los Aprendices",
        "description": "You're now part of the School of High Alchemy, but you still have a long path ahead of you, a path that can lead to wisdom, yet a path which is laden with pitfalls and threats that will test you in ways that you can't even imagine. Work hard. Learn to control the elements. Study each recipe and combination, no matter how impossible they may seem. Face your worst fears. And trust fortune as well because it's wise to admit that not everything is in your hands. That's the only true way to become an alchemist.&#10;&#10;In each turn of Los Aprendices, players throw all their dice at the same time to get resources. With these resources, they place their tokens in one or more of the six boards on the table, and on these boards they can get abilities or knowledge (depending on the area the player wants to develop). The game is all about gaining resources, using the abilities to transform them into other resources (or multiply them), and rising in the different boards to gain as much knowledge as possible. When a player has more than 42 victory points, that triggers the last round, then whoever has the most points wins.&#10;&#10;Your knowledge and intelligence will be the key to your becoming the next alchemist!&#10;&#10;&#10;Ahora sois aprendices y os queda un largo camino por delante. Un camino de conocimiento que estar&aacute; lleno de trampas, de amenazas que no imagin&aacute;is todav&iacute;a y que os pondr&aacute; a prueba. Esforzaos. Aprended a dominar los elementos. Memorizad cada f&oacute;rmula, cada combinaci&oacute;n posible o imposible. Plantad cara a vuestros miedos. Confiad, tambi&eacute;n, en la suerte porque es prudente reconocer que no todo est&aacute; en nuestras manos. S&oacute;lo as&iacute; os convertir&eacute;is en alquimistas.&#10;&#10;El primer jugador que llegue o supere los 42 puntos de conocimiento cierra la &uacute;ltima ronda. El que tenga m&aacute;s puntos en la &uacute;ltima ronda gana.&#10;Al principio de cada turno, los jugadores tirar&aacute;n sus dados para obtener recursos seg&uacute;n sus resultados. Con estos recursos se colocar&aacute;n en los tableros que m&aacute;s les interesen. En cada una se obtendr&aacute;n m&aacute;s conocimiento o m&aacute;s habilidades (seg&uacute;n el campo que cada jugador quiera desarrollar).&#10;El mecanismo del juego consiste en obtener recursos, usar las habilidades para transformarlos en nuevos elementos (o bien multiplicarlos) e ir ascendiendo en los distintas tableros para obtener tanto conocimiento como puedan.&#10;&#10;Los Aprendices es un juego en el que tendr&eacute;is que usar vuestros conocimientos e inteligencia para convertiros en alquimistas.&#10;&#10;",
        "artist": "Carlos Cara"
    },
    {
        "name": "Shakespeare",
        "description": "The theaters of London are abuzz. In one week, her majesty the Queen will attend their new shows and will grant her support to one of the troupes. It's the chance of a lifetime for the young authors who are inflaming the populace with ever more audacious and motley plays. But how do you create a masterpiece in such a short time? Whoever has the answer to this thorny question will probably enter the rolls of history!&#10;&#10;In Shakespeare, players are theater managers who must recruit actors, craftsmen, jewelers and others in order to assemble everything needed for the play's performance at week's end.&#10;&#10;In more detail, the game lasts six days and on each day players recruit one new character &mdash; starting with five at the beginning of the game: four identical ones on their individual player board and one that they've drafted &mdash; and take 1-5 actions with the characters they have. Characters and their actions are:&#10;&#10;&#10;    Actors: Rehearse one or more acts in the three-act play; the more you rehearse, the more benefits you receive during the dress rehearsals on days four and six.&#10;    Costume mistress: Take costume elements to enhance your actors; if they lack a complete costume, they can't participate in the dress rehearsals.&#10;    Set dresser: Build the set. The more elaborate the set you build, the more rewards you receive &mdash; but the set must be symmetrical!&#10;    Handyman: Set them to work on whatever you need. These joes can assemble both costumes and sets, but they're not very good at it.&#10;    Assistant: Increase the power of your craftsmen, i.e., the three roles described above.&#10;    Jeweler: Take a gold costume element or set piece to dazzle the crowd.&#10;    Queen: Earn money by giving her an early peek, or gain an objective to win her favor on the final day.&#10;&#10;&#10;After players take actions, they check the individual ambience level in their theater, gaining or losing points or rehearsal time depending on the atmosphere. Dress rehearsal on the fourth and sixth days provide another chance for fully-dressed actors to perform, and those who are well-rehearsed earn points or money.&#10;&#10;On all but the final days, players must allow characters who performed to rest, with only one of those characters being able to work the next day. Thus, the more you put them to work today, the less you'll be able to do tomorrow &mdash; but those who don't plan to do as much act before other players, so that might be a good thing.&#10;&#10;In the end, players must pay their actors, with each unpaid actor blemishing your reputation and costing you points. Whoever finishes with the most prestige points wins.&#10;&#10;",
        "artist": "Arnaud Demaegd,Neriac"
    },
    {
        "name": "Exceed: Red Horizon – Reese & Heidi vs. Vincent & Nehtali",
        "description": "Exceed is an easy-to-learn 2 player head-to-head fighting card game. Matches take approximately 10-20 minutes, with decks that are small enough to fit in your pocket.&#10;&#10;Exceed is broken up into &quot;Seasons&quot; each Season contains 16 new fighters from various franchises, packaged into 4-character boxes.&#10;&#10;This set features 4 characters from the world of Red Horizon: Reese, Heidi, Vincent, and Nehtali, as well as all materials you need to play.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Carcassonne: Star Wars",
        "description": "Description from the publisher:&#10;&#10;Carcassonne: Star Wars combines the exciting adventures of the Star Wars universe with the gameplay of Carcassonne, with the known rules of the game being simplified through clever changes that bring an entirely new feel to the game.&#10;&#10;This is similar to Carcassonne but with Roads replaced with Trading Routes and claimed by Merchants instead of Robbers, Cities replaced with Asteroid Fields and claimed by Explorers instead of Knights and Cloisters replaced with Planets and claimed by Conquerers instead of Monks. There is no farming equivalent. Faction symbols (Empire, Rebel Alliance and Bounty Hunters) provide scoring bonuses regardless of what faction your Meeples belong to. Majority control is determined by dice rolling with the highest result rather than the sum determining the winner, although tiebreaks and defeats still provide some points. A player receives dice equal to the number of his Meeples involved in the majority control plus an additional one for using his large Meeple and one for any matching Faction symbols but this is always capped at three dice. One notable change is that Planets can be conquered by placing tiles adjacent to the Planet tile where the player now has the options of placing a Meeple on the adjacent Planet tile or on the tile he placed.&#10;&#10;There is also a four player team variant where it is the two Empire colours (black/Darth Vader and white/Storm Troopers) versus the two Rebel Alliance colours (red/Luke Skywalker and green/Yoda). Orange/Boba Fett is not used.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Tumult Royale",
        "description": "Description from the publisher:&#10;&#10;Tensions are high all across the lands. The royals erect statue after statue while their loyal subjects starve. But this time, the peasants have had enough. There are whispers of a revolution. Calls for an uprising ring out and the kingdom is thrown into a tumult. Down with the king! Take that, you greedy blue bloods!&#10;&#10;In Tumult Royale, you play the royals. Round after round, you collect taxes from your subjects in order to build statues of yourself across the country, thereby securing your rank. If you leave enough commodities for the people after taxation, all is well and you can continue to build monuments to your own vanity. But if you take too much, the greediest of you will be punished. Who will build the most statues and win the game? Remember: the greedy shall rule, but the greediest is a fool!&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Steam Time",
        "description": "Description from the publisher:&#10;&#10;It's the year 1899, and strange phenomena are being observed in places like Stonehenge and the pyramids of Egypt. Time goes crazy, and newly discovered crystals have exhibited strange properties that allow for the creation of fantastic apparatuses.&#10;&#10;In a race to exploit these discoveries, the rapidly industrializing nations have used them to construct gigantic steam-driven airships to travel through time and space. In Steam Time, the race is on for long-lost knowledge, vanished cultures, and hidden treasures. Travel to past ages, search for crystals, and use your crystals wisely to stay ahead of your competitors.&#10;&#10;",
        "artist": "Jacqui Davis"
    },
    {
        "name": "The Bloody Inn",
        "description": "France 1831: In a remote corner of Ard&egrave;che, the little village of Peyrebeille sees numerous travelers pass through. A family of greedy rural farmers is determined to make its fortune and has devised a diabolical stratagem to achieve this goal: Invest in an inn so they can rob traveling guests, allowing them to get rich without arousing the suspicions of the police! Whether or not their plan will work out, one thing is certain: Not every guest will leave this inn alive&hellip;.&#10;&#10;In The Bloody Inn, you are one of the competitive innkeepers, bent on amassing the most wealth. Unfortunately, your morals hinder you from robbing your guests&hellip; at least while they're alive. Fortunately, your scruples have no qualms with murder. Of course, you can't just have dead bodies piled everywhere: It's bad for business, and besides, what if the police drop by for a visit? It's all so much work! Perhaps you could employ some of the guests as accomplices? Everyone has a price, after all!&#10;&#10;",
        "artist": "Luis Francisco,Weberson Santiago"
    },
    {
        "name": "Voilà!",
        "description": "Agile acrobats, swift jugglers and brave fire-eaters - that's circus as you know it and finally you can be part of all of the fun! Voil&agrave;! is a fast-paced dexterity and push-your-luck type of game that will challenge your agility and finger swiftness.&#10;&#10;In Voil&agrave;! each player tries to get as many points as possible by completing various dexterity tasks. In a turn the player pulls out a token from the bag, which defines how many tasks the player has to complete (either none, one or two). However, for a turn player has limited amount of time, which is kept hidden from him by another player.&#10;&#10;After pulling out a token the player draws the corresponding amount of cards and tries to complete the tasks depicted of them. There are many different tasks, for example, throwing the token in the air and catching it, or creating a tower from acrobats and so on. After player has completed the task(s) he can either end the turn and thus get the points, or try to get more points by pulling out a new token and then completing the tasks. However, if the player chooses to continue, he must complete the task before he can end the turn and this is the risk - if the time runs out while he is still performing the task, the turn ends immediately and the player doesn't receive any points this turn (any cards the player completed during this turn are put in the discard pile).&#10;&#10;The game ends after each player has had three turns and the winner is the one with most total points on his cards.&#10;&#10;",
        "artist": "Reinis Pētersons"
    },
    {
        "name": "Sly Dice",
        "description": "Sly Dice is a dice game in which you want to get as many points as possible by scoring various dice combinations. However, you can also bluff about having those combinations and hope that others will not call on you. At the end the player with the most points wins the game.&#10;&#10;Each player has three dice, a shield and tokens for marking. There are several combination cards in the middle of the table as well as three common dice that will be used by all players. In each round the starting player rolls the middle dice and then all players also have up to three rolls for their own dice, which are rolled behind player's shield. However, if you want to make a roll after your first one, you have to set one die aside, visible to other players. However, if you roll three times your last roll must remain behind the shield - thus each player will have at least one die that is not visible to others.&#10;&#10;When everyone is done with rolling, all players claim, which of the visible combinations they have. The trick is - you can also lie and try to claim a combination, which you don't have. When a player has claimed a combination then all other players in clockwise order have a chance to either accuse him of lying or pass.&#10;&#10;1) If everyone passes then the player scores this combination and receives the points it provides. If he lied and didn't have this combination he can now reveal this fact to others - he still scores the combination as if he had it and he also receives one Successful Liar's card, which gives extra points.&#10;&#10;2) If anyone accuses the player of lying, then he has to reveal his dice, which creates two possibilities:&#10;&#10;If he was not lying then he scores the combination, but the player who accused him takes a False Accusation card, which gives minus points. However, if he was lying then he was accused correctly and doesn't get to score the combination, effectively losing his turn. The accuser doesn't get anything apart from the good feeling that he didn't let the lie slip through.&#10;&#10;Thus each player in a round claims one combination. At the end of the round you add a new combination card from the draw pile and begin a new round. After certain number of rounds you tally up the score and the winner is the player with most points.&#10;&#10;",
        "artist": "Reinis Pētersons"
    },
    {
        "name": "Game of Trains",
        "description": "In Game of Trains, each player is in charge for his line of trains. At the beginning of the game, the train cars in the player's train line &mdash; each with their own number &mdash; are sorted in descending order. The aim of the game is to be the first one to rearrange your train line so that the cards are in ascending order. Each card has a train car with a number and also a special power depicted on it.&#10;&#10;On a turn, the player can do one of two things: draw a card from the draw pile and replace one of the cards in his train line with the newly drawn card, or take a face-up card from the middle of the table and use it as a special power. Cards that are replaced from a player's train line are put in the middle to be used as special powers, and the cards that are used as special powers are discarded. Special powers include such actions as swapping two cards, moving a card, destroying everyone's cards, and so on. The players keep taking turns until one has their train line in ascending order and wins.&#10;&#10;",
        "artist": "Reinis Pētersons"
    },
    {
        "name": "Evil Genius: Deathray",
        "description": "Have you ever dreamed of being an Evil Genius?&#10;&#10;Perhaps you&rsquo;ve already begun your career by experimenting with lasers and uranium. Every Evil Genius needs a deathray to make global leaders bow to his or her every whim.&#10;&#10;The Vile Genius Labs team produces quality board games for your domination needs. Our first of many board games is Deathray 1.0, which enables you to design and craft a devious machine of global domination!&#10;&#10;Your nefarious imagination has no limits when it comes to the weapons and components you add to your deathray.&#10;&#10;From guidance systems and power sources to weapons and ammo, you and your flunky plug each piece into place, while competing against and sabatoging other Evil Geniuses to complete your death ray first.&#10;&#10;Let the darkness flow through you as you build your deathray to your exacting specifications and make your dream a reality.&#10;&#10;Dream! Build! Dominate!&#10;&#10;",
        "artist": "Manuel Aguilera (I),Manny Cartoon"
    },
    {
        "name": "Ascension: Year Two Collector's Edition",
        "description": "A follow-up to the Ascension: Year One Collector's Edition, Ascension: Year Two Collector's Edition includes foil editions of every card from Storm of Souls and Immortal Heroes, as well as the associated promo cards. Each Ascension Collector's Edition comes in a metal tin and includes a special playing board.&#10;&#10;",
        "artist": "Eric Sabee"
    },
    {
        "name": "3 Kings",
        "description": "3 Kings is a game of deceptions, trickery and power that will bring the players to wear the shoes of leaders of powerful factions, with the objective to impose their own will on the triumvirate waiting the nomination of the new king.&#10;&#10;Every player should play the game using intelligence and strength to impose his allies on the throne, without letting the other players understand the allies identities.&#10;Killings, sabotages, bluffs and much more is waiting for you in a 3 kings match!&#10;&#10;A match of 3 Kings is played in 4 turns. In each turn players should manage their hands to secretly plan their strategies.&#10;The played cards will allow the players to interact with each other's strategies, to make hand-building and to vote in the intrigue phase to directly eliminate all the enemy kings' pretenders to the throne.&#10;&#10;",
        "artist": "Simone Denti"
    },
    {
        "name": "Goths Save The Queen",
        "description": "In Goths Save The Queen, two two-player clans fight to save the Queen hidden in the middle of the table. Each clan is composed of one player giving orders (the King) and another one trying to understand which order has been given (the Warchief).&#10;&#10;To give an order, the King chooses a card and flips it onto the table to reveal two orders on its back, with no clue as to which is the right one. The Warchief checks the battlefield, then tries to choose the right order with a card in hand. When both clans have chosen their cards, all of them are revealed, and if both cards match on a clan, then the order is carried out. Some examples of orders: loading the catapult, firing with the catapult, progressing toward the Queen, looking at hidden cards in the middle to find the Queen, and avoiding traps...&#10;&#10;Of course, within a clan it is absolutely prohibited to make any sign or say anything to help the partner to guess which order is intended.&#10;&#10;When playing 1-vs-1 or 1-vs-2, the game is a bit different: The single player team cannot play the same order twice, one turn after another.&#10;&#10;With multiple copies of Goths Save The Queen, you can compete in a 3-vs-3, 3-vs-4 or 4-vs-4 format.&#10;&#10;",
        "artist": "Gyom"
    },
    {
        "name": "Automobiles",
        "description": "Drivers, start your engines! Will you cross the finish line first? Now is your chance to find out!&#10;&#10;Automobiles is a deck&#226;&#128;&#145;building game in which the fun is cubed &mdash; because instead of using cards to build a deck, you build with your collection of cubes. These cubes not only allow you to race your car around the track, but they also allow you to improve your handling, optimize your pit crew, and boost your speed, all of which are your keys to victory!&#10;&#10;The goal of the game is to cross the finish line first! You accomplish this by customizing your race car and surrounding yourself with the best crew. Your race car and crew are represented by a collection of cubes garnered from various options available to you. Starting with the same small set of cubes, each player builds their collection as they play the game. Use these cubes to enhance your performance, train your pit crew, and ensure your race car runs as effectively as possible. Be the first to cross the finish line and watch that checkered flag wave!&#10;&#10;Designed by David Short, Automobiles is the third title in AEG's Destination Fun series! Continue your travels in the acclaimed Trains and Planes board games.&#10;&#10;",
        "artist": "Kali Fitzgerald,Ikaan Studio,Marco Primo"
    },
    {
        "name": "Dreamwell",
        "description": "In a place outside the waking world where children go while they sleep. &#10;Wander the dreamkin&mdash;lost sleepers, whose souls this land seeks to keep. &#10;Underneath the gentle waves of lucid seas we fell. &#10;We&rsquo;re off to find our missing friends in the vast Dreamwell.&#10;&#10;Dreamwell is a 2-4 player competitive game featuring the art of Tara McPherson where players are trying to locate their lost friends in the Dreamwell. The Dreamwell is represented by a 4 x 4 grid of tiles. Each tile shows a environment and a creature, in addition to pathways to neighboring tiles. At the beginning of the game, players will be dealt two cards, each of which shows a picture of the friend whom he or she is trying to locate along with the two creatures and environment that will be required to find that particular friend.&#10;&#10;On your turn, you will be able to take three actions from the following list: move one of your pawns, rotate a tile, draw a card, replace the display, or locate one of your missing friends by playing a card. Only by carefully navigating the maze-like Dreamwell can you locate your friends and win the game.&#10;&#10;",
        "artist": "Tara McPherson,Scott Hartman"
    },
    {
        "name": "Teenage Mutant Ninja Turtles: Shadows of the Past",
        "description": "Teenage Mutant Ninja Turtles: Shadows of the Past is a scenario-driven campaign game that features story content from the IDW TMNT comic. One player takes on the role of the ultimate villain Shredder, while the others take the role of their favorite Turtle. The Turtle players battle their way through a series of 60-90 minute missions in which they develop their characters' strengths, fighting styles, and equipment along the way to create a lasting story arc. Fan-favorite characters like Casey Jones and Alopex appear throughout the missions as the Turtles call on their closest allies for help in battling their deadliest foes.&#10;&#10;",
        "artist": "Kevin Eastman,Tony Vargas"
    },
    {
        "name": "Mighty Monsters",
        "description": "A group of monsters is traversing the perils of the castle conquering guard after guard, collecting treasurers along the way, as kings set new rules. You and your fellow players are these monsters in Mighty Monsters (first announced as Heroes' Gold).&#10;&#10;The game is played in rounds equal to the number of players, except that in a three- or four-player game the number of rounds is doubled. Each round has three phases &mdash; Placement, Resolution, and Cleanup/Setup &mdash; and is controlled by a king who sets a special rule for the round.&#10;&#10;Players can choose from six races of monsters; each player receives a unique set of five monster cards in their chosen race with strength ranging from 1-5 and healing costs ranging from 0-2. To conquer the king and therefore conquer the castle and gain the treasure, players in turn order may place an available monster from their hand on any empty guard space in the castle.&#10;&#10;Once the placement phase is over, guard cards are revealed one at a time and resolved, working your way towards the king.&#10;&#10;",
        "artist": "Markus Erdt"
    },
    {
        "name": "Munchkin: The Nightmare Before Christmas",
        "description": "Description from the publisher:&#10;&#10;Fans of The Nightmare Before Christmas and Munchkin  have an entirely new ghoulish world to immerse themselves in.&#10;&#10;In Munchkin: The Nightmare Before Christmas, you can play as a citizen from Halloween Town, Christmas Town, Thanksgiving Town or Easter Town. Battle and banish foes like Oogie Boogie, Doctor Finkelstein, and Lock, Shock &amp; Barrel from Halloween Town. Charge into battle on Santa's Sleigh as you wield new weapons, curses and treasures.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Tiny Epic Western",
        "description": "HOOK: Poker meets worker-placement&#10;&#10;DESCRIPTION: The West is growing day by day, and you&rsquo;re looking to stake your claim. To win, you have to gamble your relationships with the most powerful bosses in town to win influence. This influence comes in many forms: Law, Money and Force. If you&rsquo;re clever enough, you&rsquo;ll be able to take claim over the buildings in the evergrowing boomtowns and gain powerful abilities. At the end of the day, the boss who has the best combination of wit and bluff will become the most powerful tycoon in the Wild Wild West.&#10;&#10;GAMEPLAY: The game is played in a series of rounds.  Each round, poker cards are dealt between the locations, which are laid out in a circle.  Players place posse members on these location cards, which will both give an action and count as a bid for the location's valuable resources.  Players also get a poker card of their own which uses the two adjacent cards from a location to form a three-card hand.  This creates a clever mix of modern worker placement and poker that drives the game. In addition, players must manage their resources of Law, Money and Force to buy buildings and gunfight. If you have the highest stake in the most lucrative industry at the end, you will be rewarded bonus points. Add these points to the points you've collected from buying buildings and determine the winner! Yippie kay yay a!&#10;&#10;",
        "artist": "Adam P. McIver"
    },
    {
        "name": "Kitty Paw",
        "description": "What happens when seven cats run into cardboard boxes? Well, a crazy game of kitty hide-and-seek!&#10;&#10;Kitty Paw is a dexterity and reaction game. Players try to be the first to complete the kitty combinations shown on the Kitty cards to score victory points (VP). The player with the most VP in the end wins.&#10;&#10;Each player gets one Kitty card in each round and tries to be the first to create the patterns shown on the cards. Since this is a recognize-and-react game, all players act simultaneously. In more detail:&#10;&#10;&#10;    All players put one hand in the center of the table and shout out &quot;Kitty Paw!&quot; to start the game.&#10;    Each player grabs one Kitty card from the row and places it in front of themselves. Then players grab Kitty tiles from the center of the table and arrange them to match the patterns shown on their own Kitty card. &#10;    Using only one hand, the &quot;Kitty Paw&quot; they placed in the center of the table at the start of the game, players grab only one Kitty tile at a time instead of grabbing a bunch of tiles. &#10;    If any player thinks that she has completed the pattern on her Kitty card, she shouts out &quot;Meow!&quot; and performs the &quot;Lucky Cat&quot; gesture.&#10;&#10;&#10;",
        "artist": "Aza Chen"
    },
    {
        "name": "Ponzi Scheme",
        "description": "Based on the textbook example of financial scams, &quot;Ponzi Scheme&quot; is the term used to describe the technique Charles Ponzi employed in 1919 to operate one of the most notorious financial fraud in history.&#10;&#10;In the game Ponzi Scheme, players are scammers trying to trick investors into funding fraudulent investments with the promise of extremely high returns. You need elaborate trading skills to keep your operation afloat as long as possible, and as time goes on the dividends you need to pay every turn will only pile higher and higher! But when someone declares bankruptcy, the remaining fraudster who forged the biggest shell corporation wins the game!&#10;&#10;The goal of the game is simple: Don't be the first player to go bankrupt!&#10;&#10;In more detail, on each turn, players must take one new Fund card from the Funding boards along with a corresponding Industry tile and cash as indicated on the card. You need to pay the &quot;promised reward&quot; of each Fund card in a number of rounds.&#10;&#10;After all players have taken their Fund cards, they may choose to initiate an &quot;inside trade&quot; with one other player in order to buy the Industry you want with a price they can't refuse, or sell your own Industry to them with a good price.&#10;&#10;At the end of the round, players rotate their Time Wheel 1 or 2 spaces, and pay the &quot;promised reward&quot; to the bank if any Fund card is due.&#10;&#10;The game continues until at least one player cannot pay the &quot;promised reward&quot; due and goes bankrupt. That player is out of the game, and the remaining player who has the most VP on their Industry wins.&#10;&#10;",
        "artist": "Chih-Fan Chen"
    },
    {
        "name": "Joraku",
        "description": "Joraku, an ancient Japanese word commonly &#3;used before the Edo period, which means &#3;&ldquo;Going to Kyoto&rdquo;.&#10;&#10;Specifically, during the Sengoku period, Joraku refers to the act of local warlords&ndash;the Daimyo marching their armies toward Kyoto, to &quot;protect the Shogun and Emperor from other rogue lords&quot; and ultimately rule in their place.&#10;&#10;Onward to Kyoto! Take command of your army, and defeat every Daimyo blocking the way! March on! To victory! March on! Kachidoki!&#10;&#10;Joraku is a trick-taking area control game. Outwit your opponents with tactical card play, use your loyal Samurais to bid control of areas and build prestige. Only the Daimyo with the highest reputation and the biggest stick can rule Japan!&#10;&#10;&#10;Round Overview&#10;&#10;&#10;    Recruit Phase&#10;        Draw new hand of 5(6) skirmish cards in a 4(3) player game. &#10;        Pass 2 cards to the left simultaneously.&#10;    &#10;    Skirmish Phase&#10;         Each player plays 1 card and resolves it. &#10;         Check who wins this skirmish.&#10;         Pass the Kachidoki card to winner. All players rank influence where the winner's Daimyo token is to gain RP.&#10;    &#10;&#10;&#10;&#10;        Repeat 1~3 until all cards in hand are played.&#10;&#10;&#10;&#10;    Prestige Phase:&#10;&#10;&#10;&#10;        Rank influence of players in each area, earn Reputation Points based on the score charts on the map.&#10;&#10;&#10;The game lasts for 3 rounds, and the player with the highest RP wins.&#10;The points given in each area will be different for every round. &#10;Your Samurai cubes will stay on the map between rounds, so plan for the future when you place them.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Portal of Morth",
        "description": "Portal of Morth is a competitive board game inspired by tower defense video games. During the game, the players have a team of heroes with which they will fight against an ever increasing amount of powerful enemies. As a general rule, the game has a duration of five rounds, with one wave per player each round. Each wave is divided in four phases:&#10;&#10;1. Lord Morth's phase: The starting player rolls the enemy dice into the portal board to determine in which path the enemies enter the boards. To do this, the player rolls as many enemy dice as indicated on the turn track, and a 12-sided die to determine the exact position of the portal. Also, the players receive cards to trump their opponent's strategies.&#10;&#10;2. Portal phase: The players may pay gold to turn the portal, modifying the initial enemy distribution. In turn order, each player may pay as much gold as they want to move the portal in any direction. Once all players have moved the portal or have passed their turn, they take the enemy dice that ended the phase in their zones of the portal board, placing them in the corresponding paths.&#10;&#10;3. Heroes' phase: Players move and attack with their team of characters, trying to eliminate all threats from their boards.&#10;&#10;4. Assault phase: Enemies advance, trying to exit the player's boards. The starting player rolls a three-sided die, and each player has to add the resulting number to the initial movement value of each enemy. If an enemy escapes a player's board, the player takes damage.&#10;&#10;Once all rounds are finished, the game ends and the player who has the fewest damage points wins!&#10;&#10;",
        "artist": "Adrián Sanchez,Nicolas Serrano"
    },
    {
        "name": "Alan's Adventureland",
        "description": "Description from the publisher:&#10;&#10;In Alan's Adventureland, players are a part of the design team for a new amusement park. There are four themed neighborhoods within the facility, and each player is responsible for constructing the attractions in one of those neighborhoods: Animal Kingdom, Tour America, Sky World, and Foreign Lands. Each turn represents the passage of one week.&#10;&#10;During the game, players draw cards representing purchase orders (POs) for different types of attractions. These cards have two uses: first, as POs approved by the finance office to expedite construction of specific types of attractions each turn, and second, as the actual financing to construct the attraction represented on the card. At the end of each month, the review board meets, evaluates the progress of each neighborhood, and awards bonuses for meeting a set of predetermined preferences. These preferences relate to how attractions in a park are arranged. Points are awarded to the players who meet the review board's preferences.&#10;&#10;At the end of the game, the owners of the facility come in and award points to the finished themed neighborhoods. These points are awarded based on four criteria:&#10;&#10;&#10;    Excitement Level &mdash; size of the rides&#10;    Parking Lot View &mdash; curb appeal to visitors upon arrival&#10;    Main Entrance View &mdash; attractiveness to patrons waiting in line for their tickets&#10;    Themed Attractions &mdash; number of matched types of attractions in a neighborhood&#10;&#10;&#10;The player who earns the most points wins the design contract for the owners' next project.&#10;&#10;",
        "artist": "Alayna Lemmer"
    },
    {
        "name": "Chronicler",
        "description": "Chronicler is a civilization game that lets you step back in time of history. But unlike other civilization-building games, your ability to develop new Technologies is also influenced by the advances of the other civilizations around you. Your goal is to have the most advanced civilization at the end of the game.&#10;The game is played over 3 eras.&#10;Chronicler can be played in two modes: Age of Peace or Age of Conflict.&#10;&#10;",
        "artist": "Kim sung hun"
    },
    {
        "name": "Flock",
        "description": "Lead the most impressive flock through feeding, nest building, and hatching. Selecting the actions is simple, but when one bird flies, so do all the others! Can you time your actions to take advantage of when the flocks fly?&#10;&#10;During the game Flock, players try to expand their flock with the goal of scoring the most victory points after three rounds of play. Victory points are scored by controlling the action cards at the end of each round. Also, be sure to have enough tasty worms to feed your birds at the end of each round, or otherwise they will fly away. Will your flock be on top of the pecking order?&#10;&#10;In more detail, players start with three of their eleven birds in front of them. Six nest, egg and worm tokens are placed on the side for each player. On a turn, a player can either place a bird on one of the six action cards or activate an action card on which they have at least one bird. When you activate an action card, you can remove birds from the card &mdash; possibly paying worms, nests and eggs as well &mdash; to take the action shown, such as removing two birds from &quot;Feeding&quot; to get three worms. Spent birds are returned to your personal pool of resources, while other spent resources are placed on the side. Each player in turn order does the same with this action, then whether they used their birds or not, all birds are removed from this action card, flying away to the players' personal pools.&#10;&#10;When the &quot;Dominance&quot; card is activated, the dominant player adjusts their pecking order on the initiative track, then everyone else flies their birds from that card to the other action cards. When &quot;Competition&quot; is activated, which is possible only when enough birds have landed on it, each player spends a nest and worm for each of their birds (removing them if this isn't possible), then flies their birds to other action cards. Players then score points for having the most or secondmost birds on a card and for the birds left in their pool.&#10;&#10;After three rounds, the player with the most points wins!&#10;&#10;",
        "artist": "Valentina Moscon"
    },
    {
        "name": "Lutèce",
        "description": "The goal of Lut&egrave;ce is to have the majority of the 4 resources of the game: beer, bread, swords and wine.&#10;&#10;The player with the majority of a resource receives 10 points at the end of the round, second place receives 4 points and the last place receives no points. Therefore, balance between collecting resources should be kept in mind.&#10;&#10;You buy character and building cards from a central market to complete your resource set collections. Certain character and building cards cost 0 and give you 1 resource. For example: 1 beer. Other cards cost more: 1, 2 or 3 coins can give 2 beers or a victory point from the bread category by the end of the round.&#10;&#10;Other cards produce coins the moment they're bought, in connection the cards that you already possess.&#10;&#10;In Lut&egrave;ce, every player starts with a hand of cards that lets you pick a character and a building in the range of cards available. You collect 5 character and 5 building cards, visible to everyone at the time of selection.&#10;&#10;In order to choose the character or building card that you wish to have, place 2 cards facedown that correspond (number or letter) to the desired card in the market.&#10;&#10;Before revealing your choices, you can increase the value of your facedown cards by placing coins on your concealed cards. If 2 players want the same card, it is simply discarded and no one gets it!&#10;&#10;Increasing the value of the card allows you increase your chance of ensuring your bid, but will draw the attention of other players. If two players' increased values tie, no one gets the card, as it is discarded. Therefore, you have to watch other players and block them and place a daunting bit on your cards!&#10;&#10;If you don't have enough money, you also have two cards in your hand that bring you 3 coins each by playing them. At the end of the game, each set of 3 coins = 1 victory point.&#10;&#10;At the end of the round, when everyone has drafted one or two cards, the market is replenished with new character and building cards. The cards that weren't selected during the round have a coin added to them (much like passing over a race in Smallworld), making them more attractive to bid upon, as you receive the corresponding coin as well, if you pick up that card. This continues, leaving a mountain of coins on unselected cards after several rounds!&#10;&#10;If you didn't win a card on your turn, you get two coins to keep you from crying!&#10;&#10;Note: The publisher compares this game to 7 Wonders.&#10;&#10;",
        "artist": "Biboun"
    },
    {
        "name": "Le Bois des Couadsous",
        "description": "In Le Bois des Couadsous, you have a forest to cross to find lots of hazelnuts, and the first player to find five nuts wins the game.&#10;&#10;On the table, you have a grid of 3x3 forest cards. The backs of each card are identical, and on the front they feature one of three images &mdash; mushroom, leaf or stone &mdash; in one of three colors: yellow, red or blue. In the twelve spaces adjacent to this grid are placed cards showing 1-3 hazelnuts.&#10;&#10;A player starts: he puts his squirrel card before a row/column of his choice and cross it by announcing out loud what he thinks on the back of the forest card. It begins with the first card, the player announces for example &quot;leaf&quot; or &quot;yellow&quot; (according if the elements or colors are in play) then turns the card over and compares the guess to the actual picture. Initially, we discover, that the cards are random. If the guess it correct, the player continues the path to the hazelnuts that await us on the other side. If it is wrong, it stops there, and the next player start.&#10;&#10;If the next player starts on the same row/column, he already knows what there is on the front of this card, unless he remembers more since it was the visible item at the beginning...!&#10;&#10;Players play with colors or the elements: initially it is them who choose. But as soon as a player has reaches a nut, everyone changes: those who played on the elements switches to colors and vice versa. One must therefore be remember everything and well remember what others reveal!&#10;&#10;",
        "artist": "Katarzyna Babis,Jonathan Munoz"
    },
    {
        "name": "La Glace et le Ciel",
        "description": "La Glace et le Ciel is a cooperative game for 2 to 4 players, lasting for about 20 minutes. Players will really depend on each other (no one can lead the party) and that there will be tension crescendo during the part... Just be aware that it will be a question of balance between the elements of water (hydrosphere), the Earth (lithosphere) and Air (atmosphere), as well as the Biosphere at the intersection of all three.&#10;&#10;Mix independently each of the 3 decks of 12 playing cards (1st, 2nd and 3rd generation) and place them on the table, face down. There are 4 cards sea, 4 land and 4 Air for each generation.Found on the 4 cards of each of these elements a value of Biosphere equal to 0, 1, 2 or 3.&#10;&#10;Have the 6 benchmarks and 3 starting game cards in the middle of the table.&#10;&#10;Mix the 6 objectives cards and 6 Biosphere objectives cards, into 2 piles, facedown on the table. Place over your Earth 4 cards ice decreasing values into a pile (the top 3 and 0 at the bottom). Place the 4 sky cards next to them.&#10;Evenly distribute to all players 12 cards of the 1st generation.&#10;&#10;Each player then takes an objective card and a Biosphere card&#10;&#10;Players will play each their turn in a clockwise direction. On their turn, the player must put one of his cards where  they want, provided that the level of the element (Air at the top, Earth in the middle and Water at the bottom). As long as there are still empty spaces on the line of an element, they must be filled, as the next card will be laid over the cards already in place.&#10;&#10;A player can never move a card that has already been placed, however they may cover it with another card.&#10;As soon as the placing of a card completes the goal of one or more players, or on the contrary destroys their goal, it is revealed. These are the only clues that are given!&#10;&#10;When the 12 cards of the first generation are played, players reveal their Objective cards and points are scored. We look if there is=f there is a Co2 card in the ice returning as many ice cards as there are CO2 cards visible. Then we look at the sky level: you add up the number of unbalanced objective cards and subtracting the number of those out of balance to obtain the score. The 2nd sky card with the same value to observe the evolution of the CO2 in the sky.&#10;&#10;The philosophy of the game was very largely inspired by the book by Claude Lorius: Voyage dans l'Anthropoc&egrave;ne.&#10;&#10;",
        "artist": "David Boniffacy"
    },
    {
        "name": "One Night Ultimate Vampire",
        "description": "No moderator, no elimination, no werewolves.&#10;&#10;In One Night Ultimate Vampire, the sun has just set, and vampires have descended on your sleepy little town, slowly turning the villagers into even more vampires. Fortunately, the village has several residents with special powers, with most willing to help eliminate this fanged menace!&#10;&#10;One Night Ultimate Vampire is a fast game for 3-10 players in which everyone gets a role: The nefarious Vampire, the well-meaning Cupid, the sneaky Assassin, or others, each with a special ability. In the course of a single evening, your village will decide who among them is a vampire...because all it takes is finding one vampire to win!&#10;&#10;One Night Ultimate Vampire can be combined with One Night Ultimate Werewolf or One Night Ultimate Werewolf Daybreak or both games.&#10;&#10;",
        "artist": "Gus Batts"
    },
    {
        "name": "Potion Explosion",
        "description": "Dear students, it's time for the final exams of the Potions class! The rules are always the same: Take an ingredient marble from the dispenser and watch the others fall. If you connect marbles of the same color, they explode and you can take them, too! Complete your potions using the marbles you collect, and drink them to unleash their magical power. Remember, though, that to win the Student of the Year award, being quick won't be enough: you'll also need to brew the most valuable potions in Potion Explosion!&#10;&#10;",
        "artist": "Giulia Ghigini"
    },
    {
        "name": "Crimson Creek",
        "description": "Crimson Creek is an homage to slasher films of the 1980s. You and a few friends head up to the Lake to celebrate your recent graduation.&#10;&#10;Ignoring the advice and cautions from locals, you embark on a hard-partying amorous filled lost weekend. Little do you know that it was at this exact spot, thirty years ago to the day, that infamous killer Klein aka The Hatchet Man was executed.&#10;&#10;But as soon as night falls you learn the terrifying truth. KLEIN IS BACK. And he has bewitched one of the residents of Crimson Creek to seek his vengeance. You must Run, Peek, and Hide to survive until morning. But even then you won&rsquo;t be safe. You will never be safe again, until you learn the true identity of the killer possessed by The Hatchet Man.&#10;&#10;Players take turns moving their character tokens around various Crimson Creek locations trying to avoid Klein and deduce his lair and identity. Klein's lair is deduced by secretly looking at locations Klein has yet to attack. His identity is deduced by matching discovered clues with Suspects in a police lineup.&#10;&#10;If a player is on a location Klein is attacking without having a hiding place they are slashed and killed by Klein and eliminated from the game.&#10;&#10;Work together and survive 3 Acts(rounds), identify the killer, and win the game.&#10;&#10;",
        "artist": "Marco Chiu"
    },
    {
        "name": "Magecraft",
        "description": "Offland is a world where hundreds of races live together. It's not easy to keep peace between hundreds of races, so every ten years, each race sends its best mage to the ruins to participate in Magecraft. Only the winner of this competition receives the magic gems as a prize, with this mage's race dominating the land for the next decade. Now the competition starts again; who shall rise and who shall fall?&#10;&#10;Magecraft is a bag-building game that's suitable for 2~4 players. As a player in Magecraft, you learn spells, build a mana pool, and collect mana gems. Whoever collects twenty mana gems in their score area first wins! An additional copy of the game is required to play with 3 and 4 players.&#10;&#10;",
        "artist": "Anakin Man"
    },
    {
        "name": "Pocket Invaders",
        "description": "Since eons ago, two ancient civilizations are fighting a never-ending battle. Both worlds use all their fleets and intelligence in a dispute that will define the future of their planets.&#10;&#10;Pocket Invaders recreates a retro atmosphere in a strategic game, with a universe in which the maneuverability of your ships is as crucial as luck when introducing new units in your fleet.&#10;&#10;&bull;&bull;&bull;&#10;&#10;Desde hace eones, dos antiguas civilizaciones se enfrentan a una eterna batalla.  Ambos mundos usar&aacute;n toda su flota y su inteligencia en una batalla que definir&aacute; el futuro de sus planetas.&#10;&#10;Pocket Invaders recrea una atm&oacute;sfera retro dentro de la estrategia.  Un universo donde hay que tener en cuenta el movimiento de tus naves y el azar al introducir nuevas invasoras a tu ej&eacute;rcito.&#10;&#10;&bull;&bull;&bull;&#10;&#10;Seit Ewigkeiten k&auml;mpfen zwei uralte Zivilisationen einen nie enden wollenden Krieg. Beide Welten verwenden sowohl ihre Kriegsflotte als auch ihre Intelligenz in einem Streit, der die Zukunft ihrer Welten bestimmen wird.&#10;&#10;Pocket invaders stellt eine retro-Atmosph&auml;re in einem strategischen Spiel dar; ein Universum, in dem die Wendigkeit deiner Schiffe so wichtig ist, wie dein Gl&uuml;ck, wenn du neue Einheiten in deiner Flotte einbringst.&#10;&#10;",
        "artist": "Jose D. Flores"
    },
    {
        "name": "Wrath of Dragons",
        "description": "Description from the publisher:&#10;&#10;In Wrath of Dragons, each player assumes the role of a dragon that, over the course of many centuries, flies into different regions of the Old World to lay waste to settlements, scorch fields, snatch livestock, take gold, and capture nobles.&#10;&#10;After six centuries have passed, the devastation, destruction, and fear that the dragons have caused is scored, and the dragon that earns the most victory points wins!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Brick Party",
        "description": "Are you better at building with plastic bricks...or explaining how to do it? What if you have to build with your eyes closed or using only one hand? Or if you must explain it without speaking? Can you still be faster than your opponents?&#10;&#10;Brick Party is a funny and frenzied game of crazy building! Reveal the special rule for the round, choose your teammate, and get ready. Then grab the blocks and build the shape you choose faster than the others! And in the next round? A new special rule, new partners, and new shapes...for a game that's never boring!&#10;&#10;Brick Party contains 36 plastic construction bricks and 165 cards with shapes that must be built by the players.&#10;&#10;",
        "artist": "Erika Signini,Paolo Vallerga"
    },
    {
        "name": "Council of Blackthorn",
        "description": "Story&#10;&#10;The King of Blackthorn rose to power on the strength of his sword, gaining the devotion of the people as he forged a nation and purged the ravages of war. Once a much needed beacon of strength for a foundling kingdom, he has now grown old and is no longer a vital part of a now robust and powerful country. Others have risen to prominence and power within his council. Adept in their machinations and plots, the councilors have their own self serving ambitions. In a shadowy battle of subterfuge they ruthlessly vie against one another for true control of Blackthorn. In this dance of treachery, each must seize as much power as able without drawing suspicion for whispers of treason echo through the halls of the King of Blackthorn. Whispers from fellow councilors designed to implicate and see the competition shortened by a head. The King will call for the axe for any he deems a traitor and there is always the risk that he is not as ignorant of the schemes as he seems.&#10;&#10;As a member of the Council of Blackthorn, you must build influence with the kingdom&rsquo;s factions to expand your political influence. Rumors, bribes, spies and poison are the tools of your trade. Council of Blackthorn is about secretly gaining power while convincing your rival council members that you are not a threat. Deflect all eyes onto your most powerful enemy and take the keys to the kingdom as well as a great seat at his or her execution. Attract too much attention to yourself and the King&rsquo;s axe will find you!&#10;&#10;Gain influence, accuse your rivals, keep your head!&#10;&#10;Game Overview and Objective&#10;&#10;Council of Blackthorn is a board game for 2 to 6 players. Each player assumes the role of a member of the Council of Blackthorn. There are several different council member characters to play. Each player must build influence with the kingdom&rsquo;s political factions by playing ally and building cards. Custom dice change the game conditions for each round. As players gain influence and power, they also gain hidden treason points. The players that appear to have the most power will typically gain more treason points. The player with the most treason points at the end of the game is beheaded for treason and is removed from the game. The remaining player with the most total influence points, wins the game.&#10;&#10;",
        "artist": "Stephanie M. Brown,Chris Casciano,Rhys Griffiths,Tomas Honz,Andrew Ryan,Matthew Sellers,Joe Slucher,Alex Stone,Peter Wocken"
    },
    {
        "name": "Munchkin Oz",
        "description": "Description from the publisher:&#10;&#10;Adventure with the Scarecrow and the Tin Woodsman! Brave the Poppy Fields or the Deadly Desert! Fight against a Wicked Witch or King Krewl! Visit the Emerald City and talk with Dorothy, Ozma, or the Cowardly Lion! Play a Professor, Royalty, Soldier ... or even a Wizard!&#10;&#10;L. Frank Baum's Oz books have been favorites of children and their parents ever since the books were published over a century ago. Now you can create your own adventure with Munchkin Oz!&#10;&#10;",
        "artist": "Katie Cook,John Kovalic"
    },
    {
        "name": "Mistfall: Kickstarter Edition",
        "description": "This entry is for the Kickstarter edition with additional content in the box. Limited content consists of 55 cards and a Kickstarter Limited Guide.&#10;&#10;Kickstarter Limited cards are: 18 regular enemy cards (6 blue, 6 green and 6 red), 2 special enemy cards, 18 encounter and 2 special encounter cards, 13 time cards, and 2 quest info cards.&#10;&#10;Kickstarter Limited Guide includes two additional quests (V: Crusade of the Fallen, and VI: Old Grievances) and a chapter: &quot;the Story of Mistfall continues&quot; which gives flavour to the quests included.&#10;&#10;Limited cards have a text at the bottom saying: enemy pack/quest pack/tough times/encounter pack LIMITED. They are numbered 386 - 440.&#10;&#10;&#10;Mistfall is a fully co-operative adventure game set in a fantasy world of mystery, eldritch powers and high adventure.&#10;&#10;At the start of the game each player chooses a hero with a fixed deck of equipment and power cards, before embarking on a dangerous journey through a set of monster-ridden locations. Each hero also comes with a pool of advanced abilities that can be added to their basic deck during the game to customize and expand their powers. A variable board setup, randomized encounters and enemies, a simple but robust monster AI &ndash; all that makes for a game that is a varied and challenging experience both solitaire as well as with a group of up to three friends.&#10;&#10;Gather up your resolve, check your gear and get ready to brave the unrelenting Mists. A world of perilous adventures awaits!&#10;&#10;",
        "artist": "Enggar Adirasa,Agnieszka Kopera"
    },
    {
        "name": "Bastion",
        "description": "The castle is besieged! Hordes of monsters gather near the ancient walls and are about to smash open the castle gates. Mountain giants trample the fields, fire riders burn the surrounding settlements, and the ice dragon has nested on top of the citadel tower, horrifying the minds of the inhabitants of the bastion. Only a squad of stubborn heroes stands between the enemies and their ultimate victory.&#10;&#10;Bastion is a cooperative castle defense game set in the Berserk universe, with 1 to 4 players taking on the roles of magical castle defenders. The castle is located in the center of the game board and is menaced by a great variety of invading enemies: dangerous beasts, ferocious warriors, terrible monsters, giants, mages, and even mighty dragons.&#10;&#10;You will travel the bastion districts, draw energy from sources of magic, build obelisks, bombard the enemies by magical devices and learn new spells. You will be gathering specific mana that is required to defeat each of the invaders. Victories allow castle defenders to gain new abilities, build powerful artifacts, and perform magic rituals.&#10;&#10;To defeat a monster you usually must travel to its location and spend a specific amount of mana of a required color. Each defeated monster provides you with a new spell. The tougher the defeated enemy, the better spell you will get. Castle defenders should try to be as efficient as possible. If you take too many actions to defeat your threats, the bastion will fall.&#10;&#10;Bastion is a cooperative adventure: you either defend the city by concerted efforts or it will fall under the pressure of the attacking hordes. Bastion is a highly customizable and replayable game. There are several scenarios and difficulty settings in the rules, along with the solo mode.&#10;&#10;",
        "artist": "Sergey Dulin"
    },
    {
        "name": "Amphipolis",
        "description": "One of Greece's greatest excavations in the last years, the archaeological site of Amphipolis is threatened by landslides. As a result, several teams of archaeologists work feverishly to secure as many of the valuable findings as they can.&#10;&#10;In Amphipolis, an adventurous game for the whole family, you take the role of the captain of an archaeological team, trying to save as many findings as possible and become the best archaeological team of all time!&#10;&#10;Each round, different artifacts are found and placed on their sorting areas. The players during their turns take tiles from those areas trying to combine them in the best possible way in order to score the most points before landslides shut down the entrance to the monument.&#10;&#10;",
        "artist": "Tony Tzanoukakis"
    },
    {
        "name": "OMG",
        "description": "For thousands of years, Zeus has been the ruler of Olympus. After countless attempts from the other gods to overthrow him, he announces a final fighting contest among the twelve gods, allowing them to use their special powers to the fullest. Only one god will rule Olympus. Who will prevail?&#10;&#10;In OMG, players play cards from their hands trying to match the color, the number, or the god of the previous card while also making use of the gods' special powers. The first player to empty his hand wins.&#10;&#10;",
        "artist": "Tony Tzanoukakis"
    },
    {
        "name": "Burano",
        "description": "Burano, also known as the lace island, is an island in the northern Venetian lagoon. Burano is extremely famous for its brightly colored houses, those square-shaped houses of a riot of colors along the water channels make it like a fairy tale land.&#10;&#10;Fishing has been the main activity in Burano since its foundation. A story goes that while fishermen went a long-term fishing outside the lagoon, their wife who stayed and missed their husband took out needles and made lace like they mended their husband's fishing nets.&#10;&#10;In the Middle Ages, Burano lace was highly admired and widely requested by royal families all over Europe. Players represent a family leader on this little island. They can send men to fish for the main source of income, or send women to lacemaking to sale abroad. Making a good living and making Burano become world famous, you have to figure out how to organize family members to their suitable work. It depends on you to earn the glory for your family and lead them to be outstanding from other families.&#10;&#10;Burano is played over four seasons, 14 rounds altogether. Through the novel &quot;cube pyramid-driven&quot; mechanism, players take turns paying coins to operate their cube pyramid during each round. The operation of the color-coded cubes would trigger certain actions, such as fishing, lace making, and house roofing, which will earn players victory points (VP). At the end of the game, whoever has earned the most VP wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Falling Coin",
        "description": "Falling Coin is an engaging and challenging microgame with only 13 cards. Player need to provide one coin to play this game, and the goal is to NOT let the coin fall off the cards.&#10;&#10;Randomly choose a starting player, who places the coin on the center of the starting card and holds the card with two fingers (thumb and index). Going clockwise, the next player draws a card from the deck and uses the card to &quot;take over&quot; the card stack from the previous player. (In essence, you use this new card to carry the existing bunch of cards as well as the coin!)&#10;&#10;Sounds easy? The challenging part is that you must use the matching color of your card to touch the card stack, and the parachute icon in the center of your card must still be visible! Play continues until someone cannot keep the cards balanced, thereby dropping the coin off the cards. That player loses the game of Falling Coin.&#10;&#10;The game can be played in a number of rounds, and the player who loses the fewest times is declared the winner!&#10;&#10;",
        "artist": "Chih-Fan Chen"
    },
    {
        "name": "Fury of Dracula (third edition)",
        "description": "This edition features all-new art and graphic design crafted to complement the game's intuitive, thematic mechanics. Rounds are now broken into day and night: hunters take actions during both, but Dracula can only act at night. Combat is now more streamlined and decisive, and new rumor tokens allow Dracula to mislead hunters and extend the terrible reach of his influence. Count Dracula triumphs if he advances his influence track to thirteen; if the hunters can defeat him before then, they save the continent of Europe and win the game.&#10;&#10;",
        "artist": "Chris Beck,Samuel Shimota"
    },
    {
        "name": "Terra Mystica: Big Box",
        "description": "Terra Mystica: Big Box, a Korean crowdfunding compilation, contains Terra Mystica, the Fire &amp; Ice expansion, and the four town tiles and shipping marker bonuses as well as special terrain tiles for Fire &amp; Ice.&#10;&#10;",
        "artist": "Dennis Lohausen"
    },
    {
        "name": "KUMO Hogosha",
        "description": "A long time ago, the gods decided to pass Earth down to Mankind and retreated to live in the Heavens. They erected the Cloud Temple, a symbolic border between the two worlds and home to the Stone of Balance.&#10;As the sun shone from the Heavens and the Earth blossomed, the gods decided to open the gates of the Temple to only the most skilled people, allowing them to compete to become Kumo Hogosha, Guardians of the Clouds.&#10;Throughout the centuries, valiant warriors &ndash; the Kumotori &ndash; fought against each other in the Rotating Arena of the Four Winds where the renowned Stone of Balance resides. &#10;Each year, a prestigious tournament is held in which a single winner is elevated to the rank of Kumo Hogosha, a demigod amongst men. &#10;The challengers for this title compete in a duel that combines strength and strategy to demonstrate their skill in a myriad of fighting techniques.&#10;&#10;Today it is your turn to continue writing the legend and face these legendary warriors. Climb into the Arena, master its ever-changing environment, and bring the Stone of Balance into your opponent&rsquo;s camp to become a Kumo Hogosha!&#10;&#10;To become a Kumo Hogosha, you have to move the Stone of Balance outside the Rotating Arena, into your opponent's camp. The player who first succeeds wins. Possible actions that players can take are:&#10;&#10;&#10;     Grabbing: The active Kumotori can grab and move another Kumotori (opponent or ally) one tile vertically or horizontally.&#10;     Throwing: The active Kumotori can throw another Kumotori (opponent or ally) one tile vertically or horizontally.&#10;     Running: The active Kumotori can move from his original position to neighboring tiles either vertically or horizontally.&#10;     Jumping: The active Kumotori can jump over one or more neighboring Kumotori (not diagonally) and/or the Stone of Balance to arrive at the next free tile.&#10;     Blocking: The active Kumotori can sit on top of a neighboring (not diagonally placed) opponent to block him. You cannot block a Kumotori who is on any of the eight tiles surrounding the Stone of Balance. In the next round, the active blocking player will perform an action to unblock the opponent Kumotori, and move to a neighboring tile (not diagonally).&#10;     Kumo: Kumo is the only action that moves the Stone of Balance. With this action you can move only 1 tile. To move the Stone of Balance you must have two Kumotori with the Kumo drawing face up next to each other, and next to the Stone of Balance.&#10;&#10;&#10;",
        "artist": "Frédéric Genêt"
    },
    {
        "name": "Mysterium",
        "description": "In the 1920s, Mr. MacDowell, a gifted astrologist, immediately detected a supernatural being upon entering his new house in Scotland. He gathered eminent mediums of his time for an extraordinary s&eacute;ance, and they have seven hours to contact the ghost and investigate any clues that it can provide to unlock an old mystery.&#10;&#10;Unable to talk, the amnesic ghost communicates with the mediums through visions, which are represented in the game by illustrated cards. The mediums must decipher the images to help the ghost remember how he was murdered: Who did the crime? Where did it take place? Which weapon caused the death? The more the mediums cooperate and guess well, the easier it is to catch the right culprit.&#10;&#10;In Mysterium, a reworking of the game system present in Tajemnicze Domostwo, one player takes the role of ghost while everyone else represents a medium. To solve the crime, the ghost must first recall (with the aid of the mediums) all of the suspects present on the night of the murder. A number of suspect, location and murder weapon cards are placed on the table, and the ghost randomly assigns one of each of these in secret to a medium.&#10;&#10;Each hour (i.e., game turn), the ghost hands one or more vision cards face up to each medium, refilling their hand to seven each time they share vision cards. These vision cards present dreamlike images to the mediums, with each medium first needing to deduce which suspect corresponds to the vision cards received. Once the ghost has handed cards to the final medium, they start a two-minute sandtimer. Once a medium has placed their token on a suspect, they may also place clairvoyancy tokens on the guesses made by other mediums to show whether they agree or disagree with those guesses.&#10;&#10;After time runs out, the ghost reveals to each medium whether the guesses were correct or not. Mediums who guessed correctly move on to guess the location of the crime (and then the murder weapon), while those who didn't keep their vision cards and receive new ones next hour corresponding to the same suspect. Once a medium has correctly guessed the suspect, location and weapon, they move their token to the epilogue board and receive one clairvoyancy point for each hour remaining on the clock. They can still use their remaining clairvoyancy tokens to score additional points.&#10;&#10;If one or more mediums fail to identify their proper suspect, location and weapon before the end of the seventh hour, then the ghost has failed and dissipates, leaving the mystery unsolved. If, however, they have all succeeded, then the ghost has recovered enough of its memory to identify the culprit.&#10;&#10;Mediums then group their suspect, location and weapon cards on the table and place a number by each group. The ghost then selects one group, places the matching culprit number face down on the epilogue board, picks three vision cards &mdash; one for the suspect, one for the location, and one for the weapon &mdash; then shuffles these cards. Players who have achieved few clairvoyancy points flip over one vision card at random, then secretly vote on which suspect they think is guilty; players with more points then flip over a second vision card and vote; then those with the most points see the final card and vote.&#10;&#10;If a majority of the mediums have identified the proper suspect, with ties being broken by the vote of the most clairvoyant medium, then the killer has been identified and the ghost can now rest peacefully. If not, well, perhaps you can try again...&#10;&#10;",
        "artist": "Igor Burlakov,Xavier Collette"
    },
    {
        "name": "Completto",
        "description": "In Completto, each player tries to create an ascending row of 22 tiles. Unfortunately, the tiles &mdash; numbered 1 to 100 &mdash; start out face down on the playing area and are revealed only one at a time while you play, and you're likely to find that no gap to place the tile that you've just drawn. What do you do now?&#10;&#10;Whoever first creates an ascending row of 22 tiles wins!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Die holde Isolde",
        "description": "&quot;Squires, welcome to Medieval Academy, the place where you'll be trained to become a knight. You'll have to master the arts of Jousts and Tournaments, complete dangerous Quests, and polish your Education. You'll also have to serve the king, and show that you have a sense of Charity and Gallantry. Only one of you will be knighted by King Arthur, so it's time to show what you&rsquo;re capable of.&quot; &mdash;Father Advevan Nicolus Emilius, chairman of the Medieval Academy.&#10;&#10;In Die Holde Isolde, a &quot;family+&quot; game, each player takes the role of a squire who wants to outdo the others in the different training categories to score Chivalry Points. To achieve this goal, during the six turns of the game, the players must wisely draft the cards that are the most useful to them and play them at the right time to move their discs up the training tracks.&#10;&#10;At the end of turn VI, the squire who has the most Chivalry Points wins the game and is knighted by King Arthur!&#10;&#10;Die Holde Isolde consists of both the Medieval Academy base game and the Galantry and Magic mini-expansions.&#10;&#10;",
        "artist": "Pierô"
    },
    {
        "name": "Cornwall",
        "description": "In Cornwall, players try to enlarge the landscape by adding tiles to it and placing pawns on these tiles. By doing so, they earn money, which is desperately needed to bring their pawns back from the pub!&#10;&#10;Since all pawns move to the pub to celebrate the end of the workday once an area is complete, it becomes tricky to have enough pawns available to conquer new areas. You can leave pawns on an area in order to continue to increase the size of it, but then the area might become attractive for other players, too, with them joining you &mdash; or possibly even taking it over for themselves...&#10;&#10;",
        "artist": "Irene Bressel,Anne Pätzke"
    },
    {
        "name": "Team Play",
        "description": "Which team will be the first to complete eight tasks?&#10;&#10;In Team Play, you try to support your partner by passing along the right cards at the right time to complete goal cards, while also keeping an eye on your opponents and a third eye on the face-up cards in the middle of the table.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Dr. Eureka",
        "description": "The brilliant Dr. Eureka has important experiments for you to complete! You must solve his scientific formulas by mixing the molecules from tube to tube without touching them with your bare hands. Transfer your molecules faster than your competition in Dr. Eureka to prove you're the smartest scientist in the lab...&#10;&#10;",
        "artist": "Stéphane Escapa"
    },
    {
        "name": "Mint Tin Mini Apocalypse",
        "description": "A simultaneous 2 player game of surviving the apocalypse all in 5 to 10 minutes.&#10;&#10;It&rsquo;s a nice day in Meepleton. You &amp; friends are enjoying the day without a care in the world . . .&#10;BOOM! Transformers blow, cars crash, people fall to the ground unconscious. Phew! You&rsquo;re wobbly but okay.&#10;RAWR! Nearby a giant, heinous monster wreaks havoc!&#10;Get your friends to the school's forgotten fallout shelter.&#10;&#10;Game Setup&#10;&#10;Dump out tin, choose a color, place 4 meeps laying down &amp; 1 standing on your side of tin.&#10;Grab matching dice.&#10;Tin is the Fallout Shelter (FoS).&#10;Stand monster a few inches from FoS with green die behind it, 6 facing up.&#10;Place 2 white supply boxes between the FoS &amp; nefarious monster.&#10;&#10;Game Play&#10;Get your meeps to their feet, stay on yours, secure the FoS, get 1 supply box &amp; seal the FoS!&#10;Your actions are on 7s &amp; you need 1 standing meep to help your single meeps or to knock down others. &#10;FoS holds a max of 7 meeps.&#10;Start game &amp; roll your dice. Standard game is simultaneous rolling, not turn-based.&#10;On a 7 you can:&#10;&#10;    Stand 1 meep (if none standing)&#10;    Help 1 meep to its feet&#10;    Help 1 standing meep into FoS&#10;    Knock down 1 standing opponent&#10;    Toss 1 opponent out of FoS (you need 1 in) BUT place them standing up outside FoS&#10;    Send out RECON PAIR from the FoS to get 1 supply box&#10;    Stand 1 knocked down meep in RECON PAIR&#10;    Knock down 1 meep in RECON PAIR&#10;    Drag 1 supply box into FoS with standing RECON PAIR&#10;    Seal FoS &ndash; Close lid with at least 4 of your meeps in &amp; 1 supply box for the WIN!&#10;&#10;&#10;&#10;&#10;What about the monster?&#10;&#10;Three game modes &ndash; Decide before you start: UHOH or OMG or CRA-CRA!&#10;&#10;     UHOH activates monster die as soon as a supply box gets into the FoS. This is standard play. Once activated, player rolling doubles of monster die&rsquo;s face-up number has to turn monster die down 1.  A double 6 turns monster die to 5, a double 5 turns it to 4 &amp; so on. When monster die is on 1, snake eyes (double 1s) ends game. Monster gets in FoS &amp; eats you! BUT . . . either player can be a hero by tossing 1 of their outside standing meeps onto monster die! That meep is forever gone (but not forgotten). However, next double 1s ends the game unless another jumps on. Sacrificing a meep doesn&rsquo;t need a 7 &amp; can be done in or out of FoS but only when monster die is on 1.&#10;     OMG mode activates monster die when the game starts. Faster game but it sucks to be human.&#10;&#10;&#10;&#10;&#10;",
        "artist": "David Rene Miller"
    },
    {
        "name": "The Opulent",
        "description": "The 1920s &mdash; a time that is often referred to as the &quot;Roaring Twenties&quot;, a boisterous period characterized by rapidly changing lifestyles, financial excesses, and the fast pace of technological progress. In 1919, the requisite number of legislatures of the States ratified the 18th Amendment to the Federal Constitution, enabling national Prohibition within one year of ratification. Prohibition began on January 16, 1920 when the Eighteenth Amendment went into effect. During this time, the sale, manufacture, and transportation (a.k.a. bootlegging) of alcoholic beverages was illegal throughout the United States. Federal Prohibition agents were given the task of enforcing the law. Even though the sale of alcohol was illegal, alcoholic drinks were still widely available at &quot;speakeasies&quot; and other underground drinking establishments.&#10;&#10;Welcome to the Opulent, a posh speakeasy located in vibrant Atlantic City! In The Opulent 1-4 players are tasked with the operations of a successful nightclub during the historic Jazz Age. Each player takes on a distinct role that plays a vital part in the success &mdash; or failure &mdash; of the Opulent. Cater to the recognizable social classes of the 1920s. Politicians, mobsters, aristocrats, and social celebrities are all seeking a grand time in your club. Entertain your patrons with upbeat jazz tempos, or melodic waltzes, with the Opulent jazz band. Fancy the illegal indulgences of your patrons by preparing them an exotic mixed drink, a good whisky on the rocks, or even a simple brew. Pay lookouts to deter Federal Agents seeking to shut the club down. Hire flappers, a chanteuse, cocktail waitress, or other helpful hands and amenities to improve your club.&#10;&#10;Manage the Opulent in ten scenarios dating from 1920-1929 during one of the most historic periods of U.S. history! Each scenario has a dollar value that is associated with the cost of operating The Opulent for that particular year. Players must have enough money in the club coffers to cover this cost in order to win the scenario if playing a single session game, or to progress to the next scenario if players are taking on the Opulent campaign.&#10;&#10;With a focus on theme and history, &quot;The Opulent&quot; is a light cooperative asymmetrical game set during 1920's prohibition where players operate a campaign driven upscale speakeasy.&#10;&#10;",
        "artist": "Aaron Yung"
    },
    {
        "name": "Niña & Pinta",
        "description": "Quantum physics tells us &lsquo;the ability of quantum particles to occupy two states seemingly at once could be explained by both states co-existing in different universes&rsquo;. So when you wave goodbye to your ship in your universe, someone else waves goodbye to their ship in a different parallel universe. But what would happen if these neighboring universes, separated by the thinnest, gossamer barrier should somehow be breached and my ship sails into your world and searches for gold in competition to your ship? Play the game and find out...&#10;&#10;Ni&ntilde;a &amp; Pinta is a game of exploration of the New World where the great nations of Spain, England, France and Portugal send ships out to map the unknown and to bring home wealth to the Old World. This is a game where those ships will cross the divide and where no love is lost between Captains no matter which world it is! Explore, settle, fight if need be, and help your nation develop its Culture, Science, Religion and War-craft, to be the best in all worlds!&#10;&#10;No dice rolling in this Ragnar game, but plenty of tension as players can launch offensives with their Captains after first using them to flip land tiles thereby exploring each New World. Settlers are placed in explored lands to generate gold revenue. When combinations of terrain are occupied, towns and cities can be built. Meanwhile gold is used in the Old World to buy items to benefit further New World development or to accumulate the victory points generated by Culture, Science, Religion and War which themselves are meshed with what is taking place in the three New Worlds.&#10;&#10;This is a tightly knit puzzle that will have players pondering a multiplicity of decisions from start to finish. As much of the play is simultaneous and &quot;single-action&quot;, there is little downtime. The game has a good sense of growth worthy of its fascinating theme.&#10;&#10;",
        "artist": "Marco Primo"
    },
    {
        "name": "Retro Loonacy",
        "description": "Retro Loonacy is a rapid fire card game in which players race to be the first to empty their hand by matching one of two images on each card in their hand with the images on the open piles in front of them. The number of piles varies depending on the number of players, and if players ever reach a moment in which no one can play, everyone draws a card and it adds it to their hand at the same time, then the game play resumes.&#10;&#10;",
        "artist": "Andrew Heath"
    },
    {
        "name": "Buttons",
        "description": "Buttons is a clever dice game with a press-your-luck element. The players take turns rolling the dice and placing buttons on their board. Although only one person rolls the dice at a time, everyone can profit from the dice roll and also place a button. But be careful! The fuller the board, the riskier it becomes to play. Then it's a case of getting out in time so as not to lose your buttons!&#10;&#10;Buttons is played over several rounds. In every round, the goal of the players is to place buttons on the spaces. At the end of a round, players score for the buttons they've placed; each set of three gives them a star, which is placed on the player board. The first player to have either twelve stars or five stars in a row wins!&#10;&#10;",
        "artist": "Andrea Hofbeck"
    },
    {
        "name": "Brass Empire",
        "description": "Brass Empire takes place in a Steampunk universe and each player takes on the role of a different corporation hiring the best employees, constructing building, and manufacturing steam-powered machines. Players battle and sabotage each other to amass economic wealth and influence to win the game.&#10;&#10;Overview:&#10;&#10;Welcome to the Steampunk world of Cobalt. For centuries, Cobalt has been ruled by corporations seeking to enhance their wealth and influence with Brass. Brass doesn&rsquo;t just fuel the economy but literally fuels the technology and transportation of the world through its unique thermodynamic properties. Every day these companies compete and battle to expand their territory and authority. Companies work to optimize their labor force and resources to mine the most Brass in each territory through corporate espionage, technology, security, and even sabotage. You work for such a company and have been tasked with expanding into a new region by constructing new corporate buildings, hiring employees, and battling other companies in the area. The player who earns the most Brass will lead his company to victory in the region.&#10;&#10;Each turn, you will play Employee cards from your hand to gain resources. These resources will allow you to acquire new Employees, Buildings and Units for your deck. Along the way, you will acquire buildings to enhance your hold on the region and command units to attack other companies and mine for Brass. At the end of the game, the player with the most Brass is the winner.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Taverna",
        "description": "It is Saint-Averna's day, the holiest day in the kingdom of Averna. To celebrate, all the citizens gather in the capital city to party, drink and sing, from tavern to tavern. In the interactive card-driven worker placement game Taverna, you play an innkeeper of the city, eager to profit from this celebration and make his renown widespread. In order to do so, you will need to get along well with the four peoples of the kingdom, and you will need to cope with the demands of the Royal Court. It is up to you to be courteous with all of them. Will you play fair? Or will you use trickery, magic, and your influence with the most famous dignitaries?&#10;&#10;Each turn, players will chose one customer among the four available cards and place it in one of the five taverns. The property owners receive gold and the innkeeper is rewarded if he fulfils the expectations of the patrons. During your turn you can play one of the four dignitaries, cast spells, use royal favours and benefit from privileges. At the end of turn six, players will score one of the five members of the Royal Court, each scoring being available once. Your popularity with the four people will determine the royal scoring order and final bonuses. Power and glory to the most popular innkeeper.&#10;&#10;",
        "artist": "Jonathan Hartert"
    },
    {
        "name": "Hack Trick",
        "description": "1:34 a.m. --- A fired bookkeeper&rsquo;s message on Twitter: 3-SAME or SUM-15.&#10;1:39 a.m. --- The information leaked out few minutes ago, and already the cartel chief's server has been attacked. &#10;The stake is high, therefore the hackers not only have to break the firewall but to fight against each other ... &#10;&#10;Hack Trick is a game of deduction and combinations where players generate numbers to finally obtain a valid password - a three-digit code with the same digits (ex. 222, 555) or with their sum being 15 (ex. 852, 159, 357). Each time a card is played, the player adds a number to the sequence, and marks the generated number - the sum of the last two numbers - on the keypad (places a marker on the key). Because the keypad is a magic square (the sum of each row, column or diagonal is 15) the object of the game is to line up three markers or place three on the same key.&#10;&#10;Hack Trick gameplay is deceptively simple, but you&rsquo;ll see, that it hides many combinations. In his turn, the player may ask the sum of the opponent&rsquo;s hand, than play a card or draw. When he plays a card he may capture opponent markers, moreover, he may sacrifice a marker to force his opponent to play a card in the next turn, or contrarily, protect himself from being forced. Markers can be used in five different ways, but be careful, the player who runs out loses!&#10;&#10;Finally, the winner will be the player who knows how to defend and attack the positions, when to gather information, when to use the doubles, when to start a forced series, but above all how to find the right balance between forming a strong hand and tend to the final goal on the board.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "D6 Shooter",
        "description": "D6 Shooter is a fast paced western themed press your luck dice &amp; card game for 2-4 players. Take on the roll of Bounty Hunter and gain a good reputation by hunting down &amp; capturing wanted bandits that plague a small town. Gather enough &quot;Rep&quot; points to work your way from Bounty Hunter all the way to Marshall. Better hurry, you are not the only one after the job!&#10;&#10;The game includes over 100 game cards, 10 General Store cards &amp; 6 custom shooter dice. On each player's turn, they flip over a card to hunt for a wanted bandit.  Each bandit has a sequence of suit symbols (heart, diamond, spade &amp; club).  The tougher the bandit the more suit symbols will appear.  The player can roll and re-roll the 6 dice up to 3 times to try to capture the bandit by matching these symbol.  Jokers are wild and can be used as any suit. Skulls, if rolled, render the die out of play.  Once captured you can stop &amp; collect the bandit by moving them into you jail, or you may press your luck &amp; try to grab more bandits.  If you decide to continue on your hunt you get to re-roll all of your dice, minus any skulls previously rolled, for three more chances to capture the new bandit.  Lose any bandit on your turn &amp; you lose ALL the bandits collected this round!&#10;&#10;Each bandit has a reward amount for their capture as well as 1 to 2 reputation points to put towards your promotions. Higher ranks gain the ability to re-roll a certain number of skull dice.&#10;&#10;Reward money can be traded in for General Store cards which can help you on your journey or played to hinder another player's. But choose wisely, spending your reward money will sacrifice the Rep you have gained for those bandits!&#10;&#10;The game deck also contains event cards.  Some events award you with General Store cards by completing a rolling task. Other events may cause you to lose the bandits you are wrangling, or have your previously captured bandits escape from your jail!&#10;&#10;Be the first player to be promoted to Marshall to win!&#10;&#10;Think you have what it takes to win the west? Then roll into D6 Shooter! Yeee-haaw!&#10;&#10;",
        "artist": "Jacqui Davis"
    },
    {
        "name": "CVlizations",
        "description": "In CVlizations, you take the role of a leader of a tribe, and you are charged with the task of &quot;writing&quot; its CV (Curriculum Vitae - r&eacute;sum&eacute;). To do so, you choose which orders to give and which inventions, tools, buildings and ideologies to develop. The happiness of your people depends on you.&#10;&#10;Gameplay is built around action selection. Each turn, every player chooses two order cards, and the strength of the action depends on how many other players have chosen that action. Players manage their resources to develop ideas, and in the end the one who collected the most happiness points wins.&#10;&#10;",
        "artist": "Piotr Socha"
    },
    {
        "name": "Peloponnes Card Game",
        "description": "The Peloponnese &mdash; home of the mighty and proud city-states, the &quot;poleis&quot;. In the Peloponnes Card Game, you lead one of them through the ages, gaining fame and prosperity while weathering disaster. Over eight rounds, you develop your civilization by claiming new territory, constructing prestigious buildings, and increasing your population. Can you balance the pursuit of glory with the needs of your people?&#10;&#10;The Peloponnes Card Game is based on the Peloponnes board game; a few details were simplified, while the strategic projections and the feeling of the game are new!&#10;&#10;",
        "artist": "Matthias Catrein"
    },
    {
        "name": "Warhammer Quest: The Adventure Card Game",
        "description": "Join forces with legendary heroes to brave the many dangers of a cavernous dungeon. Wield potent weapons and magic. Conquer hordes of vile monsters. Discover fabulous treasures.&#10;&#10;Warhammer Quest: The Adventure Card Game is a cooperative game of heroic dungeon adventures for one to four players. Players assume the roles of some of the Old World's most iconic heroes, then venture into the shadows to battle ghouls, Goblins, Skaven, giant bats, swarms of rats, and other monsters.&#10;&#10;Can you survive their relentless onslaught? Can you press deeper into their lair to find the evil villain that drives them forward? There are only two ways for your quest to end &ndash; in death or in glory!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Snowblind: Race for the Pole",
        "description": "Snowblind is a press-your-luck and risk-management dice game in which 1-4 players take control of a polar expedition, racing to be the first to return from the South Pole.&#10;&#10;The object of the game is to collect the most prestige points. The further you advance your Captain, and the more men who survive the Antarctic winter at the end of the game, the more prestige your expedition receives. This requires careful management of crates, food and camps: without supplies, your explorers will not survive.&#10;&#10;Play proceeds over a series of rounds. Within each round, players may make as many moves as they like, from those available, with each additional move becoming increasingly dangerous. In more detail, each turn, players may take an action (which involves taking a risk die from the action board, adding the die to their dice pool, then taking a corresponding action), or they choose to pass. Actions include moving explorers and crates, hunting for food, collecting research, and building camps. After completing an action, the active player rolls all the dice in their dice pool. High numbers result in exposure, the loss of supplies (crates and food), explorers being incapacitated, and even death. Exposure results can be offset by explorers remaining together (company) and the building of camps.&#10;&#10;A round ends when all players have passed. At the end of the round, a weather card is drawn that may cause additional attrition, then the next round begins. When the pack ice card is drawn from the weather deck, one last round is played and the game ends.&#10;&#10;",
        "artist": "Rob van Zyl"
    },
    {
        "name": "Runebound (Third Edition)",
        "description": "Description from the publisher:&#10;&#10;Welcome to Terrinoth, adventurer! Runebound is a fantasy adventure board game for two to four players, inviting you to play as one of six heroes wandering the realm and taking whatever quests you may encounter. But all is not well in the realm: evil is awakening once more in the form of Margath the Dragonlord or the Corpse King, Vorakesh. Only you and your rival heroes stand a chance of stopping this threat before all Terrinoth is consumed in darkness.&#10;&#10;Two distinct scenarios give shape to your adventures in Terrinoth, challenging you to battle undead or outwit a dragon, even as you explore lost ruins and forgotten forests and take on quests across the realm. New adventure cards and story cards for each scenario make every game unique, alongside the ability to customize your hero with over one-hundred different skills and assets. Whether you play as a mage bristling with spells or a powerful warrior, every game of Runebound invites you to experience an incomparable adventure. Take your first steps into the world of Terrinoth!&#10;&#10;",
        "artist": "WiL Springer"
    },
    {
        "name": "8-28",
        "description": "8-28 is a press your luck card game. At the start of the game, each player gets one card they look at, then place face down in front of them. The cards have values ranging from 1 to 11. During the course of the game, the players may draw one random additional card per round to place face up in front of them. As long as any player still wants cards, gems are added to a pile. The round ends only when no one wants to take any more cards. Then, all cards are revealed and the two players whose cards are closest to a total of 8 and 28 respectively, without going over, share the gems among them.&#10;&#10;",
        "artist": "NA"
    }
]