[
    {
        "name": "Killer Bunnies REMIX",
        "description": "Playroom Entertainment is excited to announce Killer Bunnies&reg; Remix!  Now players can enjoy a sampling of favorite cards from the classic version of Killer Bunnies&reg; and the Quest for the Magic Carrot&trade;, hand-picked by the game&rsquo;s creators.&#10;&#10;KB Remix can be found exclusively at Target and Barnes &amp; Noble locations nationwide.  The game features 310 cards, taken from the KB Quest Blue Starter Deck and its Boosters.  Designed for an easier jump into Killer Bunnies world, players will find many of the funny cards and addictive game play, without the more advanced mechanics that the core game contains.&#10;&#10;KB Remix does not mix with the KB Quest Blue Starter or Booster decks, as the cards are of a different quality, with different backs.&#10;&#10;Whether you are a novice player or have been enjoying Killer Bunnies Quest for years, you'll love this mix of fantastic cards, images and hysterical references from this top-selling game series!&#10;&#10;Playroom Entertainment will continue to produce and support the KB Quest line for the specialty market and the game's huge fan base.  In fact, we have some new surprises coming soon, so stay tuned for updates!&#10;&#10;KB REMIX DOES:&#10;Include some of the best cards from the original game&#10;Serve as the perfect intro to Killer Bunnies&#10;Cause riotous laugher and hilarity&#10;&#10;KB REMIX DOES NOT:&#10;Mix with other KB Quest Starter or Booster decks&#10;Have every card from the full game&#10;Contain any cards not found in KB Quest&#10;&#10;",
        "artist": "Jonathan Young"
    },
    {
        "name": "Alien Frontiers",
        "description": "Do you have what it takes to be a deep space colonist?  An alien frontier awaits the brave and daring!  This new planet will be harsh, but if you have the skills to manage your resources, build a fleet, research alien life, and settle colonies, the world can be yours.&#10;&#10;Alien Frontiers is a game of resource management and planetary development for two to four players. During the game you will utilize orbital facilities and alien technology to build colony domes in strategic locations to control the newly discovered world.&#10;&#10;The game board shows the planet, its moon, the stations in orbit around the planet, and the solar system&rsquo;s star. The dice you are given at the start of the game represent the space ships in your fleet. You will assign these ships to the orbital facilities in order to earn resources, expand your fleet, and colonize the planet.&#10;&#10;As the game progresses, you will place your colony tokens on the planet to represent the amount of control you have over each territory. Those territories exert influence over specific orbital facilities and, if you control a territory, you are able to utilize that sway to your advantage.&#10;&#10;The planet was once the home of an alien race and they left behind a wondrous artifact in orbit. Using your fleet to explore the artifact, you will discover amazing alien technologies that you can use to advance your cause.&#10;&#10;Winning the game will require careful consideration as you assign your fleet, integrate the alien technology and territory influences into your expansion plans, and block your opponents from building colonies of their own. Do you have what it takes to conquer an alien frontier?&#10;&#10;Roll and place your dice to gain advantages over your opponent and block them out of useful areas of the board.  Use Alien Tech cards to manipulate your dice rolls and territory bonuses to break the rules.  Steal resources, overtake territories, and do whatever it takes to get your colonies on the map first!  Don't dream it'll be easy, though, because the other players will be trying to do the same thing.&#10;&#10;",
        "artist": "Piotr Burzykowski,Karim Chakroun,Mark Maxwell"
    },
    {
        "name": "The BattleTech Compendium",
        "description": "From the back of the book:&#10;&#10;&#10;        &quot;COMPILATION OF six years of detailed research, The BattleTech Compendium may well be the ultimate resource for the player. Clear and concise rules clarifications, battle demonstrations, and rules changes will help develope and streamline play. All Material from the BattleTech Manual is presented in a revised form, as well as additional rules for JumpShip and DropShip combat 'Mech construction, and the latest discoveries concerning the technology of the Star League and the Invading Clans. Optional rules are included for miniature play, environmental effects on the battlefield, and more. Loaded with color photos, this Compendium gives the clearest picture yet of combat in the 31st Century.&quot;&#10;&#10;&#10;User comment:&#10;&#10;The Battletech Compendium is a compilation of all Battletech rules and rule clarifications.  It is a concise complete guide including Aerotech, infantry and vehicle rules.&#10;&#10;It also contains rules for 'Mech construction updatd to include inner sphere as well as clan technology..&#10;&#10;The BattleTech Compendium superceded the BattleTech Manual: The Rules of Warfare and was in turn superceded by the BattleTech Compendium: The Rules of Warfare.&#10;&#10;",
        "artist": "Earl Geier,James Nelson,Mike Nielsen,Steve Venters"
    },
    {
        "name": "Wazabi",
        "description": "You have a single goal in Wazabi: Get rid of your dice. The trap, though, is that the fewer dice you have, the more difficult the game becomes.&#10;&#10;Why? Because players can use the powers of the dice to give a die to another player, draw cards, or play a card, and these cards can remove dice from the game, give dice to another player, draw even more cards, or take many other assorted actions. Good luck!&#10;&#10;",
        "artist": "Agence Bravo"
    },
    {
        "name": "Clue: Carnival – The Case of the Missing Prizes",
        "description": "Get set for a carnival adventure and solve the mystery of the missing prizes! The carnival prizes have been stolen and it&rsquo;s up to you to get to the bottom of it! Who stole them? Where were they taken from? And at what time did the crime happen? Guess as you go and prepare to reveal the truth at the nail-biting end of the game...the player with the most correct guesses wins! There&rsquo;s no time to waste... get on the case!&#10;&#10;SUMMARY: Discover who took the prizes, and when, to win! Two-sided board has 2 levels of play, so the game grows with the kids! Includes gameboard (in 2 pieces), plastic tray, 5 movers, 6 &quot;Who&quot; cards, 6 &quot;Where&quot; cards, 6 &quot;When&quot; cards, 1 All Guess card, 18 Guess tokens in 5 colors, 3 gold tokens, detective sheet, truth envelope, die and instructions. For 2 to 5 players.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Kraby",
        "description": "Time to catch some crabs! Not for dinner, mind you, but to sell to markets for a grand haul. In order to make the most for your efforts, you want to concentrate on those crabs grouped together in large sets. Otherwise you're piddling away time spent chasing individual crabs, which is hardly worth the bother. The fishermen who nets the most valuable haul wins the game.&#10;&#10;Set-up in Kraby differs depending on the number of players, with 80 or 120 tiles in play, the game board being 9x9 or 11x11, and the number of colored crab figures being 10, 12 or 15. Each player starts by secretly drawing six crab tiles (which come in four colors with two players and five colors otherwise) and placing them behind their screen. On a turn, a player chooses one tile and enters it from any side of the game board, sliding it in the row or column until it hits the island at the center of the board or another tile in play. (A move that would slide a tile off the board or create an impossible-to-fill space is illegal.) The player then draws a new tile and places it behind his screen.&#10;&#10;A player then has the option of placing one of the colored crab figures in his ship's hold. Each ship has three holds, with a scoring multiplier of x1, x2 or x3. A player can claim a color only once and cannot place it on the same multipler as another player. In a four-player game, a player can claim only two figures.)&#10;&#10;The game ends once the final tile has been placed and the game board filled. Each group of crabs in the same color, with orthogonally adjacent crabs belonging to the same group, is worth -1 to 5 points depending on its size. Once the value of a color is determined, each player scoring this color multiplies this value &ndash; which might be negative &ndash; by the multipliers showing on his ship's hold. The player with the highest score wins.&#10;&#10;",
        "artist": "Piotr Socha"
    },
    {
        "name": "Battle for Moscow (second edition)",
        "description": "(from VPG edition:)&#10;&#10;In September of 1941, the German High Command decided to launch a final, decisive offensive to crown their invasion of Russia, capture Moscow, and break the Red Army once and for all. Codenamed Operation Typhoon, German tanks and infantry pressed relentlessly forward until they could see the very spires of the Kremlin. As Russia&rsquo;s communist government was burning secret papers and evacuating Lenin&rsquo;s corpse eastward out of their ancient capital, Moscow was hanging in the balance. By 5 December, the Germans were halted along the entire front -- exhausted and demoralized, having barely failed to capture their objective as the winter freeze grew ever colder.&#10;&#10;Battle for Moscow is another in the popular series of classic introductory wargames from Victory Point Games offering new players something extra: a Battlesson(TM). Relive this dramatic campaign on the Eastern Front of World War 2 while learning more about the fascinating hobby of wargaming, where you hold command as history holds its breath.&#10;&#10;Game Components:&#10;&gt; One 4-page, color  Standard Rules booklet&#10;&gt; 40 color, two-sided die-cut 5/8&quot; mounted pieces&#10;&gt; One 11&quot; x 17&quot; color game map with tables&#10;&gt; 1 Player Aid sheet&#10;&gt; 1 BATTLESSON(TM) sheet&#10;&#10;Complexity: 2&frac12; on a 9 scale&#10;&#10;Solitaire Suitability: 8 on a 9 scale&#10;&#10;Scale: Each unit is one German corps or Russian army, and each turn is approximately one to two weeks.&#10;&#10;",
        "artist": "Alan Emrich,Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "Battleground Fantasy Warfare: Elves of Ravenwood",
        "description": "Not playable on their own as you need two starter decks to play the game.&#10;&#10;Battleground Fantasy Warfare is a point-based tabletop tactical wargame in which units are represented by cards.&#10;&#10;Centuries of training and the guidance of forest spirits make the Elves of Ravenwood a deadly force. Wolves, bears and mighty treants take the field alongside your elven warriors, ready to defeat the enemies of the forest.&#10;&#10;",
        "artist": "Richard Kitner, Jr."
    },
    {
        "name": "Battleground Fantasy Warfare: Men of Hawkshold",
        "description": "Not playable on their own as you need two starter decks to play the game.&#10;&#10;Battleground Fantasy Warfare is a point-based tabletop tactical wargame in which units are represented by cards.&#10;&#10;Lead the noble Hawk army to defend your lands and people. Cavalry, infantry, and deadly longbowmen are yours to command! The superior training, honor and courage of your troops will bring you victory.&#10;&#10;",
        "artist": "Calum Andrews,Jackie Lee,David Lloyd (II),Jordan Speer,Robert Westmore"
    },
    {
        "name": "Battleground Fantasy Warfare: Orc Army",
        "description": "Not playable on their own as you need two starter decks to play the game.&#10;&#10;Battleground Fantasy Warfare is a point-based tabletop tactical wargame in which units are represented by cards.&#10;&#10;Overrun your enemies with a battle-hardened orc army. Flank your opponent with lightning-fast goblin wolf riders and smash them with mighty regenerating trolls.&#10;&#10;",
        "artist": "Calum Andrews,Richard Kitner, Jr.,Jackie Lee,David Lloyd (II),Jordan Speer,Robert Westmore"
    },
    {
        "name": "Penny Arcade: The Card Game",
        "description": "Fantasy Flight Games is proud to announce our newest card game, Penny Arcade! Set in the world of your favorite web-comic, Penny Arcade puts you in the middle of the epic battles between Tycho and Gabe. Unleash attacks at your rival, such as Mein Leapen or the (Cardboard) Tube Strike. Put your Hijinks to good use, employing your beard-growing abilities with Oneupsmanship or the powers of Skullduggery. Collect Stuff, and acquire the Rare Card or your ally in the tub Sir Quacks-a-lot. Hidden in each deck is also the awe-inspiring powers of the Watch, and it is sure to trade hands quite often as abuse is heaped on the head of whoever holds it.&#10;&#10;Each deck features the feel of the characters. Gabe&rsquo;s sees him hiding behind the couch and using his apathy as the ultimate defense. Tycho summons forth his Vast Intellect to overwhelm the boy wonder, and loves nothing more than the feel of a natural 20 with Critical Strike.&#10;&#10;Designed by James Hata, Penny Arcade is a brand new experience. Each turn, you will have to employ your strength and intelligence to best effect to smash the face of your foe. Tycho, being the smarter of the two, can bring to bear many different Hijinks to ensure his victory. Using combinations of Attacks and Hijinks, Tycho can set up the perfect Really Big Word Attack. While not the brainy side of things, Gabe can serve up heaping helpings of pain with his brute strength.&#10;&#10;For fans and newcomers alike, Penny Arcade is a fun, fast-paced card game for two players. Though only one can walk away the victor, both sides will be itching for another go.&#10;&#10;Penny Arcade is a card game for two players featuring the characters from the hit web comic of the same name. Gabe and Tycho employ various attacks, hijinks, and stuff they have acquired over the years to assist them in beating down their rival. Playable in less than 30 minutes, Penny Arcade is easy to learn and impossible to master.&#10;&#10;",
        "artist": "Jerry Holkins,Mike Krahulik,Andrew Navaro"
    },
    {
        "name": "Chicago Gangsters",
        "description": "Chicago in the Golden Twenties: The players take the role of a Mafia clan and compete for domination of the city. They will use any means necessary - you won't get far without blackmail and bribery. Nor will you make it alone; you'll need to work with fellow players to take over the neighborhoods. However, these alliances change more often than the weather: if you're not working with someone, you're working against them.&#10;&#10;Who will best use their contacts with judges, bank directors and clubs - the best to run a lucrative business in smuggling alcohol?&#10;&#10;",
        "artist": "Michaela Kienle,Annette Nora Kara"
    },
    {
        "name": "Cards Against Humanity",
        "description": "&quot;A party game for horrible people.&quot;&#10;&#10;Play begins with a judge, known as the &quot;Card Czar&quot;, choosing a black question or fill-in-the-blank card from the top of the deck and showing it to all players.  Each player holds a hand of ten white answer cards at the beginning of each round, and passes a card (sometimes two) to the Card Czar, face-down, representing their answer to the question on the card. The card czar determines which answer card(s) are funniest in the context of the question or fill-in-the-blank card. The player who submitted the chosen card(s) is given the question card to represent an &quot;Awesome Point&quot;, and then the player to the left of the new Card Czar becomes the new Czar for the next round. Play continues until the players agree to stop, at which point the player with the most Awesome Points is the winner.&#10;&#10;This, so far, sounds like the popular and fairly inoffensive Apples to Apples. While the games are similar, the sense of humor required is very different. The game encourages players to poke fun at practically every awkward or taboo subject including race, religion, gender, poverty, torture, alcoholism, drugs, sex (oh yes), abortion, child abuse, celebrities, and those everyday little annoyances like &quot;Expecting a burp and vomiting on the floor&quot;.&#10;&#10;In addition, there are a few extra rules.  First, some question cards are &quot;Pick 2&quot; or cards, which require each participant to submit two cards in sequence to complete their answer. Second, a gambling component also exists.  If a question is played which a player believes they have two possible winning answers for, they may bet an Awesome Point to play a single second answer.  If the player who gambled wins, they retain the wagered point, but if they lose, the player who contributed the winning answer takes both points.&#10;&#10;From the website:&#10;&#10;&quot;Cards Against Humanity is distributed under a Creative Commons Attribution-Noncommercial-Share Alike license - that means you can use and remix the game for free, but you can't sell it. Feel free to contact us at cardsagainsthumanity@gmail.com.&quot;&#10;&#10;&#10;&#10;    &#10;        &#9;&#9;&#10;&#9;&#9;&#10;&#9;&#9;&#10;&#9;&#9;&#10;&#9;&#9;&#10;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#10;&#9;&#9;&#10;&#10;    &#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Billy Biber",
        "description": "A dexterity game in which cylindrical logs are stacked between the banks of a river with Billy Beaver sitting on top. Players try to remove logs from the pile (with the help of a stick) without causing the pile to collapse.&#10;&#10;",
        "artist": "Kinetic"
    },
    {
        "name": "Risiko! Prestige",
        "description": "A &quot;deluxe&quot; edition of Risiko! containing the Official Tournament Rules, based on a completely different set of secret objectives and a special scoring system.&#10;&#10;The game contains 6 sets of coloured &quot;tanks&quot; and &quot;flags&quot; (the typical Italian gaming pieces), 6 set of dice in different colours (3 for each colour), boxes for storing the gaming pieces, a playing board, a special plastic tray for rolling dice, the standard st of cards and the special Tournament Secret Objective Cards.&#10;&#10;This edition of the game is the standard one for the Italian Risiko! Game Club and the tournament rules have been used also for the online version.&#10;&#10;The Italian Risiko! Chanpionship is held every year.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Belfort",
        "description": "Welcome to the Tasty Minstrel universe! Put your Elves, Dwarves and Gnomes to work in the Village and Guilds of Belfort to collect resources and build up the city!&#10;&#10;Elves collect wood from the forest while Dwarves collect stone from the quarry. An Elf and a Dwarf together can collect Metal from the mines, and either one can collect Gold. Build buildings in the five districts of the pentagonal city and hire Gnomes to run them to gain their special abilities.&#10;&#10;Belfort is a worker placement game with area majority scoring in each district as well as for each type of worker. Buildings give you influence in the districts as well as income, but taxes increase based on your score so the winning players will have to pay more than those behind! Manage your resources and gold well, choose your buildings wisely, and help build the city of Belfort!&#10;&#10;",
        "artist": "Josh Cappel,Jay Cormier,Satya Hody,Sen-Foong Lim,Hans-Georg Schneider"
    },
    {
        "name": "Black Cross/Blue Sky",
        "description": "Take to the skies over southeast England during the turbulent Summer of 1940, as the outnumbered aircraft of the RAF fought a desperate struggle of survival against the onslaught of the near-invincible German Luftwaffe. &quot;Black Cross/Blue Sky&quot; is a historical wargame that allows players to assume the role of either a British or German pilot during the Battle of Britain.&#10;&#10;The core game rules use a revolutionary system that has been used in the historical miniatures gaming hobby for 15 years.  Nominated for the Charles S. Roberts Award for best historical miniatures rules set in 1996, the rules have been refined and expanded from hundreds of players&rsquo; feedback. The result is a game system which allows a huge number of aircraft to be easily handled without the tedium of written orders.  Multiple sets can be combined to allow large games that are limited only by the space provided by the players.&#10;&#10;",
        "artist": "Ugo Crisponi,Mark Mahaffey"
    },
    {
        "name": "Ninjato",
        "description": "In 12th century Japan, the Minamoto and Taira clans vie for power while retired Emperor Go-Shirakawa plays his rivals against one another. One of the three factions will triumph to impose the coming social order. In the shadow of these elite powers, a few ninja scheme to exploit the chaos. Daring raids, skill mastery, and subtle intrigue are essential to establishing one&rsquo;s honor.  When the new era dawns, one ninja will flourish as the Ninjato, the Invisible Sword of the ruling family.&#10;&#10;Ninjato is the newest board game from CrossCut Games, makers of Galactic Emperor, and published by Z-Man Games, IELLO, and White Goblin Games.&#10;&#10;",
        "artist": "Drew Baker,Peter Gifford"
    },
    {
        "name": "Le Boomb!",
        "description": "A single die game/activity akin to LCR or Dreidel. Roll the die: the Boomb either stays put, changes owners, or explodes. Last person in wins.&#10;&#10;(From the publisher's webpage)&#10;Fun, Silly, easy to learn and loads of fun!&#10;&#10;Le Boomb is a casual, social game for 2-16+ players ages 6 and older. You can play in about 5-15 minutes. Here's all you need for a portable game party: 1 custom die that tucks into your special &quot;boomb&quot;!&#10;&#10;Le Boomb!, a quick brilliant silly little game based entirely on luck, that turns any gathering into a party! A simple portable party game--fast, frantic and loads of fun, which capitalizes on players desire to survive.&#10;&#10;Each copy of Le Boomb contains:&#10;. 1 die&#10;. 1 bomb (for play and for die storage)&#10;&#10;",
        "artist": "Pete Fenlon"
    },
    {
        "name": "Caligula",
        "description": "It is the year 41 AD. The emperor Caligula has finally gone too far. An occasional political assassination you can understand, but his personal habits are too much to bear! It&rsquo;s time that somebody step in and deal with the madman before it&rsquo;s too late. And if you should happen to profit at the same time you rescue the Republic, well, who could complain about that?&#10;&#10;Caligula puts you and your friends in the togas of the true powers in Imperial Rome: the guys holding the knives! Send your legates throughout the empire to further your own plans and seize valuable opportunities. Keep a wary eye on your rivals and make them pay dear for their gains. Marshal your resources with care, and when the moment is right, strike! Secure your favorite on the throne, and all the wealth and glory of Rome will be yours for the taking!&#10;&#10;Caligula is the first game by Italian designer Pierluca Zizzi, and the sixth title from the up-and-coming young publisher Post  Scriptum. ElfinWerks is pleased to be able to bring this exciting game of plots and politics to America. Do you have the savvy to navigate the treacherous politics of the Eternal City? Or will your rivals leave you banished from the halls of power? Take up your knives for the Republic (And for yourself!) in Caligula!&#10;&#10;",
        "artist": "Paolo Meriti,Paolo Vallerga"
    },
    {
        "name": "NichtLustig: Labor Chaos",
        "description": "Another card game based on the german webcomic NichtLustig by Joscha Sauer and his latest print publication &quot;NichtLustig 4&quot;. It features characters from that book like the mimicry duck, a time-travelling dinosaur keen on borrowing stuff he never returns, yetis, suicidal lemmings and crazed scientists.&#10;&#10;Advertised as a party game with rules that can change during play.&#10;&#10;From the publisher's website:&#10;&quot;Actually my cards aren't that bad: If another player now laughs, I'll only have two cards left in my hand. And of course I must pass the dinosaur, otherwise I'll never get rid of the last card. So let's change the victory conditions, then this should work.&#10;But what's that? Now the machine starts rumbling and I receive additional cards! Just because there's so many players wearing glasses! These scientists just can ruin any plan! But just wait, it's my turn next. And I tell you, that will be NOT FUNNY (NichtLustig)!&quot;&#10;&#10;Integrates with:&#10;&#10;    Nichtlustig: Noch mehr Labor Chaos&#10;&#10;&#10;&#10;&#10;",
        "artist": "Anke Pohl,Thilo Rick,Joscha Sauer"
    },
    {
        "name": "Monopoly: Nightmare Before Christmas Collector's Edition",
        "description": "Monopoly, the fast-dealing property trading game presents for the first time ever Tim Burton's The Nightmare Before Christmas Monopoly!&#10;&#10;Relive this cult classic movie Nightmare Before Christmas as you buy, sell and trade iconic movie locations such as Jack&rsquo;s Tower, Oogie Boogie&rsquo;s Casino, Sally&rsquo;s Alley, Dr. Finkelstein&rsquo;s Laboratory, Town Square Fountain and Spiral Hill.&#10;&#10;This completely customized game features film photography and six collectible pewter tokens including Jack&rsquo;s Skull, Sally, the Mayor&rsquo;s Hearse, Oogie Boogie, Zombie Duck and Evil Teddy. A must-have for all The Nightmare Before Christmas collectors and MONOPOLY enthusiasts.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Adaptoid",
        "description": "Adaptoid is a board game for two players designed by N&eacute;stor Romeral Andr&eacute;s in 2007. Each game lasts around 20 minutes.&#10;&#10;An adaptoid is a creature that constantly evolves to adapt itself to its surroundings. To survive it needs to be fed. In adaptoid, two armies of adaptoids must confront one another with the aim of eliminating all opponents.&#10;&#10;The game is played on a 37-space hexagonal board. Each player receives a supply of adaptoid bodies in either white or black which are plastic discs with laser-cut sockets ready to receive one of the small pile of claws and legs in the colour of each player. The capabilities of each of the adaptoids varies through the game depending on how many and what type of appendage are added.&#10;&#10;Each player turn has 3 phases: Movement, Growth and Feeding. In the movement phase, the player may move one of their adaptoids as many spaces as it has limbs. Adaptoids cannot move through occupied spaces, but they can move on top of an opposing adaptoid to initiate a capture.&#10;&#10;In the growth phase the player must either spawn a new, empty, adaptoid next to one of their existing pieces or add a leg or a claw to any adaptoid already on the board.&#10;&#10;In the feeding phase, every enemy piece is checked for starvation. An adaptoid requires space to graze equal to its number of limbs. Any enemy piece which has fewer empty spaces around it than limbs starves to death and is removed. Starving your opponent to death (or indeed having them incautiously starve themselves) is worth a point.&#10;&#10;The resolution of capture move is simple. The adaptoid with the most claws wins and the other adaptoid is removed from the board. If both pieces have the same number of claws, both are removed with a point going to each player. Starved or captured pieces are returned to the supply ready for further use.&#10;&#10;The game ends when one player has either obtained 5 points by capturing and starving enemy adaptoids or has been completely eliminated from the board.&#10;&#10;",
        "artist": "Néstor Romeral Andrés"
    },
    {
        "name": "Hippos & Crocodiles",
        "description": "HIPPOS AND CROCODILES is a board game for 2 players designed by N&eacute;stor Romeral Andr&eacute;s in 2007. It takes 10 minutes to play.&#10;&#10;The object of the game is to fill up the river with hippos and crocodiles. If a player can&rsquo;t place a piece on the board, he loses.&#10;&#10;",
        "artist": "Néstor Romeral Andrés"
    },
    {
        "name": "Gauss",
        "description": "A small game designed by Susumu Kawasaki.&#10;&#10;A game for two players, Gauss: The Magnetic Duel is played on a small hexagonal grid.&#10;&#10;Each player has a set fifteen tokens: ten in their color and five in the opposite color. Player take turns and each player may place one token per turn.&#10;&#10;Like the poles of a magnet, tokens of opposite color are attracted to each other whereas tokens of like color are repelled by each other.&#10;&#10;You score points if you connect 4 or more discs of your colour.&#10;&#10;",
        "artist": "Néstor Romeral Andrés"
    },
    {
        "name": "Malifaux",
        "description": "Malifaux is a skirmish miniature game in a horror/steampunk setting.&#10; Each player builds a force of 5-7 figures from a faction to battle it out. A force is composed of minions and at least one master.&#10;&#10;Malifaux involves elements of resource management as hands of cards are used instead of dice to resolve skill checks.&#10;Each check involves drawing a card from a deck and adding it to a figure's statistic. Players can then use cards from &#10;their hands to raise the value. The highest value in an opposed check wins.&#10;&#10;The turn system is integrated, with each player alternating turns between model activations.&#10;&#10;",
        "artist": "Melvin de Voor"
    },
    {
        "name": "Legacy: The Testament of Duke de Crecy",
        "description": "It is 1729 in pre-revolution France, a time when the aristocracy has all the power and the means to rule the country. As a wealthy, well-educated aristocrat, you have travelled the world and had the fortune to enjoy your life to the fullest &ndash; but you see that history is about to change course and you know that in order to stay strong, your family must prepare well. You need to find new allies. You must absorb smaller families and use their potency to strengthen your kin. You have to arrange wise marriages, nurture strong connections at court, obtain titles, build mansions, and find the right spouses for your daughters and sons...&#10;&#10;Legacy: The Testament of Duke de Crecy enables you to build a powerful dynasty in 18th century France as you step into the shoes of a French noble and compete for lasting honor. Over three generations, you &ndash; a resourceful patriarch or matriarch &ndash; will attempt to create a lasting legacy by establishing a house with ties to many different wealthy and powerful families from France and abroad (Spain, Italy, Russia and other countries).&#10;&#10;This card game offers endless possibilities. Each time you build a family, you write a unique story, bringing to life the diverse relationships between parents and their children, between cousins, uncles, aunts, nephews and nieces. Whether you are looking for the best husband for your only daughter or a suitable wife for one of your two sons, whether you are looking to add new blood to your family by marrying into foreign nobility &ndash; you will be working to make your family rise in status through prestige and wealth, new skills and abilities.&#10;&#10;In Legacy: The Testament of Duke de Crecy &ndash; known previously as Nobles of Paris and winner of Ducosim Spelontwerp in 2009 &ndash; you will find 75 spouse cards with unique traits, more than twenty secret missions, nine titles, and nine &quot;contribution to the family&quot; cards. This all culminates in a highly thematic card game that will satisfy players who enjoy exploring many different paths to victory.&#10;&#10;&#10;Legacy is a worker placement game in which you take actions to improve the standing and/or wealth of your family. You will expand your family, creating an ever-growing tableau, the family tree. You will need to balance the three 'currencies' in the game, Prestige (converts to Honor points at the end of each generation, of which there are three), Income (your income which converts to hard cash at the end of each round, of which there are 9), and Friend cards (which are actual connections/friends, and are the only way to marry into wealthy/famous families, and can only be received through actions, such as  marrying a woman who brings some of her social contacts with her).&#10;&#10;Prestige, Income and Friend cards can be gained and lost. You can, for example, lose some prestige by marrying someone infamous or lose some Honor points (i.e. reputation) by asking friends for money. There are also numerous actions you can take that will affect one of the three 'currencies' detrimentally, such as bribing someone to get a title (for which you need to pay, but also in the loss of friends who felt they deserved that title, and not you), or the maintenance of a beautiful new park you have built for the people (losing you income). Finally, you can also take actions that result in the loss of some of your social contacts (friends), due to jealousy, or people simply no longer wanting to be associated with you.&#10;&#10;These currencies are carefully balanced by the male and female friend cards in the game. Generally men will give you income and possibly prestige, but will cost you a dowry/wedding costs. Women, on the other hand, will give you connections (new friends you can choose from the current socialites (cards lying open on the table) and possibly prestige, and will sometimes even earn you a dowry!&#10;&#10;The card interactions allow for multiple different paths to success, but you must choose your road strategically, planning out where you want to be headed, else you will be left behind in the dust by those with greater and more successful plans than yours.&#10;&#10;",
        "artist": "Mateusz Bielski,Barbara Trela-Szyma"
    },
    {
        "name": "Mali Powstańcy: Warszawa 1944",
        "description": "&ldquo;Little Insurgents: Warsaw 1944&rdquo; is a eurogame about scouts delivering orders during the Warsaw Rising in Poland in 1944, when the people of Warsaw rose against the Nazis occupying their city. Young boys worked as a couriers delivering letters and orders between squads of rebels, running through the underground sewage canals of Warsaw. Many of them died on that duty.&#10;&#10;In &ldquo;Little Insurgents&rdquo; each player takes command of a unit of three Scouts with the goal of delivering the most orders on time. The scouts from different units are racing against each other to be first, but they also have to co-operate. If the order is not delivered on time crucial parts of the city, or even whole districts can be lost to the occupiers. If too many orders fall into hands of the enemy all players lose.&#10;&#10;The game comes with two variants of rules: basic and extended, with basic being easier and involving more random elements. It is suitable for young players and families. The extended variant, dedicated to adults and gamers, involves special actions, more planning and secret goals.&#10;&#10;The game will be published by Egmont Polska in the autumn of 2009 with rules in three languages: Polish, English and German.&#10;&#10;The game was developed in cooperation with Polish Scout Association (ZHP) and the Warsaw Rising Museum.&#10;&#10;",
        "artist": "Maciej Szymanowicz"
    },
    {
        "name": "De Kolonisten van de Lage Landen",
        "description": "A stand alone version of Catan. In this version you play on the map of The Netherlands and Flanders. It's like the Die Siedler von Catan - Deutschland Edition, although there are some differences.&#10;&#10;&#10;     The game can be played with 3-5 players.&#10;     Players choose their colors from the two flags (black, yellow, red, white, blue).&#10;     Player parts are wooden, not plastic. Also the (uniform) monument markers are made out of wood.&#10;     With five players there also is a special building phase.&#10;     The cities near the sea produce fish chips as well, as with The Fishermen of Catan.&#10;&#10;&#10;The Game was released on September 9th 2009 by the publisher 999 Games. &quot;9-9-9&quot; get it?!.&#10;&#10;",
        "artist": "Geoffrey Cramm"
    },
    {
        "name": "Heroes of Normandie",
        "description": "The time is summer 1944. The Sun shines on Normandie hedgerows. Gentle wind, fields of bright flowers, and in the background, the romantic staccato of machine gun fire in the morning. In these typical French countryside landscapes, thousands of men are about to fight. And die. Bravely like heroes, or cowardly like wussies. But only heroes really matter. Those you see in Hollywood Golden Age war movies. Here lies the inspiration for Heroes of Normandie; here is what the game has to offer: explosive and fast-paced battles; the pleasure of butchering your enemies through MG42 walls of lead; and the ability to crush Nazi bastards under tons of shells &ndash; basically, blood and guts.&#10;&#10;A miniatures game without miniatures, Heroes of Normandie is a fast-paced WW2 strategy wargame inspired by Hollywood war movies. A tactical scale board-game opposing two players and two armies, with the Germans on one side and the Americans on the other. Players use order tokens to determine initiative and to bluff. While a single six-sided die determines combat, action cards are played to spice things up. Secretly plan your attacks and outwit your opponent. Block the opposing strategy and surprise the enemies. Deploy your units and don't turn back!&#10;&#10;",
        "artist": "Alexandre Bonvalot"
    },
    {
        "name": "Triumvirate",
        "description": "In ripis Rubiconis passus militis bellum civile fert et movet cursum eventorum e quibus imperator surget.  Quomodo dominabis proelia quae in agro, in senatu, et per vias Romae accident?&#10;&#10;On the banks of the Rubicon a legionnaire&rsquo;s footstep brings Civil War and sets upon a course of events from which an emperor will emerge. How will you master the battles that are to come on the field, in the senate and through the streets of Rome?&#10;&#10;Triumvirate is a fast-paced game for two that requires subtle hand management and card play to win consistently.  The mechanisms in the core rules make for a very satisfying, imperfect information player trick taking game. In addition to the core game there is a drafting variant that removes randomness from play beyond the initial card deal.&#10;&#10;The game is currently available in Classical Latin, English, German, French, Catalan, Polish, Spanish and Dutch.&#10;&#10;",
        "artist": "Luis Francisco,Pedro Vergani,Travis Worthington"
    },
    {
        "name": "Wo war's?",
        "description": "In a faraway kingdom, invisible creatures haunting the streets, homes, and even parts of the castle. Only the Red Dragon, friend and protector of the kingdom can help locate the creatures.&#10;&#10;2-5 players race on a board to find invisible creatures by using the sounds emitted by an electronic red dragon. The player who finds the most over the course of five timed rounds wins.&#10;&#10;",
        "artist": "Michael Menzel"
    },
    {
        "name": "Pictureka! Card Game",
        "description": "From the back of the box:&#10;&#10;Four different card games to get your creative juices flowing.&#10;&#10;&bull; A is for Apple!  Race to find pics of things that start with a certain letter!&#10;&bull; Race to get rid of all 8 of your cards by spotting mission pics.&#10;&bull; Get calm and stretch your brain muscles in a matching pairs game.&#10;&bull;&nbsp;Get creative and combine cards to complete missions.&#10;&#10;Pictureka fun in a play-it-anywhere card game.&#10;&#10;Contents: 78 picture cards, 32 mission cards and instructions.&#10;&#10;Four games included:&#10;8-Away&#10;Alphabetti&#10;Matchureka!&#10;Cow's Creative Combo&#10;&#10;",
        "artist": "Eugene and Louise (Art Studio)"
    },
    {
        "name": "7",
        "description": "Hear me! As you know, before our kingdoms, blessed by the gods with the gifts of Seven Virtues, were born, the world was ruled by the Unnamed. It was him, who spread disaster and there was no-one who did not bear wickedness in his heart. Only the First Hero, shielded by an armor, which defended him from the influence of sin, has challenged the Unnamed, defeated him and banished into the Void, which he close using magical seals.&#10;&#10;Today the safeguards crumble, and the power of the Unnamed makes its way to our world. Again, people act against each other, their hearts bearing the seeds of wickedness. The Virtues that were our strength are transforming into parodies of themselves. If the heroes will not complete the armor of the First, clothe with it the most worthy of them, and achieve victory over the Unnamed, all shall be lost.&#10;&#10;7 is a fantasy board game, in which you will become a hero worthy of legends, gathering his own party of adventurers to win over an ancient evil. You will take part in dangerous quests, working with other heroes to recover the miraculous Armor of Virtues and proving that you are the most worthy of wearing it. You shall accomplish great deeds, as long as you guard yourself from the temptation of excess, which brings with it sin and disaster.&#10;&#10;7 offers a unique mechanism of play, joining the aspect of cooperation with an element of rivalry. For the kingdom to survive, you will have to join your forces with other players. Be wary though, as there can be only one victor. You will have to beware of excessive ambition though, as it can unnoticeably cause your strength to falter. 7 opens the gates to a heroic, but dangerous adventure.&#10;&#10;",
        "artist": "Tomasz Tworek"
    },
    {
        "name": "Colorio",
        "description": "Colorio starts with players using plastic tokens to cover the colored spaces on the 5x5 game board. On each turn, a player must remove three tokens from the board, then either remove all of them from play or place one or two of them back on the game board in spaces different from where they came. (Thus, at least one token is removed from the board each turn.) A player cannot remove the final token handled by the previous player.&#10;&#10;If a player reveals the fifth space of a color, that player is eliminated from the game. In a two-player game, the remaining player wins. In a game with more players, the game continues with that color (and that player) being out of play; when the fifth space of another color is revealed, that player is also out of the game. Plays continues until one player remains in the game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Empires in America",
        "description": "Empires in America is a States of Siege(TM) series game on the French and Indian War (1754-62) created by veteran designer, Joe Miranda. With riveting solitaire gameplay action, you must command the beleaguered colony of New France, from Halifax to the Ohio Valley, while Britain and her American colonies press in from all sides with war raging from the fortress of Quebec to the Monongahela.&#10;&#10;Employing Leaders to command the opposing Armies, Empires in America presents a new focus on the important historical personages of this era like Montcalm, Wolfe and even a young George Washington. These Leaders establish their reputations as their fortunes wax and wane on campaign across the far-flung frontiers of colonial North America.&#10;&#10;Can the Montreal Militia and Algonquin Indians defeat General Braddock&rsquo;s redcoats before they reach Fort Duquesne?  Can your Troupes de la Marine stop Rogers&rsquo; Rangers at Fort Ticonderoga? Will the Royal Navy sail up the St. Lawrence River to support operations against Quebec? Can court intrigue at Versailles undermine the machinations of William Pitt (the Elder)? Find out as you defend Montreal in Empires in America.&#10;&#10;Game Components:&#10;&gt; One 8-page, color Game Rules booklet&#10;&gt; 40 color, die-cut 5/8&quot; mounted two-sided game pieces&#10;&gt; 12 color, die-cut 3/4&quot; mounted game pieces&#10;&gt; 48 &lsquo;Historique&rsquo; Event and History cards&#10;&gt; One 11&quot; x 17&quot; color game map&#10;&#10;Complexity: 3 on a 9 scale&#10;Solitaire Suitability: 9 on a 9 scale&#10;Scale: Each unit is one British Army, each Leader commands several Battalions&#10;&#10;",
        "artist": "Tim Allen,Alan Emrich"
    },
    {
        "name": "Der HeidelBÄR",
        "description": "&quot;Der HeidelB&Auml;R&quot; was just released this year (20 Year Heidelberger anniversary) and is a party game where everybody uses word association to describe a word with a per, peer, bear in it. The word is replaced with a bear and you need to describe it for the others with only six words. but the first two words are always &quot;This bear...&quot; or &quot;My bear...&quot;. So you actually only have four words and you are not allowed to use words which are in the word you have to guess.&#10;&#10;",
        "artist": "Frank Stark"
    },
    {
        "name": "Cir*Kis",
        "description": "Cir*Kis is a abstract strategy game for the whole family. Players take turns placing one of their nine differently-shaped pieces on the beveled game board next to the last piece played.&#10;&#10;The aim is to complete Circles and Stars to score points. Cir*Kis is easy to learn. Each new piece must touch the last piece played. You can get a free turn three different ways. If you get a free turn, you can place your piece touching any other piece. Scoring depends on who completed a shape and who controls the majority of the pieces in it.&#10;&#10;Be the first player to score 40 points to win the game!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Adventure of D",
        "description": " INTRODUCTION &#10;You gather in the main hall inside the Castle of Light. You can see clearly there is a deep sadness in the Great Elder&rsquo;s eyes,&quot; As you already know that Elzoof has put a curse on this island so noone can leave. When you go travel south, somehow you will emerge on the north ! Meanwhile, he send his Minions called the Shadows to hunt any heroes-wannabe&quot;. The very old man takes a deep breath, &quot;He stays in the Tower of Death and challenge anyone who wants to defeat him, or he will claim the throne very soon. With the loss of our great King in the Great War, no one dares to challenge him&quot;.&#10;&ldquo;With chaos and Shadows everywhere it won&rsquo;t be easy. I will give each of you a magical Ring powered with the legendary amulet, the Amulet of D&rsquo;Eugor. This Ring will protect you from lethal wounds, and you can use your power through this Ring to control Events anywhere in this Island.&quot;&#10;The Great Elder pauses for two seconds, then he says, &quot;May God be with you&quot; .&#10;&#10; THE MISSION &#10;Enter the Tower of Death and defeat Elzoof !&#10;&#10;",
        "artist": "T'Say"
    },
    {
        "name": "Thunderstone",
        "description": "For ages the vile Doom Knights have sought to gather the remaining Thunderstones to fulfill a prophecy of corruption over the lands. Now the first Thunderstone has been discovered in the Dungeons of Grimhold and the Doom Knights have sent their minions to claim the relic. The Villagers of Barrowsdale gather brave souls to face the dungeon and keep the Thunderstone out of the hands of the Doom Knights.&#10;&#10;Thunderstone is a fantasy deck-building game much in the style of Dominion. Before the game starts a selection of Village and Hero cards will be randomnly chosen that players may add to their specific decks. Like Dominion, every player starts with a basic deck of weaker cards that they can use to purchase other more powerful cards. In Thunderstone these cards may be different Heroes such as mages, archers, thieves, or warriors or they may be supplies the heroes need like weapons, rations, or light to reach further into the dungeon.&#10;&#10;A dungeon deck is also created by combining several different groups of monsters. Certain groups of monsters may be more or less susceptible to different Hero types, so players will have to take this into account when they choose what to buy.&#10;&#10;Rather than buying puny Victory Points, players will use their deck to defeat monsters in the dungeon. From the monster deck a row of cards is laid out. Players may on their turn choose to attack a monster in the deck rather than visit town and buy cards. If they do this they play cards from their hand and resolve their abilities in order to boost strength and have enough light to reach a specific monster. Some monsters also have special abilities which may hinder the player. If they have enough strength they defeat the monster and place that card in their deck. This card is worth victory points and often can be used as money to purchase other cards. In addition to this, players are awarded experience points for defeating monsters which can be used to upgrade their heroes into more powerful versions. The game is played until the Thunderstone is revealed from the dungeon and a player is able to claim it. The player with the most victory points in their deck is the winner.&#10;&#10;The basic Thunderstone framework was updated in the implementation of Thunderstone: Advance.&#10;&#10;Integrates with&#10;&#10;&#10;    Thunderstone Advance: Towers of Ruin&#10;    Thunderstone: Dragonspire&#10;    Thunderstone: Starter Set&#10;&#10;&#10;",
        "artist": "Jason Engle"
    },
    {
        "name": "Jaipur",
        "description": "Jaipur, capital of Rajasthan. You are one of the two most powerful traders in the city.&#10;&#10;But that's not enough for you, because only the merchant with two Seals of Excellence will have the privilege of being invited to the Maharaja's court.&#10;&#10;You are therefore going to have to do better than your direct competitor by buying, exchanging and selling at better prices, all while keeping an eye on both your camel herds.&#10;&#10;A card game for two seasoned traders!&#10;&#10;When it's your turn, you can either take or sell cards.&#10;&#10;If you take cards, you have to choose between taking all the camels, taking 1 card from the market or swapping 2 to 5 cards between the market and your cards.&#10;&#10;If you sell cards, you get to sell only one type of good per turn, and you get as many chips from that good as you sold cards. The chips' values decrease as the game progresses, so you'd better hurry ! But, on the other hand, you get increasingly high rewards for selling 3, 4, or 5 cards of the same good at a time, so you'd better wait!&#10;&#10;You can't sell camels, but they're paramount for trading and they're also worth a little something at the end of the round, enough sometimes to secure the win, so you have to use them smartly.&#10;&#10;Jaipur is a fast-paced card game, a blend of tactics, risk and luck.&#10;&#10;",
        "artist": "Alexandre Roche"
    },
    {
        "name": "Battle Sheep",
        "description": "In Battle Sheep (first released as Splits), players start the game by constructing the board from identical four-hex tiles, then each player places his/her tall stack of discs on one of the border hexes. Players take turns removing some number of discs from the top of one of their stacks, moving that new stack of discs as far away as it can go in a straight line. Players must leave at least one disc behind when moving, so the board gradually fills up and movement opportunities become more and more scarce. The player occupying the most spaces at the end of the game wins!&#10;&#10;",
        "artist": "Andrea Femerstrand"
    },
    {
        "name": "Imperial 2030",
        "description": "Imperial 2030 is a game on its own, based on the rules of Imperial.  The six powers (USA, Europe, Russia, China, India, and Brazil) develop their industrial basis and build up armies and fleets.  They fight over control of neutral land and sea areas in order to become the most powerful nation worldwide.&#10;&#10;In this game it is not the players who take turns, but the six powers, one after another.  The players are just internationally operating investors who act in the background.  By giving money to the six powers, which all have their own treasuries, the players influence the politics.  The biggest investor in each nation gains control of that nation's government and decides what the nation will do.  As control of a government can change with each new investment, players may control several governments at the same time.  As investors, players should not get too attached to their preferred nation, but rather focus on where their investments have the best rates of return.  Essentially the game is about money, and not about military domination!&#10;&#10;Imperial 2030 was released at Essen 2009 by PD-Games and Rio Grande Games. Compared to &quot;Imperial&quot; there will be some new features:&#10;- new wooden bits&#10;- the Swiss Bank &#10;- a new 30 million bond to invest in&#10;- more neutral territory, generating higher taxation&#10;- fewer home provinces&#10;- control of canals (Panama and Suez).&#10;&#10;For those who already owned Imperial, there was the opportunity to get only the new map and bonds at Essen '09, as it can be played with the old wooden bits as well.&#10;&#10;",
        "artist": "Alexander Jung"
    },
    {
        "name": "The d6 Shooters",
        "description": "The d6 Shooters are a famous Old West posse, and you are their leader. In this solitaire Print-and-Play series, you will lead your posse on several adventures and missions, using a Yahtzee-style dice system to gain resources, movement and perform other important actions.  There is always danger near, and your journeys will be very challenging to complete, but there is also the potential for great reward with untapped gold deposits among the California lands where you travel.&#10;&#10;The first episode, &quot;The d6 Shooters: Long Road to Reno&quot; and the second installment, &quot;The d6 Shooters: Ghost Town Showdown&quot;, are both now available.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Push Fight",
        "description": "The object of Push Fight is to push one of your opponent's game pieces off the board.&#10;&#10;Players take turns placing their five pieces (three with square tops, two with sphere tops) on their half of the board, with white placing first. White then takes the first turn, and players alternate turns after that. A turn consists of 0-2 moves, then a push of one space; a player can move any of their pieces orthogonally &mdash; changing direction if desired &mdash; any number of spaces as long as those spaces are empty. A player can push only with one of their square top pieces, and they push both friendly and opposing pieces one space. After pushing, the player places the red anchor piece on the piece that pushed; this piece cannot be pushed on the opponent's next turn.&#10;&#10;Players continue taking turns until someone pushes an opponent's piece off either end of the board. (The sides are ridged, and pieces cannot be pushed over them.)&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Mindflex",
        "description": "Have you ever dreamed of moving an object with the power of your mind? Mindflex, the new mental acuity game from Mattel, makes that dream a reality. A lightweight headset containing sensors for the forehead and earlobes measures your brainwave activity. When you focus your concentration, a small foam ball will rise on a gentle stream of air. Relax your thoughts and the ball will descend. By using a combination of physical and mental coordination, you must then guide the ball through a customizable obstacle course - the various obstacles can be repositioned into many different configurations.&#10;&#10;&#10;     For ages 8 and up&#10;     Combines advanced technology with the power of thought&#10;     Creates an interactive experience unlike any other&#10;     Players compete in the ultimate mental marathon&#10;     Requires 4 C and 2 AAA batteries &#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Bravery in the Sand",
        "description": "Bravery in the Sand is a two-player game that covers the major part of the battle known as Operation Crusader in North Africa during World War Two. Covering the period from November 20 to December 3, 1941, players assume the roles of the Axis and Commonwealth generals to determine who will be victorious in this battle.&#10;&#10;One player controls the Commonwealth force (British, South African, New Zealand, and Indian), and the other player the Axis force (German and Italian).&#10;&#10;Players activate formations via chit draw, and combat is of the roll-to-hit variety.  Includes rules for battlefield recovery, replacements, fortifications, Rommel and more.&#10;&#10;Part of the International Games Series (IGS) from Multi-Man Publishing&#10;&#10;Originally published in Operations Special Magazine #2 (Summer 2009).&#10;&#10;Game Scale:&#10;Turn: 2 days&#10;Hex: 15 miles / 24 Km&#10;Units: Regiment &amp; Brigade&#10;&#10;Game Inventory (Operations Special Issue #2 edition):&#10;One 17 x 22&quot; full-color mapsheet&#10;One dual-side printed countersheet (176 5/8&quot; counters)&#10;One 8-page rules booklet&#10;&#10;",
        "artist": "Nicolás Eskubi"
    },
    {
        "name": "Chronicle",
        "description": "Box blurb translated from Japanese:&#10;&#10;An irregular trick taking game where various individual abilities of persons forming history are tangled together.&#10;&#10;Who will use their powers to adequately handle the events of the lands? Who will leave their name behind in The Chronicle?&#10;&#10;This is the 2009 release from Kanai Factory.&#10;&#10;Recommended suggestions for beginners from the designer Seiji Kanai:&#10;&#10;&#10;     Play with 3 or 4 players. 5 or 6 players make the game more difficult to control.&#10;&#10;&#10;&#10;     Until you are familiar with all the cards effects, remove the following History cards from the game: &quot;Dark age&quot; (have evil cards), &quot;Coronation&quot; (use three next history cards) and &quot;Meeting with a dragon&quot; (use two previous history cards).&#10;&#10;&#10;&#10;     Use the optional rule &quot;several history cards&quot; and draw 2 history cards per round. Each history card honour rewards is resolved independently.&#10;&#10;&#10;",
        "artist": "Noboru Sugiura"
    },
    {
        "name": "Heroscape Master Set:  Battle for the Underdark",
        "description": "The third Master Set for the HeroScape series of games, which crosses over into the realm of Dungeons and Dragons.  Includes 10 rebased figures from Dungeons & Dragons Miniatures and 55 Heroscape-style terrain pieces.&#10;&#10;From the publisher:&#10;Beware the Jaws of the Dragon&#10;&#10;Evil monsters emerge from the darkest corners of Valhalla, spreading terror as they conquer and control the mystic portals that lead to other worlds. Sinister drow and brutal trolls gather in underground ruins, and rumors of black dragons are too terrifying to ignore.&#10;&#10;The hordes of evil must be stopped. The Valkyrie Generals representing the forces of good have summoned brave adventurers, who together embark on a quest to defeat the black dragons and their wicked allies. Will they prevail or perish?&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Erosion",
        "description": "In Erosion, uplift your mountain by eroding those of other players. At the end of each round, gain  points for cards in your mountain and delta.&#10;&#10;The basic rules introduce the four player actions: Weathering,  Hillslope, Fluvial, and Draw Cards. The advanced rules add details: atmospheric change, ice  ages, glaciers, flood volcanism, quakes, etc.&#10;&#10;Mountains are far more dynamic than the limitations of human  lifetimes would suggest. Their growth and death involve cycles that keep the planet habitable. The machinery of these cycles is called erosion: the weathering of rock and its transport to the sea. Once there, it is subducted into the mantle, where volcanoes return the silicates, sulfates, water, carbon dioxide, and oxygen to the surface.&#10;&#10;Almost every step of the erosion process is catalyzed by water. For instance, in your turn you may weather rock using crystallization (busting rock by growing evaporated salt crystals), then transport the remains to the River using creep (movement propelled by wet/dry and freeze/thaw cycles). Once plunked in the River, the eroded material is moved as sediment to the sea. Braided rivers carry the maximum sediment load, but they are the least stable (and the trickiest to play).&#10;&#10;The role of erosion in atmosphere control is often overlooked. Every mountain is a titanic terraformer and greenhouse gas scrubber. Weathering removes 100 billion tons of oxygen and 800 billion tons of carbon dioxide from the air each year. Although the biological functions of respiration and decay contribute more to the atmosphere than erosion, during many past episodes it was the other way around. Left unchecked, a major orogenic (mountain-building) event removes so much CO2 that the oceans would freeze over in less than an Erosion game turn (6 million years, the same scale as for the game American Megafauna). On the other hand, a major flood volcano such as the Deccan Traps has poured hundreds of trillions of tons of CO2 back into the air,  dwarfing the outputs of all human industry combined.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Difference",
        "description": "Based on the popular &quot;spot the differences&quot; challenges found in books, newspapers and elsewhere, Difference challenges your abilities to observe and react quickly. The deck includes two sets of double-sided cards, with one set being more challenging than the other. Place one card in the center of the table, then deal the rest out to players as evenly as possible.&#10;&#10;To start, each player looks at the top card of her stack, then tries to spot the two differences between her card in hand and the reference card on the table. Whoever spots her particular differences first stops play, demonstrates them to everyone, places her card on top of the reference card (creating a new challenge for everyone), then draws the next card from her deck. Whoever gets rid of all of her cards first wins!&#10;&#10;",
        "artist": "Carine Hinder,Line Paquet,Stéphane Poinsot"
    },
    {
        "name": "Nanuk",
        "description": "Winter is coming. All the hunters boasted of their prowess, but you boasted the loudest. Now you have to deliver . . .&#10;&#10;In Nanuk, each player bids for how long he can stay on the trail and how much he will bring home. Each boast must be greater than the one before, until one hunter refuses to raise the bid, saying &quot;You're doomed!&quot; Then the hunt begins. Will the hunt leader make good on his boast, or will the doomers be right? Every player decides secretly to help . . . or to let it fail.&#10;&#10;Beware Nanuk, the great polar bear, who can end any hunt in failure. If you find an inuksuk, it will protect you &ndash; once. If the hunt is successful, the hunters share the animals collected. But if the hunt fails, the doomers score instead.&#10;&#10;Nanuk is a fast-playing, highly social game of bidding and bluffing for 5 to 8 players.&#10;&#10;",
        "artist": "Alex Fernandez (I)"
    },
    {
        "name": "The Arduous Beginning",
        "description": "When the Germans launched Operation Barbarossa on 22 June 1941, their greatest concentration of troops was found in Army Group Center, tasked with driving eastward toward Moscow. The initial shock of the attack sent the Soviets reeling and Minsk quickly fell to the invaders. However, the Axis timetable demanded complete success during the initial months of the invasion, for only with the Red Army destroyed and Byelorussia occupied could the Soviet Union, fresh from Stalin&rsquo;s purges, collapse; but anything less than total victory would mean a long and protracted war. The stakes could not be higher as the German panzers and infantry engaged Soviet armies and mechanized corps along Russia&rsquo;s western frontier.&#10;&#10;The Arduous Beginning is the first new historical board game in some 15 years from renowned game designer Frank Chadwick. It is a new iteration on his classic Battle for Moscow game system that combines ease of learning and design elegance with the kind of dramatic gameplay that Frank has long been famous for.&#10;&#10;Complexity: 2.5 on a 9 scale&#10;Solitaire Suitability: 8 on a 9 scale&#10;Scale: Each unit is one German corps or Soviet army or corps, and each turn is approximately eight days.&#10;&#10;",
        "artist": "Alan Emrich"
    },
    {
        "name": "Savannah Tails",
        "description": "Welcome to Savannah Tails (Fragor's Essen 2009 release) the game of fast and furious ostrich racing. Play as either Albrecht, Alexandra, Enzo, Nnelg or Mathilda as you race for glory through the African savannah. However, winning the race is the least of your worries.  Cheetahs will try to eat you. Crocodiles will try to eat you. Warthogs will probably try to ignore you. Elephants are just in the way. The less said about porcupines the better.&#10;&#10;The game will include 25 track sections allowing players to once again design their own races. Some of these feature &ldquo;unhelpful&rdquo; animals. Special tracks involving a rope bridge, quicksand and a sand dune are also included.&#10;&#10;A limited edition of 1,000 games will be produced for Essen 2009. The game is fast paced and easy to learn.&#10;&#10;",
        "artist": "Judith Lamont,Annette Nora Kara"
    },
    {
        "name": "Warzoo",
        "description": "Warzoo is a quick-paced card game that can be played as a 1v1 or 2v2 game with a 3-player variant. Borrowing from Lost Cities, Yomi and Battle Line but with special powers twist, Warzoo brings fresh mechanics and a good deal of bluffing in a 30-minute card game with three completely different gameplay modes&#10;&#10;Warzoo is also quite deep on theme: Loosely Based on George's Orwell novel, Animal Farm, Warzoo emulates a fight between the Pigs who ruled over the farm for so many years and the Platypi who is vying for Farm control.All the 26 characters has their own personal history&#10;&#10;With an unusual theme and original artwork, Warzoo's development team tries to bring something fresh to the table!&#10;&#10;",
        "artist": "Daniel Araújo,Marcelo Groo"
    },
    {
        "name": "Bacchus",
        "description": "When the gods throw a party:  The Roman god of wine, Bacchus, has organized three great Bacchanalias to be held in his honor. He has given his satyrs the enviable task of recruiting young nymphs to come to these wild parties.&#10;&#10;These lovely ladies dress very colorfully and love to romp and cavort with the satyrs&hellip; and oh boy, do they love to party!&#10;&#10;As a player, you are one of Bacchus&rsquo; satyrs. Your task is to gather together as many  like-dressed nymphs at the bacchanalias as possible, driving up the point value of these stylish nymphs and scoring as much as possible in the process.&#10;&#10;So party on, you insatiable hoofed ones, all in the name of Bacchus!&#10;&#10;",
        "artist": "Paul Niemeyer"
    },
    {
        "name": "Space Hulk (third edition)",
        "description": "From the depths of space an ancient vessel drifts slowly towards the Imperium of Mankind - a space hulk. Within its confines, untold thousands of Genestealers slowly emerge from hibernation. The Space Marines must enter the cramped corridors and tomb-like chambers of the ancient ship to defeat this alien menace.&#10;&#10;Space Hulk is a board game for two players, recreating the battles fought between the Space Marines and Genestealers. One player commands the Space Marines as they carry out deadly missions in the ancient Space Hulk, and the other commands the horde of Genestealers opposing them. Space Hulk's fast-paced rules simulate the tense atmosphere of a mission deep inside the cramped confines of a derelict space hulk, where split-second decisions are needed for victory.&#10;&#10;",
        "artist": "John Blanche,Alex Boyd,Robin Carey,Paul Dainton,David Gallagher,Neil Hodgson,Nuala Kinrade,Adrian Smith"
    },
    {
        "name": "Skyline 3000",
        "description": "Players represent corporations competing to assemble city buildings in their orbiting plants and install them onto specially-prepared platforms in the city districts. Each player wants to construct the most living space in the blocks that feature the most desirable improvements (Greenspaces, Spaceports, and Megamalls). Players can also erect Billboards at a loss, to entice customers and to reserve space for future construction. At the end of four rounds of play, the player who has earned the most points is the most successful developer and the winner of the game!&#10;&#10;Re-implements:&#10;&#10;    Capitol&#10;&#10;&#10;&#10;&#10;",
        "artist": "Josh Cappel"
    },
    {
        "name": "Lemming Mafia",
        "description": "The third game based on the German web cartoon &quot;Nichtlustig&quot; by Joscha Sauer.&#10;&#10;It features the Mafia Lemming characters from the cartoon.&#10;&#10;From the publisher's website:&#10;&quot;Real lemmings want to jump off the next cliff.&#10;Members of the different lemming mafia families aren't any different.&#10;&#10;Because in the game, there is not only one, but six members of the suicidal species, they make a contest out of it:&#10;They all run to the lake and the first one who jumps in the lake wins.&#10;&#10;And it wouldn't be a real race if you couldn't place bets on the result!&#10;Each player has his favorite lemmings and tries to use the dice results to influence the race.&quot;&#10;&#10;&#10;Game Summary&#10;Each player has 6 cards (1/lemming), and 2 mission cards (bonus VP at end of game). On your turn, roll two dice (sides show one of the lemming colors) then choose to move one of those lemmings (if one is out of the race, move the lemming in last place). Lemmings may move one track section at a time, to any unoccupied space in the next section. The spaces on the race track are one of several types (e.g., give a lemming concrete shoe; 2=dead, remove concrete, allow you to place bets, move a lemming, etc.).&#10;&#10;Betting is interesting: each time, you have the option to bet. To do so, place a lemming card face down on top of your stack of bet cards; goal is to place winner on TOP of your stack (last bet placed).&#10;&#10;The game ends when a lemming reaches the finish; place remaining lemmings in the order they are on the track. Mission cards score bonus VP if completed, or cost VP if failed. Then resolve bets: turn over your cards, then go through them getting 1 VP per card revealed until you get to winning lemming (max 6 VP).&#10;&#10;",
        "artist": "Anke Pohl,Thilo Rick,Joscha Sauer"
    },
    {
        "name": "Scene It? The Simpsons Deluxe Edition",
        "description": "From the publisher:&#10;Scene It? The Simpsons Edition is loaded with clips, trivia questions, and puzzlers featuring all the citizens of Springfield.  Homer, Marge, Bart, Liasa and Maggie are here along with their family, friends, teachers, bosses, tavern owners, convenience store clerks, clowns, sidekicks, pets and neighboreenos!  So make a mad dash to the couch, pop the game disc into your DVD player and stay tuned for an avalanche of trivia!  Test your Simpsons knowledge with real clips as you answer trivia questions and race around the game board to win!  Scene It? The Simpsons Edition is a perfectly cromulent way to embiggen you enjoyment of TV's longest-running comedy!&#10;&#10;Contents:&#10;1 DVD&#10;1 Flextime Game Board&#10;4 Movers&#10;175 Trivia Cards&#10;16 Buzz Cards&#10;4 Category Reference Cards&#10;1 Six-sided Numbered Die&#10;1 Eight-sided Category Die&#10;1 Instruction Sheet&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "duck! duck! SAFARI!",
        "description": "Five games in one - this game uses rubber ducky safari animals, a double-sided board, animal tiles, and some cards.  The game provides rules for:&#10;&#10;Safari Sprint - Pick your ducky and let the races begin!&#10;&#10;Hi-Lo Hijinks - Play a card on the pile - if it's a match, you're good, but if it isn't, you take the whole pile! Every card you take counts against you, unless you have the most. So if you've got to take cards, go for broke!&#10;&#10;Animal Hunt -  An exciting kids game that captures the spirit of the classics &quot;Concentration&quot; and &quot;Go Fish&quot;.&#10;&#10;Savannah - Help the animals spread over the savannah in this puzzling game of matching sets. Find the unplayable spaces to earn a bonus. Once the savannah is full, earn even more points clearing it again!&#10;&#10;Herds - Everybody likes to hang out with their friends. In the animal world, that means making herds! This rummy-style game offers all kinds of twists!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Cyclades",
        "description": "In this latest collaboration between Bruno Cathala and Ludovic Maublanc, players must buy the favor of the gods in their race to be the first player to build two cities in the Ancient Greek island group known as the Cyclades.&#10;&#10;Victory requires respect for all the gods - players cannot afford to sacrifice to only one god, but must pay homage to each of five gods in turn.  Each turn, the players bid for the favors of the gods, as only one player can have the favor of each god per turn - and each player is also limited to the favor of a single god per turn.&#10;&#10;     Ares allows the movement of player armies and the building of Fortresses.&#10;     Poseidon allows players to move their navies and build Ports.&#10;     Zeus allows his followers to hire priests and build temples.&#10;     Athena provides her worshipers with philosophers and universities.&#10;     Apollo increases the income of his worshipers.&#10;&#10;&#10;&#10;&#10;",
        "artist": "Miguel Coimbra"
    },
    {
        "name": "Grand Slam",
        "description": "In Grand Slam, originally titled Love Means Nothing, each player has a deck of 24 cards, each of which depicts two parts of a tennis court: One half-court can be used for defense, returning a ball that comes your way; the other half-court can be used for offense, sending a shot across the net. You never use both halves of the card at once &mdash; either one or the other.&#10;&#10;A turn consists of first playing a card to cover the shot your opponent played, then playing another card to dictate which of the six zones you'll hit the ball to. Finally, you play a preparation card, indicating which zones you're prepared to cover. The preparation card can be used to cover a shot if the appropriate zone is highlighted; otherwise you must cover the shot with a card from your hand, in which case the preparation card becomes the attack. Thus, by playing cards that your opponent cannot cover with her preparation card, you maintain control of the match because you'll see from where the next attack will come and will be able to prepare for that. Of course if a player cannot cover a shot at all, then the point is lost.&#10;&#10;Combinations of cards can create special shots, which if not covered by the corresponding combination of cards, leave a player off balance, with her drawing only one card at the end of the turn instead of the usual two. This will leave her with fewer options and make it less likely that she'll cover your shots.&#10;&#10;",
        "artist": "Ariel Seoane"
    },
    {
        "name": "Murus Gallicus",
        "description": "Murus Gallicus is a two-player breakthrough game in which players try to create impenetrable walls of stone reminiscent of Julius Caesar&rsquo;s Gallic Wars.&#10;&#10;The object of the Murus Gallicus is to reach your opponent's home row or to stalemate your opponent.&#10;&#10;The game is played on a rectangular board consisting of an 8x7 array of cells. Each player starts with a set of 16 tokens referred to as stones; one light set and one dark set. The board is placed between players so that there are seven rows and eight columns. To start the game, each player takes a set of stones and stacks two stones on each of their eight home cells; their nearest row. The Roman player uses the light set and goes first. The Gaul player uses the dark set. Players alternate turns.&#10;&#10;The basic units of the game are towers and walls. A tower consists of two like-colored stones in a cell. A wall is a single stone in a cell. Only towers move. The main function of walls is to block the opponent's movement and secondarily they act as stepping stones which can be used later on to create new towers. Towers move by sowing as in Mancala with a stacking limit of two and only like-colored stones may be stacked. Each of the destination cells must be empty or contain a friendly wall. Tower stones can be used to remove adjacent opponent walls. This is done by sacrifice! Material remains equal throughout the game but slowly erodes for both players as players defuse threats. A player is stalemated if unable to move/sow or sacrifice at the start of his or her turn. Going flat out (stalemating yourself) in order to stalemate your opponent can be very satisfying.&#10;&#10;Murus Gallicus is a game of balance, space and timing. Players must balance defense and offense. By controlling the board's center, a player can gain mobility. Players must wait for the right moment to squeeze through the opponent's defense. The endgame can be very tense thanks to the balance in material.&#10;&#10;There are several useful structures players can employ. The Gallic Wall consisting of orthogonally connected walls (and sometimes towers) requires the opponent to go around the wall or blast his or her way thorough using a sacrificed stone. The Chariot consists of a tower, wall and empty space aligned. By sowing the towers stones in the direction of the wall, the two-celled formation glides forward. The battering ram consists of two towers and an opponent wall aligned. By sacrificing a tower stone, the opponent's wall can be removed. The remaining chariot formation can then move through the breach on the player's next turn. Lastly, a siege tower is a tower sitting within striking distance of the opponent's home row. Such a tower can tie up many of your opponent's pieces.&#10;&#10;The true excitement of the game is in the playing. A sneak attack that squeezes through a breach or a well-timed all out assault can be quite satisfying.&#10;&#10;",
        "artist": "Néstor Romeral Andrés"
    },
    {
        "name": "Luna Llena: Full Moon",
        "description": "Luna Llena (Full Moon) is a semi-cooperative horror-survival game for 2-7 players. There are two sides: Werewolves and Humans.&#10;&#10;The game starts after the Human hikers have spent the night at Aguirre's Forest, and find two of their party missing. The humans must find the Wolves' cave, rescue prisoners and find their way out of the cursed forest in order to win. The lycanthropes are looking to increase their own herd, so their aim is to stop the humans from escaping, and turn some of them into new werewolves.&#10;&#10;",
        "artist": "Juan García González,Adrián López"
    },
    {
        "name": "Bisikle",
        "description": "Bisikle is a flicking game. The players have to compete on a crazy track in order to win a bicycle race. No cards or electrical devices are involved. The whole concept is in the Z-Ball, a marble with a unique internal mechanism. It is very easy to control. Basically, the goal of the game is to flick your way to the finish line as fast as possible. The challenge is to control the effects of the Z-Ball and pass as quickly as possible through all the obstacles (slopes, fences, jumps, mouse holes, etc.).&#10;&#10;Bisikle is the first of many Z-Ball games and was published in 2009 (September) in France and the USA. A track has to be built and looks like the slot-race ones.&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "Clue: The Office",
        "description": "Play as one of six characters from The Office, as their boss Michael Scott forces them to play a real-life game of Clue to determine who killed the HR rep, Toby. Gameplay is similar to standard Clue, with special &quot;intrigue cards&quot; new to the game.&#10;&#10;Intrigue cards come in two varieties: Clocks and Keepers.  They are obtained in one of three ways: rolling a question mark on the included custome dice, landing on a question mark on the board, or if your character is moved to a room as part of someone starting a rumor (equivalent to Clue's &quot;making a suggestion.&quot;)  The first two situations incur a forced draw, while the third is optional.  There are eight clock cards in the intrigue deck, and if you draw the eighth card then you automatically lose.  Keepers give a one-time bonus that allow you to slightly alter some of the game's parameters...risk of drawing a clock; potential reward of benefiting from a keeper.&#10;&#10;Additionally, each of the six characters have a &quot;personality card&quot; which alows for a one-time power.  For example, Dwight's reads: &quot;Once per game, you may move twice.  Roll the dice, move, then roll again.&quot;&#10;&#10;The winner gets &quot;an extra week of vacation&quot; from Michael Scott!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "El Bazar",
        "description": "Simple game in which players are trying to make something that they have on drawn tile (an animal, an object, a thing) using wooden elements. When the opponent guesses what you are building you both score a point. If not, next players is trying to make others to guess.&#10;&#10;Text on the backside of the box:&#10;How can a plane, a watering can or even a doll be presented using wooden shapes? Guaranteed giggles for the whole family...&#10;&#10;Contents:&#10;17 wooden shapes&#10;sand timer&#10;350 tiles with drawings&#10;&#10;",
        "artist": "Max Ducos,Marcin Piwowarski"
    },
    {
        "name": "Atlantis",
        "description": "More than 2,000 years ago Plato told the myth of the splendid city of Atlantis, which was sunk in the sea.&#10;&#10;In this family game the players, by skillful placing of cards and the building of bridges, try to leave the city of Atlantis in order to reach the solid ground with as much treasures as possible.&#10;&#10;The city of Atlantis and the solid ground are interconnected by land tiles. The players receive cards with several drawings, land tiles with those drawings, all pawns of a color as well as a bridge. In your turn you can discard a card with any drawing and go with one of your pawns to the next tile with the same card drawing. At the end of your turn, you can take the tile left behind and put it in your hand as victory points. The player puts a water tile into the gap created and draws a card from the deck the pile. So every turn there are more water tiles and it's harder to overcome the gaps, players can go forward using their bridges or paying victory points with your collected tiles. When all players have saved his three pawns safe ground there are a recount. Who reaches safe ground with most victory points wins.&#10;&#10;Expanded by:&#10;&#10;&#10;     Atlantis - Variante Schiffe&#10;     Atlantis - Ikarus Expansion&#10;&#10;&#10;",
        "artist": "Leo Colovini,Michael Menzel"
    },
    {
        "name": "Maus au Chocolat",
        "description": "Chocolate, nuts, fruits, cream. &#10;Collect ingredients for great sweets and cakes in order to create small delicatessen. But the highest ingredient values do not always ensure you the win. If Maestro Mouse steers in the pots, he gets help from other kitchen aides, which are rather unusual as kitchen personnel: cockroaches , beetles and other insects cavort in the kitchen of the Paris Chocolatiers.&#10;&#10;",
        "artist": "Christian Fiore"
    },
    {
        "name": "Mr. Jack in New York",
        "description": "Stand alone variant of Mr. Jack. As in Mr. Jack, one player takes the role of Mr. Jack, the other takes a role of a Detective. But there are new possibilities - gaslights and manholes are represented by pawns which can be moved.&#10;&#10;The game takes place in Manhattan, and surrounding water is very important for escape of Mr. Jack.&#10;&#10;Characters will have new powers and there will be also a police spy, who will be able to get valuable information.&#10;&#10;This version of the game is more strategic and complex so it is suitable for more advanced players.&#10;&#10;London - 19 November 1888&#10;&#10;As part of the investigation into the &quot;Jack the Ripper&quot; affair, Francis J. Tumblety, a quack doctor, is arrested and freed on bail. He immediately flees to the United States.&#10;&#10;New York - Manhattan Island - January 1889&#10;&#10;Alerted by London, the New York police are on the lookout for Tumblety. Certain witnesses confirm his presence in Manhattan and crimes are committed with a modus operandi similar to those in London.&#10;&#10;The police call upon some of the city&rsquo;s most eminent citizens to help them with their investigation.&#10;&#10;Is Tumblety really Jack?&#10;&#10;If not, who is he pretending to be? These are the stakes in &quot;Mr Jack in New York&quot;.&#10;&#10;Publisher Blurb:&#10;&#10;Suspected of being the terrible Ripper, Francis J. Tumblety, the self-proclaimed doctor, is arrested by the London police service. He then escapes to New-York, where witnesses see him. The local police will not be deceived, as rumors suggest that he is in Manhattan, where the crimes appear strangely like they did in London. The police take no chance and ask the most eminent people of the city to help them in the chase of The Ripper.  You will need to Investigate whether Francis J. Tumblety the real Mr. Jack, or if it is someone else.&#10; Mr. Jack in New-York is a complete game all on its own, however it is recommend for a beginner to play Mr. Jack first. The new version is more complex and requires more strategy.&#10;&#10;Mr. Jack is exclusively published by Hurrican, all printings of Mr. Jack are from Hurrican and distributed by other companies&#10;&#10;",
        "artist": "Pierô"
    },
    {
        "name": "MegaCorps",
        "description": "From the Z-Man Games website:&#10;&#10;&quot;MegaCorps is a game of economic domination. You control a MegaCorp &mdash; one of the six enormous conglomerates that dominate economic and political life in the mid-21st Century. You control industries, manipulate governments like puppets, and even wage war to open new markets. You win by making more money than the other MegaCorps.&#10;&#10;A player chooses industries in countries, hoping for big payouts by having less competition in the industry. But if you own an industry and want to build the same industry in another country you will need to get permission. Of course, you can try to take over the country first then build in there, using the force of countries you own and mercenaries you have or with those you can persuade allies to contribute.&#10;&#10;The type of government a country is can also have an effect on what you buy (or what you keep!). Kleptocracies can steal ownership of your industry. Dictatorships can nationalize an industry to shut you out. Democracies can buy you out.&quot;&#10;&#10;",
        "artist": "Malcolm David Monette"
    },
    {
        "name": "Chaos Marauders (second edition)",
        "description": "Here the players find themselves as Orc War Chieftains on their way to fight those intolerable forces of the Empire. Only problem is that several Orcish clans have run into each other so inevitably they start to squabble over the carcass of some unfortunate Elf that is roasting over a campfire. In the time it takes for the sun to move from up to just a little more up the Orcs are at it and it&rsquo;s each Orcish War Chief for himself.&#10;&#10;Each player is trying to create armies, which are placed into 3 battle lines or formations. Each line must have one musician and one standard bearer and each of these must be placed on the far left or right of each line. Each line can be up to 12 units long but a player can create a shortened battle line by placing the two required units closer together.&#10;&#10;Each turn a player will draw one or more cards from the deck. Units drawn must be placed whilst other cards are discarded for their effects. Once a battle line has a musician and a standard bearer and all spaces in between the two are filled )with units or loot), that line can go to war and attack the battle line of another player. All units are worth a battle rating. Both sides simply add up their ratings for all units and the highest total wins, although the roll of a fate dice can still mix things up.&#10;&#10;The winner can take any loot present from the defeated player's line and this is in truth the main aim as loot is worth points that are tallied up at the end to determine the winner.&#10;&#10;Chaos Marauders also allows for players to try and construct larger units made up of multiple cards such as War Machines.&#10;&#10;See also: Summary of differences from the first edition of Chaos Marauders.&#10;&#10;",
        "artist": "John Blanche,Christophe Madura"
    },
    {
        "name": "Shipyard",
        "description": "We&rsquo;re in 19th century, sea transport is more and more important. Both corporations and naval forces require newer and newer ships. Try to put yourself in the role of their manufacturers. Hire employees, buy accessories, get favour of evaluating committees. Don&rsquo;t forget to rent a canal and you can heave anchor.&#10;&#10;Players take turns, beginning with a randomly selected player and continuing around the table clockwise. On their turn, they will choose one of the available actions from the Action Track. The action will get the player something they need to help build their ships. On the player's next turn, they will move that Action Card ahead of all the others and choose a different action.&#10;&#10;If a player completes a ship on their turn (ships consists of little cards depicting bows, sterns, and (preferably several) middle pieces with several options to add equipment or crew), it is taken out for a shakedown cruise in a canal, during which they may score points for speed, crew, equipment, or safety.&#10;&#10;As players take their turns, the line of Action Cards will advance around the Action Track. When the lead Action Card reaches the Starting Space again, the countdown marker moves down one space, and play continues.&#10;&#10;The game ends when the countdown marker reaches the finish space. (It can also end early if the players run out of Ship Cards.) Bonus points are scored for Government Contracts, and the player with the most points wins.&#10;&#10;The game lasts about 30 minutes per player.&#10;&#10;",
        "artist": "Milan Vavroň"
    },
    {
        "name": "Sneaks & Snitches",
        "description": "In this fast paced game you are the boss of sneaky thieves who are after prestige rather than money. Decide well what category of items you will be after and try to predict what other bosses will do. Send your team to the least expected location. Send your snitch to give police information about competing groups. Let the world know who&rsquo;s number one in your domain!&#10;&#10;Imagine you are the head of a company of thieves. Oh, not a filthy band of cutpurses and pickpockets, but rather an elite cadre of elegant ladies and gentlemen skilled in the art of illegal acquisition. As their criminal mastermind, your job is to coordinate their efforts and gain recognition as the best in the business.&#10;&#10;You decide whether to enter the presitigious and risky field of information theft. You decide how much effort to focus on stealing artifacts and jewelry. And don&rsquo;t forget about gold! Only the top thieves in each category will win the respect and admiration of their peers. Out-guess your competition and foil their plans, while sending your team after items no one expected you to steal.&#10;&#10;Sneaks and Snitches is a fast-paced game of psychological suspense. To win, you will need to be perceptive, clever, and daring.&#10;&#10;",
        "artist": "Milan Vavroň"
    },
    {
        "name": "Macao",
        "description": "At the end of the 17th century, Macao &ndash; the mysterious port city on the southern coast of China &ndash; is a Portuguese trading post in the Far East. The players take on the role of energetic and daring adventurers. Many exciting tasks and challenges await the players, whether they are a captain, governor, craftsman, or scholar. Those who chose the wisest course of action and have the best overall strategy will earn the most prestige at the end.&#10;&#10;Macao lasts twelve rounds, and in each round players select one new card from a display specific to that round, two of which were revealed at the start of the game and others that were revealed only at the start of the round. The deck of 96 cards includes all sorts of special abilities, with the more powerful actions costing more resources to put into play.&#10;&#10;One player rolls six different-colored dice, then each player selects two of those dice (possibly the same ones chosen by opponents), then places cubes equal to the number and color of the two dice on a personalized &quot;ship's wheel.&quot; For example, if a player chooses the blue die that shows a 5, he places five blue cubes on the ship's wheel position five spots away from the current round. (A player can never claim more cubes than the number of remaining rounds).&#10;&#10;Players rotate their ship's wheels each round, then use the cubes available to them in that round to perform various actions: activating cards selected in that round or earlier rounds, buying city quarters and collecting the goods located there, moving that player's ship around Europe to deliver those goods, acquiring gold coins, taking special actions with card previously activated, and advancing on a turn order track.&#10;&#10;Players score points by delivering goods, paying gold coins, using the powers on their cards, and building in Macao. Whoever has the most points at the end of twelve rounds wins.&#10;&#10;Macao is number 13 in the alea big box series, with an estimated difficulty on the alea scale of 6/10.&#10;&#10;",
        "artist": "Julien Delval,Harald Lieske"
    },
    {
        "name": "Panzer General: Allied Assault",
        "description": "Panzer General: Allied Assault is a quick playing game of WWII tactical / operational combat using a unique blend of cards and a board game. The game takes place during the last phase of World War II, from 1944 to 1945. The dramatic events of D-Day finally gave the Allies a foothold on Fortress Europe, allowing them to push the Germans back to Berlin.&#10;&#10;Recreate actual battles such as Utah Beach, Operation Market Garden, and the infamous Battle of the Bulge in the hopes of turning back the German tide. Build, customize and fight with your personalized deck of 60 cards.&#10;&#10;Over 12 solo and two-player scenarios depicting combat situations between the German and American forces in such battles as D-Day, Bulge, Market-Garden, Metz, and many others.&#10;&#10;Based on the Xbox LIVE&reg; Arcade game published by UBISOFT.&#10;&#10;Panzer General: Russian Assault is a sequel to Allied Assault and is available now.&#10;&#10;Microbadges&#10; Panzer General Allied Assault Fan&#10; Panzer General Allied Assault Fan&#10;&#10;",
        "artist": "Gary Cox"
    },
    {
        "name": "Kingdom Death: Monster",
        "description": "Kingdom Death: Monster is a fully cooperative tabletop hobby game experience.  Set in a unique nightmarish world devoid of most natural resources, you control a settlement at the dawn of its existence. Fight monsters, craft weapons and gear, and develop your settlement to ensure your survival from generation to generation.&#10;&#10;Campaign System&#10;Embark alone or with up to 3 friends (5 with game variant) on a 5-30-lantern-year campaign, with each year consisting of a cycle of hunt, showdown, and settlement phases. The settlement phase is an intricate civilization building game in which you spend very limited resources to build buildings, research new technologies, train your warriors, and set up your strategy for survival.  During the hunt, you'll encounter a series of stories in a &quot;choose your own adventure&quot; style journey through various events and encounters.  Finally, when you meet the monster you're pursuing, you'll engage it in an a massive arena-style battle where only one party is going to survive.  If your party lives, you'll be able to bring the spoils back home to use in expanding your settlement.&#10;&#10;Monster AI System&#10;Each of the 7 monsters included are controlled by their own pair of decks that scale to 3 levels of difficulty (except for the final encounter, which has only 1 level and it's HARD!). Every encounter, even with the same monster, is highly variable and no two showdowns will resolve the same way. Players will have to plan their gear and keep their minds sharp to prevail.&#10;&#10;Gear System&#10;In Kingdom Death: Monster, survivors will craft gear from resources earned from defeating monsters or found on their hunt. Each survivor has a 3x3 gear grid. Selection and arrangement of your gear cards is critical, as many provided bonuses and activate special rules when aligned correctly.&#10;&#10;Story Event System&#10;40+ Story Events plus over 100 hunt encounters will shape and guide your campaign. Story Events detail important evolutions in your civilization, introduce new monsters, and provide rich detail for your campaign.  Some will trigger automatically as you progress through the campaign, but most will be entirely based on choices players make.&#10;&#10;Story Events cover everything from setting up and fighting a monster to key events that happen within the overall story. Some are triggered directly from the timeline and others from choices you make in game.&#10;&#10;",
        "artist": "Lokman Lam,Lorinda Tomko"
    },
    {
        "name": "Power Struggle",
        "description": "This description was originally based on a review from BoardgameNews.com.&#10;&#10;In this corporation-themed game, players compete to be the first to acquire four out of six possible victory points. You earn a point by reaching certain numbers along tracks, such as at least 7 on the influence track or 8 on the majority track. You also may earn a point by beating your secretly assigned archenemy on three specified tracks.&#10;&#10;The game lasts a number of rounds, with each round consisting of a directors' meeting, followed by 4-7 turns. At the meeting, the &quot;company chairman&quot; is replaced (the next token in line moves up) and the &quot;division heads&quot; are named (by seeing who has the majority in each column of placed cubes). Chairmen and heads get salary bonuses and a card detailing a single advantage for the cardholder.&#10;&#10;The player who's the &quot;communications&quot; head then secretly looks at the Event cards and determines in which order they will be played (and so how many turns will be in the current round). Other heads' cards will let them pay less for stocks, for example, or place or remove bits.&#10;&#10;After each event card is revealed, players select one action to perform, such as &quot;hiring and relocating employees&quot; (placing or moving cubes), resigning as a department head, using an advantage card, or bribing players for their advantage cards. These actions result in points on the scoring tracks and sometimes money (which is only used for bribery and buying blocks of stock). A bribed card has more power than an earned one, giving incentive to accept bribes (the card is less useful or even useless to the original owner, depending on the workers' happiness scale). In addition to bribery getting you a power you want, it also moves you up the corruption track. A player who rejects a bribe, however, loses one cube on the majority columns.&#10;&#10;It's not a business simulation, and gameplay isn't as dastardly as the theme implies. The event cards provide most of the humor. (The card may read that you have failed to fix the breakroom game table, or vacations were canceled, so worker satisfaction goes down, which is what you want). The feel of rising through the ranks (getting more points) is there, and there are many things to attempt to excel in, by doing various business-related (at least in name) actions. Efficient manipulating of your opportunities will win you victory points and, if you gain four, the game.&#10;&#10;Awards: &#10;Machtspiele (Power $truggle) is derived from &quot;Die Firma&quot;, which won a special prize in the 2009 Hippodice game design competition for best full-length game.&#10;&#10;",
        "artist": "Fréderic Bertrand,Lars-Arne \"Maura\" Kalusky"
    },
    {
        "name": "Callisto: The Game",
        "description": "Callisto&rsquo;s brilliant design, including a board that changes surface according to the number of players present, is among one of the features that make this game so unique. While the goal is simple&ndash;to be the first player to place all of his/her tiles onto the board-the shapes of the tiles and additional columns make winning quite tricky. The game plays out like a competitive puzzle, and finesse and cunning are required to triumph.&#10;&#10;",
        "artist": "Antonio Catalán,Craig Jordan,Michaela Kienle"
    },
    {
        "name": "Ren Faire",
        "description": "You and your friends are newbies at the Renaissance faire. Food, music, mock combat ... it sounded like some kind of off-beat rock concert! Problem is, you stick out like a sore thumb. In a crowd of buccaneer hats and faerie wings, you're the only ones in shorts and t-shirts. Now you and your friends have one afternoon to assemble the ultimate Renaissance costume, but you're low on cash and the only way to earn more is to perform for the crowd!&#10;&#10;In Ren Faire, your goal is to outfit your character with costumes whose icons fill the slots on it. To do this, you play performance cards that award you coins for doing silly stunts, then buy the transparent costume cards that stack above your character card.&#10;&#10;Ren Faire &ndash; a light-hearted card game for 2 to 4 players, ages 13 and up &ndash; features an innovative transparent card design, and performance cards that are sure to keep everyone enjoying the game.&#10;&#10;",
        "artist": "Christiansen : Creative,Wendy Wyman"
    },
    {
        "name": "Anno Domini: Europa",
        "description": "Anno Domini is a trivia game that focuses on estimation/guessing and bluffing more than on outright knowledge.&#10;&#10;Players get a number of cards with historical events (most often very obscure ones) and have to arrange them chronologically on the table by playing one card per turn.&#10;&#10;If a player thinks there is an error in the sequence of events, he or she can express this doubt instead of playing a card of his own. Depending on the outcome of the subsequent check, either the doubter or the player who put down the previous card is &quot;punished&quot; with additional hand cards.&#10;The goal of the game is to get rid of your hand cards as soon as possible.&#10;&#10;There are quite a few games in the Anno Domini series, each dealing with a different topic ranging from &quot;Inventions&quot; over &quot;Art&quot; or &quot;Coins&quot; to different geographic regions (e.g. Germany, America or now Europe). Even a SdJ edition exists!&#10;&#10;Each game consists of 336 cards and can be played stand-alone or mixed together with some or all of the other editions.&#10;&#10;",
        "artist": "Res Brandenberger"
    },
    {
        "name": "Mister X",
        "description": "He could escape the Scotland Yard detectives in London, but this time the whole of Europe is on his heels. Will he be able to evade them this time, too?&#10;&#10;Mister X is a modernized version of Ravensburger's classic Scotland Yard which transfers the manhunt from London to the continent.&#10;&#10;Mr. X can play new tricks but also the detectives have new actions at their disposal. and this time they know where he is heading!&#10;&#10;Announced for Essen 2009.&#10;&#10;Content Break down:&#10;&#10;1 game board&#10;1 ticket board&#10;1 ticket bag&#10;6 Pieces&#10;6 Ticket racks&#10;120 Tickets&#10;15 start cards&#10;5 color markers&#10;10 position rings&#10;22 investigation chips&#10;1 checklist&#10;1 visor for Mister X&#10;1 tracker for Mister X&#10;&#10;Re-implements:&#10;&#10;    Scotland Yard&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Warriors of Japan",
        "description": "(from MMP website:)&#10;&#10;After the enormous critical and sales success of Warriors of God, MMP is proud to present the grandfather of Warriors of God, Nakajima&rsquo;s masterpiece, Warriors of Japan.&#10;&#10;Long considered one of the greatest games to ever be published in Japan, Warriors of Japan will feature much of the same system as we have seen in Warriors of God. The game covers the Nanboku-cho period of Japanese history and simulates one of the most dynamic and important periods in Japanese history.&#10;&#10;From 1336-1392, all of Japan was aflame with war. After the fall of a corrupt and ineffective emperor, the two great courts of Japan dueled to determine the future ruler of the country. Warriors of Japan covers the vital period following the destruction of the Kamakura shogunate and the fight to find a successor.&#10;&#10;Players of Warriors of God will find much familiar here, however, unlike the enormous time period covered in Warriors of God, Warriors of Japan covers only 4 years. Subtle changes in the system to cover this unique period have been exchanged in Warriors of Japan. For example, Leaders no longer die from old age but rather can switch sides unexpectedly during a combat. Subtle changes in the movement and combat rules will add to the strategy to a greater extent than in Warriors of God. A random game start generator will keep each game fresh and interesting. Warriors of Japan also brings us home to our wargaming roots. To learn and discover some new period of history that we didn&rsquo;t know about before in much the same way we discovered history through our wonderful hobby in our youth.&#10;&#10;Warriors of Japan Components:&#10;&#10;     One 34&rdquo; by 22&rdquo; map (sneak peek!)&#10;     140 1&rdquo; counters (take a look!)&#10;     16 page full color rulebook&#10;&#10;&#10;&#10;&#10;Game Details:&#10;&#10;      Solitaire Rating: Excellent&#10;      Complexity: Easy&#10;      Playing Time: 4-10 hours&#10;      Scenarios: 1&#10;&#10;&#10;&#10;&#10;",
        "artist": "Nicolás Eskubi"
    },
    {
        "name": "Santa Timea",
        "description": "Santa Timea is a card game that consists of steering cards and ship cards. There are 5 ship cards for each wind direction (north, east, south, west) with the values 3, 2, 2, 1, 1. Each game is played for 12 rounds and in every round one ship card can be 'won' by playing steering cards: Steering cards of the same wind direction as the current ship card count with their full value of points, cards with a wind direction perpendicular to that on the current ship card count with half their value and cards of the opposite wind direction count as zero points. The player who played the lowest point value gets the ship card. After 12 rounds, the player with the LEAST total of points on his collected ship cards scores the most victory points (depending on the number of players). There are, however, several possibilities to score extra victory points for certain combinations of ship cards. Thus, collecting ship cards may also be a good thing if a player can obtain the right combinations.&#10;&#10;",
        "artist": "Dennis Lohausen"
    },
    {
        "name": "Mees, kes teadis ussisõnu",
        "description": "Adventure game &quot;The man who knew snakewords&quot; are on a very hazy border of card games and board games. The game has 25 landscape cards, which create the game of risks and challenges full playground. 5 dice covered with mysterious runes, 5 pawns with hats and 39 well illustrated cards with familiar friends and enemies from the book of the same name. The game is suitable for 2-5 players aged 9-99 years.&#10;&#10;The rules are easy. You will learn the game with a few moves and the game lasts only about an hour. Game board is made by the cards and therefore is always different every game. Can be that after first game you start another one more faster and more harder game. All blind faith will be beaten in this game - is it a local madness or divine cult. And the winner, like in life, is the one who is the smartest. And if you're lucky, then you too:D&#10;It is an adventure game through time and different cultures. Might be addictive.&#10;&#10;",
        "artist": "Asko Künnap"
    },
    {
        "name": "Axis & Allies Pacific 1940",
        "description": "Axis &amp; Allies celebrates 25 years of strategy war gaming with a deluxe edition of its original theater-level game. Axis &amp; Allies Pacific 1940, designed and developed by Larry Harris, utilizes the updated rules established in A&amp;A Anniversary Edition. Two new combat units debut in this game, Tactical Bombers and Mechanized Infantry. Australia and New Zealand, joined together as the ANZAC forces, represent a new playable ally. China fields more forces than ever before, but will need help from their allies -- the United States and England -- to withstand the might of expansionist Imperial Japan.&#10;&#10;Axis &amp; Allies Pacific 1940 features an oversized board that measures 35 inches wide by 32 inches high (89 x 81 cm). With over 450 pieces, deluxe game components and local storage boxes, this game raises the standard established by A&amp;A Anniversary Edition. All new rules for neutral nations, naval &amp; air bases, kamikaze attacks and convoy disruption add even more depth and historical accuracy to this giant game.&#10;&#10;Finally, this deluxe theater-level game is designed to join together with Axis & Allies Europe 1940 to create the greatest Axis &amp; Allies experience to date! When joined, these boards will measure 5 feet wide by 32 inches high (178 x 81 cm). Both games have been designed to play alone or together to offer a 2-6 player global 1940 scenario, complete with separate set up and national objectives.&#10;&#10;Integrates with:&#10;&#10;    Axis & Allies Europe 1940&#10;&#10;&#10;&#10;&#10;",
        "artist": "Blake Beasley"
    },
    {
        "name": "Tarantel Tango",
        "description": "Another fast paced card-game by Jacques Zeimet in the vein of Kakerlakensalat und Kakerlakensuppe (also by 3 Magier Spiele).&#10;&#10;The game consists of 120 animal cards (dog, cow, donkey, goat, cat as well as parrot and 5 special tarantula cards).&#10;&#10;Each player gets his share of cards and forms his own face- down stack. The goal of the game is to get rid of one's cards as fast as possible. To do so, cards are placed clockwise around a five-sided Tarantula tile in the middle of the table.&#10;&#10;Before turning over the top card from his stack, a player might have to imitate the animal on the previous player's card (by saying &quot;wuff&quot;, &quot;eee-ah&quot; etc.). This depends on some features of this previous card: If it shows one or two spiders the player has to &quot;imitate&quot; once or twice, else he has to remain silent. &#10;Then he may put his top card down in the next slot clockwise around the Tarantula tile, except when there are two animals on the previous card. Then the new card goes in the next but one slot ...  All in a time limit of 2 seconds max.&#10;And finally, if the new card is a Tarantula, all players have to smack their hand down on the table (to &quot;chase it off&quot;).&#10;&#10;If anyone makes a mistake or is too slow, he has to take all cards on the table into his own stack and a new round begins.&#10;&#10;Several additional expert rules make it even more complicated to get rid of the cards and provoke more mistakes, e.g. cards have to be placed on previous donkeys as these are to stubborn to move on or curious dogs change the direction of placing cards (clockwise to counter-clockwise and vice versa).&#10;&#10;Announced for Essen 2009.&#10;&#10;",
        "artist": "Rolf Vogt"
    },
    {
        "name": "Mosaix",
        "description": "This game combines elements from Take it easy! and W&uuml;rfel-Bingo.&#10;&#10;Each turn one of the players rolls 4 symbol dice with the 3 symbols circle (O), triangle (A) and cross (X) on their faces. &#10;Then he arranges these dice in a specific sequence.&#10;&#10;All players transcribe this very sequence into their personal 7x7 grid on their player mat with erasable crayons. &#10;In doing so, they try to create the most and the largest cohesive areas of matching symbols to maximize their final scoring.&#10;&#10;Published September 2009.&#10;&#10;",
        "artist": "Christof Tisch"
    },
    {
        "name": "Ligretto Dice",
        "description": "The game transfers Ligretto's idea of simultaneous play to a simple dice game.&#10;&#10;W&uuml;rfel-Ligretto consists of 24 dice in for colors (6 each in red, yellow, green and blue), 4 dice cups, a cloth bag and a game board to place the dice on (with a columns in each colour and rows numbered from 1 to 6).&#10;&#10;At the beginning of each round, the players draw an equal number of dice from the cloth bag depending on the number of players.&#10;&#10;Then they roll their dice simultaneously and try to place their dice on the placement board as fast as possible. Of course, dice may only be placed in the column of the corresponding color and they have to be placed in ascending order (e.g. the 3 may only be placed when the 1 and 2 are already in place). At any time, a player may reroll ALL his unplaced dice.&#10;&#10;As soon as one player gets rid of all his dice, play stops. For each of his unplaced dice, each player gets minus one point. In addition, the player who finished first positively scores the sum of all unplaced dice. The game is played in several rounds.&#10;&#10;",
        "artist": "Design Edge"
    },
    {
        "name": "Schwarzes Gold",
        "description": "Schwarzes Gold is a short tactical game about the first oil rush in Texas.&#10;&#10;1901: Welcome to Spindletop Hill, birthplace of the modern oil industry. The first sources of oil already have been found and all adventures head for Texas to find their fortune. However, the sources are limited. Who will find the right places to set up their oil rigs and produce the most oil?&#10;&#10;In the basic game players roll dice to determine a position on the game board where they can then place either one of their own drilling rigs or a neutral oil marker. In phase 2 players decide in which order the drilling rigs score points for adjacent oil markers (which are removed from the board after scoring). The player with the most points wins the game.&#10;&#10;The game will include at least two variants (and a second game board) to add more complexity. In addition, several fan rules will be published on the homepage www.schwarzesgold.com&#10;&#10;Schwarzes Gold is the winning title of the author's game competition 2008/2009 by www.spielmaterial.de. The task of the competition was to create a new game based on the game pieces of Giganten after those were bought in large quantities by www.spielmaterial.de (an online shop for game components).&#10;&#10;",
        "artist": "Harald Lieske"
    },
    {
        "name": "Namibia",
        "description": "In Namibia, players represent mining corporations who are looking to mine commodities - diamonds, gold, silver and copper - and attempt to transport them to ports to sell at the highest possible price. In order to achieve their aims, players have to bribe (via an auction) colonial government officials who control access to the interior and to the ports.&#10;&#10;1884: First sources of various commodities have been discovered: gold, silver, copper and diamonds as well. The colonial government has issued concessions to enterprises which shall build up the necessary infrastructure to deliver the commodities and transport them to the coast. Who will place their rigs in the right place? Who will be able to sell the commodities for the highest price? The game board shows a map of Namibia with a hex grid. This is the second game of the &ldquo;Edition Bohrt&uuml;rme&rdquo; (after &lsquo;Schwarzes Gold&rsquo;) that uses the game pieces of 'Giganten&rsquo; (Kosmos). It is the winning titles in the categorie &ldquo;more complex games&rdquo;.&#10;&#10;Access to the interior allows a player to develop the country&rsquo;s rail infrastructure which is required to move commodities to ports in order to sell and make money. And money buys reputation, which gets more expensive to acquire as the game goes on. Players also need to construct and complete their mines and prospect for ore.&#10;&#10;However, too much bribery leads to a decrease in reputation which affects a player&rsquo;s position at the end of the game, but limited access to the transport and shipping infrastructure will seriously impact a player&rsquo;s ability to make money.&#10;&#10;Selecting the right time to ship and sell is the key, because the market can be manipulated by other players. The winner will be the player who can make loads of money while keeping a good market reputation. The player with the highest reputation wins.&#10;&#10;This is the second game of the &quot;Edition Bohrt&uuml;rme&quot; (after 'Schwarzes Gold') that uses the game pieces of 'Giganten' (Kosmos). It is the winning titles in the categorie &quot;more complex games&quot;.&#10;&#10;",
        "artist": "Carsten Fuhrmann"
    },
    {
        "name": "The Three Musketeers: The Queen's Pendants",
        "description": "The players take the role of the musketeers and move trough the castle to find the queen and return her the jewels.&#10;One player takes up the role of Richelieu and the guards. It's his task to find which musketeer is carrying the jewels and defeat him.&#10;&#10;Cooperative: one against all, all against one.&#10;&#10;",
        "artist": "Christophe Madura,Julien Marty"
    },
    {
        "name": "Koplopers & Dwarsliggers",
        "description": "Koplopers en Dwarsliggers&#10;&#10;The game Koplopers en Dwarsliggers puts the players in charge of their own railway company. These companies may use all railway tracks in the Netherlands. Their only goal is to transport as many passengers as possible to their intended destinations. For these passengers the journey from Rotterdam to Amsterdam may well go via Eindhoven.&#10;&#10;Sometimes there is a sudden change of direction when the train has picked up more passengers, and a majority of those want to go to another part of the country. At other times trains may well skip stations when no passengers need to be there. And when a train does call at a station the passengers enter quickly hoping that they will arrive at their destination today. Is your train the one to be in? How many times they must change trains in order to arrive at their destination? Or will they not make it at all, because of those annoying obstructions?&#10;&#10;Introduction to the game&#10;In Koplopers en Dwarsliggers every player may construct up to three trains and each of those trains can transport up to 500 passengers. During the game you pick up passengers at stations and put their tokens at your train organizer card in the corresponding box. And then you try to transport your passengers to their destinations, after which you collect their tokens in your tray. Each turn you may spend five action points that you can use for constructing or scrapping trains, but you may also combine trains, split them up again, or reverse them. You can pick up passengers, transport them or have them change trains, and finally you can play obstruction cards or perform an emergency repair. The player who has brought the highest number of passengers to their destination wins the game.&#10;&#10;Some interesting facts&#10;&#10;        Koploper is a Dutch train type (see game box), but it also means &lsquo;front runner&rsquo;. The railway meaning of dwarsligger is sleeper, but it also is Dutch for an obstructive person;&#10;        The game board is based on the actual railway lay-out in the Netherlands;&#10;        The abbreviations used to denote stations are the official abbreviations used by the Dutch railway companies;&#10;        The designer of the game works for Nederlandse Spoorwegen, the main passenger railway company in the Netherlands.&#10;&#10;&#10;&#10;&#10;",
        "artist": "WhisperTalkAndScream"
    },
    {
        "name": "Albion",
        "description": "Being almost at the top of its power, the Roman Empire plans to conquer the British Isles, also known as Albion in those times.&#10;&#10;To be successful in the game, the players have to cleverly choose their settlements, castles and fortifications as well as carefully plan the development of these. They have to balance the different resources, their defence and the number of nobles and legionnaires. In fact, all of those are necessary, but the different choices have to be carefully timed.&#10;&#10;The game is won by the player who accomplishes to fully develop three settlements.&#10;&#10;Announced for Essen 2009.&#10;&#10;",
        "artist": "Dennis Lohausen"
    },
    {
        "name": "Greed Incorporated",
        "description": "&quot;Twenty million, twenty-one million, twenty-two million... hey! Where&rsquo;s the rest of my bonus?&quot; The CEO&rsquo;s voice does not match his elegant, tailor-made suit. &quot;But sir...&quot; the accountant protests, &quot;you have bankrupted this company. Your employees have lost their pensions. Surely you can...&quot; &quot;Stop whining,&quot; the CEO interrupts him. &quot;Clearly you don&rsquo;t understand business at all. How am I supposed to pay for adequate transportation if I do not get my bonus? Make sure you transfer the money, today!&quot; He slams the door of his white limousine and drives off, heading for a new challenge.&#10;&#10;Greed, Incorporated is a game of corporate malversations and greedy executives. You run one or more companies and make their accounting books look as good as possible using every trick that good old honest businessmen ever invented. And some more. Just make sure to leave the company, cashing your exit bonus, before the company crashes and the credit crunch commences.&#10;&#10;Contents:&#10;Rulebook&#10;Mounted game board&#10;17 Black wooden cubes to keep track of prices&#10;11 Yellow wooden cubes to keep track of price trends&#10;6 Red wooden boot markers&#10;10 Black wooden dollar signs&#10;1 Green wooden dollar starting player token&#10;5 Player aids&#10;5 Sets of 12 player manager tokens each&#10;10 Company placards&#10;10 Company cards&#10;40 Asset cards&#10;18 Status symbol cards - 9 each in gold and silver&#10;99 Goods cards, depicting 11 different goods&#10;1 pile of playing money&#10;&#10;",
        "artist": "Ynze Moedt"
    },
    {
        "name": "Dice of the Living Dead",
        "description": "Dice of the Living Dead is a solo dice game that&rsquo;s free to print and play. All you&rsquo;ll need is a print of the game sheet, a pencil, and at least 8 normal dice.&#10;&#10;The story&#10;Zombies have overrun your hometown. You&rsquo;ve grouped up with other survivors, and you now have to make your way to the outskirts of town and escape the undead menace. On your way you have to fight zombies, search for survivors, and dole out your limited supplies.&#10;&#10;Every turn you roll dice trying to find the right balance between moving fast and still having time to fend off zeds. But just as every roll of the dice can help you, it also holds certain risks.&#10;&#10;",
        "artist": "Rob Robinson"
    },
    {
        "name": "Zombiaki II: Attack on Moscow",
        "description": "Polish card game for two players. One of the players is the Zombies, the second one - humans. Objective of the Zombies is to eat the people, but people want to save their own lives, which is possible if they survive until the sunrise. Game with humor and strategy.&#10;&#10;Re-implements:&#10;&#10;    Zombiaki&#10;&#10;&#10;&#10;&#10;",
        "artist": "Anna Helena Szymborska,Michał J. Zieliński"
    },
    {
        "name": "Bezzerwizzer +",
        "description": "Bezzerwizzer+ is a new standalone version of the popular Danish quiz game Bezzerwizzer. The game is, however, different due to some additional features. It adds 2400 questions, a xylophone for playing and guessing melodies, and cards for guessing images and shapes.&#10;&#10;The questions are grouped into 16 different topics, and the teams draw tiles from a bag to decide which topics they must answer. Teams must answer one question in each of the categories drawn. Correct answers are valued 1, 2, 3 or 4 points,&#10;depending on the order in which they are answered. The teams determine for themselves in which order the questions are asked. Opponents can by playing a limited number of special tiles, reorder, steal topics or being a Bezzerwizzer ('know-it-alls') by answering other participants' questions (before the question is being read or after the team can not answer).&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Coral Sea: Campaign Commander Volume II",
        "description": "Campaign Commander Volume II: Coral Sea&#10;&#10;Coral Sea is a new volume in the Campaign Commander series and simulates the campaign in the South Seas of the Pacific between the spring of 1942 and the spring of 1943. The Japanese expansion reaches its limit in the archipelago of the Solomon Islands and New Guinea. The Japanese initial force, the Army of the South Seas, began to expand reducing the boundaries of the Australian defenses from its base in Rabaul, the logistic center of Japanese control in the zone.&#10;The naval-air battle of the Coral Sea was a hard blow for the Japanese force since the Soho, their light aircraft carrier, was sunk, and the amphibious invasion force destined to take Port Moresby had to return to Rabaul without fulfilling their mission. Afterwards the imperial forces tried to take Port Moresby by a ground assault, extending their way along the Solomon Islands creating air bases and observation stations throughout the archipelago.&#10;The Japanese forces were thus threatening naval communications between the United States and Australia.  In response, the Allies reinforced Australia and the New Caledonia zone looking for an opportunity to counterattack and to stop the imperial tide extending through the region. The return to Australia of veteran units from the Middle East allowed the Allies to initiate an offensive in Papua/New Guinea that would last six bloody months and result in the Allied recovery of the enclaves of Buna and Gona on the North coast of New Guinea.&#10;&#10;In the Solomon Islands the North American counterattack began August 8th, 1942 and led to a lasting and bloody campaign through February 1943, with successive attacks and counterattacks of both sides resulting in Guadalcanal Island back in American hands. In addition to the ground forces, the region saw much use of air and naval operations.  Both navies accomplished herculean tasks to support their respective ground forces and supply them.  Their importance was noticeable, so air attacks on navies were numerous, and expensive in lives, planes and ships.  The last of them in this period was the battle of the Sea of Bismarck, which resulted in Allied air supremacy in the region.&#10;The Japanese Imperial navy based on the island of Truk made several raids in the region to support the small naval forces in the South Seas. But eventually the Japanese had to yield the initiative to the allies in the region as they exhausted their resources, fighting on two fronts.  The Allies exhausted the Japanese offensive, and they prepare to take their own offensive.&#10;&#10;The game is developed in an operational scale &ndash; area-based map with a scale 1:300,000.  It is designed for two players with one running the JAPANESE forces and the other the ALLIED forces. The game lasts approximately 3-4 hours and uses a two sided system to handle the mechanics of play: cards and counters.  The players will have to use their troops and their resources to obtain victory points while eliminating enemy forces and occupying cities in the map. It is not a card driven game as the cards are used to bring about events that influence battles, secure reinforcements, and provide resources with which to carry on the fight.&#10;&#10;In the beginning of the game the JAPANESE player will take the Initiative and will have to expand throughout the map to secure Victory Points. The ALLIED player is on the defensive, and will have to strength his forces as the game progresses. He will have to take advantage of every opportunity to inflict damage on the advancing Japanese forces.  The island of Guadalcanal will be crucial as the game develops, as are the results of actions in Papua/New Guinea.   &#10;The JAPANESE player must face the historical dilemma of concentrating on taking the Solomon Islands, Papua or both simultaneously.  The ALLIED player will have to be patient and force his opponent to extend himself, by accumulating forces and to committing lethal offensives that put the forces of the Empire of the Rising Sun in check. &#10;Like all the games of this Series, the rules are simple and straight forward.  Our objective was to create games that are very interactive, and offer players a pleasant creative experience.  We aim for solid games for players who do not have the time or the space to leave a game setup and in place over a long period of play.&#10;&#10;",
        "artist": "José Ramón Faura,Carmen J. Palma"
    }
]