[
    {
        "name": "Battle of Britain",
        "description": "Hitler's war machine has rolled like a juggernaut across the Continent, crushing all opposition. Only Britain still stands, isolated and defiant, readying itself for a mortal struggle between the Luftwaffe and the Royal Air Force. For the first time in history, air power will decide the fate of a nation.&#10;&#10;August 1940: The Royal Air Force has been awaiting massive German air raids since Churchill refused to make peace with Germany. And they did not have to wait long - in fact, far too short to build up the RAF to a strength that would be able to match the German Luftwaffe. But besides its fighters, the RAF has other weapons to help deal with the &quot;Huns&quot;: a chain of RDF (radar) towers along the British coast, and an elaborate system of communications, signal evaluation and fighter control and guidance. If those are used skilfully, the resulting economy of Fighter Command operations might just be able to offset the sheer power of the German Luftflotten (&quot;air fleets&quot;).&#10;&#10;You are in command of all four RAF Fighter Groups to match them against the incoming raids. Can you deny the Luftwaffe its objective to weaken the British air defence system beyond the breaking point?&#10;&#10;",
        "artist": "Sarah Feggestad,Dennis Kauth"
    },
    {
        "name": "Hedbanz: Identity Crisis Game",
        "description": "It&rsquo;s Hedbanz for adults. The quick question game of &ldquo;what am I?&rdquo; that leaves everyone guessing. Ask questions to figure out if the card on your head is a person, place or object. But be smart, after all it&rsquo;s Hedbanz for adults. Are you a famous person in history? Maybe an object found in the kitchen? In this hilarious adult version, the first player to accurately guess what they are wins. Adults need to have fun too. And Hedbanz is the game where everybody knows but you. Let the good times roll with Hedbanz.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Time War",
        "description": "Time War is a tactical level simulation of a possible future where governments, using the ability to travel into time, attempt to control the present day world by altering history to their advantage. The players assume the roles of opposing Time Bureau Chiefs and seek to use their resources on hand to gain complete control of their present day world by altering history and destroying the opposing players' forces.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Doomtrooper",
        "description": "DOOMTROOPER is set in the Mutant Chronicles universe, where on a 10th (fictional) planet the seal to another dimension was broken. Now the Dark Legion come to the solar system, which is populated by five different Mega-Coporations (european-styled Bauhaus, american-styled Capitol, asian-styled Mishima, british-styled Imperial, cyborg-styled Cybertronic) and the Brotherhood (the church), to wreak havoc amongst them.&#10;&#10;The object of DOOMTROOPER is to use your available warriors to do battle against the forces of your opponent.You place warrior cards on the table to form your Squad (of Doomtrooper warriors) and/or your Kohort (of Dark Legion warriors). In order to play warriors and perform certain other card effects, you will need to acquire and spend Destiny Points, the &quot;currency&quot; used in DOOMTROOPER (referred to on many cards as D). Warriors earn Promotion Points (referred to on many cards as P) for you by winning battles and through other exciting combinations of card play.&#10;When either player reaches a predetermined number of Promotion Points (normally 25), the game is over. The points are received by killing warriors, completing missions or via special card play.&#10;&#10;Online Play&#10;&#10;&#10;     http://www.lackeyccg.com/downloads.html&#10;&#10;&#10;",
        "artist": "Tony Bagge,Peter Bergting,Paul Bonner,Les Edwards,Nils Gulliksson,Peter Andrew Jones,Jens Jonsson,Danne Kochanski,Fredrik Malmberg,Paolo Parente,Bryan Winter"
    },
    {
        "name": "Dragon Dice",
        "description": "Players use colorful dice to represent armies of different fantasy races which battle to control essential terrain in this fast-rolling game.  Any number of players can join the struggle, although it's designed as a multiplayer game. The first player to capture two terrains immediately wins the game, or you may try to obliterate your opponent's dice. Spells and layered strategies benefit certain races as you try to control the odds in this dynamic game full of surprises!&#10;&#10;History: 2-Player Starter Sets, including completely rewritten rules, were released in 2006. These rules are available online at [www.sfr-inc.com]. The new Starters have perfectly paired racial armies, not random assortments like the old retail packaging, plus four terrain dice, two dragons, the complete rulebook, and new army placement cards. The races are paired up as Coral Elf/Lava Elf, Dwarf/Goblin, Feral/Undead, and Amazon/Swamp Stalker. Hybrid Dragons were offered in 2008. Acolytes of the Eldarim (a large expansion of the Eldarim race) was released in August 2009, along with a re-release of the Dragonkin. The Battlefields expansion (new major and minor terrains) was released in August 2010, adding exciting new options and strategies. The Dragoncrusader and Dragonzealots (new Eldarim Champions) were released in 2011. Dwarves and Goblins were re-released as kickers in 2012 and now include a 5th monster for each race. Magic Items were also re-released in the Battle Chest expansion in 2012. Coral Elves and Lava Elves were re-released as kickers in 2013 and now include a 5th monster. Amazons were re-released as kickers in 2014 and now include a 5th monster.&#10;&#10;The Starters listed above are now out of print. New Starters have been released that have 30 health of Firewalkers and 30 health of Treefolk. Those starters also contain 4 Terrains, 4 dragons, 2 playmats, and a simplified set of starter rules.&#10;&#10;",
        "artist": "Chris Adams,Stephen A. Daniele,Jennell Allyn Jaquays"
    },
    {
        "name": "Dragonfire",
        "description": "Dragonfire was an attempt by Target/Heartbreaker to entice young adults into roleplaying, by means of devising a crossover between a roleplaying game and a fantasy miniatures boardgame similar to Milton Bradley and Games Workshop with their Hero Quest game system. This boxed game consists of 16 miniatures, various room and corridor tiles, cardboard doors with stand-ups, and some dungeon dressings represented by die cut cardboard pieces. The aim is to complete the task of each scenario given in the scenario booklet. One player is the Dungeon Master and sets up the rooms and monsters within when the other players reach them; the instructions are very specific about how to place the monsters, traps or items they encounter. Players are cooperative and do not compete against each other. Of course the players won't see the adventure booklet in advance or during the game, only the game master. All the players are knights of different colors (red, blue, green, and yellow). The same four colors are used for the plastic miniatures of: 4 orcs with bows, 4 trolls with clubs, and 4 Dragon Lords with swords.&#10;Between each scenario may the players increase their rank, depending on how many points they have collected during the scenario. They get points depending on which monsters they have killed plus one extra for a successfully done scenario. In the Dungeons are there monsters, traps, magic items and other stuff. Overall, the designers do a decent job of making the scenarios entertaining given a limited amount material in the game. Each turn, a new event card is overturned and strange things take place. This is fun at first but becomes predictable in later games.&#10;The dicing and combat system uses colored dice with different probabilities of scoring a hit - similar to Heroquest's Skulls and shields except that they are just circles on the dice and represent more of a yes/no answer when rolling. The game is slightly more advanced than Heroquest in that players can advance in levels similar to dungeons and dragons. As you increase in levels, you switch color of dice when attacking and defending, thus increasing your chances to score a &quot;yes&quot; or &quot;hit&quot; result on the dice. Otherwise the game is very similar to HeroQuest in general.&#10;Heartbreaker Hobbies produced a couple of lead elf miniatures designed for use with Dragonfire. At the same time, they put out a rare poster/magazine called &quot;Symmetry&quot; #1 that included two new magic items for the game, stats for two elf characters, and a short scenario using all of this with the Dragonfire game. One would assume that consumer response was lacking given that no attention was given to the Dragonfire game in later issues of Symmetry and the game went into obscurity. Still, the game could be used for a couple of night's gaming, especially if introducing children to D&amp;D style gaming or if one wanted to pirate the minis and room pieces to use with other game systems.&#10;&#10;",
        "artist": "Håkan Ackegård,Ken Kelly"
    },
    {
        "name": "Astrotime",
        "description": "A game of psychology, where you have to know yourself. There's an astrological moment in the game, which you might completely ignore.&#10;You start the game by preparing your personal game tablet by taking the card with your zodiac. You place 10 red dots according to this card and add 4 other red dots on characterics which you think suits yourself.&#10;Then there is 12 turns (one for each sign in the Zodiac), where 3 cards (2 cards if 3-4 players) are drawn and put in the middle of the board. You choose which of the cards suits your personality best. After all choosing is done, all put their chosen card into their personal game tablet and if you have at least five dots and has the most on the chosen card, you'll get points. These points should be spread in as many areas as possible, to get the most points.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Brainstorm",
        "description": "To rattle off so many things, persons etc in the desired category (due to the card drawn). For each answer which is written on the category card you may advance one step (two if that's an unusual answer, written in italics).&#10;&#10;Brainstorm is highly derivative of Outburst!, but with new game mechanics.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Curse of the Idol",
        "description": "The game target is to fetch the sword in the stone, then go to the temple and there chose the right hole in the idol. If you manage to get the blood stone, then you should hurry back to the camp with it. The others may try, to steal it from you, of course.&#10;&#10;You can either move your own pawn or the black adventurer to block other players. To enter into the centre of the board with the &quot;blood stone statue&quot;, you need to walk over movable cog-wheels, which turn every time you land on certain squares.&#10;&#10;This game plays like an advanced &quot;Ludo&quot;. It is difficult to put together the 3D game board if you don't mark up the corner support the first time you succeed to assemble it.&#10;&#10;",
        "artist": "David Sque"
    },
    {
        "name": "Babylon 5 Component Game System: Core Sets",
        "description": "Component Game Systems came out with a number of component game systems that used the same sort-of-collectible approach (a roughly similar game is Space Race). Besides Babylon 5, there was Hercules, Xena, and Star Trek. The Babylon 5 game was apparently derived from the unpublished Galactic Empires board game, based on the CCG of the same name --Companion Games (Galactic Empires' publisher) became Component Game Systems in the process.&#10;&#10;The basic idea is that each player need only buy his part of the game, representing in this case a specific political entity from the Babylon 5 universe. Players sit down at the same table and put their components in common to have a game. Pretty cool.&#10;&#10;In the Babylon 5 game, you take control of a certain faction which is trying to gain power in the galaxy. You play the role of an ambassador on board Babylon 5. You explore the vast stretches of space, lead huge fleets into battle, and control the economy of your faction. There are several ways to achieve victory ranging from economic growth to all out militaristic control of the universe. Diplomacy is not to be neglected either, as the more powerful game changes are brought up in Babylon 5 council vote to be decided.&#10;&#10;You construct your playing 'board' using hexagonal shaped pieces that come with the game. The various pieces are &#10;different and can represent a multitude of things so that the game is different every time you play. In addition to the board and the ships that move on it, there are cards. Players may buy cards allowing special actions above and beyond the normal game, like an extra move or more EPs. You can create decks for each player as per CCGs, or you can just draw from a common deck after handing out the empire specific cards.&#10;&#10;Using your faction's wealth and resources you play the game and explore the map. You search for planets to colonize and possibly conquer. Use your fleets to engage in battles and use characters to assist you in reaching your faction's goals. The choices are yours and will decide if your faction is successful.&#10;&#10;The game does a very good job of recreating the B5 universe, with play action matching pretty closely the series' happenings. In terms of mechanics, it is similar to Twilight Imperium and Les Cochons de l'espace.&#10;&#10;There are two core sets, although CGS initially intended five (one for each of the show's seasons). They are the 2258 and 2259 Core Sets. The first was published in two formats, the 1997 first printing (Limited Edition; CB5-101) using a smaller, unimpressive box (they were in a hurry to get it to the store shelves by Christmas of that year), whilst the 1998 second printing (CB5-001) came in a beautiful large box (allowing room for the storage of extra sets) labeled as &quot;Babylon 5: The Board Game&quot;. The 2259 Core Set (CB5-102) was only published in the big box format. The core sets include the Earth Alliance, Narn Regime, Centauri Republic and Minbari factions, which were each available separately (although the core sets include some extra cards and stuff beyond the combination of the four individual Starter Kits). There is supposedly enough difference between the 2258 and 2259 core sets to warrant buying both, although I haven't received my 2259 set yet so I can't be sure.&#10;&#10;Component Game Systems has now disappeared from the face of the earth, and even their domain name (www.c-g-s.com) has been recycled by some unrelated outfit.&#10;&#10;Part of the Component Game System.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Isolation",
        "description": "In Isolation, the &quot;Don't Get Stranded&quot; game, the board is a 6x8 grid of removable squares. On your turn, you move your pawn one space, then remove a square. The object is isolate the opponent so they cannot move.&#10;&#10;This game is one of a series of 2 player strategy games by Lakeside from the 1970s, also including Overboard, Trespass and Blockade.&#10;&#10;",
        "artist": "Bernd Kienitz"
    },
    {
        "name": "Pig Pile",
        "description": "Pig Pile is an extremely light card (and punny) game. The cards have illustrations of pigs (naturally), and you can be &quot;hog tied&quot; or have a &quot;hog wash&quot;.&#10;&#10;Players start with three face-down cards (called &quot;Slop&quot;) and a hand of six cards. At the start you place three of your cards face-up on top of the slop cards, leaving you with a hand of three cards. Each turn you must play to the central &quot;Pig Pile&quot; one or more cards of the same value that are equal to or greater than the top card of the Pig Pile. If you fail to do so, you must take the entire Pig Pile into your hand. Certain cards have special effects:&#10;&#10;&#10;    Hog Wild: Wild card that can be played at any time and allows any card to played on it next turn.&#10;    Hog Tied (4s): The next player loses his turn.&#10;    Hog Wash (8s): Remove the Pig Pile from the game and take another turn. (If three cards of the same value are played in succession, a Hog Wash takes place automatically.)&#10;    Ewe Turn (11s): Reverse order of play.&#10;&#10;&#10;Each turn you draw back to three cards until the deck runs out. If you have no cards in hand (which can happen only after the deck runs out), you must play a face-up card (a card that you laid aside at start) or if those are gone, a slop card. (Slop cards are played blind, so you could be really screwed.) If you're the first or second player to rid yourself of cards (including your slop), you receive a number of pigs. Whoever has the most pigs after five hands wins.&#10;&#10;",
        "artist": "Scott Fleenor,John Vetter"
    },
    {
        "name": "Moonshot the Game",
        "description": "MOONSHOT The Game brings to life the fascinating story of mankind&rsquo;s greatest adventure&mdash;the Apollo voyages to the moon. MOONSHOT is not a trivia game, it&rsquo;s a fast-paced game of strategy based on card-play. NASA projects Mercury, Gemini and Apollo provide the backdrop as players are put in command of the Space Race. Each landmark event, pioneering mission, heart-pounding crisis and incredible machine is represented by a playing card. Players use these cards and a supply of fuel cards to complete the historic NASA space missions in a race to be the first to land on the Moon.&#10;&#10;To complete each mission, you must use your fuel supply to assemble the correct equipment, launch the mission and move your playing piece to the corresponding mission patch on the game board. This completes the mission, you receive a replica mission patch and gain a fuel bonus. During the game you can take advantage of special cards called alarms, events and instants. These represent historic events in space history and can be played to speed you progress or hinder your opponents. After completing the required number of missions, be the first to land on the Moon and win the game. MOONSHOT has a wealth of detail and flavor for the space enthusiast. If you're big on space travel or really enjoy space history, this game is a must. And it's collectible, too!&#10;&#10;MOONSHOT The Game was awarded &ldquo;Best New Family Game&rdquo; in the GAMES Magazine Buyer's Guide 2000 and called &ldquo;One of the Coolest New Board Games&rdquo; by Inquest Magazine. The expanded second edition was released in 2006 and has been renamed Tranquility Base&trade;.&#10;&#10;",
        "artist": "Van Overbay"
    },
    {
        "name": "Arena: Morituri te salutant",
        "description": "Tactical combat game, where you choose one or two characters, who fight each other (it's also possible with a multi-player variant, where some players can cooperate to win). The winner is the one who succeeds in getting  the opponents &quot;Condition Points&quot; down to zero.&#10;&#10;The combat rules are unusual, well thought-out and interesting. Instead of throwing a die, you choose a number 1-6 (depending of the attack type, the range might be lower) on the die and the defense is a certain number of guesses to find out what the opponent attacks with. Number of attacks depends on the active combat card (defense cards gives more guesses, but lower attack damage). The higher value, the higher becomes the damage, but if you always chooses the highest value, it's soon penetrated!&#10;&#10;You play the game by choosing the cards and their order from your characters card deck and you have to out-guess your opponent.&#10;&#10;",
        "artist": "Tomáš Kučerovský,Ondřej Mašek,Martina Pilcerová,David Spáčil"
    },
    {
        "name": "Atmosfear: The Harbingers",
        "description": "The aim is to collect 6 different key stones and return to the hub, where you need to enter exactly at your own number. Then you should NOT draw your own piece of paper from &quot;the Source of the Fear&quot;.&#10;The game uses a VHS video tape as a 'video clock' giving the players one hour to complete the game, which is interrupted now and then by the Gatekeeper on the video, who says what the current user may or must do. This makes the game quick and stressful, as you want to conclude you turn as fast as possible, so you won't be the player affected by the Gatekeeper.&#10;It's a modular game board that allows for several different setups.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Cataphract",
        "description": "(from the GMT's website:)&#10;&#10;Cataphract is defined as a heavily armored cavalryman modelled either on the Sarmatians (cataphractarius) or the Persians (clibanarius). He was the ultimate mounted armored warrior of the ancient world, trained in both shock and missile combat.&#10;&#10;Cataphract portrays the development of the art of war wrought by the early Byzantine Empire, during the reign of Emperor Justinian, under his great Generals, Belisarius and Narses. During this period the Byzantine Empire, also known as the Eastern Roman Empire, for a brief period of time, re-captured a large portion of what was formerly the Western Roman Empire. Although successful in its attempts to reconquer Italy and North Africa, the Byzantine Empire's resources were insufficient to hold on to its gains.&#10;&#10;Cataphract covers all the major battles that defined this era. To place these battles in their proper historical context, the Campaign Game, Justinian, is enclosed, which covers the quest to reconquer the Roman Empire under one ruler.&#10;&#10;Thus, Cataphract contains the decisive battles of the era; a Campaign Game; plus a special bonus Viking raid scenario; and the land/naval leaders for an upcoming series of C3i Magazine Modules covering the Peloponnesian War.&#10;&#10;Game Components :&#10;&#10;     700 Full-color 1/2&quot; die-cut counters (includes counters for Justinian and 40 double-sided, full color galley counters.&#10;     2 34x22 full color back printed maps (including the map for Justinian)&#10;     21-page Rulebook (Cataphract)&#10;     12-page Playbook (Cataphract)&#10;     16-page Rulebook (Justinian)&#10;     1 11x17 Player's Aid Chart&#10;     1 10-sided die &#10;&#10;&#10;&#10;&#10;DESIGNERS Mark Herman and Richard Berg&#10;DEVELOPER Alan J. Ray&#10;PROJECT EDITOR Gene Billingsley&#10;ART DIRECTOR Rodger B. MacGowan&#10;MAP ART Mark Simonitch&#10;COUNTER ART Rodger B. MacGowan and Mike Lemick&#10;&#10;",
        "artist": "Mike Lemick,Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "Fireside Football",
        "description": "From MNG-AJM Games and Collectibles description:&#10;&#10;&#10;Card game, simulation of a football season. Originally designed as a postal game, this version comprises 110 illustrated cards. Each player chooses which players to field in each match, and can buy overseas stars to bolster the team's performances. You can replay the whole season inside an hour. The short game version of the play by mail soccer game UNITED.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Legend of the Five Rings",
        "description": "A collectible card game, set in a fantasy empire called Rokugan, based loosely upon medieval Japan and Japanese Mythology.&#10;&#10;The factions available have changed over the editions, but generally include the 7 Great Clans: Crab, Crane, Dragon, Lion, Phoenix, Scorpion, and Unicorn. Each has specific thematic elements, which are consistent across editions and descendant games.  The other currently legal factions include the Spider, Mantis, and an unaligned ronin stronghold.&#10;&#10;The Rokugan setting has been changed over the years by participation in the storyline tournaments for the L5R CCG.&#10;&#10;Legend of the Five Rings is different from other collectible card games due to the concept of Clan loyalty.  The Clans of the game are what you build your deck around, and the communities that have built up around the Crane Clan, Lion Clan, etc are the backbone of the game.  When you say &quot;I'm a Crab player&quot; you instantly find yourself with hundreds and thousands of clan-mates who are there to help you become a better player.  When one member of the Clan wins, all benefit.&#10;&#10;L5R was the first CCG to introduce cards that players directly influenced. These are still a core part of the game.&#10;&#10;The L5R CCG has spun off a number of related games: &#10;&#10;     Clan War, a miniatures game.&#10;     Diskwars: Legend of the Five Rings, a Rokugan-themed set of the Diskwars tabletop combat game.&#10;     Legend of the Five Rings: Art of War, an as-yet unpublished wargame set in Rokugan.&#10;     Legend of the Five Rings Roleplaying Game&#10;&#10;&#10;&#10;&#10;As of 2006, only the CCG and Clan War have had storyline tournaments. Though the RPG players have been heavily involved in the ongoing plot in recent years.&#10;&#10;In 2008, L5R held the first &quot;Mega-Game&quot; which incorporated various methods of competition for the Clans and their supporters, not only in CCG form, but in contests (art, writing, poster-design, etc.), community work (charity, fundraising, food-drives), and more. The Dragon Clan ultimately won the first mega-game, and as such earned the privilege of having the next Empress come from their clan.&#10;&#10;In 2009, L5R released its first graphic novel, Death at Koten, which also included exclusive story-themed cards for the CCG.&#10;&#10;Also in 2009, L5R released The Imperial Gift the first completely free expansion in CCG history.&#10;&#10;In 2010 L5R celebrated its 15th Anniversary with many major events, new prizes, more free cards, and a special flashback set that brought back some of the most popular cards in the history of the game. 2010 also saw the largest World Championships event at Gen Con in the past 7 years.&#10;&#10;2011 saw the release of War of Honor, an all new tile-based multiplayer format for L5R that comes with 4 pre-constructed decks.&#10;&#10;In september 2015, AEG and Fantasy Flight Games announced that FFG had bought the L5R brand from AEG and will relaunch the card game as a LCG (non-collectible), with significant rules changes and a new design. The game is to go on hiatus following the release of Evil Portents, the final expansion from AEG, and will be relaunched at Gencon 2017. FFG has also plans to continue the RPG at some point (in what form and with which ruleset is yet unknown).&#10;&#10;",
        "artist": "Aaron Acevedo,Rob Alexander,Eric David Anderson,Michael Apice,Steve Argyle,Matthew S. Armstrong,Chris Arneson,Drew Baker,Nate Barnes,Julie Baroh,Jesus Barony,Thomas Biondiolillo,Theodor Black,David Bollt,Leonardo Borazio,Noah Bradley,Adam Bray,Heather Bruton,Matt Busch,Manuel Calderon,Mike Capprotti,Kari Christensen,Brent Chumley,Miguel Coimbra,Shane Coppage,Audrey Corman,Ed Cox,Jose Cua,Kevin Daily,Liz Danforth,Edwin David,Max Degen,Adam Denton,John Donahue,Stacy Drum,Randy Elliott,Steve Ellis (I),Jason Engle,Edward Fetterman,Stacy Fitz,David Fooden,Carl Frank,Ted Galaday,Randy Gallegos,Sandra Garavito,Pete Garcia,Raymond Gaustadnes,Daniel Gelon,Joachim Gmoser,Anthony Grabski,Troy Graham,James Hall,Andrew Hepworth,Paul Herbert,Ancor Hernandez,Bonnie Hill,Jeff Himmelman,Bob E. Hobbs,Quinton Hoover,David Horne,Lisa M. Hunt,Llyn Hunter,Mark Hyzer,Imaginary Friends Studio (IFS),Janine Johnston,Veronica Jones,Jaime Jones,Jason Juta,Michael Kaluta,Dave Kendall,McLean Kendree,Michael Komarck,Doug Kovacs,Heather Kreiter,Lissanne Lake,K. C. Lancaster,Michael Lavoie,Stephanie Pui-Mun Law,Brandon Leach,April Lee,Alayna Lemmer,Nicola Leonard,Randy Liu,Monika Livingstone,Eric Lofgren,Chuck Lukacs,Anson Maddocks,Craig Maher,Sławomir Maniak,Thomas Manning,Britt Martin,Cristina McAllister,Malcolm McClinton,Bradley McDevitt,Patrick McEvoy,Jeff Menges,Ken Meyer, Jr.,Peter Mohrbacher,Monte Moore,John Moriarty,Tony Moseley,William O'Connor,Gonzalo Ordoñez,Margaret Organ-Kean,Glen Osterberger,Ozan Art,Jim Pavelec,Ben Peck,Michael Phillippi,Eric Polak,Mark Poole,Chris Pritchard,Mike Raabe,Jeff Reitz,Angga Satriohadi,Erich Schreiner,Chris Seaman,Cline Seigenthaler,Doug Shuler,Ellym Sirac,Brian Snoddy,Ron Spencer,Luke Stelmaszek,Bob Stevlic,Alberto Tavira,Mark Tedin,Beth Trott,David Trowbridge,Charles Urbach,Susan Van Camp,Diana Vick,Franz Vohwinkel,Bryon Wackwitz,Christina Wald,Kevin Ward,Kevin Wasden,Corene Werhane,Mario Wibisono,Michael Williams,Brad Williams,Matt Wilson,Joe Wilson,Jarreau Wimberly,Robin Wood"
    },
    {
        "name": "Plateau",
        "description": "Each playing piece has colored rings attached to its top and bottom faces; the color of the ring that's showing indicates how the piece moves. At the start of your move, you can flip the top piece in a stack over, changing how that piece moves. And your opponent isn't allowed to look underneath your pieces to see what might be there.  With this significant bluffing aspect, tied to the transformation of units, as well as two very different ways to win, Plateau is a unique abstract strategy game.&#10;&#10;Online Play&#10;&#10;&#10;     Boardspace.net (real-time)&#10;     GamesByEmail.com (turn-based)&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Portal",
        "description": "Portal is a 'stripped-down' version of Magic: the Gathering designed to appeal to new players.  While the game retained some of the features of the original game, it also removed a number of abilities and interactions deemed too confusing for the novice player.  Though a number of the cards in portal were direct counterparts to cards in the regular-run of Magic: the Gathering, gone were named abilities like Trample, Banding, -walk (though Three Kingdoms did add the ability &quot;Horsemanship&quot;, which is almost but not quite flying).  Additionally, the game cut back on cards that could be played on another player's turn (i.e. instants and interrupts), leading to a greater focus on creatures and not spell interactions to achieve victory.&#10;&#10;Portal cards are recognizable from core and expansion sets of Magic: the Gathering by the expansion symbol, as well as a bolder and larger font in the text box, and symbols next to the attack and defense numbers of creatures.&#10;&#10;Portal was printed in three editions:&#10;&#10;     Portal&#10;     Portal Second Age&#10;     Portal Three Kingdoms (with an Eastern/Chinese theme)&#10;&#10;&#10;&#10;&#10;",
        "artist": "Miao Aili,Rob Alexander,John Avon,Qi Baocheng,Edward Beard, Jr.,Melissa Benson,Gerald Brom,Jeffrey R. Busch,Doug Chaffee,David Cherry,Wang Chuxiong,John Coulthart,Qiao Dafu,Ai Desheng,Tony DiTerlizzi,Mike Dringenberg,Brian Durfee,Robert Eggleton,Wang Feng,Fred Fields,Scott Fischer,Phil Foglio,Kaja Foglio,Dan Frazier,Una Fricker,Randy Gallegos,Daniel Gelon,Donato Giancola,Charles Gillespie,Gerry Grace,D. Alexander Gregory,Yang Guangmai,Rebecca Guay-Mitchell,David Ho,Yang Hong,Quinton Hoover,David Horne,Heather Hudson,Shang Huitong,Junichi Inoue,Jiaming,He Jiancheng,Liu Jianjian,Gao Jianzhang,Zhang Jiazhen,Janine Johnston,Qin Jun,Hannibal King,KOJI,Yang Jun Kwon,LHQ,Lubov,Steve Luke,Colin MacNeil,Anson Maddocks,John Matson,Cristina McAllister,Jeff Miracola,Ted Naifeh,Sun Nan,Terese Nielsen,Paolo Parente,Keith Parkinson,Eric Peterson,Mark Poole,R. K. Post,Dermot Power,Huang Qishi,Mike Raabe,Alan Rabinowitz,Roger Raupp,Adam Rex,Andrew Robinson,Romas,Christopher Rush,Mitsuaki Sagiri,Zina Saunders,Liu Shangying,Kuang Sheng,Song Shikai,Doug Shuler,William Simpson,Adrian Smith,Ding Songjian,Ron Spencer,Matthew Stawicki,Junko Taguchi,Zhao Tan,Xu Tan,Mark Tedin,Li Tie,Cai Tingting,Lie Tiu,Susan Van Camp,Henry van der Linde,Pete Venters,Kevin Walker,Tom Wänerstrand,Li Wang,Michael Weaver,Jack Wei,Chen Weidong,Brad Williams,Matt Wilson,Sam Wood,Tang Xiaogu,Li Xiaohua,Xu Xiaoming,Qu Xin,Quan Xuejun,Ku Xueming,Gao Yan,Hong Yan,Lin Yan,Solomon Au Yeung,Ji Yong,Li Youliang,Li Yousong,Kang Yu,Fang Yue,Wang Yuqun,Jiang Zhuqing"
    },
    {
        "name": "War Galley",
        "description": "(from GMT website):&#10;&#10;War Galley is the seventh volume in the multi-award winning Great Battles of History (GBoH) series, but the first to venture entirely into the waters of the Mediterranean Sea. It is also the first historical boardgame published, in two decades, to address galley warfare. As such, GMT's War Galley is almost a complete history for this era of war at sea.&#10;&#10;What is best about War Galley is how easy it is to play -- the rules are about half the length of the usual GBoH game -- and that means that most battles can be complete in several hours, at the most. The battles themselves, cover all aspects of galley tactics, from the line against line of big ships at Salamis (Cyprus), to the Chase, Turn and Fight of Chios, to the Line Astern vs. Line Abreast at Side, to probably the most unusual of all ancient battles, the Roman arrowhead against the Carthaginian Lines Astern at Drepanum in 249 B.C.&#10;&#10;War Galley wars and battles covered by the scenarios are:&#10;&#10;&#10;     Ionian Revolt- Lade, 494 BC&#10;     Peloponnesian War- Arginusae, 406 BC&#10;     The Silician Wars- Catana, 397 BC&#10;     The First Successor War- Salamis, 306 BC (Cyprus)&#10;     The First Punic War&#10;         Ecnomus, 256 BC&#10;         Drepanum, 249 BC&#10;         Aegatian Islands, 242 BC &#10;    &#10;     The Macedonian Wars- Chios, 201 BC&#10;     The War with Antiochus&#10;         Side, 190 BC&#10;         Myonessus, 190 BC &#10;    &#10;     The Civil War&#10;         Tauris, 47 BC&#10;         Naulochus, 36 BC&#10;         Actium, 31 BC &#10;    &#10;&#10;&#10;",
        "artist": "Mike Lemick,Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "Starfarers of Catan",
        "description": "The foray into space, sometime near the year 2700 A.D. Compete for the prestigious post of Ambassador to the Galactic Council. To attain this lofty position, players must leave Terra and the known planets to explore and colonize the galaxy, while working to establish trade with alien cultures, encounter aliens, and defeat pirates. Glory and victory go to the brave and astute explorer upon whom luck smiles.&#10;&#10;The known worlds lie at one end of the game board, where each of the 3 or 4 players begins from known solar systems, each with 3 planets producing raw materials needed for the travels into deep space.&#10;&#10;Each player begins with 2 Colonies and a Space Port (all components are made from plastic). The Space Port makes starships to transport your new colonies and trade posts to distant lands. Throughout the game, all the colonies and spaceports enable the production of resources when the dice match the numbers of adjacent planets. Resources are traded for colony ships, trade ships, and fleet upgrades of freight rings, booster rockets, and cannon. Beware as you explore&mdash;some planets are covered in ice, and some conceal dangerous pirates.&#10;&#10;Belongs to the Catan Series.&#10;&#10;",
        "artist": "Tanja Donner"
    },
    {
        "name": "Friesematenten",
        "description": "Friesematenten is a card game.  The goal of the game is to collect enough of the right type of cards to score 40 victory points.  Cards are collected through auctions.  Each card either provides victory points, produces income or gives you actions to manipulate already played cards.  The game is semi collectible with 200+ cards in the whole game but each individual game coming with a subset of those 200 cards. The base game comes with two extension sets of 60 random cards and is enough for a two-player game.&#10;&#10;",
        "artist": "Andreas Keiser,Holger Martens,PeKa,Gerrit Schwaner"
    },
    {
        "name": "13 Dead End Drive",
        "description": "A bluffing game where you try to conceal your identity.&#10;On your turn you move two of the character pawns on the board. Movement is decided by dice.&#10;&#10;The board is a 3D house with several traps. If you move a character to a trap space, you may spring the trap if you have the corresponding card in your hand. You can bluff by moving your opponents' characters towards the entrance or moving your own character onto a trap space, but not release it.&#10;&#10;The portrait above the fireplace contains cards for each character plus Aunt Agatha. When you roll doubles, you may change the portrait.&#10;&#10;You can win the game in three different ways: &#10;1) If you can move your own game counter out of the house when it's the same as the portrait on the wall. &#10;2) If your game counter is the last surviving. &#10;3) If your game counter's portrait is on the wall when the detective enters the main entrance.&#10;&#10;",
        "artist": "Andrew S. Berton"
    },
    {
        "name": "Star Fleet Battle Force",
        "description": "Lifted from Amarillo's order page :-&#10;&#10;&quot;A melding of Star Fleet technology and a classic naval card game system. Ships are marked with various weapons; if you have a matching weapon card you can fire it at the enemy. Various defenses and attack bonuses apply. Advanced game mechanics allow some weapons to use several different cards (Plasma R can fire plasma S) and many weapons can be used defensively against some kinds of attacks. Special cards include legendary officers, Klingon mutiny, Organian ceasefire.&quot;&#10;&#10;Part of the Star Fleet Universe series.&#10;&#10;",
        "artist": "Ted Geibel,Dale McKee"
    },
    {
        "name": "Mad Scientist",
        "description": "From the box:&#10;&#10;Be the first Mad Scientist to control four of the seven continents and you win.&#10;&#10;This devilishly clever two player card game will challenge your strategic interests as you battle for world domination.  The seven cards in your hand are numbered 1 to 9 and include special effect cards that may tweak the rules to your benefit.  Place a card on the continent that brings its value to ten and you control that continent, but beware of giant robots guarding your opponents interests.&#10;&#10;Sounds simple but watch out for cards like the Radioactive Randomizer, the Dreaded Duplicator and the Sinister Shuffler.  They might change everything.&#10;&#10;",
        "artist": "Daniel Golen,Michael Stern"
    },
    {
        "name": "International Movie Maker",
        "description": "You are a film producer and your aim is to make top quality, successful movies that will gross the most money possible at the box office.&#10;&#10;You run around the board trying to collect a Story, a Director, a Male and a Female Film Star and of course the relevant number of Locations.  You have a choice of Epic, Historical, Comedy, Musical, Western or Horror films, and each Star is best cast in a particular type of movie.  Directors are of varying quality as well.  The number of Locations required also depends on the film type.  The bigger your production, the greater its money making potential.&#10;&#10;Borrowing from Monopoly, there are also Distribution Company squares that act sort of like the Water or Electric Companies; the income from the Distribution Companies is raked in every time a player stops on such a square, and increases with that player's filmography.&#10;&#10;The rest of the board is the expected Oscar or Flop, Star Trouble, Retake, Director Loss, etc.&#10;&#10;A light, reasonably fun game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "G.O.O.T.M.U.",
        "description": "G.O.O.T.M.U. (Get Out of the Maze Unit) is a maze game.  The board set up with a number of tiles.  You are trying to pick up all three parts of your GOOTMU so you can leave and win the game.&#10;&#10;You move by rolling a die, and when you end your turn on a space with an instruction on it, you must follow it.  Some objects are in the maze that allow you to avoid or destroy some obstacles (water puts out fire, oil allows you to slide through tight gaps, keys open locked doors, etc.).  On a 6, you may elect to rotate the tile you are on or an adjacent tile to improve your position.  Power tokens found in the maze allow you to rotate a tile or pick the number on the die.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Venice Connection",
        "description": "This is a two player river building / tile placement game.  The object is to complete the canal in a loop.  There are 16 identical tiles in the game, each with a straight section of canal on one side and a bend on the other.  All the tiles are available for either player to use.&#10;&#10;If during the course of the game, one player notices that the canal is now impossible to complete, they say &quot;impossible&quot; to the challenged player (who placed the last tile), who now must try to finish the canal alone.  If the canal is completed the challenged player has won, if not, the challenger has won!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "World Cup Tournament Football",
        "description": "This is really a card game disguised in a rather large box. The object of the game is to get your team through the qualifying for the (soccer) World Cup, and hopefully win.&#10;&#10;The game has a board which depicts a a bunch of soccer fields - just placeholders for the cards played in the &#10;tournament: from 16 fields for the first elimination round and the 8 fields for the round of 16, up to the one field used for the finals. There is also a deck of cards for each of the teams involved in the game with two sets of numbers printed on the card depicting the number of goals scored and the number of penalties given to that team. Finally there are counters depicting the 32 teams in the tournament.&#10;&#10;Each player starts the game with five random cards and the team counters are randomly distributed to each of the players (showing which team each player will 'manage'). Each team is rated either as 0, 1, or 2 - this is the 'bonus' number of goals that team will score in each match it plays.&#10;&#10;Each player in turn can play a card onto any soccer field. On the preliminary matches (fields), the cards are placed face-up (maximum of 3 cards), on any other field, the card is placed face-down. Once all the fields are full, the matches are resolved with the winner of the match going on to the next. Once the preliminary matches are resolved and the teams determined for the next round, those cards are flipped over and the results determined. This is done all the way to the finals.&#10;&#10;A player can determine where his team will end up playing each subsequent match and play cards face-down to try to get his team to win, but if your team is upset early - all those face-down cards that you played are now going to help some other team and not yours.&#10;&#10;",
        "artist": "Chris Denton,Sarah Kulfan"
    },
    {
        "name": "Middle-Earth",
        "description": "ICE's now-out-of-print CCG (they lost their license to produce Middle-Earth products in 1999). Players take the role of the Istari, or Wizards - most familiarly Gandalf, Saruman, and Radagast, but also Pallando and Alatar - in the  struggle against Sauron in Middle-Earth. Each player competes to bring the greatest strength to bear against the Shadow, including Factions such as the Riders of Rohan or the Great Eagles, allies like Gwaihir or Shadowfax, items such as the lost Palantiri, Glamdring, or Narsil, and the completion of various quests - from the relatively straightforward rescue of prisoners through the involved Reforging of the Sword that was Broken, restoration of the White Tree to Minas Tirith, or the quest of quests, the destruction of the One Ring.&#10;&#10;Players build decks in which half are composed of resource cards and half of hazards, dedicated to the stopping of your opponent. This is where the big bad guys come in, with cards for the 9 Nazgul, a couple of Dragons (Smaug being the recognizable one), Shelob, and the Balrog.&#10;&#10;",
        "artist": "Stefano Baldo,Rob Alexander,Eric David Anderson,Randy Asplund-Faith,Doug Beekman,Melissa Benson,Derek Carbonneau,Steven Cavallo,Doug Chaffee,Ron Chironna,Storn Cook,Audrey Corman,Liz Danforth,David R. Deitrick,Donald G. Dennis,Lori Dietrick,Tom Dow,Darryl Elliott,Pete Fenlon,Jon Foster,Olivier Frot,Randy Gallegos,Donato Giancola,Rebecca Guay-Mitchell,Jo Hartwig,Jason Hawkins,Quinton Hoover,Heather Hudson,April Lee,Vincent Lujan,David G. Martin,Angus McBride,Gail McIntosh,Ken Meyer, Jr.,Malcolm David Monette,Angelo Montanini,Nick Morawitz,Pat Morrissey,Jessica Ney,Margaret Organ-Kean,Steve Otis,Mark Poole,Omar Rayyan,Jeff Reitz,Zina Saunders,Ronald Shuey,Tom Simonton,Brian Snoddy,Ron Spencer,Susan Van Camp,Christina Wald,Kevin Ward,Brad Williams,Dameon Willich,Pascal Yung"
    },
    {
        "name": "Shuttles",
        "description": "From the box:&#10;Shuttles is a game of strategy for two players, ages 8 to adult. By moving playing pieces and game board sliders, players maneuver around variable barriers in a race to be the first to reach their goal. This challenging game develops strategic thinking skills, and by solving strategy problems, helps children to develop solutions to real-life problems.&quot;&#10;&#10;The board is made up of nine or seven horizontal rows (&quot;sliders&quot;) containing various combinations of holes and barriers. The players start with five pegs each, on opposite ends of the board, and attempt to be the first to get all of their pegs to the other side. On a turn, the player can either move a peg orthogonally as far as they want without crossing a boundary, or they can move one of the rows left or right, shifting the location of the holes and barriers in an attempt to block their opponent's moves or open a path for their own pegs.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "D-Day (3rd edition)",
        "description": "D-DAY was completely revised in 1977 to incorporate the latest simulation design innovations including Strategic Movement, Air Interdiction, and Tactical Airpower. It is an Intermediate 1 level game on the Avalon Hill Complexity Scale for 2 players aged 12 &amp; up with a varying playing time of 1-4 hours.&#10;&#10;D-DAY belongs to the Avalon Hill family of classic games suitable for play-by-mail in much the same fashion as chess.&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "The Business Game",
        "description": "Board of two joined leaves, 12 mine derricks (2 of each of 6 colours), 6 lorries [trucks], 5 barges, 2 ships, 90 pyramids (15 of each of 6 colours), 24 cubes (4 of each of 6 colours), 26 production cards, 6 Canal Company Title Deeds, 2 production debit cards, 1 die, sterling and dollar currency.&#10;&#10;The players are operating a mine and trying to get the ore to market, but must compete with each other for the limited transportation resources.  The ore has to be transported initially by lorries and also later by barges to the coastal warehouse.  All transport has to be hired and there is always less transport available than required, favouring those who are prepared to take a risk on achieving a quick journey without mishap.  For example there are only 5 barges (always one less than the numbers of players) to encourage competition and load sharing.  You can also force other players to pay you for taking their ore to make up a barge load as all barges have to travel fully laden.  Much depends on how long a journey takes.  New ore can only be obtained by throwing a 1 or a six which also triggers the playing of a production card which can be favourable or not.&#10;&#10;From the coastal warehouse, barges and ships are used to transport ore out to sea to foreign ports to sell to gradually earn the Million Dollars needed to win the game.  The second set of money (dollars) is thus actually a victory point counting device and not actual currency (i.e. it cannot be spent).&#10;&#10;It works well with any number of players (when playing with a smaller complement, each player operates multiple mines) except five, as the competition factor on one side of the board is uneven with the other.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "MindTrap",
        "description": "Two teams try to solve logical riddles and moves on a board (which actually is a paper from a block with a &quot;racing track&quot;). Each time team comes up with the right solution they may move one step and demand another question or throw a die (0-3) and let the turn continue to the other team.&#10;&#10;A sequel to the game is MindTrap II.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Maloney's Inheritance",
        "description": "Players are traveling from city-to-city with a single car.  All players have a goal to reach a different city at a certain time in order to maximize points.  As each player has a different set of goals, some players will benefit while others will lose out.&#10;&#10;On each turn, the control of the car will be auctioned. After the auction round, the winner pays the bank and chooses the destination for the car.&#10;&#10;Upon arrival at a city, the driver receives that city's suitcase. This suitcase can indicate that the driver receives up to five points or $1,500.  It may also say that he loses up to three points or $1,000.&#10;&#10;Additionally, upon arriving in a city, players may play action cards that correspond to the city. Points are awarded depending on the day of the week of the arrival.  Tuesdays and Fridays you receive double points.&#10;&#10;The game ends either when a player has received 69 points or when a player is out of action cards.  Each player can then buy additional points for $1,000 each.&#10;&#10;Re-implements:&#10;&#10;    Holiday&#10;&#10;&#10;&#10;&#10;",
        "artist": "Dietrich Lange,Gerhard Schmid,Thomas Weiss"
    },
    {
        "name": "Munchkin",
        "description": "&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Publisher's Description&#10;&#10;Go down in the dungeon. Kill everything you meet. Backstab your friends and steal their stuff. Grab the treasure and run.&#10;&#10;Admit it. You love it.&#10;&#10;This award-winning card game, designed by Steve Jackson, captures the essence of the dungeon experience... with none of that stupid roleplaying stuff. You and your friends compete to kill monsters and grab magic items. And what magic items! Don the Horny Helmet and the Boots of Butt-Kicking. Wield the Staff of Napalm... or maybe the Chainsaw of Bloody Dismemberment. Start by slaughtering the Potted Plant and the Drooling Slime, and work your way up to the Plutonium Dragon...&#10;&#10;And it's illustrated by John Kovalic! Fast-playing and silly, Munchkin can reduce any roleplaying group to hysteria. And, while they're laughing, you can steal their stuff.&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Other&#10;&#10;Part of the Munchkin series.&#10;&#10;Munchkin is a satirical card game based on the clich&eacute;s and oddities of Dungeons and Dragons and other role-playing games. Each player starts at level 1 and the winner is the first player to reach level 10. Players can acquire familiar D&amp;D style character classes during the game which determine to some extent the cards they can play.&#10;&#10;There are two types of cards - treasure and encounters. Each turn the current players 'kicks down the door' - drawing an encounter card from the deck. Usually this will involve battling a monster. Monsters have their own levels and players must try and overcome it using the levels, weapons and powers they have acquired during the game or run away. Other players can chose to help the player or hinder by adding extra monsters to the encounter. Defeating a monster will usually result in drawing treasure cards and acquiring levels.  Being defeated by a monster results in &quot;bad stuff&quot; which usually involves losing levels and treasure.&#10;&#10;In May 2010, Steve Jackson Games made the &quot;big announcement.&quot; Many rules and cards were changed. See The Great 2010 Munchkin Changeover for details. Of note to Munchkin fans, the Kneepads of Allure card, which had been removed in the 14th printing, was added back to the game but modified to be less powerful.&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Sequels:&#10;&#10;&#10;    The Good, the Bad, and the Munchkin&#10;    Munchkin Apocalypse&#10;    Munchkin Axe Cop&#10;    Munchkin Bites!&#10;    Munchkin Booty&#10;    Munchkin Conan&#10;    Munchkin Cthulhu&#10;    Munchkin Fu&#10;    Munchkin Impossible&#10;    Munchkin Legends&#10;    Munchkin Pathfinder&#10;    Munchkin Zombies&#10;    Star Munchkin&#10;    Super Munchkin&#10;&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Related Board Games&#10;&#10;&#10;    Munchkin Quest&#10;&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Online play&#10;&#10;&#10;     Vassal does not support Munchkin anymore. Former link: Vassal Module&#10;&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Pegasus Expansions&#10;&#10;&#10;    Munchkin Sammlerbox&#10;    Munchkin Sammlerkoffer&#10;    Munchkin Promotional Bookmarks&#10;    Munchkin Weihnachtsedition - The same as Munchkin, but with a promotional button that grants the wearer extra treasure (when worn in December). &#10;&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Online Playthrough&#10;&#10;There's a great YouTube playthrough with Will Wheaton and Steve Jackson (yes, the Steve Jackson) found here LINK&#10;&#10;",
        "artist": "Alex Fernandez (I),Edwin Huang,John Kovalic,Ian McGinty,Heather Oliver,Philip Reed,Gabby Ruenes"
    },
    {
        "name": "Anti-Monopoly",
        "description": "The &quot;Bust~the~Trust!&quot; Game&#10;&#10;The basic idea of the game is to end the monopolistic practices of the 3-company-combinations of the game board. The players are Trust-Busting lawyers going about the board slapping lawsuits on the monopolies. The winning trust buster is the one who ends with the largest number of social-credit points when one of the players runs out of money.&#10;&#10;There are 3 kinds of company combinations on the board: Oligopolies, Trusts and Monopolies, marked by one, two and three &quot;accusation circles&quot; respectively. &quot;Accusing&quot; is done by placing a small, round chip of the same color as your token on such a circle. When all accusation circles of a combination are covered, the monopolistic practices of that combination have been ended. An accusation chip can be bought from the &quot;Budget-Commissioner&quot;; when lending money, he provides a Social-Credit card as an IOU.&#10;&#10;Variant rules are supplied for a Low-Budget Game and a Trading Game.&#10;&#10;Anspach fought --and won-- a vicious court battle against Hasbro (and others) over this game.&#10;&#10;Anti-Monopoly was briefly (1976-1982) published as &quot;Anti&quot; and &quot;Anti-Monopoly II&quot; was published as &quot;Choice&quot; whilst the company was forbidden to use the word &quot;Monopoly&quot;. In 1984 after prevailing in court the company used the names &quot;Anti-Monopoly&quot; and &quot;Anti-Monopoly II&quot; for its two games.  In 1987, Anti-Monopoly was withdrawn and Anti-Monopoly II was renamed &quot;Anti-Monopoly&quot;.  The game described here was produced as Anti-Monopoly before 1976 and from 1984 thru 1987.  The game produced as Anti-Monopoly after 1987 is a different game, with the same name. Plenty of potential for confusion there, eh?&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Anti-Monopoly II",
        "description": "In this game the players follow either the rules for monopolists or those for competitors. Competitors charge fair rents, build as soon as they own a property, place four houses (green) at the most, after which they build a hotel (red) and occasionally go to Price War. On the other hand, Monopolists extort monopoly-high rents from their poor tenants, build only after they have at least two streets of one color, restrict supply by putting only three houses on their properties, after which they also are allowed to build a hotel (red) and occasionally go to prison!&#10;&#10;The good guys are the small entrepreneurs and the bad guys are the monopolists. Since players do not play by the same rules, fairness is achieved by a win probability equalization technique (which is where the second author comes in).&#10;&#10;Competitors make more money than Monopolists in the beginning of the game but Monopolists can catch up later, especially if Competitors don't watch their money!&#10;&#10;The game was first published as &quot;Choice&quot; because Anspach was forbidden to use the word &quot;Monopoly&quot; by the courts. When that was overturned in 1983, the name was changed to &quot;Anti-Monopoly II&quot;. In 1987, believing that consumer confusion between Anti-Monopoly and Anti-Monopoly II was harming sales of the latter game, Anspach ceased the production of the original game and removed the &quot;II&quot; from the name of the latter game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Key to the Kingdom",
        "description": "The aim is to go around the game board until you've found the &quot;Key treasure card&quot; plus one more treasure card and then escape the kingdom. You may also steal treasures from the other players.&#10;&#10;From the beginning you have 8 different equipment cards, which you need to use to pass traps or defeat monsters. Sometimes you might lose 1 or more of your pieces of equipment, but there's a possibility to get them back at a couple of places on the board.&#10;&#10;The most remarkable thing about this game is that the board is in 6 parts, connected with roads in many combinations, The only way of reaching two of the parts is by jumping into one of the whirlpools in the middle of the board, This allows the board to be folded in or out to another board. There are rules to handle the other players if they get caught on the folded board.&#10;&#10;",
        "artist": "Kevin Walker"
    },
    {
        "name": "Paparazzo",
        "description": "In this auction card game, which comes with a small game board, players try to buy celebrity photos cheaply and sell them for the best price.&#10;&#10;",
        "artist": "Wolfgang Panning"
    },
    {
        "name": "Lao Pengh",
        "description": "Memory-and-discard card game where players try to avoid playing into stacks which already contain any of the symbols on the card they are placing.&#10;&#10;",
        "artist": "Jürgen Martens"
    },
    {
        "name": "XXL",
        "description": "Six card games in one on a special deck of 55 oversized - XXL - cards. Players can either play any one of the six games, or can play one game of each of the six games, totaling their scores to determine the overall winner. The games are More or Less, Stay Low, Passing Permitted, Building Runs, Get them in Sequence and Choose the Suit.&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Kismet",
        "description": "Kismet is a card-and-dice game where the object is to discard your hand and score the least negative points.&#10;&#10;Each player has a hand of 11 cards, numbered 2 to 12. On their turn, they roll three dice. They select two of them, add them together, and discard the card of that value. However, if they are not able to make a total which matches any of their remaining cards, then the first other player to spot this and shout out a total which they do have the card for, may discard their card of this value instead.&#10;&#10;Not to be confused with:&#10;Kismet&#10;Kismet&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Sindbad",
        "description": "Each player plays one incarnation of Sindbad and must, through an amazing series of sea voyages, amass a fortune of one million miskhals by way of trade, treasure, and adventure and return safely to Basra. The sea voyages take you along one of three routes. The routes are of decreasing length, opportunity, and, in some cases, risk. The routes are made up of a series of Unknown Islands, stops in the Known Lands, and trade ports. Movement distance is determined by the roll of a die with the choice of the route going to each Sindbad.&#10;&#10;The adventure cards you draw you may use to help you to defeat monsters, opponents or events.&#10;&#10;The aim is to collect a fortune of a million Mischals and get back to Basra, by fighting monsters or trading in different cities.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Sjörövarön",
        "description": "The game is played in three stages. In the first stage you have to take the map pieces from the other players.&#10;&#10;When you have all the pieces, you know where the treasure is located (since you would know which part Captain Kidd has swallowed = missing) and you can rush away to the hidden place to get the chest.&#10;&#10;In the third and last stage, you have to run away, either with the raft or with one of the rowing boats the player arrived with. All the time the other player can get the map pieces or the chest from you, so you need to be quick and careful.&#10;&#10;Of course the pirates may duel with pistols and shoot cannons at each other!&#10;&#10;A classic childrens game from Sweden, which has been sold over 30 years, although it's out-of-print now.&#10;&#10;",
        "artist": "Folke Eriksson,Ritva Hussain-Shahid"
    },
    {
        "name": "Foppen",
        "description": "A trick-taking card game where the object is to empty your hand.  The twist is the player who plays the lowest card in a trick sits out the next round.&#10;&#10;",
        "artist": "Kazutoshi Hina,Anja Jores"
    },
    {
        "name": "This Game is Bonkers!",
        "description": "A quirky and wild game of racing to twelve points. Players roll dice to move their pawn along a linear track and then play &quot;track cards&quot; where they land to add new instructions to each space moving them further forwards or backwards. These cards stay on the track, where everyone else will also follow those same instructions and add their own cards to the chain reaction.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Ultimatum",
        "description": "Players battle for the Western, Communist, Neutralist and Oil Alliances to control the world in this world domination game set in the not-too-distant future.  Players collect money purchase troops and special action cards, even laser space stations and attempt to oust each other from crucial strategic locations on the board.  A game with an obvious lineage from Risk and other low complexity world domination games.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Ali Baba",
        "description": "Players take turns moving Ali Baba around the game board to their best advantage, trying to unload loot at the most opportune moments, in a quest to collect the most cash.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Mysteries of Peking",
        "description": "As one of the best detectives in Chinatown, you'll have to solve one of the mysteries in the casebook and reveal the criminal. To get clues, you must go to the different witnesses and interrogate them. You may move the dragons with the help of fortune cookies and prevent the other detectives from getting there before you. When you discover the culprit, you must go to the dragon he is hiding in.&#10;&#10;The most important witnesses are the Spy and the Wise Man, so you must reach them as soon as possible in order to get vital information for the case. The Wise Man will tell you which of the witnesses is lying, and the Spy will tell you where the culprit is hiding. But you'll have to visit the rest of the witnesses around the board to get the description of the culprit.. Does he have glasses, a scar, a mustache or a hat? But beware! Some witnesses will have nothing useful to tell you!&#10;&#10;The game includes 3 decoders in order to decipher clues: a red filter to look at general clues, a mirror to look at the &quot;wise man&quot; clue,  and a mask card to check the culprit in the casebook.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Mystic War",
        "description": "The aim is to reach the target on the victory card you have drawn at the beginning of the game. The victory condition may be one of the following: &#10;Archmage (10 followers, 40 mystic power, 10 gold), &#10;City (40 followers, 10 mystic power, 10 gold),&#10;Hoard (10 followers, 10 mystic power, 40 gold),&#10;Balanced (20 followers, 20 mystic power, 20 gold)&#10;&#10;By using cards you try to reach the above options, as well as hinder your opponent. Each 10 of followers make you draw an extra card, each 10 of mystic power make you keep an extra card and each 10 of gold gives you some other advantages. The different levels also gives you other advantages.&#10;&#10;With the resource cards you may either increase or decrease the values on whichever player you want. There are also spell cards, deity cards and event cards, which may affect the game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Kalahen",
        "description": "The aim of this game is to find a formula, which consists of 3 parchment sheets, and bring them back to your own castle, where a dragon awaits you. To make being successful in battle against different monsters or other players easier, you need to collect money, equipment and magic rings.&#10;&#10;The game resembles, in part, &quot;The Hobbit&quot; (with rings, gold, life points, and the same combat system) but isn't close to being identical. For example, the objective of the two games (beginner's and advanced) is quite different.&#10;&#10;According to traditional adventure style, you have to build up your character to make it stronger. You don't get stronger and get more lives (like in Talisman), but you have to get enough healing potions and rings to manage the combat against monsters and maybe against other human opponents.&#10;&#10;You find different things in treasure chests, which you may search through after beating the monster that guards the place.&#10;&#10;There are additional optional rules with traps, wandering monsters, cooperation and high-risk game (a kind of gambling) when you are entering the inner region. You can choose which one or more of those rules you want to add.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Game of Dracula",
        "description": "Ages 7 and up&#10;&#10;&quot;A fiendish game of suspense and fun!  Players plot their escape from Dracula's castle and move stealthily towards the exit.  But beware!  Dracula prowls the castle looking for a victim...&quot;&#10;&#10;The first player to suffer Dracula's bite becomes the &quot;green vampire&quot; and dons the green vampire's face mask.  This vampire then flits from room to room, seeking another victim to take over his role.  Any further victims of Dracula go back to the vault and must attempt their escape from square one again.  The Dracula and Green Vampire pieces actually engulf the players' playing pieces when they're &quot;bitten&quot;.&#10;&#10;A simple, fun chase game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Game of Nations",
        "description": "Contents: Playing board, 4 sets of playing pieces (2 kings, 2 politicians, 1 dictator, 1 guerrilla and 1 secret agent), 16 tankers, 12 pipelines, currency and a pack of 16 &quot;international incident&quot; cards.&#10;&#10;This game is a geopolitical simulation of local influence in the Middle East on the flow of oil supplies to the rest of the world.&#10;&#10;The map shows 8 fictitious Middle Eastern oil producing countries, one of which controls the Canal that links both ocean sides. If your superpower is on one ocean and you try to obtain oil from a country bordering on the other ocean, the Canal becomes of vital strategic importance. The alternative is to connect that country to another on the &quot;correct&quot; side of the board (through the land-locked middle countries, which are also bigger producers) with a series of pipelines. To move oil you must, of course, have a friendly leader in place at the head of that country.&#10;&#10;You start with a leader of your color on the capital of a country and one tanker that can transport oil from that country's port to your country. To reflect a level of organisation, oil is worth more per shipping if a king or politician is in place than a dictator or guerrilla, whose job is more offensive. You spend money to move leader pieces about the board, with the managing pieces costing more than the offensive pieces. Secret agents also move each turn and are used to defend attacks by blocking the path of opposing leaders and for moving onto &quot;?&quot; spaces to take a gamble on an incident card. At face value, half the cards are favourable and half not, but all offer diplomatic opportunities for the country who is most stable.&#10;&#10;To survive players must continually manage risks while trying to maximize their oil revenue. Early bold attacks, even combined with the right incident card, are not recommended: a co-operative approach to the game maximises revenue to offset the many accidents which can happen in the game.&#10;&#10;From the Waddington ad for the game dated 1972:&#10;&#10;A political strategy game&#10;&quot;In the modern world of international diplomacy and intrigue, there are many stakes in this game of economic survival. That means energy and the key to energy is oil. In this game there is but one object - and that is to survive&quot;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Myst",
        "description": "Two teams race to put together a jigsaw puzzle of Myst Island, then take turns playing cards that match the artifacts found at various locations.  Most points after all the cards are played wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Last Word",
        "description": "Players pieces are set down on a 10x10 grid of letters and wild spaces. Each turn a player must make a word in the style of Boggle, then pick up the tiles used. As tiles are removed, scoring opportunities become more sparse, and players are eliminated when they cannot make a legal word. Bonus points are scored for isolating a player on one tile, and points are scored based on the tiles each player picks up. First to fifty points over as many rounds as it takes, wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "5 Alive",
        "description": "Theme&#10;5 Alive is an abstract card-playing game.&#10;&#10;Goal&#10;Each player starts with 5 lives. The winner is the last player to have any lives left.&#10;&#10;Gameplay&#10;Each player in turn plays a card from their hand. 'Normal' cards have a face value, and the aim is not to play a card that takes the running total above 21. If you do, you lose a life. If you manage to play the last card from your hand without taking the total above 21, then every other player loses a life. As well as 'normal' cards, there is also a variety of 'wild' cards that perform special actions, like resetting the running total, skipping the next player, reversing the direction of play or causing other players to draw extra cards.&#10;&#10;Re-implemented by:&#10;&#10;Boom-O&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Tribond",
        "description": "Players are given a list of three items and must determine the common bond.  Landing on another pawn brings up a challenge situation, where the winner stays put and the loser moves back.  The first team to bring their three pawns around the triangles wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Risk 'n' Roll 2000",
        "description": "The old dice game of &quot;Five Thousand&quot; has been given new scoring systems, wild cards to change the rules, and 2000 points wins the game.  Now, two triples or three pairs scores 500 points, and some cards allow a deuce to score 20, while others drain off opponents when you score.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Campaign",
        "description": "Not to be confused with Campaign, the identically named game produced by Wills and Hepworth in the 1940's.&#10;&#10;&quot;An exciting strategy game in which each player can become a Napoleon or a Wellington leading his army across Europe.  Famous battles can be re-fought and alliances can be made and broken with this compelling game of military and political strategy&quot;&#10;&#10;Large playing board in three sections, four sets of army pieces in red, white, blue and light green, comprising 1 General, 9 infantry and 9 cavalry units.  Six sets of 4 town cards of different colors, 4 alliance cards, 2 dice, 6 page rule book, and a 4 page &quot;The Years of Napoleon&quot; historical booklet.&#10;&#10;The game reproduces the Napoleonic wars at the strategic level in a very abstract fashion (all players are equal).  It can be won either by the outright defeat of your opponent, or (more likely) by acquiring towns controlling large areas of territory.  The board is an abstract representation of Europe and western Russia and is divided into six areas of roughly equal size representing France, Prussia, Russia, Austria, Italy and Spain.&#10;&#10;Each country has four provincial towns, and five of the countries used as starting countries also have a capital city.  Parts of the board, particularly the central area, have areas of impenetrable mountains, forests, and sea which restrict the movement of the troops.&#10;&#10;There are introductory and standard rules.  Normally, each player selects a country, but in the two player game each gets two countries except that the France + Prussia combo is not allowed.&#10;&#10;The pieces move using the dice, and combat is deterministic.  The throw can be used all on one piece or many pieces.  The full throw does not have to be used.  The pieces are placed in a set format on the country selected, with the General on the capital square and four infanty and four cavalry. The town cards are used to keep track of who controls what.&#10;&#10;The pieces move in set ways. The General moves one square in any direction. When it attacks it has a value of one and when defending a value of two. The General must be present to take a town.  Cavalry moves two squares at a time and must move horizontally or vertically but never diagonally.  Infantry moves one square and only diagonally.  Pieces cannot pass through opposing lines unless there is a clear gap of at least one square.&#10;&#10;Combat is like movement: one considers which pieces could be moved to the target piece's square and totals up the combat value --if large enough, the opposing piece is removed.  Only one piece can be attacked in a turn.  In the standard game, adjacent pieces also support each other (in a manner reminiscent of Diplomacy), which introduces a fair amount of tactics in on-going battles.&#10;&#10;Lost pieces are regenerated in your country's mustering area, forcing you to keep a constant flow of recruits towards the front.  In the standard game, the towns also represent logistical support --lose the town and you lose the corresponding piece.&#10;&#10;The odd movement system means you actually have two sets of cavalry and infantry pieces on the board, each set (which we could call &quot;odd&quot; and &quot;even&quot;) being unable to assist the other.&#10;&#10;A capital can only be captured after the provincial towns have been captured.  Where more than two players are playing you can agree to ally with another player and exchange alliance cards as reminders.  An ally cannot cross into his ally's territory without his consent.  Alliances can be broken simply by announcing the fact; you can attack your former ally on your next turn only, giving him a turn to re-deploy.&#10;&#10;The game is won if the player captures all his opponents capitals or captures 8 towns of any colour but not including the 4 in his own country.  You also win if your opponent's General is left with no troops.&#10;&#10;Campaign is basically a pure strategy game.  It you are in a position to attack a piece, you will take it.  However, there is some luck depending on how high a movement throw you have.&#10;&#10;from the Waddington ad for the game from 1976:   &quot;This absorbing strategy game captures the tension and the pressures of the famous Napoleonc battles. Alliances are made and broken and complex manoevers bring victory or defeat&quot;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Mertwig's Maze",
        "description": "From the back of the folio:&#10;&#10;Wise and beloved King Mertwig lays dying.  His only children, a twin boy and girl, were stolen by gypsies long ago when they were still babies.  Mertwig, desperate that his kingdom not fall into evil hands, announces a contest: Anyone who can present to him a Royal Treasure and a Royal Birthmark will be named heir!&#10;&#10;But treasures (not to mention birthmarks) are not exactly easy to find.  And after a would-be Royal Heir tracks them both down, he (or she) must present them to King Mertwig - and that requires braving the dangers of Mertwig's Maze!&#10;&#10;The Mertwig's Maze game is a lighthearted fantasy boardgame from Tom Wham, designer of numerous games published in Dragon magazine, including the classic Snit Smashing and Snit's Revenge.  In the Mertwig's Maze game, you are the would-be heir to Mertwig's throne!  Can you complete your quest, get past the Mystic Musk Ox in Mertwig's Maze, and reach the finish before the other players?  More importantly, can you claim the throne before Mertwig passes on and the kingdom falls into the clutches of evil?&#10;&#10;The Mertwig's Maze game contains a large game map, eight smaller maps, full-color counters, and hundreds of cards depicting hirelings, magical items, arms and armor, and random events to aid your quest - or hinder your opponents'!  Mertwig's Maze game can be played by two or more players, and is recommended for ages 10 and up.&#10;&#10;",
        "artist": "David C. Sutherland, III,Stephanie Tabat,Tom Wham"
    },
    {
        "name": "Point Of Law",
        "description": "Part of the 3M Bookshelf Series later acquired by Avalon Hill&#10;&#10;From the box:&#10; &quot;POINT OF LAW is an exciting game of involvement for all players. You are the judge and jury! You decide which argument is most convincing. Many an interesting discussion -- and an occasional laugh or two -- takes place as players use logic and intuition in reaching their decisions.&#10;&#10;&quot;Will your decisions be just? Will you declare the 'Feral Financier' a public nuisance? How will you rule in the case of the IRS against the 'Self-Rising Sinner'? Can the 'Mixed-Up Marriage' be annulled? Was the 'Midnight Murder' really murder? Any number can play. Bookshelf case contains Point of Law Case Book with 100 courtroom dramas and decisions, decision sheets, score board and marker.&quot;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Oh-Wah-Ree",
        "description": "Part of the 3M Bookshelf Series later acquired by Avalon Hill.&#10;&#10;From the box:&#10;It takes a fascinating game to live on for 3500 years, and to have devotees in nations all over the world. Such a game is OH-WAH-REE, now available in a special edition to suit modern tastes. Like other historic games, OH-WAH-REE appeals to players of all ages; children love it as a fast-moving game of pebble and pit action and capture; adults, playing in another dimension, enjoy it as an exercise in long-range planning and execution. OH-WAH-REE can be played by two, three, or four players. The contoured fold-away board, pebbles, markers, and instruction folder go into a handsome case which fits easily on any bookshelf.&#10;&#10;This is a  Mancala game with additional rules to allow play for up to 4 players.  The players mark their pits by placing a colored marble in a hole next to the pit.  The pebbles are genuine stone pebbles that have been tumbled to make them smooth.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Game of the Year",
        "description": "(Spears Edition) Players spin a calendar wheel and move forward the designated number of days around a board representing a leap year calendar.  Blue days have bad consequences, red days good ones and purple link to historical facts that can be bad or good.  Players earn money and collect Red Letter day tokens along the way.  The player with the most Red Letter Day tokens at the end of the year wins.&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Outburst Junior",
        "description": "The version of the classic party game for kids from four to ten years old.  Different color cards make for a fair game between different age levels.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Das GROSSE und das kleine A",
        "description": "This is another Karriere Poker/Great Dalmuti-like game with the requisite minor twists and tweaks. The deck is formed by combining two traditional card decks including jokers. Added are two special cards, one showing a large &quot;A&quot; the other a small &quot;a&quot;. Players attempt to go out first or if not, to avoid being stuck with too many high point parts, especially not the &quot;A&quot; which ends up being passed from hand to hand.&#10;&#10;Re-implemented by:&#10;&#10;    Ochs & Esel (2008)&#10;    Who's the Ass? (2004)&#10;&#10;&#10;&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Schwarzmarkt",
        "description": "Players influence commodity values by playing cards, deciding when is the most opportune time to sell on the Black Market.&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Black Spy",
        "description": "The trick-taking game Black Spy is a film noir take on Hearts as you want to enlist the best spies you can while avoiding the black spies, who will always turn against you.&#10;&#10;Black Spy lasts a number of rounds, with players scoring points each round. The game is played using mostly standard trick-taking rules: Each turn, someone plays a card to the center of the table, then in turn each player lays down (if possible) a card matching the suit or rank of the card led, throwing out any other card otherwise. The highest card in the color led wins the trick, and that player leads the next trick. Points come only from the black cards, with the black spies (yes, &quot;spies&quot;, with six black #7 cards) being worth ten points each and all other black cards worth 1-5 points. When someone reaches 200 or more points at the end of a round, the game ends and the player with the lowest score wins.&#10;&#10;",
        "artist": "Philippe Guérin,Charles Kibler,Doris Matthäus,Chris Quilliams"
    },
    {
        "name": "Material World",
        "description": "A game of building caravan/shipping routes to new territories to acquire resources and carefully using them to increase the level of civilization while avoiding or defeating the armed forces of the opponent. The map covers the entire world and the five possible powers are Britain, Germany, France, Russia and the Ottoman Empire.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Overturn",
        "description": "From the designers of Othello.&#10;&#10;Overturn sports a modular board that changes with every game. It's kind of like a &quot;find the hidden word&quot; puzzles you used to play in the newspaper. Each player places colored rings over letters to make words. If you use the rings already placed by your opponent, you may turn the rings over to your color. Winner is the one with the most rings after all the letters have been used, or no more words can be made.&#10;&#10;Essentially Othello with words.&#10;&#10;1993 Mensa Select&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Spy Alley",
        "description": "Each player assumes a secret identity (nationality) at the start of the game. The object is for each player to collect all the necessary items of their nationality and land on the winners square. (players need to get a codebook, disguise, key, and password) However, if an opponent guesses your identity before you win, you are out. If they incorrectly guess, then THEY are out. Players bluff by purchasing items of nationalities that they do NOT need to win.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Emperor of China",
        "description": "In this highly abstract strategic wargame, you are trying to conquer China by being the first to occupy fifteen provinces at the completion of a complete round of play (all players having had an equal number of turns).  Alternatively, the game can be timed and scored.&#10;&#10;You start with a small number of provinces under your control.  Population counters of your colour indicate this; if a province has extra population, it can move some into an adjacent unoccupied province --this is the simplest way of conquest.  Merger, diplomacy and force (Risk-like combat) are your other options.  Each turn you draw a Yin card and a Yang card.  Yin is bad, Yang is good.  Without looking at either card's instructions, you assign them to two of your provinces.  Yang will most likely increase your recruitment (which is normally three population per turn), but could also give you the capability to cross a natural barrier like a mountain range.  Yin will hurt you.  Some cards you end up holding in your hand.&#10;&#10;A player may attempt to convince another player to merge with his empire.  If the second player agrees then the smaller empire is absorbed by the larger and both players continue play as senior (larger) and junior (smaller) partners.  The absorbed empire no longer has a separate turn nor separate recruitment.  This concept of &quot;shared victory&quot; is intriguing, particularly with a larger number of players.&#10;&#10;The game allows any number of players but components are only provided for five.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Ace of Aces: Jet Eagles",
        "description": "From the makers of Ace of Aces, the WWI dogfighting game, comes Jet Eagles, the Modern Air Combat Game. Gameplay is very similar to Ace of Aces (two books each depicting the view from your fighter jet) with rules for advanced weapons such as missiles. Players each choose their maneuvers, and then using a formula, turn to a new page in their book to see the outcome.&#10;&#10;",
        "artist": "Rosaria Baldari,Jim Peters"
    },
    {
        "name": "Stop Thief",
        "description": "ELECTRONIC COPS AND ROBBERS.  Featuring the ELECTRONIC CRIME SCANNER.&#10;&#10;A crime is being committed&hellip;but where?&#10;&#10;In the jewelry store?  The bank?  Where will the thief strike next?  You and your opponents are licensed private detectives.  The thief you&rsquo;re after is computer controlled and completely invisible.  But you can hear him!  With your ELECTRONIC CRIME SCANNER you can eavesdrop on the thief whenever he moves on the board.  You can hear him in the act of committing a crime.  You hear him, too, as he opens a door, crosses a floor, breaks a window, runs on the street and escapes on the subway.  Each sound you hear is a clue that will help you track him down.  You&rsquo;ll need all your skills of deduction and logic to follow the thief and corner him.  Then you can call the police.  With luck, the police will arrest the thief and cart him off to jail.  Sometimes, though, he escapes from them.  At other times, he&rsquo;s just not where you think he is!  If you can catch this thief, you&rsquo;ll earn a large reward.  If he gives you the slip, he&rsquo;ll rob again&hellip;and again&hellip;and again&hellip;&#10;&#10;Features&#10;&#10;&#10;     On the board are 19 different locations where the thief can commit a crime&#10;     If you need another clue, a hot tip or some extra cash, play the appropriate Sleuth Card on your turn.&#10;     To earn a reward, you&rsquo;ll have to arrest the thief before one of your opponents does.&#10;     Add $100 to the reward for each additional crime that the thief commits.&#10;     The winner of the game is the first detective to earn $2500 in reward money.&#10;&#10;&#10;Track and arrest the thief with the ELECTRONIC CRIME SCANNER&#10;&#10;&#10;     Use this powerful computer to track the escaping thief.&#10;     Follow the thief with electronic sound effects.  Listen for crime alarms, creaking doors, breaking glass and more.&#10;     The digital readout instantly flashes additional information.&#10;     The tipster can tell you exactly where the thief is hiding.&#10;     Use the numbered keys to show the police where to make an arrest.&#10;     The clue button allows you to eavesdrop on the thief whenever he moves&#10;&#10;&#10;&#10;     A limited warranty is enclosed.  Ask to see the retailer&rsquo;s copy prior to purchase.&#10;     Required, but not included, is a 9-volt alkaline battery.&#10;&#10;&#10;",
        "artist": "Robert Doyle"
    },
    {
        "name": "Zargo's Lords",
        "description": "The first fantasy wargame ever published in Italy. A big success in the '80s, a game who introduced a lot of people in the hobby.&#10;Some people say that the game is unbalanced (I'm afraid it's true), expecially in the 2-player game, when it's not possible to form alliances. Lack of playtesting?&#10;&#10;Other related games:&#10;- Zargo's Lords 2: Expansion Pack (International Team): an expansion for Zargo's Lords, with two new fantasy races&#10;- Blue Stones (International Team): a new wargame on the world of Zargo, with 3 new races.&#10;- Zargos (Eurogames): Duccio Vitale did a Risk-style game in the world of Zargo&#10;- Warangel: fantasy wargame inspired by ZL.&#10;&#10;",
        "artist": "Enea Riboldi"
    },
    {
        "name": "Tutankhamen's Revenge",
        "description": "Each player starts by putting, in order, one layer each in the card box. When all cards are put in the box an upper layer finishes the process. The card box is then rotated a couple of times until none of the players are sure which cards lay where.&#10;&#10;Then each player tries, with help of the &quot;spade&quot;, to &quot;dig out&quot; as many cards with plus points as possible. Those plus points are worth money.&#10;&#10;As soon as you stumble upon a minus card, you have to give the spade to the next player, lose all the money you collected so far this turn AND pay the minus penalty. You may also stop anytime before.&#10;&#10;The player who has collected the most money when the game ends, is the winner.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "True or False",
        "description": "The aim is to correctly answer as many true/false statements as possible, so you can go around the game board before everyone else.&#10;&#10;For every wrong answer you give you have to move closer to the center of the board. If you hit the center and you have to restart the game. On the other hand the track is shorter near the center. For each right answer, you may choose to move outwards as well.&#10;&#10;The statements are from different time ages:&#10;- Before Christ&#10;- Year 1 - 1899&#10;- 2000th century&#10;- Anytime&#10;The time age depends on the current colour your counter stands on.&#10;&#10;New changed rules, doesn't force you to restart from the beginning after running through 3/4 of the board, but only one step backwards.&#10;&#10;The Finnish version by Anv&#195;&#164;ndbart Litet F&#195;&#182;retag does not have time ages, but rather four different categories - 'It Can Happen', 'Delicious', 'Naturally' and 'This &amp; That'&#10;&#10;The Norwegian version by Damm / Egmont does not come with a game board, but the players bet money on how sure they are in their beliefs. First player to 1 000 000 wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Trivial Pursuit: Family Edition",
        "description": "Like Trivial Pursuit, but you have both senior and junior questions in different boxes, so the whole family can play it.&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "Magical Maze",
        "description": "With the aid of the Wizard, you'll try to get the gold (a magnet underneath the labyrinth), to your own corner of the game board. You'll need to remember the way, except there are goblins trying to stop you.&#10;&#10;When the Wizard lowers his arm, you move back a square and the next player then tries to make it towards his corner instead.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Spectrangle",
        "description": "The object of the game is to score the highest number of points. You achieve this by aiming to score as high as possible, and by trying to block the other player(s) or team. When the triangular board is filled or all players are blocked the game is finished.&#10;&#10;The game contains 36 colored triangles, with all kinds of combinations. Triangles with fewer colors score more. All triangles must be placed adjacent to already placed triangles. You score by multiplying the number on the triangle with number of adjacent sides and the bonus point at the bottom of the board (if more then 1).&#10;&#10;You either play with 2 persons or 2 teams (4 persons).&#10;&#10;The original game published by Greystone in 1989 had 60 &quot;trangs&quot; and an enlarged board and was advertised to be played by 1 to 8 players aged 5 to 135 [sic].&#10;&#10;",
        "artist": "Alain John Fraser-Dackers,Maxwell Graham Gordon,Lester Wynne Jordan"
    },
    {
        "name": "Titanic: The Board Game",
        "description": "&quot;Gossip with other passengers, receive telegrams and collect all five pieces of your personal property to advance from the Second Class to the First Class section of the ship.  But watch out, you might get put back in steerage or, worse yet, never make it to your lifeboat in time...&quot;&#10;&#10;Using a system similar to Escape from Colditz, in this game you must collect the necessary items (passport, valuables, life vest, room key, etc.) to make it to a lifeboat before the Titanic sinks.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Top Banana",
        "description": "from Translation:&#10;A long way away there are a few palm trees, an a bit more sunshine than here, a wild band of monkeys and many bananas. We are right in the middle of of a typical banana paradise. Nothing disrupts the peace. Nothing except the wild shrieks from atop a monkey rock. The monkeys have a competition for the title Top Banana today. Let us see what happens&hellip;&#10;&#10;With orderly quick movements monkeys leap from rock to rock, first up, then down. Each has just one goal, to sit higher than the others at the end of the round, so he can get the best view. Unfortunately only the one who can do this the best can claim the title Top Banana.&#10;&#10;",
        "artist": "Vincent Kim"
    },
    {
        "name": "The Gothic Game",
        "description": "&quot;The object of the game is simple... to kill every other player on the board!&quot; An odd little gem from England. It's essentially a roll and move game with a board depicting a big, spooky haunted mansion. You move about the mansion, acquire weapons to assist in your murder spree (I'm serious), suffer the horrid effects of torture devices, get chased by Dracula (and possibly drained of blood and turned into a vampire yourself), pour boiling oil on your friends, etc.&#10;&#10;It's a bit sick-and-twisted, but it's also silly fun with the right group of gamers! It has an endorsement by Terry Jones of Monty Python fame on the back of the box, so it HAS to be good, right?!?!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Frag",
        "description": "Frag is the essence of early first person shooters like Doom and Quake distilled into a board game.  The tagline sums up the game: &quot;If it moves, shoot it.&quot;&#10;&#10;Players create characters by assigning stat points and spawn on the game board, then roll dice to move around the board, pick up weapon and gadget cards, and shoot at opponents.  There are also cheat cards that can be used to gain an advantage on other players when they least expect it.  When players are killed they respawn on their next turn and the first player to score three kills is the winner.&#10;&#10;",
        "artist": "Thomas Biondiolillo,Alex Fernandez (I),Philip Reed,John Zeleznik"
    },
    {
        "name": "Time: The Game",
        "description": "Players attempt to score sixty points in each decade from the twenties to the seventies.  Each turn gives the player a choice of two categories to answer a question from.  The third die determines the point value and difficulty: 10 points for a True/False question, 20 for multiple choice, and 30 for short answer.  First to get 60 points in all decades wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Triology",
        "description": "Triology is a melding of SET and rummy.  Each turn players look for SETs in their hand of nine cards, drawing if they cannot lay down a SET.  Players may also poach off of other players SETS if they contribute at least two new cards.  Hands Off! cards prevent this, and players score points for the number of SETs scored when a player runs out of cards.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Skirrid",
        "description": "Coming in a very awkward-sized box (42 x 42 x 3 cm), this is a distant relative of Scrabble. The 19x19 board is colored in two distinct areas, the central lozenge (just reaching the edges) being called the arena. The squares are sprinkled with numbers, of values increasing near the outer corners. The players have sets of 18 (for the two-player game) clear and smoked plastic of tangram shapes, some of which have a 2 or 3 over a certain square.&#10;&#10;Starting in the center, the players lay their pieces so as to score, adjacent to an existing piece. A piece normally scores the numbers it covers; if it has a number of its own and that number falls directly over a scoring square, they are multiplied. You can sacrifice a piece by playing it upside down; it scores half (rounding down) and the opponent isn't allowed to play a piece adjacent to the sacrificed piece on his next turn --this is a neat trick when approaching a high-scoring area. You cannot sacrifice on the first turn. You cannot play outside the arena until you've accumulated at least 75 in score.&#10;&#10;Score is kept with the help of tracking pieces on the outside edges of the game board.&#10;&#10;The playing tiles come in six different shapes, each with their own name:&#10;&#10;The Eye (covers 1 square);&#10;    The Rod (covers 2 squares);&#10;    The Quoin or Corner(covers 3 squares);&#10;    The Snake (covers 4 squares);&#10;    The Door (covers 5 squares);&#10;    The Gun (covers 6 squares).&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Trippples",
        "description": "Trippples is played on a 8&times;8 board as opponents race from one corner to the other. On the board are placed, in a pre-movement round, tiles with three arrows which point to three of the eight surrounding spaces. Each player plays these tiles alternatively until they have all been played. Movement is made by following the arrows, and avoiding the neutral zone in the middle. The game ends when one player reaches his goal or when both players cannot make legal moves.&#10;&#10;The key game mechanism is that your move options are determined not by the three arrows on the tile under your (transparent) game piece, but by those under your opponent's piece. Thus, each move is chosen to try and limit your opponent's next as well as to try and guarantee yourself a good selection of choices. This adds an element of bluff and second-guessing to the game.&#10;&#10;The rules also include some variations to the two-player game that make the game easier or harder to finish.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Shogun",
        "description": "Shogun: An exciting digital game.&#10;&#10;This game plays on a 8&times;8 grid, with each player having 7 pawns and 1 King, which start lined up on opposite sides of the board.  Each player can remove the other's pieces by moving onto them, as in chess.&#10;&#10;But what sets this game apart is that there is a window on each piece, which shows a number indicating the number of moves that piece can make.  And due to the working of many magnets under the board, the number automatically changes depending on which space the pawn or king is on.&#10;&#10;Each of the pawns responds differently on the board.  After several games the board can be rotated to keep the players guessing.&#10;&#10;",
        "artist": "Walter Schels"
    },
    {
        "name": "Non-Violent, Politically-Correct War",
        "description": "War has dramatically changed over the years, but the card game that bears its name hasn't until now. For the first time, War incorporates Love, Peace, Diversity, and Unity. Players compete to get rid of their cards first, while trying to avoid the heavily-armed Joker (the weakest card in the deck).&#10;The key differences between this game and standard War are:&#10; - The Joker is the lowest card in the deck - it loses to every other card.&#10; - When players put down cards of the same rank, instead of having a &quot;war&quot; right away, they cooperate and by trading decks, then have a war.&#10; - The first player to get rid of all his/her cards wins.&#10;&#10;The suits are of different icons (peace symbols, unity symbols, hearts with an arrow through it, etc) from a normal deck of cards and the deck includes one blank card which can be used to replace a lost or damaged card OR create a new wild card.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Up the Creek",
        "description": "An interesting card game where players try to complete three canoes using various cards with parts of the canoes on them.  These include:  Indians or empty sections of the canoe, Prey or Booty (Birds, Skins, Tobacco, Firewater, Teepees, Powder Kegs), Hunters (Bear hunter, Buffalo hunter, Cowboy, Gold prospector, Lumberjack, Soldier), Hunters Prey (Bear, Buffalo, Horse, Gold, Log, Cannon {each prey coming split on two cars}), Medicine Man, and Totem Pole.&#10;&#10;Players strive to finish the game with the most valuable canoes where length of completed canoes, prey and booty, Hunter with Prey and special cards all add to your score. Players can use Indians with a bow or lasso to affect other players canoes.  They can also use completed canoes to attack others with devastating results.&#10;&#10;The original Pelikan edition (Ogallala), in their flat box series, included player mats and allowed for 2 to 4 players. The Waddingtons edition (Up the Creek) also includes player mats for 2 to 4 players.&#10;&#10;",
        "artist": "Oliver Freudenreich,Rudi Hoffmann,Guido Hoffmann"
    },
    {
        "name": "Target",
        "description": "Poker meets rummy. Players seek to collect sets of cards specified on the target cards, and may complete several target sets with the same cards ...&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Pico",
        "description": "Second-guessing game with just 11 cards in the deck. Players select cards simultaneously; high card wins unless it's more than twice the opponent's play. Losing card is returned to its owner's hand, while the winning card is scored.&#10;&#10;Card distribution is slightly different than that of Pico 2. Pico cards run 2-10, 13 and 16. The later version, Pico 2, sees the cards run 4-13, 16.&#10;&#10;Re-implemented by: &#10;&#10;    Pico 2&#10;&#10;&#10;&#10;&#10;",
        "artist": "Doris Matthäus"
    },
    {
        "name": "Probe",
        "description": "Players try to guess each other's hidden words.  An activity deck spices things up a bit by altering scores or revealing letters.  No player is left out of the game because even if their word is revealed they continue to guess opponent's letters and score points.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "A Line in the Sand: The Battle of Iraq",
        "description": "This is a game detailing the Persian Gulf War fought in the early 1990's. Many of the mechanics are similar to that of one of TSR's other wargames (Red Storm Rising) so players of that game can rather easily go to this game.&#10;&#10;Two versions of this game are played. With less than 5 players, the game is a &quot;Basic Game&quot; where military might is what wins the game. Players take sides, usually a combination of Middle Eastern nations plus the US. In the two player version, for instance, it is (quite predictably) the US &amp; Allies vs. Iraq; in the three-player game &quot;Holy War&quot;, it's Israel vs. Iraq (and Yemen and Jordan) vs. Saudi Arabia (and Syria, Libya, and Lebanon), and so on.&#10;&#10;Combat rules are rather straightforward, and wargamers will be familiar with many of the mechanics. Land (w/ infantry, Iraqi National Guard, and tanks), sea, and air units are all utilized. Most units can take a few hits before removed from the board.&#10;&#10;The Gameboard is big and beautiful. It has large areas denoting the nations of the Middle East, with some abstracted land to shore up the U.A.E. and some islands. It also has oil wells and airbases, as well as some other stuff.&#10;&#10;The *real* game, though, is the six-player diplomatic game. The players are now clearly defined: The US (NATO), Iran, Israel, Iraq/Yemen, Moderate Arabs (Saudi Arabia, Egypt, Kuwait, etc.), and Volatile Arabs (Jordan, Libya, etc.) This adds a crucial element of diplomacy and politics, and makes the game much more interesting than the normal wargaming stuff. A &quot;War Fever&quot; and &quot;Jihad&quot; marker change as nations do things--for instance, the first time a US unit is attacked outside of Turkey, War Fever &quot;tripwires&quot; to 10. If Israel attacks a neighbor, Jihad increases by 2. War Fever and Jihad permit certain things to happen--for instance, if War Fever gets too low, the US is restricted in whom they may attack. If Jihad hits either 1 or 10, revolutions may occur--which can switch entire nations to another player!&#10;&#10;Messages can be sent to other players via a diplomatic pouch--you cannot simply pull another player to the side and whisper in their ear. All messages, once read, go into a big pouch, and players can make diplomatic gestures to read some of the messages after they're read.&#10;&#10;Victory occurs, in any case, when you meet objectives, which can vary from player to player. &quot;War Aim&quot; chits are drawn before the game begins, and so players are not quite certain as to exactly what other players are going for. For Instance, Iraq may win if they capture and hold Kuwait for the last three turns; if Jihad has reached 10 at least once and 10 non-Muslim units have been destroyed (by anyone); or by controlling three more oil fields than they started with. It all depends on what they looked for.&#10;&#10;All in all, the Diplomatic game changes the basic game so much that political considerations are as important as military ones.&#10;&#10;A simplified version of the game with the same name appeared in the TSR comic Warhawks #3. Advanced scenarions for the game in the comic appeared in Warhawks #4.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Great Khan Game",
        "description": "The Great Khan Game includes one 32-page rule book, one 11&quot; x 17&quot; full-color map of the Whamite Isles, 120 die-cut cardboard playing pieces, 162 playing cards, and one plastic storage bag.&#10;&#10;This is a card/strategy board game for 2 or more players.  The game is set in the Whamite Islands.  It is a very fun game, which usually lasts an hour or so depending on the number players and chance.&#10;&#10;The idea of the game is to make as much gold as possible by controlling countries within your own little empire from the dozen or so provinces available.  The game uses a card system with a lot of clever design tricks added on to provide depth.&#10;&#10;The game play within your turn is easy to pick up, but requires much thought to get right. You are dealt six cards initially, which will usually give you weak control of a couple of countries. These can be added to each turn by drawing two free cards or taking the top card from the discard pile. Additionally, you can buy extra cards every turn.  Having checked the cards for events and acted on those immediately, you can make 'melds,' war and political manoeuvres before compulsorily discarding one card.&#10;&#10;The heart of the game is the 'meld.' A meld is simply the act of laying one or more cards from your hand in front of you, thus activating their powers. By having the most powerful political meld on the table (determined by the total number of flags on the melded cards), you control that country until toppled by better politics or combat. Each country normally has a couple of leaders, often with low numbers, and a varying number of higher-numbered followers who might be loyal to any leader card or just one.&#10;&#10;Power can be stolen in two ways: political coups where you lay more flag cards than are currently melded (you take over those cards as well - those willing rally to your cause), or by the time-honoured invasion force.&#10;&#10;Combat is simple enough, but can prove a little fiddly at times. Once battle is joined, a d6 is rolled to see how many rounds the battle will last. Rolling a one when there are two large armies will virtually guarantee a non-result, whereas a six will give both sides a good chance of a win. Swords kill simply on a roll of five or six, castles get to 'fight' in defence, and defending ships must be beaten first.&#10;&#10;The game has an excellent basic structure.  The key to the game is the balance of military, political power, and wealth.  It really works well.  But, as always, there are improvements to be made and rules that can be changed to improve or change the flavor of the game.  But, the reason why the game works well is that there is an excellent structure underlying the few contested rules.&#10;&#10;It's worth adding that a lot of the fun comes from the irreverent humour on the cards--just in case you thought you were playing a serious strategy game.  Names are satirical, silly, or obtuse references to real world people, places or events.  For example, there's a castle named &quot;Ratlarbig&quot; (look at it closely), a character called the &quot;Sorcerer's Apprentice&quot; and a group of soldiers called &quot;The Bloody Buggers&quot;. It's a hoot whether you're winning or losing.&#10;&#10;",
        "artist": "Jeff Dee,'Manda Dee,John Lakey"
    },
    {
        "name": "Panzer Command",
        "description": "Panzer Command is a tactical level simulation of armored combat, recreating the battles that raged across the steppes of the Soviet Union during the middle years of World War II.&#10;&#10;Each of two players commands the 40 to 60 company-sized units of a German armored division or Soviet tank corps, maneuvering forces across treacherous terrain to engage the enemy in a life or death struggle.  &#10;The challenge of battlefield command is yours in the thought-provoking, exciting game experience of Panzer Command.&#10;&#10;",
        "artist": "Ted Koller"
    },
    {
        "name": "Sixth Fleet",
        "description": "Sixth Fleet is a simulation game of near-future combat for control of the Mediterranean Basin.  As commander of the U.S. or Soviet fleet and respective allies, you must form your ships into Task Forces  and attempt to cripple the enemy&rsquo;s capital ships and submarines.  Your limited air assets must be carefully assigned to defensive and offensive missions.  Commando, parachute and amphibious assault units stand at the ready to capture vital objectives.  Most important, you must protect your supply and replenishment ships, or your fleet will be unable to maintain combat momentum.  Sixth Fleet is a comprehensive simulation of the myriad elements involved in future naval confrontation.&#10;&#10;Each 8 hour game turn is broken into 3 distinct phases (sub, surface, and air) and each player takes turns choosing which phase they wish to conduct. Ex. if the US player chooses &quot;Air&quot;, they conduct all bombing, shipping strikes, anti-sub, and interception actions for all their aircraft.&#10;Players also use their units to attempt to &quot;detect&quot; enemy forces so that an attack can be made. Ships and aircraft are always detected once a unit moves close enough to them, but players have to roll to try to detect subs.&#10;Optional rules include nuclear weapons and logistics.&#10;About 14 scenarios are included which range from about 60 minutes (for Introductory Scenarios) to 3 to 6 hours (for Intermediate Scenarios) to 20 or more hours (for the Advanced Scenarios).&#10;&#10;Part of Victory Games Fleet Series.&#10;&#10;",
        "artist": "Ted Koller,James Talbot"
    },
    {
        "name": "Restaurant",
        "description": "Players vie to become head waiter at a resaurant by most effectively serving their tables and blocking opponents.&#10;&#10;",
        "artist": "A. Lefort,J. C. Sohier"
    }
]