[
    {
        "name": "DAK",
        "description": "The 5th entry in The Gamer's popular Operational Combat System, and the grandest in scope, DAK covers the entire North African campaign at the regimental level, from Compass to El Alemain and beyond.&#10;&#10;This is the most specialized of the OCS titles, with rules for the Commonwealth brigades &amp; unusual organizations, minefields, the Greek campaign, and a variety of others (including the humorous poke at Richard H. Berg with the Italian Pasta rule: there is no rule for the Italians' preference for pasta).&#10;&#10;",
        "artist": "David Pentland"
    },
    {
        "name": "Granada: The Fall of Moslem Spain",
        "description": "From Avalanche Press:&#10;&#10;For over 700 years, Spanish Christians tried to exterminate the Arab kingdoms of southern Spain. This great &quot;Reconquista&quot; fired the crusading zeal of countless generations. The Arabs, or Moors as the Spanish knew them, saw the Spaniards as backward barbarians and fought ferociously to protect their sophisticated civilization. Finally, in 1482 King Ferdinand of Aragon embarked on the last campaign, to take the fabled city of Granada from its Islamic rulers.&#10;&#10;This quick-playing, physically beautiful game re-creates the final 10-year struggle for Granada. Players take command of the Christian and Moslem holy warriors. God is on your side. Will you prevail? &#10;&#10;Granada is a two-player game based on the 1481-1492 campaign between Ferdinand and Isabella of Aragon and Castille on one side (the &quot;Spanish player&quot;) and Muhammed XII and later Muhammed XIII on the other (the &quot;Moorish player&quot;). The game's designer is Robert G. Markham, known for Soldier Kings and dozens of other game designs.&#10;&#10;The game is not overly complex. The game board (mounted, 22x17 inches) shows southern Spain including the Kingdom of Granada and surrounding areas. A network of key points is laid over this map, with castles, ports and unfortified areas connected by roads. Troops move along these roads from point to point. The object of the game for the Spanish player is to conquer the Moorish kingdom - Granada herself and five other important Moorish sites. The Moorish player seeks to prevent this, or to force peace on the Spaniards by taking their key cities of Cordoba and Lorca.&#10;&#10;Each player has troops with which to carry out these tasks - knights, cavalry, and foot soldiers plus warships. The Spanish player also has siege cannon. Both players have leaders to move their troops and assist them in battle, with Ferdinand for the Spaniards and Muhammed al-Zagal for the Moors being much better at this than other leaders.&#10;&#10;In battle, both players place their units on a combat display and roll dice to determine how many &quot;hits&quot; are achieved. Four hits will eliminate most units. The best units in the game are the Moorish Jund armored cavalry and the fanatic Spanish Knights of Santiago and Calatrava. A well-manned castle is very difficult to capture, but the Spanish siege guns can make an enormous difference. At sea, the Spanish player is trying to deny the Moor reinforcements from Africa. Many Moorish troops are volunteers from overseas, who must arrive at ports. The Moor can also gain aid from the Ottoman Empire, but only if he or she has kept the ports open.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Tobruk:  Tank Battles in North Africa 1942",
        "description": "Tobruk is a tank combat simulation set in North Africa, specifically May-June of 1942.&#10;&#10;[From the box back, including some odd formatting]&#10;&quot;The sun blazed down with white-hot intensity, turning the horizon into a shimmering, dancing ribbon.  In the distance, the mechanical roar of German panzers could be heard like a thunderstorm about to break.  The Afrika Korps was on the move!&#10;&#10;Exhausted British Infantry, part of the famed Desert Rats, crouched low in their slit trenches, patiently waiting.  Weary, dirty, and sleepless, they braced themselves to repel yet another of Rommel's ferocious assaults.  Could this ragged, think line of Australians, South African, Free French, and British infantry continue to hold against the Desert Fox's veteran troops?&#10;&#10;There could be no retreat  There could be no hope of relief.  The British faced the Germans in the desert with their backs to the sea.  This was the battle for North Africa, the conquest of a continent.  This was the most famous siege in the annals of modern warfare  This was the battle for TOBRUK&#10;&#10;Now, you can re-create all of the furious action of tank-to-tank battles on the Western Desert during World War Two.&#10;&#10;NINETEEN DIFFERENT GAME SITUATIONS are provided to enable you to re-create all facets of the decisive Gazala battle-Rommel's most spectacular victory that lead directly to his most spectacular defeat at El Alamein only a few months later.  Now you can re-fight all the crucial actions of this important battle on a SQUAD and INDIVIDUAL WEAPON level: 'The Group Cruwell Feint', 'Action at Point 171', 'The Destruction of the 150th Brigade', 'Bir Hacheim: The Fall of Point 186', 'Convoy Raid', 'Night Assault', Battery Overrun' and more.&#10;&#10;BEGIN PLAY ALMOST IMMEDIATELY!  Now, through the innovative use of the Programmed Instruction method, even a novice wargamer can quickly get into the action.  Each game situation has its own rules 'module'.  To play the game it is only necessary to read the first short module.  As skills increase, players advance to the more realistic modules at their own pace...&quot;&#10;[End box back]&#10;&#10;Rules include morale, overrun, armor penetration, smoke, Stuka aircraft, forward observers, artillery, grenades, close assaults, and much more.  504 counters (with 6 blanks), three 8&quot; X 22&quot; mapboards, charts and a 36 page rulebook are included.&#10;&#10;Avalon Hill Complexity Rating - 7&#10;&#10;",
        "artist": "Randall C. Reed"
    },
    {
        "name": "Dread Pirate",
        "description": "Dread Pirate is an elegantly presented family game focusing on pirate lore and like any good Pirate the one with the most loot wins.&#10;&#10;Each of the pirates start in their own port with a few doubloons and jewels of their own color. The rest of that color of jewel are piled near their port and the remaining doubloons are piled on &ldquo;Dread Island&rdquo; in the center of the map, along with the &lsquo;fate&rsquo; cards that are drawn when sailing through specific marked areas of the board. It is these pirates goal to sail to the other ports and either raid or trade for jewels of the other colors. Once a pirate has at least one jewel of each color they can land on that Dread Island and collect some free doubloons. &quot;Skirmishes&quot;can be had with other pirates at sea and may slow the journey, but the reward of treasure can be great. Once all the jewels are gone from the original piles in the home ports (some will accumulate on Dread Island), the game is over and everyone counts the swag in their pouch.&#10;&#10;The 2002 Signature Edition of this game is packaged in a wooden treasure chest and includes a board in the form of an aged treasure map, three knuckle bones (dice), four treasure sacks, four die cast metal ships, one wind cube, fifty-two Dread Pirate cards, four map cards, fifty replica doubloons, 120 treasure jewels, 1st Edition rulebook, and captain&rsquo;s log.&#10;The &quot;2003 Signature Edition&quot; is identical with the exception that it only has 100 jewels, and a 2nd Edition Rulebook.&#10;The &quot;2007 Signature Edition&quot; differences are that it has a 3rd Edition rulebook, a Jolly Roger flag, and the four map cards are discontinued.&#10;It also has a map with extra anchor icons that is identical with Buccaneer's Revenge, and a black wooden chest instead of a brown one. It is also marked &quot;copyright Sababa Group&quot;, instead of Front Porch Classics.&#10;&#10;The Bookshelf Edition is packaged in a wooden bookshelf box and includes all of the components of the 2003 Signature Edition, plus a Jolly Roger flag. The rulebook is marked &quot;Bookshelf Edition&quot;. The Copyright 2003 Bookshelf edition rulebook is identical to the 2nd edition treasure chest rules, and copyright 2007 Bookshelf games rulebooks correspond to the 3rd edition treasure chest rules.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Mind Maze",
        "description": "In Mind Maze, each player builds a maze for the other to navigate, sight unseen.  They then race each other.&#10;&#10;The board stands vertically between the players and serves as a screen.  On your half, you build a maze by placing a number of baffles between posts.  Handicapping can be achieved by reducing a player's number of baffles.  When the race starts, you use a magnetic controller to nudge your steel ball (on the opponent side) through the maze, toward the exit hole.  When you hit a baffle, your ball fails to follow the controller and drops to the bottom, where you must grab it anew.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Space Fleet",
        "description": "The ancestor of Battlefleet Gothic, Space Fleet is a space battle game ostensibly set in the Warhammer 40,000 universe.  It uses a variety of collectable spaceship miniatures; unlike Battlefleet Gothic, movement is more Blue Max style than miniatures style, each player simultaneously programming from any of 13 possible moves.  Before the game starts, the players also allocate their shields around the ship's periphery.  Combat is a simple affair, and the rules are very skimpy.&#10;&#10;Battlefleet Gothic was actually still called Space Fleet Gothic in 1998, one year before its release.&#10;&#10;",
        "artist": "Tony Hough"
    },
    {
        "name": "Clue: The Haunted Mansion",
        "description": "the Haunted Mansion Clue, was the first of the tin boxed Disney Theme Park Editions.  They are only sold at Disney resorts and theme parks.&#10;&#10;A version with lower quality components and a cardboard box was later sold in regular toy stores.&#10;&#10;From the box:&#10;&#10;In this special edition of the classic Clue game, you'll search rooms and secret passages as one of 6 different Disney characters. The mystery changes every time you play, If you collect the right clues and make the right deductions, you&rsquo;ll solve the mystery of the Haunted Mansion! &ldquo;We have 999 happy haunts, but there&rsquo;s always room for one more&hellip;&rdquo;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Snap: The Interlocking Dragon-Making Game",
        "description": "From the box:&#10;&#10;Enter the dragon's lair! Snap together dragons of all shapes and sizes in this game of strategy and suspense. The longer the dragon, the higher your score. Rack up big points when you ally with a tiger. But watch where you connect your tiles- the game can change in a snap! From simple matching to strategic thinking, it's &quot;lairs&quot; of fun with four games in one.&#10;&#10;It is actually more like three games and a puzzle in the box.&#10;&#10;Snap is a strategy game of tile placement suitable for adults.&#10;&#10;Double Snap and Dragon Parade are simpler games designed for children.&#10;&#10;Dragon King is a puzzle that can earn you a chance at a free game.&#10;&#10;Contents:&#10;- 36 tiles&#10;- score pad&#10;- pencil&#10;- rule book&#10;&#10;",
        "artist": "Chris Lensch"
    },
    {
        "name": "Monopoly: Millennium",
        "description": "This version of Monopoly comes in silver tin.&#10;&#10;The major differences from the standard version are: &#10;&#10;    The board is made of silver colored holographic foil&#10;    The money is translucent&#10;    The dice look like jewels&#10;    The houses stack and are translucent&#10;    There are 8 new game tokens (computer, video cell phone, in-line skate, glove, plane, car, bicycle, and labrador.&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "After the Holocaust",
        "description": "After the Holocaust is an economic, military, and political simulation of events in the United States, twenty years after a large-scale thermonuclear exchange with the Soviet Union. The game is ten turns long, and is designed for four players, each of whom controls a different region of North America and part of Canada. These regions are the Northeast, the Midwest, the Southwest, and the Far West. It is reminsicent of the works of Stafford Beer and Proyecto Synco.&#10;&#10;Each game turn consists of five distinct rounds.&#10;&#10;The first is the Production Round, which includes a basic production phase, a secondary production phase, and a mobilization phase. Second is the Trade Round. Third is the Consumption Round, during which a player expends food points, expends consumer points, calculates and declares social status, and provides military supply for any combat units under his control. Fourth is the Military/Political Round, which begins with the political placement phase, followed by initial military movement, secondary military movement, combat, and elections. The fifth and last round of the game turn is the Finance Round, which includes the political disassociation phase, the stockpile/labour reallocation phase, industrial investment phase, taxation, the industrial capacity adjustment phase, the industrial labour reallocation phase, and finally, the  depreciation and shrinkage phase.&#10;&#10;In addition, immediately before the fourth and eighth game turns, the Population Growth Cycle occurs during which the labour population of each region increases by 10%.&#10;&#10;Inside the Box:&#10;&#10;&#10;    Two 17&rdquo; x 22&rdquo; hard-backed hexagonal grid Map Boards (with Turn Record Track, Terrain Key, Four Regional Sets of Six Economic Sector Tracks, and Abbreviated Turn Sequence incorporated)&#10;    400 &frac12;&rdquo; cardboard Counters&#10;    One 8&frac12;&rdquo; x 11&rdquo; Rules Booklet (with Scenario Instructions included)&#10;    Four 11&rdquo; x 17&rdquo; back-printed, folded combined Charts and Tables Sheets (each with an Initial Resources Chart, Food Table, Secondary Production Costs Table, Trade Transport Movement Point Cost Chart, Strike Table, Political Control Table, Subversion Table, Terrain Effects Chart, Combat Results Table, Unemployment Table, Starvation Table, Stockpiling Cost Chart, Investment Chart, Corruption Table, Depreciation Table, Shrinkage Table, Research and Development Table, Tax Table, and photocopy masters for Tax Forms&#10;    Eight 8&frac12;&rdquo; x 11&rdquo; perforated, back-printed sheets of Game Money (144 pieces)&#10;    Two small six-sided Dice&#10;    One 20 compartment plastic counter tray&#10;&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "A Gleam of Bayonets: The Battle of Antietam",
        "description": "Detailed, regimental-level recreation of the Battle of Antietam/Sharpsburg. Each hex covers 120 yards, while each strength point is the equivilent of 50 men or 1 artillery gun. Each game turn represents 20 minutes of time.&#10;&#10;This is Volume 7 of the original SPI / TSR Great Battles of the American Civil War series.&#10;&#10;",
        "artist": "Ivor M. Janci,Kitty Thompson"
    },
    {
        "name": "Crazy Circus",
        "description": "Crazy Circus &ndash; one of many names under which this design has been released &ndash; is a simultaneous puzzle solving game. Three animals stand on two platforms, and you are trying to change their configuration to match a target card by issuing commands like &quot;Ma&quot;, which moves the bottom animal on one platform to the top, or &quot;Ni&quot; which swaps the top two animals on the two platforms. As a result, the game is a race to shout out multi-syllable commands such as the eponymous &quot;MaNiKi&quot;, or &quot;LoNiMaSo&quot;. The first player to do so correctly wins the target card, and whoever collects the most cards wins!&#10;&#10;",
        "artist": "François Bruel"
    },
    {
        "name": "Drive on Washington: The Battle of Monocacy Junction, July 9, 1864",
        "description": "Regimental-level game of the battle of Monocacy Junction during the American Civil War. Part of the Great Battles of the American Civil War series. Late war attempt by Confederate forces under Jubal Early to overcome Union defenders led by Lew Wallace who are defending the bridges leading to Washington.&#10;&#10;Each game turn represents 20 minutes of real time, and each hex is 125 yards from side to side. Each strength point is 100 men or 1 gun. 200 counters&#10;&#10;This is Volume 2 of the original SPI / TSR Great Battles of the American Civil War series.&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "Drive on Stalingrad (first edition)",
        "description": "Drive on Stalingrad: Road to Ruin: The German 1942 Summer Offensive, is a divisional level simulation of the German drive across the Don River towards Stalingrad and the Caucasus in the summer and fall of 1942.&#10;&#10;In the summer of '42, the wide-open steppeland was ripe for the blitzkrieg tactics of the German High Command. And with its vast Caspian oil reserves, the South of Russia was an irresistible target for the Wehrmacht's next offensive. At least for Hitler it was.&#10;&#10;In this operational level game, players maneuver colorful cardboard playing pieces on two beautifully illustrated four-color maps of Southern Russia. These playing pieces, representing panzer regiments, tank corps, and infantry divisions, are based upon the actual military units involved. &#10;Additional counters represent headquarter and cavalry units, supply transports, air support, and the historical commanders of the armies. A hexagonal grid superimposed upon the map regulates deployment, movement, and battle engagement of the playing pieces. The roll of a die on simple probability charts determines each combat's outcome. In DRIVE ON STALINGRAD, players recreate Hitler's gamble in the summer of '42.&#10;&#10;Game Inventory:&#10;Two 22 x 34&quot; maps &#10;Two dual-side printed countersheets (600 1/2&quot; counters)&#10;One 16 page rules booklet&#10;Two player aid Charts &amp; Tables&#10;One Game-Turn Record &amp; Reinforcement Track&#10;One 6-sided die&#10;&#10;Complexity Level: Medium&#10;Playing Time: 3 - 7 hours&#10;&#10;&#10;&#10;(BGG description:)Divisional-level game of the German drive across the Don in the summer and fall of 1942, using a modified version of the Panzergruppe Guderian system. Changes from Panzergruppe Guderian include expanded air rules providing new missions for air units, truck units for extended supply lines, and the &quot;Hitler Directive Table&quot;, which can place a variety of demands and restrictions upon the German player.&#10;&#10;",
        "artist": "Jeff Easley,Ivor M. Janci,Redmond A. Simonsen"
    },
    {
        "name": "Vive l'Empereur",
        "description": "Vive l&rsquo;Empereur is a game system that simulates, on a tactical level, the Napoleonic great battles.&#10;&#10;Line and &eacute;lite Infantry, Light and Heavy Cavalry, Light, Heavy and Horse Artillery are the units that as Commander in Chief you have got under your command.&#10;It takes but a few minutes to read the rules (only 3 pages, optional rules included), then deploy the units and you are ready for enjoy this game.&#10;&#10;The rules includes Napoleonic tactics, like cavalry counter-charge, form squares and artillery opportunity fire.&#10;&#10;Contents: &#10;&#10;    1 map (67x49,5 cm) front/back printed.&#10;    180 pre-cut hexes (40 mm each), with 32 different kind of terrain.&#10;    138 unit counters (20x35 mm each).&#10;    72 colors order cards.&#10;    8 special dice.&#10;    1 dice pre-cut labels sheet.&#10;    140 chips&#10;    93 round (20 mm) counter stand. &#10;    Waterloo, Ligny, Quatre Bras scenarios.&#10;    Hypothetical battles scenario&#10;    1 game rules&#10;    2 reference sheets&#10;&#10;&#10;&#10;&#10;Re-implemented by:  Advanced Vive l'Empereur&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Devil's Den",
        "description": "Devil's Den is a company/batallion level simulation of the Confederate assaults against the union positions at Devil's Den and Little Round Top on the second day of the Battle of Gettysburg.&#10;&#10;520 1/2&quot; counters represent the opposing grey and blue combatants. There are three scenarios, one for each of the two hills and a grand scenario using the entire 22&quot;x32&quot; full color map. During a typical game turn, both players move their regiments by company, positioning them for rifle fire and melee assaults which are resolved by a die roll on the CRT.&#10;&#10;Optional game rules such as off map artillery, double time movement, and CSA sharpshooters can be added for added historical interest.&#10;&#10;",
        "artist": "Larry Catalano,Charles Kibler,George I. Parrish, Jr."
    },
    {
        "name": "Kursk: History's Greatest Tank Battle, July 1943",
        "description": "Kursk is a simulation of the largest tank battle the world has ever known.  The finest German armies advanced upon the numerically superior and well-entrenched Red Army, and their might was shattered.  Because the war between Nazi Germany and the Soviet Union is the most important event in recent history, this study of its most crucial battle provides invaluable insight to both the historian and the gamer.&#10;&#10;From the dreaded Tiger I, Panther, Elephant to the SS Divisions &amp; Red Army Guards to Khukov &amp; Manstein.. it is all present at the Battle of Kursk (Kypckar) !!&#10;&#10;Kursk:  The greatest tank battle the world has ever witnessed, is recreated in a highly detailed game-system that incorporates all the vital elements of the battle - from movement and attack modes to anti-tank units and artillery barrages, from air support to Soviet partisans and German Kampfgruppen.  Three scenarios capture all the battlefield action.&#10;&#10;&#10;    Components :&#10;&#10;&#10;Map:            22&quot; x 34&quot; single sheet&#10;Counters:        600 pieces&#10;Rulebook:        25 pages &#10;Charts:        German Deployment Display &amp; Soviet Deployment Display&#10;&#10;&#10;    Stats :&#10;&#10;&#10;Average Playing Time:        4-9 hours &#10;Ages:                12 to Adult&#10;Number of Players:        Two-? Player&#10;Complexity:            Moderate&#10;Suitability for Solitaire Play:    High&#10;&#10;&#10;The Six Angles edition features:&#10;- 1 22&quot;x34&quot; map + 1 small (DIN A4) map &#10;- 960 counters with new units, but mainly the same units shown at different step reduction (the former edition used markers to show step reduction&#10;- Several thick playing aids &#10;- 64 Pages magazine, including rules, Designer's notes, Player's notes, After Action Report by Masahiro Yamazaki and historical notes.&#10;&#10;The rules are essentially the same but are clarified and corrected. There are some new (optional) rules (2 pages) as well an introduction scenario using the mini-map (5 Game-Turns long).&#10;&#10;",
        "artist": "Redmond A. Simonsen,Masahiro Yamazaki"
    },
    {
        "name": "Atlantic Wall",
        "description": "6 June 1944: While German Troops battled for their lives on the Eastern Front, all remained quiet in the West.  The long anticipated allied invasion seemed particularly unlikely along this portion of French Coast known as Normandy.  But this was D-Day, and the unlikely was soon to become reality.  As the vast Allied armada came into view, as Allied munitions began to burst upon the quiet French beach and among the German strong-points, the greatest drama in military history began to unfold.&#10;&#10;This game simulates this historical conflict on a five-section map representing the actual area, across which cardboard playing pieces move and engage through an hexagonal grid, which functions like the squares of a chessboard in the outcome of each combat and the success of failure of various game operations.&#10;&#10;Atlantic Wall is a battalion-level game of the D-Day invasion.  This is a monster game as it comes with five 34&quot; x 22&quot; maps and over 2000 counters.&#10;&#10;",
        "artist": "Redmond A. Simonsen,Shin Ueda"
    },
    {
        "name": "TaskForce",
        "description": "An operational/tactical simulation of naval combat circa 1980-1990.  Includes naval-air, surface-to-surface missile, torpedo, and gunnery combat.&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "Time is Money",
        "description": "Do you want to get rich? You have just 60 seconds to roll the dice and grab the cash in this fast paced game. Beat the timer and make your fortune!&#10;&#10;",
        "artist": "Henning Löhlein"
    },
    {
        "name": "Talkin' Tango",
        "description": "Pick your partner!  You don't have to get up and dance, but you do have to make a sentence, the two of you alternating words.  Talkin' Tango can be frenzied at first, but if you hit a groove with your partner and get the others to guess the Target Word, you can boogie to the bank, baby 'cause you score!&#10;&#10;Everybody plays at once and you're always switching partners...it's more fun than the fox trot!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Yu-Gi-Oh! DungeonDice Monsters",
        "description": "Yu-Gi-Oh! tackles the minis market.&#10;&#10;Players roll dice that unfold depending on their value, and are placed on the board to create a dungeon path. Minis represent monsters summoned by the players (each with a corresponding stats card), and move through the dungeon, fighting each other, discovering treasure, avoiding traps, and eventually trying to get across the board to attack the opposing player.&#10;&#10;",
        "artist": "Kazuki Takahashi"
    },
    {
        "name": "Time Tripper",
        "description": "!!!TimeTripper!!! is a cooperative or solitaire game in which a Vietnam era squad or single soldier is teleported through time and space to battle everything from T-Rexes to Hell's Angels to Psionic Flesh Eating Plants.&#10;&#10;From an SPI advert in 1980:&#10;&#10;TimeTripper simulates the adventures of a U.S. infantryman, who accidentally creates a time warp that transports him to famous battles of the past and to fantastic battles of the future. Though armed with modern weaponry, the TimeTripper must husband his resources as he encounters the fearsome Tyranosaurus Rex, the Greek hoplites, Nazi infantry, and the futuristic Timepolice. Rules cover travel through time, missile and melee combat, endurance and experience; the game also includes rules for TeamTripper play and for a Timemaster. TimeTripper includes an 11' x 17' sheet with Battlefield and Time Displays, 100 cardboard playing pieces, rules and playing aids.&#10;Buyers Guide for TimeTripper&#10;Age Range: 12 years through adult&#10;Number of players: 1 to 4 (highly suitable for solitaire)&#10;Average playing time: One to three hours&#10;Complexity: Moderate (3.2)&#10;For purposes of comparison; the game of Monopoly is considered to have a complexity rating of 2.34&#10;&#10;",
        "artist": "Joe Barney,Redmond A. Simonsen"
    },
    {
        "name": "Napoleon's Battles",
        "description": "These are traditional rules for 15mm Napoleonic Miniatures.  The basic game covers weather, routing, command &amp; control, movement &amp; maneuver, defensive reaction, fire, combat, and pursuit.  The basic rules are more complex than most miniature games.  Advanced and optional rules add depth in the areas of fatigue, morale, evasion, special cavalry rules, supply chains, hidden movement, and generals.&#10;&#10;Like most Napoleonic minature games, the basic turn segments are:&#10;&#10;&#10;    Rally&#10;    Command &amp; Control&#10;    Move&#10;    Fire&#10;    Close combat(called All-out attack in this game)&#10;    Casualties (including routs)&#10;    Morale&#10;&#10;&#10;Each player in turn determines which units are in control, moves, is subjected to fire, engages in close combats, the results of combat are resolved, and then the second player goes through the same sequence.&#10;&#10;The winner can be determined by control of scenario objectives, a loss of army morale, and/or casualty counts.&#10;&#10;Combats are resolved via the rolling of a d10 and a combat table that is modified for a large number of factors, ranging from troop quality to current formation.&#10;&#10;Data for a large variety of nationalities and troop types are included.&#10;&#10;Includes an introduction to miniature wargaming bookle and cardboard counters that can be used in place of miniature stands.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Southern Front",
        "description": "Southern Front: Race for the Turkish Straits:&#10;&#10;Game Two in the Third World War series, although it uses the same rules, is very different from its parent.&#10;Bulgaria and Romania, reinforced with three Soviet armies and special-capability forces, face Greece, Turkey, and Yugoslavia, thinly reinforced with a few elite units from the U.S., France, and Italy.&#10;&#10;The campaign is very mobile, with neither side having enough troops to cover a solid front (although the mountainous terrain of the area helps somewhat). Special units such as airmobile, airborne, and amphibious troops, with their abilities to outflank a line, become even more important.&#10;Another important feature is the tangled web of Balkan politics, Romania is the least reliable of the Pact countries, and its participation is half-hearted at best. A second scenario allows for its total neutrality, forcing the Soviets to reinforce their armies and invade before taking on NATO. Greece and Turkey are uneasy allies, and rules allow for Greek withdrawal from NATO. And Albania is completely unpredictable.&#10;&#10;Additional rules allow Southern Front to be combined with The Third World War; players can reinforce one front with forces from the other, requiring a host of new decisions on the strategic level. One or two new divisions or air units sent to the Balkans can turn the tide there, but at what cost to the main front, where every unit is desperately needed ?&#10;&#10;Components:&#10;&#10;    360 die-cut counters&#10;    two 17&quot; x 22&quot; and one 8&quot; x 17&quot; maps&#10;    one rules booklet&#10;    one reference/background booklet &#10;    one set of game charts&#10;    two dice&#10;&#10;&#10;&#10;&#10;",
        "artist": "Rich Banner,William H. Keith, Jr."
    },
    {
        "name": "Symbioz",
        "description": "On a far distant planet three life-forms vie for dominance: the carnivorous Kroguls; the herbivorous Grabits and the vegetable Zherbes. Players try to expand their populations of these, at the expense of their rivals naturally .&#10;&#10;The ultimate goal is to to achieve an exclusively plant population in any three of the 24 concentrically symmetrical areas into which the board is divided.  The system is entirely luck-free.&#10;&#10;",
        "artist": "Emmanuel Boutier,David Duval"
    },
    {
        "name": "Air Charter",
        "description": "Players represent competing air-freight companies shuttling cargoes between airfields in northern Australia and S.E. Asia.&#10;&#10;Movement is basically roll a die and move but (simple) rules for air-lanes, airfield circuits, load sizes and fuel consumption add interest and require some planning.  The 'basic' game covers just these aspects.  The 'full' game has additional freight rules and players have to compete for cargoes and the important fuel-supply franchises.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "UNO Rummy-Up",
        "description": "UNO Rummy-Up combines two favorite classics, UNO and Rummikub, into one game.  In this game, colorful UNO tiles are played like rummy but also use special UNO rules that make this game fun and exciting.&quot;&#10;&#10;A variation of Rummikub that adds the Draw Four, Draw Two, Reverse, and other special cards from the UNO card game.  The object is still getting rid of all your tiles and having the lowest score.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Where in the USA is Carmen Sandiego?",
        "description": "Move around the US and arrest all of Carmen's henchmen and save the stolen United States monuments and marvels.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Light Speed",
        "description": "From the Publisher:&#10;&#10;'Light Speed is a lightning-fast card game of space combat about identical teams of spaceships dropping out of hyperspace to do battle over an extremely important asteroid. Each spaceship is equipped with 1 to 4 lasers, and the lasers have 3 different &quot;strengths&quot;&#10;&#10;The game is played in two stages. In the &quot;fast round&quot; players play their cards onto a table, trying to position them so that their laser beams will hit either the asteroid (and thereby &quot;mining&quot; it) or other players (causing them damage). Once one player has gotten rid of all of their cards, the &quot;scoring round&quot; begins.&#10;&#10;In the Scoring round, all ships of the same rank will fire at the same time. (All &quot;1&quot; ships will fire, then all &quot;2&quot; ships, etc.) If, after all the ships of the same rank have fired, a ship has more damage than it does Health, the ship is destroyed. Play continues through the ranks 1-10. Once all ships have fired, players receive 1 point for each point of health they took from their opponent, plus one point for each successful &quot;mining&quot; of the asteroid.&#10;&#10;Light Speed is part of the Hip Pocket Games series.&#10;&#10;Awards&#10;&#10;    2004 Listed in GAMES Magazine's GAMES 100&#10;&#10;&#10;&#10;&#10;",
        "artist": "Eduardo Muller"
    },
    {
        "name": "Barbarossa: The Russo-German War 1941-45",
        "description": "On June 22, 1941, before dawn, German tanks and guns began firing across the Russian border. It was the beginning of Hitler's Operation Barbarossa, one of the most brutal campaigns in the history of warfare. Four years later, the victorious Red Army has suffered a loss of seven million lives. &#10;The Barbarossa campaign included some of the greatest episodes in military history: the futile attack on Moscow in the winter of 1941-42, the siege of Stalingrad, the great Russian offensive beginning in 1944 that would lead the Red Army to the historic meeting with the Americans at the Elbe and on to victory in Berlin.&#10;&#10;Barbarossa is not simply one game but it is composed of three different types of games.&#10;1) The Standard Games: There are four of these games. They depict specific situations of crucial parts of the war&#10;2)The Campaign Game: It combines the four afforementioned games and fill in the gaps so that the campaign can be played out in sequence&#10;3)The Variable situations: Several &quot;what if&quot; historical effects are examined when added to the above games.&#10;&#10;The Game includes a 23&quot; by 29&quot; map sheet that portrays the area os the Soviet Union in which the operations took place.&#10;A hexagonal grid is superimposed upon the map to regularize the movement and the position of the playing pieces.&#10;The combat map is all inclusive with a Terrain Effects Chart (TEC) and Combat Results Table(CRT)&#10;There are two types of units each repressenting one of the opposing armies.Each piece is distinguished by type strenght nationality and mobolity.&#10;&#10;How To Play&#10;Each player moves his Units and executes attacks in turn.Players have as an objective to destroy the enemy units and gaining territory whilst minimizing friendly unit loses.&#10;The combat is resolved by comparing attack and defence strengths of adjacent opposing units and expressing the comparison as a simplified probability ratio(odds)&#10;After the defender has chosen which CRT table will be used a die is rolled and the outcome indicated by cross referencing the die roll result and the odds column is applied to the unit being attacked.&#10;Barbarossa is played in turns.&#10;Each Game-turn is composed of two player turns that are divided into three phases.&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "VII Legio",
        "description": "Old game from IT, where one player is the game master as he must create a galaxy. The others players are space ship commanders who must explore planets, meet alien races (capture, kill, negotiate, trade etc.)&#10;&#10;Players gather command points if they can complete these missions. Once they gather enough points they can return to the base, be promoted and receive bigger ships that are better at different types of missions.&#10;&#10;There are also hidden pirates ships that move in the galaxy and try to destroy the ships of the players.&#10;&#10;The Galaxy is also full of other dangers such as black holes, spatial jumps square etc...&#10;&#10;Expanded by:&#10;&#10;    Tablin&#10;&#10;&#10;&#10;&#10;",
        "artist": "Silvio Cadelo"
    },
    {
        "name": "Das Wasser des Lebens",
        "description": "Das Wasser des Lebens (&quot;The Water of Life&quot;) is a re-theming of Settlers of Catan issued in partnership with the Glen Grant Distillery Company.  The game itself is basically identical, but the theme is centered around Scotch whisky production.  As Scottish Highlanders, players collect wood, stones, barley, peat, and clear spring water.  With these materials they build roads and distilleries.  The all too familiar robber from Settlers of Catan has become the &quot;oppressive force&quot;.&#10;&#10;Das Wasser des Lebens features all new artwork and is packaged in the same metal cylinder that each bottle of Glen Grant Whisky ships in.  As a final added bonus, the game even includes a small bottle of Glen Grant Whisky for the players to enjoy after a hard day in the fields.&#10;&#10;Belongs to the Catan Series.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Sky Galleons of Mars",
        "description": "Sky Galleons of Mars is a board game set in the fantasy Victorian era of space exploration.  It is essentially the tactical ship combat game for the &quot;Space: 1889&quot; role-playing system.&#10;&#10;The game has a lot of mechanics that are similar to Star Fleet Battles and Interceptor.  It has a distinct 'naval' feel about it though... think of a game like Wooden Ships & Iron Men, with altitude thrown into the mix.&#10;&#10;The game is played in turns of three phases.  In the Initiative Phase, players form or disband boarding parties and change crew assignments.  They also roll dice to see who becomes the First Player that turn.&#10;&#10;Two Movement/Fire Phases follow.  The moving player moves all of his vessels, both players fire (depending on range, weapon, etc.), damage is taken, then the second player repeats the full move/fire action.&#10;&#10;Two large hex, beautifully rendered maps are included in the game to accomodate detailed plastic ships.  The rules are broken into two parts: Basic (the game at its simplest level with basic rules for moving, firing, taking damage, etc.) and Advanced (adds more detailed rules such as: ramming and grappling, towing, small arms, crew quality, etc.).  Also included are seven Scenarios and rules for a Campaign game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Outremer",
        "description": "Outremer is a man-to-man small scale combat game set in the time of the 3rd Crusade (1146).&#10;&#10;The game is both a game by itself or can be played as an expansion to Cry Havoc and/or Siege.&#10;&#10;As a stand-alone game it has 3 scenarios as well as a scenario generation system and 2 maps. There are rules covering a character advancement system that allows for a campaign game using the included campaign mapboard depicting the region of Palestine. It is well suited for play-by-email format and can be adapted for decent solitaire play as well.&#10;&#10;The unit scale is one man to one counter. Each man (or woman! They are here too!) is generally represented by multiple counters or both sides of a single counter to portray healthy and wounded combatants as well as mounted and unmounted (including the horses) where applicable. Each counter has a nicely colored picture of each man with attack defense and movement values in addition to the name of the person depicted.&#10;&#10;Integrates with:&#10;&#10;    Cry Havoc&#10;    Siege. &#10;&#10;&#10;&#10;&#10;",
        "artist": "Peter Dennis"
    },
    {
        "name": "PeaceBowl",
        "description": "PeaceBowl is a fast paced tactical game for 2-4 players.&#10;Each one leads a team composed by 3-5 warriors. &#10;Cards are played which affect what's going on in the game: &#10;&#10;    HIT! -- take down opponents, &#10;    PASS! -- launch the ball at your receivers anywhere on the game field &#10;    RAGE! -- break out of a fray &#10;&#10;&#10;&#10;&#10;Dealer gives 5 action cards to each player. In a game using the Basic Rules cards stay face up. With the Complete Rules you play with hidden cards and the games become much more fun because it becomes harder to foresee enemy interactions. In fact, many cards can be played that may break your opponent's sequence of play, during his/her turn. Also, with the Complete Rules you play with Special Cards that always offer different ways of being used. It's up to you to choose the best way, based on differing game situations.&#10;&#10;Enjoy hit and be hit, and have fun! Peace, Love... Fight!&#10;&#10;Expanded by:&#10;&#10;    Peacebowl Six&#10;&#10;&#10;&#10;&#10;",
        "artist": "Angelo Porazzi"
    },
    {
        "name": "Dungeoneer: Tomb of the Lich Lord",
        "description": "'Dungeoneer - Perilous Adventures in an Ever-Changing Labyrinth.&#10;&#10;In Dungeoneer', you take up the mantle of a great Hero set out to prove your valor in the Tomb of the Lich Lord. To triumph over your rivals, you will need to explore the labyrinth of corridors, defeat the heinous monsters, overcome nefarious traps and be the first to complete all your Quests. But beware, the gods are fickle and to test their Heroes even further, they often bestow upon them Banes as well as Boons.&#10;&#10;Game Description:&#10;&#10;This simple card game is very reminiscent of Wiz-War. Players are dealt one of 4 Heroes, each with varying movement, fighting and magic abilities. The Dwarf for example is very tough, but has no magic value at all. Each Hero also has a value for hit points, the amount of Treasure he can have (carry) at any time and also the number of &quot;Boons&quot; (special abilities) he may have. Players are dealt 3 quest cards initially in front of them (public knowledge) and have 5 Adventure cards in hand.&#10;&#10;Each turn a player may:&#10;&#10;     Discard unwanted cards and draw back to 5 cards.&#10;     Play Encounters and/or Bane cards (always on opponents never on yourself).&#10;     Build the Dungeon.&#10;     Move (collect Peril and Glory tokens).&#10;&#10;&#10;&#10;&#10;Players will collect Peril tokens as they move which then makes them targets for others to play Encounter/Bane cards against them (Encounter/Bane cards have a fee to play - which is paid for by the person who the card is played ON with Peril tokens). This  simple mechanic balances the game by spreading the attacks around as you can't attack someone that can't pay the Peril price.&#10;&#10;Players attempt various quests (some are simple die rolls in a certain room, some are tough combat and some a series of things to do), with each completed quest having your Hero &quot;go up a level&quot; which increases his abilities.&#10;&#10;Treasures &amp; Boons help you, Banes, Traps &amp; Encounters hurt you (which are played on you by other players).&#10;&#10;The dungeon map is different each time as it is made up of cards played one at time onto the table by each player.&#10;&#10;This game was introduced at DunDraCon 2003, in San Ramon, Ca. There are several planned expansions, and two special cards available by mail if you purchased at the convention.&#10;&#10;First game in the Dungeoneer Series.&#10;&#10;",
        "artist": "Thomas Denmark,Molly Mendoza Denmark,Morgan Gray,James Kei,Chris Mangum,Ben Van Dyken"
    },
    {
        "name": "UNO: Harry Potter",
        "description": "Basically the same as UNO, except with colorful cards from the charcters and items from Harry Potter.&#10;&#10;Cards that are different from traditional UNO:  &#10;&#10;    The Howler Wild card -- makes the next player shout out every card they have and forfeits their turn.  &#10;    Invisibility Wild card -- a protection card that stops any command card played against you.&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Perfection",
        "description": "This dexterity and shape recognition game pits players to be the quickest to fit all the shapes into the matching holes in the tray that pops up.&#10;&#10;The board for the &quot;full size&quot; game is a 5x5 grid with 25 shapes. There is a &quot;travel edition&quot; which has a 4x4 grid and only 16 shapes.&#10;&#10;Re-implemented by:&#10;&#10;    Superfection&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Full House",
        "description": "Each player is an innkeeper, signing in and checking out guests as directed by the cards and the die.  He tries to improve the standard of his hotel from Economy to Luxury, thereby attracting more guests and higher room rates. Players start with $7,500 and an empty hotel (consisting of two floors of four rooms each: one single, one double, and two suites).&#10;&#10;A player begins each turn by selecting three guests from the plastic &quot;People Popper&quot; and check them in to his hotel.  If he doesn't have the required space, the guest moves clockwise around the board to one of his opponents. A die is then rolled and the player does the action of the square he lands on.  This could mean checking out his guests, staying at another hotel, or getting a random event. A hotel may be upgraded in stages from Economy to Luxury by paying an upgrade fee.  Every step increases the rates that are paid by each guest.&#10;&#10;There is a little skill in deciding how your guests fit into your hotel, but otherwise the game is driven by the roll of the die.&#10;&#10;The first player to make $500,000 wins the game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Hallo Dachs!",
        "description": "Another children&rsquo;s game from Klaus Teuber involving animals, meals and memory. The other one is Die Ritter von der Haselnuss.&#10;&#10;Here the player is a badger (Dachs in German) in a forest. The forest has paths that lead to various amounts of meals for the badger. Once a badger reaches an area, he must roll the die a number of times equal to the amount of meals presented, and for each roll turn over the correct tiles. If the player turns over the correct tiles, the player gets to keep the meal tile, which will have a number of points on the downside (the more meals the higher points, usually).&#10;&#10;First player to the point goal wins the game. (The goal varies depending on the number of players.)&#10;&#10;Reimplemented by Spinnengift und Kr&#195;&#182;tenschleim&#10;&#10;Awards&#10;&#10;1998 &#195;&#133;rets B&#195;&#184;rnespil, Childrens Game of the Year Denmark&#10;&#10;",
        "artist": "Gabriela Silveira"
    },
    {
        "name": "Clue Jr.: The Case of the Hidden Toys",
        "description": "Clue Jr. The Case of the Hidden Toys is a game specifically designed for ages 5 to 8.&#10;  &#10;Which pet has hidden which toy in the doghouse? That's the mystery! Pets love to hide in funny places. And they love to hide kids' toys.  It's up to you and the Clue Jr. Detectives (Johnny Green, Vivienne Scarlett, Peter Plum and Liz Peacock) to find them.  Search all the hiding spots, check out all the kids, and solve the mystery - which changes every time you play!&#10;&#10;Based on the original Clue Game that your family loves&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Achtung: Spitfire!",
        "description": "Second of J.D. Webster's World War II air combat wargames Fighting Wings series.&#10;&#10;Tactical WW2 Air Combat game with mechanics upgraded from Over the Reich (first game in series).  Focuses on air to air and air to ground combat during the Battle of Britain with some before (Battle of France) and some afterward (Western Europe through 1942).&#10;&#10;Mechanics are based on fairly realistic energy physics.  Aircraft capabilities modeled closely on differences between the performance of the aircraft.  A turn represents 4.1 seconds; a hex represents 100 yards.&#10;&#10;The game system is more complex than the other games of this type of combat such as Mustangs or Dauntless/Air Force Dauntless Expansion Kit.&#10;&#10;The system includes an operational scale to handle flying an entire mission.&#10;&#10;",
        "artist": "Rick Barber"
    },
    {
        "name": "The Fastest Gun",
        "description": "Players buy deeds in a Western Town and defend their property with their guns.&#10;&#10;Hire a gunfighter to do your dirty work for you (if you have the money), otherwise you'll get called out into the street.&#10;&#10;A 3D board with a unique mechanism for resolving gunfights is the center of play.  A rotating underlay moves beneath a player's (or hired gun's) token.  In the underlay are die-cut holes, so when it rotates under your token it falls down... and you lose the fight.&#10;&#10;Last man standing is the winner.&#10;&#10;Publishers&#10;&#10;     Denys Fisher Toys (1973)&#10;     Milton Bradley (1974)&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Vietnam 1965-1975",
        "description": "This simulation game re-creates one of the longest, most complex, and least understood conflict in US history in all of its military and political aspects.&#10;&#10;The rules include detailed treatment of movement, terrain, search and destroy operations, special operations, firepower, air mobility, riverines, brigade-level formations, limited intelligence and auxiliary units in each scenario.  The scenarios start out small with Operation Starlite, and slowly build in complexity, introducing more rules, until the entire Campaign Scenario which covers the entire war from 1965 to 1975 and introduces South Vietnamese politics, morale and commitment, strategic bombing, reinforcements, and pacification.&#10;&#10;Unit counters are Battalion and Regiment size.&#10;&#10;",
        "artist": "Ted Koller,James Talbot"
    },
    {
        "name": "Bleeding Sherwood",
        "description": "The peasants around Sherwood Forest are getting pretty rich thanks to Robin Hood's meddling. In this auction card game, players take on the roles of merchants hoping to profit from this new-found wealth by bidding on randomly-turned up point cards. Just try to avoid the Robin Hood card.&#10;&#10;Very satirical.&#10;&#10;Out of print as of 2003.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Pacific War",
        "description": "Pacific War is a strategic wargame that takes players from the attack on Pearl Harbor through the climactic summer of 1945... from Australia to China, from Burma to Hawaii... from the defense of Wake Island to the Guadalcanal campaign to the massive actions fought in desperate defense of the Japanese homeland.&#10;&#10;For the first time in a Pacific Theater game, size, subtlety, and ease of play have come together in a game of sharp action and historical accuracy.  Players can become familiar with the layered Pacific War systems in the solitaire Engagement Scenarios, fighting their way through increasinly panoramic Battle, Campaign, and Strategic two-player and multi-player Scenarios.  Building on the game's basic maneuver and combat systems, players learn to conduct strategic bombing, merchant shipping attition, search and detection, amphibious assaults, and extensive Operations whose duration and cost they determine themselves.&#10;&#10;Pacific War is a source of limitless challenge and excitement for every gamer ever fascinated with the vastness and fury of the Pacific Campaigns.&#10;&#10;",
        "artist": "Ted Koller"
    },
    {
        "name": "Second World War at Sea: Bomb Alley",
        "description": "For three years, Britain's Royal Navy and Italy's Regia Marina waged a ferocious battle for control of the Mediterranean Sea. Fifty scenarios re-create these struggles: the battleship duels at Cape Teulada, First Sirte, Second Sirte and Cape Matapan. The convoys to Malta. The Italian torpedo boat Lupo's defeat of two British cruisers.&#10;&#10;This is the ultimate World War 2 naval game, from the team that gave you SOPAC and Midway.&#10;&#10;Per Avalanche Press Bomb Alley has gone out of print. This version is not coming back. A new, bigger, version is mentioned but at this time no further information.&#10;&#10;",
        "artist": "Peggy Gordon,Brien J. Miller,Christine Whitmer"
    },
    {
        "name": "APBA Pro Football",
        "description": "The game was created in 1958 by Dick Seitz and yearly player card editions have been printed almost every year since.&#10;&#10;The game attempts to simulate professional football through the use of player ratings, charts, and dice rolling. Every master edition comes with hundreds of player cards which have ratings based on that year's performance. Also included is a football field to track the movement of the ball; many charts to reference in order to determine play results; rules and dice.&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "Bombay Bazar",
        "description": "Bombay Bazar is a game of tactics, where players try to grow their elephants the longest trunk of all.&#10;&#10;Patience and inventiveness get results, as the pieces of trunk - and options - decrease. Luck can also play it's part in this game for the whole family.&#10;&#10;Awards&#10;&#10;2001 &#195;&#133;rets Familiespil, Family Game of the Year Denmark&#10;2001 Vuoden Perhepeli&#10;&#10;Re-implemented by:&#10;&#10;Valtra Tractors&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Nightmare",
        "description": "NIGHTMARE The Video Board Game!&#10;&#10;Nightmare is a board game controlled by a video tape.  It is a race against time and the game's host, The Gatekeeper.  The aim of the game is to collect 6 of your character's keys and then race to the center of the board; The Nightmare Square.  If the tape reaches 60 minutes The Gatekeeper Wins!&#10;&#10;Expanded by:&#10;&#10;    Nightmare II&#10;    Nightmare III&#10;    Nightmare IV&#10;&#10;&#10;&#10;&#10;Similar to:&#10;&#10;    Party Mania&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Stap op",
        "description": "Stap op is a classic game about biking.&#10; Collect 100 kilometres of routes to the moors, woods, beach and the lakes. Hinder your opponents with flat tires, head winds and other hazards.&#10;&#10;This game was originally released in the '50s by Sio with the subtitle 'Het Nieuwe Fietsspel'. In 2003 it was re-released by Goliath Games, this time with the subtitle 'Het Nostalgische Fietsspel'.&#10;&#10;Stap op is the Dutch adaptation (bikes!) of the classic American game Touring (cars!).&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Pass-out",
        "description": "Reminiscent of a College drinking game, players roll and move around a board taking a drink when the board square instructs.&#10;&#10;Each time a player passes the 'start' square he must take a 'Pink Elephant' card which contains a tongue twister.  If he managers to recite the card three times successfully he gains the card.&#10;&#10;The first player to obtain 10 'Pink Elephants' is declared the winner.&#10;&#10;A large disclaimer at the end of the rules: &quot;Not intended for use with Alcoholic Beverages.&quot;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Longest Day",
        "description": "The Longest Day is tactical level Monster game depicting the assault, buildup, and breakout of the Normandy Invasion.&#10;&#10;The game includes 2603 counters representing Battalion sized units and command units up to Corp level of the American and German armies in northern France. Seven map boards depict the invasion beaches and areas as far east as Cabourg, as far west as Coutances, and as far south as Avranches/Argentan. The counters are in the style of German WW2 military symbols representing armor, infantry, artillery, assault guns, bicycle units, etc. Five separate scenarios are presented using the programmed instruction approach learning only what's needed to play a scenario before moving on to the next scenario.&#10;&#10;Once all the rules have been learned then the campaign game is played which can take up to several months to finish.&#10;&#10;Avalon Hill complexity rating - 8&#10;&#10;",
        "artist": "Rodger B. MacGowan,Randall C. Reed"
    },
    {
        "name": "France 1944: The Allied Crusade in Europe",
        "description": "(David A. Vandenbroucke review - http://grognard.com/reviews/france44.txt):&#10;&#10;France 1944 (Victory Games) is a Mark Herman design.  It's a 130 counter, 1 map game of the breakout and pursuit across France. Units are divisions, I believe.  Components are up to VG's usual high standards.&#10;&#10;Complexity is rated as &quot;low,&quot; and solitaire suitability is &quot;medium.&quot;  The most interesting aspect of the game is that it seriously tries to model time over the course of the player's turn. You activate HQs, which can then control a varying number of infantry or armor units, depending on nationality.  There is a track display that you use during movement/combat.  As you make decisions about which actions to take, you branch along the track, limiting your options about what you can do next. Essentially this captures the passage of time required for certain actions.  It's easier to play than it is to describe.&#10;&#10;For example, suppose you have an armor division near the enemy and a couple of infantry divisions further away. If you move up the infantry to attack and make a breakthrough, the armored unit will probably not be able to move very far through the breach. In effect, the armored unit has spent most of the turn waiting around for the infantry to get in position and make its attack.&#10;&#10;The game puts emphasis on elite units on both sides and on the brittleness of the powerful British formations (no replacements).&#10;Chrome rules cover Market-Garden and the Bulge.&#10;&#10;",
        "artist": "Ted Koller,James Talbot"
    },
    {
        "name": "Trivial Pursuit: 1960's Edition",
        "description": "This is a card set expansion for Trivial Pursuit with the following categories having questions from the 60's:&#10;&#10;&#10;    Personalities&#10;    Entertainment&#10;    Headlines&#10;    Music&#10;    Sports &amp; Leisure&#10;    Wild Card&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Word Mastermind",
        "description": "A word version of the popular color matching Mastermind Game.&#10;&#10;In this multi-lingual edition, players must attempt to guess three and four letter words in the least number of attempts.&#10;&#10;Small yellow letters are placed on the board and clues are given as to whether the letter exists in the Word Maker's word.  Black clue: proper letter and location.  White clue: Proper letter, wrong location.&#10;&#10;To assist play, the rules include lists of common three and four letter words in 10 languages.&#10;&#10;Re-implements:&#10;&#10;    Mastermind&#10;&#10;&#10;&#10;&#10;Words Worth is essentially the same game, but with five letters.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "WFF 'N PROOF",
        "description": "The complete set of 21 games that started with the game of WFF (q.v.).&#10;&#10;The game includes 36 special dice, a timer, and a 184 page rules and examples manual.&#10;&#10;The games included in this set are actually a set of logic rules presented in a 'Programmed Instruction' order.  Each game adds to all prior games until Game 21, Frantic WFF 'N PROOF, is attained.&#10;&#10;As well as building WFFs (Well Formed Formulas), players must also try to reach a goal by using rules of inference.&#10;&#10;For example: If the goal is 'p', a player could use the 'Ko' (or Conjunction Out) rule and use 'Kpq' as a premise.  In other terms, if the following sentence is true: &quot;The first games of WFF 'N PROOF are easy and the last games of WFF 'n PROOF are hard.&quot;  Then it can be inferred that the following sentence is true: &quot;The first games of WFF 'N PROOF are easy.&quot;&#10;&#10;Up to 36 dice are rolled depending on the game being played.  One player sets a 'goal' by building a WFF in the goal area of the playing mat.  players then alternate playing dice to the &quot;permitted&quot; or &quot;essential&quot; sections of the play area.  If a die is placed in the essential area it MUST be used in either a premise or a rule.  If a player doesn't think that it can be used, he can challenge his opponent.&#10;&#10;To win, a player must make a successful challenge or be unsuccessfully challenged.&#10;&#10;Games 3 through 19 introduce the 11 Rules of Logical Inference in this order: Conjunction, Implication, Reiteration, Disjunction, Negation, and Equivalence.  Then 18 more derived rules are added to the mix for Game 20, the PC (Propositional Calculus) game.  The 21st and final game, Frantic WFF 'N PROOF, takes the PC game and adds timed moves for rapid and chaotic scoring.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Mini Mastermind",
        "description": "The travel version of the game Mastermind. 6 rows in which to guess the solution.&#10;&#10;A common version came in a small 2&quot; X 5&quot; plastic box with a playing board cover is encased in a slipsleeve.  All of the components are kept neatly inside the box.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Arnhem",
        "description": "Originally part of the Westwall quad, Arnhem was released as a Designer's Edition game in 1976.  The game included a hard mounted map, counters, standard and specific rules.&#10;&#10;The game is a two player recreation of Operation Market Garden, Sept. 1944.&#10;&#10;Re-implemented by:&#10;&#10;    Arnhem: The Farthest Bridge&#10;&#10;&#10;&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "Lee vs. Grant",
        "description": "This game simulates the decisive 1864 spring campaign in Virginia during the American Civil War, nicknamed The Wilderness Campaign.&#10;&#10;Players control the Union and Confederate armies which took part.  The game is played in turns that represent five days.  A unit's strength point represents approximately 2,500 men commanded by a leader.  The map is a 1:200,000 representation of an area between Fredricksburg and Petersburg.&#10;&#10;The game is split into two: Basic and Advanced.  The basic game introduces players to the concepts of movement and unit activation.  The advanced game adds sea movement, supply, and additional leader rules. Victory conditions depends on the scenario being played.&#10;&#10;Lee vs. Grant is arguably the first game in the GCACW series by the same designer albeit from a different (though related) publisher and with a different map art style.&#10;&#10;",
        "artist": "Rosaria Baldari,Ted Koller"
    },
    {
        "name": "18EU",
        "description": "18EU is an 18xx title which depicts a century of European railroading from the 1830s to the 1930s. It shares much in common with other 18xx titles, but also includes 15 minor companies. They are auctioned before the game starts, then pay 50/50 dividend (Minor/Owner) and finally merge to form corporations. Another special element are bonuses for completing long runs between off-map areas, that can affect huge incomes in the end game. The map stretches from France to Austria and Poland, and from northern Germany to middle Italy and features the Alps as mountains (higher tile laying costs). The game is played in sets of two operating rounds, where the railroads are built, followed by one stock round, where shares are bought and sold.&#10;&#10;The general idea of all 18xx titles is holding shares of railway companies, building railroads by laying hex-tiles, running trains and generating income paid out as dividend. The special thing (and difference to other games) is the difference between the players&acute; private money and the money in the companies&acute; treasuries. In the end the player, who managed to acquire the biggest private fortune, wins the game!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Stargrunt II",
        "description": "Stargrunt II is a comprehensive set of generic rules for simulating science-fiction infantry combat in virtually any background. The system covers actions from a few squads up to full company level. Rules are included for infantry, powered armored troops, AFV's, artillery and aerospace support and much much more. The game is designed for use with 25mm or 15mm scale miniatures. The game has a flexible integrated game sequence, minimal record keeping and a brilliant system of distinguishing troop quality. The game encourages the players to think tactically. There are rules for troop confidence, motivation, suppression and much more.&#10;&#10;This game is now available as a free download from Ground Zero Games.&#10;&#10;http://www.groundzerogames.net/&#10;&#10;Re-implements:&#10;Stargrunt&#10;&#10;",
        "artist": "Aaron Alderson,Peter Barfield,Dave Garnham,Tim Osborne,Barrie Quin,John Treadaway,Malcolm Yaxley"
    },
    {
        "name": "Dirtside II",
        "description": "Dirtside II is a comprehensive set of generic rules for simulating science fiction battles in virtually any background or &quot;future history&quot;.&#10;&#10;The system covers combined-arms actions from a few platoons up to a full battalion combat group level. Rules are included for infantry, AFV's of all types, artillery, aerospace support and landings, combat walkers and much more.  The game is designed for use with 1:300/1:285 scale miniatures but will function equally well with 1:200 or other scales.  The game has a flexible integrated game sequence, chartless combat system, vehicle design and points value system and more.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Highly Suspect",
        "description": "In Highly Suspicious 2-4 detectives are chasing the crook who's hiding in the park. The bord is tiltable, and by tilting the board in one direction all detectives and the crook will walk as far to this side as they can, until they hit an obstacle. The goal is to get your detective to land on a square next to the crook, thus catching him.&#10;&#10;Ages 6 and up&#10;&#10;A winner of the 1997 Concours International de Cr&#195;&#169;ateurs de Jeux de Soci&#195;&#169;t&#195;&#169;.&#10;&#10;",
        "artist": "Martina Leykamm"
    },
    {
        "name": "Reiner Knizia's Amazing Flea Circus",
        "description": "Do not confuse this with the other Reiner Knizia Circus Flohcati. This is a very different game.&#10;&#10;From the rules:&#10;&#10;&quot;The Flea Ring Circus is about to begin! But the cats and dogs are still deciding which show to watch. Fill your tent with the most spectators and win the game as the most successful ring master.&quot;&#10;&#10;A simple cardgame with a circus or carnival theme.  Players play cards (generally one at a time) representing fire breathers, animal trainers, clowns, cotton-candy vendors, etc., in an effort to attract spectators who, depending on what card is played, can be taken from a pool or from another player.&#10;&#10;Cards - 12 yellow clowns, 6 pink acrobats, 2 orange animal control vehicles, 12 x number 2 cards (4 each of green, orange and blue), 12 x number 3 cards (4 each of mauve, orange and blue), 4 x number 4 cards (green), 7 ticket cards.&#10;&#10;",
        "artist": "Scott Fleenor,Ulf Marckwort"
    },
    {
        "name": "The Emperor Returns",
        "description": "Part of the Campaigns of Napoleon Operational System.  1st edition published in 1987/88.&#10;&#10;Contents:&#10;&#10;    34&quot;x22&quot; map&#10;    Standard rulebook&#10;    Special rulebook including study folder&#10;    3 organization displays&#10;    240 counters&#10;    Game turn track/ replacement pool display &#10;&#10;&#10;&#10;&#10;GAME SYSTEM: CAMPAIGNS System - Series 1X = 3,200m/hex, 1,000 men/SP, 2 days/turn.&#10;&#10;",
        "artist": "Rick Barber,Vasily Ivanovich Sternberg"
    },
    {
        "name": "Afrika: The Northern African Campaign, 1940-1942 (1st edition)",
        "description": "Afrika: The Northern African Campaign, 1940-1942, is a simulation game covering the North African Campaign from September, 1940 through December, 1942. In late 1940, the Italian Army invaded Egypt beginning the famous North African Campaign of World War II. After a short withdrawal, the Commonwealth forces counterattacked and all but threw the Italians back to Tripoli. Not content to let his southern partner bring disgrace to the Axis arms, Hitler dispatched a German contingent under a new commander: Erwin Rommel. His arrival began a rapid mobile campaign across the rocky sands.  However, by the end of 1942, Rommel had failed in his final bid to seize the Nile Delta and was thrown completely out of the theater by Montgomery's pursuit after El Alamein. Axis fortunes would never rise on the African continent again.&#10;&#10;Afrika is a fast paced game of mobile warfare at the operational level. Can you take the Nile? Can your Commonwealth forces kick the Axis armor out of Egypt for good?  This game gives you the tools to find out. The game's easy-to-use supply system (no writing) allows for a correct logistical aspect to the game.&#10;&#10;This is the second game in Standard Combat Series by The Gamers that began with the game Stalingrad Pocket. The series rules have been refined after lessons learned with the earlier game. This series of games was designed to off-set The Gamers's line of more complex products. Experienced players will feel comfortable with the rules as soon as they read through them.  It is designed as a fast paced fun game giving a reasonable simulation of events. It was not intended to be a definitive simulation of this campaign.&#10;&#10;Game Scale:&#10;Game Turn: 1 month&#10;Hex: 10 miles / 16 Km&#10;Units: Regiment to Division&#10;&#10;Game Inventory:&#10;One 22 x 34&quot; full color map&#10;One 17 x 22&quot; full color map&#10;One dual-side printed countersheet (280 1/2&quot; counters)&#10;One 8-page SCS system rulebook version 1.5&#10;One 12-page Afrika specific rulebook&#10;Two 6-sided dice&#10;&#10;Solitaire Playability: High&#10;Complexity Level: Low&#10;Players: 2 or more&#10;Playing Time: 2-12 hours&#10;&#10;",
        "artist": "Bernard Bittler,Dean Essig"
    },
    {
        "name": "Air Bridge to Victory",
        "description": "Air Bridge to Victory covers all of Operation Market-Garden at a scale of 1/2 day per turn, 1 mile per hex and units at battalion level.&#10;&#10;Game Features&#10;&#10;    Innovative combat resolution, integrating maneuver combat, close assault, artillery bombardment, assault engineers, and air support into one easy-to-use system&#10;    Bridge-blowing and repair&#10;    Initiative rules reflecting the ebb and flow of the battle&#10;    Easy to play introductory scenario&#10;    Tournament scenario highlighting the Battle for Arnhem&#10;    Grand campaign game on the breakout of the British XXX Corps to relieve the 1st Airborne&#10;    Automatic Victory conditions which make each game different from the last&#10;&#10;&#10;&#10;&#10;Contents:&#10;&#10;    300 die-cut Counters&#10;    1 22&quot;x34&quot; Mapsheet&#10;    1 22&quot;x17&quot; Mapsheet&#10;    16 page Rule/scenario book&#10;    1 Player aid card (the box states 4 but this is a misprint - the charts &amp; tables are on the map sheets)&#10;    1 ten sided die&#10;&#10;&#10;&#10;&#10;Time Scale: 1/2 day per game turn&#10;Map Scale: 1 mile per hex&#10;Unite Scale: Battalion&#10;Players: One-to-Four&#10;Playing Time: 5-20 minutes for introductory scenario&#10;2-3 hours for tournament scenario&#10;4-10 hours for campaign game&#10;&#10;Complexity: Medium&#10;Solitaire Suitability: Medium&#10;&#10;",
        "artist": "Rodger B. MacGowan,Brent Mercer,Terry R. Shrum"
    },
    {
        "name": "Dark Blades",
        "description": "Dark Blades is part of the Cry Havoc series of games. It adds a fantasy element to the system by including mythical beasts and magic.&#10;&#10;Contents:&#10;&#10;    Over 200 double-sided counters&#10;    2 combat maps&#10;    An Island map for campaign use&#10;    24 spell cards&#10;    40 page rulebook with 4 scenarios&#10;    2 Quick reference sheets&#10;    Beginner's guide&#10;&#10;&#10;&#10;&#10;Part of the Cry Havoc series.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Second World War at Sea: Eastern Fleet",
        "description": "Eastern Fleet is the second game in Avalanche Press's Second World War at Sea series. It covers the conflict between the British and Japanese in the Indian Ocean during 1942.&#10;&#10;Contents:&#10;&#10;    Strategic Map&#10;    Tactical Map&#10;    210 counters&#10;    2 Airbase Cards&#10;    2 Task Force Cards&#10;    2 Player Aid Cards&#10;    24 page Series Rulebook&#10;    20 page Scenario/rulebook with 11 Scenarios&#10;&#10;&#10;&#10;&#10;",
        "artist": "Peggy Gordon,Brien J. Miller"
    },
    {
        "name": "Capt'n Clever",
        "description": "Each player is a captain who is collecting treasures.&#10;&#10;They move from island to island by placing their boats (and sometimes using the boats of other captains), but where is the next treasure to be found? Captains get that information from their right-hand neighbor. The player who manages to collect the treasure from all nine islands will be called a real Capt'n Clever and win the game.&#10;&#10;Game for ages 6 and up.&#10;&#10;",
        "artist": "Czarnè"
    },
    {
        "name": "Cuckoo Zoo",
        "description": "Cocotaki is a Uno-style card game in which you must match the animal or color of the card on the top of the discard pile in order to play a card. When you play, you have to make the appropriate animal sound. If you forget to make this sound, you get penalty cards. If you place down a red card you must not make any sound &ndash; except when you place down the red rooster, in which case you shout &quot;Cocotaki!&quot;&#10;&#10;The first player who has no cards left wins. The game includes many additional rules for advanced play.&#10;&#10;Kakadoo is an updated version of Cocotaki that incorporates a number of the optional rules from that earlier game. As a result, the minimum playing age has been raised from 5 to 8. Players now draw four penalty cards instead of two when they mess up, and whenever a lion is played, the player doesn't roar but says, &quot;Hello, your majesty&quot;. Play a donkey, and only donkeys can follow in the next round; play a cockatoo to skip the next player.&#10;&#10;",
        "artist": "Ran Arieli,Andreas Besser,Dennas Davis,Oliver Freudenreich,INGEORGE Design"
    },
    {
        "name": "Squad Seven",
        "description": "Squad Seven is an unusual action game involving a CD soundtrack and a dart-gun.&#10;&#10;Each player takes a squad of seven people into the jungle to recover Inca treasure. Players take it in turn to reveal cards, which may show treasure or various dangers of the jungle including dinosaurs, mummies and collapsing rope bridges. The soundtrack indicates whether it is day or night - certain cards may only be taken at certain times - and many cards require the player to shoot a target or run round the table before a scream is heard on the soundtrack. If they fail, they lose a member of their squad.&#10;&#10;The player who recovers the most treasure wins the game.&#10;&#10;",
        "artist": "François Bruel"
    },
    {
        "name": "Petropolis",
        "description": "From the box:&#10;&#10;An exciting game about the fortunes of oil: From 2 to 7 players compete for the thrills of being an oil tycoon.&#10;&#10;The object of the game [is] to acquire concessions in the petroleum producing countries, control them and operate them. The player who obtains the largest number of petrodollars is the winner of the game.&#10;&#10;This &quot;roll the die and move&quot; game is strongly reminiscent of Monopoly, with petrol-producing countries replacing the streets, telex messages replacing &quot;Chance&quot; cards, and oil platforms and derricks replacing houses and hotels. Visually, it is a stunning game, with beautifully crafted components.&#10;&#10;Contents:&#10;&#10;    1 board&#10;    27 concession titles&#10;    25 telex messages&#10;    7 playing markers&#10;    2 dice&#10;    34 derricks&#10;    14 oil platforms&#10;    390 petrodollar bills.&#10;&#10;&#10;&#10;&#10;(The Dutch HEMA edition comes with 30 derricks, 12 platforms and 430 bills. According to the Dutch rulebook the game is designed for 3-7 players.)&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Balloon Cup",
        "description": "In Balloon Cup, the players compete in several short balloon flights (hops) to collect the colored cubes associated with each hop. Four landscape cards &ndash; two plains alternating with two mountains &ndash; are laid out, and 1, 2, 3, or 4 cubes in assorted colors (gray, blue, green, yellow, red) are added to these cards. From a hand of eight balloon cards, you must try to pass each landscape by adding cards matching the colored blocks onto their side of table, although winds (and cunning) may occasionally cause them to play on their opponent's side &ndash; a move that can really ruin the opponent's plans.&#10;&#10;High-valued balloons are played on the mountains, and low-valued balloons are played on the plains. Whoever is the better balloonist takes the cubes from the card, which is then flipped over &ndash; mountains becomes plains and vice-versa &ndash; and refilled with cubes. Five trophy cards of value 3 to 7 are placed at the top of the cards. When a player has collected enough cubes of a given color, he earns the trophy card for that color. Players may even trade three otherwise useless cubes for one they can use. The first player to earn three trophy cards is the winner!&#10;&#10;",
        "artist": "Michaela Kienle,Jurgen Zimmermann"
    },
    {
        "name": "Cranium Cariboo",
        "description": "Cranium Cariboo is a game for young children (Ages 3 - 6) to help them learn letters, numbers/counting, colors, and shapes.&#10;&#10;Players take turns drawing a card and opening one of the treasure hunt doors that has a trait corresponding to the card (color, number of objects, etc.).  Once the door is opened, players look for a ball.  If they find one, they drop it in the &quot;tide pool&quot;.  Once all six balls are found, the treasure chest opens and everyone wins (there are scoring rules, if a cooperative win is not desirable).&#10;&#10;Reimplemented by:&#10;Cariboo Island&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Great Patriotic War",
        "description": "The Great Patriotic War: Nazi Germany vs. the Soviet Union is a fast-paced wargame that reproduces the circumstances, the events, and the forces that fought the fiercest war in history.  Using wargame techniques, The Great Patriotic War simulates the operations, battles, and conflicts of the war; wargame systems make it an enjoyable conflict game for two people.&#10;&#10;The gameplay features monthly turns, 40 miles per hex and there are 240 counters representing corps and armies.  Playing time ranges from the 1 hour Introductory scenario to the 8 hour Campaign game, with five historical scenarios detailing Operations Barbarossa, Fall Blau, Kursk, Stalingrad, and Bagration.&#10;&#10;It also includes an introductory wargame (now available for free download) called Battle for Moscow, using similar wargame systems.&#10;&#10;Re-Implements:&#10;&#10;    Battle for Moscow (first edition)&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Journeys of Paul",
        "description": "This game begins immediately after St. Paul completed his famous four journeys during which he spread the Gospel and established the first churches in the Roman Empire. Each player in the game is a missionary who, like Paul, travels through the Roman Empire attempting to start churches in several key cities. The game simulates the difficulties and challenges confronted by Paul and his companions.&#10;&#10;It is not related in any way (apart from theme) to the game by Avalon Hill with a similar name, The Journeys of St. Paul.&#10;&#10;",
        "artist": "Michelle Spalding"
    },
    {
        "name": "Star Wars Lightsaber Dueling",
        "description": "Similar to the Lost Worlds series of books, West End Games's Star Wars Lightsaber Duelling Pack consists of two books.  One book representing Luke Skywalker and the other book, Darth Vader.&#10;&#10;Each book contains 32 character pages plus rules.  The character pages depict the combatants in various offensive and defensive poses that show each player what they are looking at at each moment in the game.  Each character begins the game with 30 &quot;Force&quot; points and loses one for every wound.&#10;&#10;The first player to inflict 30 points of damage wins.&#10;&#10;Book mechanic also featured in:&#10;&#10;     Lost Worlds&#10;     Marvel Battlebooks&#10;&#10;&#10;&#10;&#10;",
        "artist": "Stephen Crane,Anne C. Fink,Michael Manley"
    },
    {
        "name": "Ace of Aces: Balloon Buster",
        "description": "Part of the Ace of Aces series this game simulates a WWI fighter attempting to shooting down a reconnaissance balloon that is protected by an anti-aircraft gun.  The fighter maneuvers to shoot at the balloon while the anti-aircraft player attempts to shoot him down.&#10;&#10;",
        "artist": "J.B. Deneen"
    },
    {
        "name": "Domaine",
        "description": "The king shall return... But before he does, the realm falls into anarchy and chaos. The lords of the kingdom struggle to improve their place and standing. New borders are drawn, and expanded through strength of arms and subtle maneuver. Each duke seeks to establish a claim over the most valuable parts of the kingdom before the king finally returns. In the dark of the Middle Ages, control of the land was the key to wealth and power. Can you control enough territory to become the most prestigious duke before the king&rsquo;s return?&#10;&#10;In Domaine, players form domaines by placing walls on the modular board to enclose territory. Completed domaines can then be expanded, even into your opponents'. Protect domaines by placing knights, which resist expansion.&#10;&#10;Actions are taken by playing cards that have a cost associated with them. Gain money by selling cards and controlling mines. Sold cards can be acquired by other players.&#10;&#10;Players score points based on the quantity and type of terrain enclosed in their domaines, as well as by controlling many mines of a single type. The winner is the first player to cross a specific point threshold or the player with the most points when the card deck runs out.&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Strat-O-Matic Pro Football",
        "description": "One of the several statistically-based sports simulations produced by the Strat-O-Matic Game Company.  The game consists of player cards and team defensive cards that accurately reproduce play outcomes and player, team, and league statistics of the National Football League for the season on which the cards are based.  Play progresses with the gamer on offense calling his play (run or pass, where the play is directed, the ball carrier or primary receiver, etc.) and the gamer on defense setting a defensive configuration (blitzes, double coverage of receivers, stacking the line, etc.).  In the cards and dice version, three dice are then rolled, with one die determining whether the play result comes from the offensive or defensive cards and the other two determining the result from the speciifed card.  Play takes place on a game board that resembles a football field, and the gamers keep track of the ball position, the down, and the time remaining in the quarter being played.  Penalties and injuries are part of the game.  Gamers play from the perspective of a head coach and/or general manager.&#10;&#10;The game also comes in a computer version that automatically determines play outcomes and compiles and reports player, team and league statistics.  The computer version grapically portrays the plays using X's and O's to depict player movement.  The computer version also features a sophisticated computer coach that faciltates solitaire play.&#10;&#10;Each year the Strat-O-Matic Game Company issues a new set of player and team cards (or computer disk) based upon the most recent NFL season.  The company also issues from time to time sets of players and teams from past seasons.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Simon",
        "description": "Simon is a large round electronic box with four player 'press pads' on top.  Each of the pads lights up and plays a tone.&#10;&#10;The game is basically a memory game.  Simon lights one of the coloured pads and sounds a tone, then two, then three, etc.  Players attempt to match Simon by pressing the pads in the proper sequence.  If someone fails, they get a 'raspberry' and are out of the game.  Of course Simon speeds up as the game progresses so it becomes increasingly more difficult.&#10;&#10;For a little less randomness, players can set the game to ignore the computer and perform the sequences themselves adding one colour to each play.  Player 1 can press &quot;Red&quot;, Player 2 then must press &quot;Red&quot; and then adds another &quot;Red&quot;, player 3 then must press &quot;Red, Red&quot;, and then adds &quot;Blue&quot;, etc.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Harry Potter and the Sorcerer's Stone Trivia Game",
        "description": "A trivia game based on the first Harry Potter book.&#10;&#10;Players roll a special die and move around a track answering questions based on Harry Potter.  Successful answers net a player one of three types of cards.&#10;&#10;Collect 6 Charm cards and return to Hogwarts... answer one final question to win.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Operation Mercury",
        "description": "Operation Mercury' allows you to recreate the bitter struggle for Crete (Spring 1941 - Axis vs. Allied) at company/battalion level.&#10;&#10;The game system, based on the award winning GMT Operational System which first appeared in Operation Shoestring: The Guadalcanal Campaign, 1942 and Air Bridge to Victory, allows for multiple combat options. The system also takes into account unit morale and efficiency as well as formation strength when resolving combat.&#10;&#10;",
        "artist": "Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "Bakerstreet",
        "description": "Two players race to try to solve a mysterious case by collecting 7 consecutively-lettered evidence cards.&#10;&#10;Every turn a player increases his influence by placing a card next to an evidence pile. After that he has to estimate the total of the values of both players' cards in hand.&#10;&#10;Instead of increasing influence a player may dispute the opponent's bid. If the bid was too high (higher than the card total) the player may choose one evidence pile which is evaluated. Influence on this pile is rewarded with an evidence card.&#10;&#10;Belongs to the Ravensburger Fun For 2 Series.&#10;&#10;",
        "artist": "Marcel-André Casasola Merkle,Claudia Riga"
    },
    {
        "name": "Monopoly: Pokémon",
        "description": "Another edition of the classic Monopoly game themed with characters and places from the Pokemon animated series. It includes a variant to replace the &quot;doubles roll again&quot; rule with &quot;Pokemon Powers.&quot;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Monopoly: Star Trek Limited Edition",
        "description": "Edition of the classic Monopoly game themed with items from the original series of Star Trek. The game was originally designed to be combined, through a &quot;wormhole effect&quot; rule,  with other planned editions themed on other Star Trek series but only the Monopoly: Star Trek The Next Generation edition was published.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Mammoth Hunters",
        "description": "It's a cool, windy day in autumn, some time around 30,000 years ago. For several hours now, a group of hunters have been following a herd of mammoths. Will they succeed? Will they actually be able to bring down one of these giant animals? Its meat would last the entire tribe for several weeks...&#10;&#10;Take on the role of one of these fearless Ice Age tribesmen and try to keep close to the mammoth herds. Of course, everyone else wants to accomplish this as well, so there will always be fights over territory. Who may stay, and who has to leave? Lucky for those with a club handy!&#10;&#10;This game is #8 in the Alea big box series, but the English RGG version doesn't have the number printed on the side.&#10;&#10;",
        "artist": "Felix Scheinberger"
    },
    {
        "name": "Matanikau",
        "description": "Matanikau - Battles on the Matanikau River, Guadalcanal, 1942 recreates the epic battles of the 5th and the 7th Marine Regiments along the Matanikau River in the fall of 1942 between the US Marines and the forces of Imperial Japan. The Japanese are attempting to establish a position from which they can launch further attempts to capture Henderson Field. The Marines are trying to expand the perimeter around Henderson Field far enough so as to deny the Japanese any decent staging area for attacks against that airbase.&#10;&#10;Using The Gamers 3rd edition Tactical Combat Series (TCS) rules, this first ever TCS game set in the Pacific theater features Banzai charges, vicious night attacks, Higgins Boat, naval and air support, as well as the redoubtable 'Chesty' Puller.&#10;&#10;Game Scale:&#10;Game Turn: 20 minutes&#10;Hex: 125 yards / 114 meters&#10;Units: Infantry platoons, individual vehicles&#10;&#10;Game Inventory:&#10;One 22 x 34&quot; full color maps&#10;Three dual-side printed countersheets (700 1/2&quot; counters)&#10;One 28-page TCS version 3.0 specific rulebook&#10;One 12-page Matanikau specific rulebook&#10;Two 6-page TCS version 3.0 Charts &amp; Tables folders&#10;Two Player Aid cards&#10;Two 6-sided dice&#10;&#10;Solitaire Playability: High&#10;Complexity Level: High&#10;Players: 2 or more&#10;Playing Time: 4-40 hours&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Edelweiss",
        "description": "Edelweiss was the German codename for the third phase of their &quot;Case Blue&quot; summer offensive, and the operational plan for the invasion of the Caucasus in late July of 1942.&#10;&#10;In Edelweiss players will represent commanding officers in control of the campaign for either side.&#10;&#10;Scenarios covering small portions of the battle, as well as variable length campaign game, focus on the German offensive operations undertaken in the Caucasus. Campaign game options will allow players to experiment by altering the historical order of battle to determine just what the German possibilities for a victory were. Was the offensive doomed from the start, or could the right combination of planning and military force have secured the objectives?&#10;&#10;In Edelweiss both players will put that question to the test as they struggle to outperform their historical counterparts.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Orchard",
        "description": "Obstgarten is a cooperative game for two or more players aged 3 and up. Only a quick harvesting of the trees carrying crunchy cherries, juicy apples, sweet pears and marvellous plums prevents the snitching of fruits by the impudent and insatiable raven. All players work together to harvest the fruits.&#10;&#10;",
        "artist": "Walter Matheis"
    },
    {
        "name": "Oh, Really!",
        "description": "Your goal in Oh, Really! is to think like the crowd &ndash; or at least like your partner. Five item cards &ndash; such as &quot;Hope&quot;, &quot;Garbage Collectors&quot;, &quot;Underwear&quot;, &quot;Wisdom&quot;, and &quot;Hearing&quot; &ndash; are placed on the table next to letters A-E. Each player then secretly places rank cards in order based on which item is most important to her: &quot;B&quot; first since you don't want to live in filth, then &quot;D&quot; because being wise is next most important after a clean home, and so on.&#10;&#10;Players then reveal their cards, showing all the cards in the first rank, then the second rank, and so on. Whichever letter appears the most in a position is the crowd favorite; those letters stay revealed, while all other letters are turned face-down again. Whichever player (or players) has the most cards revealed at the end of a round scores a point; if a player has all five cards revealed, she scores two points. Whoever scores seven points first wins.&#10;&#10;Oh, Really! can also be played in teams, with one player on a team trying to match the ranking of the other member. Scoring is handled the same as in the group game, and the first team to earn seven points wins.&#10;&#10;",
        "artist": "Jason Fidler,Mike Petty,Scott Starkey"
    },
    {
        "name": "Electronic Whac-a-Mole",
        "description": "This is a battery operated home version of the arcade game of the same name. There are two variants - the familiar &quot;Whac a Mole (on the top of the head)&quot; for 1 or 2 players, and a &quot;Follow Me&quot; game, which is a mole version of Simon.&#10;&#10;Instead of moles popping up out of holes, they have lights on top of their heads.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Electronic Detective",
        "description": "The ultimate &quot;Who-Done-It&quot; game, where 1-4 players combine human deductive reasoning with advanced computer logic to solve over 130,000 totally different murder mysteries.&#10;&#10;Bang! Bang! Shots ring out in the big city.  A body lies alone at the docks.  The funeral dirge sounds.  19 colorful characters at the scene of the crime flee to other parts of town.  As one of the &ldquo;private eyes&rdquo; assigned to the case, you must interrogate these suspects.  Players compete, using logic and deduction, to be first to identify the murderer.&#10;&#10;Features&#10;&#10;&#10;     Each suspect card contains different questions you may ask to obtain vital information which will help you deduce the identity of the murderer.&#10;     The computer becomes the suspects, as you &ldquo;grill&rdquo; them one by one.  You have the questions and it has the answers.  Get careless and you&rsquo;ll ask for useless information.  Ask a smart question and you&rsquo;ll have a key fact in a flash!&#10;     Electronic Display (light-emitting diodes) shows you the answers.&#10;     Your case fact sheet helps you study and weigh the suspects&rsquo; statements, and logically follow the tangled web of evidence.  Now you&rsquo;re ready to make an accusation.  If you&rsquo;re correct the sirens sound.  If not&hellip;Bang!  Bang!  The next victim is you and you&rsquo;re out of the game!&#10;     In its powerful microcomputer brain electronic detective has all the suspects&rsquo; alibis, plus key clues pertaining to the dastardly deed.  Its electronic I.Q. is at your fingertips!&#10;     You may recheck clues at any time using the computer&rsquo;s electronic memory bank.&#10;     Gun shots, police sirens, and the funeral dirge are all part of the game&rsquo;s play.&#10;     May be played at 3 different levels: &ldquo;Gumshoe,&rdquo; &ldquo;Sleuth,&rdquo; or &ldquo;Master Detective.&rdquo;&#10;     Automatically switches off after game play is completed.&#10;     Battery operated - 6 AA &ndash; you can play it anywhere.&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Chancellorsville (second edition)",
        "description": "This is a complete redesign of the original Chancellorsville (1961 Version) and it recreates the Civil War battles around the town of Chancellorsville.&#10;&#10;Includes standard and optional game rules along with a historical summary.&#10;&#10;Avalon Hill Complexity rating - 4&#10;&#10;Re-Implements:&#10;&#10;    Chancellorsville (first edition)&#10;&#10;&#10;&#10;&#10;",
        "artist": "Rodger B. MacGowan"
    },
    {
        "name": "D-Day",
        "description": "D-Day (Smithsonian Edition) is a re-designed, simplified version of the original 'classic' Avalon Hill D-Day- which had two versions as well: D-Day (1961) and D-Day (1977). It is one of Avalon Hill's game in their Smithsonian Series.&#10;&#10;Two scenarios, one historical and one &quot;what if&quot;, are covered by basic and optional rules.  A complete historical background and list of weapons, tanks, and aircraft is included.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Edel, Stein & Reich",
        "description": "Players take on the roles of directors of the trading house Edel, Stein &amp; Reich, wheeling and dealing at the world&rsquo;s precious gem exchanges. However, only those who correctly predict their opponent&rsquo;s intentions will win.&#10;&#10;Players attempt, over three phases, to accumulate as much money as possible. To that end, there are multiple actions that can be carried out: Players may choose to increase their gemstone supply, or they may choose Event Cards that may bring additional advantages over the course of the game. Then again, they may choose to simply take whatever amount of cash is currently being offered.&#10;&#10;However, only those players who choose an action that nobody else has chosen get to carry their actions out without hindrance. To that end, it pays to keep an eye on what the other players intend to do&hellip; The winner is the player with the most money at the end of the game.&#10;&#10;This game is #4 in the Alea small box series.&#10;&#10;Re-implements:&#10;&#10;&#10;     Basari&#10;&#10;&#10;",
        "artist": "Oliver Freudenreich"
    },
    {
        "name": "Coloretto",
        "description": "Game play in Coloretto is simple: Either draw a card to play to a row, or take a row of cards to add them to your collection. A row can have at most three cards, so at some point everyone is forced to take a row. Once all the rows have been claimed, players start a new round, drawing or taking once again.&#10;&#10;What are you trying to do with these cards? Collect huge sets - but only in three colors as every color beyond the third will cost you points. Jokers are highly-prized as they always match what you want, and +2 cards provide sure points, giving you a back-up plan if everything goes south in terms of the colors you're collecting.&#10;&#10;Once only a few cards remain in the deck, the round ends and everyone tallies their score, choosing three colors of cards to score positively while any other colors count against you. Each color is scored using a triangular number system: the first card in a color is &plusmn;1 point, the second card is &plusmn;2 points, and so on. The player with the high score wins!&#10;&#10;A two-player variant is included with some versions of Coloretto, with the only change being that rows can have only 1-3 cards placed in them, depending on the icons on the row cards.&#10;&#10;Nordic version include extensions: 'Coloretto: The Extra Cards', 'Coloretto: The Limit Cards' and 'Coloretto for two players'.&#10;&#10;",
        "artist": "Guido Favaro,Michael Schacht,Oksana Svistun"
    }
]