[
    {
        "name": "Dark Moon",
        "description": "WELCOME TO DARK MOON. The Noguchi Masaki interplanetary mining corporation welcomes you to its outpost on Titan, the dark moon of Saturn! You will be joining an experienced crew of miners, technicians, and adventurous souls who live to experience all the wonders that our solar system has to offer. Purpose, loyalty, camaraderie, friendship, and sacrifice all await you as a new and valued member of the Noguchi Masaki family!&#10;&#10;DARK MOON (formerly known as BSG Express), is a game of deception and betrayal at the cold edge of space.&#10; You are a crew member on a deep space mining expedition to Titan, the dark moon of Saturn. During a routine excavation, an &ldquo;incident&rdquo; occurs whereby some of the crew become infected with an unknown virus, and become paranoid, deceitful, and violent, trying to destroy the others.&#10;&#10;At the start of the game, players are divided into two teams: Uninfected and Infected. The Uninfected team simply needs to survive until the end of the game, while the Infected team secretly attempts to destroy them. Each player knows which team they are on, but does not know which team the other players are on! Who is your teammate and who is your enemy? Can you trust your best friend? And why doesn&rsquo;t anyone trust you when you tell them you&rsquo;re one of the good guys?! &#10; Roll dice, overcome traumatic events, throw your friends in quarantine when you don&rsquo;t believe them, and (if you&rsquo;re Infected) betray everyone at just the right moment to secure victory!&#10;&#10;",
        "artist": "William Bricker,Viktor Csete,Evan Derrick"
    },
    {
        "name": "Zombie Town",
        "description": "A fast 3 to 6 player non-collectible card game where everyone dies, the &quot;winner&quot; is just the last person to fall to the horde. A turn comprises seven actions: drawing cards; (if applicable) perform a hiding test to determine if any location is retained; (if applicable) play cards to perform defensive actions or deploy locations; (if applicable) take explosion or infection tests; adjust health level; distribute zombies to other players; discard down to current hand size. When your health reaches zero you are out of the game and the last player with any health left wins.&#10;&#10;The rules are simple and the game is quick to play.&#10;&#10;The game blurb reads as follows:&#10;&#10;&quot;Suddenly a small town was attacked by unknown viruses; all of the people was infected and became zombies. Only a few people survive...&quot;&#10;&#10;The game is distributed by Swan Panasia Distribution.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Würfel Bohnanza",
        "description": "W&uuml;rfel Bohnanza is, as you might suspect, a dice game in the Bohnanza family. Instead of cards, dice give you the beans that you must use to satisfy orders and (eventually) collect &quot;Bohnentalers&quot; (i.e., dollars, bucks, dinero...). The first player to collect thirteen Bohnentalers wins.&#10;&#10;At the start of the game, each player receives two order cards, each of which shows six orders; the player tries to complete orders on one card while using the other to cover completed orders. The easiest orders to complete &ndash; say, two specific bean types or three beans in any combination of two types &ndash; are at the bottom of the card, and the hardest ones &ndash; requiring, say, a four-of-a-kind or seven beans with no blue ones &ndash; are at the top. Orders must be completed from bottom to top.&#10;&#10;On a turn, the active player starts by rolling the seven bean dice, three of which have one combination of beans and four of which have another combination. This player must set aside at least one bean, then she rerolls any remaining dice, setting at least one aside, etc. After at most seven rolls, she completes as many orders as she can, reusing the dice as needed to complete orders. Once a player completes three orders, she can &quot;harvest&quot; the card for one coin. Each additional completed order is worth a coin, up to a maximum of four. When a player harvests the order card, she draws a new card and uses that to record completed orders (possibly on the same turn) on the order card she already had.&#10;&#10;In the Bohnanza card game, players trade cards to improve the standing of both parties involved in the trade. In W&uuml;rfel Bohnanza, the active player doesn't trade dice, but opponents do get to benefit from that player's rolls. After each roll by the active player, all other players can use the dice just rolled &ndash; and not dice already set aside &ndash; to complete orders on their own cards. Thus, the active player has some incentive not to dawdle too much with her rolls as her opponents might benefit from her turn more than she does.&#10;&#10;The game ends as soon as one or more players have collected thirteen Bohnentalers. The player with the most Bohnentalers wins!&#10;&#10;",
        "artist": "Björn Pertoft"
    },
    {
        "name": "Crooks",
        "description": "New York, 1935 &ndash; You are a cunning top criminal with a plan that just can't fail. You need only a number of thieves and other scum to put these plans into practice. Fortunately, the city is packed with unemployed rogues who linger in bars, at pool halls and by the race course waiting for a chance to make easy money. Gather the best thieves and rob various locations in the city so as to go home with the most money at the end of the day.&#10;&#10;In Crooks you assume the role of a mafia boss and want to use your thieves tactically to increase your earnings or to thwart others. To do this you must:&#10;&#10;&#10;    Look for the best thieves: Visit hangouts in the city and choose from the thieves available, taking into account that whomever you don't choose will work for your opponents!&#10;    Balance tactics and bluffing: The choice is yours ... thwart others or immediately carry out your own plans?&#10;    Use your cards wisely: Some thieves can also perform special actions, which increase your chances of winning.&#10;&#10;&#10;The second edition of Crooks features a cardboard box (instead of a tin), updated cards (with some crooks having new ranks), the removal of the Kingpin, a changed pickpocket rule, and a new type of card: the Support Crew, which affects the rank of the cards on its left or right.&#10;&#10;",
        "artist": "Dennis Lohausen"
    },
    {
        "name": "Little Devils",
        "description": "Everybody is fond of teasing and challenging each other from time to time. In this game you try to saddle opposing players with negative cards, and every little devil scores a penalty point. But take care: You will not escape the &quot;diabolical&quot; plans of your opponents either. Little Devils is a devilishly fun trick-taking game you keep on playing...&#10;&#10;Little Devils is a fluent trick-taking game with simple rules:&#10;&#10;    Players don't need to follow trump or suit and can play higher or lower than previously played cards.&#10;    The second card played &ndash; and not the first &ndash; determines the goal for that round.&#10;&#10;&#10;&#10;&#10;",
        "artist": "Dennis Lohausen"
    },
    {
        "name": "I Will Survive",
        "description": "You survived the jungle, cleaned out the lost temple of Muataca-Capichu, and crossed the land of the terrible Moumbas cannibals &ndash; yet the tribe has not forgiven your intrusion into their forest. You need to escape or else end up as supper, and unfortunately only one spot remains behind the controls of the hydroplane!&#10;&#10;In I Will Survive, players take on the role of one of six explorers, each with a unique combination of shield and weapon abilities. Each round consists of turns, and on each turn each player secretly chooses one of three moves &ndash; attack, defend, reload &ndash; then they all simultaneously make a gesture to signal their move. If a player defends, which costs a shield, no one can damage him this turn; if a player attacks, which costs a weapon, he injures the player targeted if that player did not defend himself; if he reloads, he reclaims spent tokens. Anyone injured moves one step closer to the cannibal's cauldron.&#10;&#10;Players continue taking turns until one or fewer explorers are uninjured. When this happens, everyone stands up, reclaims their shield and weapon tokens and starts a new round. When a player falls into the cauldron, he's out of the game. The last explorer uneaten wins!&#10;&#10;",
        "artist": "Antoine Riot"
    },
    {
        "name": "The Great Zimbabwe",
        "description": "The Great Zimbabwe is a game about building a trade based civilization in ancient Africa. It has been inspired by the old kingdoms surrounding the Great Zimbabwe, a world heritage site in southern Africa. Far into the previous century, colonial governments denied that a civilization that produced such impressive monuments and beautiful artwork could have been African in origin. But of course, this civilization was African, and the country of Zimbabwe itself was proudly named after this impressive cultural heritage. As always in our games, we have used this history for inspiration; however, first and foremost we wanted to create a highly playable and replayable Splotter game, so in many cases we took liberties with historical names, periods and artwork.&#10;&#10;In the game, players strive to build the most impressive monuments to one god of their choice. They can choose this god themselves-- each of the twelve gods offers a unique blessing, but each also requires a different amount of work to win the game. Building the monuments is done by developing a logistics network stretching across the region. Through this network, players produce and obtain ritual goods to raise their monuments and bring honour to the god of their choice.&#10;&#10;Here's the flavour text from the rules:&#10;&#10;The Mutapa king struts into the village, followed by a bunch of young warriors herding cattle. &ldquo;Oondabezitha &rdquo;, he addresses the assembly of kings, &ldquo;I have brought twelve heads of cattle for the ceremony tonight&rdquo;. The others seem to shrink in stature as he speaks. The star of the king of Mutapa is clearly ascending. They have not brought nearly as much cattle themselves. &ldquo;Soon, we will all be praying to Obatala&rdquo;, murmurs one of the older Kilwa traders. &ldquo;The Mutapa will be raising their godless monuments sky-high. Perhaps it is time for us to resort to some magic of our own&rdquo;. Then the sky breaks into a thunder and a torrential rain pours down on the assembly. The men scramble while the plains fill with water. The ceremony will be wet tonight...&#10;&#10;&#10;The Great Zimbabwe is a logistico-economic game in which players are tribal leaders in Africa trying to please the gods by building monuments.&#10;&#10;Buying technology, building craftsmen, gathering resources and worshipping a god are among the many decisions necessary to win in 'The Great Zimbabwe'. But the main way of getting there is building and developing a network of monuments. The higher the monuments, the closer the players will be to victory, but players must balance many subtle aspects of the game. If they develop their economy, if they worship a powerful god or if they use a lot of technology, they will need to score more victory points.&#10;&#10;Clever use of turn-order manipulation, economic development in an almost close environment, scarce natural resource use and logistical optimization to deliver goods from craftsmen to monuments: You only get one action per turn, so be smart! 'The Great Zimbabwe' is a race for victory, in which you decide how far you want to go and at what speed. Then other players' decisions change everything...&#10;&#10;",
        "artist": "Ynze Moedt"
    },
    {
        "name": "My Very First Games: Animal upon Animal",
        "description": "The animal stacking game, now for toddlers. This is a very basic game for very small children. You roll the die and stack the given animal on the matching tile and any other animals already stacked on that tile.&#10;&#10;The game's rules include three different versions for your young children to try.&#10;&#10;",
        "artist": "Kristin Mückel"
    },
    {
        "name": "Star Trek HeroClix: Tactics",
        "description": "Star Trek HeroClix: Tactics puts you in command of Federation and Klingon vessels and is 100% compatible with the HeroClix core rules system.  Tactics is intended as a standalone game system and will exist outside of the Modern and Golden Age tournament environments. What this means is Tactics operates by the same rules and Powers and Abilities card that your standard HeroClix game is played with, but is meant to be played as its own game. (Eg. No Spiderman Vs USS Enterprise. There's Star Trek HeroClix: Away Team for that)&#10;&#10;Tactics features more than 20 pre-painted ships from both the Federation and Klingon affiliations and will be available for sale in both a 4-Ship starter product and single figure boosters.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Great Heartland Hauling Co.",
        "description": "In The Great Heartland Hauling Co. (originally announced as Over the Road), players take on the role of medium haul Midwest truck drivers doing their best to make a living by hauling goods for big suppliers. Players truck to various locations around America's Heartland, picking up and dropping off goods using matching cards from their hands. Most locations have native goods that require fewer cards to load; other locations may pay a premium for those goods but may also require more fuel &ndash; and time &ndash; to get there with the cargo. With limited space in each trailer and only five cards in hand at a time, players will have to expertly manage their resources, as well as play the odds and press their luck to be the best trucker on the road.&#10;&#10;The Great Heartland Hauling Co. offers a lot of replay value through the use of cards to create a variable board set-up each game. The game includes 60 goods cubes, four thick cardboard trucks, and 46 resource cards &ndash; required for pick-up and delivery &ndash; that are drawn from a shared draft board, as well as 20 fuel cards, which are used to move about the Heartland.&#10;&#10;",
        "artist": "Brian Buckley,Christopher Kirkman"
    },
    {
        "name": "Star Trek Deck Building Game: The Next Generation – The Next Phase",
        "description": "&quot;Space, the final frontier...these are the voyages of the Starship Enterprise...it's continuing mission&hellip;to explore strange new worlds...to seek out new life and new civilizations...to boldly go where no one has gone before.&quot;&#10;&#10;In Star Trek [Deck Building Game]: The Next Generation - The Next Phase &ndash; a standalone game that can also be used as an expansion for Star Trek [Deck Building Game]: The Next Generation &ndash; you are the Captain of a small Starship with a standard crew and basic weaponry. Will you use your crew's experience to improve your ships systems or to recruit more experienced crewmen to your ship? Will you form diplomatic relationships or conquer civilizations in battle? Build your deck and explore the Star Trek universe!&#10;&#10;Play these different scenarios or create your own!&#10;&#10;&#10;    Explorations [Free For All] &ndash; Explore the universe, interact with alien races, complete missions and experience the mysteries of space. Gain knowledge and power to become a legendary Captain!&#10;&#10;&#10;&#10;    Reunification [Teams] &ndash; Team-up and determine if you are in favor of peace or war in the Alpha Quadrant! What will be the future of the Federation?&#10;&#10;&#10;&#10;    Borg Invasion II [Co-op] &ndash; &quot;I am the Borg.&quot; This time the Borg Queen has arrived to assimilate planet Earth! Work with your fellow players to defeat the Borg and the Queen.&#10;&#10;&#10;Integrates with:&#10;&#10;    Star Trek Deck Building Game: The Next Generation&#10;    Star Trek Deck Building Game: The Original Series&#10;&#10;&#10;&#10;&#10;",
        "artist": "Jak L. Hueng"
    },
    {
        "name": "Kings of Air and Steam",
        "description": "On the cusp of the twentieth century, America is the undisputed land of industry. Factories fire their machines twenty-four hours a day, and demand is skyrocketing in the cities. A small but fierce rivalry of shipping barons must manage their amazing airships and the extensive railroad system in order to get goods to the cities before the demand is met by someone else. Anyone who can't stay competitive will be left with nothing but dust in their coffers!&#10;&#10;The process is simple: Factories produce the goods (machinery, textiles, chemicals, food, and luxuries) that are coveted by the city folk.  Airships &ndash; forbidden from landing in the cities but capable of carrying cargo over great distances &ndash; must be used to gather those goods and deliver them to depots along the rail network. Trains then haul the goods to the cities that want them, earning cash for the competitor who gets there first! Will you be the &quot;King of Air and Steam?&quot;&#10;&#10;Kings of Air and Steam spans five rounds, and at the beginning of each round, players plan their Airship flights using four of their movement cards. When everyone is ready, everyone reveals their first planned card. According to the turn order and movement limits of their cards, players move their Airships, then take an Action; Actions include Building Depots, Upgrading your Airship or Train, Shipping Goods by rail, and Soliciting Funds from the bank. When all players have acted, the second planned cards are revealed, and so on through the four planned cards until all players have finished carrying out their plans for the round. All the while, players must keep aware of the rising values of the different types of Goods and try to get the most-valuable Goods from the specialized factories that produce them to the cities that want them. At the end of the game, the player with the most money and the greatest shipping network will be declared King of Air and Steam!&#10;&#10;Kings of Air and Steam includes seven teams of characters, each with unique powers to give them a competitive edge, and a modular game board that makes each game a different experience.&#10;&#10;",
        "artist": "Josh Cappel"
    },
    {
        "name": "Cuba Libre",
        "description": "In December 1956, paroled rebel Fidel Castro returned to Cuba to launch his revolution with virtually no political base and&mdash;after a disastrous initial encounter with government forces&mdash;a total of just 12 men.  Two years later, through masterful propaganda and factional maneuver, Castro, his brother Ra&uacute;l, and iconic revolutionary Che Guevara had united disparate guerrillas and exploited Cubans&rsquo; deep opposition to their dictator Fulgencio Batista y Zald&iacute;var.  Castro&rsquo;s takeover of the country became a model for Leftist insurgency.&#10;&#10;Castro&rsquo;s Insurgency&#10;&#10;Following up on GMT Games&rsquo; Andean Abyss about insurgency in modern Colombia, the next volume in the COIN Series, Cuba Libre, takes 1 to 4 players into the Cuban Revolution.  Castro&rsquo;s &ldquo;26 July Movement&rdquo; must expand from its bases in the Sierra Maestra mountains to fight its way to Havana.  Meanwhile, anti-communist student groups, urban guerrillas, and expatriates try to de-stabilize the Batista regime from inside and out, while trying not to pave the way for a new dictatorship under Castro.  Batista&rsquo;s Government must maintain steam to counter the twin insurgency, while managing two benefactors:  its fragile US Alliance and its corrupting Syndicate skim.  And in the midst of the turmoil, Meyer Lansky and his Syndicate bosses will jockey to keep their Cuban gangster paradise alive.&#10;&#10;COIN Series, Volume II&#10;&#10;Cuba Libre will be easy to learn for Andean Abyss players&mdash;both volumes share the same innovative GMT COIN Series system.  Like Volume I, Cuba Libre is equally playable solitaire or by multiple players up to 4&mdash;and with a shorter time to completion than Andean Abyss.  But Cuba Libre&rsquo;s situation and strategic challenges will be new.  A deck of 48 fresh events brings 1950s Cuba to life and includes &hellip;&#10;&#10;&bull; The Twelve:  The first wave&rsquo;s escape to the Sierra Maestra&mdash;inspirational legend or harbinger of defeat?&#10;&bull; El Che and Ra&uacute;l:  Brilliant in the field, or bungling hostage-takers?&#10;&bull; Operation Fisherman:  Can the rebels pull off a second invasion?&#10;&bull; General Strike:  Urban disruption or rebel embarrassment?&#10;&bull; Radio Rebelde:  Are the masses tuning in, or just the Army direction finders?&#10;&bull; Pact of Caracas:  Can the rebels unite?&#10;&bull; Armored Cars:  Mobile striking power, but in whose hands?&#10;&bull; Rolando Masferrer:  Brutal pro-government tactics&mdash;will they help or hurt?&#10;&bull; Fat Butcher:  Can the Mob&rsquo;s enforcer protect its casinos?&#10;&bull; Sinatra:  Frankie&rsquo;s Havana show a boom or bust, and who collects?&#10;&hellip; and much more.&#10;&#10;New twists match the COIN Series system to the situation in 1950s Cuba:&#10;&#10;&bull; It&rsquo;s the insurgents who build lasting capabilities, while the Government is limited to fleeting bursts of momentum.&#10;&bull; The Syndicate&rsquo;s bases are Casinos&mdash;expensive to build, but so important to Cuba no army will destroy them.  &#10;&bull; Syndicate special activities include calling in the &ldquo;muscle&rdquo; of Government troops and police to protect mob assets.  &#10;&bull; Stacks of Syndicate cash awaiting launder can fall in anyone&rsquo;s hands&mdash;even the corrupt Government&rsquo;s.&#10;&bull; The Government has its own terror tactic&mdash;reprisals&mdash;and can skim a portion of Syndicate profits.&#10;&bull; The eroding US Alliance with Batista overshadows all Government actions, not just through aid levels but also through the day-to-day ability of troops and police to operate.&#10;&bull; Even if Batista flees, the struggle may not end&mdash;the counterrevolutionary government may even become stronger!&#10;&#10;Multiplayer, 2-Player, Solitaire&#10;&#10;Cuba Libre provides up to 4 players with contrasting roles and overlapping victory conditions for rich diplomatic interaction. For 2- or 3-player games, players can represent alliances of factions, or the game system can control non-player factions . Or a single player as the Cuban Revolutionaries can attempt to topple Batista and seize power for themselves. The non-player sides will fight one another as well as the players, but too much power in the hands of any one of them will mean player defeat.&#10;&#10;More COIN Series Volumes to Come&#10;&#10;Andean Abyss and now Cuba Libre present a game system on modern insurgency readily adaptable to other conflicts, particularly those featuring the interaction of many sides (thus the name COunterINsurgency Series). A rich and under-represented history of guerrilla warfare beckons, as modern insurgency offers virtually unlimited, under-gamed topics for the COIN Series.  Volume III is A Distant Plain&#226;&#128;&#148;Insurgency in Afghanistan.  Volume IV is Fire in the Lake&#226;&#128;&#148;Insurgency in Vietnam.&#10;&#10;",
        "artist": "Xavier Carrascosa,Rodger B. MacGowan,Chechu Nieto"
    },
    {
        "name": "DiceAFARI",
        "description": "You and your friends are going on a photo safari! To see as many animals as possible, you will have to plan your trip well. Whoever visits the most areas and takes the best photographs will be the safari champion!&#10;&#10;In DiceAFARI, you select a route to visit on the animal-shaped map by rolling the custom dice strategically &ndash; but choose wisely because routes are limited and other players can revisit the areas you select. Be sure to take a photo of an animal you see before someone else does. Once the entire map has been visited, points are scored for sets of photos taken and areas most recently visited. The player with the most points wins!&#10;&#10;",
        "artist": "Brian Elligson,Darrell Louder,Tempest Production Studios LLC"
    },
    {
        "name": "Lumacorsa",
        "description": "In Lumacorsa, a family card game about snail-racing, players have to bet on the snails involved in the race. A player can alter the speed of the snails by playing cards from his hand.&#10;&#10;",
        "artist": "Guido Favaro"
    },
    {
        "name": "Rise!",
        "description": "In Rise!, players race to be the first to construct three towers on the growing game board, moving workers to and fro to keep the towers rising and the opponent befuddled.&#10;&#10;To set up, place 12 hexagonal tiles in a dogbone shape as specified in the rulebook, then place one token for each player on their starting locations. On a turn, a player takes two actions (possibly the same action twice) from this list of options:&#10;&#10;&#10;    Place a land tile adjacent to any existing tile.&#10;    Place a worker adjacent to any of your workers already on the game board.&#10;    Move one of your workers to an adjacent empty space.&#10;    Jump an opponent's worker and land on an empty space, removing that worker from play.&#10;    Remove two of your workers from the board to remove an opponent's worker from any space.&#10;    Remove two of your workers from the board to place one of your workers in any empty space.&#10;    Remove one of your tower layers from the board.&#10;&#10;&#10;If at any time during play you have a circle of six of your workers surrounding an empty space, place the first layer of one of your towers in that space. Your ring of workers must remain in place for two additional turns for the remaining two layers to be added to the tower; if your ring is disrupted, you can complete it later to continue the tower-building. If you completely surround an opponent's tower, you can remove the top level of that tower from the board.&#10;&#10;In addition to building three complete towers, a player can also win by eliminating all of the opponent's workers from the game board.&#10;&#10;",
        "artist": "Michael Coe"
    },
    {
        "name": "Pharaoh Code",
        "description": "In Pharaoh Code, you're trying to claim as many scarabs as you can by solving the aforementioned codes. To set up the game, you divide the number tiles into four piles based on the number of scarabs on them, with more scarabs typically signifying larger numbers. To create the number pyramid, you lay out one tile with four scarabs, two tiles with three, and so on.&#10;&#10;On a turn, one players rolls the three dice &ndash; an octahedron, a decahedron and a dodecahedron &ndash; then all players try to use the four fundamental arithmetic operations to transform the numbers on two or three of the dice to match one of the numbers on a tile. For example, amongst the cards on the board is a 72 and you rolled two 8s and one 1; you can calculate 8 x (8 + 1) and the result is 72. As soon as a player has reached a target number, she takes that tile off the game board, then flips the thirty-second sand timer. Everyone else can grab one tile during this time, then once time expires the players must demonstrate how they reached the number in question. If a player calculated correctly, she keeps the tile face-up; otherwise she flips it face-down as a penalty.&#10;&#10;Players then fill up empty spaces on the game board, then roll the dice again to start another round. As soon as a row cannot be filled, the game ends. Players then tally the scarabs they collected, subtract penalty scarabs, and see who has the highest score.&#10;&#10;",
        "artist": "Jun-Ho Na"
    },
    {
        "name": "Shadowrift",
        "description": "Haven Town is facing total annihilation at the hands (and teeth) of a horde of monsters from beyond the Shadowrift.&#10;&#10;You, the heroes, must band together to drive them back. To do this, you will need powerful spells, skills, attacks and loot. When the game begins, you are a basic hero; you can explore and fight. Luckily for you, Shadowrift is a deck-building game! You can buy new cards to add to your deck, cards that will define you as an adventurer and complement the strengths of your fellow heroes. Unlike other deck-builders, there is constant interaction with your fellow players as you figure out who will gain which benefit from the limited supply of townsfolk, offer their coin to help construct walls, and seek healing from anyone who's learned such magic.&#10;&#10;Shadowrift also features monsters that don't merely sit waiting to be slain; if you leave them alone, they will rip Haven Town asunder. They'll kill people, break walls, and kick your heroes in the face. Combat with them is intuitive (though frequently painful). For defeating a monster, heroes gain Heroism, a simple, consistent boost to their power that makes them better at anything they undertake. Since the monsters won't stop coming until the last Shadowrift is sealed or the town has been built into a mighty fortress, you'll need every boost you can take.&#10;&#10;The second edition of Shadowrift features many improved mechanisms, including a revised system for how monsters choose who to attack (based on types of villagers, instead of specific people) and a new system for monster powers (making them much more dangerous). It also has a revised card layout and a great deal of new and improved artwork.&#10;&#10;",
        "artist": "Enggar Adirasa,Kirsten Brown,Colin Epstein,Ross Grams,Tomasz Jedruszek,Nicholas Kay,Tom Kelly,Andy Kluthe,Philip X. Liu,José Muñoz,Terry Pavlet,Elin Petterson,Levente Rückert,Sabine van Apeldoorn,Thomas Williams"
    },
    {
        "name": "SchuhBidu",
        "description": "Centipedes want to be as long as possible to stand out from their fellow 'pedes and in SchuhBidu players can help them grow and grow &ndash; but only if they have shoes to place on the centipede feet.&#10;&#10;At the start of the game, each player takes a centipede &quot;head&quot; tile, while the feet tiles are placed in the center of the table. On a turn, the active player rolls all four dice, sets aside any he wishes, then rerolls up to two more times, with the option of rerolling dice set aside after the first throw. After his third roll (or earlier, if he wishes), he can take any one foot tile for which he has matching symbols on the dice (with suns counting as a wild symbol) and add it to his centipede&#10;&#10;The game ends after all the feet tiles have been claimed, and the player with the longest centipede wins. The rules include a variant for older players in which you can steal shoes from an opponent.&#10;&#10;",
        "artist": "Volker Maas,Maciej Szymanowicz,Irene Wanitschke"
    },
    {
        "name": "RED",
        "description": "RED is a three-colored tile-laying game for three players. The three colors in the game are black, white, and red, and each player will be a different color. Each tile has a background color and a different-colored circle in the middle. There are 6 different combinations and 5 small tiles and 1 large tile for each combination.&#10;&#10;Players place tiles on the table trying to connect groups of their border color and groups of their circle color.&#10;&#10;RULES&#10;&#10;Place all the tiles face-up in a pool, leaving room to play the game.&#10;&#10;Each player is assigned one of the three colors by some agreeable method and takes the corresponding counter; the counters just show which player is which color. The order of play is White player, then Black, then Red. Players take turns placing any tile from the pool on the playing surface according to the following rules:&#10;&#10;- Tiles must be placed so that they align with an imaginary grid of squares the size of the small tiles.&#10;&#10;- White cannot play a large tile on the first turn.&#10;&#10;- Except for the obvious exception of the first tile, each new tile must be orthogonally adjacent to at least one small tile (i.e. must touch a small tile). Just having the corners touch isn't good enough.&#10;&#10;- A large tile cannot be placed orthogonally adjacent to another large tile (that is, no two large tiles can touch each other, except at the corners).&#10;&#10;The game ends when there are no available moves.&#10;&#10;SCORING&#10;&#10;Small tiles count as 1 point, and large tiles count as 2 points.&#10;&#10;Find the largest connected group of tiles with your border color, and then find the largest connected group of tiles with your circle color. Multiply these two numbers to determine your score.&#10;&#10;The player with the most points wins. If two players tie, the third player wins! If all three tie, play again!&#10;&#10;The rules include a variant for 2 players.&#10;&#10;Microbadges:&#10;&#10;&#10;&#10;",
        "artist": "Néstor Romeral Andrés"
    },
    {
        "name": "Krosmaster: Arena",
        "description": "In Hormonde, a strange world deep in the folds of time, the Hour Demons have finally found a hobby worthy of their cruel hearts... the Arena! The idea is simple. They select warriors of all ages and lands and whisk them away to the Hormonde where the enslaved gladiators must fight for their souls and the chance to become the ultimate champion. Why don't the gods put an end to this macabre circus? Why does Xelor himself turn a blind eye to the demons' meddling with time's delicate web? Well, you may ask, but it is not for us mortals to know the minds of the gods.&#10;&#10;Krosmaster: Arena is a player-vs-player, tactical card game with anime-style miniatures that offers the craftiest tacticians among you the chance to challenge other players to heated battles in arenas scattered around Hormonde. All players build their team using a pre-determined method, whether a point system, draft, or at random. Equip your team with spells, weapons and other items adapted to their requirements, then utilize their various talents and abilities to create a powerful fighting force. Every figure has a point value attached to it to help balance things out. Randomly drawn event cards spice up the game at each turn, and the winning conditions differ for each game based on the scenario you choose to play. Only those who are able to create a strong, yet versatile, strategy will prevail!&#10;&#10;",
        "artist": "Édouard Guiton,Alexandre Papet"
    },
    {
        "name": "Sugar Gliders",
        "description": "Sugar Gliders is a board game for two to four players. Each game lasts around 20 minutes. Each player has a sugar glider, that has to collect as many fruits as possible by jumping from branch to branch.&#10;&#10;The sugar glider is a small marsupial that loves nectarous foods. As its name suggests, it&rsquo;s capable of gliding through the air, much like a flying squirrel.&#10;&#10;COMPONENTS&#10;&#10;- A board depicting a tree with 61 cells.&#10;- 4 sugar gliders in different colours.&#10;- 60 food tiles in 5 types: 1 fruit, 2 fruits, 3 fruits, 4 fruits, 1 big fruit (5 points).&#10;- A carrying case.&#10;&#10;GAME PREPARATION&#10;&#10;Each player chooses a player color and takes the corresponding sugar glider.&#10;&#10;Leaving the center space empty, randomly distribute the 60 tiles face-up to the 60 other spaces on the tree, 1 per space.&#10;&#10;White starts by choosing any space with a white fruit (value 1 tile), and placing his sugar glider on it. The tile in that space will be his &lsquo;jumping tile&rsquo;. In turn, the other players do the same.&#10;    &#10;The game can start now. White plays first.&#10;&#10;GAME RULES&#10;&#10;The game is played in turns, counterclockwise. On your turn, you must either make your sugar glider jump or go into a brief state of torpor:&#10;&#10;JUMP&#10;&#10;Move your sugar glider in a straight line a number of spaces equal to your &lsquo;jumping tile&rsquo; (this means one space in the first turn). If you have no &lsquo;jumping tile&rsquo; underneath your sugar glider, you must use one from your reserve. Notice that purple fruits count as 5 movement points.&#10;&#10;Then you take the &lsquo;jumping tile&rsquo; that you just used, and put it beside yourself face-up. This is your &lsquo;reserve&rsquo;. If you had no &lsquo;jumping tile&rsquo; underneath your sugar glider and had to use a tile from your reserve, discard this tile to the game case; it cannot be used again for the rest of the game.&#10;&#10;The tile on which your sugar glider has landed (if any) is your new &lsquo;jumping tile&rsquo;.&#10;&#10;Exceptions:&#10;&#10;- The sugar gliders cannot jump outside the tree.&#10;- A sugar glider sitting in the center space can jump to any space on the board by spending any tile from his reserve (no need to match the length of the jump).&#10;- A sugar glider cannot move through another sugar glider.&#10;&#10;Example: Anna wishes to make her sugar glider jump, but there is no &lsquo;jumping tile&rsquo; underneath her sugar glider. She uses a &lsquo;2&rsquo; from her reserve, moves the sugar glider 2 spaces in a straight line, and discards the tile she&rsquo;s used to the case.&#10;&#10;TORPOR&#10;&#10;You don&rsquo;t move your sugar glider. Take the &lsquo;jumping tile&rsquo; from underneath your sugar glider (if there is one), and add it to your reserve.&#10;&#10;GAME END&#10;&#10;The game ends when all the sugar gliders are consecutively in a state of torpor, or when the tree runs out of tiles, whichever happens first.&#10;&#10;Each player sums the values of the tiles in his reserve (purple tiles count as 5 points). Highest score wins. In case of a tie, play again.&#10;&#10;VARIANT FOR 2 PLAYERS&#10;&#10;For shorter 2-player games, discard all the purple fruit tiles and 3 tiles of each other value. Then play on the inner board.&#10;&#10;",
        "artist": "Heather Cornelius,Tomasz Larek,Dennis Lohausen,Néstor Romeral Andrés"
    },
    {
        "name": "Metro 2033",
        "description": "Welcome to the future&#10;&#10;The year is 2033. The world is in ruins. All the major cities have been wiped away by a nuclear war. Flooded with radiation, the planet surface is largely unfit for life. Handfuls of survivors have found refuge in antinuclear bunkers, the largest of which is the Moscow Metro. The Metro has become humanity&rsquo;s last haven after Judgment Day.&#10;&#10;Metro 2033 is based on the popular Metro 2033 universe created by Russian writer and journalist Dmitry Glukhovsky. After the nuclear strike, thousands of survivors have found refuge in the Moscow underground (a.k.a., the Metro) &mdash; the biggest shelter in the world. In the stations and tunnels deep below the surface a new civilization emerges.&#10;&#10;Gameplay&#10;&#10;Each player is a leader of one of the many factions of post-nuclear underground. In order to win, a faction has to achieve ten victory points (VPs). Each station under the faction's control gives it 1 VP; different quests also bring VPs when completed. The other way to win is to capture all four stations of Polis &mdash; the cultural and political heart of Metro. Each faction has a hero at its disposal. Heroes can travel the underground, gain quests and equipment that increases their abilities, fight opponents' heroes, attack stations, and so on. The army of a faction can also attack stations, and usually with better chances to win, but it can target only adjacent stations. Stations under factions' control produce resources &mdash; pigs, ammo and mushrooms &mdash; that are used to capture new stations, strenghten the army, buy equipment and obtain quests. The production of resources and other game events are determined by a special sequence. This sequence tells what will happen each round: production of certain recources, a vote for a new law, or a sudden attack from the dark that must be repelled.&#10;&#10;Players can attack stations with their armies or their heroes. Both have strength that may be increased by hiring new troops or buying useful equipment. When attacking a neutral station, the army/hero fights a random threat from the special deck and has to beat its strength. When attacking an opponent, the attacker confronts his army or hero. In battles between players a special set of combat cards is used; these cards give various bonuses to strength depending on the card chosen by the opponent, so the goal is to deduce which combat card will be used by the other side.&#10;&#10;",
        "artist": "Sergey Dulin"
    },
    {
        "name": "BraveRats",
        "description": "BraveRats, first released as R, is a simple and short simultaneous action selection game for two that's played with cards. Both players have a hand of eight cards, numbered 0 to 7, with each card having a special power. Both players choose a card, then reveal them simultaneously. The highest card wins the round, and players play until someone has won four rounds. The cards' special powers greatly influence the game.&#10;&#10;",
        "artist": "Noboru Sugiura,Christophe Swal"
    },
    {
        "name": "Abaddon",
        "description": "Game description from the publisher:&#10;&#10;It's the distant future, and mankind has taken a galactic leap forward through space, time, and technology. Life as we know it struggles to endure on the Abaddon. Once the home of a mysterious, non-human civilization, the planet is now a desolate wasteland bearing one immensely precious resource: Feronium power crystals. The unimaginable energy contained within the crystals is coveted by two groups of humans: the Satellite City-States and the Commonwealth Alliance. Using Links &ndash; giant bio-mech suits made from modified military vehicles and alien technology &ndash; the warring factions fight a weary battle for territorial control of the Abaddon.&#10;&#10;At your disposal in Abaddon is a 28&quot; x 19&quot; battlefield game board with 32 highly-detailed mech figurines, 18 free-standing landscape terrain features, over 100 game-changing Wild Fire and Weapon System cards, dozens of tokens, battle dice and a Battle Manual containing over 15 mission scenarios. Choose your allegiance and lead your army in non-stop excitement as you forge through unforgiving terrain, fight to overcome random and bizarre technological glitches, and battle your enemies in never-ending war.&#10;&#10;Abaddon is a furious, two-to-four-player game of futuristic combat. Each scenario is laid out on the customizable battlefield game board with each side using a varying number of units. The game is played in turns during which a player rolls his Activation Dice, allowing him to &quot;activate&quot; certain units and move them. These mechanical units &ndash; Links &ndash; are powered by Feronium power crystals, and as they take damage these crystals are depleted. A unit that runs out of crystals is unable to continue functioning and is considered destroyed.&#10;&#10;Combat is card- and dice-based. The attacker lays out his Weapon System cards, targeting defending enemy units. Once the attacker has laid out all of his planned attacks, the defender may defend with his own Weapon System cards. These cards can modify the dice rolls that are used to determine the results of the combat. Additionally, due to the experimental nature of the Links and the mysterious happenings in the Abaddon region, things can, and often will, go wrong. These malfunctions and odd happenings are represented by Wild Fire cards, the drawing of which can result in anything from possible shutdowns to anti-gravity surges.&#10;&#10;Victory is determined based on stipulations presented by the chosen mission scenarios. Typically, victory is achieved by damaging and destroying your opponent's units by way of their power crystals. Each destroyed enemy crystal is worth one victory point, which players must collect in order to win.&#10;&#10;",
        "artist": "Wan Chiu,Nate Furman,Zac Pensol,Chris Quilliams,David Wilson"
    },
    {
        "name": "Disaster Looms!",
        "description": "The Earth is probably doomed, and rumors and speculation run rampant. Newspaper headlines from across the globe stir the populace to desperation:&#10;&#10;&quot;MELTING POLAR ICE CAPS&quot; &quot;RISING SEA LEVELS&quot; &quot;POLLUTION!&quot; &quot;OVERPOPULATION!&quot; &quot;NUCLEAR WINTER?&quot; &quot;RAVENOUS BLACK STAR GOATS?&quot; &quot;WILL METEORS STRIKE YOUR CHILDREN?&quot; &quot;DISASTER LOOMS!&quot;&#10;&#10;The race to escape Earth has begun! With the world's nations in decline, powerful corporations now stand as humanity's last hope. Take the reins of one such corporation, as CEO, and venture out into space. With your mission in hand; build ships, collect resources, research technologies, survive the dangers of space exploration, and, while ticket sales hold steady, preserve the human race. Remember to stay a step ahead of competing corporations, which can use slick marketing campaigns and 10 cent tchotchkes to buy the loyalty of the people you just saved from certain doom!&#10;&#10;In Disaster Looms!, players are rewarded points for sticking to the mission and building colonies, and saving colonists. As you are a CEO you are also rewarded points for filling the Corporate treasury, and building the company's value proposition by retaining rights to the best technologies. Gameplay is fast, and exciting. Events, and the vast variety of hazards that space has to offer will keep you on your toes, and your underlings busy on the paperwork for decades to come!&#10;&#10;The game is played in five phases:  Research, Fleet, Management, Revenue, and finally First Player Turn Auction. All players will complete each phase, in turn order, before proceeding to the next phase. This helps to keep the game moving, and keeps players engaged. In Research phase players can pay to research, or choose to license another players tech. In the Fleet phase players get one action with each ship they own. The Management phase is when players build new ships, special tech items, and sell technology to the public domain. The Revenue phase is when players collect their hard earned resources, including a small stipend from their home office on Earth. And finally, the turn auction phase is a bidding war for who goes first. Not that important at the start of the game, but monumental for the end.&#10;&#10;",
        "artist": "Sylvia Armitstead,Jules Ius"
    },
    {
        "name": "Schlock Mercenary: Capital Offensive",
        "description": "Schlock Mercenary: Capital Offensive is a multi-player tactical shooter, played on a grid-based modular map, set in the popular Schlock Mercenary epic science fiction webcomic created by Howard Tayler. Players take on the roles of Tagon's Toughs and a variety of other characters while working to achieve scenario-specific goals.&#10;&#10;Schlock Mercenary: Capital Offensive includes roughly one hundred pieces of original artwork, including top down floor tiles, plasma cannons, scanners, turrets, Teraport cages, and more. The game includes several scenarios, with more scheduled for release in future years.&#10;&#10;Featured characters from the comic are Tagon, Elf, Schlock, Ennesby, Legs, Thurl, Kevin, Shodan, Elizabeth, Petey, and Partnership Collective Drones.&#10;&#10;",
        "artist": "Erik Ramirez,Howard Tayler"
    },
    {
        "name": "Monster Factory",
        "description": "In Monster Factory, the players take turns drawing and placing tiles, either adding to their own monsters or to those of their opponents. The goal is to make monsters that are big, but not so big that they go unfinished.&#10;&#10;Nina Paley did the original art, with Marco Morte coloring it.&#10;&#10;",
        "artist": "Nina Paley,Marco Primo"
    },
    {
        "name": "Epic Spell Wars of the Battle Wizards: Duel at Mt. Skullzfyre",
        "description": "Game description from the publisher:&#10;&#10;Did you know that magical wizards are battling to the death ... and beyond ... right now!? &quot;Why battle?&quot; you might ask. &quot;What have I got to prove, magic man?&quot; Only who's the most awesomely powerful battle wizard in the entire realm, that's what! As a Battle Wizard, you'll put together up to three spell components to craft millions (okay, not really) of spell combos. Your spells might kick ass, or they could totally blow &ndash; it's up to you to master the magic. You will unleash massive damage on the faces of your wizard rivals in a no-holds-barred, all-out burn-down to be the last Battle Wizard standing. And it doesn't stop there! Powerful magic items bring on a whole new level of bloody carnage as you and your mighty wizard opponents tear each other limb from limb in an orgy of killing! Do you have what it takes to use epic spells in a war at Mt. Skullzfyre? Will YOU be the Ultimate Battle Wizard!?!&#10;&#10;Epic Spell Wars of the Battle Wizards: Duel at Mt. Skullzfyre is a humorous card game depicting a vicious, over-the-top battle between a variety of comically illustrated wizards. The game focuses primarily on creating three-part spell combos to blast your foes into the afterlife. The unique Dead Wizard cards allow players to stay in the game even after their wizards have been defeated.&#10;&#10;",
        "artist": "Nick Edwards"
    },
    {
        "name": "Goblins: Epic Death",
        "description": "The new Goblin chiefs are ready to sound the charge and assault the castle! This time, the fortress is defended by a moat full of muddy water, but our fearless heroes did not come unprepared! Among the Goblin warriors are lifeguards, rafts, divers, fishermen, and even a pedal-boat &ndash; and they will all be needed to face the hazards (as well as the monsters!) hidden under the waters defending the castle! There are plenty of heroes of every kind, but this does not assure victory, especially when a fray erupts among the Goblins in the middle of the battlefield! But at the very end, there will be just one cry: Goooooobliiiiiiins!!!&#10;&#10;Coming from the unleashed minds of 4G, Goblins: Epic Death, a fast-paced &quot;card 'n' luck&quot; game, is a new chapter in the saga of our green-skinned little friends. Victory is at hand, and the castle is ready for capture: Both are just an &quot;epic death&quot; away from you! So toss your Goblins, cross your fingers, and pray they all die. That way, victory will be yours!&#10;&#10;",
        "artist": "Dante Maiocchi"
    },
    {
        "name": "Mine Shift",
        "description": "How can you forge ahead through the jeweled walls of the mine shaft? Shift them! Rotate a game tile a quarter turn to move the mine wall and allow your gemstone access. Or rotate tiles to prevent your opponent from moving. There are walls everywhere, but strategic miners can successfully make their way through to the other side. With 27 game board tiles, the set-ups are unlimited for a brand new game every time you play. 2 players.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Munchkin Apocalypse",
        "description": "Munchkin Apocalypse is a core set in the Munchkin series with an end of the world theme that includes natural disasters, zombie takeovers, Armageddon, alien invasions, nuclear war, etc. And while this is still a standard Munchkin game where you try to level up by killing the monsters, stealing the treasure, and stabbing your buddy, there's a new &quot;Seal&quot; mechanic that significantly changes the gameplay.&#10;&#10;Seals are a reference to the biblical seals of the Apocalypse. They can be opened and closed, although it's typically more difficult to close them. Once seven Seals are open, the game ends immediately, and the player with the highest combat strength (excluding levels) is the winner. The Seal mechanic adds a sense of impending doom to the game, meant to mimic the sense of impending doom for a real apocalypse. It also tends to create situations where the group works together to close a Seal in order to prevent a player from winning via the Seal mechanic. So there is more teamwork than in a regular Munchkin game.&#10;&#10;The balance of the deck is also different than the other Munchkin sets. There are a lot more Disaster cards, which are equivalent to traps and curses, so bad things tend to occur more frequently. Also, there are more monsters, especially high-level monsters. To offset this, however, there are more item enhancers and high-bonus items. It's been stated in the Munchkin forums that Munchkin Apocalypse is harder to play and is intended more for seasoned Munchkin veterans.&#10;&#10;Munchkin Apocalypse has four new classes but does not have races, powers, or other &quot;thingies&quot;. It includes Undead and Shark monsters, which follow special rules.&#10;&#10;The game comes with 180 cards (92 Doors, 76 Treasures, 12 Seals). The Seal cards are a different size than the regular cards--they're square and are shorter but wider (2.75&quot; x 2.75&quot;). The included d6 is orange with lime green pips, similar in color to the orange dice in the +6 Bag o' Radioactive Munchkin d6.&#10;&#10;",
        "artist": "John Kovalic,Ethan Nicolle,Len Peralta,Gabby Ruenes"
    },
    {
        "name": "Munchkin Conan",
        "description": "Munchkin Conan is a 168-card core set in the Munchkin family of games, with 101 Doors and 67 Treasures. Unlike other core sets, it lacks unique card backs, instead using the standard card back from Munchkin. The included Munchkin-head d6 is yellow with dark red print.&#10;&#10;In Munchkin Conan, Robert E. Howard's epic hero gets the full Munchkin treatment. Play a Cimmerian Warrior or a Stygian Wizard! Wield the Sword of the Phoenix and poison your foes with Black Lotus! Slay Thoth-Amon's minions, Pict raiders, and abominable monsters, and hear the lamentations of their women! On many of the cards, the publisher provides context by including relevant quotes from Howard's work.&#10;&#10;Munchkin Conan has a new type of card &ndash; birthright &ndash; and the mechanisms are similar to that of classes and races in that you can have only one in play at a time; you may discard a birthright at any time but may play one only on your turn or when you first get it. The Munchkin Conan core set comes with two birthrights: &quot;Noble&quot;, which allows you to have an extra Comrade (see below), and &quot;Barbarian&quot;, which allows you to ignore all &quot;Usable By&quot; and &quot;Not Usable By&quot; restrictions on items. There is no birthright analogue to &quot;Super Munchkin&quot; or &quot;Half-Breed&quot;.&#10;&#10;Speaking of races and classes, the races in Munchkin Conan are &quot;Kushite&quot;, &quot;Zamoran&quot;, &quot;Cimmerian&quot;, and &quot;Stygian&quot;; when playing a blender game, they are all considered to be human unless the other sets have non-human races. The classes are &quot;Cleric&quot;, &quot;Thief&quot;, &quot;Warrior&quot;, and &quot;Wizard&quot;, and are identical to the fantasy Munchkin classes with the same names.&#10;&#10;The Munchkin Conan hireling is called a Comrade. Comrades fall in the same class as the Hirelings, Minions, Mooks, Sidekicks, etc. that come with other flavors of Munchkin. Each Comrade is associated with a class or birthright, and gives you some of the advantages of that class/birthright. Comrades can carry an item for you, even some that you can't legally use yourself, and their gender matters. They also have the standard Hireling ability to sacrifice themselves to give you an automatic escape when running away.&#10;&#10;Part of the Munchkin series.&#10;&#10;",
        "artist": "John Kovalic"
    },
    {
        "name": "Zoneplex",
        "description": "In the far future, humanoid empires of the universe turned to an intense study of ancient civilizations that existed on a planet known as Earth. They learned that these ancients simultaneously built pyramids towards the sky and had an extensive knowledge of the stars. It was rumored that perhaps they were the original colonizers and space-farers of the first human age.&#10;&#10;Now, at the edge of a colossal black hole, a pyramid-craft known as the Zoneplex has emerged with legendary markings and glyphs of the deep past. The known empires have sent their elite warrior-monk mystics on a one-way mission to gain control of the Zoneplex, to emerge victorious and ultimately control the pathways of the universe and time itself.&#10;&#10;Zoneplex is a game that combines a tile-laying/exploration mechanism, a collaborative battle system and a zone control system to create an intriguing adventure in an alien pyramid.&#10;&#10;The game works in 2 phases with the first phase players not counting Influence points until the pyramid is completed.&#10;&#10;In phase 1 players strategically lay tiles determined by action cards to build their pathway through the Zoneplex pyramid whilst being cognizant of the Sacred Symbol card that they are bestowed with before the game begins. While building strategically players also confront creatures within the pyramid which they must collect to become worthy to enter the Eye and win the game. The players control the Zoneplex by gaining Influence points which occurs when a Player places a spirit-stone on the board. Spirit Stones not only sustain one's Influence points but can also be removed to gain bonuses in combat.&#10;&#10;In phase 2 after exploring the pyramid, the players reveal their Sacred Symbol cards and count influence points, then a cutthroat race for survival and worthiness begins as players vie to enter &quot;The Eye of The Zoneplex&quot; to become the decisive winner or stand their ground with the most influence points as the action cards run out.&#10;&#10;",
        "artist": "Niklas Åkerblad,Peter Lazarski,Alex Skinner"
    },
    {
        "name": "Angry Birds: On Thin Ice",
        "description": "This game one of the many games in the Angry Birds Series.&#10;&#10;Board game based on the bestselling phone app Angry Birds On Thin Ice. Players build structures and try to launch his birds and destroy the opponents' buildings. In his turn player draws a card and build the structure shown before their opponents launch Angry Birds in an attempt to knock down the structure to win points! &#10;Player with the most points in the end of the game is the winner.&#10;&#10;Save the Angry Birds! The game of exciting skill and action based on the bestselling phone app Angry Birds On Thin Ice lets players build, launch, and destroy with fun features, including pigs with helmets, breakable ice-block building pieces, an exploding TNT box, and the large red bird character. Players draw a card and build the structure shown before their opponents launch Angry Birds in an attempt to knock down the structure-- and the pigs-- to win points! Includes 2 Angry Birds, 3 green pigs, a slingshot-style catapult launcher, structure pieces, and mission cards. 2 to 4 players. Ages 5 and up.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Snake Oil",
        "description": "In the Old West, the wily snake oil salesman had a special talent, getting the most skeptical customers to buy the most dubious products. Now it's your turn! Invent your own zany two-word products &ndash; Rumor Mirror! Burp Balloon! &ndash; and sell them to all types of wacky customers. If the round's customer buys your product, you win!&#10;&#10;To set up Snake Oil, each player takes six purple word cards. The customer for the round draws a customer card and announces it. Inventors quickly combine two purple word cards from their hand to form a crazy new product to sell to that customer. When ready, each inventor quickly pitches his or her product directly to the customer. The customer can end any pitch that goes longer than thirty seconds. The customer decides which product to buy and gives the inventor of that product the round's customer card as the prize. Inventors discard all used word cards and take two new word cards each. The player to the left of the customer becomes the next round's customer. Play repeats until each player has been the customer once.&#10;&#10;Whoever collects the most customer cards wins.&#10;&#10;",
        "artist": "John Kovalic"
    },
    {
        "name": "Article 27: The UN Security Council Game",
        "description": "Article 27: The United Nations Security Council Game gets its title from &ndash; yes, you guessed it &ndash; Article 27 of the United Nations Charter, which includes these two provisions:&#10;&#10;1. Each member of the Security Council shall have one vote.&#10;2. Decisions of the Security Council on procedural matters shall be made by an affirmative vote of nine members.&#10;&#10;In this negotiation game, each player represents one member of the UN Security Council and will both present and be presented with different proposals.&#10;&#10;In each round, one player acts as the UN Secretary General, presents a proposal to the Council and presides over a negotiation period that lasts no more than five minutes. The proposal will affect five issues &ndash; military, currency, etc. &ndash; in various ways, and each player has a secret document for the round that tells him how a change in each issue will affect him. All players openly negotiate on what they need in terms of points and bribes in order to vote for that proposal.&#10;&#10;After at most five minutes, the Secretary General closes negotiations by banging his wooden gavel, then players vote yes or no on the proposal. Any &quot;no&quot; vote kills the proposal, as in the United Nation's actual Security Council &ndash; but vetoing a proposal costs a player points, so he might prefer to look for deals that will enable him to say &quot;yes&quot;. The Secretary General scores a bonus when his proposal succeeds, so he and others who will benefit might be willing to negotiate to make the proposal sweet for all.&#10;&#10;After each player has served as Secretary General once (twice in a three-player game), each player scores based on bribe money on hand, points scored from proposal cards, and how well the player fulfilled the secret agenda card he received at the start of the game.&#10;&#10;",
        "artist": "Michael Christopher"
    },
    {
        "name": "Escape: The Curse of the Temple",
        "description": "Escape: The Curse of the Temple is a cooperative game in which players must escape (yes...) from a temple (yes...) which is cursed (yes...) before the temple collapses and kills one or more explorers, thereby causing everyone to lose.&#10;&#10;The initial game board consists of a row of three square tiles, each showing a combination of two symbols, say, two green adventurers or one green adventurer and one blue key in one corner of the tile. All of the explorers start in the center tile &ndash; the safe room &ndash; and each player starts with a hand of five dice. Each die has five symbols:&#10;&#10;&#10;    A cursed mask &ndash; this die is set aside when rolled.&#10;    A golden mask &ndash; each such symbol counteracts two cursed masks, either your own or those of another explorer in the same room.&#10;    A red torch or blue key &ndash; these are used to enter rooms, access treasure, or activate gems.&#10;    A green adventurer, which appears twice on the die &ndash; you need these to move from room to room, and to activate some gems.&#10;&#10;&#10;Escape is played in real-time, with all players rolling dice and taking actions simultaneously. You must roll the right symbols to enter a room, and if you're at an open doorway, you can roll to reveal the next tile in the stack and add it to that doorway. Some rooms contain combinations of red and blue symbols, and if you (possibly working with other players in the same room) roll enough red or blue symbols, you &quot;discover&quot; magic gems, moving them from a separate gem depot onto that tile.&#10;&#10;The real-time aspect is enforced by a soundtrack to be played during the game. At certain points, a countdown starts, and if players aren't back in the safe room when time is up, they lose one of their dice.&#10;&#10;Once the exit tile is revealed, players can attempt to escape the temple by moving to that tile, then rolling a number of blue dice equal to the magic gems that haven't been removed from the gem depot. Thus, the more gems you find, the easier it is to escape the temple. When a player escapes, he gives one die to a player of his choice. If all players escape before the third countdown, everyone wins; if not, everyone loses, no matter how many players did escape.&#10;&#10;Escape: The Curse of the Temple includes two expansion modules that can be used individually or together. With the &quot;Treasures&quot; module, some rooms contain treasure, and when you reveal such a room, you place a face-down treasure chest on the tile. Roll the symbols on that chest tile, and you claim the treasure for use later: a key lets you teleport anywhere, a path lets you connect two rooms that otherwise have no door between them, and a medic kit heals all players instantly (putting black dice back into play). With the &quot;Curses&quot; module, some tiles &quot;curse&quot; players by forcing them to place one hand on their head, keep mute during play, or otherwise do what you wouldn't want to do while escaping a temple!&#10;&#10;",
        "artist": "Oliver Schlemmer"
    },
    {
        "name": "Clocks",
        "description": "In Clocks you try to make the hours count, and the clock is ticking...&#10;&#10;Each player chooses a clock and receives a number of coins. The start player rolls a number of dice equal to the number of players plus one, then divides them into groups. All players make a simultaneous blind bid on the dice lots, with the highest bid choosing first, and so on. Each player puts the purchased die/dice on his clock in a clockwise direction, gaining money, bonus actions, or both in the process. On each turn, a player may execute one free action, in addition to buying one more action.&#10;&#10;As soon as the value of all placed dice match the numbers on a player's clock, that player wins!&#10;&#10;",
        "artist": "Dany Stuer"
    },
    {
        "name": "Grill Party",
        "description": "It's barbecue time, so call your friends and tell them to bring the ingredients to grill!&#10;&#10;In Grill Party, each player has a deck of twenty cards depicting the conditions for the meal &ndash; e.g., &quot;More Steaks than Corn&quot;, &quot;More Fish than Steaks&quot;, &quot;No Fish&quot;, &quot;More Wurst than anything&quot; &ndash; and a set of wooden tokens: fish, corn, wurst and steak.&#10;&#10;On your turn, you can exchange one token from your hand with one token on the central barbecue or in the possession of another player, then play as many cards from your hand as you can that meet the condition depicted. The first to rid himself of cards wins.&#10;&#10;",
        "artist": "Michael Menzel"
    },
    {
        "name": "Timeline: Historical Events",
        "description": "Timeline: Events is a card game played using 110 cards. Each card depicts a historical event on both sides, with the year in which that event occurred on only one side. Players take turns placing a card from their hand in a row on the table. After placing the card, the player reveals the date on it. If the card was placed correctly with the date in chronological order with all other cards on the table, the card stays in place; otherwise the card is removed from play and the player takes another card from the deck.&#10;&#10;The first player to get rid of all his cards by placing them correctly wins. If multiple players go out in the same round, then everyone else is eliminated from play and each of those players are dealt one more card for another round of play. If only one player has no cards after a bonus round, he wins; otherwise play continues until a single player goes out.&#10;&#10;Timeline: Events can be combined with any other title in the Timeline series.&#10;&#10;",
        "artist": "Xavier Collette,Nicolas Fructus"
    },
    {
        "name": "Genegrafter",
        "description": "Genegrafter is a superhero card and dice game that was designed to be easy to pick up and start playing within minutes but still offer enough complexity so that more advanced players won&rsquo;t get bored.&#10;&#10;The core game is comprised of a deck of 54 cards that include Characters, Abilities, and Events. The goal of the game is to have more Genetic Markers than your opponents when the last DNA Strand is revealed.&#10;&#10;To do so, you will have to make the best use of your Characters and Abilities as you draw them from the main deck (all players draw from the same deck). Game play is also randomly affected by Event cards that can completely change who is winning or losing. The core game includes hand manipulation, resource management (your Characters and Abilities), bluffing, and blind luck (dice and Event cards) which make each game interesting and unique.&#10;&#10;Genegrafter is currently available only on Kickstarter and will offer customization and additional expansions.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Mediterranean Empires",
        "description": "&quot;Mediterranean Empires&quot; is a strategy game for 2 to 8 players that depicts the troublesome hegemonic struggles that took place on the Mediterranean shores in Ancient times before the Roman Empire made it a Roman lake -Mare Nostrum. Each player takes the leading role of one Ancient Empire to rise to global domination or subjugation. For players 12 and up, it is a user-friendly boardgame of strategy and conquest. Interaction between players is the key of the game system.&#10;&#10;The game is played with a wide hand of cards that varies from turn to turn due to players&acute; exploits and events. Cards are the resources of each player (troops, leaders, fleets, diplomacy...) and are played in rounds for events and to send military expeditions to expand your Empire. The game has 3 turns and the end of each one is unpredictable. Each Empire has his own tailored 35-card deck to reflect its own unique characteristics and style of play.&#10;&#10;",
        "artist": "José Ramón Faura"
    },
    {
        "name": "Edo",
        "description": "In Edo, players represent daimyo in mid-second millennium Japan who are trying to serve their shogun by using their samurai to construct castles, markets and houses in Tokyo and surrounding areas.&#10;&#10;At the start of Edo &ndash; which won &quot;best evening-length game&quot; in the 2010 Hippodice Game Design competition under the name Altiplano &ndash; each player has five samurai tokens, seven houses, one market and three square action cards, each of which has four possible actions on it. One card, for example, allows a player to:&#10;&#10;&#10;    Collect rice (up to four bundles depending on the number of samurai applied to the action),&#10;    Collect $5 (per samurai),&#10;    Collect wood (up to four, with one samurai on the action and one in the forest for each wood you want), or&#10;    Build (up to two buildings, with two samurai on the card and one in the desired city, along with the required resources)&#10;&#10;&#10;Each turn, the players simultaneously choose which actions they want to take with their three cards and in which order, programming those actions on their player cards, similar to the planning phase in Dirk Henn's Wallenstein and Shogun. Players then take actions in turn order, moving samurai on the board as needed (paying $1 per space moved) in order to complete actions (to the forest for wood, the rice fields for rice, cities to build, and so on). Before a player can move samurai, however, he must use an action to place them on the game board; some actions allow free movement, and others allow a player to recruit additional samurai beyond the initial five.&#10;&#10;One other action allows you to recruit additional action cards from an array on the side of the game board, thereby giving you four (or more) cards from which to choose for the rest of the game.&#10;&#10;Building in cities costs resources and gives you points as well as money; as more players build in a city, the funds are split among all present, with those first in the city receiving a larger share. Players can also receive points or buy stone by dealing with a traveling merchant.&#10;&#10;Once at least one player has twelve points, the game finishes at the end of the round, with players scoring endgame bonuses for money in hand and other things. The player with the most points wins.&#10;&#10;Edo includes separate game boards for 2-3 players and for 4 players.&#10;&#10;",
        "artist": "Marko Fiedler,Claus Stephan"
    },
    {
        "name": "111",
        "description": "&ldquo;111&rdquo; is a simple war game for two based on the mechanics used in the &ldquo;303&rdquo; board game. One of the players is the commander of the Pursuit Brigade - Polish fighter group defending Warsaw on September 1st., 1939, the very first day of World War II, while the other commands the attacking German Luftwaffe. Polish player has access to four P.11 fighters, outdated and slow but highly manoeuvrable. German player uses two powerful Heinkel He-111 bombers and three fast and well-armed Messerschmitt BF-110 fighter. They conduct aerial duels by using special dice. &#10;The mission of the Third Reich&rsquo;s air force is to bomb Capital City. Polish Air Force mission is to shoot down the bombers using the advantage of clouds, hidden airfields and anti-aircraft artillery. &#10;The name of the game &ldquo;111&rdquo; evokes one of the escadrilles, which pilots, after Poland&rsquo;s defeat in 1939, formed the personnel of the famous 303 Fighter Squadron in 1940 during the Battle of Britain. This makes the &ldquo;111&rdquo; the prequel of &ldquo;303&rdquo;, showing the crucial differences between aerial war over Poland in 1939 and Britain in 1940.&#10;&#10;",
        "artist": "Tomasz Ginter"
    },
    {
        "name": "Tenzi",
        "description": "Every player gets 10 dice.&#10;&#10;The object of the game is to roll the dice as fast as possible, the player who gets all dice on the same number and yells &quot;Tenzi!&quot; is the winner.&#10;&#10;Several variants are suggested in the rules to add variety, interactivity and challenge:&#10;&#10;     Tenzi Tower: In addition to getting the dice on the same number, they all have to be stacked on top of one another in a single column.&#10;     Splitzi: Roll one number on 5 dice, and another number on the other 5.&#10;     Team Tenzi: In teams of 2, try to roll the same number on all 20 dice.&#10;     Target Tenzi: All players call the number they will go for before rolling the first time.&#10;     Stealzi: When another player rolls the number that you need on their dice, you can steal those dice and give them yours in exchange.&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Richard Scarry's Busytown: Busy, Busy Airport Game",
        "description": "From the publisher:&#10;PILOT YOUR PLANE TO DISTANT LOCATIONS! In Richard Scarry&rsquo;s Busy, Busy Airport, you get to be a pilot and fl y your own plane! Load your plane with your favourite Busytown characters and wait for the right moment to take off. Visit distant locations and collect exotic souvenirs &ndash; the more you collect, the bigger chance you&rsquo;ll have at winning the game! Richard Scarry&rsquo;s Busy, Busy Airport encourages children to use picture matching, imagination and strategic thinking while playing.&#10;&#10;Roll the dice to fill up your cardboard plane with passengers. Then roll to drop them off at one of four destinations spread around the room. Grab a souvenir card and return back to the airport.&#10;&#10;An 'I can do that!' game.&#10;&#10;From the rule sheet:&#10;Take passengers from the Busytown airport to the destinations they need to go and collect souvenirs. The player with the most souvenirs at the end of the game is the winner.&#10;&#10;",
        "artist": "Richard Scarry"
    },
    {
        "name": "The Hunters: German U-Boats at War, 1939-43",
        "description": "&quot;Hostilities with England effective immediately.&quot;&#10;the time is: 1256 hours, 3 September 1939&#10;&#10;The Hunters is a solitaire tactical level game placing you in command of a German U-boat during WWII. Your mission is to destroy as much Allied Shipping and as many Capital ships as possible while advancing your crew quality and increasing your commander rank culminating in special decoration &#226;&#128;&#146; all while remembering you have to make it home.&#10;&#10;The Hunters is purposely designed to deliver a brisk yet intensive gaming experience that forces many decisions upon you as you will take command among the major German U-boat models in service during WWII, and try to complete an entire tour.&#10;&#10;Those familiar with the classic Avalon Hill game title, B-17: Queen of the Skies, will come to enjoy the same type of gaming experience of the German U-boat War. All major U-boat models are accounted for with every level of detail including period of service, armaments, crew make-up, damage capacity, and more.&#10;&#10;Winner: 1 Player Guild Gaming Awards - Best Solitaire Game of 2013&#10;&#10;Third Printing now available for preorder from Consim Press&#10;&#10;",
        "artist": "John Kranz,Rodger B. MacGowan,Ian Wedge"
    },
    {
        "name": "Zombicide",
        "description": "Zombicide is a collaborative game in which players take the role of a survivor &ndash; each with unique abilities &ndash; and harness both their skills and the power of teamwork against the hordes of unthinking undead! Zombies are predictable, stupid but deadly, controlled by simple rules and a deck of cards. Unfortunately for you, there are a LOT more zombies than you have bullets.&#10;&#10;Find weapons, kill zombies. The more zombies you kill, the more skilled you get; the more skilled you get, the more zombies appear. The only way out is zombicide!&#10;&#10;Play ten scenarios on different maps made from the included modular map tiles, download new scenarios from the designer's website, or create your own!&#10;&#10;&#10;     This is just a great game for zombie lovers!&#10;&#10;&#10;Integrates with:&#10;&#10;    Zombicide Season 2: Prison Outbreak&#10;    Zombicide Season 3: Rue Morgue&#10;&#10;&#10;&#10;&#10;",
        "artist": "Nicolas Fructus,Édouard Guiton,Mathieu Harlaut,Eric Nouhaut"
    },
    {
        "name": "Nightfall: The Coldest War",
        "description": "Game description from the publisher:&#10;&#10;Eastern Europe and the former Russian states are known as the birthplace of vampires, werewolves, and many fears that have been realized in Nightfall. Face those fears and bring tactics used in generations past to fight the darkness.&#10;&#10;Nightfall: The Coldest War is a stand-alone expansion to the competitive deck building game Nightfall. The Coldest War brings you a complete, all-new set of cards with special powers and features a full set of 6 exciting new starting minions! The Coldest War also introduces Moon Phase cards that change the game globally as well as new, fully illustrated Wound cards.&#10;&#10;Each card has a main color and two linking colors. If you can match the main color of a card to one of the linking colors of the previous card, you can chain those cards together. Once a chain is started, players all get an opportunity to link additional cards onto the chain during that turn.&#10;&#10;Cards in the chain resolve in reverse order: first in, last out. Instant effects fire off as cards come off the chain, doing damage to your opponents or bringing characters into play to defend you and attack your opponents.&#10;&#10;The object of Nightfall is to put wounds into your opponents&rsquo; decks and end the game with the least amount of wounds in your deck. But beware: the more wounds a person has, the more enraged they become and the faster their deck works, meaning more cards and bigger chains will come your way!&#10;&#10;",
        "artist": "Conceptopolis,James Hall,Andrew Hepworth,Jake Murray,Matthew Starbuck"
    },
    {
        "name": "Rock'n Roll Manager",
        "description": "Have you ever thought of creating your own rock band? Get into show business, surround yourself by guitars, drums, basses and vocals? Have you ever dreamt of performing on huge festivals and traveling the 5 continents making concerts?&#10;&#10;On Rock'n Roll Manager, all those challenges are brought to life in a vibrant, fun and strategic fashion. But don't expect the routine to be easy... Your agents will have to work hard to hire new musicians, arrange rehearsals, record and sell records and face many challenges along the game.&#10;&#10;Achieving rock star status won't be easy, but it's impossible to play and not have fun!&#10;&#10;Rock'n Roll Manager is an eurogame of medium complexity, that pleases beginners and experienced gamers. His main mechanic is worker placement. The game fits 2 to 5 players, and lasts around 90 minutes.&#10;&#10;Tune your electric guitars, get your drumsticks and raise the volume! Let's rock!&#10;&#10;",
        "artist": "Henry Chen,Roe Mesquita"
    },
    {
        "name": "Phantom",
        "description": "Jamestown, Virginia, at the end of the year 1907 &ndash; a tercentenary house welcomes new owners, a peaceful family. But the place is already occupied by lost souls which have been in confrontation for ages. The Standish cannot escape from this haunted house and will be the collateral damage of the conflict.&#10;&#10;In Phantom, the four areas of the house &ndash; Garden, Basement, Ground Floor and First Floor &ndash; are placed in a line, with the areas divided into two sides. Each player controls Ghosts in half of the house, and he must make Spectres, Souls and other Spirits appear in front of the different areas of the house in order to frighten the Occupants before the other player. Each turn, a player can play a card &ndash; Ghost or Place &ndash; in order to increase the Scare level of his corresponding apparition; each Place card must be played in front of its corresponding area(s); for example, the Attic must be played in the First Floor,while  the Stairs can be played either in the First Floor or in the Ground Floor. (Note: In Europe, the first floor is customarily the initial floor above ground level, while in the U.S. the floor at ground level is the first floor.)&#10;&#10;The Ghost cards can be played in front of any areas. Each of them creates a special effect:&#10;&#10;&#10;    The Squatter takes a Place from the opponent's apparition.&#10;    The Charmer makes an Occupant come in the area.&#10;    The Howler puts Occupants off the area.&#10;    The Knocker discards a Ghost from the opponent's apparition.&#10;    The Queen takes a Ghost of his family from the opponent's apparitions.&#10;    The Invoker gets a Ghost back from the discard pile.&#10;&#10;&#10;Unfortunately for you, the adults of the family can kill off some vulnerable Ghosts, and a family of Ghosts is vulnerable to each of the adults. Some Places protect the Ghosts from the adults.&#10;&#10;At the end of a player's turn, the Scare level of the apparitions in the different areas are compared to the Fear threshold of any Occupants located there. When a player's Scare level is higher or equal to the Fear threshold of an Occupant who is alone in the corresponding area, this player takes this Occupant and wins the corresponding Victory points. After his turn, the player draws Ghost/Place cards until he has five cards in hand.&#10;&#10;Each adult is worth 3 victory points (VPs), each child 2 VPs, the baby 4 VPs, and the Priest adds 1 VP to the last Occupant of the house. As soon as a player has collected 11 VPs, the game ends, with him as the winner.&#10;&#10;",
        "artist": "Morlock"
    },
    {
        "name": "Tajemnicze Domostwo",
        "description": "Tajemnicze Domostwo is a purely co-operative game for 2-7 players. One player takes the role of a helpful ghost who lives in a mysterious ancient manor. Other players are a group of psychics invited by the manor owner to solve the mystery of the place and bring peace to its residents, as any person who stays in the castle sees strange dreams.&#10;&#10;The ancient legend says the ghost is the soul of the manor's previous resident, who was unjustly executed for a crime he didn't commit, more than one hundred years ago. Now he tries to use the mysterious signs to tell people the truth about what really happened then, so that justice would be established and he might rest in peace for ever. The specialists in the supernatural were invited to try to understand what the ghost wants to tell and in case of success be honored by one more victory and receive a generous reward. They have seven days and seven nights to reach their goal. If they succeed in time, everyone wins the game (including the ghost).&#10;&#10;",
        "artist": "Mateusz Bielski,Igor Burlakov,Mariusz Gandzel,Karolina Węcka"
    },
    {
        "name": "Copycat",
        "description": "Fremde Federn, which means roughly &quot;to adorn oneself with borrowed plumes,&quot; or something like &quot;strange feathers.&quot;&#10;&#10;Fremde Federn is about borrowing elements from well-known games (Eurogames) and constructing a new game out of them. For now, it is a deck-building, worker-placement, drafting race game. The print-and-play files &ndash; German only for now &ndash; are available on the 2F-Spiele website.&#10;&#10;You are a politician who tries to gather enough money and influence to become the next president. Of course, you depend on the work of others to get the needed influence. You start with a set of 10 cards (7 of them are &quot;fatherly friends,&quot; which give you 1 money each and 3 of them yield 1 influence each (VPs)). Each round you draw 5 cards from your deck and use one card for the turn order to place your workers. The workers go to the different offices in the government building to buy new cards for you, get influence or to carry out other actions. Each round there is one more space in which you can choose to place your workers. On the game board is a row of cards which you can choose to buy and each round the empty places in this row are filled from a deck of cards divided into 4 different &quot;Ages.&quot; The last cards of the deck are Doctoral degrees which you can buy with your money; these give you 1 VP for each unit of money spent. The game ends when all of the Doctoral degrees are bought or when one player has 95 VPs or more.&#10;&#10;",
        "artist": "Harald Lieske"
    },
    {
        "name": "Malta Besieged: 1940-1942",
        "description": "That Scorpion of the Sea: Malta Besieged is a solitaire game covering the pivotal World War II years of the mid-1940 through 1942 period in the often overlooked Battle for the Mediterranean. You are placed in the role of the Commonwealth Commander in the theatre, and must utilize every resource at your disposal to fend off unrelenting Axis attacks in order to ensure the survival of the island of Malta.&#10;&#10;Built upon the same States of Siege engine as the designer's previous 2010 Charles S. Roberts award-winning release (We Must Tell the Emperor), Malta Besieged features both familiar and innovative game play. Supply was the key element in the Mediterranean Campaign, and so it is here as well. Players will have to safely shepherd vulnerable convoys - and their valuable cargoes - in order to effectively wage war. With the ability to trade Supply for extra Actions at the most crucial moments, this places an additional emphasis on that precious resource and also creates extremely tense convoy battles which will resolve as the game progresses.&#10;&#10;ULTRA is a crucial asset in the game, but beware of Axis counterintelligence! Spitfires can rule the skies, Gibraltar can block U-Boat advances, Operation Herkules is a constant threat, and Admiral Cunningham himself can intervene on occasion.&#10;&#10;North Africa is not treated as a mere sideshow; indeed, the struggle with Rommel, the &quot;Desert Fox&quot;, holds the ultimate key to victory... if Malta can hold out against the constant pressure. If a fortified Tobruk manages to stubbornly delay the vaunted Afrika Korps long enough, then General Montgomery and his battle-tested 8th Army can possibly make a final dash from El Alamein to capture Tripoli and secure a glorious triumph.&#10;&#10;Raiding Axis supply lines to weaken Rommel's Situation, scrambling Hurricanes to provide Air Support for inbound shipping, attacking the Italians early before the dreaded Luftwaffe arrives, requesting British Fleet escort for your individually named convoys, and maintaining the morale of a battered Malta are just some of the important decisions to be made throughout the game. Numerous theatre-wide events such as The Fall of France, O'Connor's desert offensive, the daring raid on the Italian Fleet at Taranto, the Air Assault on Crete, the evacuation from Greece, the sinking of the aircraft carrier Ark Royal, and the Torch landings are all abstracted via card play, and can have a significant impact on the overall conduct of the war.&#10;&#10;With That Scorpion of the Sea: Malta Besieged, it's all here - the only question is will you have the wisdom, leadership, fortitude, and luck to prevail? Play this game and find out!&#10;&#10;Game Data:&#10;&#10;Complexity: 4 on a 9 scale&#10;Solitaire Suitability: 9 on a 9 scale&#10;Game Length: 75 minutes&#10;Scale: Each unit is one Axis Front, each turn is a variable number of days or weeks.&#10;&#10;NOTE: The game is currently out-of-print.&#10;&#10;",
        "artist": "Tim Allen"
    },
    {
        "name": "Ace of Spies",
        "description": "A card game of stealth and sneakiness! Players act as spymasters, collecting sets of cards in order to complete missions. Only the greatest player will be declared The Ace Of Spies! By taking two cards at the start of each turn, you'll build up a selection of Agents, Tools, Intelligence and Locations that will allow you to hopefully finish more missions than everyone else. More missions mean more points - as long as they're complete! If they're left incomplete by the end of the game, they score negative points and pretty much ensure you're not going to win...&#10;&#10;Four separate decks are needed to play the game. The Mission Deck cards state what combinations are needed in order to complete a mission. The more specific the requirements the more points the completed mission is worth - some can be very difficult to finish but will prove very lucrative, but there's always the risk they'll count against you.&#10;&#10;The other decks represent three different cities - London, Paris and Berlin - and contain the Agents, Tools, Intelligence and Locations you'll need. Intervention cards can be used as instants and will allow you to turn the game in your favour (as long as you play them at the correct time. Should that all important card you require be lost in the discard piles, you may be able to retrieve it, but that'll come at a high cost.&#10;&#10;Between two and five spymasters can attempt to become the Ace of Spies! May the most devious and sneaky win!&#10;&#10;",
        "artist": "Aaron Norell,Shane Tyree"
    },
    {
        "name": "Thebes: The Tomb Raiders",
        "description": "Game description from the publisher:&#10;&#10;Europe at the start of the 20th century: Foreign cultures and their artifacts have a strong appeal for archeologists, and its in that role that players try to increase their knowledge in order to equip and conduct expeditions to Egypt, Mesopotamia, Crete and Greece. Glory and esteem are waiting!&#10;&#10;Thebes: The Tomb Raiders is a card game version of the Thebes board game from designer Peter Prinz and Queen Games.  The game dispenses with the map of Thebes, but retains many of the main aspects of the game.  The main turn-order play of the game is based on the time-track; players must spend time to take actions, with varying amounts of time spent dependent on the nature and benefits of the action.  The player who is furthest back &quot;in time&quot; is the active player.  Players use actions to gain knowledge about five civilizations, and then use this knowledge in different actions to &quot;dig&quot; to pull cards from a civilization's deck that contains treasures and dirt.  The more knowledge a player has about a civilization, the more efficient the player is at searching for treasures.&#10;&#10;The game plays over a certain span of time, and when all players can no longer take any actions because they are out of time, the game is at an end, and the player with the highest score from their accumulated treasures wins.&#10;&#10;",
        "artist": "Michael Menzel,Christof Tisch"
    },
    {
        "name": "But Wait, There's More!",
        "description": "Have you ever wanted a glass, that stops messy accidents before they happen,  or pants, that provide relief at the touch of a button? In But Wait, There's More!, players pitch wacky products to each other for fun and profit.&#10;&#10;At the start of the game, each player receives three &quot;Feature&quot; cards. Each round starts with one Product card being revealed from the deck, e.g., guitar. Each player in turn has thirty seconds to play one of their Feature cards &ndash; say, &quot;Helps you fall asleep and stay asleep&quot; &ndash; and pitch their own version of a guitar. At some point during these thirty seconds, this player must say, &quot;But wait, there's more!&quot;, then reveal the top Feature card from the deck &ndash; say, &quot;great for parties&quot; &ndash; and incorporate that Feature into their product. Once all players have pitched their unique version of a guitar, everyone votes simultaneously for  which pitches they liked the best. The top vote getter after three rounds wins the game!&#10;&#10;With six or more people, play in teams, with the first player on a team starting the pitch with one of his Feature cards and the second player finishing the pitch with a Feature card of her own, but neither player knows what the other Feature is until they are revealed!&#10;&#10;",
        "artist": "Zac Pensol"
    },
    {
        "name": "The New Science",
        "description": "Players control one of the great scientists during the 17th century Scientific Revolution in Europe. Use your limited time and energy to make discoveries, test hypotheses, publish papers, correspond with other famous scientists, hire assistants into your laboratory and network with other people who can help your progress. Discoveries follow historical tech trees in the key sciences of the age: Astronomy, Mathematics, Physics, Biology and Chemistry. The scientist who accumulates the most prestige will be appointed the first President of the Royal Society.&#10;&#10;",
        "artist": "Heiko Günther"
    },
    {
        "name": "Villages",
        "description": "(Description from thegamecrafter.com)&#10;&#10;A new land has been discovered. As a mighty king, you have a grand opportunity to expand your empire by building new villages here. Unfortunately, many of your fellow rulers also hope to stake their claim in this new world. Whose villages will stand, and whose will fall?&#10;&#10;Each card has a gold value, and your goal is to earn 100 gold pieces across multiple rounds by building villages. Do this by collecting three unit cards of the same color and laying them down. If an enemy puts down a card you'd like to have, it's time for battle! Send out your village's finest hero or hire one in secret by playing it face-down from your hand, and your opponent will do the same. Play the stronger card, and you'll be able to take a prisoner from your enemy's village and make it part of your own.&#10;&#10;However, it's not enough to simply send your most powerful units to attack neighboring kingdoms. Each unit has its own winning strategies: knights excel at defense, the wizard's power falters only when facing enemies of the same color, the dragon's strength increases with each enemy he defeats, and heroes become much stronger when you're in last place. These are only a few of the 15 different unit types you'll command. With the right combination of luck and skill, you'll always come out on top.&#10;&#10;War is one way to expand your empire, but it is certainly not the only way. Perhaps you'd like to avoid conflict altogether. Take on the role of a benevolent king who gives freely to other players, and you'll win bonus gold for being the first to empty their hand and end the round. However you choose to play, there are strategic choices to be made. How will you rule?&#10;&#10;",
        "artist": "Jaron Frost"
    },
    {
        "name": "Rune Wars",
        "description": "The rune wars is a board game for 2 players in which players are invited to make combinations of rune cards to perform attacks on their opponents. Each player has 3 actions on each turn and he can use either their own cards or his opponen&tau;'s cards.&#10;&#10;But be careful, the wounded opponent will have the opportunity to activate a Magic powerful Rune and the battle will be changed forever...&#10;&#10;Winner will be the player who eliminate his opponent.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Ragami",
        "description": "In all cultures there are mythical characters that protect people and help them to solve their problems. Those characters often take the human form with wings and we call them Guardian Angels or RAGAMI.&#10;&#10;In this game, each player will play the role of a RAGAMI, winged human form, that travels around inside a city - the board. In this city, there are always people with problems, with their own internal conflicts, that need your help. There are also holy men and demons that can help or oppose to solving these conflicts.&#10;&#10;The objective of the game is to achieve the highest possible number of Virtue Points (VP). There are several ways to get VP, and consequently there are several strategies one can follow to win the game: solve conflicts, cause demons to disappear, help other RAGAMI, to be the RAGAMI who has solved the highest number of conflicts, etc.&#10;&#10;But helping people to solve their conflicts is what worths more VPs, and for this you need to have Points of Strength. As many as the strength of the conflict you're trying to solve, which can go from 1 to 6. There are several ways to get Points of Strength: white cubes, cards, holy men, the help of another RAGAMI, or a die.&#10;&#10;There are Action Dies (which allow to execute a certain number of actions, and it's placement will be made by the last player in the turn order) and there are Action Cards (that may be acquired during the game). In his play, Player can do one of the following actions: move his RAGAMI, move the holy men and the demons, pick cards or solve conflicts.&#10;&#10;Game ends in the turn when the places of conflicts ends or when a player hit's the 30 points score mark.&#10;&#10;Game to 2 to 4 players, 10 years up, 60 - 90 min.&#10;&#10;",
        "artist": "Gil d'Orey,Pedro Soto"
    },
    {
        "name": "For The Win",
        "description": "&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Overview&#10;&#10;For The Win is an abstract strategy game in which each player gets ten tiles, two of each character representing Monkeys, Zombies, Pirates, Aliens, and Ninjas.  The objective is to connect five (or more) of one's tiles, including at least one of each type, together (sides and corners count).  Additionally, all five (or more) tiles must be face-up, or unactivated.  The game ends immediately when a player achieves this goal.  Each character type has a specific ability to help you toward the objective.&#10;  &#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Gameplay&#10;&#10;Players take turns using either 1 or 2 actions within 5 action rounds.  Once one player's actions are consumed for a round, the other player(s) get to use any of their remaining 5 actions at once.  Judicious action management is key; if one budgets one's actions wisely, one can play several actions in a row for game-winning combinations.  The available actions are as follows:&#10;&#10;&#10;      Add a tile to the Grid&#10;      Move one of one's tiles&#10;      Refresh or flip a tile face up&#10;      Shove a tile or column/row of tiles&#10;      Activate an ability (the chosen tile turns face down; see below)&#10;&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Characters &amp; abilities&#10;&#10;&#10;    Alien &mdash; The Alien uses her tractor beam to pull any tile in the Grid to a space that is adjacent to her. &#10;    Monkey &mdash; The mischievous Monkey uses a banana peel to flip over all of the tiles it is touching. &#10;    Ninja &mdash; The sneaky Ninja can move from his current spot to any other unoccupied space in the Grid.&#10;    Pirate &mdash; The Pirate uses his trusty cannon to blast an adjacent tile to any unoccupied space in the Grid.&#10;    Zombie &mdash; The Zombie can infect any adjacent tile. The infected tile is removed from the Grid and replaced with a Zombie tile that has not yet been added to the Grid. If all of the Zombie tiles have already been added to the Grid, the Zombie may choose one adjacent tile and deactivate it (that is, flip it face down).&#10;&#10;&#10;",
        "artist": "Eric J. Carter"
    },
    {
        "name": "Castellan",
        "description": "In Castellan, two players work together to build a castle. Finely-detailed wall and tower pieces link together to form courtyards, and the player who finishes a courtyard claims it with a Keep, scoring points for that courtyard equal to the number of tower pieces surrounding it.&#10;&#10;In more detail, each player starts the game with two decks of cards: a wall deck and a tower deck. Each card allows a player to play the components shown on it, with the wall deck cards always depicting at least one wall (and some combination of walls/towers) and the tower deck cards always depicting at least one tower (and again some combination of walls/towers). On a turn, a player can play as many cards as she wants, but she draws only one card at the end of her turn. The goal is to create courtyards &ndash; and subdivide existing courtyards &ndash; while keeping your opponent from doing the same. Players have the same cards in their decks, so the challenge is all about what to use when. The game ends when all the castle pieces are used up, and the player with the most points wins.&#10;&#10;Two different pairs of Keep colors are available in the two versions of Castellan, so with two copies of the game &ndash; and the right combination of bits &ndash; up to four players can play.&#10;&#10;",
        "artist": "Richard Kerr,Ben Williams"
    },
    {
        "name": "Starship Merchants",
        "description": "4049: The galaxy hums with prosperity and peace two millennia after the dawn of space travel. But as mankind and its neighbors colonized the stars, the burgeoning need for resources was apparent. One by one, new geological discoveries revolutionized terraform, construction and energy technology. The sub-temperature properties of the mineral Ice-9 allowed life-giving water to flow on uninhabitable planets. Crystallized Cobalt was accidentally found to be incredibly strong, resistant to extreme pressure. And a single chunk of Deuterium could power a sprawling metropolis for a month!&#10;&#10;As a plucky entrepreneur you must explore the edges of space searching for precious minerals. Will you buy the fastest ship in the sector or hire the best pilot in the galaxy? Purchase the latest state-of-the-art gadgets, invest in planetary refineries, or pay off your rising debt? The cargo you haul could be worth fortune, so grab your helmet and suit up! The cosmos and a mountain of credits call!&#10;&#10;In Starship Merchants, each player runs a fledgling corporation looking to stake a claim in the lucrative mining business. Player will buy starships, explore the galaxy and deliver cargo for interstellar credits, all the while expanding their operations.&#10;&#10;Starting at the shipyard and ending at the dock, players will move clockwise around the four quadrants on the board to complete an entire Business Cycle. During each turn, a player either performs one action at the current quadrant or advances to the next, performing an action there. As players take actions or advance they spread apart across all four quadrants while completing individual Business Cycles.&#10;&#10;The Shipyard is where you can buy a speedy scout or a heavy load bearing tug. The Market is where Gear, Pilots, Refineries, and claims can be purchased. In the belt, starships are run by spending energy points to explore, pickup mines, or fly to another destination. The final quadrant is the Dock where delivered cargo is traded for credits.&#10;&#10;A player that ends his turn at the Dock with 100+ credits can declare the Final Run, ending the game. But after completing the Final Run, the player with the most credits wins!&#10;&#10;",
        "artist": "David J. Coffey,Zac Pensol,Chris Quilliams"
    },
    {
        "name": "The Metagame",
        "description": "Everybody&rsquo;s got an opinion. The Metagame gives you a chance to exercise your smartest and most ridiculous opinions on just about everything: music and movies, fine art and fashion, junk food and videogames. It&rsquo;s a card game where you do what you already love to do with your friends: talk about culture. There&rsquo;s not just one way to play - The Metagame comes with six unique games. Each one makes use of both types of cards in The Metagame deck:&#10;&#10;&#10;     CULTURE CARDS feature a single cultural object or icon, from the Mona Lisa to Ms. Pac-Man.&#10;     OPINION CARDS say things like &ldquo;Which feels like first love?&rdquo; or &ldquo;Best reminder of our mortality.&rdquo;&#10;&#10;&#10;Some of the games get you debating, and some are more strategic. Some are best for a handful of players and others are designed for dozens of them. &#10;The six games are:&#10;&#10;&#10;     Matchmakers: match your culture cards to the right opinion cards&#10;     History 101: put everything in the right chronological order&#10;     Debate Club: argue to the critics for your hilarious opinion&#10;     Head to Head: a fast-paced race to get your cards out first&#10;     Massively Multiplayer Metagame: for big parties and events&#10;     Metaquilt: a tricky combination of strategy and discussion&#10;&#10;&#10;You don&rsquo;t usually find games where players have debates like: Which is more fundamentally misunderstood - Fox News or the rainbow flag? The Metagame covers every possible kind of design, media, and art and helps you see culture in new ways. We&rsquo;ve played The Metagame at hardcore tabletop game conferences and in dimly lit hipster bars. The Metagame works in just about any social setting - just pick the game variation that suits your group and situation the best.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Kittens in a Blender",
        "description": "From the Designers:&#10;You are twisted.  I can&rsquo;t believe you actually want to put these adorable kittens in a blender! I guess that&rsquo;s none of my business. Maybe you&rsquo;re more of a dog person. Sure, kittens are curious by nature, but when they get in a kitchen full of dangerous appliances, it is up to you to save them.&#10;&#10;This fast-paced card game has players working to save all of their own kittens before the unthinkable happens. But sometimes the only way to save your precious litter of kittens is to let those curious little cats learn the lesson of why you should never play in a Blender!&#10;&#10;According to the box: A portion of the proceeds will be donated to a no kill cat shelter.&#10;&#10;Objective:&#10;Save your kittens and send your opponents' kittens to The Blender.&#10;&#10;Setup &amp; Play:&#10;Put the game box top on the table, open-side up and place the oversized Blender card inside, face-up: that's The Blender. Place the oversized Box card face up in the base of the box: that's The Box. Leave a little space between The Blender and The Box: that's The Counter.  Assign each player a Kitten color (red, green, blue or yellow), shuffle the deck, deal each player 6 cards and it's time to start saving adventurous kittens.&#10;&#10;On each turn, players play two cards and then draw back up to 6. Kitten cards may be played into The Blender, The Counter or The Box.  All other cards are played face up in front of the player so that all players can see which cards have been played.&#10;&#10;Players can play Kitties on the Move to move kittens to or from The Blender, The Counter or The Box; the number on the card specifies the number of kittens that can each be moved 1 space. Playing a Blend card will destroy the kittens currently in The Blender, save the kittens in The Box, and move the kittens on The Counter into The Blender unless countered by another player's Blend &quot;Pulse&quot; card.&#10;&#10;Players can move kittens around with other cards as well. Kittens in the Blender moves all of the kittens on The Counter or in The Box to The Blender. With These Cats in the Blender a player can move all cats of a chosen color from The Counter and The Box to The Blender. Kittens in the Box moves all kittens in The Blender or on The Counter to The Box, while Cats on the Counter moves all the kittens in The Blender or The Box to The Counter.&#10;&#10;Total chaos reigns when the Dog's in the Kitchen as each player gives her hand to the player in the direction indicated on the card.&#10;&#10;The game ends when all 16 of the Blend cards have been played. Saved kittens are worth 2 points each, blended kitties cost 1 point each. Highest score wins.&#10;&#10;Contents: 1 oversized Blender card, 1 oversized Box card, 110 playing cards (64 Kittens: 16 in each of 4 colors - red, green, blue and yellow; 18 Kitties on the Move: 6 of each number; 16 Blends: 8 Regular Blend &amp; 8 Blend Black; 4 Dogs in the Kitchen: 2 left &amp; 2 right; 2 Kittens in the Blender; 2 Your Cats in the Blender; 2 Cats on the Counter; 2 Kittens in the Box), rules.&#10;&#10;",
        "artist": "Anne-Julie Painchaud"
    },
    {
        "name": "Rory's Story Cubes: Voyages",
        "description": "Roll the cubes, begin with &quot;Far, far away...&quot;, start with the first symbol to grab your attention, and tell a story that links together all nine face-up images. There is no wrong answer, as the goal is to let the images spark your imagination.&#10;&#10;Rory's Story Cubes: Voyages &ndash; a pocket-sized set of nine cubes depicting 54 icons to inspire epic adventure &ndash; is the second expansion set for Rory's Story Cubes, while also being a standalone item. Made to the same high quality as the original set, the cubes are inked in dark green to allow for easy sorting if you choose to use more than one set during play.&#10;&#10;As with Rory's Story Cubes, you can play Voyages as a game for one or more players, as a party game for three or more, or as an improv game in which each player contributes part of the story, picking up where the last one left off. Win award points for speedy delivery, inventiveness, imagination, drama and humor.&#10;&#10;Integrates with&#10;&#10;&#10;    Rory's Story Cubes&#10;    Rory's Story Cubes: Actions&#10;&#10;&#10;",
        "artist": "Rory O'Connor"
    },
    {
        "name": "Penny Arcade: The Game – Rumble in R'lyeh",
        "description": "Game description from the publisher:&#10;&#10;Just when you thought it was safe to pick up the controller...just when it seemed the time for cardboard tubes was at an end...the dread elder god Cthulhu rises from his slumber in the sunken city of R'lyeh, and he's not playing games!&#10;&#10;Penny Arcade: The Game - Rumble in R'lyeh is both a complete game and an expansion to Penny Arcade: The Game - Gamers vs. Evil. Players can mix the two sets together for the ultimate crazy ride through the sublimely bizarre world of the Penny Arcade web comic. Explore Gabe's Gross Mouth, harness the dubious power of Bono Trask: Timesqueezer, and fall under the curse of TouchWeiners' dark double: the Were-Swan.&#10;&#10;So what's new under the sea? Gold cards! These powerful cards require both Tokens and Power to acquire and count as both Green and Red cards, unlocking tons of new synergy and customization options with the previous set. New Green and Red cards add even more longevity to the game.&#10;&#10;Integrates with:&#10;&#10;    Penny Arcade: The Game &#226;&#128;&#147; Gamers vs. Evil&#10;&#10;&#10;&#10;&#10;",
        "artist": "Mike Krahulik"
    },
    {
        "name": "War of the Ring (Second Edition)",
        "description": "In War of the Ring, one player takes control of the Free Peoples (FP), the other player controls Shadow Armies (SA). Initially, the Free People Nations are reluctant to take arms against Sauron, so they must be attacked by Sauron or persuaded by Gandalf or other Companions, before they start to fight properly: this is represented by the Political Track, which shows if a Nation is ready to fight in the War of the Ring or not.&#10;&#10;The game can be won by a military victory, if Sauron conquers a certain number of Free People cities and strongholds or vice versa. But the true hope of the Free Peoples lies with the quest of the Ringbearer: while the armies clash across Middle Earth, the Fellowship of the Ring is trying to get secretly to Mount Doom to destroy the One Ring. Sauron is not aware of the real intention of his enemies but is looking across Middle Earth for the precious Ring, so that the Fellowship is going to face numerous dangers, represented by the rules of The Hunt for the Ring. But the Companions can spur the Free Peoples to the fight against Sauron, so the Free People player must balance the need to protect the Ringbearer from harm, against the attempt to raise a proper defense against the armies of the Shadow, so that they do not overrun Middle Earth before the Ringbearer completes his quest.&#10;&#10;Each game turn revolves around the roll of Action Dice: each die corresponds to an action that a player can do during a turn. Depending on the face rolled on each die, different actions are possible (moving armies, characters, recruiting troops, advancing a Political Track).&#10;&#10;Action dice can also be used to draw or play Event Cards. Event Cards are played to represent specific events from the story (or events which could possibly have happened) which cannot be portrayed through normal game-play. Each Event Card can also create an unexpected turn in the game, allowing special actions or altering the course of a battle.&#10;&#10;",
        "artist": "Kristofer Bengtsson,John Howe,Fabio Maiorana"
    },
    {
        "name": "The Big Bang Theory: Fact or Fiction Game",
        "description": "Get Ready to get your geek on as you test your knowledge from THE BIG BANG THEORY! Players answer trivia question, compete in rounds of &quot;Rock, Paper, Scissors, Lizard, Spock&quot; and draw their way to collecting a complete set of character cards!&#10;&#10;Included are: Fact Cards, Fiction cards, Character Cards, Game board, 8 Playing Pieces, Die, Pad of Paper, and Comprehensive instruction manual.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Eaten By Zombies!: In Cahoots",
        "description": "The sun was shining, the sky was blue, and the only sounds whispering through the streets were the gentle moans of the undead. Can you and a friend survive the horde together, or will you use that beating heart across the table to save your own skin?&#10;&#10;Eaten By Zombies!: In Cahoots is both a two-player standalone game and an expansion for Max Holliday's Eaten By Zombies! that allows for play with up to six players. In Cahoots includes five zombies with a new &quot;reveal&quot; ability, eleven new Swag cards, and two new starting decks.&#10;&#10;Integrates with:&#10;&#10;&#10;    Eaten by Zombies!&#10;&#10;&#10;",
        "artist": "Max Holliday,John Huerta"
    },
    {
        "name": "18NY",
        "description": "18NY is a railroad game set in New York State and surrounding areas. The game is a stock, train, and track building game that uses the 18xx system. Two to six players compete to have the largest net worth in cash and stock at game end.&#10;&#10;Game play is divided into Stock Rounds and Operating Rounds. During Stock Rounds, players and share companies may buy or sell stock in minor and share companies, open new companies, or take over existing ones. During Operating Rounds, each minor and share company conducts business (laying track, placing stations, and buying trains). At first, stock and operating rounds alternate, but as the game progresses, the number of intervening operating rounds increases.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Lokus",
        "description": "This is a card game about going to the loo. Players try to send one of their eleven people (cards) to an outhouse, but there are only two of these available. Whoever doesn't get a seat has to go to the forest - resulting in a negative score.&#10;&#10;",
        "artist": "Christian Opperer"
    },
    {
        "name": "Apples to Apples Dice Game",
        "description": "The trend of popular games being remade as a dice game comes to Apples to Apples.  Instead of the cards, the person acting as the judge rolls a green 20 sided die with letters on it, and makes up an adjective that starts with the rolled letter.&#10;&#10;Then, red six sided dice with different assortments of letters are rolled, one for each player (except the judge).  Those players then grab a die and make up their noun based on that die roll.&#10;&#10;The rest of the rules play as normal Apples to Apples.  The judge picks his or her favorite of the choices, and the position of judge rotates to the next player.  Play until one player has his selected 5 times, denoted by green chips..&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "UNO Dice Game",
        "description": "BASIC DESCRIPTION:&#10;The UNO Dice Game attempts to translate the original UNO card game into a two player dice game.  It was released during the 2011 Christmas season and displayed along with other Mattel dice games in the same type of soda can tin packaging.&#10;&#10;COMPONENTS:&#10;The game includes 11 dice.  Each die is unique and has some combination of faces in the four UNO colors (yellow, green, blue and red).  The die faces include: 1, 2, 3, 4, 5, draw one, draw two, and wild (in black).  Note that there are no die faces that represent the Skip or Reverse cards from the original UNO card game (presumably because this is just a 2 player game).&#10;&#10;GAMEPLAY:&#10;The game mechanic is simple and mimics the original UNO card game.  To begin, 5 dice are randomly given to each of the two players.  These dice take the place of a players hand of cards in the original UNO card game.  The 11th die is left in the middle of the play area to form the start of the dice line (think UNO discard stack from the original card game).  The starting player rolls their dice and has to match either the color or value of the most recently placed die in the dice line.  That player's matching die is placed in the dice line and will have to be matched by the next player.  Play continues as players take turns rolling their hand of dice and adding one matching die from their hand to the dice line each turn until they only have one die left in their hand.  The player must then say &quot;UNO!&quot; or be penalized.  The penalty for not remembering to say &quot;UNO!&quot; is similar to the draw one and draw two die faces:  the affected player must take the appropriate number of dice from the end of the dice line.  The first player with no dice left wins.  The winning player's score is based on the faces of the dice left in front of their opponent.  Alternate rules are provided to ignore scoring and simply play the best out of 3 games.&#10;&#10;PACKAGING:&#10;This edition was packaged in a creative looking tin that was made to resemble an aluminum soda can--complete with Nutrition Facts label.  The top of the can pops off (twist to open).  The one sheet of rules and 11 dice fit inside the tin with a cardboard insert to help dampen the sound of the dice in the tin.  The tin also has a coin slot in the top that holds the a plastic hook to allow it to be hung for selling/display purposes.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Fruit Ninja Card Game",
        "description": "SUMMARY:&#10;The Fruit Ninja Card Game is based on the popular Fruit Ninja video game popularized on the iOS and Andriod mobile platforms.  In the video game, fruit (and bombs) are tossed into the air and the player makes gestures to slice as much fruit with their sword as possible while avoiding bombs.&#10;The Fruit Ninja Card Game is a very simple push your luck card game that makes thematic use of simply cutting the deck of cards.  By cutting the deck and selecting cards based on the risk associated with the color coded card backs, players attempt to be the first to either collect one of each of the 7 types of fruit or collect 25 pieces of the same type of fruit.&#10;&#10;GAMEPLAY:&#10;After shuffling the deck of cards, the starting player cuts the deck while making the sound of someone making a sword chop.  That player chooses either the top card from the bottom section of the deck or the bottom card from the top section of the deck (a choice between the two inner cards of the split deck). By looking at the color of the card backs, the player can asses the risk of choosing a particular card.  Some cards have a higher risk of being a bomb while having the potential to contain more pieces of fruit.  The player continues their turn as long as they avoid choosing a bomb card.  As long as the player only finds fruit cards, they continue adding up fruit and splitting the top section of the deck remaining from their previous split.  If the player chooses to stop, they get to keep their fruit cards and pass the deck to the next player.  If at some point the player chooses to cut the deck and chooses a bomb card, they end their turn and loose any fruit that they have revealed during that turn (while keeping fruit earned on previous turns).  Three types of power bananas can be played from a players saved stash of fruit to perform one of the following actions based on the type of fruit: steal a fruit, ignore a bomb or take an additional turn.  While very simple, this card game remains thematically true to the simple video game that it is based on.&#10;&#10;CONTENTS:&#10;103 Fruit Ninja Cards + 1 sheet of rules in English&#10;&#10;FROM THE BOX:&#10;Based on the hit game.  Make Sensei proud!  Cut the deck--select the top or the bottom.  The first player to collect one of each fruit or 25 of any fruit wins!  The colors on the card backs will help you choose.  Be wary! Bombs end your turn and you forfeit this turns bounty.  Power bananas grant special ninja powers.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Noah",
        "description": "In No&eacute; the flood is at hand, and to save as many species as possible, Noah will need your help &ndash; with only the most deserving of players being saved from the waters!&#10;&#10;Each round, players start with eight animal cards in hand; five ferries are laid out in a circle, with one animal placed on board from the top of the deck. Noah himself stands on one ferry. On a turn, a player plays one card from hand onto the ferry where Noah is located, following two rules: (1) the total weight of all animals on board cannot exceed 21 and (2) animals on a ferry must be placed either in alternating gender order or must be all of the same gender. After placing an animal, the player moves Noah to a different ferry; if he played a female animal, Noah goes to either adjacent ferry, while if he played a male, Noah goes to either ferry on the other side of the circle.&#10;&#10;If a player can't legally play an animal, he must first take in hand all the animals on the ferry where Noah is located, then play an animal.&#10;&#10;In addition to moving Noah to a nearly full ferry, players have two other ways to benefit themselves or mess with other players. If a player plays an animal identical to the one last played on that ferry, he moves Noah, then takes another turn. If a player brings the weight of a ferry to exactly 21, that ferry launches from shore to meet the ark located in distant waters, a new ferry becomes available for loading, and the player distributes 1-4 cards from the deck among his opponents. finally, some cards have special animals, such as the giraffe that lets you peek at an opponent's hand and the woodpecker, which stupidly pokes holes in the ferry and reduces its maximum weight to 13. Bad woodpecker, bad!&#10;&#10;The round ends when a player runs out of cards in hand or a fourth ferry launches. Players receive penalty points for cards still in hand, scored according to the number of tears on each card, those tears representing Noah's sadness at the animal being left behind. Then players shuffle all the animal cards and begin a new round. The player with the fewest points after three rounds wins!&#10;&#10;",
        "artist": "Xavier Collette"
    },
    {
        "name": "The Cook-off",
        "description": "Welcome to the ultimate cooking contest: The Cook-off! Here the most talented and selfish chefs duel to find who is the best. Be careful, opponents will try everything to beat you... Sabotage is the way!&#10;&#10;The Cook-off is a strategic party game for 4-6 Players. The objective is to be the best and more productive cooker in the contest.&#10;&#10;All Players have the same hand of action cards.&#10;&#10;The tournament has 10 rounds with a sequence of three actions each. &#10;Players put down 3 cards facing down on the Countertop, following the desired order for their actions.&#10;&#10;All players de&#239;&#172;&#129;ne their round cards, everyone simultaneously show the &#239;&#172;&#129;rst card. &#10;Players should now discuss and decide in which order actions take place, in other words, who Sabotages who if possible. &#10;Alliances and conspiracies are more than welcome, but it is good to remember: No one is required to follow anybody!&#10;&#10;After resolving &#239;&#172;&#129;rst actions, each player has now the option to change the order of the second with the third card, as long as they aren&rsquo;t revealed. Everyone confirm the final order and resolve the action on the proposed order. After the three action are resolved, each player return the played cards to their hands and choose 3 cards again according to their plans for the next round. Game continues...&#10;&#10;The winner will be the one who gets more Victory Points (VPs) with his recipes, and nothing friendly tricks, after ten rounds with three actions each.&#10;&#10;Highlights&#10;&#10;&#10;     Party with strategic feel&#10;&#10;&#10;&#10;     Fast and easy gameplay&#10;&#10;&#10;&#10;     Colorful artwork and components quality&#10;&#10;&#10;Components&#10;&#10;06 Custom Kitchens (Individual Mats)&#10;&#10;01 Round and Score Board&#10;&#10;07 Round and Score Markers&#10;&#10;42 Action Cards&#10;&#10;54 Vegetable Tokens&#10;&#10;36 Meat Tokens&#10;&#10;18 Sabotage Tokens&#10;&#10;Microbadge:&#10;&#10; &ndash; The Coook-off fan&#10;&#10;",
        "artist": "Marcelo Bissoli,Luis Francisco"
    },
    {
        "name": "Heroica: Ilrion",
        "description": "Game description from the publisher:&#10;&#10;Since the dark forces settled upon the land, farmers have struggled to maintain their livelihood. Monsters constantly ravage the fields and destroy most of the crops, and what is left is barely enough for families to survive. There is no longer enough to trade, and even if there was, the Goblin General's siege on Draida Bay makes it impossible to sell or buy anything. Prospects are grim.&#10;&#10;In Heroica: Ilrion, it's up to you to locate the Catacombs, fight your way past vicious bats and lumbering zombies, and defeat the Vampire Lord to rescue the King!&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "Cartoona",
        "description": "Cartoona is a creature-building, tile-laying game featuring the pop art of Robert Burke. The goal is to be the first player, or team to reach 50 points by building colorful and odd cartoon creatures. This is accomplished by placing tiles of different creature parts together and by playing cards that speed the process, or hinder your opponents. The game box includes 94 creature part tiles, 70 action cards, 8 player screens, and a rules booklet.&#10;&#10;",
        "artist": "Robert Burke,Luis Francisco"
    },
    {
        "name": "Indigo",
        "description": "Indigo is a tile-laying game along the lines of Metro, Tsuro, and Linie 1 in which players build paths bit by bit, with no player owning the individual paths and everyone trying to exploit the paths already present. Unlike those earlier games, however, your goal is to move gemstones from their starting locations on the board to your designated goals, with the player who scores the most points winning the game.&#10;&#10;To set up the game board, place the central hex tile, then add five green gems and one indigo gem to it. Place six &quot;U-turn&quot; tiles at their designated locations on the outer edge of the game board, then place a yellow gem on each such tile. Each player places goal markers on goals between these U-turn tiles on the edge of the game board: in a two-player game, the players alternate goals; in a three-player game, each player has one goal to herself, while sharing two others; and in a four-player game, each player shares a goal with every other player.&#10;&#10;On a turn, a player places a tile on any space on the game board, with the only restriction being that a player cannot create a route directly from one goal to another. Each tile has three route segments on it, connecting one pair of edges. If a player places a tile next to a gemstone, that gemstone &quot;moves&quot; as far as possible along the route so that all players can see where to place tiles to next move that gemstone. (Thus players avoid the mental gymnastics required in Metro and Linie 1 in which nothing moves until a route is complete.) When connecting to the central tile, the green gems move off first, with the indigo gem moving only with the sixth connection.&#10;&#10;If a player places a tile so that one gem would run into another, both gems are removed from the game!&#10;&#10;When a gem is moved to a goal owned by only one player, that player keeps the gem. If two players own the goal, then both players collect a gem of that color, taking the extra gem needed from the reserve. Once all the gems have been claimed, the game ends, with players earning 3 points for an indigo gem, 2 for green, and 1 for yellow. The player with the most points wins.&#10;&#10;",
        "artist": "Eckhard Freytag,Walter Pepperle"
    },
    {
        "name": "CITY Alarm",
        "description": "The chase is on in the streets of LEGO City! Can the thieves get the money without setting off the alarm, or will the police catch up with them and put them all in jail? Everyone must think ahead if they want to win!&#10;&#10;Players are divided into two teams: police and thieves. The thieves win if they steal all ten stacks of money. This is done by landing on a space next to a building and rolling the die to determine whether they get two stacks of money, set off the alarm allowing the police to deploy the helicopter to protect a building of their choice, or set off the alarm but still get away with one stack of money. The police win if they arrest all four thieves before they manage to get ten stacks of money. Capturing thieves involves landing on the same space as a thief.&#10;&#10;",
        "artist": "Tore Magelund Alexandersen,Emilie Røndal Nielsen,Martin Rathschau,Thomas Robert Van der Heiden"
    },
    {
        "name": "Star Wars: Battle of Hoth",
        "description": "Publisher blurb:&#10;&#10;Defend Hoth&trade; as you battle against your friends and the Empire!&#10;&#10;LEGO&reg; Games is the world's first collection of games that you build, play and change. With the unique buildable LEGO Dice and changeable rules, LEGO Games is a great way of having fun together with family and friends.&#10;&#10;It is a dark time for the Rebellion. Darth Vader has discovered Luke Skywalker&rsquo;s secret base on the remote ice planet of Hoth&trade;, and Imperial ground forces are ready to attack! The Battle for Hoth&trade; has begun in an exciting game of strategy and luck for 2 or 4 players. Game play approximately 10-20 minutes.&#10;&#10;    1 buildable LEGO&reg; Dice&#10;    32 LEGO microfigures&#10;    Rules booklet&#10;    Building instructions&#10;&#10;&#10;&#10;&#10;Game overview:&#10;&#10;Star Wars: Battle of Hoth is a game for two or four players on a Lego game board. One player or team represents the empire, and the other player or team represents the Rebels. The players move their pieces over the assembled board and attack the opponent's pieces. Each piece has a range of fire and movement that dictates what damage can be done and at what distance. The board is a gridwork of interlocking Lego pieces that can be altered to change the layout, thus opening some movement paths that were previously blocked, and blocking movement elsewhere. The goal of the game is to eliminate the opposition's forces or leader.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Thunderstone Advance: Towers of Ruin",
        "description": "In Thunderstone: Heart of Doom, you had a chance to face Doom's very heart, the eighth Thunderstone, and defeat the ancient evil &ndash; but winning that battle had unexpected consequences. It banished Doom, but also freed him to visit other worlds, so you advanced to the next world with him.&#10;&#10;Thunderstone Advance: Towers of Ruin, which is fully compatible with all previous Thunderstone offerings, is the next stop in your adventure. In Thunderstone Advance you build your party of heroes to defeat the dreaded Thunderstone Bearers in their dungeons or wilderness. The player who defeats the most valuable monsters will win the day, but beware &ndash; those monsters have all-new tricks up their sleeves, and victory will not come easy.&#10;&#10;Thunderstone Advance: Towers of Ruin includes new rules, all new cards in new card frames, and a new village and dungeon board.&#10;&#10;Integrates with&#10;&#10;&#10;    Thunderstone&#10;    Thunderstone: Starter Set&#10;&#10;&#10;",
        "artist": "Jason Engle,Erich Schreiner,Mark Tarrisse,Shane Tyree"
    },
    {
        "name": "Bullenparty",
        "description": "Like its predecessors 6 nimmt! and 11 nimmt!, Wolfgang Kramer's Bullenparty has players lay out numbered cards, then collect bullheads &ndash; but the details of game play require you to point your horns in new directions.&#10;&#10;Bullenparty uses two decks of cards: one numbered 1-100 (with each card bearing 1-7 bullheads) and the other with ten Bull cards, bearing 4-7 bullheads. At the start of the game, each player receives five number cards at random along with a zero card.&#10;&#10;At the start of each round, lay out one row of number cards for each player, with two cards in each row. Each turn, all players secretly choose a card in their hand, then reveal them simultaneously. Whoever played a number card chooses all of the cards in one row and adds them to his hand, discarding the card used for bidding. Whoever played a zero card adds a card from the top of the deck to a remaining row, then reclaims the zero card. All players who played zero cards then repeat this process. If a row reaches five cards in length, add the top card from the Bull deck to this row; if all rows end in Bull cards, then players must play number cards.&#10;&#10;After a round ends, all players must reduce their hand to five number cards, playing any excess cards in hand onto one or more stacks in front of them, with cards being played in ascending order. Bull cards are placed separately.&#10;&#10;Players then create new rows and play another round. When the deck runs out, shuffle the discards to finish the round, after which the game ends. Players then score positive points for Bull cards and for the bullheads in the pile with the most bullheads; all other bullheads are negative points. The player with the highest total score wins.&#10;&#10;",
        "artist": "Oliver Freudenreich"
    },
    {
        "name": "Klack!",
        "description": "Klack! is both the name of the game and the sound that the magnetic discs in the game will make when you slap one against another &ndash; and slap them together you will as you're trying to claim the right discs as quickly as possible.&#10;&#10;To set up the game, lay out all 36 discs face up so that everyone can see the colored symbols on them. One player rolls the two dice &ndash; one showing colors, the other symbols &ndash; then everyone simultaneously tries to grab any discs showing the colored symbol determined by the die roll. If a die shows a white face instead of a color or symbol, then that characteristic is ignored for the round. For example, if the roll is white (i.e., blank) and red, then players can grab any disc with a red symbol. If both dice show white, then it's a free-for-all, with players grabbing as many discs as possible!&#10;&#10;A player can use only one hand to grab discs. If a player accidentally grabs the wrong disc, she must return that disc to the playing area, along with an additional disc as a penalty.&#10;&#10;When all the discs have been claimed, the game ends and the player with the most discs wins!&#10;&#10;",
        "artist": "Markus Wagner"
    },
    {
        "name": "Piraten kapern",
        "description": "Piraten Kapern is the German version of the 2011 game Otsarot o Tsarot, published by Shafir Games in Hebrew and English.&#10;&#10;As you might expect with a game titled Piraten Kapern, part of a line of combined dice-and-card games that publisher AMIGO Spiel introduced in 2012, players must set off in search of treasure, pushing themselves to find as much as possible without losing their heads.&#10;&#10;At the start of a turn, the active player rolls the eight special dice. He must set aside any skulls rolled, and his turn ends immediately with no score if he rolls a third skull. The player is free to set aside any number of other dice, rerolling the rest. He may continue to do this until the skulls get him or he stops. He then scores for dice combinations, with a three-of-a-kind earning 100 points, a four-of-a-kind 200 points, and so on all the way up to an eight-of-a-kind earning 4,000 points. Each gold or diamond showing is worth 100 points on its own. A player earns a 500 point bonus if all eight dice score.&#10;&#10;If a player rolls four or more skulls on his first roll, he heads to Skull Island for the turn, setting aside those skulls and continuing to roll as long as he sets aside at least one skull each time. Once he stops, all other players lose 100 points for each skull showing.&#10;&#10;Before a player starts to roll for his turn, however, he draws a card from the pirate deck, which affects what's possible on that turn: He might score double for the treasure he collects, or need to roll sabers to fight off other pirates, or receive a free diamond or gold coin, or be able to score treasure even if he collect three skulls.&#10;&#10;Once a player reaches 6,000 points, all other players take one final turn, then the player with the most points wins.&#10;&#10;",
        "artist": "Mario Barbati,Rafael José Pardo Macías,Jose Pedro"
    },
    {
        "name": "Wanzen tanzen",
        "description": "In Wanzen Tanzen (&quot;Dancing Bugs&quot;) you will not dance and the only bugs you'll encounter are made of cardboard. What you will find in the box is a dice-and-card game in which you're challenged to compete multiple tasks on a card in order to claim it for points.&#10;&#10;At the start of the game, shuffle the 28 task cards, then place fifteen of them face-down and remove the rest from the game. Place the five penalty cards (worth -1 to -5 points) in order with the -5 on the bottom. Give the starting player the five dice, then reveal the top task card.&#10;&#10;On a turn, the active player starts by rolling all the dice, then she has two choices:&#10;&#10;&#10;    Set aside at least one die, then roll any remaining dice.&#10;    Take one baby bug token and reroll all dice just rolled.&#10;&#10;&#10;After each roll, a player has these two options. She continues until either she sets aside all five dice or takes a fifth baby bug. (More on that below.) If the player has set aside all the dice and has completed one (or more) of the tasks on the card, she covers one task with a marker. If no tasks remain uncovered, she claims the task card, which is worth positive points, then the next player reveals the next task card and takes his turn.&#10;&#10;If at least one task remains uncovered, the player can either take another turn immediately or pass the dice to the next player. If the player has set aside all the dice without completing a task, she takes two baby bug tokens, and the next player takes a turn.&#10;&#10;As soon as a player has five or more baby bugs, that player claims the top penalty card and all players return all baby bugs to the supply. The game ends as soon as the last task card or the last penalty card has been claimed. Players sum their points, and the player with the highest score wins.&#10;&#10;",
        "artist": "Oliver Freudenreich"
    },
    {
        "name": "Army vs. Aliens",
        "description": "Can flying saucers and death rays beat out tanks, nukes and troopers? Find out with Army vs. Aliens, the first game in the Army vs. Aliens series, with each game being playable on its own while also allowing for any faction in one game to be played against any faction in another or for multiple sets to be combined for team games or &quot;last man standing&quot; challenge matches. In this fun take on alien invasion games, you get to choose whether you want to fight off alien forces as the army or whether you want be the aliens trying to conquer Earth.&#10;&#10;In the game, players roll dice to set their power &mdash; each army has one type of dice with six faces &mdash; so that they can destroy the other players' dice on a subsequent turn. Used dice are placed into an expended pile where they can later be rallied (re-rolled) to reset their power. Dice are ranked in power and can destroy any die of equal or lesser rank but the higher value dice have special abilities, e.g., Nukes on the Army side that destroy just about everything if you get three of them. On a player's turn, he has three options: (1) Attack with an existing die, (2) Rally any or all dice (including active ones) or (3) Use a special power.&#10;&#10;If five rounds pass without either player scoring, then the game ends and the player who has the most dice in his scoring zone wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "FitzIt",
        "description": "Game description from the publisher:&#10;&#10;What comes in a box, fits inside a blender, and is bound to make you laugh? FitzIt &ndash; the party game where fun is all in the description! Name an object that fits the attributes on your cards, then play them to the grid. The more cards you play, the faster you score. Use your creativity and you're fit to win!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Oz Fluxx",
        "description": "Does life seem drab and humdrum? Let the cyclone of Oz Fluxx, the ever-changing card game, whisk you away to a magical world of fun and wonder! Mingle with Munchkins, make new friends, help them with their quests, and follow the Yellow Brick Road to seek the Wizard's help for your own heart's desire &ndash; but beware the flying monkeys, fighting trees, and fields of poppies! Don your green spectacles to enter the Emerald City, and keep a bucket of water handy: You never know when you'll run into a Wicked Witch that needs melting. Next stop...the land of Oz!&#10;&#10;Game description above from the publisher.&#10;&#10;Fluxx is a card game where the cards themselves determine the current rules of the game. By playing cards, you change numerous aspects of the game: how to draw cards, how to play cards, and even how to win.&#10;&#10;At the start of the game, each player holds three cards and on a turn a player draws one card, then plays one card. By playing cards, you can put new rules into play that change numerous aspects of the game: how many cards to draw or play, how many cards you can hold in hand or keep on the table in front of you, and (most importantly) how to win the game. There are many editions, themed siblings, and promo cards available.&#10;&#10;",
        "artist": "Michael Hays"
    },
    {
        "name": "Kosmonauts",
        "description": "In Kosmonauts, players take on the role of space cadets who need to complete one final challenge before they can become officers of the Space Forces. The challenge? A race through space during which they demonstrate their spaceship-controlling skills and problem-solving abilities. This race is not linear, and spaceships can pass checkpoints on the planets and comet in any order. Once a ship lands, the player claims the appropriate planet/comet token; the earlier you arrive, the more victory points (VPs) that token is worth. Each game turn is divided into four phases:&#10;&#10;&#10;    Events: The active player chooses one of three available events, which then affects all players. Events won't necessarily affect everyone the same way, though, depending on where they are in space and what they're doing.&#10;&#10;&#10;&#10;    Orders: All players present their movement orders simultaneously using a direction rose with six possible directions. Each turn, a player can place up to three units of fuel in any of those six directions.&#10;&#10;&#10;&#10;    Flying: Each ship flies one cell for each unit of fuel spent on movement in a particular direction; if a player fueled multiple directions, the ship moves in all directions fueled. Fuel units are not removed after each turn &ndash; there's no friction in space, right? &ndash; so each turn allows a captain to further increase speed (by adding fuel to units already in place) or slow down his ship (by accelerating in the opposite direction).&#10;&#10;&#10;&#10;    Planet Movement: The active player moves all planets, then passes the active player token to the player on his right.&#10;&#10;&#10;The game ends when someone returns to Earth after visiting all but one planet. Players receive VPs for their landing tokens and completed missions, and whoever has the most VPs wins!&#10;&#10;",
        "artist": "Filipe Alves,Gil d'Orey"
    },
    {
        "name": "Step by Step",
        "description": "Step by Step is a push-your-luck dice game in the spirit of Sid Sackson's classic Can't Stop as players try to push their pieces to the top of multiple columns on the game board &ndash; but players win by scoring points and that can be done two ways.&#10;&#10;Each player starts the game with their pieces in the start spaces of five columns on the game board &ndash; a space worth -5 points at game's end, mind you, so don't stick around too long! (The game board is double-sided, with one side for 2-3 players and the other for 4-5 players.)&#10;&#10;On a turn, a player chooses a column, then rolls 2-6 dice depending on which column he chose. After rolling the dice, the player then makes a bid &ndash; either &quot;higher/same&quot; or &quot;lower/same&quot; &ndash; that lasts for the remainder of the turn. After making a bid, the player chooses one or more dice from among those he rolled previously and rerolls them. If the sum of all the dice matches his bid, then he advances a runner in the column he chose, skipping over opponents' pieces on the way.&#10;&#10;The player then either ends his turn (moving his pieces to where the runner sits) or rerolls one or more dice to try to match his bid once again. If a player ever fails to match his bid, his turn ends without moving his pieces.&#10;&#10;If a player ends his turn with his piece on one of 14 tokens that start on the game board, he claims this token.&#10;&#10;Each column is divided into two zones, and a player cannot advance into an upper zone unless he has moved at least three pieces from the start spaces. The game ends as soon as one player piece is in each upper zone. Players score points based on the height they reached in each column (-5 to 12 points) and the number of tokens they collected (-3 to 5 points). The player with the highest total score wins.&#10;&#10;",
        "artist": "Dennis Lohausen"
    },
    {
        "name": "The Big Fat Tomato Game",
        "description": "Game description from the publisher:&#10;&#10;Sink your teeth into this juicy game of fierce tomato farming!&#10;&#10;In The Big Fat Tomato Game, you try to harvest the most tomatoes while defending your patch from a garden variety of intruders like weeds, varmints, and even the dastardly tomato zombie. Oh, and did we mention flying hippos?! Haul the most tomatoes to market by the end of the game and you're a slice above the competition!&#10;&#10;",
        "artist": "Stephen Gilpin"
    },
    {
        "name": "Milestones",
        "description": "Game description from the publisher:&#10;&#10;The settlement of the country is the work of the players in their role as noble builders in Milestones!&#10;&#10;In this game, players work together to build roads, create marketplaces, and erect houses. With each milestone set along the way, they move further into the country.&#10;&#10;But while they build together, when it comes to procuring construction materials, money, and grain each player is on his own. Thus, you must carefully develop your own network of goods, trade and colonization materials and optimize its use cleverly. Whoever also develops a keen sense of timing can grab the most valuable building sites and in the end win out.&#10;&#10;",
        "artist": "Klemens Franz"
    },
    {
        "name": "Yedo",
        "description": "Japan, 1605 &ndash; Hidetada Tokugawa has succeeded his father as the new Shogun, ruling from the great city of Edo (a.k.a. Yedo), the city known in present times as Tokyo. This marks the beginning of the golden age of the Tokugawa Shogunate and the so-called Edo Period that will last until 1868. Naturally, the most powerful families in Edo immediately try to curry favor with the new Shogun &ndash; and this is the opportunity our clan has been looking for, our chance at power and glory. Our clan will prove ourselves to be indispensable to the new Shogun. We will work from the shadows to acquire information about our rival clans. We will kidnap those who might oppose our ascent and assassinate those who prove a threat. We will use cunning to prevent our adversaries from doing the same to us. We will find glory and honor in the eyes of this new Shogun &ndash; or failing that we will end his rule by any means necessary.&#10;&#10;In the strategy game Yedo, players assume the roles of Clan Elders in the city of Edo during the early years of the Tokugawa Shogunate. The object of the game is to amass Prestige Points, mainly by completing missions. To do so, players must gather the necessary assets and &ndash; most importantly &ndash; outfox their opponents and prevent them from completing their missions.&#10;&#10;There are several ways to reach your goal. Will you try to complete as many missions as possible and hope that your efforts catch the Shogun's eye? Or will you choose a more subtle way of gaining power by trying to influence the Shogun during a private audience? You can also put your rivals to shame by buying lots of luxury goods from the European merchants. It's all up to you &ndash; but be careful to make the right choices, for in Yedo, eternal glory and painful disgrace are two sides of the same coin...&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Zooloretto: The Dice Game",
        "description": "Zooloretto: The Dice Game takes the basic Zooloretto / Coloretto game play &ndash; on a turn either add to the offerings on display, or take one set of offerings &ndash; and replaces the cards with dice so that you'll never know which animals will pop up for you to take. Each player has her own scoresheet, which represents her zoo, with space for five types of animals: one crocodile, two ostriches, up to five lions. The scoresheet also has space to collect coins and barns for animals that don't fit in the appropriate pens.&#10;&#10;On a turn, the active player takes one of two actions:&#10;&#10;    Take two dice from the reserve, roll them, then assign each die to a transport cart on the game board.&#10;    Take all the dice in one transport cart, then tick off the animals/coins on those dice on your scoresheet.&#10;&#10;&#10;&#10;&#10;Dice can be placed in separate carts, and the number of dice is limited to six, eight, or ten depending on the number of players. The round continues until each player has taken dice from a cart, then a new round begins. The first player to fill the pen of a particular type of animal receives a bonus; if a player takes more animals than she has room for, however, she ticks off the barn for each type of overflow animal.&#10;&#10;The game ends once a player has filled all her animal pens or has space in only one pen. Players score one point for each animal and any bonus points they received; they lose two points for each barn ticked off, but for each group of coins collected, one penalty can be ignored. (Alternatively, coin groups are worth one point.) The player with the highest score wins!&#10;&#10;",
        "artist": "Design/Main"
    },
    {
        "name": "Las Vegas",
        "description": "Developer Stefan Br&uuml;ck at alea describes Las Vegas as &quot;an easy, dice-rolling, fun-and-luck game with a lot of interaction and 'schadenfreude'&quot;. Who doesn't love schadenfreude? (Well, other than those being schadened, I suppose...)&#10;&#10;In more detail, Las Vegas includes six cardboard casino mats, one for each side of a normal six-sided die. For each mat, players draw money cards until at least $50k is showing, but the amount may end up being a lot more, making that casino more desirable.&#10;&#10;Each player has eight dice of a different color, which they take turns rolling. When you roll your dice, you can choose to place them on the relevant casino cards; for example, a die showing a 1 will be placed on the casino mat marked &quot;1&quot;. You must place all dice of one number on one casino in your turn. All players take turns doing this until all the dice have been used. Finally, the player with the most dice on each casino card takes the money associated with it. In case of a tie, the next non-tied player takes the highest-valued money card at that casino.&#10;&#10;Las Vegas rates a 1 out of 10 on alea's difficulty scale.&#10;&#10;",
        "artist": "Harald Lieske,Markus Schmuck,Mia Steingräber"
    },
    {
        "name": "Saint Malo",
        "description": "Developer Stefan Br&uuml;ck at alea describes Saint Malo as &quot;a light, dice-rolling strategy game in which the players draw their own city buildings, walls, and people on wipe-off boards&quot;.&#10;&#10;In more detail, in Saint Malo players roll five dice to gain various resources; combinations of dice create enhancements like characters or buildings, which can provide additional victory points, money, or special actions, such as altering the outcome of a die roll. Players draw symbols for their holdings on erasable boards showing a grids of their cities to create individual towns. Players could build storehouses on particular squares, for example, then place a merchant nearby to gain money each turn. Another important character is the soldier; players must acquire these to defend themselves from pirate attacks that can decimate their towns.&#10;&#10;Saint Malo rates a 2 out of 10 on Alea's difficulty scale.&#10;&#10;",
        "artist": "Julien Delval,Harald Lieske"
    }
]