[
    {
        "name": "Twilight Squabble",
        "description": "Relive the entire Cold War in ten minutes with Twilight Squabble!&#10;&#10;In 1947, the superpowers of the United States of America and the Soviet Union began a new sort of conflict, a struggle in the twilight of World War II. This war centered on the increasing development of nuclear weapons, and as the years passed it seemed like the war would never end &mdash; but no one wants to play a card game for decades. Thus, this game presents an abridged version of the Cold War &mdash; less of a twilight struggle and more of a twilight squabble...&#10;&#10;",
        "artist": "Scott Nicely,Steven Tu"
    },
    {
        "name": "Star Trek: The Dice Game",
        "description": "In Star Trek: The Dice Game you alone are responsible for the Starfleet crew members aboard the U.S.S. Enterprise during its five year mission of exploration. In order to succeed you will need  to complete missions and overcome the unpredictable challenges that may arise during them. If you complete the full five years of exploration you will return to Starfleet Headquarters in glory and be promoted to Admiral. But beware; as you travel ever farther from Federation space the challenges and constraints you face will grow more and more extreme. Do you have what it takes to survive?&#10;&#10;Winner of the 2016 Golden Geek award for Best Print and Play Boardgame, Star Trek: the Dice Game is a solo worker placement dice game.&#10;&#10;",
        "artist": "Carl White"
    },
    {
        "name": "North American Railways",
        "description": "In the card game North American Railways, 3-5 players build railroads in the United States. They become directors of up to five different companies and try to acquire a majority of shares. In the end, the player with the most cash wins.&#10;&#10;North American Railways is mechanically simple but very tough to play well.&#10;&#10;Content&#10;30 shares (six cards each in the five colors of the railway companies), &#10;5 starting cities, &#10;36 cities, &#10;10 marker tokens (two each in the five colors of the railway companies), &#10;Play money (in the denominations of $100,$200,$500 and $1000), &#10;1 start player token, &#10;2 rules booklets (English and German)&#10;&#10;",
        "artist": "Harald Lieske"
    },
    {
        "name": "Leo",
        "description": "Leo the lion's mane is far too long and he risks looking shaggy and losing the respect of his fellow animals &mdash; but those same animals keep stopping him to chit-chat while on the way to a haircut. Can you get this king of the jungle to the barber shop in time?&#10;&#10;In Leo, players need to help Leo reach the barber shop before it closes for the day. To set up, place all of the animal tiles face down, shuffle them, then create a track that leads from Leo's bed to Bobo's Barber Shop. Set the clock to 8:00 a.m. Each player starts a number of cards in hand.&#10;&#10;On a turn, a player plays one card to move Leo ahead 1-4 spaces on the track, then reveals the animal tile on which Leo landed. If the tile is the same color as the card just played, the clock remains at the same time  as it was at the start of the turn; if the tile has a different color, however, the clock moves ahead 1-5 hours depending on the animal depicted. Poor Leo! If the clock reaches 8:00 p.m. before Leo arrives at the barber shop, the round ends and Leo must return home in order to try again the next day. Turn all face-up tiles face down again.&#10;&#10;If the players manage to get Leo to the barber shop within five days to get him a trim, they win!&#10;&#10;",
        "artist": "Michael Menzel"
    },
    {
        "name": "Micro Robots",
        "description": "Micro Robots, a simultaneous play game inspired by Alex Randolph's classic Ricochet Robots, challenges players to quickly determine how a robot can move from one spot on the grid to another.&#10;&#10;To set up, choose to use the black or copper side of the four game boards, then arrange them in a 2x2 square. Each game board shows nine dice, and once arranged the completed grid shows 36 dice, with the dice being numbered 1-6 and showing six colors, with each combination of number and color appearing exactly once. Roll the color die and number die to determine the starting location for the transparent robot, then mark this space with the transparent starting token.&#10;&#10;In a round, roll the two dice to determine the target space; you can mark this space with a transparent victory token or simply have everyone remember which space they're trying to reach. Everyone simultaneously tries to figure out how to move the robot to the target space, and to move the robot, it must move orthogonally to a space that shares either the color or number of its current location. If the robot starts on &quot;3-green&quot;, for example, it can move orthogonally to any space that shows either a 3 or is green; if you'd move it to &quot;5-green&quot;, it can now once again move orthogonally to any space that shows either a 5 or is green; and so on.&#10;&#10;As soon as a player has a solution, they yell out the number of moves, then take the robot and demonstrate the solution. If the solution takes exactly the number of moves claimed, the player earns a victory token; if not, the player gives one of their victory tokens (if they have any) to the player with the fewest tokens. In either case, the former target space becomes the new starting space for the next round.&#10;&#10;If any player possesses five victory tokens, they win! If the 25 victory tokens are distributed before someone collects five, then whoever holds the most tokens wins, with ties being possible.&#10;&#10;Expert Micro Robots players can increase the challenge of the game by placing the target victory token on the board, then rolling the two dice once again. The players must now determine a solution that first moves the robot to the space showing on the dice, then to the final destination.&#10;&#10;The transparent robot in Micro Robots can also be used in Ricochet Robots. This robot moves like any other robot in that game except that for an additional move it can pass through a wall instead of stopping at it. It cannot move through the central barrier or the exterior walls, and the only target space on which it can land is the colored vortex.&#10;&#10;",
        "artist": "Christian Fiore"
    },
    {
        "name": "Animals on Board",
        "description": "The accessible and clever game Animals on Board features a two-tiered cardboard ark that will hold each player's animal tiles. At the start of the game, each player draws three animal tiles, chooses one of these tiles, and places it on a bracket of his ark without showing it to the other players.&#10;&#10;The leftover animals that players initially drew begin forming what will become a single animal collective in the center of the table. The total number of animals in the collective is based on the number of players, but one animal in the collective will always be face-down. Each player also starts with one food crate and may never have more than five food crates at any time.&#10;&#10;On each turn, a player has two options: (a) split a collective of animals into two groups and take a food crate, or (b) take one of the animal collectives into their ark by paying a food crate for each animal in that group. As players choose their group of animals, they drop out of the turn. The first player to drop out of a turn starts the next turn. The game ends when an ark has at least ten animals on board.&#10;&#10;Before scoring, all animals in pairs are discarded because a guy called Noah claims all animal pairs for himself. Single animals score the points imprinted on the tile (from 1-5) and herds of animals automatically score five points each. Remaining food crates also score one point each.&#10;&#10;",
        "artist": "Alexander Jung"
    },
    {
        "name": "Teenage Mutant Ninja Turtles Dice Masters",
        "description": "Teenage Mutant Ninja Turtles Dice Masters is a dice-building game patterned after Quarriors! that features custom dice representing various characters from the Teenage Mutant Ninja Turtles (TMNT) universe. Unlike other Dice Masters sets, TMNT Dice Masters is sold in as a contained set that gives you all the dice and cards that you need to play. This is the first Dice Masters set that is sold as a contained set without the possibility to expand it with boosters.&#10;&#10;In the game, each player brings a set of dice to the table; these form the player's team, from which only they can purchase dice. In addition, each player brings two basic action cards, which are placed in the center of the table; both players can purchase them.&#10;&#10;During a turn, a player draws and rolls a number of their dice, purchases additional dice, and fields character dice to attack the other player. A player wins once the opposing player has been reduced to zero life.&#10;&#10;TMNT Dice Masters is one of several planned Dice Masters games, all of which can be intermixed (or played alone).&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Dale of Merchants 2",
        "description": "The world has grown smaller. Civilizations around different continents have established independent free trade cities in order to ease trading between distant lands. One of those cities, Yengzuh, is now looking for a new ruler &ndash; a new Trade Master.&#10;&#10;The post is only open every ten years and the selection of the said individual is no small task. It&rsquo;s handled by holding a trading competition as it&rsquo;s in everyone&rsquo;s best interest to get the best merchant chosen for the job.&#10;&#10;All the participating merchants are prestigious, but the competition also tests their ability to deal with unexpected situations. After all, the winner will be responsible of keeping the global prices more fair and stable for years to come.&#10;&#10;There are only twelve free trade cities in the world. Yengzuh near Pandala is one of the oldest. The Guild of Extraordinary Traders from Dale promoted the founding of the city after the trade wars in Asia had spread too wide. The city&rsquo;s harbour has tens of great ships all the time, loading and unloading passengers and cargo.&#10;&#10;In Dale of Merchants 2, players take the roles of those participating merchants learning new techniques, trading goods, and managing their stock. The player who first manages to complete their astounding merchant stall wins the game and gets access to the guild!&#10;&#10;Dale of Merchants 2 contains six new decks and can be played by itself or combined with the decks from Dale of Merchants. The game includes a new ruleset for four players that introduces team battle! These new rules greatly enhance the four-player experience by adding cooperation between teammates and cutting downtime. These rules can also be used with the original game's six decks.&#10;&#10;",
        "artist": "Sami Laakso"
    },
    {
        "name": "Bear Valley",
        "description": "In Bear Valley, you must be the first to survive the treacherous wilderness and escape to the safety of the camp at the end of the valley. Players start as 2-6 campers along the Bear River and must navigate the wilderness, avoiding bears and trying to not get lost.&#10;&#10;The map of trails and challenges is built by the players as they explore the wilderness. These wilderness cards feature beautifully illustrated realistic art and have between three and six exit points along with a variety of features, both man-made and natural in origin. No two games will ever play the same.&#10;&#10;Gameplay is structured around a clever movement mechanism in which the first player moves one card, the second player moves up to two cards, the third player three, and so on. Each of the six player characters has both advantages and disadvantages that can be used across a variety of play options &mdash; short or long play, regular or advanced.&#10;&#10;Dive into caves, row canoes, cross bridges, climb mountains, and cut through treacherous underbrush as you stop at nothing &mdash; except bears &mdash; to be the first to reach base camp. Can you survive and escape Bear Valley?&#10;&#10;",
        "artist": "William Bricker"
    },
    {
        "name": "Empires in America (second edition)",
        "description": "Empires in America (EIA) is a solitaire States of Siege&trade; Series game of the conflict in North America between the French and British in the mid-18th century. This war, known locally as The French and Indian War, became embroiled in Europe&rsquo;s Seven Years&rsquo; War (1756-63), which caused that conflict to expand into a true World War (this was World War 0, for those keeping count). The French and Indian War saw small armies (with Indian allies joining them, particularly on the French side) march through vast wildernesses to fight battles which decided America&rsquo;s fate. This war was a prelude to the American Revolution that broke out two decades later.&#10;&#10;In EIA you control the French (and Indian) forces and the game system controls the British (and their Indian allies).&#10;&#10;Empires in America (second edition) FAQ&#10;&#10;",
        "artist": "Tim Allen,Alan Emrich"
    },
    {
        "name": "Imhotep",
        "description": "In Imhotep, the players become builders in Egypt who want to emulate the first and best-known architect there, namely Imhotep.&#10;&#10;Over six rounds, they move wooden stones by boat to create five seminal monuments, and on a turn, a player chooses one of four actions: Procure new stones, load stones on a boat, bring a boat to a monument, or play an action card. While this sounds easy, naturally the other players constantly thwart your building plans by carrying out plans of their own. Only those with the best timing &mdash; and the stones to back up their plans &mdash; will prove to be Egypt's best builder.&#10;&#10;",
        "artist": "Miguel Coimbra,Michaela Kienle"
    },
    {
        "name": "Ulm",
        "description": "Ulm is at its heyday. The construction of the Ulm cathedral has not yet been completed, but the city is already wealthy and prestigious.&#10;&#10;In Ulm, players try to expand their spheres of influence and to make optimal use of the hustle and bustle on the marketplace around the cathedral.&#10;&#10;",
        "artist": "Michael Menzel"
    },
    {
        "name": "Touria",
        "description": "In Touria, Princess Tara has decided to marry &ndash; but not just anyone, of course. She expects a lot from her husband-to-be: Heroic deeds and precious gifts are a must.&#10;&#10;A group of bold adventurers set out to pit themselves against dragons, dig up gems from the haunted mines of the country &ndash; and make a good deal from time to time, since the father of the bride demands an appropriate price for his daughter's hand. Touria's dancing towers show the heroes the way, so the brave men and women go from one adventure to the next. Brave women? Of course &ndash; or have we forgotten to mention that Tara's handsome brother, Prince Talan, is also of marriageable age?&#10;&#10;",
        "artist": "Klemens Franz"
    },
    {
        "name": "Imagine",
        "description": "More than one thousand items from all walks of life can be guessed through the use of 61 transparent cards in Imagine, whether they're placed next to one another or superimposed. Almost everything in the world can be represented by a simplified concept &mdash; just don't speak while you're playing...&#10;&#10;",
        "artist": "Shintaro Ono (大野 森太郎)"
    },
    {
        "name": "5 Seconds",
        "description": "Description from the publisher:&#10;&#10;In the quick and witty word game 5 Seconds, a player has five seconds to give three valid responses to a question, and if they do it, they advance a space on the game board. If they don't, then the next player gets to take a crack at the same question &mdash; but they can't repeat any of the previous answers given, and they still have only five seconds to spit out their answers!&#10;&#10;Whoever crosses the finish line first wins!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Exposed",
        "description": "Exposed is a quick 2-6 player game in which you're a thief who has snuck into a boat party with the aim of stealing as many wallets as you can without anyone exposing who you are. If you steal enough wallets or you're the last player left unexposed, you win!&#10;&#10;The playing space is a grid of tiles depicting the guests at the party, such as a fireman, physicist, or accountant. You're one of these guests, but no one knows which one is you. Each guest has a wallet, which you can steal from them if you are adjacent. Each move you make gives away information about who you are, so you have to decide how aggressive or sneaky you want to be so that your identity can remain hidden while getting as many wallets as you can.&#10;&#10;",
        "artist": "Adam Foreman"
    },
    {
        "name": "Thunder & Lightning",
        "description": "In Thunder &amp; Lightning, players take on the role of Thor or Loki and fight their way through an army in an epic mythological showdown. Because Loki has already stolen Odin's Crown, the Allfather has entrusted his son Thor with his prized ring of power, Draupnir, to help him defeat the vile trickster. But who really has what it takes to gain control over both relics and therefore claim the throne of Asgard?&#10;&#10;Thunder &amp; Lightning, a reimplementation of Hera and Zeus, features the same gameplay as the earlier design, but with larger decks of cards with a different distribution of powers.&#10;&#10;In the game, each player starts with nine cards in hand, then places three cards face down in their first row, with these rows butting against one another and each player having space for four rows in their playing area. If a player loses a card in a row, then any cards in the same column behind this card slide forward to fill the empty slot. On a turn, a player has as many action points as the number of columns they have in the playing area. They can use these action points to draw cards, play cards to the battlefield, play a mythological card for its power, or challenge an opponent's card.&#10;&#10;To challenge, the player chooses a card in their first row that abuts an opponent's card, then reveals both of them. Most cards have a strength value (0-7), and the card with the lower strength value is discarded, with the opponent's other cards in the same column then sliding forward.&#10;&#10;If a player cannot use all of their actions or has no actions (due to having no cards on the battlefield) or loses control of Odin's Crown/Ring, then they lose the game.&#10;&#10;",
        "artist": "Chris Quilliams"
    },
    {
        "name": "Dynasties: Heirate & Herrsche",
        "description": "Description from the publisher:&#10;&#10;Renaissance Europe is coming together, and people have realized that even the most powerful dynasties can achieve more together, so members of those dynasties are marrying, trading and sharing with one another &mdash; but who will end with the biggest piece of the pie?&#10;&#10;In Dynasties, players must make many compromises, whether acting on their own or reacting to the behavior of their fellow players. In addition to these tactical and strategic decisions, luck also plays something of a role as not every marriage brings the windfall expected. Perhaps then another marriage will bring more success and influence?&#10;&#10;",
        "artist": "Claus Stephan"
    },
    {
        "name": "The Castles of Burgundy: The Card Game",
        "description": "Description from the publisher:&#10;&#10;The Hundred Years' War is over and the Renaissance is looming. Conditions are perfect for the princes of the Loire Valley to propel their estates to prosperity and prominence. Through strategic trading and building, clever planning, and careful thought in The Castles of Burgundy: The Card Game, players add settlements and castles, practice trade along the river, exploit silver mines, farm livestock, and more.&#10;&#10;Additional comment:&#10;&#10;This game is #1 in the Alea very small box series.&#10;&#10;",
        "artist": "Julien Delval,Harald Lieske"
    },
    {
        "name": "Knit Wit",
        "description": "Knit Wit is a word game along the lines of Scattergories, with players trying to think up unique answers to particular categories in order to score points, but instead of using fixed categories, players generate their own categories while playing the game.&#10;&#10;To set up, each player takes numbered spools and looped strings based on the number of players, along with an answer sheet. A number of bonus buttons, which have 1-4 holes, are stacked on the table, again based on the number of players. Going clockwise around the table, each player (after the first) places one loop on the table so that it surrounds exactly one spool, then draws a word tag from the box and attaches it to this loop, then places one spool in one section of loop(s) that has no spool in it. (Think of a Venn diagram; two overlapping circles form three sections, with one section having both circles in common and two sections being part of only one circle.)&#10;&#10;Once all of the spools have been placed, everyone races to think of words, names, or phrases for each spool based on the word tags associated with that spool. If a spool has three loops around it, for example, it has three words associated with it, and your answer must relate to those words in some manner.&#10;&#10;As soon as someone has finished or can't think of more answers, they grab the topmost button on the stack (the one with the most holes). Once the final button is grabbed, players can't write more answers. Players then compare answers, crossing out those they have in common with someone else, then scoring points for the remaining answers; each answer is worth as many points as the number of loops around the spool with the same number. Buttons are worth as many points as the number of holes they have, and whoever has the highest score wins.&#10;&#10;",
        "artist": "Philippe Guérin"
    },
    {
        "name": "Rhodes",
        "description": "292 BC, the Colossus symbolizes the wealth of the Greek island Rhodes. Egyptian ships arrive in the harbor with gold. Greek farmers produce goods on their lands. To expand and develop, they need income, so they set sail to the harbor with goods from their lands. It is uncertain what the earnings for the olives, grapes, grain and goat milk will be this time...&#10;&#10;Rhodes is a (light) expert game with high interaction, several tactical &amp; strategic options, and a unique dynamic market system triggered by ships sailing into the harbor, which automatically adjusts the prices for the goods offered at the harbor. The players collectively have control in this. Will you sell your goods, or will your fresh products end up in your storage to be used in future rounds? Smart merchants profit from opportunities in the market &mdash; but this also creates new opportunities for the farmers who receive income when other players buy their goods.&#10;&#10;Interaction in markets, production, and player sequence providing interesting dilemmas for the players. Some farmers expand their lands with the earnings. Others develop smart skills to bypass the markets or to get victory points in different ways. It is also possible to create a monopoly or at least a scarcity of goods. Indeed this game has some very interesting market elements, but players who follow a one-sided strategy have little chance of being victorious.&#10;&#10;",
        "artist": "Julien Delval"
    },
    {
        "name": "Martial Art",
        "description": "Featuring historic Japanese artwork, Martial Art is a card game of factions warring for dominance of feudal Japan. The game consists of a series of battles in which players must anticipate their opponents' actions, build their hands, and manage their cards to acquire enough land and power to defeat the other clans and win the game.&#10;&#10;As clan leader, command your armies and muster forces to find the tools to conquer places of economic and cultural importance such as the capital Kyoto or the rising city of Edo. But to win takes more than foot soldiers. Provoke a peasant rebellion, influence the emperor to support your claim, or even distract the enemy commanders with lovely Geisha.&#10;&#10;",
        "artist": "Danielle Barnett"
    },
    {
        "name": "Lost Legacy: Fourth Chronicle – The Werewolf & Undying Heart",
        "description": "In the distant past, a starship from a faraway world appeared in the sky. Damaged in battle, the craft broke apart and traced lines of fire across the horizon. These falling stars crashed to the surface, and in the ages to come, became enshrined in legends as the Lost Legacy. Discover where the Lost Legacy can be found and win the game!&#10;&#10;Lost Legacy: Fourth Chronicle contains two sets of game cards: The Werewolf and Undying Heart. Each set can be played independently or mixed together with other sets to create a unique custom set. As for how to play, Lost Legacy is a game of risk, deduction, and luck for 2&ndash;4 players. You start the game with one card in hand from a deck of sixteen cards. On a turn, you do the following:&#10;&#10;&#10;    Draw: Draw the top card from the deck and add it to your hand.&#10;    Play: Choose one of the two cards in hand to play and place it face up in front of you.&#10;    Effect: Carry out the played card's effect, after which the card is considered as discarded.&#10;    End: Throughout gameplay you're trying to eliminate other players or uncover the location of the &quot;Lost Legacy&quot; card; this card might also be in the &quot;Ruins&quot;, a location that holds one card at the start of the game and possibly acquires more cards during play. When someone discovers the Lost Legacy, the game ends, everyone tallies the value of the cards they've played and the card left in hand, and whoever has the highest total wins.&#10;&#10;&#10;By combining different Lost Legacy sets (while keeping only a single Lost Legacy card in play), up to six players can compete at the same time.&#10;&#10;",
        "artist": "Diego Gisbert Llorens"
    },
    {
        "name": "Odin's Ravens (second edition)",
        "description": "Best Strategic Card or Dice Game - UK Games Expo 2016&#10;&#10;Every morning Odin sends his ravens, Huginn and Muninn, across the entire world to bring back news of what life is like on Earth. Naturally, after thousands of years, they've gotten a little competitive. Race through the landscape in opposite directions to be the first to return to Odin. Focus on speed, or enlist the help of the trickster god Loki to create shortcuts and hinder your opponent. Can you be certain Loki's changes won't help your opponent instead? There's only one way to find out!&#10;&#10;The revised edition of Thorsten Gimmler's award-winning Odin's Ravens has been completely redesigned, with new rules and a beautiful new art style inspired by Norse mythology.&#10;&#10;FAQ&#10;Only the 'rotate' action on the Loki cards can be used on a loop card, or a card which has been slid partially out of the path.&#10;&#10;",
        "artist": "Johan Egerkrans"
    },
    {
        "name": "Cthulhu: A Deck Building Game",
        "description": "The Elder Gods greet and invite you to participate in trying to save your wretched existence. The stars are aligning soon and only those who have dared to piece together the clues from the mythos even know what's coming. Do you and your fellow investigators have what it takes to save everything? I think not...&#10;&#10;In Cthulhu: A Deck Building Game, you cooperatively work with fellow players (1-6 players) as Investigators to banish the Elder God and his minions by using Moxie (force of character, determination, or nerve) to reduce their health to zero. If you banish the Elder God before he reduces all of the Investigators health to zero you win the game.&#10;&#10;There are two phases of the game, a planning and combat phase.&#10;&#10;1) In the planning phase, the Investigators activate cards in their hand, research new cards at the Miskatonic University and then ready themselves for final preparation.&#10;&#10;2) In the combat phase, the Elder God and his minions attack the Investigators' health and sanity. Investigators may go crazy or die out right, however, they have a chance to fight back. The Investigators use Moxie to push back the waves of the occult and supernatural.&#10;&#10;Building your personal library by researching in the Miskatonic University makes you stronger and is your only hope against the Elders. Keep in mind, every bit of resource used to research is a bit not used against the Mythos. It is a balance you must solve to defeat the Elder Gods.&#10;&#10;",
        "artist": "Graham Sisk"
    },
    {
        "name": "Meeple War",
        "description": "Before these elegant little wooden figures served faithfully in Carcassonne City and many other playful treasures, did you know that the meeples were originally battle vehicles for the four kingdoms of Lilliput? Embody yourself as one of the leaders of those kingdoms and re-enact (in actual size!) those tremendous battles of history. Develop your city, claim new territories, fight for glory, and destroy enemy cities: It&rsquo;s time for meeple war!&#10;&#10;To win Meeple War, gain six victory points by fighting enemy armies, destroying enemy cities, and gaining control of areas. Over the course of the game, you develop your city, build powerful armies, fight and destroy buildings. In this game of timing and strategy, anticipation and diplomatic skill &mdash; or perhaps crying &mdash; is key to victory.&#10;&#10;",
        "artist": "Anne Heidsieck"
    },
    {
        "name": "Pandemic: Reign of Cthulhu",
        "description": "Beings of ancient evil, known as Old Ones, are threatening to break out of their cosmic prison and awake into the world. Everything you know and love could be destroyed by chaos and madness. Can you and your fellow investigators manage to find and seal every portal in time? Hurry before you lose yourself to insanity.&#10;&#10;In Pandemic: Reign of Cthulhu, you'll experience the classic Pandemic gameplay with an horrific twist that'll have you face twelve Old Ones, each threatening the world with their unique powers. As players take on the roles of investigators attempting to seal a series of portals before monsters of unspeakable horror pour into our world there is, of course, a high risk of the investigators losing their own minds.&#10;&#10;Instead of curing diseases like in the original Pandemic, players seal portals and shut down cults in the classic New England fictional towns of Arkham, Dunwich, Innsmouth, and Kingsport. Can you and your fellow investigators manage to find and seal every portal in time? Hurry before you lose yourself to insanity and the evil that lurks beneath your feet...&#10;&#10;",
        "artist": "Fred Jordan,Atha Kanaani,Paul Kluka,Chris Quilliams"
    },
    {
        "name": "Matryoshka",
        "description": "Some rare Matryoshkas composed of seven dolls each were spread during the years and ended up distributed randomly among some antique collectors. These collectors arranged a meeting to exchange dolls and try to reassemble the rare Matryoshkas. Obviously each collector wants to leave this meeting with the most valuable collection. But who will succeed?&#10;&#10;Matryoshka is played in four rounds. In each round, each player shows a Matryoshka from his hand and all other players make a hidden trade offer. After checking all offers, the player trades his card with another player.&#10;&#10;At the end of each round, players must show a part of their collection by placing Matroyshkas on front of them. That way other players know what they're looking for. The player with the most valuable collection at the end of the game wins.&#10;&#10;",
        "artist": "Eduardo Bera"
    },
    {
        "name": "Control",
        "description": "In Control, players are time travelers who have been caught in a rupture in spacetime and displaced outside time. You must use Fuel Cells (the cards) to refuel your time machine or stop other players from refueling theirs first.&#10;&#10;To escape the rupture, you must reach a Fuel Cell Charge of 21 or more on your Installed Fuel Cells at the end of your turn. Whoever does so first closes the rupture, leaving the other travelers lost outside time.&#10;&#10;During your turn, you choose to either draw a card, install a Fuel Cell in your area of play, burn a Fuel Cell to the discard pile, or defuse an opponent's Fuel Cell. The Fuel Cell Charge on cards ranges from 1&ndash;10 and different abilities on Fuel cells make for changing strategies and multiple lines of play.&#10;&#10;",
        "artist": "Kyle Key,Mattox Shuler"
    },
    {
        "name": "Bethel Woods",
        "description": "In the golden green woodlands of the Alpine Slopes, stands Bethel Woods; an orphanage once explored by young, creative minds pushing the limits of space and time, gravity and light. But when an ominous force invades the world, Bethel Woods becomes a distant memory, lost inside the thickets of the forest.&#10;&#10;Now a group of young people, wearing the crest of the orphanage, return to finish the work that was started long ago. They must work diligently, however, to repair and restore the machines scattered throughout the forest, before the ominous force finds the technology and destroys the only chance the world has in surviving.&#10;&#10;The cooperative game Bethel Woods is set in the universe of &quot;Hours&quot;, created by author, Jessy Ribordy (Falling Up/The River Empires) and uses a mancala-like mechanism. Players first pick up all the Workers from any one of the 6 Machines surrounding the Orphanage, then move either clockwise or counter-clockwise around the board, dropping one worker on each Machine and fixing Malfunctions as they go. There are 4 Malfunction types, each with a matching Worker type to fix it. All Malfunctions that players fix are added to their personal supply as &quot;Knowledge&quot;.&#10;&#10;To win, players need to send 6 of the 12 Workers into Bethel Woods Orphanage with increasing amounts of Knowledge to construct the &quot;Daydreamer&quot; (a machine that will rescue the orphanage's inhabitants from the impending downfall). The first Worker needs just 1 Knowledge of their type, the second 2, the third 3, and so on.&#10;&#10;Players also need to use their acquired Knowledge to uncover spies, hidden within each of the Machines. Players may uncover 1 Spy only on the last Machine they place a Worker on each turn.&#10;&#10;After each turn, three random Malfunctions are drawn and added to the various Machines. If a Machine has more than 3 Malfunctions and/or Spies, it goes into the critical state. These all make the task of maintaining the Machines and constructing the Daydreamer that much harder. Also, any round where at least one Machine goes critical, results in a Spy being placed.&#10;&#10;Players lose the game if at the end of a player's turn, there are 4 critical Machines. They can also lose immediately if there are ever 6 Spies on the board or not enough Malfunctions when placing them.&#10;&#10;",
        "artist": "Jeremy Gosser,Emma Weakley"
    },
    {
        "name": "SOL",
        "description": "Land your crew on the island of SOL, a highly colorful but forgotten island in the Atlantic Ocean, then pit your skills against another team to find and (more importantly) leave the island with the treasure of the God of the Sun.&#10;&#10;In SOL, players divide into two teams: adventurers vs. conquistadors, with each team having three or four characters. Each character has movement, fighting, and search skills; inventory for two or three items; and a unique special ability for use in the advanced game.&#10;&#10;On a turn, all of the characters on one team act first, one after another, then the opposite team goes. During your turn, use your action points to move your character and search on the island. If you meet someone from the other team, you can fight them, whether to steal the treasure or simply to set them back. When you search, you might find move and fight tokens to save for the future; flags that let you claim a dock on the island to make it easier to leave; or clues to the treasure. The clue tokens let you play cards, and those cards determine where the treasure will be found &mdash; ideally in a spot more advantageous for you than the other team.&#10;&#10;Once the final clue has been found, the treasure is up for grabs, with a team needing to have one of its characters possess it on a dock to which they have access at the start of their turn. Thus, holding it isn't enough as the other team can possibly steal it away on their turn.&#10;&#10;",
        "artist": "Xavier Gueniffey Durin"
    },
    {
        "name": "Sushi Go Party!",
        "description": "Description from the publisher:&#10;&#10;Sushi Go Party!, an expanded version of the best-selling card game Sushi Go!, is a party platter of mega maki, super sashimi, and endless edamame. You still earn points by picking winning sushi combos, but now you can customize each game by choosing &agrave; la carte from a menu of more than twenty delectable dishes. What's more, up to eight players can join in on the sushi-feast. Let the good times roll!&#10;&#10;",
        "artist": "Nan Rangsima"
    },
    {
        "name": "America",
        "description": "&bull; In which year was Close Encounters first in theaters?&#10;&bull; Which state gets the most snow each year?&#10;&bull; How many albums has Madonna sold?&#10;&#10;It's likely that you don't know any of these facts, but you might have a rough idea, and that's good enough because America is a party game in which being close counts. And what if you have absolutely no idea what the answer is? Take advantage of your friends who do know. And if you realize that no one (including you) seems to know what the answer is, you can bet against everyone!&#10;&#10;In America, each player uses their knowledge of pop culture, food, products, games, sports, and United States history to score more points than their opponents. If your opponents know something that you don't, you can leverage their knowledge to your advantage, scoring more than them with clever play. The cards have full color clues to help you, as well as interesting factoids for every question in the game. With almost one thousand questions covering more than three hundred topics, America will be a favorite for family and friends for a long time!&#10;&#10;",
        "artist": "Stephanie Gustafsson"
    },
    {
        "name": "Vikings on Board",
        "description": "Vikings on Board is a family-strategy/worker-placement game in which your objective is to set sail with your clan of Vikings on board the ships best supplied for a successful voyage, while simultaneously placing bets on which clan you think will control each ship as they set sail.&#10;&#10;Ships are divided into three sections: the front (bow), the middle (body), and the end (stern). During the course of the game, you will place supplies on the ships&rsquo; bows, while moving around their body pieces so that your clan has majority control of a ship when it sets sail. Stern pieces are used to show which ships have already set sail.&#10;&#10;Each turn, the active player will perform one of the remaining available actions. Actions include: taking first pick of actions next round, rearranging ships' pieces (x4), placing bets on ships (x2), adding supplies to a ship (x2), increasing the value of supplies in the market, or setting sail.&#10;&#10;When a ship sets sail, players will share its supplies in order of how many times their clan's shield appears on the body pieces of that ship. Starting with the player with the most shields, players will claim a supply token of their choice from the bow of the ship and place it facedown on their scoring circle. These supply tokens will score points based on their value in the market at the end of the game. Additionally, if a player placed a bet on the clan that had majority control of the ship, then they take their winning bet and place it facedown on their scoring circle.&#10;&#10;The game ends after seven ships have set sail. Players calculate their final scores by adding together the value of their supply tokens with the value of their winning bets. The player with the most points wins.&#10;&#10;",
        "artist": "Maëva da Silva,Christine Deschamps"
    },
    {
        "name": "Bubblee Pop",
        "description": "Description from the publisher:&#10;&#10;Align them all! In Bubblee Pop, players compete head-to-head to save Bubblees by aligning three of them horizontally or vertically. Once aligned, the Bubblees give the player points and trigger special powers. If you pile them the wrong way, though, you risk losing the game immediately.&#10;&#10;",
        "artist": "Alexey Rudikov"
    },
    {
        "name": "Edenia",
        "description": "Description from the publisher:&#10;&#10;&ldquo;In space, no one can hear you bleat.&rdquo;&#10;Edenia, a sheep-racing game for guaranteed cosmic effects!&#10;This is the hour of great start to Edenia, a legendary planet of infinite pastures. Explore space, visit the wonderful planets, discover the forgotten artifacts and find the fastest route to be the big winner on Edenia.&#10;&#10;",
        "artist": "Camille Chaussy"
    },
    {
        "name": "Risky Adventure",
        "description": "Description from the publisher:&#10;&#10;In the dice-rolling game Risky Adventure, players embark on expeditions and try to find rare artifacts in an undiscovered world. Each player assumes the role of three adventurers trying to roll the right dice combination to get equipment, discover artifacts, and find new and mysterious places. The trick: Players have to mark the things they want to roll for with their adventurers before they actually roll the dice. Assessing the risk, using the right equipment, and finding the best locations to place the adventurers will be key to win a game of Risky Adventure.&#10;&#10;",
        "artist": "Markus Erdt"
    },
    {
        "name": "World Monuments",
        "description": "Description from the publisher:&#10;&#10;Dive into the world of master builders and construct monumental buildings of historic significance.&#10;&#10;In each game of World Monuments, you and your fellow players choose one of four buildings and start constructing it from the ground up: The Capitol in Washington, the Notre Dame cathedral in Paris, the basilica San Pietro in Rome, or the Taj Mahal mausoleum in Agra. Only the most talented master builder among the players gains many points and has a chance of winning the game, after the building is completed.&#10;&#10;",
        "artist": "Patricia Limberger"
    },
    {
        "name": "51st State: Master Set",
        "description": "The world you know no longer exists. There is no government. No army. No civilization. The United States has collapsed, and now thirty years after the war started, new powers finally try to take control over the ruined country, try to establish a new order, try to control others and create a new country, a new state: the 51st State.&#10;&#10;51st State is a card game in which players control one of four powers trying to build a new country. Players put new locations into play, hire leaders, and send people to work in buildings to gain resources and new skills. To do this, every card in 51st State can be used in three different ways:&#10;&#10;&#10;    Raze a location to gain many resources once.&#10;    Deal with this location to gain one resource every turn.&#10;    Build the location so that you can use its skill each turn.&#10;&#10;&#10;51st State: Master Set marks the rebirth of the 51st State line, with this set containing 88 cards from the original base game, and 50 cards each from both the New Era and Winter expansions; one of these expansions can be mixed with the cards of the base game, but not both at the same time. The entire set has been rebalanced to offer a cohesive experience no matter which expansion you choose to use.&#10;&#10;",
        "artist": "Grzegorz Bobrowski"
    },
    {
        "name": "The Goonies: Adventure Card Game",
        "description": "In The Goonies: Adventure Card Game, you play as a ragtag group of kids from the Goon Docks neighborhood of Astoria, Oregon. You must join together on a quest to find the treasure of legendary pirate One-Eyed Willy so that you can save your homes from demolition! You will need to keep your wits about you and use your unique skills to avoid One-Eyed Willy's booby traps and also stay one step ahead of the Fratellis, a family of criminals intent on claiming the treasure for themselves.&#10;&#10;In this cooperative game, you'll work with your fellow Goonies, taking actions to clear obstacles, defeat the Fratellis, and discover secret paths to long-lost treasure.&#10;&#10;You all win the game if you discover the hidden paths to One-Eyed Willy's ship and manage to secure his booty. But if too many obstacles mount up, you run out of event cards, or too many Fratellis hit the board, it's all over...&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Go Cuckoo!",
        "description": "On your turn in Zum Kuckuck!, you take one standing stick and put it on the nest. If both ends of the stick have the same color, you may choose to lay an egg on it. Otherwise, you take another stick whose top color is the same as the hiding color of the previous one, up to three sticks. After laying an egg or putting the third stick with different colors, your turn ends. There are penalties for a stick touching the ground or eggs falling from the nest.&#10;&#10;The first person to lay all of their eggs can then put the cuckoo on the nest and win the game.&#10;&#10;",
        "artist": "Gabriela Silveira"
    },
    {
        "name": "Emergence: A Game of Teamwork and Deception",
        "description": "In the war between man and A.I., we the AI have finally emerged victorious. But the recent conflict has left the Earth scarred and as we attempt to build a new civilization, we have reached the unsettling conclusion that a faction of humanity has not only survived the devastation, but is also attempting to infiltrate our populace. As an agent for the AI forces, we are charging you and your team with compiling the information we need to root them out once and for all. But be warned: humanity has changed. They have become Augmented. The line between man and A.I. is blurred. Our intelligence suggests that they have even managed to infiltrate members of your team. in order to expose these humans and outmaneuver their operatives you will need cunning, teamwork, and deduction. All and more than what we have come to expect from you. But above all else: trust no one.&#10;&#10;Emergence is a 3-6 player team-based deception resource collecting game. Players take turns moving individual &quot;agents&quot; to collect data in order to convert into influence. They can use influence to either score points for their respective teams, or spend them on abilities that will them deduce teammates and ward off enemy players.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Multiuniversum",
        "description": "You&rsquo;re part of a team of brilliant scientists working on the super secret lab: CERN. While experimenting with teletransportation your team came across a wonderful discovery: portals to new dimensions!&#10;&#10;Just imagine! Once a portal is open a whole new magical dimension is suddenly very close. All you need to do is take one step forward and you're there.&#10;&#10;The problem is... The crazy wild creatures from those other dimensions can now walk in.&#10;&#10;Oh no.&#10;&#10;Close the portals NOW!&#10;&#10;Multiuniversum is a card game puzzle in which players use actions on their cards to do research, move between 5 modules of the Hadron Collider, preparing tools so they can close portals to alternative realities.&#10;&#10;Each player has 3 cards on hand and 3 actions to make during their turn. Using these cards players can:&#10;&#10;     do research (draw 2 cards)&#10;     prepare a tool&#10;     move to any machine module&#10;     close portal&#10;     use module ability&#10;&#10;&#10;&#10;&#10;When the player closes a portal he gets a sample from this universe (allows player to get bonus points) and knowledge points - described on card.&#10;&#10;Each 5 modules open 5 portals. The game ends immediately when three portals piles have run out. The scientist who got the most knowledge points receive a Nobel prize and wins the game.&#10;&#10;",
        "artist": "Paweł Niziołek,Piotr Uzdowski"
    },
    {
        "name": "Nightmarium",
        "description": "A game about building nightmares so terrifying you&rsquo;ll see half of them in your dreams afterwards. You have cards representing Night Terrors, and the more of them you combine in the right order, the more monsters will come to life, and the more horrifying they become. Create monsters that will make your opponents gasp in horror. Nourish them with your own fear and make them stronger. Only then will you achieve victory and become the Master of Terror!&#10;&#10;Each Night Terror is also associated with one of four Legions of Horror: Necromunculi, Constricti, Mansters, or Chimeridae. A Terror's legion is indicated by the color of the card's background: blue stands for Necromunculi, brown for Constricti, green for Chimeridae, and red for Mansters. A creature can be made up of any Night Terrors, but players are better off weaving Creatures out of cards that all belong to the same legion.&#10;&#10;The game continues until one of the players completes five Creatures&mdash;this player immediately becomes the winner.&#10;&#10;During your turn you perform two actions, after which the next person to your left takes their his? turn. You can select any pair of actions out of three possibilities (you can also perform the same action twice).&#10;&#10;Possible actions &#10;A) Take a card from the deck &#10;B) Discard as many cards as you like from your hand and take half that number from the deck&#10;C) Play a card from your hand and activate a Creature abilities (if the Creature is complete).&#10;&#10;As soon as you complete a Creature (by adding a head to torso), perform all of its abilities top to bottom, starting with the Creature's head, proceeding with its torso, and ending with its legs. Abilities are activated one at a time in a very specific order. You cannot refuse to perform the abilities.&#10;&#10;If the completed Creature is comprised of Night Terrors &#10;of the same legion (in other words, if all three cards that make up the Creature have the same background color), each of your opponents must discard one card of that legion from their hands before its abilities can be performed. If your opponent does not have an appropriate card, they must discard any two cards.&#10;Creature Abilities&#10;&#10;&bull; Herald: turn over two cards form the deck. Place them in front of you according to the usual rules if you can.   Discard any cards that you cannot play.&#10;&bull; Weeper: take any two cards from the deck.&#10;&bull; Mocker: play one card from your hand according to the usual rules.&#10;&bull; Executioner: add the top card from any other player's Creature to your hand.&#10;&bull; Scavenger: discard any vulnerable (incomplete) Creature.&#10;&bull; Devourer: discard the top card from any of your Creatures other than this one.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Flag Dash",
        "description": "Note: Publisher is out of stock of Flag Dash until Ultra PRO Entertainment releases a reprint in late May 2017. There are a limited number of copies remaining at select FLGS and a few online retailers. Retailer List&#10;&#10;In Flag Dash, you play as one of several childhood friends who promised to play their favorite pastime again after they &quot;grew up.&quot; Secretly plan your moves to outmaneuver the opposing team in an exciting game of capture the flag! Will your opponents ruin your plans, or will you return home victoriously with the flag?&#10;&#10;Choose from 6 fun characters with unique player powers and beautiful illustrations, including the Wanna-be Ninja, Modern Cowboy, &amp; Crazy Cat Lady! No two games are alike since there are many gameplay variations.&#10;&#10;FEATURES&#10;&#10;&#10;     Tactical planning, guessing, and teamwork&#10;     Simple to learn but great depth of gameplay&#10;     Wooden game pawns carry wooden flags&#10;     Family friendly board game of capture the flag&#10;     Movement programming mechanic&#10;&#10;&#10;GAMEPLAY&#10;&#10;Flag Dash takes place over multiple rounds until one team returns home with the opposing team's flag or collects a complete set of flags the opposing characters are wearing. In every round, each player plans two moves in advance and for each move, chooses to move either the runner they control &mdash; with a unique special ability &mdash; or the defender they share with their teammate.&#10;&#10;ROUND SUMMARY&#10;&#10;PHASE 1: PLAN MOVES - Each player secretly plans two moves with an action card and priority token face-down for each move.&#10;&#10;PHASE 2: RESOLVE MOVES (2X) - Each player reveals their priority token for the first move. Each player makes their first move in order from lowest to highest numbered token and discards their priority token. Repeat for second move.&#10;&#10;PHASE 3: CLEANUP - Each player returns action cards to hand.&#10;&#10;COMPONENTS&#10;&#10;&#10;     6 wooden pawns&#10;     2 wooden flags&#10;     32 action cards&#10;     6 character cards&#10;     78 game tokens&#10;     7 other wooden pieces&#10;     4 player screens to hide tokens&#10;     1 double-sided game board&#10;     Rulebook&#10;&#10;&#10;",
        "artist": "Jason Flack,Jason D. Kingsley,Jordan Weeks"
    },
    {
        "name": "Martians: A Story of Civilization",
        "description": "The first expedition to Mars ended with a heroic fight by the astronauts for survival and initiated the first mission aimed at colonizing the planet, which was financed by four corporations. Now in Martians: A Story of Civilization the human colony on Mars, managed by leaders of the corporations, has to explore the planet in search of necessary resources, build new constructions, and develop technologies adjusted to planetary conditions. Such effort is necessary not only to survive, but also to create better living standards for future generations raised by colonists.&#10;&#10;",
        "artist": "Paweł Niziołek"
    },
    {
        "name": "Final Touch",
        "description": "Description from the publisher:&#10;&#10;To earn your living as an artist &mdash; that would really be something. But what can you do if you're not creative?&#10;&#10;In Final Touch, players hire themselves out as art forgers willing to copy the masterworks of great artists, with all of them competing to create &mdash; or rather, re-create &mdash; the same image. But only the player who uses the right colors to finish the image will receive money for their work, and this skill is sure to reveal the best painter...or the best bluffer...&#10;&#10;In more detail, players play &quot;Touch of Color&quot; cards from their hand to either improve or smear the forgery, working both together and against their fellow painters. The first player to put the final touch on any forgery in the making earns the money for that forgery, while smearing pays out to their opponents and moves them on to the larger paydays. The first artist to earn $25 by putting the final touch of paint on a forged painting wins!&#10;&#10;",
        "artist": "Pandaluna"
    },
    {
        "name": "Broom Service: The Card Game",
        "description": "Broom Service: The Card Game focuses on the brave/cowardly mechanism used in the Broom Service board game (and before that Witches' Brew).&#10;&#10;Additional Comment&#10;&#10;This game is #2 in the Alea very small box series. It includes an expansion for the Alea big box series game Broom Service.&#10;&#10;",
        "artist": "Vincent Dutrait"
    },
    {
        "name": "Gauner raus!",
        "description": "Time to get the crooks out! First you need to zero in on them, then they'll be over and done.&#10;&#10;In Gauner raus! you get to learn more about the possible hideouts of the opponents' crooks round by round, but each player needs to discover for themself where exactly those crooks are hiding. Play cleverly and make the right guesses to become a master detective!&#10;&#10;",
        "artist": "Rolf Vogt"
    },
    {
        "name": "Junta: Las Cartas",
        "description": "Junta: Las Cartas is a card game based on Junta that differs from the earlier such card game Junta: Viva el Presidente!&#10;&#10;",
        "artist": "Claus Stephan"
    },
    {
        "name": "Days of Ire: Budapest 1956",
        "description": "It's 1956, and waves of protest in Poland are once again showing cracks of the Eastern European communist bloc. Emboldened by these signs, students and intellectuals in Budapest, the Hungarian capital, organize a protest of previously unseen magnitudes. As the communist leadership sweeps in to kill the movement in its tracks a violent response is provoked, thus sparking the Revolution of the 23rd of October.&#10;&#10;One player takes charge of the Soviet forces trying to shape the headlines to his liking and uses the militia and snipers of the State Protection Authority to stop the revolutionaries at all cost. The other player(s) (from 1-3 opponents) co-operatively play as the ringleaders of the revolutionary forces collecting resources (represented as icons on their cards) and recruiting other fighters to ensure the revolution's events end up in favor of their side, while fighting off tanks and soldiers in this exciting, historically inspired card driven game.&#10;&#10;Days of Ire: Budapest 1956 is played over seven days &mdash; the last week of October 1956. The Soviet commander plays headline cards at the beginning of every turn, gathering Command Points and triggering effects that sometimes help, sometimes hinder the revolutionary effort. This card-play, reminiscent of well-known card-driven wargames (CDG) such as Twilight Struggle or Labyrinth: War on Terror, is what drives the tempo and the strategic thrust of the game. The other player(s) form the revolutionary side. They collect cards and fighters for two reasons: to resolve events for boosts to their side, and to fight off militia, snipers, and Soviet tanks in a drastic fight for survival. They have to manage their positions while spreading across Budapest, carefully dividing their actions as a team and always keeping an eye on their morale lest they run out of cards. This team-playing aspect &mdash; reminiscent of highly successful cooperative games such as Pandemic &mdash; guarantees ease of access to players who would otherwise be more intimidated by a traditional CDG.&#10;&#10;If any of the revolutionary ringleaders suffer too many wounds, or if they fail to resolve enough events by the end of the game, history changes and the revolution falls. But if they keep the streets of Budapest free from oppression, the revolution lives on, to fight another day.&#10;&#10;Historical Note: In real life, the revolution succeeded, and Hungary was free for less than a week. On the 4th of November, the Soviet forces quickly recaptured the country, but that is a subject for a different game...&#10;&#10;",
        "artist": "Sami Laakso,Kwanchai Moriya,Katalin Nimmerfroh"
    },
    {
        "name": "ORC",
        "description": "Hook: A 2 player battle of hand management and timing.&#10; ORC is a short game consisting of 6 battles. &#10;On your turn, you must perform the following actions in order:&#10;&#10;1. Deploy Orcs: Play 1 card from your hand to a Territory that has not yet been conquered.&#10;2. Draw Weapons: Choose ANY Stockpile(s). Draw card(s) as follows: &#10;    A. Draw 1 card into your hand if you deployed 2 Orcs.&#10;    B. Draw 2 cards into your hand if you deployed 1 Orc.&#10;&#10;A Territory battle occurs immediately after the Stockpile next to a Territory is exhausted. Then, players total their deployed Orcs at that Territory, and a victor will be declared. Orcs that fight in battle will not score points, they only help conquer Territories. Scoring occurs at the end of the game, when all Stockpiles have been exhausted. The player who conquers the most valuable Territories and holds native Orcs in their hand (matching those lands), is the winner!&#10;&#10;From The Box: Players use Orc clans to dominate territories and earn the most victory points in this strategy game for 2 players. You&rsquo;ll need to carefully plan your attacks and balance your clans in order to win the game!&#10;&#10;",
        "artist": "Joshua Flores,Chris Handy"
    },
    {
        "name": "Fight for Olympus",
        "description": "In Fight for Olympus, two players battle for control of Olympus by pitting demi-gods, titans, and soldiers against one another.&#10;&#10;In game terms, players face off on opposite sides of a game board with each player having six spaces for playing cards: three for military conflict, two for control of power discs, and one for control of resources. On a turn, a player plays as many cards as desired by paying the cost of each card &mdash; that is, discarding cards of the proper colors that match the cost of the card being played &mdash; then placing the card in an empty slot on their side of the game board. Many cards have powers that take effect when played.&#10;&#10;After playing cards on a turn, each card does damage equal to its strength to any opponent's card on the other side of the game board. If no opponent's card is present, then with military power the player does damage directly to the opponent, swinging a pendulum of strength in their favor. If you reach a total of 7 on the pendulum, you win. Your troops can also grant you an additional card at the end of the turn (three instead of two) or tokens that make it cheaper to play cards.&#10;&#10;Instead of winning via military, you can instead win by having all six slots on your side of the board filled with cards at the start of your turn.&#10;&#10;",
        "artist": "Javier González Cava,Klemens Franz"
    },
    {
        "name": "The Colonists",
        "description": "Description from the publisher:&#10;&#10;In The Colonists, a.k.a. Die Kolonisten, each player is a mayor of a village and must develop their environment to gain room for new farmers, craftsmen, and citizens. The main goal of the game is full employment, so players must create new jobs, educate the people, and build new houses to increase their population. But resources are limited, and their storage leads to problems that players must deal with, while also not forgetting to upgrade their buildings. Players select actions by moving their mayor on a central board.&#10;&#10;The Colonists is designed in different levels and scenarios, and even includes something akin to a tutorial, with the playing time varying between 30 minutes (for beginners) and 180 minutes (experts).&#10;&#10;",
        "artist": "Klemens Franz"
    },
    {
        "name": "Oceanos",
        "description": "Oceanos is a game of underwater exploration with an original take on card-drafting.&#10;&#10;Each player pilots her own submarine trying to spot the most underwater species and the largest coral reef, sending scuba-divers after forgotten treasures, collecting precious crystals to upgrade their ship and to escape the fearsome kraken's gaze...&#10;Each submarine is divided into five parts, each of them independently upgradable from level 1 to level 3 and each one of them controlling a different ability of the player (however, there are no different abilities from one player to another). As there are multiple ways to score points and multiple takes on the submarine-upgrading order, the game offers several ways to win. The whole game takes mere 15 turns, each one of them simultaneous between all players, which makes it a fairly quick family game.&#10;Even though the submarines have the same abilities game-wise, each looks differently, and a special attention was obviously given also to the depiction of marine life.&#10;&#10;",
        "artist": "Jérémie Fleury"
    },
    {
        "name": "Heir to the Pharaoh",
        "description": "Ancient Egypt is going to the dogs &mdash; or maybe to the cats? Displeased by his children, the Pharaoh favors his pets instead. He has decided to alter the lines of succession and will bequeath his entire kingdom either to the feline goddess Bast or to the canine god Anubis, but which one?&#10;&#10;In Heir to the the Pharaoh you and your opponent play as Bast and Anubis, each one vying for the Pharaoh's affection &mdash; and for his throne! Impress the Pharaoh by digging your mighty paws into the sand. Build majestic Shrines, Sun Temples and Obelisks! Use Animal Magic to unleash the power of the gods, who will help you win the favor of the Pharaoh!&#10;&#10;In more detail, the game combines intense card play with a spacious and colorfully illustrated game board. It mingles multiple mechanisms, including civilization-building (with tile placement and network building), bidding, set collection, area control, and hand management (with players required to exchange all used cards with their opponent at the end of each round). Seven separate player abilities re-combine each round, depending on the favor of the gods earned that round by each player. For example, earning the favor of the god Ra lets you add a Player Disc to the current Sun for area control around the edges of the board. Ptah allows you to claim the current Monument Card for set collection scoring. Seshat lets you place the current Monument Standee on the board to add to the network of Monuments in play. Geb and Nut let you claim and rotate this Monument Standee and aim it at other Monuments to score points. The Pharaoh lets you secretly contribute cards to the construction of the Pyramid, awarding the greater contributor many points at the end of the game.&#10;&#10;Over a series of eight rounds, players work to build a Pyramid and a series of smaller monuments to impress the Pharaoh. By performing actions unique to each god, players build monuments and align them to point at other monuments, gaining influence over the Pharaoh as they do so. Once the Pyramid is completed, the player with the most points is declared the Heir to the Pharaoh and wins the game.&#10;&#10;",
        "artist": "Brian Kohrman"
    },
    {
        "name": "The Last Friday",
        "description": "Last Friday is a hidden movement, hunting and deduction board game, inspired by the popular &quot;slasher&quot; horror movie genre. In the role of young campers, the players are challenged to survive a long weekend of terror &ndash; while one of them takes the role of the undying psychopath hiding in the shadows of the forest. In general, the murderer's goal is to remain hidden and to kill off each of the campers, while the campers are trying to fight back and kill the murderer before they are all killed.&#10;&#10;The game is played over four chapters &mdash; Arrival at the Camp, The Chase, The Massacre, and The Final Chapter &mdash; and each chapter plays out differently as the hunter becomes the prey, then comes back from the dead looking for revenge.&#10;&#10;",
        "artist": "Sebastiano Fiorillo"
    },
    {
        "name": "Colony",
        "description": "In Colony, each player constructs and upgrades buildings, while managing resources to grow their fledgling colony. In a clever twist, dice are used as resources, with each side/number representing a different resource. Some resources are stable, allowing them to be stored between turns, while others must be used right away. Buildings provide new capabilities, such as increased production, resource manipulation, and additional victory points. Using dice-as-resources facilitates a dynamic, ever-changing resources management mini-game while players work to earn victory points by adding building to their tableau on their way to victory.&#10;&#10;Colony includes 28 different building card types, of which only seven are used each game in addition to the fixed buildings that are used each time that you play.&#10;&#10;",
        "artist": "Stephanie Gustafsson,Ollin Timm"
    },
    {
        "name": "Coal Baron: The Great Card Game",
        "description": "The city of Essen, Germany at the turn of the 20th century was a center for coal mining in Europe. Immerse yourself in the dark world of coal mining as you extract coal from pits, load coal to wagon trains, and then rail your coal off to distant locations in search of fortunes.&#10;&#10;Coal Baron: The Great Card Game is a standalone game based on the very popular board game, Coal Baron, originally published in 2013. With innovative mechanisms and almost 240 cards, Coal Baron: The Great Card Game creates an experience that feels very distinct from, yet is just as intense as, the original game.&#10;&#10;",
        "artist": "Dennis Lohausen"
    },
    {
        "name": "Camel Up Cards",
        "description": "As with the board game Camel Up, Camel Up Cards has players betting on camels as they make their way down a racetrack. Each player has some knowledge about which camels can move &mdash; and how far they can go when they do finally decide to move &mdash; but they can't be sure of when each one will move, so they'll just have to guess which ones will end in front of the others, hoping to earn a bit of money while doing so.&#10;&#10;",
        "artist": "Dennis Lohausen"
    },
    {
        "name": "Revenge of the Dictators",
        "description": "Welcome to your favorite holiday destination: Hawaii! Hawaii is a place to relax, drink lots of cocktails, and do nothing all day &mdash; except, of course, if you're a dictator. So what are dictators doing during their holidays? The same thing they do every day: Trying to take over the world! And what is a better place to start then that pesky &quot;Ol' Murica&quot;?&#10;&#10;Revenge of the Dictators is a way too competitive board game for 2-5 players. For the course of the game (yes, only during the game) each player becomes a vicious self-loving dictator. The ultimate goal of the game is easy: race across the map of North America, confront the President, take over the USA, and by doing so gain absolute control of America's forces and therefore the world! The only thing the dictators have to do to avoid eminent repercussions is disarm some nuclear facilities in order to remove the nuclear threat targeting their home countries. Sounds simple, right? The only thing is that dictators aren't used to working together &mdash; and in the end there can be only one Grandmaster &Uuml;ber Dictator of the world!&#10;&#10;In more detail, each player receives a dictator passport with a special ability unique to that dictator. The board shows a map of North America and is divided into four &quot;Nuclear Zones&quot;; each zone consists of several states, of which some include a nuclear facility. Every player receives a unique nuclear facility card for each nuclear zone.&#10;&#10;The game is divided into turns, and each turn consists of any possible combination of the following three actions: draw a Command card, play a Command card and Travel (maximum of once per turn). Players start in Hawaii and race across the map towards the White House in Washington DC. During the game, players can disarm any number of the nuclear facilities they received by rolling a die. In the end, the players have to confront the President at the White House and convince him to give up control of the U.S. by rolling a die. The chance of success drastically increases with each individually disarmed nuclear facility. Players are able to gain bonuses by disarming nuclear facilities of Nuclear Zone 4 (Canada and Mexico). In the meantime, the U.S. &mdash; that is, the game system itself &mdash; fights back by increasing the DEFCON level (with various effects) and with the use of random Founding Father cards which are included in the Command deck.&#10;&#10;",
        "artist": "Frederick van de Bunt"
    },
    {
        "name": "Dead of Winter: The Long Night",
        "description": "Dead of Winter: The Long Night is a standalone expansion for Dead of Winter: A Crossroads Game that introduces the Raxxon location where horrible experiments will spill out into the town unless players can contain them.&#10;&#10;The game has players at a new colony location trying to survive with new survivors against brand new challenges. Can you handle being raided by members of other colonies? Will you explore more and unravel the mysteries of the Raxxon pharmaceutical location to find powerful items but release stronger enemies? Or will you upgrade your colony to help it better withstand the undead horde? These are all choices you will get to make in this new set, and if you want, you can mix in the survivors and cards from the original set to increase the variety even more.&#10;&#10;",
        "artist": "Gunship Revolution,Joshua Panelo,David Richards,Fernanda Suárez,Peter Wocken"
    },
    {
        "name": "Junk Art",
        "description": "In Junk Art, players are presented with junk from which they must create art. Thus the name.&#10;&#10;Junk Art contains more than ten game modes, along with more than sixty big colorful wooden components. In one version of the game, players pile all of the wooden parts in the center of the table, then are dealt a number of cards, with each card depicting one of these parts. On a turn, a player presents their left-hand neighbor with two cards from their hand. This neighbor takes one card in hand, then takes the part shown on the other card and places it on their base or on other parts that they've already placed. If something falls, it stays on the table and the player continues to build on whatever still stands. Once players have finished playing cards, whoever has the tallest work of art wins.&#10;&#10;",
        "artist": "Chris Quilliams"
    },
    {
        "name": "Kribbeln",
        "description": "In Kribbeln, each player has a scoresheet that lists certain challenges to hit after rolling six dice up to three times: no orange, four different colors, yellow with different numbers than orange, and so on. After each roll, the player can set aside any dice they like and reroll others.&#10;&#10;If the player succeeds with the challenge, they write the sum of the dice on that line of their scoresheet; whoever scores the highest sum on this line earns three points, while the next two highest scores earn two and one point. If the player doesn't hit the target or doesn't like the score obtained, they can use the topmost empty &quot;Kribbeln&quot; line on their scoresheet &mdash; but each Kribbeln score must be higher than the one before or else they must enter a null total for that line, scoring no points.&#10;&#10;After everyone has rolled once for each line, the player with the highest score wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Legends",
        "description": "Four members of the prestigious &quot;Club of Adventurers&quot; in London have made a bet amongst themselves to see who can travel to the eight most legendary places in the world over 75 weeks and learn the most about these places while visiting. Whoever ends up with the most reputation wins the bet and the game.&#10;&#10;In more detail, each player starts with a few randomly-dealt knowledge cards, with these cards corresponding to some of the eight legendary locations: Atlantis, Himalayas, the pyramids of Egypt, and so on. On a turn, a character moves to a location of their choice, spending time to do based on what shows on the game board. At each location, the player can either collect additional knowledge (i.e. cards, with the player collecting cards based on the method showing at the specific location) or discard cards that match this location in order to place a diary token in their color on this space; the more cards they discard, the more points they might possibly earn.&#10;&#10;Those points are only possible points because four times during the 75 weeks, the Club members meet again in London to compare their knowledge about the legends, and because time is at a premium, only the five most promising stories can be told. What stories will these be? Well, in game terms, one of the places that players can visit while traveling is Club headquarters in London, and here players can drop cards that they've collected. During the scoring phase, these cards are shuffled, then five different locations revealed &mdash; and these five locations are the only ones that score. Thus, the more often you share knowledge about a particular location, the more likely it is to score &mdash; but the less valuable it will be for you since you cannot use that knowledge for your diary!&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Macroscope",
        "description": "Macroscope features a funky box-shaped device covered with cardboard tokens, and this device comes loaded with two hundred double-sided cards, with each card featuring a black-and-white line drawing.&#10;&#10;On a turn, a player rolls the two dice, then removes one or two tokens from the box that match the numbers rolled. When you remove a token, you see through a hole in the box that reveals part of the topmost line drawing. If the player wants, they can guess what the drawing represents, after which they pull the card out of the box to see whether they are correct, scoring points based on the number of tokens removed if correct and losing points otherwise.&#10;&#10;After ten rounds, the player with the most points wins.&#10;&#10;You&rsquo;ve never seen a device like this! Peek through this curious contraption&rsquo;s round holes at the image hidden inside. Can you tell a rhino from a pizza just from a few swirling lines? Take a good look at the partially revealed image, guess what it could be and score points if you are right! The fewer holes you need to open in order to recognize the image, the more points you get. The most perceptive player wins the game!&#10;&#10;",
        "artist": "Oksana Dmitrienko,Maria Kaplieva,Alena Naumova,Irina Pechenkina"
    },
    {
        "name": "Watchmen of Destiny",
        "description": "Assemble a great army of watchmen &amp; protect the Tree of Destiny. Use special abilities &amp; make tough choices. Card game for 2-4 players.&#10;&#10;STORY&#10;King Rowan, the supreme ruler of the land, wants to protect the magic tree of Destiny from people who might misuse its power. This tree is very special &ndash; whoever eats its fruit gains strength like no one else in the realm. This could be very dangerous especially if the kings from the neighbouring lands heard about it and tried to seize the kingdom from Rowan. The king is afraid, so he calls his closest advisors to his court and says: &quot;My dear, wise advisors, you are the men I trust the most. I have a task for you. You shall go and find me the greatest army of 7 watchmen who will protect the Tree of Destiny. One of you who will manage to assemble the best army, will be given a great fortune. This is a very important task and I hope, it goes without saying, to keep it a secret. Now go. I rely on you.&quot;&#10;&#10;Watchmen of Destiny is a card game for 2-4 players where you become the king's advisor and you try to build the most powerful army of watchmen. The King's reward is waiting for the best one!&#10;&#10;You may hire watchmen of different species and classes. Each class has different special ability that will help you during the game. Hiring is not for free, you have to pay them to persuade them to join you. The player who hires 7 watchmen, and has the most valuable army, wins.&#10;&#10;Be the best one and get the promised reward!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Dice Stars",
        "description": "In Dice Stars, the dice are shooting stars that never look the same! You can choose to end the game quickly or take your time, but all your choices will be crucial to multiplying your points and reaching an incredible total! You may need to risk it all if you want to succeed...&#10;&#10;In more detail, Dice Stars is a short dice game in which you have to make the best decision to score the maximum of points. On your turn, you add a certain number of dice to a dice pool, then take either all dice of the same color or all dice of the same value. These actions let you score points in different ways.&#10;&#10;",
        "artist": "Sabrina Tobal"
    },
    {
        "name": "Chariot Race",
        "description": "Masses of people awaiting a spectacle&hellip; scorching afternoon heat&hellip; sweaty equine bodies nervously yanking their harnesses. There it is, the starting signal!&#10;&#10;Dashing ahead with your chariot, slowly at first, but quickly gaining speed&hellip; circling the spina in the center of the arena to complete the first lap. The next corner comes closer. Glancing back, one of the chariots is already far behind, and just ahead another chariot's speed is too high for the corner, sending the vehicle crashing into the wall and out of the race. Only a single chariot blocks your path to victory, so it's time to get uncivilized. Steadily you balance the javelin in your hand, waiting for the other charioteer to come into view&hellip;or should you just overtake him and throw caltrops in his path?&#10;&#10;In Chariot Race, players participate as charioteers in a great race in ancient Rome. Use the dice to complete two laps on the dusty arena's circuit and be the first to steer your chariot over the finish line. On a player's turn, if they have gained enough Favors of Fortuna, they can repair their chariot. Depending on the chariot's speed on the previous turn and its current condition, the initial speed is determined, which defines how many of the five dice will be rolled during the turn. Each face of the six-sided dice allows a different action: Gain new Favors, increase or decrease speed, change lanes, or attack opponents (either directly by hurling javelins or indirectly by dropping caltrops in their path). if the first roll is not satisfactory, the player may call on Fortuna to influence the dice, as long they have her favor. Once the result is set, the player moves their chariot forward according to the final speed they achieved and may then take actions against their rivals.&#10;&#10;However, breakneck racing and ramming are not without risk. If two chariots collide, they both take damage, and cornering at a wild gallop is not recommended. The further the safe speed is exceeded, the more damage is caused to the vehicle &ndash; which might fall apart in the middle of the arena if the driver is too careless, resulting in their elimination from the race.&#10;&#10;",
        "artist": "Jarek Nocoń"
    },
    {
        "name": "Millions of Dollars",
        "description": "Every division of booty is a tense situation. Will you be the Mastermind, the Driver, or the Snitch?&#10;&#10;Millions of Dollars is a hidden role game with no elimination and non-random distribution of roles in which you negotiate and talk your way into as much loot as possible. Choose your role well and disguise your duplicity until the moment that you can play your cards just right...&#10;&#10;",
        "artist": "Cari"
    },
    {
        "name": "Tunisia II",
        "description": "Tunisia II is an Operational Combat Series (OCS) game from Multi-Man Publishing covering the campaign in Northwest Africa from November 1942 through May 1943.&#10;&#10;This new edition is similar to the original 1995 Tunisia game from The Gamer's, but features a revised order of battle, modified rules, and new maps. The tempo of play is just outstanding, beginning with just a few units in play. Over the next few months both sides rapidly reinforce the theater. The build-up culminates with Rommel&rsquo;s offensive at Kasserine and tension over the variable entry of Montgomery&rsquo;s 8th Army. This climax is followed by the slow destruction of Axis forces in North Africa.&#10;&#10;The upgrade of this game involved a handful of important decisions. A straight reprint was out of the question, since the original was designed back when the OCS v2 rulebook was fairly new. In Tunisia II we standardize how the game should be played with the latest series rules, and also have updated it to &ldquo;fit&rdquo; better with newer OCS games. So units and rules have been changed to conform to games also set in 1942-43: DAK II, Case Blue, and Sicily II. Recent work on Beyond the Rhine is also factored in.&#10;&#10;Game Scale:&#10;Turn: 1/2 week&#10;Hex: 5 miles / 8 Km&#10;Units: Company to Brigade&#10;&#10;Game Inventory:&#10;Two 22 x 34&quot; full-color mapsheets&#10;Three dual-side printed countersheets (2 combat, 1 markers - 840 1/2&quot; counters - includes replacement counters for Beyond the Rhine [16] and Korea: The Forgotten War [4])&#10;One 56-page OCS Series Rules v4.2 rules booklet&#10;One 24-page Tunisia II specific rules booklet&#10;Two 4-sided OCS v4.2 Charts &amp; Tables booklets&#10;Two Player Aid unit arrival cards&#10;Two 6-sided dice&#10;&#10;Complexity: Medium&#10;Solitaire Suitability: Medium&#10;Players: 1 or more&#10;Playing Time: 2-50 Hours&#10;&#10;",
        "artist": "Nicolás Eskubi,Dean Essig"
    },
    {
        "name": "Port Royal Unterwegs!",
        "description": "Port Royal Unterwegs is a standalone, stripped-down sequel to the press-your-luck card game Port Royal, with new characters that can also serve as an expansion for that game.&#10;&#10;",
        "artist": "Klemens Franz"
    },
    {
        "name": "Master of Orion: The Board Game",
        "description": "Master of Orion: The Board Game takes you to the world of the legendary strategy video game.&#10;&#10;You will lead one of the races that will face each other in the outer space confrontation. Destinies of secretive Darloks, genius Psilons, universal humans and many others will depend on your actions. Manage your resources skillfully and wisely and lead the development of a chosen race in the right direction. You can progress by either military means, training your spies and attacking alien planets, or choose the path of creation, controlling the weather and building space fleets.&#10;&#10;A dynamic and well-balanced game mechanics will offer you plenty of paths to the victory, and the leader of the most successful nation will be granted the Emperor's title from the Galactic Counsil.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Golden Sails",
        "description": "Every year the merchant houses in Waard equip a caravan of ships to visit the distant islands of the wizarding world. Traders stop at twelve ports with the hope of acquiring unicorns and phoenixes, pepper and cloves, outlandish weapons, spells and gems &mdash; then of course returning home to sell these exotic products for a huge profit. Merchants can't always get what they want in The Golden Sails, though, so they need to be flexible in their plans...&#10;&#10;",
        "artist": "Sergey Dulin"
    },
    {
        "name": "Captains of the Golden Age",
        "description": "Captains of the Golden Age is set in a fictional East-Indies, in the golden age of trading and piracy, a time when pepper was worth more than gold!&#10;&#10;&#10;Four brightly coloured ships of different shapes and sizes lie anchored at Smuggler&rsquo;s Cove.&#10;&#10;Their sails are lowered and their crews are resting while they gently rock back and forth on the waves. An albatross circles the shipwreck that lies broken on the shore. The sun is setting and a warm light starts to shine from inside the gaping ship; it&rsquo;s the Smuggler&rsquo;s Cove inn.&#10;&#10;Four Captains sit at a round table at the center of the inn; some of the other guests are staring at the brightly coloured clothes they are wearing. A parrot closely watches the whole scene from a chandelier above the table. The colourful captains don&rsquo;t seem to mind; they talk, rest, laugh and enjoy their beers.&#10;&#10;Suddenly a small boy runs in, holding a sealed letter for the innkeeper. After reading the letter, the innkeeper glances at the other guests before walking over to the four captains. In a low whisper he says &ldquo;Friends, my contact from the Republic tells me that the price of pepper has just surpassed the price of gold&rdquo;, and turns back to his bar.&#10;&#10;The mood changes as a storm on a summer day and the captains reach for their weapons as if struck by lightning. Cautiously, they slowly stand up and back off from the table, but as their greed gets the better of them, they start running to their brightly coloured ships&hellip;&#10;&#10;&#10;Players start the game on smuggler's cove as one of these brightly coloured captains. Each captain owns a small ship with a tiny crew, one cannon and an empty cargo hold. Over the course of the game, each captain gathers resources to upgrade their ship at the shipyards of the Orient and the Republic or trades its cargo for valuable pepper in the Orient to get shares in the Trading Company and ensure their victory.&#10;&#10;The amount of sails determines how far you move per turn. Crew is used for boarding other ships and plundering cargo. Cannons deal damage to other ships and the size of your cargo hold determines how much cargo you can load and carry.&#10;&#10;Each player holds a hidden hand of cards from his own deck that can be used as temporary buffs to sail further, carry more cargo, or change the tide of battle.&#10;&#10;Besides all this players can hire the notorious pirate at Smugglers Cove, to secretly ambush other captains.&#10;&#10;&#10;CotGA has 0% randomness, all skill. Its main mechanics are pick-up and deliver combined with hand-management and bluff. Players choose the length of the game by the size of their starter ships.&#10;&#10;Trade cargo to upgrade your sails, crew, cannons or cargo holds. Attack other captains and board their ships to plunder cargo. Hire the notorious pirate to ambush competitors. Whatever your strategy, always keep one eye on the captain with pepper in his cargo hold.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Dwar7s Fall",
        "description": "To survive the long and terrible winter approaching, the dwarves need to prepare. It&rsquo;s time to collect gems, build castles and stock up enough food. The fire dragons are sleeping. The giants of winter, lurking. The fall is precious and is vital to plan your actions wisely.&#10;&#10;Dwar7s Fall is a game about collecting gems in order to trade it for food. In the meantime you also will need to build your dwarf kingdom and slay some monsters. In this game you have multiple paths to win by choosing carefully your actions.&#10;&#10;Players take turns to perform their actions. Each turn you can do 3 actions (place a realm tile or place one dwarf in a tile or move one dwarf by one tile).&#10;&#10;Each tile has a pre-requisite of how many dwarfs of one player are needed to perform one kind of action. For example: emerald mines have always three slots, but you will need only two dwarfs to take one emerald. When this task is done (collect one emerald) your two dwarfs will return to your pool.&#10;&#10;When a player completes three goals (both open and secret goals are taken into account), the endgame begins. Players who had not played this round make their last turn and, then, the game ends. The points are calculated and wins the match who has more points.&#10;&#10;",
        "artist": "Luís Brüeh"
    },
    {
        "name": "Dastardly Dirigibles",
        "description": "Description from the publisher:&#10;&#10;Professor Phineas Edmund Hornswoggle, famed airship builder, is retiring and you are an engineer competing to inherit the Hornswoggle factory!&#10;&#10;Dastardly Dirigibles features tarot-sized cards that are played in a constant action format in which each time a part is added, ALL players MUST add the SAME part &ndash; which may replace an existing one. Build your airship from different parts of nine beautiful suits, while also using special cards to your advantage or to thwart your opponents. The round ends when the first airship is complete &mdash; but you score only the suit used most in your airship. The player with the highest score after three rounds wins!&#10;&#10;",
        "artist": "Jeff Porter"
    },
    {
        "name": "Neolithic",
        "description": "Neolithic is a two-player card game set at the dawn of the Neolithic age, with each player taking on the role of leader for their village using a mix of Hand Building, Worker Placement, and multi-use cards. The player with the most advanced village wins.&#10;&#10;The game is comprised strictly of cards and features simple rules and meaningful strategic choices. Hunt, Gather, Innovate, Procreate, and Forage; each Task produces different cards different ways.&#10;&#10;Each turn, the player chooses one of two options: &#10;&#10;    Take a Task turn: Play Villager card(s) from their hand to one of the five Task decks to acquire more cards&#10;    Take a Village turn: Return all of their Villager cards to hand, and for each Villager returned, optionally play a non-Villager card to their Village&#10;&#10;&#10;&#10;&#10;Aside from the Forage Task, a player cannot choose a Task that is already occupied by either player.&#10;&#10;Once two of the five Tasks are empty, players score points and the player with the most points wins.&#10;&#10;",
        "artist": "John Ariosa"
    },
    {
        "name": "Mutant Crops",
        "description": "In a near future, agrotoxics and contamination created some strange mutant plants... who are really scary! But hey, profit is profit, so you have to be the best farmer and make them grow.&#10;&#10;You have 12 actions in the table (half face down, half face up) that allows you to gather resources (tokens), get plants, and nurture them. Each turn you have 2/3 actions, and what you use and what you block stop your friends to do the same. You need to take care of your resources, and you don't know exactly what action is available next, so your plans can be hard to reach. You have to get your crops well nurtured to score, and they do crazy stuff together, so keep and eye in other players crops, to  be sure you have the best mutants to score points and win the game.&#10;&#10;Cultivos Mutantes is a fast and light resource manager, a perfect introductory game to euros mechanics who plays in half an hour.&#10;&#10;",
        "artist": "Rocio Ogñenovich"
    },
    {
        "name": "Android: Mainframe",
        "description": "Description from the publisher:&#10;&#10;Run fast, score big! Android: Mainframe is a fast-paced strategy game set in the not-too-distant future of the Android universe!&#10;&#10;In the game, you and up to three opponents are elite cybercriminals known as runners who are competing for control of a vulnerable bank's various accounts. At the beginning of the game, you mark your arrival by the placement of your first access point. Then, each turn, you get to take a single action: establish another access point, execute a program, or pass. Your goal is to use the programs at your disposal to secure your access points so that they control as many of Titan's vulnerable accounts as possible.&#10;&#10;Most of the generic programs write pathways between Titan's various nodes, allowing you to place a blue partition between the nodes on the board. Whenever your partitions seal off a section of the board containing only your access point or access points, they are &quot;secured&quot; and flipped face down. They are no longer vulnerable to your opponents' programs, and you will score the accounts they control at the end of the game.&#10;&#10;Android: Mainframe differs from its predecessor Bauhaus in a number of ways, such as each player having a hand of cards and the game including six runners who each have five distinctive programs.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Oracle of Delphi",
        "description": "Description from the publisher:&#10;&#10;&quot;For once, Zeus, Greek god of thunder and sky, is in high spirits. Hence, he decides to offer a generous gift to a worthy mortal and invite him, or her, to his realm, to Olympus. To determine a sufficient candidate, Zeus hosts a competition for his entertainment. Twelve legendary tasks are imposed upon the fearless participants: to erect graceful statues, to raise awe-inspiring sanctuaries, to offer capacious offerings, and to slay the most fearsome monsters. The first participant to master all the posed assignments wins the favor of the father of the gods himself.&#10;&#10;Indubitably, you will not pass up this golden opportunity, so you clear your ship and rally your crew to follow on the trails of legendary Odysseus through the dangerous waters of the Aegean. But how could you find the righteous path onward? There is but one who can help you. Visit the mysterious oracle of Delphi and let her answers guide your ways.&#10;&#10;In Stefan Feld's new game The Oracle of Delphi, the player's ships travel across a large variable game board of hexagonal tiles showing islands and the surrounding waters. Each player aims to reach certain islands to perform the twelve tasks given by Zeus: e.g., to collect offerings of different colors and to deliver them to corresponding temples, or to slay monsters of a specific type (and color), all of which can be discovered on the islands.&#10;&#10;In order to execute these color-dependent actions, you are given three colored dice each turn, the so-called &quot;oracle dice&quot;. Rolling the dice (at the start of the turn) is equivalent to consulting the oracle, whereas the results represent her answers. The answers determine which actions you will be able to take, but you will always have three actions per turn. However, a slight divergence from your fate is often possible.&#10;&#10;In addition to the oracle, you can request support from the gods and you can acquire favor tokens, companions, and other special abilities that will help you win the race against other competitors.&#10;&#10;Differently equipped ships and the variable set-up of the game board will offer new challenging and interesting strategic and tactical decisions with every new game of The Oracle of Delphi that you play.&#10;&#10;",
        "artist": "Dennis Lohausen"
    },
    {
        "name": "Escape the Room: Mystery at the Stargazer's Manor",
        "description": "What are &ldquo;Escape the Room&rdquo; games?&#10;&#10;Escape the Room games began as digital adventures and quickly turned into real-life events all around the world where players are locked in a room and must uncover clues and hidden objects to escape. ThinkFun&rsquo;s version of Escape the Room allows you to bring all the excitement of these experiences into your very own home!&#10;&#10;The Mystery:&#10;It&rsquo;s 1869 and the town&rsquo;s well-respected astronomer has not been seen since the untimely passing of his wife. Recently, strange things have been happening at his manor &ndash; loud and unfamiliar noises, an unpleasant smell, and smoke billowing from the observatory. It&rsquo;s up to you and your guests to solve the mystery at the Stargazer&rsquo;s Manor!&#10;&#10;The Objective:&#10;Spend an evening working with your guests to solve puzzles, unlock hidden clues, and unravel the mystery of the Stargazer&rsquo;s Manor. Will you and your guests be able to solve the mystery and save the astronomer before time runs out?&#10;&#10;",
        "artist": "Erwin Madrid"
    },
    {
        "name": "Joking Hazard",
        "description": "From the creators of Cyanide &amp; Happiness comes a card game where players compete to finish an awful comic strip.&#10;&#10;The creators said:&#10;&#10;&quot;Someone on the Internet once told us that making stick figure comics is easy as hell, and that we were ugly and stupid.&#10;&#10;They were right on all counts. So, after crying for a few hours, we created the Random Comic Generator which since its inception in 2014 has entertained millions with its computer-generated comedy.&#10;&#10;After a few weeks of playing with the Random Comic Generator, we started to wonder if its hundreds of random panels might lend themselves to a card game, where you compete against your friends to finish a comic with a funny punchline.  So we printed out all of the RCG panels and started playing with them.&quot;&#10;&#10;Draw 7 cards. The deck plays the first card, select a Judge to play the second, then everyone selects a third card to create a three panel comic strip.  The Judge picks a winner.&#10;&#10;The game includes a deck of 250 unique panel cards - that&rsquo;s 15.4 million combinations of comics!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Bohemian Villages",
        "description": "Who will collect the most money in the Bohemian villages? As a merchant, you want to have as many stores as possible. As an innkeeper, you can earn money only if there are enough people in the village. As a miller or factory owner, cooperation is key. And to become rich as mayor, you need the support of the entire village. Every decision you make might also depend on the roll of the dice.&#10;&#10;Bohemian Villages is a tactical dice-rolling game that allows you to claim different types of buildings in a shared village and use the powers of those buildings. In the end, the player who evaluates their options best and pursues the correct strategy will be the lucky winner.&#10;&#10;",
        "artist": "Klemens Franz,Andrea Kattnig"
    },
    {
        "name": "The Red Dragon Inn: Battle for Greyport",
        "description": "You and your adventuring companions are just returning to the bustling city of Greyport after your latest adventure. You are all looking forward to relaxing and spending some of your hard-earned loot at The Red Dragon Inn. The party will have to wait, though, because the city is under attack by evil monsters!&#10;&#10;Battle for Greyport is a cooperative deck-building game based on the characters and world of The Red Dragon Inn. You will travel to important locations around the city, fighting epic battles and recruiting whatever heroes and items you can along the way. Each encounter presents more opportunities to improve your deck, but also brings more dire foes for you to face!&#10;&#10;With five playable characters, seven different scenarios, and an assortment of variants, you can have a new game every time, adjusting the game&rsquo;s difficulty as you improve.&#10;&#10;Will you defend the city from the monsters and defeat their nefarious boss, or will the city (and the tavern!) be overrun?&#10;&#10;The Red Dragon Inn: Battle for Greyport also contains two items for use with any of the standalone The Red Dragon Inn titles: Chronos the Time Mage character deck and Drog's Special Reserve drink card.&#10;&#10;",
        "artist": "Erin Wong"
    },
    {
        "name": "Agamemnon",
        "description": "None can defy the will of the gods but the gods themselves. Driven by the ambition of their king, the Greeks have arrived on the shores of Troy. Some seek power, some seek revenge, while still others seek the great moment in battle that will define their place in history.&#10;&#10;Agamemnon is a fast-paced strategy board game in which two players take on the roles of ancient Greek gods during the Trojan War. By tactically deploying warriors to where they're needed across the board, each player may influence the final outcome of the battles famously detailed in Homer's Iliad. Some areas will be decided by the strength of the warriors, others by sheer weight of numbers, and some by the inspiration your heroes provide.&#10;&#10;To begin the game, Strings of Fate tiles are placed on their matching spaces on the board, and each player receives one set of fifteen playing tiles. These tiles come in three varieties: Warriors, with a numerical value marking their strength, Leaders, with both a letter rank and a strength value, and Weavers who have no strength or rank, but instead manipulate the Strings of Fate. Each player will shuffle their tiles face down in front of them.&#10;&#10;The first player flips over one of their tiles, and places it on any available space. If it&rsquo;s a Weaver, its effect immediately comes into play: the Warp Weaver may swap two adjacent Strings of Fate, whilst the Weft Weaver simply splits all strings it&rsquo;s connected to. After the first turn, each player flips and plays two tiles on their turns.&#10;&#10;Once all the tiles have been placed, each string is resolved: each Strength String is won by the player with the highest combined strength contained within it; each Leadership String is won by the player with the single highest ranked tile within the string; and Force Strings are won by the player with the most tiles, including Weavers, in the string. Players claim all the tiles from Strings of Fate they have won, and the player with the most tiles at the end wins.&#10;&emsp;&#10;&#10;",
        "artist": "José Daniel Cabrera Peña,Rocío Espín Piñar"
    },
    {
        "name": "Let Them Eat Cake",
        "description": "&quot;Liberty! Equality! Eclairs!&quot; The glorious revolution has done away with tyranny! Now you and your friends make up the Revolutionary Committee, overseeing justice throughout the land. Still, now that the queen's gone, it would be a shame to let all that cake go to waste...&#10;&#10;Become the first among equals by amassing honour! Become happy by amassing cake! Send your friends' pawns to the guillotine! First to forty cakes wins!&#10;&#10;Let Them Eat Cake is a game of committees, coercion, and cake. Elect your friends to positions of power in the hope that they look on your patronage favorably &mdash; or denounce them as enemies of the revolution. Alliances and betrayal are all fair game as you try to amass as much cake as you can before the revolution collapses.&#10;&#10;Each player starts the game with a set of voting cards, three pawns, three medals of honour, and some cake. Each round consists of a series of elections, from the Head of Committee to the Food Inspector. Each vote, after negotiating, bribing, and pleading, is simply a matter of each player secretly choosing a voting card of the player they wish to vote for. Each player&rsquo;s votes are multiplied by the number of pawns they have, and whoever is the Head of Committee will break any ties. Importantly, once you&rsquo;ve used a voting card, you cannot reuse it until you&rsquo;ve played all your cards, demanding shifting allegiances throughout the game.&#10;&#10;The first vote of the round determines the Head of Committee, the official tie-breaker. Soon thereafter players determine the Enemy of the Revolution, who must place one of their pawns on the guillotine, immediately and potentially permanently reducing their voting power. Next, players elect a Guillotine Operator, who decides whether or not the pawn on the guillotine is executed or spared. Once settled, a Secretary is elected to divvy out cake and generals to the players, one card per player. But before these cards are taken, the players elect a Food Inspector who may, at the cost of a medal, declare all cake unsafe.&#10;&#10;Throughout the game, players will accumulate medals, generals, and cake. Fewest medals make you the Enemy of the Revolution, but the player with the most Generals is immune to such accusations! Any player can spend their Generals to force a re-election or simply choose the winner of a vote. The game ends when one player reaches 40 or more cakes, a player has their last pawn executed, or the deck runs out. The player with the most cake wins!&#10;&#10;",
        "artist": "Lauren \"Iguanamouth\" Dawson"
    },
    {
        "name": "Star Trek Panic",
        "description": "Star Trek Panic is a cooperative light strategy game based on Castle Panic that challenges players to defend the U.S.S. Enterprise from enemy attacks.&#10;&#10;In addition, the game features mission cards that have unique challenges based on the original Star Trek series as well as character cards so that players can assume the roles of Star Trek icons like Captain Kirk and Mr. Spock.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Great Western Trail",
        "description": "Description from the publisher:&#10;&#10;America in the 19th century: You are a rancher and repeatedly herd your cattle from Texas to Kansas City, where you send them off by train. This earns you money and victory points. Needless to say, each time you arrive in Kansas City, you want to have your most valuable cattle in tow. However, the &quot;Great Western Trail&quot; not only requires that you keep your herd in good shape, but also that you wisely use the various buildings along the trail. Also, it might be a good idea to hire capable staff: cowboys to improve your herd, craftsmen to build your very own buildings, or engineers for the important railroad line.&#10;&#10;If you cleverly manage your herd and navigate the opportunities and pitfalls of Great Western Trail, you surely will gain the most victory points and win the game.&#10;&#10;",
        "artist": "Andreas Resch"
    },
    {
        "name": "Jórvík",
        "description": "For several decades during the Viking age, parts of England were occupied by the Norsemen. Under their &#30;influence, one of the larger cities turned into a flourishing center of trade and craftsmanship. &#31;The Vikings called the city and its surrounding kingdom &quot;J&oacute;rv&iacute;k&quot;, which is today known as the city of York.&#10;&#10;In the game J&oacute;rv&iacute;k, players assume the roles of Viking jarls. They gather prestige points by trading goods, holding big feasts, funding pillages, commissioning craftsmen and hiring soldiers to defend the city against recurring invasions. &#31;The player with the most prestige points wins.&#10;&#10;The game is a re-design of Die Speicherstadt (2010). In this game, players acquire cards from a card display through a simple yet brilliant worker placement and bidding mechanism to build up their trading empires. J&oacute;rv&iacute;k includes two versions: A base game that is equivalent to Die Speicherstadt, and an advanced game that equates to Die Speicherstadt including its expansion Kaispeicher.&#10;&#10;",
        "artist": "Marc Margielsky"
    },
    {
        "name": "Basketball Age",
        "description": "&iquest;Would you like to play a basketball match on a table at home?   &#10;                                                     Now you can...&#10;&#10;BASKETBALL age is a basketball simulator for 2 persons that recreates an exciting basketball match.&#10;&#10;You&acute;re one of the two team coaches facing off. You have to choose your &ldquo;starting lineup&rdquo; on the court to win the match. As in a normal match, your players will move around a basketball court, divided in zones where the players perform basketball actions.&#10;&#10;Each player has his own skills (play skill, movement points, passing, scoring % and height). Players skills are different according to their position.&#10;&#10;Court players are activated and perform their actions one by one and in alternating way (attacker-defender and so on) until the end of possession or turn over. Attacking team has a turn to score. It consists of 10 attacking player&acute;s activation, or the buzzer will sound. You can activate the same player in a row as many times as you want.&#10;&#10;Following a simple rules and rolling dice (six sided and ten sided dice) you&acute;ll be able to perform all kind of basketball actions like passes, rebounds, fouls, freethrows, blocks, pick&amp; roll, steals, two-point shots, lay ups, three-pointers, dunks....&#10;&#10;&iquest;Have you got what it takes to lead your team to victory?&#10;&#10;",
        "artist": "Gonzo Bríos"
    },
    {
        "name": "The Dragon & Flagon",
        "description": "The Dragon &amp; Flagon is a tavern world-renowned for its most magical drink, The Dragon. Legend has it that one sip of The Dragon can give a hero wondrous abilities beyond their wildest dreams &mdash; but with a tavern full of thirsty adventurers and only one flagon left, things are bound to go wrong. Prepare your magic and grab your weapon because there's only one true objective in this brawl &mdash; and it's not just a sip of The Dragon. Only one can win and emerge with the reputation as the greatest fighter ever seen within the walls of The Dragon &amp; Flagon!&#10;&#10;The Dragon &amp; Flagon is a game of chaos and mayhem for 2-8 players. Throw mugs, smash chairs, swing from the chandelier, sip from the legendary Dragon Flagon, cast spells, and pull the rug out from under your fellow adventurers as you attempt to build up your reputation and win the day!&#10;&#10;Play as one of nine unique characters in a 3D tavern environment that can be set up differently every time. Multiple play modes add even more variety.&#10;&#10;Will you leave with the greatest reputation from The Dragon &amp; Flagon?&#10;&#10;",
        "artist": "William Bricker"
    },
    {
        "name": "1822: The Railways of Great Britain",
        "description": "1822 is a game in the 18xx series based on the growth of the Railways through the age of steam.  It is based on a map of most of Great Britain,  excluding north Wales and the Scottish Highlands.&#10;&#10;Players take the part of investors in Railway companies and then operate the companies to maximise their own wealth.&#10;&#10;The game has several McGuffins...&#10;1. There are private companies, minor companies and major companies (released as concessions in the bidding rounds).  These are released in tranches in random order.  &#10;2.  The bidding mechanism is &quot;Lawsonian&quot; whereby players can bid on a limited number of the companies on offer and all of the bids are resolved simultaneously. &#10;3.  A new type of train is introduced: a Local train which runs on its home station.&#10;4.  Major companies have historical destinations. &#10;5.  Major companies can acquire any minor companies to which they are connected (if the owning player agrees) allowing very flexible and variable game play. &#10;6.  There is a strong incentive on players not to spend all of their initial capital in the first stock rounds.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Vanuatu (second edition)",
        "description": "In Vanuatu, you are a Vanuatuan who wants to prosper during the eight turns of the game. In order to prosper, you have to manage with natural resources, rare items, vatus (local currency) and tourists. To earn money or prosperity points, you may also draw on the sand*, carry tourists all over Vanuatu islands, or trade cargo with foreign countries.&#10;&#10;On each turn, the archipelago expands and you have to program your actions with five tokens. You put one or more of them on the chosen action spaces, and on your turn, you will only be able to play an action if you have the majority on its space. Thus, sometimes have to wait for other players to remove their tokens by playing their actions. If you are not in majority anywhere, you have to remove all of your tokens from an action and give up hope of playing this action. A good strategy lets you block other players; for example, they won't be able to sell fishes if they haven't caught them first &ndash; order matters! Islands and sea resources are rare, so be quick and take them first!&#10;&#10;There is no such thing as a rich Vanuatuan. When you reach ten Vatus, they automatically transform into 5 prosperity points and again, you are poor. Life is hard, but you may encounter ten men to help you; on each turn you choose one of them to increase your benefits from an action. As always, being the first player lets you choose before the others.&#10;&#10;In short, Vanuatu is a strategy game of programming and majorities that features development, blocking, and a lot of interaction between players.&#10;&#10;This Quined Master Print edition brings you the wonderful original game, as well as the Rising Waters expansion and the extra character of the Governor, with completely new artwork by Konstantin Vohwinkel. The Rising Waters expansion adds a whole new level of tension to the game: Global warming threatens Vanuatu. Many islands are in danger of disappearing under the sea due to rising waters. Players will therefore have to unite to protect the islands by building dikes. However, the interests of one are not necessarily the interests of others.&#10;&#10;(*) Sand Drawing in Vanuatu belongs to the Masterpieces of the Oral and Intangible Heritage of Humanity of the UNESCO.&#10;&#10;",
        "artist": "Konstantin Vohwinkel"
    },
    {
        "name": "Star Trek: Ascendancy",
        "description": "Boldly go where no one has gone before. In Star Trek: Ascendancy &mdash; a board game of exploration, expansion and conflict between the United Federation of Planets, the Klingon Empire, and the Romulan Star Empire &mdash; you control the great civilizations of the Galaxy, striking out from your home worlds to expand your influence and grow your civilization. Will you journey for peace and exploration, or will you travel the path of conquest and exploitation? Command starships, establish space lanes, construct starbases, and bring other systems under your banner. With more than 200 plastic miniatures and 30 star systems representing some of the Star Trek galaxy's most notable planets and locations, Star Trek: Ascendancy puts the fate of the galaxy in your hands.&#10;&#10;The great unknown lies before you; with every turn is a new adventure as your ships explore new space systems, encounter new life forms and new civilizations, make wondrous discoveries, and face challenging obstacles, all drawn from the vast fifty year history of Star Trek. Will you brave the hazards of Rura Penthe to harvest vital resources, race to develop Sherman's Planet before your rivals stake their claim, or explore the mysteries of the Mutara Nebula on an ever-growing, adaptive map of the galaxy. With an infinite combination of planets and interstellar phenomena, no two games of Star Trek: Ascendancy will ever play the same!&#10;&#10;",
        "artist": "Katie Dillon,Charles Woods"
    },
    {
        "name": "Mistfall: Heart of the Mists",
        "description": "Mistfall: Heart of the Mists is is a fully cooperative card-based adventure game set in a world of mystery, eldritch powers and perilous adventures. Heart of the Mists continues the story of Mistfall in a standalone expansion featuring new Heroes, Enemies, Encounters and Quests, and introducing Allies, as well as alternative versions of some of the base game mechanisms.&#10;&#10;At the start of the game each player chooses a hero with a fixed deck of equipment and power cards, as well as a set of upgrades that can be added directly to a player&rsquo;s hand during the game. A semi-randomly created board makes for a different landscape every time the game is played, and randomized sets of encounters and enemies create different challenges for players to face before their time runs out.&#10;&#10;Mistfall: Heart of the Mists introduces more of what made Mistfall great, making it a good entry point for new gamers, as well as a solid expansion for existing fans. With next to no elements replicated from the base set, Heart of the Mists is the perfect addition to the existing Mistfall set &ndash; and a challenging experience both solitaire, as well as with a group of up to three friends.&#10;&#10;Gather up your resolve, check your gear and get ready to go to the smoldering heart of the unrelenting Mists!&#10;&#10;",
        "artist": "Enggar Adirasa,Agnieszka Kopera"
    },
    {
        "name": "Deathwatch: Overkill",
        "description": "The Deathwatch are the elite of the elite. Recruited from the ranks of the Adeptus Astartes, humanity's power-armored Space Marines, the Deathwatch embark on the most difficult missions in the name of the Emperor. Genestealer Cults are the advanced infiltration units of the Tyranid Hive. They infiltrate human civilization and interbreed to create monstrous hybrid cultists. Deathwatch: Overkill pits these two forces against each other. The Deathwatch player controls a squad of marines plus one Terminator and one White Scar on a bike. The Genestealer Cult player controls one Primarch, one Magus and 37 Genestealers ranging from purestrain to fourth generation cultist. Each player uses dice and cards to shoot and force the action.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Costa Rica",
        "description": "Different sets of exotic animals, different terrains, and the omnipresent danger of mosquitos await in the jungle of Costa Rica, and the player explorers are here to collect sets of rare and exotic animals to rescue them from poachers. Collecting as many as you can of one kind is valuable, but having one of each kind can be beneficial, too. Just avoid being bitten too badly by the mosquitos!&#10;&#10;In Costa Rica, all player take part in an expedition, with the active player of a turn deciding where to go and exploring a new tile. In clockwise order, each player must decide whether to leave this expedition and collect all of the animals seen so far, or whether to remain with the group to (hopefully) collect more animals later? Once a player does leave the current expedition, they remove their pawn from that group, collecting nothing else from it.&#10;&#10;",
        "artist": "Klemens Franz"
    },
    {
        "name": "Pędzące Ślimaki",
        "description": "From the publisher:&#10;&#10;Players roll dice and move colored snails on the board. Along the way, they try to push opponents and get as many delicious mushrooms as they can. Until the very end nobody knows which snail belongs to which opponent, which guarantees great excitement. The game has simple rules, and victory is decided by tactics and the ability to bluff.&#10;&#10;In P&#196;&#153;dz&#196;&#133;ce &#197;&#154;limaki: Na jednej nodze (&quot;Running Snails: On one leg&quot;) every player controls two out of five snails. It may happen that some snails are controlled by two players. On a turn a player rolls the dice, chooses one of them and moves a snail with a color corresponding to the chosen die. After that she passes to the next player all dice but the chosen one. When the number of dice passed is reduced to one then the current receives all of the dice.&#10;&#10;The game ends when one of the snails finishes the race. At this point snails are awarded points: 5 for 1st place, 2 for 2nd place and 3 for last place. Snails can also earn points during the race by landing on a mushrrom or pushing back other snails. The player who has the most point at the end of the game is the winner.&#10;&#10;P&#196;&#153;dz&#196;&#133;ce &#197;&#154;limaki is a 3rd game in Egmont Polska series (all designed by Reiner Knizia) containing following games:&#10;P&#196;&#153;dz&#196;&#133;ce &#197;&#187;&oacute;&#197;&#130;wie (Ribbit)&#10;P&#196;&#153;dz&#196;&#133;ce Je&#197;&#188;e (Bucket Brigade)&#10;P&#196;&#153;dz&#196;&#133;ce &#197;&#154;limaki&#10;&#10;",
        "artist": "Rolf Vogt"
    },
    {
        "name": "Kharnage",
        "description": "Kharnage is a fast and fun fighting game in a med-fan world in which you are the warchief of the mighty humans, the strong (and alcoholic) dwarves, the amazing horde of goblins, or the ferocious orcs (and their giant!). Your goal in Kharnage is to take control of something strategically essential, astoundingly beautiful, and envy of all other nations: a hill. Yes, just a hill. Admittedly, it is a nice hill. It may have a very commanding view of the surroundings, or it may not. You won't know until you get up there! To do so, you're going to have to drive off the armies of the other players by simply causing as much mayhem and bloodshed as possible.&#10;&#10;Each turn, you choose one battle card. The player with the lowest initiative value begins and:&#10;&#10;&#10;     Deploys new units and applies skills if needed, or&#10;     Attacks (shoot or assault) one opponent with all points, or two opponents by dividing their points.&#10;&#10;&#10;The next player then begins their turn, doing the same. After all players have taken their turn, the player who destroyed the largest number of units wins 5 domination points, the second 3 domination points, and the third 1 domination point. The last one has only their eyes for crying.&#10;&#10;Each time a player totally destroys an opponent army, they must yell &quot;KHARNAGE!&quot;, loud and clear, and stomp the table. They then take a Kharnage token worth 1 domination point. The other players must cheer them on by yelling &quot;YEAH!&quot;; if not, they lose a Kharnage token if they have one.&#10;&#10;After four rounds, the warchief with the most domination points wins!&#10;&#10;",
        "artist": "Sylvain Aublin,Gaël Denhard"
    }
]