[
    {
        "name": "Fruit Salad",
        "description": "In Fruit Salad, players collectively assemble a fruity dish, trying to get rid of their cards in hand or score four points first.&#10;&#10;Cards are distributed face down evenly among all players. At the start of a round, someone rolls the two dice &mdash; one showing a number 4-8, the other showing a type of fruit &mdash; then players take turns laying cards in the center of the table, covering the card most recently played. Whenever someone thinks that the stack of cards contains at least as many of the required fruit as shown on the dice, they can slap the stack and reveal the cards. If they're correct, they keep one card face up as a point and distribute the other cards among the opponents; if incorrect, they must keep all of the cards.&#10;&#10;While this part of the game is straightforward, some cards include minions that require you to reroll either the number or fruit die, thereby changing what you're trying to collect in the salad. Can you keep track of everything?&#10;&#10;",
        "artist": "Vincent Boulanger,Jean-Charles Mourey"
    },
    {
        "name": "Dragon Keeper: The Dungeon",
        "description": "In those primitive times when men and dragons were enemies, former adventurers left their original guilds to serve a dragon. They protect him from the repeated assaults of adventurers attracted by his fabulous treasure, buried in the basement of the castle. What if there were more than gold to protect?&#10;&#10;In the tile-collection game Dragon Keeper: The Dungeon, you embody these keepers and must capture the adventurers who invade the rooms of the dungeon &mdash; yet you must remain faithful to your guild by avoiding capturing its members. Once you have repelled the assaults, you give to the dragon as a tribute a part of the adventurers you caught&hellip;&#10;&#10;In more detail, the game contains tiles in five different colors and different values. These tiles represent the adventurers who want steal the plunder of the dragon. You are responsible for removing these adventurers from the dungeon. Each turn, you take a tile for yourself and give another tile to another player. The choice of tiles depends on the position of the dragon (as the tile must be in its line or in its column). Then the dragon is moved to the location of the tile that has just been removed. Thus, each tile decision limits the choice of the next tile to take.&#10;&#10;At the start of the game each player receives a color that they keep secret, with this color corresponding to their original guild. Every tile of this color brings them negative points. Players stack their collected tiles by color, and at the end of the game, the tallest stack is removed. If this stack is the player's guild color, then the player must discard the next tallest stack instead. Players then sum the values of their tiles, and whoever has the most points wins.&#10;&#10;",
        "artist": "Boris Moncel,Ismaël Pommaz"
    },
    {
        "name": "Loot N Run",
        "description": "Ah, the great pyramids! Full of treasures, just waiting for you! It would be so easy without the other explorers waking up the Mummies, Werewolves, and Franks, and sending them after you. But you are quick and clever, so it shouldn't be a problem, right?&#10;&#10;Loot N Run is a subtle bluffing game in which you have to know when to take risks. On your turn, take one of these three actions:&#10;&#10;&#10;    Loot: Draw a card and keep it in front of you.&#10;    Run: Score all of your cards. You score 1 point for each treasure on it. Double your score for a type of treasure if it is present on two or more cards.&#10;    Awaken the monster guardians: Look at an opponent's cards. If you find guardians, that player loses all unscored cards and you get the bonus from the guardians!&#10;&#10;&#10;The first player to score 35 points wins!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Exceed: Red Horizon – Eva & Kaden vs. Miska & Lily",
        "description": "Exceed is an easy-to-learn 2 player head-to-head fighting card game. Matches take approximately 10-20 minutes, with decks that are small enough to fit in your pocket.&#10;&#10;Exceed is broken up into &quot;Seasons&quot; each Season contains 16 new fighters from various franchises, packaged into 4-character boxes.&#10;&#10;This set features 4 characters from the world of Red Horizon: Eva, Kaden, Miska, and Lily, as well as all materials you need to play.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Exceed: Red Horizon – Satoshi & Mei Lien vs. Baelkhor & Morathi",
        "description": "Exceed is an easy-to-learn 2 player head-to-head fighting card game. Matches take approximately 10-20 minutes, with decks that are small enough to fit in your pocket.&#10;&#10;Exceed is broken up into &quot;Seasons&quot; each Season contains 16 new fighters from various franchises, packaged into 4-character boxes.&#10;&#10;This set features 4 characters from the world of Red Horizon: Satoshi, Mei Lien, Baelkhor, and Morathi, as well as all materials you need to play.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Exceed: Red Horizon – Gabrek & Ulrik vs. Alice & Zoey",
        "description": "Exceed is an easy-to-learn 2 player head-to-head fighting card game. Matches take approximately 10-20 minutes, with decks that are small enough to fit in your pocket.&#10;&#10;Exceed is broken up into &quot;Seasons&quot; each Season contains 16 new fighters from various franchises, packaged into 4-character boxes.&#10;&#10;This set features 4 characters from the world of Red Horizon: Gabrek, Ulrik, Alice, and Zoey, as well as all materials you need to play.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Islebound",
        "description": "Set sail in a mystical archipelago filled with bustling towns, sea monsters, pirates, and gold!  Compete to build the best sea-faring nation with up to three friends by collecting treasure, hiring crew, and conquering or befriending island towns.&#10;&#10;In Islebound, you take command of a ship and crew.  You sail to island towns, collecting resources, hiring crew, and commissioning buildings for your capital city.  Each building has a unique ability, and your combination of buildings can greatly enhance your strength as a trader, builder, or invader.  You also recruit pirates and sea monsters to conquer towns, which, once conquered, allow you to complete the town action for free, and charge a fee to opponents if they want to use it.  Alternatively, you can complete events that give influence, which can be used to befriend towns.&#10;&#10;There are many routes to success.  Will you be a ruthless conqueror, careful diplomat, or shrewd merchant in your race to the top?&#10;&#10;The player with the most wealth and most-impressive capital city will win the game!&#10;&#10;",
        "artist": "Ryan Laukat"
    },
    {
        "name": "Beasts of Balance",
        "description": "Beasts of Balance is a game of strategy and balance in which you build a tower of animals on your tabletop, then help them evolve in a connected digital world.&#10;&#10;A cooperative game for one to five players, the aim is to make the most fabulous world you can by strategically nurturing and evolving your creatures and casting skill-based miracles - before your tower collapses.&#10;&#10;Players take turns to stack a set of beautifully made artifacts into a tower. As they're placed they pop onto the connected device's screen, where they'll be seen to evolve and grow as players continue to make tactical choices over how they build.&#10;&#10;Our in-house designed technology uses a unique combination of sensors to recognize the pieces in play, connecting to the device over Bluetooth to tablets and smartphones running iOS or Android.&#10;&#10;",
        "artist": "Tim Burrell-Saward,Lyall McCarthy,Chris Shaw"
    },
    {
        "name": "Metropolia",
        "description": "Welcome to the city of Machi Koro. You've just been elected Mayor. Congrats! Unfortunately the citizens have some pretty big demands: jobs, a theme park, a couple of cheese factories and maybe even a radio tower. A tough proposition since the city currently consists of a wheat field, a bakery and a single die.&#10;&#10;Armed only with your trusty die and a dream, you must grow Machi Koro into the largest city in the region. You will need to collect income from developments, build public works, and steal from your neighbors' coffers. Just make sure they aren't doing the same to you!&#10;&#10;Machi Koro is a fast-paced game for 2-4 players. Each player wants to develop the city on his own terms in order to complete all of the landmarks under construction faster than his rivals. On his turn, each player rolls one or two dice. If the sum of the dice rolled matches the number of a building that a player owns, he gets the effect of that building; in some cases opponents will also benefit from your die (just as you can benefit from theirs). Then, with money in hand a player can build a landmark or a new building, ideally adding to the wealth of his city on future turns. The first player to construct all of his landmarks wins!&#10;&#10;The Machi Koro: Harbor Expansion injects further excitement into the game that has everyone talking! Want even more fun in your box?! Perhaps ten new establishments, one new starting establishment and two new landmarks will help?&#10;&#10;",
        "artist": "Noboru Hotta,Mirko Suzuki"
    },
    {
        "name": "Stawka większa niż życie",
        "description": "Stawka wi&#196;&#153;ksza ni&#197;&#188; &#197;&#188;ycie (More than life at stake) is board game inspired by most popular tv series produced by TVP (Polish television) in 1967. This black and white series is broadcasted  almost every year (by different Polish tv channels).&#10;&#10;Action takes place during World War II in Poland occupied by Germans. In game one player becomes a member of the Polish resistance and try to execute tasks against occupants.&#10;&#10;The second player becomes a member of German forces and tries to stop Polish actions.&#10;&#10;Each player controls up to four agents. Each turn player choose a card which decides whose agent first makes his move and what is the amount of action points. This points can be used to moving agents on map and taking special actions like searching for items or evidence of illegal activity. They can try to talk with enemy agents to force them to reveal secret information. German agents may try arrest Poles but polish agents may try to make assassination of gestapo officers. After successful actions, players receive Victory Points.&#10;&#10;Both players can play cards to use special effects or to disturb enemy actions.&#10;&#10;Every scenario has special win conditions (like finding some items or execute some activities). If this conditions are not achieved, players must compare Victory Points they gathered.&#10;&#10;",
        "artist": "Marek Szyszko"
    },
    {
        "name": "Win/Lose Revolution",
        "description": "Win/Lose Revolution is a very light social deduction game for 3 players.  Each player is dealt one of the three role cards and secretly looks at the card.  The player with the Controller card turns the card face up and then must pick one other player to go on a mission.   The players with the Rebel and Informant cards will try to convince the Controller to pick them (without showing their card).&#10;&#10;If the Controller picks the Rebel, both those players win.  If the Controller picks the Informant, the Informant player wins.&#10;&#10;The game can be expanded to 4-5 players with a second set.&#10;&#10;",
        "artist": "Stephanie Gustafsson"
    },
    {
        "name": "Minecraft Card Game?",
        "description": "Based on the hit video game, players have the opportunity to mine, craft or reserve to win.&#10;&#10;Players &quot;mine&quot; Resource Cards of Wood, Stone, Iron, Diamond, or Gold, and then use those cards to &quot;craft&quot; Craft Cards for points. If you desire a certain Craft Card, but are currently unable to pay for it, you may Reserve the card in your card holder to craft later. Craft Cards can become Tools with special powers you can you can use in your favor to control the game play&mdash;but watch out! TNT and Creeper cards are hiding in the deck for unexpected upsets.&#10;&#10;The player who reaches the game point goal first, wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Mini Mölkky",
        "description": "A mini table top version of M&ouml;lkky made in eco-friendly wood and great for indoors.&#10;&#10;The players use a wooden pin (also called &quot;m&ouml;lkky&quot;) to try to knock over wooden pins (also called &quot;skittles&quot;) of almost similar dimensions with the throwing pin, which are marked with numbers from 1 to 12. The pins are initially placed in a tight group in an upright position. Knocking over one pin scores the amount of points marked on the pin. Knocking 2 or more pins scores the number of pins knocked over. After each throw, the pins are stood up again in the exact location where they landed. The first one to reach exactly 50 points wins the game. Scoring more than 50 will be penalised by setting the player's score back to 25 points. A player will be eliminated from the game if they miss all of the target pins three times in a row.&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "Pick the Lock",
        "description": "Players take on the role of a thief attempting to obtain priceless treasures and outdo their fellow gentleman and lady burglars. Two to five players take turns picking locks to steal valuable items from the vault or each other. The thief with the most treasures at the end of the game is the winner.&#10;&#10;Each treasure obtained puts you closer to winning. However, each treasure has a special negative effect that makes your collection vulnerable. Steal wisely, certain combinations of treasures in your possession could make it easier for other thieves to steal from you.&#10;&#10;The main mechanic of Pick the Lock has a small amount of wit and a lot of luck. Players attempt to steal treasures from each other or the vault by using one of their five number cards. These cards are numbered four through eight. When played they define the odds of success during your attempt to steal a treasure. The defending player sets the combination of the lock to his or her vault by placing a card face down that is from 1 to the number the attacking player has played. Using the right cards with the right treasure effects could ensure your victory. Pick the Lock combines a nice blend of strategy, wit, and luck. Are you clever enough to outwit your friends and Pick the Lock?&#10;&#10;Pick the Lock is a Card game for 2-5 players ages 6 and up.&#10;&#10;",
        "artist": "Jon Mietling"
    },
    {
        "name": "Die fiesen 7",
        "description": "Players play a card in front of them showing one or two gangsters. They have to say the current number, i.e: The first is one, the second two up until 7 and then it goes backwards (after 7 comes 6).&#10;If there are two gangsters the player has to name both numbers and the next player is skipped. &#10;If the gangster is looking into a gun you don't say anything.&#10;If the gangster is holding a mobile you have to clear your throat instead.&#10;If you make a mistake you have to take the pile of cards.&#10;Goal is to get rid of the cards first.&#10;&#10;",
        "artist": "Rolf Vogt"
    },
    {
        "name": "Tavarua",
        "description": "Tavarua is a 1-6 player competitive surfing board game. In Tavarua you are a surfer in a surf contest. You'll need to pick a board, paddle out, look for waves, and ride them in to score points!&#10;&#10;Tavarua is played over a number of short rounds. In each round waves advance towards shore, players simultaneously select then resolve actions by playing cards, and a wave card is revealed and resolved. Rounds continue until there are no more wave cards in the wave deck, at which point the game ends and one player claims victory.&#10;&#10;Goal&#10;The goal of the game is to win the grand champion trophy, by having the highest scoring waves. You score points by catching and riding waves, but you may only keep your top two wave scores for each board type. General gameplay involves looking for a wave to ride, paddling to the wave, catching the wave, riding the wave, then scoring the wave. When the game ends, three trophies are given out, whoever gets the Grand Champion trophy wins!&#10;&#10;Looking For a Wave&#10;At the start of each round all the wave tiles advance one space towards the shore. When looking for a wave to catch, you&rsquo;ll need to remember that you can only catch a broken wave. Waves are either unbroken, or broken. Waves with a die number less than their space in the break are unbroken. Waves with a die number equal to or higher than their space in the break are broken.&#10;&#10;Paddling to a Wave&#10;Paddling moves your surfer in the channel. You can play any card to paddle, the number on the card determines how many spaces you move.&#10;&#10;Catching a Wave&#10;You can only catch the wave that&rsquo;s in the same space in the break as your surfer is in the channel. To catch a wave, you&rsquo;ll need to play a card. The number and direction on the card will shift your balance. When catching a wave you&rsquo;ll want to look at the top card of the wave deck to determine which card to play. You want to play a card that will shift your balance so that you do not wipeout during the Wave / Score phase. You now move your surfer/surfboard onto the wave tile (standing your surfer up) and finally move your played card over to your score pile.&#10;&#10;Riding a Wave&#10;Once you&rsquo;ve caught a wave you are considered to be riding it. While riding, your goal is to maintain your balance, while maximizing scored points. Cards you play will both shift your balance, and count as your score for the wave. The higher the number on the card, the more points it&rsquo;s worth, however the more difficult it will be to maintain your balance. After you play and shift your balance, a wave card will be revealed, and it too will shift your balance. Be careful: if your balance token moves one or more spaces off the nose or tail of your surfboard, you&rsquo;ll wipeout!&#10;&#10;Scoring a Wave &#10;When riding a wave: cards played are not discarded, but placed into your score pile. The numbers on the cards determines the score value of that wave. When you stop riding a wave you will score it during the &ldquo;Wave / Score&rdquo; phase of that round. To score a wave take one of your color score tokens, with the board you&rsquo;re currently riding, and place it on score track at the number equal to your wave score point value, then discard all the cards/tokens in your score pile.&#10;&#10;",
        "artist": "John Ariosa,Lina Cossette,David Forest"
    },
    {
        "name": "Tokaido Deluxe Edition",
        "description": "TOKAIDO is a game for 2 to 5 players, with unique atmosphere and aesthetics, in which the players are pilgrims on a journey along the legendary East Sea Road of Japan. Along the way, you will try to collect the most beautiful souvenirs, discover glorious vistas, enjoy enriching encounters, soak in soothing hot springs, sample sumptuous cuisine, and much more!&#10;&#10;The Deluxe Edition is the post-Kickstarter public release of parts of the Tokaido Collector's Edition . It does not have all the character tiles and miniatures available in the Collectors Edition, nor are the character miniatures painted. The Tokaido: Matsuri expansion is also not included in this edition.&#10;&#10;This version does include: &#10;- the bigger box of the Collectors Edition&#10;- the giant board of the Collectors Edition&#10;- all cards for Tokaido &#10;- all cards for Crossroads &#10;- 16 character tiles (Tokaido + Crossroads) &#10;- 16 unpainted figurines (Tokaido + Crossroads) &#10;- 5 point markers &#10;- 5 color bases &#10;- metal coins + fabric bag &#10;- soundtrack CD &#10;- Crossroads wooden die &#10;- Tokaido + Crossroads rulebooks&#10;&#10;",
        "artist": "Xavier Gueniffey Durin"
    },
    {
        "name": "Zimby Mojo",
        "description": "Zimby Mojo is a co-opportunistic game for 2-8 players that also supports solo play. Each player is the all-powerful shaman of a tribe of ferocious, conniving, vicious little cannibals called zimbies, and each player has a single goal: to become the new Cannibal King. To achieve their goal, each player will have to use their zimbies to infiltrate the current King&rsquo;s compound, kill him, take his Crown, and carry it safely to their tribal board before a rival zimby tribe can do so first.&#10;&#10;In solo play, the player must use their zimbies, scrolls, and strategy to defeat the Cannibal King, evade his thugs, and bring the Cannibal Crown to their tribal board before time runs out. In a multiplayer game, the players must work together to gain access to the Cannibal King&rsquo;s sanctum before they can confront him. Once they kill the King, however, it&rsquo;s every tribe for itself and the player that reaches their tribal board with the King&rsquo;s Crown immediately becomes the new Cannibal King and wins the game!&#10;&#10;Keep one eye on the Crown.  Keep the other on your back.&#10;&#10;WHAT'S A ZIMBY?&#10;Zimbies are vicious, conniving little cannibals.  They are small, stubborn, anti-heroes in a game of control of a land of nasty little creatures.  They are not human: each zimby tribe has followed its own cultural and evolutionary path -- there are humanoid zimbies, avian zimbies, aquatic zimbies, simian zimbies, ursine zimbies, arachnid zimbies, the list goes on!  That's why there's a bunch of reptilian-eyed, orange-skinned, clawed, stick-haired creatures on the box!  The name &quot;zimby&quot; itself derives from a play on words on the word &quot;zombie&quot; and the designer's love of the cartoon character Invader Zim, who he feels exquisitely exemplifies zimby behavior and fanaticism.&#10;&#10;MORE DETAILED DESCRIPTION OF CONCEPTS AND ELEMENTS&#10;Each player plays the shaman of a different zimby tribe.  Zimbies are nasty, unruly, conniving little cannibals that follow their shaman with fanatical loyalty.  Each player&rsquo;s goal is to bring about the death of the Cannibal King, steal his fallen Crown, and get the Crown to his tribal board so he can become the new Cannibal King.  To do this, the players will have to:&#10;&#10;1. Get some zimbies onto the main game board (you can&rsquo;t get the Crown without a zimby to grab it and carry it home),&#10;2. Cooperate with at least one other tribe to activate a sigil (you can&rsquo;t kill the King unless you can get to him),&#10;3. Kill the Cannibal King (that&rsquo;s the only way he will give up his Crown),&#10;4. Get the Crown and deliver it to your tribal board (you win the game by becoming the new Cannibal King).&#10;&#10;Part 1 of the game is completely cooperative.  Part 2 of the game is completely competitive.&#10;&#10;CREATURES&#10;There are four creature types in the game: zimbies, obnoxious little cannibals that do a shaman&rsquo;s bidding with ruthless (sometimes inept) fanaticism; zombies, undead meat-puppets; thugs, the Cannibal King&rsquo;s dim-witted, fervently devoted brutes; the Cannibal King, the sadistic yet cowardly overlord of the zimby tribes. Shaman are players and don&rsquo;t count as creatures.&#10;&#10;MOJO&#10;Mojo is &quot;a power that may seem magical and allows someone to be very effective, successful, etc.&quot; (Mirriam Webster).  It is the inexplicable, mystical energy than allows shamans to both impel their zimbies into action and release the powerful magical spells bound in the scrolls they raid from the Scroll Library!  But be warned, mojo is drawn from shamans and zimbies!  The more zimbies a shaman sends forth to kill the Cannibal King and steal his Crown, the less mojo that shaman has available!  Every turn, each player (shaman) generates a small amount of mojo and may also draw forth mojo from zimbies on their tribal board, thereby depleting them of energy for the remainder of the turn and rendering them useless. A shaman may also cannibalize (yes, eat!) their own zimbies for more mojo... Of course, eaten zimbies are dead and gone...&#10;&#10;STACKING&#10;Multiple zimbies can stack to form columns which count as single, giant creatures.  The more zimbies in the stack, the stronger they are but the slower they move.  And the shaman whose turn it is fully controls the column...&#10;&#10;SCROLLS, MOVEMENT, AND COMBAT&#10;Shamans may use mojo to empower scrolls to cast one-off rituals, long-lasting incantations, and blindingly fast witcheries.  These cast magical effects -- beneficial and detrimental -- on the shaman themselves.  Shamans also use mojo to move their zimbies on the main board -- so, the more scrolls a shaman uses the less mojo they have available for movement. Combat is a simple 1d6 &quot;roll-off&quot; with the combatant making the higher die roll dealing a number of wounds damage equal to the difference in the die rolls to the combatant making the lower die roll.&#10;&#10;TIMING&#10;Many of a player's actions are limited to the player's turn, such as spawning new zimbies, turning zimbies into zombies, movement and combat.  Players may extract and use mojo at any time on any player's turn.  So, scroll use is always an option!&#10;&#10;FIRST MOVER STRATEGY&#10;At the end of the round, after all the players have gone, the player with the most undepleted zimbies on his tribal board becomes the first mover on the next round.  That player goes first and play proceeds clockwise from them.&#10;&#10;SOLO&#10;There is also a solo mode, which is not only a fully realized game but also very useful to hone the strategies that you will use in your multiplayer games. But be warned: solo play is limited to 12 turns and your score gets lower the more turns you take.  It's not too hard to win, but it's tough to get a high score!&#10;&#10;HAVE FUN WREAKING HAVOC!&#10;&#10;",
        "artist": "Jim Felli,Tani Pettit,Naomi Robinson"
    },
    {
        "name": "Tofu Kingdom",
        "description": "This is a deduction game involving seven characters.  The player assuming the role of Prince Mochi asks each of the other players one question and then guesses which player plays the role of Princess Tofu, the love of Prince Mochi.  When answering Prince Mochi&rsquo;s questions, the other players must either lie or tell the truth in accordance with the cards they hold.&#10;&#10;The player who Prince Mochi deducts (rightly or wrongly) to be Princess Tofu wins the round and receives the number of points specified on his/her card.  The goal of this game is to be the first player to accumulate 7 points.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Baseball Highlights: 2045 – Super Deluxe Edition",
        "description": "Publisher Blurb:&#10;&#10;Baseball Highlights: 2045 is like watching TV highlights of early 21st-century baseball games, with the gameplay being full of theme with no outs or innings and without bogging down in a play-by-play baseball simulation. In this quick and interactive game, two players build their teams as they play, combining both strategy (building your team) and tactics (playing the game) without any of the downtime. Game includes regular head to head play as well as solitaire and 3 player variants and the means to play 4 player tournaments. The game also supports combining boxes for even larger tournaments. 1-4 players 45 minute play time. The Super Deluxe Edition comes with seven mini expansions: Magna Glove, Pitches, Cyborg Hitters, Robots Rally Cap, Coach, Big Fly!, and Errors!.&#10;&#10;",
        "artist": "William Bricker"
    },
    {
        "name": "Tiny Epic Galaxies Deluxe Edition",
        "description": "This Kickstarter-exclusive edition contains, in addition to all the contents of the base game, the mini expansion &quot;Tiny Epic Galaxies: Satellites &amp; Super Weapons Mini Expansion&quot;.&#10;&#10;From the description of Tiny Epic Galaxies:&#10;&#10;A thirty-minute game of galactic conquest, Tiny Epic Galaxies is driven by an exciting dice-rolling mechanism that rewards thoughtful programming of the results. Players control a home galaxy and a fleet of space ships. As players upgrade their galaxies, they gain access to more ships and more dice.&#10;&#10;Each turn, a player rolls a set of dice; how many dice are rolled is determined by the level of that player's galaxy. Each side of the six-sided die represents a different type of action: Movement, Colony Action, Harvest from Culture Planets, Harvest from Energy Planets, Improve an Economic Influence, and Improve a Diplomatic Influence.&#10;&#10;After the roll, the player sorts the results of the roll (one selective re-roll is allowed) and organizes the dice in a desired activation order. Each die, in order, is then resolved and the results are immediate, which allows the player to pull-off unseen combos and surprise other players. Other players have the option to copy other player's actions...at a cost!&#10;&#10;As players expand their galaxy by colonizing other planets through economic and diplomatic influence, they gain victory points AND the special powers brought in by those planets! In addition to galaxy upgrades, effective resource management provides luck-mitigating options that can sway the game in a calculated player's favor.&#10;&#10;Whoever achieves the most points from acquiring planets and upgrading their personal galaxy wins!&#10;&#10;",
        "artist": "William Bricker,Benjamin Shulman"
    },
    {
        "name": "Burger Up",
        "description": "Burger Up is a card matching puzzle game about the art of burger making. Fill orders, earn prestige and be the best burger chef around!&#10;&#10;Players strive to become the most prestigious restaurant by building the biggest Burgers and by using the best ingredients.&#10;&#10;Players take turns, which consist of four phases: the Market phase where players may purchase ingredients from the market, the Building phase where players place up to 3 ingredients on their burgers, the Burger Up! phase where players may score their burgers if they satisfy an order and the clean-up phase where players draw back up to 4 cards.&#10;&#10;The game ends when no more Order cards can be revealed. A bonus is awarded to the Chef who built the most burgers and then the winner is determined, based on who has earned the most coins.&#10;&#10;Contents:&#10;&#10;     21&times; Top Bun Cards&#10;     4&times; Player Aid Cards&#10;     72&times; Ingredient Cards&#10;     8&times; Bottom Bun Cards&#10;     4&times; Spatula Cards&#10;     32&times; $1 Coins&#10;     20&times; $5 Coins&#10;     8&times; $10 Coins&#10;     Rulebook&#10;     Plastic Tray Insert suitable for sleeved cards&#10;&#10;&#10;&#10;&#10;",
        "artist": "Stephen Gibson"
    },
    {
        "name": "Healthy Heart Hospital",
        "description": "Welcome to Anytown, U.S.A. where people grumble about the quality of their health care but still show up at Healthy Heart Hospital hoping they made a smart decision. Much has been said (and even more has been written) about the previous administration&rsquo;s haphazard management of Healthy Heart. In an effort to save the Hospital, you and your allies among its leading Physicians have staged a recent &ldquo;Clinical Coup&rdquo; and taken over the Hospital to restore its prestige. However, actually managing things from the inside is never as easy as it appears from the outside, and juggling the responsibilities at Healthy Heart Hospital can quickly turn even the noblest healer into a money-grubbing pragmatist cynically looking for a place to hide the victims of your &ldquo;care.&rdquo;&#10; Does your team have what it takes to bring Healthy Heart Hospital back to its former glory without becoming Hard Hearted in the process?&#10; Healthy Heart Hospital is a cooperative game for 1 to 5 players, played in rounds, with each player spending actions to treat and (hopefully) cure the various patients that come pouring into the hospital each round. Patients are represented by a number of cubes of various colors. Color represents the type of illness, while the number of cubes represents the severity of the illness.&#10;&#10;",
        "artist": "Chelsea Autio"
    },
    {
        "name": "Barnyard Roundup",
        "description": "Family bluffing card game, aimed at parents and adults that are bored playing old typical games. Fun for both adults and kids, Barnyard Roundup is a game that doesn&rsquo;t feel like a &ldquo;task&rdquo; to play for the adults and is on a level a kid would enjoy.&#10;&#10;The goal of the game is to collect the most valuable farm animals for Farmer Brown to sell on Market Day. You do this by playing cards face-down from your hand and declaring what they are, then giving one other player the choice to decide if you are bluffing or telling the truth. If they choose correctly, THEY get the Farm Animal card(s) you played, but if they guess wrong, YOU get the card instead. Whoever wins Farm Animal cards adds them to their collection. But you may also get Crows, pests that irritate Farmer Brown and count against you in the scoring.&#10;&#10;Collect the most animals by bluffing, baffling and out-guessing your friends! Score the most points and win the game!&#10;&#10;Barnyard Roundup is a family-friendly, appropriate game for ages 7 and up. We have played the game with players as young as 4 and had a lot of fun! Everyone in the family will enjoy this game, we have even brought this out on game night with the adults and had a great time!&#10;&#10;",
        "artist": "Lina Cossette"
    },
    {
        "name": "Tiefe Taschen",
        "description": "In this game the players are corrupt politicians with the goal to grub as much money as possible. One player distributes money from the treasury. After intensive negotiations the players vote. If a majority votes against the proposed distribution the current president has to resign and another player becomes president. &#10;  &#10;Besides voting the players can also blackmail and bribe each other.&#10;&#10;",
        "artist": "Christian Opperer,Gregor Zolynski"
    },
    {
        "name": "4 Gods",
        "description": "Four Gods is a real-time tile-laying game in which players create a world &mdash; one tile at a time &mdash; before laying claim to one of the four gods of their world and attempting to win followers by sending prophets into that world.&#10;&#10;In more detail, players sit outside of a cardboard frame that represents the limits of the world. Each player starts with two randomly-drawn tiles in hand, with each double-sided tile depicting 1-3 types of landscape out of the four types present in the world.&#10;&#10;When play begins, each player simultaneously starts laying tiles into the frame; each tile must be adjacent to two sides to be placed, so initially tiles can be placed only in the corners of the frames, with players building inward from there. Players can place tiles anywhere that they can legally be placed (two sides are adjacent to the frame or previously placed tiles and all landscapes match across tile borders.&#10;&#10;Instead of placing a tile, a player can place it in their personal discard area, which can hold at most ten tiles. When a player has both hands free, they can draw two new tiles from the bag; alternatively, any player with a free hand can pick up any tile in any discard area and place it in the world.&#10;&#10;At any point during the game, a player can claim one of four gods and that god's followers. Each god is associated with a particular type of landscape, e.g., the merfolk god. Once a player has followers, they can place a prophet on a tile they just placed to claim that section of landscape. Players can place any number of prophets in a landscape as long as they're placing each prophet on a tile they just added to the world.&#10;&#10;At any point in the game, if a player thinks that a section of the board cannot be filled with a tile &mdash; e.g., a space that's surrounded by four types of landscapes &mdash; that player can place a round city marker in that space, and then claim that city with a prophet. If a matching tile is found later, a player can &quot;smash&quot; and collect that city, replacing it with the tile.&#10;&#10;Once the world is filled or players agree that no more tiles can be placed, the game ends. Each player scores five points for each city occupied or smashed. Each landscape with one or more prophets is worth a number of points to the player(s) with the most prophets in it equal to the number of tiles in that landscape minus the number of prophets in it. The landscape with the largest mass rewards its god with a large bonus, with the second and third largest masses rewarding their gods with smaller bonuses; similarly, the landscape that appears in the most distinct groups rewards its god with a large bonus, with the second and third largest groups again rewarding their gods with smaller bonuses.&#10;&#10;Whichever god has scored the most points wins!&#10;&#10;",
        "artist": "Ismaël Pommaz"
    },
    {
        "name": "Far East War 1592",
        "description": "In 1592, Japanese Taikou (&#229;&#164;&#170;&#233;&#150;&#163;) Toyotomi Hideyoshi showed his great ambition to conquer China (Ming Dynasty). His proposal to Korea (Joseon Dynasty) to march through their territory was denied, and there began The Imjin War.&#10;&#10;In Far East War 1592, players are divided into Japan and China/Korea factions, with each side trying to conquer the target provinces of their rivals. Players alternate to move around the action roundel to perform different actions such as recruit forces, assign generals, march armies, initiate battles, etc. With careful planning on the action roundel, tactical movement and assignment of troops and generals, and a bit luck in dice roll during battles, players should revive the vivid history in the Far East War.&#10;&#10;&#229;&#156;&#168;1592&#233;&#128;&#153;&#228;&#184;&#128;&#229;&#185;&#180;&#239;&#188;&#140;&#230;&#172;&#138;&#229;&#130;&#190;&#228;&#184;&#128;&#230;&#153;&#130;&#231;&#154;&#132;&#232;&#177;&#144;&#232;&#135;&#163;&#231;&#167;&#128;&#229;&#144;&#137;&#233;&#135;&#142;&#229;&#191;&#131;&#230;&#188;&#171;&#229;&#135;&#186;&#230;&#151;&#165;&#230;&#156;&#172;&#230;&#156;&#172;&#229;&#179;&#182;&#239;&#188;&#140;&#229;&#144;&#145;&#230;&#156;&#157;&#233;&#174;&#174;&#230;&#143;&#144;&#229;&#135;&#186;&#227;&#128;&#140;&#229;&#129;&#135;&#233;&#129;&#147;&#229;&#133;&#165;&#230;&#152;&#142;&#227;&#128;&#141;&#231;&#154;&#132;&#231;&#139;&#130;&#229;&#166;&#132;&#232;&#166;&#129;&#230;&#177;&#130;&#227;&#128;&#130;20&#232;&#144;&#172;&#229;&#164;&#167;&#232;&#187;&#141;&#232;&#168;&#136;&#231;&#149;&#171;&#231;&#169;&#191;&#233;&#129;&#142;&#230;&#156;&#157;&#233;&#174;&#174;&#229;&#141;&#138;&#229;&#179;&#182;&#239;&#188;&#140;&#230;&#148;&#187;&#230;&#137;&#147;&#230;&#152;&#142;&#230;&#156;&#157;&#239;&#188;&#140;&#229;&#190;&#129;&#230;&#156;&#141;&#230;&#149;&#180;&#229;&#128;&#139;&#230;&#157;&#177;&#228;&#186;&#158;&#227;&#128;&#130;&#233;&#128;&#153;&#229;&#160;&#180;&#228;&#186;&#158;&#230;&#180;&#178;&#231;&#137;&#136;&#228;&#184;&#137;&#229;&#156;&#139;&#229;&#191;&#151;&#239;&#188;&#140;&#229;&#190;&#158;&#230;&#181;&#183;&#228;&#184;&#138;&#230;&#137;&#147;&#229;&#136;&#176;&#233;&#153;&#184;&#229;&#156;&#176;&#239;&#188;&#140;&#229;&#131;&#181;&#230;&#140;&#129;&#228;&#186;&#134;&#232;&#182;&#133;&#233;&#129;&#142;6&#229;&#185;&#180;&#239;&#188;&#140;&#229;&#143;&#178;&#231;&#168;&#177;&#229;&#163;&#172;&#232;&#190;&#176;&#229;&#128;&#173;&#228;&#186;&#130;&#227;&#128;&#129;&#230;&#150;&#135;&#231;&#165;&#191;/&#230;&#133;&#182;&#233;&#149;&#183;&#228;&#185;&#139;&#229;&#189;&#185;&#227;&#128;&#129;&#232;&#144;&#172;&#230;&#155;&#134;&#230;&#156;&#157;&#233;&#174;&#174;&#228;&#185;&#139;&#229;&#189;&#185;&#239;&#188;&#140;&#228;&#189;&#134;&#230;&#156;&#128;&#231;&#130;&#186;&#228;&#186;&#186;&#231;&#159;&#165;&#231;&#154;&#132;&#231;&#168;&#177;&#229;&#145;&#188;&#231;&#130;&#186;&#239;&#188;&#154;&#227;&#128;&#140;&#229;&#163;&#172;&#232;&#190;&#176;&#228;&#185;&#139;&#230;&#136;&#176;&#227;&#128;&#141;&#227;&#128;&#130;&#10; &#230;&#151;&#165;&#232;&#187;&#141;&#233;&#128;&#178;&#230;&#148;&#187;&#229;&#136;&#157;&#230;&#156;&#159;&#239;&#188;&#140;&#229;&#139;&#162;&#229;&#166;&#130;&#231;&#160;&#180;&#231;&#171;&#185;&#239;&#188;&#155;&#230;&#156;&#157;&#233;&#174;&#174;&#231;&#142;&#139;&#231;&#175;&#128;&#231;&#175;&#128;&#230;&#149;&#151;&#233;&#128;&#128;&#239;&#188;&#140;&#231;&#142;&#139;&#228;&#186;&#172;&#230;&#188;&#162;&#229;&#159;&#142;&#227;&#128;&#129;&#233;&#153;&#170;&#233;&#131;&#189;&#229;&#185;&#179;&#229;&#163;&#164;&#231;&#155;&#184;&#231;&#185;&#188;&#229;&#164;&#177;&#229;&#174;&#136;&#239;&#188;&#140;&#232;&#162;&#171;&#233;&#128;&#188;&#232;&#135;&#179;&#233;&#180;&#168;&#231;&#182;&#160;&#230;&#177;&#159;&#231;&#149;&#148;&#239;&#188;&#140;&#230;&#177;&#130;&#232;&#171;&#139;&#230;&#152;&#142;&#230;&#156;&#157;&#230;&#149;&#145;&#230;&#143;&#180;&#227;&#128;&#130;&#228;&#184;&#173;&#230;&#151;&#165;&#233;&#159;&#147;&#228;&#184;&#137;&#229;&#156;&#139;&#230;&#150;&#188;&#230;&#152;&#175;&#229;&#156;&#168;&#230;&#156;&#157;&#233;&#174;&#174;&#229;&#141;&#138;&#229;&#179;&#182;&#239;&#188;&#140;&#229;&#177;&#149;&#233;&#150;&#139;&#230;&#191;&#128;&#231;&#131;&#136;&#233;&#167;&#129;&#231;&#129;&#171;&#227;&#128;&#130;&#10;&#231;&#142;&#169;&#229;&#174;&#182;&#228;&#184;&#128;&#229;&#136;&#134;&#230;&#137;&#174;&#230;&#188;&#148;&#230;&#151;&#165;&#230;&#156;&#172;&#239;&#188;&#140;&#229;&#143;&#166;&#228;&#184;&#128;&#230;&#150;&#185;&#230;&#137;&#174;&#230;&#188;&#148;&#230;&#152;&#142;&#230;&#156;&#157;&#232;&#136;&#135;&#230;&#156;&#157;&#233;&#174;&#174;&#239;&#188;&#140;&#229;&#150;&#132;&#231;&#148;&#168;&#230;&#137;&#139;&#228;&#184;&#173;&#231;&#154;&#132;&#230;&#173;&#166;&#229;&#176;&#135;&#239;&#188;&#140;&#232;&#170;&#191;&#229;&#186;&#166;&#229;&#160;&#180;&#228;&#184;&#138;&#231;&#154;&#132;&#233;&#131;&#168;&#233;&#154;&#138;&#239;&#188;&#140;&#231;&#178;&#190;&#231;&#174;&#151;&#229;&#130;&#153;&#231;&#148;&#168;&#231;&#154;&#132;&#231;&#179;&#167;&#233;&#164;&#137;&#239;&#188;&#140;&#233;&#130;&#132;&#232;&#166;&#129;&#233;&#160;&#144;&#233;&#152;&#178;&#230;&#156;&#170;&#231;&#159;&#165;&#228;&#186;&#139;&#228;&#187;&#182;&#229;&#176;&#141;&#232;&#187;&#141;&#230;&#131;&#133;&#229;&#184;&#182;&#228;&#190;&#134;&#231;&#154;&#132;&#229;&#189;&#177;&#233;&#159;&#191;&#227;&#128;&#130;&#232;&#170;&#176;&#232;&#131;&#189;&#230;&#148;&#187;&#228;&#184;&#139;&#230;&#136;&#176;&#229;&#189;&#185;&#228;&#184;&#173;&#231;&#154;&#132;&#231;&#155;&#174;&#230;&#168;&#153;&#239;&#188;&#140;&#229;&#176;&#177;&#232;&#131;&#189;&#230;&#136;&#144;&#231;&#130;&#186;&#227;&#128;&#140;&#229;&#163;&#172;&#232;&#190;&#176;&#228;&#185;&#139;&#230;&#136;&#176;&#227;&#128;&#141;&#228;&#184;&#173;&#231;&#154;&#132;&#230;&#156;&#128;&#229;&#190;&#140;&#229;&#139;&#157;&#229;&#136;&#169;&#232;&#128;&#133;&#227;&#128;&#130;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Here, Kitty, Kitty!",
        "description": "In the crazy cat-collecting game Here, Kitty, Kitty!, your neighborhood has a cat problem, the problem being that the cats don't all belong to YOU! Unfortunately you can't just grab them for yourself as everyone in the neighborhood wants to claim those adorable kitties. Outwit your fellow feline fiends as you lure cats onto your property, move cats into your house, and steal cats from your neighbors. All's fair in love and cat-collecting!&#10;&#10;In the game, each player chooses a Property board, which contains three zones: the Yard, the Porch, and the House. At the end of the game, cats in the House are worth 5 points each, cats on the Porch are worth 3 points each, and cats in your Yard are worth 0 points. However, having cats in your Yard does have advantages for special scoring conditions, such as having the most cats of a single color or the most cats overall. All 40 cat miniatures are placed in the center of the table, and represent the Neighborhood. Each player is dealt 2 or 3 cards, depending on the number of players in the game.&#10;&#10;On each player's turn, they perform two Actions: moving a cat, playing a card, or discarding cards. Cats can be moved 1 space for 1 Action, by picking up the cat and putting it in the next zone of the property. For example, a cat can be moved from the Neighborhood to the Yard for 1 Action, or from the Yard to the Porch or from the Porch to the Yard (and vice versa). Playing cards may allow a player to move multiple cats at once, to move cats multiple spaces, to steal cats from opponents, or to make opponents give up cats. A player may also choose to discard 1, 2, or 3 cards as an Action. Once both Actions have been taken, the player draws back up to a full hand, and play passes to the person to the left. If an Instant card (red border) is drawn, it is played immediately and affects the entire group. The player then draws a replacement card for the Instant card until a full hand is achieved.&#10;&#10;The final round is triggered when a player draws the last card from the draw pile. From that point every player, including the player who drew the last card, has one final turn to maximize their score. Then, the cats are counted and a winner is lauded for their purr-procurement proficiency.&#10;&#10;",
        "artist": "Tony Steele"
    },
    {
        "name": "Marvel Dice Masters: Civil War",
        "description": "Marvel Dice Masters: Civil War is a collectible dice-building tabletop game designed by Quarriors! creators Michael Elliott and Eric M. Lang.&#10;&#10;WizKids has announced a Civil War set for its popular Marvel Dice Masters Collectible Dice Game.  Marvel Dice Masters: Civil War will include Starter Sets, Foil Packs, a Team Box, a Collector&rsquo;s Box, a Playmat, and a Dice Bag. Release is planned for May.&#10;&#10;Based on the Marvel comic book Civil War storyline, the set will include iconic characters from both sides of the conflict, like Spider-Man, Captain America, and Iron Man. It will also introduce new mechanics for the game:  Thunderbolts, Enlistment, and New Warriors.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Quissama",
        "description": "Rio de Janeiro, 1868. Quissama is a fugitive slave  from guaiamum malta who counts on English detective Woodruff to help him find Bernardina, his missing mother. At the same time, he needs to run from Alem&atilde;o and his malta, who wants to capture him. Ara&uacute;jo wants to make his business prosper, but Alencar is eyeing the political influence. In the court, the Princess wants to set slaves freed, while the Emperor uses his power as he pleases. In the squares, you will face the capoeira fighting between Nagoas and Guaiamuns, which divide the Rio de Janeiro at the time. Choose your characters and take part in this plot!&#10;&#10;How to play&#10;Draw, combine and use your cards to establish your territory in Rio de Janeiro, 1868. Place your meeples and prosper thanks to coins that will help open trades, free slaves and employ capoeiras. With some card combinations, get the right to choose a character. Use your skills and reach your goal to win the match. But be careful with your opponents! They can cause malta attacks against your territory, deploy your ministers or steal the characters you worked hard to win. Go through all scandals and the power of money and be the first to reach one of your characters' goal!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Dark Mages",
        "description": "In a distant land covered in lush forests and bordered by hills and mountains, magicians battle mercilessly on the plains of Th&auml;rin. The end goal: to defeat all adversaries and become the Northland continent's most legendary magician.&#10;&#10;Dark Mages is a 120-card game that can be played by 2 to 8 players. It is a game of both luck and strategy that can last anywhere from 20 to 60 minutes.&#10;&#10;This game contains 8 character cards, 112 playing cards, rules and instructions, 7 polyhedron dice (d4, d6, d8, d10, d12, d20 and d00), and a velvet pouch.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Zooscape",
        "description": "The animals have escaped from the zoo, and it's up to the zookeepers to get everyone back in their cages &mdash; but lots of things can happen while you're chasing critters...&#10;&#10;In Zooscape, originally released as Curio Collectors (&#227;&#129;&#175;&#227;&#130;&#147;&#227;&#129;&#139;&#233;&#128;&#154;&#233;&#170;&#168;&#232;&#145;&#163;&#229;&#184;&#130;), you must prove yourself the best zookeeper by rounding up animals worth the most points, but remember that all the animals need enough space in their cage to stay happy! Shove too many in one cage, and they'll be worth almost nothing to you.&#10;&#10;In each round, someone deals a line of twelve cards face up on the table; each card depicts an animal (a curio in the original version) along with a point value and a limit. The starting player splits the line in two by choosing a dividing point. Each player holds two cards showing the left or right group, and each player chooses, then simultaneously reveals which group of cards they want. If only one player chooses a side, they take all the cards in that group and add them to their personal tableau. If a side is chosen by more than one player, however, then one of the players who chose it splits that group into two smaller groups, then everyone who originally chose this group secretly votes again for which group they want. This process repeats with each group until either each player has taken some number of cards or groups have been reduced to single cards and two or more players are still voting to take them; in this case, those single cards are placed in a special pile. At the start of a round, the starting player adds a special card to the line-up and whoever wins this card collects all of the animals in this special pile.&#10;&#10;Players complete three rounds this way, then score points. If a group of cards has exceeded the limit on it &mdash; say, by collecting four cards when the limit is three &mdash; then the owner of these cards scores only 1 point per card instead of the point value for each card. Some cards in the game allow you to remove cards from your collection, possibly allowing you to stay under the limit and score more points. You might also start trying not to win cards so as not to spoil the value of what you've already collected. (In Curio Collectors, you would effectively crash the market value for an item by trying to sell too many of them at one time.)&#10;&#10;Whoever has the most points wins!&#10;&#10;",
        "artist": "Katy Lipscomb,Ryo Nyamo"
    },
    {
        "name": "Star Wars: Rebellion",
        "description": "From the publisher:&#10;&#10;Star Wars: Rebellion is a board game of epic conflict between the Galactic Empire and Rebel Alliance for two to four players!&#10;&#10;Experience the Galactic Civil War like never before. In Rebellion, you control the entire Galactic Empire or the fledgling Rebel Alliance. You must command starships, account for troop movements, and rally systems to your cause. Given the differences between the Empire and Rebel Alliance, each side has different win conditions, and you'll need to adjust your play style depending on who you represent:&#10;&#10;     As the Imperial player, you can command legions of Stormtroopers, swarms of TIEs, Star Destroyers, and even the Death Star. You rule the galaxy by fear, relying on the power of your massive military to enforce your will. To win the game, you need to snuff out the budding Rebel Alliance by finding its base and obliterating it. Along the way, you can subjugate worlds or even destroy them.&#10;     As the Rebel player, you can command dozens of troopers, T-47 airspeeders, Corellian corvettes, and fighter squadrons. However, these forces are no match for the Imperial military. In terms of raw strength, you'll find yourself clearly overmatched from the very outset, so you'll need to rally the planets to join your cause and execute targeted military strikes to sabotage Imperial build yards and steal valuable intelligence. To win the Galactic Civil War, you'll need to sway the galaxy's citizens to your cause. If you survive long enough and strengthen your reputation, you inspire the galaxy to a full-scale revolt, and you win.&#10;&#10;&#10;&#10;&#10;Featuring more than 150 plastic miniatures and two game boards that account for thirty-two of the Star Wars galaxy's most notable systems, Rebellion features a scope that is as large and sweeping as any Star Wars game before it.&#10;&#10;Yet for all its grandiosity, Rebellion remains intensely personal, cinematic, and heroic. As much as your success depends upon the strength of your starships, vehicles, and troops, it depends upon the individual efforts of such notable characters as Leia Organa, Mon Mothma, Grand Moff Tarkin, and Emperor Palpatine. As civil war spreads throughout the galaxy, these leaders are invaluable to your efforts, and the secret missions they attempt will evoke many of the most inspiring moments from the classic trilogy. You might send Luke Skywalker to receive Jedi training on Dagobah or have Darth Vader spring a trap that freezes Han Solo in carbonite!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Covert",
        "description": "Control your network of spies, gather intel, and break codes in Covert, a game of tactical dice placement, set collection, and timing set in Cold War Europe. Players race to complete high risk Missions by deploying their agents and acquiring the necessary equipment, all while keeping an eye on the needs of future missions and the advances of rival agencies.&#10;&#10;Each round, players roll their hand of dice and in turn allocate them to different actions, like moving their Agents, acquiring Agency Cards, completing and acquiring new Missions, and more. Dice are placed on action circles that require players to place their dice numerically adjacent to dice that have already been placed, allowing for rival agencies to thwart their plans &mdash; but a good Agent always has a backup plan, and there are ways around everything that stands in your way.&#10;&#10;Covert combines simple concepts with a depth of play that allows players the freedom to combine special abilities and card combos to complete their Missions and overcome obstacles. Utilize your assets. Make your move. Don't let anyone stand in your way.&#10;&#10;",
        "artist": "Luis Francisco,Hokunin,Scott Nicely,Chris Ostrowski"
    },
    {
        "name": "The Horus Heresy: Betrayal at Calth",
        "description": "From the official description:&#10;&#10;&quot;The Horus Heresy: Betrayal At Calth is a fantastic standalone boxed game of claustrophobic tunnel combat, set during the Word Bearers&rsquo; invasion of the Ultramarine world of Calth. Emphasising fast-paced squad-based combat during six exciting missions, it allows players to choose their side and command a force of beautifully detailed Citadel miniatures in a brutal war for survival, during one of the iconic battles of the Horus Heresy.&quot;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Pathfinder Adventure Card Game: Mummy's Mask – Base Set",
        "description": "On the Threshold of Discovery! The ancient lands of Osirion are blanketed by the sands of time, and eldritch secrets and vast riches lie just beneath the sun-blistered surface. As modern Osirion opens its tombs to outsiders for the first time in centuries, many of these lost treasures and secrets are now emerging&mdash;some more malign than others. Can your group of heroes brave terrible guardians, foul cults, and the burning sands of the desert to stop the rebirth of an ancient tyrant?&#10;&#10;This complete cooperative strategy game pits 1 to 4 heroes against the monsters, curses, and traps of the Mummy&rsquo;s Mask Adventure Path. Choose your character&rsquo;s class, build a deck of equipment, magic, and allies; and explore dangerous locations as you journey through an exciting fantasy tale. As your adventures continue, your characters add unique gear and awesome magic to their decks as they gain incredible powers, all of which they&rsquo;ll need to challenge more and more powerful threats.&#10;&#10;The Pathfinder Adventure Card Game: Mummy&rsquo;s Mask Base Set includes:&#10;&#10;. More than 500 cards, featuring 7 character classes, a wide array of gear and magical treasures,&#10;and dozens of allies, monsters, and villains from the Mummy&rsquo;s Mask storyline.&#10;. &quot;The Half-Dead City Adventure Deck,&quot; which begins your journey through the Mummy&rsquo;s Mask Adventure Path.&#10;. A complete set of 5 polyhedral dice.&#10;&#10;",
        "artist": "Tyler Jacobson"
    },
    {
        "name": "The Banner Saga: Warbands",
        "description": "The Banner Saga: Warbands is a cooperative game for 1-4 players. Players take up the role of the leaders in a warband tasked with keeping the warband together and alive. It is a cooperative, miniatures board game that deals with the difficulties and consequences of decision making.&#10;&#10;There are four roles in the warband: Quartermaster, Keeper of Names, Warmaster, and Thane. Each role must aggressively push for resolutions that help out themselves, while being open to compromise for the good of the warband. It is this conflict and compromise that is the heart of Warbands.&#10;&#10;",
        "artist": "Keith Lowe"
    },
    {
        "name": "Glen Drover's Empires: Galactic Rebellion",
        "description": "Description from the publisher:&#10;&#10;Rebellion simmers in the corners of the Galactic Empire and several rival factions are gathering forces in the hope of overthrowing the corrupt Senate by defeating the Sentinels that keep them in power. These rebel factions, each with their own vision of what life in the galaxy should be, despise each other almost as much as they hate the corrupt Galactic Senate. However, only one can wield ultimate power in the galaxy.&#10;&#10;You are the leader on one such rebel faction You must recruit and train key specialists to help you fight and win a Galactic Rebellion. Scientists will perform research on new technologies that can tip the balance in your favor. Smugglers will help you build a trade network while Diplomats will join the Senate in hopes of influencing critical decisions. Heroes will conduct Covert Missions to aid your rebel cause and Troopers will fight your battles as they flare up on planets across the galaxy.&#10;&#10;Empires: Galactic Rebellion is a sequel to Empires: Age of Discovery using similar overall mechanisms. However, many of the specific actions have been reworked to follow the theme and new spheres of activities have been added to create an entirely new experience, including Covert Missions, The Galactic Senate and Capital Ship Fleets.&#10;&#10;As the Rebel Faction Leader, you must lead your rebellion to free the galaxy from tyranny and thereby achieve ultimate victory!&#10;&#10;",
        "artist": "Paul Niemeyer"
    },
    {
        "name": "Nerdy Inventions",
        "description": "We are a group of nerd inventors. In this competition, who can invent the most prolific inventions and become the nerdiest inventor?&#10;&#10;Nerdy Inventions (&#231;&#153;&#186;&#230;&#152;&#142;&#227;&#130;&#170;&#227;&#130;&#191;&#227;&#130;&#175;&#227;&#129;&#174;&#230;&#128;&#170;&#229;&#165;&#135;&#227;&#129;&#170;&#229;&#130;&#145;&#228;&#189;&#156;) is a game for 2-4 players that takes about 25-30 minutes. Players take turns until the game meets one of the ending conditions.&#10;&#10;In each turn, the active player rolls 3 dice. Then he may do the following 4 actions as many times as he wants (the actions can be done repeatly). When he cannot or decide not to take any more actions, he passes and next player's turn begins. The 4 available actions are:&#10;&#10;     Use your own invention card&#10;     Charge your own invention card&#10;     Research (Swap uninvented cards)&#10;     Build (Take) invention card&#10;&#10;&#10;&#10;&#10;Invention cards provide victory points and abilities. At the end of the game, the player with the highest total of victory points wins the game!&#10;&#10;",
        "artist": "Chih-Fan Chen"
    },
    {
        "name": "Islebound (Kickstarter edition)",
        "description": "The Kickstarter Edition includes the Metropolis Expansion, which comprises 40 new building cards and 2 extra Reputation cards.&#10;&#10;&#10;In Islebound, you take command of a ship and crew. You sail to island towns, collecting resources, hiring crew, and commissioning buildings for your capital city. Each building has a unique ability, and your combination of buildings can greatly enhance your strength as a trader, builder, or invader. You also recruit pirates and sea monsters to conquer towns, which, once conquered, allow you to complete the town action for free, and charge a fee to opponents if they want to use it. Alternatively, you can complete events that give influence, which can be used to befriend towns.&#10;&#10;There are many routes to success. Will you be a ruthless conqueror, careful diplomat, or shrewd merchant in your race to the top?&#10;&#10;The player with the most wealth and most-impressive capital city will win the game!&#10;&#10;",
        "artist": "Ryan Laukat"
    },
    {
        "name": "Pyramid Arcade",
        "description": "Pyramid Arcade is a compilation of 22 games that can be played with &quot;Looney Pyramids&quot; and assorted other components. Looney Pyramids are colored pyramids in three sizes that can nest together.&#10;&#10;The plan for Pyramid Arcade is to focus on games that can be played with three or fewer trees of each color, and include ten colors of pyramids (ninety in all). Pyramid Arcade will also include numerous boards, nine dice, and a rulebook explaining all the games.&#10;&#10;The individual games are:&#10;&#10;     Black Ice&#10;     Color Wheel&#10;     Give or Take&#10;     Hijinks&#10;     Homeworlds&#10;     IceDice&#10;     IceTowers&#10;     Launchpad 23&#10;     Looney Ludo&#10;     Lunar Invaders&#10;     Martian Chess&#10;     Petal Battle&#10;     Petri Dish&#10;     Powerhouse&#10;     Pharaoh&#10;     Pyramid Shambo&#10;     Treehouse&#10;     Twin Win&#10;     Verticality&#10;     Volcano (v3.0, aka Fiesta Caldera)&#10;     World War 5&#10;     Zark City&#10;&#10;&#10;&#10;&#10;",
        "artist": "Eileen Tjan"
    },
    {
        "name": "Nine Tiles",
        "description": "In Nine Tiles, each player takes nine double-sided tiles, with each side of a tile having one of six images, and arranges them in a 3x3 gird. Each image appears a total of three times on the tiles, with it being paired with a different image in each of the three instances. (The sets of nine tiles are identical, and they have 1-4 dots on them to help players sort the tiles.)&#10;&#10;Each round, one of the thirty goal cards is revealed, then players race to rearrange their tiles &mdash; flipping one tile at a time, or swapping two tiles &mdash; in order to make their nine tiles match the image shown on the card. Whenever a player thinks they've done this, they slap the card. If they're correct, they keep the card; if they're wrong, they still keep the card, but flipped face-down. If a player collect two face-down cards, they're out of the game.&#10;&#10;The first play to collect four (face-up) cards wins!&#10;&#10;By combining two sets of Nine Tiles, up to eight players can compete at once. When more than four people are in a game, reveal two of the thirty cards each round. Each player can claim at most one card in a round.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Deadfall",
        "description": "Deadfall is a gambling / bluffing game. Players ante one coin to begin and start with a hand of six cards. Everyone plays one card, and the lowest of these will go first.&#10;&#10;On your turn you may either play a new card face up or call one of your opponents. When you play a card, you are trying not to play the last card of that rank. For example, if you play a 5, you are declaring that someone's hand still contains a 5. If you have one, you know you're safe. If not, you're making an educated guess.&#10;&#10;A call ends the hand. When you call another player, you are saying that they were wrong when they played their last card, and there are no more cards of that rank left in anyone's hand. If the caller is right, she wins the pot, plus a penalty equal to the rank of the card, paid by the called player. (For example, 7 coins for calling a 7.) If the caller is wrong, the called player wins the pot, and he wins the same penalty from the caller.&#10;&#10;There are two ways to get ahead in Deadfall: You can catch people when they play the wrong cards, and you can trick others into calling you when you're safe.&#10;&#10;",
        "artist": "Bill McGuire"
    },
    {
        "name": "Taluva Deluxe",
        "description": "In Taluva, players attempt to successfully settle a South Sea island slowly emerging from the ocean waters as volcano after volcano erupts.&#10;&#10;Each turn, players decide to either have a new volcano erupt along the shore, increasing the size of the island, or to have an existing volcano erupt again, increasing the height of the land around it (and possibly destroying parts of existing settlements). They do this by placing a new tile, consisting of one volcano and two other types of landscape. A tile must always touch at least one other tile, when placed at sea level, or be placed on top of at least two other tiles (without any gaps under the land being created), with the volcano being placed on top of an existing volcano.&#10;Next, the player will place one or more wooden buildings; huts, temples or towers. Settlements must always start at the lowest level, by placing a single hut. From there on, existing settlements may expand by placing huts on all hexes of a single type of terrain around the settlement, with temples once the settlement takes up at least three hexes, or with towers, placed at level three or above.&#10;&#10;The game ends when all tiles have been placed. At that point, the player who's placed most temples wins. Ties are broken by towers, then huts. Ultimate victory - and an immediate end to the game - waits for the player who manages to place all their buildings of two types. Immediate defeat is also possible, when no buildings can legally be played during a player's turn.&#10;&#10;A lot of strategy results from the various placement rules. Volcanoes may never fully destroy a settlement, so single huts can block volcano placement, protecting other settlements. Alternatively, a well placed volcano can split a large settlement in two, creating the opportunity for both to expand more rapidly than a new settlement would. Limiting your opponent's growth potential is at least as important as preparing the terrain for you to expand upon...&#10;&#10;The Deluxe edition contains the basic Taluva game at increased size, as well as the following new expansions:&#10;&#10;     Ship expansion: A new wooden piece, which can be placed in lagoons, adjacent to settlements&#10;     2-Hex tiles expansion&#10;&#10;&#10;&#10;&#10;",
        "artist": "Charlotte Bey,Xavier Gueniffey Durin,Mathieu Moreau"
    },
    {
        "name": "Draconis Invasion",
        "description": "Battle the dark powers of Draconis in the ultimate medieval fantasy deck-building game.&#10;&#10;With over 500 beautifully illustrated cards, Draconis Invasion is a fast-paced deck-builder for 1-6 opponents, lasting approximately 45 minutes, with hordes of Invaders attacking your kingdom, and players racing to gather armies, gold, and special action cards to fight the enemy. Unlike other deck-building card games, Draconis Invasion incorporates hidden Campaign cards that reward points for killing specific Invaders, Terror cards and the Terror Die that add a doomsday clock so that your armies become tired and weak as time passes, and triggered Event cards that target the game-leader with potentially disastrous effects. Kill 6 Invaders or exhaust the Events cards to end the game. When the dust settles, only one hero will stand victorious as the realm's greatest champion.&#10;&#10;",
        "artist": "Juan Pablo Fernández,Vuk Kostic,Manthos Lappas,Grzegorz Pedrycz,Unrealsmoker"
    },
    {
        "name": "Avignon: A Clash of Popes",
        "description": "Avignon is a quick influence manipulation card game in which the two players are rival candidates for Pope in the 14th century. Players gain influence by petitioning members of the medieval Church, such as Cardinals, Nobles, and Knights, and using the characters' unique powers to pull the character cards over to their side of the table (their congregation), or force an opponent to push cards towards them. The first player to get three characters into their congregation wins.&#10;&#10;",
        "artist": "Fabrice Weiss"
    },
    {
        "name": "Complots",
        "description": "A corrupt city, subject to vice and avarice, is under the control of vile characters. The seat of power is vacant and waiting for you to take it &mdash; unless someone else takes it first.&#10;&#10;In Complots, as in the original game Coup, you control two characters and start with two coins, and through trickery, manipulation and bluffing, you want to eliminate all other players who stand in your way, possibly by having them eliminate one another along the way.&#10;&#10;The 24-card deck includes four copies of six different characters, each with a unique set of powers:&#10;&#10;&#10;     Duke: Take three coins from the treasury. Block someone from taking foreign aid.&#10;     Assassin: Pay three coins and try to assassinate another player's character.&#10;     Contessa: Block an assassination attempt against yourself.&#10;     Captain: Take two coins from another player, or block someone from stealing coins from you.&#10;     Ambassador: Draw two character cards from the Court (the deck), choose which (if any) to exchange with your face-down characters, then return two. Block someone from stealing coins from you.&#10;     Inquisitor: Draw one character card from the deck and choose whether or not to exchange it with one of your face-down characters, or force an opponent to show you one of their character cards (their choice). If you wish, you may then force them to draw a new card from the deck. They then shuffle the old card into the deck. Block someone from stealing coins from you.&#10;&#10;&#10;(Either the Ambassador or the Inquisitor can be used in a game, not both.)&#10;&#10;On your turn, you can take any of the actions listed above, regardless of which characters you actually have in front of you, or you can take one of three other actions:&#10;&#10;&#10;     Income: Take one coin from the treasury.&#10;     Foreign aid: Take two coins from the treasury.&#10;     Coup: Pay seven coins and launch a coup against an opponent, forcing that player to lose an character. (If you have ten coins or more, you must take this action.)&#10;&#10;&#10;When you take one of the character actions &ndash; whether actively on your turn, or defensively in response to someone else's action &ndash; that character's action automatically succeeds unless an opponent challenges you. In this case, if you can't (or don't) reveal the appropriate character, you lose an influence, turning one of your characters face-up. Face-up characters cannot be used, and if both of your characters are face-up, you're out of the game.&#10;&#10;If you do have the character in question and choose to reveal it, the opponent loses a character of their own, then you shuffle that character into the deck and draw a new one, perhaps getting the same character again and perhaps not.&#10;&#10;The last player to still have a face-down character wins the game!&#10;&#10;",
        "artist": "Xavier Gueniffey Durin"
    },
    {
        "name": "Ravenous River",
        "description": "In Ravenous River, each player takes the role of an animal trying to cross the river. The roles are hidden, so you don't know which players are predator or prey. Be careful not to end up on a boat with the wrong animal, or you'll end up as its lunch! Use your feral cunning to trap your prey on the same boat for a tasty treat while you cross the river. The player who scores the most points by crossing the river, eating their prey, and avoiding being eaten themselves wins!&#10;&#10;In more detail, Ravenous River includes seven animals, with each animal (e.g., horse) having a predator (bull) and a prey (hound). At the start of each round, each player secretly receives an animal card, and they want to feed that animal and get it safely home. Shuffle seven animal cards, then place them face down in a row on the riverbank. Place two boat cards near this bank; each boat can hold at most two animals. Deal each player two action cards. On a turn, a player either:&#10;&#10;&#10;    Places an animal: The player looks at animal card, then either places it face up on a boat or discards an action card and places it face down on the riverbank again.&#10;    Moves an animal: The player discards an action card, then either moves an animal from a boat to the bank or from the bank to a boat.&#10;    Plays an action card: The player discards an action card and performs that action.&#10;&#10;&#10;If a player has no cards in hand at the end of their turn and both boats are full, players simultaneously vote on whether to end the round or not. If they do end it, players first see who eats whom on the riverbank, then who eats whom on each boat, then they unload the animals at home on the far side of the river, then again see who eats whom. Each animal scores 1 victory point (VP) for each animal eaten, unless it was eaten in turn in which case the point passes to its predator. Surviving animals score 1 VP on the bank and 2 VP at home.&#10;&#10;If a single player has 6 or more VP, the game ends and that player wins. If no one has more than 6 VP or multiple players are tied with 6 or more VP, then the game continues for another round.&#10;&#10;",
        "artist": "Felicia Cano"
    },
    {
        "name": "RONE",
        "description": "RONE: Races of New Era is a strategic post-apocalyptic card game for 2 or 4 players. Players are immersed in a dark world full of destruction and suffering, a world where people are fighting to take back their place after a global nuclear war annihilated all achievements of the human race and all that was left was only a handful of usable resources. The remaining scattered groups of survivors are fighting amongst themselves for dominance over the remnants of the past. Now it is your turn to join the global war and recruit soldiers, battle machines, powerful hybrids, or tremendous mutants into your army. Equip your troops with the best available technologies and show all your enemies who is the ruler of the new order.&#10;&#10;Players are represented in the game by their hero and play units or one-time effects (tactics) in an attempt to destroy all cards from the opponent&rsquo;s deck. The number of cards in the deck and the player&rsquo;s hand is connected to the number of health points of the player's hero. For each point of damage that the hero receives, the player has to destroy one of their cards &ndash; from the top of their deck or from their hand. Once a player loses all cards from their deck and hand they lose the game. Because each card used by a player during the game costs them a life point, players are forced to play cards as efficiently as possible so that each played card does more damage to the enemy than to themselves.&#10;&#10;These combined mechanics create a well-balanced system where every erroneous move or unplanned action can lead to a player&rsquo;s defeat. Each and every decision is tightly coupled, and even a small decision can completely change the course of the game.&#10;&#10;Players have to find a balance between investing in game control, which allows them to play cards more effectively, or investing in killing the enemy hero, which is the primary goal. This means that players should control their damage output wisely. One can easily feed the enemy graveyard with destroyed cards, which may turn the game completely against them - because of the recycling system which allows players to put cards from the graveyard back on the battlefield. So, instead of dealing massive amounts of damage directly to the enemy hero, waiting sometimes has its benefits.&#10;&#10;Timing of attacks, card activation, graveyard management and tactical decisions are the real keys to victory.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Topoum",
        "description": "1916, Europe: The Great War has ravaged the land. Only one fertile ground remains and it is strongly disputed...by moles?&#10;&#10;In Topoum, you control an army of moles that are fighting for control of a piece of fertile land in the middle of the Great War. The moles are well known for their blindness and, for this reason, you'll earn badges (points) if you can form uninterrupted lines of sight between your soldiers.&#10;&#10;Topoum features several different types of cards of four categories: combat, movement, expansion and special. Each game is different because you build the playing deck with seven types of cards (+110.000 combinations!).&#10;&#10;Each player has a private hand with two cards and there is a public row of five cards available for all the players on the board. This is the structure of the turn:&#10;&#10;&#10;     Choose between &quot;Enter the Battle with a Mole&quot; (playing one card is mandatory) or &quot;Move Moles in the Battlefield&quot; (playing a card is optional for each mole).&#10;    Score the lines of sight between your moles.&#10;    Refill the cards in your hand and the public row.&#10;&#10;&#10;When the &quot;Peace&quot; card (hidden at the bottom part of the deck) is drawn, the game ends. The players now score extra badges for majorities and sets of the categories of the cards they used during the battle.&#10;&#10;",
        "artist": "Pedro Soto"
    },
    {
        "name": "GG",
        "description": "GG is based on the idea of having a card game that is as easy as learning rock-paper-scissors, but more based on strategy, memory and deception.&#10;&#10;Each player has an identical 32-deck of cards. Players use these cards to make 4 piles of 8 cards each to challenge each other.&#10;&#10;Instead of challenging an opponent, strategy cards can be played.&#10;&#10;The goal is to eliminate the rivals by attaining their GG cards.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Spoilers",
        "description": "Spoilers is a party-trivia game with movie questions and bluffing mechanisms.&#10;&#10;The player taking the spoiler role (a different one each turn) makes a question about what happens in a particular movie and gives three possible answers (A, B, C). The Spoiler knows the right answer and earns points when the other players answer incorrectly and loses points when they get it right. Thus, the Spoiler will try to mislead them (and everyone knows that). Everyone takes the role of Spoiler three times, then the player with the most points wins.&#10;&#10;&bull;&bull;&bull;&#10;&#10;Party Game con preguntas de cine y mec&aacute;nicas de faroleo.&#10;&#10;El jugador que toma el rol de Spoiler (uno diferente en cada turno) hace una pregunta acerca de lo que sucede en una pel&iacute;cula en particular y da tres respuestas posibles (A, B, C). El jugador Spoiler sabe cu&aacute;l la respuesta correcta, pero s&oacute;lo ganar&aacute; puntos cuando el resto de jugadores fallen  y perder&aacute; puntos cuando acierten, por lo que tratar&aacute; de despistarlos (y todo el mundo lo sabe).&#10;&#10;La partida dura tres rondas (cada jugador Spoiler har&aacute; 3 preguntas) y el jugador con m&aacute;s puntos al final, gana.&#10;&#10;",
        "artist": "Manu Palau"
    },
    {
        "name": "Simon's Cat Card Game",
        "description": "The fast-paced Simon's Cat Card Game features adorable art taken directly from animator and illustrator Simon Tofield's YouTube series, Simon's Cat, which has hundreds of millions of views.&#10;&#10;In the game, players go around the table playing cards to escape Simon's attention. Get caught and you get Blame; get too much Blame and you get fed last. No one wants that.&#10;&#10;",
        "artist": "Simon Tofield"
    },
    {
        "name": "AEG Black Friday Black Box 2015",
        "description": "AEG's second Black Friday Black Box, containing 7 games:&#10;&#10;&#10;     Bacon wars&#10;     Lost Legacy: Flying Garden and Starship (Kanai Factory version)&#10;     Adventure Time Loveletter&#10;     Pretense&#10;     Empire Engine (Cold War Edition)&#10;     Who Stole the Cookie? (Christmas Theme)&#10;     Agent Hunter (or Cypher in same cases)&#10;&#10;&#10;And a bag of AEG logo wooden tokens, in four different colours&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Secret Hitler",
        "description": "Secret Hitler is a dramatic game of political intrigue and betrayal set in 1930s Germany. Each player is randomly and secretly assigned to be a liberal or a fascist, and one player is Secret Hitler. The fascists coordinate to sow distrust and install their cold-blooded leader; the liberals must find and stop the Secret Hitler before it's too late. The liberal team always has a majority.&#10;&#10;At the beginning of the game, players close their eyes, and the fascists reveal themselves to one another. Secret Hitler keeps his eyes closed, but puts his thumb up so the fascists can see who he is. The fascists learn who Hitler is, but Hitler doesn't know who his fellow fascists are, and the liberals don't know who anyone is.&#10;&#10;Each round, players elect a President and a Chancellor who will work together to enact a law from a random deck. If the government passes a fascist law, players must try to figure out if they were betrayed or simply unlucky. Secret Hitler also features government powers that come into play as fascism advances. The fascists will use those powers to create chaos unless liberals can pull the nation back from the brink of war.&#10;&#10;The objective of the liberal team is to pass five liberal policies or assassinate Secret Hitler. The objective of the fascist team is to pass six fascist policies or elect Secret Hitler chancellor after three fascist policies have passed.&#10;&#10;",
        "artist": "Mackenzie Schubert"
    },
    {
        "name": "Incómodos Invitados",
        "description": "Awkward Guests / Inc&oacute;modos Invitados is an innovative mystery card game. It reacreates the night when Mr Walton was murdered. There are 3.600 different solutions and millions of different games. You will never play the same game twice!!&#10;&#10;Will you be the first to solve the crime?&#10;&#10;WHO murdered Mr Walton?&#10;HOW was he murdered?&#10;WHY was he murdered?&#10;Did the murderer have an ACCOMPLICE?&#10;&#10;Draw conclusions, trade your information wisely and be the first to catch the murderer.&#10;&#10;Awkward Guests / Inc&oacute;modos Invitados base game mechanic is quite simple. Players have a hand of 6 cards. Each card has a value (1, 2 or 3 points, according to the amount of information that it provides) and several references (the matters that the card information is about). During his turn, each player ask for information about two different references he is interested in. The rest of the players can offer him cards which contains the requested references. The asking player can trade those cards by giving the offering players the same amount of points they have offered, with cards of his hand and no reference restriction.&#10;&#10;After every round is completed, players can try to solve the mystery. If the mystery is not solved, players discard part of their hands and receive 3 new cards. The player or players who solve the mystery first, win.&#10;&#10;",
        "artist": "Samuel Gonzalo García,Laura Medina Solera"
    },
    {
        "name": "Jewels",
        "description": "The goal is to become the richest merchant by hoarding as many Coins as possible. Each Player earns Coins by selling crafted Gems and Jewels. The game is divided in Turns, every Turn is completed when each Player completes his Round.&#10;&#10;At the start of the game the cards are placed in two rows, Characters and Gems, for a total of seven columns. Each column represents a City. Every city has two slots one for a Character one for a Resource.&#10;&#10;During his Round a Player can execute three Actions from a list of six:&#10;&#10;    Travel to another City &#10;    Buy Gems or Gold &#10;    Craft Jewels or Gems &#10;    Interact with a Character: Sell a Jewel or a Gem, hire a Mercenary or fight a Monster &#10;    Refill City slots if empty &#10;    Earn a Coin&#10;&#10;&#10;&#10;&#10;The Player can travel between the columns, which represent Cities. Traveling between Cities costs Coins.&#10;&#10;The Player can buy a Gem from his current City and add it to his hand.&#10;Before a Jewel or a Gem can be sold, the Player has to spend a crafting action to lay the cards down. To craft a Jewel the Player needs also the right combination of Gems and Gold. So each Player always has a round to plot against the seller.&#10;&#10;Selling a Jewel or a Gem to a Buyer means discarding it and earning its value in Coins. Mercenaries and Monsters can hinder or favor the Players. After a Player interacts with any Character, the card is added to the discard pile.&#10;&#10;At the beginning of each turn the Cities are repopulated with new Characters and Gems. At this time many Events can be triggered.&#10;The game ends when a City can&rsquo;t be refilled at the start of the Turn.&#10;&#10;The Player with most Coins wins the game.&#10;&#10;",
        "artist": "Elisa Reali"
    },
    {
        "name": "Alienation",
        "description": "Welcome to the highly lucrative world of intergalactic real-estate!  In Alienation, you will assume the role of a real-estate agent attempting to satisfy various alien creature clientele.  But watch out for your rival competitors, because they will surely be trying to corner the market.  Finish with the most points after 3 rounds to win the game!&#10;&#10;Players will draft a hand of 9 alien creature cards.  Creature cards may have 1, 2, or 3 creatures displayed in one of 6 races:  Friendlies, Meanies, Rowdies, Sleepies, Matchies, and Sunnies.  Each race has very distinct personalities and interacts differently with their neighbors.  On his/her turn, the starting player will take one of 2 actions:&#10;&#10;1. Play 1 card in his/her own solar system.&#10;    2. Play 1 card in another player&rsquo;s solar system.&#10;&#10;All cards must be played either adjacent or diagonal to the sun card.  Play proceeds left.  The next player then takes one of the 2 actions.  Once your solar system has 8 creature cards surrounding the sun, it is full.  You may now ONLY play cards in other players&rsquo; solar systems.  The round ends once all solar systems are filled.  The final card in each player&rsquo;s hand is placed into the discard pile.  Each player will now score his/her solar system.&#10;&#10;",
        "artist": "Moy Shin Hung,MJ Leong"
    },
    {
        "name": "Sea of Clouds",
        "description": "&#226;&#128;&#139;In Sea of Clouds, as captain of a flying pirate ship, recruit a cutthroat crew, collect relics and unearth the best rum by gathering shares of Loot. Then send your pirates aboard enemy ships to plunder their treasure!&#10;&#10;In each round of the game, players take turns divvying up shares of Loot to gain Rum, Relics, Objects, and Pirates. In some rounds, when ships are flying close together, they will also clash in a Boarding action, using the effects of any Pirates they picked up to gain Doubloons and plunder Loot.&#10;&#10;On your turn, take the first of the three shares of Loot on the table, and look at it secretly. You must decide to either take all the cards in the Share then add the top card from the deck face-down to this Loot space, or to leave the Share and look at the next one. If you choose to do the latter, add the top card from the deck to the Share you declined (or a Doubloon, if there's already three cards), thus increasing its value for the next player. If no shares interest you, blindly take the top card of the deck.&#10;&#10;The card backs give you a hint about what&rsquo;s in the next Shares: Pirates to board other ships, legendary Relics to collect, Rum to be scored at the end of the game, and Items with permanent, immediate, or secret effects.&#10;&#10;Every 4 or 5 rounds (depending on the number of players), Boarding action will occur! Add the strength of your Captain and your Pirates, apply any bonuses or penalties, and face your two neighbors! For each victory, your Pirates will gain Doubloons or steal some Loot! After the fight, all Pirates are discarded.&#10;&#10;The game ends after 12 (or 15) rounds. Players then add the value of their Doubloons and their Loot cards to determine who&rsquo;s the winner.&#10;&#10;",
        "artist": "Miguel Coimbra"
    },
    {
        "name": "Tales & Games: The Pied Piper",
        "description": "Tales &amp; Games: The Pied Piper is the sixth title in Purple Brain Creations' Tales &amp; Games series.&#10;&#10;You live in Hamelin, a town infested by rats. The easiest way to get the rats out of your house is to send them to your neighbors. Whenever too many rats are jammed into a house, its occupants get desperate and move out! The player who can best keep the rats out of his house wins!&#10;&#10;",
        "artist": "Mathieu Leyssenne"
    },
    {
        "name": "Red Flags",
        "description": "Red Flags is &quot;The Game of Terrible Dates&quot;&#10;&#10;In Red Flags, your goal is to use &quot;Perk&quot; cards to create the best date for &quot;The Single&quot; (the judge for this round). However, there is a catch. Players may also play &quot;Red Flags&quot; (bad traits) in an attempt to sabotage another player's hot date.&#10;&#10;Each player has an opportunity to argue why their date is the best one for &quot;The Single,&quot; who chooses which awful date wins...&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Cavern Tavern",
        "description": "In a war torn land, a magical land of heroic feats and epic quests, there is a place that has never felt the wrath of the ongoing and everlasting war between the five realms. Hidden in the hills of Strongcliff , deep in the shadows of a cavern lies the best kept secret for many years.&#10;&#10;This place is called the Cavern Tavern.&#10;&#10;Cavern Tavern is a worker (dice) placement and resource management game that is set in a fantasy world. Each player assumes the role of a worker in the tavern. Your job is to serve drinks, work in the kitchen, do chores, and on top of that try to keep every guest happy, including the nasty and greedy barkeep.&#10;&#10;On each turn, a player can assign his dice to 1 of the 21 locations in the tavern.&#10;&#10;These locations are divided in 6 sections. The Main area, where the guests are located and from where each player must pick up an Order, Cellar where all the ingredients that are used to complete the Orders are located, Kitchen where players can work to receive different rewards, as well as the Chores section. Also, the board features the Wizards workshop where the players can seek help for completing the Orders and Nasty the Dwarf's office where the players can go and try to suck up to the boss and badmouth a coworker.&#10;&#10;The players will have to complete the Orders as soon as possible, because for each round they are late, they&rsquo;ll receive less points than the Order's original value.&#10;&#10;Also, for being late with the Orders, your reputation with Nasty the Dwarf is affected, something that is vital in the game.&#10;&#10;To stand out from other workers and gain your employers favor, you&rsquo;ll need to skillfully manage the orders from your customers and the resource ingredients. You&rsquo;ll have to carefully prioritize your moves, and choose from what kind of work you&rsquo;ll profit the most out of the situation.&#10;&#10;So&hellip; do you have what it takes? Get ready for the biggest challenge in your life, and start working in Cavern Tavern.&#10;&#10;",
        "artist": "Mihajlo Dimitrievski,Vojkan Krstevski"
    },
    {
        "name": "Top That!",
        "description": "Each player in Top That! has five wooden bits before them: a black hat, orange tube, red goblet, green coin, and white rabbit. Shuffle the deck of sixty challenge cards, then reveal one of them. Players race to stack their pieces following two rules:&#10;&#10;&#10;    Whichever pieces on the revealed card are in their original color must be visible in the stack.&#10;    Whichever pieces are shown in grey must be hidden somewhere within the stack.&#10;&#10;&#10;Whoever does this first claims the card, and whoever first claims a certain number of cards wins the game!&#10;&#10;",
        "artist": "Stéphane Escapa"
    },
    {
        "name": "Bill & Ted's Excellent Boardgame",
        "description": "Description from the publisher:&#10;&#10;Strange things are afoot in Bill &amp; Ted's Excellent Boardgame!&#10;&#10;Collect personages of historical significance in order to pass your oral history report. But beware! Every time you bag someone, the phone booth breaks most-heinously, and your adventure through time will take a most serious turn!&#10;&#10;Be excellent to each other...and party on, dudes!&#10;&#10;",
        "artist": "Sabrina Gonzalez,Len Peralta,Ben Williams"
    },
    {
        "name": "Mi Tierra: New Era",
        "description": "Mi Tierra: New Era (My Land: New Era) is a worker placement game in which the players represent farmers that try to labor their land in the best way possible. They will have to sow and work the land and take care of their animals so they can produce goods and sell them in the different available markets.&#10;&#10;In this second edition, players will have all the fun included in the original Mi Tierra plus more, since the second edition includes many more features like use of water for plantations, horses, new products and more. Also, instead of four players you will be able to play up to six-player games. Finally, the rules of the game have been revised to make sure that Mi Tierra gets even better.&#10;&#10;",
        "artist": "Cristián González"
    },
    {
        "name": "Saltlands",
        "description": "The Earth has dried out and civilization with it. Some of the survivors have managed to eke out a living on the Saltlands: plains left behind by a once great ocean. Adapting to their environment they use land sails with wheels on these flats. But the Apocalypse is not done with the Saltlands, from the west a storm of raiders, a terrifying Horde on gas guzzling machines approaches in search of their lost God. Only those among the first to escape have a chance!&#10;&#10;In Saltlands, the first group of players to find and reach an exit point wins, leaving the rest to the Horde. There are no fixed teams, players can decide to co-operate or backstab each other as they see fit. Each player starts the game with a single captain but may increase his crew as the game progresses. Each crew member represents an extra life and an action each turn. Players move with their land sails according to the wind direction: being able to criss-cross slowly upwind or speed in the fastest direction, sailing on a broad reach. Each player can choose which group of raiders to move at the end of their turn until all raiders have moved. This allows players to help each other or force confrontation with the raiders. Players can fight the raiders and take their vehicles as an alternate mode of transport.&#10;&#10;",
        "artist": "Bazsó Lossonczy"
    },
    {
        "name": "Yeti",
        "description": "Yeti is a quick family dice game with extraordinary components and funny illustrations.&#10;&#10;In Yeti players are competing adventurers and mountaineers, looking for traces of the Yeti, the legendary Snowman in the Himalaya. They want to find its footprints &mdash; or even better take photos of it &mdash; in order to collect points. To achieve this, they need to improve their equipment and acquire the help of Sherpas to lead them up the mountains. Most importantly, though, they should hope for good weather because if too much snow falls, the search of all players comes to a halt...&#10;&#10;",
        "artist": "Dennis Lohausen"
    },
    {
        "name": "Virus",
        "description": "A frightening virus, Virus Q, is spreading in the major cities of the planet. Infected people and animals change rapidly, becoming horrible bloodthirsty and almost unstoppable creatures. Our only hope is to find the zero patient and the place where everything originated. There, perhaps, we can find an antidote and return the hope to the dying humanity.&#10;&#10;But not everyone agrees. There are those who want to take advantage of the chaos and terror in order to gain power and establish a new form of government, trying to maneuver and control the monsters generated by the virus. A cure would ruin their plans forever.&#10;&#10;The virus was created in a secret military lab, in a space that's practically inaccessible. Inside, Virus Q spread for the first time, accidentally, maybe; the creatures that now inhabit the Lab are difficult even to imagine...&#10;&#10;In the innovative lab crawler game Virus, players are the team that infiltrates the Lab looking for the antidote to Virus Q. They will collect the few and fragmentary bits of information scattered in the laboratory, avoiding or fighting the monsters that populate it.&#10;&#10;The map generation and the movement/placement of monsters depends on the player actions with a semi-automatic mechanism controlling what takes place where. The fighting requires some dexterity elements as well as players must plan their tactics by combining their shooting power with available movement, achieving successes by rolling cubes.&#10;&#10;Also, the game takes place in real time!&#10;&#10;In sum, you can play Virus cooperatively, semi-cooperatively or competitively. The &quot;infiltrator&quot; option makes the game even more exciting and unpredictable!&#10;&#10;",
        "artist": "Kevin Dubeau,Mirko Failoni,Marina Fischetti"
    },
    {
        "name": "Zombie Tower 3D",
        "description": "The year is 20XX, a mysterious object fell from outer space. Not long after, zombie outbursts have been reported all around the world!!&#10;&#10;In Zombie Tower 3D, you will play as a one of the characters trapped inside a building crawling with zombies. Working with your teammates, you must try to evacuate the building before it collapses. But beware! Zombies will appear out of nowhere every so often, craving for your flesh. There are also other desperate survivors in the building, waiting to be rescued. You must search the building for various tools to fight off the zombies, save survivors, and evacuate from the building!&#10;&#10;Zombie Tower features a revolutionary 3D stand-up board. During the game, you may only look at your own play space, so you will have to actively communicate with your teammates about your situation to call for help or offer rescue. Items are also passed through small slits between the walls, and not directly to other players. After fulfilling the escape conditions, each player will get victory points depending on the number of survivors saved and completion of their minor objective cards, and the true winner will be determined.&#10;&#10;",
        "artist": "Mana Okada,Riyo"
    },
    {
        "name": "Munchkin Marvel",
        "description": "Description from the publisher:&#10;&#10;Munchkin Marvel fuses the classic card game fun of monster-slaying and role-playing with the most iconic characters from the Marvel universe. Created under license from Steve Jackson Games and in conjunction with Marvel, Munchkin Marvel comes complete with new monsters (villains), allies (heroes), and custom S.H.I.E.L.D. Identification Cards.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Butterfly Garden",
        "description": "In The Butterfly Garden, you are an avid butterfly collector and the local butterfly garden needs your help expanding and diversifying its collection. Capture highly desired butterflies, put them in your trusty jar, and deliver them to the garden to gain respect from the collecting community and to help diversify the garden &mdash; but watch out for your opponents as lepidopterists can be quite devious!&#10;&#10;The game is played in a series of rounds. Players start each round by playing a card from their hands to determine the round's turn order. Cards are numbered from 0 to 59, and lower numbered cards will go first. On a turn, a player captures butterflies from the field and adds them to the jar (i.e., they take a card from the row of face-up cards and tuck it under their jar card). When possible, players &quot;deliver butterflies&quot; from their jars to the zoo's butterfly garden to score victory points (VPs). Which butterflies can be delivered is indicated on the face-up &quot;delivery cards&quot; and players are often in a race to deliver butterflies to take the cards and score points. The player with the most VPs at the end of the game wins.&#10;&#10;During the game, players must carefully decide which butterfly cards to play. By playing lowered numbered cards, players not only get a better pick of butterflies in the field, but they also get first chance at delivering butterflies. However, lower numbered butterfly cards usually have fewer butterflies on them, so players cannot add as many to their jars. Also, butterfly cards with special powers usually have high numbers, so you often must sacrifice turn order in order to use one of these special powers.&#10;&#10;",
        "artist": "Cathy Gruetzke-Blais"
    },
    {
        "name": "Scrimish Card Game",
        "description": "Scrimish is a fast moving card game that pits player against player in an epic 10 minute battle of strategy, memory, and misdirection. Every game is different, and you'll want to play over and over again to try new ways of outsmarting your opponent. The game is expandable to large team or free-for-all games.&#10;&#10;The objective of the game is to uncover and attack your opponent&rsquo;s Crown Card with one of your own cards. Each player places 5 piles of 5 cards each face down in from of them. The crown card should be hidden on the bottom of one of the 5 piles. The rest of the cards may be arranged however you like, but choose carefully. A bad setup can quickly give your opponent the upper hand.&#10;&#10;Game play: Players take turns attacking by selecting the top Card from one of their Piles and laying that Card face up in front of one of their opponent&rsquo;s Piles. The defending player must then reveal the top Card of the Pile that was attacked. The Card with the lowest number value loses and is discarded. The winning Card must be returned face down to the top of the original Pile it was drawn from. If the two Cards have the same number value, both Cards are discarded. Play continues until one of the players attacks their opponent&rsquo;s Crown Card, winning the game.&#10;&#10;Special cards:&#10;Archer Card: If you attack with an Archer Card, it always wins. If your Archer Card is attacked, it always loses. Shield Card: Shield Cards cannot be used to attack. If your Shield Card is attacked, both your Shield Card and your opponent&rsquo;s attacking Card are discarded (except for Archer Cards - see Additional Rules. Crown Card: You can attack with your Crown Card. If you attack your opponent&rsquo;s Crown Card, you win. Otherwise, you lose the game&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Ludi Gladiatorii",
        "description": "&quot;Uri, vinciri,  verberari, ferroque necari&quot;&#10;&#10;&quot;I will resist, to be burned, tied, beaten, to die by sword&quot;&#10;&#10;The Coliseo is the throbing heart of Rome and as a &quot;lanista&quot;, owner of  &quot;ludus&quot;, you will train and pay for the greatest champion of the arena that will serve and fight for you and your honor. Auctions will take place to sell the best fighters. You will have the chance to develop your infrastructures and set combats. Each victory for your &quot;ludus&quot; is a line written in History.&#10;&#10;The main objective of Ludi Gladiatory is to achieve 7 points of Fame and Glory. This is gained by either making your &quot;Ludum&quot; bigger or by wining combats. You have at your disposal several gladiators that you can either sell, order to build or to fight. &#10;Another section are combats with a drawing damage cards system.&#10;&#10;",
        "artist": "Pedro M. Vinaches"
    },
    {
        "name": "Tyrants of the Underdark",
        "description": "Tyrants of the Underdark is a territory control game with a deck-building element.&#10;&#10;Each player leads a house of Drow in a section of the Underdark below the Sword Coast. The Drow house is represented by a deck of cards, with each card being a minion in that player's deck. Each minion belongs to one of five aspects of Drow society, and those aspects correspond to different strategies in the game, e.g., malice minions excel at assassinating opponents' troops, while ambition minions are best at recruiting additional minions and promoting minions to your &quot;inner circle&quot;, which is a special zone that increases their value at the end of the game.&#10;&#10;When you set up the game, you create an 80-card deck by shuffling two 40-card half-decks together, with the half-decks being Drow, Dragons, Demons, and Elemental Evil.&#10;&#10;A central marketplace has new minions that can be recruited through influence, one of two resources in the game; purchased cards are placed in your discard pile, then shuffled together with other cards in your deck when needed. The other resource is power, which allows you to place troops on the game board, expand your forces across the map of the Underdark, manipulate happenings in the city, and assassinate enemy troops.&#10;&#10;Players gain points by controlling sites, recruiting valuable minions, promoting minions to your inner circle, and assassinating troops, and whoever ends the game with the most points wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "100 Swords: The Blue Mammoth's Dungeon",
        "description": "100 Swords: The Blue Mammoth's Dungeon is a sword based dungeon crawling micro deck builder! Load up with as much as you can carry and run head first into the dungeon, exploring rooms and revealing monsters, all while keeping track of hidden treasures and swords!&#10;&#10;During play, you must efficiently play the 5 cards in your hand for any combination of movement, strength, or energy. Movement advances you deeper into the dungeon allowing you to peek at or reveal the cards along the way. Monsters you find can only be defeated with strength. New items (and swords!) are acquired by spending cards in your hand for energy. Many items have effects that will further expand your tactical options as your deck grows.&#10;&#10;As you defeat monsters and pick up loot, do your best to remember where everything is hidden. Treasures and slain monsters are worth gold, so get collecting! Once the dungeon has been thoroughly ransacked, or the boss is defeated, whoever has the most gold wins!&#10;&#10;This deck is a standalone dungeon complete with items, monsters, and a Boss, the dreaded Blue Mammoth. This dungeon has hard hitting monsters and harder hitting swords.&#10;&#10;",
        "artist": "Samuel Strick"
    },
    {
        "name": "The Contender: The Game of Presidential Debate",
        "description": "The Contender is a social card game inspired by the vim and vigor of a real presidential debate.&#10;&#10;To win, you must use facts, attacks and distracts to convince the Moderator that you are fit to lead the free world. The deck brings you hundreds of one-liners based on real presidential quotes that you'll combine to beat your opponents in the debate of the century.&#10;&#10;Players take turns debating an issue drawn from a deck of Topic cards by combining the phrases on the Argument cards to create the most convincing or entertaining argument.&#10;&#10;",
        "artist": "Guts & Glory (Branding and Design)"
    },
    {
        "name": "Plan Orange: Pacific War 1930 - 1935",
        "description": "Plan Orange is a complete stand alone game inside C3I Magazine Nr29 published by RBM Studio that uses the &quot;Empire of the Sun&quot; (GMT Games) CDG engine to simulate a hypothetical Pacific war between the United States and the Empire of Japan in the early 1930s. The game features a 'what if' conflict based on the United States Orange (Japan) plans on how to respond to anticipated Japanese aggression in the Western Pacific. This is still the era of the Battleship ala Jutland supported by the early introduction of aircraft carriers that would be the capital ship that would dominate the real war that occurred 9 years later (1941).&#10;&#10;The game comes with a full sized map, 48 cards, mounted counters, and rules.&#10;&#10;www.c3iopscenter.com/&#10;&#10;",
        "artist": "Francisco Colmenares,Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "Bloc by Bloc: The Insurrection Game",
        "description": "In Bloc by Bloc: The Insurrection Game, players join a vibrant popular rebellion struggling to liberate a city that changes with every game. Each player controls a faction of revolutionaries who must cooperate with other factions while balancing their own objectives in order to push back riot cops, loot shopping centers, build barricades, and occupy state districts before the military arrives and time runs out.&#10;&#10;Bloc by Bloc is played in a city made up of 25 district tiles connected by streets, highways, and metro stations. Each player controls one of four factions in the city: the Workers, the Neighbors, the Students, or the Prisoners. Each district tile has a two sides: a repressed side and a liberated side. At the start of the game, all districts are repressed and, over the course of the game, players work together to liberate districts one at a time.&#10;&#10;The game lasts 8 rounds. Each round is 1 night and each night has 2 phases. During the Sunset phase, each player takes a turn: 3-5 actions and ending with police movement controlled by the Police Ops deck. Each player starts with 1 bloc in the city and can add more throughout the game. On a player's turn, they roll dice and take one action (such as looting, occupying, attacking, or barricading) for each die rolled with 1+ of their blocs. Players may use loot cards to enhance their actions. After all factions have taken their turns, the Sunrise phase begins, which is when police attack and factions have a chance to liberate districts.&#10;&#10;The police and the State are the common enemies of all factions. Occupations must be built in all State districts by any combination of factions for the insurrection to be successful. However, each faction also has its own secret agenda with a set of specific tasks that faction must complete in order to win the game.&#10;&#10;",
        "artist": "Tim Simons"
    },
    {
        "name": "Sans Alliés",
        "description": "OVERVIEW&#10;Sans Alli&eacute;s (French: &ldquo;without allies&rdquo;) is a solitaire card game where you command 20th century troops and technology, pushing through an enemy nation bent on developing a vile super-weapon.  Sans Alli&eacute;s takes the feel of a grand-strategy, area-movement war game and compresses it into a tight little solo package, playable in about an hour.&#10;&#10;GAME PLAY&#10;The enemy nation is represented by an assortment of &quot;region&quot; cards arranged as a layered pyramid, with the &quot;enemy capital&quot; card at the top of the pyramid.  Meanwhile, the enemy's &quot;progress&quot; towards completion of an ultimate weapon is represented by a proximity track along the side of the pyramid, which possibly increases each turn.  The object of the game is to capture or claim the enemy capital card before the enemy succeeds in completing his weapon.&#10;&#10;No region card can be removed from the pyramid until either one or both of the cards laid atop it are removed first.  Therefore, you will need to capture region cards at the lowest level of the pyramid first, working your way up the pyramid in stages.  Each attempt to capture a region is called an &quot;invasion.&quot; To conduct invasions, you gather various military unit cards from your draw deck (separate from the enemy nation deck).  These units have strength values, while each level of the pyramid has a defensive value.  You have to amass enough strength and the right types of units to attempt an invasion on a given region, and then a roll of the dice determines whether you lose (discard) this entire invasionary force, or save a few, or lose more than expected, and are possibly forced to retreat.&#10;&#10;Along the way, you can capture select region cards called resource centers, and/or you can invade select zones to liberate prison camps.  These achievements not only increase the number of cards you draw on a turn, but also grant you the ability to improve your units strength values, and they introduce tactical developments that give you more dynamic choices in battle, including an Ultimate Weapon of your own.&#10;&#10;",
        "artist": "Studio1126"
    },
    {
        "name": "Aventuria Adventure Card Game",
        "description": "From the publisher (translated):&#10;&#10;For an unknown reason, the undead had chosen to concentrate their attacks on Carolan, trying to drag him into their cold grave: &ldquo;Just do something already!&rdquo;, the half-elf shouted at his comrades, while dodging attacks left and right with growing boldness. Despite his skills, he received multiple hard strikes nonetheless, his quilted tunic torn to shreds. Then he heard Arbosch roaring triumphantly. The dwarf took a last swig from his jug of beer before raising his spiked mace up high: &bdquo;In the name of my ancestors, now we can begin!&rdquo; With a loud crack, the terrible weapon smacked down on the first skeleton, bursting into a cloud of bone dust.&#10;&#10;Brace yourself for combat!&#10;&#10;Aventuria is a dangerous place. Behind every corner lurks danger in form of devious monsters, exciting adventures or bad-tempered comrades, challenging you to a duel. &#10;Gather weapons, armor and magic spells. Acquire special talents and unique abilities to surprise your enemies with unexpected tricks. You need to make a decision: Concentrate your strengths to be able to play a mighty sword later or make do with a dagger to keep your enemies on their toes and snatch their own weapon afterwards?&#10;&#10;Aventuria The Adventure Card Game is a fast paced card game for 1-4 players (age 14 and older) where each player embodies a hero from the land of the dark eye, Aventuria. &#10;The grim dwarf Arbosch, the swift elven scout Layarial, the shifty half-elven wanderer Carolan, or the mysterious tulamid mage Mirhiban.&#10;&#10;In duel mode you fight each other for glory, whereas in the cooperative adventure mode, you work together to overcome exciting adventures. Each turn, you get to draw actions cards which improve your character constantly. But be aware! Every turn, hard decisions have to be made and surprising attacks of your enemies can catch you off-guard.&#10;&#10;",
        "artist": "Nadine Schäkel"
    },
    {
        "name": "Zany Penguins",
        "description": "In Zany Penguins, you want to make sure that your tribe of penguins is the one that takes control of the Earth, so do what you can to take charge of regions such as the desert, jungle, and the North Pole.&#10;&#10;In game terms, each region has a set of cards numbered 1-9. To set up, shuffle the deck, then deal each player a personal deck of 18 cards. Each player starts with two cards in hand.&#10;&#10;On a turn, you draw two cards, pass one card each to your left- and right-hand neighbors, take the cards passed to you, then simultaneously play and reveal one card in front of you on the table. If you play a 1, on your next turn you play and reveal two cards instead of one; if you play a 2, it blows up all 6-9 cards played that same turn; and if you play a 3, on the subsequent turn everyone else plays before you do.&#10;&#10;After eight turns, for each card color on the table in front of you in which you have the highest sum of all players, you score the sum of all cards of this color in your hand. For each color in which you don't have the highest sum, you score the single lowest card of this color in your hand. Players tally their scores, and whoever has the most points wins.&#10;&#10;",
        "artist": "Rémy Tornior"
    },
    {
        "name": "My First Stone Age",
        "description": "Travel to the past with Jonon and Jada, two stone age children, to rediscover how the first humans settled the world around them.&#10;&#10;In My First Stone Age, a children's version of the Stone Age family game, the players collect goods and build their own settlement.&#10;&#10;",
        "artist": "Michael Menzel"
    },
    {
        "name": "West of Africa",
        "description": "In the late Middle Ages, the Canary Islands had faded into obscurity from a European point of view. There was neither gold nor silver, and the islands did not play a role as a trading post because the north-south trade of that time went through the Sahara.&#10;&#10;In 1312, the Genoese merchant and seafarer Lancelotto Malocello effectively &quot;rediscovered&quot; the Canary Islands. During the 15th century, the archipelago was conquered by the Spanish. Spanish masters pushed agriculture, cultivating sugar cane, wine and grain, which quickly gave the islands a certain economic value and importance.&#10;&#10;In West of Africa, the players cultivate goods, try to sell them profitably, and build settlements. Each player has their own deck of cards. Each turn the players select cards from their decks to conduct successful actions, always keeping the actions of the other players in mind.&#10;&#10;",
        "artist": "Harald Lieske"
    },
    {
        "name": "Carrotia",
        "description": "Carrot supplies are getting low and the rabbits must brave the wilds to collect enough to feed the colony! Time is short, the pathways long and the birds are circling overhead, looking for easy prey.&#10;&#10;Carrotia is a light co-operative, tile placement game for 1-6 players where the team collectively works together against a timer to build three different mazes of increasing size. The master rabbit needs to dash from entrance to the exit within a specific number of moves according to the current mission card, scooping up the precious carrots while avoiding the owl, hawk and other birds as they swoop low over the zones causing mayhem and mischief.&#10;&#10;Although the task may seem daunting, the master rabbit has some supporters, other rabbits that bring a unique special ability to assist the team and and thwart the hungry predators!&#10;&#10;",
        "artist": "CDS Studio"
    },
    {
        "name": "The Cohort",
        "description": "It is time to polish your armor and sharpen your sword, for mighty Caesar has called for his legions to assemble.&#10;&#10;The Cohort is a fast-paced card game for 2-6 players in a race to be the first to assemble a Legion and show Caesar you are the greatest of his commanders.&#10;&#10;Legions are composed of 3 different Cohorts, each made of one of seven different types of units: Praetorians, Catapults, Centurions, Sagittarii, Equites, Legionaries and Velites. During a turn, you draw two cards, keep one and give the other to a player of your choice. You can keep that card in your hand or trigger it and create a Cohort. Be careful though, for the troops are rowdy! Until a Cohort is complete their behaviour works against you.&#10;&#10;So snap them into line as quickly as you can, disrupt the plans of your fellow commanders and show Caesar that your Legion is the greatest in all the Empire.&#10;&#10;",
        "artist": "Loïc Billiau"
    },
    {
        "name": "Smugglers",
        "description": "To bring the best youngsters into the business, the smuggler boss is holding a contest, with the candidates being challenged to move a sack filled with contraband through an opening in the fence.&#10;&#10;More specifically, in Smugglers players form the &quot;sacks&quot; used for smuggling out of modeling clay and hide their contraband within. The sacks are then rolled down a 3D path, with a die roll determining which hole in the fence the player needs to try to squeeze through. The player whose bag fits through the hole and who has the largest sack now checks the smaller bags, possibly taking the contraband hidden within. Who will prove to be the best smuggler?&#10;&#10;",
        "artist": "Fiore GmbH"
    },
    {
        "name": "Kerala",
        "description": "Welcome to the elephant festival in the Indian province of Kerala! Colorfully decorated elephants roam everywhere, and naturally players want to participate and make the most magnificent fairground with as many elephants as possible.&#10;&#10;In Kerala, each player wants to take at least one tile of each color, and all tiles of one color should be joined together, but of course the players are constantly getting in the way of one another and grabbing the tiles that someone else wants.&#10;&#10;",
        "artist": "Claus Stephan,Antje Stephan"
    },
    {
        "name": "Halt mal kurz: Das Känguru-Spiel",
        "description": "The Halt mal kurz: Das K&auml;nguru-Spiel, based on Marc-Uwe Kling's kangaroo trilogy, the rules of the game are explained by the marsupial himself in a new story. In the game, players must annoy the other players as skillfully as they can through assemblies, not-to-do lists, epic Schnick-Schnack-Schnuck groups, and (of course) the hated Razupaltuff card.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Castle Flutterstone",
        "description": "Quick! Into the old stone castle!&#10;&#10;An exciting race for the Magic Cup is about to start in Burg Flatterstein, but beware as the mysterious ruins are littered with obstacles and odd surprises. With a little luck and some skill with flapping bats to the right places, children will find the fastest route to their destination.&#10;&#10;Players take turns using the &quot;catapult&quot; to launch cloth bats at the game board. Depending on where the bat lands, the active player may move 1-2 spaces. If they land in the moat, they must take a Ghost card. The Ghost cards have various effects that can either help the player, or hinder their progress. The first player that is able to get to the top of the castle wins the game, and gets the golden bat trophy!&#10;&#10;",
        "artist": "Rolf Vogt"
    },
    {
        "name": "Zock 'n' Roll",
        "description": "The dice dance across the table in Zock 'n' Roll, and every player must ask themselves: Should I get out and be satisfied with a little success, or do I stick with it even though I might end up empty-handed?&#10;&#10;A good poker face is required because every player keeps three dice hidden for themselves, and they get to add the result of those dice to what's thrown face-up for all to see, thereby adding additional uncertainty and stress. If you can pinch players in the early rounds, whoever stays in the longest can skim off the cream for themselves...&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Dream Islands",
        "description": "At first glance, a visit to Dream Islands might seem like haphazard island hopping. The tourists, however, are moving from island to island based on the tactical considerations of the players, who each have three goals in mind based on their order cards. One such card might require the assembling of vacationers on one or several atolls, while another calls for a majority presence on an island.&#10;&#10;Thus, in Dream Islands players must tactically budget their movement points in order to send the tourists where they need them to go.&#10;&#10;",
        "artist": "Michael Menzel"
    },
    {
        "name": "Skull King: Das Würfelspiel",
        "description": "In Skull King: Das W&uuml;rfelspiel, the player pirates try to predict the results of the dice battles, and whoever predicts most accurately will come out the winner of the contest.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Vampire Queen",
        "description": "The gray morning has arrived, and the vampires of the ancient clans must now hurry back to their tombs. For the high and mighty this is easy, but the smaller, weaker vampires have the strength to do this only in groups. Thus, you as the vampire lord might want to play out several with low values together in order not to be surpassed.&#10;&#10;Whatever you do in Vampire Queen, though, be sure to rid yourself of the intrusive vampire hunter because no one wants to get stuck with that!&#10;&#10;",
        "artist": "Irene Bressel,Eckhard Freytag"
    },
    {
        "name": "Sugi",
        "description": "Delve into the enchanted woods of Sugi, meet the spirits dwelling there, and guide your predilect descendants so that they are the first to make it to the Temple.&#10;&#10;In Sugi, players represent the spirit ancestors trying to guide their descendants through the forest so they find the Temple. Each player has a family tree indicating which are their favorite descendants and win points if they arrive in the right order. In turn order, players must play one of their cards in hand in one of these two ways:&#10;&#10;&#10;    Adding the card to the movement line face down. When there are five movement cards, they are revealed and the movements resolve.&#10;    Discarding the card to use its special ability. (Rotate a card or tile, draw cards, discard from the movement line...)&#10;&#10;&#10;The author, V&iacute;ctor Samitier (aka Kiru) is a member of the Spanish association of board game designers Ludo, coming from an artistic background in the fields of music and cinema. In 2015 he won the express board game design contest &quot;crearxcrearxcrear&quot; in the Granollers fair &ldquo;JugarxJugar&rdquo;.&#10;&#10;",
        "artist": "Alba Aragon"
    },
    {
        "name": "Aeon's End",
        "description": "The survivors of a long-ago invasion have taken refuge in the forgotten underground city of Gravehold. There, the desperate remnants of society have learned that the energy of the very breaches the beings use to attack them can be repurposed through various gems, transforming the malign energies within into beneficial spells and weapons to aid their last line of defense: the breach mages.&#10;&#10;Aeon's End is a cooperative game that explores the deckbuilding genre with a number of innovative mechanisms, including a variable turn order system that simulates the chaos of an attack, and deck management rules that require careful planning with every discarded card. Players will struggle to defend Gravehold from The Nameless and their hordes using unique abilities, powerful spells, and, most importantly of all, their collective wits.&#10;&#10;",
        "artist": "Gong Studios,Scott Hartman"
    },
    {
        "name": "Retreat to Darkmoor",
        "description": "The foul forces of Darkmoor have amassed their legions to strike at the Capital City. Despite their well-laid machinations, something awaits them within the city walls: the realm's legendary heroes, who have gathered to council the king. Failing to siege the city, each overlord's minions must now retreat to Darkmoor lest they be captured&mdash;or worse.&#10;&#10;In Retreat to Darkmoor, 2-4 players assume the roles of dark overlords of the realm, each commanding an identical deck of minions. Your goal: to successfully evade the legendary heroes and take refuge in the various locations of Darkmoor. Each minion that manages to escape will count toward control of a location, but beware of your so-called collaborators, as each overlord also scores points for eliminating rival minions!&#10;&#10;",
        "artist": "Jacqui Davis,Scott Hartman"
    },
    {
        "name": "Via Nebula",
        "description": "Crafters, builders and carriers &mdash; your help is needed to dispel the mists of Nebula! The people of the valley will reward you handsomely if you harvest and exploit our many resources, open paths through the mists, and help our settlers build new structures. Cooperate temporarily with other builders in order to create paths and share goods, but do not forget your own objectives. Will you have a statue erected in your honor on the Nebula City plaza?&#10;&#10;A game of Via Nebula starts with a board showing a hexagonal grid, some production sites with a few available resources on them (wood, stone, wheat, and pigs), building sites in various areas scattered over the whole board, and a lot of mist.&#10;&#10;Turn after turn, players have two actions at their disposal from these options: They may clear the mist of a hex to create new paths of transportation, open new production sites, open a building site in a city, carry resources from any production site to their own building sites, and, of course, achieve a construction. Resources and paths through the mist may be used by all the players. This initially induces a kind of cooperation, but eventually other players will take advantage of your actions!&#10;&#10;To achieve a construction, you fulfill a contract on one of your cards. You start the game with two contracts, and four more contracts are available for all players to see and use on a first come, first served basis &mdash; and that's where the cooperation abruptly stops. Additionally, most contracts have special powers that are triggered on completion.&#10;&#10;The game ends when a player finishes a fifth building. Opponents each take two final actions, then players score based on the number of cleared hexes and opened production sites and the point value of their contracts, with a bonus for the player who ended the game.&#10;&#10;",
        "artist": "Vincent Joubert"
    },
    {
        "name": "Less: Like Chess but Less!",
        "description": "Less is a simple strategy board game for two or four players. It's a simple game which can be set up in seconds and the rules can be learned in less than a minute. Just take the nine board pieces, place the game pieces and you&rsquo;re ready to go! The goal is to move your four pieces to the opponents starting corner before he moves them to yours.&#10;&#10;The board is set up randomly at the beginning of every game and there are over 100,000 combinations to try out. Less can also quickly be expanded into a four-player game by adding another set of tiles to the deck. This way you have to work together with your partner to bring both of your pieces to the other side before the other pair of players does the same.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Archaeology: The New Expedition",
        "description": "Archaeology: The New Expedition is a reimplementation of the popular Archaeology: The Card Game (with several changes).&#10;&#10;You are an archaeologist working the dig sites of the Egyptian desert. Search for the right pieces to complete torn parchments, broken pots, and other priceless artifacts. Explore an ancient pyramid in the hope of uncovering a huge stash of treasure! Trade shrewdly at the local marketplace to increase the value of your collection. Sell your treasures to the museum at just the right time for maximum profit.&#10;&#10;But beware, the desert also has its dangers! A devastating sandstorm can throw your expedition into disarray, and cunning thieves lurk around the dig site ready to steal your prize discovery!&#10;&#10;In Archaeology: The New Expedition, you want to find treasures and make the most money possible by selling them to the museum. Players start with four treasure cards in hand; one monument tile is chosen at random, then the chambers of the monument are loaded secretly with treasure cards.&#10;&#10;On a turn, a player digs for treasure by drawing from the deck. If they find treasure, they don't show anyone and keep it; if they find a thief, they steal a card at random from an opponent; and if they find a sandstorm, all players lose half of their cards in hand to the marketplace, which starts the game with five face-up cards. (Each player has a tent that they can discard to avoid the effects of one sandstorm.) After digging, a player can:&#10;&#10;&#10;     Discard one or more maps to explore one chamber of the monument, looking at all the cards there and keeping some number of them.&#10;&#10;&#10;&#10;     Trade at the marketplace by laying down one or more treasure cards and picking up cards with equal or lesser trading value.&#10;&#10;&#10;&#10;     Sell to the museum by placing sets of treasure cards in front of them; in general, the more cards you have of a type, the more the set is worth.&#10;&#10;&#10;Players can explore only once, but they can do the other actions repeatedly, and they can take these actions in any order. Once the deck is empty, players keep taking actions until they all pass in turn, after which they sell treasures to the museum. Whoever ends up with the most money wins!&#10;&#10;According to the designer, Archaeology: The New Expedition differs from Archaeology: The Card Game through the inclusion of tent cards, the addition of new treasure types and additional cards to allow for five players, the adjustment of some treasure values, and the inclusion of six monuments instead of one to have more variety when exploring.&#10;&#10;",
        "artist": "Atha Kanaani"
    },
    {
        "name": "The Walking Dead: All Out War",
        "description": "The Walking Dead: All Out War is a tactical head-to-head game set in the walker-strewn Georgia countryside, a survival miniatures game from Mantic Games based on the characters from the pages of the bestselling The Walking Dead comic series. Your group will be pitted against other groups in a bitter fight for supplies, but the Walkers react to your every move. In this game, everyone and everything is trying to kill you.&#10;&#10;In more detail, each player controls their own group of survivors made up of popular characters from The Walking Dead storyline, such as Rick, Shane, Michonne and many more. Each survivor is represented by a finely-detailed plastic miniature, which can be painted in your color scheme of choice. It comes with a character card highlighting their game stats and unique abilities, and it can be upgraded with a selection of weapon and equipment cards.&#10;&#10;The game is set around Atlanta and the surrounding suburbs, and contains a gaming mat and a selection of barricades, abandoned cars and supplies to give it that authentic The Walking Dead atmosphere. Your survivors move across the board using the measuring stick included with the game, and you use the terrain to block Walker routes, sneak up on opposing survivors, or raid enemy camps for supplies.&#10;&#10;During the game, you fight a bitter battle for resources against a rival group of survivors &ndash; but be careful not to make too much noise as you'll draw the attention of the Walkers, which are controlled by an AI system developed specifically for this game. They attack anyone who comes within reach &mdash; and because they are AI-controlled, you can play the game solo.&#10;&#10;The base game includes rules for running simple campaigns and basic guidelines for designing your own characters.&#10;&#10;",
        "artist": "Charlie Adlard"
    }
]