[
    {
        "name": "Arnhem: The Farthest Bridge",
        "description": "From the Decision Games' website:&#10;&#10;In September 1944, Operation Market Garden was intended to open a direct path for the Allied armies to circumvent the West Wall and threaten Germany's industrial Ruhr heartland. British, American and Polish airborne forces were ordered to assault and capture key bridges along the main highway leading through Holland, the Arnhem bridge being the most distant of them all. Unfortunately, the Allies had gravely underestimated the strength of German forces in the area; so, when the airborne forces landed, they found themselves scattered amid an SS panzer division. The various bridges thus became the fulcrum of the entire operation for both sides.&#10;&#10;Arnhem utilizes the new Fire &amp; Movement combat system that's designed so players can augment their units with &quot;support fire&quot; during the course of the turns. From mortars to self-propelled artillery, units can receive support assets to engage enemy positions and formations, allowing combat to develop at all levels. A single recon battalion, for example &mdash; perhaps supported by tanks &mdash; could be tasked to assault a lone enemy paratrooper battalion defending a landing zone. As that attack gets underway, however, the recon battalion may find itself strafed by enemy fighter-bombers. More support will be necessary to take the landing zone, but assets are limited.&#10;&#10;In Arnhem, the attritional design of the new Combat Results Table simulates the true nature of battles in Europe. Units are typically two-sided formations that can incur casualties, accurately replicating the realities of combat and the high losses sustained by both sides during the actual fighting for Arnhem. Winning the battle is thus a matter of maneuver, firepower and asset management.&#10;&#10;Re-implements:&#10;&#10;    Arnhem&#10;&#10;&#10;&#10;&#10;",
        "artist": "Eric R. Harvey,Larry Hoffman,R. David Shepherd,Redmond A. Simonsen,Joe Youst"
    },
    {
        "name": "Magnum Sal",
        "description": "In the year 1368 our ruler Casimir the Great, on the right of his royal sovereignty, established the Statute of the Cracow Salt Mine. It is clearly written that anyone to whom the King awards the title of Royal Steward will manage the Wieliczka Salt Mine, called Magnum Sal. His Majesty the King will give this royal stewardship to the foreman who by his work shows that he is the best in the craft of salt mining, and he will lead the operations of the Cracow Salt Mine for the glory of the Polish Kingdom.&#10;&#10;Magnum Sal is a eurogame about exploration of a salt mine (second oldest still operating salt mine in the world). Each player takes the role of a foreman - the manager of a mining team. During the game, players will try to extract salt most efficiently from the mine, sell their &quot;white gold&quot; at the market, and above all complete the king's salt orders. The player who earns the most money from extracting salt receives the title of Royal Steward and wins the game.&#10;&#10;(From the rulebook)&#10;&#10;Magnum Sal is latin name that Wieliczka was noted in some documents for the first time - it means Great Salt. From this latin name, Wieliczka was formed - Magnum (Latin) -&gt; Great (EN) -&gt; Wielki (PL)&#10;&#10;Quote from wikipedia (there is no source for this but it's probably the way that the name Wieliczka was formed): &#10;Magnum Sal (latin) -&gt; Wielka S&oacute;l -&gt; Wielika S&oacute;l -&gt; Wielicka -&gt; Wieliczka&#10;&#10;",
        "artist": "Piotr Nowojewski"
    },
    {
        "name": "Papayoo",
        "description": "Get rid of your Payoo!&#10;&#10;There are no jacks, queens or kings in Papayoo &ndash; just an unusual die and a fifth suit called Payoo. The aim is to score the fewest points possible; to do so, try to avoid collecting those dreadful Payoos and especially the Papayoo, that confounded 7, whose suit changes with each new hand. That cursed die!&#10;&#10;If you are unhappy with your hand, don't fret; just give your hand to the player on your left before starting. Be sure to make the right choice because you'll be getting the player's cards on your right. Then play your hand with no trumps or qualms. The best player doesn't always win!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "51st State",
        "description": "The world you know no longer exists. There is no government. No army. No civilization. The United States have collapsed. And now, thirty years after the war started, new powers finally try to take control over the ruined country, try to establish a new order, try to control others and create a new country, a new State: the 51st State.&#10;&#10;51st State is a card game in which players control one of the four powers (mutants, traders, New Yorkers and Appalachians) and try to build their very own new country. Players put new locations into the game, they hire leaders, and send people to work in buildings to gain resources and new skills.&#10;&#10;Every card in 51st State can be put into play in three different ways. You can invade a location to gain many resources once, or you can sign a contract with this location to gain one resource every turn, or you can attach the location to your State so you can use its skill. One card, three possibilities. Lots of decisions and choices that matter.&#10;&#10;Integrates with:&#10;&#10;&#10;     The New Era&#10;     Winter&#10;&#10;&#10;",
        "artist": "Mateusz Bielski,Mariusz Gandzel"
    },
    {
        "name": "Troyes",
        "description": "In Troyes, recreate four centuries of history of this famous city of the Champagne region of France.  Each player manages their segment of the population (represented by a horde of dice) and their hand of cards, which represent the three primary domains of the city:  religious, military, and civil.  Players can also offer cash to their opponents' populace in order to get a little moonlighting out of them&mdash;anything for more fame!&#10;&#10;Make your underlings:&#10;&#10;     work on the cathedral&#10;     combat misfortune&#10;     bustle about the city&#10;     and other such tasks that are below your family's stature&#10;&#10;&#10;&#10;&#10;Online Play&#10;&#10;&#10;     Board Game Arena (real-time or turn based)&#10;&#10;&#10;",
        "artist": "Alexandre Roche"
    },
    {
        "name": "Pirates vs. Dinosaurs",
        "description": "Pirates vs. Dinosaurs is a game for 2-6 players by Richard Launius (designer of Arkham Horror) in which players control pirate captains and their cutthroat crews, all with partial knowledge of the whereabouts of buried treasure on a forgotten Pacific island.&#10;&#10;The catch? They don't know the island is the final home of dinosaurs, survivors of millions of years, and they aren't happy to let outsiders explore their island. Of course, the pirates also don't know that the island is sinking or that there are other pirates looking for the same treasure. Who will get away with the most loot and become the pirate remembered by history?&#10;&#10;Before the game, players outfit themselves with a variety of crew, weapons, and gear before choosing the section of the island that they will explore, knowing that the jungle takes longer than the beach as they look for their parts of the map. The search can be interrupted as other players play dinosaur (and other) cards to cause mayhem and carnage. Once the treasure is located, players draw treasures from a bag, looking to avoid the pirate ghost and island sinking events, and return safe to their ship &ndash; a question of how far they'll go in pushing their luck.&#10;&#10;",
        "artist": "Josh Cappel"
    },
    {
        "name": "Pirate Fluxx",
        "description": "Fluxx with a pirate twist. Getting the Captain's Hat allows you to have a good bit of control, but watch out for Scurvy and Shackles, which will keep you from winning. Grab lots of Booty keepers, maybe some Ships, and expect a few new Surprise cards along the way. (From playing the game demo at Origins 2010)&#10;&#10;A pirate themed variant of Fluxx, this game is much like the original. Simply follow the rules that are currently in play. Start by drawing a card and playing a card, but even those can be changed. There's no way to win at the begining, but once a Goal card is played, you have to play the appropriate Keeper cards in front of you or play other cards to keep them away from everyone else, like Steal a Keeper or play a new goal card to replace the old one.&#10;&#10;New to Fluxx are the Surprise cards which can be played at any time to cancel certain plays or steal a keeper as played.&#10;&#10;",
        "artist": "Derek Ring"
    },
    {
        "name": "Tadaaam!",
        "description": "Tadaaam! is a revision and repackaging by C&#195;&#169;drick Caumont and Thomas Provoost of the earlier Monstermaler. The most obvious change is that Tadaaam! comes in a big box (Monstermaler was just a pad of paper), with cards to suggest people, and now also objects and animals, that players independently draw right and left halves of with pens on wipe-clean boards to make one recognisable picture. The pictures are then revealed and the players guess what those they didn't draw are intended to be.&#10;&#10;Along with revisions to the basic rules there are now easy, normal, difficult and character categories of things to draw and a spinner which adds one of six additional challenges to drawing: with the ear on the table, blind under the table, with the &quot;wrong&quot; hand, without the thumb, et cetera&hellip;&#10;&#10;Re-implements:&#10;&#10;    Monstermaler&#10;&#10;&#10;&#10;&#10;",
        "artist": "Fabrice Bovy"
    },
    {
        "name": "Porto Carthago",
        "description": "Carthage &ndash; long before the deadly conflict with Rome.&#10;During 5 decades, each a game round, players use their servants to earn income or position them to obtain goods and load the goods onto incoming merchant ships - or even take the risk of chartering a private vessel - all with the goal of buying influence in the palace.  Influence in the harbor can also determine where the best ships will dock, and the path of intrigue can provide yet another way into the palace courts.  Only the player who develops the best business - through any means necessary - will end the game as the most influential senator.&#10;&#10;",
        "artist": "Oliver Schlemmer"
    },
    {
        "name": "Expedition Sumatra",
        "description": "Sumatra - Island of many rare species&#10;&#10;On behalf of the most famous zoological gardens of the Western World a few teams of big game hunters set out to the jungle of Sumatra to catch some nearly extinct species for the benefit of posterity. While also the black market lures with attractive prices, the inhabitants of the island have a say in the matter as well.&#10;&#10;Expedition Sumatra leads the players into the dense primeval forest of the Indonesian island. By cleverly flipping and rotating the path tiles they have to build new roads through the jungle, track down rare animals and load them onto their ships, which circle around the island.&#10;&#10;Like the vegetation in a jungle the board of Expedition Sumatra is constantly changing its appearance - old paths vanish, new ones appear, while the players are searching for animals hidden in the forest. And each tile that is flipped raises the question anew: Will the hunt be successful or will there be only deserted paths or might there even be a native lurking, ready to take the hard-won animals back to the jungle?&#10;&#10;---&#10;&#10;Sumatra - Insel vieler seltener Tierarten&#10;&#10;Im Auftrag namhafter Zoologischer G&auml;rten machen sich mehrere Teams von Gro&szlig;wildj&auml;gern daran, zum Nutzen der Nachwelt einige der selten gewordenen Tiere im Dschungel von Sumatra einzufangen. Zwar lockt auch der Schwarzmarkt mit guten Preisen, doch die Inselbewohner haben ebenfalls noch ein W&ouml;rtchen mitzureden.&#10;&#10;Expedition Sumatra f&uuml;hrt die Spieler in einen &uuml;ppig wuchernden Inselurwald. Hier gilt es, durch geschicktes Klappen und Drehen der Wegepl&auml;ttchen Pfade durchs Dickicht zu bahnen, seltene Tiere zu entdecken und auf das eigene Schiff, das die Insel umkreist, zu verladen.&#10;&#10;Wie die Vegetation eines Urwalds ver&auml;ndert sich bei Expedition Sumatra best&auml;ndig der Spielplan - alte Wege verschwinden, neue entstehen, w&auml;hrend die Spieler auf der Suche nach im Dschungel versteckten Tieren die gr&uuml;ne Wildnis durchk&auml;mmen. Bei jedem Klappen eines Wegepl&auml;ttchens stellt sich erneut die Frage, was sich darunter verbirgt - wird einem das Jagdgl&uuml;ck hold sein, st&ouml;&szlig;t man nur auf verlassene Pfade oder lauert einem gar ein Eingeborener auf, der wom&ouml;glich die m&uuml;hsam gefangenen Tiere wieder zur&uuml;ck in den Urwald bringen will?&#10;&#10;",
        "artist": "Mariusz Gandzel,Piotr Rorot,Anna Włodarska"
    },
    {
        "name": "Cabo",
        "description": "In Cabo, the goal is to minimize the total value of your cards; however, you don't know what all your cards are at the beginning of the game.  By using certain cards to peek at your own card, spy on your opponent's card, or swap a card with your opponent, you can try to minimize the value of your cards.  When you think you have the lowest value, you can call &quot;Cabo&quot; to end the round, but everyone else gets another turn.&#10;&#10;By adding more decks, you can theoretically play with as many players as you want.&#10;&#10;This is a commercial version of four-card Golf with special-power cards and a few variant rules.&#10;&#10;",
        "artist": "Adam Peele"
    },
    {
        "name": "K2",
        "description": "K2 is the second-highest mountain on Earth as well as the second deadliest. It's known as the Savage Mountain, as it kills one person for every four who have reached the summit...&#10;&#10;Now your team stands in its shadow, ready to climb for fame and glory.   &#10;You know the dangers of K2 all too well. Extreme weather with frequent and  deadly storms, exposed, steep, tricky routes and lack of oxygen await you on your way to the summit. You will test your climbing skills to death, try to outsmart the ever-changing weather and always worry about the acclimatization of your 2 mountaineers. Also there are the other teams ready to take the glory for themselves.&#10;&#10;K2 is a board game in which each player controls a team of 2 mountaineers, trying to climb to the summit of K2 and return before the other players' teams and before the mountain kills them. Every player uses an identical deck of cards. You use the cards to move your climbers on the route pictured on the gaming board, or to acclimatize the members of your team.  &#10;You can also set up a tent and wait for better weather. You will have to choose your path carefully, as the other mountaineers can block your way, and watch the upcoming weather which can lower your acclimatization to 0, thus killing your climbers.&#10;&#10;K2 is a hand management game for 1-5 players, with strong interaction and low luck factor, lasting up to 60 minutes. The theme is very well represented by the mechanics, including such elements as changing weather, lack of oxygen and death of the mountaineers. The result is an exciting match for gamers and non-gamers alike.&#10;&#10;The box includes, among other materials, a double-sided board with two different routes to the summit (easier and harder) and two sets of weather tiles (for summer and winter).&#10;&#10;",
        "artist": "Jarek Nocoń"
    },
    {
        "name": "Grimoire",
        "description": "Grimoire is the French word for &quot;spellbook&quot;, and smart use of your spellbook &ndash; more specifically, the spells within said book &ndash; will determine whether you succeed in this game.&#10;&#10;Each turn in Grimoire starts by revealing several cards on the game board; each card has either a victory point (VP) value or is a character with a particular way to earn VPs at the end of the game. Once these cards are revealed, each player secretly chooses which spell to cast in his spellbook by placing a bookmark on the appropriate page. Everyone then reveals which spell they chose, with the spells going off in order from weakest (those with the lowest numbers) to strongest. Some weak spells nerf stronger ones, and the order in which players choose cards from the display can be flipped topsy-turvy depending on who plays which spells.&#10;&#10;In the One Draw and Z-Man versions, the game ends as soon as one player has collected either ten character cards or ten treasure cards; in the Schmidt Spiele version, the game ends after a fixed number of rounds. All players then tally their points, and the player with the highest score wins.&#10;&#10;Differences between the versions:&#10;&#10;&#10;    As noted above, the game ending conditions differ in the 2012 Schmidt Spiele version.&#10;    The Z-Man Games and Schmidt Spiele versions of Grimoire accommodate five players, while the original One Draw release allows only 2-4 players.&#10;    The Schmidt Spiele version contains four new character cards and two new treasure cards, includes hardcover books instead of softcover, changes two spells, and uses a more elaborate game board that depicts the spells and allows players to mark the spells chosen with small figures to track who has played what.&#10;&#10;&#10;",
        "artist": "Matthias Catrein,Eckhard Freytag,Keita Komiyama,Shusaku Kondo"
    },
    {
        "name": "Red Poppies: WWI Tactics",
        "description": "Red Poppies simulates regimental-sized engagements from WWI with company-level units in 10 minute turns on maps scaled at 200 yards per hex. The game strives to illustrate the sort of command and control trade-offs that typified WWI battles.&#10;&#10;The units involved are companies and platoons, making this one of the few games to cover World War I small unit tactics. In addition, there are rules for tanks, barbed wire, artillery support, infiltration tactics, cavalry, and machine guns. Scenarios will include German, French, Belgian, and British forces, with battles spanning the entire conflict on the western front.&#10;&#10;Scenarios&#10;1. &quot;Opening Day&quot;, July 1, 1916, La Boiselle (Somme)&#10;2. &quot;Storming La Boiselle&quot;, July 3, 1916, La Boiselle (Somme)&#10;3. &quot;Meeting Engagement&quot;, August 22, 1914, Neufchateau&#10;4. &quot;Heavy Section Machine Gun Corps&quot;, September 15, 1916, Flers&#10;5. &quot;Kaiserschlacht&quot;, March, 1918, Flers&#10;6. &quot;Cavalry Charge&quot;, August 12, 1914, Haelen&#10;7. &quot;Attack on Mort Homme&quot;, April 9, 1916, Mort Homme&#10;8. &quot;Tank Assault&quot;, April 16, 1917, Juvincourt&#10;&#10;",
        "artist": "Ian Wedge"
    },
    {
        "name": "Der Pate",
        "description": "Der Pate (Eng: The Godfather) is one of the 2010 Essen releases of Kosmos. Here is a loose translation of their promo text on their website.&#10;&#10;Each player is the head of one of New York's Mafia clans and tries to earn the most money with illegal activities, e.g. running casinos or betting agencies.&#10;&#10;To hinder the opponents you can tip off the FBI about their activities or (more bluntly) initiate a vendetta. &#10;With the help of your Consigliere you can make offers the opposition cannot refuse and take over a business the FBI just shut down. You can also influence the press to improve your reputation and use the help of a prosecutor who is a friend of the family to get your relatives out of jail. Just don't be prissy or you won't become the boss of bosses.&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Fictionaire",
        "description": "[Fic&bull;tion&bull;aire: Person who tricks opponents into choosing&#10;the wrong word definition in the dictionary game.]&#10;&#10;You may know it as dictionary, fictionary, Balderdash... or even &quot;Call my Bluff&quot;, the classic British TV game show; but it could just as easily be called &quot;the making up lies to fool your friends&quot; game!&#10;&#10;Fictionaire is a new quiz card game from Days of Wonder&#10;that gives a fresh twist to this classic genre.&#10;&#10;In Fictionaire, players make up a bogus definition or fake answer for a word or question asked by the game&rsquo;s host, trying to trick him or her into believing that their answer is correct. To earn points, players either choose the right definition - or get someone to pick their answer. If a player bluffs someone into choosing the wrong answer, they earn a bonus point.&#10;&#10;",
        "artist": "Cyrille Daujean"
    },
    {
        "name": "Rolling Freight",
        "description": "Rolling Freight is a route building and cargo shipping game in which dice represent each player&rsquo;s resource pool. Players spend these dice to purchase and complete rail contracts, deliver cargo, and improve their companies&rsquo; competitive abilities. Who can build the best rail network and deliver the most profitable goods? Get rolling and find out!&#10;&#10;Players begin the game with a pool of six dice with multi-colored sides. On each turn, a player can spend his or her dice to purchase contracts, construct rail links, build switching stations, purchase improvements and deliver one cargo of passengers or freight. Unused dice can be converted into stockpile markers for future use. By purchasing improvements, players can gain more dice with special abilities, become more efficient at laying rail or stockpiling dice, or increase the points they receive when other players deliver cargo over their rails. Bonus points are awarded for delivering passengers quickly or delivering freight over long distances.&#10;&#10;The large, two-sided, colorful board has two maps. The western U.S. map, from the California gold rush era, is designed for 2 &ndash; 4 players. With many double-track routes, this map allows newer players to effectively plan their networks and maximize deliveries. The southeastern U.S. map, depicting the late Nineteenth Century, has only single-track routes that are significantly interwoven. This provides more advanced strategic options and is intended for 3 &ndash; 5 experienced players.&#10;&#10;",
        "artist": "Jim Maxwell"
    },
    {
        "name": "Warhammer Fantasy Battle: The Island of Blood",
        "description": "The Island of Blood is the introductory set for Warhammer Fantasy Battle eighth edition. It is a stand alone game containing forces of Skaven and High Elves along with a small rulebook, scenario book and dice and templates necessary to play. Set during a Skaven raid of an Elven fortress island, this set contains two starter armies plus a smaller, pocket-sized version of the Warhammer rules.&#10;&#10;Players take command of each force, fighting a series of battles recreating the battles for the Island of Blood each looking to conquer it for their own.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Flash Point",
        "description": "Introduction&#10;&#10;A fire has erupted in a large home, threatening the property and its occupants. As the first responders to the fire, players must enter the home to rescue the people trapped inside. Resources are scarce, and time is not an ally. As the fire spreads out of control, victims are endangered and the building approaches collapse. Players must cooperate to mount a successful rescue effort.&#10;&#10;Objective&#10;&#10;Flash Point is a fully cooperative game, meaning that players win or lose together. To win, players must rescue the victims trapped inside a burning home. The players fail if three or more people die, or if the house collapses from structural failure.&#10;&#10;Features&#10;&#10;&#10;     Fire and smoke spread, interact, flashover and explode through an innovative mechanic. Chain reactions are possible and very deadly.&#10;     Fully cooperative gameplay where players must work together to overcome the fire and rescue trapped victims.&#10;     Game scales well, accomodating as few as 1 and as many as 6 players. Solitaire is an option!&#10;     Two ways to play: the Basic Game introduces key concepts and is a great way to teach new players. The Advanced game adds specialists, two drivable rescue vehicles, hazardous materials, and random start conditions.&#10;     Multiple difficulty levels accommodate the widest range of player ability and invite replay.&#10;     Two houseplans are included. Each presents its own challenges.&#10;&#10;&#10;",
        "artist": "Kevin Lanzing"
    },
    {
        "name": "War Cards",
        "description": "War Cards is a card game based on War, a classic boardgame from Brazil (the later is based on Risk). As well as in the original game, in War Cards each player commands an army and have objectives like conquer certain continents or a number of territories determined in the Objective Cards. Another new feature in War Cards are the special power cards, wich gives various abilities for the player to use. In the boardgame the combats are decided with dice rolls. In War Cards the combats are decided through the cards depicting dice in various combinations. War Cards plays faster than the boardgame (about 45 minutes), and unites strategy with a little luck. The game comes in a plastic box, so you can take it with you wherever you want.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Got It!",
        "description": "The math game Got It! &ndash; which had a working title of Fermat &ndash; accommodates as many people as fit around the table. What they're looking at on the table is a 6x6 grid of cards, with half the cards numbered 1-14 and the other half bearing mathematical operators. To set up the game, these cards are placed randomly checkerboard-style, with numbers and operators placed adjacent to one another.&#10;&#10;Everyone plays simultaneously, with players trying to find a five-card formula that results in the number shown on a goal card, with goals ranging from 1 to 40. The solution must consist of orthogonally adjacent cards, though not necessarily in a straight line, and a player can't use a card twice in a formula. If a 12 is turned up as the goal, for example, one might find &quot;8+4x1&quot; in the grid, then shout out &quot;Got It!&quot; Players can mentally insert parentheses into a formula, so &quot;7+2x3&quot; can result in (7+2)x3 (=27) or 7+(2x3) (=13).&#10;&#10;The first player to shout with a correct formula &ndash; and the grid might contain many &ndash; claims the goal card. The player who collects the most goal cards wins!&#10;&#10;An easy version of Got It! can be set up for younger players, with a 5x5 grid that contains only the numbers 1-9 and only addition and subtraction as mathematical operators.&#10;&#10;",
        "artist": "BoardGameDesign.com,Michael Spahitz"
    },
    {
        "name": "Norenberc",
        "description": "In Norenberc, each player represents an ambitious merchant trying to gain influence in the town council of Norenberc. To do this, players must win over the craftsmen of the city's various guilds. The player who manages to win over the most (and the most influential) craftsmen will be the one who wins the game.&#10;&#10;Every round consists of one or more turns. Every turn, all players simultaneously select the guilds at which they wish to take actions, limited by the number of agents at their disposal. Actions include buying and selling goods and hiring guests who are lodging at the guilds: various craftsmen and townsmen with useful special abilities.&#10;&#10;At the end of each round, the master of each guild will select a favorite from among the players: the one owning the most of that guild's goods. The favorite of each guild will claim the loyalty of that guild master and earn one of that guild's crests. The most important guild in the city will also bestow one of the valuable prestige crests upon its favorite.&#10;&#10;At the end of the game, players will compare their amassed craftsmen, crests, money, and townsmen to see who has won the game!&#10;&#10;",
        "artist": "Josh Cappel"
    },
    {
        "name": "De Vulgari Eloquentia",
        "description": "Italy, late Middle Ages. The fabric merchants need to write down their contracts in a language that everyone can understand and the literates are looking for an alternative to the elite of the traditional Latin language. So, the Volgare, the language spoken by the common people, taken from the dialects spoken in the various Italian regions, starts to gain relevance. During this period, Francesco D&rsquo;Assisi writes his famous Canticle of the Sun and Dante writes the Divine Comedy, both written in Volgare.&#10;&#10;The players will have to do their part in the creation of this new language! But who will provide them the proper knowledge to understand the manuscripts in the different dialects? Who will succeed to uncover the secrets of the books inside the Papal Library? Who will embrace the religious life and who will remain a merchant? Some of the players can become a famous banker, someone else can climb the church&rsquo;s hierarchy to be the next Pope! But in the end, who will be the most appreciated and respected for his status and his culture?&#10;&#10;The aim of the game is to obtain more Volgare points. The players will gain VP from reading manuscripts, looking for important documents like the Canticle of the Sun or &quot;The Riddle from Verona&quot;. Players can also gain VP by improving their social status, for example, if the merchant becomes a banker or the Friar becomes a Benedictine Monk or the Cardinal becomes Camerlengo or Pope. Moreover, VP can be gotten with money and with the support of Politicians, Noblemen, Abbesses, and the Amanuensis.&#10;&#10;",
        "artist": "Lamberto Azzariti,Guido Favaro,Eva Villa"
    },
    {
        "name": "Grand Cru",
        "description": "Grand Cru represents the best locations for a vintner to create and cultivate wine. But creating great wine and running a successful vineyard requires much more than just a great location. Patience, dedication, and a good understanding of the market are all needed to be profitable.&#10;&#10;As ambitious vintners, the players attempt to run new vineyards located at the best sites available. As with many new businesses, starting up is very difficult. For cultivation and operating of their new businesses, the players will need to rely on loans from the local bank. Money is tight and wise investments will also help with the costs of the business. There is a need to observe the cellar and balance long-term strategies against short-term interests for running a successful vineyard. Far-sighted planning and skillful timing are keys to success.&#10;&#10;The game ends when the first player is able to pay off all of his loans. Only then do the players find out which vintner has the most profitable vineyard to win the game. A votre sant&eacute;!&#10;&#10;",
        "artist": "Alexander Jung"
    },
    {
        "name": "Utopia Engine",
        "description": "Utopia Engine is a free print-and-play dice game for one player.  You play an old artificer named Isodoros who is attempting to reconstruct the Utopia Engine, a fabled device from the distant past and possibly the only hope for averting the fast approaching Doomsday.  You must recover the machine's six parts from six dangerous regions and assemble the Utopia Engine before the world ends.  The game uses simple dice mechanics to simulate searching the wilderness, activating and assembling powerful artifacts, and combat with artifact weapons.&#10;&#10;Requires a printed play sheet, two six-sided dice, and a pencil with eraser.&#10;&#10;",
        "artist": "Nick Hayes"
    },
    {
        "name": "Target Earth",
        "description": "&lsquo;Target Earth&rdquo; is a board game simulation of an Alien Invasion of Planet Earth. &#10; Battlefield is the whole planet, represented by a Global Board, featuring the 30 most economically powerful countries on the planet. Allied countries will bring money and Victory points to the Alliance. Countries aligned with the Aliens will count as victory points for the invader.  By the end of the seventh turn whichever side has more Victory Points will be the winner.&#10; Each player represents a faction of a Human Alliance and manages one of their bases and its associated resources (money, units and cards).  Players must deal with the alien offensive using their units to fight airborne and landed UFOs in an effort to strengthen their Alliance by getting countries to join them. In order to stop the Alien offensive and beat the invader, they must also investigate new technologies as well as the nature of the Alien life form.&#10;&#10;The Alien side is not controlled by any player. Its actions are determined randomly each turn, with an incremental difficulty as game progresses.&#10;&#10; The game has two playing modes:&#10; -Basic mode is a cooperative game where 1-4 players form a Human Alliance that will fight to stop the alien invasion. &#10; In this game mode, if the Human Alliance achieves victory, all players win. Otherwise, everyone loses.&#10;&#10;-Advanced game mode, is a semi-competitive game for 2-4 players, where each player forming the human Alliance has his own secret agenda and is able to obtain individualized victory points. As in the basic mode, the total amount of victory points and human technology level will determine whether the Alien side has achieved victory. If Humans win, only one of the players will be declared winner, according to their fulfilled agenda and performance during the Alien War.&#10;&#10;",
        "artist": "Sergi Marcet"
    },
    {
        "name": "Paris Connection",
        "description": "A re-issue of David V. H. Peters' SNCF (Soci&eacute;t&eacute; Nationale des Chemins de fer Fran&ccedil;ais).  Originally released by Winsome Games as part of its 2010 Essen Set, SNCF was subsequently licensed by Queen Games and rereleased as Paris Connection in 2011.  This is a fast network-/portfolio-building game with a train theme, with the objective of having the most valuable stock portfolio at the end of the game.  Players can own and trade stocks as well as influence the value of each company.&#10;&#10;There are 6 colors of wooden locomotives, each color representing a company.  Players are dealt random hands of 5-10 (depending on number of players) locomotives, which are essentially a stock portfolio; the rest of each color are placed in a pool.  On your turn, you can either increase the value of a single company by placing 1-5 locomotives from the remaining pool of that company, or you can trade one locomotive in your portfolio for one or two locomotives from the remaining pool in a company.&#10;&#10;The game board is a map of France, with cities worth anywhere from 1-4 points, and rural hexes worth 0.  Connecting to a city adds to a company's value.&#10;&#10;The game ends when Marseille is reached by a company, or when there is only one company with locomotives remaining in the pool.  Players' scores are determined by the value of each company at the end multiplied by the number of locomotives the player has for each color.&#10;&#10;SNCF expansions may be used with this game.&#10;&#10;",
        "artist": "Oliver Schlemmer"
    },
    {
        "name": "Texas & Pacific",
        "description": "You and your friends are rail barons trying to be on top. Who will correctly determine the end game and have the most money?&#10;&#10;A fun train game.&#10;&#10;Harry Wu's Texas &amp; Pacific is a train game that employs 2-6 players for an hour. The players are rail barons who purchase stock and try to increase their income through shrewd track placement. The game includes ranches, building options and the explosive growth in Texas. The player with the most money at the end of the game wins! A player may trigger a stock auction, lay track, or pass.&#10;&#10;Contents: Cubes, stock shares, map, rules&#10;Part of the Winsome Games Essen 2010 Set.&#10;Winsome Games' 2010 Essen Set&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Karnaxis",
        "description": "In Karnaxis, you're a high school graduate trying to find your own path to success in the modern economy. You'll choose a character with different talents and a unique Karnaxis, or life ambition. Using 2 actions for each of the 12 game years, you'll take turns competing for various jobs, businesses, and a college education while trying to fulfill your life ambition. Each year, random events mix things up; like the stock market crashing. At the end, the player with the most cash wins.&#10;&#10;One character's life ambition may be to dominate the business world, while another's may be to become a doctor. As you fulfill your ambition, you receive bonus cash. Along with college, jobs, and businesses you can also start franchises, play the stock market, invest in retirement, get pay raises, win the lottery, take out loans, or even collect unemployment. It's up to you where to take your life and what financial fate that path holds.&#10;&#10;",
        "artist": "Julie Gersewski"
    },
    {
        "name": "Master of Economy",
        "description": "Financial simulator.&#10;Players start the game by managing their corporations (1 of 4) and using them as a tool for increasing the value of private property (like countries in &quot;Imperial&quot;). By effective speculation on the stock market, a player may take control of more than one corporation. Proper corporation management is preferable but not the most essential.&#10;The rules attempt to simulate real conditions of business competition and relationships between shareholders.&#10;&#10;THERE IS NO LUCK FACTOR.&#10;Internal balance discourages to play in a relation of 2(3) players versus 1.&#10;&#10;Most of the rules are quite easy and intuitive. It is the most difficult to use the rules effectively by good planning and predicting opponents&rsquo; plans.&#10;Players manage their corporations by investing in new factories and trading produced goods to earn money (like in many other games). The point is what the players do with earned money. They can re-invest it to make their corporations earn more during next phase or try to make pressure on another player by buying shares of his/her corporation. The player who has the biggest number of shares can be elected by voting as a new leader of the corporation for the next stage. Even if you don`t have enough shares to take control over another player`s firm, the investment can be quite beneficiary because it can give you some profit (if that firm is managed well) or enforce your opponent to use the corporation money for defending, which makes his final result worse than could be achieved without your pressure.&#10;&#10;Of course, the more players (max 4), the more fun there is during voting phase when all the shareholders, who are going to manage the corporation in the next stage, vote.&#10;&#10;The game tries to extract maximum advantage of double circulation of money you can find in the &quot;Imperial&quot;. Players have money and corporations have money. So, what is new then? Besides the players, also the corporations can be shareholders and they all (corporations and players) vote for new leaders. It means that if you want to keep control over a corporation you had started with, you can, for instance, first take control over some weaker corporation which has some shares of yours. The best defense is attack, isn`t it? ;) The only weapon in this war is money.&#10;&#10;There are some tools of defense, so taking control over experienced opponent`s corporation is rather difficult, though possible. When an experienced player plays versus a beginner, he/she shouldn`t have a problem with it. Moreover, keeping control of the corporation is useful, because it is a way of generating money for the leader, although speculating by buying and selling shares is a bit more efficient. It is the best to go both ways at the same time, choosing and changing your engagement alternately.&#10;&#10;Well, it is also possible to play without any corporation and increase the value of private property only by playing as a stock market profiteer, but this way is recommended only for very experienced players.&#10;&#10;There is a fixed variant of playing 2 vs. 2.&#10;&#10;",
        "artist": "Paweł Klus"
    },
    {
        "name": "Tanto Cuore: Romantic Vacation",
        "description": "Tanto Cuore: Romantic Vacation, the second expansion for the deck-building game Tanto Cuore in addition to being a standalone game, is themed around a paradise island vacation. (&quot;Dokidoki&quot;, the sound of heartbeat in Japanese, means &quot;exciting&quot; or &quot;romantic&quot;, which is why the English name is &quot;Romantic Vacation&quot;.) Players take the role of house lords and start with a deck containing some love cards and a few maids. During the game, players gradually employ more maids, increasing their deck of cards, and the player who collects the most victory points wins.&#10;&#10;Romantic Vacation includes love cards and maid cards like the parent game, but no event cards (curse cards) nor private maids (unique cards with a lasting effect). Instead the game introduces reminiscence cards, representing memorial events, like &quot;Camp Fire&quot;, &quot;Watching the stars&quot;, &quot;Picnic&quot;, etc. These cards are worth substantial victory points, but unlike the other victory points they are not bought with love, but gained by discarding a specified number of maid cards from your hand, thus introducing the possibility of getting victory points from pure maid cards, previously not possible. These reminiscence cards never enter a player's deck.&#10;&#10;",
        "artist": "COMTA,Takehito Harada,Akira Hayase,Kinoshita Ichi,Kira Inugami,Souji Kusaka,Misa Matoki,Miki Miyashita,Poyoyon Rock,Ruchie,Satoru Satou,Ofuu Yamadori"
    },
    {
        "name": "Firenze",
        "description": "In the Florence of the 12th-14th centuries, the city&rsquo;s powerful and in&#31;fluential families don&rsquo;t just compete with each other in trade and politics. They also try to outdo one another by building tall, mostly square-based tower homes as status symbols.  In this game, you are master builders working on the families&rsquo; construction commissions for such towers.&#10;&#10;Each player competes to earn the most prestige points, by completing the commissions from families and the church and placing their seals on the work they have done.  When someone plays their final seal the other builders get one more turn before the final scoring.&#10;&#10;Coloured bricks are the currency of the game and there are cards to both help and hinder your progress.  On a turn a player must choose a card from the display, taking the bricks from it and paying a brick to every card skipped.  There is an opportunity to exchange 3 bricks for one on display before the player works in their construction site.  Players can have multiple towers they are working on at once.  However for every brick they wish to add in a turn there is an extra cost, and if any towers are not increased in a turn then they will be torn down as abandoned construction. Players must pay attention to other projects, so that commissions  they were counting on are not snatched away before they can claim them.&#10;&#10;This game won the second prize at the &quot;Hippodice e.V. Authorenwettbewerb&quot; (game designer contest) in 2008 under the name &quot;Die Architekten von Florenz.&quot;&#10;&#10;",
        "artist": "Michael Menzel"
    },
    {
        "name": "Inca Empire",
        "description": "In Inca Empire, each player is an &quot;Apu,&quot; or leader of one of the four regions (&quot;suyus&quot;). Your job as an Apu is to increase your status in the eyes of the divine emperor (&quot;Sapa Inca&quot;) by doing the best job of expanding and improving the empire. Each Apu begins with the manpower of their region. They build roads and conquer neighboring regions, increasing the manpower and resources available to them. Apus are rewarded for each new region they add to the empire and for improvements such as terraces, garrisons, cities, and temples.&#10;&#10;The player who has the most victory points (VP) at the moment Pizarro arrives at the Inca capital of Cuzco wins the game.&#10;&#10;Note: Due to the highly interactive nature of the Sun card placement, Inca Empire cannot be played with only two players.&#10;&#10;Inca Empire is a reimplementation of Tahuantinsuyu.&#10;&#10;",
        "artist": "Alexandre Roche"
    },
    {
        "name": "Bhazum",
        "description": "Welcome to the colorful city of Bhazum!  Ruled by the Councils of the four Cliques, the city is spilt into two prosperous disctricts. Players are in control of one of these two districts, and by drafting and playing cards depicting the city's Characters, they attempt to secure the support of the councils and have the best inhabitants.&#10;&#10;The game begins with players drafting the 64 character cards to form two 32 card decks, one for each player.  During the player's turn, the player gains actions to play Character cards into his district.  Each character belongs to one of the four cliques, and many have special abilities, called Traits, that occur when they are placed into a district from a player's hand.  Additionally, at the end of a player's turn, the player will place a card from his hand face down on one of the council cards.  When a Character with the Ksari trait is played in a district, the corresponding Clique Council is convened, and the player with the highest value of face down cards wins the support of the convened council.&#10;&#10;Players score points for the Characters in their districts, as well as points for the Council support they have received.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Shipwrights of the North Sea",
        "description": "Shipwrights of the North Sea is set in the early years of the Viking Age, circa 900 AD. As Viking shipwrights, players compete to build the greatest fleet on the North Sea. Players must collect oak, wool and iron, as well as getting other craftsmen on board to help. Gold is a precious commodity, and must be spent wisely. As you would expect, the township is filled with an array of characters, bad and worse. Better hope they're on your side!&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Aim of the Game&#10;&#10;The aim of Shipwrights of the North Sea is to be the player with the most Victory Points at the game&rsquo;s end. Points are gained by constructing various Ships and Buildings. The game ends after the round where 1 or more players constructs their 4th ship.&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Gameplay Overview&#10;&#10;The game is played over a series of days (rounds). Each day follows the same pattern:&#10;&#10;Morning Phase - Planning (Each player receives 3 cards)&#10; Afternoon Phase - Working (Players take actions and play or discard their 3 cards)&#10; Evening Phase - Resting (Players receive Gold and Workers for the next day)&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Printed Components&#10;&#10;128 Cards - Featuring 46 unique and stunning illustrations&#10;5 Beautifully Illustrated Player Boards&#10;5 Player Reference Boards&#10;1 Illustrated Rulebook&#10;1 Pioneer Token&#10;5 VP Markers&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Wooden Components&#10;&#10;5 Gold Ships&#10;25 Oak&#10;25 Wool&#10;25 Iron&#10;50 Workers&#10;&#10;",
        "artist": "Mihajlo Dimitrievski"
    },
    {
        "name": "Julian: Triumph Before the Storm",
        "description": "Julian, designed by Joseph Miranda, is a wargame of intermediate complexity simulating the situation across the Roman Empire in the 4th century AD. There are two opposing players: Roman and Barbarian. The Roman player represents the high command of a centralized empire; the Barbarian player represents the various chaotic forces working to destroy that empire. The Roman objective is to reconsolidate the threatened empire and secure its frontier regions to prevent further barbarian invasion. The Barbarian objective is to grab as much Roman territory as possible. The game system is based on the one originally presented in our earlier S&amp;T games: They Died With Their Boots On, Vol. 1 and They Died With Their Boots On, Vol. 2.&#10;&#10;The Barbarian side is divided into &ldquo;forces,&rdquo; each representing an independent people or coalition of tribes, such as the Goths. The Persians and Armenians, though commanded in the game by the barbarian player, are considered &ldquo;civilized&rdquo; forces (along with all Roman and rebel units).&#10;&#10;Each turn represents one year. Each hexagon on the map represents 100 miles (162 km) from side to opposite side. Each unit represents 10,000 to 30,000 troops and camp followers, etc. Special rules cover such things as: usurpation, stratagems, random events, reinforcements, pursuit, taxation, Caesar and Augustus units, naval movement, fortresses and bases, fog of war, the Huns, political crises, tribal homelands, militia, field armies, supply trains, pursuit combat, amphibious operations, pillage, civic works, and more.&#10;&#10;",
        "artist": "Larry Hoffman,Joe Youst"
    },
    {
        "name": "The Phantom League",
        "description": "In Phantom League, you are the captain of a merchant spaceship. You begin as a nobody with a hunger for recognition and glory that will soon lead you onto a path of fame or notoriety! Build your career through trading, piracy, exploring new systems and eliminating your rivals in the other Leagues &ndash; phantom alliances&#10;powerful enough to challenge law and political order across the known universe. This game features:&#10;&bull; A modular board &ndash; every game is different&#10;&bull; Card-driven game play &ndash; you, not the dice, are in control of the game&#10;&bull; A wide range of actions and strategies &ndash; there is no single best way to win&#10;&bull; Cooperative and competitive interaction &ndash; choose when to ally with or conspire against other players&#10;&#10;Phantom League is designed for 2-6 players of 12 years and up, and will take approximately 2 hours to play. Phantom League is inspired by David Braben&rsquo;s video game Elite.&#10;&#10;",
        "artist": "Karim Chakroun"
    },
    {
        "name": "Mai-Star",
        "description": "A card game about Japanese geisha by Seiji Kanai.&#10;&#10;Players take the roles of various geisha, and compete with the other players to win the legendary title of &quot;Mai-Star&quot;. Use the characters surrounding you to increase your popularity, and earn money by attracting guests, the more demanding the better.  Focusing only on increasing your popularity won't earn you any money, yet failing to spread your name won't make the rich or helpful guests come your way. &#10;It's a matter of deciding which characters (cards) will help you increase your popularity and which character cards you want to attract as guests. &#10;Once a player runs out of cards, the round is over, and all cards remaining in your hand become minus points, thus depleting your hand of cards quickly is important. Only the one who has attracted the richest guests (earned the most money) after three festival nights (rounds) will be the one who deserves to carry the title of &quot;Mai-Star&quot;.&#10;&#10;This game's setting is same as Master Merchant.&#10;&#10;",
        "artist": "Calderon Studio,Conceptopolis,Jason Engle,Anthony Francisco,Aurélien Hubert,Greg Lambrakis,April Lee,Jorge Matar,Jake Murray,Adam Schumpert,Chris Seaman,Doug Shuler,Florian Stitz,Noboru Sugiura,Gemma Tegelaers"
    },
    {
        "name": "Pocket Pro Golf",
        "description": "Tee up for the opening drive!&#10;&#10;Pocket Pro Golf&trade; brings you the best aspects of real golf--club selection, careful aim, and shot consideration--in a pocket sized game that will fit in any golf bag.&#10;&#10;One to four players can play anywhere from a single hole to a full round of 18 holes.&#10;&#10;Unlike many other golf games, Pocket Pro Golf&trade; shows you the &quot;narrative&quot; of each shot as it works its way down the fairway. Watch as your ball comes perilously close to each hazard. Did you plan the shot well enough to keep your ball on course?&#10;&#10;Each hole is created using a series of modular game cards. Hazards and features can be set up at random or arranged to resemble any hole from any golf course in the world.&#10;&#10;Once the hole is assembled, players must choose the right club, aim carefully (taking wind into account) and hit the ball with the right swing tempo. Too fast and you'll lose control of the ball. Too slow and your ball won't go far enough.&#10;&#10;The core of the game uses a clever movement mechanic that combines loss of control with distance. You use a number of dice to represent swing tempo (one two or three for slow, moderate and fast). Doubles and triples represent the effects of wind and slope, causing your ball to make semi-random deviations from a straight shot. Roll more dice and you're more likely to lose control and have your ball drift off course!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Thing",
        "description": "It fell from the sky and lay buried in ice for 100,000 years. Soon it will be free.....&#10;&#10;Twelve men:&#10;Trapped in the Antarctic&#10;&#10;Eleven:&#10;Discover the intruder&#10;&#10;Ten:&#10;Battle the alien force&#10;&#10;Nine:&#10;Agonise for the answer&#10;&#10;Eight:&#10;Desperate to be saved&#10;&#10;Seven:&#10;Consumed one by one&#10;&#10;Six... Five... Four... Three...&#10;&#10;The Thing is an unauthorised non-collectable, non-profit game for two to six players, based on the 1982 horror movie masterpiece &quot;John Carpenter's The Thing&quot;, and simulates the paranoid members of an American Antarctic research facility (Outpost 31) being overrun by - or conquering - a parasitic alien organism capable of perfectly imitating its victims. One player begins as the Thing - all the other players start as human.&#10;&#10;The game is primarily played out using six asymmetrical card decks - three decks for each side (each deck corresponds to a different section of the narrative). Managing your hand of cards, and when to use each deck, is key to winning the game.&#10;&#10;The twelve members of the Outpost 31 team cards are positioned between the players, with each human player taking one character. The team then have to overcome various encounters, while trying to stay alive, in an effort to stop the Thing. Encounters are directly taken from film events, and are sorted into three separate acts - the second and third acts are shuffled, and then all three acts are placed together, forming one narrative (in this way, each game is a little different). Some example encounters: Autopsy of Norwegian-Thing, Battle in Dogtown, Explore Norwegian Base, Conduct Blood Test, and Investigate Crashed Saucer Site. In addition, the Outpost team must allocate men to tasks that may aid in their victory over the Thing. The truth being that the humans will not be able to achieve all that they want to do and will have to prioritise. All the while, the Thing player will do all in its power to thwart the human players, while attempting to construct its Blair-saucer in a secret ice cavern by cannibalising parts from the bulldozer, radio room, and helicopter.&#10;&#10;During the game, at various stages, the Thing player has the opportunity to place infection or dummy infection cards under the human character cards. Later in the game, the Thing may even directly infect other players (unbeknownst to the remaining players), or give the impression to the others that it has! The humans must keep their wits about them if they are to fight and win against the Thing, or they may find themselves fighting each other....&#10;&#10;Victory Conditions:&#10;&#10;1. The Outpost #31 team win if they survive the final confrontation, having destroyed the camp and sabotaged the Thing's Blair-saucer - and have killed all the Things.&#10;&#10;     If they are mistaken and some Things remain: the Things win.&#10;     If they killed a non-infected player: the Thing wins.&#10;&#10;&#10;&#10;&#10;2. The Thing wins if it completes construction of its Blair-saucer.&#10;3. The Thing wins if all the humans have been assimilated or killed.&#10;4. The Outpost #31 team win if the survivors manage to fly to the coast in the helicopter.&#10;5. The Outpost #31 team win if they contact McMurdo base by radio.&#10;&#10;Please note: This game is strictly for adults - with profanity and horrific imagery on many of the cards.&#10;&#10;You can find the game here: The THING Card Game now Available!&#10;You can explore the rules here: THING Rulebook&#10;And you can discover the deck guide here: Visual THING Deck Guide&#10;&#10;Expanded by:&#10;&#10;&#10;     The Things&#10;     The Thing: Man is the Warmest Place to Hide&#10;&#10;&#10;",
        "artist": "Viktor Csete"
    },
    {
        "name": "Spartacus Imperator",
        "description": "Smash your chains and fight for your liberty ! Taking the places of Spartacus (-73 to -71), Tryphon (-104 to -101) or Eunus (-139 to -132), during the three Servile Wars which shook the Roman Empire, defy the Roman Consuls (Crassus, Pompey and others) by liberating slaves, ravaging the countryside and pillaging cities in the heart of Italy. Recruit your armies amongst the enslaved warrior tribes of the Gauls, the Dacians, the Germans, the Syrians and the Thracians. Increase your forces tenfold as swiftly as possible before Rome sends its best legions to re-establish the Pax Romana.&#10;&#10;Only your genius and your knowledge of war can save you and allow you to found a kingdom of former slaves. But be careful, for Roman strategists are watchful, and are taking the new menace more and more seriously. You must conquer or perish... on the cross !&#10;&#10;Imperator: for the Romans the word signified a victorious general, and was an honorific title. The nearest term today is marshal, rather than emperor. Declaring Spartacus to be Imperator was an out and out provocation to Roman military nobility which sought honour above all !&#10;&#10;THE GAME PLAY&#10;&#10;&#10;     Actions in the game&#10;&#10;&#10;Each season, each chief can do 1 to 4 actions (1 in Winter, 3 in Summer and Autumn, 4 in Spring ...)&#10;A player takes an action with a chief, and then the other player takes an action too.&#10;- Move&#10;- Recruit (only for the Slaves, random units)&#10;- Ravage  (only for the Slaves)&#10;- Play a Stratagem (special real historical action)&#10;- Reinforcement &#10;- Historical new troops (only for the Roman player)&#10;&#10;&#10;     Bounty&#10;&#10;&#10;- it can boost recruitment and reinforcement&#10;- you gain it with battle victory and ravage&#10;&#10;&#10;    Battle&#10;&#10;&#10;- 4 tactical choices (units in first line can make critical hit but are the first to die)&#10;- the best general has rerolls&#10;- fire phase&#10;- 2 melee phases&#10;&#10;&#10;    Siege Battle&#10;&#10;&#10;- 2 tactical choices&#10;- the best general have rerolls&#10;- city gives reroll&#10;- 1 or 2 fires phases&#10;- 0 to 2 melee phases&#10;&#10;&#10;    Specials&#10;&#10;&#10;- Pirate Fleet attempt to escape&#10;- slave counters are hidden (not the number but the unity)&#10;- two armies of the same player can't be in the same area (jealousy, Roman glory, not enough food for slaves)&#10;- dead units can't be recruited or the player must wait one year&#10;- The victory conditions can change each year&#10;&#10;",
        "artist": "Lionel Liron,François Vander Meulen"
    },
    {
        "name": "Slither",
        "description": "Slither is a dynamic square board connection game in which players move and place stones.&#10;&#10;White's objective is to connect the right and left hand sides of the board while black aims to connect the top and bottom edges.&#10;&#10;On a turn, a player must place a stone anywhere where it isn't diagonally adjacent to any other stones of his color unless they are connected to each other orthogonally by a common stone. A player may also choose to move one of his stones already on the board to a diagonally or orthogonally adjacent space and before placing a new stone. After the turn is complete no one player's stones should be diagonally adjacent and not connected orthogonally through a common stone. If a player has no legal move on his turn, he must pass. Passing is otherwise not permitted. There will never be a position where neither player has a move.&#10;&#10;No draws are possible in Slither.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Sorry! Spin",
        "description": "The twists and turns never end in this fun game! Just like in the classic SORRY game, your goal is to get your pawns back to their same-colored home. But watch out: in the SORRY SPIN game, if you draw a Spin Card, the playing board turns and you could end up getting closer to your goal or whizzing right past it! In a SORRY SPIN showdown, revenge is sweet unless the board spins and the revenge is on you!&#10;&#10;&#10;    From HASBRO website.&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Pictionary Card Game",
        "description": "Pictionary Card Game captures the essence of Pictionary, but without the drawing! The object of the game is to guess the correct answer when the presenter acts out a word using a combination of picture clue cards. The first person or team to guess the correct answer in head-to-head play wins a point, and the first to get to five points wins the game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Revolver",
        "description": "Howdy, ya'll.&#10;C'mon in and sit a spell. Let me tell ya about Jack Colty and his gang, and get ya up to gallop on all the interestin' events. Those filthy drovers and gunslingers are dangerous and desperate, each one generally havin' killed a man, and be content to live on a diet of Navy plug and whiskey.&#10;I ain't never seen no queen in her damned undies, so the feller says. But I'll tell you what - after hearin' this here stupefyin' story I'm about to unfold, well, I guess you folks can make up yer own minds why I retired early.&#10;&#10;The year is 1892.&#10;The bank at Repentance Springs has been robbed.&#10;Many good citizens, including Sheriff Anton Dreyfus and school-marm Sue Daggett, were brutally slain as Colty's gang shot its way, whooping and hollering, out of town.&#10;Colonel Ned McReady and his men are tasked with bringing Jack Colty - a man so mean he'd steal a fly from a blind spider, or a coin off a dead man's eyes - and his gang to justice.&#10;&#10;Revolver is a non-collectable card game set in the Old West.&#10;&#10;Consisting of two balanced 62 card decks, the game pits two players against each other in a life or death struggle. One player takes the role of Colonel Ned McReady and his lawmen, and his opponent assumes control of the notorious and deadly Colty gang.&#10;&#10;At their disposal, the Colty gang - the meanest bunch of low down dirty dogs in the West - have a roster of weaponry to bring down the lawmen on their tail: .38 Specials, .45 Long Colts, 1866 double barrel Derringers, and even a Gatling gun! Some example cards from the gang's deck: Cherokee Scout, &quot;Adios, Amigoes!&quot;, &quot;Thanks for yer coffee and eggs, ma'am&quot;, and &quot;Chew on this, Gringo!&quot;&#10;&#10;The Colonel player's objective is to eliminate all the gang members before they can escape across the Mexican border. He can utilise such cards as Buffalo Stampede, Rattlesnake Bite, &quot;I can smell those yellow bellies on the wind&quot;, &quot;He shot my hat clean off!&quot; Apache Scout, and Rickety Bridge.&#10;&#10;The game has an asymmetrical design, with both decks featuring different cards and abilities. Revolver is played using a 5-column system, representing consecutive gunfights in the following battlegrounds: The Bank at Repentance Springs, Whiskey Canyon, Buzzard Point, Rattlesnake Creek, and the 3:15 Express from Rattlesnake Station. Gameplay is quick and bloodthirsty with bandits gunned down frequently, and law-men peppered with lead by the well-placed use of &quot;Fire at will, boys.&quot;&#10;&#10;Numerous tricky decisions must be made throughout. For instance, the Colty player could choose to deploy the Jackson Clan during the Whiskey Canyon battle, but the resources that this would require might make it a very risky, but rewarding, play. Similarly, the Colonel McReady player can deploy the Colonel at any time during the conflict - he's free to play aboard the 3:15 Express Train, but hugely expensive if used at Buzzard Point, for instance. Also, during the final confrontation, Jack Colty can force the train to crash - as a last ditch effort, probably killing some of his own crew in the process - he's as crazy as popcorn on a hot stove!&#10;&#10;Primarily a combat-driven card game, each player must manage his deck of cards effectively to win. In addition to simple, unique abilities, each card also has two values: power and cost. Some simple icons are used to display such things as 'coming-into-play' effects, and if a gringo has 'True Grit'.&#10;&#10;Revolver can trace its parentage back to San Juan, Magic: The Gathering, Battle Line, and is a new implementation of Aliens: This Time It's War.&#10;&#10;Victory Conditions:&#10;&#10;The Colty Gang player wins if he manages to &quot;Escape across the Mexican border.&quot;&#10;The Colty Gang player wins if he reaches and survives the battle on the 3:15 Express train.&#10;The Colonel McReady player wins if Jack Colty and all the gang members are either hanged or killed.&#10;The Colonel McReady player wins if Cortez is killed before boarding the 3:15 Express train.&#10;&#10;Each bandit character card has a Survival Rating, indicating the likelihood of them surviving to the end of the game. For example, Lenny and Micky Mason have a low chance of survival, whereas Cortez has a high Survival Rating. Also, certain character's deaths have hugely detrimental effects on the game, such as having to discard a card, or in &quot;Kittens&quot; Mackenzie's case: the gang having to fight an extra two turns on the Rattlesnake Creek battlefield.&#10;&#10;",
        "artist": "Xavier Carrascosa,Chechu Nieto"
    },
    {
        "name": "RRR",
        "description": "RRR (Regality vs. Religion: Revolution) is an advanced version of the basic game RR designed by Seiji Kanai&#10;&#10;RR is a two-player full-information abstract game. Both players have the same set of pawns. The players take turns placing pawns on a 3x3 square playing field. Each pawn placed will either turn or destroy one or more of the pawns surrounding it. A game is finished when all nine squares are filled with pawns. At that time, the winner is the holder of most pawns which are facing in one's own direction.&#10;&#10;RRR introduces new pawns to the game. At the start of the game, five neutral pawns are randomly selected from a stack of 11, which are available to both players, adding variation to each game.&#10;&#10;Reimplements:&#10;&#10;    RR&#10;&#10;&#10;&#10;&#10;",
        "artist": "Keita Komiyama,Noboru Sugiura"
    },
    {
        "name": "Blockade Runner",
        "description": "Blockade Runner is a resource trading game in the Euro style, but with a dash of danger. In Blockade Runner, players take on the roles of entrepreneurs attempting to make the most money  by shipping cargo in and out of the South during the American Civil War. Positioning is achieved by competing with each other for access to commodities, top market prices, and newly built ships.  Hard decisions include whether to play safely to keep ships afloat or take potentially profitable risks.  The crux of the play is hinged upon whether to bring in vital war goods, which reduce the intensity of the growing blockade, or more profitable black market goods. This enables a potential for cooperation, but competition is the heart of the game. &#10;publisher blurb.&#10;&#10;",
        "artist": "Patrick Stevens,Orlando Villagran"
    },
    {
        "name": "Eaten by Zombies!",
        "description": "Description &#10;In the new game Eaten By Zombies! players strive to survive as the horde of the living dead make it their goal in Death to force you to join the crowd. You must work with or against the other survivors to be the last one standing.  No not standing, cowering in the corner crying for their mommy.&#10;&#10;In the spirit of AMC's &quot;The Walking Dead&quot; and &quot;I Am Legend&quot;, Eaten By Zombies takes you into a dark world of eventual death. Every turn you must venture out from your safehouse and scavenge for Swag. But not so fast, the Undead have other plans for your brains. Every day a Horde of fresh zombies will be waiting for you, and over time the threat gets greater. Now it's time for your &quot;Fight or Flight&quot; instincts to help you to survive just one more day. Using the swag you've got on you (ie cards in you hand) you must survive any way you can.&#10;&#10;If you can get away or kill the Horde, you may scavenge the remains of the desolate suburbs for any Swag the neighbors may have left behind.   With the right stuff and a few good friends to out run, you may just make it through this alive... well, no probably not.  But being the last one to die a slow, painful death means you can claim sole victory!&#10;&#10;With a set of over thirty different cards to start with, no two games will ever be alike. This game is a combination of Card Drafting, Hand Management and Survival Horror with a few dirty tricks thrown in.&#10;&#10;Game Play/Mechanics &#10;You start with five heavy sticks (each worth +1 fight) and five hide cards (each +1 flee) as well as two sandwiches (+1 Flee &amp; Draw one card).  You shuffle these 12 cards and draw 6 into your hand.  You then face one of the 25 zombies from the Zombie Deck with a fight value ranging from 1-8 and a flee value of 1-4.  You must announce Fight or Flee and then proceed to play some/all of your 6 cards in your hand.&#10;&#10;If you successfully fight/flee you then take the total fight/flee value to the scavenging portion of your turn (think of it as a &quot;buy&quot;) where you acquire items such as Shotguns, fists full of ammo, crowbar, binoculars, fire on a stick, grandma pantry, deadeye or other cards which you then put INTO YOUR HAND for use in the very next turn and draw back up to 6 cards from your draw deck.  Played cards go to your discard pile, including any zombies you have succeeded in killing.&#10;&#10;If you flee then the zombie card goes to the zombie discard pile.  As you draw zombies into your hand (from shuffling your discard pile) you are stuck with them in your hand forever unless you play them into the zombie horde attacking on another player's turn, so the zombie horde gets tougher over time.&#10;&#10;If you are unsuccessful in killing/fleeing then you must lose a number of cards equal to the flee value of the horde.  These lost cards come from either your hand or as a blind draw off the top of your draw pile and go back to the scavenging area, weakening you.  If you run out of cards you succumb to your wounds and become a zombie, now trying to kill the other players on each turn.&#10;&#10;If a player ever ends up with six zombie cards in his/her hand the zombie players win as the remaining players have gone insane.  Each time the zombie deck is gone through and reshuffled you add one more zombie to the horde for the rest of the game, making perpetual survival impossible.&#10;&#10;It isn't a matter of if you're going to die but when.  Be the last player standing and win.  If at any time the entire zombie deck is depleted (because the players have killed all of them rather than using flee), all remaining players alive win together.&#10;&#10;This is a unique cooperative/competitive game where you really feel the tension and inevitability of doom.  You spend the first few turns building up your deck only to see the zombies increase in power and slowly drain your will to live as the game progresses.&#10;&#10;Integrates with:&#10;&#10;    Eaten By Zombies!: In Cahoots&#10;&#10;&#10;&#10;&#10;",
        "artist": "Max Holliday,John Huerta"
    },
    {
        "name": "Unusual Suspects",
        "description": "FRAME THE FELON, CLOSE THE CASE!&#10;&#10;When everyone's a suspect AND a detective, things can get a little strange!  Earn your detective stripes by being the first to match the fingerprint dice left at the scene of the crime with the &quot;criminal file&quot; cards in your hand.  Use the Dice Slide to &quot;tamper with the evidence&quot; and protect you secret identity!&#10;&#10;The ultimate game of &quot;who dunit&quot;. Players receive one &quot;Fingerprint&quot; card which establishes their secret identity and six playing cards. The crime scene is established by rolling the six fingerprint dice down the dice slide. Players try to &quot;solve the case&quot; by matching their 6 cards to the 6 fingerprint dice. First player to solve the crime is the winner.  Includes dice slide, cards, finger print dice and instructions.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Poseidon",
        "description": "Two to five players act as leaders of different peoples and command them to explore, send out fleets, build trading posts, and generate the highest possible profit. Poseidon contains most of the basics of 18xx games and due to the relatively short running time of two hours is as suitable for 18xx-newbies who want to explore this wonderful world as it is for experienced train gamers.&#10;&#10;The 18xx basics included are:&#10;1) Instead of running a corporation, players control a country/people&#10;2) The goal of the game is personal wealth, the wealthiest player at game end is the winner&#10;3) Players create trade routes similar to railway lines in 18xx games&#10;4) Trains are replaced with common modes of transportation at the time (i.e. ships) with varying types&#10;5) 18xx type stations are replaced with trading posts&#10;&#10;Game Contents: game board, eight &quot;possession sheets&quot;, play money, lots of wood pieces, cards, 1 rule book&#10;&#10;",
        "artist": "Klemens Franz"
    },
    {
        "name": "Bismarck (second edition)",
        "description": "Avalon Hill's (AH) Bismarck 1979/80 edition, designed by Jack Greene, is a totally different game from the AH 1962 edition designed by Lindsley Schutz and Charles Roberts.&#10;&#10;The game centered around the hunt for the KMS Bismarck and the KMS Prinz Eugen in mid-1941. The game has some similarities to game Battleship, with both players having a hidden map-board and calling out coordinates to locate their opponent.&#10;&#10;There are two players, German and British. The British player has the arduous task of placing the large number of Royal Navy vessels and search aircraft on his map-board before game play begins. Each map-board is on a grid, with letters on one axis, and numbers on the other. Each Royal Navy unit has a historically accurate starting point. The German setup takes but a moment, since the Germans have only a few bomber units and the task force with Bismarck and Prinz Eugen to place on their map.&#10;&#10;Each turn, the players move their respective units (cardboard counters), searching for enemy units, and possibly engaging in combat. In the vast spaces of the Bering Sea and North Atlantic, the search phase becomes vital. Each player calls out grid coordinates containing a ship or aircraft, and the opponent indicates whether a ship is located there, and if so what type. A player may choose not to search with a particular unit, thus keeping its location secret (common tactic for German player, obviously). Since the Bismarck is the only enemy Battleship on the map, British discovery of her is key to victory. As the British are unlikely to have a force sufficient to sink the Bismarck when they initially find her, they will need to &quot;shadow&quot; the mighty vessel. A fast unit, such as the Heavy Cruiser Suffolk, is able to keep up with Bismarck and follow her on radar without engaging in combat.&#10;&#10;Eventually, British heavy units, such as the Battlecruiser Hood may be vectored into the same square as the German Task Force. At this point combat ensues. The British also have air units on the Aircraft Carriers Victorious and Ark Royal which can both search for the Germans and attack with torpedoes from a distance. The game has combat damage sheets with squares representing areas of each warship that can be damaged in combat. As combat is resolved, squares are checked off.&#10;&#10;The Germans win by avoiding contact with the British, successfully &quot;breaking out&quot; into the Atlantic and ravaging merchant shipping there. They can also achieve victory by destroying any opposition they encounter and making their way to a friendly port in occupied France. Historically, either scenario would have grave consequences for the Battle of the Atlantic. The British have a tougher task, needing to intercept and destroy the Germans. Since most British vessels are no match for Bismarck, it is necessary to vector several vessels currently on convoy escort duties in the area to form a powerful task force. Poor planning by the British or clever moves by the Germans allow Bismarck to slip through.&#10;&#10;The advanced rules of the game implement a weather system, combat using a miniatures-type system (with ship counters laid out on the floor), realistic damage to ships, etc. Alternate &quot;what if&quot; scenarios and ships are provided, such as the German Aircraft Carrier Graf Zeppelin, breakout with the Tirpitz and others. U-boats are also represented (albeit in an abstract way) in the Advanced game.&#10;&#10;Second edition changes included:&#10;&#10;     the square grid on the original map was replaced with a  hexagonal brick grid overlay;  &#10;     the single Bismarck ship unit was replaced by multiple German ships; &#10;     the relatively simple search, movement and combat systems of the original were replaced by much more complex rules. (Indeed, many considered the rules changes ponderous and detrimental to gameplay.)&#10;     packaging was modified, second edition coming in a smaller, standard-sized AH flat box (compared to the over-sized box of the first edition) and having alternative cover artwork.&#10;&#10;&#10;&#10;&#10;",
        "artist": "Jean Baer,Claus Bergen,Bob Haynes,Mick (Mike) Uhl"
    },
    {
        "name": "Those Pesky Humans!",
        "description": "Those Pesky Humans game turns the tables and lets you play the role of the Monsters who are fighting off the annoying Humans who keep invading your dungeon. This game is playable against one or a team of your &quot;friends&quot;. It is highly re-playable due to the variable dungeon tile design and the variety of Avatars and abilities you may choose to play with each game. Mechanics are kept very simple to keep the pace of the game moving quickly.&#10;&#10;",
        "artist": "Chuck Whelon"
    },
    {
        "name": "Legitimacy",
        "description": "The kingdom of Legitimant is in turmoil. The old king has died, leaving no legitimate heir... He has, however, left several illegitimate ones.&#10;&#10;Since you were an infant, your mother has told you of the royal blood that runs in your veins. Now the time has come for you and your trusty animal sidekick to set out on an epic quest to fulfil your destiny and claim the throne that is your birthright.&#10;&#10;Whether you choose to follow a path of righteousness or use every dirty trick in the book, you&rsquo;ll need nerve, cunning and just a little luck as you assemble an assortment of strange creatures and magical objects to out-manouver and overpower your rivals and prove that you are, indeed, the one true heir of Legitimacy!&#10;&#10;",
        "artist": "Chuck Whelon"
    },
    {
        "name": "Five Fingered Severance",
        "description": "Today is your last day on the job. Corporate decided to close the store and everybody is getting the boot. You could spend the rest of the day helping those miserable, wretched wastes of human skin who come in and demand service, or you could do what you always wanted - tell them were to go and have a good time. And you know which one it&rsquo;s going to be...&#10;&#10;From the instructions.&#10;&#10;In Severance each player assumes the role of one the characters at the store. They can steal items from the store, slack off, or keep performing their work duties. Each activity has risks and rewards. The player scores points after successfully slacking off and after taking their stolen goods to their locker. When a player gets caught (by the boss) doing something wrong they gain heat. Heat also naturally rises during the game. When a player reaches 30 they are fired. The game ends when all of the players but one are fired or the event deck is exhausted.&#10;&#10;Five Fingered Severance is a take that game. To gain points the players will have to open themselves up to the other player's attacks. I want the game to be more tactical though, so the plot cards in the deck are limited to just a few types of cards. This allows players to know about what they are getting when they take a turn to refresh their hand.&#10;&#10;",
        "artist": "Erik Lervold,Topher McCulloch"
    },
    {
        "name": "Tricked-Out Hero",
        "description": "Defending the realm takes bravery, strength, and to be totally tricked out. Collect as many magic, melee, and health tricks as you can while avoiding the monster tricks.&#10;&#10;In Tricked-Out Hero, players select a character class, then play hands of cards to improve their health, magic, or melee strength based on what tricks are taken before facing monsters in battle. But beware, if you take tricks with spades, they add to the strength of the monster that you face off against at the end of the round. Players play through three levels with several monsters, and the player with the most victory points from defeated monsters and collected wins.&#10;&#10;",
        "artist": "Ryan Johnson"
    },
    {
        "name": "Expedition: Congo River 1884",
        "description": "In 1884, the major European imperialist powers &ndash; Great Britain, France, Germany and Belgium &ndash; were busy struggling to get a piece of the cake that was colonial Africa. At first they sent missions dedicated to exploration, but this quickly changed to vying for favorable concessions, treaties, and even settlements. This race for supremacy and the desire to be the first to establish a foothold in Africa provoked an endless series of confrontations and conflicts.&#10;&#10;In Expedition: Congo River 1884 &ndash; the first title in Rivero's &quot;Expedition&quot;-series, which will take place all around the world &ndash; a paddle-wheeler steamboat is about to leave Leopoldville (now Kinshasa) and sail up the Congo River bound for the remote village of Kindu in the heart of deepest Africa. While the travelers aboard the steamer are of many different nationalities and professions, they all share the same spirit of adventure. Each player controls a group of these travelers and must compete with their opponents to take command of the colonial stations found at each stop along the steamer's trip upstream. Players gain victory points for each station under their command. The player with most points at the end of the game wins.&#10;&#10;",
        "artist": "Alexandre Roche"
    },
    {
        "name": "Diary of a Wimpy Kid: Cheese Touch",
        "description": "Move your mover &ndash; either Greg, Rowley, Fregley or Manny &ndash; around the game board. Depending on where you end up, you&rsquo;ll be playing different categories. In Who Said What all players will secretly write down an answer to a question like if you could only eat one food for the rest of your life, what would it be? Go through the answers and try to guess who said what. Correct answers move you closer to finish. But wrong answers can give you the cheese. Try to get rid of it as fast as you can.&#10;&#10;For 3 or 4 players, ages 7 and up.&#10;&#10;Contents: Game board,4 movers, game cards, card box, cheese piece, game die, rules&#10;&#10;-From the Publisher's website&#10;&#10;",
        "artist": "Jeff Kinney"
    },
    {
        "name": "String Railway",
        "description": "String Railway is a unique train game that consists of colored strings, tokens, station tiles, and a board for scoring. To set up, first place the string tied in a big circle on the table to establish the field area for the game. Next, place a small circle of string to represent mountains and a line of string to represent a river. Finally, place the main stations for each player equal distances apart from one another.&#10;&#10;On a turn, you draw and place a station tile, then try to place a railroad string between your stations in an effort to connect them in order to form your own train network. Connected stations earn victory points (VPs).&#10;&#10;After five turns, the game ends and the player with the most VPs wins.&#10;&#10;",
        "artist": "Franck Dion,Ryo Nyamo,Jaouen Salaun"
    },
    {
        "name": "The Kingdoms of Crusaders",
        "description": "In The Kingdoms of Crusaders, players assemble units to create armies and overwhelm opponents competing for the same territories. The game includes components for a two-player game; by combining two sets, up to four players can compete.&#10;&#10;Units are represented by cards, with each card depicting the forces in it with color-coded symbols across its top. The forces come in five strengths, which from weakest to strongest are Lance, Bow, Sword, Helmet and Banner. For example, a unit (card) with Sword and Helmet will have across the top: blank, blank, green, yellow, blank. Each player starts with a hand of five cards and a location card on the table depicting five territories, which is where a player lays his cards.&#10;&#10;On a turn, a player draws a card from the deck, then lays one card from his hand into one of the territories next to his location card. Each territory can have no more than four cards in it. Once you've played four cards into a territory, you've determined the final strength of the army there. If the same symbol is on all four cards, you've created a Regiment; the same symbol on only three cards creates a Battalion, and the same symbol on only two cards creates a Company. (You can create multiple Regiments, Battalions and Companies in the same territory.)&#10;&#10;To determine who wins the battle in a territory, compare each player's army in this territory. The player whose army has the most Regiments wins; if players are tied for the number of Regiments, then the player with the strongest Regiments wins; if players have equally strong Regiments, then the player with the most Battalions wins; and so on. Even if his opponent(s) have not completed their armies, a player can win a territory by proving that it's impossible for someone to create a stronger army in the same territory.&#10;&#10;When a player wins a territory, he places a lowest available victory marker on this army. Once all five victory markers have been claimed, the game ends. The player who collects the most markers wins; if players are tied for the number of victory markers, then the player whose markers have the lowest sum wins.&#10;&#10;",
        "artist": "Gustave Doré"
    },
    {
        "name": "Launch Pad",
        "description": "The space race is on!&#10;&#10;You are battling to build the biggest, baddest rockets possible and send them soaring into space. Each rocket requires metal, fuel, and the expertise needed for liftoff. As you build your rockets, beware of your opponents, who are eager to steal your goods and sabotage your work--you may even have some tricks of your own to thwart their progress.&#10;&#10;All the while, the launch pad is being constructed--as soon as it&rsquo;s ready, the rockets that are &quot;go&quot; for launch will blast off into space, leaving all others behind!&#10;&#10;Do you have what it takes to make your rockets soar before it&rsquo;s too late?&#10;&#10;",
        "artist": "Andy Kurzen"
    },
    {
        "name": "Freeze",
        "description": "In every round of Freeze (aka B&uuml;hne frei!), four players enter the stage together and improvise a scene in a situation only they know. Each of them knows their personal rank among the actors (1-4), but no actor knows the rank of another. The actors must act out their rank within the scene so obviously that the spectators can guess it.&#10;&#10;But do not fear: There is no need to have studied acting in order to win at Freeze. Just react to what the others are doing in the 45-second-long scene &ndash; or laugh yourselves away, no matter whether you are spectator or actor...&#10;&#10;",
        "artist": "Fréderic Bertrand,Nora Nowatzyk,Sebastian Wagner"
    },
    {
        "name": "Last Call: The Bartender Game",
        "description": "The customers are restless, the drink orders are piling up, and the bartenders won&rsquo;t mix drinks until they have the right bottles in hand! Pass the bottles from one bartender to another until someone can fill an order. But beware, if the bartender has too many bottles, they&rsquo;ll water down your cocktail with ice cubes. Get the bartenders to fill your drink orders and collect the fewest ice cubes along the way. Find out who runs the best bar when it&rsquo;s time for &ldquo;Last Call&rdquo;!&#10;&#10;A fast-paced game for 2 to 5 players. Although themed to mixing alcoholic drinks, it is simple enough for an eight-year-old to play. Continual involvement for all players, and language-independent components. Rulebook includes English, French, and German rules. A good pick-up or end-of-session game.&#10;&#10;- publisher&#10;&#10;",
        "artist": "Quinton Hoover"
    },
    {
        "name": "Khan",
        "description": "1244 - The Mongol Empire rules from Eastern Europe clear across Asia to the Pacific Ocean. It was (and still is) the largest contiguous empire in the history of the world. The Great Khan rules from the capital Karakorum over the empire and he sends out his best generals to conquer more areas for the ruler of all Mongols. Mongol strategy gives individual generals a high degree of independence in deciding how to invade and conquer new territories, so long as they keep to the overall objectives. The Mongol armies are highly mobile and enemies are terrorized by their ability to appear everywhere at once. To prevent enemy rulers from being able to regain control of their armies, the Mongols drive the rulers out and pursue them relentlessly wherever they flee.&#10;&#10;In KHAN it's your task to chase out the 8 different rulers of the lands that you are invading and to conquer as many valuable areas as you can. The general that fulfills this task the best will be proclaimed the next Great Khan.&#10;&#10;Each player invades areas by placing his yurts on the board. A player can then conquer two or more adjacent areas by laying one of the variously shaped conquer tiles over the yurts (not all the yurts need to be the player's own). Conquer tiles will bring the player victory points - the larger the conquer tile, the greater the number of victory points. At the end of the game the players with the largest connected conquered territories will gain additional victory points. The player who then has the most points is the winner.&#10;&#10;",
        "artist": "David Cochard"
    },
    {
        "name": "Orient Bazaar",
        "description": "Take a magic carpet ride to find Far East fortunes in the LEGO Games Orient Bazaar. Discover exotic treasures in the colorful nooks of the bustling market! Spend your gold wisely and battle for fortune by collecting priceless matching items to sell!&#10;&#10;The aim of the game is to collect as many items of one colour to sell them at the highest price. The more items of the same colour you have the higher price you will get. The golden goblet in the bazaar are jokers that can be used in any collection.&#10;&#10;Use the bazaar to close other shops, swap an item with the other player or sell a collection of items.&#10;&#10;You start out having three gold coins and the first player with 15 gold coins wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "For Crown & Kingdom",
        "description": "The king lies weakened on his deathbed. His Majesty has but days to live, and has failed to produce an heir. Any of the local dukes or duchesses could be next in line, as long as they are able to gain the approval of the people. Each has set off on a heroic campaign. They vie for fame, for glory, for crown and kingdom!&#10;&#10;In For Crown &amp; Kingdom, players must use their teams of specialized emissaries to travel the kingdom, raise funds, obstruct opponents, and gain the support of the people. The first duke or duchess to gain support in every region will become the new monarch!&#10;&#10;",
        "artist": "Kelly McClellan"
    },
    {
        "name": "Cat & Chocolate",
        "description": "Cat &amp; Chocolate is a card game set in a haunted mansion. Each turn, the active player must use 1-3 items in hand to avoid threats, such as a crumbling floor, erupting flames, or attacks by ghosts and the living dead. How can you use a cat and a piece of chocolate to defend yourself? How can a bankroll of money and rope help you escape unscathed? You tell me!&#10;&#10;After you tell everyone the story of how you used various tools to ward off the threat, everyone votes on whether or not you succeeded. If a majority backs you, you keep the threat card; otherwise, you don't. Each player secretly belongs to either the Secret Society or the Cult, and you naturally want to vote for the players on your team, but no one knows who is on which team.&#10;&#10;After a certain number of threats, the game ends, players reveal which group they belong to, and each group tallies the number of threats that their members escaped. Whichever side avoided more threats wins!&#10;&#10;",
        "artist": "Yuka Kabayama,Tomoe Kitahara,Munku Mutsuki,Ofuu Yamadori"
    },
    {
        "name": "Loch Ness",
        "description": "Loch Ness is a game for children ages 4 and up, with expandable rules to make the game more and more exciting as they grow and learn.&#10;&#10;All the world knows the monster legend, but anyone can take a good photo of it. The players have 2-3 tourist pawns to place on the spots on the shores of the lake, then try to drive the monster near to them rolling a 12 sided dice with different effects on his moves.&#10;The more skilled and lucky tourists will be able to pick one or more photo tiles from the sack, keeping only the last one. At the end of tiles, the best photographer will be the winner.&#10;&#10;The basic game is very simple to play; the game have some advanced rules for a more challenging play. The monster is composed by a set of three different painted pieces: head, back and tail.&#10;&#10;Game contents&#10;&#10;     Gameboard&#10;     12 plastic Photographers&#10;     1 Nessie figure&#10;     32 Nessie pictures&#10;     1 bag&#10;     rulebook&#10;&#10;&#10;&#10;&#10;Not to be confused with another 2010 game with the same theme, Loch Ness!&#10;&#10;",
        "artist": "Piotr Socha"
    },
    {
        "name": "Sid Meier's Civilization: The Board Game",
        "description": "Please note: this entry covers the 2010 release of Sid Meier&rsquo;s Civilization: The Board Game from FFG. This game is unrelated to the similarly named 2002 Eagle Games Sid Meier's Civilization: The Boardgame.&#10;&#10;From Press Release:&#10;&#10;Before you lies a vast bounty of land, ripe for the plucking. Your meager beginnings will influence the paths you must take. Lead your people well and they will take you to infinite heights of greatness. If civilization manages to endure the ages, your name will hang in every whisper of its legacy...&#10;&#10;Fantasy Flight Games is excited to announce the upcoming release of Sid Meier&rsquo;s Civilization: The Board Game! Forge an empire to stand the test of time using innovative game mechanics with multiple paths to victory.&#10;&#10;Will you lead the greatest army in the world to conquer your foes? Or will you be the first to journey to the stars, becoming the most technologically advanced civilization known to man? The choice is yours.&#10;&#10;Designed by Kevin Wilson, Civilization: The Board Game is inspired by the legendary video game series created by Sid Meier. Players are tasked with guiding an entire civilization throughout the ages, taking ownership of your people&rsquo;s technology, economy, culture, and military, as well as all the choices that go along with them. There are four different paths to victory, and each is riddled with opposition.&#10;&#10;In Civilization: The Board Game, 2-4 players take on the roles of famous leaders in charge of historical civilizations, each with their own abilities. Players will be able to explore a module game board, build cities and buildings, fight battles, research powerful technology, and attract great people by advancing their culture. No matter what your play style is, there is a civilization for you!&#10;&#10;Fans of Sid Meier&rsquo;s classic video game franchise will find familiar footing in Civilization: The Board Game. Staying true to the foundations of its video game predecessor while creating a new and unique way to play, Civilization: The Board Game captures the spirit and grandeur of carving out a magnificent empire from modest beginnings.&#10;&#10;Players start off with a single city, one army figure, and one scout, and from these meager origins you must forge through the ages and become the greatest civilization in the world.&#10;&#10;Those unfamiliar with the video game series will find Civilization: The Board Game a great way to enter into the world of Civilization. The strategy and tactical decisions involved in Civilization: The Board Game will appeal to strategy gamers and war gamers alike, and the ability to win through culture and technological advancement will give those who only wish to focus on their own empire a chance at victory as well.&#10;&#10;",
        "artist": "Henning Ludvigsen"
    },
    {
        "name": "Globalization",
        "description": "Globalization brings the exciting world of big business into your living room. You are the head of a multinational corporation with one goal in mind: to make money. Outbid your competitors to acquire businesses within six different industries and grow your conglomerate. Streamline operating costs, build additional factories, sue your competitors or take one of your subsidiaries public for big returns. Your corporate strategy will impact which companies you buy and how to take your corporation worldwide. The synergy that comes from the right company combinations increases your perceived net worth. The first to reach a billion in net worth wins!&#226;&#128;&#168;&#226;&#128;&#168;&#226;&#128;&#168;&#226;&#128;&#168;&#10;&#10;In the age of Corporate Imperialism, only the strong survive.&#10;&#10;",
        "artist": "Brent Knudson"
    },
    {
        "name": "Atlantis Treasure",
        "description": "Navigate your submarine through the murky depths to find sunken treasure in the new LEGO Atlantis Treasure. Fire at obstacles and block other explorers in a deep sea quest where only one sly sailor will triumph!&#10;&#10;Be the first player to collect three golden treasures to win the game (four if you are less than four players). Place compassbricks on the board to navigate your sub in the right direction -or place a compass brick to divert one of the other players. -or roll a torpedo and fire at another sub and take one of their treasures...&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Photo Party",
        "description": "Take 12 cards and a camera with a timer (a tripod is usefull to).&#10;Read a card that describe what players must do in front of the lens and then press the button. Being in the air, hold their hands, being cut by the photo borders.&#10;&#10;On each photo we count points, the player with the most point win the games.&#10;&#10;",
        "artist": "Olivier Fagnère"
    },
    {
        "name": "The Lord of the Rings: The Card Game",
        "description": "The Lord of the Rings: The Card Game is a cooperative adventure game in which the players attempt to complete a scenario, each with three heroes of their choice and a deck of allies, events and attachments to support them. Each round, players send their heroes and allies to quest or to fight with enemies that engage them. However, as the heroes and allies exhaust after questing, defending, or attacking, the players' options are typically insufficient to deal with everything at once. Therefore, players need to determine whether it is more urgent to quest and make progress in the scenario while the enemy forces gain power, or to take down enemies while making no progress, not knowing what will come next.&#10;&#10;The Lord of the Rings: The Card Game is the base game of a Living Card Game for which new adventure packs are released monthly. The base game contains three scenarios, twelve famous characters from the works of J.R.R. Tolkien (including Aragorn, Legolas, Gimli, Denethor and Eowyn), and four pre-constructed player decks. Players can either use one of these decks or construct their own deck to increase their chances to be succesful in the more challenging scenarios. The monthly adventure packs contain a new scenario, a new hero, and new player cards to be used in their deck. The base game is for 1-2 players, but with an additional base game the scenarios can be played with up to four players.&#10;&#10;Although this game is set in Tolkien's Middle Earth, the scenarios do not represent scenes from the books, but rather take place in the seventeen years from Bilbo's 111th birthday until Frodo's departure from the Shire.&#10;&#10;The scenarios from saga-expansions do represent scenes from the books. Saga-expansions will form the Campaign Mode so that you can play all the saga quests that deal with the trilogy (+ Hobbit) together in one marathon campaign.&#10;&#10;",
        "artist": "Even Mehl Amundsen,Erfian Asafat,Tiziano Baracchi,Ryan Barger,Sara Biddle,Yoann Boissonnet,Leonardo Borazio,Noah Bradley,Marco Caradonna,Kevin Childress,Anna Christenson,West Clendinning,Nicholas Cloister,Soul Core,Daarken,Katherine  Dinger,Empty Room Studios,Loren Fetterman,Tony Foti,Tom Garden,Kristina Gehrmann,Lucas Graciano,Margaret Hardy,Jeff Himmelman,David Horne,Ijur,Dominik Kasprzycki,Kaya,Igor Kieryluk,Mathias Kollros,Lius Lasahido,David Lecossu,Henning Ludvigsen,Daryl Mandryk,Mike Nash,David A. Nash,Winona Nelson,Andrew Olson,Gabrielle Portal,Rio Sabda,Alexandru Sabo,Amanda Sartor,Marc Scheff,Alexandr Shaldin,John Stanko,Matthew Starbuck,Florian Stitz,Nikolay Stoyanov,Angela Sung,Fredrik Tyskerud,Santiago Villa,Magali Villeneuve,Frank Walls,Jason Ward,Drew Whitmore,John Wigley,Mark Winters,Sandara Tang Sin Yun,Jen Zee,Ben Zweifel"
    },
    {
        "name": "Arkham Express",
        "description": "Arkham Express is a cooperative dice-based game designed by David Willems. Players are working together to gather clues, kill monsters, close gates and eventually defeat the Great Old One (Cthulhu).&#10;&#10;Players will select characters, each with a unique special ability.  During a player's turn they will roll 5 dice with unique symbols on each side, after rolling they have the option of re-rolling 3 more times.  If the &quot;Monster&quot; symbol is rolled on a die it is locked and cannot be re-rolled.  If 3 Monster symbols appear a new gate opens and a monster appears in Arkham.  The other sides of the dice include movement points, clue tokens (used to close gates), healing, and combat symbols (used when fighting the monsters guarding the gates).  Each player must carefully choose how to use their symbols to move around and try to close and collect six gates.  If six gates are open on the board the players automatically lose..  However if the players manage to close six gates Cthulhu awakens and players must try to defeat him with their remaining items and abilities.&#10;&#10;This game is in no small part inspired by Felbrigg Herriot's (FNH1) wonderful Dune Express game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Enigma of Leonardo",
        "description": "In The Enigma of Leonardo, players try to collect keys by creating patterns in the cards before them on the table.&#10;&#10;To start the game, deal each player ten cards. Each player takes five of these cards at random, places them in a + pattern, then turns them face-up; the other five cards form that player's hand. Each card has two of twelve symbols in the upper-left corner.&#10;&#10;On a turn, a player replaces one card in his + with a card from his hand, moving the first card into the + of his left-hand opponent in the same location; that opponent discards the card that was in that location. If a player creates a horizontal or vertical line of cards which each feature the same symbol, that player takes a key card showing that symbol. (A player can claim a particular type of key only once.) If all five cards in a player's + show the same symbol, the player can claim any key card that he does not already have. The first player to collect seven key cards wins.&#10;&#10;The Enigma of Leonardo includes rule variants featuring additional ways to play.&#10;&#10;Reimplemented by:&#10;&#10;    The Enigma of Leonardo: Quintis Fontis&#10;&#10;&#10;&#10;&#10;",
        "artist": "Leonardo da Vinci"
    },
    {
        "name": "Campos",
        "description": "Pietro Vozzolo's Campos may look rather ingenious  on first glance, but the game actually has little in common with that well-known Reiner Knizia design other than brightly-colored hexagons on plastic tiles.&#10;&#10;Each player starts the game with 3-5 hidden scoring cards and two face-up triangular tiles, while one tiles is laid out in the center of the table. On a turn, a player can either add her two tiles to the growing hexagonal mess or add one tile to the central display, then play a scoring card. Each scoring card is read as follows: &quot;If the largest contiguous mass of color A is larger than the largest contiguous mass of color B, then score points equal to the number of hexes in the largest contiguous mass of color C.&quot; Lots of contiguity in there!&#10;&#10;A player draws one or two new tiles at the end of her turn, and the game continues until either someone runs out of scoring cards or a player can't refill her visible display of tiles. In either case, each player again receives 3-5 scoring cards adding those to any remaining in hand then players start taking turns removing one or two tiles each turn, playing a scoring card if the player removes only one tile. The game ends once all the tiles have been removed from play, and the player with the highest score wins the game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Lexigo",
        "description": "Starting with a small hexagonal grid of letter tiles, players add more tiles onto the grid. Every turn, players have to trace a path from their piece's location to spell out a word, including all of the newly added letters, and keeping their piece on the last letter of that word. Next turn, their word will start with that last letter. Players try to get rid of all their letter tiles in their hand and stack; the first one to do so wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Key Market",
        "description": "Key Market is the sixth game in the Key series of stand-alone games published by R&amp;D Games set in the medieval lands of Keydom, with components in both English and German.&#10;&#10;The game is designed by David Brain, who was a playtester on some of the earlier Key games.  The game is the first game published by R&amp;D Games that has not been designed by Richard Breese.  Richard this time takes on the role of developer and the game consequently has the same look and feel as the previous Key games, with artwork again by Juliet Breese plus its own set of ani-/vegi-/arti-meeples.&#10;&#10;Each player controls an extended family of workers.  Over the course of two years, players will organise their workers in an attempt to turn their initial scanty resources into a thriving economic system.&#10;&#10;After an initial set up phase, the game is played over eight seasons.  Each season has three distinct phases, during which players may take a variety of actions.  The topography, weather, and seasons will influence the ability of workers to produce crops and livestock in the fields and luxuries in the villages.  In addition, resources and luxuries may be bought and sold in the market, or gold and favours sought and acquired.  Other workers may be sponsored to join the powerful guilds, where they will acquire skills as they gain promotion to become craftsmen or even the guild master.&#10;&#10;Turn order throughout the game is determined by the player&rsquo;s position on the season track, which changes at the end of each season.  At the end of the game, the player who has acquired the most gold will win the game.&#10;&#10;David Brain&rsquo;s designer notes on the box sides conclude by stating that &lsquo;Key Market is a reasonably intricate game.  Some of the strategies that can be employed (particularly the effective use of the market) are not immediately apparent, and some of the Guild combinations do not look so devastating at first glance.  But for those looking for a challenging medieval resource management/economic engine game, here you are.&rsquo;&#10;&#10;The game is for two to four players, with a game time of approximately 30 minutes plus 30 minutes per player.&#10;&#10;Key Market is a limited edition of 900 copies and was released at the Essen Spiel in October 2010.&#10;&#10;",
        "artist": "Juliet Breese"
    },
    {
        "name": "Mousquetaires du Roy",
        "description": "&quot;Mousquetaires du Roy&quot; is based on the novel &quot;The Three Musketeers&quot; by Alexandre Dumas.&#10;&#10;The Musketeers (a team of 1-4 players) are fighting against Milady to find the Queen's pendants before the end of the game. Meanwhile, they also have to defeat other plots in several places (Le Louvre, La Rochelle...).&#10;&#10;A turn begins with Milady playing plots/cards, and secretly programming a destination.&#10;&#10;Then, each musketeer (D'Artagnan, Athos, Porthos, or Aramis) has 3-4 actions to choose amongst: move, draw a card, get equipment, exchange cards/equipment, challenge in one of his four characteristics, fight against one of Richelieu's guards, reinforce La Rochelle... Milady can also reveal herself and send Rochefort to fight the Musketeers.&#10;&#10;The game includes rules for an AI-controlled Milady and can therefore be played as a pure co-op.&#10;&#10;&quot;One against all, all against one!&quot;&#10;&#10;Essen 2010 release.&#10;&#10;",
        "artist": "Arnaud Demaegd,Neriac"
    },
    {
        "name": "Hex Hex XL",
        "description": "Players redirect Hex tokens to other players with cards until a player can't redirect it anymore and becomes hexed. Those hexed lose points while the last player to pass the hex gains points. At the end of the game, the player with the most points (also called Voice) creates a new rule for the next game.&#10;&#10;Summarized in the rules:&#10;     Hex Hex is a fast-playing, highly interactive card game for 3-6 people. Players hurl Hex after Hex around the table, constantly redirecting, deflecting and altering the Hex's power until finally someone runs out of options and becomes HEXED. In the end, the winner alone will command enough Voice to control the group and lay down the law...&#10;creating a new rule for the game.&#10;&#10;Hex Hex XL, the definitive edition of the game, combines the best of classic Hex Hex and Hex Hex Next - with the addition of 2 compelling NEW variants, Hex Hex Vexed and Hexen Stix.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Wrong Chemistry",
        "description": "The Concept:&#10;Scientists in a lab are trying to create new elements, and they get it all wrong! In Wrong Chemistry (W.C.) you change a molecule in order to create new elements out of it. A fun, easy to learn, but hard to master, game, with funny references to the real elements from the periodic table.&#10;&#10;Gameplay:&#10;Players alternate rounds, during which they try to change the pieces on the board, in such a way that they can be the same shape represented by the cards in their hands. The cards represent new elements that the players discover, and when the board has the proper form, the player reveals from his hand the element he/she discovered and adds the card to his/her pile of earned points.&#10;&#10;Game End:&#10;The game ends when a player can no longer draw more cards. &#10;The winner is the player with the most points or, in case of a tie, the one that discovered more elements that are next to each other in the Periodic Table of the Elements (chairs not included).&#10;&#10;Greek description:&#10;&Mu;&iota;&alpha; &omicron;&mu;&#206;&#172;&delta;&alpha; &tau;&rho;&epsilon;&lambda;&#207;&#142;&nu; &epsilon;&pi;&iota;&sigma;&tau;&eta;&mu;&#207;&#140;&nu;&omega;&nu;, &eta; &omicron;&pi;&omicron;&#206;&#175;&alpha; &delta;&epsilon;&nu; &#206;&#173;&chi;&epsilon;&iota; &iota;&delta;&#206;&#173;&alpha; &alpha;&pi;&#207;&#140; &Chi;&eta;&mu;&epsilon;&#206;&#175;&alpha;, &pi;&rho;&omicron;&sigma;&pi;&alpha;&theta;&epsilon;&#206;&#175; &nu;&alpha; &mu;&epsilon;&tau;&alpha;&sigma;&chi;&eta;&mu;&alpha;&tau;&#206;&#175;&sigma;&epsilon;&iota; &#206;&#173;&nu;&alpha; &mu;&#207;&#140;&rho;&iota;&omicron; &kappa;&alpha;&iota; &nu;&alpha; &delta;&eta;&mu;&iota;&omicron;&upsilon;&rho;&gamma;&#206;&#174;&sigma;&epsilon;&iota; &alpha;&pi;&#207;&#140; &alpha;&upsilon;&tau;&#207;&#140; &kappa;&alpha;&iota;&nu;&omicron;&#207;&#141;&rho;&iota;&alpha; &sigma;&tau;&omicron;&iota;&chi;&epsilon;&#206;&#175;&alpha;, &alpha;&lambda;&lambda;&#206;&#172;&hellip; &tau;&alpha; &theta;&alpha;&lambda;&alpha;&sigma;&sigma;&#207;&#142;&nu;&epsilon;&iota;! &#10;&Mu;&eta;&nu; &alpha;&nu;&eta;&sigma;&upsilon;&chi;&epsilon;&#206;&#175;&tau;&epsilon; &alpha;&nu; &eta; &Chi;&eta;&mu;&epsilon;&#206;&#175;&alpha; &delta;&epsilon;&nu; &epsilon;&#206;&#175;&nu;&alpha;&iota; &tau;&omicron; &delta;&upsilon;&nu;&alpha;&tau;&#207;&#140; &sigma;&alpha;&sigmaf; &sigma;&eta;&mu;&epsilon;&#206;&#175;&omicron;, &kappa;&alpha;&theta;&#207;&#142;&sigmaf; &sigma;&tau;&omicron; &pi;&alpha;&iota;&chi;&nu;&#206;&#175;&delta;&iota; &alpha;&upsilon;&tau;&#207;&#140; &delta;&epsilon;&nu; &pi;&rho;&#207;&#140;&kappa;&epsilon;&iota;&tau;&alpha;&iota; &nu;&alpha; &epsilon;&xi;&epsilon;&tau;&alpha;&sigma;&tau;&epsilon;&#206;&#175;&tau;&epsilon; &gamma;&iota;&alpha; &tau;&eta;&nu; &omicron;&rho;&theta;&#207;&#140;&tau;&eta;&tau;&alpha; &tau;&omega;&nu; &sigma;&tau;&omicron;&iota;&chi;&epsilon;&#206;&#175;&omega;&nu; &pi;&omicron;&upsilon; &delta;&eta;&mu;&iota;&omicron;&upsilon;&rho;&gamma;&epsilon;&#206;&#175;&tau;&epsilon;, &tau;&omicron; &alpha;&nu;&tau;&#206;&#175;&theta;&epsilon;&tau;&omicron; &mu;&#206;&#172;&lambda;&iota;&sigma;&tau;&alpha;&hellip; &Pi;&omicron;&#207;&#141; &xi;&#206;&#173;&rho;&epsilon;&tau;&epsilon; &mu;&pi;&omicron;&rho;&epsilon;&#206;&#175; &nu;&alpha; &pi;&#206;&#172;&rho;&epsilon;&tau;&epsilon; &kappa;&alpha;&iota; &Nu;&#207;&#140;&mu;&pi;&epsilon;&lambda; &gamma;&iota;&alpha; &tau;&eta;&nu; &alpha;&nu;&alpha;&kappa;&#206;&#172;&lambda;&upsilon;&psi;&#206;&#174; &sigma;&alpha;&sigmaf;!&#10;&#10;",
        "artist": "Michael Andresakis,CDS Studio,Tony Cimino,Tiago Da Silva,Urszula Mos,Nikolay Popov"
    },
    {
        "name": "Resident Evil Deck Building Game",
        "description": "In Resident Evil, a deadly virus has caused the dead to rise and infect any living thing they encounter!  Fleeing to a mysterious mansion, you must gather any materials you can find to protect yourself and fight for your survival against a legion of infected beings!&#10;&#10;The Resident Evil DBG brings the story to life in a game of strategy where players construct their card decks while they play.  Choose one of your favorite characters from Resident Evil such as: Chris Redfield, Jill Valentine, or Albert Wesker among others. Players start with only the most basic of items and weapons. As the game progresses, players build their arsenal with additional Weapons, Ammunition, Action or Item cards to customize their deck and improve their ability in defeating the Infected!  Your deck will be your lifeline to survival.  How will you survive the zombie outbreak?&#10;&#10;The Resident Evil DBG will consist of 250 playing cards, 3 different game modes (Story, Mercenary and Versus) and hundreds of possible scenarios within each mode for unlimited replay value.  No two games will ever be the same!&#10;&#10;&#10;     Story mode is the main version of the game where players must race to claim the best weapons, items, and ammunition before others get to it first. Quick thinking and a good instinct will help you survive the Mansion and be the one to escape to safety.  &#10;     Mercenary mode is similar to Story mode but this mode rewards the players that take the offensive. Players must prove their skills by defeating as many zombies as they can in a limited amount of time. This mode can be played in teams.&#10;     Versus mode removes the Infected from the game and pits the human characters against each other in a battle for dominance. Players must watch their back as they attempt to defeat each other while staying alive themselves. Watch out because you may find that players are not as merciful as the Infected!&#10;&#10;&#10;Players take on the role of one of the Heroes of Resident Evil. They start with a deck of 10 cards, which consist of Weapons and Ammo. Players must use their resources to obtain more powerful Weapons, Ammo, Items, and Action Cards that they add to their deck. As you progress in the game your Deck will become stronger and more efficient. You must use the cards in your deck to fight the &quot;Infected&quot; creatures which awards you Decorations . To win the game you must defeat more &quot;Infected&quot; creatures then your opponents, but the game only ends when the strongest &quot;Infected&quot; creatures is killed. Once he is killed, the player that has gained the most Decorations wins the game.&#10;&#10;&#10;     Ammo cards are used to power your Weapons as well as purchase new cards.&#10;     Weapon cards are used to battle the &quot;Infected&quot; creatures. Stronger weapons require more ammo.&#10;     Item cards allow you to strengthen and Heal your Character.&#10;     Action cards give you additional actions that you can take during your turn, such as drawing more cards or improving the power of your weapons.&#10;&#10;&#10;Game Contents&#10;&#10;     250 Cards&#10;     Game Manual&#10;&#10;&#10;&#10;&#10;Integrates with:&#10;&#10;    Resident Evil Deck Building Game: Alliance&#10;    Resident Evil Deck Building Game: Mercenaries&#10;&#10;&#10;&#10;&#10;Expanded by:&#10;&#10;    Resident Evil Deck Building Game: Outbreak&#10;    Resident Evil Deck Building Game: Nightmare&#10;&#10;&#10;&#10;&#10;",
        "artist": "Jak L. Hueng"
    },
    {
        "name": "Star Trek: Fleet Captains",
        "description": "Star Trek: Fleet Captains, designed for two or four players, is set in the &quot;Prime Universe&quot; of STAR TREK (as seen in the various TV series and movies up to Star Trek: Nemesis) and is more adversarial in nature when compared to Star Trek: Expeditions.  Each player takes the role of a faction (or race) from the universe.  In the base game, the choices are Klingons and Federation.  Each faction has a number of ships (on Clix dials similar to the Heroclix line of components) of varying ability and with a corresponding &ldquo;size.&rdquo;  Fleets of ships are drafted to a given size total which reflects the victory points required to win.  Thus, larger fleet sizes lead to higher point (and longer games).&#10;&#10;Players then &ldquo;shuffle build&rdquo; a deck of command cards.  Choosing four decks from a set of ten decks per faction.  Each deck has a unique flavor or theme, with corresponding major characters.  For instance the Klingons have a deck themed around larger ships and imperial domination and Gowron is a central character.  The four decks chosen will help to set the player&rsquo;s strategy for winning.&#10;The ships chosen have physical stats like weapons, shields, engines, and sensors. They also have mission totals for science, influence, and combat missions.  These determine the kinds and numbers of each kind of mission cards the player draws to form a mission deck.  Completing missions gains the player points, which will win them the game.   Missions could be as simple as damage an opposing ship that is larger than your own (combat), to as complex as claiming the spaces connecting your command post to your opponents (influence). Thus a player&rsquo;s chosen ships sets the types of missions they will need to earn points and the deck they build determines the way they will complete missions.&#10;&#10;Points can also be earned for non-mission actions such as destroying a ship or building a starbase.&#10;&#10;The game itself plays out on a randomly built board of hex cards, called sectors that start the game unexplored.  As each ship progresses through the sector, the cards are turned face up, revealing what is in that part of the sector (a Class-M planet, a Class-J Nebula, empty space, etc...). There are additionally random events that can occur when exploring, which usually correspond to a single episode of a series (for instance one encounter is &ldquo;trouble with tribbles.&rdquo; Some of these encounters also give victory points.&#10;&#10;Overall, the game can best be thought of as playing out an entire season of Star Trek with the conflict between players representing the major story arc and the turns, missions, and random encounters representing individual episodes.  Players will move their ships, explore space, complete missions, play cards to upgrade their ships (and staff them with famous and not so famous crewmembers), or boost their stats in combat.  Combat, while important, is not the sole path to victory, with the mission cards being the primary factor (some of which will encourage combat).  The style of game will depend heavily on individual player decisions, but no matter what, it will feel like Star Trek.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Star Trek: Expeditions",
        "description": "Star Trek: Expeditions is a board game for up to four players, set in the &quot;New Universe&quot; of Star Trek, as seen in the 2009 movie. It is built upon the cooperative board game model and the players will work together against the game itself.&#10;&#10;In the game, players assume the roles of Kirk, Spock, Bones and Uhura. The premise is the Federation has received a petition for membership from a planet and the Enterprise is dispatched to assess their application. When the Enterprise arrives, they discover:&#10;&#10;&#10;     A Klingon battle cruiser is in orbit;&#10;     Civil war is threatening to break out on the planet;&#10;     And the planet is (coincidentally?) reconsidering its application for UFP membership.&#10;&#10;&#10;Your mission is threefold; defuse the threat of civil war, deal with the Klingon threat and get the planet to join the UFP. And you only have 30 days (roughly equaling 30 turns) in which to do it. or a Klingon battle fleet will warp in and you will be forced to withdraw (thus failing your mission).&#10;&#10;Each objective is tracked on a scoresheet that monitors your progress. Decisions you make in the game as well as how you interact with the other players will affect the outcome of the mission.&#10;&#10;The four figures are fully rendered, 3D versions of the four Bridge officers. The four figures and two spaceships are similar to Heroclix figures, with the clicks on the dials at the base of the figure representing damage and corresponding diminished abilities.&#10;&#10;This product is designed as a non-collectible, non-blind, all-in-one-and-done game, but is built upon the &quot;expandable&quot; board game model meaning that down the line, new missions and crew members will be made available for folk to play other &quot;episodes&quot;!&#10;&#10;",
        "artist": "Chris Raimo,Ed Repka"
    },
    {
        "name": "Plateau X",
        "description": "Players try to reach the highest point on the ever changing board. In a turn, players either place a tile, place their pawn on the board, or move their pawn if it's already on the board.&#10;&#10;Moving a pawn is allowed under the condition that for each step (based on the square grid of the board), the pawn has to either go up or down one level. Precisely one level. Too steep a climb or descent and the pawn can't go there. Movement on the same level is also not allowed.&#10;&#10;The players that reaches the highest point is the winner. In case of a tie, the player that is on the largest plateau wins. If this doesn't solve the tie, then the player that has been on the highest point the longest is the winner.&#10;&#10;With two players, the game is very strategic. With 3 or 4 players luck also becomes a factor to take into account.&#10;&#10;EDIT (November, 2nd 2011): There's a new supplementary rule (approved of by Winning Moves):&#10;Players are allowed to remove their own pawn from the board as a separate move (and re-enter it on the ground level at some later point of the game as a separate move).&#10;&#10;",
        "artist": "Claus Stephan"
    },
    {
        "name": "Era of Inventions",
        "description": "From rules:&#10;Explore the lives and minds of Alexander Graham Bell, Karl Benz, the Wright brothers and other pioneers of invention and experience the thrill of the industrial revolution. Be there when the cash register, the sewing machine, the typewriter, the telephone, the gramophone, the photograph camera, the car, the steam engine and the plane are all invented again in Era of Inventions.  This time you will be the inventor, who creates, patents and introduces these inventions to the markets and the world!  In the late 19th and early 20th century, these inventions were all made in a certain order. In Era of Inventions, however, you&rsquo;re the one who determines the order of the inventions. Race your competitors to invent as much as possible, or to speed through the production process.  But don&rsquo;t forget to register your patents.  Otherwise you may lose influence in the industry.&#10;&#10;GAME OVERVIEW&#10;Era of inventions is played over 8, 9 or 10 rounds &ndash;depending on the number of players&ndash;. In each round players attempt, by using action tokens, to use the following actions at the wisest, such as: building factories, buying or producing goods, and making and producing new inventions. The number of action tokens is limited however(the time is short), and thus you must choose the best of many actions, given your situation. The player who uses his actions, money, goods and development points at the best will earn the most influence in the Era of Inventions and win the game!&#10;&#10;",
        "artist": "Hans Janssen"
    },
    {
        "name": "Zombie Survival: The Board Game",
        "description": "Game description from the publisher:&#10;&#10;The mysterious event that has animated the dead has also given them an unhealthy hunger for your brains! The only way to survive is to fortify your house and make your stand. How long can you survive?&#10;&#10;In Zombie Survival: The Board Game, you choose your provisions to survive a zombie apocalypse. Each player selects items to place in their house, including weapons, lumber, gas, first aid, etc.&#10;&#10;The second part of the game brings your fears to light as the zombies start heading towards your house, tearing down your barricades and creeping in. You may have a chance to make it to town for some additional supplies, hopefully avoiding the zombies there, leaving your family to defend against the walking dead. Did you prepare for the possible power outage, contaminated water, sickness and fatigue? How long can you feed your family and keep them healthy?&#10; The best prepared will win.&#10;&#10;",
        "artist": "Dave Aikins"
    },
    {
        "name": "A Few Acres of Snow",
        "description": "A Few Acres of Snow is a two-player, deck-building game about the French and British conflict in North America.&#10;&#10;The card-play contains a focus on a deck-building mechanic similar to Dominion, each card will have multiple uses like card-driven game. The players have to choose only one aspect of the card to use when it is played. Each space captured by a player will add another card to the capturing player's deck.&#10;&#10;From the box description:&#10;&#10;A war fought at the edge of two mighty empires. For over one hundred and fifty years Britain and France were locked in a struggle for domination of North America. Thousands of miles from their homes, settlers and soldiers were faced with impenetrable forests, unpredictable American tribes, and formidable distances. Despite these obstacles they were able to engage in bitter warfare, with the British ultimately taking the prize of Quebec. A Few Acres of Snow is a two-player game that allows you to recreate this contest. You can change the course of history by your decisions.&#10;&#10;A Few Acres of Snow takes an innovative approach to the subject, using cards to represent locations and manpower. As the game progresses you add to your selection of cards, increasing the range of actions available to you. There are many strategies to be explored. How quickly should you build up your forces, do you employ Native Americans, what energy should be expended on your economy?&#10;&#10;The game is about more than just fighting &ndash; you must successfully colonize the land to have a chance.&#10;&#10;",
        "artist": "Peter Dennis"
    },
    {
        "name": "Mord im Arosa",
        "description": "From the game rules:&#10;&#10;A thriller in the MYSTERY TOWER for 2 to 6 good noses ears,10 years and up, by Alessandro Zucchini&#10;&#10;Night in the &quot;Arosa&quot; hotel. Creaking floor boards, banging window shutters, strange noises. Behind the wafer-thin walls, no sound remains hidden from eavesdropping ears.&#10;Suddenly: a bang! A scream! Hurried steps fade away&thinsp;&hellip; &#10;Nobody saw anything! But everybody heard everybody else&thinsp;&hellip; There are clues from the hotel guests on all floors. But which of them will be discovered? And which of them will remain hidden? If you don&rsquo;t want a murder rap pinned on you, you should lay the blame on the other players instead. Because one thing is for sure: the overwhelming evidence will convict the culprit.&#10;&#10;The players arouse suspicion: they throw their clues (in the form of little wooden cubes) into the shaft of the hotel tower. If you prick up your ears, you&lsquo;ll be able to guess on which floors the suspicious clues come to rest. With this knowledge, you can denounce other players and cover your own tracks.&#10;The culprit is the one who has left particularly suspicious clues in the vicinity of the scene of the crime. Whoever attracts the fewest suspicious facts, wins.&#10;&#10;Contents:&#10;1 hotel (8 parts)&#10;2 victims (red)&#10;120 clues in 6 colors&#10;1 investigation sheet&#10;&#10;",
        "artist": "Oliver Richtberg,Tobias Schweiger"
    },
    {
        "name": "Geistertreppe: Das Kartenspiel",
        "description": "Secretly, the children are exploring the old ruin. But the old ghost already saw them and decides to play a trick on them. He transforms the children into ghosts. The player who can best memorize where the children are located and collects the most cards, wins the game. But the children change places all the time.&#10;&#10;&#10;Heimlich schleichen die Kinder in der Ruine umher. Doch der alte Geist hat sie l&auml;ngst bemerkt und erlaubt sich einen Streich! Er verwandelt die Kinder in Geister. Wer sich richtig merkt, wo sich welches Kind befindet und die meisten Karten sammelt, gewinnt.&#10;&#10;",
        "artist": "Rolf Vogt"
    },
    {
        "name": "Busstop: The Boardgame",
        "description": "There are many types of people who arrive at a bus stop waiting to get on a bus; babies,kids, high school girls, working men, seniors and ETs(the Extra-Terrestrials). In this game it is your job to get the same type of people on to one of your buses, and to make sure your bus is full before taking them to their destinations.  If you have more kinds of people than you have buses you will have to make some of them wait at the bus stop for another bus to come. If the game ends and you still have passengers waiting for a bus, you create unhappy customers and you receive negative Victory Points.&#10;&#10;This is the new version of card game Busstop.&#10;Cards changed into tiles, main board and player boards.&#10;A new kind of passenger called baby introduced.&#10;And several rules are changed.&#10;&#10;",
        "artist": "Kai Fujiwara"
    },
    {
        "name": "Dexter: The Board Game",
        "description": "As DEXTER, travel through the streets of Miami trying to hunt down a suspect that has slipped through the cracks of the justice system and make them your next victim.&#10;&#10;Keep your day job by completing Blood Spatter Reports to avoid any suspicion and reap the rewards of a job well done. In the meantime, try to avoid your opponents, who will expose you, the first chance that they get.&#10;&#10;Once you have found your suspect and have collected the Tools that you need, you must head over to the Marina to get rid of the evidence and win the game.&#10;&#10;Strategic game play, loads of fun&hellip;.if you&rsquo;re a fan of DEXTER, this game is a must have.&#10;&#10;Components: Game Board, Playing Pawns, Six-Sided Die, Cards, Suspect Tokens, Tool Tokens, Mini Garbage Bags.&#10;&#10;Playing Time: 2 Players (30-45 minutes), 3-4 Players (45-75 minutes). .&#10;&#10;Features: Ages 17+, 2-4 Players.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Antics!",
        "description": "Antics! is the 2010 Essen release by Fragor Games. You play an ant colony. Prey and leaves abound nearby - if only those other ants would not take what is rightfully yours. Players attempt to have their ants bring back prey and leaves to their anthill. Only the best ant colony will survive and the winner proclaimed The Ant Queen.&#10;&#10;Gameplay is straightforward yet rich in challenging decisions. Do you concentrate on building your ant-hill only to discover that others have got to the food before you ?  Or do you go and grab the food only to find yourself outpowered towards the end of the game ?&#10;&#10;The game is for 3-4 players, ages 10+ and lasts for 60 minutes. It features Fragor&rsquo;s &quot;ant-hill system&quot; - a revolutionary new game mechanic.&#10;&#10;Get carried away this Essen...&#10;&#10;",
        "artist": "Judith Lamont"
    },
    {
        "name": "Dungeon Raiders",
        "description": "Join a brave party of adventurers! Explore a dungeon filled with monsters, traps and treasure!&#10;&#10;In Dungeon Raiders, each player takes the role of a different adventurer. You'll need to work together to survive the dungeon, but only one of you will make it out with the most treasure and win the game! The dungeon is different each time you play, offering new surprises as you collect treasure, trigger traps, and fight off horrible monsters.&#10;&#10;Dungeon Raiders can also be played as a solitaire game: take on the dungeon alone and see how much treasure you can make it out with!&#10;&#10;Microbadge ::   &#10;&#10;",
        "artist": "Chechu Nieto,Meredith Walker,Phil Walker-Harding"
    },
    {
        "name": "MUNERA: Familia Gladiatoria",
        "description": "MUNERA: Familia Gladiatoria is a boardgame for 2-4 players in which you will play the role of a lanista, an ancient world entrepreneur who has decided to invest his wealth in the constitution of a Gymnasium of Gladiators with the aim of making it the most glorious of the Empire. You will recruit trainers, armourers, medics and even prostitutes. You will train free men, slaves, criminals and war prisoners to become gladiators and you will bring them to fight in the arenas throughout Italy. You will manage not only the duels, but the whole life of your gladiators: lead your champions to glory!&#10;    &#10;Unwinding of a game&#10;&#10;In the first round, after a short preparation, the Players take their Gladiators to the arenas for brief introductory Shows: they approach the first challenges of their champions and place their bets on life or death of duelists. After this initial stage, the game takes on its regular sequence. In the first phase, called Forum phase, Players will play aggressive auction for what the market has to offer them: athletes for training and professionals for Gymansium&rsquo;s management. In the second phase, called Munus phase, the Players play the Spectacles, trying to participate with their best Gladiators. Not all spectacles are equal: some have more money gain, others provide more glory. The Players need to make the best choices!&#10;&#10;During the Spectacles, you will fight the duels of Gladiators. Just like a lanista of two thousand years ago, you will manage many duels and you will place bets and tampering to obtain money. Duel by duel, your Gladiators will grow and become stronger and more popular. Which Gym will be able to prevail and become the most glorious of the ancient world?&#10;&#10;Familia Gladiatoria is the first in a series of games that aim to recreate the whole cruel and multiform world of Imperial Rome spectacles. The MUNERA series will allow you to live not only the training of Gladiators and their challenges, but also the hunts in the arena and the chariots in the Circus Maximus.&#10;&#10;",
        "artist": "Jocularis"
    },
    {
        "name": "4 Monkeys",
        "description": "In this game players will be monkeys in a research lab where scientists are trying to determine which of them is the smartest in order to send him to the first space flight to Mars.&#10;&#10;Various sets of colored figures are projected onto a screen and monkeys will have to do their best to quickly try and reproduce these combinations by pressing the right buttons on their individual panels. If they do it right they get some bananas.&#10;&#10;Each game lasts for 3 rounds during which players will try to score as much as possible. The player with the most points at the end of the game will be the winner and be eventually sent to Mars!&#10;&#10;Note: Each game allows 4 players to play the game. Technically, there is no upper limit of players.&#10;&#10;Components:&#10;4 decks with 40 figure cards ea&#10;4 sets with 11 combo tiles ea&#10;4 &ldquo;Banana skins&rdquo; tiles&#10;1 timer&#10;4 player aids&#10;1 rule set&#10;&#10;",
        "artist": "Bascu"
    },
    {
        "name": "Sandwich",
        "description": "In the card game Sandwich, you want to prepare the best sandwiches possible &ndash; well, the least disgusting ones anyway &ndash; with the ingredients you collect.&#10;&#10;At the start of the game, each player is dealt nine ingredient cards face-down; ingredients range from the traditional (tomato, cheese) to the more unusual (mussels, melon). Each player stacks these nine cards face-down. At the same time, they each take the top card of their stack and reveal them in the center of the table. Each player then grabs one card that he desires, possibly his own. This process is repeated nine times, giving each player nine ingredients that they &quot;chose&quot;.&#10;&#10;Each player then creates three sandwiches, each containing three of their nine ingredients. The players give one sandwich to three neighbors on the left (dividing them differently in a three-player game), so that everyone has three sandwiches in front of them created by other players. Players then take turns &quot;tasting&quot; the sandwiches on their plate, reading the ingredients aloud, then stating which one sounds best (worth 3 points for its creator), which is second-best (2 points) and which would be left on the plate (0 points).&#10;&#10;After three complete rounds &ndash; nine sandwiches total &ndash; the player with the most points wins.&#10;&#10;",
        "artist": "Maëva da Silva,Christine Descamps,Thibault Deflandre"
    },
    {
        "name": "Cité",
        "description": "In this fledgling city, things have yet to be built, and opportunities to carve out a commercial empire abound. However, in order to erect the city's largest districts, you'll have to be a shrewd negotiator and a wise spender.&#10;&#10;Cit&eacute; includes wood cubes, metal nuggets, pieces of fabric, stones, and more to represent the resources and tiles of different sizes to represent buildings. A building brings you resources and has special effects on other buildings in the neighborhood.&#10;&#10;In each of the seven turns, you collect resources, possibly exchange them with the other players, and build new constructions. All other rules, namely the effects of buildings, are written on the tiles.&#10;&#10;Each neighborhood tends to specialize in a few resources, but to undergo new construction you will need a little bit of everything, so there are many trade-based interactions between players. Cit&eacute; illustrates the workings and limits of mainstream economic theory like the Hecksche-Ohlin model and improves your negotiation skills.&#10;&#10;Everybody plays at the same time, so you never wait, making Cit&eacute; quite quick for this category of game.&#10;&#10;",
        "artist": "Maëva da Silva,Christine Descamps"
    },
    {
        "name": "Ranking",
        "description": "At the beginning of the game each player receives a different set of picture tiles. To start a round, a theme is shown, e.g. &quot;Women like it...&quot; Everyone thinks about this and selects a tile from his set, but does not show it to the other players. Players lay their tiles picture-side down on the table, and these tiles are mixed up with random tiles from the stock.&#10;&#10;On the board there are slots which are numbered from 0 to 6. Tiles are placed next to slot 3 so that everyone can see the pictures. The goal for each player is to have his tile reach the top (slot 6) of the ranking of items that best meet the requirement. Each player receives points equal to the slot number where his tile is at the end of each round. The point total is reduced if another player correctly guesses which tile belongs to whom and marks it with the player's color.&#10;&#10;When it is your turn, choose two tiles in the same row/slot and compare them to one another in meeting the requirement of the theme. (Important: You can only compare two tiles in the same row. If there is only one tile in row 4, you cannot compare this tile to one in a different row!)&#10;For example, say, &quot;I think women like lipstick more than a car.&quot; Then, you move the lipstick tile up one row and the car tile down one row. After you have done that, the others can guess your tile, by placing a stone of your color on any tile. Each player has only one stone of each color and can only guess the active player, so this must be done selectively and timely!&#10;&#10;The round ends when one tile reaches the 6 slot and another is in the 0. Then, you calculate the points. Each player gets points equal his slot, minus every correct guess stone on the tile. So, if your tile is in slot 4, but there are 2 correct color stones are on it, you get only 2 points (4 - 2 = 2).&#10;&#10;Before the beginning of the next round everyone gets a new picture tile from the stock and a new theme is shown.&#10;&#10;The first player to score 15 points after a round ends the game and is the winner. He is the RanKING.&#10;&#10;",
        "artist": "Klemens Franz"
    },
    {
        "name": "Stich-Meister",
        "description": "Stich-Meister is a trick-taking game in which the players alter the rules before each round of play. The game consists of two decks of cards: One deck of 60 cards with four suits of cards numbered 1 to 15, and one deck of 60 rule cards.&#10;&#10;Each player has three rule cards, and at the start of a round, each player plays one of these cards. The rule cards played determine the rules for that round. There are three types of rule cards:&#10;&#10;&#10;    Trump cards, which determine the trump suit;&#10;    Scoring cards, which determine how many points a trick is worth;&#10;    Basic rule cards, which affect the way cards may be played.&#10;&#10;&#10;Now, a trick-taking game is played with the 60-card deck. One player leads a card and others need to follow suit, if possible (unless this has been changed by the rule cards). The winner of a trick leads the next trick. At the end of the round each trick is worth one point, modified by the scoring cards.&#10;&#10;After a number of rounds equal to the number of players, the game ends, and the player with the most points wins.&#10;&#10;",
        "artist": "Lars-Arne \"Maura\" Kalusky"
    },
    {
        "name": "Régents",
        "description": "In 1286, Alexander III, King of Scotland, died of a fall from a horse. None of his children who survived him, the Scottish lords declared his little daughter Margaret, then aged 4, Queen of Scots. But because of his age too young, the Lords put up a regency, the Guardians of Scotland for the administration of the kingdom until Margaret was old enough to reign.&#10;&#10;Gathered in a meeting in Edinburgh Castle, with the referee King Edward 1st of England, the major Scottish clans will have to use their influence to get the honorary title of Regent, also known as &quot;Guardian of the kingdom.&quot;&#10;&#10;REGENTS is a placement game / majority where he must win the points of influence in areas key to the kingdom (political, military, religious, financial and trade). The dot gain sensitivity is based on a threshold to cross in order to progress making the game very tight. In addition to playing cards &quot;ACTION&quot; and a charge to make the ambience of the conspiracy.&#10;&#10;",
        "artist": "Stéphane Poinsot"
    }
]