[
    {
        "name": "Ca$h 'n Guns (Second Edition)",
        "description": "In an abandoned warehouse a gangster band is splitting its loot, but they can't agree on the split! It's time to let the guns talk and soon everyone is aiming at everyone. The richest surviving gangster wins the game!&#10;&#10;Ca$h 'n Guns helps you relive the best scenes of your favorite gangster movies. The goal is to have more money than anyone else after eight rounds while still being alive.&#10;&#10;Each round, one player is the Boss, and he controls the pace of play. First, loot cards are revealed on the table to show what's up for grabs. Next, players load their guns by secretly selecting either a &quot;Bang!&quot; or a &quot;Click! Click!&quot; card from their hand. The Boss counts to three, and on &quot;Three&quot; each player points his foam gun at someone else; due to his status, the Boss can tell one player who's pointing a gun at him that he needs to point it in another direction. After a pause to observe threats and measure the seriousness in an opponent's eyes, the Boss counts to three again and anyone who doesn't want to risk getting shot can chicken out and remove themselves from the round.&#10;&#10;Everyone who's pointing a gun at someone still in the round now reveals their card, and anyone who's the target of a &quot;Bang!&quot; takes a wound marker and gets none of the available loot. Starting with the Boss, everyone still in the round takes one loot card at a time from the table &mdash; money, diamonds, paintings, the position of Boss, medical care (to remove a wound), or a new bullet (to add a &quot;Bang!&quot; card to your hand) &mdash; until everything has been claimed.&#10;&#10;After eight rounds, the game ends. Whoever has the most diamonds receives a big bonus, and paintings score based on the number of them that you've collected. Whoever has the most valuable stash wins!&#10;&#10;",
        "artist": "John Kovalic"
    },
    {
        "name": "DreadBall Xtreme",
        "description": "DreadBall Xtreme is the underground sports game of the future and the follow-up to DreadBall: The Futuristic Sports Game. In this game, two teams battle it out on the pitch to outscore each other, with all-new twists:&#10;&#10;&bull; No Referee = More Violence for Everyone: with no one to stop the bloodshed, anything goes! Sucker punches and stomps are the norm, and the introduction of explosive collars, deadly traps and bloodsucking aliens only increase the level of violence.&#10;&#10;&bull; Customize your Battlefield: games are organized in prisons and warehouses at a moment&rsquo;s notice, using industrial scenery to shake things up - everywhere from the scoring zone to the ball launch location can change!&#10;&#10;&bull; Play as Enigmatic Sponsors: the powerful organizers behind the game, Sponsors dictate your play-style and are experts in intimidation, blackmail and illegal gambling. Best of all, Sponsors allow you to build entirely unique teams out of any player combination you like!&#10;&#10;Are you ready for an all-new ball game?&#10;&#10;DreadBall Xtreme is a standalone game based in the same world as DreadBall and cross-compatible with it, but DreadBall is not required for play.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Castles of Mad King Ludwig",
        "description": "In the tile-laying game Castles of Mad King Ludwig, players are tasked with building an amazing, extravagant castle for King Ludwig II of Bavaria...one room at a time. You see, the King loves castles, having built Neuschwanstein (the castle that inspired the Disney theme park castles) and others, but now he's commissioned you to build the biggest, best castle ever &mdash; subject, of course, to his ever-changing whims. Each player acts as a building contractor who is adding rooms to the castle he's building while also selling his services to other players.&#10;&#10;In the game, each player starts with a simple foyer. One player takes on the role of the Master Builder, and that player sets prices for a set of rooms that can be purchased by the other players, with him getting to pick from the leftovers after the other players have paid him for their rooms. When a room is added to a castle, the player who built it gains castle points based on the size and type of room constructed, as well as bonus points based on the location of the room. When a room is completed, with all entranceways leading to other rooms in the castle, the player receives one of seven special rewards.&#10;&#10;After each purchasing round, a new player becomes the Master Builder who sets prices for a new set of rooms. After several rounds, the game ends, then additional points are awarded for achieving bonus goals, having the most popular rooms, and being the most responsive to the King's demands, which change each game. Whoever ends up with the most castle points wins.&#10;&#10;",
        "artist": "Keith Curtis,Agnieszka Dabrowiecka,Ollin Timm"
    },
    {
        "name": "Pleasant Dreams",
        "description": "Pleasant Dreams is a 1 or 2 player card game placing the players in a dreamworld where they fend off nightmares. Decide whether you want to hold on to pleasant elements of your dream... Anything can come back to haunt!&#10;&#10;The goal of the game is to trick your opponent into drawing so many nightmarish dream fragments that he or she wakes up. Alternatively you can win the game by being the first player to finish the dream without waking up.&#10;&#10;Each turn of the game starts with the player deciding how many dream fragments they want to resolve. Pleasant ones help you relax, while the unpleasant ones bring you closer to waking up screaming. You can have some of the cards come back later. These you secretly insert anywhere into the dream deck. Will you play to win or to make your opponent lose?&#10;&#10;",
        "artist": "Wayne Dorrington"
    },
    {
        "name": "Guild Ball",
        "description": "minutes to learn &ndash; incredibly deep gameplay - modern-design game mechanics &ndash; fully realised world &ndash; amazing miniatures.&#10;&#10;After 12 months of development, Mat Hart and Rich Loxam are pleased to present &ldquo;Guild Ball&rdquo;, a tabletop medieval football wargame. Playing the role of the team coach, you will take control of a Guild Ball football (soccer) team and with a combination of tactics and strategy attempt to outscore your opponent whilst simultaneously trying to achieve additional secret political objectives and agendas.&#10;&#10;",
        "artist": "Doug Telford"
    },
    {
        "name": "The Hobbit: An Unexpected Journey Deck-Building Game",
        "description": "Game description from the publisher:&#10;&#10;In The Hobbit: An Unexpected Journey Deck-Building Game, each player takes on the role of a member of The Company as they set out on the long and treacherous path to Lonely Mountain. Play as Bilbo Baggins, Gandalf the Grey, Thorin Oakenshield, or others. Your Hero card will guide your strategy throughout the game, or you can break away with a plan of your own.&#10;&#10;Each player starts with his own basic ten-card deck and draws a hand of five cards each turn. Power is the currency you will use to buy new, stronger cards to add to your deck. The goal of a deck-building game is to craft your personal deck into a well-oiled machine, and five types of cards can be acquired: Enemies, Allies, Artifacts, Maneuvers, and Locations. A large, central stack of cards supplies a five-card &quot;Path&quot; from which players make their purchases. Each player always has five face-up cards from which to choose each turn, so new options and surprises await each turn.&#10;&#10;When you have amassed enough Power, you can take on an Archenemy! Each Archenemy has Loot cards you can acquire. Defeat a Troll and you might find Sting, Orcrist, or Glamdring! Take on The Goblin King and you might find the maneuvers you need to escape from the Misty Mountains. Azog is the final Archenemy, and he has unfinished business...&#10;&#10;In the end, the player who has accumulated the most Victory Points from the cards in his deck wins.&#10;&#10;Cryptozoic's The Lord of the Rings/The Hobbit deck-builder series:&#10;&#10;&#10;     The Lord of the Rings: The Fellowship of the Ring Deck-Building Game&#10;     The Lord of the Rings: The Two Towers Deck-Building Game&#10;     The Lord of the Rings: The Return of the King Deck-Building Game&#10;     The Hobbit: An Unexpected Journey Deck-Building Game&#10;     The Hobbit: The Desolation of Smaug Deck-Building Game Expansion Pack&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "DC Comics Deck-Building Game: Forever Evil",
        "description": "DC Comics Deck-Building Game: Forever Evil is the third standalone game in Cryptozoic's DC Comics deck-building series, each of which is playable on its own or in combination with the other titles. In addition to including new challenges and abilities, Forever Evil lets you play as the villains in the DC universe instead of the heroes.&#10;&#10;It's fun to be bad! In the DC Comics Deck-Building Game: Forever Evil, players finally get to play the game as some of the most infamous Super-Villains in the DC Universe! With a name like Forever Evil, you can expect to find new and more dangerous Attacks, rugged Defenses and a number of nefarious ways to mess with your opponents. Card destruction is rampant in the set! Like every good Villain knows, henchmen you leave behind don't count toward the bottom line. If you're tired of ending the game with Starter cards still in your deck, then this is the set for you!&#10;&#10;Forever Evil introduces Victory Point tokens to DC Deck-Building Game! Just be on the lookout for lowly thieves who would steal away your hard-earned loot. While this game is a full-fledged stand-alone game, it can also be mixed with all previous releases in the line.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Walking Dead \"Don't Look Back\" Dice Game",
        "description": "In The Walking Dead &quot;Don't Look Back&quot; Dice Game, you play as one of four survivors from the television show: Rick, Daryl, Michonne, and Carl. Each character has a unique special ability that helps them survive and score the most Walker kills.&#10;&#10;The game also features four important locations from the series, and you need to kill walkers to prevent your location from being overrun. Each location offers different strategies for wide-ranging game experiences, and by varying the number of locations in the game, you can adjust the game length from 15 to 45 minutes. This is a competitive dice game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Peasant Buffet",
        "description": "A cutthroat press-your-luck card game -- Gather your loot, survive, and doom your friends to be devoured by horrible monsters!&#10;&#10;Horrible monsters have attacked the village of Donteatus and they're eating all of the peasants within its borders! Take control of one of the scrambling survivors to collect as many goods from the town as you can before being devoured, but only one player will ultimately win.&#10;&#10;In Peasant Buffet, each player takes the role of a Peasant trying to survive the onslaught of monsters while collecting the items they desire. The player who collects the most of their goal items, before being eaten, wins!&#10;&#10;",
        "artist": "Jeremy Raab"
    },
    {
        "name": "Game Developerz",
        "description": "Game Developerz gives you the chance to build up your own studio and Company Cards represent the publisher your studio will be working for. They all have a special ability and they will provide you the Coinz you need to keep your business going.&#10;&#10;You will have to hire your own Staff in order to compose a solid Team. Staff Cards represent the people you can hire in your Team in order to complete your game. There are four Skills they can master: Game Design(GD), Art(ART), Programming(CODE) and Marketing(MKT). The sum of these Skills allows your studio to complete Features and develop a game. Some Staff cards might also have special abilities that you can use in your advantage.&#10;&#10;Business Development is something crucial if you want to be able to release your game, learn how to use your assets properly and how to manage your studio. Business Development Cards will do the dirty job for you!&#10;&#10;Finally you will be able to create the game you always dreamed of &hellip;Well.. Almost..!&#10;&#10;Features are the core of your videogame and your goal is to put together the best of them if you want to release a great game!&#10;&#10;During every game development something might go wrong or there could be unexpected surprises. These events are represented by the Random Event Cards. They might be good but they are usually very bad, so be ready!&#10;&#10;During the year Special Events might occur and your studio has the chance to earn important awards and be rewarded for its incredible job!&#10;&#10;It&rsquo;s hard to run your business if you don&rsquo;t have founds. In the game you can find 60 tokens representing the game currency known as Coinz. Your publisher will fuel you up with Coinz and you will have to use them consciously if you want to be the best.&#10;&#10;You'll have to collect as much Betascore as you can!&#10;&#10;Betascore is earned through completed Features and represents the score given by the critics and the audience of your game. Don't worry, even if your game was not so good, you will still be able to buy some journalists loyalty with the Coinz you saved at the end of the game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "KUNE v LAKIA: A Chronicle Of A Royal Lapine Divorce Foretold",
        "description": "Once upon a time, the royal wedding of Duke Kune and Princess Lakia brought joy and celebration to every warren in the Bunny Dutchy.&#10;&#10;Alas, for all the carrot cake that was consumed at the wedding was in vain. One day, a petty argument boiled over to a fight, and once the fight grew to the point that the royal guards had to be called in, there was no way to contain the situation. It was going to be Kune v Lakia!&#10;&#10;&#10;KUNE v LAKIA: A Chronicle Of A Royal Lapine Divorce Foretold is a game for two players, each acting for the Duke or the Princess during the divorce proceedings.&#10;&#10;A starting hand of five assets (manors, jewelry and abundant wealth) is drawn, and the players use those assets to influence members of the royal lapine court (the abbot, the sorceress, the duke's sister, the king, and the knight). The favors gained and plots hatched are represented by cards added to each player's deck. These cards can be used to further influence courtiers, hide property, and hinder the opponent's ability to do the same.&#10;&#10;Much like in a real-life divorce, this is a highly interactive process, and not an easy one at that. In a game of behind-the-scenes plotting and intrigue, only the most clever player will emerge victorious in the struggle for prestige, property and power!&#10;&#10;",
        "artist": "Krissorium,Sami Laakso,Todd Sanders"
    },
    {
        "name": "HoldFast: Russia 1941-1942",
        "description": "HoldFast: Russia 1941-42 is our strategic World War II game on the Russian Campaign.  It is the first of our Campaigns of World War II series.  It uses wooden blocks for fog of war and hex movement.  Clean mechanics and a manageable number of units allow for the entire campaign to be played in a evening.  Objectives are clear.  Hold two of the three victory location cities at the end of the game.  But with mud and supplies a constant factor, German armor always a threat,  and winter  bringing a boost to Russian resources and manpower, it is not easy for either side to HOLD FAST. &ldquo;The world will hold its breath&hellip;&rdquo;&#10;&#10;Holdfast Russia FAQ&#10;&#10;",
        "artist": "Sean Cooke"
    },
    {
        "name": "Specter Ops",
        "description": "A secret agent of A.R.K. has infiltrated a top secret Raxxon facility, attempting to complete three mission objectives before they escape &mdash; but they are hunted by genetically modified Raxxon Hunters. Players can choose which side they wish to join.&#10;&#10;Specter Ops is a sci-fi, stealth ops game of hidden movement that's similar to Scotland Yard. Players are trying to locate/capture a mysterious agent, who keeps track of their sneaking via a private map. The other players take control of unique characters who must use their wits, abilities and technology to help them hunt down this infiltrator. Items like flash grenades, scanners, and the like are at the disposal of this covert agent.&#10;&#10;",
        "artist": "Steven Hamilton,Emerson Matsuuchi,David Richards"
    },
    {
        "name": "Zombies Keep Out",
        "description": "It's bodge or get bitten in Zombies Keep Out when a giant mob of zombies attacks the goblins' workshop. Now it's up to you and the other bodgers to repel the undead or become a zombie's late-night snack!&#10;&#10;Barricaded in your workshop, you and your goblin cohorts must rely on your mechanical expertise to construct the sometimes ramshackle but always maniacal machines you'll need to overcome the endless Leapers, Creepers, Runners, and Brutes trying to break down your doors. Collect parts to build your machines as fast as you can, but don't get bitten &mdash; or else you'll be left moaning and groaning as you join the horde and turn on your friends!&#10;&#10;Zombies Keep Out is a fully cooperative board game for 1&ndash;6 players.&#10;&#10;",
        "artist": "Manny Trembley"
    },
    {
        "name": "Level 7 [Invasion]",
        "description": "The year is 2020. The world hovers on the brink of annihilation. Preceded by a devastating orbital attack, a warlike alien race known as the Hydra has besieged the planet, their invasion force carried on enormous drop ships that dwarf city blocks and rain devastation from above. The Hydra&rsquo;s ultimate goal is to eradicate the last survivors of their ancient nemesis, the Ghin, an alien race that has taken refuge on Earth. Humanity is caught in the apocalyptic crossfire. As widespread panic grips the populace, governments topple, economies crumble, and order dissolves. In these desperate days, mankind&rsquo;s only hope lies with the Ghin and one of their most brilliant minds: Dr. Cronos, a being as guilty of atrocities against humanity as those who hunt him.&#10;&#10;LEVEL 7 [INVASION] is a standalone semi-cooperative game of global strategy set in the LEVEL 7 universe that follows the events of LEVEL 7 [ESCAPE], LEVEL 7 [ESCAPE]: Lockdown, and LEVEL 7 [OMEGA PROTOCOL]. As the planet is battered by the Hydra's relentless assault, you'll control Earth's desperation-forged coalitions in an effort to turn back the invasion. But soldiers aren't enough. You and your allies must manage your resources carefully to combat the threats of hysteria, famine, and population loss as well. Endure long enough, and you might buy the time for Dr. Cronos to develop the advanced weaponry required to defeat the invading Hydra. The survival of the human race depends on your next move!&#10;&#10;",
        "artist": "Michael Jenkins"
    },
    {
        "name": "Dungeons & Dragons: Attack Wing",
        "description": "Dungeons &amp; Dragons: Attack Wing uses the core rule set of the FlightPath game system seen previously in Star Wars: X-Wing and Star Trek: Attack Wing, but with a Dungeons &amp; Dragons twist as the players now control dogfighting dragons, while also having forces on the ground such as giants and magic users. As with Star Trek: Attack Wing, the Dungeons &amp; Dragons: Attack Wing game series consists of a starter set and expansion packs.&#10;&#10;The Dungeons &amp; Dragons: Attack Wing &ndash; Starter Set includes three pre-painted dragons, maneuver dials, and upgrade cards and tokens.&#10;&#10;",
        "artist": "Raymond Swanland"
    },
    {
        "name": "Game of Thrones: Westeros Intrigue",
        "description": "Game description from the publisher:&#10;&#10;Game of Thrones: Westeros Intrigue is a fast-paced game of cards and intrigue at court, created by renowned game designer Reiner Knizia. Every game is played over a series of rounds, as you and your opponents play character cards in an attempt to claim the Iron Throne for yourselves.&#10;&#10;In each round, you pursue your own plans and seek to foil your opponents by playing character cards. Each turn, you will play a character card from your hand, adding to the court at King&rsquo;s Landing. You can advance your own prospects by playing your character cards cleverly, but certain rules govern exactly where you can place your character cards.&#10;&#10;The first character cards must be played in a single row, forming the bottom row of the court. Once there are two cards in a row, you may play a card in a new row above them. The card that you play in the new row, however, must match the House of one of the two cards below it. In Game of Thrones: Westeros Intrigue, character cards are divided between House Stark, House Lannister, House Baratheon, and House Targaryen, and each player may have character cards from any of these Houses in his hand.&#10;&#10;The court develops as you and your opponents play cards, but a player will eventually discover that he can no longer legally play a character card. Once this occurs, that player is eliminated and the round continues. A round ends when no one can play another character card, and whoever played the last character card wins the round. In Game of Thrones: Westeros Intrigue, you will play rounds equal to the number of players.&#10;&#10;If you win a round of Game of Thrones: Westeros Intrigue, you reap the rewards by drawing an Iron Throne card, which cancels a number of your penalty points. Your opponents, on the other hand, must take penalty points equal to the number of character cards that they have left in their hand. Over the course of the game, players gain penalty points from having character cards at the end of the round, and reduce their penalty points by winning a round and drawing an Iron Throne card. At the end of the game, the player with the least penalty points wins!&#10;&#10;",
        "artist": "Evan Simonet"
    },
    {
        "name": "Age of War",
        "description": "Age of War is a quick-playing game of conquest. Fourteen cards are laid out at the start of the game, each showing one castle and the symbols required to conquer this castle, with the symbols separated into battle lines. Each castle belongs to a clan, with some clans having only a single castle and some having up to four castles.&#10;&#10;A player starts his turn by rolling seven dice, the six sides of which show archery, cavalry, daimyo, and 1-3 infantry. He then selects a card and uses the symbols rolled to conquer exactly one of the battle lines on this card (by placing the appropriate dice on that line). If he can do this, he then rolls the remaining dice, ideally conquering another line; if he can't conquer a line, he removes one die from play, then rolls again. His turn ends when either he conquers every line on the card (in which case he claims it) or he no longer has dice available to roll.&#10;&#10;Each card is worth a number of victory points. You can conquer cards owned by other players, but you need to conquer an additional daimyo line in the process. If a player owns all the castles of one clan, however, those castles are secure and cannot be stolen. What's more, these castles are now worth more points because you've united the clan under one ruler (you) and strengthened your hold over Japan.&#10;&#10;When the last card is claimed, players tally their points, and whoever has the highest score wins.&#10;&#10;",
        "artist": "Simon Eckert,Tony Foti"
    },
    {
        "name": "Happy Birthday!",
        "description": "Happy Birthday! is the perfect game for a kid's party. &#10;Happy Birthday! gets kids laughing as soon as they open the box.  It's the hilarious game where kids give each other surprising gifts.&#10;&#10;How to Play&#10;Deal 5 Gift Cards to each player.&#10;&#10;1) When it is your turn, it is your birthday!  Everybody gives you a face-down Gift card from their hand.&#10;2) You shuffle the cards, turn them over one by one, and pick the gift you like the most, AND the gift you dislike the most.&#10;3) The players who gave you those gifts each get a point.&#10;4) Draw back up to 5 Gift Cards.  Play moves to the left.&#10;&#10;The first player to 5 points wins.  But the real goal is to have fun while learning about the gifts people love, and the gifts that they hate.  You'll be amazed at what you learn about your family!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Quarriors! Light vs. Dark",
        "description": "In Quarriors! Light vs. Dark, players take on the roles of Quarriors, mighty mystical warriors who have the power to capture dangerous quarry from the untamed Wilds! They must conjure the mysterious powers of Quiddity, cast powerful spells, and summon their creatures to battle if they hope to overcome rivals and earn their rightful place as the Champion!&#10;&#10;Quarriors! Light vs. Dark has the frenetic excitement of a dice battle game, with an added &quot;deckbuilding&quot; twist as players customize their dice pools during the game by using resources generated by their rolls.&#10;&#10;Quarriors! Light vs. Dark can be played as a standalone game or used as an expansion for the Quarriors! base game.&#10;&#10;",
        "artist": "J. Lonnee,Chris Raimo"
    },
    {
        "name": "Evolution",
        "description": "In Evolution, players adapt their species in a dynamic ecosystem where food is scarce and predators lurk.  Traits like Hard Shell and Horns will protect your species from Carnivores, while a Long Neck will help them get food that others cannot reach. With over 4,000 ways to evolve your species, every game becomes a different adventure.&#10;&#10;Evolution packs a surprising amount of variety for a game with simple rules.  The variety comes from the synergies between the trait cards and from the different personalities at the table.  Some players thrive on creating Carnivores to wreak havoc on their fellow players.  Others prefer to stay protected and mind their own business.  Evolution encourages both play styles by giving each of them multiple paths to victory.  And it is the mix of play styles at the table that ultimately determines the ecosystem in which the players are adapting.  So gather your friends and see who can best adapt to the changing world around them.&#10;&#10;&quot;The theme of evolution is not just tacked on: it drives play.&quot; - Nature (the world's most prestigious scientific journal)  &#10;Evolution was covered in the journal Nature.  The article was written by Stuart West, a Professor of Evolutionary Biology at the University of Oxford who has used Evolution in his undergraduate class.  &#10;&#10;     https://boardgamegeek.com/thread/1487263/evolution-and-other-evolution-themed-games-nature&#10;     https://boardgamegeek.com/thread/1580710/using-game-evolution-teach-evolution&#10;&#10;&#10;&#10;&#10;",
        "artist": "John Ariosa,Giorgio De Michele,Catherine Hamilton,Kurt Miller,Jacoby O'Connor"
    },
    {
        "name": "Tiny Epic Defenders",
        "description": "GENERAL INFO: Cooperative, 1-4 players, 30 minutes.&#10;THEME: Fantasy, set in the world of Tiny Epic Kingdoms.&#10;HOOK: Fast paced, portable co-op, with a unique turn-deck mechanic.&#10;WIN: Defeat the Epic Foe!&#10;LOSE: Let the Capital City get destroyed!&#10;STORY: After the Great War (Tiny Epic Kingdoms), many of the factions, shattered and defeated, looked for something to cling to. One final hope before the last of their race would flow like the river into the ocean of history, gone and forgotten. It was the sages of the Order of Gamelyn who answered their prayers. They provided a new perspective on unity, and a way of life that would welcome peaceful members of any faction. A utopia for all. With very few options and a will to survive, this world alliance became an inevitable truth in the eyes of many of the factions&rsquo; leaders. Even factions who hated one another had nothing left but each other. Under the guidance of the Order of Gamelyn, a Capital City was chosen and factions from all over the world came to call this city their new home. At last, the world was at peace&hellip; but not for long. A great storm is coming and in the darkness of the mist, there be demons.&#10;&#10;You have fought hard and established your Kingdom, but peace never lasts.&#10;&#10;Your scouts report that hordes of treacherous monsters is approaching the outskirts of your Capital City. If your Capital City falls you will lose everything, along with your Kingdom.&#10;&#10;Gather your friends and defend against the onslaught in this exciting and unpredictable cooperative micro-game!&#10;&#10;In Tiny Epic Defenders, players must select their classes and work together to defend against the evil horde and slay the Epic Foe.&#10;&#10;Will you take on the role of the Barbarian, the Sorcerer, the Cleric or the Warrior? Each class has a unique player power that you will need to use.&#10;&#10;In this fast-paced game, players will scramble between various regions outside their Capital City fighting off enemy hordes! Each region will offers unique properties that players must account for in their strategies.&#10;&#10;If your group is fortunate enough to defeat the wave of monsters, you may live long enough to face the Epic Foe! Which Epic Foe will it be? Will you be prepared!?&#10;&#10;Does your group have what it takes to survive? Will you have the skill to be crowned the Tiny Epic Defenders!?&#10;&#10;",
        "artist": "William Bricker,Darrell Louder,Ian Rosenthaler"
    },
    {
        "name": "Tokaido Collector's Edition",
        "description": "TOKAIDO is a game for 2 to 5 players, with unique atmosphere and aesthetics, in which the players are pilgrims on a journey along the legendary East Sea Road of Japan. Along the way, you will try to collect the most beautiful souvenirs, discover glorious vistas, enjoy enriching encounters, soak in soothing hot springs, sample sumptuous cuisine, and much more! Because the Collector&rsquo;s Edition will incorporate the already famous &ldquo;Crossroads&rdquo; expansion, it allows you to savor your journey even more while unveiling new secrets such as lucky charms, lovely calligraphy, or you can even try your luck in the Yakuza game rooms.&#10;&#10;With unrivaled setting and aesthetics, TOKAIDO transports you, your family, and your friends to Japan. For all ages: From the youngest to the most experienced, everyone can gather for an ever-fresh gaming experience; it is extremely easy to get started, thanks to its fluid, simple, and tactical rules.&#10;&#10;Although TOKAIDO has been acclaimed for its design and artistic qualities ever since its initial release, we at FUNFORGE never settle for just &ldquo;good&rdquo;: We are always thinking of how we can do &ldquo;better&rdquo;.&#10;&#10;After more than a year of discussions with enthusiastic players, who are always asking for more, we decided to transform this work of art into a masterpiece. This long period of reflection has allowed us to design a very unique edition that keeps the advantages of the classic edition, but adds plenty of elements that will make it an exceptional game.&#10;&#10;Kickstarter Yakuza/Pilgrim Level- This game contains 34 character tiles (Tokaido + Crossroads + Kickstarter characters) and 16 unpainted miniatures&#10;Kickstarter Ronin Level- This game contains 35 character tiles (Tokaido + Crossroads + Eriku + Kickstarter characters) and 17 unpainted miniatures +4 Encounter Cards&#10;Kickstarter Samurai Level- This game contains 35 character tiles (Tokaido + Crossroads + Eriku + Kickstarter characters) and 35 painted miniatures +4 Encounter Cards&#10;&#10;",
        "artist": "Xavier Gueniffey Durin"
    },
    {
        "name": "Korrigans",
        "description": "Each player in Korrigans has two korrigans (a.k.a. fairies or spirits) and must use them to move about the landscape, claim animal tokens in order to access other parts of the land, and eventually find the pot of gold that will become visible once the rainbow's location is revealed.&#10;&#10;In more detail, players take their first two turns to place their korrigans on the game board; with each korrigan you place, you look at the tokens in that location and keep one of them. These tokens show either gold (which possibly gives you points at the end of the game) or an animal (which allows you to pass through gates that bear that animal to reach a different landscape). From the third turn on, players use their animal tokens to move their korrigans and pick up more tokens. Each round the player holding the bag draws a rainbow token and places it in one of the rows or columns on the board; this means that the pot of gold won't appear in this row or column in the final part of the game.&#10;&#10;Once the gold is finally placed on the game board, players have a final round in which they try to reach the pot with their korrigans. If a player reaches the pot with one korrigan, he scores 10 points and if both of his korrigans reach the pot he scores 15 points. Whoever has the highest score wins!&#10;&#10;",
        "artist": "Olivier Fagnère"
    },
    {
        "name": "Inis",
        "description": "Inis is a game deeply rooted in Celtic history and lore in which players win by being elected King of the Island (Inis). Players can try to achieve one of three different victory conditions:&#10;&#10;&#10;     Leadership: Be the leader &mdash; i.e., have more clan figures than any other player &mdash; of territories containing at least six opponents' clans.&#10;     Land: Have your clans present in at least six different territories.&#10;     Religion: Have your clans present in territories that collectively contain at least six sanctuaries.&#10;&#10;&#10;Over the course of the game, players also earn deeds, typically chanted by bards or engraved by master crafters, that reduce by one the magic total of six for any condition. While one victory condition is enough to claim the title of King, a game of experienced players usually has a tight balance of power, emphasizing the leadership of the capital of the island.&#10;&#10;At the start of each round, players draft a hand of four action cards (with 13 action cards for three players and 17 for four players) during the Assembly. Action cards not played at the end of one season are not held for the next. Players also have access to leader cards for the territories that allow it and where they were elected leader during the assembly. Each Assembly reallocates those cards. Finally, they collect &quot;epic tales&quot; cards that depict the deeds of the ancient Irish gods and heroes, like Cuchulainn, the Dagda, Lugh and many others. These will be kept and used to inspire the clans and achieve extraordinary feats...under the right circumstances. The cards provide a variety of actions: adding clans, moving clans, building/exploring, and special actions.&#10;&#10;Careful drafting, hand management, bluffing (especially once players understand the importance of passing their turn), good timing, and a precise understanding of the balance of power are the keys to victory. After a discovery game you'll be ready for a full and epic game, where an undisputed player will be king by the Assembly for his merit and wisdom.&#10;&#10;While Inis has &quot;dudes&quot; that are &quot;on a map&quot;, it's a beginner's mistake to play this as a battle game because eliminating other clans reduces your chances of scoring a Leadership victory condition. Peace among different clans, with or without a clear territory leader, is the usual outcome of a clan's movement. Battles will occur, of course, as the Celtic clans can be unruly and a good player will listen to his clan's people (i.e., his hand of cards). That battle aspect is reflected in the clan's miniatures representing warriors. Woodsmen, shepherds and traders complete the set of twelve minis for each player; these occupations have no impact on the game, but give it flavor.&#10;&#10;",
        "artist": "Dimitri Bielak,Jim Fitzpatrick"
    },
    {
        "name": "Krosmaster Junior",
        "description": "A simpler version of Krosmaster: Arena, aimed at younger players (ages 7+), and targeted for mass market sale.  The game will include four new character figures, simplified rules, and progressive scenarios, much like the Krosmaster: Arena rulebook.  The box includes 2 double sided game boards, 30 XL scenario cards, the figures and Krosmaster cards for those figures, and a Krosmaster membership card for players to start an online account. The figures can also be used in the Krosmaster: Arena game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Krosmaster: Quest",
        "description": "Unlike the head-to-head battles of Krosmaster: Arena, Krosmaster: Quest can be played &quot;cooperatively&quot; (with one player as the &quot;demon&quot; and the rest of the players working together), or as a competition as players look for treasures on tiled boards. The box includes seven new Krosmaster figures with character cards (two exclusive), more than 600 pieces, 16 terrain parts (which can be used in Arena), more than 40 settings, and 6 special dice.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Power Grid Deluxe: Europe/North America",
        "description": "Power Grid deluxe: Europe/North America is a standalone game in the Power Grid universe.&#10;&#10;For the 10th anniversary of the highly successful game Power Grid we present this new deluxe version including brand new components. Wait for a huge double-sided game board presenting Europe and North America, newly customized wooden parts and an entire deck of new power plants, some of which use natural gas instead of garbage. New overview cards for the resource refill improve game play. An exciting new two players experience is also added - &ldquo;Against the Trust&rdquo;!&#10;&#10;The game is still Power Grid, with all the exciting auctions, the nerve-wracking resource speculations, city networks and the competition among the players, all the way to the tight game ending with several players fighting for the win.&#10;&#10;The goal of Power Grid Deluxe is to supply the most cities with power when someone's network reaches a predetermined size. Players mark pre-existing routes between cities for connection, then bid against each other to purchase the power plants that they need to power these cities. However, as power plants are purchased, newer, more efficient plants become available, so by merely purchasing, you're potentially allowing others access to superior equipment.&#10;&#10;What's more, players must acquire the resources (coal, oil, natural gas, and uranium) needed to power said plants (except for the &quot;renewable&quot; windfarm plants, which require no fuel), making it a constant struggle to upgrade your plants for maximum efficiency while still retaining enough wealth to quickly expand your network to get the cheapest routes.&#10;&#10;",
        "artist": "Harald Lieske"
    },
    {
        "name": "Harbour",
        "description": "Dockmaster Schlibble and Constable O'Brady cordially invite you to visit their bustling Harbour town! Attend to business at the Trader's Guild or the Masoner's Hall. Break for lunch at the Sushi Shop, or stop off for a drink at the Pub. Don't forget to check out the Wizard's Traveling Imaginarium before you go! But no matter where you go, keep on the lookout for a bargain... the denizens of this town are always wheeling and dealing! Collect and trade resources as you visit the various buildings of Harbour, and cash them in to buy your way into the town. Whoever has the most points worth of buildings when the game ends, wins!&#10;&#10;Harbour is a worker placement game where players move their worker from building to building, collecting and trading Fish, Livestock, Wood, and Stone; and cashing those resources in to purchase buildings (which are the worker placement spots) from the central pool. Once a building is purchased, it is replaced from the deck, and the central pool is a small subset of the deck, and is therefore different every game.&#10;&#10;The game ends when a player has purchased his fourth building. After that round finishes, the player with the most points worth of buildings is the winner!&#10;&#10;At the heart of Harbour is a dynamic market mechanism. Each time a player purchases a building, the value of the resources they used drops, while the value of the other resources rise. You'll have to carefully time your purchases to take advantage of the ebb and flow of market prices, or be prepared to waste some resources!&#10;&#10;",
        "artist": "Max Holliday,Rob Lundy"
    },
    {
        "name": "Abyss",
        "description": "The Abyss power is once again vacant, so the time has come to get your hands on the throne and its privileges. Use all of your cunning to win or buy votes in the Council. Recruit the most influential Lords and abuse their powers to take control of the most strategic territories. Finally, impose yourself as the only one able to rule the Abyssal people!&#10;&#10;Abyss is a game of development, combination and collection in which players try to take control of strategic locations in an underwater city. To achieve this, players must develop on three levels: first by collecting allies, then using them to recruit Lords of the Abyss, who will then grant access to different parts of the city. Players acquire cards through a draft of sorts, and the Lords of the Abyss acquired on those cards grant special powers to the cardholder &mdash; but once you use the cards to acquire a location, that power is shut off, so players need to time their land grabs well in order to put themselves in the best position for when the game ends.&#10;&#10;",
        "artist": "Xavier Collette"
    },
    {
        "name": "Mound Builders",
        "description": "Mound Builders, from the Charles S. Roberts Award-winning design team of Wes Erni and Ben Madison at Victory Point Games, is a solitaire States of SiegeTM game where you represent the two largest pre-Columbian Indian &ldquo;mound builder&rdquo; cultures that dominated eastern North America from before the time of Christ until the coming of the European colonists in the 17th century. Your empire represents the earlier Hopewell culture and the later Mississippian culture that derived from it.&#10;&#10;Until the arrival of the Spanish late in the game, you will expand your control across the map of North America, extending it over the various chiefdoms encountered and incorporating them into your economic and religious sphere (&ldquo;empire&rdquo;). Your domain will grow and shrink, but be aware that rather than a military advance and retreat, this process represents the rise and decline of culture, religious ideology, and an economic way of life, threatened from outside by competing ideologies and lifestyles as much as by hostile armies.&#10;&#10;Your goal is to extend Mound Builder culture and amass as many chiefdoms as possible before rival native powers (and the smallpox-ridden Spanish!) rise up to drive you back to your Mississippi River heartland and extinguish your vast capital city at Cahokia, Illinois &ndash; near modern St. Louis.&#10;&#10;What's In The Box?:&#10;&#10;&bull;    One 32-page full color Rules booklet&#10;&bull;    One 11&quot; x 17&quot; map&#10;&bull;    49 thick, laser-cut, multi-shaped counter pieces (minor assembly required)&#10;&bull;    50 History cards&#10;&bull;    One player aid&#10;&bull;    One six-sided die&#10;&bull;    One 11&rdquo; x 17&rdquo; mounted, jigsaw-cut game map&#10;&bull;    One bright red, 9 1/4&quot; x 5 7/8&quot; Standard cardboard VPG game box&#10;&bull;    One beautiful box cover sleeve&#10;&bull;    One &quot;Wipes-A-Lot&quot; napkin&#10;&bull;    One charcoal desiccant packet&#10;&#10;",
        "artist": "Tim Allen,Michelle Ball"
    },
    {
        "name": "Imperialism: Road to Domination",
        "description": "Imperialism: Road to Domination approximately covers the period from the 15th to the 19th century. The players control superpowers and attempt to transform them into mighty empires. To accomplish this, they will not only have to look after the economic growth and try to gain social and civilization achievements, but also modernize and expand their fleet and land army. Because being at war is expensive, it is often wiser to resort to plots and lies. Sometimes, making empty promises by negotiating tables is better than getting involved into a risky and exhausting war, which may empty the treasury and expose you to losing the precious prestige. The players have to pay extra attention to the dissenters who, especially in the beginning of the game, have greater military power and will not hesitate to draw others into a religious war. Will you manage to create an enormous colonial empire, military European dominium, or a small territorially but strong economically country? The player&rsquo;s choices, luck, and reactions of others will affect the struggle. Creating an empire requires good strategic sense and flexible approach to the current military and economic situation. The players have to forge thoughtful alliances and avoid wars which they may not win.&#10;&#10;The aim of the game is to create the most powerful empire. To achieve this, the players will change the reigning rulers, brew plots, conspire, conquer minor countries and overseas lands which will increase the level of goods production in their empire. The players will have to expand their armies and fleet to confront other superpowers. The player with most glory points wins.&#10;&#10;",
        "artist": "Katarzyna Fic"
    },
    {
        "name": "Ucho Króla",
        "description": "Rumors say that the superintendent of finances on the king's court is in poor health and will soon pass away. The new vacancy could be really appealing, but only one person will be needed to fill the position of the deceased superintendent. It is the best time for a secret confrontation to begin. In Ucho Kr&oacute;la (a.k.a. King's Ear), the deceitful courtiers will do everything they can to pin back their competitor's ears and improve their position in the eyes of the King. No holds barred! Each struck at opponent's delicate place, every plot and prompt to the right ears will bring you closer to the coveted goal. Every sarcasm, irony or cutting retort to someone's machinations should cut like a rapier to pave the way to even bigger riches. The title of superintendent will provide unlimited access to the King's treasury from which something may disappear...not only for satisfying the King's needs.&#10;&#10;The aim of the game is to get most prestige points by weaving intrigues, ruining the authorities of other players and demonstrating tact and good manners.&#10;&#10;",
        "artist": "Sylwia Smerdel"
    },
    {
        "name": "A Fistful of Dinero",
        "description": "The year is 1886 in a small forgettable hovel of a town on the border of nowhere. Several unscrupulous individuals come together for a hand of poker over a pile of cash. A whispered accusation of chicanery crosses the table and irons are yanked from holsters. The sparse crowd dives for cover and lead arcs towards flesh, the saloon aching for a fresh coat of crimson.&#10;&#10;A Fistful of Dinero, the first game published by Magic House Games, is a card game for 3-6 players set in the wild west. After a poker game goes terribly wrong, players draw their weapons, make a quick grab for the cash, throw chairs, dive for cover, and do everything they can to be the richest gunslinger &mdash; or just the last man standing...&#10;&#10;At the start of a round, players draft cards and place (program) them in one of three slots. Then in player order, players reveal the first slot and take one of the two available actions. Players can fire their weapons, hide beyond cover, switch weapons, grab money, etc. Players also have the opportunity to &quot;throw&quot; chairs or other items (cards) onto an opponent's player board to do additional damage.&#10;&#10;The game ends in two ways: If a player takes five points of damage, he's dead and out of the game, with the last man (or woman!) standing winning it all. Alternatively, if the pot of dinero ever runs out, the richest outlaw wins.&#10;&#10;Highlights Include:&#10;-Card Drafting with Conflict&#10;-Action Programming&#10;-Completely unique cover system based on seating location&#10;-Literally throw chairs, tables, knives, tomahawks, and dynamite at your opponents by physically tossing cards&#10;-Descriptive wounds with story flair and lasting repercussions&#10;-Intense narrative that unfolds organically from actions performed (heavily inspired by the classic Avalon Hill game Gunslinger)&#10;&#10;",
        "artist": "Mark Sellmeyer"
    },
    {
        "name": "Sons of Anarchy: Men of Mayhem",
        "description": "Based on the hit TV series, in Sons of Anarchy: Men of Mayhem players take the role of rival gangs out to control territory, accumulate contraband and reap the monetary rewards of illegal enterprise.&#10;&#10;With each turn gangs must attempt to control a range of sites by assigning gang members and resources to claiming, defending and fighting for money, contraband and guns. However, other players can challenge the right for territory, which will lead to conflict! Negotiate, threaten and ally with rival gangs when it serves your needs, but be wary of the inevitable knife in the back. This game is about making and breaking alliances, and only the gang with the most money at the end of six rounds wins.&#10;&#10;COMPONENTS&#10;Early copies of SoA: Men of Mayhem included a manual listing incorrect component counts. The corrected component counts are:&#10;&#10;4 Clubhouse cards (1 per player)&#10;4 Player blinds (1 per player)&#10;4 Dice (1 per player)&#10;20 Members (5 per player)&#10;20 Prospects (5 per player)&#10;&#10;24 Site Tiles&#10;36 Anarchy Cards&#10;4 Hardcore Anarchy Cards (identifiable by a red border)&#10;136 Cash&#10;34 Order tokens&#10;16 Heat tokens&#10;24 Contraband&#10;24 Guns&#10;1 Reaper Patch&#10;&#10;NOTES&#10;&#10;+  Due to a packing error many first print copies of the game are missing a reference card, 'The Black Market'. You can find the PDF for this card in the files section of this page. The missing card also comes in both the Sons of Anarchy: Men of Mayhem &#226;&#128;&#147; Grim Bastards Club Expansion and Sons of Anarchy: Men of Mayhem &#226;&#128;&#147; Calaveras Club Expansion.&#10;&#10;+  First print copies of SoA: Men of Mayhem include a promo Clubhouse Card for the 'Grim Bastards' Motorcycle Club, which can be used as a substitute for one of the other playable gangs. This promo is also now available as part of a full 5th player expansion in the Sons of Anarchy: Men of Mayhem &#226;&#128;&#147; Grim Bastards Club Expansion.&#10;&#10;",
        "artist": "Katie Dillon,Charles Woods"
    },
    {
        "name": "Snake Oil: Party Potion",
        "description": "In the Old West, the wily snake oil salesman had a special talent, getting the most skeptical customers to buy the most dubious products. Now it's your turn! Invent your own zany two-word products &ndash; Rumor Mirror! Burp Balloon! &ndash; and sell them to all types of wacky customers. If the round's customer buys your product, you win!&#10;&#10;To set up Snake Oil: Party Potion, each player takes six purple word cards. The customer for the round draws a customer card and announces it. Inventors quickly combine two purple word cards from their hand to form a crazy new product to sell to that customer. When ready, each inventor quickly pitches his or her product directly to the customer. The customer can end any pitch that goes longer than thirty seconds. The customer decides which product to buy and gives the inventor of that product the round's customer card as the prize. Inventors discard all used word cards and take two new word cards each. The player to the left of the customer becomes the next round's customer. Play repeats until each player has been the customer once.&#10;&#10;Whoever collects the most customer cards wins.&#10;&#10;Integrates with:&#10;&#10;&#10;    Snake Oil&#10;    Snake Oil: Elixir&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Snake Oil: Elixir",
        "description": "In the Old West, the wily snake oil salesman had a special talent, getting the most skeptical customers to buy the most dubious products. Now it's your turn! Invent your own zany two-word products &ndash; Rumor Mirror! Burp Balloon! &ndash; and sell them to all types of wacky customers. If the round's customer buys your product, you win!&#10;&#10;To set up Snake Oil: Elixir, each player takes six purple word cards. The customer for the round draws a customer card and announces it. Inventors quickly combine two purple word cards from their hand to form a crazy new product to sell to that customer. When ready, each inventor quickly pitches his or her product directly to the customer. The customer can end any pitch that goes longer than thirty seconds. The customer decides which product to buy and gives the inventor of that product the round's customer card as the prize. Inventors discard all used word cards and take two new word cards each. The player to the left of the customer becomes the next round's customer. Play repeats until each player has been the customer once.&#10;&#10;Whoever collects the most customer cards wins.&#10;&#10;Integrates with:&#10;&#10;&#10;    Snake Oil&#10;    Snake Oil: Party Potion&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Dark Age Z",
        "description": "In the ancient world, kingdoms fought for control of medieval earth. For decades, fierce wars broke out and in combat after combat, deaths tolled thousands, in battles and massacres with no sign of peace. In one of these battles, the sky suddenly roared and the earth broke open abruptly, unleashing countless swarms of zombies of the modern world that rushed in from the unearthly crevice. The sudden invasion of these monstrous creatures brought unprecedented threat to the entire world. With their highly infectious ability and agility, the zombies rapidly broke out and were quickly becoming unstoppable. To avoid annihilation, all kingdoms were forced to set aside their long hatred towards each other and joined the line to fight for the survival of mankind.&#10;&#10;Dark Age Z is a strategic board game for 2 to 5 players. You are one of the kings in the Dark Age. All players strive to gain as many victory points (VP) as possible by killing the zombies that attack the Frontiers of the Kingdom Cities. At the end of the game, the player with the highest VPs wins the game.&#10;&#10;",
        "artist": "Anakin Man"
    },
    {
        "name": "Regular Show Fluxx",
        "description": "Like Fluxx, Regular Show Fluxx is a card game in which the cards themselves determine the current rules of the game. By playing cards, you change numerous aspects of the game: how to draw cards, how to play cards, and even how to win.&#10;&#10;At the start of the game, each player holds three cards and on a turn a player draws one card, then plays one card. By playing cards, you can put new rules into play that change numerous aspects of the game: how many cards to draw or play, how many cards you can hold in hand or keep on the table in front of you, and (most importantly) how to win the game.&#10;&#10;Regular Show Fluxx features characters and situations from the Regular Show animated series on Cartoon Network.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Deception: Murder in Hong Kong",
        "description": "Deception: Murder in Hong Kong is a game of deduction and deception for 4-12 players that plays in about 20 minutes.&#10;&#10;In the game, players take on the roles of investigators attempting to solve a murder case &ndash; but there's a twist. The killer is one of the investigators! Each player's role and team are randomly assigned at the start of play and include the unique roles of Forensic Scientist, Witness, Investigator, Murderer, and Accomplice. While the Investigators attempt to deduce the truth, the murderer's team must deceive and mislead. This is a battle of wits!&#10;&#10;The Forensic Scientist has the solution but can express the clues only using special scene tiles while the investigators (and the murderer) attempt to interpret the evidence. In order to succeed, the investigators must not only deduce the truth from the clues of the Forensic Scientist, they must also see through the misdirection being injected into the equation by the Murderer and Accomplice!&#10;&#10;Find out who among you can cut through deception to find the truth and who is capable of getting away with murder!&#10;&#10;Roles&#10;&#10;Forensic Scientist x1&#10;As the game master, the Forensic Scientist holds the solution to the crime. They are responsible for assisting the Investigators in identifying the &ldquo;Key Evidence&rdquo; and &ldquo;Means of Murder.&rdquo; When an Investigator does that successfully, the crime is solved and the Forensic Scientist and the Investigators win the game.&#10;&#10;During the game, the Forensic Scientist is NOT allowed to hint to the solution with words, gestures, or eyes.&#10;&#10;Murderer x1&#10;When the crime takes place, the Murderer chooses 1 Clue card and 1 Means card as the solution to the crime. These will be the &ldquo;Key Evidence&rdquo; and &ldquo;Means of Murder&rdquo; respectively.&#10;&#10;The Murderer tries to hide their role and look for a scapegoat. Even if they are identified, the Murderer still wins the game if no one correctly identifies both the &ldquo;Key Evidence&rdquo; and the &ldquo;Means of Murder&rdquo;.&#10;&#10;Investigators x8&#10;To solve the crime, the Investigators must analyze the hints given by the Forensic Scientist. As long as one of the Investigators correctly identifies both the &ldquo;Key Evidence&rdquo; and &ldquo;Means of Murder,&rdquo; the Murderer is arrested and the Investigators win the game (as does the Forensic Scientist).&#10;&#10;Bear in mind that the Murderer (and sometimes Accomplice) is among the Investigators! The innocent Investigators must make a vigorous effort to defend themselves from false accusation.&#10;&#10;Accomplice x1&#10;The Accomplice is an optional role for games with six or more players. The Accomplice knows who the Murderer is, as well as the solution to the crime. The Accomplice and Murderer both win if the Murderer gets away with his crime.&#10;&#10;Witness x1&#10;The Witness is an optional role when playing with six or more players.* The Witness is an Investigator who has witnessed the culprits leaving the crime scene. They have no way of knowing which is the Murderer and which is the Accomplice and they do not know how the crime was committed.&#10;&#10;If the Murderer is arrested but can identify the Witness, the Witness is considered to be killed, allowing the Murderer and the Accomplice to get away with murder and win the game.&#10;&#10;",
        "artist": "Ben Carre,Tommy Ng,Ari Wong"
    },
    {
        "name": "Happy Pigs",
        "description": "As pig farmers in Happy Pigs, players compete on raising healthy pigs by executing strategic combinations of &ldquo;Actions&rdquo; (Feed, Mate, Purchase, and Sell) and &ldquo;Tools&rdquo; (Vaccines, Nutritional Supplements and Birth Amulets) for each round. Both the frequency to take these &ldquo;Actions&rdquo; and the number of &ldquo;Tools&rdquo; a player can purchase are restricted by the number of players choosing to take the same action in any given round. Also, from time to time there are unexpected events (such as Pig Shows and Sausage Fest) which offer players great opportunities to outperform their peers.&#10;&#10;There are four rounds to each season, and all unvaccinated pigs die at each season change. The game concludes at the end of four seasons, when all pigs are sold off at different prices in accordance with their sizes. The player with the highest profit at the end wins the game.&#10;&#10;",
        "artist": "Biboun"
    },
    {
        "name": "Eggs and Empires",
        "description": "Eggs from the dragons of Ridback Mountain are valuable &mdash; not quite as valuable as gold following the last market fluctuation, but still TOTALLY worth the hassle, especially since it's not like YOU are climbing the mountain and searching through dragon caves. That's what peasants are for...&#10;&#10;All the empires have sent their intrepid adventurers out to collect eggs, but not all will succeed! It gets crowded on Ridback Mountain, and there are only so many dragon eggs to go around &mdash; not to mention that the dragons have started mixing exploding eggs into their nests, and those hurt.&#10;&#10;In the fast-playing card game Eggs and Empires, players use matching decks of empire cards that contain adventurers numbered 1-10. Starting with a hand of three empire cards, each turn all players select one card from their hand, then play them simultaneously in an attempt to collect egg cards. Typically, the player who played the highest empire card chooses an egg first, then the player with the second highest empire card, and so on until all revealed eggs are collected, if possible. However, each empire card has a unique power that can affect the order in which eggs are selected. The powers interact in strategic and awesome ways so that every hand is exciting and fun!&#10;&#10;Outwit your opponents to collect as many good eggs as possible &mdash; that is, ones worth victory points (VPs) &mdash; while avoiding those nasty exploding eggs! Whoever collects the most VPs over three rounds wins.&#10;&#10;",
        "artist": "Cristian Chihaia"
    },
    {
        "name": "Foretold: Rise of a God",
        "description": "Foretold is a turn-based strategy game for 2-4 players. Play features Cards (Faithful, Fate Cards and Relics) and Tiles (Temple) acquired through a central Marketplace board. Games feature a period of economic build-up, preparation for combat, then Raiding and end-game. Players will align with one of four unique Fate Decks, boosting replay value and interaction. Craftiness, table politics and strategic play determine the winner. &#10; Overview:&#10;Players take on the role of an aspiring deity. They must build up a Temple, gather Faithful followers and collect powerful Relics in an attempt to wipe their opponents off the map &ndash; only one deity can reign eternal in this free-for-all of legendary proportions!&#10;&#10;Play Time: &#10;2 players (1-hour), 3 players (1.5 hours), 4 players (2-2.5 hours)&#10;&#10;Basic Play: &#10;&#10;    Play follows a 4-step turn: Reveal (start), Marketplace (buy), Raid (combat), Reinforce (end). &#10;    The Tile Deck, Faithful Deck and Relic Deck feed into a central board called the Marketplace. &#10;    Players use Faithful (human followers) in their Temple to collect gold and defend in combat. &#10;    Faithful placed in the Raiding Party can attack opposing Temples during combat. &#10;    Relics (4 of which are aligned to each Fate) further increase strategic play and add variety. &#10;    Players will purchase Tiles from a randomized stack (the Tile Deck) to customize their Temple, which is then arranged strategically to increase hand-size and defenses. &#10;    The four fates are: Chaos, Grace, Prosperity and Wisdom, each tailored to a unique play-style. &#10;    Each Fate Deck has a powerful set of 20 different cards, in theme with each of the Fates. &#10;&#10;&#10;&#10;&#10;Combat: &#10;A Raiding Party ventures into an opposing Temple, encountering Defenders and Traps along a Tile path  to the Heart of the Temple, where the opposing life force dwells. Combat is resolved through dice rolls, with Defense rolling first and combining its total. Faithful played from the Raiding Party must beat defending total or they are forced to retreat. If the Temple is conquered, damage is dealt through Smiting. When an opponent&rsquo;s life hits zero (20 max), they are defeated. The last remaining player has achieved immortality!&#10;&#10;",
        "artist": "Garrett Post"
    },
    {
        "name": "Apex Theropod Deck-Building Game",
        "description": "Game Description:&#10;&#10;Apex is a deck-building game, played solo or with up to 5 friends. You play as a prehistoric predator competing for territory and resources against other predators. Each playable species has a unique deck to master.  Each deck has different strengths, weaknesses, and strategies&mdash; creating a varied and constantly evolving experience.&#10;&#10;Your species must overcome a very brutal environment including harsh climate changes, disease, attacks from predators, grievous wounds, infections, and deadly prey. The game incorporates many dinosaurs that behave in their own distinct way. The goal of the game is to endure the environment, build up the population and evolve your species, and become the apex predator.&#10;&#10;Base Game includes:&#10;&#10;&bull;   17&quot; Dinosaur size box&#10; &bull;   525 cards + 20 Card Dividers&#10; &bull;   24&quot; x 16&quot; Hunting Grounds game board&#10; &bull;   Six 16&quot; x 9&quot; Nesting Grounds mats&#10; &bull;   80mm T.rex miniature Player Marker&#10; &bull;   40pg Rulebook&#10; &bull;   5 Foam Blocks to protect cards and fill empty spaces&#10;&#10;Includes 7 Playable Apex Decks:&#10;&#10;&bull;   Acrocanthosaurus&#10; &bull;   Carnotaurus&#10; &bull;   Giganotosaurus&#10; &bull;   Spinosaurus&#10; &bull;   Tyrannosaurus&#10; &bull;   Utahraptor&#10; &bull;   Velociraptor&#10;&#10;The 525 cards includes 7 playable Apex Decks, 22 diverse animals to hunt, 11 dangerous carnivores, 8 opposing Boss cards with Minions (acts as artificial players for solo play), 11 environmental effects, 5 genetic evolution types, and 3 grievous wound types.&#10;&#10;Previous Version Published (NOT TO BE CONFUSED WITH BASE GAME):&#10; &bull;  Exotic Predators Limited Edition (see separate entry for details)&#10;&#10;Note to fans:&#10;&#10;The dinosaurs and events in Apex are not 100% based on fact. Apex is a mix of old and new dinosaur culture and some things were just changed to enjoy the game more. Please forgive us for any inaccuracies you find in Apex and it is not designed to educate.&#10;&#10;Beta Tester list:&#10;&#10;Anthony Sato, Erich Hartsock, Keith Neemann, Ramon Wallace, Sean Donaldson, Dennis Lenusters, Jeremy Mohler, Mike Paschal, Jonathan Venezian, Stephen Hill, Chris Gunning, Cody Bridges, Kevin, Christopher Crowell, Thomas Prentice, Baldur, Matthew, Nathaniel Graham, Chris Pienta, Christopher Lambson, Joseph Avery, David Schreiber, Tyler Howsare, Matthew Sauerbrunn, Denis Durand, Daniel Goldman, Aaron, Teresa Phillips, Collin Shorette, NVS Gameplays, Gergorian, Scott Lenet, Adherbal Junior, Corey Punko, Scott Sexton, Cyn, Matt Schock, Kyle Collins, Jack, Tom Hoefle, Jason Lesovoy, Kristian, Ekky-Bear, Ryan Mrochuk, Deon Beswick, Tim Long, Chen Weiyu, Brandon Lane, Nicholas Rusak, Nicholas Miesmer, Nicholas Rusak, Jacob Carter, Gabriel Marquez, James Dundas, S Williams, Tremane Barclay, George Bracy, Nathaniel Walter, Jason Wright, Chris Murphy, and all other testers!&#10;&#10;Microbadges&#10;&#10; Apex Theropod fan&#10;&#10; - Apex Theropod Deck-Building Game fan&#10;&#10;",
        "artist": "Herschel Hoffmeyer"
    },
    {
        "name": "Onirim (second edition)",
        "description": "You are a Dreamwalker, lost in a mysterious labyrinth, and you must discover the oneiric doors before your dreamtime runs out &ndash; or you will remain trapped forever!&#10;&#10;You may wander through the chambers of dreams, hoping that chance will reveal the doors, or you can linger in each type of room. In both cases, you will have to deal with the slithering Nightmares, which haunt the hallways of the labyrinth.&#10;&#10;Onirim is a solo/cooperative card game. You (and a partner, if you wish) must work (together) against the game to gather the eight Door cards before the deck runs out; you can obtain those Door cards either by playing cards of the same color three turns in a row, or by discarding (under specific circumstances) one of your powerful Key cards. In both cases you will have to decide the best use of each card in your hand and carefully play around the Nightmares. Those cards are hidden in the deck and will trigger painful dilemmas when drawn...&#10;&#10;Seven mini-expansions, all standalone and compatible with one another, are included with the second edition of Onirim, including these three that were in the first edition of the game:&#10;&#10;&#10;    &quot;The Towers&quot; introduces a new type of card that allows more searching and deck manipulation, while also imposing an additional victory condition.&#10;&#10;&#10;&#10;    &quot;Happy Dreams and Dark Premonitions&quot; adds evil time bombs that will impede your progress at predictable moments of your quest as well as helpful but unreliable allies.&#10;&#10;&#10;&#10;    In &quot;The Book of Steps Lost and Found&quot;, you must find the eight Door cards in a randomly given order and may remove discarded cards from the game to cast powerful spells that will help you complete this difficult task.&#10;&#10;&#10;Apart from these three from the first edition, there are four new modules in the Onirim 2nd edition box. Just like previously, each module consists of something that makes the game easier and something that makes the game harder:&#10;&#10;&#10;    &quot;The Glyphs&quot; introduces a fourth symbol on location cards (apart from Key, Sun and Moon), which makes it easier to compose the row of unrepeated symbols. Player must then find one extra door of each color (so 12 doors in total) to win&#10;&#10;&#10;&#10;    &quot;The Dreamcatchers&quot; are four cards that &quot;guard&quot; the Limbo piles. The Limbo pile stays with Dreamcatcher until some effect allows the player to shuffle the pile back to the deck... if all Dreamcatchers are full and new cards should come to Limbo, a Dreamcatcher is discarded and his cards shuffled back. Also, four new &quot;Lost Dreams&quot; cards are supposed to be in Limbo at the end of the game, as an extra winning condition - so discarding all Dreamcatchers means loss.&#10;&#10;&#10;&#10;    &quot;The Crossroads and Dead Ends&quot; introduce location cards with a given symbol (3 Sun, 2 Moon, 1 Key), but serving as any color &quot;joker&quot;. It also contains 10 &quot;Dead End&quot; cards, that remain in players hand (un-discard-able on its own) and block her 5-cards hand limit... until a player discards the whole hand (=the only way to discard a Dead End).&#10;&#10;&#10;&#10;    &quot;The Door To The Oniverse&quot; brings several one-time abilities cards as &quot;inhabitants of the Oniverse&quot;... and one extra colorless door to find.&#10;&#10;&#10;Apart from all those, there are a few special rules to use the dark meeple in the game (which interferes with Nightmare cards resolving), making the game easier or harder, depending on the chosen variant.&#10;&#10;",
        "artist": "Philippe Guérin,Élise Plessis"
    },
    {
        "name": "Hipster Dice",
        "description": "Game description from the publisher:&#10;&#10;Based on the underground German phenomenon Nichteinechtesw&uuml;rfelspiel and updated with vintage rules, Hipster Dice is poised to be the perfect game to play while you're waiting in line at the second-hand clothing store. Get it before it's cool.  It even has a pretentiously  hipster name, since it only includes one die.&#10;&#10;The rules are characteristically evasive but the gist is: there is a six-sided die. Each side of the die represents a category: music, drink, literature, fashion, movies, and food. One player rolls the die and has one minute to declare a factoid concerning the rolled subject. If everyone accepts the factoid as true, then play passes to the left. If someone challenges the factoid, then that player has two minutes to disprove the statement using whatever electronic device is handy. The winner in the challenge scores one point. The winner of the game is declared when that person scores five points. Players will have to provide their own score keeping units and electronic device for research.&#10;&#10;",
        "artist": "Samuel Mitschke"
    },
    {
        "name": "Chimera",
        "description": "Chimera is a three-player card game of two against one similar to climbing- and shedding-based card games like Tichu, The Great Dalmuti, Big Two and Beat the Landlord.&#10;&#10;Each hand, one player is designated Chimera and the other two players team up as Chimera Hunters to defeat the Chimera. Players compete for points in several hands of play by playing sequential pairs, trips, straights and other card combinations, and whoever has scored the most points once the designated point score has been reached wins. Chimera is normally played to 400 points, although longer or shorter games can be played.&#10;&#10;",
        "artist": "Philippe Guérin,Chris Quilliams"
    },
    {
        "name": "Geek Out! Pop Culture Party",
        "description": "Geek Out! Pop Culture Party is a party game that can determine once and for all which player is the most knowledgeable about your favorite pop culture subjects!&#10;&#10;In this game, which is aimed at a more mainstream audience than parent game Geek Out!, you draw cards asking you to list a certain number of things which fall under a certain category: television, movies, music, literature, and more. Before you begin, however, the other players may try to steal your points (and bragging rights!) by bidding to list even more than the card requires. The bidding continues until one player is ready to &quot;out-geek&quot; their friends. Collect a predetermined number of cards, and you win!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Asking for Trobils",
        "description": "Asking for Trobils is a worker-placement boardgame where the player is trying their best to rid the star system of Trobils (space pests). You play a Trobil Hunter - flinging the space vermin into the star, and dealing with unsavory folk just to get the job done.&#10;&#10;Players start with one ship, placing it at various locations to gather resources that will allow you to trap Trobils. But just one ship may not be enough, so you can fly through a wormhole to create two or even three ships to help you gather resources.&#10;&#10;You can make connections to gain more resources or hang around the local Riffraff. Send pirates, bounty hunters, or gangsters out to make areas rougher for your opponents, or enhance locations for everyone by sending out traders and courtesans.&#10;&#10;For every Trobil card you capture, you gain victory points. The player with the most points at the end wins&#10;&#10;",
        "artist": "Christian Strain"
    },
    {
        "name": "Viticulture: Complete Collector's Edition",
        "description": "The Complete Collector's Edition of Viticulture quite simply is a box with distinctive art, with two [filled] compartments in it:  One for the Viticulture (2nd printing) complete box, and the other for the Tuscany complete box.  Thus, the Complete  Collector's Edition.&#10;&#10;",
        "artist": "Jacqui Davis,David Montgomery,Beth Sobel"
    },
    {
        "name": "Gloobz",
        "description": "Players in Gloobz need to act quickly to grab the right things from the table before anyone else can.&#10;&#10;Seven plastic items start in the middle of play: three paint cans (blue, red, yellow), three critters (triangular, square, round) and one boss gloob that is all colors and shapes. On a turn, a player calls either &quot;more&quot; or &quot;less&quot;, then flips the top card of the deck. Depending on what's called, players race to grab the items that correspond to the color and shape most (or least) visible on the card, scoring one point for each item correctly grabbed. If a magnifying glass appears on the card, players can grab anything they want. If the boss shows up, just grab him and score three points if you do.&#10;&#10;The number of points needed to win depends on the number of players.&#10;&#10;Attrapez-les tous !&#10;Les Gloobz sont d&rsquo;adorables cr&eacute;atures mais elles s&egrave;ment la pagaille partout o&ugrave; elles passent :&#10;rattrapez-les vite ! Selon l&rsquo;annonce du tour, saisissez les figurines dont la forme et la couleur sont les moins ou les plus repr&eacute;sent&eacute;es sur la carte en jeu. Chaque bonne figurine saisie vous fait marquer 1 point mais en cas d&rsquo;erreur, une p&eacute;nalit&eacute; vous attend. Et des cartes sp&eacute;ciales viennent se m&ecirc;ler &agrave; ce joyeux d&eacute;sordre. Ayez l&rsquo;esprit et le geste vifs pour attraper ces dr&ocirc;les de cr&eacute;atures avant vos adversaires! Points forts : mat&eacute;riel ludique, r&eacute;fl&eacute;chir vite, ambiance survolt&eacute;e.&#10;&#10;",
        "artist": "Maxim Cyr"
    },
    {
        "name": "RoboRama",
        "description": "In RoboRama the goal is simple: Race against the other players by constantly picking the right combination of action cards and routes for your robots in order to cross the arena. Or &mdash; if that isn't thrilling enough &mdash; add the ChaosBot, which can be controlled by everyone. Finish first with your four robots on the opposite side of the arena and you win! Of course this is easier said than done. After all, you are not the only one trying to win, making it pretty crowded in the arena.&#10;&#10;RoboRama offers three different types of play with multiple variations; the game is easy to learn, but all the more difficult to win.&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "MERCS: Recon – Assassination Protocol",
        "description": "MERCS: Recon - Assassination Protocol is a fully cooperative, stand-alone game set in the exciting MERCS world. Recon uses a modular setup that allows for a highly replayable experience.&#10;&#10;Players are MERCS infiltrating an opposing MegaCon location. The MERCS team must fight through the tight corridors of the structure, capture and interrogate worker-citizen, find mission objectives, and breach and secure the package.&#10;&#10;Recon utilizes MERCS well known dynamic, high-quality miniatures, an engaging fog-of-war mechanic with variable agent movement, escalating security forces, and a tension-filled end game through a unique breach and clear mechanic.&#10;&#10;",
        "artist": "Ignacio Bazán Lazcano,Keith Lowe"
    },
    {
        "name": "Unknown",
        "description": "&quot;Unknown&quot; is a cooperative tile based exploration and resource management game set in a post-apocalyptic world.  Each turn players use their action points to move their meeples, explore new tiles, gather resources, interact with environmental hazards and battle enemies in order to complete objectives.&#10;&#10;Players must complete objectives while keeping the base supplied with food. If players fail to keep the base supplied with food before completing all objectives, the game is lost.&#10;&#10;&quot;Unknown&quot; features a vast array of characters, hazards, enemies and objectives that are mixed together each game, providing a unique experience every time.&#10;&#10;",
        "artist": "Boya Sun"
    },
    {
        "name": "March of the Ants",
        "description": "As spring dawns the great thaw begins. Deep beneath the lush meadow grasses the queen stirs in her nest and the colony comes to life. Soldiers venture forth, battling centipedes while clashing with opposing colonies for territory. Workers dig an ever-expanding network of tunnels in their tireless search for food. The first larvae hatch and it is clear this generation will be different: the young colonies rapidly evolve into a multitude of new forms. The ants march out to claim the meadow as their own.&#10;&#10;In March of the Ants, you create the shared Meadow board by sending your ants to explore it, revealing and strategically placing two dozen unique tiles like Fern, Pebble, and Nest of Centipedes.&#10;&#10;Populate new territory by breeding larvae and marching your ants onto collection sites. Will you engage competing colonies in battle, seeking to claim the land for yourself? Or will you establish peaceful, symbiotic relationships and share the spoils? All of this must be done while carefully managing the resources in your underground nest.&#10;&#10;Forage for Event Cards like Strange Appetite, Cold Snap, and Fungal Outbreak to impact the entire board &ndash; or just one unlucky opponent.&#10;&#10;Mutate your colony with special Evolution Cards like the Trap Jaw head, Weaver thorax, and Leaf Cutter abdomen. What weird and wondrous path will your colony&rsquo;s evolution take: advanced Workers, fearsome Soldiers, or a fertile Queen?&#10;&#10;Emerge triumphant by scoring Colony Points as your ants explore and control the Meadow. Search for Colony Goals like Epic Stores, Followers of the Eyeless, and Extensive Tunnels to plan your route to victory.&#10;&#10;March of the Ants takes strategy underground&hellip;literally!&#10;&#10;",
        "artist": "Tim Eisner,Ryan Swisher,Peter Wocken"
    },
    {
        "name": "Greenland",
        "description": "The three players  in Greenland represent the Norse (red), Tunit (green), and Thule (yellow) tribes inhabiting Greenland from the 11th to the 15th centuries.&#10;&#10;As a tribe, you attempt to secure food, resources, and technology to increase the size of your tribe and support children, elders, and livestock while also wiping out competing species or gathering resources to collect victory points. You must work around the weather and the extinction of natural resources as well as negotiate deals to protect your wives while you decide between monotheism or polytheism. In this tableau-building game, you'll send your population out to hunt native species of Greenland &mdash; but some might not come back. (Historically, the climate turned frigid and all but the Thule (Inuit) died out.)&#10;&#10;In the game, play takes place over six phases; all players complete each phase in turn order, then the next phase starts. Each turn is one generation. In order:&#10;&#10;&#10;     Resolve events: Examples include elder deaths, animal migrations, feuds, or global cooling. If a trade ship arrives, an auction is held for its wares. &#10;     Assign hunters: Hunters are assigned to hunting grounds, resource gathering, colonizing the New World, raiding other tribes for wives or animals, or promotion to an elder.&#10;     Negotiate: Players can bribe others to peacefully withdraw hunters, including marrying them to their daughters. Players with a War Chief Elder can use hunters to attack others on the same card. The New World turns hostile if there are too many colonists.&#10;     Resolve hunting: Roll a die for each hunter and modify it for technologies and marriages. Success can result in gaining new hunters, resources, hand cards, wives, and/or technologies. Beware, as some animals can be confused by the prey-predator relationship and your hunters might not return. Some successes let your take cards from the central play area into your hand if within hand limit. &#10;     Maintain livestock: Pay to keep the animals you've already domesticated.&#10;     Take elder actions: Examples include invention, domestication, proselytization, and witch-burning. If you have no elders, you can convert to monotheism.&#10;&#10;&#10;Depending on each player's ending theistic worldview, he has a variable scoring based on successful hunts (polytheism) or resource gathering (monotheism).&#10;&#10;LIVING RULES&#10;&#10;Vassal module&#10;&#10;",
        "artist": "Karim Chakroun,Phil Eklund"
    },
    {
        "name": "Monikers",
        "description": "Monikers is a party game based on the public domain game Celebrity, where players take turns attempting to get their teammates to guess names by describing or imitating well-known people.&#10;&#10;In the first round, clue givers can say anything they want, except for the name itself. For the second round, clue givers can only say one word. And in the final round, clue givers can&rsquo;t say anything at all: they can only use gestures and charades.&#10;&#10;",
        "artist": "Alex Hague"
    },
    {
        "name": "Super Dungeon Explore: Forgotten King",
        "description": "Princess Emerald and her companions are questing deep into the Lordship Ruins to confront the evil that resides there. Brooding from his darkened hallways, the Forgotten King is a cursed lord who has pledged himself to the service of the Dark Consul, darkening his once lush and verdant lands. At his side are two new mini-bosses: Trent, a towering guardian of the forest with thick bark and brambles for armor, and Boris, a raging brute with snarling ursine features.&#10;&#10;In Super Dungeon Explore: Forgotten King, players explore the Fae Wood, home of the Kodama, sentient forest spirits with a taste for adventuring Heroes. Wisps lure Heroes into ensnaring traps as terrifying, man-eating plants sprout from the loamy forest floor to devour them. Continue into the Lordship Ruins where the once proud bramble knights, now corrupted and twisted into servants of the Dark Consul, stalk the stony ruins for any who would defile their lord's holdfast. Don't get too close to the trees, though, as we hear the squirrels are in an ill mood.&#10;&#10;Super Dungeon Explore: Forgotten King includes five new Heroes to brave the depths, including the Thundervale Huntress, Fae Alchemist, Royal Warden, and the brave Questing Knight. Each lend a new dynamic to gameplay and your strategy to conquer the Forgotten King and his minions.&#10;&#10;Forgotten King contains two play modes: Classic Mode, in which someone controls the dungeon and its monsters while everyone else takes the roles of the plucky heroes, or Arcade Mode, which allows for a fully co-operative game for up to five players.&#10;&#10;Forgotten King, while itself a standalone game, is compatible with all previously published Super Dungeon Explore expansions and supplements.&#10;&#10;",
        "artist": "Kris Aubin,Elmer Damaso,Ein Lee"
    },
    {
        "name": "Zombie Island",
        "description": "The family vacation isn't going according to plan. Your boat sprang a leak, but luckily you made it to the beach of a remote tropical island. While you were making repairs your family wandered off. Time to go explore the island and find them. Man, that's thick jungle! Good thing you have a machete as you're going to need it...&#10;&#10;Zombie Island is all about tactical tile placement and strategic piece movement. The core mechanisms contained in the initial scenarios are the foundation for future expansions and many more scenarios to come! This core game is made for 1-4 players (including an easy-to-learn solo game) and plays in 15-45 minutes.&#10;&#10;",
        "artist": "François Valentyne"
    },
    {
        "name": "Lords of Xidit",
        "description": "The Black Southern Host has arisen, corrupting the hearts of the indigenous creatures. Afflicted by a mysterious sickness, they are attacking human cities. The last remaining hope for restoring peace to Xidit lies with the Kingdom's noble heirs, the Idrakys. As one of them, you must roam the Kingdom recruiting brave soldiers and reclaiming threatened cities. Your bravery will not go unrewarded: accumulate wealth, send bards to sing your praises, and build Sorcerers' Guilds!&#10;&#10;Lords of Xidit features simultaneous programming and an elimination-based scoring system that leaves no room for complacency! In more detail, at the end of the game players compare their influence in one category and the player with the least influence is eliminated and his pieces removed from the board; players then compare influence in another category, with a player again being removed. The order of elimination is randomly determined at the start of play, forcing you to thinking in different ways each game.&#10;&#10;Prepare to ride out, Idrakys, and forge your legend!&#10;&#10;",
        "artist": "Xavier Gueniffey Durin,Stéphane Gantiez"
    },
    {
        "name": "Caffeine Rush",
        "description": "Game description from the publisher:&#10;&#10;Need a jolt to get your day off to a great start? Jump into the game of Caffeine Rush for a latte fun! You share a workspace with your fellow baristas and orders are flying in fast and furious. Grab the ingredients you need to pump out orders and rake in the tips! But be careful &mdash; if someone else finishes your work, they'll get the tips!&#10;&#10;As each drink is served, you'll pull a new order and shout it out. You will definitely need a double shot of espresso to compete in this hilarious game of battling baristas!&#10;&#10;",
        "artist": "Stephen Sauer"
    },
    {
        "name": "Blood of the Werewolf",
        "description": "Blood of the Werewolf is a different type of Werewolf game as at the start of play, you don't know your own identity but others do. Thus, you need to observe the actions of others to figure out who you are. Another difference from traditional Werewolf games is that it requires no moderator and if your character dies, you can still participate in the discussion &mdash; and possibly even win!&#10;&#10;In the game, players are divided into two camps: Manlike and Werewolf. During the game, players accuse one another through confidential markers, which send others to death through family trial. When the number of surviving players drops to a predetermined threshold, which is based on the number of players, the camp with more survivors wins.&#10;&#10;",
        "artist": "Chih-Fan Chen"
    },
    {
        "name": "Legendary: Villains – A Marvel Deck Building Game",
        "description": "The Legendary universe gets flipped upside down in Legendary: Villains &ndash; Marvel Deck Building Game, and you can now play as villains trying to take out the heroes protecting the city!&#10;&#10;The goal of the game remains roughly the same as in the first Legendary game as players can work both with and against other players to overcome obstacles that the game throws at them. In this case, however, players use the super villains of the Marvel Universe &mdash; including Venom, Magneto and Loki &mdash; to battle superheroes such as the X-Men, the Avengers and Spider-Friends.&#10;&#10;Legendary: Villains &ndash; Marvel Deck Building Game is a standalone game that includes all the cards needed to play.&#10;&#10;",
        "artist": "Devin Low"
    },
    {
        "name": "Doomtown: Reloaded",
        "description": "The classic collectible card game Deadlands: Doomtown returns as an Expandable Card Game in Doomtown: Reloaded. Featuring four factions fighting for control of Gomorra, California. Doomtown: Reloaded allows you to build your own deck from a fixed set of cards in the box. Play your dudes to control deeds in the town, and use actions, hexes, and more to thwart your opponents.&#10;&#10;Shootouts are resolved via a poker mechanism as every card has a suit and value. Preparing for the hands you want to draw is as much a part of deck building as choosing the actions and dudes you'll want to play. Your deck is built around an Outfit, one of the four main groups attempting to control Gomorra, California, and these outfits are:&#10;&#10;&#10;    The Law Dogs: The Sheriff and his deputies, tasked with enforcing law and order in an extremely chaotic town.&#10;&#10;&#10;&#10;    The Sloane Gang: The main cause of a lot of the chaos, the Sloane Gang takes what they want, no matter who it costs.&#10;&#10;&#10;&#10;    The Morgan Cattle Company: Progress and investment, Morgan Cattle has moved into the surrounding ranch lands and uses its deep pockets to influence the town.&#10;&#10;&#10;&#10;    The Fourth Ring: It's that circus that's been here for months, but I swear it just arrived...&#10;&#10;&#10;The base set of Doomtown: Reloaded will be followed by Saddlebag expansions, in-store OP events, and the Badge Series of tournaments.&#10;&#10;",
        "artist": "Grzegorz Bobrowski,Mario Wibisono"
    },
    {
        "name": "Dino Race",
        "description": "Trying to save their dinosaurs from extinction, players in Dino Race run as quickly as possible through plains, deserts, swamps and jungles while avoiding the nasty tricks of the opponents. Each player must bring his dinosaur couple to the end of the race track, scoring points when one of his dinos&shy; finishes the race. Players also score points by bringing the dino egg to safety.&#10;&#10;",
        "artist": "Francesco Mattioli,Michelangelo Ricci"
    },
    {
        "name": "Reglamentacja: Gra na Kartki",
        "description": "If you decide to play Reglamentacja: Gra na Kartki (&quot;Rationing: The Card Game&quot;), a difficult task awaits you. You will be going back to the Communist era during the winter of 1983 to fight for ration cards for meat, sugar and other goods. Your goal is to buy the goods on your shopping list before your guests arrive.&#10;&#10;Unfortunately, the goods in stores are rationed, and the number and kind of ration cards distributed rarely corresponds with what you need. Instead those cards might land in the hands of other players. You soon realize that success depends on how clever and smooth you are in exchanging ration cards with players standing in the same queue &mdash; but you need to hurry as the clerk will finish her tea in just one minute and start selling the goods.&#10;&#10;As with all IPN publications, Reglamentacja: Gra na Kartki was created as an educational tool to remind the world of why the Communist economy fell. The richly illustrated booklet includes a historic overview of the last decade of Communism in Poland and the principles of distribution of controlled goods.&#10;&#10;",
        "artist": "Natalia Baranowska"
    },
    {
        "name": "Fleets: The Pleiad Conflict",
        "description": "In 3400 AD, mankind has colonized the Pleiad star cluster where mighty corporations vie for control and influence. Each player equips fleets with escort ships and upgrades and uses them to control star systems for VPs. Diplomatic leverage, cunning, and brute force will determine the victor.&#10;&#10;Each round in Fleets: The Pleiad Conflict consists of six phases:&#10;&#10;1) Player order. Every round has a new randomized player order. Being first has its pros and cons, so does being last.&#10;&#10;2) Build. The players take turn buying new fleets, escort ships, and upgrades, using their megacredits. The fleets each consist of a flagship and space for some combinations of escort ships and upgrade cards. Which fleet you choose and how you develop it will determine its strengths and weaknesses.&#10;&#10;3) Deployment. The players place their fleets at the different systems they want to control.&#10;&#10;4) Diplomacy. Players take turns using diplomatic actions. There are 2 basic actions: A) Use 2 diplomatic points to retreat your fleet from the board. B) Use 6 diplomatic points to retreat an opposing fleet from a system where you have a fleet. There are also diplomatic actions on some fleets, systems, and action cards.&#10;&#10;5) Battle. At every system with more than one fleet there will be a battle where every ship gets to shoot once. Each fleet has different initiative numbers for its ships, describing when they get to act. Late ships risk being shot down before they have a chance to fire. During battle, players can also use battle actions on action cards, upgrade cards, fleets, and escort ships. Most battle actions cost energy from the fleet. If a flagship is destroyed, its owner must immediately retreat all surviving escort ships from that battle and discard the fleet.&#10;&#10;6) Reward. Players get 1 VP for each system they have to themselves (The first player to reach 7 VP is the winner.). Then each fleet gets energy from its reactor and resources from the system where they are located. Then each player gets 2 diplomatic points, 6 megacredits, and an action card, and then the next round can begin.&#10;&#10;",
        "artist": "Daniel Fryxelius"
    },
    {
        "name": "Warhammer 40,000: Conquest",
        "description": "In Warhammer 40,000: Conquest, a two-player Living Card Game, you take the part of a warlord, leading your armies into battle against your opponent in a bid to claim glorious victory. Even as you lead your bravest warriors into battle, you must plan for the future, establishing a presence on planets before the tides of war consume them in blood and fire. You must conquer the Traxis sector by strength of arms for in the grim darkness of the far future, there is only war.&#10;&#10;Warhammer 40,000: Conquest introduces seven distinct factions: Space Marines, Astra Militarum, Orks, Chaos, Dark Eldar, Eldar, and Tau. Each of these factions possesses a unique flavor and style of play, and an alignment wheel introduces the possibility of forming an alliance between two factions.&#10;&#10;At the start of play, the Traxis sector lies open before you, with planets awaiting the tramp of armies on the road to war. Each round begins with you and your opponent preparing for battle. Planet cards are arranged in a row between the players at the beginning of the game, and the planet farthest to the left of the starting player is the first planet. Each round, you or your opponent will clash at the first planet, and the victor will capture the first planet.&#10;&#10;Capturing planets is your ultimate goal. Some planets possess essential materials necessary for the armies of the 41st millennium. Others offer strategic advantages to those who hold them, while yet others are home to great technological wealth. Each of the planet cards possesses one or more symbols in the upper left hand corner, designating that planet's assets. These symbols grant no abilities by themselves, but the first player to collect three planets sharing a common symbol dominates the sector and wins the game.&#10;&#10;Your warlord grants powerful special abilities, determines your starting resources and hand size, and serves as a vital part of your army, so you'll want to build your deck around your warlord to take full advantage of his strengths &mdash; and cover his weaknesses, as defeating the opponent's warlord is another way to victory.&#10;&#10;",
        "artist": "Víctor Pérez Corbella,Alex Drummond"
    },
    {
        "name": "Munchkin Panic",
        "description": "Munchkin Panic is a semi-cooperative board game that blends the all-for-one gameplay of Castle Panic and the all-for-me gameplay of Munchkin.&#10;&#10;In this hybrid game, the Munchkin monsters have found the Castle Panic towers and are on the rampage! Players need to combine cards to hit and slay the monsters before they destroy the castle. The card combos available in Munchkin Panic are created from a unique mixing of the decks of the two source games. Each defeated monster becomes a trophy and gives up its treasure to the victor. If players work together to defeat the monsters, the player with the highest point count becomes Master Munchkin &mdash; but players must balance their self-interest with the cooperation necessary to survive. If players get too greedy, the monsters will stomp the castle flat while the players are too busy fighting amongst themselves!&#10;&#10;",
        "artist": "John Kovalic"
    },
    {
        "name": "Clinic",
        "description": "You are the rich owner of a large field near New York where health needs are more important. Your goal is to build the most efficient hospital in three dimensions in order to get the most popularity. You will manage the construction of the building from scratch as well as the installation of new services and the recruitment of the best doctors, nurses and administrative staff that align with the arrival of new patients. You will also be attentive to the well-being of patients and not forget that time is also money when competing with neighboring hospitals...&#10;&#10;Each turn in Clinic, players take three actions &mdash; building in different modules; hosting patients; hiring doctors, nurses and staff &mdash; by playing one card. Each cube that enters the clinic comes with a car that needs to be parked, leaving less space for the hospital being constructed! During the game, you'll move patients, doctors, nurses, and staff in the 3D structure as efficiently as you can in order to save time, with doctors and nurses tending to patients as long as their colors (indicating both training and illness) match. By taking care of patients you receive money, which lets you pay fees, salaries and maintenance as well as buy popularity points.&#10;&#10;During an administrative phase, uncared for patients grow sicker, new patients enter the pre-admission room, doctors become less knowledgable about the diseases they face, and new doctors and nurses become available from their schools. In the end, the player with the most popularity points and least time spent during the game wins.&#10;&#10;",
        "artist": "Da-Fanny,Sampo Sikiö"
    },
    {
        "name": "Balance of Powers",
        "description": "They shall grow not old, as we that are left grow old:&#10;Age shall not weary them, nor the years condemn.&#10;At the going down of the sun and in the morning&#10;We will remember them.&#10;    -For the Fallen, by Robert Laurence Binyon&#10;&#10;Balance of Powers pays fitting tribute to the fallen with a respectful presentation of their bitter struggles in the air, on land, and at sea.&#10;&#10;The game offers players a corps-level recreation of the entire First World War from the Somme through Dar-es-Salaam and on to Tsingtao. A roll-to-hit system enables air and (optional) naval combat to scale from the small dogfights of the Fokker Scourge to the mighty clash of dreadnoughts at Jutland. On land, corps entrench by flipping which opens up an in-hex dimension for every trench battle to simulate the tactical ebb and flow that animated the front even during strategic &quot;stalemate&quot;.&#10;&#10;Since victory hinges on territorial control, the opposing sides feed men into the mill hoping to win a war of attrition before accumulated demoralization triggers a domestic political crisis to upset their balance. The prospect of a &quot;breakthrough&quot; to the green fields beyond motivates ceaseless attacks, but it's ephemeral until tanks and planes arrive in numbers. The presence of specific admirals and generals, including the U-boat ace Lothar von Arnauld de la Periere, makes the game personal.&#10;&#10;A haggle-based diplomacy system enables history buffs to recreate the land-swap politics of the period, or players can opt for a simpler, streamlined schedule of neutral entry with a dash of randomness added for surprise. Production is as simple as 1-2-3 to avoid excessive math while enabling players to comprehend the &quot;cost&quot; of their losses. In the end, victory goes to the side that beats its historical record.&#10;&#10;Link to VASSAL http://www.vassalengine.org/wiki/Module:Balance_of_Powers&#10;&#10;Link to Zun Tzu module&gt; http://www.mediafire.com/download/hrl36m0iko6by9c/Balance+of+Powers.ztb&#10;&#10;",
        "artist": "Mark Mahaffey"
    },
    {
        "name": "Pirate Den",
        "description": "Pirate Den is a game of bluffing and deception for 3-5 players that plays in 30 minutes or less.  Players take on the role of pirate captains trying to get the most loot.  Plunder the seas, steal from your rivals, and bury your treasure to protect it.  The captain with the most loot at the end of the game, wins.&#10;&#10;In the game players will play cards to take gems from the center of the table and from each other, and bury to turn 5 gems into buried treasure to prevent it from being stolen.  When one player has 5 buried treasure the game ends and the person with the most points between their gems and buried treasure wins, with each gem being worth 1 and each buried treasure being worth 5.&#10;&#10;",
        "artist": "Thomas Deeny,Kevin Forney,Todd Harris,Jen Thomas (II),Peter Wocken"
    },
    {
        "name": "Black Orchestra",
        "description": "As Hitler's grasp on Germany tightens and his maniacal fervor is unmasked, men from the highest levels of the Reich begin to plot his assassination. As the clock ticks and Hitler's ambitions grow, these daring few must build their strength and prepare for the perfect moment to strike. The Gestapo hound their trail, calling these conspirators &quot;Schwarze Kapelle&quot;, the Black Orchestra. Will this band of daring patriots save their country from utter ruin before it is too late?&#10;&#10;Black Orchestra begins with each player choosing an historic figure involved in the conspiracy against Hitler. In this dark and dangerous pursuit, motivation is perhaps your greatest weapon. If you can stay true to your convictions in the face of overwhelming threat and inspire your comrades, then you will be able to use your special ability, attempt plots, and even become zealous (necessary for some extremely daring plots).&#10;&#10;But every move you make may also increase the suspicion of the authorities. The Gestapo will make routine sweeps, and any players with high suspicion will be arrested and interrogated (possibly resulting in other players being arrested). If you are all arrested or if the Gestapo finds your secret papers, you lose. And the suspicion placed on each conspirator will increase the chances their plots are detected.&#10;&#10;On a turn, players may take three actions, such as moving, searching for an item, or drawing a card; or, at the cost of one action per die, roll the dice in an attempt to gain even more actions &mdash; at the risk of attracting the suspicion of the gestapo. This dice rolling &quot;Conspire&quot; action allows players to make bold moves when most needed.&#10;&#10;After the actions have been taken, an event card is drawn. The game is played over seven stages of World War 2, represented by seven stacks of event cards. These cards walk you through the events of WWII in a roughly (but not strictly) chronological order. New stages open up new areas of the board, cause Hitler and his deputies to interact with the Conspirators, and present various opportunities or threats. During the final stage, many board spaces become off-limits, as the Allies move closer to Germany.&#10;&#10;To win, players must collect a plot card and fulfill all necessary requirements listed (such as having Hitler be in a certain space and possessing certain items--detonator &amp; fuse, etc.). The active player may then attempt the plot by rolling the indicated dice, including all additional modifiers and helpful Action cards. The total of number of &quot;Target&quot; symbols needed to kill Hitler is based on Hitler's military support, but a Conspirator's security level decides if any &quot;Eagles&quot; rolled will see them detected, and foil the plot regardless. Players must consider their ability to successfully complete a plot and the relative suspicion levels of the different Conspirators involved.&#10;&#10;Players will need to work together and agree on the wisest course of action, as well as have a little luck, to succeed. The phenomenon of one player dominating the game because of it's cooperative nature is mitigated by the fact that there are no certainties, and often a player will need to make a bold or reckless move to keep the conspiracy alive. Cool heads often prevail, but play it too cool and you may miss your chance. The co-operative dynamic gets really interesting if a player is ever arrested, and fails to resist interrogation, then they will need to make a big decision all by themselves, without revealing their options to the group. No one player can guarantee success. It is hoped that players will have tense conversations similar to those had by the real conspirators and enjoy a truly unique historical experience.&#10;&#10;",
        "artist": "Cody Jones,Dann May,Lucas Soriano"
    },
    {
        "name": "Saint Petersburg (second edition)",
        "description": "In Saint Petersburg, you'll be buying different types of cards: workers, buildings, aristocrats, trading cards, and the new market cards. In every phase, a new type of card will be available for purchase. You'll start with workers, who are good at bringing in rubles. The new market (yellow) cards bring in new resources. Having the majorities in these resources from round to round will earn you additional victory points. This battle for the lead enhances the game experience and expands the tactical and strategic possibilities of the players. In the next phase, buildings can be acquired, mostly granting victory points. Aristocrats provide a mix of victory points and rubles, and also lead to a large end-game point bonus that can't be ignored.&#10;&#10;Trading cards allow already purchased cards to be improved. These phases will repeat until one of the card decks runs out. At this point, the final victory points are counted, and the winner is declared.&#10;&#10;For this new edition of Saint Petersburg, we've kept the well-known and loved basic game, but also added an additional game phase. This will allow us to fully integrate the fifth player into the game. The new market phase will introduce a new mechanic providing additional victory points and rubles. The purple action cards from the banquet expansion will also have matching cards for the market phase. And, of course, for lovers of the old version, it will still be possible to play the game by the original rules.&#10;&#10;",
        "artist": "Irene Bressel,Anne Pätzke"
    },
    {
        "name": "The Front Nine",
        "description": "The Royal Golf Association are running their annual competition to judge the best new nine hole course of the year. Will you finish all nine holes before the judges carry out their inspection?  If not will stunning scenery and design excellence be enough to beat off the opposition?&#10;&#10;The Front Nine is a card game where players compete to build the best nine hole golf course with a balance of challenging par, scenery and facilities. The course cards depict each hole (pars 3, 4 and 5)and after paying the land and resource cost for trees, water and sand, they are laid on the table to depict the actual layout of the course. Each player develops a course from club house to 1st tee and from green to following tee etc. Each hole has a differing topography which constrains tee access and green exits which results in each player's course snaking across the table. Players must manage their finances carefully to enable their course to generate an income to ensure they can afford the ever increasing land costs and resources required to design and build each hole. The winner is the player whose course design best links back to the club house, has the best design, bunkers, woodland and water hazards and optimizes the use of the natural environment.&#10;&#10;The Front Nine has direct player interaction and competition and an economic engine with an interesting spatial aspect where careful thought is needed for card purchase and placement.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Planes",
        "description": "From the rails to the air &mdash; well, hopefully. Planes puts you in the role of a group attempting to push your way through a crowded airport to reach your plane before takeoff. Other players' families or groups, as well as neutral travelers, will cause all sorts of congestion in the terminal and may keep you from boarding.&#10;&#10;With cards that affect play and allow bonus scoring, in addition to variable airport maps, Planes is the next phase in global travel from AEG's Destination Fun series! Continue your travels in the acclaimed Trains and Automobiles board games.&#10;&#10;",
        "artist": "Banu Andaru"
    },
    {
        "name": "Trains: Rising Sun",
        "description": "Trains returns with all-new cards and strategies for you to build the best rail system in Japan. Trains: Rising Sun not only features all new cards, it includes three entirely new boards. Two of the boards are designed specifically for two-player games, while the Nagoya map is for 3 to 4 players. This standalone game can mix easily with the original Trains game for even greater replay possibilities!&#10;&#10;Trains: Rising Sun also introduces Route Bonus Cards, allowing you to score additional points for being the first to connect specific stations. Route Bonus Cards are included for the original Trains game as well!&#10;&#10;Finally, Trains: Rising Sun includes the Trains: Nagoya Map expansion that was first produced only by the designer for use with the original OKAZU Brand production of Trains. (This item is not linked to in the information box for database reasons.)&#10;&#10;",
        "artist": "Banu Andaru,Ikaan Studio"
    },
    {
        "name": "Ascension: Realms Unraveled",
        "description": "Ascension: Realms Unraveled is a deck-building game in which players acquire cards from a central pool, then place those cards in their discard pile to be shuffled into their deck for later use; creatures also show up in that shared card pool, and players can combat them to earn victory points (VPs) and possibly other benefits, such as the ability to remove less useful cards from their deck or to banish cards from the pool that others might find useful. The game ends once all the available VPs have been claimed or the shared deck of cards runs out.&#10;&#10;Ascension: Realms Unraveled, part of the Ascension deck-building game series, is both a standalone game for 2-4 players (with solitaire rules included, too) and an expansion that can be combined with any other Ascension game to support up to six players.&#10;&#10;While cards in previous Ascension games have always belonged to one of four factions, Ascension: Realms Unraveled introduces multi-faction heroes, and these heroes combine with the new &quot;Multi-Unite&quot; game mechanism to deliver huge rewards to those who play multiple heroes from the same faction.&#10;&#10;Ascension: Realms Unraveled also features the &quot;Transform&quot; mechanism that debuted Ascension: Darkness Unleashed, with players being able to convert their cards into new, more powerful versions as the game progresses.&#10;&#10;",
        "artist": "Eric Sabee"
    },
    {
        "name": "ESSEN The Game: SPIEL'13",
        "description": "ESSEN the Game is a strategy game where each player is a visitor at the International Game Fair of Essen.&#10;&#10;With your wishlist, face the crowd and make your way to the stands of your favorite publishers. However, beware that games availability is limited. To achieve your goals, you have to manage your budget and encumbering. The number of games that you carry will reduce your moves in the fair. You will need to come back to the parking lot to store your purchases in your car before getting back to the fair in search of that special game.&#10;&#10;ESSEN The Game is the opportunity to live or relive a crazy day in the Kingdom of Games!&#10;&#10;",
        "artist": "Cyrille Breuil"
    },
    {
        "name": "Historia",
        "description": "In Historia, the players guide their civilization through 12,000 years of human history, from the first sparks up to the development of Singularity. Civilizations discover new technology and expand over the planet; they trade with more developed neighbors to import new technologies or exploit the land to have more power for future actions. Civilizations develop their military and wage wars with each other. They build wonders to make their civilization stand above others and to eventually attract tourists and newcomers to their land to follow their leaders and use their national advisors.&#10;&#10;Historia is a civilization game for 1-6 players that takes 25 minutes per player. A set of action cards is available to the players to guide their civilization, and used actions form a discard queue from which they are taken back into a player's hand during the game. Wars and raids are carried out in a non-disruptive way. When modern times have been reached the game ends and the player with the most VPs wins.&#10;&#10;A solo Historia variant with A.I. bots is also available.&#10;&#10;Flavor text:&#10;History is made by strong leaders and wise advisors, by conquests and discoveries, by wars and trade and amazing wonders. Historia is made by you.&#10;&#10;",
        "artist": "Miguel Coimbra,Marina Fischetti"
    },
    {
        "name": "Destination: Neptune",
        "description": "Destination: Neptune shows an optimistic vision of commercial space exploration in the next century. Players control an organization with the resources and intent to explore, develop, and colonize the worlds beyond Earth. Organizations that practice careful planning and resource management, with a healthy dose of technology research will succeed. Destination: Neptune moves through four generations of space exploration. Players earn Victory Points by building large commercial outposts and colonies, as well as from fame and outright purchases. After four generations, the player with the most Victory Points wins the game.&#10;&#10;This is a card driven game in which most Cards have an action that happens immediately, and another action for all of the players (including the player who played the card). Players can also sell cards in exchange for currency. When you sell a card, it goes to an Opportunity Track and is placed to the side of the board. If the Opportunity Track already has as many cards as players, the rightmost card is discarded. You may not change the order of the cards in the Opportunity Track. Players can play cards from the Opportunity Track as if they were in their hands.&#10;&#10;Players must use the cards to gain currency and fuel in order to launch space missions to establish bases, factories and colonies on various locations within our solar system. Careful hand and resource management is key to winning the game. In addition, players also need to research certain technologies in order to build on most locations. Technologies are researched through card play and paying currency. The cards are separated into 4 piles which are separate generations. At the end of each generation, each player scores points for the various structures they've built. The game ends when all generation piles have been exhausted.&#10;&#10;",
        "artist": "Nicholas Avallone"
    },
    {
        "name": "Dice Brewing",
        "description": "Dice Brewing is a dice-building game in which you manage resources and brew beer to become the beer master. &#10;The players become brewers whose goal is to acquire the resources needed to brew many new beer recipes and then gaining the rewards that come with brewing them - gold and mastery points. To do so, each player uses their player board and two location cards (marketplace and black market) to develop their resource pool and stock their storage with certain tokens that alter the course of the game. The player who has the most mastery points at the end, wins the game.&#10;Players will have to prove themselves by brewing various styles of beer, acquiring specific malts and hops, as well as enhancing the recipes with ingredients that will make your beers stand out. But that's not all... The Apprentices will be able to compete with each other directly, making their lives harder by using some unrefined methods!&#10;&#10;Players manage their resources by way of 6-sided dice in 4 different colors:&#10;&#10;&#10;    Light malt: yellow dice&#10;    Dark malt: black dice&#10;    Hops: green dice&#10;    Skill: blue dice, which allow for additional effects on recipe cards and resource dice.&#10;&#10;&#10;Players can influence the luck of the dice through a variety of cards that allow them to replace the dice, increase the value rolled, receive extra dice, buy special ingredient tokens, and buy action tokens - which can affect opponents or provide additional dice manipulation.&#10;&#10;When a player collects the correct number of dice with the proper value, he can brew one of the available recipes and gain points, gold, or another effect. Players can also enhance recipes by throwing in additional ingredients to earn a bonus (more gold, more points).&#10;&#10;",
        "artist": "Piotr Uzdowski"
    },
    {
        "name": "MBT (second edition)",
        "description": "From GMT P500:&#10;&#10;MBT is a complete game system modeling the US 7th Army and the GSFG Soviet mechanized forces of 1987.  It is M1 Abrams (105mm and 120mm armed version)versus a whole stable of Soviet armor with their T-80s, T-72s, T-64s, and upgraded models of T-62 and T-55.  There is even M60A3s sprinkled in to balance out the US tank inventory. Bradley IFVs and CFVs mechanized units are set to take on their counterparts mounted in BMP 1,2s and even a few 3s.  Not to overlooked M113A2s and BTRs and MT-LBs are also set to make their appearance.&#10;&#10;Mechanized infantry and their related weapons are in abundance, including M47 Dragon, M72 LAW, AT-7 Saxon, AT-4 Spigot, and multiple RPG versions.&#10;&#10;The scale is right down in the weeds with individual vehicles, infantry squads, half squads and sections.  Each hex is just 100 meters across, so it is going to be nose-to-nose action at its finest.&#10;&#10;The rules cover the total realm of modern mechanized combat with ATGMs, including TOW and deadly Soviet gun launched missiles like the AT-11 Sniper and AT-8 Songster, special armor (including ERA), advanced night fighting with thermal images and image intensifiers, advance artillery with ICM and laser guided shells, helicopters, including the AH-64A Apache and Mi-24P Hind-F, attack aircraft, including the A-10A Warthog and SU-25 Frogfoot, and missile and gun armed AA units to counter the deadly air threats.  It is all included in this total package.&#10;&#10;",
        "artist": "Pete Abrams,James M. Day,Charles Kibler,Terry Leeds,Mark Simonitch,Eric Williams (I)"
    },
    {
        "name": "Five Tribes",
        "description": "Crossing into the Land of 1001 Nights, your caravan arrives at the fabled Sultanate of Naqala. The old sultan just died and control of Naqala is up for grabs! The oracles foretold of strangers who would maneuver the Five Tribes to gain influence over the legendary city-state. Will you fulfill the prophecy? Invoke the old Djinns and move the Tribes into position at the right time, and the Sultanate may become yours!&#10;&#10;Designed by Bruno Cathala, Five Tribes builds on a long tradition of German-style games that feature wooden meeples. Here, in a unique twist on the now-standard &quot;worker placement&quot; genre, the game begins with the meeples already in place &ndash; and players must cleverly maneuver them over the villages, markets, oases, and sacred places tiles that make up Naqala. How, when, and where you dis-place these Five Tribes of Assassins, Elders, Builders, Merchants, and Viziers determine your victory or failure.&#10;&#10;As befitting a Days of Wonder game, the rules are straightforward and easy to learn. But devising a winning strategy will take a more calculated approach than our standard fare. You need to carefully consider what moves can score you well and put your opponents at a disadvantage. You need to weigh many different pathways to victory, including the summoning of powerful Djinns that may help your cause as you attempt to control this legendary Sultanate.&#10;&#10;",
        "artist": "Clément Masson"
    },
    {
        "name": "Black Fleet",
        "description": "Pirates, merchants, and even the occasional captain of a Navy ship all seek glory and fortune on the Caribbean seas!&#10;&#10;In the tactical card-driven board game Black Fleet, you're in command of three different types of ships: your merchant ship earns you doubloons by conveying goods from one port to another, your pirate ship by attacking and stealing goods from merchants and burying them on islands, and the Navy ships by sinking your opponents' pirate ships. With your (not-always-honestly-won) money, you'll improve your ships by buying advancement cards, giving you powerful additional abilities.&#10;&#10;Outwit your opponents with fortune cards and combos, earn money faster than they do, and pay the ransom for the governor's daughter to win the game!&#10;&#10;",
        "artist": "Denis Zilber"
    },
    {
        "name": "New Bedford",
        "description": "Set in the mid-1800s, the golden age of whaling, New Bedford gives you the chance to build the Massachusetts town of the same name into a thriving whaling community. Gather resources to add buildings with new actions and launch ships to go whaling. Go out longest for the best choice, but wait too long and the whales become harder to catch. And don't forget to pay your crew when ships return! Carefully balance time management and timing to earn the most points in this medium-weight worker placement and resource management game.&#10;&#10;In more detail, over twelve rounds players take turns placing two workers per round, one at a time. The town board and whaling board contain basic game actions: taking goods (food, wood, brick), selling goods, building buildings, docking ships, and launching ships. These actions can be used multiple times per round, with the first player to do so in a round receiving a bonus or more goods or reducing the number of goods paid.&#10;&#10;Most buildings add extra action spaces with new actions, combined actions, and more powerful versions of basic actions. You own whatever you build, with others needing to pay to use them and you earning points from them at game's end.&#10;&#10;You need to pay to send ships whaling, choosing how far out to send them. At the end of the round, ships move closer to shore and whale tokens are drawn randomly. Ships that are farthest out have first chance to pick the valuable sperm whales, but as they move in, others have the opportunity to launch farther out and get a better pick, possibly leaving you with only empty seas. Over the course of the game, whales become more rare and empty seas more common. Once a ship reaches shore, a percentage of the profits (the &quot;lay&quot;) must be paid in order to keep the whales selected.&#10;&#10;After twelve rounds, all ships must return, and players total their points from buildings, whales, and extra money. High score wins.&#10;&#10;",
        "artist": "Nolan Nasser"
    },
    {
        "name": "Birth",
        "description": "BIRTH is a completely new strategy dice game on the theme of the universe creation.&#10;&#10;Concept of BIRTH is a fusion of Euro game as &quot;sugoroku&quot; of Japan.&#10;&#10;Players will advance the frame by using the dice. And, the player places the dice strategically to five areas of different value.&#10;&#10;Players will be placed one by one die of their eleven. When all players that were placed there by the dice of all, the game is over. Player is given a score by the arrangement of the dice. The player who won the most points is the winner.&#10;&#10;There are basic rules for casual players, and advanced rules for more serious gamers.&#10;&#10;The game contains a beautiful board and luxury marble dice.&#10;&#10;",
        "artist": "Takashi Sakaue"
    },
    {
        "name": "Victory in Europe",
        "description": "Victory in Europe is a game covering the Second World War in Europe from 1939 to 1945. One player commands the Axis powers, the other the Allies.&#10;&#10;Players maneuver their armies on an area map of Europe, fighting for control of key victory cities and critical resources.  Air, naval, and ground units are all involved.  Battles are fought when enemy units clash in the same area.&#10;&#10;The early war 1939-1941 is driven by the Axis, but gradually the Allies become stronger and usually take the initiative by 1943.  However, the game need not unfold exactly like history.&#10;&#10;The French may survive 1940, the Germans may invade Britain.  Germany may attack Russia in June 1941, or attack earlier, or later, or not at all.  The Soviets may attack Germany first which was likely their plan.&#10;&#10;The USA might enter the war in 1942, perhaps earlier, perhaps later.  All of these decisions are made by the players, influenced by Diplomatic events that are controlled by game events.  Invading neutral countries such as Norway or Belgium has consequences.&#10;&#10;",
        "artist": "Tom Dalgliesh,Ron Draker"
    },
    {
        "name": "Viceroy",
        "description": "Viceroy is a board game of bidding and resource management set in the fantasy universe of the famous Russian CCG Berserk. As the players struggle for control over the world of Laar, they recruit a variety of allies and enact various laws. These cards allow players to develop their state's military and magical might, increase their authority, and get precious gems they need to continue expanding their nation.&#10;&#10;As the game progresses, each player builds his own power pyramid using character and law cards. Each card has its own effect that depends on the level of the pyramid where the card is played. These effects may give more resources, more cards, or victory points. The player who has the most power points at the end of the game becomes the ruler of entire Laar and the winner!&#10;&#10;",
        "artist": "Dmitry Burmak,Sergey Dulin,Pavel Guzenko,Anna Ignatieva,Ilya Komarov,Kate Maximovich,Dmitry Prosvirnin,Uildrim"
    },
    {
        "name": "Linkage: A DNA Card Game",
        "description": "Linkage is competitive card game that is simple to learn, yet offers lots of depth, forward thinking and replay-ability for 2 to 4 players. But best of all, Linkage was designed and themed around a process normally taught in high school biology, DNA Transcription, (when an RNA copy is made from DNA for protein synthesis or other in a cell) and in this way offers a unique, engaging and tactile experience for someone to familiarize themselves with this fundamental concept of biology.&#10;  &#10;In Linkage, DNA cards are randomly aligned side-by-side creating a DNA template strand. Players compete to build the most accurate RNA copy of this DNA Template by connecting their own RNA Cards side-by-side to match the DNA Template.&#10;&#10;During a turn, players choose between one of four actions: Building onto their RNA Strand, Fixing their RNA strand, Mutating an opposing players RNA Strand, or Mutating the actual DNA Strand. Players can also pay (discard) cards from their hand to take extra actions during their turn.&#10;&#10;Players are awarded points based upon the number of RNA Cards in their strand that correctly pair with the DNA template. The game can be played in as little 10 to 20 minutes but additional rounds can be added for a longer, more in-depth game. Multiple decks can also be added together for a game with more than 4 people, or a longer overall game.&#10;&#10;",
        "artist": "Tomasz Bogusz"
    },
    {
        "name": "Pints of Blood",
        "description": "Some old habits die hard. As the city is unexpectedly hit by disaster, and its inhabitants are slowly turning into hordes of hungry undead, an ever-growing assembly of zombies is beginning to queue outside a little corner pub. Inside a small group of patrons suddenly becomes aware that the evening is going to be more than just beer and snacks, and they're forced to take up whatever arms are within reach to avoid the fate of ending up as someone else's snack.&#10;&#10;In Pints of Blood, you must keep the zombies from entering the pub, and they're outside ready to move forward whenever they see any sign of life at the windows or door &ndash; or if they're pushed from behind by the ever-increasing number of zombies that are being brought in by the still running public transport.&#10;&#10;But no need to despair as help is on its way! Rally with your fellow survivors and hold out until the rescue vehicle makes its appearance. Be aware, however, that it might not have room for everyone, so at some point you may have to decide whether to support your mates or to fight for yourself &mdash; but if all buddies die before help arrives, the zombies win.&#10;&#10;",
        "artist": "Mariusz Gandzel"
    },
    {
        "name": "We Didn't Playtest This at All with Chaos Pack Expansion",
        "description": "This version of We Didn't Playtest This at All includes the Chaos Pack Expansion and comes in a sturdy 2-deck-playing-card-type box with a lift top.&#10;&#10;The Chaos Pack Expansion contains a side deck of 15 cards you can use alongside We Didn't Playtest This at All. Every game, you randomly draw one Chaos card, and it becomes a rule that must be followed for the entire game.&#10;&#10;From the publisher's website:&#10;&#10;&quot;The most aptly named game ever!&#10;&#10;In this exceptionally silly and awesome game, your objective is to win! Simple enough. Sadly, all of your opponents have the same simple goal, and they're trying to make you lose. Between Rock Paper Scissors battles, being eaten by a random Dragon, or saved by a Kitten Ambush, there are many hazards to avoid.&quot;&#10;&#10;Play Summary&#10;&#10;Everyone starts with 2 cards. On your turn, draw one card from the deck, and then play one from your hand following the instructions on the card. There are many hazards to avoid, including: bombs, dragons, arrows, laser pointers, black holes, Rock Paper Scissors battles, number battles, zombies, etc. Luckily items abound that can save you, too: spaceships, science, shields, dinosaurs and a kitten ambush!&#10;&#10;There are Star Cards: they are clearly superior to normal cards. Every player has an equal chance of drawing a Star Card from the deck.&#10;&#10;Integrates with:&#10;&#10;    We Didn't Playtest This Either&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Barragoon",
        "description": "Barragoon is a fascinating, completely strategic game without any random factor. Complexity and variety of this game with all its unexpected turns will inspire you!&#10;&#10;The process:&#10;Both players use their tactical skills to move their tiles and arrange the barragoon pieces to enable them to capture all their opponent`s tiles or to impede their opponent`s progress. &#10;A player has lost when he no longer has any tiles that he can move.&#10;&#10;The barragoon piece:&#10;The barragoon piece is the central element of the game. Each of its side shows another symbol. It blocks or frees the tiles to be moved in specific directions, depending on the direction indicated by the uppermost symbol. If a barragoon piece is captured, it can be placed again on the board at a free chosen position. By this, the players can block or attack the opponent or save their own tiles.&#10;&#10;The clou: &#10;Each time a tile is captured, two new, additional barragoon pieces have to be put on the board. By this, the board becomes more and more crowded and the risk to get locked up increases. At the same time the chance to beat the opponent increases as well.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Pandemic: Contagion",
        "description": "After many years of trying to defeat the diseases that threaten mankind&rsquo;s existence, the tables have been turned.  You are now the disease and guess what?  There is no cure.&#10;&#10;In Pandemic: Contagion, you are competing against other diseases (fellow players) to see who can eliminate humanity. With no cure to be had, the one of you that wipes out all human civilization will come out on top as the most deadly disease ever known to man, may he rest in peace.&#10;&#10;Pandemic: Contagion includes a deck of contagion cards with differing colored borders, city cards with similar colored borders, event/WHO cards, player disease card and disease cubes. On a turn you take two of three possible actions, and you can take the same action twice. Those actions are:&#10;&#10;&#10;     Draw contagion cards equal to your current incubation rate.&#10;     Advance one of three mutations to the next level.&#10;     Spread disease equal to your current transmission rate.&#10;&#10;&#10;When the number of diseases equals the city&rsquo;s population number, the city is wiped out.  The player who placed the final disease earns a special action. The player with the most diseases scores the population number. The two smaller numbers are awarded to those with the second- and third-most diseases.&#10;&#10;Your disease card has three mutations: Incubation (number of cards you can draw), Transmission (number of disease cubes you can spread), and Resistance (number of cubes/cards you can protect). As an action, you can advance a mutation one level by discarding the required number of cards.&#10;&#10;Event cards are drawn at the start of each round and affect everyone during their turn. You might benefit from the card or it could have a negative impact. WHO cards are always bad, but your resistance will lessen whatever the penalty would be based on its level, if you planned ahead.&#10;&#10;Mid-game scoring occurs when the second, fourth and sixth skull comes out.  When a city icon appears, a new city is introduced.&#10;&#10;Once the event/WHO deck runs out or only two city cards remain in play, the game ends, with players conducting a final scoring round to see which virus is victorious.&#10;&#10;",
        "artist": "Marie-Elaine Bérubé,Josh Cappel,Philippe Guérin,Marie-Eve Joly,Chris Quilliams"
    },
    {
        "name": "Nations: The Dice Game",
        "description": "From the humble beginnings of civilization through the historical ages of progress, mankind has lived, fought and built together in nations. Great nations protect and provide for their own, while fighting and competing against both other nations and nature itself. Nations must provide food as the population increases, build a productive economy, and amaze the world with their great achievements to build up their heritage as the greatest nations in the history of mankind!&#10;&#10;Nations: The Dice Game is a game for 1-4 players that takes 10-15 minutes per player and shares many concepts with the civilization-building game Nations while still offering its own challenges. The game is played over four ages (four rounds). During each round, players take turns until all have passed. The available actions are:&#10;&#10;&#10;     Buy a tile&#10;     Build a wonder&#10;     Reroll some or all your dice&#10;&#10;&#10;Buildings and military provide dice. Colonies and wonders provide resources and victory points. Advisors provide rerolls. New tiles provide benefits immediately, so you can roll new dice at once.&#10;&#10;At the end of each round, War and Famine drawn at the start of the round is checked for each player, giving you victory points if you match or beat the values. Books are accumulated and scored. Player order is checked, with high military strength going first in the next round. At the end of the game, whoever has the most victory points wins.&#10;&#10;",
        "artist": "Ossi Hiekkala,Jere Kasanen,Paul Laane,Frida Lögdberg"
    },
    {
        "name": "Heat",
        "description": "Recruit members of your criminal mob, then pull off jobs in the city for cash. Some crimes attract more attention from the police than others, and bringing down the Heat is bad for everybody.&#10;&#10;Heat is a micro-ish card game that plays out over three rounds. Every round, there's a drafting phase where your hand evolves by passing cards to your neighbor and drawing new cards. Then you select which cards from the hand you draft to play, attempting to out-guess the other players while scoring the highest yourself and carefully managing the amount of Heat you have, lest the police come down on you at the end.&#10;&#10;",
        "artist": "Cara Judd"
    },
    {
        "name": "Escape: The Curse of the Temple – Big Box",
        "description": "Escape: The Curse of the Temple is a real-time, cooperative game in which all players must escape from a temple after awakening an ancient curse. Players navigate through the temple by rolling dice and matching symbols to rooms, thereby gaining entry and visibility into adjacent rooms. So the temple &quot;map&quot; randomly unfolds as you explore further...every game is different! But as you explore, don't wander too far! All players must find the exit before the curse seals the adventurers in forever! The real-time aspect is enhanced by a soundtrack that is your timer for the game.&#10;&#10;The Big Box Edition includes:&#10;Escape: The Curse of the Temple&#10;Escape: The Curse of the Temple &#226;&#128;&#147; Illusions (Expansion 1)&#10;Escape: The Curse of the Temple &#226;&#128;&#147; Quest (Expansion 2)&#10;Escape: The Curse of the Temple &#226;&#128;&#147; The Pit (Queenie 1)&#10;Escape: The Curse of the Temple &#226;&#128;&#147; Doomed (Queenie 2)&#10;Escape: Adventurer Stickers (Queenie 3)&#10;Escape: The Curse of the Temple &#226;&#128;&#147; Fountain (Queenie 4)&#10;&#10;",
        "artist": "Oliver Schlemmer"
    },
    {
        "name": "Roll For It! Express",
        "description": "All the fun of Roll For It! in a single card!&#10;&#10;In this solitaire microgame, you get three rolls to score as close to 30 points as possible!  Roll the dice and then place them into the quadrants so that they add up to the target number.  Use the minimum number of dice in each quadrant, or you lose points!  Compare your score to your friends and then start again!&#10;&#10;The score card has 4 scoring sections with a value of 4, 6, 8 and 12 points. Players may use multiple rolls to complete any quadrant(s). However, once a die is placed it cannot be moved or re-rolled.&#10;&#10;If a player successfully utilizes all 6 dice on the gold Calliope squares in the appropriate quadrants they will achieve the perfect score: 30 points!&#10;&#10;Playable in a flash, this is a great game to take with you when gathering with your friends or hanging out at the pub!&#10;&#10;Roll it!  Place it!  Score It!&#10;&#10;",
        "artist": "Ilonka Sauciuc"
    },
    {
        "name": "Rise to Power",
        "description": "Rise to Power is a city-building strategy card game for 2-6 players, set in a futuristic world where companies compete to fulfill the world's power needs.&#10;&#10;The game is set in a futuristic world that has discovered an abundant source of energy, dubbed PRISM. Competing power companies are scrambling to extract as much PRISM as they can to increase their influence by powering districts and ultimately controlling the city's power needs.&#10;&#10;Activating a district card allow players to expand their power grid capabilities and also increases a company's influence.&#10;&#10;Instead of activating a district, a player could instead use the card's exchange ability to perform a powerful action at the cost of giving up the district, placed on the The Exchange for others to take.&#10;&#10;Players take turn extracting PRISMs, and using it to fulfill district contracts offered by the government. As players power districts, their play area will reflect the state of their city influence. When powering districts, players are rewarded for paying the exact amount, portraying efficiency and promoting careful planning.&#10;&#10;When a player activates their 8th district, the game enters the last round phase. At the end of the game, players with the highest influence points, earned by activated districts and their private agenda is declared the winner.&#10;&#10;",
        "artist": "Nick H. Smith"
    },
    {
        "name": "The Lord of the Ice Garden",
        "description": "The world of Midgaard, created by author Jaros&#197;&#130;aw Grz&#196;&#153;dowicz in The Lord of the Ice Garden novel series, is inhabited by a race very similar to humans, filled with magic and for a reason stuck at the cultural and technological level of medieval Viking world. The arrival of scientists from Earth disturbs its fragile balance. The power gained by controlling magic changes the scientists &ndash; they become possessed by the lust for making this world better. They become gods, who are willing to sacrifice any life, except for their own, of course, to accomplish their &ndash; great, according to them &ndash; ideas.&#10;&#10;Players impersonate the scientists struggling for the domination over The Coast of Sails and also for staying on Midgaard, because soon after them another person arrives to this world: Vuko Drakkainen, highly trained agent, whose task is to find the members of scientific expedition and send them back to Earth &mdash; or as a last resort make them vanish. Will the players, as powerful gods, allow him to do it?&#10;&#10;From the first turn, the players are tossed in the middle of war. They will feel the adrenaline, fear, pain and the heat of a battle. They will smell blood and sweat, hear the clash of arms and the moaning of wounded and dying.&#10;&#10;The Lord of the Ice Garden takes place on The Coast of Sails, which is divided into several regions. The main goal is fighting for the domination over those regions. A region is dominated by the player with the most influence in it. Dominating the region allows players to collect its resources (M-factor, gold, population), also to win victory points in specific turns, and to accomplish their own goals. Each player has unique winning conditions and special units.&#10;&#10;&#10;    Olaf Fjollsfinn &ndash; uses Ice Drakkars to seduce/kidnap six dwellers of The Coast of Sails to the Ice Garden.&#10;&#10;&#10;&#10;    Passionaria Callo &ndash; sends nightmares on the controlled regions and tries to isolate them. She needs to isolate two of them.&#10;&#10;&#10;&#10;    Pier van Dyken &ndash; greedy collector of M-factor. When he dominates a region with  a magical reserve, he may move it towards his headquarters, The Thorn. He needs to absorb four magical reserves.&#10;&#10;&#10;&#10;    Ulrike Freihoff &ndash; spreads her religion. When she dominates a region where she also has a special unit called The Enlightened One, she may build a Red Tower there. Six of those grant her victory.&#10;&#10;&#10;There is also Vuko, who came to evacuate the scientists and clean up their mess. Each turn he goes to the region, where the player with least reputation/morality (it decreases each time the player uses magic) has the most influence. Such a visit is nothing nice &ndash; Vuko kills one special unit of that player in this region and lowers his/her influence there.&#10;&#10;The game may end in one of the three ways:&#10;&#10;    Meeting the player's unique victory condition &ndash; the game ends and that player is the winner,&#10;    After specified number of turns game ends and the player with most victory points is the winner,&#10;    The Dead Snow token reaches the end of its track &ndash; each use of magic shakes the balance of Midgaard. If the players exceed the limit of changes that world and its gods can accept, the game ends and the winner is the player with the highest reputation.&#10;&#10;&#10;&#10;&#10;INITIATIVE PHASE:&#10;During the initiative phase players decide how many action tokens they will have for the current turn and also determine the player order during the Planning Phase. Moreover, they can initiate scoring of the regions by moving their initiative tokens. In the advanced mode they also determine the order of action fields resolution.&#10;&#10;PLANNING PHASE:&#10;Players, one by one in the order determined in the Initiative Phase, place their action tokens on selected action fields.&#10;&#10;ACTION PHASE:&#10;Players perform actions in the action fields, in the order determined by the placement of tokens.&#10;&bull; Viper's Nest &ndash; player receives one token of any resource. They can also exchange resources.&#10;&bull; Influence &ndash; player may sacrifice up to two population tokens to place as many influence tokens on the region(s) where they already have at least one influence&#10;&bull; Move &ndash; player may sacrifice up to two gold tokens to make as many moves of their influence tokens and/or special units to the neighboring region(s)&#10;&bull; Voracious Mountain &ndash; player may sacrifice population to move any number of their influence tokens and/or special units from one region to any other region&#10;&bull; Raven's Shadow &ndash; player may raise his/her reputation or use a magic token to get rid of the disadvantageous token of contact with Vuko.&#10;&bull; Magic &ndash; allows the player to do any of the three actions: translocate the M-factor, summon special units of the given level, add a new ability to the special unit. Each of those actions results in moving the Dead Snow token up on its track and decreasing the player's reputation.&#10;&bull; Activation (automatic field) &ndash; after resolving the actions players may activate the abilities of their special units. The order of activation of given abilities is strictly determined. After the activation the situation on the board may change drastically.&#10;&bull; Vuko Drakkainen (automatic field) &ndash; each turn Vuko must go to another region. Its figure is placed in the region, where the most immoral player has the most influence. That player receives a conact token decreasing his/her influence, and also loses one special unit in this region (provided he/she had any). In the advanced mode players will be able to equip Vuko with more abilities, that will activate in specific moments of the game.&#10;&#10;DOMINATION PHASE:&#10;Players collect victory points and resources from the regions, and accomplish their unique goals.&#10;&#10;",
        "artist": "Dominik Kasprzycki"
    }
]