[
    {
        "name": "Polterdice",
        "description": "Polterdice is set in a haunted mansion in which treasures have been stashed away by ghosts.&#10;&#10;Players move their men (&quot;meeples&quot;, if you will) up sets of stairs hoping to be the first to reach the top of the staircase.  Which staircases you can move up and how much you can move are determined by rolling 8 dice and combining them into pairs.  When one of a player's men reaches the top of a staircase, he gets treasure as well as the option of challenging the Polterdice (ghosts of the former inhabitants of the mansion whom you must &quot;capture&quot; for additional treasure) for more money.  If he loses the challenge, it goes to the next player on the staircase and so-on until someone wins or everyone loses.  The key mechanic is deciding how to &quot;spend&quot; your dice rolls on which men in which part of the mansion.&#10;&#10;The designers note that the game is inspired by Can't Stop, and is therefore dedicated to Sid Sackson (who died during the production of the title).&#10;&#10;",
        "artist": "Erika Luppi"
    },
    {
        "name": "Star Trek: The Enterprise^4 Encounter",
        "description": "Captain Kirk, and the crew of the Enterprise, are sent on a mission to re-establish contact with Trelane, the Squire of Gothos.  Trelane captures them and forces them to play a diabolical game.&#10;&#10;Trelane creates four Enterprises (one for each player) and places a few crew members on each.  The remaining crew are scattered, marooned on worlds from their past.  Sensors on each of the four Enterprises sense each other as Klingon battle cruisers. Each player must scour the galaxy and find a full crew compliment by gaining all six crew specialties and locking them down.&#10;&#10;Once a player has locked down Command, Science, Medical, Navigation, Communication, and Security positions, he wins the game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Battle of the Sexes Card Game",
        "description": "From the box:&#10;&#10;Find out once and for all which is the superior sex.  This fun, fast-paced party game tests one's knowledge of the opposite sex with gender-based questions.  Does she know the usual number of lugs on a whee?  Can he think of the best way to stop a run in stockings?  &#10;&#10;The winner is the first to correctly answer three consecutive questions covering a wide range of topics.&#10;&#10;Includes 50 cards with 144 questions.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Maelstrom",
        "description": "This game was originally published in the summer of 2001 as collectible game &quot;Vortex&quot;, and was promoted with free demo-kits distributed to the hobby industry in the spring of 2001. &quot;Vortex&quot; used a clever connected-hexagons-as-board game system that would later inspire other games in the &quot;hexagon mass as a board&quot; category.&#10;&#10;From the FFG Website:&#10;&#10;Maelstrom is a fixed, stand-alone 2-4 player board game that contains every common and starter flat from the Vortex fantasy battle game - 54 flats in all, over 150 tiles. Maelstrom is the perfect way for strategy board gamers who don't like collectibility to experience the game, and is an ideal way for Vortex fans to fill out their collections.&#10;&#10;The Masters of the Void are at war. Using the powers of the Vortex, they tear holes in the fabric of existence, recruiting powerful allies and enslaving lands, cities, and beasts of the wild. Magic, creatures of unimaginable power, and engines of destruction are bound to the Vortex and equally engulfed in the bitter struggle between the Masters.&#10;&#10;Designed by Diskwars creators Tom Jolly and Christian T. Petersen, Maelstrom is a game of fantasy battles, magic, and resource management using a unique hexagonal tile game field that grows as players add allies, land, and relics to fill the void that surrounds the Vortex. Game play is fast and furious, as players seek to gain mastery over the battlefield, shaping the very foundation of the Vortex with each strategically placed tile. Only one can rule the void. Will you?&quot;&#10;&#10;This is the game Vortex, packaged in a non-collectible format.  The box contains a ton of tiles.  Vortex includes 92 &quot;flats&quot; of tiles total (16 &quot;fixed&quot;, 38 &quot;standard&quot;, and 38 &quot;rare); this box contains all of the fixed and standard flats (for a total of 54 flats).  Note that events and relics are not included in this game, as they are in Vortex (all events and relics are rare).  Otherwise, it's the same game as Vortex, and you can even add Vortex booster packs to this game to increase your collection.  That having been said, you really don't need to.  Events DO add to the game experience, but they're not necessary -- this is a complete game without any further purchases.&#10;&#10;Expanded by:&#10;&#10;    Maelstrom Expansion Pack&#10;&#10;&#10;&#10;&#10;",
        "artist": "Mahmud Asrar,Andy Brase,Louis Frank,Glen Ostrander,Ramón Pérez,Hian Rodriguez,Scott Schomburg,Brian Schomburg,Frankie Washington,Kieran Yanner"
    },
    {
        "name": "Richelieu",
        "description": "The theme is the &quot;journ&eacute;e des dupes&quot;, in 1630, when Mary of Medici tried to have the young Louis the XIIIth dismiss the Cardinal of Richelieu. All the cards are placed face up on the game table, in 4 rows. Players, in turn, can take one or two cards at the end of the rows, the goal being to have the majority of cards in each color, as well as with some symbols.&#10;&#10;Belongs to the Ravensburger Fun For 2 Series.&#10;&#10;Re-implements:&#10;&#10;&#10;     Kardinal & K&#195;&#182;nig: Das Kartenspiel&#10;&#10;&#10;",
        "artist": "Oliver Freudenreich"
    },
    {
        "name": "Trivial Pursuit: Warner Bros. All Family Edition",
        "description": "Another version of Trivial Pursuit where players answer questions based on Warner Brothers movies, television series and cartoons.  Contains two separate sets of cards, one regular set for adults, and picture cards for kids.&#10;&#10;The categories in this set are:&#10;&#10;    Movies&#10;    Television&#10;    Cartoons&#10;    Classics&#10;    Behind the Scenes&#10;    Anything Goes&#10;&#10;&#10;&#10;&#10;&quot;Th-th-that's all Folks!&quot;&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "The Best of Dragon Magazine Games",
        "description": "This is a set of six games previously published in Dragon Magazine, collected in one box, with better components, maps, and playing aids:&#10;&#10;Ringside (Issue #38)&#10;Food Fight (Issue #44)&#10;Search for the Emperor's Treasure (Issue #51)&#10;File 13 (Issue #72)&#10;The Baton Races of Yaz (Issue #82)&#10;King's Table, aka Hnefatafl (Issue #128)&#10;&#10;For a complete list of Dragon Magazine games, check out this wiki:&#10;Dragon Magazine&#10;&#10;",
        "artist": "Dennis Kauth,Dale Oldfield,Tom Wham"
    },
    {
        "name": "Brute Force: The War in the West, 1940-1945",
        "description": "The second installment in the Clash of Arms Games's Struggle for Europe series - the first was War Without Mercy.&#10;&#10;Brute Force highlights three pivotal campaigns from the West Front: &#10;&#10;    Norway, &#10;    The 1940 Blitzkrieg in the West&#10;    Operation Overlord. &#10;&#10;&#10;&#10;&#10;In each, both commanders are faced with numerous operational decisions. Proper allocation of the limited air and naval support is just as important as deciding manpower assignments. Both sides have opportunities to make numerous decisions affecting the outcome of the campaign. For the Allied commander, deciding where and when to commit the small but powerful BEF in 1940 is a choice as difficult as that facing the Axis commander concerning his limited panzer forces in 1944.&#10;&#10;Units are Corps, Divisions, and Brigades. One hex equals 30 miles. One turn is about 2 weeks.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Kids of Catan",
        "description": "A simplified building game for kids, based on the immensely popular The Settlers of Catan, wherein all players take part in the game at all times. The high quality wooden pieces are suitable not only for the game, but also for &quot;free play.&quot;&#10;&#10;Each player in turn rolls the die, and rotates the village plan clockwise that number of spaces. Resources are collected by each player depending on where their piece lands, and if one of each resource type has been collected by any player, that player may place one of their buildings on the village plan. If a player has built all of their buildings, they may build the Town Hall. The first player to build the Town Hall wins.&#10;&#10;Belongs to the Catan Series.&#10;&#10;",
        "artist": "Tanja Donner,Michaela Kienle,Annette Nora Kara,Susanne Reichardt"
    },
    {
        "name": "Paris Paris",
        "description": "Every year, millions of tourists visit Paris and the many attractions the city has to offer. To the joy of the Parisian business owners &ndash; represented by the players &ndash; the tourists leave a substantial amount of their vacation money in the Caf&eacute;s, Bistros, and Souvenir shops. There are five tour bus operators that offer different routes. The places where the most successful tour buses stop are great places to open businesses that cater to tourists. Then the next time the tour comes by, the owners can reap big rewards for their investments. The player who earns the most money will win the game.&#10;&#10;Expanded by:&#10;&#10;    Paris Paris: Zusatzkarten Expansion&#10;&#10;&#10;&#10;&#10;",
        "artist": "Michael Schacht"
    },
    {
        "name": "Victory in the West",
        "description": "Victory in the West: Plan Yellow, The French Campaign 1940, is a realistic two-player game that accurately recreates the 1940 campaign in all its aspects except one: the outcome is totally up to you. The game's centerpiece is an options system that lets the Allied player trade Victory Points for changes to his armies and policies that might (or might not) have changed history. Can you, as the Allied commander, repel the Germans with the forces on hand in 1940? How about if you train them better? Or give them a better command structure? Or provide them with more and better anti-aircraft an anti-tank guns? What do you think is the key to victory in the west? Can you, as the German commander, still beat the Allies if the French Army is motorized like the BEF? And how does your strategy change if the French don't build their Maginot Line, but do build a bigger and better air force? Do you still try to sneak through the Ardennes forest with your Panzers? Or do you ignore Allied bombers and wheel across the open plains of northern Belgium in a repeat of the 1914 Schlieffen Plan? Or do you do the unexpected and land a left hook through the Alsace? Your commanders await your orders. The future of Europe is in your hands.&#10;&#10;10 May, 1940 ... The German Wehrmacht opened its long-awaited campaign in the West by smashing across the frontiers of Belgium and Holland. For the German High Command, it was seen as a daring move. Hitler's fledgling legions faced the combined armies of France, Britain, Belgium and the Netherlands. These Allied forces had more and better weapons of almost every type, and at least two of the opposing armies, those of France and Britain, were considered to be the best in the world. The Germans had the element of surprise and the new Blitzkrieg tactics of mobile warfare.&#10;&#10;Six weeks later, it was all over. The British Expeditionary Force (BEF) had been driven from the continent and the French, Belgians, and Dutch had all capitulated. Hitler had achieved a victory in the west, and the world would never be the same.&#10;&#10;But, what if? It didn't have to happen that way ... Bad generalship and correctable flaws in their armies hastened the Allied defeat. What if the High Command had bothered to stay in radio contact with its armies on the frontier? And had then reacted promptly to the developing situation? What if the Maginot Line had been extended to cover the Meuse crossings at Sedan where Guderian's Panzers broke into the Allied rear? What if the BEF had included a strong British mobile corps that could have fought Rommel's Panzers on even terms at Arras? What if the French had prepared to meet the Blitzkrieg by building eight tank divisions instead of three? Or by mechanizing their cavalry the way the Germans did after the Polish campaign? Or even by developing their own blitzkrieg doctrine? The Allies could have taken any or all of these actions, and any of them would have altered the campaign's course. But which ones would have changed the outcome?&#10;&#10;Game Scale:&#10;Game Turn: 2 days&#10;Hex: 6.8 miles / 11 kilometer&#10;Units: Battalion to Army&#10;&#10;Game Inventory:&#10;One 22 x 34&quot; full color mapsheet&#10;One 17 x 22&quot; full color mapsheet&#10;Three dual-side printed countersheets (720 1/2&quot; counters)&#10;One 32-page Victory in the West rulebook&#10;One 8-page Victory in the West Example of Play booklet&#10;One 4-page Victory in the West Design Notes booklet&#10;Five dual-side printed Player Aid Cards&#10;One 10-sided dice&#10;&#10;Solitaire Playability: High&#10;Complexity Level: Medium&#10;Players: 2 or more&#10;Playing Time: 2-20 hours&#10;&#10;DESIGNER: David James Ritchie&#10;DEVELOPER: Kevin Boylan and Gene Billingsley&#10;ART DIRECTOR: Rodger B. MacGowan&#10;MAP ART: Mark Simonitch&#10;&#10;",
        "artist": "Gene Billingsley,Sylvain Cordurié,Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "A Winter War",
        "description": "(from the introduction:)&#10;&#10;A Winter War is a detailed simulation of the Soviet invasion of Finland during the winter of 1939-40. [...]&#10;&#10;Game components:&#10;&#10;    Rules booklet (28 pages)&#10;    Orders of battle booklet (16 pages)&#10;    Europa Map 35 [34&quot;x22&quot;]&#10;    Counter sheets 58 &amp; 59 (2 sheets) - Accessory counter sheet #2 (1/2 sheet) [Total: 656 counters]&#10;    Charts &amp; Tables:&#10;        Two Combat results / Terrain effects charts&#10;        Two Unit identification charts&#10;        Two Game Play charts / Master sequence of play&#10;        Two Game charts (one Finnish, one Soviet)&#10;        One Victory chart / Coast defence chart&#10;        One Europa master terain key&#10;    &#10;    Two dice&#10;&#10;&#10;&#10;&#10;",
        "artist": "Winston Hamilton,Barbie Pratt"
    },
    {
        "name": "Balkan Front",
        "description": "Balkan Front is a detailed simulation of the Axis campaigns of conquest in the Balkans, from autumn 1940 to summer 1941. It covers the failed Italian invasion of Greece, the German blitzkrieg that overran Yugoslavia and Greece, and the German airborne assault on Crete.&#10;&#10;First (1990) Edition Game components: &#10;&#10;    Two maps (in two full sheets as 14A &amp; 15B or six quarter sheets as 14A:NW, 14A:NE, 14A:SW, 14A:SE, and 15B:NW, &amp; 15B:NE)&#10;    Four counter sheets (Europa 20A, 21A, 22A and Europa ACS-2 Sheet)&#10;    Rules booklet (includes Rules and Order of Battle)&#10;    Charts &amp; Tables:&#10;        Victory Chart&#10;        Turn Record and Weather Table&#10;        Axis Game Chart&#10;        Allied Game Chart&#10;        Terrain Effects Chart/Combat Results Tables (x2)&#10;        Unit Identification Chart (x2)&#10;    &#10;    Two six-sided dices&#10;&#10;&#10;&#10;&#10;Second (2002) Edition Game components:&#10;AS ABOVE, EXCEPT Rules and Charts printed &quot;2nd Edition&quot; AND:&#10;&#10;    Four counter sheets, totalling 1120 counters (Europa 20A-R, 21A-R, 22A-R and Europa Universal Marker Sheet) - dated 1999&#10;    Revised Order of Battle (20 pages) - dated 2000&#10;&#10;&#10;&#10;&#10;",
        "artist": "Winston Hamilton,Barbie Pratt"
    },
    {
        "name": "Bloody 110",
        "description": "Bloody 110 - The Battle for Clervaux, December 16-17, 1944 is the first game in the Tactical Combat Series (TCS) by The Gamers and it features the vital two day delay of the 2nd Panzer Division by elements of the US 28th Infantry Division along the road to Bastogne on December 16th and 17th, 1944. The actions of the handful of Americans represented by the game were critical in setting the stage for the more famous siege of Bastogne itself. It was their defense that provided the time needed for other units, including the 101st Airborne, to make it to Bastogne in order to defend it. Without this successful defense, Bastogne would surely have fallen and the road would have been clear to the Meuse.&#10;&#10;The actions of the handful of Americans represented by the game were critical in setting the stage for the more famous siege of Bastogne itself. It was their defense that provided the time needed for other units, including the 101st Airborne, to make it to Bastogne in order to defend it.&#10;&#10;Game Scale:&#10;Game Turn: 20 minutes&#10;Hex: 125 yards / 114 meters&#10;Units: Infantry platoons, individual vehicles&#10;&#10;Game Inventory:&#10;Two 22 x 34&quot; full color maps&#10;Three dual-side printed countersheets (840 1/2&quot; counters)&#10;One 32-page TCS specific rulebook&#10;One 14-page Bloody 110 specific rulebook&#10;Two 6-sided dice&#10;&#10;Solitaire Playability: Medium&#10;Complexity Level: High&#10;Players: 2 or more&#10;Playing Time: 1-30 hours&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Britain Stands Alone",
        "description": "Britain Stands Alone allows players to fight one of the most intriguing &quot;what if's?&quot; of WWII.&#10;&#10;The game explores the hypothetical possibilities of Operation Sea Lion, assuming that the Luftwaffe had succeeded in winning air superiority, and then gone on to the inflict serious losses upon the Royal Navy.&#10;&#10;Given their circumstances, could the Third Reich have won WWII in the fall of 1940?&#10;&#10;The game features:&#10;&#10;    Integrated air-sea movement and interception capabilities&#10;    Combined arms combats&#10;    Rules for Brandenburgers, Churchill, the Royal Family, etc&#10;    Additional Campaign starting with the Battle of Britain, adjusting the invasion possibilities based on the outcome of the air battle.&#10;&#10;&#10;&#10;&#10;",
        "artist": "Rodger B. MacGowan"
    },
    {
        "name": "The Great Battles of Julius Caesar: The Civil Wars 48-45 B.C.",
        "description": "Alea iacta est... 49 B.C. Rome is in turmoil. Armed mobs rule the streets. The First Triumvirate - overseers of the last days of the Roman Republic - has disintegrated. The Senate and the People have two options: on the one hand is the overweening ego, ambition, but limited military vision of Gnaeus Pompeius Magno - Pompey the Great. On the other hand is one of history's greatest - and most schemingly ambitious - political/military figures, the conqueror of Gaul, Caius Julius Caesar. In Italy, at the edge of the Rubicon River, word of the stalemate has reached Caesar and his XIII Legion. He intones, for posterity: Ialea acta est... the die is cast.&#10;&#10;Great Battles of Julius Caesar recreates 5 battles, using the GMT Great Battles of History (GBoH) basic system:&#10;&#10;    Pharsalus (Tessaly), 48 B.C.&#10;    Dyrrhachium-Lesnika (Illyria), 48 B.C.&#10;    Thapsus (Africa), 46 B.C.&#10;    Ruspina (Africa), 46 B.C.&#10;    Munda (Spain), 45 B.C.&#10;&#10;&#10;&#10;&#10;",
        "artist": "Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "Campaign to Stalingrad",
        "description": "Campaign to Stalingrad is a game simulating the Russo-German War in southern Russia from June to December 1942. Three scenarios are included: the German summer offensive (Fall Blau), the Soviet winter offensive (Uranus), and a campaign game that covers the entire period.&#10;&#10;Campaign to Stalingrad is a game of moderate complexity. Each turn represents 3 days, each hex equals 16 kilometers. Most units are divisions, however Soviet Tank, Cavalry, and Mechanized Corps, along with independent brigades and regiments are also included.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Command Decision",
        "description": "Command Decision is a set of miniatures rules which enables players to refight operational-level combined arms engagements during WWII.&#10;&#10;It shows the importance of each element of the combined arms team and does so in a fast-playing format that uniquely captures the pace and tempo of modern mobile combat.&#10;&#10;Game Components include:&#10;&#10;One rules book&#10;One data chart booklet&#10;One organization booklet&#10;One campaign booklet&#10;One rules summary folder&#10;Four game reference charts&#10;One sheet of markers&#10;&#10;",
        "artist": "Steve Venters"
    },
    {
        "name": "Steam Tunnel",
        "description": "From Website:&#10;&#10;In the year 2185, in the steam-driven titanium mine deep under the surface of Io,.... oh, who are we kidding. Steam Tunnel is a great game with no particular basis in reality. Compete for control of tunnels in an abstract game with a perfect mix of strategy and luck.&#10;&#10;Battle for control of tunnels in this purely abstract strategy card game by James Ernest. On a wrap-around board made of 36 cards, players flip and capture cards that show sets of tunnels. Connect high-scoring end-caps to score points. The longer your tunnel, the better. A truly engaging strategy game with a lot more involved than you think.&#10;&#10;Steam Tunnel is part of the Hip Pocket Games series.&#10;&#10;Awards&#10;&#10;    2003 Listed in GAMES Magazine's GAMES 100&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Trivial Pursuit: Walt Disney Family Edition Card Set",
        "description": "This is yet another version of the Trivial Pursuit Master game featuring Disney questions.&#10;&#10;It contains the following categories:&#10;&#10;    World of Places&#10;    World of People&#10;    World of Science&#10;    World of Music&#10;    World of Fantasy&#10;    World of Leisure&#10;&#10;&#10;&#10;&#10;Like other expansions it contains two boxes of questions. The blue box has questions for adults and the gold box has questions for younger players.  Every card has a mixture of generic trivia questions and Disney questions, with at least one Disney question per card.&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "Azuma",
        "description": "Azuma is similar to Spoons  It comes with plastic sticks about 8 inches long, with stickers to mark the colors.  There is one fewer stick than the number of players, so each round, one player will not get a stick.&#10;&#10;Players are dealt a hand of 7 cards.  All players pass a card to their neighbor when the dealer calls out &quot;Azuma&quot;.  If no one has a &quot;winning&quot; hand, the dealer calls &quot;Azuma&quot; again and another card is passed.  This repeats until one player gets either:&#10;&#10;    one set of 4 and one set of 3 matching cards or&#10;    3 bomb cards&#10;&#10;&#10;&#10;&#10;When a player has a &quot;winning&quot; hand, she quietly grabs a stick and other players must suddenly rush to grab the remaining sticks.  Points are scored by who got which color sticks.&#10;&#10;There is also a penalty for &quot;faking&quot;, which is pretending to start grabbing a stick to get other players to grab early before anyone has a &quot;winning&quot; hand.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Wonderful World of Disney Trivia Game",
        "description": "From the box:&#10;&quot;Test your Disney knowledge in 5 categories:&#10;&#10;    Animation&#10;    Film&#10;    Song&#10;    Personalities&#10;    Mousellaneous. &#10;&#10;&#10;&#10;&#10;With a deck of questions for adults, and a separate deck for kids, it's a game the whole family will enjoy!&quot;&#10;&#10;Put out by Disney with Mattel as a home-grown trivia game, it offers several unique characteristics: the game comes in a high quality tin/metal film can, and has 'mickey' shaped player pawns with stackable mouse ears rather than wedges.  The playing board is shaped like the iconic Mickey mouse head, with ears that fold inward for storage in the round container.&#10;&#10;All questions are Disney-related (unlike Trivial Pursuit that has only 1 or 2 Disney questions per card.)&#10;&#10;Includes 400 Adult cards (2000 questions) and 100 Kids' cards (500 questions) with a picture clue.&#10;&#10;For the true Disney-ologist, questions will be easy and playtime quick, but for just a casual fan, it is more challenging.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Clue II  VCR Mystery Game",
        "description": "The butler, Mr. Didit, is back in an all new mystery of 18 new cases.  The over-the-top acting and scripting is still there, along with a clever deduction game in the tradition of the original board game Clue.&#10;&#10;Includes characters from both the original and the Master Detective versions. Players must discover who murdered whom with what weapon in what room, but they must also discover who's who because each player plays one of the suspects and each case may involve more than one murder.&#10;&#10;This game is a sequel to the original Clue VCR Mystery Game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Descent on Crete",
        "description": "Descent on Crete is a tactical, company level simulation of the largest German airdrop of World War II.&#10;&#10;The entire scope of the operation is taken in, as players are given the command decisions throughout the operation. Special rules covering the air drop, air strikes, supply, leadership, fatigue, and British Armour are included. Depending on the scenario being played, players gain points for various objectives and for eliminating their opponent's units  strength points.&#10;&#10;The player with the most points, after a set number of turns, is the winner.&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "Frigate",
        "description": "Frigate simulates naval battles of the 18th and 19th centuries in 20 different scenarios.&#10;&#10;Battles involving the American, British, French, Spanish, Italian, and Dutch are represented.  They range from single ship combats to full scale battles, like Trafalgar, which involved more than 70 ships.  Ranged combat, grappling, and boarding actions are all included.  Movement is both plotted and simultaneous. Wind effects and command control also play a big part of the game. 255 counters&#10;&#10;Victory conditions are dependent on the scenario played.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "10 Days in Europe",
        "description": "&quot;There is much to be discovered in Europe! Many roads lead to success in this exciting travel game - you just have to find the right one. Exchange your cards cleverly and find your way through Europe quickly to win. Ten cards must show continuous travel either by land, sea or air.&quot;&#10;&#10;Europa Tour (copyright 2002) is possibly the first in the 10 Days in series while 10 Days in Europe is the third installment in the 10 Days in series.&#10;&#10;Gameplay&#10;All players pick tiles up one at a time, examining them and placing them onto any empty spot on their tile holders. Then, in turn, each player draws one tile and may replace one of their lined-up tiles with it. (Tiles may not be rearranged.) Tiles are drawn from one of the face-up discard piles or a face-down pile. The drawn card or replaced card is then discarded into one of the face-up piles. The first person to have all ten tiles satisfy the travel connection requirements wins.&#10;&#10;Connection requirements:&#10;By Foot If a country is next to or connected to another country on the map, their tiles may be placed side-by-side&#10;By Air  Any two countries of the same color may be connected by an airplane of that color (its tile in between them)&#10;By Ship  If two countries can be linked by ship a ship can connect them (a ship tile placed between them)&#10;&#10;Contents:&#10;&#10;    60/7 cardboard tiles - 40/8 country tiles, 9/10 ship tiles and 5 pairs of plane tiles (in 5 colours)&#10;    4 trip planners (tile holders)&#10;    1 game board showing a map of Europe, each country depicted in one of 5 colors &#10;&#10;&#10;&#10;&#10;Differences between Europa Tour and 10 Days in Europe&#10;&#10;    Europa Tour has 5 face-up discard piles, a board with 40 countries, 40 country tiles and 10 identical ship tiles. A ship can connect 2 countries joined by a dashed line.&#10;    10 Days in Europe has 3 face-up discard piles, a board with 42 countries, 48 country tiles (6 duplicates), 4 Atlantic, 3 Mediterranean and 2 Baltic ship tiles. If a sea or ocean borders two countries, a ship can connect them.&#10;&#10;&#10;&#10;&#10;",
        "artist": "Grafik Studio Krüger,John Kovalic,Cathleen Quinn-Kinney"
    },
    {
        "name": "Mordred",
        "description": "A game in which players take the role of one of King Arthur's knights in an attempt to prevent Mordred from taking over Wales.&#10;&#10;Players roll dice, balancing risk against reward.  Reward is in the form of build points, which can be used to build towns, castles, and wage combat against Mordred.  Risk is that of aiding Mordred in his expansion across the countryside.&#10;&#10;The game ends with an assessment of the victor:  If King Arthur has more towns/castles in play than Mordred has men on the board, then the player with the most victory points is the winner.  If Mordred has more men in play, then the player who aided Mordred the least is victorious.&#10;&#10;",
        "artist": "Peter Dennis"
    },
    {
        "name": "Syzygy",
        "description": "Syzygy is a real-time crossword-puzzle building game.&#10;&#10;Each player starts with a number of tiles, and attempts to build them into a network of words.  The first player to use all his/her tiles calls 'Draw' and everyone must draw an additional tile.  Repeat until all tiles (&gt; 300) are used.  Crosswords can be rearranged as needed until the game ends.&#10;&#10;Winner is person with fewest unused tiles.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Tet Offensive",
        "description": "On January 30, 1968 the combined forces of the Viet Cong and the North Vietnamese Army launched a countrywide offensive directed at the major cities and towns of Vietnam.  The offensive was unprecedented in its scope and violence and would eventually prove to be the deciding battle of the war.&#10;&#10;The game, in somewhat abstract terms, covers all of the important events of the battle. Morale plays a major part of the game, in fact the way to win is by demoralizing your opponent.&#10;&#10;Included in the rules are variants, including a 4-player version, and historical commentaries and analysis.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Europe Aflame",
        "description": "Europe Aflame is a game of the land, sea, and air combat fought in Europe and the Middle East during World War II.  Each player commands one of the major alliances of the war... choosing strategies, building forces, and conducting campaigns as supreme commander.&#10;&#10;Rules are included for movement, combat, special units, supply, industry, invasion and conquest.  It should be noted that the units are all placed in small plastic holders so that they stand up on the map... all markers lie flat.&#10;&#10;Three short scenarios and a complete Campaign game are included.  Victory conditions depend on the scenario chosen, but in most cases in depends on control of industrial points.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Die Dracheninsel",
        "description": "An adventure on to the Island of Dragon, where players try to reach for treasure chests while crossing through different terrains.&#10;&#10;Players need to bring back a treasure to their own boat but in order to do so, players must cooperate with other since a chest is too heavy to carry alone.  There are two dragons that get in the way of players.  The one who brings back most treasure chests to their boat wins this game.&#10;&#10;This game has plenty of interaction between players, that may be cooperation or betrayal, but its a light and fun experience.&#10;&#10;",
        "artist": "Andrea Boekhoff"
    },
    {
        "name": "1863",
        "description": "1863 is a Civil War game covering the battles of Gettysburg, Fredericksburg, Brandy Station and the hypothetical Battle of Mine Run&#10;&#10;Contents&#10;400 die-cut counters&#10;Two 22&quot; x 34&quot; backprinted Mapsheets&#10;One Basic Rules Booklet&#10;One Advanced Rules Booklet&#10;One Scenario Booklet&#10;Two Charts &amp; Tables sheet&#10;Two 6-sided dice&#10;&#10;Time Scale: 1-1.5 hours per turn&#10;Map Scale: 275-425 yeards per hex&#10;Unit Scale: Brigade&#10;Players: 1-2&#10;Playing Time: Per Scenario; 1-2 hours Basic; 4-10 hours Advanced&#10;&#10;",
        "artist": "Joy Cohn,Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "Twister",
        "description": "A large vinyl playing mat is placed on the floor, with a 6 x 4 array of spots, each spot about 6 inches in diameter. The spots are colored red, blue, yellow, and green. A player is chosen to moderate, and the rest of the players, up to 4, stand on the play mat with their feet on different spots.&#10;&#10;Each turn consists of the moderator spinning a spinner, which gives a result matching a random color with a random element from the set (left hand, right hand, left foot, right foot). Each player must put the relevant bodypart on the relevant color spot. If the bodypart is already on a spot of that color it is moved to another spot of the same color. No two players bodyparts can share the same spot. If a player falls or touches an elbow or knee to the ground they are eliminated.&#10;&#10;Iterate until one player remains.&#10;&#10;This classic party game became an overnight hit when on May 3, 1966 when Johnny Carson played it during the Tonight Show with Eva Gabor (see: http://www.boardgamegeek.com/image/104221).&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Hungry Hungry Hippos",
        "description": "This children's game is as much of a toy as it is a game. Each player has a plastic hippo that is arranged around a plastic arena. When you push the tail it will reach its head onto the playing field - perhaps trapping one or more marbles to be pulled back to a private player marble gutter, perhaps just sending marbles bouncing around the playing field.&#10;&#10;Some marbles are released onto the playing area; players attempt to get their hippos to eat as many marbles as possible.&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "Lie Detector",
        "description": "Lie Detector includes a small plastic non-electronic 'Lie Detector Machine', a plastic peg board for keeping score, and numerous 'Arrest', 'Summons', 'Secret Information', and 'Suspect' cards.&#10;&#10;Of the 24 suspects, one of them has committed a crime. The players have a number of turns to find the guilty party by interrogating suspects with the Lie Detector machine.&#10;&#10;To play Lie Detector, the Suspect cards are divided among the game players.  One of the six square 'Guilty' cards is inserted into the back of the Lie Detector machine so that no one knows which suspect is the criminal; each 'Guilty' card has four suspects on it, with the guilty suspect being determined by the orientation in which the card is inserted.&#10;&#10;On their turn, each player questions a suspect by taking the  suspect's card, placing it over the front of the Lie Detector and inserting the Lie Detector's wand through a hole in the card and into the Lie Detector itself.  If the testimony is false, a bell rings and a needle on the machine points to &quot;False&quot;.  If it is true, no bell rings and the needle points to &quot;True&quot;.  (e.g. - The Racketeer says &quot;the Suspect has a 'Big Jaw'... if it comes up 'True' you know that one of the six suspects with a big jaw committed the crime)&#10;&#10;Also included in the game are special 'Secret Information' cards. These cards have testimony that is known only to the player who own the cards.&#10;&#10;By process of elimination, the suspects are narrowed down, until a player feels confident that he can make a successful accusation and 'make an arrest'.  He checks the guilty card in the machine.  If he is right, he gets 5 points plus bonus points for the number of face-up suspects still showing on the table.&#10;&#10;Additional rounds are played until one player's score is 25 points of more.&#10;&#10;Mattel re-issued this game as Spy Detector with different artwork, and it did not sell nearly as well.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Aliens vs. Predator",
        "description": "A collectible card game set in the worlds of the Aliens and Predator films.  From the starter box: &quot;Enjoy the deadly competition between three very dangerous species.  Defend humanity as the Colonial Marines, search for prey as the master hunter Predator, or live to breed as the Hive-building Alien.&quot;&#10;&#10;The game was sold in starter decks (for Aliens, Predators, or Colonial Marines) which included 60 cards, one die, one token sheet, plus a rule book.  Cards were also sold in 15 card booster packs.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Cats' Mansion",
        "description": "In a great country mansion there live, in great luxury, four cats. As all cats, they are totally unlike each other, both in appearance and in character....The cats do not like each other and are also competitive. &#10;&#10;The first cat to get it's object, Wins!&#10;&#10;Contents:&#10;&#10;    Board depicting a mansion (similar to Cluedo board)&#10;    5 figurines of cats (in some editions different from each other)&#10;    4 silver color objects (pillow, gift box, mouse, food)&#10;    4 cats cards&#10;    4 objects cards&#10;&#10;&#10;&#10;&#10;40 Meow and Purrrr cards.&#10;&#10;Each player gets a cat and an object card, these are kept throughout the game and do not change.  These represent the player's cat and the object that cat dreams about. Players will try to keep these two cards secret, while trying to meet CAT &amp; OBJECT on the board to win the game.&#10;&#10;Any player can move any cat and any object. A total of 4 moves are granted per turn.  No dice are involved.&#10;&#10;The Meow cards are used to send cats directly to certain rooms, either to hassle your opponents or to help your own cat.  The purrr cards cancel a Miaow card, but they need to be played on the same particular cat.  There is also hissing when cats pass each other!!&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "Hell Hath No Fury",
        "description": "Hell Hath No Fury is a strategic simulation for two-players which recreates the revolt of the Iceni (and other tribes) against the Romans in Britain in 60 AD.&#10;&#10;One player controls the rebel British tribes under command of their warrior-queen Boudica. The other player controls the Roman occupation forces.&#10;The winner of the game must demoralize their opponent, by killing their leaders, occupying certain map areas or, for the rebel player, rally additional tribes to their cause.&#10;&#10;",
        "artist": "Jan French Johns"
    },
    {
        "name": "Napoleon and the Archduke Charles: The Battle of Aspern-Essling",
        "description": "Part of 3W's 'Bonaparte' Series by Keith Poulter, this game was first published in The Wargamer Magazine (#49). The portrait on the magazine cover is of French Marshal Jean Lannes, who died at Aspern-Essling. The game is a two-player simulation of the Battle of Aspern-Essling, May 21-22, 1809. One player leads Napoleon Bonaparte's Grande Arm&eacute;e d'Allemagne, the other player commands the Austrian Army of Archduke Charles of Austria.&#10;&#10;Victory Points are awarded each player for the elimination of strength points, elimination of leaders, and control of Aspern and/or Essling.  (Exception: The Austrian player wins immediately if Napoleon is a casualty.)  The difference in points between the players determines the level of victory.  &#10;A pyrrhic Austrian victory, Aspern-Essling turned out to be Napoleon's first ever setback in Europe, and the first time the Austrians ever defeated Napoleon in the field of battle.&#10;&#10;",
        "artist": "François Gérard"
    },
    {
        "name": "Harpoon (1st & 3rd edition)",
        "description": "Harpoon simulates modern naval warfare. Its rules tell how ships and aircraft move, detect enemy contacts, and attack them. Weapons inflict realistic effects, and proper naval tactics produce accurate and believable results. The die-cut counters included in the game make it possible to take this game home and start playing.&#10;&#10;Tom Clancy's books Hunt for Red October and Red Storm Rising used Harpoon as a source (the game was not based on the books).  To quote from the Author's Note in Red Storm Rising &quot;(Harpoon)...served as a primary source for The Hunt for Red October&quot; and &quot;... a macro-wargame or campaign game which, using the&quot; Harpoon system, would fight out a new Battle of the North Atlantic.  I thought this was fascinating and we began talking about building a book around the idea...'.  Larry Bond is given co-copyright to Red Storm Rising.&#10;&#10;",
        "artist": "Lauretta Oblinger,Steve Venters"
    },
    {
        "name": "Clash of Empires: August 1914",
        "description": "This game, first published in The Wargamer Magazine (#58), is a simulation of the beginning of the Great War.  Basically a two-player game where one person controls the French and the other, the Germans (a third player can be brought in to control British forces).&#10;&#10;The game is open-ended... it continues until one side of the conflict has achieved its victory conditions or a stalemate is reached.  To win as the German player you must capture Paris and cut it off from supply for two complete turns.  The French must capture two German supply centres to win.  Either player may declare a Stalemate if the game lasts longer than 12 turns... a 'marginal' victory may then be calculated based on city control and strength losses.&#10;&#10;",
        "artist": "Kerry Anderson,Scott Holmgren,Rodger B. MacGowan"
    },
    {
        "name": "Stonewall: The Battle of Kernstown, March 23, 1862",
        "description": "Stonewall is a grand tactical, regimental simulation of the Battle of Kernstown, March 23, 1862.  The players recreate the encounter between Major General T.J. 'Stonewall' Jackson's Confederate Valley Army and Brigadier General James Shield's Division, part of the Union Army of the Potomac.&#10;&#10;The game uses a Combat Effectiveness Chart to track unit's morale and fatigue along with rules based on the popular Terrible Swift Sword game system and which was later developed into the Great Battles of the American Civil War system.&#10;&#10;Victory points are awarded both players for certain objectives and for enemy unit losses.  The player with the higher total wins, with the difference in points determining the level of victory.&#10;&#10;Each Game-Turn represents 20 minutes of real time, each hex covers about 125 yards from hexside to hexside, and each Strength Point is the equivalent of 100 men or 1 gun.&#10;&#10;1 22&quot; x 32&quot; mapsheet, 1 countersheet of 100 counters.&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "Bug Hunter Sniper!: Sniper! Companion Game #3",
        "description": "Bug Hunter is a Sniper! series game about hypothetical clashes between spacefaring human adventurers and hostile alien monsters.&#10;&#10;As in all games in the Sniper! series, this game focuses on combat as experienced by the individual soldier.  This game examines the problems and situations peculiar to close combat in strange environments and against unknown foes.&#10;&#10;Multiple geomorphic 2-sided maps are included in the game to play out numerous scenarios (for from 1 to 3 players), each with their own set of victory conditions.  The game also includes rules to Sniper!, exclusive Bug Hunter rules, scenario booklet, random event cards, cut out vehicles, and 400 personnel counters and markers.  It is a stand-alone game that does not require the original Sniper!.&#10;&#10;",
        "artist": "Kim Janke,Dennis Kauth,David C. Sutherland, III"
    },
    {
        "name": "Mermaid Rain",
        "description": "Mermaid Rain is a Japanese game from the makers of Train Raider.&#10;&#10;Over five rounds, players try to collect five different types of goods by moving around the sea. The game uses two phases: first is the &quot;surf predicting&quot; phase where players play melds of cards in a Taj Mahal-type mechanic. The melds determine player order, selection of &quot;wave tile&quot;, and give other benefits. In the second phase, &quot;surf riding&quot;, players place their wave tiles on the board and then use cards to move through the sea on the waves to collect goods.&#10;&#10;The game is playable with English rules as the components are either language-independent or easily decipherable.&#10;&#10;&#10;Game Summary&#10;Setup: specific locations for subset of tiles, some face down; rest are to side, also face down. Deal out 7 cards (3 suits).&#10;&#10;Each round, players simultaneously select a card to play (max 5 cards total) -- choose the pass card to pass for rest of round. The resulting poker-style combinations give bonuses (VP, or special powers); the ranking gives you player order for the round.&#10;&#10;In order, select a face up sea tile (4 shapes, 2-3 hexes each, with one of 3 suits or wild). Then, in order, place the tile on the board and use some/all cards left in hand to move your mermaid around the board (playing card allows you to move mermaid to matching tile/space). Whenever on an island with token(s), look at face down tokens then add one of the tokens to your collection.&#10;&#10;At end of round, sea tiles with the darker color are removed from the board. Any mermaids on them are displaced to one of the unoccupied starting locations (player's choice). Then, deal 7 cards per player (max hand size 9) and repeat.&#10;&#10;Game ends after 5 rounds. Each player must discard 5 tokens (1 per symbol), or lose 5 VP per missing symbol. Then rank players' collections of sets of each type, awarding VP accordingly (rarer tiles, larger sets earn more VP). Most VP wins.&#10;&#10;",
        "artist": "Loïc Billiau,Karim Chakroun,Hitoshi Yoneda"
    },
    {
        "name": "Mystery Rummy: Al Capone and the Chicago Underworld",
        "description": "Mystery Rummy: Al Capone and the Chicago Underworld, the fourth title in the Mystery Rummy series, introduces some elements of Canasta with players scoring bonuses for collecting complete sets. Sets have varying numbers of cards in them, from Mike Heitler with four cards up to Al Capone with eight.&#10;&#10;The four types of gavel card make cards accessible everywhere: &quot;Agent Meeting&quot; searches other players' hands, &quot;Eliot Ness&quot; searches the deck, &quot;Search Warrant&quot; looks in the discard pile, and &quot;Raid&quot; allows you to take an opponent's already melded cards, provided you have at least three melded. All these mechanisms help make completing entire sets for their bonuses something you can reasonably strive for &ndash; while also putting you on guard against your opponent doing the same.&#10;&#10;",
        "artist": "Christine Conrad,Caroly Van Duyn"
    },
    {
        "name": "Xena: Warrior Princess CCG",
        "description": "A resource-management collectible card game.  Cards feature popular characters, settings and episodes from the television series with actual screen captures.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Karambolage",
        "description": "Six colored disks are in the playing area. On a player's turn they roll 2 dice, with the six colors of the disks on them. The player must flick a disk of one of the colors into a disk of the other color. If they succeed they get a point and may continue. If both dice are the same color they get a point and may continue. If they ever continue and fail, they lose all the points they have accumulated during the turn.&#10;&#10;Includes rules for three games:&#10;&#10;     Karambolage Roll two color dice, which will indicate which disc must strike another.  Use the firing band to propel one into the other.  If there's no direct shot, you may bank the shot off an included block.&#10;     Karamba Roll two color dice, which indicate the two discs that mark the ends of an imaginary goal, through which you must propel another disc.&#10;     Karamboli Simply line up the discs along the long side of a rectangular &quot;ring&quot;.  Launch the first disc, and then with each subsequent disc, try to strike as many of the previously-launched discs as possible.&#10;&#10;&#10;&#10;&#10;Ages 6 and up&#10;&#10;",
        "artist": "Walter Matheis"
    },
    {
        "name": "Patton Goes to War",
        "description": "Patton Goes to War is a two-player operational level simulation of the World War II American offensive in southern Tunisia led by Gen. George S. Patton, which took place between March 16th and April 3rd 1943.  It was first published in Strategy &amp; Tactics magazine #112.&#10;&#10;The game includes a mapsheet, 14 pages of rules, 200 counters representing U.S. and Axis units, and complete Unit Organization Charts.&#10;&#10;Four scenarios are included, each with their own set of victory conditions.  An optional rule for limited intelligence is also  included as well as a set of designer's notes.&#10;&#10;",
        "artist": "Rodger B. MacGowan"
    },
    {
        "name": "South Africa",
        "description": "South Africa: The Death of Colonialism, is a two-player operational level simulation of a possible revolt of that nation's Black majority (Black Nationalists) against the White South African government (Republic of South Africa Government) and of the government's reaction to such a revolt.&#10;&#10;Subtitled 'The Death of Colonialism', this game was first published in Strategy &amp; Tactics magazine #62.&#10;&#10;Victory points are awarded each player for reduction (or destruction) of their opponent's units and control of certain map hexes.  An automatic victory is attained if the ratio of points gained by either player reaches 3:1, otherwise play continues indefinitely (the standard scenario postulates that the Republic of South Africa will eventually collapse).&#10;&#10;Variable events can prolong the game each turn until one side wins (or surrenders).&#10;&#10;Game Scale:&#10;Turn: 1 Week&#10;Hex: 37.2 Miles / 60 Kilometers&#10;Units: Company to Battalion&#10;&#10;Game Inventory:&#10;One 22 x 34&quot; full-color mapsheet&#10;One dual-side printed countersheet (200 1/2&quot; counters)&#10;One 8-page South Africa rules booklet&#10;One 6-sided dice&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "Tito",
        "description": "Tito (and his Partisan Army - Yugoslavia, 1941-45) is an abstract simulation of guerilla warfare in the Balkans during the Second World War. The game portrays all of the elements of this dynamic partisan campaign, which successfully tied down large numbers of Axis troops on occupation duties and eventually helped liberate Yugoslavia and Albania from Axis domination.&#10;&#10;Originally published in Strategy &amp; Tactics magazine #81, the game included a 22&quot;X34&quot; map, 12 page rulebook, and 200 counters.&#10;&#10;The maps areas are divided into numerous display boxes (each with their own victory point value) which represent mountains, hideaways, and city objectives. The Yugoslav player gains points for occupying these areas. If the Yugoslav player accumulates more than 500 points over the course of the game (17 turns), he wins... otherwise, the German player does.&#10;&#10;Errata: see this thread.&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "NATO, Nukes & Nazis",
        "description": "World War III as it might have been...&#10;&#10;An alternative-history simulation of a war which occurs in a world where Nazi Germany survived the Second World War and decided to make another stab at planetary domination in the early 90s.  They are opposed by an alliance of North Atlantic democracies.&#10;&#10;The game is a two-player operational/strategic level game that speculates on the military trends which might have developed had Germany continued to build weapons based on those planned in 1945.&#10;&#10;Three scenarios and a Campaign game are included to provide a full range of hypothetical options.  Each side gains victory points based on 'Political Points' and other objectives (which vary depending on the side played).  The player with the higher total at the end of the scenario is the winner... the ratio of points gained determines the level of victory.&#10;&#10;The game includes a full colour 34&quot;X22&quot; map, 400 counters, charts, and tables.  Rules covering all aspects of Modern Warfare (including mobilization, ground, naval, and air attacks, political events, intelligence, and nuclear weapons) are included as well as extensive designer's notes.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Scrimmage",
        "description": "Scrimmage - Tactical Professional Football is, in many ways, &quot;the ultimate wargame&quot;.  It combines varieties of movement, combat and objectives rarely found in actual warfare.&#10;&#10;First published in Strategy &amp; Tactics magazine #37, Jim Dunnigan transformed the game of Football into a wargame, with limited success.&#10;&#10;Played on a hex map football field (6 hexes = 10 yards), players set up their teams and run plays.  Rules cover all aspects of the sport: facing, movement, contact, transferring the ball, passing and running.  The standard 'Combat Results Table' in most wargames becomes the 'Contact Results Table', where players are neutralized for a number of play segments or immobilized for the turn.  On passing plays, a 'Pass Completion Table' is consulted.&#10;&#10;Extensive examples of play are included for both running and passing.  However, no rules are included for kickoffs/punts or Field Goal attempts.&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "Strike Force One",
        "description": "Strike Force One is an easy-to-use, two-player game designed to introduce the concept of &quot;Conflict simulations&quot;.&#10;&#10;Designed as an introductory game to be given away at conventions and as a promotional item, the game consisted of a folder with map, Combat Results Table, small counter sheet (with 10 units) and rules.  Also provided was a complete turn-by-turn sample game.&#10;&#10;The game is a hypothetical meeting of U.S. and Soviet forces in West Germany.  To win, the Soviet player must occupy two of the three town hexes in four turns, otherwise the U.S. player wins.&#10;&#10;The Second edition of this game, published in 2007 by Victory Point Games, is the first game in their BATTLESSON (TM) series. The listed expansion is for this edition of the game.&#10;&#10;This game came free with Nicholas Palmer's book The Comprehensive Guide to Board Wargaming published in 1977 by Hippocrene Books, Inc., New York, N.Y.&#10;&#10;Expanded by:&#10;&#10;    Strike Force One+&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "American Civil War 1861-1865",
        "description": "This is a grand strategic game about the War Between the States. The US player controls the Union forces under Abraham Lincoln; the CSA player controls the Confederate forces under Jefferson Davis.&#10;&#10;Contents:&#10;&#10;    22&quot;X34&quot; mapsheet (35 miles/hex)&#10;    16-page rules booklet&#10;    200 counters representing leaders, headquarters, troops, and riverine units.&#10;&#10;&#10;&#10;&#10;Leaders are introduced over the course of the game (each game turn represents 3 months real time) and are activated using 'Command Points'. Each game turn consists of activating and rallying troops, supplying troops (including Port blockades), adding reinforcements, fortifying positions, activating Naval units, and then three separate movement/combat phases are executed.&#10;&#10;On the game turn track is listed a differential in victory points that the CSA player must obtain to win the game (which increases as the game progresses). If the CSA player does not achieve this total by the end of the Spring, 1865 turn he loses.&#10;&#10;",
        "artist": "Kristine L. Bartyzel,James Holloway"
    },
    {
        "name": "October War",
        "description": "Strategy &amp; Tactics magazine #61.&#10;&#10;This game is a tactical simulation of combat in the Middle East during the 1973 Yom Kippur War.  The game included a map, 200 counters representing Israeli and Arab forces, and a 12-page rulebook.&#10;&#10;Eight scenarios and two campaign games (which link multiple scenarios) are included for play.  Victory conditions vary depending on the scenario. (e.g.- Victory in 'The Battle of Gamala' scenario is based on victory points; in 'Peled's Counterattack', victory is based on capturing Hill 6 on the map)&#10;&#10;Extensive designer's notes and combat examples are included in the rulebook.&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "Sequence Dice",
        "description": "As with Sequence, players strive to get 5 of their tokens in a row. In Sequence Dice, however, players roll a pair of dice to determine where they can put their tokens. Each number has 4 squares associated with it, except for 10 which removes an opponent's token, or 11 which is wild. The 2 and 12 additionally get bonus turns.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Blood & Iron",
        "description": "Blood &amp; Iron: The Battle of Koniggratz, 1866, was the decisive battle of the Austro-Prussian War, in which the Kingdom of Prussia defeated the Austrian Empire. Taking place near K&ouml;niggr&auml;tz and Sadowa in Bohemia on 3 July 1866, it was an example of battlefield concentration, a convergence of multiple units at the same location to trap and/or destroy an enemy force between them.&#10;&#10;There are some extensive rules for cavalry charges, artillery, morale loss, and weather effects.  The game also includes a number of 'what if?' scenarios which include alternate orders of battle as well as the historical one.&#10;&#10;Game length and victory conditions are determined by the scenario being played.  Victory usually relies on capture of geographical objectives and/or elimination of opponent's forces.&#10;&#10;The game was first published as a supplement to Command Magazine Issue #21 Mar-Apr 1993.&#10;&#10;Not to be confused with 3W's Blood and Iron, this game is a two-player wargame covering the battle of Koniggratz (3 July 1866), the decisive battle of the 7 Weeks War between Austria and Prussia.&#10;&#10;Game Scale:&#10;Game Turn: 1 hours&#10;Hex: 500 yards / 457 meters&#10;Units: Brigade&#10;&#10;Game Inventory:&#10;One 22 x 34&quot; full-color mapsheet&#10;One dual-side printed countersheet (240 1/2&quot; counters - 200 for Blood &amp; Iron, 6 for Tet '68 &amp; 34 for Gettysburg)&#10;One 24-page Blood &amp; Iron rulebook&#10;One 12-page Lost Victory Study Booklet (Designers Notes)&#10;Two 4-page dual-side printed Player Aid Cards&#10;One 10-sided die&#10;&#10;Solitaire Suitability: Medium&#10;Complexity Level: Medium&#10;Players: 2 or more&#10;Playing Time: 2-12 hours&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Lion of Ethiopia",
        "description": "This game is a two-player simulation of the Italian invasion of Ethiopia in 1935-36. This war holds the distinction of being the largest colonial war ever fought in Africa and was the first round of the European portion of what would become World War II.&#10;&#10;The game includes a 12 page rulebook, a 22&quot; x 34&quot; mapsheet, and 166 counters.&#10;&#10;For the Italians, victory is determined by occupation of a number of geographical locations or the complete destruction of the Ethiopian army. For the Ethiopians, they must occupy Massawa and Mogadisho, destroy both Italian HQs, destroy the entire Italian army, or prevent the Italians from winning by Turn 22.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Operation Grenade",
        "description": "The game is a two-player simulation of the U.S. Ninth Army's February 1945 offensive in the Rhineland area of Germany.&#10;The U.S. player gains victory points for occupying German towns and for occupying bridges on the Rhine river. The number of points gained determines the level of victory for both players.&#10;&#10;Included are a 22&quot;X34&quot; mapsheet, standard rules for the Victory in the West game system, exclusive rules for Operation Grenade, and 245 1/2&quot; counters.&#10;&#10;Command Magazine Japan covers this game on #133 in 2017.&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "The Tigers Are Burning",
        "description": "The Tigers are Burning: Campaigns for the Ukraine, 1943-44 is a strategic level simulation of the Soviet reconquest of that vital area..&#10;&#10;The onus is on the German player to be very aggressive in this game as only the Soviet Player may gain victory points.  At the end of every game turn, starting with turn 2, the Soviet player checks to see if his victory point count matches what is required to win (e.g.- 15 points on Turn 2, 25 points on Turn 5)... if it does, the German player loses.&#10;&#10;Game Scale:&#10;Turn: 1 month&#10;Map: 40 miles / 65 km per hex&#10;Unit: Division to Army&#10;&#10;Game Contents:&#10;One 18 x 24&quot; map&#10;One countersheet (100 1/2&quot; dual-side printed counters)&#10;One 14 page rulebook&#10;&#10;Complexity: low to intermediate&#10;Playing Time: 3 hours&#10;&#10;",
        "artist": "Rodger B. MacGowan"
    },
    {
        "name": "Tsushima",
        "description": "Tsushima is a tactical naval game simulating the battles that were fought in the Sea of Japan in 1905, during the Russo-Japanese War.&#10;&#10;Counters represent individual capital ships with destroyer and torpedo boat flotillas. Hexes represent 1000 meters and each turn represents 7.5 minutes of real time. A number of scenarios are provided, each with its own victory conditions.&#10;&#10;",
        "artist": "Larry Hoffman,Mark Simonitch"
    },
    {
        "name": "The Battle for Cassino: Assaulting the Gustav Line, 1944",
        "description": "The Battle for Cassino: Assaulting the Gustav Line, 1944, is a two-player company/platoon level simulation of the third Allied attack on the German Gustav Line around Cassino which occurred in March, 1944. The game was first published in Strategy &amp; Tactics magazine #71.&#10;&#10;The game makes extensive use of Artillery and, because Cassino Abbey was at the top of a hill, there are extensive elevation and line-of-sight rules.&#10;&#10;If the Germans do not have a unit counter in Cassino Abbey after 17 game turns, the Allies win. If the German player has a unit in Cassino Abbey AND the Continental Hotel, the German player wins. If neither of these conditions exist, victory is then determined by Allied casualties.&#10;&#10;Game Scale:&#10;Turn: 6 Hours&#10;Hex: 54 yards / 50 meters&#10;Units: Platoon to Battalion&#10;&#10;Game Inventory:&#10;One 22 x 35&quot; full-color mapsheets&#10;One dual-side printed countersheet (200 1/2&quot; counters)&#10;One 12-page Cassino rules booklet&#10;One 6-sided dice&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "Pleasant Hill: The Red River Campaign",
        "description": "Pleasant Hill: The Red River Campaign was first published in Strategy &amp; Tactics magazine #106. It was the sixth game of the Great Battles of the American Civil War series which included Pea Ridge, Drive on Washington, Wilson's Creek, Cedar Mountain, and Jackson at the Crossroads.&#10;&#10;The game is a simulation of the battle of Pleasant Hill, fought in Louisiana in April, 1864.  The Union Army was attempting to move up the Red River valley to Shreveport where it was overrun by a small Confederate force at Mansfield. The Union Army then retreated to nearby Pleasant Hill and took a defensive posture... on April 9, the Confederates attacked.&#10;&#10;Each Game-Turn represents 20 minutes of real time, each hex covers about 125 yards from hexside to hexside, and each Strength Point is the equivalent of 100 men or 1 gun.&#10;&#10;Included are a 22&quot;X34&quot; mapsheet, 200 counters, standard rules for the 'Great Battles' series, exclusive rules, and player charts and tables.&#10;&#10;Not a simple game... there are more than 20 pages of rules which include extensive rules for cavalry, artillery and line-of-sight, morale, and fire and melee combat.&#10;&#10;Victory is based on points earned by eliminating or demoralizing units and through capture of certain geographical objectives. The difference in points between the Union and Confederate players determine the level of victory.&#10;&#10;",
        "artist": "Dave LaForce"
    },
    {
        "name": "The Italian Campaign: Sicily",
        "description": "The Italian Campaign Series: Sicily, is the first of four operational level games (Sicily, Salerno, Anzio and Med War) simulating the Battle for Italy in World War II using the Westwar Gaming System developed by Vanguard Games. This game represents the Allied invasion of Sicily and was first published in Strategy &amp; Tactics magazine #146.  Errata was published in S&amp;T #155.&#10;&#10;The Allies are trying to force the Axis player to completely evacuate the island of Sicily, if they can manage to capture and hold Messina for two complete turns, they force a surrender.  Victory points are calculated based on the number of German/Italian units captured or eliminated... the difference between this total and the Allied Landing Capacity determines who wins.&#10;&#10;Game Scale:&#10;Turn: 1 to 2 days&#10;Hex: 5 miles&#10;Unit: Company to Brigade&#10;&#10;Game Inventory:&#10;One 22&quot; X 34&quot; mapsheet&#10;One countersheet (200 1/2&quot; counters)&#10;One 16 page rule booklet&#10;&#10;",
        "artist": "Mark Simonitch"
    },
    {
        "name": "The Italian Campaign: Salerno",
        "description": "The Italian Campaign Series: Salerno, is the second of four operational level games  (Sicily, Salerno, Anzio and Med War) simulating the Battle for Italy in World War II using the Westwar Gaming System developed by Vanguard Games. This game represents the Allied invasion in southern Italy and was first published in Strategy &amp; Tactics magazine #150.  Errata was published in S&amp;T #153.  Errata was published in S&amp;T #155.&#10;&#10;The Allies are trying to force the Axis player to completely retreat from southern Italy.  Victory points are calculated based on the number of units captured, reduced, or retreated from the map... the difference between the Axis total and the Allied total determines who wins.&#10;&#10;Three scenarios are provided: the historical situation, a 'What if?' scenario, and a scenario which links with 'The Italian Campaign: Sicily' game.&#10;&#10;Game Scale:&#10;Turn: 1 to 2 days&#10;Hex: 5 miles&#10;Unit: Company to Brigade&#10;&#10;Game Inventory:&#10;One 22&quot; X 34&quot; mapsheet&#10;One countersheet (200 1/2&quot; counters)&#10;One 20 page rule booklet&#10;&#10;",
        "artist": "Mark Simonitch"
    },
    {
        "name": "The Italian Campaign: Anzio",
        "description": "The Italian Campaign Series: Anzio, is the third of four operational level games  (Sicily, Salerno, Anzio and Med War) simulating the Battle for Italy in World War II using the Westwar Gaming System developed by Vanguard Games. This game completes 'The Italian Campaign' series land game and cannot be played by itself... ownership of Salerno is required. The game was first published in Strategy &amp; Tactics magazine #155.  Errata was published in S&amp;T #157.&#10;&#10;Five scenarios and two campaign games are provided. Each one uses counters and/or maps from the Salerno game. There are also linking rules with The Italian Campaign: Sicily. Victory is determined by the scenario being played.&#10;&#10;Errata is also included for the first two games in the series.&#10;&#10;Game Scale:&#10;Turn: 1 to 2 days&#10;Hex: 5 miles&#10;Unit: Company to Brigade&#10;&#10;Game Inventory:&#10;One 22&quot; X 34&quot; mapsheet&#10;One countersheet (200 1/2&quot; counters)&#10;One 20 page rule booklet&#10;&#10;",
        "artist": "Mark Simonitch"
    },
    {
        "name": "Donau Front",
        "description": "Donau Front: Ardennes of the &lsquo;90s:  The Bavarian Option in the Next War, is the second game in the renewed Central Front series of games which include: North German Plain, BAOR, Fifth Corps, and Hof Gap. Maps from all of the renewed series games may be linked and rules exist for a full Campaign game. Donau Front was first published in Strategy &amp; Tactics magazine #131. The games are designed to depict hypothetical Warsaw Pact versus NATO conflict during the first five days of a future war.&#10;&#10;Victory is measured by the PACT player's attainment of certain objectives, and the NATO player's denial of these. Objectives range from advancing to a specific hex row, to occupying Munich. Four different objective types exist, so it is possible for both players to &quot;win&quot;.&#10;&#10;Rules are provided to link this game with Hof Gap.&#10;&#10;Game Scale:&#10;Turn: 6 hour daylight &amp; 12 hour nighttime turns &#10;Hex: 4 km&#10;Unit: Company to Brigade&#10;&#10;Game Inventory:&#10;One 22&quot; X 34&quot; mapsheet&#10;One countersheet (200 1/2&quot; counters)&#10;One 16 page rules booklet (Central Front Standard Rules &amp; Donau Front Exclusive Rules)&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Indian Mutiny",
        "description": "The Indian Mutiny is a simulation of the Sepoy Rebellion in 1857.&#10;&#10;The game includes a 22&quot;X34&quot; map, 8 page rules and scenarios booklet, and 200 counters.&#10;&#10;Extensive conditions for either the British or Indian players determines which side wins (depending on the scenario being played).&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Korea: The Mobile War",
        "description": "Korea is a regimental/divisional level game of the first year of the UN Operations in 1950-51. One player commands the units of the Korean People's Army and the allied Chinese People's Liberation Army; the other player controls the Republic of Korea armed forces and the allied U.N. coalition Army containing U.S., British, Philippine, Turkish, Canadian, and Thai forces. This game was first published in Strategy &amp; Tactics magazine #111.&#10;&#10;Included are a 22&quot;X34&quot; map sheet, 200 counters (units and markers) and a 12 page rulebook.&#10;&#10;Multiple historical and 'what if?' scenarios are provided, each with its own victory conditions, usually based on points gained by the KPA/PLA player for controlling certain geographical areas.&#10;&#10;",
        "artist": "Kevin Zucker"
    },
    {
        "name": "Iron Cross",
        "description": "Iron Cross is a man-to-man wargame covering infantry battles, on a tactical level, between German and Soviet forces in Russia during 1941-42.  The game was first published in Strategy &amp; Tactics magazine #132.&#10;&#10;The game has been called &quot;the poor man's Squad Leader&quot;, but does a great job simulating small unit tactics in the six provided scenarios.&#10;&#10;Game Scale:&#10;Turn: 2 minutes&#10;Map: 10 meters&#10;Unit: Individual man, weapon, vehicle&#10;&#10;Game Contents:&#10;One 22 x 34&quot; map (designed to be hand cut to give three 12 x 18&quot; maps)&#10;One countersheet (200 1/2&quot; counters)&#10;One 20 page rulebook&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Fortress Stalingrad",
        "description": "Fortress Stalingrad: Soviet Winter Counter Offensive 1942-1943, is a strategic/operational level simulation of the Soviet Winter Counter Offensive in 1942-43. Many have called this to be the single most important Campaign in all of World War II. The game was first published in Strategy &amp; Tactics magazine #124.&#10;&#10;The Soviet player gains victory points based on objectives and German unit losses.  If he gains more than 110 points in the 12 game turns, he wins. If the German player holds the Soviets to less than 100 points, he wins.&#10;&#10;The game is declared a draw if the point total is between 100 and 110.&#10;&#10;Game Scale:&#10;Turn: approximately 10 days&#10;Hex: 15 miles / 25 km&#10;Unit: Company to Army&#10;&#10;Game Inventory:&#10;One 22&quot; X 30&quot; mapsheet&#10;One countersheet (200 1/2&quot; counters)&#10;One 20 page rules booklet&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Ruweisat Ridge: The First Battle of El Alamein",
        "description": "Ruweisat Ridge: The First Battle of El Alamein, was first published in Strategy &amp; Tactics magazine #105. The game covers the desert battles around El Alamein from July 1 through July 18, 1942. The British Commonwealth 8th Army must hold the line against the battered Panzerarmee Afrika, since Alexandria and the virtually undefended Nile Delta lie less than 100 miles to the east.&#10;&#10;The map depicts the battlefield of El Alamein, from the Mediterranean Sea in the north, to the virtually impassable Qattara Depression in the south.&#10;&#10;The game system tries out some unusual mechanics to simulate the fast-paced flow of desert warfare. Combat units are rated for firepower and assault strength, while AFVs have an armor rating, and artillery has an anti-tank rating.  HQs are used for activation of units in their formation. Rules of interest are Opportunity Fire, Overruns, Reaction Movement and Withdrawal Fire, Airstrikes and Fortifications.&#10;&#10;Victory is determined by points gained through objective hexes, enemy units eliminated, and for occupying portions of the 'coast road'... the player with the most points wins. The difference in points between the Commonwealth and Axis player determines the level of victory.&#10;&#10;Game Scale:&#10;Turn: 1 day&#10;Hex: 1.5 miles&#10;Unit: Company to Brigade&#10;&#10;Game Inventory:&#10;One 16&quot; X 21&quot; mapsheet&#10;One countersheet (100 1/2&quot; counters)&#10;One 12 page rules booklet&#10;&#10;",
        "artist": "Ivor M. Janci,Roger Raupp"
    },
    {
        "name": "Soldiers of the Queen: Battles at Isandhlwana and Omdurman",
        "description": "Soldiers of the Queen is actually two separate Colonial battle games that use the same game system: Isandhlwana, 1879 and Omdurman, 1898.  The game was originally published in Strategy &amp; Tactics  magazine (#95).&#10;&#10;The game includes an 18&quot;X22&quot; backprinted mapsheet (one side for each battle), a 16 page rulebook, 200 counters, and player aid charts and tables.&#10;&#10;In Isandhlwana, the Zulu player wins if he eliminates all British units before he himself loses 14, otherwise the British player wins; the game has no set time limit... it is played until one player or the other has achieved their victory conditions.&#10;&#10;In Omdurman, points are gained for each player according to a victory points chart... if the British do not win an 'Automatic Victory' by turn 21, the side with the higher point total wins.&#10;&#10;",
        "artist": "Kristine L. Bartyzel,Ivor M. Janci,John Meyers,Keith Parkinson,Stephen Sullivan"
    },
    {
        "name": "Phantom Rallye",
        "description": "How awful, four children have entered the Ghost Ride to be scared. But the cars suddenly stop, and all of the turning ghosts stand still. The gears are broken, and it is up to the children to fix the gears to make the ghosts turn.&#10;&#10;A clever children's game where players must use logic (logi) to move ghosts (geists)through use of gears placed over pegs.&#10;&#10;",
        "artist": "Kinetic,KniffDesign,Chris Mitchell (I)"
    },
    {
        "name": "Blitzkrieg '41",
        "description": "Blitzkrieg `41 is a two-player strategic level wargame of the German invasion of the Soviet Union in 1941.&#10;&#10;The game includes a 20 page rulebook, 200 counters, and a 22&quot; x 34&quot; mapsheet which contains a map plus charts and tables for both players.&#10;&#10;Victory conditions are quite extensive (over a page of rules) and, because of the great number of draws that the game will produce (the historical result), the designer recommends playing multiple games for total points.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Borodino: Doomed Victory",
        "description": "This game is a simulation of the Battle for Moscow, 1812, first published in Strategy &amp; Tactics magazine #136; errata appears in S&amp;T #138.&#10;&#10;Included in the game are rules, a 22&quot;X34&quot; mapsheet, and 200 counters.&#10;&#10;Two scenarios are provided: a historical scenario (where units are placed as they were actually deployed) and a hypothetical scenario (where players are free to deploy where they wish).&#10;&#10;Victory is solely based on Russian strength losses, the French player must eliminate at least 90 strength points to win. (approximately 40% of the Russian army).&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Hastings, 1066",
        "description": "First published in Strategy &amp; Tactics magazine #110, Hastings, 1066 is a tactical simulation of the confrontation between William the Bastard, Duke of Normandy, and King Harold Godwineson of Wessex... a battle that forever changed the face of the world, as the victor became King.&#10;&#10;The game includes a 12 page rulebook, 200 counters and a 22&quot;X34&quot; mapsheet, which includes player displays, charts, and tables.&#10;&#10;The Norman's objective was to reach and take London. Harold's army blocked the only road. If the Norman player controls all of the road hexes on Senlac Hill, they win a Strategic victory. The Normans also win if they can eliminate all of the Saxon housecarle units. If neither of these victory conditions occur by the end of the second assult phase, the Saxon player wins.&#10;&#10;",
        "artist": "The Bayeux Tapestry,Tom Dardnell,David C. Sutherland, III"
    },
    {
        "name": "13: The Colonies in Revolt",
        "description": "This game is an operational simulation of the American Revolutionary War from late 1775 (the siege of Boston and the two Canadian expeditions) through the end of 1781. The British player must try to stop the revolt by trying to control half a continent.&#10;&#10;Included are a 16 page rulebook, 22&quot;X34&quot; map, 200 counters, and various player charts and tables.&#10;&#10;The British player wins in one of two ways. If the year is 1775 or 1776, the British player requires control of a limited number of objectives (Canada, Boston, New York, Philadelphia, Charleston, and one area of operations). If the game continues to 1781, the British player must control New England, the Middle Colonies, the South, and either Canada or the Western Territories. If the British do not attain these objectives, the American player wins.&#10;&#10;",
        "artist": "Doug Chaffee,Dave LaForce"
    },
    {
        "name": "Thunder at Luetzen",
        "description": "The Thunder at Luetzen game is an army level simulation of the opening of Napoleon's 1813 campaign in Germany.  The game was first published in Strategy &amp; Tactics magazine #99.&#10;&#10;THe game consists of a 16 page rulebook, one 22&quot;X34&quot; mapsheet, 200 counters and various player aids.&#10;&#10;Leadership and morale play an important part of the game.  Combat is by strength differential. If neither the French nor Allied army is demoralized by the end of 32 game turns, the French player wins if he controls Leipzig Bridge, otherwise the Allied player wins.&#10;&#10;",
        "artist": "Dave LaForce,Keith Parkinson,Patrick Lucien Price"
    },
    {
        "name": "Warsaw Rising: Revolt of the Polish Underground, 1944",
        "description": "This game is a simulation of the Polish resistance in Warsaw during 1944.  The game was originally published in Strategy &amp; Tactics  magazine (#107).&#10;&#10;The game includes a 16 page rulebook (covering all aspects of guerrila warfare and resistance combat), 200 counters (representing the units and weapons involved in the conflict) and a 22&quot;X34&quot; map of the City of Warsaw.&#10;&#10;Two scenarios are provided: Warsaw Rises! (August 1944 - 4 turns) and The German Juggernaut (September, 1944 - 5 turns).  Victory is based on capturing or assaulting various buildings in the city, eliminating enemy units, and (for the German player) maintaining a supply line through Warsaw.  Points may also be spent during the game for additional reinforcements.  The player with the most victory points at the end of the scenario, wins.&#10;&#10;",
        "artist": "Kevin Zucker"
    },
    {
        "name": "Cortes: Conquest of the Aztec Empire",
        "description": "A two-player wargame that covers the epic three month siege of Tenochtitlan, the climactic battle for control of Mexico, fought in 1521.  &#10;14 pages of rules, 144 5/8&quot; counters, and a 22&quot; x 34&quot; map are included.&#10;&#10;This game is the only one that I am aware of that includes rules for Human Sacrifice...&#10;&#10;If Cortes is killed or captured, the Aztec player wins immediately.  Otherwise, the Spanish player must keep his &quot;Loss Points&quot; to a minimum... as long as the Spanish player does not gain 17 or more points, they win.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Shogun Triumphant",
        "description": "Shogun Triumphant is a two-player historical simulation of the most famous land battle in Japanese history: The Battle of Sekigahara.&#10;&#10;Included are a 14 page booklet of rules, charts and tables, a 22&quot; x 34&quot; map of the battlefield, and 158 counters.&#10;&#10;Units are broken into factions and clans... one player commands the Eastern Army, the other player commands the West.  Extensive rules for Melee Combat, Clan Effectivenes, and Defections are provided.&#10;&#10;Victory is determined by counting loss of &quot;Stalwartness Points&quot;.  The first player to drop 160 points due to losses and defections, loses the game.  If the game manages to last eight turns, without either player losing, the Western player is assumed to win.&#10;&#10;",
        "artist": "Sawshun Yamaguchi"
    },
    {
        "name": "Antietam: Burnished Rows of Steel",
        "description": "Antietam: Burnished Rows of Steel is a game of the bloodiest single-day battle in the American Civil War.&#10;&#10;Game turns are sequential, with each player moving, firing artillery, and then having two rounds of combat, each in turn.  Also provided are rules for solitaire play.&#10;Victory is determined by victory points earned by the Union player for capturing and maintaining control of geographical objectives and Confederate unit losses.  If the Confederate player can hold the Union to less than 25 points, they win.  Victory conditions are slightly different for the Solitaire game.&#10;&#10;First published in Command magazine No. 22 (May-June 1993).&#10;&#10;Game Scale:&#10;Turn: 1 hour&#10;Hex: 250 yards&#10;Unit: Brigade &amp; Battery&#10;&#10;Game Inventory:&#10;One 22&quot; X 34&quot; mapsheet&#10;Two countersheets (304 5/8&quot; counters)&#10;One 36 page rule booklet&#10;&#10;",
        "artist": "Larry Hoffman,Beth Queman,Mark Simonitch,Don Troiani,Sawshun Yamaguchi"
    },
    {
        "name": "Desert Storm: The Mother of All Battles",
        "description": "Ths game is a one- or two-player operational simulation of the Gulf War.  It focuses almost exclusively on the Coalition ground war that liberated Kuwait and shattered the occupying Iraqi army.&#10;&#10;The game includes a 22&quot; x 34&quot; hex map of the significant terrain in the Kuwaiti Theatre of Operations, 192 counters, and 20 pages of rules, charts, and tables.&#10;&#10;Rules are split into both a basic and an advanced game.  There are separate rules for solitaire play.&#10;&#10;The U.S./Coalition player must completely liberate Kuwait to have a chance to win.  If Kuwait is liberated within 12 game turns, the player who has gained the most 'points' in inflicting losses on their opponent, wins.  The Coalition player must be aggressive in order to completly clear Iraqi units from all Kuwaiti cities, towns, oilfields, and airfields, otherwise the Iraqi player will win.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Budapest '45",
        "description": "This is a simulation of the fighting in and around the capital of Hungary in January 1945.&#10;&#10;The game is played for 14 turns and ends either with a political victory (control of Budapest) or a victory on points (given for destruction of opposing units).&#10;&#10;It includes 16 pages of rules, a 22&quot; x 34&quot; mapsheet, two player aid cards, and 165 counters.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "I Am Spartacus!",
        "description": "This game is a two-player simulation of the Third Servile War, a slave revolt that shook the Roman Republic from 73-71 B.C.&#10;&#10;Included in the game are 14 pages of rules, 189 5/8&quot; counters, and a 22&quot; x 34&quot; mapsheet with the areas of Italy and the Mediterranean where the War of the Gladiators took place.&#10;&#10;Barring the occupation of Rome (for the Rebel player) or the capture of Spartacus (for the Roman player), which would give an automatic victory, the game is played for points.  At the end of 17 Turns, the player with the most points wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Gettysburg: Lee's Greatest Gamble",
        "description": "This game is a simulation of the battle which took place between Lee's Army of Northern Virginia and Meade's Army of the Potomac at Gettysburg, Pennsylvania during the first four days of July 1863.  &#10;Included in the game are a 22 x 34&quot; mapsheet, 200 counters, and 18 pages of rules.&#10;&#10;To win the game, the Confederate player must inflict heavy casualties on the Union army and/or move his own train off the map to the southwest.  The Union player must resist the Confederates drive while inflicting heavy losses on the Confederates.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Port Arthur: The Russo-Japanese War",
        "description": "Port Arthur is a simulation of the ground campaign of the Russo-Japanese War of 1904-05.  &#10;Included in the game are 10 pages of rules, a 22&quot; x 34&quot; mapsheet, and 101 counters.&#10;&#10;Victory points are awarded for causing enemy casualties, and for control of Liaoyang, Mukden, and Port Arthur (which is worth 2 points).  At the beginning of the game the Russian player will be receiving 4 points per turn, so it is imperative for the Japanese player to be aggressive.  At the end of 10 complete turns, the player with the higher total, wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Czechoslovakia '38",
        "description": "Czechoslovakia '38, This game is a two-player wargame that simulates what might have been the first campaign of World War II in Europe if the Prague government rejected the Munich Diktat.&#10;&#10;The game was first published as a supplement to Command magazine Issue #24.&#10;&#10;To win, the German player must attempt to crush Czechoslovakia by conquering crucial territory before France and England decide to join the war.  The Czech player wins by holding out until those two Allies intervene.&#10;&#10;Game Scale:&#10;Turn: 2 days&#10;Hex: 7.5 miles / 12 km&#10;Unit: Regiments to Divisions&#10;&#10;Game Inventory:&#10;One 22&quot; X 34&quot; mapsheet&#10;One countersheet (176 5/8&quot; counters - 142 for Czechoslovakia '38, the rest are errata counters for other games)&#10;One 28 page Rulebook&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Duel of Ages Set 1: Worldspanner",
        "description": "From the Publisher:&#10;&#10;Behind the stunning artistry of Duel of Ages lies an epic, deeply intriguing strategy game that will capture your attention for years to come. Build the uniquely modular game map (using the PAKIT board game system) to your own advantage, thwarting the enemy's attempt to do the same.&#10;&#10;Accept a random roster of heroic characters, each with radically different abilities. Discover a way to turn this diverse group into an effective team. To survive, your team must acquire strange and deadly equipment by confronting the illusionary guardians of the labyrinths. But through every minute of play, the enemy will be uncomfortably close, hounding your team as you hound theirs...&#10;&#10;Expanded by&#10;&#10;    Duel of Ages Set 2: Intensity&#10;    Duel of Ages Set 3: Vast Horizons&#10;    Duel of Ages Set 4: Royal Tournament&#10;    Duel of Ages Set 5: Mercenary Camp&#10;    Duel of Ages Set 6: Field of Honor&#10;    Duel of Ages Set 7: Ruins of Cany XII&#10;    Duel of Ages: Masters Addendum&#10;    Duel of Ages: Prestige Pack&#10;    Duel of Ages: Scrye Add-On Pack&#10;&#10;&#10;&#10;&#10;",
        "artist": "K. Andersen,Armands Auseklis,Jose Castello,Lon Chaney,Dean Chaney,Donna D'Amelio,Gerald Double,Ronald Kapaun,Zieben Lin,Lorraine Purviance,Mike Robinson,Martin Roes"
    },
    {
        "name": "York Town",
        "description": "Washington&rsquo;s and Cornwallis&rsquo; problems for the decisive siege in the American War of Independence, reproduced on a 70x100 centimeter map, with the employment of all the American, French, Prussian and English units.&#10;&#10;Degree of difficulty: 2/6&#10;&#10;Contents:&#10;&#10;    79 cut out pieces, representing American, French, English and Prussian units which took part in the battle.&#10;    Explosion markers to show which units have been shot or damaged.&#10;    Combat disk, to check the results of battles and of artillery fire, with calendar.&#10;    York Town map and surroundings in rigid, thick cardboard with a matte plastic finish, cut into 5 pieces.&#10;    Rule booklet in 4 languages with examples and table of battle field forces.&#10;    Plastic storage tray and one die.&#10;&#10;&#10;&#10;&#10;",
        "artist": "Enea Riboldi"
    },
    {
        "name": "Little Big Horn",
        "description": "Three games at different levels of difficulty reconstructing the most famous battle between the U.S. Army and the Indians. The three-dimensional board shows the Valley of Little Big Horn, from the high plains, just as Colonel Custer saw it before his last stand.&#10;&#10;Degree of difficulty: 3/6&#10;&#10;Contents:&#10;&#10;    Pieces in matte finish cardboard, cut and printed on both sides.&#10;    Large cardboard table to be used to establish the outcome of combat and rifle fire.&#10;    Board in rigid, thick cardboard with a matte plastic finish, cut into 5 pieces.&#10;    Relief sections in rigid, thick cardboard to be used to create the three-dimensionality of the terrain.&#10;    Rule booklet in 4 languages with examples.&#10;    Plastic storage tray and dice.&#10;&#10;&#10;&#10;&#10;",
        "artist": "Ermes Miceli"
    },
    {
        "name": "Queen's Necklace",
        "description": "From the slums, where purse-snatchers and courtesans work their respective trades, to the inner salons of the Louvre, where confessors, royal astrologers, musketeers, and court favorites mingle and scheme in hushed conversations, the position of King's Jeweler has suddenly become a lot more dangerous!&#10;&#10;Set in Paris, on the eve of the French Revolution, Queen's Necklace is a game of gem-selling, influence, and intrigue at the court. Two to four players compete in the role of royal jeweler to sell rare jewels to the Queen and her court.&#10;&#10;Jeweler's loupe in hand, you must decide how best to spend your hard-earned ducats: acquiring beautiful gems (diamonds, emeralds, and rubies); or buying the favors of the various court followers. After three years of craftsmanship, the jeweler who sells the most precious gems and builds the largest fortune will receive the coveted title of King's Jeweler and a place at the court!&#10;&#10;",
        "artist": "Pierre-Alain Chartier,Cyrille Daujean,Hub"
    },
    {
        "name": "East & West",
        "description": "East &amp; West is a hypothetical Russian attack on Europe and the consequences of the war on the three hottest fronts in the world.&#10;&#10;Degree of difficulty: 6/6&#10;&#10;Contents:&#10;&#10;    Card for electronic codes and sinking of reserves.&#10;    Cardboard table for launching of missiles, bombardments and battles.&#10;    570 pieces in plasticized, matte finish cardboard, cut and printed on both sides.&#10;    3 maps in rigid, thick cardboard with a matte plastic finish, cut into 2 pieces and printed in 5 colours, they represent the three &ldquo;warm&rdquo; borders: Europe, the Middle East and the Russian-Chinese border.&#10;    Table for reserves and their transport.&#10;    Rule booklet in 4 languages with examples.&#10;    Plastic storage tray and dice.&#10;&#10;&#10;&#10;&#10;",
        "artist": "Enea Riboldi"
    },
    {
        "name": "Okinawa",
        "description": "Landings and battles are displayed on two general maps while they are taking place on the island. Surprise techniques by the Japanese and the succession of land, air and naval battles in addition to historical faithfulness, make Okinawa a precise and amusing game.&#10;&#10;Degree of difficulty: 3/6&#10;&#10;Contents:&#10;&#10;    20 little maps to calculate the hidden position of Japanese forces and American movement.&#10;    2 tables to resolve combat and to calculate the artillery fire in matte finish plasticized cardboard.&#10;    166 counters in plasticized, matte finish cardboard, cut and printed on both sides representing *American and Japanese units which took part to the battle.&#10;    Playing board in rigid, thick cardboard with a matte plastic finish, cut into 5 pieces.&#10;    Rule booklet in 4 languages with examples.&#10;    Plastic storage tray and dice.&#10;&#10;&#10;&#10;&#10;",
        "artist": "Enea Riboldi"
    },
    {
        "name": "Rommel",
        "description": "The last great offensive of the German-Italian forces in Tunisia to halt the advance of the English and American forces which landed in Marocco in &rsquo;42. The board is a three dimensional map consisting of a reproduction of the area on three levels.&#10;&#10;Degree of difficulty: 5/6&#10;&#10;Contents:&#10;&#10;    7 cardboard tables to be used to establish the outcome of combat and artillery fire.&#10;    Calendar indicating the entries onto the battlefield, the rounds divided into days and nights, air raids and all other indications necessary to the game.&#10;    Pieces in matte finish cardboard, cut and coloured on both sides.&#10;    Board in rigid, thick cardboard with a matte plastic finish, cut into 5 pieces.&#10;    Relief sections in rigid, thick cardboard to be used to create the three-dimensionality of the terrain.&#10;    Rule booklet in 4 languages with examples.&#10;    Plastic storage tray and dice.&#10;&#10;&#10;&#10;&#10;",
        "artist": "Enea Riboldi"
    },
    {
        "name": "Pack of Flies",
        "description": "12 cards (with positive, negative, and special powers) are revealed one after the other.  Each time a card is revealed, the players try to acquire it by secretly choosing a number of flies(each player starts with 5 black plastic flies), and guessing the total number of flies chosen by all of the players.  The used flies become the reserve in the middle of the table.&#10;&#10;The player who guessed the correct number(or closest guess) gets the card and either keeps it, if it's a positive card, or gives it to another player, if it's a negative card.&#10;&#10;There are 3 special power cards, Mireille, the (blue) Trained fly, who can be called back from the total, Insecticide which can eliminate the flies from opponents hands, and Fly Babies which allows players to take flies from the reserve.&#10;&#10;If a player guesses the exact number of flies chosen by the group in a round, they get to take one fly from the reserve.&#10;&#10;After all 12 cards have been acquired/distributed, the point values on the cards are totaled and added to the remaining flies a player possesses.  The player with the most points at the end of the game will be the winner.&#10;&#10;",
        "artist": "Franck Dion"
    },
    {
        "name": "Battle Dome",
        "description": "Battle Dome is &quot;the game of rapid-fire action and lightning-quick reflexes!&quot; It is a pinball-style game in which colored plastic marbles fall from a motorized dispenser down onto a dome, and then fall into one of four chutes. Players  2-4 control a set of flippers at their chute and try to shoot the falling balls into their opponent's goals while keeping marbles out of theirs. Any marbles in your goal count against you, with the black &quot;stealth&quot; marble counting extra. There are spinners and bells on the dome that the marbles hit - these can be rearranged, or replaced by a fence to block off one or two chutes if there are fewer than 4 players.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Nobody but Us Chickens",
        "description": "As sunset approaches in Littleton, Kentucky, Farmer Johnson&rsquo;s chickens have had a hard day scratching, pecking and egg laying. But now it&rsquo;s getting dark&mdash;time to return to the coop and get a good night&rsquo;s sleep. &#10;&#10;Unfortunately, a pack of foxes have found the coop and when the rats show up, they&rsquo;ll snatch every chicken they can lay their fangs on, even if they have to make more than one trip to do it.&#10;&#10;Will the loyal guard dogs save the chickens from the foxes, or will a rat sneak in and snatch the best chicken for itself? Only you will decide!&#10;&#10;Nobody But Us Chickens is a fast-paced, Simultaneous Action Selection card game where players earn points by capturing chickens with their predators (foxes and rats) or protecting chickens with their guard dog. The game is easy to learn, but exciting and unpredictable.&#10;&#10;",
        "artist": "Rick Enright"
    },
    {
        "name": "Discovery",
        "description": "Discovery (also sold as Destination Tresor in French, and Discovery Island in Sweden) is an interesting deduction game of discovery. Each player begins in an unknown location on an island (the opponent picks where the other starts), and each has the same goal: find the hidden treasure. The treasure is hidden in one of 28 spots on the island, and there are 7 clues available in special checkpoints to help determine where it is. The island is made up of 5 different types of terrain, and for each type of terrain there is a set of corresponding hexes.&#10;&#10;In play, one player calls a direction (Northeast, South, etc.) and the other player (who knows where you are) reveals a hex on the type of terrain you just stepped into. On the back of the hex there is a number, showing how many hours have been used.  Each turn, a player gets 12 hours worth of movement. By moving this way, you can eventually figure out where you are and then start moving with more accuracy.&#10;&#10;The game uses a clever device that reveals only one spot of a 6 x 6 matrix. A card, from a large set, is initially placed and this determines where the treasure will be for that game. When players get to a checkpoint, they can reveal that spot on the card to get a clue. The clues can tell you which of 4 types of treasure spots is &quot;live&quot;, and also the six surrounding terrain types. The board is well designed so that with a few clues you can narrow down the options of spots.&#10;&#10;A clever system in a tense and interesting game design.&#10;&#10;Components:&#10;  2x Map boards&#10;  2x Plastic map sheets&#10;  1x Checkometer&#10; 28x Checkometer cards&#10; 18x Equipment cards&#10;  2x Whiteboard pencils&#10;210x Terrain tiles divided as&#10;   - 20x Plain tiles&#10;   - 82x Jungle tiles&#10;   - 35x Mountain tiles&#10;   - 50x Swamp tiles&#10;   - 20x Outback tiles&#10;   -  4x Special tiles&#10;&#10;",
        "artist": "NA"
    }
]