[
    {
        "name": "Laser Attack",
        "description": "Our galaxy has been invaded by an alien Space Station whose powerful laser beam is drawing vital energy pods away from your spaceships.&#10;&#10;Your mission is to attack and destroy this violator of the Inter-Galactic Peace Accord. You must gather up your scattered energy pods before you risk an assault on the space station. Then, using your energy pods, you block its ports, causing the laser to overload and self-destruct.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Star Wars: Escape the Death Star Action Figure Game",
        "description": "From the Box:&#10;&#10;Board the Death Star... for a fight to the finish!&#10;&#10;Recreate classic Star Wars movie battles in two games! In the first, for younger players, Luke Skywalker, Han Solo, Princess Leia and Chewbacca sneak through the Death Star capturing Imperials. Can you score the most captures?&#10;&#10;Now advance to the next game - and take sides! Darth Vader, Boba Fett and stormtroppers move in the open, capturing Code Cards to win. But the Rebels move in secret. To win, they must use strategy to reach the Millenium Falcon, then dice-roll their way off the Death Star!&#10;&#10;Add other action figures you already own...and fill the game board with life-like Star Wars characters!&#10;&#10;Action figures bring intergalactic battles to life! For even more action, add your own figures!&#10;&#10;The game originally came with two limited edition Star Wars: Power of the Force action figures that were unavailable anywhere else:&#10;&#10;&#10;    Death Star Darth Vader (with removable helmet and lightsaber) &#10;    Stormtrooper Disguise Luke Skywalker (with removable helmet and lightsaber).&#10;&#10;&#10;&#10;All other characters were represented with cardboard cutouts in plastic stands; these could be replaced with other action figures from the Power of the Force line.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Drive",
        "description": "In the two-player card game Crazy Chicken, players try to collect as many types of chickens as possible. Each turn, they draw two cards &ndash; from the two draw piles or two discard piles, with each card coming from a different pile &ndash; then either discard one card or lay down a set of cards. To lay down a set, you need at least two cards if that type of chicken hasn't been played or more cards than are already on the table if it has been played. Any cards of the same type on the table are discarded onto a single discard pile. The round ends when one player has six types of chicken, all types of chicken are on the table, or only one draw pile remains. Players then earn points based on which types of chickens they own: for example, Marilyn Henroe has only six cards in the deck and is worth 6 points, while Billy the Chick has twenty cards and is worth 20 points.&#10;&#10;After four rounds, the player with the most points wins.&#10;&#10;In 2005, SimplyFun republished Crazy Chicken as Drive, with rules for up to four players and a collectible car theme. Three rounds are played rather than four.&#10;&#10;",
        "artist": "Damon S. Brown,Oliver Freudenreich,Atelier Wilinski"
    },
    {
        "name": "Avalon",
        "description": "Avalon is a card-based game where a line of 11 landscape cards form the board and the cards in your hand are made up of Knights and Enchantresses. There are 8 of each in each of five different colors, for a total of 80 cards, which both players share as a common draw deck.&#10;&#10;The game starts with the landscapes face down, randomly assigned knights or enchantresses on each player's side of the landscape cards, and five knights/enchantresses in each players hand. In the course of the game, if you play knights on your side of the territory and you have at least as many cards on your side before playing the card, you have the option of declaring an attack with that knight. The other player has a chance to respond by defending with a knight of exactly the same color (in which case both knights are left in place). If the attacker is successful, the loser loses all of their cards from their side, and the winner loses an equal number. Then, the winner must lose an additional number of cards from their side or the hand equal to the total number of knights on both sides that were involved in the conflict. Finally, the region is turned face up with the crowns on the bottom facing toward the controlling player. You can only attack up to two landscapes per turn, but you may play as many cards as you would like to on your turn. The max hand size at the end of a round is 5. The object is to control 15 crowns at the end of your turn (number of crowns on a card ranges from 1-3).&#10;&#10;Two landscape cards have special abilities - Avalon reduces your loss from battles by one once per turn, and the forest with a standing stone allows you to declare an attack on your opponent with an enchantress as if she was a knight.&#10;&#10;Enchantresses normally will convert enemy knights from their side of the board to yours unless countered with a same color enchantress. The countering player receives the aggressor's attacking enchantress into his hand if he counters an enchantress.&#10;&#10;When the player is done playing cards, he draws one of the 5 Light tiles or 4 Dark tiles that describe the options for replenishing cards in hand. Light tiles give you their benefit immediately, and Dark tiles give you their benefit at the beginning of your next turn. Each tile is used only once until all tiles have been used, at which point they are all available again. After drawing a replenishment tile, the player's turn is over and the game continues with the next player.&#10;&#10;Avalon is part of the Kosmos two-player series.&#10;&#10;",
        "artist": "Anke Pohl,Thilo Rick,Sabine Weiss"
    },
    {
        "name": "Xe Queo!",
        "description": "Seven tokens of seven different colors and one ring are placed randomly on eight spaces of a seven-by-seven grid. Each player has seven disks that correspond to each of the seven tokens.&#10;&#10;At the start of a round, each player secretly selects one of the seven tokens. (The disks are used to do this.)&#10;&#10;You may do the following on your turn:&#10;&#10;     Move any of the tokens Chinese Checkers-style towards the ring&#10;     Guess which token your opponent has chosen&#10;&#10;&#10;&#10;&#10;You win the round by:&#10;&#10;     Moving the token you have chosen into the ring&#10;     Correctly guessing which token your opponent has chosen&#10;     Choosing the same token as your opponent, and having your opponent move that token into the ring&#10;&#10;&#10;&#10;&#10;Best out of seven rounds wins the game.&#10;&#10;Ages 10 and up&#10;&#10;",
        "artist": "Johann Rüttinger"
    },
    {
        "name": "The Sun of Austerlitz",
        "description": "THE SUN OF AUSTERLITZ &#10;&#10;Napoleon's campaign in Moravia 1805&#10;&#10;Components: One 22 x 34&quot; map, 280 counters, 20 pages of rules, 7 player aid charts for setup and organization displays. November-December 1805.&#10;&#10;Map covers the territory from Znaim and Brunn to Olmutz and Ostrava, with the regular 2 miles to the hex. And it can mate with the &quot;1809&quot; map (Victory Games), allowing for a precession of the campaign through Durrenstein and Znaim.&#10;&#10;The campaign scenario begins on 15 November, with the Russians retiring on Br&uuml;nn and the French in pursuit. A second scenario begins with the French spread out around Br&uuml;nn and the Coalition forces in Olm&uuml;tz. Fortunately for Napoleon, the Allies attacked, but what if they had not? With the imminent entry of Prussia into the war, Napoleon would have been forced to advance on Olm&uuml;tz, and his forces would have been beyond their LOC.&#10;&#10;Detailing Napoleon's campaign in Moravia, 1805, Sun of Austerliz is the only game to simulate the whole campaign at the operational level (2 mi/2 days/1,000 men) from the Fall of Vienna through the actions of Hollabrunn, Schoengrabern, and Wischau, to Austerlitz.&#10;&#10;GAME SYSTEM: CAMPAIGNS System - Series 1X = &#10;- scale = 3,200m/hex, &#10;- time = 2 days/turn&#10;- strength = 1,000 men/SP, .&#10;&#10;",
        "artist": "François Gérard,Mark Hinkle,Mark Simonitch,Joe Youst"
    },
    {
        "name": "Dante's Inferno",
        "description": "This is a fairly complex strategy game featuring resource management and trading.  The objective is to move one of your player tokens to the 9th circle and defeat Lucifer.&#10;&#10;The initial setup is the outer ring of the board. Each tile is two rings and the tiles are numbered. Players take turns placing 3 of their player tokens on the tile of their choice.  Each tile corresponds to one of four resources.&#10;&#10;At the beginning of each player's turn, two dice are rolled.  A 7 brings a demon into play in a corner of that player's choice.  Any other number will result in some players gaining resources. Rolling doubles gives your regular allotment of resources, plus a resource of your choice.  Rolling 2 or 12 allows you to place a marker on one tile that either doubles or eliminates production for that tile.&#10;&#10;Players can use their resources to bring out new player tokens, buy new tiles for inner circles of hell, move themselves, descend deeper into hell, move others, flip tiles, or alter die rolls.  Players can trade resources with other players during their turn.  The lower circles of hell generate more resources (2 for 3/4, 3 for 5/6 and 4 for 7/8).&#10;&#10;The game ends when a player descends to the ninth level and defeats Lucifer by rolling a 10 or better on two dice.&#10;&#10;",
        "artist": "Dave Aikins"
    },
    {
        "name": "The Rise of the Roman Republic",
        "description": "(from GMT website:)&#10;&#10;The Ancient World: Rise of the Roman Republic is the first volume in a projected series of games that will cover virtually every war and campaign in ancient history on the same scale and scope that the legendary Europa series did for WWII. Each game and module in the series will add maps, units, and all the personalities that will enable you to play, in some, but not daunting, detail your favorite periods.&#10;&#10;Volume I, Rise of the Roman Republic, is the introductory game to the Ancient World series with shorter, smaller scenarios. Rise of the Roman Republic includes scenarios for the Samnite Wars (which also includes a three-player version that takes in the invasion of Alexander of Epirus), the invasion of Pyrrhus (including his Sicilian adventures), and also the first three years of Hannibal, all on a single map of Italy, complete with dated road system.&#10;&#10;The focal point of the game system is the unusual set of mechanics that, in essence, have no allowance limits to movement. Units - troops under a leader - are free to move as far and as long as they want, subject to two major factors: leader capability to do so, as well as attrition.&#10;&#10;The Romans are really fun, mostly because you have to master the Roman political system, from yearly elections, to pro-roguing consuls, even to asking the Senate permission to do many things, all of which serve to make running the Roman armies about as close to realistic as has ever been seen in a wargame.&#10;&#10;The land combat system uses a unique Combat Results Table that includes the dreaded Unusual Result dicerolls, which replicate the battles that took place wherein the outcome belied the odds. But you still get the Carthaginian cavalry, the Epirote hoplites, elephants, and all the usual goodies you'd expect in such a game.&#10;The Ancient World is aimed at aficionados of the subject, as well as those interested in the breadth and depth of campaign operations. Yet it is a very playable system in which most scenarios can be finished in an evening, and none, in Rise of the Roman Republic, take more than one map.&#10;&#10;Game Features&#10;TIME SCALE     1 year per turn&#10;MAP SCALE     13 miles per hex&#10;UNIT SCALE     Strength point = either 500 men; 300 cavalry; 10 elephants&#10;NUMBER OF PLAYERS     1-2&#10;&#10;DESIGNER Richard Berg&#10;DEVELOPER Alan Ray&#10;MAP ART Mark Simonitch&#10;COUNTER ART Rodger B. MacGowan and Mark Simonitch&#10;&#10;",
        "artist": "Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "Enemy at the Gates",
        "description": "Enemy at the Gates - The Stalingrad Pocket to Manstein's Counterattack Army Group South - 19 Nov '42 to 14 March '43, is an OCS game about the Uranus Counteroffensive to encircle Stalingrad and the subsequent &quot;Backhand Blow&quot; of Manstein in the fourth battle for Kharkov.&#10;&#10;&#10;(from the Game Box:)&#10;&#10;On a cold, foggy morning in November, 1942, a four-hour artillery barrage rocked the Rumanian lines north and south of Stalingrad. Countless swarms of Red infantry, tanks, and guns then swept the lines. In four days, the pincers met near Kalach-um-Don &ndash; entombing the 6th Army in Stalingrad. During the next three months, the Germans will reel from successive Soviet hammer blows, try in vain to relieve the 6th Army, and fail to supply it from the air. The 6th Army surrenders, and only the counter-attack by von Manstein&rsquo;s panzers stop the red tide. The turning point of World War II in Europe has passed.&#10;&#10;Enemy at the Gates, the second Operational Combat Series release by The Gamers, offers players different challenges from those in the very popular game Guderian&rsquo;s Blitzkrieg. The Soviet army has rearmed and reorganized their Tank Corps &ndash; their challenge to the Panzer Divisions. The unique force structures of each side force players to fight differently in order to maximize their strengths. And, of course, players must face the toughest operation and strategic choices they have ever faced. When to stand, when to run&hellip;and when to strike.&#10;&#10;Enemy at the Gates covers the entire period from 19 November 1942 to mid-March 1943. There are numerous one and two map scenarios. The game covers Operation Uranus, Operation Little Saturn, the German Relief and airlift efforts, and Operation Star and Gallup (to include von Manstein&rsquo;s famous &ldquo;backhand blow&rdquo;).&#10;&#10;Extensively researched, playtested, and developed, Enemy at the Gates will satisfy the Eastern Front interest of any gamer who wants to know more than the pulp-history version of these pivotal events!&#10;&#10;Features:&#10;Dynamic and fluid situation&#10;All of the pivotal battles in AG South&#10;The creation of the Stalingrad pocket&#10;The relief effort and airlift&#10;Mansteins famous Backhand Blow!&#10;Follow-on to the popular Guderian's Blitzkrieg game and system- refined based on player feedback&#10;Player skill is highly rewarded&#10;&#10;Game Scale:&#10;Turn: Half-week&#10;Hex: 5 miles / 8 Km&#10;Units: Battalion to Army&#10;&#10;Game Inventory:&#10;Four 22 x 34&quot; maps (Maps A, B, C &amp; D)&#10;One 8 x 11&quot; Stalingrad 'Blow-Up' map&#10;Eight dual-side printed countersheets (5 combat, 3 markers - 2,800 1/2&quot; counters)&#10;One 36-page OCS rules booklet&#10;One 36-page Enemy at the Gate game specific rules booklet&#10;Two 6-page OCS version 2.0 Charts &amp; Tables Folders&#10;Four Player Aid cards&#10;Two 6-sided dice&#10;&#10;Complexity: High&#10;Solitaire Suitability: High&#10;Playing Time: 4-100 hours&#10;Players: 1 or more&#10;&#10;",
        "artist": "Dean Essig"
    },
    {
        "name": "Europe Engulfed",
        "description": "from GMT website:&#10;&#10;More than thirteen years of design and development have gone into the making of Europe Engulfed (EE), which is GMT Games' first offering to the block-game enthusiast. It covers the entirety of World War II in Europe from September 1939 to the end of 1945.&#10;&#10;Europe Engulfed plays fast with its focus on playability and making players feel the pressures their historical counterparts were under. The game achieves this level of playability without sacrificing historical detail. The entire campaign is playable in a single 10-to-14 hour day once players become familiar with its elegant game systems including:&#10;&#10;Wood Block Units:&#10;Wood blocks for land units provide a realistic fog of war. Only the controlling player can see if their units are armor or infantry, weak or strong until combat is engaged. The inability to know the strength of your opponent ensures that even the most experienced players will make their fair share of tactical and strategic errors.&#10;&#10;Production and Strategic Warfare:&#10;Europe Engulfed Game Turns represent two months each and production and strategic warfare takes place within each of these turns. The inventive production system shows that the conquering power does not get the same value out of resource areas as the original power that lost them. Production levels are easy to calculate and production choices include special actions, fleets, U-boats, strategic fighter and bomber assets, ground-support units, flak, V-weapons, and, of course, lots and lots of armor and infantry and the odd paratrooper or cavalry unit from which to choose.&#10;&#10;Special Actions:&#10;Special actions are an innovative rule system to account for the large historical territorial gains that occurred over the course of a two-month game turn without bogging the game down with multiple player turns. Using Special Actions, players can purchase additional movement phases and combat rounds, amphibious and airborne assaults, and even take actions during an opponent's combat phase.&#10;&#10;Rulebook and Playbook:&#10;The 24-page rulebook is clearly written with many examples. Also included is a 24-page playbook. The playbook includes player notes, designer notes, optional rules, scenarios, index, and an extended example of play highlighting the May/June 1940 turn which reveals tactics for successfully attacking and defending.&#10;&#10;Europe Engulfed plays quickly with a very historical feel. Many players have indicated that they actually feel the pressures and stresses felt by the strategic level commanders in the real war. We know of no other European Theater of Operations game that plays this fast and with this much historical value.&#10;&#10;Play Times:&#10;1939 Campaign: Up to 14 hours&#10;1941 Campaign: Up to 10 hours&#10;Blockskrieg!: Up to 6 hours&#10;European War: Up to 5 hours&#10;'42 - '43 two-map scenario: 4 hours&#10;'42 - '43 one-map scenario: 3 hours&#10;Patton's Fantasy scenario: 2 hours&#10;&#10;Integrates with: &#10;&#10;    Asia Engulfed&#10;&#10;&#10;&#10;&#10;",
        "artist": "Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "Mag·Blast (Second Edition)",
        "description": "First edition with new artwork and extra Flagships, Actions and Ship upgrades.&#10;&#10;Upgrades include; 2nd Gun (2 Shots without Direct Hit being played); Security Force to prevent Boarding; Turret Defense (cannot be targeted by Fighters/Bombers); Long Range Cannon (allow Ships to fire into adjacent zones).&#10;&#10;Re-implements:&#10;&#10;    Mag&#194;&#183;Blast&#10;&#10;&#10;&#10;&#10;Re-implemented by:&#10;&#10;    Mag&#194;&#183;Blast (Third Edition)&#10;&#10;&#10;&#10;&#10;",
        "artist": "John Goodenough,John Matson,Ben Prenevost,Brian Schomburg,Tyler Walpole"
    },
    {
        "name": "On Assignment with National Geographic",
        "description": "OBJECT:&#10;To be the winning photographer by earning the greatest number of points. YOU EARN POINTS BY:&#10;&#10;    Traveling to your assigned destinations on the Map Board&#10;    Being the first to fill your portfolio with the 6 photo cards in your portfolio&#10;    Getting rid of photo cards that don't fit your portfolio list, as they count against you at the end of the game&#10;    Demonstrating your knowledge of geography by answering continent card questions for tokens&#10;    Getting lucky breaks (drawing even chance cards)&#10;&#10;&#10;&#10;&#10;This is basically an educational game of trivia about geography, which includes a great number of cards depicting nice NatGeo photos of every country around the world. The use of clues make it suitable for most ages. However, the clues are not easy and young children will struggle to answer the majority of the questions.&#10;&#10;",
        "artist": "Alison Wilbur Eskildsen,Mary Elizabeth Molloy"
    },
    {
        "name": "StarSoldier: Tactical Warfare in the 25th Century",
        "description": "A tactical level simulation of combat between a small number of StarSoldiers, powerful future warriors - shades of Starship Troopers. Firmly rooted in SPI wargaming - along with the usual complexity and breadth of rules. One notable about the game is that it has simultaneous plotted movement - manageable since each player only controls 3 - 12 warriors. There are many scenarios and a campaign as well.&#10;&#10;&#10;Part of the StarForce Trilogy box set, along with StarForce amd Outreach.&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "Eastern Front Tank Leader",
        "description": "Eastern Front Tank Leader is the first game in West End Games' Tank Leader series.  A tactical (platoon/company level) game where formations are activated by playing command cards.  The emphasis is on command, control, and communications with the use of Command cards that represent formations which are used to determine order of movement/combat, rallying, and group cohesion. The game is similar to the Panzerblitz type of game but with the addition of soft factors such as unit experience, command, and morale.&#10;&#10;The terrain on the map is variable for woods, contours, and cities, which are defined in each scenario.&#10;&#10;",
        "artist": "Stephen Crane,Diane Malz,Kevin Wilkins"
    },
    {
        "name": "The Perilous Parlor Game",
        "description": "Board game inspired by and based on the Series of Unfortunate Events childrens books by anonymous author &quot;Lemony Snicket&quot; in which the Baudelaire orphans are cared for by the evil Count Olaf while hoping for visits from the friendly Mr. Poe, the executor of their estate. Set in the Olaf mansion, one player is Count Olaf, while the other player(s) are the Baudelaire children. The game lasts roughly 24 turns, which is how long it will take Mr. Poe to travel to the bank and back to the mansion to visit the children. While he's gone, it is Count Olaf's job to successfully play Tragedy cards to damage The Guardians health (by moving into a room in the manor on which The Guardian's marker is in then playing a special card), while the children attempt to collect items in the manor with which they can thwart Olaf's schemes and restore health to The Guardian. The children win if Poe manages to get back from the bank, but Olaf wins if he drains all of The Guardian's health and kills him. The theme is extremely well used in this high-presentation childrens game.&#10;&#10;Excerpt from the box:&#10;&quot;If you wish to play a game where the hero always wins, the villain is forever defeated, and innocent children are brought to warmth and safety, then I encourage you to put this box down immediately and for something involving lollipops, ponies, or educational flashcards. The lives of Violet, Sunny, and Klaus Baudelaire are fraught with sorrow, mis-fortunate, and unpleasantness, and the game in their honor contains the exact same things.&quot;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Crusades",
        "description": "A strategic level hex-wargame treatment of the 1st and 3rd Crusades, 1096-1099 and 1190-1192 respectively. The rules for each Crusade share the same basic mechanics however the 3rd Crusade scenario is designed as a two-player only game, while the 1st Crusade scenario is intended for multi-player play, and has additional rules covering diplomatic and economic elements.&#10;&#10;Distinguishing features:&#10;&#10;    Combat occurs within hexes.&#10;    Sieges play a significant part in the game.&#10;    The 1st Crusade scenario creates a co-operative yet competitive game in that the crusader players must co-operate for the Crusade to succeed yet still need to pursue their own objectives (the same applies to the Muslim players).&#10;    Lots of atmospheric 'chrome', individual Crusader and Muslim leader are present as units, random events (plague, visions, treachery etc), Armenian and Byzantine intervention.&#10;    All orders for a turn are pre-written - makes for a long game (particularly the 1st Crusade scenario).&#10;    The map covers South-East Asia minor down through the Holy Land and Northern Egypt. Constantinople and the early part of the rout of the 1st Crusade is therefore not covered.&#10;&#10;&#10;&#10;&#10;One of the few  strategic level treatments of the Crusades. GMT have subsequently published 'Onward Christian Soldiers' (also by R.Berg); Columbia have published 'Crusader Rex', and Multi-man publishing have published Kingdom of Heaven.&#10;&#10;This was published as both a boxed set by SPI and in their Strategy &amp; Tactics magazine #70.&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "Alhambra",
        "description": "Granada, 1278.  At the foot of the Sierra Nevada mountains, one of the most exciting and interesting project of the Spanish Middle Ages begins: the construction of the ALHAMBRA.&#10;&#10;The best master builders in the whole of Europe and Arabia want to demonstrate their skill.  Employ the most suitable teams of builders and make sure that you always have enough of the right currency.  Because no matter whether they are stonemasons from the north or horticulturalists from the south, they all want a proper wage and insist on their &quot;native&quot; currency.  With their help towers can be constructed, gardens laid out, pavilions and arcades erected and seraglios and chambers built.&#10;&#10;In Alhambra, players are acquiring buildings to be placed within their Alhambra complex.&#10;&#10;The money in Alhambra comes in four different currencies and is available in the open money market.  The 54 buildings of six types become available for purchase in the building market four at a time; one building is available in each of the four different currencies.  On a player's turn, a player may 1) take money from the open money market, 2) purchase a building from the building market and either place it in his Alhambra or reserve, or 3) engage in construction and re-construction projects with buildings that have been placed in the player's Alhambra or reserve. The game rewards efficiency, as when a player purchases a building from the market for the exact amount of money, the player may take another turn.&#10;&#10;Players with the most buildings in each of the six building types in his Alhambra score in each of the scoring phases, and points are awarded for players' longest external &quot;wall&quot; section within their complex. The game ends when the building market can no longer be replenished from the building tile supply, and there is a final scoring, whereupon the player with the highest score wins.&#10;&#10;Integrates with:&#10;&#10;    Alhambra: The Dice Game (a variant in which you can combine Alhambra buildings with Alhambra dice.)&#10;&#10;&#10;&#10;&#10;",
        "artist": "Jörg Asselborn,Jo Hartwig,Christof Tisch"
    },
    {
        "name": "Chez Grunt",
        "description": "'Chez Geek' set in the army.  Once again, players attempt to gain slack in any way that they can.  Food, jobs, nookie... apparently the army is more fun than you thought.&#10;&#10;",
        "artist": "John Kovalic"
    },
    {
        "name": "Arnhem: Defiant Stand",
        "description": "The Battle of Arnhem in super detail, with a building by building map with big hexes (you can put a bunch of counters in each one).&#10;&#10;&#10;    10 mostly small scenarios &#10;    Two sheets of die cut counters with new art - big 3/4&quot; AFV counters including lots of unusual German AFVs &#10;    Giant-hex two sheet map depicting downtown Arnhem in September 1944 &#10;    Super-sized deluxe AFV cards for all AFV types &#10;    Sturdy box &#10;    Two ten-sided dice &#10;    Four Play Aid cards &#10;&#10;&#10;The tank counters are 3/4&quot; across - the largest AFV counter of any tactical-level system on the market. The personnel counters are 5/8&quot; each.&#10;&#10;Mostly a two or four-player game - it seems to play very quickly. There is a Basic Game included that explains all of the rules in a simple format. It takes about a half hour to get comfortable with tanks, infantry and terrain and start really playing. Very solid and extremely nice production values.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Wacht am Rhein",
        "description": "SPI's monster game of the Battle of the Bulge. 4 maps.&#10;This is a grand tactical simulation of the Battle of the Bulge. Recreate the decisive engagement that represented Hitler's last major effort to win the Second World War.&#10;Not a simple game to learn, but once mastered a very enjoyable game.&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "King's Breakfast",
        "description": "The king has invited you to his castle for breakfast.  During the feast the players will take portions of various dishes from the table to eat.  As a good host, the king will serve all his guests before taking any portion from each course.  From time to time, his pet dragon Emerald will steal some food from his master.  Of course, it is rude for a player to have more of a dish than the king, so players must be careful not to be too greedy.  In the end, the winner is the player who gets the most to eat of the things the king likes best without eating more than the king eats of any dish.&#10;&#10;Online Play&#10;&#10;&#10;     BrettspielWelt (real-time)&#10;&#10;&#10;",
        "artist": "Georg von Westphalen"
    },
    {
        "name": "Objective Moscow: The Death of Soviet Communism",
        "description": "Objective: Moscow is a land/sea/air game of the hypothetical invasion of the former U.S.S.R. in the late 1970s and at the end of the 20th century.  The area depicted on the map covers from Paris to Turkey, to Iraq and central Asia, to China as far south as Peking, to Japan, Korea, and Alaska.  In all, units of more than 30 nations are included.  This is truly a 'World War' monster game set in Modern times.&#10;&#10;Several scenarios are postulated, including a NATO counteroffensive after a Soviet invasion of Western Europe, a Chinese invasion of Siberia, and an Iranian campaign of expansion in the Middle East. Scenarios taking place later postulate an alliance of the USA, a United Europe, Iran, China, and other countries joining for the conquest of the Soviet Union.&#10;&#10;Contains: 24 page rulebook; 1,200 colorful die cut cardboard playing pieces; four 22&quot; x 34&quot; hexagonal grid soft map sections; and various playing aids.  This game came in a flat plastic pack or a 'detergent soap' sized box.  An excellent solitaire as well as 3-player game.&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "Junior Stratego",
        "description": "A children's variant of the classic strategy game using a special die to decide combat, rather than a value system. Each team consists of wizards, princesses, knights etc.&#10;&#10;At the near and far edges of the board are three spaces, where players place their &quot;major&quot; pieces (flag, jester and the robber baron) in any order. The first player to capture the other's flag is the winner.&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "Eketorp",
        "description": "This text refers to the Queen 2007 reprint. The older edition had players write down their viking orders and was two rounds longer.&#10;&#10;In Eketorp, players build Viking strongholds upon the Swedish island of &Ouml;land.&#10;&#10;The goal of the game is to collect the most valuable blocks to build your own fortress, either by winning battles on the resource spaces or by stealing blocks from other vikings.&#10;&#10;Each turn, new resources appear and the players secretly plan their viking movements. After all the placements are revealed, vikings battle each other for blocks (with the losers sent off to the field hospital to recover). The game ends after a set number of rounds, or when one of the players has succeeded in finishing their fortress.&#10;&#10;",
        "artist": "Jo Hartwig"
    },
    {
        "name": "Azhanti High Lightning",
        "description": "From the rulebook: Azhanti High Lightning is a game of close-action combat between individuals on board a large military spaceship. The game covers the weapons and personal abilities which can reasonably be expected aboard a starship; tactics and strategies then become the realm of player input. A variety of scenarios are provided, and many more can be generated using the components included in the game.&quot;&#10;&#10;A &quot;square and counter&quot; supplement to Traveler, similar to Snapshot. Each turn is 15 seconds, each square 1.5 meters, counters represent one individual or animal.&#10;&#10;",
        "artist": "Rich Banner,Naoyuki Kato"
    },
    {
        "name": "The Ungame",
        "description": "The UNGAME was designed for YOU to experience the fun of learning how to communicate more effectively. As you share thoughts, ideas and feelings, you will develop a deeper understanding of others and of yourself. Each person's ability to respond and become involved will improve as he continues to TELL IT LIKE IT IS. You'll find the UNGAME both entertaining AND educational.&#10;&#10;The UNGAME is appropriate with friends, for family circles, classrooms, committees, counseling groups, and at any social gathering.&#10;&#10;From two to six people can participate and there is no competition! Everyone wins! So follow the rules and have a most enjoyable time TELLING IT LIKE IT IS!&#10;&#10;Games last for a predesignated amount of time agreed upon by the players prior to the start. 1 hour - 45 minutes is recommended. Players take turns rolling and moving. When your piece lands on a space, you do what that space says, usually draw a card or answer the question on the board. The goal of the game is to connect to the other players on a deeper level. Only the individual players can determine to what extent they have won.&#10;&#10;Themes for the game and depth of questions shift with varying decks of cards and expansions.&#10;&#10;Ostensibly, this is Outside the Scope of BGG, but is kept in the database by fiat due to history.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Shark Attack!",
        "description": "Summary: The shark goes around in circle devouring fish. The last fish left un-eaten is the winner.&#10;Text on back of box:&#10;&#10;DON'T GET GULPED!&#10;&#10;It's a race!  And a chase!  And a swim-for-your-life escape!  You are one of four little fish that encounter a shark with a ferocious appetite.  You've got to move -- and move fast!&#10;&#10;Roll the dice and move your fish.  But watch out!  If you're not fast enough, the motorized shark creeps up behind and swallows your fish.  You're out of the game.  The last fish to escape that shark's bite wins the game.&#10;&#10;",
        "artist": "Chuck Slack"
    },
    {
        "name": "Dying Lights",
        "description": "The galaxy is bleeding to death.&#10;People are dying with each new nightfall as their very souls wither. &#10;Their only hope lies in destruction, and you must teach them how to sow it...Dying Lights is a game of interstellar combat and survival for 2 or more players. The game is played using cards that represent starships, sectors of space, special combat maneuvers, the terrain on which battles are fought, and other such circumstances. The goal of the game is to ensure your faction's survival, whether through military force, heroic self-sacrifice, or simply outlasting the enemy.&#10;&#10;",
        "artist": "Steve Argyle,Mark Argyle"
    },
    {
        "name": "Switchboard",
        "description": "The playing surface consists of 36 tiles laid out numerically to form a square. Each tile contains spots which form a pathway; some form straight paths, some are angled paths and some form crossroads. As players advance their tokens along the paths, they also move the tiles in an attempt to bottle up opponents while building the shortest possible path to the Finish for themselves.  Thus, the pathway is continuously shifting, branching out, and breaking into segments.&#10;&#10;Also published in 1965 as a promotional game for Culligan, title &quot;Hey, Culligan Man!&quot;.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Gulo Gulo",
        "description": "Each player is a Gulo, or wolverine, trying to rescue a baby Gulo who got caught by the swamp vulture whose eggs it was trying to steal.  Unfortunately for the baby Gulo, all the adult Gulos are distracted by all the delicious swamp vulture eggs, and it has to wait very, very patiently as the adults constantly trip the very, very sensitive &quot;egg alarm&quot; rigged by the vulture to scare off the pesky Gulos.&#10;&#10;There is a nice wooden bowl filled with multicolored swamp vulture eggs of various sizes, into which a long thin dowel with another egg at one end is inserted, like a flagpole.  As you can imagine, lots of M&amp;M Peanut-shaped wooden bits banging around together in a polished wooden bowl makes it rather difficult to keep a thin dowel with weight at the top balanced...&#10;&#10;The essential mechanic of the game is to try to pull an egg of a particular color and move to a tile of that color on the linear path toward the bowl, and the little stack of tiles hiding the baby Gulo tile.  If you set off the alarm, or knock any eggs out of the bowl, your Gulo is sent back to the previous tile of the attempted color.  If there's no such tile, then back to the start he goes!&#10;&#10;",
        "artist": "Victor Boden"
    },
    {
        "name": "Monty's Gamble: Market Garden",
        "description": "(from the back of the box :)&#10;&#10;Monty's Gamble: Market Garden is a simulation of the Allied attack in Holland. The Allied must land paratroopers, seize key bridges, and get XXX Corps up &quot;Hell's Highway&quot; to relieve the British paratroopers in Arnhem, all while the Germans are attempting to break their supply line.&#10;&#10;Monty's Gamble features a semi-simultaneous movement System which provides maximum interaction and requires players to make tough choices as every move they make may be countered by their opponent. Both players will have pressing needs up and down &quot;Hell's Highway&quot; but may only address one at a time&mdash;hopefully before the variable turn length causes the turn to end!&#10;&#10;CONTENTS: &#10;1 Unmounted Mapsheet&#10;2 Countersheets &#10;1 Rulebook with history and designer notes &#10;4 Setup Cards &#10;4 Dice&#10;&#10;&#10;(BGG description :)&#10;&#10;An Area-Impulse game based on the game engine pioneered in Storm Over Arnhem and developed through Breakout: Normandy. &#10;Monty's Gamble: Market-Garden covers the airborne drive into Holland in 1944 using the same basic system as Breakout: Normandy (with infiltration from Turning Point: Stalingrad thrown in).&#10;&#10;The game features a basic game (4 days) and an extended game (5-10 days), and a game layout (including rules, examples of play, etc.) very similar to Breakout: Normandy.&#10;&#10;",
        "artist": "Nicolás Eskubi,Kurt Miller,Joe Youst"
    },
    {
        "name": "Cirondo",
        "description": "Played on a round board the object of the game is to eliminate your opponent(s) whilst remembering the game is about offense, defense and sacrifice.  &#10;You are to advance forward one space at a time with your moons, whilst defending them with your planets and setting up strategies to attack your opponent(s) stellars.  When the moon reaches the inner ring it is sucked into the void and exchanged for a solar system.  The solar systems are the most powerful stellar which every player is aiming to get.  The planets are defending pieces which can only move in arcs around the board.  &#10;A great strategy game for 2 or 4 players or 2 teams of two.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Antietam: The Bloodiest Day, 17 September 1862",
        "description": "Increasingly regarded as THE pivotal battle of the civil war, this &quot;mini&quot; game is based on rule systems from Borodino and Austerlitz; and shares basic rules with others in the SPI Blue & Gray Folio Series (Chicamauga, Gettysburg and Shiloh) Scale is 400 meters/hex. 1-2 hours per Game Turn. Union Movement Restrictions are used to reflect McClellan's lack of aggression.&#10;&#10;Rigid Zones of Control, retreat and advance after combat, and Sequential Player Turns are common to these games, but a new concept, &quot;Attack Effectiveness&quot; is introduced. Surrounding to cut off retreat is a major strategy.&#10;&#10;Fairly wide open terrain, defense specifics (like Bloody Lane) are not detailed but &quot;Burnside Bridge&quot; is.&#10;&#10;",
        "artist": "Edwin Forbes,Redmond A. Simonsen"
    },
    {
        "name": "Monopoly: World Cup France '98 Edition",
        "description": "A monopoly (from Greek monos &mu;&#207;&#140;&nu;&omicron;&sigmaf; (alone or single) + polein &pi;&omega;&lambda;&epsilon;&#225;&#191;&#150;&nu; (to sell)) exists when a specific person or enterprise is the only supplier of a particular commodity.&#10;&#10;Monopoly is a roll-and-move game where players move around the game board buying or trading properties, developing their properties with houses and hotels. When opponents land on players owned property, the owning player collects rent from the landing player. Owning sets of properties increases the rent paid to the player who owns them, by the player who lands on the square. The ultimate goal is to have the most money and drive opponents into bankruptcy.&#10;&#10;This is a World Cup 98 edition. Each block on the map represents a national soccer team.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Totally Insane Card Game",
        "description": "Quick Introduction To &#10;    The Totally Insane Card Game &Ocirc;&#10;&#10;The Totally Insane Card Game plays &ldquo;like&rdquo; you would play UNO&reg;, only with 27 action cards and lots of fun new twists.   The game ends when a player reaches 500 points, lowest score wins.&#10;    The Totally Insane Card Game has numbered cards 0-10 and 27 action cards such as the Change Hands.   If you do not like the cards in your hand, you think another player MAY have a better hand, play the Change Hands to the discard pile and change hands with him.  Other examples of action cards are the Moving Cards, these cards when played, will move the entire hand of all players ether two players left or one player right. The Totally Insane Card Game includes Draw 2, Draw 4, and Take 2, cards that make the next player ether Draw 2 or Draw 4 cards from the draw pile, or Take 2 cards from any player. Of course the draw cards add together so you might have to draw 6 or 8 cards. In Totally Insane, players could take cards from your hand, helping you get rid of your cards, while adding cards to their hand.  The Totally Insane Card Game has a Totally Useless Card this card is exactly what it says totally useless.  At no time can the Totally Useless Card be played to the discard pile.  So what do you do with a card you can&rsquo;t play to the discard pile?   Simple, you give it to anther player so he can&rsquo;t play it either. (If you can&rsquo;t play it, you can&rsquo;t go out.) You can give it away with cards like the Change Hands, Moving Card, or a Forced Kindness.  When you play a Forced Kindness to the discard pile, you give two cards from your hand to any player.  You never know who will be picked on next.  The Totally Insane Card Game boasts one Dead Card, any time this card is played to the discard pile, the hand is over immediately all players add the points of there cards, then deal the next hand.  This is just a sample of the action cards and how they play.  &#10;    The Totally Insane Card Game is designed to play in turn and out of turn, (matching) so you must be alert, or you may miss an opportunity to play a card.  &#10;    The Totally Insane Card Game is fast moving and outrageous fun, for 4 to 12 players Ages 8 and up. &#10;Find us at totallyinsanecardgame.com&#10;&#10;",
        "artist": "Gary Fowler"
    },
    {
        "name": "Dungeons & Dragons: The Fantasy Adventure Board Game",
        "description": "A cooperative dungeon crawl game in which a party of four heroes strives to complete adventures that the Dungeon Master puts before them.  Quite similar to HeroQuest.&#10;&#10;Expanded by:&#10;&#10;Eternal Winter Expansion Pack(2003)&#10;&#10;Forbidden Forest Expansion Pack(2004)&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "King Arthur",
        "description": "England in the Middle Ages is seeking a King. Knights from across the land go on exciting and adventurous quests with one goal in mind: to pull the sword Excalibur from the stone and claim the throne. As in the story, the game lets players take the role of knights wandering from town to town and adventure to adventure. While doing so, they encounter the saga's heroes - bridge guardians, generous barkeeps, successful noblemen - who influence the events of the game. Their voices can be heard from the giant fist-sized stone that is fastened to the gameboard and in which Excalibur rests.&#10;&#10;The electronics of the game pay attention throughout and remember every move of every player: Good deeds are rewarded and un-knightly deeds punished by friendly (or less friendly!) characters which speak to the players through the stone.&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Napoleon at the Berezina",
        "description": "(from ATO website:)&#10;&#10;Napoleon at the Berezina is a solitaire game of the last major action of the 1812 campaign. Disintegrating as it moved along, the French army was faced with total destruction if the three converging Russian armies caught the French army with its back against the Berezina River. A way had to be found across the river before that happened.&#10;&#10;Being a solitaire game, the player should imagine himself as the French side &quot;fighting a colossus of blind automata&quot;. The solitaire rules combine a set of parameters for movement, with a system for authorizing Russian movement and other actions via a track that monitors overall Russian morale and successes to date to assist the player in running a challenging automaton.&#10;&#10;Complexity - Low&#10;Solitaire Suitability - High&#10;&#10;Full color 22&quot;x34&quot; map&#10;200 full color die cut counters&#10;&#10;",
        "artist": "Craig Grando"
    },
    {
        "name": "Made for Trade",
        "description": "An educational game for 2 to 6 players, set in early America.  Each player begins the game as an indentured servant, who must first earn his or her freedom, then collect a list of required items for day to day life. Items are obtained from various shops and are also bought and sold in the marketplace, in exchange for shillings or in trade for other items.  Along the way, various events in history shake things up.  Players visit the many different buildings in a colonial American town (tavern, inn, jail, church, etc.) and find ways to strip other players of their belongings and negotiate trade.  When one player collects all the items on his or her list and ends the game, the player with the most assets becomes the winner.&#10;&#10;Rules contain 3 different levels of difficulty so that the game can be tailored to different age groups (Ages 8 and up, Ages 10 and up, and Ages 12 and up).  The game was developed in cooperation with the Winterthur Museum.&#10;&#10;",
        "artist": "Elizabeth Lada"
    },
    {
        "name": "WarCry",
        "description": "War Cry is a collectible card game set in the Warhammer Fantasy Battles Universe. Instead of painting miniatures, as in Warhammer Fantasy Battles, the players construct their deck using cards that represent various Warhammer Fantasy Units and cards that represent items of equipment and battlefield tactics.&#10;&#10;",
        "artist": "Torstein Nordstrand"
    },
    {
        "name": "Sequence for Kids",
        "description": "Sequence for Kids is a children's version of the popular board/card game Sequence. It has a smaller board, cards that shows various animals instead of a regular deck, and you only need 4 in a row to win.&#10;&#10;Contents:&#10;&#10;&#10;     game board&#10;     42 cards&#10;     84 chips (21 each in red, yellow, green, and blue)&#10;     instructions&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Life Style",
        "description": "A game about guessing (or knowing) players dreams, hopes &amp; wishes - create your own definition of your personal &quot;Life Style&quot; by playing this game...&#10;&#10;Game play: The active player gets a question card (example: Where do you want to go on vacation?), and 4 image cards with possible answers. He orders the cards according to his preferences. The other players try to guess his sequence, and gain a point on each correct guess.&#10;&#10;Re-implements:&#10;&#10;    Sympathie&#10;&#10;&#10;&#10;&#10;",
        "artist": "Thomas di Paolo"
    },
    {
        "name": "Mr. Mouth",
        "description": "Mr. Mouth is a children's action game.  A motorized frog head rotates in the center of an X-shaped board.  Each player uses a spring-loaded hand affixed to each arm of the X to propel plastic housefly pieces into the frog's mouth, which periodically opens and closes.  The first player to flip all ten of his or her flies into the frog's mouth wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Star Wars: Return of the Jedi – Battle at Sarlacc's Pit",
        "description": "From the Back of the Box...&#10;&#10;Ages 7 - 12&#10;&#10;Equipment:&#10;Special three-dimensional game board&#10;17 plastic playing pieces&#10;48 cards&#10;a card holder&#10;&#10;Object: Your favorite Star Wars heroes need your help! Luke Skywalker, Princess Leia Organa, Han Solo, and Chewbacca are being held captive by the evil Jabba the Hutt. They're on his Sail Barge, high above the dangerous sandpit where the monster Sarlacc lives. To escape, you must defeat the Gamorrean Guards -- and the powerful Nikto and Boba Fett -- by pushing them overboard into Sarlacc's waiting jaws. Collect Jedi points for each guard you defeat. Then try to overpower Jabba the Hutt. The one with the most Jedi points at the end of the game is the winner!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Ancients I",
        "description": "Ancients I has 32 different scenarios, each covering a battle from the period 1800 B.C. to 1400 A.D. There is a low Complexity Rating and a very high Solitaire Suitability Rating.&#10;&#10;Re-implements:&#10;&#10;    Ancients&#10;&#10;&#10;&#10;&#10;Expanded by:&#10;&#10;    Ancients II&#10;&#10;&#10;&#10;&#10;Re-implemented by:&#10;&#10;    Ancient Battles Deluxe&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Forward to Richmond!",
        "description": "Forward To Richmond re-creates the First Bull Run, the first major battle of the Civil War. It includes rules simulating the difficulties of commanding raw troops, morale, firefights, bayonet charges, cavalry, artillery, rallying, and hidden movement.&#10;&#10;Published in The Wargamer Magazine volume 1, #13.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Four Battles of the Ancient World",
        "description": "Includes:&#10;&#10;     Arbela - Alexander vs. Darius&#10;     Cannae - Roman Consul Varro vs. Hannibal&#10;     Pharsalus - Julius Caesar vs. Pompey&#10;     Teutoburger Wald - Roman Govenor Varus vs. Germanic Tribes&#10;&#10;&#10;&#10;&#10;Each battle has its own scenario, map and 100 counters. Introductory, Basic and Advanced Rules.&#10;&#10;Companion games:&#10;&#10;    Battles of the Ancient World Volume II&#10;    Battles of the Ancient World Volume III&#10;    Zama: Triumph of the Roman Way of War (Published in Strategy &amp; Tactics magazine #153)&#10;    Battles of the Ancient World: Marathon and Granicus (Published in Strategy &amp; Tactics magazine #214)&#10;&#10;&#10;&#10;&#10;Also available as a box set with all three volumes.&#10;&#10;",
        "artist": "Joy Cohn,Callie Cummins,Christine Lockwood,Mark Simonitch"
    },
    {
        "name": "Hannibal: The Second Punic War",
        "description": "Strategy &amp; Tactics magazine #141.&#10;&#10;Hannibal covers the conflict between Carthage and Rome, during the period of 218 to 195 B.C. Each turn represents one year. During each turn, there is in sequence a Diplomacy Segment, a Carthaginian turn and a Roman turn. Basic and Advanced Rules allow customization of gameplay. Strategic movement is performed on the map. When armies engage each other, they are transferred to a Battleboard, which allows for army field positioning and tactical combat.  Amphibious Assaults, Recruiting and Promotion on the March, Siege Assault, Naval Combat and Interception, and Neutrals are all part of the basic rules. Tactical Superiority, Roman Battlefield relief, Supply and Attrition, Land Units in naval combat, Limited Intelligence, Blockade, and special rules for Syracuse are Advanced rules.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Blokus 3D",
        "description": "In the game Rumis, the players construct an Inca building with their stones. All players receive three-dimensional pieces made of wood, which they will try to position adjacent to their already placed pieces of their own color. All of their own pieces are of different shapes, which is a challenge to the three-dimensional imagination.&#10;&#10;Cubic, wedge-shaped, or pyramidal volumes are different building limitations, which are imposed by the various building scenarios. Playing RUMIS, you will find that no game is similar to any previous one. Once your mind has mastered the puzzling shapes of the RUMIS pieces, you will explore the depth of tactical and strategic possibilities offered.&#10;&#10;The rebrand by Educational Insights is labelled 1 to 4 players on the box, adding solitaire puzzles such as building a 3x3 cube with one color and building the various shapes using all the colors, following the rules of the multiplayer games while leaving no gaps in the structure.&#10;&#10;Expanded by:&#10;&#10;&#10;    Rumis+&#10;&#10;&#10;",
        "artist": "Stefan Kögl"
    },
    {
        "name": "Genius Rules",
        "description": "Genius Rules is played with a deck of cards depicting historical thinkers categorized as thinkers, artists and leaders.  For each game there is a &quot;secret rule&quot; known only to the moderator.  The other players attempt to position the cards in accordance with their best guess of the &quot;secret rule&quot; that governs the pattern of placement.  The moderator allows them to continue when correct, but stops play and corrects their moves when incorrect.  The objective of the other players is to be the first to correctly guess the Secret Rule.  There is also strategy for the moderator in terms of giving out information as incompletely as he/she can.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Cranium Cadoo",
        "description": "A version of Cranium &quot;scaled down&quot; for kids, although the game should still appeal to adults who like Cranium.  Here's the manufacturer's information:&#10;&#10;&quot;With a variety of hilarious activities, Cranium Cadoo gets kids thinking, creating, giggling, grinning, and laughing like crazy as they try to get four in a row to win. With so many different activities, there is something in Cranium Cadoo that will make every kid hoot and high-five. They might even discover a talent they never knew they had!&#10;&#10;And kids just love the cool Cranium Clay, funky tokens, and especially the Secret Decoder Mask. Whether kids love to act, puzzle, sketch, sculpt, or even crack secret codes, Cranium Cadoo has something for everyone&hellip;including you!&quot;&#10;&#10;",
        "artist": "Damon S. Brown"
    },
    {
        "name": "Air & Armor",
        "description": "Air &amp; Armor is a simulation of near future combat in a Warsaw Pact invasion of West Germany, taking place on 50 miles of the Inter-German border near Wurzburg and Schweinfurt in the US VII Corps sector. Units represent companies, battalions and regiments supported by a wide range of helicopters and attack aircraft.&#10;&#10;Instead of granting NATO units combat strengths far higher than the Soviet strengths to compensate for inferior numbers, the game emphasizes the doctrinal and command differences between the opposing armies that provide NATO with the force multiplier it needs to survive. Players operate asymmetric command systems, and each is challenged to get the most out of his system. The game system also creates a true &quot;fog of war&quot; environment in which deception, outguessing your opponent and tactical surprise can pay off handsomely.&#10;&#10;Game Scale:&#10;1 hex = 1 mile&#10;1 turn = 2 hours (day), 6 hours (night)&#10;Each unit step = 1 company or Warsaw Pact artillery battalion, 3-4 aircraft&#10;&#10;Turn Sequence:&#10;1. Warsaw Pact Planning Phase&#10;2. Initiative Phase&#10;3. Mission Phase (players alternate)&#10;4. Reserve Phase&#10;5. Bookkeeping Phase&#10;&#10;",
        "artist": "Stephen Crane,Richard A. Johnson,Kevin Wilkins"
    },
    {
        "name": "Echelons of Fury",
        "description": "Echelons of Fury is the Tactical Command Series card game of WWII Tactical Warfare.&#10;&#10;Re-implemented by:&#10;&#10;    Echelons of Fury Pacific&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Testimony of Jacob Hollow",
        "description": "Each player plays a character who has become embroiled in the mysteries of the once-tranquil town of Castle Bay.  Your objective is to survive horrible encounters and frightening locations as you search for clues to uncovering the mystery.  Be the first player to gain 10 Investigation Points or be the last one alive in the town, and you win.&#10;&#10;Online Play&#10;&#10;     CCG Workshop (no longer available)&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Pirates' Gold",
        "description": "Pirates' Gold The 3-D Adventure Game with Magnetic Ships, Sunken Treasure and Pirate Danger.&#10;&#10;Move your Pirate Ship over the clear plastic overlay sheet to pick up the treasure chests below by magnets in each ship. However, the board has multiple underwater reefs --if you cross one your ship will sail on, but your treasure will be caught on the reef and sink back to the bottom of the sea. Negotiating the maze to carry your treasure back to your port without losing it on reefs is the main challenge of the game.&#10;&#10;Treasure chests when opened have a value from 0 to 4 coins written in the chest lid that is only seen by popping the chest open once back at your home port. The first player with 10 points in treasure chests wins the game, or play highest once all chests are retrieved.&#10;&#10;Players may only retrieve treasure at their home port opening. All pieces (including Sea Monster) may only move orthogonally, not diagonally. May pick up only 1 treasure chest at a time. May sail through Sea Monster Island, but not end movement there. May not sail through other players or Sea Monster. If Monster is moved onto a player they are sunk. Lift player to drop treasure where they are, return that player&amp;#039;s ship to port and the Sea Monster back to the center island.&#10;&#10;Movement die is 1,2,2,3,3,4. &#10;Rolling a 1 or 4 allows you to roll the Doom Die.&#10;&#10;Doom Die (also six sides)&#10;Skull and Crossbones --steal a treasure chest from another player.&#10;Storms --move a player 3 or 4 spaces (usually over reefs to lose treasure and far away from home port). &#10;Monster --move the monster 2, 3 or 4 spaces.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "A Game of Thrones (first edition)",
        "description": "Description from the publisher:&#10;&#10;War and chaos are engulfing the lands of Westeros. The great Houses are vying for control of the Iron Throne using the old tools of intrigue and war. Yet while the war for Westeros rages, grave dangers gather in the cold North, and an ancient enemy is gaining momentum in the distant East.&#10;&#10;In A Game of Thrones: The Board Game, players take control of one of the great Houses of Westeros. Via resource management, diplomacy, and cunning, they seek to win dominance over the land. Players must give orders to armies, control important characters, gather resources for the coming winter, and survive the onslaught of their enemies. A unique phase mechanic, battle resolution, and special ordering system make for an engaging game in which all players are actively involved at all times.&#10;&#10;Reimplemented by:&#10;&#10;     A Game of Thrones: The Board Game (Second Edition) (2011)&#10;&#10;&#10;&#10;&#10;",
        "artist": "Jacques Bredy,Thomas Denmark,Jason Engle,C. Michael Erickson,Mark Evans (I),Anders Finér,Thomas Gianni,John Goodenough,Cos Koniotis,John Matson,Scott Nicely,Roman Papsuev,Jim Pavelec,Alexander Petkov,J. P. Targete,Sedone Thongvilay,Timothy Truman"
    },
    {
        "name": "L-Game",
        "description": "From Mr. de Bono's website:&#10;The intention was to produce the simplest possible game that could be played with a high degree of skill. An attempt was made to fulfill the following conditions:&#10;&#10;1. A minimum number of playing pieces, preferably one each. &#10;The smallest possible board.&#10;&#10;2. A game with very few rules, one that would be very simple to learn and play.&#10;&#10;3. A game that could be played with a high degree of skill.&#10;&#10;4. A game that would not be determinate. A determinate game such as nim or noughts and crosses, is one in which the starting player could always win if he knew the strategy. An indeterminate game is one which two perfect players would play forever.&#10;&#10;The L game was the result. Each player has only one piece. The board is four squares by four squares.&#10;&#10;Appears with 3 SPOT game in Rex Games' Two Smart Games mini-anthology.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Phoenix",
        "description": "The game contains a forest of wood:  6 &ldquo;light spectrum&rdquo; large cubes in different colors and thirty smaller pawns, 5 each in six different colors that match the larger cubes.  There are also fifty cards that determine the movement of the pawns and cubes, a cloth bag in which to place the pawns and a board onto which the cubes and twenty of the pawns will be placed.&#10;&#10;To begin the game, the six large cubes are arranged randomly on the spaces provided in the center of the board.  Then, the thirty pawns are mixed inside the cloth bag.  Twenty pawns are drawn randomly, with ten being placed on each side of the board.  Each player is then dealt five cards.&#10;&#10;The objective in Phoenix is to arrange your ten pawns in the same color sequence as the six large cubes.  Playing a card allows you to move or swap pawns within your row, or exchange one pawn with your opponent. There are also three cards which allow you to change the order of the central cube pattern.&#10;&#10;The round ends when one player's pawns match the central pattern. That player receives five points. Victory points are also awarded to both players based on having 3, 4 or 5 pawns of the same color connected, and using one of every color. A game lasts three rounds.&#10;&#10;",
        "artist": "Cyril Saint Blancat"
    },
    {
        "name": "Quidditch: The Game",
        "description": "Players control 14 quidditch pieces on a hex board quidditch field. Teams take turns rolling and moving, turning over tiles to search for the snitch, or finding quaffles to shoot thru the hoops. Various other tiles reveal bonuses and penalties. When a player wants to score with a quaffle, he loads a quaffle ball into a miniature catapult and tries to launch it through hoop. That scores 10 points. If a seeker token finds the snitch, the team scores 150 points, ends the game, and more likely than not, wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Fantasy Warriors",
        "description": "From the rules introduction:&#10;&#10;With its simple but challenging rule systems, Fantasy Warriors will let you fight exciting fantasy battles, full of insane heroism, low cunning and sudden death.  Everything you need, except a playing surface, is here - over 100 miniatures, an easy-to-understand rulebook, lots of counters, dice and even a ruler.&#10;&#10;The object of the game is simple - to defeat your enemy using any tactics or strategem you can find.  In Fantasy Warriors there's much more to battle than launching your army in a head on attack - discover the perils and rewards of scouting, boasts, omens, threats and, of course, magic.&#10;&#10;Each player controls an army, headed by a war chief who issues orders to the troops under his command.  Giving the right orders and changing them when the moment is right is the essence of generalship in Fantasy Warriors.  How well will you do in the battle of wits between opposing players?&#10;&#10;You can play the game with forces of any size, from small skirmishes of 20 to 40 figures a side to epic clashes between several armies, containing hundreds of figures.  Battles may be fought between two players, each with an army, or groups of players forming tabletop alliances.  You don't need any sort of referee or games master.&#10;&#10;There's no book keeping in Fantasy Warriors and, after you have decided on your forces, there's no need for pencil and paper.  Once the battle is under way, the colourful counters supplied with the game will give you all the information you need.&#10;&#10;From the back of the box:&#10;&#10;Fantasy Warriors is a complete game set for playing exciting fantasy wargames with finely detailed Grenadier miniatures - all you need to provide is a table and the desire to enjoy yourself.  The set contains: two armies [dwarves and orcs] (102 figures) of plastic Grenadier miniatures; around 140 colourful game-play counters; comprehensive rulebook; unique day/night timedial; [5] high quality dice; quick reference sheet; inch/millimetre game ruler.&#10;&#10;Components&#10;&#10;     102 Plastic Miniatures&#10;     51 Plastic Shields&#10;     5 Dice&#10;     150 Order Counters&#10;     56-page Rulebook&#10;     Quick Reference Sheet&#10;     A very flimsy box&#10;&#10;&#10;&#10;&#10;Expanded by:&#10;&#10;    Fantasy Warriors Companion&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Iron Tide: Panzers in the Ardennes",
        "description": "This game system makes use of hidden combat strengths. Hexagon colored map simulating the Battle of the Bulge from WWII.&#10;&#10;This game is using a chit pull system similar, but updated from the SPI Operation Typhoon and Victory in the West series games (Patton's Third Army, Operation Grenade, and Sicily). Players are encouraged to not inspect the enemy side other than what is obvious on top. Thrills and chills as surprises from the hidden stacks upset or reward well laid plans.&#10;&#10;700 back printed counters, extra large single mapsheet, Huge, full color set up and special unit/information sheet, short, clear rule booklet, boxed or ziploc format.&#10;&#10;",
        "artist": "Maureen Grey,Joe Youst"
    },
    {
        "name": "Two Player Brick by Brick",
        "description": "Although this game can be played solo or in teams it is most often played between two players.  A card is flipped depicting a pattern of bricks.  Both players have 5 puzzle pieces and attempt to build the corresponding pattern before their opponent does.  A great mind bender and an excellent way to sharpen your thinking and visual skills.&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "Harpoon: Captain's Edition",
        "description": "A simpler version of the original Harpoon, the famous naval battle simulation game, designed for beginner players. The box says: &quot;Start Playing in 30 Minutes&quot;!&#10;You navigate your task forces on a 18x21 hexagonal grid, set between Greenland, Iceland and UK, the GIUK gap, either as a NATO or Soviet Admiral. Your Task Forces consits of surface ships, submarines, patrol aircraft and tactical fast jet aircraft, represented by data cards, and task force counters on the map. You utilize radar, sonar and visual search to detect your enemy task forces. You utilize naval gunfire, surface-to-surface missiles, and air-to-surface missiles to defeat them, using die-rolls and data cards. The game is easy to learn. It is a wargame, but the heavily themed weapon aspects are abstracted to a very basic level, without loosing it's high technology appeal. After 30 minutes study of the rules you should be able to set up the first scenario, where you have one task force each, an Arleigh Burke class destroyer against a Sovremennyy class destroyer. Part of The Harpoon Series&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Ace of Aces: Wingleader",
        "description": "Another game in the Ace of Aces series, this one focuses on WWII fighter combat. 24 fighters (including the Me-262 jet) are modeled in the game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Tom Tube",
        "description": "Ganymed - moon of Jupiter. Tom and Dave are building a space station. The base and solar modules have already been constructed. Taking turns, Tom and Dave have to place tubes, move through tubes or space. The astronaut who picks up more valuable counters and returns to his base more quickly with his two solar counters wins the game.&#10;Tom Tube presents a new kind of tessalation with rhombs and triangles, creating a complex, mind puzzling structure of ways through space.&#10;&#10;",
        "artist": "Tobias Goslar"
    },
    {
        "name": "International Oilman Game",
        "description": "From the box: A game that captures the true to life excitement and drama, success, and failures of the international oil magnate. Using the unique 3 dimensional board, oil companies bid for leases world wide, drill for oil, and erect oil wells. The object... to become the most successful oil company in the world. The amazing game board design insures the game will never be played the same way twice. For two or more players or teams.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Don't Panic!",
        "description": "The Name a Lot On the Spot Game.&#10;&#10;Game consists of 6 rounds and a bonus round. In Round 1, the guesser sets the timer, the announcer draws a card and announces the category. The guesser must name 3 things in the given category like things at the beach for example. The timer is stopped as soon as the guesser is able to name 3 items that fit in the category. Their scoring peg is moved ahead based on where you stopped the timer (labeled 1-6). In Round 2, name 4 things and so on. For each round, the peg is moved ahead according to the number on the timer.&#10;&#10;The final round is the lightning round. The guesser starts the timer and the announcer gives the category. The guesser must name 2 things for the given category. Once completed, the announcer sets the card aside, a new one is drawn, and the category is announced. Once again after 2 items have been named, the card is set aside and a new one is drawn. This continues until the timer stops. One point is given for each card completed. The scoring peg is moved accordingly.&#10;&#10;The player with the most points is the winner.&#10;&#10;",
        "artist": "Arthur Wagner"
    },
    {
        "name": "Titan Legions",
        "description": "Titan Legions is a part of Games Workshop's Epic games system for 6mm miniature battles in the popular Warhammer 40,000 setting.  It can be played as a stand-alone game, pitting Imperial Titans against Orkish Gargants, but is fully compatible with Space Marine and all it's supplements, adding new rules and classes for titans and super-heavy vehicles to expand your Epic armies, and make you battles even more... Epic.&#10;&#10;The Titans, war engines of the Collegia Titanica, are massive fighting machines as tall as skyscrapers.  Each carries an arsenal of deadly weapons powered by the fury of its plasma reactor and is protected by void shields and meters-thick armor.  The ground trembles before these steel giants and whole cities are reduced to burning rubble by the earth shattering energies of their weapons.  In their long shadows march armies of Knights, sworn warriors of the Adeptus Mechanicus encased in tank-sized suits of battle armour.&#10;&#10;Ranged against the Imperium's Titans are the Gargants of the Ork Clans; vast, crude idols to the Orks' brutish gods, wrought in scrap metal, and bristling with primitive but potent weapons.  The embodiment of Orkish battle-lust and crazed genius, these metal monsters rumble across the battlefield on armoured tracks, grinding to dust the shattered remains of civilisation.&#10;&#10;Contained in the box are an Imperal Imperator-class Titan, two Ork Mega-Gargants, ten Imperial Knights, twelve Ork Bonebreaker tanks and nine card buildings, plus rulebooks, datasheets, unit cards and counters to pit these mighty war machines against each other in Epic scale battles.&#10;&#10;",
        "artist": "John Blanche,Wayne England,David Gallagher,Mark Gibbons,Geoff Taylor,Richard Wright"
    },
    {
        "name": "Magdar",
        "description": "Magdar is a light game of risk management with a board that is slowly destroyed over the course of play. Players control dwarves mining mithril and gems on a randomly assembled tile-based board. After each player's turn, he or she rolls a die and chooses a tile with that number on it at one end of the board for Magdar to destroy. Any dwarves on the destroyed tile are sent back to the cavern entrance and lose anything they were mining at the time. The game ends when one row of tiles has been completely destroyed. Scoring is based upon having a good mix of mithril and gems. Other elements such as claim jumping are added in the advanced version of the game.&#10;&#10;",
        "artist": "Jesper Ejsing,Scott Nicely,Brian Schomburg"
    },
    {
        "name": "Panzer Grenadier: Airborne",
        "description": "A Hex-and-Counter game that uses the Panzer Grenadier system. While the mechanics are the same as PG, it is a stand-alone game. The game centers around platoon level combat that takes place in Normandy just after D-Day. The American player controls elements of the 101 Airborne while the German player controls the hardened Grenadiers.&#10;&#10;Infantry and Vehicle platoons are activated by Command Units. Activated units can then move, shoot and fight in close combat. Combat is resolved by the roll of one or two dice and table check.&#10;&#10;About 165 counters and 1 map board are included. The components have wonderful graphics.&#10;&#10;This game was re-released in a second edition as Panzer Grenadier: Airborne (Introductory Edition).&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Dwarven Dig!",
        "description": "FROM THE BOX:  Dwarven Dig! is the fast-paced, hard-hitting, cave-smashing game of dwarves on the hunt for treasure.  With the wise, grit-generating elder, the savvy engineer, the hell-raising miner and the stout warrior, can you lead your team safely through the perils of the mountain to retrieve the treasure before your opponents do the same?  Play defensively or go on the attack to directly thwart the other teams, and never play the same game twice due to the game board's tile construction system.  Face the mountain if you dare!&#10;&#10;Reprinted by Bucephalus Games&#10;&#10;",
        "artist": "Jennifer Burke,Keith DeCesare,Brendon Fraim,Brian Fraim,Ben Hall,Japji Khalsa"
    },
    {
        "name": "Monopoly: Australian Edition",
        "description": "The Australian edition of Monopoly utilizing local properties and utilities.  Supplied in the long flat box that is still popular down under.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Maya Madness",
        "description": "Adventure back to the ancient world of Maya numerology in this intriguing card game of mystery and mathematics. Add and subtract the right combination of cards to claim your secret number token. Play a Wild Jaguar to help reach your goal. But be careful&mdash;one misstep and you plunge into the underworld of negative numbers! The first player to collect five tokens wins. Ages 10 and up. Contents:&#10;69 cards&#10;20 secret number tokens&#10;4 number lines&#10;rules of play&#10;&#10;",
        "artist": "Red Hansen"
    },
    {
        "name": "Don't Wake Daddy",
        "description": "Children's game in which players move by drawing cards and moving to the matching space.  If you land on a picture-number space then you have to risk waking Daddy.  Daddy is in his bed, a spring-loaded molded plastic gizmo.  If you did something that might cause him to stir, you have to press the snooze button on his alarm clock a specified number of times.  Daddy might sleep through it... but he might sit up suddenly and send his nightcap flying.  And send the kid who woke him up back to bed (the start).&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Formula Dé Mini",
        "description": "A mini version of Formula D&#195;&#169;, that simplifies and streamlines some of the rules to shorten playing time.&#10;&#10;This game includes:&#10;&#10;    2 racing tracks on a single board&#10;    5 polyhedral dice for different car speeds&#10;    1 black 20-sided die for car damage&#10;    8 cars and 8 ailerons in four different colors&#10;    8 dashboards and 8 aileron markers (to represent each car/aileron combination)&#10;    8 gear shift pawns&#10;    200 life tokens&#10;    1 rules booklet&#10;&#10;&#10;&#10;&#10;Check the Descartes Editeur website (listed in the Links section below) for more information.&#10;&#10;",
        "artist": "Bernard Bittler"
    },
    {
        "name": "Fear God and Dread Nought",
        "description": "Fear God &amp; Dread Nought completes the Admirality Trilogy (Harpoon 4, Command at Sea, Fear God &amp; Dread Nought) Utilizing the same framework, those familiar with either of the other games will have no difficulty stepping into the First World War. The selection of a small scenario allows the novice to play within an hour of opening the box, with several scenarios also being optimal for solitaire play.&#10;&#10;Rules come punched for a three ringed binder (not provided) for ease of use and photocopying. They follow the same format as our other rules used in the Trilogy, making them easy to follow for experienced gamers, and novices alike. Tactical turns represent 3 minutes, with intermediate turns (for long distance maneuvering and long stern chases) representing 30 minutes. Gun hit probability is based upon a combination of factors such as visibility, range, target size, number of rounds firing at the target, and speeds of the firing and target platforms. Damage is a function of the type of shell, number of barrels firing and armor of target, and is easy to calculate also. Blank ship forms allow the player to list all the ranges and damages of his ship's particular guns in advance, making it quick and easy to calculate both damage and hit probability. Critical damage is a function of the amount of damage taken last round vs. the amount of damage able to be taken. Critical hits typically scored against systems (engineering, bridge, steering or individual weapon amounts).&#10;&#10;The 40+ scenarios include the well known &quot;biggies&quot; such as Jutland (broken into three parts, as well as the grand battle) and Dogger Bank, and many smaller engagements. Often there are variants given, covering important &quot;almosts&quot; and &quot;what ifs&quot;. All aspects are covered, with ships provided for the Japanese, Turkish, Austrian, and Russian navies as well as the British and German fleets. The Data Annex includes all ship classes for the war and is a valuable reference by itself. So with this product, one need only Fear God &amp; Dread Nought!&#10;&#10;",
        "artist": "Terry Leeds,Steve Pancrazio,Mal Wright"
    },
    {
        "name": "Articulate!",
        "description": "Try to get your partner to say as many words from a particular category written on the cards within the thirty second time limit, you may only pass once. Move your team pawn forward a number of spaces on the board equal to the number of words you got correct. If you land on an Orange or Red space, spin the spinner for a chance to move yourself 2 or 3 spaces forward, or move an opponent piece 2 or 3 spaces back. If you land on a spade space, try to get you team mate to say the word on the card before any other team can say it. Whoever answers correctly gets a turn immediately.&#10;Categories include Person, World, Object, Action, Nature and Random. First team to make it around the board and successfully answer a spade category (chosen from any of the above) wins the game.&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "Lock 'n Load: Forgotten Heroes – Vietnam",
        "description": "Forgotten Heroes - Vietnam 2nd Edition with new art has been completely updated. Each counter has been redrawn, every map created new, also new skill cards, scenarios, charts, and rules. Forgotten Heroes - Vietnam 2nd Edition simulates combat in Vietnam with squad-level combat. Counters represent squads, leaders, medic, chaplains, machine guns tanks and more. Turns cover 30 seconds to three minutes, and the interactive impulse system keeps both players involved in the game.  A Charles S. Roberts award winner, International Gamers Awards Game of the Year, and voted by Game Magazine as one of the top five conflict simulations.&#10;&#10;Components:&#10;&#10;Five Maps of the Vietnamese Countryside&#10;340 Color Counters&#10;16 Skill Cards&#10;Complete Rule Book&#10;Player's Aid Card&#10;Dice&#10;Full Color Game Box&#10;&#10;Forgotten Heroes is now out of print and has been superceded (including the Anzac Attack expansion) with much improved gaming boards and counters as Lock 'n Load Tactical: Heroes of the Nam&#10;&#10;",
        "artist": "Pete Abrams,Richard Canavan,Nicolás Eskubi,Tom Herrschaft,Olivier Revenu,Guillaume Ries,Marc von Martial"
    },
    {
        "name": "WorldKiller",
        "description": "Ares Magazine #1. World Killer is a simulation of the classic science fiction theme of planetary assault. In the standard scenario, one player commands the ships and orbital fortresses of the defending human forces; and the other player commands the ships of the attacking alien forces. Beyond the standard scenario there are provided additional rules and types of ships for players to devise their own scenarios.  A small game with 4 pages of rules, a 11&quot;x 16&quot; fold-out map sheet and 100 die-cut counters.&#10;&#10;",
        "artist": "Howard Chaykin,Rosalind Fruchtman,Ted Koller,Manfred F. Milkuhn,Bob Ryer,Redmond A. Simonsen"
    },
    {
        "name": "Battle for Moscow (first edition)",
        "description": "Free, relatively simple WW2 wargame.&#10;&#10;The basic game lasts 7 turns by each side; the expanded rules set doubles that.&#10;&#10;Many of the elements of wargames are presented here: zones of control, combat results table, movement and combat values, full strength versus half strength, terrain effects on movement and combat, turns divided into phases, and weather conditions for mud.&#10;&#10;",
        "artist": "James B. Byrne"
    },
    {
        "name": "Pretty Pretty Princess",
        "description": "From the back of the box:&#10;&#10;Play dress-up with your friends as you collect fancy jewelry from the jewelry box. Collect your own matching color necklace, bracelet, ring, and earrings. But beware the Black Ring! If you get it, you must get rid of it before you can win. When you have all of your jewelry plus the crown, you win the game! Then you'll be pretty as a princess - the Pretty Pretty Princess!&#10;&#10;Pretty Pretty Princess is a roll and move game where players put on costume jewelry when they land on the appropriate locations on the board. The target audience is very young girls.&#10;&#10;",
        "artist": "Peggy Brown"
    },
    {
        "name": "Cashflow 101",
        "description": "Cashflow 101 is a serious game designed by investor, businessman, and self-help author Robert Kiyosaki to serve as a tool for learning basic financial strategies and accounting principles. Cashflow 101 is the first of several games created by Kiyosaki to reinforce the information in his books.&#10;&#10;The board has two tracks: A &quot;Rat Race&quot; small circle where you only roll one die to advance, and a &quot;Fast Track&quot; where you roll two dice to advance. In the Rat Race you get paid for passing your Paycheck space, and then draw from one of four decks of cards depending on which space you've landed. Some of the deals are good, others are bad. Your main problem here is a shortage of cash. In the Fast Track your main problem is an excess of cash and finding investments to sink it into before you lose it to lawsuits, divorce or tax audits.&#10;&#10;The heart of the game though are the player sheets where players learn how to fill out a financial statement. Players choose from a variety of starting careers (Truck Driver, Mechanic, Lawyer, Airline Pilot, etc.) and fill out their financial sheets appropriately. As they land cards and invest in different deals they dutifully log each change to their financial sheets as well. After a few games most people end up using the same financial sheets to fill out their own personal information.&#10;&#10;With each card event the drawing player may buy at that price, but all players may sell at that price. Also, players may make co-investments with the drawing player or even buy the deal from him if they agree. Player deals are encouraged.&#10;&#10;The game with few players is heavily biased towards real estate. With 5-6 players the cards are being drawn fast enough that the part time businesses pay off as well.&#10;&#10;There are thousands of Cashflow 101 game clubs around the world.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Pussy Cat",
        "description": "Players each control a pack of 12 cats, and are trying to bring as many as possible to safety in the tree, escaping the dogs chasing them. Unfortunately, not all branches can hold as many animals as they appear to. Since players only know the capacity of a few of the branches, it can happen that a branch collapses under its load. Then all cats on the branch fall from the tree, and must try again to reach safety.&#10;&#10;At the end of the game, the player who has brought the greatest number of their cats to safety is the winner.&#10;&#10;",
        "artist": "Arnaud Quere,Franz Vohwinkel"
    },
    {
        "name": "Lawless",
        "description": "In Lawless, each player is in charge of a ranch in the Wild West.  In order to become the richest ranch owner in the West, players must buy land and cattle and hire cowboys to look after them.  All this, of course, must be dealt with amongst Indian wars, bank robberies, stagecoach attacks, gunfights at the saloon, cattle theft, gold rushes and all that stuff. In such a wild world, the legal ways are usually not the best ways to get richer.&#10;&#10;Lawless is a nice, fast paced and fun game of resource management, full of action and event cards, in which a strong theme and clever mechanics are deeply interwoven.&#10;&#10;Re-implemened by:&#10;&#10;    Les Fils de Samarande (released in 2005)&#10;&#10;&#10;&#10;&#10;",
        "artist": "Sébastien Tournadre"
    },
    {
        "name": "Diceland: Space",
        "description": "Diceland: Space uses the same basic mechanics as Diceland: Deep White Sea, although the setting details are starkly different.  Using content from their Strange Adventures in Infinite Space computer game, Cheapass has made the new Diceland into a ship-to-ship combat game.&#10;&#10;From the Cheapass Games website:&#10;&#10;Diceland is a tabletop combat game that uses paper dice as the characters. The dice are eight-sided, printed in full color, and about 2 inches to a side. Each die is pre-cut and scored, and assembles with just tabs and slots. The &quot;paper&quot; in these paper dice is 12-point coated cardstock, which makes these dice solid enough to withstand any amount of normal play.&#10;&#10;Diceland: Space is a 50-die expansion for Diceland, which comes in two different 25-die boxes. The set introduces new abilities like Cloak, Remove, Dodge, and more, and gives players their first chance to construct customized Diceland armies. Each box contains two major armies, one smaller one, and a strange and wonderful 25th die.&#10;&#10;Space: Terrans vs. Urluquai includes an 11-die Terran army, featuring a fast-moving wing of Scouts and a powerful 15-point Destroyer; the 8-die Urluquai army including both a Corvette and a Fighter with the Cloaking ability; and the 5-die Zorg army, with a fat carrier and a unique Tender which can teleport enemies off the board. Also in the Terrans vs. Urluquai box, you&rsquo;ll find the friendly Klakar Frigate, an impressive 16-point frigate that&rsquo;s a perfect addition to any army that can afford him.&#10;&#10;Space: Garthans vs. Muktians includes an 11-die Garthan army, featuring both the Light and Super Carriers as well as a vast array of small Fighters; the 8-die Muktian army featuring a mix of unusual ship designs; and the 5-die Tan Ru army, featuring a powerhouse 15-point Decimator and a wing of three mindless Drones. Also in the Garthans vs. Muktians box, you'll find the 50-point Yellow Kawangi die, a bizarre and powerful die that's sure to be illegal in tournaments any day now.&#10;&#10;List of Diceland sets and armies&#10;&#10;",
        "artist": "James Ernest,Iikka Keranen,Phophorous"
    },
    {
        "name": "The Secret Door",
        "description": "The game Memory with a theme.  Three object cards are removed from the deck.  The rest are mixed in with 12 clock cards and placed on spots on the board.  Players take turns revealing two cards, hoping to form a match.  When a clock card is turned over, it is added to the time row.  When the 12th clock card is turned over, the game ends.  At this point the players try to determine which three cards have been removed from the deck, based on the cards they have seen and the pairs that they have.&#10;&#10;",
        "artist": "Zofia Burkowska,Jim Deacove,Jennifer Ring"
    },
    {
        "name": "Glory II: Across the Rappahannock",
        "description": "Glory II: Across the Rappahannock (AtR) is the second game in GMT's acclaimed American Civil War series, Glory. Glory presents a brigade-level system that highlights ease and speed of play with solid historical insight. Across the Rappahannock revises the original design to make all of those features even better. And it is still a game that can be played, and played well, by solitaire gamers.&#10;&#10;Across the Rappahannock still features GMT's unique chit activation mechanic, which provides a great deal of play tension, as the commanders never quite know what is going to happen next. However, new command and combat mechanics make the game even more fun. Best of all, these new mechanics are not only retro-fitted to the original Glory, but Glory II: AtR provides all the counters necessary to play the battles in the original Glory game (Manassas and Chickamauga) with the new rules!&#10;&#10;Across the Rappahannock brings you two of the biggest battles in the Civil War; battles that have received scant attention from the hobby: Fredericksburg, with Burnside's frontal assault across the river against a heavily defended Confederate position, and Chancellorsville, the biggest battle in the entire war. And, while the full game of the latter battle uses 3 maps and a lot of your time, there are two standard one-map battles and three smaller scenarios highlighting engagements within the bigger battles that use few counters and take only a couple of hours to play!&#10;&#10;",
        "artist": "Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "VisualEyes",
        "description": "A dice game requiring recalling acceptable words and phrases. In each round 19 large picture dice are shaken in the box, with one other die marked &quot;slow play&quot; or &quot;fast play&quot; indicating how the round is played. With &quot;slow play&quot;, a sand timer is turned over and each writes words/phrases on their own pad. Making words/phrases requires using a pair of picture dice for each word/phrase. For example a picture of a snowflake and a picture of an eye can make &quot;cold stare&quot;. Once time is up, each player compares their list, only scoring a point for the word/phrase no-one else has written. In &quot;fast play&quot;, all players shout out the word/phrase, the quicker player removing the pair of dice from the box. Once all the dice are removed or no-one can make an acceptable word, each player scores a point for each pair of dice. After several rounds, first player to 20 points wins the game.&#10;&#10;",
        "artist": "Kristine Nuyens"
    },
    {
        "name": "Cronberg",
        "description": "On a hexagon built up from 56 triangles surrounded by a scoring track wall, rhombus-shaped buildings are placed onto two of the triangles or pawns are placed on intersections The pawns are scored when they are surrounded by buildings or at the end of the game, if a triangle near them can't be used for a rhombus.&#10;&#10;An easy, fast tile-laying game in the tradition of &quot;Auf Heller und Pfennig&quot; by Knizia and &quot;Isis and Osiris&quot; by Schacht. New is the interaction of triangles and rhombuses which delivers some nice tactical moments.&#10;&#10;",
        "artist": "Harald Lieske"
    },
    {
        "name": "Electronic Dream Phone",
        "description": "One of 24 incredible boys really likes you. Now you just have to find out who by calling his friends for clues!&#10;&#10;Play a boy's photo card and call his number on the electronic touch-tone phone!  Listen to a clue about your secret admirer's clothes, sports, foods, or special hangouts.  Then search the gameboard to identify who he is and who he isn't.&#10;&#10;Calls are private unless someone plays a Speakerphone card - then everyone hears that clue!  If it's a Share a Secret card, just you and one friend listen together!&#10;&#10;To guess who your secret admirer is, make a special call to that boy.  If you hear him say, &quot;You're right! I really like you!&quot;, you win the game!&#10;&#10;The game changes every time you play.  Boys give different clues and the secret admirer changes too!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Korea: The Forgotten War",
        "description": "Korea: The Forgotten War, Is the ninth game in the Operational Combat Series (OCS) release by The Gamers.&#10;&#10;The Korean War stands as a key event in world history. The first shooting confrontation of the Cold War, and the first limited war of the nuclear age, it is the only time since the Second World War that two of the world's major military powers fought one another - in this case the United States and China.&#10;&#10;Diplomatically, the war offers an interesting view of the miscalculation and ineptitude on both sides that led to open conflict. It also brings to light the United Nations' first opportunity to play a leading role in world military events.&#10;&#10;Korea: The Forgotten War covers the first year of the war and highlights the mobile phases of the battle. Campaign victory is determined most often by the stable positions of the lines (relative to the &quot;neck&quot; of the peninsula). A number of shorter scenarios are also included to allow players to explore specific operations or to use as a training scenario before taking on one of the campaign games.&#10;&#10;Korea: The Forgotten War was initially released in 2003. The 2014 (2nd edition) is a reprint of the 2003 (1st edition) with changes made to address errata and to better conform to the latest version of the OCS rules when printed.&#10;&#10;&#10;Korea: The Forgotten War has 15 scenarios broken down as follows:&#10;    5 1-map scenarios&#10;    4 2-map scenarios&#10;    6 3-map scenarios&#10;&#10;Game Scale:&#10;Turn: Half-week&#10;Hex: 5 miles / 8 Km&#10;Units: Battalion to Army&#10;&#10;2014 Game Inventory:&#10;Three 22 x 34&quot; full-color mapsheets&#10;Four dual-side printed countersheets (2 combat, 2 markers - 560 1/2&quot; counters)&#10;One 48-page OCS v4.1a rules booklet&#10;One 40-page Korea v2.0 game specific rules booklet&#10;Two 4-page OCS v4.1a Charts &amp; Tables Folders&#10;Two dual-sided Player Aid cards&#10;Two 6-sided dice&#10;&#10;Complexity: High&#10;Solitaire Suitability: High&#10;Playing Time: 4-100 hours&#10;Players: 1 or more&#10;&#10;",
        "artist": "Nicolás Eskubi,Dean Essig"
    },
    {
        "name": "Let's Do Lunch!",
        "description": "An abstract two-player game played on a 7x7 board with 12 cannibal pawns per player. The three six-sided dice show the numbers 1 to 3, twice each per die. A half-hearted attempt has been made to theme the game around two cannibal tribes trying to eat each other.&#10;&#10;The columns on the board are numbered 3 to 9. Down the center of the board (column 6) runs a stream. The board is initially empty. Each player in turn rolls the three dice and then places one of their cannibals anywhere on the column given by the total of the three dice. If a player rolls three of a kind, they place a pawn and then take another turn. If a player rolls 1,2,3 then they do not place a pawn. If you enclose a line of the opponent's pawns between two of your pawns (horizontally, vertically, or diagonally), then the opponent must take back their pawns except for those in column 6.  The enclosure may wrap around the top and bottom of the board, but not the sides.&#10;&#10;The first player to place their final pawn on the board wins.&#10;&#10;Re-implements:&#10;&#10;&#10;     Magestones &#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Kung Fu Samurai on Giant Robot Island",
        "description": "The third game in the B-Movie Series of card games by Z-Man Games.  It focuses on martial arts movies, anime, and giant monster movies.&#10;&#10;Players play characters, locations, and prop cards to create a movie.  Creature cards are played to kill off characters in other movies and Special FX cards are used to perform various special actions at (almost) any time.  The goal of the game is to have the most points in your movie when &quot;Roll the Credits&quot; is played or the draw deck runs out.&#10;&#10;This game adds the 'Kung Fu' trait to certain characters, allowing them to attack and knock out other characters so they don't count as part of the movie until the next turn.&#10;&#10;This game can be played as a stand-alone product or mixed with any other B-Movie Series games.&#10;&#10;",
        "artist": "Steve Bryant,Paul Gerardi,Mike Jackson,Leo Lingas,Jason Millet,Leo Winstead"
    },
    {
        "name": "Grave Robbers II: Skippy's Revenge",
        "description": "The fourth game in the B-Movie Series of card games by Z-Man Games.  The series returns to spoofing bad sci-fi movies in another stand-alone game.  It can also be mixed with any other game from the B-Movie Series.&#10;&#10;Players build a sci-fi movie by playing characters, props, and locations.  Players also play creature cards on the other players' movies to kill off characters.  Special FX cards can be used for a variety of sci-fi themed actions such as boosting attacks or defending against a certain creature type.  The goal is to have the most points in your movie when &quot;Roll the Credits&quot; is played or the draw deck runs out.&#10;&#10;To explain the subtitle: &quot;Skippy the Wonderdog&quot; is a fan favorite character from the B-Movie Series and appears as a creature instead of a character in this game.&#10;&#10;",
        "artist": "Steve Bryant,Mike Jackson,Michael N. Jackson,Leo Lingas,Jason Millet,Leo Winstead"
    },
    {
        "name": "E.T.: The Extra-Terrestrial",
        "description": "This is a simple game in which players roll dice and move about the gameboard attempting to collect the items that ET needs to phone home. Along the way you'll have to hide ET from your parents (using his clever Halloween disguise) and go on the magical bicycle ride through the skies (with the use of special Elliot cards).  The object is to be the first player to get ET to the three-dimensional spaceship that sits in the middle of the board.&#10;&#10;Obviously intended for children, this game is mostly a merchandising tie-in for the movie, but is at the least an interesting piece for an ET enthusiast.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Frogger",
        "description": "This is another of Milton Bradley's 1980's video-game themed board games. This is based on the arcade and home-system smash hit Frogger.  In this version of the game, 2 players face off, each with their own army of frogs, logs, and automobiles. Each turn, a player spends his movement points either moving his frogs toward their goal (the other side of the board), or moving logs and cars in an attempt to block or squash the other player's frogs. Complete with &quot;bonus points&quot; for landing on flies, this is actually a pretty faithful interpretation of the video-game; but far too simple to have any long-lasting interest. More of a curiosity for video-game enthusiasts than anything.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Munchkin Fu",
        "description": "&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Publisher's Description&#10;&#10;If you loved Munchkin... look out. Here they come again.&#10;&#10;&quot;I'm a Ninja with the Dragon Tooth Katana!&quot;&#10;&quot;I'm a Monk with the Sai of Spleen Mangling. Fear my Drunken Monkey Kung Fu!&quot;&#10;&quot;I'm a Yakuza with a gun. Run away!&quot;&#10;&#10;The Munchkins are back! Now the game is chop-socky Hong Kong action. The characters are Samurai, Ninja, Yakuza, and Monks. The foes are mooks, demons, and assorted bad guys from all the worst martial arts films you've ever seen. Collect treasures and learn new styles to build up your character's powers. Kill the monsters, take their stuff, and be the first one to 10th level!&#10;&#10;Created by Steve Jackson (I). Munchkin Fu is completely compatible with the entire Munchkin line.&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Other&#10;&#10;Part of the Munchkin series.&#10;&#10;Munchkin is a satirical card game based on the clich&eacute;s and oddities of Dungeons and Dragons and other role-playing games. Each player starts at level 1 and the winner is the first player to reach level 10. Players can acquire familiar D&amp;D style character classes during the game which determine to some extent the cards they can play.&#10;&#10;There are two types of cards - treasure and encounters. Each turn the current players 'kicks down the door' - drawing an encounter card from the deck. Usually this will involve battling a monster. Monsters have their own levels and players must try and overcome it using the levels, weapons and powers they have acquired during the game or run away. Other players can chose to help the player or hinder by adding extra monsters to the encounter. Defeating a monster will usually result in drawing treasure cards and acquiring levels. Being defeated by a monster results in &quot;bad stuff&quot; which usually involves losing levels and treasure.&#10;&#10;",
        "artist": "Alex Fernandez (I),Greg Hyland,John Kovalic,Gabby Ruenes"
    },
    {
        "name": "Lord of the Rings Trivia Game",
        "description": "The Lord of the Rings Trivia Game is the ultimate test of your knowledge of J.R.R. Tolkien's Lord of the Rings!&#10;&#10;In this exciting board game, each player, or team of players, takes on the role of Frodo Baggins and seeks to destroy the One Ring by throwing it into the fires of Mount Doom. As the players travel through 14 areas of Middle-Earth they must spend precious resources and answer challenging questions. There are 1200 questions; all based on the original books and prepared by a team of Tolkien experts. Multiple choice answers can make the game easier for less experienced Middle-Earthers.&#10;&#10;The winner of the game is the first player or team to reach and successfully face the challenges at Mount Doom.&#10;&#10;",
        "artist": "Ted Nasmith"
    },
    {
        "name": "Spinergy",
        "description": "(back of the box)&#10;&#10;Spinergy gives everyone a chance to be a writer, actor, singer, poet, date magnet and stand-up comic.  Given three random words, describe how your life was saved by a platoon of Marines...compose a shocking tabloid headline...deliver the ultimate pickup line... create the next blockbuster movie!  Haiku, riddles, jokes, tongues twisters, songs, foreign accents, and much, much more!  It's different every time you play!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Battlelines: The Stalingrad Campaign",
        "description": "(From the Publisher)&#10;The Battlelines&trade; series of card games allow players to recreate the epic struggles of World War II. Each player uses a deck of cards to represent the troops of an historical formation about the size of a division. A third deck, the Operation deck, is used to create a series of battles using Mission and Location cards. Points are scored for achieving Mission objectives and destroying enemy troops. A typical 100 point Operation can be played in about an hour.  The game can also be played by teams of up to three players on each side.&#10;&#10;This, the first  in the Battlelines&trade; Series World War II card games. It includes Units and Operations from the German 1942 offensive against Stalingrad, the Soviet counter-attack (Operation Uranus) which trapped the German 6th Army in the city, and the gallant efforts of 4th Panzer Army to relieve their surrounded comrades (Operation Winter Storm).&#10;&#10;Unit Decks represent divisional level assets. They are the basic play decks. One is needed for each player. Operation Decks are used to generate a &quot;random&quot; series of &quot;scenarios&quot; depicting several days of fighting. Higher Echelon Decks will allow players to introduce new cards into their Unit Decks to liven up the game and surprise their opponents with new stratagems.&#10;&#10;The decks are not &quot;collectible&quot; per se.  There are no &quot;rare&quot; cards to collect.  They can however be customized by mixing in units from &quot;higher echelon&quot; decks that are available.  The game is considered &quot;expandable&quot; since there are many different decks (sold individually) that can be played against each other.&#10;&#10;",
        "artist": "Jeff Billings"
    }
]