[
    {
        "name": "Epic Armageddon",
        "description": "Epic Armageddon is a game of mass combat set in the Nightmare future of the 41st Millennium. These are not simply the battles of man against man. This is the struggle of mankind against a universe full of alien invaders, usurpers and traitors who seek to shatter the fragile Imperium of Man. Epic Battles feature immense armies of infantry, dozens of tanks and giant war engines such as the Titans and super-heavy tanks.&#10;Engage in massive conflicts across entire worlds engulfed in war-worlds such as Armageddon.&#10;&#10; The Rulebook contains all the information you need to begin playing games of Epic. In addition it contains historical background, army lists, scenarios and gaming advice about the world of Armageddon and the forces involved in the fierce war there. These include the Imperial Guard armies of the Steel Legion Mechanized Infantry, Space Marines of the Adaptes Astartes, Titan Legions, Aircraft of the Imperial Navy and the forces of the Ork Warlord Ghazghkull Mag Uruk Thraka.&#10; This is the 4th incarnation of Games Workshop Epic battles but it is very different to the others and has brought back much detail that was lost in the 3rd edition Warhammer Epic 40,000. The rulebook is a great accomplishment with full color throughout, excellent stories and a fantastic set of rules that play smoothly and add lots of extra special rules.&#10;&#10;Expanded by:&#10;&#10;    Epic Swordwind&#10;&#10;&#10;&#10;&#10;",
        "artist": "Karl Kopinski,Stef Kopinski"
    },
    {
        "name": "Duel Masters Trading Card Game",
        "description": "In Duel Masters, players build a deck of creatures and spells using cards from starter decks and booster packs. Your creatures are brought into play by paying the mana cost associated with it and are used to attack your opponents creatures or shields. Each player starts the game with 5 shields in play. These shields are merely 5 cards from your deck that are dealt face-down in front of you before the game starts. The shields, along with any &quot;tapped&quot; creatures you have in play, form your defenses. When a creature attacks a player and isn't blocked, that creature breaks one of that player's shields. Each time a player's shield is broken, the player puts the shield into his hand. You win the game if on of your creatures attacks your opponent when he has no shields left (as long as your creature isn't blocked).&#10;&#10;Duel Masters is played in a very similar fashion to Magic: The Gathering, which is also made by Wizards of the Coast. Much of the terminology used in Duel Masters is the same as in Magic as well, such as &quot;tapped&quot;, &quot;summoning sickness&quot;, etc.&#10;&#10;Re-released as: Kaijudo&#10;&#10;",
        "artist": "D-Suzuki,Dai,Dreamwave,Dustmoss,Fruit Parfait,Asai Genji,Gyokan,Haccan,Akira Hamada,Koji Harada,Masaki Hirooka,Soushi Hirose,Masateru Ikeda,Hikaru Ikusa,Iron Pot,Ittoku,Daisuke Izuka,Jason,Youichi Kai,Imo Kajii,Eiji Kaneda,Katsuya,Tsutomu Kawade,Atsushi Kawasaki,Katsuhiko Kojoh,Hisanobu Kometani,Kou1,Takesi Kuno,Miho Midorikawa,Mikumo,Miya,Norikatsu Miyoshi,Hisashi Momose,Yusaku Nakaaki,Nakagawa,Nottsuo,Syuichi Obata,Tomofumi Ogasawara,Nakoi Saito,Sansyu,Seki,sgr,Shishizaru,Ippei Soeda,Ken Sugawara,Yoshio Sugiura,Hideaki Takamura,Toshiaki Takayama,Yoko Tsukamoto,Tsuu,Koji Watanabe,Akifumi Yamamoto,Taro Yamazaki,Yarunoca,Ryoya Yuki"
    },
    {
        "name": "Crocodile Dentist",
        "description": "Don't get chomped by the cranky croc.  Croc's got toothaches and a snap-happy attitude.  You're his dentist - so get ready to pull a mouthful of teeth.  Use the special tooth tongs to wiggle out one Croc tooth per turn.  But don't pull the one that triggers Croc's touchy temper or, Snap.  He'll growl, charge and chomp and you're out of the game.  To win, be the only dentist who doesn't rile the crocodile.&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "Renegade Legion: Leviathan",
        "description": "64 pages of rules, 16 pages of forms, 25 ship counters (mostly multi-hex), 240 other counters, and two 22&quot;x34&quot; mapsheets.  Rulebook includes ship &amp; fighter data and three scenarios.  Scale is 75 km per hex (the multi-hex ship counters show turn mode, not scale) and five minutes per turn.  Fighter counters represent 6, 24, or 72 fighters.&#10;&#10;Expanded by:&#10;&#10;    Renegade Legion: Leviathan Capital Ship Briefing&#10;    Renegade Legion: Leviathan &#226;&#128;&#147; The Wake of the Kraken&#10;&#10;&#10;&#10;&#10;",
        "artist": "Dana Andrews,Joel Biske,Jeff Laubenstein,Todd F. Marsh,James Nelson,Steve Venters"
    },
    {
        "name": "The Franco-Prussian War",
        "description": "The Franco-Prussian War is an historical simulation of the conflict between the French Empire and the Kingdom of Prussia, with its German Allies. The game covers only the period of the defeat of the French Imperial Armies, from August 1 through September 2, 1870. The map on which  the game is played covers the important areas of Germany and eastern France.&#10;There are two main versions of the Franco-Prussian War game. The first version, the Basic Game, familiarizes the Players with the map and forces involved, as well as the basic strategy and tactics of the game. The Standard Game introduces the use of dummy counters and hidden forces. There are two independent Optional Rules introducing strategic limited intelligence, and the use of Formation status for all Combat units.&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "The East is Red: The Sino Soviet War",
        "description": "Strategy &amp; Tactics magazine #42.&#10;&#10;The East is Red is a simulation on a strategic/operational level of a possible attempt by Soviet forces to invade and occupy Manchuria and North China sometime in the 1970s. Within the theatre of operations it is assumed that tactical nuclear weapons and atomic demolations will be used. The game is played with variants of two basic scenarios. The M-1 scenario variants postulate a hasty Soviet attack into China and the M-30 variants describe a later stronger attack.&#10;&#10;Variant counters, rules and scenarios were published in Strategy &amp; Tactics magazine #226 - Jan/Feb 2005.&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "Camelot Legends",
        "description": "The tales of King Arthur and the Knights of the Round Table have inspired artists, scholars, and dreamers for over a thousand years. Now you can relive the legends of Camelot by sending powerful knights to mysterious lands in order to accomplish the world's greatest adventures!&#10;&#10;Camelot Legends is a fast-paced, non-collectible card game for 2-4 players, featuring 100 different cards with illustrations from leading artists such as Ed Beard Jr., Quinton Hoover, Carisa Swenson, Melissa Benson, and Donato Giancola.&#10;&#10;Camelot Legends divides the Arthurian world into three main locations: the chivalric kingdom of Camelot, the treacherous domain of Cornwall, and the enchanted realm of the Perilous Forest. Throughout the game, players create factions of characters who attempt to complete quests and overcome their enemies. Rival knights endeavor to surmount the difficult challenges that arise at each location. When the final event is complete, the knights who have accomplished the most challenging tasks capture the mantle of victory!&#10;&#10;",
        "artist": "Randy Asplund-Faith,Drew Baker,Edward Beard, Jr.,Melissa Benson,Heather Bruton,Storn Cook,Chris Dien,Mark Evans (I),Donato Giancola,Thomas Gianni,Daerick Gross,D. W. Gröss,Paul Herbert,Tina Hoffman,Quinton Hoover,Mike Jackson,Craig Maher,Thomas Manning,Patrick McEvoy,Jeremy McHugh,Jeff Menges,Noel Meyer,Raven Mimura,Jim Pavelec,Mark Poole,Carisa Swenson"
    },
    {
        "name": "Canvas Eagles",
        "description": "WWI dogfighting game that is a fast, action-packed easy to learn game. Available free on home page, but you will need to build your own planes and board.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Blue Marble",
        "description": "A Korean knock-off of Monopoly. Instead of buying &quot;streets,&quot; you're buying &quot;cities&quot; (Seoul replaces Boardwalk). If you visit your own city, you can build various buildings. Community Chest and Chance cards are conflated into one &quot;Key&quot; cards that give you either some sort of bonus or penalty.&#10;&#10;Other than that, it's pretty much identical to Monopoly: roll, move, buy land, or pay rent if someone already owns it. The player with the most money wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Leinen los!",
        "description": "The object of Leinen los! is to push a little wooden ship, following the race track while doing so and avoiding the buoys. This might be easy to do, except that the ships are composed of two separate parts: the motor and the rest of the ship, with the latter part tending to turn in every direction except the way you want to go, but since you must move the ship by pushing on the motor with only one finger, sometimes you can't help traveling in directions unintended.&#10;&#10;Players take turns via a chronometer/egg timer, and the first player to reach the end of the track wins!&#10;&#10;",
        "artist": "Matthias Holländer,Renate Seelig"
    },
    {
        "name": "Dragster",
        "description": "There is a 3D racing track in which each player has to lead 4 cars to victory. &#10;You have to use a trigger to shoot a marble at the cars to push them over the finish line. &#10;Whoever finishes first wins the game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "I Spy Memory Game",
        "description": "This is a Memory game based on the &quot;I Spy&quot; line of classic children's books and the photographs of Walter Wick and Jean Marzollo. The catch is that the images aren't exact matches. Instead, one version may be a silhouette or from another angle. According to the instructions, recognizing an object in a different environment is a valuable pre-reading skill.&#10;&#10;Several variants are provided. Younger players play it just like the classic Memory game by turning over two cards and trying to find the pairs. Older players play it by trying to find the four cards that match objects named in a riddle. The pictures are beautiful.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Tyrus",
        "description": "Two political parties vie for the control of the city. Elections take place in the citadels, markets and temples around the city. These elections will name the nine representatives who will sit at the high council. Each party must carefully divide its soldiers, merchants and priests, to obtain the majority of votes during the elections. These elections follow each another in each of the areas of the city. The struggle is tense and all manner of dirty tricks are allowed. Each faction has the capacity to apply pressure on the others and has the chance of canceling their votes. Tyrus is thus a game of careful application of power, force and influence in order to affect the best outcome possible for your political party. Throughout the game you must try to carefully conserve your troops, because you never know when they will be needed. Both parties start the game with equal forces, so Bluff and misdirection are your main weapons to win the day, and become Master of the city.&#10;&#10;Online Play&#10;&#10;&#10;     Bo&#195;&#174;te &#195;&#160; jeux (turn-based)&#10;     Yucata (turn-based)&#10;&#10;&#10;",
        "artist": "Jérôme Caproni"
    },
    {
        "name": "Victory & Honor",
        "description": "A card game of trick taking and skill based on a Civil War theme. The object is to capture soldiers, but the catch is they are not worth anything unless you capture generals along with them!&#10;&#10;",
        "artist": "Aaron Williams"
    },
    {
        "name": "Football Champions",
        "description": "Soccer trading card game.&#10;&#10;Each team will start with a number of player cards and action cards. Each player is rated on the card for skills like tackling, shooting at goal, being a better in one area of the board, and so on. The action cards are used for tactical advantages. Movement of the players is die driven. There are slightly different rules if you are a defending team than if you are an attacking team, because the attacking team is currently in possession of the ball, the defending team's objective is to 'steal' the ball and become the attacking team now.&#10;The game ends when one player runs out of action cards and a certain number is rolled on a die. Thus you might or might not, get an extra turn(s) before the game is finally over.&#10;The one who scores the most goals, wins of course&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Gyges",
        "description": "The object of Gyg&egrave;s is to move a piece to your opponent's last row. The catch is that no one owns the pieces. You can only move a piece in the row nearest you. Pieces are made up of 1, 2, or 3 rings; this number is also the number of spaces it must move. If it lands on another piece, it can move the number of spaces equal to that piece's number of rings. It can also displace that piece to another space. Played with tournament rules, you cannot win on an opponent's mistake, but rather only by creating a situation in which your opponent cannot block multiple winning combinations.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Napoleon's Art of War: Eylau and Dresden",
        "description": "Napoleon's Art of War consists of two distinct and separate games: The Battle of Dresden and the Battle of Eylau. Each of these games has a body of rules in common, and specific rules for the game.&#10;&#10;Dresden is a simulation of the battle between the French under Napoleon and the allied forces of Russia, Prussia, and Austria in August 1813. Eylau is a game depicting the struggle between the French and the Russo-Prussian force under Baron Levin Bennigsen that occurred in 1807 on February 7th and 8th in a remote area of Poland.&#10;&#10;The game was originally published in Strategy &amp; Tactics magazine #75, Jul-Aug 1979, and uses the system from Napoleon at War quad.&#10;&#10;",
        "artist": "Jean Baptiste Édouard Detaille,Redmond A. Simonsen"
    },
    {
        "name": "Betrayal at House on the Hill",
        "description": "From the press release:&#10;&#10;Betrayal at House on the Hill quickly builds suspense and excitement as players explore a haunted mansion of their own design, encountering spirits and frightening omens that foretell their fate. With an estimated one hour playing time, Betrayal at House on the Hill is ideal for parties, family gatherings or casual fun with friends.&#10;&#10;Betrayal at House on the Hill is a tile game that allows players to build their own haunted house room by room, tile by tile, creating a new thrilling game board every time. The game is designed for three to six people, each of whom plays one of six possible characters.&#10;&#10;Secretly, one of the characters betrays the rest of the party, and the innocent members of the party must defeat the traitor in their midst before it&rsquo;s too late! Betrayal at House on the Hill will appeal to any game player who enjoys a fun, suspenseful, and strategic game.&#10;&#10;Betrayal at House on the Hill includes detailed game pieces, including character cards, pre-painted plastic figures, and special tokens, all of which help create a spooky atmosphere and streamline game play.&#10;&#10;An updated reprint of Betrayal at House on the Hill was released on October 5, 2010.&#10;&#10;An expansion 'Widows Walk' will be released Fall 2016. (http://avalonhill.wizards.com/games/widows-walk)&#10;&#10;",
        "artist": "Dennis Crabapple McClain,Christopher Moeller,Peter Whitley"
    },
    {
        "name": "Big Boggle",
        "description": "Big Boggle is a timed word game where players attempt to find as many connected words as possible from the face up letters resting in a 25 cube grid. When the timer runs out, players compare their list of words and remove any shared words. Points are then awarded for remaining words, depending on how many letters are in the word.&#10;&#10;Big Boggle is similar to the standard Boggle, but with the following changes:&#10;&#10;    uses a 5x5 grid instead of 4x4&#10;    the minimum word size is 4 letters instead of 3&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Pyramidos",
        "description": "The big pyramid needs just a few more blocks before it's finished. Can you help the master builders? You have to cross the unpredictable Nile. High waves slow your progress and dangerous crocodiles snap at you. Only the player who shows skill and courage will be successful.&#10;&#10;Ages 6-99&#10;&#10;",
        "artist": "Ales Vrtal"
    },
    {
        "name": "The Black Prince",
        "description": "THE BLACK PRINCE features four battles from the Hundred Years War (Crecy, Poitiers, Navarette and Verneuil). Three of these battles include Edward, Prince of Wales, otherwise known as the &ldquo;Black Prince.&rdquo; These battles, Crecy, Poitiers, and Navarette are coupled with the later battle, Verneull, the &ldquo;Second Agincourt,&rdquo; to present four of the most important battles of the war. Each battle was not only a clash of arms but also a clash of military systems and weapons. The English longbow would be pitted against the French lance, with the crown of France in the balance.&#10;&#10;THE BLACK PRINCE game system, designed by Rob Markham, is medium complexity and features rules on the longbow, heavy cavalry charges, commands and command control, ammunition, and demoralization. The system is quick to learn and quick to play, with games taking between 1/2 and 3 hours to play.&#10;&#10;",
        "artist": "Ted Koller,Beth Queman,Christopher Rothero"
    },
    {
        "name": "Why Did the Chicken...?",
        "description": "From the publisher's website:&#10;&#10;What makes you laugh? More important, what makes your friends laugh?&#10;&#10;Each round, you'll have two minutes to create funny answers for a randomly generated riddle. But know your audience: One player will be judging answers instead of writing them! The judge's choices for the two best answers earn points. When the game's over, tally up your points to see who's the life of the party.&#10;&#10;Give it a whirl! How would you answer the question:&#10;&#10;What do you get when you cross a lion with a pizza?&#10;&#10;Or if you were the judge, which two of these answers would you reward?&#10;&#10;-Pride in Service &#10;-Could I have that with extra antelope? &#10;-A real meat-lovers pizza! &#10;-In the jungle, the quiet jungle, the pizza sleeps tonight.... &#10;-Extra cheese, pepperoni, hold the courage &#10;-Junk food that people are scared to eat&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Mississippi Fortress",
        "description": "Mississippi Fortress is the fifth game in CoA's Civil War Campaigns series. The game is a two player strategic simulation of General Ulysses S. Grant's campaign of 29 April through 4 July 1863 that culminated in the capture of the capture of Vicksburg and the splitting of the Confederacy. The Union forces are powerful but initially weaker than the total rebel strength, yet forced to take the offensive. The two Confederate armies are widely separated at first, but can form a decisive mass if they can link up.&#10;&#10;The game map depicts the theater of operations in the central Mississippi. It is divided into areas, stretching from Bruinsburg to Jackson. Each map area serves to regulate movement and combat and represents a fourteen mile square of terrain. The two campaign game scenarios cover the period between 29 April and 4 July 1863 using two day turns. A smaller scenario covers the key maneuvering and combat that took place at Champion Hill. Special rules cover the weather, Union gunboats and rebel shore batteries, the siege of Vicksburg, among other things.&#10;&#10;Game contents include one 17 inch by 22 inch full-color game map, 240 die-cut game counters, one standard rules book, one exclusive rules book, one battle board, one game card, two army display sheets, and one die.&#10;&#10;",
        "artist": "Rick Barber"
    },
    {
        "name": "Fits",
        "description": "In Fits it's all about speed. Every player gets a board which he needs to fill with colored tiles (Small and large triangles and squares in 4 colors). The die defines which tile to pick from the tile holder and the player needs to place this piece on his/her board. But the piece can't touch other pieces of the same color.&#10;&#10;The fun part is that the die can't lay still for more than five seconds. So after one minute you have lots of pieces on and besides your board and are pretty stressed to make it all fit on the board. The first player who can make it all fit on his board wins.&#10;&#10;",
        "artist": "Thomas di Paolo,Thomas Weiss"
    },
    {
        "name": "Poison Pot",
        "description": "Selection #6 of The Games Collection by Pin International.&#10;&#10;The box reads: &#10;In this 2 or 3 player game, the objective, when the 36 Cauldrons have finally finished being shuffled around, is that you end with the largest connected group. But beware! Even one of the group finishing adjacent to the Poison Pot nullifies the whole group.&#10;&#10;The mechanic is that the board starts empty except for the Poison Pot. Then, on each turn one pot existing is moved, and a new pot is drawn at random, evaluated, and placed on the board.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The War for the Union",
        "description": "A strategic, one-map treatment of the Civil War, focusing on troop quality and other &quot;soft factors&quot; of the war.  Features rules and units for foreign intervention, and a more detailed treatment of naval warfare than is present in most Civil War games.&#10;&#10;",
        "artist": "Rick Barber"
    },
    {
        "name": "Summer Storm: The Battle of Gettysburg",
        "description": "A tactical and operational-level game of the battle of Gettysburg.  The game's focus is on morale and command; the operational game is a double-blind recreation of the movements leading up to the battle, the results of which are transferred to the tactical maps.&#10;&#10;The game includes a tactical map area of 51x44&quot;, two 17x22&quot; operational maps, 980 counters, and numerous player aids and charts.  This monster game's graphics were done by the game's designer--the prominent wargame artist Rick Barber, and the results are visually highly impressive.  The tactical maps are extremely detailed, and feature virtually every feature on the actual battlefield.&#10;&#10;",
        "artist": "Rick Barber"
    },
    {
        "name": "Bittereinder",
        "description": "Bittereinder is a two-player simulation of the entire 2nd Anglo-Boer War of 1899 to 1902. It depicts the events arising from President (of the Zuid Afrikaansche Republiek - ZAR) Paul Kruger's ultimatum to the British Empire on October 9, 1899, demanding the following:&#10;&#10;&bull; The withdrawal of British troops on the borders of the ZAR,&#10;&#10;&bull; Discontinuing the British military build-up in South Africa, and&#10;&#10;&bull; Settling all differences between Britain and the ZAR through arbitration.&#10;&#10;The Republic of the Orange Free State threw its lot in with their Boer (literal translation: farmers) brethren in the ZAR. At 17:00 on 11 October 1899 the ultimatum expired. The British Empire was at war with the Boers, the white tribe of Africa. The war would straddle the centuries, ending on May 31, 1902. It was a bitter defeat for the Boers and a victory bereft of glory for the world's mightiest empire.&#10;&#10;Full color 22&quot;x34&quot; map&#10;264 full color 5/8&quot; die cut counters&#10;Rulebook length - 14 pages&#10;Charts and tables - 2 pages&#10;Complexity - Medium&#10;Solitaire suitability - Medium&#10;Playing time - 8 hours&#10;&#10;",
        "artist": "Craig Grando"
    },
    {
        "name": "Race to the Roof",
        "description": "An Exciting Game Of Pursuit...&#10;&#10;From The Basement To The Attic!&#10;&#10;Children begin by arranging the rooms of the house, then advance their playing pieces by rolling the die.&#10;&#10;Each time a player rolls a 6, he or she draws a chance card, searches the house for the object pictured on the card, then moves ahead - or back! - to that spot.&#10;&#10;Because the house is rearranged before beginning play, the hidden objects will be in a different place each time!&#10;&#10;The first player to reach the attic window is the winner.&#10;&#10;Game Contents: Gameboard,16 Room Cards,20 Chance Cards,4 Playing Pieces,1 Die,Game Rules.&#10;&#10;",
        "artist": "Erhard Dietl,Janosch,Ingrid Kellner"
    },
    {
        "name": "Gringo!",
        "description": "Gringo! The Mexican War 1846-1848. For the battles in Gringo!, both sides run the gamut from mountain assaults to street-fighting, allowing gamers to see some of the differences between ACW-era tactics and those of the Napoleonic era. The battles included are:&#10;&#10;&#10;    Buena Vista, the classic battle of the war, with Zach Taylor's decimated army making a valiant stand against Santa Anna and a force three times Taylor's. &#10;    Monterey, with the North Americans launching a three-pronged assault against, into, and through the beautiful city of Monterey, complete with huge fortifications, high peaks, bull rings, cathedrals filled with ammunition, even a telegraph system. &#10;    Cerro Gordo, Scott's first meeting with Santa Anna, on the dangerous mountain roads leading towards the heart of Mexico. &#10;    El Molino del Rey, where Santa Anna makes a last, well-entrenched stand outside Mexico City. Will that Mexican cavalry division ever move? &#10;    Chapultepec, a mini-battle, in which the gringos have to scale the precipitous heights of this immense fortress guarding the roads into the Mexican capital. &quot;Stonewall&quot; (pre-nickname) Jackson, hidden mines, wall-scaling, and those courageous Mexican pre-teen cadets. &#10;&#10;&#10;The game rules are simplier (GBACW v4.3) with reduced command rules (for the smaller armies); they also include extensive rules for street-fighting and the square formation. The game includes some of the most colorful characters in military history: General Zachary Taylor &amp; inept division leaders Twiggs &amp; Pillow for the Americans; head throwing General Pedro Ampudia and Generalissimo Antonio de Santa Anna.&#10;&#10;GRINGO! is easily the most playable, colorful and challenging of the GBACW series games to date. 2 22&quot; x 34&quot; maps (1-backprinted), 4 countersheets, plus the usual rules and charts.&#10;&#10;Time Scale: 60 minutes per game turn&#10;Map Scale: between 45-125 yards per hex&#10;Unit Scale: Each Strength Point = 50 men&#10;Players: 1-6&#10;&#10;&#10;Expanded by:&#10;&#10;    Battle of Churubusco&#10;    Battles with the Gringos, Mexico 1846-62&#10;&#10;&#10;&#10;&#10;",
        "artist": "Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "Memoir '44",
        "description": "Memoir '44  is a historical boardgame where players face-off in stylized battles of some of the most famous historic battles of World War II including Omaha Beach, Pegasus Bridge, Operation Cobra and the Ardennes.&#10;&#10;Memoir '44 includes over 15 different battle scenarios and features a double-sided hex game board for both beach landings and countryside combat. Each scenario mimics the historical terrain, troop placements and objectives of each army. Commanders deploy troops through Command and Tactic cards, applying the unique skills of his units -- infantry, paratrooper, tank, artillery, and even resistance fighters -- to their greatest strength.&#10;&#10;&quot;By design, the game is not overly complex&quot;, says Memoir '44 designer, Richard Borg. &quot;The game mechanics, although simple, still require strategic card play, timely dice rolling and an aggressive yet flexible battle plan to achieve victory.&quot; In addition to the large, double-sided gameboard, Memoir '44 includes 144 amazingly detailed army miniatures - including historically accurate infantry, tanks and artillery; 36 Obstacle pieces, 60 illustrated Command cards, 44 Special Terrain tiles, and 8 Custom Wooden dice.&#10;&#10;Memoir '44 is designed for 2 players but easily accommodates team play. And with Memoir '44 Overlord scenarios, players can use multiple boards and up to 8 players to conduct large scale operations, experiencing the challenges of troop coordination and military chain of command on a large scale battlefield. Average game length is between 30 and 60 minutes, encouraging match play where players can command first one side and then the other.&#10;&#10;The Memoir '44 series consists of the base game and a number of expansions.&#10;&#10;This game is based upon Richard Borg's Command and Colors system.&#10;&#10;",
        "artist": "Cyrille Daujean,Julien Delval,Don Perrin,Claude Rica"
    },
    {
        "name": "Napoleon and the Archduke Charles: The Battle of Abensberg",
        "description": "This games was published in Strategy &amp; Tactics magazine #113. Napoleon and the Archduke Charles: The Battle of Abensberg is a game for two players, simulating the battle of Abensberg which took place on April 20th, 1809. One player commands the French forces, the other the Austrians. Rules on movement, combat, leadership and morale reflect the problems and possibilities which faced the historical commanders.&#10;&#10;Scale = 600 yards (=548 m)/ hex&#10;Strength = 200 infantry, 150 cavalry or 2 guns/ Strength point&#10;Time = 35 min./ GT&#10;&#10;Victory is determined by controlling objectives and by inflicting losses to the enemy forces.&#10;&#10;Note:&#10;Abensberg is a complete game in itself. It can also be played as a &ldquo;campaign game&rdquo; linked with another of 3W&rsquo;s Bonaparte series, The Battle of Eckmuhl (in S&amp;T #114). Eckmuhl was fought on the two days following Abensberg, in the area immediately to the north. Many of the same units participated, along with many others. Two scenarios are provided with Abensberg; four are provided with Eckmuhl. An additional dozen scenarios can be found in The Wargamer #3 and S&amp;T #115 (Kanev). These later scenarios link the two games.&#10;&#10;Strategy &amp; Tactics magazine #116 includes two more scenarios along with a Q&amp;A by the designer.&#10;&#10;Nominee for the 1987 Charles S. Roberts awards for Best Pre-World War II Boardgame (Charles S. Roberts Awards).&#10;&#10;",
        "artist": "Larry Hoffman"
    },
    {
        "name": "Doom: The Boardgame",
        "description": "&quot;Attention all Marines! All UAC personnel be advised. There has been a code red security breach in the dimensional gateway research facility here at the Union Aerospace Corporation&rsquo;s Mars base. We are under invasion. I repeat, we are under invasion.&#10;&#10;Report immediately to central command. If you are isolated from the main facility, seek out other marines, form squads, and engage the invaders with whatever means possible. The weapons at the Mars base are limited, but should be sufficient for neutralizing the invaders.&quot;&#10;&#10;In Doom: The Boardgame, demonic invaders have broken through from another dimension into the Union Aerospace Corporation&rsquo;s Mars base. Marines have been deployed to the base to protect UAC personnel and destroy the invaders. Up to three players will take the roles of heavily armed and highly trained marines, while one player will control the legion of demonic invaders. In the game, the marine players explore the claustrophobic rooms and corridors of the Mars base, attacking monsters, picking up new weapons and equipment, and working together to complete specific mission objectives.&#10;&#10;The heart of Doom: The Boardgame is the scenario. Before every game, a scenario must be chosen. Each individual scenario will tell you how to set up the game, explain any special rules, and describe the specific objectives you must achieve in order to win the game. You will find several ready-to-play scenarios in the Doom Scenario Guide.&#10;&#10;Doom: The Boardgame is a game for 2 to 4 players Ages 12 and up, playable in 1 to 2 hours, based on the groundbreaking DOOM computer game by id Software.&#10;&#10;Expanded by&#10;&#10;    Doom: The Boardgame Expansion Set&#10;&#10;&#10;&#10;&#10;",
        "artist": "Bob Naismith,Scott Nicely"
    },
    {
        "name": "Barbarossa: Army Group South, 1941",
        "description": "June 1941 -- the German juggernaut rolls over the Soviet Army. As the tally of encirclements and surrenders mounts, the German advance appears unstoppable to Hitler and many others. However, the officers and men at the front are beginning to have serious misgivings -- not in themselves, but in the pre-war intelligence estimates that they had received. They had not been prepared to encounter hundreds of KV-1's and T-34's, tanks far superior to anything they possessed. For the moment, German tactics provided the margin of victory over better material, but the Russians were proving to be quick learners. Worse yet, by western European standards, Russian losses had been so staggering that there should have been no army left to fight. Not so. There seemed to be no end to these tenacious Russian defenders. As the German forces continued their eastward advance, more and more soldiers began asking, &quot;What have we gotten ourselves into?&quot;&#10;&#10;Kiev, the first major German objective in the south, did not fall on schedule. In fact, Soviet resistance was so fierce that it required diverting Guderian's Panzer Group away from the advance on Moscow. Kiev fell in one of the greatest encirclements of the Second World War, but the German advance on Moscow was delayed for several critical weeks. Quite possibly the delay at Kiev might have cost the German forces victory in the battle for Moscow.&#10;&#10;840 full-color two-sided counters.  &#10;MAPS   &#10;Three 22x34&quot; and one 17x22&quot; full-color mapsheets  &#10;OTHER  One 10-sided die &#10;36-page Rule Book &#10;36-page Play Book &#10;Player Aid Cards: four two-sided Soviet Set-Up cards, four two-sided Axis Set-Up cards, Soviet Status card, Axis Status card, two 11x17 two-sided game chart cards, two cards of additional scenario charts. &#10; Eight scenarios allow players to vary their level of involvement, complexity, and starting point, from introductory to full campaign &#10;An asymmetrical sequence of play that highlights Axis armored breakthroughs and Soviet difficulties in combined arms warfare &#10;Detailed air rules that integrate with land combat and weather rules &#10;Incredibly detailed orders of battle, including special coverage of artillery, rocket artillery, engineers, bridge units, armored trains, and much more &#10;Modifications to the proven Typhoon system include revised overrun and Soviet surrender procedures, as well as a new non-op Soviet HQ system to simulate the rigid yet fragile Soviet Command structure &#10;Extensive bibliography and design/historical notes&#10;&#10;Scenarios include;&#10;&#10;Scenario #1 &quot;Assault on Kiev&quot; which uses a portion of map G. GT#21 to GT#28&#10;&#10;Scenario #2 &quot;Odessa&quot; which uses a portion of Map F. GT#26 to GT#40&#10;&#10;Scenario #3 &quot;Rundstedt Attacks&quot; which uses most of Map E. GT#1 to GT#6&#10;&#10;Scenario #4 &quot;Operation Munich&quot; which uses portions of maps E and F, an optional rule allows map E to be omitted. GT#6 to GT#17&#10;&#10;Scenario #5 &quot;Campaign Game&quot; which uses all of maps E,F, and G. GT#1 to GT#28&#10;&#10;Scenario #6 &quot;Uman Pocket&quot; which uses maps F and G. GT#9 to GT#28&#10;&#10;Scenario #7 &quot;Rostov&quot; which uses small map R. GT#T19 to GT#T33 (note Typhoon style game turn code).&#10;&#10;Scenario #8 &quot;Counterattack&quot; which uses small map R. GT#T30 to GT#T32&#10;&#10;",
        "artist": "Rodger B. MacGowan"
    },
    {
        "name": "Barbarossa: Army Group North, 1941",
        "description": "On June 22nd, 1941, Army Group North, the smallest of the three German army groups, drives forward into the Baltic states. Its objective is Leningrad. Once the crown jewel of Czarist Russia, Leningrad is now the second most important city in the Soviet Union. Its array of ordnance factories includes the massive Kirov Tank Works that turns out most of the heavy KV-1 and KV-2 production for the Soviet Army. Loss of Leningrad would deprive the Soviets of a major population and industrial center and give the Germans the advantage of position in any drive against Moscow from the northwest. &#10;Army Group North, short of Luftwaffe support and motorized forces, is the only army group that fails to achieve a significant encirclement at any stage of its campaign. Skillfully utilizing terrain and ruthlessly exploiting the civilian population, the Soviets construct a fortified line along the Luga River that stalls the Germans for a month until massive Luftwaffe and motorized reinforcements from Army Group Center allow a decisive breakthrough and dash for Leningrad itself. In a furious September battle, the Germans fall just short of taking Leningrad when time runs out. Operation Typhoon, the final push against Moscow, is imminent. Army Group North must give up almost all of its Luftwaffe and motorized formations. With no strike force remaining, the Germans dig in. Leningrad survives capture only to endure a brutal, epic 900 day siege.&#10;&#10;Can you, as the Axis commander, succeed where German High Command failed? As the Soviet commander, can you repeat history and halt the Axis invaders short of Leningrad?&#10;&#10;980 multi-colored die-cut counters. &#10;MAPS &#10;Five 22&quot;x34&quot; &amp; two 17&quot;x22&quot;full-color mapsheets &#10;OTHER One 10-sided die &#10;36-page Rule Book &#10;48-page Play Book &#10;Player Aid Cards: 11 two-sided Set-Up cards, Soviet Status card, Axis Status card, two 11x17 two-sided game chart cards, one card of additional charts and tables.&#10;&#10;Five 22x34 inch color mapsheets (with a reprint of Map C from Army Group Center), plus Maps A, B, L, and a full sheet devoted to the Leningrad inset map. &#10;Two 17x22 inch color mapsheets (front and back printed). Half sheet Map W with the Learning Scenario back printed on it and a half mapsheet with Scenario One map area, set-up card, and rules on one side, and Scenario Two map area, set-up card, and rules on the other. &#10;Eight scenarios (plus the learning scenario) allow players to vary their level of involvement, complexity, and starting point; from introductory to full campaign. &#10;An asymmetrical sequence of play which highlights Axis armored breakthroughs and Soviet difficulties in combined arms warfare, detailed air rules which integrate with land combat, and weather rules. &#10;Incredibly detailed Order of Battle, including artillery, rocket artillery, engineers, bridge units, armored trains, and much more. &#10;Modifications to the proven Typhoon system include revised overrun and Soviet surrender procedures, as well as a new non-op Soviet HQ system to simulate the rigid, yet fragile, Soviet Command structure. &#10;Extensive bibliography and design/historical notes&#10;&#10;",
        "artist": "Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "Pirates of the Spanish Main",
        "description": "Pirates of the Spanish Main is the world&rsquo;s first constructible strategy game.  In Pirates of the Spanish Main, players make fleets of ships to sail to different islands looking for treasure. This booty is obtained in one of two ways: commanding your salty dogs to dig it out of the ground or sending your opponent&rsquo;s ships to Davy Jones&rsquo; locker! Either way, game play is fast and fun, and the built-in damage tracking system makes Pirates of the Spanish Main the game of choice of wannabe-buccaneers everywhere. (From the official press release)&#10;&#10;Pirates of the Spanish Main includes numerous different collectible pieces, including ships, crew, treasure, and famous (and infamous!) personalities. It sells in booster packs that include all materials required for play (&quot;A game in every pack&quot;), which typically consists of two ships, an island, crew, treasure, a small six-sided die, and complete rules for play.&#10;&#10;WizKids officially renamed the entire product line &quot;Pirates of the Cursed Seas Pocketmodel Game&quot; in 2008.&#10;&#10;Topps officially shut down WizKids in November 2008, and put the property up for sale. In September 2009 NECA purchased WizKids and its properties from Topps, and began releasing new content for the game HeroClix.&#10;&#10; Expanded by: &#10;&#10;&#10;     Pirates of the Crimson Coast (2005)&#10;     Pirates of the Revolution (2005)&#10;     Pirates of the Barbary Coast (2005)&#10;     Pirates of the South China Seas (2006)&#10;     Pirates of Davy Jones' Curse (2006)&#10;     Pirates of the Mysterious Islands (2006)&#10;     Pirates of the Frozen North (2007)&#10;     Pirates at Ocean's Edge (2007)&#10;     Pirates of the Caribbean PocketModel Game (2007)&#10;     Pirates of the Cursed Seas: Rise of the Fiends (2008)&#10;     Pirates of the Cursed Seas: Fire and Steel (2008)&#10;     Pirates of the Cursed Seas: Savage Shores (2008)&#10;     There are also numerous (unofficial) fan-designed sets.&#10;&#10;&#10;Similar constructable ships were used for Pirates: Quest for Davy Jones' Gold.&#10;&#10;",
        "artist": "Sandra Garavito,Ethan Pasternack"
    },
    {
        "name": "Hex Hex",
        "description": "This is a card game that forces a Hex token around the table between players. In this respect, it's sort of a game of Hot Potato. Whoever can't get rid of the Hex token by using his cards &quot;blows up,&quot; thus losing points. Naturally, there are nuances to this. There are 17 different cards in the deck, some which merely pass the Hex token left, right, and across, while others split the token in two, or increase it's damage. One dismisses it entirely. One blows it up while in another player's possession. One forces the token to pass in only one direction, some cause extra effects if the token DOES blow up on you. A round ends when there are no more Hex tokens available, and there are as many rounds as there are players, plus one.&#10;&#10;There are some interesting strategies that are not immediately apparent, but which become obvious after the first couple of rounds. Controlling when the last token blows up is very important since you lose and gain points based on this, so learning to play the cards to force the location of the tokens when they blow up is of paramount importance. Sending them to a player who has no cards to play works very well for this.&#10;&#10;Scores are kept with individual cards monitoring &quot;Voice&quot;, which is just points. How many you have at the end of the x+1 rounds determines who the winner is.&#10;&#10;One last amusing thing about the game is a bit of chaos tossed in; a Hex Hex card; when it's played, all players have to drop their card hands and put their hands in the air. The slowpoke loses points. Not exactly strategy, but still entertaining.&#10;&#10;Integrates with:&#10;&#10;    Hex Hex Next&#10;&#10;&#10;&#10;&#10;Reimplemented by:&#10;&#10;    Hex Hex XL&#10;&#10;&#10;&#10;&#10;",
        "artist": "Curt Covert"
    },
    {
        "name": "Micropul",
        "description": "micropul is a strategic &amp; tactical tile-laying game in which players are scientists trying to extract precious micropul matter from an energy core.&#10;&#10;The game can be played as a solitaire puzzle or competitively.&#10;&#10;Each player has a hand of tiles they must play optimally to keep a flow of new tiles coming in and if possible keep aside some tiles in a supply stack that will be worth more points at the end of the game. Drawing new tiles is done by activating catalysts, this part is very tactical.&#10;&#10;During the game, groups of micropul of the same color will get formed. These groups can be claimed and will be worth a lot of points if they are closed at the end of the game. This is the strategic part.&#10;&#10;Winning is done by balancing the tactical and strategic part.&#10;&#10;Print &amp; Play&#10;&#10;&#10;     http://neutralbox.com/micropul/&#10;     (Rules are available in English, Japanese, Spanish, Polish and French.)&#10;&#10;&#10;Online Play&#10;&#10;&#10;     Boardspace.net (real time, robot option)&#10;     http://superpowernosissies.com/games/game-preserve/micropul/ (solitaire)&#10;&#10;&#10;",
        "artist": "Jean-François Lassonde"
    },
    {
        "name": "Victoria Cross",
        "description": "VICTORIA CROSS is a block style, area movement game covering the Battle of Rorke's Drift during the Anglo-Zulu war of 1879.  The game plays in 2 hours and has 60 blocks, a full color mapboard with a 3d view of the battlefield, charts and dice.  The game is very exciting and has many decisions to be made.  Playable by the novice gamer and detailed enough for the grognard.&#10;&#10;",
        "artist": "Sean Cooke,Keith Rocco"
    },
    {
        "name": "Panzer Grenadier: Desert Rats",
        "description": "Desert Rats is the seventh complete game from the Panzer Grenadier Series and picks up where Afrika Korps left off. Most of the scenarios are between November 1941 and May 1942 in North Africa but there are also some bonus scenarios that cover East Africa/Somali.&#10;&#10;Two 22&quot; X 34&quot; maps, 825 counters. Two players but can be played very well solitaire. With Initiative determination phase and the action segment alternating between players, there is no sitting around waiting for your turn.&#10;&#10;Nationalities include; British, German, Indian, Italian, Italian Colonial &amp; New Zealand troops.&#10;&#10;This game is part of the Panzer Grenadier series&#10;&#10;Expanded by:&#10;&#10;    Panzer Grenadier: Sinister Forces&#10;&#10;&#10;&#10;&#10;",
        "artist": "Peggy Gordon,Terry Moore Strickland"
    },
    {
        "name": "Easy Come, Easy Go",
        "description": "&quot;Easy Come - Easy Go: The Dicey Game of Changing Forces. Try your Luck! Win Fabulous Prizes with a simple roll of the dice. Win the game by holding on to your prizes as other players attempt to beat the odds and take them from you. Hit it big with Easy Come &ndash; Easy Go!&quot;&#10;&#10;As his Wheedle was to Pit, Knizia's Easy Come, Easy Go is to Yahtzee. In this game of luck and card stealing, players roll 4 dice (numbered 1-5 and 0), trying to match a combination on one of the nine Fabulous Prizes cards: four of a kind, two pairs, a straight, exactly 13, three of a kind with all odd/even numbers, etc. All 4 dice must be used. If they match a card they take it, either from the center of the table or from another player's collection. If unsuccessful after the first roll, the player must choose at least one die to &quot;freeze,&quot; then can re-roll the rest till they either win a prize or use up the dice. The first player to have 3 prizes in their collection and keep all three through the next two turns wins the game.&#10;&#10;",
        "artist": "John Kovalic"
    },
    {
        "name": "Monopoly: America Special Edition",
        "description": "Life, liberty, and the pursuit of properties. There's nothing more American than the game of Monopoly, except maybe a special America Edition of the world's most popular board game. You can own pieces of American culture and history, learn about American people and places, and move around the board using tokens that are as American as apple pie. Enjoy classic play or experience a new variation with our Corner Squares Game. Answer American challenge questions and you may get a property for free! This is an American Road Trip you don't want to miss.&#10;&#10;The components for this consists of the following: &#10;&#10;    1-Gameboard &#10;    28-American History Deed Cards&#10;    Monopoly Money and Banker's tray&#10;    6-American themed movers&#10;    16-American People Cards&#10;    16-American Places Cards&#10;    90-American Challenge Cards&#10;    32-plastic houses&#10;    12-plastic hotels&#10;    2-DICE&#10;    4-Alternate Corner Squares&#10;    1-Set of Instructions. &#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Knight Hawks",
        "description": "This board game of starship combat was published as part of the Knight Hawks supplement for TSR's Star Frontiers role playing game. It is however playable as a stand alone game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "A Fearful Slaughter: The Battle of Shiloh",
        "description": "from MMP website:&#10;&#10;This is it. As its sister game (This Hallowed Ground) did for Gettysburg and (This Terrible Sound) did for Chickamauga, A Fearful Slaughter strives to be the definitive Shiloh game.&#10;&#10;Unrivaled in size, scope, accuracy, and development, A Fearful Slaughter is a game on the battle to be savored and played repeatedly. It uses the popular Civil War Brigade Series rules with a set of specially adapted extension rules for Regimental scale action.&#10;&#10;The research for the two maps was done using multiple Park histories, battlefield surveys and county historical maps. They show the battlefield in more detail than ever before. They are very graphic intensive.&#10;&#10;Multiple scenarios in an assortment of sizes make A Fearful Slaughter perfect for anyone who enjoys ACW gaming.&#10; Unit Scale: Regiments &amp; Batteries  &#10;Hex Scale: 100 Yards &#10;Players: 2 (also suitable for solitaire play) &#10;Playing Time: Varies with scenario played &#10;Complexity: Moderate &#10;Solitaire Suitability: High&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Apples to Apples Junior",
        "description": "As its name implies, this is a version of Apples to Apples designed for kids, although the basic game still works well with adults, too. The version has card optimized for middle-school aged children (9+). Also good for advanced grade-school aged children.&#10;&#10;Compared to the original game, this edition features simplified words that even young children can understand and has no &quot;suggestive&quot; words that adults would be uncomfortable explaining to the kids.&#10;&#10;Out of the Box changed the name of this game in 2007 from Apples to Apples Junior 9+ to Apples to Apples Junior.  The Junior 9+ edition was originally sold in a small (288-card) box. It was changed to a bigger (576-card) box when the name was changed to Junior.&#10;&#10;Note: Apples to Apples Kids was formerly called Apples to Apples Junior!, but was changed to Apples to Apples Kids when Apples to Apples Junior 9+ was changed to Apples to Apples Junior.&#10;&#10;Part of the Apples to Apples Series.&#10;&#10;",
        "artist": "John Kovalic"
    },
    {
        "name": "Atlas & Zeus",
        "description": "From www.thecompleatstrategist.com &#10;Atlantis&hellip; As Plato first attested to in Critias, Atlantis was entrusted to the Titan Atlas by the gods, long before the dawn of history. His sons created there a magnificent civilization, a civilization that, among other things, succeeded in developing a potent magic that allowed them to transform into marine animals.&#10;&#10;But the golden age would not last. When Atlas disappeared, his sons divided themselves into two clans and battled each other for the ultimate prize: sole rule over the kingdom of Atlantis and all of its riches.&#10;&#10;Zeus, the ruler of all gods, decided to intervene and punish the greedy clans. He sent them a mighty flood that, in the span of one day and one night, engulfed the entire archipelago! Zeus told the Atlas' sons that he would save only the clan that succeeded in escaping the raging elements for the longest possible time.&#10;&#10;Atlas &amp; Zeus allows you to relive the final moments of Atlantis, the epic struggle of Atlas' sons for survival and Zeus' pardon. Which of the two of you will succeed in becoming the last of the Atlantians?&#10;&#10;CONTENTS: 16 Island Tiles 16 Character Tiles 2 Decks of 25 Cards 1 Action Order Track 8 Game Markers 1 Rule Book&#10;&#10;Part of the Eurogames Games for 2 Series.&#10;&#10;",
        "artist": "Christel Espie"
    },
    {
        "name": "Tipsy Tower",
        "description": "The Tower Rocks ... Careful! Don't let the figures fall!&#10;&#10;Strategy, planning, coordination and balance ... in an action-filled game that is fun for the whole family.&#10;&#10;In turn, each player rolls the die and places a Daredevil on the colored Tower Ring that matches the color die roll.  If the Tower tips and Daredevils fall off, the last player who rolled the die must add all of the fallen Daredevils to his or her Daredevil pile.  This ends that player&rsquo;s turn!  Play then continues clockwise with the next player.  Players continue to take turns rolling and placing Daredevils until one player is out of Daredevils.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Advanced Dungeons & Dragons Battlesystem Skirmishes",
        "description": "From the back cover: &quot;Everyone can enjoy miniatures gaming with these fast-paced exciting fantasy combat rules.  Each miniature represents one hero, wizard, soldier, or monster.  Create exciting battles using any number and assortment of figures.  The rules are compatible with the AD&amp;D&reg; game, so your player character can be converted in minutes without complicated formulas.  Magical items and spells are covered in detail.  Also included is a complete, illustrated guide to painting miniatures.&quot;&#10;&#10;A set of skirmish rules for miniatures in the Advanced Dungeons and Dragons 2nd Edition realm.  It simplifies Ad&amp;d into wargame rules, but keeps a lot of the elements of the roleplaying game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Hacker: Deluxe Edition",
        "description": "This is the computer crime card game inspired by the 1990 Secret Service raid on Steve Jackson Games. Play is similar to Illuminati except players play cards as part of the ever-expanding &quot;Net&quot; in the center of the table instead of having individual card stacks. Players use in-dials to break into systems and gain root access. Upgrade your hacking tools, deal with other hackers for access, phreak others onto your system, etc. is all part of the game. Avoid ICE and law enforcement raids to gain the greatest number of root access sites and win the game.&#10;&#10;The Deluxe edition comes with the &quot;Dark Side&quot; expansion and includes features such as out-dials, military upgrades, multiple accounts, virtual bridges, increased security, and new threats such as Black ICE, viruses and the worm.&#10;&#10;Re-implements:&#10;&#10;    Hacker and Hacker II: The Dark Side&#10;&#10;&#10;&#10;&#10;Home Page: http://www.sjgames.com/hacker/&#10;&#10;",
        "artist": "John Dismukes,Heather Oliver,Jeffrey K. Starling"
    },
    {
        "name": "Bondespelet",
        "description": "Swedish classic roll-and-move game about farmers and farming. You win by being the first farmer who buys the castle.&#10;&#10;The game features a roll-and-move style of movement around the board, success relying on having your marker stopping on the good spaces so you get crop markers that you can sell later on. Farms and forests are bought and sold by the money you earn from the events and crops.&#10;&#10;Though being an absolute classic in Sweden, and one of the flagships for the game publisher Alga, very little is known of this game's origin. It has seen at least four graphically major remakes since the first version. It's rumoured to be as old as the 40s, at least we know that the game existed in 1953. The now defunct publisher &quot;AB Grafisk Konst&quot; seems to be the first publisher, followed by Aristospel, and then Alga (currently owned by Brio).&#10;&#10;See the information tab on the various versions for details about them.&#10;&#10;",
        "artist": "Barbro Hennius,Ritva Hussain-Shahid,Anders Jeppsson,Per Leveaux"
    },
    {
        "name": "CSI: Crime Scene Investigation Boardgame",
        "description": "The object of the game is to be the first player to enter Grissom&rsquo;s office with a correct arrest warrant, determining the suspect&rsquo;s means, motive and opportunity to commit the crime.  Players become Crime Scene Investigators, sorting through three levels of evidence collected from seven Crime Lab Divisions located on the board and, as in the TV show, visit their colleagues in each division: Interrogation, Autopsy, Identification, Trace, Ballistics, Forensics and DNA, to gather sufficient data to make an arrest.  Disclosure cards and Grissom cards come into play to test the players&rsquo; powers of deduction.&#10;&#10;Expanded by:&#10;&#10;    CSI: Crime Scene Investigation Boardgame &#226;&#128;&#147; Crime Game & Booster Pack #1&#10;&#10;&#10;&#10;&#10;",
        "artist": "Barry Hobbs"
    },
    {
        "name": "Corx",
        "description": "Corx is a dexterity game played with two cork cylinders (basically wine-bottle corks, but precisely manufactured and with amusing characters painted on the sides -- this is where the 'collectible' aspect comes in, but other than the art every cork is the same).&#10;&#10;Players take turns dropping the corks onto the table, attempting to land them on their ends.  A cork that lands with the red end up is worth one point, the black end up is worth 2 (because the black end is wider).  The player who gets exactly 21 points first wins; if you go over 21, that turn is not scored.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Dancing Dice",
        "description": "Players are contestants in a dancing marathon.  Each turn they roll their dice and arrange them into two sequences of three dice (with one re-roll to try to change unwanted dice into something else).  These sequences are then compared to those of everyone else.  Higher difficulty dances (sequences) like the Tango or Tap Dance impress the judges.  Less accomplished dancers move down in ranking.  If they hit the bottom of the chart, they are out of the game.  Certain sequences also convey special abilities such as not having to move down in ranking even if you are &quot;out danced&quot; by your competition.&#10;&#10;The last dancer still standing wins!&#10;&#10;",
        "artist": "Gianpaolo Derossi"
    },
    {
        "name": "Geist",
        "description": "Each player takes on the role of a &quot;Geist Hunter&quot; and the first to catch their set of Geists and get them safely to the underworld wins. To catch Geists, you need to lure them with an exact number of Zingiberi chips. These are earned by moving around the board and landing on numbered squares. The number lets you take or return a chip of that value, but also determined how far you will move next turn. A clever movement system encourages people to cheat and get away with it, or at least makes everyone watch closely. Each Geist, once captured, can also be use to &quot;prank&quot; other players, and this keeps things rowdy but also adds to the strategy. Chili Pepper cards also spice things up since the Geists don't usually like them.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Hellenes: Campaigns of the Peloponnesian War",
        "description": "Hellenes: Campaigns of the Peloponnesian War (GMT Games) is 2 player game on the Peloponnesian War of the Greek classical age designed by Craig Besinque (EuroFront series). Based on a variant of the Hammer of the Scots/Liberty system, Hellenes features good historical flavor, fast play, and lots of options for both players.&#10;&#10;One player plays Sparta, the dominant land power of the era; the other plays Athens, the dominant sea power. Each side also seeks the allegiance of minor Greek city-states and barbarian tribes: some that persevere and others that come and go. Revolts, sieges, leaders, wintering, and civic discord all play important roles.&#10;&#10;The object of the game is to erode enemy prestige to the point of Surrender by capturing cities, winning battles, and devastating enemy territory with raids. Walled cities are very strong in defense, leaving Siege as a common method of reduction. But if a Siege is broken by a relieving force, the lost battle reduces the besieger's prestige!&#10;&#10;The map depicts Ancient Greece in the Aegean area, including the Peloponnese, continental Greece, Macedonia, Thrace and Ionia. A separate area on the map contains Sicily. Units include fleets, cavalry, archers, infantry and hoplites. Cards drive military actions and special events. Each card has both an Action value and an Event, and can be played for either purpose but not both. Actions include unit buildup, adding new units and group movement. Events include leader change, plague, barbarian uprisings, revolts, civil unrest, etc.&#10;&#10;Hellenes includes 4 scenarios: The 431 BC Campaign (10 turns), The Sicily Campaign (5 turns), The 415 BC Campaign (12 turns), and The 413 BC Campaign (10 turns).  Each one plays in about 3-6 hours.&#10;&#10;Designer: Craig Besinque&#10;Developer: Joel Toppen&#10;&#10;",
        "artist": "Donal Hegarty,Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "Somethin' Fishy",
        "description": "This card game from Oliver Igelhaut has fish feeding on fish. The cards show different types of fish in different sizes, from hungry to full. Players draw cards and play them to rows, with hungry fish eating everything in front of it until it meets a like fish. A fish doesn't eat its like, and instead goes to the table as a fat fish. When a player has drawn 3 cards of a kind, it can take a fat fish from the table. When the round ends, players score for the most fish in their catch.&#10;&#10;Reportedly a good, quick filler, with English and French rules in the box (only in the Abacus Edition, the SimplyFun Edition has only English rules).&#10;&#10;",
        "artist": "Damon S. Brown,Allison Kline,Christof Tisch"
    },
    {
        "name": "Fishing for Terrorists",
        "description": "In Fishing for Terrorists you will fight against terrorism as the &quot;heroic&quot; head of a government agency.  Your goal is to capture as many terrorists as possible, even if it means stabbing other agencies in the back.&#10;&#10;Much like Go Fish with action cards, this game reflects in inter-agency squabbling that insiders will recognize all too well.&#10;&#10;Re-implemented by:&#10;&#10;    Fishing for Terrorists Version 2.0&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Dawn Under",
        "description": "A memory game in which players try to be the first to get all of their vampires into the appropriately colored crypts so that they do not burn when dawn comes.&#10;&#10;",
        "artist": "Victor Boden"
    },
    {
        "name": "Navia Dratp",
        "description": "This chess-like game was inspired by Shogi and themed around an anime style. Players set up the two different starter armies consisting of seven holy warriors, seven power-harvesting pawns and two power-harvesting uber-pawns. Fourteen warriors came with the starters, fifteen from the first expansion, and fifteen from the final expansion. Instead of the initial fourteen warriors, players may chose to draft seven (per side) of these 44 warriors which are summoned onto the board one-at-a-time during play. They can be promoted to more powerful chess/shogi style movement using power crystals. Many of these warriors have special magic powers (e.g., teleportation, resurrection, obliteration) which can be turned on by spending crystals.&#10;One of the most exciting things about this chess/shogi variant is that there are multiple ways to win: &#10;&bull; Creating a mating solution that forces surrender - Capturing the Navia (She's like the chess/shogi king)&#10;&bull; Getting one's own Navia across and off the other side of the board &#10;&bull; Economic victory by attaining enough power-crystals for your Navia to blast your opponent off the board.&#10;&#10;",
        "artist": "Koichi Yamazaki"
    },
    {
        "name": "Krieg! World War II in Europe",
        "description": "Hex-and-counter strategic level wargame covering World War II in Europe and North Africa from September 1939 to December 1945. Includes more than 400 counters representing major and minor powers in addition to special &ldquo;what if&rdquo; option cards. Players represent Axis and Western Allied and Soviet Allied (if there are only two players one player plays both Allied turns). Two large folded paper maps depict Eastern and Western Europe and the Mediterranean region.&#10;&#10;",
        "artist": "Beth Queman"
    },
    {
        "name": "Vapor's Gambit",
        "description": "In Vapor's Gambit, you race hover boards on a course of interchangeable track sections. As you race around the track you can throw obstacles in front of your opponents such as ramps and dumpsters to throw them into walls or otherwise slow them down.&#10;&#10;",
        "artist": "Scott Lininger,Brian Wood"
    },
    {
        "name": "Heart of Africa",
        "description": "From the Mayfair Catalog:&#10;&#10;Heart of Africa is a meaty trading game where the players each lead a trading company which tries to make profits in Africa.&#10;&#10;Although Africa had been circumnavigated by the start of the 19th century, the continent remained largely undiscovered. One of the great mysteries was the source of the Nile, and explorers like Burton, Speke, Baker and Livingstone became immortal in their attempts to find it.&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Visual Game",
        "description": "Just like Pictionary with some variants. Members of a team have to guess what their mates are drawing.&#10;Probably there is only an Italian edition.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "White Bear & Red Moon",
        "description": "Glorantha world based - &quot;The game that started it all.&quot; It has been revamped and reissued as Dragon Pass. There are 9 scenarios designed for 1-3 players. Updates can be found published in Wyrm's Footnotes. A fantasy wargame about conflict between the armies of Sartar and the opposing Lunar Empire. 32-page rulebook and over 300 counters. It has a mono color map which was reissued in color for DP. Playable size - 22&quot; x 34&quot; map. It has been quoted as &quot;A very playable game, once you start to grasp the unique abilities of many of the units and learn to use them wisely. Contents include: Heroes, Exotics and Independents&quot;&#10;&#10;Nomad Gods is a 2nd game set in the same fantasy world, in a land just of the east of the map.&#10;&#10;",
        "artist": "Steve Swenston"
    },
    {
        "name": "New Rules for Classic Games",
        "description": "This book offers a large number of variations on many classic board and card games, as well as listing some new games that can be played with components from those games.&#10;&#10;While it is comparable to Sid Sackson's well known gaming book (A Gamut of Games) in some respects, New Rules for Classic Games also explains how and why certain variations work. It also provides some guidelines on creating new variations for existing games, including tips on how to change the number of players or to handicap one side effectively. Because of this, New Rules for Classic Games is recommended for people interested in game design.&#10;&#10;Rules are given for the induction game of Eleusis, and several variations on Sid Sackson's classic party game Haggle are described.&#10;&#10;Variations are also provided for many classic board games, including:&#10;&#10;    Monopoly&#10;    Trivial Pursuit&#10;    Chinese Checkers&#10;    Boggle&#10;    Mastermind&#10;    Hearts&#10;    Scrabble&#10;    Chess&#10;    Checkers&#10;    Backgammon&#10;    Risk&#10;    Pente&#10;    Bridge&#10;    Poker&#10;    Go&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Minotaur Lords",
        "description": "In this game, Minotaur Lords fight for control over the ancient isle of Cresos.&#10;&#10;Cresos is divided in an upper and lower area. Each of these is further subdivided in economic, religious and military aspects which form the 6 columns over which players fight for control. On their turn, players play Minions, Buildings and Leaders cards in these columns. The player with the highest strength in a given column exercises supremacy over it and may use its special ability.&#10;&#10;A player wins the game if he starts his turn and his opponent has no cards or if he has majority control over both the upper and lower areas. Majority is won by having more influence in a column than the other player and allows the use of special abilities.&#10;&#10;From the fantasy flight &quot;rant&quot; page&#10;Minotaur Lords is a sequel game to Scarab Lords. It is a stand-alone game, but if you have a copy of Scarab Lords, you can have your favorite Egyptian faction face off against one of the new factions from Minotaur Lords.&#10;&#10;",
        "artist": "Thomas Denmark,John Goodenough,Roberto Marchesi,John Moriarty,Jon  Schmidt,Brian Schomburg"
    },
    {
        "name": "Jumpin' Java",
        "description": "From the box back:&#10;&#10;The strategy game that's a big buzz without the caffeine! Try to outwit your opponent and be the first player to jump your cups and slide your saucers to the opposite end of the game board. Jumpin' Java is a unique game that is fun to play and display. It is sure to find a home on your 'coffee' table.&#10;&#10;Beautiful wood game box holds 4 cups and 4 saucers with a unique, folding coaster game board and instructions.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Simply Suspects",
        "description": "In society, whenever a crime has been committed, no matter how small, there is always evidence left behind. The evidence usually points to certain suspects. In this game, the players are all &quot;simply suspects.&quot; What is unusual is that the suspects each have the opportunity to tamper with the evidence so that it points to other suspects.&#10;&#10;If the evidence points to you when you meet the Grand Jury, you are eliminated from the game. While moving the evidence around, players must also try to hide their own identity - so other players don&rsquo;t figure out which suspect they are. If a player discovers another player&rsquo;s identity, they may point the finger at that player and eliminate them from the game.&#10;&#10;Simply Suspects is a fast-action game of suspicion and finger pointing. Much like Spy Alley, Simply Suspects is deceptively simple yet surprisingly intense. The advantage that one player may appear to have can change with a single move. You are never sure which suspect will escape the Grand Jury and win the game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Spearhead",
        "description": "Spearhead is a complete rules set that simulates Division-level tactics of WWII. The emphasis is on commanding a multi-battalion force, and all game mechanics serve that priority.&#10;&#10;Players command multi-battalion forces, using division-level tactics. Pre-game orders determine how units perform, with limited ability to change plans on the fly&#10;&#10;No plan survives the first ten minutes of a battle. This truism is frequently misinterpreted and used by many to argue against the use of a restrictive command control system. Above all, it does not mean that a new plan can be extemporized to replace the faulty one. A commander adjusted as best he could, given the systematic limitations of his troops and the availability of reserves. These factors are of paramount importance in Spearhead.&#10;&#10;Expanded by:&#10;&#10;    Great War Spearhead&#10;&#10;&#10;&#10;&#10;Scenario books:&#10;&#10;    Where the Iron Crosses Grow :Eastern Front&#10;    White Star Rising :Western Front&#10;    Blaze Across the Sands :North Africa&#10;    Forgotten Battles :Various theaters&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Tumbling Tower",
        "description": "You take turns with other players removing rectangular wooden blocks from a block tower. Each time you take one out, you put it on top. The object is to not knock the tower over while removing pieces. In difference of some other Tower Stacking Games, you must space out the blocks on Tumbling Tower in order for it to make a nicely shaped tower.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Things...",
        "description": "Things... is a party game where everyone writes a response to a particular prompt, such as &quot;Things... you shouldn't put in your mouth,&quot; and the players then try to guess which player wrote which response.&#10;&#10;A reader is chosen. This reader reads aloud a Topic Card. The players all write a response, fold up the slip of paper and turn it in to the reader, who reads them aloud once and then a second time. The player to the left of the reader has to guess who wrote which response. This is all done from memory, without benefit of taking notes or having the responses read again. If the guesser is correct, he or she continues guessing until incorrect, at which time the player to his/her left tries guessing. Players whose responses were correctly identified are eliminated and cannot make guesses. The round ends when one player has not been matched to a response.&#10;&#10;1 point is awarded for each correct guess. 6 points are awarded to the person who successfully avoided detection. The job of reader passes to the left. When everyone has been reader once, the game ends. High score wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Master Thieves",
        "description": "A very unusual game which comes in a beautiful wooden box. Central element is a sort of necklace case (in wood) comprising three levels, each of which has a drawer on each side. Each level can be rotated individually. The whole case looks the same on the top and the bottom so it can be turned around. Everybody chooses a role: wife, jeweler, detective, or master thief and tries to get the biggest loot of beautiful gems.&#10;&#10;Expanded by:&#10;&#10;    Master Thieves: Expansion Cards&#10;&#10;&#10;&#10;&#10;",
        "artist": "Czarnè"
    },
    {
        "name": "Swärje",
        "description": "Sw&auml;rje is a card game where you play the different ministers in something that just might be the Swedish government (the late 1990's socialist version). The object of the game is to get as much money to your swiss bank account.&#10;&#10;The game is a bit like  Junta (but without the coup phase).&#10;&#10;",
        "artist": "Patrik Hultén"
    },
    {
        "name": "Smugglers of the Galaxy",
        "description": "Dodging battlecruisers, escaping space monsters, and blasting bounty hunters are all in a days work for you, as captain of your own space freighter. Trade goods on the space lanes, work for crime lords, or engage in your own piracy - the big bucks are for those who can smuggle past orbital customs stations.&#10;&#10;Use your credits to upgrade your space freighter and find other special equipment. Freedom of movement and diversity of choice don't keep Smugglers of the Galaxy from being a simple and easy play.&#10;&#10;Some of the many options for players include: Space Trading, Smuggling, Piracy, Bounty Hunting, and Starship Upgrades.&#10;&#10;SPACE TRADING&#10;Every planet has different demands for Food, Robots, Weapons, Luxuries, and Medical Supplies.  Buy low on one world and sell high on another. Expand your ship&rsquo;s cargo capacity and upgrade your Lightspeed to make credits quick - but watch out for pirates on the space lanes.&#10;&#10;SMUGGLING&#10;Some goods are illegal on some worlds - but that means big bucks to those who can smuggle them past customs! Larger worlds generally have larger starports - which means better security but also better profits. Crime Bosses offer the biggest payoffs but you&rsquo;ll regret it if you fail them. Find friends and technology that will help you smuggle because you don&rsquo;t want to get caught with a shipload of illegal goods.&#10;&#10;PIRACY&#10;Become a space pirate yourself by arming your ship and blasting unsuspecting merchant ships (and other players) for their cargo. Be careful though - as your bounty stacks up, tougher bounty hunters will become interested in you.&#10;&#10;BOUNTY HUNTING&#10;So other players have bounties on their heads? Go after them and collect! But making powerful enemies in the galaxy may be your undoing. A good bounty hunter must know when and where to strike.&#10;&#10;UPGRADE YOUR SPACESHIP&#10;Whether peaceful merchant, shifty smuggler, or ruthless warrior - everyone could use a better ship. Upgrade your Lasers, Engines, Lightspeed, Shields, and Cargo Pods and keep your enemies off your back and increase your money-making potential. In addition to these standard upgrades, be on the lookout for unusual technology, such as cloaking devices, secret compartments, telepathic orbs, and more.&#10;&#10;FREE EXPANSION : Alpha Expansion&#10;&#10;Taken from the announcement : A free expansion called &quot;Alpha Expansion&quot; is available as a PDF download at dtstrain.com/smugglers. This expansion features custom character creation rules and additional optional rules which alter, improve, or add different aspects of the game. The expansion also includes an expanded strategy guide, solo-play rules, clarifications &amp; errata, and a series printouts for improved spaceship sheets, character sheets, money, and more.&#10;&#10;RULES 2.0 AVAILABLE&#10;&#10;These new and improved rules are available as a free download from dtstrain.com/smugglers. See also, Total rules on one sheet of paper.&#10;&#10;UPDATE&#10;Ownership of Smugglers of the Galaxy has passed from Playus Maximus to designer Daniel Strain, and is now available to individuals, merchants, and distributors at: dtstrain.com/smugglers&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "April's Harvest: The Battle of Shiloh, April 6 & 7, 1862",
        "description": "April's Harvest: The Battle of Shiloh, April 6 &amp; 7, 1862, is the ninth game of the Civil War Brigade (CWB) Series from The Gamers.&#10;&#10;April 6, 1862: The Confederacy must strike back at a host of Union armies that have virtually captured vital Tennessee. The South masses its forces under charismatic Albert Sidney Johnston to strike Union troops encamped at Pittsburgh Landing, on the Tennessee River. These forces are commanded by the North's newest war hero: Ulysses S. Grant.&#10;&#10;April's Harvest covers the resulting Battle of Shiloh, the largest bloodbath to that point on the North American continent. The game portrays the whole battle, from the initial Rebel drive through the camps of the surprised Union army, to the Grant's final counterstroke after receiving desperately needed reinforcements.&#10;&#10;Special features cover the fighting at the Hornet's Nest, the uncertain arrival of Buell's Army of the Ohio, Union gunboats and Confederate looting. A host of options allow players to see how Shiloh might have been fought if Grant hadn't been surprised, or if the South had received additional men from Van Dorn's Army of the West&#10;&#10;Game Scale:&#10;Game Turn: 30 minutes&#10;Hex: 200 yards&#10;Units: Brigades&#10;&#10;Game Inventory:&#10;One 22 x 34&quot; full-color mapsheet&#10;One dual-side printed countersheet (280 1/2&quot; counters)&#10;One 32-page CWBS 2nd Edition system rulebook&#10;One 24-page April's Harvest specific rulebook&#10;Two 6-sided dice&#10;&#10;Solitaire Playability: High&#10;Complexity Level: Medium&#10;Players: 1 or more&#10;Playing Time: 4-20 hours&#10;&#10;",
        "artist": "Dean Essig,Thure de Thulstrup"
    },
    {
        "name": "Crash Canyon",
        "description": "This off road racing game uses a large three dimensional board very similar to Fireball Island.  Players race their 4x4 vehicles with the roll of a special six sided die without a 1 pip but it has a star instead.  Rolling a star allows you to move opponents cars and roll again.  Cars can roll freely on the board and possibly roll off the board or crash.  When movement ends, you must release your 4x4 and see if it &quot;free wheels.&quot;  Rolling off the board or crashing means the loss of a turn while you get your 4x4 back on the road.  Seven boulders on the road (placed at the start of the game) stop movement, but are removed from the game when first encountered.  Light hearted and fun, especially with younger players.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Dice Games Properly Explained",
        "description": "Reiner Knizia's paperback book about dice games runs to 224 pages including the index. There are 8 chapters:&#10;1. Lucky Scoring Games&#10;2. Lucky Counter Games&#10;3. The Theory of Dice (9 pages headed &quot;It's easier than you think&quot;)&#10;4. Betting Games&#10;5. Progression Games&#10;6. Jeopardy Games&#10;7. Category Games&#10;8. Bluffing Games&#10;&#10;There are tons of games here, all explained pretty simply, in an open, friendly style. Most have one or two pages and include variants, tactics and odds where applicable. The only illustrations are relevant but basic diagrams, nothing big enough to photocopy.&#10;&#10;The front piece notes some games are original to Knizia, and these are the ones that are mentioned as &quot;original&quot; games in the book - games like Catego or Six Hundred.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Borodino: Battle of the Moskova, 1812",
        "description": "Second volume in the Triumph &amp; Glory series covers the classic battle of Borodino. &quot;The brigade-level Orders of Battle include the latest research, some directly from Russia (The Wonders of The Net!), and we even give the French player an opportunity - fraught with danger, to be sure - to attempt to undertake Davout's suggested flanking maneuver. In addition to the full Borodino, the game also includes a nice, short, 'introductory' mini-battle, the Attack on the Schevardino Redoubt (which took place 2 days before the actual battle).&quot; [From box.]&#10;&#10;SYSTEM: Triumph &amp; Glory / Jours de Gloire Series (JDG) &#10;- scale = 297 m/hex; &#10;- time = 75 min/GT; &#10;- strength = 200 men/SP.&#10;&#10;COMPONENTS&#10;420 full-color die-cut counters.&#10;One 22x34&quot; full-color mapsheet     &#10;One 10-sided die&#10;One 24-page Rule Book&#10;2 Player Aid Cards&#10;&#10;",
        "artist": "Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "ConHex",
        "description": "Conhex is a 2-player abstract game in which the winner is the first player to connect his or her assigned sides of a square board (thus the goal is similar to the goal in Twixt.)  The board is a pattern of non-regular hexagons with a few non-hexagonal polygons.  Players alternate turns placing pieces of their own color on a vertex, and a player can claim a space after placing pieces on at least half the vertices of that space.  A description can be found at www.gamerz.net and the game can be played face-to-face or over the internet.&#10;&#10;",
        "artist": "Néstor Romeral Andrés"
    },
    {
        "name": "Reinforce the Right!",
        "description": "Game from Strategy &amp; Tactics magazine #180.&#10;&#10;Wargame covering the first few weeks of the German offensive in the west, 1914.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Boomtown",
        "description": "There's gold in them thar hills!&#10;&#10;In Boomtown &mdash; a game with auctions, dice, and fun/nasty action cards to play on opponents &mdash; you start as a gold digger and try to end as a tycoon. To do this, you must first buy the best mining concessions, hoping to find gold veins. You can also try to become the Mayor of Whiskey River or San Narciso, in order to get a small cut on concessions sales, or build a saloon where lucky prospectors will spend their nuggets in moonshine whiskey. If business is really bad, you can still rely on bank or stagecoach hold-ups to reestablish you. A well placed stick of dynamite can also solve some minor problems.&#10;&#10;Piraci features the same gameplay as Boomtown, but with the players now sailing the waters instead of panning them.&#10;&#10;",
        "artist": "Kara,Maciej Szymanowicz"
    },
    {
        "name": "Word Jam",
        "description": "This card game consists of two decks: a deck of topics and a deck of consonants. Both decks are shuffled and five consonants are dealt. The first consonant may not be used by the players in their word but the other consonants may be used and are assigned values of one, two or three. The topic is read aloud and the players must think up a word that fits the topic and uses any or all of the permissible consonants but not the forbidden consonant. The first to think up a word announces it and totals its value. The other players then secretly decide whether anyone else can come up with a higher scoring word. Once the players have voted anyone who thinks a higher scoring can been generated has an additional twenty seconds (a sand timer is included) to announce that word. Points are scored based on who came up with the round's winning word and who voted correctly.&#10;&#10;The final round of the game has the players deciding which of two teams to join secretly. The player who comes up with the highest scoring word on each team scores the most points.&#10;&#10;The player with the most points at the end of the game is the winner.&#10;&#10;",
        "artist": "Gianpaolo Derossi"
    },
    {
        "name": "Abracadabra",
        "description": "From the publisher's website:&#10;&#10;The best pupils from the school of magic gather to try out their most powerful spells. But be careful of their clumsy broomstick! A game of forming combinations for apprentice wizards.&#10;&#10;",
        "artist": "Gianpaolo Derossi"
    },
    {
        "name": "Mister Bill",
        "description": "From the publisher's website:&#10;&#10;In Mister Bill's restaurant, waiters rush about serving typical dishes from around the world. Who is going to pay the... bill? A game of exchanges and luck for experienced gourmets.&#10;&#10;",
        "artist": "Roberta Barletta,Toni Cittadini"
    },
    {
        "name": "Farfalia",
        "description": "From the publisher's website:&#10;&#10;Research into natural science requires careful planning - especially when only one specimen can be taken for the collection. And how much better if it is a species of Farfalia! A trick taking game for alert naturalists.&#10;&#10;",
        "artist": "Roberta Barletta,Stefano de Fazi"
    },
    {
        "name": "El Capitán Alatriste",
        "description": "Based in the novel series El Capit&aacute;n Alatriste by Arturo P&eacute;rez-Reverte. Each player plays a hidalgo in the Spain of Felipe IV in his search to be introduced to Count-Duke Olivares.&#10;&#10;The game mixes role-play like rules with typical roll and move board game rules.&#10;&#10;",
        "artist": "Antonio Catalán"
    },
    {
        "name": "Fiasco",
        "description": "Fiasco describes itself as a recently discovered card game thought to date from the Italian Renaissance of the late-1450s. Fiasco distinctively incorporates six suits representing symbols of power and wealth and features the legendary character Fiasco.&#10;&#10;A game for advanced card players, Fiasco is easy to learn but a challenge to master. First, select your favorite suit. Choose from horses, swords, mandolins, roses, books or treasure chests. Now do your best to collect them all. Play high cards to win the pot and accumulate points. But here&rsquo;s the twist: Playing high cards also gives your opponents the opportunity to hit you with Fiasco penalty cards. Avoid the danger by laying low, but lose the chance to win your points.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Barbarossa: Game of the Russo-German War 1941-45",
        "description": "Barbarossa: Game of the Russo-German War 1941-45, On 22 June 1941, the German Wehrmacht invaded Soviet Russia in an operation code-named Barbarossa. BarBarossa is a strategic, two-player, Corps-level simulation of the four year struggle of the East Front war in the Soviet Union. The Axis Player takes the role of the German High Command (OKH) and controls playing pieces representing the forces of Germany and its allies. The Soviet player takes the role of the Soviet High Command (STAVKA) and controls pieces representing the armed forces of Soviet Russia and allied partisans.&#10;&#10;Four scenarios:&#10;1941 Barbarossa: Turns 1 through 8&#10;1942 Blau: Turns 12 through 24&#10;1943 Zitedelle: Turns 26 through 36&#10;Campaign: Turns 1 through 48&#10;&#10;Game Scale:&#10;Game Turn: 1 month&#10;Hex: 27 miles / 44 kilometers&#10;Units: Corps to Army&#10;&#10;Game Inventory:&#10;Two 22 x 34&quot; full color mapsheets&#10;Two dual-side printed countersheets (800 1/2&quot; counters)&#10;One 32-page Barbarossa rulebook&#10;Two 6-sided dice&#10;One plastic storage tray&#10;&#10;Solitaire Playability: Medium&#10;Complexity Level: High&#10;Players: 2 or more&#10;Playing Time: 4-25 hours&#10;&#10;",
        "artist": "Ivor M. Janci,Dave LaForce"
    },
    {
        "name": "Four Battles in North Africa",
        "description": "Four game in the Western Desert 1941-1943. Standard rules and Exclusive rules for each of the four games.&#10;&#10;    Crusader, Battle for Tobruk, November 1941&#10;    Cauldron, Battle of Gazala, May 1942&#10;    Supercharge, Battle of El Alamein, October 1942&#10;    Kasserine, Baptism of Fire, February 1943.&#10;&#10;&#10;&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "The Great Battles of Alexander: Deluxe Edition",
        "description": "The Great Battles of Alexander: Deluxe Edition, the updated, expanded, full-color-enhanced version of the best-selling, multi-award-winning game system that started the Great Battles of History series, includes new game counters, maps, packaging, battles, and scenarios that cover all the major battles from the original game and the Juggernaut module, plus five additional battles ... ten in all. The Great Battles of Alexander: Deluxe Edition is virtually the complete history of Alexander the Great and the Macedonian art of war.&#10;&#10;Game features:&#10;&#10;     Third Edition rules, with many changes and additions &#10;     New maps for The Granicus and Chaeronea, plus an expanded Gaugamela map &#10;     Armies for the Danubian tribes, Illyrians, Greeks, Persians, Scythians, and Indians &#10;     Eighteen new Macedonian Commanders &#10;     New Restricted Line Command system for Persians, Indians and Greeks &#10;     Wing Commanders and Macedonian Contingent Commanders &#10;     Cavalry Shock Formations: The Companion Wedge and the Thessalian Diamond &#10;     The Persian Immortals and Kinsmen, Macedonian artillery, cataphracted cavalry ... and cataphracted elephants!&#10;&#10;&#10;&#10;&#10;Components:&#10;&#10;     720 full-color two-sided counters (43 full-color two-sided double-size counters)&#10;     Three full-color double-sided 22x34&quot; map sheets&#10;     One 10-sided die &#10;     32-page Rule Book &#10;     24-page Scenario Book &#10;     Player Aid Cards: Two 8.5x11&quot; cards showing game charts &amp; tables&#10;&#10;&#10;&#10;&#10;TIME SCALE: 20 minutes per turn &#10;MAP SCALE: 70 yards per hex &#10;UNIT SCALE: 100 men per strength point &#10;NUMBER OF PLAYERS: One to four&#10;&#10;",
        "artist": "Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "Normandy",
        "description": "&quot;Normandy - The invasion of Europe 1944&quot; is a classic simulation wargame by SPI. The German players has six different sets of victory goals, depending on the orders from the HQ: the Allied does not know which one is in use and has to plan the invasion accordingly. German reinforcements are also affected by the battle plan used.&#10;&#10;Rules are quite standard for SPI wargames, with units able to 'break down' into their component formations. The game goes on smoothly and ends in a reasonable time.&#10;&#10;At least four editions exist: the original 'Test Series' edition, with the most primitive components and rules; the 'Simulation Games' edition, with die-cut counters, heavier cardstock for the map, and cleaned up rules; the SPUK edition, printed in the UK under licence with different colours; and a later more colourful edition.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Familienbande",
        "description": "Here is a description of the game from Spielbox:&#10;&#10;Familienbande is the third game in Winning Moves&rsquo; new &ldquo;Compact Game&rdquo; series, and is by Leo Colovini. It&rsquo;s a fast and funny board game that deals with the dynastic succession of royal families. Brides are chosen, heirs are born. Unmistakable traits such as large noses, red hair or cauliflower ears are depicted on the humorously-illustrated cards; these traits must be used to score points and be combined in engagements and births. Incest? Shame on you for thinking of such a possibility! The game is for 2-4 players Ages 8 and up.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Moby Pick",
        "description": "This game is one of daVinci's Allegro line of simple and fast games.&#10;&#10;Here is a description of the game from the publisher:&#10;&#10;Molly the kid, Polly the parrot or Moby Pick the white whale? Which cards will be the same of the concealed ones? What will be their colors? A game of reflexes for refined speakers.&#10;&#10;",
        "artist": "Alessandro Pierangelini"
    },
    {
        "name": "Jumbo & Co",
        "description": "In the card game Jumbo &amp; Co, first published as Mausen, you try to collect as many valuable animals as possible by chasing them from the table into your holding pen. To do that, you'll need to play the right animal at the right time while anticipating what opponents will play, too.&#10;&#10;Each player starts the game with a hand of sixteen cards: four each of elephant, dog, cat and mouse, with those cards valued 1-4. One card of each type starts in the center of the table. Each round, players choose one card from their hand, then reveal them simultaneously.&#10;&#10;Which animals are chased away is determined through a &quot;rock/paper/scissors&quot; format, with dogs chasing away cats, cats chasing away mice, mice chasing away elephants, and elephants chasing away dogs. If you play the only dog, for example, you collect all cats on the table and all cats played that turn; if multiple people play dogs, the strongest valued dog wins; if players play dogs of the same value, then those are ignored and the next strongest dog wins. Any animals not collected stay on the table for the next round.&#10;&#10;Once all the hand cards have been played, players tally the value of the animals they collected and whoever has the highest sum wins!&#10;&#10;",
        "artist": "Fiore GmbH,Alexander Jung"
    },
    {
        "name": "Leuthen: Frederick's Greatest Victory",
        "description": "December 1757: Not since losing Silesia in 1742 had Austria come so close to regaining the province. With the recent Imperial victory at Breslau (November 22) Austrian forces under Prince Charles of Lorraine and Field-marshal Daun, the victor at Kolin, were only a battle away from that goal. They expected to fight this battle in the new campaign year which would begin in the coming spring.&#10;&#10;For King Frederick II the loss of Silesia would not only be a devastating blow to his prestige but deprived of its resources, revenue and manpower Prussia's ability to continue the war would be desperately compromised. Rather than to allow the enemy to go unchallenged Frederick marched his remaining army of 40,000 men composed of Rossbach veterans and Breslau survivors against Charles' nearly 60,000 polygynous force of Austrians, Hungarians, Imperials, Bavarians and Wurttembergers.&#10;&#10;On a frigid December 5th, in a season when armies usually sought the comfort of winter quarters, the opposing forces met on the snow covered fields surrounding the Silesian village of Leuthen. After deftly maneuvering around Prince Charles' flank Frederick's Prussians attacked with unprecedented fury collapsing the enemy line. However, despite this initial crushing blow the Austrians were able to reorganize their front and fight the Prussians to a standstill leaving the battle's final outcome still in doubt. Only after a climactic cavalry charge did the Habsburg army finally break and retreat to Breslau. Two weeks later the city capitulated and the Austrians evacuated Silesia. Although the war would continue for another six years Frederick would never again attain the level of success he did at Leuthen, his greatest victory.&#10;&#10;Leuthen (Battles from the Age of Reason, Vol. 3) presents both gamers and students of the period with a colorful and meticulously detailed simulation with which to explore the actual events and possibilities of this definitive battle. Included is an historical commentary written especially for the game by the period's leading authority, Prof. Christopher Duffy. This narrative contains many previously unpublished aspects of the battle and includes maps, diagrams, statistics and his analysis of the 1757 campaign in Silesia.&#10;&#10;",
        "artist": "Carl Röchling"
    },
    {
        "name": "Zorndorf",
        "description": "1758 marks a turning point in the Seven Years War. For the first time Austrian, Swedish and Russian forces pose simultaneous threats to the Prussian heartland. By mid-August the Russian offensive crests on the Oder River, laying siege to the fortress of C&uuml;strin. Force marching from Silesia through blazing summer heat, Frederick races to bring about a decisive battle. On 25 August near the village of Zorndorf 43,000 Russians and 36,000 Prussians fight one of the most savage battles of the war. For nearly 10 hours they hammer one another, yet by day's end neither army yields, despite staggering losses - nearly half the Russians and one-third of the Prussians were casualties. Finally, both armies limp away, each claiming victory: the Russians back into Poland; the Prussians to Saxony and a new Austrian threat.&#10;&#10;Zorndorf is the second game in the acclaimed Battles from the Age of Reason (BAR) series. The system presents a detailed simulation of warfare in the age of linear tactics. It is the framework through which players maneuver historic armies while seeking to discover which combinations of units and formations lead to victory, or are a formula for defeat.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Tahuantinsuyu",
        "description": "From Hangman Games' web site:&#10;&#10;Tahuantinsuyu is the Quechua or Inca word for &quot;Land of the Four Regions&quot;. It is what the Inca called their own empire. The empire was organized as a pyramid-shaped hierarchy with the Sapa Inca as the supreme ruler, followed by the four Apus, who were followed by the Hahua Incas, etc. To play, you assume the role of one of the Apus (a leader of one of the four regions or &quot;Suyus&quot;). Your job is to increase your status in the eyes of the Sapa Inca by doing the best job of expanding and improving the empire. Each Apu begins with the manpower of their quadrant of the original empire. You build roads and conquer neighboring regions, thereby increasing the manpower and available resources. Apus are rewarded for each new region added to the empire, for improvements such as terraces, garrisons, cities, and temples, and for connecting road systems to all of the improvements throughout the empire.&#10;&#10;Reimplemented by:&#10;&#10;    Inca Empire&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Who's the Ass?",
        "description": "An exciting and fun cardgame for large and small gaming groups by Wolfgang Kramer!&#10;Just as I was winning, the ass appeared! Now I am stuck with a hand full of cards again!&#10;The aim of the game is it to get rid of your cards as fast as possible. Once done, all other players score negative points.&#10;However, beware of the ass... and do not feel sorry if it sticks on you!&#10;&#10;Re-implemented by:&#10;&#10;    Ochs & Esel (2008)&#10;    Das GROSSE und das kleine A (1996)&#10;&#10;&#10;&#10;&#10;",
        "artist": "François Bruel"
    },
    {
        "name": "Warhammer 40,000: Rogue Trader",
        "description": "The first edition of Warhammer 40,000, but different enough to call it another game. Rogue Trader was a story-based skirmish game with plots the GM (Game Master) would write up. Rules were provided for various races but algorithms were also in the rulebook to calculate the cost of your homemade units. There was a wide variety of gear, vehicles, and troop types available to each army. Players were encouraged to use other companies models with GW's own and make up rules and units.&#10;&#10;This edition is considered the best by some players because of the massive amount of background and the free-form rules.&#10;&#10;Re-implemented by:&#10;&#10;    Warhammer 40,000 2d and 3d editions&#10;&#10;&#10;&#10;&#10;Expanded by:&#10;&#10;     Book of the Astronomican&#10;     Warhammer 40,000 Compendium&#10;     Warhammer 40,000 Compilation&#10;     Warhammer Siege&#10;     Warhammer 40,000 Battle Manual&#10;     Warhammer 40,000 Vehicle Manual&#10;     Realm of Chaos: Slaves to Darkness&#10;     Realm of Chaos: The Lost and the Damned&#10;     Waagh da Orks&#10;     'Ere We Go: Orks in Warhammer 40,000&#10;     Freebooterz&#10;&#10;&#10;&#10;&#10;Buy Microbadge&#10;&#10;",
        "artist": "Tony Ackland,Dave Andrews,John Blanche,Carl Critchlow,Colin Dixon,Charles Elliot (I),Angus Fieldhouse,David Gallagher,Jes Goodwin,Tony Hough,Pete Knifton,Martin McKenna,Ian Miller,Trish Morrison,Aly Morrison,Bob Naismith,Alan Perry,Tim Pollard,Wil Rees,John Sibbick,Stephen Tappin"
    },
    {
        "name": "A Famous Victory",
        "description": "A Famous Victory is MiHs game simulating the battles of Blenheim and Ramillies. Quote from the rules &quot;A Famous Victory (AFV) allows players to recreate two of the major battles - Blenheim and Ramillies - fought by England and her continental allies against the ambitions of the Sun King, Louis XIV, during the War of the Spanish Succession, a war that revealed John Churchill, First Duke of Marlborough, as England's greatest Field Commander and one of the true military geniuses in history.&quot;&#10;Components:&#10;22x33 inch game map (back printed)&#10;720 counters&#10;rule booklet plus historical comment&#10;4 aid charts&#10;1 d6&#10;1 d10&#10;&#10;",
        "artist": "Beth Queman"
    }
]