[
    {
        "name": "Nations at War: White Star Rising",
        "description": "White Star Rising introduces Lock &lsquo;n Load Publishing&rsquo;s Nations at War (NAW) game system. Based on the popular World at War, NAW depicts platoon level combat in World War II. Here you&rsquo;ll find everything you're looking for in a platoon-level game -- armor, artillery, infantry that serves as more than cannon fodder, command and control, air support, amphibious landings, and desperate close assaults that leave the victor in possession of the ground and the defeated in headlong retreat, all in eight pages of rules. That&rsquo;s two less than the World at War system.&#10;&#10;Units represent platoons of vehicles, such as M-10 Wolverines, M4A3E8 Easy Eight Shermans, and German Panthers, Tigers, and Mark IVs. Of course White Star Rising isn&rsquo;t all about tanks. There&rsquo;s plenty of infantry; paratroopers, line doggies, Fallschirmjaeger, and Volksgrenadiers. In the same vein as the World at War system, the infantry are capable of moving fast and hitting hard. White Star Rising also includes support weapons, such as heavy machine guns, flamethrowers, and satchel charges that infantry platoons can use to lethal effect.&#10;&#10;The system throws typical turn-based gaming out the window. The platoons are grouped into formations (usually battalions and kampfgruppen) and led by a headquarters. Each unit of the formation must be within range of the HQ to activate with its formation. Although individual units might activate, and recon units can double their range from the HQ, you&rsquo;ll want to keep those formations together. The formations are activated by chit draw, and better-trained, better-led units can activate more than once in a turn, moving, shooting, and fighting in each activation. On the flip side, there is no guarantee that a formation will activate even once. The cup into which the formation chits are placed is seeded with end turn chits. When the second end turn chit is drawn the turn ends. Doesn&rsquo;t matter if a single formations has activated; the turn is over. It keeps you on your toes.&#10;&#10;When attacking, each platoon rolls a number of dice equal to its firepower. Every die that equals or exceeds the &ldquo;to hit&rdquo; number (right superscript) hits the target. The target then rolls a number of dice equal to its armor factor plus terrain advantages. Each die that equals or exceeds its armor factor negates a hit. The first hit disrupts a unit, second reduces it, the third eliminates it.&#10;&#10;Units may also close assault, entering the opponent&rsquo;s hex to either deal a death blow or force him (or her) out of valuable terrain. Same procedure, but both units use their close assault value. The side that takes the most hits must retreat from the hex. Infantry is VERY good at this, especially against armor without its own infantry support.&#10;&#10;Game includes rules for thin-skinned vehicles, support weapons (actual counters that represent heavy machine guns, flamethrowers, and satchel charges that add to an infantry platoon&rsquo;s capabilities), air support, bunkers, wire, artillery, mines, overruns opportunity fire, line-of-sight rules that have been streamlined since their inception in World at War, transporting infantry--and all in eight pages of rules.&#10;&#10;Contents&#10;&#10;    2 sheets (approximate 200 total) .75&quot; counters&#10;    4 professionally-drawn, printed, 11&quot; x 17&quot;  geomorphic maps&#10;    18 scenarios&#10;    2 players' aid cards&#10;    4 dice &#10;    20 page full color rule, scenario, and chart book.&#10;&#10;&#10;&#10;&#10;Other Games in Series:&#10;&#10;    Nations at War: White Star Rising&#10;    Nations at War: Desert Heat&#10;    Nations at War: Stalin's Triumph&#10;    White Star Rising: Airborne&#10;    White Star Rising: Operation Cobra&#10;&#10;&#10;&#10;&#10;Re-implements:&#10;&#10;    World at War: Eisenbach Gap&#10;&#10;&#10;&#10;&#10;",
        "artist": "Marc von Martial"
    },
    {
        "name": "Founding Fathers",
        "description": "Politics year to year in the early American republic. Play begins with George Washington as president, with Vice President John Adams. Each player controls several statesmen as well as others who will appear, up through the arrival of Abraham Lincoln. Together the players try to solve the issues faced by the young republic -- wars, debt, financial panics, the growth of the Union, north-south division, and more. Every four years the most popular politicians from each party square off to see who becomes the next president.&#10;&#10;Somewhat similar to The Republic of Rome, but with many modifications to suit the topic, including a completely different way of resolving elections and a more nuanced treatment of Issue cards (rather than simply Wars), plus novelties such as the Public Support Track, spendable Influence, political parties, more offices, tax cards, counterfactual events and an ever-expanding map of the United States.&#10;&#10;If diplomacy is not your cup of tea, a variant printed in the rules removes all requirements to negotiate and makes it a matter of cardplay, drafting and utilization of resources.&#10;&#10;Living rules available: https://www.thegamecrafter.com/games/founding-fathers:-green-edition&#10;&#10;",
        "artist": "Luca Cammisa,Rick Heli"
    },
    {
        "name": "Nefertiti",
        "description": "From the back of the box:&#10;Akhenaton, Pharoah of Upper &amp; Lower Egypt, God among men, all powerful sovereign, he trembles before no-one. There is, however, one mistake that even an immortal king cannot afford to make: forgetting his wedding anniversary. Especially when his wife is the exquisite Nefertiti.&#10;Alas, the powerful monarch has almost made such an unforgivable blunder, remembering the event a mere two days before it is to take place. Now, he must find a veritable shower of queenly gifts.&#10;The task of finding beautiful &amp; original gifts falls upon his councilors - YOU!&#10;It's time to play! Send you servants to the four corners of Egypt, from Gizeh to Abou Simbel &amp; gather up the most impressive objects the realm has to offer. If your gifts are noteworthy and please Nefertiti, there is no doubt that the Pharaoh will reward you most generously.&#10;&#10;",
        "artist": "Alexandre Roche"
    },
    {
        "name": "Moto Grand Prix",
        "description": "Moto Grand Prix is an exciting game for all ages with a fast, realistic, dice-based system for playing multi-lap races quickly. Moto Grand Prix's beautiful, accurate models can lean and wheelie, and the modular boards allow a wide range of realistic circuits.&#10;&#10;Although it takes just minutes to learn, experienced players and  racing fans can add optional rules to crank up the realism even more.&#10;&#10;The box includes&#10;&#10;     1 24-page rulebook&#10;     6 1:55 scale model bikes, each with a rider and a special stand&#10;     12 six-sided dice (in red, yellow, and blue)&#10;     72 racetrack tiles&#10;     6 dashboards and 18 plastic spinners for the dashboards&#10;     6 lap-counting cards&#10;     84 corner difficulty counters and18 plastic stands for the difficulty counters&#10;&#10;&#10;&#10;&#10;Experience the thrill of high-speed motorcycle racing with Moto Grand Prix!&#10;&#10;Race track tiles are 10cm wide and come in different length and shapes - straights and curves.&#10;&#10;",
        "artist": "Demis Savini"
    },
    {
        "name": "Lincoln's War",
        "description": "Lincoln&rsquo;s War reflects the fickle nature of politics and its influence on military policy-making during the American Civil War. Here, the battlefield is an extension of the political arena. Many historical movers and shakers support or oppose their presidents&rsquo; war plans. Will Mr. Lincoln save the Union? Will Mr. Davis succeed in sundering one nation and creating another? How will you direct their political support?&#10;&#10;Lincoln&rsquo;s War is a card-driven game using cards to activate generals, but in Lincoln&rsquo;s War, activation numbers are also political currency or PC. PC not only activates generals but promotes worthy commanders, purchases war material, forces indecisive commanders to act, and represents support for the war. A decisive PC point spread is an advantage in winning the game but driving an opponent to 0 PC (and 0 Congressional support) at the end of a turn will ensure victory, even in the face of defeat.&#10;&#10;Unique features include a diceless combat system, seditious characters, and immobilization tokens. The combat system requires players to husband resources and congressional political support to ensure victory. Seditious characters oppose their respective Presidents&rsquo; handling of the war and sooner or later will erode a resident&rsquo;s vital political support. Immobilization tokens reflect damage in the form of casualties, as well as hesitation, confusion and even insubordination.&#10;&#10;Lincoln&rsquo;s War contains:&#10;    1 22&quot; x 34&quot; map&#10;    1 color rulebook&#10;    1 color play and background booklet&#10;    162 Operations Cards&#10;    2 countersheets&#10;    2 player aid cards&#10;&#10;Lincoln&rsquo;s War was designed by John Poniske with the assistance of Mike Joslyn, and features the artwork of Niko Eskubi and map artwork by Mark Mahaffey.&#10;&#10;(source: MMP website)&#10;&#10;",
        "artist": "Nicolás Eskubi,Mark Mahaffey"
    },
    {
        "name": "Strafexpedition 1916",
        "description": "(from Europa Simulazioni website:)&#10;&#10;Strafexpedition 1916, using battalion level units, comes with a brand-new impulse system, which allows a remarkable level of interaction between the two players. Manoeuvring is by brigade, at times depending by the initiative of the single commanders.&#10;&#10;To keep units and brigades in reserve, and the way you use them in battle, can make the difference between victory and defeat.&#10;&#10;Great importance is given to the morale of troops, and to its wearing, which affects the units&rsquo; efficiency in combat, and can take them even to surrender.&#10;&#10;The logistic effort is simply simulated using Logistics Points, that are the real &quot;fuel&quot; of any activity: attacks, artillery bombardment, trench building.&#10;&#10;Bayonet assaults, machine guns fire, trenches and forts, terrible artillery bombardments, fast counterattacks, snow on high mountains, fighting over 2000 meters heights, crags bordering the valleys (and limiting the manoeuvre), Austro-Hungarian big guns (like Gudrun and Barbara, and Lang Georg, or 42 and 30,5 cm mortars), Kaiserj&auml;ger and Alpini, Landessch&uuml;tzen and Bersaglieri...&#10;&#10;Components:&#10;&#10;Two 22&quot;x34&quot; maps of  the battlefield&#10;    840 die-cut counters&#10;    Standard rules and Scenario Instructions (four small and one large  campaign scenario)  &#10;    Charts, tables&#10;    Dice&#10;    Boxed&#10;&#10;",
        "artist": "Alberto Cavazzuti"
    },
    {
        "name": "Triovision",
        "description": "In Triovision, players are trying to move the pieces on the game board to match the shapes shown on the task cards. They can move only one piece in order to claim a card, however. Can they find the right move before another player? Whoever claims the most cards wins!&#10;&#10;",
        "artist": "Sabine Kondirolli"
    },
    {
        "name": "Barbarossa: Crimea",
        "description": "GMT is proud to present Vance von Borries&rsquo; sixth epic game in his award winning series of East Front games, Barbarossa: Crimea. This is a two-player operational level game depicting the battles in the Crimean peninsula of the Soviet Union during 1941 and 1942. Beginning in mid-October 1941 and ending in January 1942, it completes the year 1941 in this series of the German invasion of the Soviet Union. And it includes 1942 scenarios of the continued fighting in Crimea until the historical fall of the great Soviet naval fortress Sevastopol in July 1942.&#10;&#10;COMPONENTS&#10;One 22x34 inch map&#10;840 counters&#10;Rule booklet in color&#10;Playbook in color&#10;Various player aid cards for charts and tables in color&#10;Set up cards for each scenario in color&#10;4 Scenario cards 11x17&#10;1 ten sided die&#10;&#10;THE GAME&#10;&#10;This comprehensive game system was designed at a scale for divisions but it accommodates the many independent brigades, regiments, and special battalions that were also available for this campaign. These include units for rocket artillery, heavy artillery, armored trains, assault guns, engineers, Stukas, Sturmoviks, anti-aircraft guns, waffen SS, NKVD, militia, base units, naval units, and more. You have reinforcement options to tailor your army to fight a full campaign with many historical variables.&#10;&#10;As we have indicated with each game, all games in this series share the same game mechanics. Veteran East Front Series (EFS) players will find much here that is familiar. Such mechanics include ranged artillery, air units for close support or interdiction, Soviet HQs, retreat or stand orders, weather, reaction movement, railroad movement, strategic movement, overruns, combined arms, fortifications, special supply situations, and more. Veteran players should be able to pick up game play right away, and for them we have clarified many game procedures. For those who are new to the series, examples of play will be found in the rules book as well as a Learning scenario to fully illustrate game play and some of the decision making for each battle.&#10;&#10;All games of the EFS series are built to fit together side-by-side for possible combined play. We recognize that space is at a premium for some of you, so consider that all of the eight scenarios in this game require only one map or less; yes, just one map! Newcomers should try this game as a sample of the whole series.&#10;&#10;Barbarossa: Crimea includes several special features not found with all EFS games. Since the game revolves around Sevastopol, we include a special inset map to depict in detail the fighting at that important naval fortress. Much gaming will directly involve the inset, so we have streamlined previous series rules dealing with an inset map. We have also streamlined the naval rules, effectively rebuilding them. This in turn allowed us to rebuild the Odessa scenario found with the Barbarossa: Army Group South game in this series. There, and later in Crimea, the Soviets used amphibious operations to move battle lines forward. If an amphibious operation is not going well, the Soviets could declare an Evacuation. At Sevastopol the German player will be using his super-heavy artillery, including the world&rsquo;s largest artillery piece, Dora, historically seen in the final game scenario. The design notes include an essay on these wonder-weapons.&#10;&#10;Barbarossa: Crimea challenges you to balance your attack and defense in each sector of the game map, regardless of scenario. Neither side has sufficient resources in either troops or supplies so the key to winning will be good game play and a sound plan. Can you do better than the titans that struggled for the Ukraine in the summer and fall of 1941?&#10;&#10;THE SCENARIOS&#10;&#10;1) Learning Scenario: The Tartar Ditch. The German 11th Army has just received orders to enter the Crimea but to do so it must first clear the narrow Perekop Isthmus. This was the first battle for the Crimea. This is a small scenario but it teaches important lessons in precise game unit positioning - exactly what one would expect for historical positional warfare.&#10;&#10;2) Odessa: Hero City. This is a bloody example of siege warfare. The Romanian army shows exactly why it was so ill-suited for such an offensive, while the Soviets struggle to balance their forces from sector-to-sector and endure delays of reinforcements coming by sea. This rebuilds the scenario found in theArmy Group South game using new research and this game&rsquo;s improved naval rules.&#10;&#10;3) Crimea: The Road to Sevastopol. This begins in mid October 1941. The Germans almost certainly will break through the main Soviet defense line, so the Soviet player has to know when to break away from the action and run back to fresh prepared positions, a tactic typical of game play in other series games. The German player also chooses secret victory conditions. He will either drive south to Sevastopol or southeast to Kerch, forcing the Soviet to balance his defense of both.&#10;&#10;4) Sevastopol: The First Battle. With the Germans committed to Sevastopol, can the Soviet divert enough German attention elsewhere to save the fortress? In the meantime, the deeper the German pushes into the Sevastopol inset map, the better his chances for long-term victory.&#10;&#10;5) Crimean Campaign. The campaign scenario puts scenarios 3 and 4 together to feature a punch and counter-punch game strategy. The Soviet player relies on his naval units to rapidly shift the threat. The German relies on his infantry to consolidate gains.&#10;&#10;6) Kerch: The Party Boss Attack. Ever wonder why Mandated Attacks exist in this game system? In the middle of winter 1942 one of Stalin&rsquo;s cronies thought the armies holding the Kerch Peninsula in the Crimea were not sufficiently motivated to defeat the fascists. He personally bullied the local Front commander into do-or-die attacks. This scenario exemplifies the insanity of political expectations trumping battlefield realities. Can you find a weakness in the Axis line?&#10;&#10;7) Kerch: Operation Trappenjagd. Now it is the German turn to attack in the Kerch Peninsula but their champion knows how to attack. This is a brilliantly planned German attack, one that pays handsome dividends. Can you repeat Manstein&rsquo;s success? As the Soviet can you defeat Manstein&rsquo;s attack?&#10;&#10;8) Sevastopol: Operation Storfang. This is the last picture show in the Crimea and it will be bloody. Truly, the best is saved for the last as the Soviets fight for every last hill, fort, and farmhouse. They went down fighting and their sacrifice earned them great honor in the history books. It was close. The German plan of offensive was sound and it met each challenge the Soviets posed. Can you duplicate Manstein&rsquo;s cold calculations and earn your marshal&rsquo;s baton?&#10;&#10;",
        "artist": "Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "Dead of Winter (second edition)",
        "description": "Dead of Winter is GMT&rsquo;s recreation of Richard Berg&rsquo;s &ldquo;Great Battles of the American Civil War series&rdquo; series title on the battle of Murfreesboro; also known as The Battle of Stone&rsquo;s River to Union Veterans. Perhaps one of the most evenly matched battles of the war, Murfreesboro/Stone&rsquo;s River pitted the Federal Army of the Cumberland under Major General William Starke Rosecrans against the Confederate Army of Tennessee captained by General Braxton Bragg. With near parity of numbers (each side fielded roughly 40,000 men) and remarkably similar battle plans, both armies grappled in the December cold for control of Middle Tennessee.&#10;&#10;The Series:&#10;&#10;The GBACW Series is one of the hobby&rsquo;s longest lived design concepts, springing from the legendary regimental Level Gettysburg game - Terrible Swift Sword - created by Richard Berg in 1976. Since then, the series has undergone numerous system evolutions, always seeking to enhance the player&rsquo;s illusion of reality. Today, the series relies on inter-active chit-pull mechanics to simulate the sometimes chaotic nature of the 19th Century battlefield. GMT's Red Badge Of Courage and Gringo! Are the two most recent releases in this classic line of games.&#10;&#10;The Game:&#10;Dead of Winter II completely revisits this battle. The old version needed a face-lift. The biggest change is in returning the ground scale to 110 yards per hex.  While going to the larger scale means an increase in maps, the added elbow room allows for much more historical unit frontages and more playable stacking.&#10; One Introductory and ten regular scenarios examine every aspect of the historical battle and present the players with several plausible alternative situations based on events leading up to the actual engagement. Scenario sizes range from one-half of one map and an hour to play, to all four maps and many enjoyable gaming hours. Also included are a number of optional forces that could have plausibly been brought into the fight; Keep your opponent guessing as to what he will face next with this interesting range of options.&#10;&#10;The Team: &#10;While Richard Berg remains the final authority for all things GBACW, and John Alsen continues his invaluable role in the development of each title, Dead of Winter II adds one more well-known gaming name to the mix: Designer Dave Powell. Dave has designed more than a dozen civil war simulation games with The Gamers, Inc, (now owned by MMP.) Dave has always loved the GBACW since the moment he first opened the box for TSS, and welcomed the chance to bring his design talents and historical skills to the Dead of Winter project.&#10;&#10;&#10;Game Design: Dave Powell&#10;Series Design: Richard H. Berg&#10;Developer: John Alsen&#10;&#10;",
        "artist": "Charles Kibler,Kurz and Allison,Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "The Name of the Rose",
        "description": "In this deduction game, players are monks who are trying to collect as many suspicion points on the other players as possible in order to figure out who the criminal is.&#10;&#10;&#10; Game Summary&#10;The board shows several locations, each with 2 numbered (2-6) chits in one of 6 colors (the rest are face down in a line next to the board). There are 6 colored monk pieces, a Williams piece, and an Anson piece, all set up in different locations at the start. All monks start with 10 suspicion points and 5 clue points. Players are each randomly assigned one monk color (keep secret!). Each player receives 3 cards (which show either a monk, a location, or Williams/Anson).&#10;&#10;There are 7 rounds (days), each with 24 hours. Each day starts by revealing a random event tile in effect for that day. Then, players take turns playing cards: monk card = move that monk to a different location; location card = move any piece to that location; Williams/Anson card = move either of those pieces to any other location. Cards also have a number (0-5): add as many hours to the clock, unless you spend previously collected chits to reduce the number (by 1 per chit spent) -- spent chits added to the line of chits next to the board. If you move past 2400 hours, the day ends. Draw a card at the end of your turn.&#10;&#10;When a monk is moved to a location, if there is no piece of their color, increase their suspicion by the sum of (both) chits present. If there is, take that chit and reduce the monk's suspicion score by the number on that chit. If it was the last chit, add 2 chits from the line next to the board.&#10;&#10;If Williams moves to a location, add/subtract 3 from each of the clue scores for all monks present there. For Anson, it's +/- 5 suspicion points.&#10;&#10;When the day ends, that player takes the event tile (=2 clue points against their monk at end of game). Convert suspicion points to clue points by ranking most to least (5, 4, 3, 2, 1, 0 clue points); ties &quot;generous&quot;. Reset suspicion points to 10 for all monks.&#10;&#10;After days 1, 3, and 5 players reveal one color they are NOT.&#10;&#10;Day 7 is different: players simultaneously guess which monk other players were assigned. For every correct guess, that player's monk receives (substantial) additional clue points (number of points varies based on number of players).&#10;&#10;The player with the fewest clue points against their monk wins the game!&#10;&#10;",
        "artist": "Volkan Baga"
    },
    {
        "name": "Wiedeń 1683",
        "description": "Historical game about great Battle of Vienna that was the turning point in the wars between Otoman Empire and European Kingdoms. One of the player commands the Holy League (Poland-Lithuania, Austria, Saxony, Bavaria and Franconia) lead by King of Poland John III Sobieski. His task is to break the army of Ottoman Empire commanded by the second player which besieges the Vienna.&#10;&#10;Game uses the hex-and-counter mechanics which is less complex compared to other Dragon games. Scale is 600-1800 infantry man and 500-700 cavalry per counter.&#10;&#10;Related Microbadges&#10; Dragon fan&#10;&#10;",
        "artist": "Zbigniew Kasprzak,Jacek Mirczak"
    },
    {
        "name": "Fauna",
        "description": "360 animals on big cards are waiting for the players of Fauna. Every round a single animal presents itself by name and picture. The 2-6 players try to guess the animal's weight, length, height, tail length and - most important - the areas in which the animal lives on the Earth. The early bird gets the worm: an area on the big map or a sector on the scales already occupied by a player token cannot be chosen a second time. When no player wants to set another token the round ends and the scoring is performed. Tokens on correct spaces get points for the corresponding player, also tokens in the direct neighborhood of correct spaces score points. Tokens not earning points are temporarily out of the game - so risk should be carefully considered. Next round - next animal - starting player changes. The first player who reaches a certain total score wins (normally after 8-12 animals).&#10;&#10;",
        "artist": "Peter Braun,Alexander Jung,Volker Maas"
    },
    {
        "name": "Ra: The Dice Game",
        "description": "Ra - The Dice Game takes all the major thematic elements of &quot;Ra&quot; and uses them very creatively in a dice game. Pharaohs, The Nile, Civilizations, and Monuments as well as the occasional catastrophe are all here.&#10;&#10;Instead of auctions, the core mechanism of Ra, each player rolls 5 dice and can reroll any of them up to two times. The five dice have identical sides, but different colors - the die color matters in some occasions (eg. a player can't claim purple civilization square with a green die). Then, according to the roll, the player claims some squares on the central board (civilizations, monuments, Niles etc.) or moves the Ra figure, which determines the remaining time in Epoch. One die side is a joker and can be used as any other side, as long as one of the other dice actually shows the mentioned other side.&#10;Players need to consider how to utilize their roll for the best personal gain. Scoring takes place in three Epochs (with monuments only scored after the third) and is nearly identical as in the original Ra, but this time the score is kept on a score track on the edge of the board, instead of tokens.&#10;&#10;From the box: Remember Ra! Now Reiner has added dice to the game and in such a great way. Players still try to score by collecting Pharaohs, niles and floods, monuments and civilizations, but this time they roll dice and choose which to keep and which to re-roll. True to the original game, players must watch out for disasters and each of the three rounds ends when &quot;Ra&quot; shows up a set number of times, so players need to watch Ra and decide when the round may end and when they have more time. After three rounds, the player with the most points is the winner!&#10;&#10;Contents: 1 game board, 92 wooden cubes, 5 dice, 1 Ra figure, 4 summary cards, rules.&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Walk the Plank!",
        "description": "In Walk the Plank!, players represent the worst pirates in a captain's crew. The captain has rounded you all up because you're all lazy and stupid and simply not worth the rum and loot you get paid. That said, the captain has decided he's willing to keep two of you in his crew. To prove you're worthy, you will fight amongst yourselves, trying to shove other players' pirates off the end of the plank while keeping yours alive!&#10;&#10;In game terms, each round players secretly stack three of their ten action cards, then they take turns revealing and playing those actions one by one no matter what's gone wrong between the planning and the doing. If you plan to have a pirate shove someone off the plank on your third move and all he sees are his own best mates, he will still shove away! Some cards bear a skull on them, and these powerful cards must remain on the table the round after they're played, but otherwise players then pick up their action cards and start a new round. As soon as two or fewer pirates remain on board, the game ends and the owner (or owners) of these pirates win! Watch out, though, as sometimes every pirate will end up in the drink, which means that no one wins other than the sharks circling in the water below...&#10;&#10;",
        "artist": "Mike Groves"
    },
    {
        "name": "The Princess Bride: Storming the Castle",
        "description": "From publisher's site :&#10;&#10;Storming the Castle is a fantastic, fun new game based on the classic film, &quot;The Princess Bride.&quot; Fight man to man in sportsman like combat to beat your opponents to Humperdink's castle to rescue the fair Buttercup from marriage. Make your way through the Fire Swamp, the Ravine, and up the Cliffs of Insanity.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Aronda",
        "description": "On your turn, you place pieces in an area on the board. Areas of the board can be claimed by either placing enough pieces in them, or by claiming enough adjacent areas. This means that claiming an area can lead to claiming more areas, causing chain reactions to take potentially large areas of the board.&#10;&#10;Online Play&#10;&#10;     Yucata (turn-based)&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Jumbulaya",
        "description": "Each player works with five letter tiles on his/her tray and all the letters on the board, rearranging, adding, and trading them, building and claiming longer and longer words each turn. Simultaneously, as players build words horizontally, they also look for a JUMBULAYA. A JUMBULAYA is a seven-, eight-, or nine-tile word that can be spelled vertically on the board. Players will be able to strategize and plan multiple moves ahead to create longer and longer words. A player earns points for all lines he/she claims, bonus points for using &quot;letter-combo&quot; tiles, and even more points for being the first to find a JUMBULAYA. The player who earns the most points, wins!&#10;&#10;2008 Mensa Select&#10;2008 GAMES Magazine Word Game of the Year&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Mini Make 'N' Break",
        "description": "This is a compact/travel edition of Make 'n' Break.&#10;&#10;To save space, the blocks (8 instead of 10) are much smaller (about 4cm long) and the cards are printed with the diagrams of the buildings to construct on both sides.&#10;&#10;There is no timer, one of the other players rolls the die (3, 2, 1, blank, blank, blank) until the result is equal to or greater than 15.  Once this total is exceeded the current player's turn is over.  After 5 rounds the player with the most points wins.&#10;&#10;",
        "artist": "Kinetic"
    },
    {
        "name": "Tinners' Trail",
        "description": "Tinners' Trail is set in nineteenth century Cornwall. You are mining for copper and tin, attempting to sell when the prices are high. To reduce the cost of mining you can place developments, such as ports, adits, and trains. Once you have made your money you invest it in industries outside of Cornwall, which gains you victory points. The earlier you invest the better the return.&#10;&#10;Official web page&#10;&#10;Awards&#10;&#10;     2011 Ludoteca Ideale (Italy)&#10;&#10;&#10;&#10;&#10;",
        "artist": "Peter Dennis,Andreas Resch"
    },
    {
        "name": "Strozzi",
        "description": "Strozzi is based on choosing vessels from a deck of cards and then deciding if you want to use them to deliver their goods to a particular port. Each port takes one type of good. You have tokens to add speed, goods, or steal someone else's ship during the round. At the end of the round scores are tabulated based on fastest ship, most goods produced and most prestige.&#10;&#10;One of the Knizia Florentine auction games.&#10;&#10;",
        "artist": "Ryan Laukat,Franz Vohwinkel"
    },
    {
        "name": "Koe zoekt Boer",
        "description": "The different colored cows tend to be sad when their favourite farmer is not around. It's up to the players to make them happy again by providing the nicest hay, the sunniest weather and the prettiest stable. Finding a farmer (or a farmer's wife) to take care of your cows will make them even happier. Off course, at the same time, you should prevent the other players from doing exactly so.&#10;&#10;Each player receives three cow cards (double sided, different moods) and one stable. The remaining cow cards (double sided,  are mixed together with the action cards. Three of them are spread out. The rest of them forms the drawing pile.&#10;&#10;On your turn you may either take one of the face up cards or the top card of the drawing pile. If it is a cow card you put in in front of you (without changing it's mood). If it is an action card, you perform the action thereby changing the cows' moods, stealing cows from other players, placing cows inside/outside the stables, etc. As an alternative to drawing a card you may also discard one of the face up which becomes out of play.&#10;&#10;The game ends when the drawing pile is used up. The player with the most happy cows (after subtracting minus points for the sad cows) wins the game.&#10;&#10;Trivia: The author was loosely inspired by the reality tv show &quot;Boer zoekt vrouw&quot; (Farmer Wants A Wife) when designing this game.&#10;&#10;Home Page: http://www.koezoektboer.nl/&#10;&#10;",
        "artist": "Florine de With,Wesly Gibs,Yvon-Cheryl Scholten"
    },
    {
        "name": "Witchcraft",
        "description": "Witchcraft is a strategy game for two players with action taking place in ruined temple in a fantasy world. Each player leads an army which consists of ten wizards. Each of them can attack in different directions &ndash; eight directions are available &ndash; and some of them have special forms of magical attack.&#10;&#10;On his turn, a player decides which of his wizards will cast a spell, then resolves the attack. He can attack an enemy wizard or one of the four altars in the temple.  Each altar gives a unique power (movement, adding new piece of board, etc.). If player decides to cast a spell on an enemy wizard, he is overwhelmed by magic powers and from this moment on he starts to fight for this player.&#10;&#10;The aim of the game is to get all wizards fighting on your side or at least make an opponent be unable to cast a spell in his turn.&#10;&#10;",
        "artist": "Sławomir Maniak"
    },
    {
        "name": "Where There Is Discord: War in the South Atlantic",
        "description": "&quot;Where there is discord... may we bring harmony.&quot;  -- Margaret Thatcher, quoting a prayer ascribed to St. Francis of Assisi&#10;&#10;At 16.28 hours on the afternoon of Saturday, 1 May 1982, an AIM-9L Sidewinder missile fired from the Sea Harrier of Royal Naval Air Squadron Flight Lieutenant Paul Barton struck the Mirage III of Lieutenant Carlos Perona of Fuerza Aerea Argentina, destroying it on impact.  The Falkland/Malvinas War had begun in earnest.&#10;&#10;Over the next 45 days, the armed forces of the United Kingdom and Argentina locked in a deadly struggle, as both attempted to assert their right to govern a small, inhospitable South Atlantic island unknown to most of the world and to many of those fighting over her.&#10;&#10;    In this solitaire military simulation boardgame, you have the opportunity to recreate those fateful summer days, commanding the British Task Force as it attempts to defend itself from concerted attacks by Argentine air and naval forces, and mount a successful amphibious landing on the disputed islands.  You will have to manage and deploy the Royal Navy&rsquo;s limited Sea Harrier assets, coordinate the defence of the fleet with a wide range of vessels and weapons systems, and plan a landing strategy that enables you to consolidate a bridgehead before Argentine forces can respond.  Modeled closely on historical events, you will confront issues including variable rules of engagement, surveillance and intelligence gathering, submarine warfare, Argentine carrier and surface fleet operations, the Exocet missile threat, third-party operational support and interference, fleet logistics, supply interdiction, and uncooperative weather.  At the same time you will have to walk the tightrope of public opinion, deal with &ldquo;oversight&rdquo; from the politicians back in London, and overcome unforeseen events ranging from the sabotage of supply lines up to orders to take the fight to the mainland.&#10; Will the Falklands remain in British hands, or will the Malvinas return to Argentina?  Their fate is in your hands..&#10;&#10;",
        "artist": "George Bieda,Ugo Crisponi,Mark Mahaffey"
    },
    {
        "name": "Samurai: The Card Game",
        "description": "Samurai - the Card Game simulates the board game by placing cities on the board and then allowing each player to play one of their 5 cards from their hands. A city is considered surrounded when 4 cards surround the sides. A new city is placed when two different players cards create a location for it to be placed.&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Log Jam",
        "description": "From the manufacturer's website:&#10;&#10;The busy beaver has built a beautiful dam out of logs, but his pesky neighbors keep trying to snatch them away while he's not looking. Be careful when skillfully removing the logs, as the pile might suddenly cave in! When he falls, you'll hear the beaver chattering his annoyance. Who'll be able to collect the most logs unnoticed?&#10;&#10;Similar to:&#10;&#10;    Fire&#10;    Karamo&#10;&#10;&#10;&#10;&#10;",
        "artist": "Kinetic"
    },
    {
        "name": "Caesar XL",
        "description": "Caesar XL is another fine offering from veteran game designer Joe Miranda who transports its players back to the waning days of the Roman Republic as it is plunged into civil war. Julius Caesar stands poised on the banks of the Rubicon River that he must cross to win Rome, while opposing him stands Pompey Magnus (Pompey the Great) and the mighty forces loyal to him.&#10;&#10;In this great clash between rival factions, the Populares (those &ldquo;favored of the people&rdquo;) and Optimates (the &ldquo;best men&rdquo;) must find their champion and either preserve the Senate and Republic or call forth a Dictator to deal with Rome&rsquo;s pressing problems; perhaps making him king!&#10;&#10;Players can quickly master the games XL (&ldquo;40&rdquo;) cards and counters via the Bronze Rules and have their Legions and great Leaders contesting Rome&rsquo;s territories for ultimate domination before you can augur a chicken&rsquo;s entrails. Building upon that are the Silver Rules that every great conqueror should know before donning the purple and staging their triumph through the streets of Rome. Hail!&#10; &#10;     One 4-page, color 'Bronze' level instructions booklet&#10;     One 1-page sheet of 'Silver' level rules&#10;     40 color, die-cut 5/8&rdquo; square mounted game pieces&#10;     28 color, die-cut 5/8&rdquo; round mounted game pieces&#10;     40 SPQR cards&#10;     One 11&rdquo; x 17&rdquo; color game map&#10;     Each unit is 1 Legion (5-10,000 troops) or 1 Leader, and each turn is roughly 6 months.&#10;     Complexity: 3 &#10;     Solitaire Suitability: 4&#10;&#10;&#10; Buy Microbadge&#10;&#10;Expanded by:&#10;&#10;     Caesar XL Gold Expansion Kit&#10;&#10;&#10;&#10;&#10;",
        "artist": "Tim Allen"
    },
    {
        "name": "Eye Know",
        "description": "Eye Know is a visual trivia betting game. At the start of the game, a number of cards are laid out on the game board. On a turn, you choose one of the cards and identify the image on it. (This isn't the hard part, but rather a precursor of what's to come.) If you correctly identify the image, you can then bid some amount of poker chips to answer a trivia question relating to the object named on the card, or you can auction off the right to answer a trivia question. Questions come in three varieties &mdash; true/false, multiple choice, and open ended &mdash; and the payouts are higher for the tougher questions: 1:1, 2:1 and 3:1. Answer correctly, and you collect more chips as well as the card; collecting sets of cards gives you bonus points, and the player with the most points wins.&#10;&#10;",
        "artist": "Connor Reid"
    },
    {
        "name": "Bastogne: Screaming Eagles under Siege",
        "description": "Bastogne: Screaming Eagles Under Seige,18-27 Dec '44,  is the thirteenth game is the Standard Combat Series.  This game covers the defense of the little crossroads town of Bastogne from 18 December to 26 December 1944. It is not a game about the whole Ardennes Offensive, but rather a close-up look at the actual perimeter battle to protect the town and the mechanized delaying actions leading into it. The map only extends as far east as Longvilly and north to Noville at 400m per hex. Each turn is a day, units are generally companies.&#10;&#10;Bastogne comes with special rules for road marching, Team SNAFU, barrages, and air strikes - but is built around a quick-to-play, simple-to-learn framework. Bastogne has three scenarios: an introductory scenario covering the Battle for Noville, a medium-sized one covering the Battle for Longvilly, and the withdrawal of Team Cherry plus the counterattack by the 501st Airborne Regiment, and the campaign game itself covering the whole action in a jam-packed 10 turns. A number of variants have been provided so you can experience the game over and over looking at fresh insights.&#10;&#10;Game Scale:&#10;Game Turn: One day&#10;Hex: 400 meters&#10;Units: Platoon to Battalion&#10;&#10;Contents:&#10;&#10;    One 22&quot;x34&quot; map&#10;    One countersheet (280 1/2&quot; counters)&#10;    Standard Combat Series Rulebook&#10;    Bastogne Specific Rulebook&#10;    American and German full-color player aid cards&#10;    Two Dice&#10;&#10;&#10;&#10;&#10;Players: 2 (suitable for solitaire play)&#10;Playing Time: 4+ hours&#10;Complexity: Low&#10;Solitaire Suitability: High&#10;&#10;",
        "artist": "Nicolás Eskubi,Dean Essig"
    },
    {
        "name": "Arktia",
        "description": "On the distant ice moon Arktia a research station is build. Players try to build or move their residential or research modules, called 'Muglus' (small towers of rings, discs and stones), to control a maximum of tiles. But beware; muglus, which are cut off from their main settlement, are lost, and ground tiles can &quot;melt&quot; and disappear due to global warming.&#10;&#10;",
        "artist": "Urs Lehmann"
    },
    {
        "name": "Le Havre",
        "description": "In Le Havre, a player's turn consists of two parts: First, distribute newly supplied goods onto the offer spaces; then take an action. As an action, players may choose either to take all goods of one type from an offer space or to use one of the available buildings. Building actions allow players to upgrade goods, sell them or use them to build their own buildings and ships. Buildings are both an investment opportunity and a revenue stream, as players must pay an entry fee to use buildings that they do not own. Ships, on the other hand, are primarily used to provide the food that is needed to feed the workers.&#10;&#10;After every seven turns, the round ends: players' cattle and grain may multiply through a Harvest, and players must feed their workers. After a fixed number of rounds, each player may carry out one final action, and then the game ends. Players add the value of their buildings and ships to their cash reserves. The player who has amassed the largest fortune is the winner.&#10;&#10;",
        "artist": "Klemens Franz"
    },
    {
        "name": "Carpe Astra",
        "description": "10,000 years in the future, humanity has claimed the stars. But all is not well. The Emperor is weak, and without strong guidance, the Empire is crumbling. Powerful guilds within the empire are squabbling, positioning themselves for their own gain. If the Empire is to survive, it needs a strong leader - that means you! You must build a power base throughout the Empire by connecting with important guilds: the military, traders, priests, engineers, expansionists, and politicians and then claim the throne. Time is running out, though; others also struggle for the throne. You must form a network of support with powerful guilds and slander your opponents. Each connection gains the support of some guilds, and at the end of the game the player with the most support grasps the Galactic Throne. Take advantage of events that occur for further gain. Be careful, though, because each slander you receive reduces your support.&#10;&#10;The name &quot;Carpe Astra&quot; was chosen after Jackson Pope asked the users of BGG to brainstorm a name for the game.&#10;&#10;",
        "artist": "R. H. Aidley"
    },
    {
        "name": "Sylla",
        "description": "Sylla was the name of a Roman Consul and dictator; the name of the game is a reference to his person. The designer tried to bring together &quot;Res Publica Romana&quot; and &quot;Saint Petersburg,&quot; furthermore playable in one hour.&#10;&#10;The players will try to become the premier Consul of Rome. Each of the five years (turns) is subdivided into seven phases in which the players take their actions. It will be semi-cooperative as one player alone cannot influence all parts of the Roman social or political life. They also have to prepare for negative events like epidemic plague or persecution of the Christians and also decadence.&#10;&#10;The Ystari games website has downloadable rules for the game for 2 players.&#10;&#10;",
        "artist": "Arnaud Demaegd"
    },
    {
        "name": "Climb!",
        "description": "Players must climb a route made of cards. They get points for each move they make. The more fingers there are in &quot;holds&quot; (holes on cards) at the end of a move, the more they get points. Performing complex manoeuvres is the key, since each hold is bordered by a color. One finger can only go in one color! Beware, if the cards move, your turn ends.&#10;&#10;The route is changed a little bit between each round.&#10;&#10;The player with most points after 3 rounds wins.&#10;&#10;",
        "artist": "Stéphane Crépeau,Le Mille-Pattes"
    },
    {
        "name": "Lungarno",
        "description": "A game of Merchants and Builders in Old Pisa&#10;In Pisa during the fourteenth century gold rules over all. The great families of the city are the route to success, wealth, and power. Merchant houses compete to make deals with the great families and earn the greatest profits. Meanwhile, master builders erect splendid palaces, marvelous tower houses, beautiful plazas, and fabulous shops, hoping to impress the great families and earn prestige. The center of this quest for wealth and prestige is the Lungarno district, along the banks of the River Arno. Can you overcome your rivals to dominate the Lungarno and become the richest merchant in Pisa?&#10;&#10;Overview:&#10;Using tiles, you will build the various districts of Lungarno, sending your merchants to trade with the four great families (represented by shields of different colors). When a district is complete, you will earn profits for your merchants, based on the prestige of the families in that district.&#10;At the end of the game, the player with the most gold is the winner!&#10;&#10;Components:&#10;&#10;     13 Special board pieces&#10;     65 Building tiles&#10;     55 Florin coins (20 yellow - worth 5 and 35 Grey)&#10;     25 Merchants (5 of each color)&#10;     12 Privilege tokens&#10;     Rulebook&#10;&#10;&#10;&#10;&#10;Expanded by:&#10;&#10;&#10;     Lungarno: Luminara&#10;&#10;&#10;",
        "artist": "Studio Mattigatti"
    },
    {
        "name": "Wild Vikings",
        "description": "From the rules:&#10;&quot;Loaded down with jewels and other precious stones that sparkle and twinkle, the Vikings have just got back from their latest foray. Under a cheering hubbub they unpack the treasure booty and start distributing it. Vikings, keep cool! Don't reach out for your divvy too quickly. Perhaps if you wait, the more precious pieces will arrive on a later ship!?&#10;&#10;Aim of the game is to be the player with the most jewels at the end of the game. The players collect equipment cards and as soon as a Viking ship returns from a foray to the village the treasure load is distributed. Whoever has the most suitable equipment cards, and can bid correctly, will win all the jewels from ship's treasure. But watch out, don't display too many cards or be too greedy!&quot;&#10;&#10;",
        "artist": "Michael Menzel"
    },
    {
        "name": "A Touch of Evil: The Supernatural Game",
        "description": "'Tis the dawn of the 19th century; an age of science, superstition, and witchcraft.  &#10;Howling fills the night as a full moon rises over the small, secluded village of Shadowbrook.  &#10;Gruesome murders have become a daily occurrence and terror haunts the streets at night.  An evil creature has taken up residence here and the countryside is engulfed by a tide of darkness.  &#10;But all is not lost&hellip;not yet.&#10;A small group of heroic individuals, with the courage and strength to fight, have arrived in town.  Some just passing through while others have come with a purpose; but all will be put to the test as they race to save this cursed town from falling into darkness.  &#10;It will take a cunning mind and strength of spirit to determine who is friend and who is foe&hellip; to solve the mysteries and hunt the beast to its lair.   &#10;But the secrets of Shadowbrook run deep. Gossip and rumors run rampant and these few Heroes may soon discover that they are outsiders here and this town is already so rotten from within there is little left to save.&#10;     &#10;&quot;A Touch of Evil, The Supernatural Game&quot; is a fast-paced game of fiendish creatures, dashing Heroes, and high-adventure.  &#10;Each player takes on the role of a unique monster-hunting Hero, racing against time to stop the forces of darkness from claiming another foothold in the world of man. Only by investigating the town and building your Hero&rsquo;s strength can you hope to hunt down the Supernatural Villain to his Lair and defeat him in an epic Showdown.  Players can race Competitively to be the first to defeat the Villain and save the town, or they can work together Cooperatively to defeat a much stronger Villain.&#10;&#10;Featuring a gameboard map of Shadowbrook and its surrounding countryside, eight Heroes to choose from, and four different Supernatural Villains to hunt; each with its own host of unique Minions and powers to drastically change the game.  &#10;A Touch of Evil is designed to create an adventurous cinematic feel as the story and game unfolds.&#10;&#10;So grab up your Wooden Stake, stuff some shot in that Musket, and hold onto your Tri-corn Hat; no one is safe from the creatures of the night and no one can be trusted&hellip;for inside everyone lies A Touch of Evil.&#10;&#10;&quot;Expanded by:&quot;&#10;&#10;    &#226;&#128;&#152;Something Wicked&#226;&#128;&#153; Game Expansion&#10;    A Touch of Evil: Hero Pack One&#10;    A Touch of Evil: Hero Pack 2&#10;    &#226;&#128;&#152;The Madness&#226;&#128;&#153; Game Supplement&#10;    'The Allies' Game Supplement&#10;    Delion Dryad Villain&#10;    Special Edition Soundtrack&#10;    Volgovian Nutcracker Villain&#10;    The Shadow Witch Villain&#10;    'The Coast' Game Expansion&#10;    Krampus Villain&#10;&#10;&#10;&#10;&#10;Home Page: http://www.flyingfrog.net/atouchofevil/&#10;&#10;",
        "artist": "Gaël Goumon,Jason C. Hill,Jack Scott Hill,James Ma,Matthew Morgaine"
    },
    {
        "name": "Auf die Schätze, fertig, los!",
        "description": "The object of the game is to obtain the most treasures. Treasures are awarded by completing tasks. Each turn the player turns over the hour glass, then turns over the first treasure card. Depending on the card, various tasks must be performed before the time runs out; pantomiming animals, matching cards, grabbing for specific animals...&#10;&#10;If the players wish to push their luck, they can turn over yet another treasure card and attempt to complete another task. If, however, time runs out, the players lose all of the accumulated treasure cards. They can stop after completing a card and retain the current round of treasures they've collected.&#10;&#10;",
        "artist": "Ulrike Fischer"
    },
    {
        "name": "Cannonball Colony",
        "description": "Settle a deserted island and cannonball your rivals!&#10;&#10;It is the golden age of colonialism and a beautiful deserted island has just been discovered. Unfortunately, ships from different countries have arrived at the same time to claim it!&#10;&#10;You take the role of one of these countries in the fight for supremacy on the island. Build a strategic network of roads and forts to extend your influence. Set up cannons in the right positions to blow away your opponents. The player with the most forts standing at the end of the game wins the island for his country!&#10;&#10;",
        "artist": "Phil Walker-Harding"
    },
    {
        "name": "Day & Night",
        "description": "Day &amp; Night is a strategic board game where two players duel with asymmetric decks. The many spells and strategies make every game different than the other and exciting until the very last turn. Day &amp; Night is beautifully illustrated with over 40 illustrations, specially created for this game by fantasy artist Eerin Vink.&#10;&#10;Plan your actions and anticipate on the actions of your opponent; combine spells, use them at the right time and make sure your pawn is located at the right place on the board. Day &amp; Night is a challenge for everyone who likes strategic board games!&#10;&#10;In Day &amp; Night, two players duel as Lady Day and Lady Night. The board has 44 squares which can be filled with tiles of either Day or Night. By getting enough of your tiles next to each other, you can build a temple. You win the game when you've built two temples.&#10;&#10;Tiles are placed by playing cards (Spells and Miracles) from your deck (Book of Spells). Both players have different deck with a different theme (&quot;Mystify&quot; for Lady Day and &quot;Crystallize&quot; for Lady Night). The deck have different abilities, and the both characters have their own style of play.&#10;&#10;",
        "artist": "Eerin Vink"
    },
    {
        "name": "Beim Jupiter: Göttliche Sticheleien",
        "description": "In this game, it is not the one who receives the most cards who will win, but the one who organizes his cards in the best way so that he/she can play them both tactically and cleverly. Before every turn, the playing conditions for that hand - esp. regarding the trump - is decided by all players.&#10;&#10;",
        "artist": "Michaela Kienle"
    },
    {
        "name": "duck! duck! Go!",
        "description": "Bathtub rubber ducky racing has long been a popular sport. Every year rubber duckies from all walks of life train in bathtubs, spas and small ponds around the world to prepare for the annual Kenducky Derby, the premier bathtub ducky race.&#10;&#10;duck! duck! GO! comes with 6 REAL rubber duckies, and a rubber bird dog. There are over 100 duckies in the set - which ones will YOU get?&#10;&#10;Each round, choose a movement card from your hand. When it is your turn, race your ducky according to the directions on the card.&#10;&#10;Be the first ducky to touch all the buoys and get back to the finish drain to win!&#10;&#10;NOTE: The current, in-print edition plays up to four, and comes with four ducks in the box. The first edition played up to six, and came with the same.&#10;&#10;",
        "artist": "Carolyn Dew,Jeremy Kupsch"
    },
    {
        "name": "Dominion",
        "description": "(from the back of the box:)&#10;&#10;&quot;You are a monarch, like your parents before you, a ruler of a small pleasant kingdom of rivers and evergreens. Unlike your parents, however, you have hopes and dreams! You want a bigger and more pleasant kingdom, with more rivers and a wider variety of trees. You want a Dominion! In all directions lie fiefs, freeholds, and feodums. All are small bits of land, controlled by petty lords and verging on anarchy. You will bring civilization to these people, uniting them under your banner.&#10;&#10;But wait! It must be something in the air; several other monarchs have had the exact same idea. You must race to get as much of the unclaimed land as possible, fending them off along the way. To do this you will hire minions, construct buildings, spruce up your castle, and fill the coffers of your treasury. Your parents wouldn't be proud, but your grandparents, on your mother's side, would be delighted.&quot;&#10;&#10;&#10;In Dominion, each player starts with an identical, very small deck of cards.  In the center of the table is a selection of other cards the players can &quot;buy&quot; as they can afford them.  Through their selection of cards to buy, and how they play their hands as they draw them, the players construct their deck on the fly, striving for the most efficient path to the precious victory points by game end.&#10;&#10;Dominion is not a CCG, but the play of the game is similar to the construction and play of a CCG deck. The game comes with 500 cards. You select 10 of the 25 Kingdom card types to include in any given play&mdash;leading to immense variety.&#10;&#10;&#10;Part of the Dominion series.&#10;&#10;Integrates with:&#10;&#10;    Dominion: Intrigue&#10;&#10;&#10;&#10;&#10;",
        "artist": "Matthias Catrein,Julien Delval,Tomasz Jedruszek,Ryan Laukat,Harald Lieske,Michael Menzel,Marcel-André Casasola Merkle,Claus Stephan,Christof Tisch"
    },
    {
        "name": "Toboggans of Doom",
        "description": "The feel of the wind on your face, the sight of the finish line just over the next snow bank&hellip;and the elation of rocket-jumping over evil trees while being chased by a phalanx of chainsaw-wielding snowmen! It&rsquo;s the wild challenge of extreme downhill sledding against a hill of crazy, zany, fun obstacles in Toboggans of Doom!&#10;&#10;Compete to acquire the coolest, most effective upgrades to survive the various obstacles that cover the hill. Can you use gadget legs to get over your ex-girlfriend? Will you power up for orbital re-entry to plow through the Viking Opera? Will the other players laugh as they fly over your broken toboggan&hellip;only to fall into a volcanic fissure?&#10;&#10;Toboggans of Doom has a unique bidding system where each player uses a collection of dice to bid on different upgrades. Designed for fantastic two person play, up to four players can join in just by adding additional dice to the game, beautifully illustrated by CCG artist Jason Engle. Toboggans of Doom plays simple and fast, with three rounds of building toboggans, hurtling down the hill, and sledding for your life!&#10;&#10;",
        "artist": "Zannah Aensland,Jason Engle,Dan Tibbles"
    },
    {
        "name": "Rorschach",
        "description": "Play personality detective as you unravel the inner workings of your friends&rsquo; minds.  They have secrets, and so do you.  Maybe there&rsquo;s a maverick inside you; can your friends predict what you will do?  Or will you keep them guessing while you expose their inner selves to the world?&#10;&#10;In every round of Rorschach, each player picks an inkblot that answers a question asked on a card.  To win the game, you must pick the same inkblot as each other player at least once, and you must be the only one to pick an inkblot at least once. Can you figure out whether the other players are giving honest answers?  Or are they trying to pick the same inkblot they think you will choose?  Can you throw them off your scent so as to make a unique selection for an extra point? Subterfuge abounds in this game of skill, timing, and intrigue.&#10;&#10;Rorschach contains 100 new and unique inkblot cards that are large, widely varied, and graphically stunning. The question deck covers a broad range of topics, keeping play fresh every time. One expansion is planned for the game, adding an even larger selection of questions and blots, and additional questions and inkblots will be available to print from www.bucephalus.biz.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Duke",
        "description": "Levy. Maneuver. Conquer.&#10;&#10;The Duke is a dynamic, tile-based strategy game with an old-world, feudal theme, high-quality wooden playing pieces, and an innovative game mechanism in its double-sided tiles. Each side represents a different posture &ndash; often considered to be defensive or offensive &ndash; and demonstrates exactly what the piece can do within the turn. At the end of a move (or after the use of a special ability), the tile is flipped to its other side, displaying a new offensive or defensive posture.&#10;&#10;Each posture conveys different options for maneuver and attack. The full circle is a standard Move, the hollow circle the Jump, the arrow provides for the Slide, the star a special Strike ability and so on. Each turn a player may select any tile to maneuver, attempting to defend his own troops while positioning himself to capture his opponent's tiles. If you end your movement in a square occupied by an opponent's tile, you capture that tile. Capture your opponent's Duke to win!&#10;&#10;Players start the game by placing their Duke in one of the two middle squares on their side of the game board. Two Footman are then placed next to the Duke. Each turn a player may choose to either move a single tile or randomly draw a new tile from the bag. With fifteen different Troop Tiles, all double-sided, and nineteen total pieces for each player (plus special optional tiles), the variety of game play is limitless.&#10;&#10;Beyond the endless variety of the basic game, Terrain Tiles introduce a variety of game play options, altering the game board. These rules also include several alternate objectives, such as the challenging Dark Rider game which pits five Pikeman against a lone Knight.&#10;&#10;",
        "artist": "Matt Heerdt"
    },
    {
        "name": "Living Labyrinth",
        "description": "Living Labyrinth is a light-hearted race through an ever-changing maze of garden tiles. Players hurry to be the first to reach their goal, all the while moving pathways, changing the maze, and even moving the victory goals. Should you race ahead at full speed? Or spend precious time cutting off your opponents? Only one player will succeed and escape the Living Labyrinth!&#10;&#10;Rules are simple, and the game can be enjoyed by both kids and families. The action cards give players a handful of simple tactical options, but playing them in the right order on the right tiles requires some challenging decisions. The double-sided tiles ensure that the maze is never the same twice - don't expect the same plan to work in every game, because the ground under your feet is ever-changing!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Timestreams: Deck 1 – Stone Age vs. Future Tech",
        "description": "This multiplayer time-travel card game has players assign inventions to different time periods and then score points for appropriate combos and matching the correct eras for those inventions. The first pair of decks are Stone Age and Future Tech, and contain over 120 unique pieces of original art.&#10;&#10;First part of the Timestreams series.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Israeli Independence",
        "description": "From the Publisher:&#10;&#10;Israeli Independence is an introductory level solitaire wargame that tells the rich and engaging story of the First Arab-Israeli War &ndash; Israel&rsquo;s War for Independence. Five Arab armies, poised at the borders of the newly declared state, launch their determined invasions &ndash; and each must be pushed back in turn before any reaches West Jerusalem, the new Israeli capital.&#10;&#10;As the headlines unfold and the vast forces of the Arab League relentlessly press forward, can you successfully allocate the precious few resources of the new Israeli Defense Force (IDF) to conduct daring offensives that will send them reeling back? Can you push the Arab legions back so far that an armistice can be achieved and these threats removed? Or will you be over-whelmed and defeated, seeing Zionist aspirations crushed?&#10;&#10;Wargames recreate situations so that they can be studied and played, and Israeli Independence is particularly well suited to classroom use. The included BATTLESSON (TM) article helps explain this useful and fascinating field of study: wargaming.&#10;&#10;Expanded by: &#10;&#10;    Israeli Independence Expansion Kit&#10;&#10;&#10;&#10;&#10;",
        "artist": "Vince DeNardo"
    },
    {
        "name": "No Question of Surrender",
        "description": "No Question of Surrender: The Battle for Bir Hacheim&#10;&#10;The Grand Tactical Series moves to North Africa! Taking the acclaimed system used in The Devil&rsquo;s Cauldron, this game gives players the chance to explore the struggle of the free French forces, including two Foreign Legion battalions, as they attempt to hold out against the might of Rommel&rsquo;s Panzerarmee Afrika at the southern tip of the Gazala line in an abandoned Turkish fort.&#10;&#10;Three times the French were asked to surrender, each time they refused, with General Koenig stating that there was &ldquo;no question of surrender&rdquo;.&#10;&#10;No Question of Surrender is the first game in the Grand Tactical Series of company-level games offered by Multi-Man Publishing to examine the North African campaign. The game will also introduce new terrain types to the system and new special rules to cover events from the battle.&#10;&#10;The Free French, composed of &ldquo;Gaullists, swashbucklers and criminals of twenty different nations&rdquo; according to Rommel&rsquo;s aide Alfred Berndt, have to hold out against the Germans and Italians as Rommel adds more and more strength to try and crack the Gro&szlig;st&uuml;zpunkt (major strong point).&#10;&#10;Scenarios will include:&#10;&#10;     The historical attack by the Italian Ariete Division on the morning of May 27, 1942&#10;     An attack by the full Ariete Division on May 27 (to allow players to explore if the Italians could have captured Bir Hacheim)&#10;     The fight over point 186 where the Germans briefly capture the pivotal observation point, only the be repulsed by the Free French&#10;     And finally, the full siege starting on June 2 as the Free French try to hold out against ever increasing Italian and German forces.&#10;&#10;&#10;&#10;&#10;Taking the same level of care and detail that was observed in The Devil&rsquo;s Cauldron, No Question of Surrender continues the excellence in gaming expected from the Grand Tactical Series.&#10;&#10;Game Scale:&#10;Turn: 2 hours&#10;Hex: 364 yards / 333 meters &#10;Units: Company&#10;&#10;Game Inventory:&#10;One 22&quot; X 34&quot; mapsheet&#10;Three countersheets (528 5/8&quot; dual-sided counters)&#10;One 36 page Grand Tactical Series rulebook&#10;One 20 page game rulebook&#10;One 8 page series rules summary booklet&#10;Four Division Tracking Player Aid Cards (1 sided)&#10;Two Player Aid Cards (1 sided)&#10;Four 10 sided dice&#10;&#10;No Question of Surrender Credits:&#10;&#10;     Designer: Nick Richardson&#10;     Developer: Adam Starkweather&#10;     Graphics: Niko Eskubi&#10;&#10;&#10;&#10;&#10;",
        "artist": "Nicolás Eskubi,Steve Paschal"
    },
    {
        "name": "Where Eagles Dare",
        "description": "Where Eagles Dare: The Battle for Hell&rsquo;s Highway is the sequel to The Devil's Cauldron: The Battles for Arnhem and Nijmegen, and completes the Market Garden saga, allowing players to play out the entire operation.&#10;&#10;In addition, Where Eagles Dare is also a complete standalone game, offering a fascinating game situation in which the outnumbered elite 101st Airborne division must race from emergency to emergency - to maintain the vital lifeline to the British 1st Airborne Division fighting for its life in Arnhem.  This single and fragile lifeline would come to be called &ldquo;Hell&rsquo;s Highway&rdquo;.&#10;&#10;Where Eagles Dare is the next game in the Grand Tactical Series of company level games offered by Multi-Man Publishing. The game will also introduce new terrain types and new special rules to fully explore the battle.  Where Eagles Dare will introduce a special off-map movement system to allow the Germans to move forces from sector to sector of the battlefield and a host of other rules to make this game as unique and interesting as The Devil&rsquo;s Cauldron.&#10;&#10;Scenarios will include the following famous historical actions:&#10;&#10;&#10;     The Breakout from Joe&rsquo;s Bridge&#10;     The capture of Aalst and Eindhoven&#10;     The Battle of Best&#10;     The battles of Veghel&#10;     The preemptive American attacks at Heeswijk and Schijndel&#10;     4 versions of the grand campaign game&#10;     Fully linkable rules to The Devil&rsquo;s Cauldron to allow players to play all of Market Garden&#10;&#10;&#10;All the attention to detail and the same graphic style that has earned The Devil&rsquo;s Cauldron much praise within the wargame community will also be seen in full force in Where Eagles Dare.  From the unknown Dutch farmer that misdirected the advance of powerful Panther tanks on the Son Bridge and may have saved the entire operation to the German air raid on Eindhoven that stalled the advance up Hell&rsquo;s Highway during a crucial moment in the fighting, Where Eagles Dare will feature many little- known tidbits of history that made this battle so unique.&#10;&#10;Included in the countersheets are 18 errata &amp; 63 campaign counters for The Devil's Cauldron: The Battles for Arnhem and Nijmegen&#10;&#10;Game Scale:&#10;Game Turn: 2 hours daylight, 8-12 hours nighttime&#10;Hex: 547 yards / 500 meters&#10;Units: Company&#10;&#10;Game Inventory:&#10;Five 23.5&quot; x 35.5&quot; full-color mapsheets&#10;Eleven dual-side printed countersheets (1936 5/8&quot; counters)&#10;One 36-page GTS version 1.1 system rulebook&#10;One 8-page GTS Rules Summary booklet&#10;One 48-page Where Eagles Dare game specific rulebook&#10;One Turn Record Chart player air card (single-side printed)&#10;Two Terrain Effects Chart/Combat Results Table player air cards (dual-side printed)&#10;Six Divisional Unit Display cards (single-side printed)&#10;Four 10-sided dice&#10;&#10;Solitaire Playability: Medium&#10;Complexity Level: Medium&#10;Players: 2 or more&#10;Playing Time: 2-40 hours&#10;&#10;",
        "artist": "Nicolás Eskubi,Steve Paschal"
    },
    {
        "name": "Down in Flames: Aces High",
        "description": "From the Publisher's Website:&#10;&#10;Down In Flames is our tactical air combat card game. It was first released back in the mid 1990&rsquo;s and was again released as a computer game through Battlefront in 2004. Brian Marrs did all the programming for the computer game.&#10;&#10;Down In Flames places each player in the cockpit of a Leader and Wingman as they enter combat against other aircraft. By playing cards, you gain advantageous positions on your targets, fire your guns, and send them down in flames!&#10;&#10;The game is based on a unique action-reaction card mechanic. Each card can be countered by specific other cards. At the bottom of every card is the list of cards it is allowed to cancel. This makes for exciting card play back and forth between players&hellip;&#10;&#10;Player #1: &ldquo;I Play an In My Sights for 3 Hits. If you don&rsquo;t stop it, you&rsquo;re going down.&rdquo; Player #2: &ldquo;I counter with a Barrel Roll.&rdquo; Player #1: &ldquo;I react with a Yo-Yo.&rdquo; Player #2: &ldquo;You got me.&rdquo;&#10;&#10;Each aircraft is accurately simulated with a several ratings including: Performance (the maximum cards you can hold), Horsepower (the maximum cards you can draw each turn), Bursts (how many times you can fire), Damage (how much damage your attacks inflict), and Airframe (how much damage your aircraft can sustain).&#10;&#10;The air combat is simulated using a Positioning system that allows aircraft to be Advantaged, Tailing, Disadvantaged, or Tailed in relation to other aircraft. An aircraft&rsquo;s position determine if it can aircraft, and how many bonus Bursts it receives if it is Advantaged or Tailing.&#10;&#10;The game uses a simple Altitude system to add this vital aspect of air combat. Aircraft get to draw cards when diving, and must discard cards when climbing.&#10;&#10;The game also includes Light, Medium, and Heavy Bombers that are used in the historical campaign games.&#10;&#10;Down In Flames has won several awards through the years and continues to be a favorite for both serious and casual gamers.&#10;&#10;Components&#10;110 Full color Action Cards&#10;110 Full Color Aircraft Cards&#10;Full Color Rulebook&#10;Full Color Counter Sheet (88 - 5/8&rdquo; counters)&#10;6 Full Color Campaign Sheets&#10;&#10;DiF: Aces High is part of the Down in Flames series.&#10;&#10;",
        "artist": "William Arance"
    },
    {
        "name": "Monty Python Fluxx",
        "description": "Monty Python themed version of Fluxx. The random and chaotic nature of the Fluxx engine makes it a perfect vehicle for the crazy world of Monty Python!&#10;&#10;At the start of the game, each player holds three cards and on a turn a player draws one card, then plays one card. By playing cards, you can put new rules into play that change numerous aspects of the game: how many cards to draw or play, how many cards you can hold in hand or keep on the table in front of you, and (most importantly) how to win the game.&#10;&#10;The card mix focuses on Holy Grail with other references added from Flying Circus and other Python material. For example, one win condition card might require you have to have the Knights who Say Ni and a Shrubbery card face up in front of you.&#10;&#10;Part of the Fluxx series.&#10;&#10;",
        "artist": "Todd Hamilton"
    },
    {
        "name": "Dust Tactics",
        "description": "The year is 1947. Throughout the world, three major superpowers fight to claim exclusive control over a revolutionary source of power: Vk. Elite troops and massive combat robots wage violent battles to control these energy reservoirs...&#10;&#10;Dust Tactics is a tactical miniatures board game for 2-4 players. In an alternate 1940s reality, alien technology fuels gigantic machines of war as the forces of the Axis and Allies clash over rare mineral deposits that could inevitably decide the outcome of the war. With over 30 highly detailed miniatures, nine double-sided terrain boards, 12 custom dice, unit cards, terrain, and plastic scenery, Dust Tactics delivers everything you need to wage battles in the immersive world of Dust.&#10;&#10;A deep and engaging game setting, featuring stunning artwork by Paolo Parente, will draw players into a world desperately at war... and the highly detailed miniatures only add to this immersion. Eight included scenarios and nearly limitless customization ensures hundreds of hours of replayability, while scalable rules offer a satisfying experience for players of all levels.&#10;&#10;&bull; Over 30 highly detailed miniatures&#10;&bull; Nine double-sided boards to customize your own battle&#10;&bull; A deep and engaging setting&#10;&bull; A battle book including eight unique scenarios&#10;&bull; Quick-start rules to get into the action quickly&#10;&#10;",
        "artist": "David Kidd,Karl Kopinski,Paolo Parente"
    },
    {
        "name": "The Napoleonic Wars (Second Edition)",
        "description": "From GMT Games:&#10;&#10;&quot;The Napoleonic Wars, 1805 - 1815, brings you a fast-paced, tension-filled, card-driven wargame using a point-to-point movement system that pushes the envelope in a new direction for this pivotal period of history. Having a simple-to-learn strategic system and short rulebook, The Napoleonic Wars, can be played in an evening as the cards and Diplomatic Track make for tough decision-making in the face of everchanging enemy threats.&#10;&#10;Set in 1805 Europe, you must weigh the strategic dilemmas facing the two alliances in mortal conflict. Napoleon's France enjoys a superb army, central position, superior leadership, and a useful, if not powerful, ally in Spain. However, she faces three foes.&#10;&#10;Napoleon must beware of Britain's seapower and wealth, Austria's threatening position, and Russia's reinforcing hordes. In the wings, Prussia, Turkey, and Sweden teeter on the brink of war, begging inducements to join either side. Even lowly Denmark's fleet can upset the balance of power.&#10;&#10;When fleets or armies collide, battle-related cards may be played and then dice are rolled to resolve the battle and inflict casualties. Even the most brilliant maneuver faces the chance of floundering. So play The Napoleonic Wars now, and put the strategist in you to the test. Your options are only limited by your vision, a meddlesome enemy's cards, and the hand of fate.&quot;&#10;&#10;Expanded by:&#10;&#10;     Napoleonic Wars: Super Deluxe Map&#10;&#10;&#10;&#10;&#10;Re-implements:&#10;&#10;     The Napoleonic Wars&#10;&#10;&#10;&#10;&#10;",
        "artist": "Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "The Guns of Gettysburg",
        "description": "The Guns of Gettysburg is a simulation of the largest battle of the American Civil War. Like Bowen Simmons's previous games, Bonaparte at Marengo and Napoleon's Triumph, The Guns of Gettysburg uses a diceless and cardless system for governing movement and resolving combat. Units in the game are represented by linear blocks rather than the traditional hex and counters, giving the game an appearance that evokes 19th-century battlemaps.&#10;&#10;The Guns of Gettysburg has simple rules and fast play but still reflects the historical limitations of the actual conflict. Though it preserves the aesthetics and &quot;fog of war&quot; mechanisms of Bonaparte at Marengo and Napoleon's Triumph, The Guns of Gettysburg is neither a sequel nor a successor to either game but a wholly new system of its own.&#10;&#10;",
        "artist": "Michael Christopher,Bowen Simmons"
    },
    {
        "name": "Goblin Slayer",
        "description": "Description from the rules file:&#10;&#10;Goblin Slayer is a quick and easy to play fantasy boardgame of underground combat for two players.&#10;&#10;One player controls the evil denizens of Snarlsbad Cavern, a numberless horde of goblins who jealously guard a fabulous object called the Shimmering Widget.&#10;&#10;The other player controls Stormbeard the dwarf, armed with his legendary battle axe, who must enter Snarlsbad Cavern, acquire the Shimmering Widget and escape.&#10;&#10;Goblin Slayer is a free print and play boardgame, and features a special geomorphic game board designed to create a &quot;perfect&quot; but different cave system each time the game is played.&#10;&#10;http://www.digital-eel.com/&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Pressure Point",
        "description": "From the back of the box:&#10;&#10;Who will stay cool and who will Crack!&#10;&#10;Can you keep your cool under pressure? You are given a category and must blurt out answers that fit in only 10 seconds!  Everyone else wagers on how many you can spit out... Beat the clock and their guesses to win Pressure points!&#10;&#10;",
        "artist": "Jennifer Vargas"
    },
    {
        "name": "90°",
        "description": "A football (soccer) card game that simulates the highlight actions of a match.&#10;Contents of the game: 112 cards, 4 dice, 4 scheme markers (white) and 2 card-cancelling markers (orange).&#10;&#10;Each card represents a player&rsquo;s motion in attack (red) and in defence (blue), except for the goalkeeper, who only has a catch motion plus special cards. &#10;Each coach chooses the scheme to be used and draws 11 cards for that specific scheme (Ex. 4-4-2).&#10;The ball handler plays a card and at the same time his opponent also plays a card. If the ball handler is playing with a defender, the opponent should contrast it with a forward card, likewise, if a midfielder is playing, the opponent should also play with a midfielder. &#10;The ball handler should always pass the ball to a player in a more forward, adjacent section. Only one back-pass is allowed during each action.&#10;If the player still has the ball after playing an attack card, he may attempt to score a goal. Roll as many dice as the value of the bonuses accumulated during the action, minus the value for the goalkeeper.&#10;Some special cards may be used to have an extra benefit in some cases.&#10;&#10;Rules are in Italian, English and German languages.&#10;sandrindavide@yahoo.it for info&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Gulf, Mobile & Ohio",
        "description": "Gulf, Mobile &amp; Ohio is the third entry in Winsome Games's Historic Railroads System and is set to be released at Essen 2008 along with the second game in the series, German Railways.&#10;&#10;Publisher John Bohrer describes it as a &quot;No luck game about building railroads in the South, 1830-1860,&quot; and notes that &quot;The map runs from Richmond to New Orleans, from Memphis to Savannah.&quot;&#10;&#10;Elsewhere it is also stated that GM&amp;O will be the &quot;gamer's game&quot; of the two new HRS games released this year.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Crown of Roses",
        "description": "(from GMT website:)&#10;&#10;Crown of Roses is a 3-hour block game set during the turbulent years of the Wars of the Roses in 15th Century England. This 35-year long conflict saw the extinction of a large number of noble houses, and would eventually set the house of Tudor upon the throne.&#10;&#10;In Crown of Roses, players take on the roles of the dynastic giants - the House of Lancaster and their Beaufort cousins, and the House of York. The four player game adds in the powerful House of Stafford, and the ever-scheming Richard Neville and his son, Richard of Warwick, the 'Kingmaker'.&#10;&#10;Using intuitive mechanics, Crown of Roses offers players a historical feeling with tremendous strategic depth and excellent replayability. Unit starting locations vary with each turn and even with each game, and the use of blocks creates the &quot;fog of war&quot; of limited intelligence on enemy strength and deployment. Random game events throw a touch of the chaos of the era into the mix, and the multiple uses for the player action cards leads to a level of uncertainty where enemy plans are concerned.&#10;&#10;During each game turn in Crown of Roses, players will play cards to perform actions such as improving their armies, influencing the locals to support them, collecting supplies or prestige, moving to attack enemy forces, to recruit new houses to your cause, calling another Royal Heir into the fray, or even changing the nature of the conflict through the use of player events.&#10;&#10;Unit blocks rotate to show strength, and each army can have a variety of experience levels and combat capabilities. A novel roll to hit-based system is used to determine combat results, with better experienced forces scoring hits more often in battle. Kill all of the enemy heirs, and you can rule England unimpeded!&#10;&#10;In Parliament, players can try to gain a favorable posting or take control of the crown itself by gathering enough noble support. Gather enough votes for enough years and the nobles of parliament will welcome you as their sovereign!&#10;&#10;And if you can create enough influence with the local gentry, your economic might will sway the common folk to support you as their chosen monarch!&#10;&#10;And the four player game of Crown of Roses allows all of this and more without the sacrifice of the unique fog of war aspect that the unit blocks provide. With each player having up to three ways to win, who knows who will be the next King of England!&quot;&#10;&#10;TIME SCALE Variable&#10;&#10;MAP SCALE Area Movement&#10;&#10;UNIT SCALE Noble houses and mercenary factions&#10;&#10;NUMBER OF PLAYERS  Two to Four&#10;&#10;COMPONENTS:&#10;22x24 inch Cardboard Game Map&#10;54 Large Wood Blocks&#10;27 Small Wood Blocks&#10;222 Counters&#10;1 sheet of 54 Block Stickers&#10;15 6-sided Dice&#10;110 playing Cards&#10;2 Color Play Aid Cards&#10;8 Parliament/Office Cards&#10;4 Player Mats&#10;1 Rules book&#10;1 Scenario and playbook&#10;&#10;DEVELOPERS: Andy Young and Kevin Bernatz&#10;ART DIRECTOR/PACKAGING: Rodger B. MacGowan&#10;MAP ART: Knut Gr&uuml;nitz&#10;CARD &amp; COUNTER ART: Charles Kibler&#10;&#10;",
        "artist": "Knut Grünitz,Charles Kibler,Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "Wings of War: Fire from the Sky",
        "description": "The WW2 series of Wings of War is an easy, fun to play, fast and furious system which previous fans of the game will be able to start playing minutes after opening the box! New game mechanics support a simulation which must encompass planes with very different flight capabilities and firepower, while still keeping the flow of the combat simple as it is in the WW1 series. The innovations to maneuver cards and to the fire deck system provide all the needed historical accuracy with no headaches to the players!&#10;&#10;&ldquo;Fire from the Sky&rdquo; is the second set in the new series of Wings of War games, which will allow you to re-create dogfights, bombing missions, escorts, and endless other aerial combat situations set in World War Two. New fighters are introduced into the system, among which the Curtiss P-40 Tomahawk featured in several allied color schemes including the famed Flying Tigers. Airacobra, Yak 1, Reggiane Re.2001 Falco II, Hien and several other fighters from every WWII front are also included. The newest add to the system are Anti-Aircraft guns in ground nests and three different dive bombers: Stuka for the Axis, Val for Japan and Dauntless for United States and France.&#10;Up to 6 planes can fly with the contents of this set, for scenarios with 1 to 6 players.&#10;&#10;Part of the Wings of War series&#10;&#10;Expanded By:&#10;&#10;     Wings of War: The Dawn of World War II&#10;     Wings of War: Flying Legend Squadron Pack&#10;     Wings of War: Eagles of the Reich Squadron Pack&#10;&#10;&#10;&#10;&#10;",
        "artist": "Andrea Angiolino,Vincenzo Auletta,Fabio Maiorana"
    },
    {
        "name": "2 de Mayo",
        "description": "2 de Mayo is an abstract game of the terrible incidents that took place in Madrid on May 2, 1808. On that date, civilians in Madrid &mdash; and a few Spanish army units &mdash; rebelled against the French occupation troops of Napoleon.&#10;&#10;2 de Mayo is a bilingual (English and Spanish) boardgame for two players, in which each player controls the forces of one side, either Spanish or French. The game lasts 10 turns and takes about 20-30 minutes to play.&#10;Each turn is divided into four phases:&#10;&#10;     Preparation&#10;     Orders&#10;     Movement&#10;     Resolution&#10;&#10;&#10;&#10;&#10;At the end of Turn 10, the French player achieves victory if all the Spanish forces have been eliminated, all the access areas to Madrid are French garrisoned and has not lost four or more cubes. If a French victory does not apply, the Spanish player wins.&#10;&#10;The game includes:&#10;&#10;     board showing the old map of Madrid, divided in 21 areas or zones&#10;     41 wooden cubes: 30 blue (representing the French troops), 10 red (representing the Spanish civilians and troops), and 1 unpainted used as the turn marker.&#10;     22 event cards, 11 French (blue back); and 11 Spanish (red back)&#10;     2 player aid cards&#10;     1 turn track card&#10;     rulebook, including historical commentaries and a full example of play&#10;&#10;&#10;&#10;&#10;",
        "artist": "Edigrafica games,Francisco Goya"
    },
    {
        "name": "Castellers",
        "description": "[EN] Strength, balance, bravery and good sense. These are the four key words for the castellers. In this game you will have to use all of them to emulate the brave castellers and to raise the higher towers of the game.&#10;&#10;&#10;     Components: 66 castellers wooden pieces in 4 colours, 2 sets of stickers, 12 pinya base tiles, 2 bonus tokens, 1 bag, a set of rules.&#10;     Game has rules in English, Spanish, Catalan and Portuguese.&#10;&#10;&#10;&#10;[ES] Fuerza, equilibrio, valor y sensatez. Estas son las cuatro palabras clave de los castellers. En este juego tendr&aacute;s que usarlas todas para emular a los valientes castellers y levantar los castells m&aacute;s altos de la partida.&#10;&#10;&#10;     Componentes: 66 castellers de madera de 4 colores, 2 conjuntos de adhesivos, 12 baldosas base de la pinya, 2 fichas de bonus, 1 bolsa, reglas.&#10;     El juego dispone de reglas en ingl&eacute;s, castellano, catal&aacute;n y portugu&eacute;s.&#10;&#10;&#10;&#10;[PT] For&ccedil;a, equilibrio, valor e sensatez. Estas s&atilde;o as quatro palavras chave dos castellers. Neste jogo ter&aacute;s que us&aacute;-las todas para simular os valentes castellers e levantar os castells mais altos da partida.&#10;&#10;&#10;     Componentes: 66 castellers de madeira em 4 cores, 2 conjuntos de autocolantes, 12 bases de pinya, 2 fichas de b&oacute;nus, 1 bolsa, regras.&#10;     O jogo vem com regras em ingl&ecirc;s, castelhano, catal&atilde;o e portugu&ecirc;s.&#10;&#10;&#10;&#10;[CA] For&ccedil;a, equilibri, valor i seny. Aquestes s&oacute;n les quatre paraules clau dels castellers. En aquest joc haur&agrave;s d'emprar-les totes per tal d'emular als valents castellers i aixecar els castells m&eacute;s alts de la partida.&#10;&#10;&#10;     Components: 66 castellers de fusta de 4 colors, 2 conjunts d'adhesius, 12 rajoles base de la pinya, 2 fitxes de bonus, 1 bossa, regles.&#10;     El joc disposa de regles en angl&egrave;s, castell&agrave;, catal&agrave; i portugu&egrave;s.&#10;&#10;&#10;",
        "artist": "Bié,Antonio Catalán"
    },
    {
        "name": "Time's Up! Title Recall!",
        "description": "Based on the popular game Time's Up!, Time's Up: Title Recall challenges players to guess the titles of books, films, songs, and more. Players try to get other players to guess the same set of titles over three rounds. In each round, one member of a team tries to get his teammates to guess as many titles as possible in 30 seconds. In round 1, almost any kind of clue is allowed. In round 2 no more than one word can be used in each clue (but unlimited sounds and gestures are permitted.) In round 3, no words are allowed at all.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Enuk",
        "description": "Translated from publisher's description:&#10;The small Eskimo child Enuk is already completely excited. Today he may go with his large brothers on journey into the ice. Finally he may see the wild polar bears on their way, watch the seals fishing and fish himself through the ice holes. At most, however, he looks forward to building the igloo with the others. However, the day goes on much too fast...&#10;&#10;The children have to build the igloo and to observe as many animals as possible at the same time. Who collects most animal tiles and builds the igloo successfully, will win!&#10;&#10;Description of the mechanics:&#10;Enuk is a mixture of memory and push-your-luck. Players turn over animal tiles, until they want to quit or one of the animals is scared and flees: the herring flee from the salmon, salmon flees from the seal, the seal flees from the polar bear and the polar bear flees from the Eskimo. How many tiles dare you turn over?&#10;&#10;",
        "artist": "Alexander Jung"
    },
    {
        "name": "Click Clack",
        "description": "From the rules:&#10;Freddy the Piglet has a difficult task, because lots of tasty tidbits are hidden in the forest and he  has to keep an eye on them all.&#10;The squirrels in the Hazelnut Gang are up to their usual mischief, however, and have also taken an  interest in the crunchy hazelnuts, juicy berries, chestnuts and fir cones. &#10;Your task is to be the first to steal 7 tidbits from under Freddy&rsquo;s nose! Whoever manages this will be the new leader of the HAZELNUT GANG!&#10;&#10;Players move their squirrels on the board and then rotate the board on top of the box. When rotating the board, metal food tiles may click to the magnetic squirrels. The game is very simple and suitable for children aged four or more.&#10;&#10;",
        "artist": "Alexander Jung"
    },
    {
        "name": "Ancient Battles Deluxe",
        "description": "With grim-faced determination and sharpened sword, lead your troops through the greatest battles of history using the simple maneuver and combat mechanics that allow you engage in the decisive missile and melee combat that is Ancient Battles Deluxe.&#10;&#10;Here players will find more than a great game, but a complete system using standardized pieces and rules that allows hearty warriors to recreate any number of pre-gunpowder and early-gunpowder era battles in a compact playing area over a short time.&#10;&#10;Do you have what it takes to command an army in a desperate situation? Will your leadership be able to advance your line in good order or resist the shock of a barbarian charge? If your units falter and break, will you be able rally them once more unto the line, or will your army disintegrate into abject panic? Show us what it takes to maintain good order and cohesion amidst the chaos of battle long enough to vanquish the foe, break their spears asunder, and to stand gloriously amid the field of battle victorious!&#10;&#10;Time scale: Each Game Turn equals 45 minutes.&#10;Unit scale: Dozens to hundreds of men, beasts and equipment.&#10;&#10;",
        "artist": "Alan Emrich"
    },
    {
        "name": "Serpents of the Seas",
        "description": "Serpents of the Seas is the second volume in the Flying Colors series of naval combat games, and represents frigate actions and the rise of the American Navy. Unlike the larger battles between ships of the line depicted in Flying Colors, Serpents of the Seas includes sixteen battles from the American Revolutionary era and the War of 1812 that involve smaller ships -- from tiny gunboats with only one or two cannon through &ldquo;5th Rate&rdquo; frigates of less than 50 guns. Also depicted are three dozen &ldquo;Ship Duels&rdquo; between one or two vessels on a side, like the mighty Constitution (&ldquo;Old Ironsides&rdquo;) against her foes Java and Guerriere. To make these duels more challenging, an all new initiative system has been created using activation cards that might grant players a jump on their opponents, but limit their flexibility in the process. The cards can also be used as events that provide additional shipboard flavor. These new systems are fully compatible with the original Flying Colors game, with mechanics that can be selected a la carte.&#10;&#10;",
        "artist": "Rodger B. MacGowan"
    },
    {
        "name": "Impetus",
        "description": "Impetus is a set of wargaming rules that allows you to play battles from the Ancient, Medieval and Renaissance periods. It is produced by the same team that publish the Italian 'Dadi &amp; Piombo' miniatures wargaming magazine.&#10;&#10;It is an extremely flexible system which allows players to recreate armies from a huge period of history - from Ancient Egypt, Romans and the Crusades right through to the Hundred Years War and Samurai.&#10;&#10;Impetus is designed to be played using miniatures in various scales: 6mm, 10mm, 15mm, 20mm, and 25/28mm are all catered for.&#10;&#10;Miniatures are based in elements - 60mm wide for 6mm &amp; 10mm, 80mm wide for 15mm, and 120mm wide for 20mm &amp; 25/28mm. The depth of the element is stipulated, but is not vital. This enables you to play the system with armies already based for other games systems.&#10;&#10;The game play is turn based, but is not traditional i-go/u-go. Players roll dice for initiative every turn, but units are able to react to enemy forces out of sequence.&#10;&#10;Units have 3 or 4 statistics, the most important of which is VBU, a combination of unit strength and morale.&#10;&#10;Combat is fast and simple. Units roll dice equivalent to their VBU in combat, with various modifiers giving bonuses to the number of dice thrown. Any score of '6' or double '5' score a hit. There is some record keeping required, as unit hits cause a reduction in VBU. When VBU is reduced to 0, the unit routs and is removed from the table.&#10;&#10;Armies are points based, with average armies ranging between 300-500 points. There are 15 army lists detailed in the original rules, usually in 'matched pairs'. These include Alexander's Macedonians &amp; Later Achaemedian Persians, 2nd Punic War Romans &amp; Carthaginians, Gauls &amp; Caesar's Romans, Crusaders &amp; Saladin's Army, and French &amp; English armies from the 100 Years War.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Level Up",
        "description": "A game very similar to Phase 10. 8 different card combinations (3 in a row, 7 cards of the same color etc.) have to be completed in sequence. The game ends if a player completes his eight level.&#10;&#10;",
        "artist": "Franck Dion,Arthur Wagner"
    },
    {
        "name": "Huuue!",
        "description": "A new horse-racing game, driven by card play. For each race, different horses are identified as favourites or laggards. You get more victory points for a bad horse finishing well than for a favourite winning the race. Players use cards from their hand to select which horses move forward and backward by different places. There is no race track. Instead, markers for each horse are re-ordered on the table as needed. This allows horses to run neck and neck, which affects how they move in later goes. Players secretly bet on their choice before each race and try to manipulate the result to their favour. After a few races, the most VPs wins.&#10;&#10;",
        "artist": "Tony Rochon"
    },
    {
        "name": "Monopoly: The Portable Property Trading Game",
        "description": "A very small travel version of Monopoly which often comes in the shape of a red suitcase and plays very similarly to the original game. One difference is that it contains three dice. The Community Chest and Chance cards are replaced with tables. Three dice are rolled and the tables are referenced to find the result.&#10;&#10;The Waddington's UK edition has different properties than the U.S. version, and also comes in a different sort of case with a magnetic board and magnetic hotels, houses, and movers.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Game of Life: Indiana Jones",
        "description": "This re-theme of The Game of Life is part of the May 2008 wave of Indiana Jones product timed to capitalize on the release of Indiana Jones &amp; The Kingdom of the Crystal Skull. This particular game is available exclusively through Target.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Qyshinsu: Mystery of the Way",
        "description": "BOARD: there are twelve triangles on the surface of the circular board. Only one stone may reside on a space.&#10;&#10;STONES: There are a total of 24 stones (12 red &amp; 12 black). Each player chooses one color, red or black. There is one pair of six different kinds of stones for a total of 12 stones per player. They vary in kind:&#10;&#10;&#10;     Stone of 1&#10;     Stone of 2&#10;     Stone of 3&#10;     Stone of 4&#10;     Stone of 5&#10;     &quot;Old Stone&quot;&#10;&#10;&#10;MOVEMENT: There are only two actions a player can perform - placing or removing a stone from the board.&#10;&#10;RULES: When you place a stone in a space on the board, your opponent must place or remove one of their stones (# of spaces - according to the value of the stone you placed) away from your stone in either direction on the board - to the right or left of your stone. The same rule applies when removing a stone - the logic is the same.&#10;&#10;The &quot;Old Stone&quot; is unique. When placing this stone, your opponent MUST place a stone in the nearest vacant space to it. When removing this stone, your opponent MUST remove their nearest stone to it.&#10;&#10;ADDITIONAL RULES (&quot;The Precepts&quot;):&#10;&#10;&#10;     First Precept: players are not allowed to touch each others stones.&#10;     Second Precept: only two of each kind of stone is allowed on the board at the same time.&#10;     Third Precept: when you remove a stone from a space, that same kind of stone may not be put back in that same space on your very next turn.&#10;&#10;&#10;OBJECTIVE: &quot;Return to the Way&quot;:&#10;&#10;This occurs when your opponent is unable to place or remove a stone.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Second World War at Sea: Coral Sea",
        "description": "In May 1942, the Japanese sought to capture Port Moresby on the south coast of New Guinea and interrupt communications between the United States and Australia. Such a move, they hoped, would bring the Americans to battle.&#10;&#10;The United States Navy needed no special inducement to fight its nation's enemies. Two American aircraft carriers met one small and two large Japanese carriers in the world's first battle between these powerful new warships. For the first time in naval history, a major battle was decided with no warship of either fleet even sighting an enemy ship directly. Aircraft were the new measure of naval power.&#10;&#10;Coral Sea is the new introductory boxed game for the Second World War at Sea series. It covers this key battle and is intended as a gateway for players new to the world's most popular series of naval boardgames. The Japanese player must establish new bases in New Guinea and at Tulagi in the Solomon Islands; the American player must stop them. Forces are very closely balanced, and victory will rest with the player who can best make use of his or her resources.&#10;&#10;The 22x17-inch operational map covers the Coral Sea off northeastern Australia as well as surrounding waters. Players maneuver their task forces on this map and search for one another with aircraft, submarines and surface ships. When contact is made, player moves to the tactical map.&#10;&#10;The tactical map is a generic blue field of hexagons, used to resolve surface combat. There, ships maneuver and fight using their gunnery and torpedo factors. Each player rolls a number of dice according to the ship&rsquo;s capabilities, hitting on a result of 6. Gunnery and torpedo damage tables give the results: ships can suffer damage to engines, hull or armament. Air attacks are resolved in similar fashion. The combat systems yield results rapidly but in a historically accurate fashion, giving a good balance of fun and insight.&#10;&#10;",
        "artist": "Beth Donahue,Susan Robinson,Christopher West"
    },
    {
        "name": "Rice Wars",
        "description": "Become The Daimyo &ndash; a head of a Japanese noble house and clash in battle with your power-hungry opponents.&#10;&#10;Rice Wars is the economic strategy game set in the XIV-century Japan. Game is suggested for 2-5 players aged 8 years and up.&#10;&#10;The goal of the game is to manage the resources of the small island of Tokuno and take control of its rice fields. Get the peasants to work for you in the fields, fend off the envious neighbours by sending your ashigaru troops, lend an ear to Imperial Advisors and hire the ronin who can challenge the opposing daimyo to the noble duel to the death.&#10;&#10;The game contains a two-sided board allowing the players to choose two variants of the game. The simple board is designed for fast-paced play for 2-4 players, while the epic board allows longer and more intricate game for 3-5 players.&#10;&#10;Enter the world of medieval Japan and fight for victory!&#10;&#10;The game includes:&#10;&#10;- the board&#10;- 144 tokens&#10;- 55 cards&#10;- 26 wooden markers&#10;- 8 advisor cards&#10;- 5 daymio cards&#10;- ryo banknotes&#10;- the rulebook.&#10;&#10;",
        "artist": "Grzegorz Przybyś"
    },
    {
        "name": "Pyramid",
        "description": "Fluch der Mumie (Curse of the Mummy) is a game with asymmetrical goals. While one player as the Mummy tries to catch tomb raiders, the other players try to secure as many treasures as possible from the Pyramid.&#10;&#10;The game is played with magnetic playing pieces on two sides of a vertical board, so the Mummy player cannot see the pieces of the tomb raiders. As the Mummy piece consists of two parts (one on each side of the board) the tomb raiders on the other hand know the movements of the Mummy.&#10;&#10;They move their pieces via dice rolls and judging by the color of the tomb raiders treasure goal cards and their dice rolls, the Mummy player tries to deduce their position on the board, while they try to evade him.&#10;&#10;When the Mummy moves over a tomb raider, he is &quot;caught&quot; by the Mummy magnet, thrown into the dungeon and loses some life points. The mummy wins when it earns a certain number of life points, while the tomb raiders have to secure a certain amount of treasures. &#10;Ravensburger states that bluffing and memory also play a big part in this game.&#10;&#10;Contents: 1 magnetic game board, 1 magnetic mummy figure (2 pieces), 4 magnetic treasure hunters (tomb raiders), 12 life points, 5 treasure hunter dice, 1 Mummy die, 23 mission cards, 2 cover tiles.&#10;&#10;",
        "artist": "illuVision,Michael Menzel"
    },
    {
        "name": "Aquarium",
        "description": "Aquarium offers high player interaction as the other players can &ndash; and will &ndash; use their action cards to alter the available fish that you can buy and the price that you have to pay for them.&#10;&#10;Each player starts with a set of nine action cards and $15. The deck is shuffled, then set up with three or four &quot;Feeding time!&quot; cards shuffled into the deck at various points. On a turn, a player first turns up a card from the deck if the market is empty (as it is as the start of the game). Then the player looks at the fish and plant cards in the market and decides whether to pass or try to buy them. If he passes, he takes $2 from the bank and adds the top card to the market; if he wants to buy, all other players get to influence what's on the market and what the cards cost.&#10;&#10;First, each other player chooses one of their five action cards for use in phase 1 of a buy. These cards force the active player to add, remove or swap a card from the market or simply allow the card player to make a fish swap of his own! (Players can also pass, with all action cards but the &quot;pass&quot; being set aside.) Second, each other player chooses one of their five action cards for use in phase 2 of a buy. These cards add or subtract 1 from the cost of the market, or double or halve the cost of the market. In the latter case, the player of the card receives money from the active player instead of those coins going to the bank.&#10;&#10;Once the goods and the cost are set, the active player chooses to buy all the fish and plants on offer or none of them. The cost is equal to the sum of the card values, plus or minus any modifications, then doubled or halved as appropriate. All purchased cards go into a player's personal aquarium. If a player has two identical fish, he can move them to a separate breeding tank where they will earn him 1-3 coins each turn.&#10;&#10;Each time a &quot;Feeding time!&quot; card is revealed, players reveal one &quot;food cost&quot; card at random, then pay money equal to that cost times the number of stars on fish and plants in their aquariums. Any fish not fed starve and float away to the big toilet bowl in the sky. Each plant in an aquarium reduces the food cost by one.&#10;&#10;After the final &quot;Feeding time!&quot;, players count the stars on their non-breeding fish, then receive bonuses for collecting all colored fish of the same size, all three sizes of fish of the same color and different varieties of plants. The player with the most stars wins.&#10;&#10;Here, fishy, fishy, fishy...&#10;&#10;",
        "artist": "Atha Kanaani,Steven Kees"
    },
    {
        "name": "Free Trader",
        "description": "Free Trader is a solitaire game of opening trade routes while fighting Pirates and dodging Police patrols.&#10;&#10;It plays by exploring tiles representing planets and drawing cards for trade prices and events.&#10;&#10;You need to keep trading in order to make the payments on your new space ship.  Make four payments to win!&#10;&#10;It is free, and web published&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "One More Barrel",
        "description": "Invent a reason to invade a nation rich with petroleum, make everyone believe that your actions are legitimate and done in the name of freedom and justice, make sure the media plays along by giving false information for a long time: this is the formula for becoming rich beyond your wildest dreams. Luckily, this is only a game and would never happen in real life!&#10;&#10;In this game every player represents a leader of an Occidental Country. The objective is to ward off global terrorism by finding weapons of mass destruction that are hidden in a state considered to be hostile. In order to do this, every player must send troops to invade this rogue state and accomplish the overall objective. Because, however, the weapons of mass destruction don't exist (this merely serves as an excuse to win over the public opinion), to win the game, you must conquest the diverse provinces within the invaded country, steal their oil, sell as much of it as possible and award many contracts to companies in your own country. At the end, whoever is the richest wins!&#10;&#10;Every player, in addition to being a leader of an Occidental Country, also take the role as head of a rebel group within the invaded country. These rebels will become operative after the first phase of the war and can cause damage to your troops allowing you to win the last barrel of oil!&#10;&#10;More information on http://www.giochix.it&#10;&#10;Essen 2008 Release&#10;&#10;",
        "artist": "Alberto Bontempi,Andrea Cuneo"
    },
    {
        "name": "Bump in the Night",
        "description": "A group of kids have wandered into your house to spend the night. Dawn will not come soon enough to save them, the only question that remains is which group of monsters will terrorize them the most.&#10;&#10;In &quot;Bump In The Night&quot; 2-6 players each play a group of six monsters that they will use to terrorize the kids in the haunted house.  If enough terror is generated in a person or if a person is forced to flee the house, the player claims the person for a point.  Other points can be gained through special bonus cards as well.  The first player to five points on their turn wins the game.&#10;&#10;",
        "artist": "Dave Aikins,Todd Breitenstein,Kurt Miller"
    },
    {
        "name": "Leader 1",
        "description": "Leader 1, the legend of cycling, is a cycling race simulation by Ghenos games.&#10;&#10;In each of the 5 teams there are different types of cyclists: 1 rouleur, 1 climber and 1 leader. Different tracks can be arranged with the hexagons reproducing different types of routes: plain, ground rise, mountain pass and downhill.&#10;&#10;Every cyclist enjoys the benefits of a free base movement which varies according to his specialty and according to the hexagon at the beginning of his movement. After this kind of movement every racer can add a paying movement. Therefore, the race is based on the riders&rsquo; energy management: initially the riders are all inside the peloton, where it is easier to save energy, but then they will have to find the proper moment to break away to open the definitive gap ahead of the peloton.&#10;&#10;The slipstreaming rule assures the simulation of the easier breaking away with a fellow, saving energy by swapping places. Cracks, falls and punctures make the simulation more complete.&#10;&#10;Leader 1 has a simple yet fascinating mechanism: players decide the placement and energy management of their riders, facing all the elements of a &ldquo;classic&rdquo; or &ldquo;stage&rdquo; race.&#10;&#10;Re-implemented as:&#10;&#10;    Giro d'Italia: the Game&#10;&#10;&#10;&#10;&#10;Stand-alone expansion:&#10;&#10;    Leader 1: Hell of the North&#10;&#10;&#10;&#10;&#10;",
        "artist": "Tony Rochon"
    },
    {
        "name": "Black Sheep",
        "description": "Designed by Reiner Knizia and illustrated by the incredibly talented Ursula Vernon, In BlackSheep, players try to corral the best combination of cows, horses, chickens and more while avoiding the mischievous black sheep. BlackSheep is perfect for two to four players ages eight and up. -From the FFG website.&#10;&#10;There's a lot of randomness here, but also room for elementary strategy.  Players make poker hands from two shared cards (figurines of ranked animals) and three of their own (these are actual cards).  There are three such hands playing simultaneously, with players adding one or two cards at a time to any hand on their turn.  When all players have played three cards onto a hand, a winner is chosen, based on the poker ranks.  The winner takes the two shared cards (animal figurines), and new shared cards are added.  At the end of the game, scores are calculated by summing numbers printed on the bottoms of the figurines they captured and some bonuses.  The black sheep figurines are worth negative points.&#10;&#10;",
        "artist": "Ursula Vernon"
    },
    {
        "name": "Simply Ingenious",
        "description": "Einfach Genial: Wer zu viel riskiert, verliert! (&quot;Simply Ingenious: Whoever Risks Too Much Loses!&quot;) is a tile game related to the Ingenious board game in that players are once again collecting as many points as possible in each color/symbol while also needing to score points in all colors/symbols in order to do well.&#10;&#10;To start the game, mix all 126 tiles (21 of each color/symbol) face down, then turn three face up and place them in a shared pool in the center of the table. On a turn, a player flips a tile face up. If the tile doesn't match one of those in the pool, he adds all tiles revealed this turn to the pool and ends his turn; if it does match, the player can either end his turn and collect the face-up tiles before him and all matching tiles in the pool, or take another turn.&#10;&#10;If you're the first player to collect seven tiles of each color, you win. (With four players, the goal is five tiles.) Any tiles of a color you collect over seven are shuffled back into the supply.&#10;&#10;If a player has a single color with fewer tiles in it than all other colors and a tile of that color is in the pool, the player can take one such tile and end his turn; this rule allows players to work toward that final color they need, while also pushing other players to try to remove that color from the pool. If the pool ever has fewer than three face-up tiles, reveal tiles and add them to the pool until three tiles are available.&#10;&#10;Einfach Genial: Wer zu viel riskiert, verliert! was later released as one of three games in Fantasy Flight Games' Ingenious Challenges.&#10;&#10;",
        "artist": "Michaela Kienle"
    },
    {
        "name": "Jishaku",
        "description": "In Jishaku, players take turns placing hematite magnets onto a foam playing field in one of three different games, trying either to prevent the magnets from attaching to one another or to encourage them to connect.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Anno Domini: Wort Schrift Buch",
        "description": "Each Anno Domini set consists of 336 cards, with a description of a historical event on one side of the card, and the year (and sometimes specific date) in which it happened on the other.&#10;&#10;Each player receives nine of these cards (or less, if you want the game to be shorter), and may only look at the descriptions. Players then put in turn a card on the table, *trying* to put theirs in chronological order. A player may, instead of adding a card, claim that the order in which the cards were put is incorrect. In this case all cards are turned over and the correct years revealed.&#10;If the order was correct then the doubting player receives two cards and skips a turn. If the order was incorrect then the previous player, who accepted the order as correct, receives three cards. The first player that gets rid of all the cards wins.&#10;&#10;Bluffing is as least as important as knowledge in this game. Most events are rather obscure or are hard to date exactly, so this ain&rsquo;t no game for the nerds/geeks of this world, even they might think so, because it&rsquo;s full of surprises and pure fun. Highly recommended, because Anno Domini is a blast to play, is a very enjoyable social event and you even learn something from it.&#10;&#10;Unfortunately there is no English edition in existence, but this game could be a good way, to improve your already existing German skills or a very good reason, to learn German language in the first place.&#10;&#10;The set &quot;Wort Schrift Buch&quot; contains historical events which are related to writing and printing, and to the history of popular phrases. Like all Anno Domini the &quot;Wort Schrift Buch&quot; edition can be played as standalone or mixed with some or even all editions.&#10;&#10;Part of the Anno Domini series&#10;&#10;",
        "artist": "Res Brandenberger"
    },
    {
        "name": "Pickpocket",
        "description": "The players are pickpockets in a bar. The aim of the game is to leave the bar as rich as possible.&#10;&#10;A round starts by turning a card. On this card you see a number of lines (maximum 4). The players have to decide to leave the bar with the current earnings or to turn a new card. When they turn a card there is a risk of being thrown out of the bar if all the lines on the cards are broken. As long as there is one line that starts on the first card and ends on the last card without any interruptions in between they can stay in the bar to continue stealing.&#10;&#10;You can also turn a card that shows a guard. As soon as two guards are turned the exits of the bar are blocked. In this way it is impossible to leave the bar. There are also a few other cards available to add some variation to the game.&#10;&#10;The game is played in several rounds. Each round you have to decide how much risk you are willing to take. Timing and luck are very important.&#10;&#10;",
        "artist": "Olivier Fagnère"
    },
    {
        "name": "The Princes of Machu Picchu",
        "description": "When the Spaniards conquered the Incan Empire, only a few princes managed to flee into the mountains. Well-hidden high above the river Urabumba is a place the Spanish would never discover: The lost city of Machu Picchu. But beware! Is there a traitor among the princes, ready to reveal the location of the secret city to the Spaniards?&#10;&#10;Each player represents an Incan prince, whose workers will grow corn, feed llamas, plant coca, and manufacture ceramics and cloth. They try to engage Priests of the Condor, Priests of the Puma, and Virgins of the Sun. The game can end in 2 different ways:&#10;&#10;     The Incans win by activating all priests and virgins in time&#10;     The Spaniards win when they discover Machu Picchu&#10;&#10;&#10;&#10;&#10;With an Incan victory, the prince who made the wisest sacrifices to the gods will win. With a Spanish victory, the princes who accumulated the most gold will get a multiplier to their score... but it may not be enough to win the game.&#10;&#10;Players choose their actions by walking around with their prince on the city map.&#10;&#10;",
        "artist": "Oliver Graute"
    },
    {
        "name": "After the Flood",
        "description": "Description courtesy of BoardgameNews.com&#10;&#10;After the Flood &ndash; a three-player game that&rsquo;s set in Sumeria, with players using regional resources to trade for goods not produced in the area while also building short-lived empires for long-lasting victory points.&#10;&#10;&ldquo;Certain mechanisms were created with three players in mind,&rdquo; says Wallace. &ldquo;You score an empire, then remove it, so you can try to maximize points on your turn without leaving yourself in a position to get hit on following turns.&rdquo; This design sidesteps the problem of a third player winning a game due to fights to the death by players 1 and 2, but that bug becomes a feature in another part of the game. Competition among the players for goods and army strength is relative rather than linear; having twice as many dudes collecting resources won&rsquo;t net you twice the number of goods, so getting into an arms race with one opponent might hurt the two of you together and advantage the third player who can spend resources on better things.&#10;&#10;Controlling different cities gives you different bonuses, with the bonus being based on the history of the city itself: Sippar lets you trade more, Babylon counts for additional armies, and so forth. Combat in the game is dice-based to avoid deterministic battles in which you can guarantee victory simply by piling up more troops, although size does have its advantages.&#10;&#10;&#10;&#10;Game Summary&#10;Like Wallace's other games Libert&eacute; and Byzantium, players don't represent a particular faction/nation. Instead, the game covers a long period of history (~1500 years in this case) and players temporarily control empires as they rise and fall. Score VP at the end of each turn (~350 years) when the empires fall. Players start with several resources and 2 workers in their available stock, and workers in the irrigation and weaving boxes. Each turn follows the same steps:1. Collect Resources (grain and textiles) based on relative rank of workers in the irrigation/weaving. Then take 8 workers to available stock (total 10 at start of game). Move all workers in Scribes and Toolmakers to the left (and &quot;Unused&quot;) side.&#10;&#10;2. Decline (turns 2 and 4 ONLY): each player removes all workers from Dilmun, and 1 from every non-Sumerian region. In the Irrigation and Weaving boxes, the player with the most workers reduces their number TO 2 (with n being the number of workers they returned to supply). The other players remove n workers. Finally, each removes 1 worker from the Scribes and Toolmakers boxes.&#10;&#10;3. Player Actions. In turn order (random at start of game), take 1 action. If anyone has passed, you must discard one item (resource, worker, or army) from your available stock to take an action. Continue rotating in turn order till all 3 pass. Action Choices:&#10;- Build City. Place one of your city markers in Sumerian region with no other city there. Most give you a special power. If all 4 out, may destroy old city to build new one.&#10;- Place Workers. Spend a resource of value x; place up to x workers in ONE location (Scribe box: max 2 workers/player). In addition, or instead, may use each unused scribe to move or place a worker.&#10;- Trade. Each worker is allowed to trade 1 resource for 1 of the resource(s) available in their region. Each region only provides 1 of each resource present there. However, if ANY army is in the region, workers cannot do anything. Each army, though, can conduct 1 trade just like a worker. In addition, or instead, you can use worker(s) in the Toolmakers box to convert metal to Tools (1/worker).&#10;- Start Empire. 3 available each turn, 1/player. Each has designated start region (2 Sumerian empires -- may start anywhere in Sumer). You must have equal or greater number of workers than any other single player in their home region (except Sumerian empires: no workers needed). Take designated # armies into available stock; may buy more (pay resource(s)). Also, may equip (spend resources; rank by value relative to what other already created empires spent). Then come onto board: if enemy army there, fight. Otherwise (or once enemy killed), place 1 or 2 armies in starting region.&#10;- Expand Empire.&#10;... [i]Place Army[/i] token (from available stock) to adjacent region. If enemy army present, fight.&#10;... [i]Destroy City[/i]. If have army in region with enemy city, discard 2 from supply to destroy it -- return to supply.&#10;... [i]Reinforce Region[/i]: place 2nd army into a region (max 2/region).&#10;... After any choice above, may discard 1 army from supply to Expand again.&#10;Fighting&#10;Attacker rolls 2d6. If better equipped than defender, kills on 5+. Otherwise, need 7+. May continue attacking until decide to end battle, or win and place 1 army in new region (all considered 1 attack; i.e., don't need to discard an army to continue the fight).&#10;- Pass. May opt to discard resource(s) as well.&#10;&#10;4. Determine Turn Order. Based on resources discarded when passing: most--&gt;least first--&gt;third. If tied, retain relative turn order.&#10;&#10;5. Score VP. 2VP/region with your army token. Then in turn order, decide whether or not to improve your cities: each requires discarding 2 wood + 0-4 resources (earn 3-18 VP). If improved, place marker on city -- it won't score again.&#10;&#10;6. Reset. Remove all armies from board. Remove all armies and workers from available stock. Advance turn marker.&#10;&#10;End of Game&#10;- After end of turn 5.&#10;- Final scoring: player with most [i]workers[/i] in each region scores VP shown on board.&#10;- Most VP wins. Tiebreaker = turn order.&#10;&#10;",
        "artist": "Peter Dennis"
    },
    {
        "name": "The Office Trivia Game",
        "description": "From the manufacturer:&#10;&#10;Based on the hit NBC-TV show starring Steve Carell, players race around the office visiting cubicles and answering questions about the adventures and misadventures of its unique characters. Includes a &quot;Support the Rabid&quot; rubber bracelet - as seen on the show - that players get when they win the &quot;5K&quot; race.&#10;&#10;Buy Microbadge&#10;    &#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Squadron Strike",
        "description": "&quot;Building off of the streamlined 3-D movement engine of Saganami Island Tactical Simulator, 2nd Edition, Squadron Strike lets you build any ship, from any setting, in full 3-D glory&mdash;and then pit them against each other, in titanic battles for the fate of galaxies.&quot;&#10;&#10;&quot;Squadron Strike takes between 5 and 10 minutes per turn with 6 ships per side, and combines fast play with more tactical depth and scalable detail than any other 'construction ready' space combat game. It&rsquo;s suitable for Ages 12 and up.&quot;&#10;&#10;&quot;In Squadron Strike, ships move in one of three movement modes, named for the number of Newton&rsquo;s Laws being obeyed; with these options you&rsquo;re not stuck with whatever movement mode the game designer liked - you can pick the one that works best for the setting you&rsquo;re trying to run in. You even have optional fuel rules (for both interstellar and tactical movement) to simulate the setting or TV series to whatever degree you like. You decide what reality level is appropriate for your level of fun.&quot;&#10;&#10;&quot;You can design nearly everything in the game, from missiles, to beams, to fighters, to torpedoes. An original setting includes pre-built ships and weapons for people who don&rsquo;t want to get deeply into the customization process, but if you want it, you have complete control.&quot;&#10;&#10;&quot;Automated tools do complete SSD generation for you, in Excel format, or with higher end features via web applications.&quot;&#10;&#10;&quot;Squadron Strike comes with a complete, integrated campaign system, including web apps that automatically generate campaign maps, victory decks, and system maps. Just enter the campaign turn in the web app and the positions of the planets on the system map update automatically!&quot;&#10;&#10;&quot;The boxed game will have two map sheets, a bag of tilt blocks, two bags of stacking tiles, box miniature sheets, a rulebook, an SSD book and a setting book. The ship design tools are available as a free download in Excel; the web applications (including a nicer ship design tool set, and campaign support) are behind a subscriber login.&quot;&#10;&#10;",
        "artist": "Thomas Marrone,Charles Oines"
    },
    {
        "name": "Claustrophobia",
        "description": "Claustrophobia is a miniatures-based dungeon crawl game set within the universe of Hell Dorado.&#10;&#10;The box contains pre-painted miniatures which are placed on large tiles showing the dungeon spaces.  Also included are character boards, counters and markers, and dice.&#10;&#10;One player controls a small group of determined humans, while the other plays an almost unending army of demonic creatures.  The game is thematic and highly asymmetric: human characters  are stronger, but the demon characters are more numerous.  Gameplay is very straightforward with a minimum of rules, and each game plays in an hour or less.&#10;&#10;In essence dice are allocated after rolling to perform actions, while cards or special abilities are also available.  The game is about managing decisions and choosing what to do with the resources that you have, managing difficult events and out-thinking your opponent.  Combat is handled by dice.&#10;&#10;Complexity is low, with the focus on theme and building towards a tense, climactic ending. &#10; Claustrophobia is played through scenarios of which there are several in the rulebook.  Generally speaking the human characters are attempting to complete a task (e.g. escape the catacombs, close a portal) while the demons are focused on stopping them.  There are varying win conditions depending on the scenario chosen.&#10;&#10;",
        "artist": "Bertrand Benoit,Aleksi Briclot,Stéphane Gantiez"
    },
    {
        "name": "Electronic Guesstures",
        "description": "A fast paced game of charades.&#10;&#10;Based on Guesstures but with different rules.&#10;&#10;Played in teams to 15 points&#10;&#10;The actors try to get their team to guess as many words as possible in 30 seconds (no limit).&#10;&#10;The actor doesn't get to see the words before the timer starts but only as they come up when the timer is going.&#10;&#10;If the actor is still trying to get the team to guess a word when they time runs out, the team loses all points gained in the round so when time is getting low, the player must decide whether to play it safe and stop or try another word and risk losing all the points earned so far this round.&#10;&#10;After the timer runs out, the other team may challenge rules violations. If they are successful, the acting team loses all points for the round.&#10;&#10;The electronic device has an LCD display on both sides and manages the time, the words, points and challenges. Requires three AA batteries (not included).&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Red November",
        "description": "Red November is a cooperative game in a gnomish attack submarine where everything is going wrong. The sub is descending and the water pressure increasing, the nuclear reactor is overheating, the nuclear missile launchers are pre-igniting, fires and water leaks are everywhere, there's a giant Kraken looming nearby and there&rsquo;s very little oxygen and vodka left. While the storyline feels more and more like a disaster movie, the players must get organized to solve the problems, divide the tasks among themselves to minimize the risks, and sometimes accept to sacrifice themselves for the common cause.&#10;&#10;The game is played on the map of the submarine. The conditions in the submarine are represented by three disaster tracks: Asphyxiation, Heat and Pressure. During the game, these conditions get worse, and if anyone of them reaches its maximum value, the submarine is lost. In addition, various emergencies can occur which have to be dealt with swiftly, or they'll also lead to the loss of the submarine.&#10;&#10;Each turn, a player can move to a new location, and perform some action there. Such an action can be repairs (which will improve conditions on the sub and/or fix emergencies), removing obstacles (unblocking hatches, removing flooding or extinguishing fires) or stocking up on equipment (which will help with later actions). Each action is paid for with time. The more time a player spends on an action, the greater the chance of success. After each player's turn, a number of events will happen; the more time was spent, the more events will occur. Such events will be the worsening of conditions in the submarine, or the triggering of emergencies.&#10;&#10;If the Gnomes can keep alive long enough, rescue will arrive and the game is won.&#10;&#10;",
        "artist": "Bruno Faidutti,Jef Gontier,Christophe Madura"
    },
    {
        "name": "The Office DVD Board Game",
        "description": "From the manufacturer:&#10;&#10;Join the cast of NBC's hit show &quot;The Office&quot; in a DVD game that features some of your favorite scenes. Answer questions about the clips to earn real Schrute bucks as you move along a game board that Dwight himself created. There's seven different kinds of trivia questions for lots of variety.&#10;&#10;Buy Microbadge&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "All Things Zombie: The Boardgame",
        "description": "All Things Zombie is a board game based on designed by Ed Teixeira of Two Hour Wargames and winner of the Origins 2005 Miniatures game of the year.&#10;&#10;Gamers play as survivors trying to survive in a world populated with zombies, fighting intensely satisfying tactical battles as they roam the devastated land. As the minis game designer, Ed Teixeira says, &quot;It's all about real life in an unreal world.&quot;&#10;&#10;Featuring amazing art, and a detailed, yet accessible, design, All Things Zombie is a gamers' dream. All Things Zombie will appeal to both strategy gamers and RPGers alike. Whether searching a police station for guns and ammo, gunning down hordes of zombies, or blasting through a running gun battle with other not-so-nice-survivors, All Things Zombie will keep you on the edge of your seat.&#10;&#10;All Things Zombie can be played solo, cooperatively, or competitively with everyone against each other. Whichever way you choose to play the game the zombies are run by the game mechanics and do not need to be run by one player.&#10;&#10;The game includes six scenarios as well as a campaign game that insures a high degree of re-playability. Easy to learn but difficult to master All Things Zombie will provide the gamer with many hours of fun.&#10;&#10;The new edition is now available titled All Things Zombies Reloaded.&#10;&#10;New Edition In the Series:&#10;&#10;    All Things Zombie: Reloaded&#10;&#10;&#10;&#10;&#10;",
        "artist": "Laurent \"Lohran\" Couturier,Paul Kime,Guillaume Ries,Marc von Martial"
    },
    {
        "name": "Partini",
        "description": "Partini&#10;The party game with a delicious twist!&#10;A great mix of games for the laugh-out-loud party crowd!&#10;&#10;Open up the game box. Sprinkle friends around the room. Mix up the coasters, Then pick'em at random to play 6 games. Stir in a dash of drama, a splash of laughs and a double shot of silliness, and you've got a happy hour that will last all evening long!&#10;&#10;Pick a coaster... play a game!&#10;&#10;Hum Punch:&#10;Hum it up in a musical challenge. No singing allowed! Hmm-Hmm-Hmm&#10;&#10;What Not:&#10;Don't say what it is, say what it's not! Will your team guess &quot;Hot Dog&quot; when you say, &quot;It's not a cool cat&quot;?&#10;&#10;Straight Up:&#10;Write something true or funny about a teammate. Will you get points for telling it like it is?&#10;&#10;Bouncers:&#10;Ready, aim, and fire balls into cups. The action changes with every draw of a card.&#10;&#10;Mime Twist:&#10;Zip your lips and act it out. Will your team guess &quot;Stud Muffin&quot; in the Lover Boy category?&#10;&#10;Clay Smoothie:&#10;Mold and fold clay into shapes that your teammates just might recognize... like a snowman.&#10;&#10;Contents:35 Coasters, 430 Cards, 5 Plastic Cups, 2 Plastic Balls, Container of Partini Modeling Compound, 2 Pads of Paper, 4 Pencils, Timer, Die and Rules.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Ghost Stories",
        "description": "Ghost Stories is a cooperative game in which the players protect the village from incarnations of the lord of hell &ndash; Wu-Feng &ndash; and his legions of ghosts before they haunt a town and recover the ashes that will allow him to return to life. Each Player represents a Taoist monk working together with the others to fight off waves of ghosts.&#10;&#10;The players, using teamwork, will have to exorcise the ghosts that appear during the course of the game. At the beginning of his turn, a player brings a ghost into play and places it on a free spot, and more than one can come in at the same time. The ghosts all have abilities of their own &ndash; some affecting the Taoists and their powers, some causing the active player to roll the curse die for a random effect, and others haunting the villager tiles and blocking that tile's special action. On his turn, a Taoist can move on a tile in order to exorcise adjacent ghosts or to benefit from the villager living on the tile, providing it is not haunted. Each tile of the village allows the players to benefit from a different bonus. With the cemetery, for example, Taoists can bring a dead Taoist back to life, while the herbalist allows to recover spent Tao tokens, etc. It will also be possible to get traps or move ghosts or unhaunt other village tiles.&#10;&#10;To exorcise a ghost, the Taoist rolls three Tao dice with different colors: red, blue, green, yellow, black, and white. If the result of the roll matches the color(s) of the ghost or incarnation of Wu-Feng, the exorcism succeeds. The white result is a wild color that can be used as any color. For example, to exorcise a green ghost with 3 resistance, you need to roll three green, three white, or a combination of both. If your die rolls fall short, you can also use Tao tokens that match the color in addition to your roll. You may choose to use these after your roll. Taoists gain these tokens by using certain village tiles or by exorcising certain ghosts. One of the Taoists has a power that allows him to receive such a token once per turn.&#10;&#10;To win, the players must defeat the incarnation of Wu-Feng, a boss who arrives at the end of the game. There are also harder difficulty levels that add more incarnations of Wu-Feng, in which to win, you must defeat all of them.&#10;&#10;There are many more ways to lose, however. The players lose if three of the village's tiles are haunted, if the draw pile is emptied while the incarnation of Wu-Feng is still in play, or if all the priests are dead.&#10;&#10;",
        "artist": "Pierô"
    },
    {
        "name": "Star Fleet Battles (Designer's Edition)",
        "description": "Star Fleet Battles Designer's Edition was the second version of the Star Fleet Battles series. An expanded &amp; enhanced version of the original zip-lock bag version. Contains 216 full-color die cut counters representing the ships of seven fleets, freighters, outpost stations, starbases, asteroids, planets, and monsters. Also contains a large hex map, charts, and ship displays.&#10;&#10;The Designer&rsquo;s Edition followed up the successful original Star Fleet Battles Pocket Game. The original version had optional advanced rules.  The Designer&rsquo;s Edition divided the rules into a &quot;Basic Game&quot; and an &quot;Advanced Game&quot; and rewrote much of the optional advanced rules into the &quot;Advanced Game&quot; and included more ships and counters for the newly added ships. This version also included the first expansions in the Star Fleet Battles series, and it had three pocket game expansions.&#10;&#10;There were two editions of the Designer's Edition.  The second edition had a different box cover (the same cover art as Star Fleet Battles Commander's Edition Volume I) and a larger sized rulebook.&#10;&#10;Re-implements:&#10;&#10;     Star Fleet Battles&#10;&#10;&#10;&#10;&#10;Re-implemented by:&#10;&#10;     Star Fleet Battles Commander's Edition&#10;     Star Fleet Battles Captain's Edition&#10;&#10;&#10;&#10;&#10;",
        "artist": "Alvin Belflower,Gary A. Kalin"
    },
    {
        "name": "Bharg",
        "description": "Bharg is a Decktet set-making game for 2 players.&#10;&#10;Object of the game: To bind all the cards in your hand.&#10;&#10;Setup: Each player is dealt a hand of seven cards. The dealer then deals one card face up to start a discard pile.&#10;&#10;As the game progresses, there will be two discard piles: one for aces, the other for number cards and crowns. The discard pile for aces is called the Ace Pile.&#10;&#10;Game play: On your turn, you may take the top card of the numbers-and-crowns discard pile or the top card of the deck. Then you discard a card.&#10;&#10;",
        "artist": "P. D. Magnus"
    }
]