[
    {
        "name": "Overthrone",
        "description": "from the Game Report:&#10;&#10;The game is played in a series of rounds during which each person plays a card to the center of the table. Usually these cards will fall into one of four Suits: Gold, Courtiers, Provinces and Musketeers. The cards feature ranks from 1-7, and after all cards have been played the person who played the highest card in each Suit collects all the cards of that type. Captured cards are then placed into a person's &quot;structure&quot;, which shows all the elements of a player's court. At the end of the game and at various points during play, a player scores points based on the value of the cards in his structure.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Relationship Tightrope",
        "description": "This game is a relative of the Raj/Hols der Geier family of games, the german title means Tightrope.  Each turn, a number of red and blue sticks are up for grabs.  The highest card played will take the blue sticks and the lowest card will take the red sticks.  The trick is that a red stick cancels a blue stick (that is, a well balanced tightrope walker), and the goal is to score as few points as possible.  However, there are two different ways of playing the game, depending on how players wish to play: strategic or otherwise.  The basic game has players simultaneously playing cards (ala Raj), whereas the strategic version plays like a trick-taking game with players selecting a card sequentially.&#10;&#10;Re-implemented by:&#10;&#10;    Yin Yang/Fifty-Fifty&#10;&#10;&#10;&#10;&#10;",
        "artist": "Alvin Madden,Thorsten Schäfer"
    },
    {
        "name": "5ive Straight",
        "description": "A very nice peg-board game, now re-issued. The plastic board has 100 holes, numbered in a oft reversing spiral with 1 in the center. A deck of numbered cards from 1-100 is shuffled and players start with 4 each. You may either play a card and stick a peg in, or draw a card, the hand limit being 4. And of course, you're trying to get five of your pegs in a row to win. Simple, except that playing a card allows you to place a peg in that number, or any empty number above. So with a 60, I can fill a space from 60 to 100, the outside rows effectively, but with a 6, I can play practically anywhere, especially the key points in the center area. The game is for 2-3 players, but works even better when played in partnership, your partner frustrated as you fill high numbers with low cards, you frustrated as your partner fails to block. Very good fun and nice for non-gamers.&#10;&#10;Similar to:&#10;&#10;    Take 5&#10;    5 in a Row&#10;    Go-Moku&#10;    Renju&#10;    Pente&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Mystery Rummy: Murders in the Rue Morgue",
        "description": "The second Mystery Rummy game.  In this one players investigate the murder from the Edgar Allan Poe story.  The basic mechanics (evidence card melds, gavel cards, etc.) are similar to the first Mystery Rummy game, but this one adds a hidden &quot;kitty&quot; in which players secretly place cards throughout the hand.  The first player to go out (before the draw deck is exhausted) wins the kitty in addition to their regular melds.&#10;&#10;Can be played as a partnership game with 4 players.&#10;&#10;",
        "artist": "Christine Conrad,Virginijus Poshkus"
    },
    {
        "name": "Schotten Totten",
        "description": "In Schotten Totten, nine boundary stones lie between you and your opponent.  In front of each, you build poker-like formations of three cards on a side.  Whoever plays the higher-ranking formation wins the stone.  And in a unique twist, you may use your powers of logic to claim a stone even before your opponent has played all three of his cards, by demonstrating that the stone is impossible for him to win.  Successfully claim five stones, or any three adjacent stones, and you win the game.&#10;&#10;In 2000 GMT published a rethemed version as Battle Line which includes an extra 10 &quot;tactics&quot; cards that modify the standard game play, and with cards that run from 1 to 10 (instead of 1 to 9).&#10;&#10;The 2004 Edition of Schottentotten has these &quot;tactics&quot; cards too.&#10;Schotten-Totten FAQ.&#10;&#10;",
        "artist": "Dorien Boekhorst,Jean-Baptiste Reynaud,Bärbel Skarabelo"
    },
    {
        "name": "Colorado County",
        "description": "In this unique game, players buy plots of land on a large, grass-covered board. After a random-like placement of twelve placement markers, the players simultaneously bid for cards which will allow the players to put control markers on the board in the positions indicated on the cards. However, only three cards are available, so only the top three bidders will receive a prize. As if the pressure wasn't enough, players receive a supply of bidding chips (called cowboy tiles) at the beginning of the game, which are only replenished by bidding lowest or zero (missing out on a card/placement) or by selling an owned plot (only 4 or 5 sales per game).&#10;&#10;Some of the plots that the players own will score differently, depending on the timing. At the beginning of the game, border plots are the key; later in the game, control of lakes and large masses of tokens are at a premium. The scoring values vary over the 4 rounds considerably.&#10;&#10;",
        "artist": "Sabine Stephan,Dirk Westphal"
    },
    {
        "name": "6 Billion",
        "description": "A game which combines the themes of exponential population growth with the colonization of our Solar System. The game starts with Earth's population of 6 billion divided between up to 6 factions, including at least one Neutral faction. Players send out colonists and migrants to harvest the riches of the planets and their moons, and the Asteroid Belt. Natural growth limits, plus the Four Riders Of The Apocalypse (War, Famine, Pestilence and Death), slow the growth of your populations. Score points at the end of the game for the biggest and most widespread populations - score double for your HIDDEN AGENDA, or any DISCOVERY cards you hold. Score points during the game for cards played which 'help' the Neutral(s) and other players' populations (in various wicked ways!). Brief Optional Rules allow a player to adjust the otherwise random turn order, and to score bonus points for having a populace which is wealthy, happy or concerned for all life (not just humans).&#10;&#10;",
        "artist": "Julian Johnson"
    },
    {
        "name": "DruidenWalzer",
        "description": "In this brain-burner from the Kosmos two-player series, players try to protect their own trees and steal their opponents'. Each player has four trees, all of which are inhabited by tree spirits (cards). Playing spirits (cards) from their hands causes the 'Druid's Dance', and the cards move around the circle of trees, possibly hurting or helping each side in the following contest of strength between matching druids. The game is won when either player has captured two of his opponents trees either through successful druid contests or because a tree has lost all of its tree spirits.&#10;&#10;Druidenwalzer is part of the Kosmos two-player series.&#10;&#10;",
        "artist": "Andreas Steiner"
    },
    {
        "name": "Lancashire Railways",
        "description": "Lancashire Railways is a train game about the birth of the first commercial railroads in Central England in 1829. The Silicon Valley of its day, Manchester was the hub of advanced engineering and manufacturing. Liverpool was the largest port and Manchester needed access for its exports of Cloth and Machinery. Lancashire Railways is set in this era of unrestrained growth and development. Each player starts a railway, and attempts to acquire right-of-way at auction. Players may finance their acquisitions with loans from the Bank, although the interest rate may become exorbitant.&#10;&#10;Lancashire Railways is the first game in the Early Railways Series and is the progenitor of later Wallace titles such as Age of Steam and Railroad Tycoon.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Express",
        "description": "Building trains is an integral part of America's history. Now the tradition continues with Express, a unique card game for the 90's. Reminiscent of classic card games but including new play twists, Express is as easy to learn as rummy. Players start with one or two car trains and build on their meld to maximize points and bonuses. But players must be wary of train wrecks and derailments. Unique play allows partners to pass key cards to each other during the game.&#10;&#10;The cards represent various train cars, freight, passenger and way, diesel locomotives and disasters.&#10;&#10;Cards are shuffled and dealt to each player, and remaining cards form a draw pile.  Turns consist of drawing either two cards from the face down draw pile or one face up card from the discard pile, melding cards from one's hand and discarding a card.  Players must end their turns with no more than five cards in their hands.  Players meld cards to form freight trains or passenger trains, or they meld individual way cars.  Freight trains are melded so that all the cars are of the same type, such as box car, tank car or auto carrier.  However, a wild card car can be used to have two types of cars in the same freight train.  Passenger trains may contain any or all of the different types of passenger cars.  Each train needs a locomotive which can be any card placed face down.  There is a locomotive pictured on the back of each card.  During the melding phase of their turn, players may exchange face down locomotive cards with any card in their hand.  This feature allows partners to share cards when the game is played by four or six.&#10;&#10;Disaster cards may be played as discards.  They can change the direction of play, allow theft of an opponent's car or wreck an entire train.  Way car cards either absorb the damage of corresponding disasters or remedy them in a fashion similar to the Coup Fourre' of Mille Bornes.&#10;&#10;Hands end when a player or partnership &quot;goes out.&quot;  To do this the player's melds must consist of at least one five car train, one four car train and all other trains must be at least three cars long.  The player then melds all but one card which he discards.  Trains and way cars are scored.  Cards left in players hands count against them.&#10;&#10;The game is played in hands until one player or partnership accumulates the points needed to win.  The player or partnership with the most points at the end of that hand wins.&#10;&#10;",
        "artist": "David B. Bromley,Ike Scott"
    },
    {
        "name": "Polarity",
        "description": "Once rare and mysterious, now thankfully back in print, Polarity is a 2-player game using lots of magnets (so keep it away from credit cards, watches and so on). The plastic coated pieces look like Reversi/Othello discs, with black and white faces. Each piece contains a magnet, with the black side being North and the white side being South. Each player gets a stack, one plays black one plays white. A neutral red piece goes in the center of the game cloth and players start by place five each of their stack around the cloth. These flat pieces are the foundations.&#10;&#10;On your turn, you take one piece from your stack into your hand, then bring it to bear against one of your foundations. You keep your color face up, so the opposing polarity bears against your foundation piece. This way, you can very carefully balance your new piece in the air against the foundation stone! This is just fantastic to see. The board fills up with lots of discs teetering at 45 degrees, ready to fly about if the balances are upset.&#10;&#10;Get it right and your stack is one piece smaller. Make a mistake and  your turn ends. Either a piece falls flat somewhere (becoming a new foundation) or pieces jump together making towers or into your hand. Your opponent takes the tower you accidentally made and places it their side up where they like. Towers get you points at the game end.&#10;&#10;If a piece jumps to the stone in your hand, they both go back on your stack. The game ends when one player finishes their stack and points are calculated based upon towers and discs remaining. Causing the red piece to jump to another loses you the game outright.&#10;&#10;To be honest, the scoring matters less than the tension and joy of watching the natural but weird force of magnetism at play. Because the discs are discs, they can easily roll around, causing domino effects. Because the towers increase the magnetic pull, they make it so much harder to find a safe spot to play.&#10;&#10;If you want a strange fun game to amaze your friends and family, Polarity is hard to beat. If you want a serious 2-player game, you may prefer other abstracts. The rules could do with being shorter and simpler. Otherwise, a joyous game.&#10;&#10;Comment from the designer &quot;Polarity began as a sculpture. Polarity is zen. It represents that point where absolute opposites merge. In this case, the poles of the magnetic field. The quality of play is determined by one's ability to perceive balance in the midst of extremes. Each game is unique and can never be reproduced. It is in that uniqueness that I was awarded a patent from the U.S. Pat. &amp; Trdmks. office for magnetic principle. The strategy must be viewed 3-dimensionally. It is not just control of a 2-dimensional board but must include the space above and below the playing surface.&quot;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "X Pasch",
        "description": "This vindictively fun game is ostensibly about gaining control of businesses, which are represented by cards.  Every turn, each player gains income from companies where he has the most boardmembers, then rolls three dice and uses them for various purposes:  bringing a new business into the game, adding boardmembers to existing businesses, or drawing new cards.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Heimlich & Co.",
        "description": "The game board in Heimlich &amp; Co. is an oval movement track, with points allocated to the various spaces. Seven differently colored &quot;spies&quot; are placed on the board. On a player's turn, he rolls a dice, then moves any combination of characters forward that number of spaces. The newly-moved spies then score points based on their new location. However, the trick here is that each player's color isn't known until the end of the game, so players are encouraged to deduce which color belongs to whom.&#10;&#10;Heimlich &amp; Co. includes advanced rules which allow players to score more points at the end of the game for correctly guessing everyone's identity. (&quot;Heimlich&quot;, by the way, is a German adjective meaning secretly and slyly, so Heimlich &amp; Co. translates as Clandestine and Company!)&#10;&#10;",
        "artist": "Oliver Freudenreich,Dietrich Lange,Matthias Wittig"
    },
    {
        "name": "Turf Horse Racing",
        "description": "Classic Knizia betting and racing game. Initially players bet on the horses as they are dealt from the deck, then the horses race on the die roll, the course being 40 spaces. The cards &amp; die have 4 symbols, jockey's hat, boot, horse shoe and horse's head; the head is on the die 3 times, giving it a 50% chance of being rolled. The cards have different values against each symbol, showing how far they move when that symbol is rolled. But the number against the horse's head is always 1 to 7 for the same horse. So Raven Beauty always has a 50% chance of moving 7 spaces, Lagoon Lady moves 4, and poor old Roamin' Emporer goes 1 space. The trick, and it's a good trick, is that the other 3 values vary wildly for the lower horses, making them outside chances to win. One lucky roll and Roamin' Emporer can leap forward 20 places! So do you bet on the steady goers, or take a gamble on the nags? Players take turns to roll the die and choose which horse moves, so with a good roll you move one you've bet on, with a bad roll you move someone else's horse. Points are awarded to 1st, 2nd &amp; 3rd home, and one of your bets is a doubler.&#10;&#10;Re-implemented as:&#10;&#10;    Winner's Circle / Royal Turf &#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "TurfMaster",
        "description": "Turfmaster is a horse-racing game for two to eight players, played over a &quot;meet&quot; of three races.  The board is two-sided, and hurdles are provided so that players can choose flat racing or steeplechases (races with fences that the horses must jump).&#10;&#10;Players each have their own deck of 32 movement cards, dice and a horse of their own colour.  Ten cards are randomly selected for each race, with two cards left over which can be drawn for use in any one race.  Cards played in a race are removed from the game.&#10;&#10;A round consists of two parts.  First all players simultaneously select a card and move the number on the played card (if able), in position order.  After this, a single pair of dice is rolled by one player (the rolling player rotates throughout the game).  The player rolling the dice decides if all horses move the value of one or both of the dice and all horses move (again in position order).&#10;&#10;Like a real horse race, inside position is important.  The game has rules for lane changing, blocking and handicaps on the leaders which restrict the values of the cards the players whose horses are in the first three spots are able to play, or how much (or even IF) a horse in one of those spots can move on a dice roll.  To try to counter this, players have &quot;joker&quot; cards which can be used to avoid being handicapped when in one of the first three spots.  The steeplechase introduces additional rules for jumping fences.  Horses can be forced to pull up short of a fence (because they are blocked on the other side and have nowhere to land safely) or can occasionally fall if their movement ends on a fence - which takes four movement points to jump.  Players will need to plan their moves carefully to prevent other players from getting their full amount of movement, and to avoid having players doing that to them.&#10;&#10;The first four horses to finish each race are awarded points towards their final total.&#10;&#10;The game comes in two versions.  The regular version which has single-colour plastic horses, and the &quot;DeLuxe&quot; version which has hand-painted pewter horses (each jockey wears a different coloured jersey) - each in a little protective case.   In addition, several other tracks are available - there are two course collections which can be purchased separately and a third (web-published) collection.&#10;&#10;",
        "artist": "Stefan Niehues,Peter Röseler"
    },
    {
        "name": "Pirateer",
        "description": "The object of the game is to steal the treasure with one of your ships and get it to your home port - or by capturing all your opponents's ships.&#10;&#10;Nine extra scenarios are included - from &quot;Shipwreck&quot; to &quot;Nuke-A-Teer&quot;(!) - including one for up to 8 players (requires two games).&#10;&#10;1996 Mensa Select&#10;&#10;",
        "artist": "Carol Baker,Mark Ferrari"
    },
    {
        "name": "Corruption",
        "description": "Described by the designer as a cross between Doris &amp; Frank's Banana Republic and stud poker, this game casts players as construction company owners who are seeking to bribe various government officials for lucrative building contracts.  Each turn, six new contracts are up for grabs, and players compete for them by placing secret bribe amounts.  At the end of each round, whoever offered the most bribe money for each contract gets it.  Special cards, whose backs look just like bribe cards, can alter the contest significantly, but while the bribe cards are recycled after each of the three rounds, the special cards are not.&#10;&#10;",
        "artist": "C. Brent Ferguson,J. Scott Reeves,Cyril Saint Blancat"
    },
    {
        "name": "Finale",
        "description": "Another game in Kosmos two-player series, this game casts players as soccer (football) coaches on opposite teams.  Players use special square cards to represent the players they have in each of the positions: strikers, mid-fielders, defenders, and goalies.  Each turn, one of the two players will be the offense based on a simultaneous selection of cards from their respective play books.  Then players allocate their players to the current play, which rotates the used players.  A player card has a number of soccer balls on each edge, which tells how many skill points the player will contribute to a given play, and using the player (thusly rotating him) might actually weaken him for the next use.&#10;&#10;Re-implemented as:&#10;&#10;    Tooor!&#10;&#10;&#10;&#10;&#10;",
        "artist": "Marion Pott"
    },
    {
        "name": "Die Mauer",
        "description": "Each player has a matching set of pieces, Walls, a Tower and a Gate, and tries to clear their hand first or is deducted points. Each turn, one player is Master Builder, and all players secretly choose a piece in their fist. When revealed, if the Master Builder chose uniquely, that piece is added to the wall, but if any player chose the exact match, they get to build instead.&#10;&#10;Walls can go next to anything, but Towers or Gates may only sit next to walls.&#10;&#10;Players have the option of an empty fist too. If the Master Builder is the only empty fist, it gets to pick from its hand. If one other player had an empty fist, they secretly pass a piece to the Master Builder. If more than one empty fist matches the Master Builder's choice, no-one builds.&#10;&#10;Play continues with the next player being the Master Builder and so on until somebody clears their hand. If you still hold pieces, Towers lose you 15pts, Gates 10pts and the Walls from 1-6 pts. Play a few rounds and total the scores.&#10;&#10;Group think and the building rules have some control, but this is a nice game of bluff and mind-reading. Get it right, and you'll sail through. Get it wrong and you'll rack up the points! Good fun, good for a pub or bar, nice bits and very quick play.&#10;&#10;",
        "artist": "Thomas Fackler"
    },
    {
        "name": "Brawl",
        "description": "From the Cheapass Games web site: (6 November 2011)&#10;&#10;History: In 1999, James Ernest refined his notion of Real Time card games. Building on his first real time card game, Falling, which was multi-player with a dealer, he created Brawl, a two-player card game with no dealer.&#10;&#10;Summary: Brawl is a lightning-fast combat game where two players burn through their 35-card decks in about 35 seconds. Each deck contains a unique mix of cards, and each deck requires a slightly different playing style to win.&#10;&#10;Mechanics: Each player takes one deck, sets a &quot;base&quot; card on the table, and begins to play. Players play their cards (Hit, Block, Clear, etc.) as fast as they like, trying to win each Base by playing more Hits on their own side. At the bottom of both decks are three Freeze cards. When every base is Frozen, the game is over.&#10;&#10;",
        "artist": "Phil Foglio,Ryan Kinnaird,Maxime le François,Bryce Nakagawa,Brian Snoddy"
    },
    {
        "name": "Dinosaurs of the Lost World",
        "description": "One of Avalon Hill's family games that appeals to gamers as well.  Players control different expeditions which they equip to explore the Lost World.  Victory is achieved through finding various species of dinosaurs and collecting specimens.  The game comes with a modular board to ensure that no two games are alike, and lots of dinosaur stand-up pieces.  One of the most entertaining parts of the game occurs when a dinosaur chases an expedition back to base camp!&#10;&#10;&#10;This Avalon Hill game has features beyond most family games that appeals to strategy gamers and increase replayability.  First, the board is modular; the location of all the dinosaur sites and required items is completely random every game.  This sort of feature, unusual before the German games of the 90's, puts Dinosaurs of the Lost World years ahead of its time.&#10;&#10;Second, players may influence and interact with other players both indirectly by moving dinosaurs in their path or directly by either trading items amicably or attacking their expedition mercilessly.&#10;&#10;Third-The sharp limits set out in the rules on weapons and ammunition force the players to pick their battles carefully and makes each dinosaur encounter thrilling and high stakes.  Followed strictly, the rules give the dinosaurs a real possibility of winning a combat and requires strategic planning from players if they hope to avoid being chased right out of the game.&#10;&#10;Fourth- The consequences of losing a dinosaur combat are serious.  During the chase you may lose one or more useful tools and even victory points.  Once you escape from the dinosaur, you are returned to camp and lose your next turn.  Because actions that can be taken in camp are somewhat limited, a lost dinosaur battle completely knocks out one turn and diminishes what can be accomplished in two additional turns.&#10;&#10;Finally- The game has excellent style.  The dinosaur areas are displayed in a unique &ldquo;comic book&rdquo; format, allowing for great enjoyment and immersion from all players regardless of age.&#10;&#10;",
        "artist": "James Talbot"
    },
    {
        "name": "Kahuna",
        "description": "Originally published in 1997 as Arabana-Ikibiti by the designer's own publisher Bambus Spieleverlag, then reprinted by Funagain in the U.S., Kosmos' Kahuna &ndash; part of its Kosmos two-player series &ndash; is the best known implementation of this design.&#10;&#10;It's a two-player game, played on a board depicting twelve islands. Players use cards to place bridges between these islands or remove opponent's bridges. If you get the majority of bridges around an island, you place one of your marker stones on it and also remove any of your opponent's bridges to that island &ndash; which might cause them to lose a bridge majority on an adjacent island and lose a marker stone there.&#10;&#10;The game is played in three rounds. A round ends when all cards from the face down deck and the three face up cards have been taken. Then points are scored for the islands with a marker stone on them. The game can also end sooner when one player has absolutely NO bridges left on the board.&#10;&#10;The Kosmos edition has excellent graphics and nice wooden pieces and plays very well.&#10;&#10;Reimplements:&#10;&#10;     Arabana-Ikibiti&#10;&#10;&#10;&#10;&#10;Reimplements:&#10;&#10;     Kanaloa&#10;&#10;&#10;&#10;&#10;",
        "artist": "Michaela Kienle,Anke Pohl,Thilo Rick,Claus Stephan"
    },
    {
        "name": "Der dreizehnte Holzwurm",
        "description": "The name of the game translates as something like 'The Thirteenth Woodworm,' but the theme doesn't have much relevance to the game.  Similar to Kramer's other creations, 6 Nimmt! and Hornochsen, players are putting positive and negative cards into groups and either trying to take the resultant points, or avoiding the subject all together.  This game falls in between the previous incarnations, being less brain-burning than Hornochsen, and more strategic than 6 Nimmt!.&#10;&#10;",
        "artist": "Jo Hartwig"
    },
    {
        "name": "Diskwars",
        "description": "A Fantasy themed miniatures wargame without the miniatures.  Will you play as the ubiquitous Elves, the barbaric Uthuk Yllan, the stalwart Dwarves, the vile Undead, the medieval Knights, the desert dwelling Acolytes, the mighty Dragon kin, or the vicious Orcs?  Players choose a faction from the eight available in the base game and an army point value for the battle. Each must then build an army using the double-sided cardboard disks and battle it out.  At least half of the army points must be from one faction and the remaining points are made up of like aligned or neutral disks and spells.&#10;&#10;Each double-sided disk represents either a faction homeland (your starting area), a terrain (ruins, forest, swamp etc... with effects on combat and line of sight), a spell(levels 1-3), a missile or one unit with its alignment (Good, Neutral, or Evil) with values for its Attack, Defense, Toughness, Movement and the army point cost of the disk. The disks have varying sizes (Giants and Dragons tend to be larger) and most units have a wide variety special abilities such as flying, the spell-casting ability or the missile ability to launch boulders, bolts, arrows or fireballs for example.  Players take it in turn activating 3 units(disks) and resolving battles, casting spells, and firing missiles.&#10;&#10;Activated Unit disks are moved around the table by flipping them end over end a number of times up to their movement value.  If the disk lands on top of an opposing army disk a battle ensues with the top disk (the attacker) doing its attack damage value to the lower disk (the defender) who applies its defense value to the attacker if the damage is equal or greater to either unit's toughness it is either wounded or killed. Combats can involve numerous disks upon top of each other and are resolved top down. Missiles can be fired by missile capable units at disks within range by dropping them upon the target from a foot above the table. Those which land upon the target do damage otherwise they miss or can hit other disks they land on.  This can result in 'friendly fire' damage on your own troops and adds an element of luck/dexterity to the game.&#10;&#10;The game rules come with multiple scenarios that accommodate 2 to 8 players.  The  victory goal of each scenario can vary from king of the hill, to enemy elimination, to just about any combat scenario victory condition one could imagine.&#10;&#10;",
        "artist": "Brian Ewing,Louis Frank,Earl Geier,Fredd Gorham,Chad Jasper,Eric Kemphfer,Yeng Khang,Zach Lohse,Bradley McDevitt,Ben Prenevost,Hian Rodriguez,Scott Schomburg,Brian Schomburg,Tyler Walpole"
    },
    {
        "name": "Wildlife Safari",
        "description": "Wildlife Safari was originally published by AMIGO Spiel + Freizeit GmbH as Flinke Pinke. This game is one of those 'painfully simple' Reiner Knizia games. There are five different colored chips, with six cards, zero through five, in each of the colors.  The cards are dealt out, and then players take turns playing a card and taking any available chip.  When one color has all six cards played on it, then the game is over, and players use the last card played in each category to value their chips.  The highest total value wins.&#10;&#10;Description of 1994 Milton Bradley re-issue Quandary, for 2-4 players:&#10;&#10;A game of placement, shares and nerve by Reiner Knizia, this is a lovely edition with nice, heavy tiles akin to Mah-jong pieces in weight and feel. Players in turn lay numbered pieces on tracks curling to the centre, and then take a share in any colour. The round ends when a track is filled. Scoring is based on your total share multiplied by the value of the final tile played on each track. So if you are collecting blue shares, I'll try and lay a blue 1 as near last as possible. Then you'll want to play a blue 5 to raise your possible score, but must take a share in a different colour. Same game, different production.&#10;&#10;Description of 2003 Fantasy Flight Games re-issue, Loco!, for 2-4 players:&#10;&#10;Here is the FOURTH version of the game that was originally Flinke Pinke only this time, the added &quot;rule&quot; is that whenever you play a card with a value of &quot;0&quot;, you must say &quot;Loco!&quot; aloud or forfeit your opportunity to select one of the colored chips.  Apart from that, the game is identical.&#10;&#10;Description of the 2010 Eagle-Gryphon Games games re-issue, Botswana, for 2-5 players:&#10;&#10;This fifth version of the game adds a safari theme. Rules and gameplay are unchanged from the original version (no rules about animal noises), but the chips are replaced by plastic animal figures and the cards are covered in matching animal fur patterns. In 2014, Gryphon Games released a new edition of this game as Wildlife Safari, featuring the same components and artwork but changing the title of the game.&#10;&#10;",
        "artist": "Charlie Bink"
    },
    {
        "name": "Tom Clancy's Politika",
        "description": "from User Review:&#10;Tom Clancy, the famous author of military-style thrillers, long been a wargaming fan. Now, he has entered into the wargame market with Politika, produced by a company of his own, Red Storm Entertainment.&#10;&#10;The premise of the game is that Yelstin has died and there is now a power struggle amongst various factions within Russia to take control of the vast country. The game is billed as 'The Strategy Game of political intrigue in modern day Russia'.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Shanghai",
        "description": "Players bid for the right to chose which of three locations the 'marker' will go.  Once there, any of the players can score for having a corresponding card for that location.  However, things are complicated by the fact that your payout for using the card varies with a clock type of mechanism.  The goal of the game is score enough points to overtake a non-player scoring token which advances throughout the game.&#10;&#10;Awards&#10;&#10;1997 Vuoden Perhepeli&#10;&#10;Re-implements:&#10;&#10;    Holiday&#10;&#10;&#10;&#10;&#10;",
        "artist": "Klaus Albrecht,Clive Davis,Wolfgang Scheit,Walter Wagner"
    },
    {
        "name": "Gold Connection",
        "description": "Borrowing elements of his classic 'push your luck' game, Can't Stop, Sackson places participants in the role of gold looters in this game.  Players move around to various locations inside a vault filled with gold bars.  Dice are rolled to capture bars with numbers on them, with the idea that bigger-numbered bars that are far from your starting location on that turn are the most difficult gold bars to acquire.  You can continue collecting gold on your turn until you either miss a dice attempt or decide you've collected enough for one turn.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Elk Fest",
        "description": "Part of the Kosmos two-player series, Elk Fest or Elchfest is a two player dexterity game in which players attempt to navigate their moose across a river along a series of stones. Players take turns flicking 2 stones, represented by disks, and moving their moose along said stones. Care must be taken when moving ones moose as if the front and back hooves of the moose do not rest atop of the stones the players turn immediately ends, the moose is returned to its previous position, and the opposing player may flick 3 stones. The winner is the first person to move their moose to the opposing river bank!&#10;&#10;Game description from the publisher:&#10;&#10;Two elk (Jule and Ole) stare at each other across a river. Longing for the greener grass where the other elk is, they set out to beat each other to the opposite bank! In Elk Fest, move your elk to the other bank by flicking wooden disks across the table and balancing your elk on them. Can your elk get to the greener grass across the river? Good grazing is just a stone's flick away!&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Worm Up!",
        "description": "In this fun, goofy game, each player controls a worm formed from several lined-up discs.  A turn consists of all players secretly choosing on their dice the amount that they want to move.  When the choices are simultaneously revealed, all players who chose the same number as someone else lose their movement for that turn.  All other players move their worms according to their dice, taking the appropriate number of discs from the back of the worms and adding them to the front, sometimes curving a bit in an attempt to cut off other worms' movement.&#10;&#10;",
        "artist": "Gabriela Silveira"
    },
    {
        "name": "Weer en wind",
        "description": "An unusual game based on the theme of building hotels and cruise ships and trying to ensure that they get idyllic weather. The weather is controlled by clear tiles that overlay the squares on the board, and can be moved - but the wind can only change by a very limited amount each turn.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Zoon",
        "description": "This is a non-collectible card game; it comes in sets of two pre-built factions (e.g. Rhinogoths &amp; Monkus or Warus &amp; Boarix). The Zoon are warring tribes of genetic experiments that humans left behind on Earth. Half human, half animal, the Zoon fight while humans observe their behavior from space. Essentially, Zoon is Chess with cards.&#10;&#10;The El Moondo version came in sets of four factions decks, and contained rules for a four-player version, in addition to the standard two-player game.&#10;&#10;",
        "artist": "Robert Cepo"
    },
    {
        "name": "Dschungel",
        "description": "A paraphrased description of the game from Adlung Spiele:&#10;&#10;Trapped in the jungle, the players race to break through the engulfing maze of undergrowth. Only now and again are there a few free paths in an otherwise seemingly impenetrable primeval forest. Three stage goals must be reached, so be sure not to lose perspective!&#10;&#10;",
        "artist": "Jürgen Martens"
    },
    {
        "name": "D'r Af",
        "description": "The object of the game is to be the first to drive your car off the side of the table. A road which has as many lanes as contestants is constructed from a number of gray road tiles. Each turn, players select a card from 2 to 10, which is the number of spaces they're moving. After these are revealed remembering that players cannot duplicate a card played by someone previous, players move forward down the road. Each of the cards allows for a certain number of road tile placements from your supply, a number of maneuvers per turn, and the damage your current speed with inflict should you careen into another car. Additionally, a percent of the tiles have special actions associated with them, which give the car on them the ability to jump, or hit a semi-truck, or skid out of control, or just plain slow down 'cuz there's a Smokey comin' on his flipside... The game is over when a car reaches the edge of the table, which gives the game a variable ending. Plus if ever a group of cars pulls out to a six-space lead, then all trailing cars are eliminated.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Die Erben von Hoax",
        "description": "This is a reworking of an older Eon game known simply as Hoax.  The new additions include a new character as well as a point system to replace the all-or-nothing nature of accusations.  The basic idea is to pretend to be somebody you are not while working towards the goal of figuring out who other people are. Each player is assigned one of seven different characters -- each with its own unique abilities -- but can pretend to be any character and use its corresponding powers. Abilities are used to acquire three different types of goods, which can be spent to get clues to opponents' identities. If the majority of the other players think you're pretending to be a character that you're not, you must either admit that you are not that character (and permanently lose the use of its power), or reveal that you are and win the game.&#10;&#10;Is a re-implementation of:&#10;&#10;    Hoax&#10;&#10;&#10;&#10;&#10;",
        "artist": "Georg von Westphalen"
    },
    {
        "name": "Around the World in 80 Days",
        "description": "Players start out in London and race around the world. By skillful use of cards, each player tries to be the first to get back to London.&#10;&#10;This is an action game without dice. Using cards representing different travel modes, players try to use as many of their cards as they can. Playing all of ones cards during a turn, allows one a bonus move.&#10;&#10;",
        "artist": "Klaus Bürgle,Th. A. Weiss"
    },
    {
        "name": "A to Z",
        "description": "Each player receives a plastic board with 25 spaces on it labeled A to Z (with X and Y sharing a space). The playing board has spaces marked 15, 30, hand and 2. Each player takes a turn moving the single pawn around the board. Once you land on a space, another player draws a card (each with 6 categories on them), looks up your die roll on that card and reads the corresponding category. If you landed on a 15 or 30 you have that many seconds to think of as many words in that category as you can and for each word you can come up with, you cover the appropriate space on your plastic board with a chip. The aim is to be first to fill all 25.&#10;&#10;If you land on a hand, you get 15 seconds and choose another player. For every word you think of you can pull a chip off of their board that starts with the appropriate letter. If you land on the 2 space you can cover 2 spaces on your board for free (handy for Q and X, Y, Z).&#10;&#10;The timer is obnoxiously loud by intent (very distracting) and flips over very suddenly, scaring people who aren't used to it, to mark the end of the time limit.&#10;&#10;Basically, this is a very simple word enumerating party style game that's quick and easy to learn and frustrating for people with poor vocabularies or stalled minds.&#10;&#10;Many years ago, while still known as Nelospelit, Tactic already used the title Sanamania for an earlier word game; these are different games, although some similarities do exist.&#10;&#10;",
        "artist": "Gordon Barlow"
    },
    {
        "name": "Edison & Co.",
        "description": "Mad professors test their experimental racing machines on the lab roof. Each player has a favorite machine, a set of movement cards for the racers and a secret score card. The score card shows the actual result you want to achieve, each player wanting the 4 cars to finish in a different order. The movement cards have 3 functions, showing number of spaces to move, or direction to move in, or 2 vehicles out of the 4 available that you could move. Start order changes each turn, the first player chooses one card of the three available, the next chooses a different type of card, the 3rd player the last type. The final player decides which car moves of the 2 cars that have been chosen as possible cars to move. The board also has random oil patches and hazards.&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Rail Baron",
        "description": "Rail Baron is one of the earlier train games - boardgames with a railroad theme.&#10;&#10;Players move trains along historical USA railroad lines and collect delivery payoffs. They compete to purchase the railroads in order to assemble a network that gives access to important map destinations while simultaneously trying to prevent their opponents from doing so.&#10;&#10;From the Box (Avalon Hill Bookshelf Game)&#10;Only in America!&#10;&#10;You are living in the heyday of the locomotive. You are Jay Gould. And you have just added another railroad to your vast railroad empire. Flushed with success, you now retire to the sartorial splendor of your very own Pullman Palace Car. The dream ends. You awaken to reality with the thought... &quot;just another fantasy.&quot; Ahh, but for the grace of Avalon Hill, you dream continues.&#10;&#10;Here, in Rail Baron, you become a latter day Gould, or a Cornelius Vanderbilt, or any of those menacingly infamous moguls whose wizardry and acumen established the criteria for which business success was to be judged in decades to come.&#10;&#10;Rail Baron is played on a large board of the United States RR network. in fact, it comes in three separate boards. Laid end to end, it spell out America and portrays the 28 major rail lines and major cities they connected during the halcyon days of railroading.&#10;&#10;You start with $20,000 - and a train. You make money on trips from city to city. Pretty soon you've got enough money to build up your empire (you can buy the B&amp;O and C&amp;O for just $44,000). More holdings bring more money your way (track rental) from your opponents.&#10;&#10;With many new nuances of strategy, it becomes a game where fortunes see-saw until the last rail baron is bankrupt - or has accumulated the $200,000 needed to win.&#10;&#10;All of this may take 3 to 4 hours. But it's great fun for 3 to 6 people, ages 10 &amp; up.&#10;&#10;Contents: United States Mapboard, rules folder, Payoff chart, 28 Rail Line Title cards, 6 Express Train cards, 6 Superchief cards, 6 sets of tokens and matching colored chips, 2 white and 1 colored dice, pack of play money.&#10;&#10;The GENERAL Index  Article List:&#10;&#10;    The GENERAL Vol.15,No.2&#10;        Rail Baron &ndash; &ldquo;Strategy for the Fourth Man - A Rail Baron Clinic&rdquo; (Strategy) Michael Gray&#10;    &#10;    The GENERAL Vol.16,No.5&#10;        Rail Baron &ndash; &ldquo;The Short Game and the Two-Man Game&rdquo; (Variant Discussion) Gary Charbonneau&#10;    &#10;    The GENERAL Vol.21,No.5&#10;        Rail Baron &ndash; &ldquo;MOVIN' ON: Strategies &amp; Tactics for Rail Baron&quot; (Strategy) By Bertrand Bauer&#10;    &#10;    The GENERAL Vol.25,No.5&#10;        Rail Baron &ndash; &ldquo;Freight Train-  A Rail Baron variant&rdquo; (Variant) Kenneth Waido&#10;    &#10;    The GENERAL Vol.23,No.6&#10;        Rail Baron &ndash; &ldquo;My Favorite Lines - The Railroads of Rail Baron&rdquo; (Strategy) by Matt Ellis&#10;    &#10;    The GENERAL Vol.28,No.3&#10;        Rail Baron &ndash; &ldquo;Government Intervention in Rail Baron- A variant for Avalon Hill's game of empire-building&rdquo; (Variant Discussion) Stephen Taylor, Jim Brown and Alan Marian&#10;    &#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "1830: Railways & Robber Barons",
        "description": "1830 is one of the most famous 18xx games. One of the things some gamers like about this game is that the game has 'no chance' element. That is to say, if players wished to play two games with the same moves, the outcome would be the same also.&#10;&#10;This game takes the basic mechanics from Tresham's 1829, and adds several new elements. Players are seeking to make the most money by buying and selling stock in various share companies located on eastern United States map. The stock manipulation aspect of the game is widely-regarded as one of the best. The board itself is actually a fairly abstract hexagonal system, with track tiles placed on top of the hexes. Plus each 18xx title adds new and different elements to the game. This game features private rail companies and an extremely vicious, 'robber baron' oriented stock market. A game is finished when the bank runs out of money or one player is forced to declare bankruptcy, and the player with the greatest personal holdings wins.&#10;&#10;The 2011 version of 1830 was published by Mayfair Games in partnership with Lookout Games of Germany. This publication was developed under license from Francis Tresham in co-operation with Bruce Shelley (the original 1830 developer). This version contains rules and components for Francis Tresham's original classic design, a faster-playing basic game, and new variants from some of the world's best railroad game developers.&#10;&#10;",
        "artist": "Mike Atkinson,Jared Blando,Charles Kibler,James Talbot,Mark Zug"
    },
    {
        "name": "1835",
        "description": "This 18xx game takes the basic mechanics from Tresham's 1829 and adds several new elements.  Players seek to make the most money by buying and selling stock in various rail companies located on a German map. The board itself is actually a fairly abstract hexagonal system, with track tiles placed on top of the hexes.  Players buy and sell stock in various share companies, whose actions are controlled by the majority stockholder.  The stock manipulation aspect of the game is not as brutal as in 1830.  Plus each 18xx title adds new and different elements to the game.&#10;&#10;This game features minor rail companies, layered stock offerings, and the formation of the Prussian railroad from the minor companies. A game is finished when the bank runs out of money, and the player with the greatest personal holdings wins.&#10;&#10;",
        "artist": "(Uncredited),Bernd Brunnhofer"
    },
    {
        "name": "1856",
        "description": "This 18xx game takes the basic mechanics from Tresham's 1829, and adds several new elements. Players seek to make the most money by buying and selling stock in various rail companies located on an map of eastern Canada. The board itself is actually a fairly abstract hexagonal system, with track tiles placed on top of the hexes. Players buy and sell stock in various share companies, whose actions are controlled by the majority stockholder. The stock manipulation aspect of the game is widely-regarded as one of the best. Plus each 18xx title adds new and different elements to the game.&#10;&#10;This game features the formation of the Canadian Government Railroad, and government loans as well as major obstacles for railroad growth. A game is finished when the bank runs out of money or one player goes bankrupt, and the player with the greatest personal holdings wins.&#10;&#10;",
        "artist": "John Kamacher,Mike Russo,Chris Vande Voort"
    },
    {
        "name": "1870",
        "description": "This 18xx game takes the basic mechanics from Tresham's 1829, and adds several new elements. Players seek to make the most money by buying and selling stock in various rail companies located on a map of central United States. The board itself is actually a fairly abstract hexagonal system, with track tiles placed on top of the hexes. Players buy and sell stock in various share companies, whose actions are controlled by the majority stockholder. The stock manipulation aspect of the game is widely-regarded as one of the best.  Plus each 18xx title adds new and different elements to the game.&#10;&#10;This game features private companies with special money-making capabilities and sizeable map which encourages most (if not all) share companies to become profitable.  A game is finished when the bank runs out of money, and the player with the greatest personal holdings wins.&#10;&#10;",
        "artist": "John Kamacher,Mike Russo,Chris Vande Voort"
    },
    {
        "name": "Thunder's Edge",
        "description": "From the website&#10;Thunder's Edge is a science-fiction board game of politics, strategy and giant mecha for two to five players. Each player controls one of Earth's factions, each of which is trying to exert power over the planet Thunder's Edge. To win, players must gain the support of important lobby groups within the government, hold key locations on Thunder's Edge by military force, and fight for control of vital off-world locations.&#10;&#10;from review by Nickjost:&#10;Play begins by setting up the board. The board is composed of hexes a la Settlers of Catan. These hexes are dealt out to the players who may look at them and then deploy them face down one at a time. The players then receive an initial allotment of money. They may spend this money to purchase units for the initial planet-fall. Any money that isn't spent is doubled. Opening strategies are based on buying enough infantry to hold any cities that you can know of (from the hexes dealt) and deploying those infantry to guard those cities.&#10;&#10;There are also several other components. First, is the tension track. This is essentially a turn marker. Once the tension track is exhausted the game ends. There are also a few off-world locations that provide special bonuses. Military units also make use of the transit and orbit boards. Units in &quot;transit&quot; are moved to &quot;orbit&quot;. Units in &quot;orbit&quot; can be deployed to the board. This introduces a minimum one turn delay from when an item is purchased to when it can be deployed.&#10;&#10;Expanded by:&#10;&#10;    Thunder's Edge: Demon Canyon&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Battle of the Bulge",
        "description": "The Battle of the Bulge is an historically correct re-creation of the famous World War II campaign of the same name.  The 101st Airborne Division is hopelessly encircled at Bastogne. The German commander demands surrender. General Anthony McAuliffe replies to the demand with one simple word &quot;Nuts!&quot;.&#10;&#10;The game's scale is 3.2 km (2 miles) per hex; 12 hours per turn. Units are regiments and brigades. 377 Counters (including blanks)&#10;&#10;",
        "artist": "Jean Baer,Rodger B. MacGowan,Dale Sheaffer,Mick (Mike) Uhl"
    },
    {
        "name": "Grass",
        "description": "Regarded as a distant cousin of the French card game, Mille Bornes, this card game casts the players as dope dealers looking to make a quick buck or two selling pot.  Players seek to add 'drug deal' cards of varied monetary values to their stash, but others can attempt to interfere on their turn.  When one player has squirreled away $250,000, he is declared the winner.&#10;&#10;Re-implements:&#10;&#10;    Mille Bornes&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Galopp Royal",
        "description": "While ostensibly a racing game - a &quot;racing your sedan chair around the gardens of Versailles&quot; game, no less - the heart of Galopp Royal is the auction rounds that precedes each race: a jumble of bluffing, bidding &amp; wild swings of luck.&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Magalon",
        "description": "Rivalry between wizards. The players become the wizards who travel through the mysterious forest of Magalon in search of the magic items which will allow them admission to the prestigious &quot;Council of 11&quot;. They have to collect 3 magical items - the Amulet of Power, the Stone of Wisdom and the Ring of Immortality. Whoever possesses these 3 objects will be admitted to the Council.&#10;&#10;The aim of each player is to be the first to return to entrance to the forest with his wizard (the arrival and departure squares), after having collected the necessary 3 items.&#10;&#10;",
        "artist": "Tim Gill,Mark Holiday,Kinetic"
    },
    {
        "name": "Asterix: Das Kartenspiel",
        "description": "The year is 50 B.C. Gaul is entirely occupied by the Romans. Well, not entirely... A simple card game themed on the famous comic graphic novels, with indomitable Gauls bashing unfortunate Romans. Players have a set of cards (Asterix, Obelix, Getafix, Cacofonix &amp; Vitalstatistix) numbered 1 to 10, each card having a different combination of 1-4 magic potions to act as a tie-break. A deck of 55 Roman soldiers, ranging from the cook to Crismus Bonus &amp; Julius himself, are competed for in turn. A scoring card is shown, players select their Gaul cards and show them together, highest wins the Roman and discards their winning card. The other players return their cards to their hands to fight again. There are also Pirate cards which reduce your winnings and Dogmatix cards which allow the players to draw from the deck and either keep the card themselves or pass it onto another player. The rank of the Roman increases your score, but combinations of the same rank are worth much more.&#10;&#10;Re-implemented by:&#10;&#10;    The Gnumies &#10;&#10;&#10;&#10;&#10;",
        "artist": "René Goscinny,Albert Uderzo"
    },
    {
        "name": "Alhambra: The Card Game",
        "description": "Alhambra: The Card Game is a game that both inspired and was named after the more popular, award-winning game and franchise, Alhambra.&#10;&#10;This game has been released in several different versions, with the same core rules but different themes. The 2010 release of the game re-themed what was then called Stimmt So!' to Alhambra: The Card Game, after the popular Alhambra franchise and related, award-winning game Alhambra.  Alhambra, is itself derived from Stimmt So!. The original version of the game, Al Capone, was published in 1992 by a self-publishing company, db-Spiele, which was owned by the game designer Dirk Henn.&#10;&#10;The re-theming of Stimmt So! and Alhambra: The Card Game resulted in the same game with different themes and only minor differences. Changes between Stimmt So! to Alhambra: The Card Game include:&#10;1) The initial money rules from Alhambra are used.&#10;2) The 2 player variant rules from Alhambra are used.&#10;&#10;Stimmt So! A description of this version:&#10;Using mechanics similar to Union Pacific or its predecessor, Airlines, this game is about acquiring stock interests in the various aspects of a large corporation.  There are six &#10;different types of stock, which will reward the majority and sometimes the minority stockholders throughout the game.  Stock is made available by drawing cards on a four-card queue.  Each of the positions on the queue is a different stock market, which means there are four different currencies (Dollar, Euro, Ruble, Yen).  The currency cards are drawn from another queue on the same board.  A turn is quite simple - either take one of the four available currency cards or use some of your currency cards to purchase one of the available stocks.  If you pay more than the amount indicated on the stock card, the excess is lost.  However, if you purchase the stock for the exact printed price, then you can buy another stock, and so on.  After two randomly distributed payouts, the game ends with a final payout with the final stock card.  The player with the highest payout point total is the winner.&#10;&#10;Al Capone  A description of this version:&#10;Using Influence cards, you collect Trade cards from different areas of town under the Mafia control, giving you control over the Distillery, the Chinese Laundry, the Betting Shop, etc. If you spend the exact amount of Influence required, you get another turn, and so on. Scoring occurs randomly twice during the game and at the end. When the first scoring occurs, only the majority holder in each Trade scores. When the second scoring occurs, the first and second majority holders score, and at the final scoring, the first three majority holders score. Ties are split accordingly.&#10;&#10;Other versions/re-themes:&#10;Alhambra Bonn card game is Alhambra the card game with the Bonn theme. Originally as a limited run for Bonn, Germany and surrounding areas. There is also a Alhambra New York card game which is currently out of print, as well as an Alhambra Nederland card game. The re-themes are collectors items that people like to collect.&#10;&#10;",
        "artist": "Jo Hartwig,Reinhard Horst"
    },
    {
        "name": "6 nimmt!",
        "description": "In 6 nimmt!, a.k.a. Category 5 and many other names, you want to score as few points as possible.&#10;&#10;To play the game, you shuffle the 104 number cards, lay out four cards face-up to start the four rows, then deal ten cards to each player. Each turn, players simultaneously choose and reveal a card from their hand, then add the cards to the rows, with cards being placed in ascending order based on their number; specifically, each card is placed in the row that ends with the highest number that's below the card's number. When the sixth card is placed in a row, the owner of that card claims the other five cards and the sixth card becomes the first card in a new row.&#10;&#10;In addition to a number from 1 to 104, each card has a point value. After finishing ten rounds, players tally their score and see whether the game ends. (Category 5 ends when a player has a score greater than 74, for example, while 6 nimmt! ends when someone tops 66.) When this happens, the player with the fewest points wins!&#10;&#10;6 nimmt! works with 2-10 players, and the dynamics of gameplay change the more players that you have. One variant for the game has you use 34 cards, 44 cards, 54 cards, etc. (instead of all 104 cards) when you have three, four, five, etc. number of players. This change allows you to know which cards are in play, thereby allowing you to track which cards have been played and (theoretically) make better choices as to which card to play when.&#10;&#10;",
        "artist": "(Uncredited),Design Edge,Bill Herrin,Gatis Sluka,Studio Tapiro,Franz Vohwinkel"
    },
    {
        "name": "Shark",
        "description": "Shark is a stock-trading game slightly reminiscent of Acquire, in that abstract plays on the game board determine the share values of the various companies.  The similarities end there, though, as Shark is more free-wheeling than Acquire.&#10;&#10;Each player may buy (maximum 5 shares total during the turn) and sell (unlimited) shares both before and after his turn, and during his turn rolls dice to determine which company he can affect and in what region he can place that company's marker.    Placing next to another of that company's markers increases the company's share price, which pays out in two ways: first, for placing the marker, the player gets money equal to the new price, and secondly, all players get paid the amount of the increase, multiplied by the number of shares each of them owns.    This wealth is not without risks, though, as placing  in a way that brings two companies' marker-groups adjacent to each other causes the smaller group to be removed from the board, decreasing that company's share price accordingly -- and all players  must pay the amount of the decrease, again multiplied by the number of shares they hold in that company!&#10;&#10;The game ends if all of one company's markers have been used, if one company's share price reaches 15, or all of shares in the game are sold; at which time the players cash out their stock and determine who, with the most money, has won.&#10;&#10;",
        "artist": "A. Lefort,J. C. Sohier,Walter Wagner"
    },
    {
        "name": "Yucata'",
        "description": "Simple movement game themed on Mayan graphics. Players have 7 cards (numbered 1-5 and 2 actions) and leapfrog their stone down the track. There are initial stones laid on the track and you collect them as you pass. According to their color, you throw stones away at the end, most stones left wins. The game has different variants of the initial layout.&#10;&#10;Online Play&#10;&#10;&#10;     Yucata (turn-based)&#10;&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Canyon",
        "description": "Canyon is a trick-taking game in which players try to predict exactly how many tricks they will take.  The number of cards in a hand increases and then decreases in size.  A correct prediction gives your marker movement points around a scoring track depicted on a river in a canyon, whose main feature of interest is a section of &quot;rapids&quot; near the finish line where your marker will be &quot;caught in the current&quot; and sent back a few spaces if you go too many hands without a correct prediction.&#10;&#10;Re-implements:&#10;&#10;    Bid & Bluff&#10;&#10;&#10;&#10;&#10;Expanded by:&#10;&#10;    Grand Canyon&#10;&#10;&#10;&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Master Labyrinth",
        "description": "This earlier Master Labyrinth is very different than the 2007 dragon-themed Master Labyrinth.&#10;&#10;Part of the Ravensburger Labyrinth Games series, this game is based on the simpler, original Labyrinth game. It is played on a board with maze tiles (straight, L, and T shaped corridors) randomly arranged on it.  Players are represented on the board by little wizard pawns.  Players are wizards-in-training, and they are charged with exploring the maze and finding all the ingredients (numbered chips) needed to become a Wizard.  The trick is that chips must be claimed in numerical order.  Perhaps the most novel aspect of this game is that players mutate the maze by sliding a tile onto the board from the side, which hopefully will enable them to travel to the next ingredient.  Once all twenty-one items have been claimed, the highest total score wins, but each player also holds a secret recipe worth bonus points if they were able to capture three specific ingredients.&#10;&#10;",
        "artist": "Monika Broeske,Andreas Härlin"
    },
    {
        "name": "Scotland Yard",
        "description": "In Scotland Yard, one of the players takes on the role of Mr. X. His job is to move from point to point around the map of London taking taxis, buses or subways. The detectives &ndash; that is, the remaining players acting in concert &ndash; move around similarly in an effort to move into the same space as Mr. X. But while the criminal's mode of transportation is nearly always known, his exact location is only known intermittently throughout the game.&#10;&#10;The 125 fare tickets are 5 black, 23 pink underground, 43 green bus,  54 yellow taxi.&#10;&#10;Similar to&#10;&#10;    The Fury of Dracula&#10;    Clue: The Great Museum Caper&#10;    Ghost Chase&#10;    Letters from Whitechapel&#10;    Garibaldi: The Escape&#10;&#10;&#10;&#10;&#10;",
        "artist": "Erika Binz-Blanke,Rene Habermacher,Franz Vohwinkel,Thomas Weiss,Torsten Wolber,Ugurcan Yüce"
    },
    {
        "name": "Zoff in Buffalo",
        "description": "Once a year, Buffalo City goes beef crazy. Cowboys drive their cows here to the biggest auction in the Wild West. The players must attempt to find grazing for their cows on the limited pasture.&#10;&#10;Which beef baron will most cleverly play his cards?&#10;&#10;Players have 10 cards to play which specify a number of cows.  Each round features a simultaneous selection of 2 of the 10 cards and a designation of which of the several pastures (the number of pastures in the game depends on the number of players) you'll try to place the cows in.  The tricky part starts with the rule that no two players can ever have exactly the same number of cows in a given pasture.  So if you plan to put 4 cows in a certain pasture, but somebody else has exactly 4 there already when your turn comes around, you'll only get to put 3 of them in -- and if somebody else has exactly 3 there already, you'll only get to put 2 of them in.  And it's very detrimental to your gameplan if you don't get to play all the cows you're entitled to!&#10;&#10;When a pasture is completely filled with cows, there are bonuses paid in the form of a chance to put extra cows into other pastures, but perversely, the better bonuses go to the players with the second or third most cows, not the first most.  This is the *really* tricky part.&#10;&#10;The game ends after five swift rounds and all 10 of your cards played, maybe half an hour from start to finish. Whoever has the most cows in the pastures wins!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Filthy Rich",
        "description": "Filthy Rich is a card game that is played with a binder and 4 pages of Ultra Pro card protector pages.  Players launch business billboards in the form of cards that get placed in the pages.  If the number rolled on the business dice corresponds to your billboard you get paid.  Income is spent to acquire Luxuries, and the first player to own three luxuries wins!  However, Luxuries and Businesses have a tax value that is due during a randomly-triggered tax phase.  if you cannot pay your taxes, you must liquidate your empire.  Special action cards and events add to this light but fun game.&#10;&#10;",
        "artist": "Christopher Rush"
    },
    {
        "name": "Um Reifenbreite",
        "description": "Translating as &quot;By the Width of a Tire,&quot; this game covers a Tour de France-type of bicycle race.  Each player takes control of a four-member racing team, and the goal is to score as many points as possible for the whole team.  Movement is primarily handled by dice, however a limited card set partially replaces die results.  Once you add unique rules which allow riders to draft one another and multiple kinds of road surfaces, this game has much to offer race fans.&#10;&#10;Published in 1991 was the more widely held reprint (Jumbo also produced a Dutch edition called Demarrage!).&#10;&#10;Homas Tour is the original edition of the cycle racing game later known as Um Reifenbreite. Many copies of the original game were destroyed in a warehouse fire in 1979. The combination of its sudden rarity and recognition as a good game meant that Homas Tour was (and is) very desirable, particularly to collectors. Everyone else can save their money and enjoy Um Reifenbreite!&#10;&#10;",
        "artist": "Jan van Haasteren"
    },
    {
        "name": "Code 777",
        "description": "The clever little game Code 777 combines the elements of a good, logical deduction game and Indian poker. Each player receives a rack for keeping three tiles drawn from a pool of tiles, which are seven different numbers in seven different colors (28 tiles in total); however, the rack is turned away from you. When players sit in a circle, each player can see everyone else's tiles, except their own. Each turn, players draw a card with a question like, &quot;Do you see more yellow sevens or more blue sevens?&quot; which should help the others' determine their tiles. Once you're reasonably sure of which tiles you have in front of you, you can take a guess &mdash; but if you're wrong, you have to start over with a fresh set of tiles...&#10;&#10;Code 777 was explicitly inspired by What's That on My Head?, and Alex Randolph credited Robert Abbott with co-designing this game based on that inspiration.&#10;&#10;In 2010, Stronghold Games released Code 777: 25th Anniversary Deluxe Edition, adding both a fifth player to the game and symbols to make it colorblind-friendly. In 2015, Stronghold Games released Code 777: 30th Anniversary Limited Edition, which is the final edition from Stronghold Games.&#10;&#10;",
        "artist": "Kinetic"
    },
    {
        "name": "Midnight Party",
        "description": "Although billed as a children's game, Midnight Party is actually quite enjoyable by adults as a light, fun game. Each player controls a number of guests at a party, with the number of guests dependent on the number of players. These guests start the round in the spaces of the gallery on the game board, one guest per space; this initial placement is a large part of a player's strategy.&#10;&#10;Hugo the ghost starts in the cellar, then climbs the stairs towards the gallery where the guests circle. The mechanism for Hugo's movement is simple: On a player's turn, he rolls a special die. If he gets a number, he moves his pieces; if he gets a Hugo, Hugo moves. This means that with more players in the game, Hugo moves a lot more frequently, so you must adjust your strategy accordingly.&#10;&#10;Once Hugo has reached the gallery, the guests can start ducking into rooms adjoining the gallery to avoid him, with only one guest per room! A couple of rooms are special in that they add or subtract extra &quot;fright points&quot; from your score. As Hugo catches up with the remaining guests, they are sequestered on the stair steps, then in the cellar. The first guest caught &quot;earns&quot; the most fright points, with those caught later in the round earning less and less.&#10;&#10;Once all the guests have been caught, the fright points are tallied. After playing a predetermined number of rounds, the player with the fewest fright points wins!&#10;&#10;",
        "artist": "Nicole Baron,Marek Bláha,Bernard Giroud,Wolfgang Kramer,Franz Vohwinkel"
    },
    {
        "name": "Die Osterinsel",
        "description": "A simple game. Race to the end of a path. On your turn, you must move one figure and place as many rocks in the heads of other figures as the number of spaces you moved. Of the first two finishers, the one with the most rocks in his head wins.&#10;&#10;The pieces are big honking Moai (Easter Island Statues) heads made of plastic which are hollow. The game is short and simple. There is not a huge amount of strategy and it helps if the other players cannot remember how many rocks are in the others heads.&#10;&#10;",
        "artist": "Hartmut Gärling,Fabio Visintin"
    },
    {
        "name": "Avalanche",
        "description": "Players take turns dropping their marbles down the channels of the game, trying to get as many marbles as possible to fall out the bottom.  Impeding the motion of the marbles are several plastic gates.  The gates catch the first marble that hits their top (subsequent marbles roll off) and swing back and forth when a marble hits their base.  Using logic, players deduce which way the gates will move when they drop their marble, and try to make a move that results in the most marbles making it to the bottom of the game (or that blocks a potentially good move by their opponent).&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Great Balloon Race",
        "description": "This is a light game -- lighter than air, one might even say -- in which each player starts the game with a card assigning a secret interest in three different balloons.  The balloon markers are lovely little brightly colored plastic gadgets, and on your turn you roll a die and choose which of the eight you want to move.  Some spots you land on give you a free roll; from some you can only go backwards.  With much shucking and jiving the balloons gradually float and bump up toward the finish line whilst players feign disinterest in their own colors in hopes they'll be promoted by others.  When all three of your balloons reach the finish, you can claim victory.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Octi",
        "description": "Octi is a unique abstract strategy game.   Its object is to move your pieces into your opponent's starting points.  Octi  allows for multiple jumping, capturing, and special movement of pieces.  On each move players decide whether to bring in new pieces, upgrade their existing pieces, or move a piece.  The choices in this game are staggering and each move presents and entire new way of thinking about the game.  There is a 4 player teams variant that is included in the rules.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Mummy Rummy",
        "description": "from a session report:&#10;&#10;This is a rummy based game where you are trying to form sets of Egyptian artifacts, three cards to a set, from a deck of about 50 cards. The quirk here is some cards have two images on them, so they could belong to one of two sets. You score for sets, and deduct points for cards left in the hand.&#10;&#10;",
        "artist": "Annie Campbell"
    },
    {
        "name": "Tante Tarantel",
        "description": "Tante Tarantel (Auntie Tarantula) scoots round her web, gobbling up your insects as they try to escape. The web is a spiral, you roll the die and move Auntie, then take turns to move one of your bugs towards the exit space. Initially, Auntie is in a good mood, if she runs into a bug or bugs, they go back to her larder. But as soon as someone escapes, she loses her temper and kills anything she catches! The game has a scoring track, and each time a bug is caught or escapes, a marker moves up, also adding a number to the die roll. So Auntie runs around the web faster and faster. Players can share some spaces, but most of the time, bump each other back and forth. Naturally, nasty bugs push others into Aunty's path to certain death!&#10; Slightly confusing when you start, this is actually a really simple game, easily as good as any D&F game. The original set had wooden pawns for the bugs, but D&F issued a series of neat rubber bugs, which do add to the games' style.&#10;&#10;",
        "artist": "Doris Matthäus"
    },
    {
        "name": "Am Fuß des Kilimandscharo",
        "description": "Simple Knizia game for children. Progress up the trail to the foot of Kilimanjaro by playing numbered cards. You can play cards in front of yourself to make 3 piles, or onto your opponents to slow them down if they're ahead of you on the trail. The cards are in different types (colors), canoe, mule, jeep or by foot. If your 3 cards are the same type, you can move the total. If 2 cards match, you can move that total. If the 3 cards don't match, you can move the highest number.&#10;&#10;In addition, there are chance tokens laid on the trail face-down. These are revealed as you reach them; the banana is a meal-break (take another move), a lion is danger (fall back to the last village), or a swap tile lets you switch places on the trail with another player.&#10;&#10;The player that reaches the mountain first wins, but if the players exhaust their decks, then the furthest along the trail is the winner.&#10;&#10;",
        "artist": "Doris Matthäus"
    },
    {
        "name": "Jumbo Grand Prix",
        "description": "extrapolated from review:&#10;Components:56 playing cards (divided in 4 categories) and 20 scoring cards.&#10;&#10;The goal: By creating strong race cars score the most racing points.&#10;&#10;The means: Every player starts with 4 cards. In the next 4 rounds he tries to build a competitive race car by changing his cards. A race car consists of a coach-work card, a tire card, an engine card and a driver card. After 4 rounds all the players show their race car for that race. The strength is the sum of the 4 played cards. The stronger the combination, the higher your finish place. In case of a tie, the value of the driver decides. Whenever you cannot make a complete car, you cannot take part in that race.&#10; Specials: When your coach work, tires and engine have the same value, the combination is worth 21 points, in spite of their original value. Then you add the value of the driver. When your driver is also of the same value, the total combination is worth 28 points.&#10; Changing: When it's your turn, you can choose on of the following actions:&#10;1.Hand in 1 of your cards (visible) and draw 2 new ones. The new cards can be drawn from the visible cards or from the closed pile. The 4 open piles are sorted by their kind.&#10;&#10;2.Keep all your cards and draw 1 new card. (from an open or the closed pile.  So every turn you get 1 extra card. After 4 turns you have 8 cards, from which you must build your race car. The other 4 cards are used in the next round. Whenever you draw a card from one of the open piles, it is always the top one. From the kind you just handed in 1 of your cards, you cannot draw a new one from that open pile.&#10;&#10;Race: At the start of each round as many scoring cards are revealed as there are players. The winner gets the highest card and so on. So every player gets some points, unless you cannot take part in the race.&#10; The end: As soon as all scoring cards are used, the racing season is over. The player with the highest total of scoring cards wins the season (and the game).&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Sherlock Holmes: The Card Game",
        "description": "With illustrations from the original novels, this card game goes some way to evoke the feeling of the chase through Victorian London to unmask Moriarty and other villains. Players draw and lay cards in sequence, Movement, Location, Info, Action, Detectives and Villains. So I might take a train to the Country, find a clue and use a Disguise. I can use an Inspector, Arrest or Alibi card on my opponents and so on. Play ends either when an Arrest successfully reveals a Villain, or when a player discards their last card, a Villain, who Escapes. Scoring is based on cards remaining in your hand, and if you are the arresting or guilty player, caught with a Villain in your hand.&#10;&#10;Re-implemented by:&#10;&#10;    I Say, Holmes!&#10;&#10;&#10;&#10;&#10;",
        "artist": "Sidney Paget"
    },
    {
        "name": "Ausgebremst",
        "description": "Using the basic system pioneered in Ave Caesar, this racing game casts the players as race car drivers.  Players use cards to move their cars forward a number of spaces, however the tracks often have 'choke' points where few cars can race side-by-side (not unlike Kramer's Detroit/Cleveland Grand Prix system).  The track is constructed from three double-sided half-boards, which can be combined in a number of different ways for easier and harder tracks.  For the advanced game, each player's movement cards can be divided different ways, depending on the strategy that he wishes to employ for the given track.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Railway Rivals",
        "description": "This is a classic simple railway racing game, perhaps the first modern railroading game, where you draw the railway lines on hex-board. This one uses the sort of colored marker pens you can wipe off with a damp cloth after the game. The game goes through phases; initially you draw tracks and earn money for linking cities. When a number of cities are joined, you start racing, the cities being chosen randomly. The races are simple dice-rollers and the 1st &amp; 2nd place get prize money. After a couple of races, you draw some more tracks, then race some more and so on.&#10;&#10;The railways cost more if you go over mountains etc, but this gives you shorter routes. You can run parallel to other lines at a cost, or simply link into another player's track and rent the tracks of other players when you race.&#10;&#10;The board has a UK map on one side and a US map on the other, both giving amusing challenges, and the game has good repeat value. The designer David Watts has published a lot of stand alone Railway Rivals maps, and there is another edition of this game, Dampfross published by Laurin.&#10;&#10;Re-implemented by:&#10;&#10;    Dampfross&#10;&#10;&#10;&#10;&#10;",
        "artist": "Andrew Poole,David G. Watts"
    },
    {
        "name": "Freibeuter",
        "description": "Freibeuter is a game of playing your boats in spaces allowed  by the cards you've drawn in hopes of being part of a capturing team of surrounding boats.   Sometimes you play the &quot;Flying Dutchman&quot; which can go more places but disappears as soon as the capture is made.  You also have the option of positioning to be the main deal-maker on a capture, which leaves you paying off all the surrounding boats but getting more money yourself on the deal at the end of the game.  Timing, of course, turns out to be a nice matter for judgment.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Esels-Rennen",
        "description": "First issued in 1989 for fewer players, the second edition (released in 1996) is for 2-6 players. The board has two sides, for racing either 3 or 4 colored donkeys. Players are given a card secretly, each showing the donkey's finishing order, a different result for each card. The board shows a patchwork of steps across a field from start to finish, each space with a colored arrow matching the donkeys. When you move a donkey onto a space marked with a green arrow pointing left, you then move the green donkey one space that way. If that space then has a blue arrow pointing right, you next move the blue donkey on one space that way. This goes on until you cannot move the final donkey because it is blocked. Eventually, the donkeys cross the finish line, and the player with the best matching result on their card wins. More of a competitive puzzle than a game, it is a nice diversion, but awkward because the donkeys constantly fall on their sides. Possibly Doris & Frank's first game and related to their Bunny Zick-Zack.&#10;&#10;3rd Place 1989 Hippodice Spieleautorenwettbewerb (as Donky [sic]).&#10;&#10;",
        "artist": "Doris Matthäus"
    },
    {
        "name": "Magic: The Gathering",
        "description": "From the official website:  In the Magic game, you play the role of a planeswalker&mdash;a powerful wizard who fights other planeswalkers for glory, knowledge, and conquest. Your deck of cards represents all the weapons in your arsenal. It contains the spells you know and the creatures you can summon to fight for you.&#10;&#10;This is the grandfather of the collectible card game (or CCG) genre.  Cards are categorized as common, uncommon, rare, and mythic rare.  Players collect cards and build decks out of their collection.&#10;&#10;Players build a deck of cards and duel against an opponent's deck.  The first player to reduce his opponent to 0 life (or meet another set win condition) wins the game.&#10;&#10;Deck building is  major part of the game.  There are over 17,000 different cards from which to build your deck!&#10;&#10;Players randomly draw spells to see what they get and can play each turn.  Although this limits your choices, there is a lot of strategy in how you play those spells.  A robust list of game mechanics, including intricate rules for reactive card play called &quot;the stack,&quot; provide for rich tactics and tough choices each turn.&#10;&#10;Though traditionally a two-player duel, there are several casual and tournament formats to Magic that allow more players to play.&#10;&#10;",
        "artist": "Victor Adame,Miao Aili,Randis Albion,Rob Alexander,James Allen,Dave Allsop,Scott Altmann,Ian Edward Ameling,Eric David Anderson,Chris J. Anderson,Dana Andrews,Glen Michael Angus,Chris Appelhans,Steve Argyle,Randy Asplund-Faith,Janet Aulisio,John Avon,Daren Bader,Volkan Baga,Scott Bailey,Drew Baker,Qi Baocheng,Julie Baroh,Tom Baxa,Edward Beard, Jr.,Patrick Beel,Jason Behnke,Steven Belledin,Melissa Benson,James Bernardin,Michael Bierek,Kristen Bishop,Joel Biske,Simon Bisley,Robert Bliss,Johann Bodin,Peter Bollinger,John Bolton,Paul Bonner,Zoltan Boros,Aaron Boyd,Whit Brachna,Noah Bradley,Jacques Bredy,Aleksi Briclot,Mark Brill,Kev Brockschmidt,Gerald Brom,Sue Ellen Brown,Ron Brown,Cornelius Brudi,Michael Bruinsma,Catherine Buck,Christopher Burdett,Wesley Burt,Jeffrey R. Busch,Clyde Caldwell,Matt Cavotta,Clint Cearley,Paul Chadwick,Doug Chaffee,Jason Chan (I),David Cherry,Ron Chironna,Christine Choi,Scott Chou,Wang Chuxiong,Ciruelo,Trevor Claxton,D. J. Cleland-Hura,Bud Cook,Mitch Cotie,John Coulthart,Carl Critchlow,jD,Daarken,Qiao Dafu,Liz Danforth,Oriuzio \"Dany Orizio\" Daniele,Stephen A. Daniele,Mike Danza,Geof Darrow,Al Davidson,David Day,Nelson DeCastro,Blackie del Rio,Thomas Denmark,Eric Deschamps,Ai Desheng,Brian Despain,Dennis Detwiller,Dave DeVries,Chris Dien,Tony DiTerlizzi,Kevin Dobler,Dom!,Dominick Domingo,John Donahue,William Donohoe,Brandon Dorman,Dave Dorman,Dan Dos Santos,Mike Dringenberg,Brian \"Chippy\" Dugan,Brian Durfee,Jeff Easley,Cole Eastburn,Robert Eggleton,Jesper Ejsing,Randy Elliott,Steve Ellis (I),Larry Elmore,Tristan Elwell,Rick Emond,Jeremy Enecio,Wayne England,Jason Engle,James Ernest,Vincent Evans,Glenn Fabry,Patrick Faricy,Rick Farrell,Jason Felix,Wang Feng,Richard Kane Ferguson,Cecil Fernando,Fred Fields,Steve Firchow,Scott Fischer,Marc Fishman,Tom Fleming,Kaja Foglio,Phil Foglio,Eric Fortune,Jon Foster,Anthony Francisco,Carl Frank,Dan Frazier,Frank Kelly Freas,Massimilano Frezzato,Una Fricker,J. W. Frost,Ted Galaday,John Gallagher,Randy Gallegos,Sandra Garavito,Kevin Garletts,Daniel Gelon,Donato Giancola,Thomas Gianni,Gary Gianni,Charles Gillespie,Tomas Giorello,Erik Gist,Andrew Goldhawk,Rob Gonsalves,Gerry Grace,Lucas Graciano,Adi Granov,Lars Grant-West,D. Alexander Gregory,Stuart Griffin,Yang Guangmai,Rebecca Guay-Mitchell,Brian Hagan,Kunio Hagio,Joshua Hagler,Trevor Hairsine,Nils Hamm,Justin Hampton,Scott Hampton,Yeong-Hao Han,Fred Harper,Lou Harrison,Mark Harrison,Michael C. Hayes,Don Hazeltine,Nathalie Hertz,Carol Heyer,Henry Higgenbotham,Tim Hildebrandt,Greg Hildebrandt,Yoshino Himori,David Ho,Patrick Ho,Yang Hong,Craig Hooper,Fred Hooper,Quinton Hoover,Alex Horley,Daniel Horne,David Horne,Ralph Horsley,Brian Horton,John Howe,Austin Hsu,David Hudnut,Heather Hudson,Shang Huitong,Mark Hyzer,Junichi Inoue,Ironbrush,Ittoku,Hiro Izawa,Izzy,Tyler Jacobson,Hugh Jamieson,Jeremy Jarvis,Tomasz Jedruszek,Jiaming,He Jiancheng,Liu Jianjian,Gao Jianzhang,Zhang Jiazhen,Kari Johnson,Janine Johnston,Miles Johnston,Fay Jones,Jaime Jones,Goran Josic,Qin Jun,Michael Kaluta,Kerstin Kaman,Yokota Katsumi,Tsutomu Kawade,James Kei,Doug Keith,Dave Kendall,Mike Kerr,Igor Kieryluk,Mike Kimble,Hannibal King,Scott Kirschner,Brandon Kitkouski,Nic Klein,Patrick Kochakji,Michael Koelsch,KOJI,Michael Komarck,Cos Koniotis,Karl Kopinski,Kekai Kotaki,Vance Kovacs,Yang Jun Kwon,Tom Kyffin,Ray Lago,Clint Langley,Jeff Laubenstein,Jennifer Law,Stephanie Pui-Mun Law,Alton Lawson,Khang Le,Garry Leach,April Lee,Pat Lee,Paul Lee,Ron Lemen,Nicola Leonard,LHQ,Daniel Ljunggren,Todd Lockwood,Lubov,Chuck Lukacs,Steve Luke,Rebekah Lynn,Howard Lyon,Larry MacDougall,Colin MacNeil,Corey Macourek,Anson Maddocks,Warren Mahy,John Malloy,Sławomir Maniak,Thomas Manning,Dylan Martens,David G. Martin,Stephan Martiniere,John Matson,Val Mayerik,Cristina McAllister,Iain McCaig,Sean McConnell,Chengo McFlingers,Martin McKenna,Harold Arthur McNeill,Véronique Meignaud,Jeff Menges,Ken Meyer, Jr.,Ian Miller,Jeff Miracola,Matthew Mitchell,Cara Mitten,Christopher Moeller,Peter Mohrbacher,Malcolm David Monette,Monte Moore,Pat Morrissey,Philip Mosness,Craig Mullins,Kevin A. Murphy,Scott Murphy,Justin Murray,Andrew Murray,Jim Murray,Jon J. Muth,Jesper Myrfors,Ted Naifeh,Sun Nan,Mark A. Nelson,James Nelson,Winona Nelson,Jeff Nentrup,Terese Nielsen,Cliff Nielsen,Justin Norman,Nottsuo,David O'Connor,William O'Connor,Syuichi Obata,Kensuke Okabayashi,Okera,Ariel Olivetti,Margaret Organ-Kean,Jen Page,James Paick,Efrem Palacios,David Palumbo,Anthony Palumbo,Ryan Pancoast,Adam Paquette,Paolo Parente,Jung Park,Keith Parkinson,Lucio Parrillo,Jim Pavelec,Nick Percival,Omaha Perez,Eric Peterson,Bob Petillo,Michael Phillippi,Martina Pilcerová,Mike Ploog,Zak Plucinski,Eric Polak,Alan Pollack,Mark Poole,R. K. Post,Dermot Power,George Pratt,Steve Prescott,Vincent Proce,Puddnhead,Huang Qishi,Mike Raabe,Isabelle Rabarot,Alan Rabinowitz,Fredrik Rahmqvist,Chris Rahn,Dave Rapoza,Kathryn Rathke,Roger Raupp,Omar Rayyan,Dom  Reardon,Jeff Reitz,Jeff Remmer,Adam Rex,Wayne Reynolds,Esad Ribic,Darrell Riche,Brad Rigney,Franco Rivolli,Tony Roberts,Andrew Robinson,Mark Romanoski,Romas,Mark Rosewater,Jean-Sebastien Rossbach,Gary Rudell,Robh Ruppel,Christopher Rush,Andi Rusu,Michael G. Ryan,James Ryman,Mitsuaki Sagiri,Richard Sardinha,Mike Sass,Zina Saunders,Jana Schirmer,Dan Scott,Dan Seagrave,David Robyn Seeley,Liu Shangying,Liam Sharp,Kuang Sheng,Song Shikai,Shishizaru,Doug Shuler,Bill Sienkiewicz,Greg Simanson,Marc Simonetti,William Simpson,Mark Simpson (II),Adrian Smith,Larry Snelly,Brian Snoddy,Ding Songjian,Greg Spalenka,Ron Spears,Ron Spencer,Terry Springer,John Stanko,Greg Staples,Matthew Stawicki,Darbury Stenderu,Matt Stewart,Philip Straub,Michael Sutfin,Raymond Swanland,Justin Sweet,Arnie Swekel,Tony Szczudlo,Gábor Szikszai,Junko Taguchi,Hideaki Takamura,Bryan Talbot,Xu Tan,Zhao Tan,Philip Tan (I),Hiroshi Tanigawa,Stephen Tappin,Mark Tedin,Nènè Thomas,Joel Thomas,Richard Thomas (I),Ruth Thompson,Ben Thompson,Matt Thompson,Li Tie,Cai Tingting,Jerry Tiritilli,Junior Tomlin,Francis Tsai,Drew Tucker,UDON,Charles Urbach,Susan Van Camp,Cyril Van Der Haegen,Henry van der Linde,Svetlin Velinov,Pete Venters,Diana Vick,Marcelo Vignali,Rogério Vilela,Sal Villagran,Franz Vohwinkel,Erik Von Lehmann,Johannes Voss,Bryon Wackwitz,Kevin Walker,Ron Walotsky,Stephen Walsh,Shelly Wan,Tom Wänerstrand,Li Wang,Anthony Waters,Michael Weaver,Amy Weber,Jack Wei,Chen Weidong,Kipling West,Michael Whelan,Steve White,Richard Whitters,L. A. Williams,Brad Williams,Allen Williams,Dameon Willich,Matt Wilson,Jarreau Wimberly,Jim Wong,Ash Wood,Sam Wood,Richard Wright,Tang Xiaogu,Li Xiaohua,Xu Xiaoming,Qu Xin,Quan Xuejun,Ku Xueming,Gao Yan,Lin Yan,Hong Yan,Erica Yang,Kieran Yanner,Ryan Yee,Solomon Au Yeung,Ji Yong,Li Youliang,Li Yousong,Kang Yu,Fang Yue,Min Yum,Wang Yuqun,John Zeleznik,ZENTOYO,Jiang Zhuqing,Luca Zontini,Mark Zug"
    },
    {
        "name": "Billabong",
        "description": "In this geometrical racing game players maneuver teams of kangaroos jumping around a Billabong (&quot;a dead-end channel extending from the stream of a river,&quot; a term used in Australia).  The board is made up of checkerboard-style squares around the billabong in the middle.  On your turn you move one of your five kangaroos, usually moving it in a jump or series of jumps over the other kangaroos.  Jumps can be long; if the kangaroo to be jumped over is five spaces away, for example, the landing space will be five spaces beyond.  The other option, to move a kangaroo just one space, is usually used as a positioning tactic for a subsequent move.  The first player to get all five kangaroos around the billabong and over the finish line wins.&#10;&#10;",
        "artist": "Ralf E. Kahlert,Alvin Madden,Franz Vohwinkel"
    },
    {
        "name": "Zankapfel",
        "description": "Players take turns moving a token around a matrix that determines the price of each of four different types of apples. However, before adjusting the price, players decide whether they will attempt to sell a particular apple type or buy a new apple. If more than one player decides to sell a given variety, then a bidding war takes place with the reward being the newly adjusted price or a swift kick to the teeth. Once someone has sold enough apples to move his scoring token around the board's scoring track, the game is over and the highest paid player is the winner.&#10;&#10;Contents&#10;1 Board&#10;6 Dice&#10;6 Apple Farmers&#10;1 Mayor&#10;1 Big apple&#10;50 Apple cards (10 of each colour plus 10 multi-coloured)&#10;60 Contention cards (10 of each colour)&#10;25 Harvest chips&#10;&#10;",
        "artist": "Axel Gesinn"
    },
    {
        "name": "Inkognito",
        "description": "Game description from the publisher:&#10;&#10;The goal of each agent in Inkognito is to complete a mission, together with his partner. At the beginning of the game, however, players don't know which mission they must fulfill!&#10;&#10;In the standard four-player game, each player guides one of four secret agents. The four characters are allied in pairs: Lord Fiddlebottom and Colonel Bubble are always partnered against Agent X and Madame Zsa Zsa. Each of the four agents is represented by one of four different figures, with different builds: tall, short, fat, thin. Only one of them represents the actual character controlled by a player. The other three figures represent spies which are friendly to him and that are trying to confuse the opposition.&#10;&#10;On a turn, a player shakes the Phantom of Prophecy randomizer to determine his three available actions, e.g., moving on a land route or a sea route. The player moves his figures, trying to reach spaces already occupied by the other players' figures or the Ambassador. When&#31; figures are in the same space, the current player gets the right to &quot;ask questions&quot; and inspect some of the cards of that player. By deduction and a logical process of elimination, he can draw conclusions as to the identity and intentions of the other players.&#10;&#10;The &#31;first goal of every agent is to discover which of the other players is his partner. This partner has the other half of the &quot;code&quot; indicating his secret mission. After discovering (or thinking he has discovered) the real identity of the other players, an agent must trade his secret mission card with his ally. This will reveal the final mission and what must be done to complete it. If either agent on a team completes the mission, both he and his partner win the game.&#10;&#10;There is another character with an important role in the game: the Ambassador. He can be used to get clearer information about the other characters. Everyone wants to meet him because he is well-informed and can be useful to accomplish your purposes, but he can also help your rivals, so do everything you can to keep him far from them.&#10;&#10;The 2013 version of Inkognito from Ares Games raises the maximum player count to five by allowing someone to play the Ambassador and move it during his turn. He can still gather clues when the other players question the Ambassador during their turn, and the other players can still gather clues from him. The goal of the Ambassador's player is to know everything about the other characters, guessing their identities and builds. If the Ambassador achieves &quot;perfect knowledge&quot; before a team accomplishes its secret missions, he wins the game.&#10;&#10;",
        "artist": "Peter Gifford,Studio Tapiro"
    },
    {
        "name": "In Teufels Küche",
        "description": "In this fun, light children's game that translates to &quot;In the Devil's Kitchen&quot;, players move little devils in chefs' caps around the underworld, collecting pots, trying to be the first to collect 10 points worth of dishes.  Before the game starts, each player secretly assigns a value of 1, 3, 5 or 'milk' to each of the four pots of his color, then players take turns placing their pots on the board.    Each player's turn consists of rolling dice and moving his devils appropriately, either trying to get to another player's pot, or carrying one back to the kitchen.  If a devil brings milk to the kitchen, it explodes, and the devil carrying it is removed from the game.  A large plastic stove in the middle of the board is the game's exciting gimmick, and comes into play when two opposing devils share the same space and start dueling.  Each player takes turns pushing the plunger that forms the oven's stovepipe, and eventually a large devil pops out, deciding the winner!&#10;&#10;Is a rethemed and slightly altered version of the author's earlier Top Secret.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Road to the White House",
        "description": "extrapolated from the preview:&#10;&#10;The essence of the game is that you are moving from one to four pawns around the country, landing in cities, and scoring &quot;votes&quot; in the appropriate state which are proportional to the size of the city. Each turn, you move and add votes to the states you land in.&#10;&#10;There are many complications that can occur. You can sit out a turn and collect money. With money, you can buy &quot;organization&quot; in a state, acting as a multiplier to all subsequent votes you get in that state. You can buy &quot;advertising&quot; - most useful in buying votes in piddly states that you're too busy to visit. You can buy &quot;surrogates&quot; which are additional pawns who may travel, garnering votes, just like your candidate. You can buy &quot;special flights&quot; that help you get to places without the luck of the dice.&#10;&#10;The most characteristic part of the game comes in the &quot;issues&quot;. Each player picks a politician with his own profile on how he stands on various issues. Then either through choice or chance cards, issues become &quot;active&quot;. As long as the issue is active, politicians with a relevant stand will have bonuses or penalties when he visits certain states. The game strongly encourages role playing.&#10;&#10;The climax of the game comes at the end, as you go down each state to see who has the most votes, thereby winning that state's delegates. There is a smart balloting system, in which the lowest scoring player drops out, giving his states' votes to the next strongest in each state. This continues, with players dropping out in each successive ballot until a winner is chosen.&#10;&#10;&#10;&#10;&#10;",
        "artist": "Bill Sanders"
    },
    {
        "name": "Totem",
        "description": "from the rules summary from Game Cabinet:&#10;&#10;This little village, the arena of our game, could be anywhere in the world. It could be in the jungles, in the savanna or in the mountains. Four families live here, and each attempts to garner the most prestige. The sign of power and status stands before each cottage: the totem pole - the taller the better.&#10;&#10;The Totem animal is the proud Tschukka bird. Its meat has nourished innumerable generations in the village, and the shaman of the village use their bones to cast spells.&#10;&#10;In this game about family generations you have one goal:&#10;&#10;Your family should become the biggest and most reputable in the village and your totem pole must be the first to have all six parts.&#10;&#10;",
        "artist": "François Bruel"
    },
    {
        "name": "DungeonQuest",
        "description": "Players explore the ruins of Castle Dragonfire trying to reach the treasure chamber in the center of the dungeon and escape alive with as much treasure as possible. A limited number of turns before the game ends puts pressure on players to take risks and score rewards because anyone left in the dungeon when time runs out dies! A tile-laying system creates the maze-like dungeon and ensures that no two games are ever exactly the same.&#10;&#10;Originally published as Drakborgen (Dragon's Keep) in 1985 by Brio AB. Sold in Norway (Skatten i borgen) and Denmark (Drageborgen). Licenced to Germany (Schmidt Spiele) as Drachenhort, to Great Britain (Games Workshop) as DungeonQuest. A 2nd edition named Drakborgen Legenden was released in 2002 (never released outside Sweden). The game was re-licensed to FFG in 2010, who released the 3rd edition the same year. See the family entry for more information.&#10;&#10;Expanded by:&#10;&#10;    Drakborgen II (the Swedish expansion that upon Games Workshop's British release was split into the two below:)&#10;    Heroes for Dungeonquest&#10;    Dungeonquest: Catacombs&#10;&#10;&#10;&#10;&#10;Re-implemented by:&#10;&#10;    Drakborgen Legenden&#10;    DungeonQuest (third edition)&#10;    DungeonQuest Revised Edition&#10;&#10;&#10;&#10;&#10;!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!&#10;&#10;&#10;R&egrave;gles en fran&ccedil;ais de la Version Games Workshop 1987 de DungeonQuest&#10;&#10;+  Traduction fran&ccedil;aise de la Feuille de R&eacute;f&eacute;rence&#10;&#10;https://sites.google.com/site/cyrunicorndungeonquest/home&#10;&#10;",
        "artist": "Dave Andrews,Gary Chalk,Colin Dixon,Jes Goodwin,Anders Jeppsson,Peter Andrew Jones,Peter Jones (I),Pete Knifton,Alastair Morrison,Bill Sedgwick"
    },
    {
        "name": "Olé!",
        "description": "The object of this simple card game is to rid yourself of your hand of cards.  The deck consists of four suits, two have one through twelve cards, two have one through fifteen cards.  The suits are ranked high to low, with the fifteen suits in the middle.  Each turn, players have to play a card onto the last card played.  In order for the play to be legal, the card played must be 'higher' in either suit or numeric value.  If you play a card that beats the last card in both categories (suit and value), then you must play another card with the same restrictions.  If you cannot play a card, then you take penalty.  The first person to play his entire hand ends the hand, and everyone scores the value of the remaining cards in his hand.  During subsequent hands, the player with the highest score (the current loser) can decide to reverse the suit order (mirror it) to make his hand better.&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Cold War",
        "description": "A game for four players, Cold War gives you command of the economic, military, and intelligence forces of one of the contemporary world's major powers, and dares you to seize political, military, and economic control of as much of the world as possible.  The only obstacles in your way are your three opponents, each of whom has a bag of dirty tricks to play and an equal stake in the world regions you claim for your own.  Cold War is designed to be easy to learn, fun to play, and hard to win.&#10;&#10;",
        "artist": "Ted Koller,James Talbot"
    },
    {
        "name": "Taj Mahal",
        "description": "Northwest India at the beginning of the 18th century. The rule of the Grand Moguls is waning, and the Maharishis and princes seize the opportunity to take control of the region. By influencing the prominent forces, building magnificent palaces, and ensuring a steady supply of commodities, the princes increase their power until the most successful has won.&#10;&#10;The goal of the game is to gain the most influence points. These can be obtained by building palaces and by acquiring commodities. A palace can be built after securing the support of the Vizier, the General, the Monk, the Princess, or the Grand Mogul. Commodities are gained by seizing control of a region or by retrieving them on a space where a palace has just been built.&#10;&#10;There are twelve turns with an auction for the region control and the support of the Vizier, General, Monk, Princess, and Grand Mogul, each represented by a different symbol. Players use cards in four colors to bid for the various prizes, and each player may only play one color in any given turn. During your turn you can either increase your bid by playing more cards or withdraw. When you do, you gain the reward for every symbol you have the majority of. You place palaces, gain region tiles, and increase your score accordingly. There are bonus points for connecting palaces over several regions on the map.After the final area on the board is auctioned, the player with the highest point total wins the game.&#10;&#10;This game is #3 in the Alea big box series.&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Mr. President",
        "description": "Part of the 3M Bookshelf Series.&#10;&#10;Mr. President is a highly realistic reenactment of the campaign events which lead to the election of the President and Vice-President of the United States.  The two major political parties choose their candidates from a slate of possible nominees, each of whom possesses varying strengths and weaknesses. In their quest for victory, players feel the same frustrations and make the same decisions that confront actual candidates.  Strategies which were intended to sweep a party into office may suddenly require a drastic change of tactics.&#10;&#10;Mr. President includes Advanced Play rules covering Nominations, Advertising, Fund-Raising, Debates, and Incumbent Candidates.&#10;&#10;In the 2-player game, one player controls the President and Vice President of a party.&#10;&#10;In the 4-player game, two teams of candidates for President and Vice-President compete.&#10;&#10;The 1967 or later copyright date differentiates this version from the earlier 1965/1966 release by 3M, which is an entirely different game.&#10;&#10;NOTE:&#10;There are significant differences between the 1967 version and the 1971 version.&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "The Broadway Game",
        "description": "In The Broadway Game, you're a producer engaged in the rough and tumble world of show business finance. You can take your shows out of town and come back a hit...or die on the road from bad reviews. Your investors can pull out or a union can strike your set. Your star can fall ill; you can sell the movie rights; or be rocked by scandal. It's Broadway...&#10;&#10;The Broadway Game was invented in the late 1950's backstage in New York by Ernie Parmentier. Over the years it has become a cult hit, played in theater circles from New York to Hollywood. Now, in this new version presented by stage and screen star Mike Farrell, you can see what the excitement's all about!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Citadels",
        "description": "In Citadels, players take on new roles each round to represent characters they hire in order to help them acquire gold and erect buildings. The game ends at the close of a round in which a player erects his/her eighth building. Players then tally their points, and the player with the highest score wins.&#10;&#10;Players start with a number of building cards in their hand; buildings come in five colors, with the purple buildings typically having a special ability and the other colored buildings providing a benefit when you play particular characters. At the start of each round, the player who was king the previous round discards one of the eight character cards at random, chooses one, then passes the cards to the next player, etc. until each player has secretly chosen a character. Each character has a special ability, and the usefulness of any character depends upon your situation, and that of your opponents. The characters then carry out their actions in numerical order: the assassin eliminating another character for the round, the thief stealing all gold from another character, the wizard swapping building cards with another player, the warlord optionally destroys a building in play, and so on.&#10;&#10;On a turn, a player earns two or more gold (or draws two building cards then discards one), then optionally constructs one building (or up to three if playing the architect this round). Buildings cost gold equal to the number of symbols on them, and each building is worth a certain number of points. In addition to points from buildings, at the end of the game a player scores bonus points for having eight buildings or buildings of all five colors.&#10;&#10;The expansion Citadels:  The Dark City was initially released as a separate item, but the second edition of the game from Hans im Gl&uuml;ck (packaged in a tin box) and the third edition from Fantasy Flight Games included this expansion. With Dark City, Citadels supports a maximum of eight players.&#10;&#10;",
        "artist": "Cyrille Daujean,Julien Delval,Jesper Ejsing,Bruno Faidutti,Didier Graffet,Bjarne Hansen,Darrell Hardy,Florence Magnin,Jean-Louis Mourier,Scott Nicely,Christian T. Petersen,Brian Schomburg,Richard Spicer"
    },
    {
        "name": "Bambuti",
        "description": "The Bambuti tribe has an annual competition where the villagers bring their most valuable family belongings--large, richly engraved wooden masks--which are constantly pushed back and forward among the participants until the sound of the jungle drums abruptly stops. Who has the most valuable mask?&#10;&#10;The players play mask cards with different values and colors in front of them trying to capture the opponent's most valuable masks and gain the most points when the game ends.&#10;&#10;",
        "artist": "Jürgen Martens"
    },
    {
        "name": "Carolus Magnus",
        "description": "This game uses a collection of smallish hexagon clusters arranged in a circle.  Mercenaries, in the form of small wooden blocks, are placed onto the land pieces.  Players can then use these blocks to attempt to gain control of the corresponding mercenary type, or place the same small blocks onto the board which can help the player who controls that color.&#10;&#10;Once a player has majority of control markers on a piece of land, he can build a tower there.  The tower serves as a semi-permanent control marker, as well as a way to win.  If two land pieces are controlled by the same player, the land pieces are combined into one, which makes the position harder to take by the other players.&#10;&#10;The first player to place a set number of towers wins the game, but the game can also end when the land masses are reduced to three or fewer, in which case the player with the most towers placed wins.&#10;&#10;",
        "artist": "Studio Tapiro"
    },
    {
        "name": "Sky Runner",
        "description": "Players take on the role of cat burglars and use a simultaneous bidding mechanism similar to Raj/Hol's der Geier to get cards that allow them to move up a skyscraper.  However, the game system does add several new features to the genre such as sabotage, stealing equipment, and unique &quot;parasite&quot; cards.  In addition, the unique 3-d board is modular to allow for different difficulties and game lengths.&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Diplomacy",
        "description": "This classic game of pure negotiation has taken many forms over the years.&#10;&#10;The first Avalon Hill version has perhaps the widest release, but Avalon Hill (Hasbro) re-released the game in 1999, complete with a colorful new map and metal pieces.  In 2008, Avalon Hill released a 50th anniversary edition with a new map and cardboard pieces representing the armies and navies.&#10;&#10;In the game, players represent one of the seven &quot;Great Powers of Europe&quot; (Great Britain, France, Austria-Hungary, Germany, Italy, Russia or Turkey) in the years prior to World War I. Play begins in the Spring of 1901, and players make both Spring and Autumn moves each year. There are only two kinds of military units: armies and fleets. On any given turn, each of your military units has limited options: they can move into an adjoining territory, support an allied unit in an attack on an adjoining territory, support an allied unit in defending an adjoining territory, or hold their position. Players instruct each of their units by writing a set of &quot;orders.&quot; The outcome of each turn is determined by the rules of the game. There are no dice rolls or other elements of chance. With its incredibly simplistic movement mechanics fused to a significant negotiation element, this system is highly respected by many gamers.&#10;&#10;Avalon Hill Complexity rating - 3&#10;&#10;Re-implemented by:&#10;&#10;    Colonial Diplomacy&#10;    Diplomacy: Classical Variant&#10;    Diplomacy: Hundred Variant&#10;&#10;&#10;&#10;&#10;",
        "artist": "Blake Beasley,Hugh Bredin,Vincent Dutrait,Gilles Lautussier,Guillaume Rohmer,Allison Shinkle"
    },
    {
        "name": "Stratego Legends",
        "description": "Stratego Legends takes the familiar game play of Stratego and expands it into something new. In addition to ranks, all pieces now have powers as well. Some fly, some teleport. Some perform better in the marshes or in the mountains. Others have powerful death curses that provide long-lasting effects to the battle. There are over 200 different pieces in the universe, each with its special function.&#10; Stratego Legends is an &quot;optionally collectible&quot; game. Each box comes with a light army and a dark army whose pieces have been chosen to work well together. However, there are rules for customizing armies (and the lands they fight upon) to specialize your attack force. There are also rules for multiplayer games where 4, 6, or 8 players can square off as two teams.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Galloping Pigs",
        "description": "Galloping Pigs is a cute little 'not-quite-a-children's-game' game where players are collecting points in the form of food.  Plastic pigs are placed on a track made from cards laid in a circle, and then players are given cards in the colors of the pigs.  Each turn, a player selects a card, and moves the corresponding pig one space forward.  If the space in front is occupied by another pig, then the moving pig 'leapfrogs' that, and this can continue until the pig takes the lead, which gives the active player a food card.  Play goes on like this until all cards for the round have been played, however in order to keep the food (points) you collect during a round, your final movement for the round must score some more food.&#10;&#10;Ages 6 and up&#10;&#10;",
        "artist": "Iskender Gider,Franz Vohwinkel"
    },
    {
        "name": "Barnyard Buddies",
        "description": "In Barnyard Buddies, a bunch of cards depicting various animals in different colors are placed faceup on the table. Each turn, one player reveals a card that depicts four animals, each in a different color. All players race to figure out the animal and color not depicted on this revealed card, then grab the card on the table showing this colored animal combination.&#10;&#10;This quick, mind-crushing exercise continues until the deck is depleted. Whoever collects the most cards wins!&#10;&#10;",
        "artist": "Guy Francis,Oliver Freudenreich,Uschi Heusel"
    },
    {
        "name": "Power",
        "description": "One of the elements of Diplomacy that makes it so unique is the writing of orders for your pieces and then the simultaneous resolution of the move for everyone.  Power uses this same general concept, only minus all the devil-inspired backstabbing that makes Diplomacy what it is.  In this game, players are given equal forces consisting of ships, planes and other weapons of modern warfare, including a 'nuke' of sorts.  Each turn, players can move a set number of their pieces based on the chosen piece's movement.  The board is a painfully simple system of orthogonal squares.  Once all moves for a given turn have been written down, all pieces are moved simultaneously.  If more than one force's pieces occupy the same space, then a superiority check is made with each type of piece contributing a set number of strength points (usually inversely related to movement).  The largest force then takes possession of all opposing pieces, making the shift in power quite significant, and the central theme for the remainder of the game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Pacal",
        "description": "King Maya Pacal was born on March 26th 603 a.c. from Mrs. Zuc Kuk. Nobody knows Pacal&rsquo;s real name. He was called Pacal in many writings in order to show everybody that he was a person because his armor was found after a war and in the Mayan language armor is called Pacal. This king had a throne and he was in charge for over 68 years. Now there has to be a successor, and the players have to build their pyramid. The greatest value has to be upside and the lowest has to be on the base ascendant sorted from left to right.&#10;&#10;Who&rsquo;s going to build his pyramid first and will be the new king?&#10;&#10;",
        "artist": "Bluguy,Anke Pohl,Thilo Rick"
    },
    {
        "name": "Warangel",
        "description": "Warangel is a light, fantasy wargame, comprising now 120 warrior races, created and illustrated by Angelo Porazzi.&#10;The first edition appeared in Italy in 1996 as a collectible game.&#10;In 2000 the first boxed edition was produced and was awarded in 4 different italian luding Cons and Fairs:&#10;Best Italian BoardGame in Ludex 2000 Bologna&#10;BEST ITALIAN GAME in LuccaGames 2000, greatest luding fair in Italy&#10;Best Italian Wargame in MilanoGames 2000&#10;Best Self-produced game in AcquiComics 2001&#10;&#10;From 2007 the game is available to satisfy gamers' requests with the service:&#10;Create YOUR Warangel&#10;well illustrated on official website http://www.warangel.it/WAbox.html&#10;&#10;Now gamers may request their favourite RACES from any Generation already mounted on painted woodenblocks, &#10;choose their favourite MAPS illustrating real sectors of Earth and receive your own customized copy of Warangel.&#10;On website find plenty of pictures and samples.&#10;&#10;All REFERENCE SHEETS and RULEBOOK are A4 format, fullcolor, in English.&#10;MAPS are in A3 format, fullcolor. &#10;All these materials are well protected in plastic folders.&#10;&#10;In its first 15 years of life, Warangel reached thousands of gamers mostly in Italy but also in many countries all over the world.&#10;&#10;Create YOUR Warangel&#10;&#10;    120 RACES available, choose your favourite from any Generation, already mounted on painted woodenblocks&#10;    120 REFERENCE SHEETS available in English or Italian &#10;    ALL Available hexed MAPS, representing real sectors of Earth&#10;&#10;&#10;&#10;&#10;Integrates with:&#10;&#10;    Warangel Card Game&#10;    Warbeast&#10;&#10;&#10;&#10;&#10;",
        "artist": "Angelo Porazzi"
    },
    {
        "name": "Web of Power",
        "description": "Players struggle for influence over regions of Europe by placing two different type of control markers, Monasteries and Advisors. Monasteries are the basic placement, with the goal of securing a majority in a region or chain of monasteries or even decent points from second place. The placement of the Advisors is more restricted as the total number of Advisors in a region is limited by the majority player's number of monasteries. The game is played in two rounds and is very fast paced.&#10;&#10;Online Play&#10;&#10;&#10;     http://www.boardgames-online.net (turn-based)&#10;&#10;&#10;implemented bonus maps: China, Hellenia, Skandinavia, America, AD 850, Life on Mars, Big in Japan, Soviet Union&#10;&#10;&#10;     http://www.onlinebrettspiele.de/kuk/default.asp?l=en (Against AI)&#10;&#10;&#10;Re-implemented by:&#10;&#10;&#10;     China&#10;&#10;&#10;Expanded by:&#10;&#10;&#10;    Web of Power: The Vatican&#10;    Web of Power: The Duel&#10;&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Aladdin's Dragons",
        "description": "After the immediate response to Richard Breese's Keydom at Essen 1999, Hans im Gl&#195;&#188;ck Verlags-GmbH contracted to take the basic game idea and produce a version of the game.  Aladdin's Dragons, or Morgenland in the original German, is the product of their cooperation.&#10;&#10;The game features players putting numbered bidding chips face-down onto the board sequentially.  After the players have placed all of their chips, then each of the areas is resolved.  The bottom part of the board is where players attempt to gather treasure tokens, which is the overall currency of the game.  The middle part of the board features a number of special actions, which help the players cast spells, trade in their resource tokens, or block other players' actions.  The top part of the board is where players use treasure tokens to purchase artifacts, and the player who can collect the most artifacts by the end of the game will be the victor.&#10;&#10;Won Games Magazine Game of the Year award in 2001.&#10;&#10;Re-implements:&#10;&#10;    Keydom&#10;&#10;&#10;&#10;&#10;Re-implemented by:&#10;&#10;    Aladdin's Dragons (card game version by same name as board game)&#10;&#10;&#10;&#10;&#10;Microbadges:    (Buy One)&#10;&#10;      Aladdin's Dragons fan&#10;&#10;&#10;&#10;&#10;",
        "artist": "Doris Matthäus"
    }
]