[
    {
        "name": "Pyramid: Home Game",
        "description": "Board game rendition of the famous game show most frequently (and notably) hosted by Dick Clark. The object of the game is to describe items of a given subject to one's teammate as quickly as possible. Each team has thirty seconds for each list. The team with the most points after three rounds advances to the &quot;Winners Circle&quot; round.&#10;&#10;In the &quot;Winners Circle&quot; one teammate must make a list of items which fit each of six different categories. If the teammate can guess all six subjects in under sixty seconds the team wins the big money. The team with the most money after three games is the winner.&#10;&#10;The eight Milton Bradley games never used the actual Winner's Circle format, opting to use descriptions of items like the front game. The first three games were $10,000, with the Third Edition later repackaged as $20,000 with slightly different artwork to accommodate the change. The eighth game used $50,000, per the brief 1981 series.&#10;&#10;",
        "artist": "Design Edge"
    },
    {
        "name": "Doubles Wild",
        "description": "From the box:&#10;&#10;A roll of the dice decides where you place your marble on the board.  Don't like your roll?  You get a second chance!  3 in a row scores one point.  Four in a row scores two points.  Get the point?  Build your rows or block your opponents.  There's fun and strategy on every roll, and doubles are always WILD!&#10;&#10;The board is a grid, with the numbers 3-11 along each edge. Two blue dice determine which blue column, two red dice determine which red row, and you place your marble where they meet. Doubles are wild, so you can choose where to place your marble. If your opponent has a marble at that spot and it's not part of a three-in-a-row, you have a roll off, 3 dice and three chances, to see who can get the highest roll and claim that spot. Once a marble is part of a three-in-a-row it is locked in. Points are counted for a three-in-a-row in every direction; horizontally, vertically, and diagonally. The game ends when someone runs out of marbles, and everyone has a final turn.&#10;&#10;1999 Mensa Select&#10;&#10;",
        "artist": "Godi Gutierrez"
    },
    {
        "name": "The Simpsons: LOSER Takes All!",
        "description": "A Simpsons branded party game with a strong truth or dare flavor.&#10;&#10;The winner is the player with the lowest score at the end of the game.&#10;&#10;Players select a Simpsons character for a pawn and place it on the board.  They are given $20 in fake money and 10 junk food tokens as well as the give character cards matching the pawn they selected.&#10;&#10;Players take turns using the spinner to decide actions and movement.  Moving into a new square triggers the action described on the square, in addition to any action the spinner dictated.&#10;&#10;Typical actions are giving away money or junk food tokens to other players, receiving money or junk food tokens from other players, and swapping money or junk food tokens with another player.&#10;&#10;Special actions are the question spaces on the board.  When a player lands on one they must read the next question on the current question card, write down their answer, and pick one of the other players to guess the written answer.  If they guess correctly, they turn one of their character cards face down; if they guess incorrectly, then the current player turns one of the his/her character cards face down.&#10;&#10;Some sample questions:&#10;&quot;True or False: I'd rather watch a horror movie than a sentimental drama.&quot;  &#10;&quot;What's my favorite movie?&quot;  &#10;&quot;Has a dog ever chased me?&quot;&#10;&#10;When one player has turned all five character cards face down, the game is over.  Players with face up character cards remaining must add three points per card to their point total (sum of junk food and money).  The player with the lowest score wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Afrikan tähti",
        "description": "Afrikan t&auml;hti (&quot;Star of Africa&quot;) is the most important Finnish board game ever. Designed in 1949 by then 19 years old Kari Mannerla and published two years later in 1951, it has sold over 3.5 million copies since, half of them in Finland. There's one in almost every home in Finland.&#10;&#10;Players start in either Cairo or Tangier and start exploring Africa, trying to find gems. The main objective is to find the legendary giant diamond, Star of Africa. However, when flipping the tokens, players cannot know what they will find: nothing at all, some lesser gemstones or even a robber stealing their money and slowing their progress.&#10;&#10;When someone finds the Star of Africa, a race begins. The player with the diamond tries to deliver it back to Cairo or Tangier, other players try to find a horseshoe - a token discarded with no value before, now a key to victory. Winner is the player who reaches Cairo or Tangier first, carrying either the diamond or a horseshoe.&#10;&#10;A rules amendment, which prevents a player being stuck on an island and effectively out of the game, was only added in 2005.&#10;&#10;The first official expansion, Afrikan t&#195;&#164;hti: Retkikunnat, was published in 2014. This could be a record - a game being expanded for the first time, by the rights holder, 63 years after it was first published.&#10;&#10;Re-implemented by: Inkan Aarre&#10;&#10;",
        "artist": "Seppo Heinonen,Ritva Hussain-Shahid,Maria Jeppsson,Reet Ohna"
    },
    {
        "name": "Malarky",
        "description": "Very similar to Out of Context or any of the other find-the-real-answer games.  A question card is selected by the reader (e.g. &quot;Why does Mickey Mouse have 4 fingers&quot;).  On the back is the correct answer.  That correct card is placed into a wallet and closed.  Into all other wallets (identical) a bluff card has been placed.  The wallets are shuffled and passed around the table.  Then everyone reads their card.  If they have the correct answer, they must read it.  If they have a &quot;bluff,&quot; they make up an answer.  &quot;Balderdash&quot; voting ensues.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Piraten-Abenteuer",
        "description": "In Piraten-Abenteuer &ndash; previously published as Corsaro &ndash; players have been forced to take refuge near Adventure Island, and now they must work together to move all their boats to safety while trying to avoid the pirates who patrol the nearby waters. If a boat is captured by the pirates, the players have a chance to rescue the prisoners... at the cost of valuable time and supplies.&#10;&#10;This cooperative game is played on a board which shows the route from Adventure Island back to the player's home town. Each player starts with a boat on Adventure Island, and two pirate ships are placed along the route. The game is played in turns. Each turn, a player rolls two dice, then choses one die to use for his own boat and one die to use for one of the pirate ships. Both are moved as many places forward as the selected die shows. At certain points, the player can have his ship take a hidden route, which is not used by the pirate ships.&#10;&#10;If a pirate ship passes a boat, or if a boat passes a pirate ship, the boat is captured and placed on Pirates' Island. Other boats can free it if they manage to land on one of the rescue spaces on the track; the rescued boat is then returned to that same space.&#10;&#10;When all boats have reached the home town, the players have won the game. However, if some ships are captured while all other ships have reached the home town, the players lose.&#10;&#10;The difficulty level can be increased by giving each player two or three boats instead of one. The greatest challenge is the Grand Adventure, in which each player has three boats, there is a third pirate ship, and each player may hide on the hidden routes at most five turns during the game.&#10;&#10;The 2011 AMIGO edition is part of its &quot;&Ouml;kologisch + Kooperativ&quot; (Ecological &amp; Cooperative) line of games.&#10;&#10;",
        "artist": "Wolfgang Kramer,Petra Probst,Johann Rüttinger"
    },
    {
        "name": "Fighting Sail: Sea Combat in the Age of Canvas and Shot 1775-1815",
        "description": "Fighting Sail is a simulation of naval warfare during the age of sail. Nine scenarios are presented in the game, dealing with small-scale naval actions from the American Revolution to the Napoleonic Wars and the war of 1812.&#10;&#10;Contents:&#10;&#10;    1 22&quot; x 34&quot; map sheet&#10;    1 sheet of 140 counters&#10;    1 rules booklet&#10;&#10;&#10;&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "GolfProfi",
        "description": "The Golf Game by the people who published TurfMaster and MotorChamp.  This game shares many of the characteristics of their earlier two games, including over-the-top production, rules in both German and English, and the ability to create expansion boards (golf courses, in this case).&#10;&#10;Players use various-sided dice to represent clubs as they swing through a hex-laden course.  Also like TurfMaster, the game has a strong random element but also a decent dose of strategy.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "CrossCribb",
        "description": "CrossCribb&reg; is the exciting strategy game that takes the traditional favorite, Cribbage, and multiplies the fun times five.  CrossCribb&reg; uses conventional Cribbage scoring rules, but the similarities end there as you try to build five high scoring cribbage hands while trying to sabotage your opponents' hands.  It's easy to learn, but difficult to master.  It's CrossCribb&reg; !&#10;&#10;Build your hands across the rows, criss-crossing cards with those of your opponent who is building hands in the columns perpendicular to your rows.  One card at a time, the importance of placement, strategy and luck magnifies as the hands take shape.  Do you go for points, or play defense? It's high-scoring, fast-paced action as you try to outwit your opponents and work with your teammates.  But watch out!  Fortunes change at the turn of a card in CrossCribb&reg; !&#10;&#10;CrossCribb&reg; can be played with two to six players, or play stimulating CrossCribb&trade; Solitaire.  Durable color CrossCribb&reg; game board, high-quality CrossCribb card deck, 2 scoring pads, pencil, die and full scoring rules included.  The game also includes rules for exciting variations: CrossCribb&reg; BASIC TRAINING, CrossCribb&reg; 20:20, CrossCribb&reg; DoubleTrouble, CrossPoker Solitaire, Killer CrossCribb&reg;, and CrossPoker for 2+ players.&#10;&#10;Whether you're an experienced Cribbage player or new to the game, you'll find CrossCribb&reg; is an easy but challenging twist on an old favorite that's positively addicting!&#10;&#10;http://www.crosscribb.com&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Dorada",
        "description": "Each player starts with four tokens, and needs to advance them to the end of a short track.  Each turn, a die is rolled, and one of the tokens is moved.  There are two twists to an otherwise utterly straightforward game:&#10;&#10;&#10;     Some of the spaces are &quot;holes&quot;.  The first piece to land on a hole is lost from play, but it also fills the hole.  It is flipped to its other side, which is colored as a regular (safe) space.&#10;     A piece scores more points the later it arrives at the finish, so it behooves the player to delay for as long as feasible.  Pieces that don't finish score nothing, though, so the waiting game must be judged carefully.&#10;&#10;&#10;The game plays very fast, and offers enough depth to provide good replay value.&#10;&#10;Re-implemented by:&#10;&#10;    Cheese Please&#10;&#10;&#10;&#10;&#10;",
        "artist": "Heiner Buck"
    },
    {
        "name": "Chinese Chess",
        "description": "Despite its name, this game has nothing to do with Xiangqi, the *real* Chinese Chess.  It does have original mechanics, though.&#10;&#10;The pieces start out filling the 6x6 board except for the central 2x2 area.  Both players move both sets of pieces; the trick is that one player jumps same-coloured pieces whilst the other jumps different-coloured pieces.  Jumped pieces are removed, and the object of the game is to capture 13 pieces.&#10;&#10;When you land on same/different-coloured square (there are 12 coloured squares, surrounding the central 2x2 area), you get to go again.  Multiple jumps are possible.  If you cannot jump, you slide, moving like a rook.  Lastly, you cannot move a piece that's just been moved by the opponent.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Express Monopoly Card Game",
        "description": "A different and simpler game from the Monopoly Card Game; this game comes in a double card sized pack with a jigsaw board.&#10;&#10;Play consists simply of playing cards from your hand to the board with the aim of being the player to complete a set or Monopoly, at which point you collect the cards in that set in your score pile.  There are special cards which allow you to steal cards sight unseen from other players.  Chance and Community Chest cards act as jokers.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Rubik's Illusion",
        "description": "A curious abstract strategy game.&#10;&#10;The box forms the board; 32 squares plus a mirror which fits at right angles to the board producing a total playing surface of 64 squares.  Each piece on the real side of the board has a reflection on the virtual side, which acts in all ways as a real piece. The pieces come in three types; red with red reflection, yellow with yellow reflection, and red with a yellow reflection (and vice versa, of course).&#10;&#10;On his turn a player can introduce a piece to the edge of the board, slide a piece of his colour or a dual piece or turn a dual piece 180 degrees.   The aim of the game is to produce a line of 5  (but no more) pieces of his colour in any direction.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "War Without Mercy",
        "description": "War Without Mercy is the first of three games in Clash of Arms's Struggle for Europe series. It includes the entire east front including the invasion of Poland which is an introductory scenario. The game scale is 30 miles per hex, two weeks per turn with units at division and corp level. When the final two games are published all three games can be combined to play all of WW2 in Europe and North Africa.&#10;&#10;",
        "artist": "Tom Hannah,Timothy Schleif"
    },
    {
        "name": "Blitzkrieg General",
        "description": "Blitzkrieg General is much like an advanced version of Axis & Allies. The game has both basic and advanced rules.&#10;&#10;From the publisher site:&#10; Standard Features:&#10;Complexity     Low&#10;Solitaire Suitability     High&#10;Time scale:     1 turn equals three months&#10;Playing time:     2-12 hours&#10;Players:     One to Eight&#10;Recommended Player Age     10 and up&#10;&#10;",
        "artist": "Udo Grebe,Beth Queman"
    },
    {
        "name": "Avalanche: The Invasion of Italy",
        "description": "Avalanche: The Invasion of Italy covers the allied invasion of Italy at Salerno. The game scale is 2 kilometers per hex, 6 hours per turn, and units are battalion to company level.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Drakborgen Legenden",
        "description": "The 2nd edition of the classic adventure game Drakborgen (DungeonQuest) from 1985. The players enter the unexplored Dragon's Keep in search for treasure. The Keep is home to a dragon, and it is up to the players, with luck and timing, to overcome the dangers, collect some treasure and escape from the Keep before the sun sets and the vampires go hunting.&#10;&#10;This edition features streamlined rules, for example pre-placed one-use event tiles (placed onto the room tiles) instead of the players drawing room cards each time they enter a room. Door cards, trap cards, search cards, corpse cards and chest cards have been rationalized; all is now contained on the room tiles. Undefeated monsters and certain traps now stay on the board, and the game features a slightly more complex and tactical fighting system. The game allows for co-operative play, and even the dragon herself can be killed.&#10;&#10;Re-implements:&#10;&#10;    DungeonQuest&#10;&#10;&#10;&#10;&#10;",
        "artist": "Andreas Gustafsson"
    },
    {
        "name": "Marrakesh",
        "description": "An adventurous children's race game, with a tactical element and a variable game board. Good fun for adults too.&#10;&#10;Each trader has four camels, that they attempt to get through the desert to the market at Marrakesh. The market in Marrakesh has a lot of valuable items waiting and these provide the victory points for finding out the winner. Movement is controlled by drawing tiles from a bag. Tiles usually allow you to move your camel, but may have other effects such as Sandstorms, which change the board layout. Camels that arrive earlier at the market will be able to pick up the most valuable items. However, if you concentrate all your efforts to get one camel to market, you are likely to lose your back-markers to the sandstorms.&#10;&#10;Re-implemented by:&#10;&#10;    Race Through Space&#10;&#10;&#10;&#10;&#10;Re-implements:&#10;&#10;    Up the River&#10;&#10;&#10;&#10;&#10;Ages 6 and up&#10;&#10;",
        "artist": "Ulrike Fischer"
    },
    {
        "name": "Operation Cannibal",
        "description": "Operation Cannibal simulates the battle of Arakan in Burma during 1942-43. It uses a multiple impulse system where impulse chits are drawn and the player whose chit is drawn may perform actions which may be limited due to the restrictions of the chit drawn.&#10;Operation Cannibal is a fast-paced two player wargame that reproduces the circumstances, the events, and the forces that fought the fiercest of the Commonwealth jungle operations during WWII. The game system simulates the various battles and conflicts of the combat operations from December 1942 until April 1943.&#10;&#10;The game scale is 4 Km per hex, while turns represent one day, and there are 140 counters representing companies and battalions. There's the Campaign game starting with the initial Commonwealth push into the penninsula, with three shorter scenarios. Optional rules for amphibious assaults, evacuation by sea, Fog of War, random impulse selection, and the British 29th Brigade.&#10;&#10;",
        "artist": "Brien J. Miller"
    },
    {
        "name": "The African Campaign",
        "description": "The African Campaign covers the war in North Africa during world war two. The map covers an area from Alexandria to just east of Tripoli. Units are from brigade to divisional level. This game is much like an advanced version of Avalon Hill's Afrika Korps.&#10;&#10;",
        "artist": "John Edwards"
    },
    {
        "name": "Austerlitz",
        "description": "Austerlitz is the first game in The Gamer's Napoleonic Brigade Series of games. Game scale is 30 minutes per turn with each hex representing 200 yards. The game includes special rules for solitaire play.&#10;&#10;Napoleon Brigade Series (NBS) &#10;- scale = 180-200 m/hex (197-219 yrd/hex);&#10;- time = 30 min/GT (60 min/Night-GT);&#10;- strength = 150 inf (100 cav)/SP&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Field Marshal",
        "description": "Field Marshal is a wargame between two fictional countries using world war two era technology. The game adds a level of uncertainty with a deck of event cards which could cause events such as some of your troops being withdrawn to another front which is off map and which you have no control over. Also included is a third minor country which could join the fighting on either side.&#10;&#10;",
        "artist": "Sawshun Yamaguchi"
    },
    {
        "name": "King Arthur and the Knights of the Round Table",
        "description": "King Arthur and the Knights of the Round Table is two games in one. First you play the quest game to build your army and improve your knight. Then the game proceeds to the civil war where the fight to be the heir to the throne begins. Elements of role playing are involved as your knight has statistics which can improve during the game and various pieces of equipment can be bought. The game also includes jousting tournaments in which the winner can earn money and honor.&#10;&#10;",
        "artist": "Ed Dovey"
    },
    {
        "name": "The Fury of the Norsemen",
        "description": "MicroHistory #4 in the Metagaming MicroHistory series is a two-player game of Viking raids in the 10th century. Rules allow for plunder, capture, berserker, torching, leaders, missile combat, and a special Divine Wrath provision for the clergy.&#10;&#10;Includes one rules booklet, map, counters and die.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Farming Game",
        "description": "Similar to Monopoly, but instead of buying real estate, players acquire plots of land and plant a variety of crops in the hopes that the harvest will pay out big. However, with each harvest comes the unavoidable cost of doing business (fertilizer, equipment breakdown, purchasing new seeds, labor problems, etc.). The first player who has a total net worth (including land, equipment, livestock, etc.) of $250,000 becomes a &quot;Full Time Farmer&quot; and wins the game - thus getting rid of the time-consuming player elimination aspect of Monopoly.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Stalin's Tanks",
        "description": "MicroHistory #3 in the Metagaming MicroHistory series&#10;&#10;Players fight the East Front battles of WW2.&#10;&#10;From back of the game:&#10;&#10;Welcome to the Eastern front...&#10;&#10;The Nazi invasion of Russia destroyed more lives than any war in history.  For the common soldier it meant unsurpassed suffering.  Great battles were fought in ice, mud, dust and exhaustion.  The tank became queen of the battle and the key to victory.  Now you can face the challenge of an east front armor commander in this fun, fast playing game of maneuver and combat.&#10;&#10;STALIN'S TANKS is another historical MicroGame from Metagaming.  Players take command of the mighty, proven German war machines or the relentless Soviet defenders.  Complete with basic and advanced rules, STALIN'S TANKS is an exciting simluation of armored warfare on the Russian front and is compatible with ROMMEL'S PANZERS.&#10;&#10;",
        "artist": "Trace Hallowell,Ben Ostrander"
    },
    {
        "name": "The Lords of Underearth",
        "description": "Microgame #18 in the Metagaming Microgames series.&#10;&#10;From the box:&#10;&#10;Underearth is the ancient stronghold of the Dwarven Lords.  This game covers the earthy realms' full history: from the height of Dwarven power to its decline in the days of dragonfire and destruction.  Here, you will lead bands of Humans, Dwarves, Orcs and monsters on raids, wars and treasure hunts.&#10;&#10;'The Lords of Undereath is a two player game of fantasy tactical combat in an underground labyrinth.  The rules cover solitaire play, surprise attack, pursuit, morale, locked doors, sentries, flight, treasure, mercenaries and even uncontrolled movement.  This game is a complete simulation of fantasy combat at the group (skirmish) level.&#10;&#10;Lords of Underearth definitely pays off on its promises and then some.  It's easy to learn.  It plays fast.  The board is geomorphic which helps replayability.  Solitaire play actually works.  Four clever scenarios are presented, all of them are fun, like the one that sure reminds us of Smaug and the Lonely Mountain or another that is suspiciously similar to the battle at the Bridge at Khazad-d&ucirc;m. It's also compatible with Wizard &amp; Melee and The Fantasy Trip, although you'd never want to play it that way.&#10;&#10;This game republished in supplement of Japanese TACTICS magazine #54.&#10;&#10;",
        "artist": "Trace Hallowell,Pat Hidy,Denis Loubet,Norman Royal"
    },
    {
        "name": "Helltank",
        "description": "Microgame #19 in the Metagaming Microgames series.&#10;&#10;Details from the game box:'&#10;&#10;The nearby grumble and clank surges rank fear in your veins. Crouched low you wait. Dragons or Ogres of old might at least be fought. Helltanks are certain death. Closer, closer it comes. You wait and pray it strikes right or left, anywhere but here. Helltank is a game of tactical armored conflict in the 21st century. Each counter is a single vehicle or small unit. Included are the U.S. Klane class MBT-1 1, light cav. Raiders, Japanese IFV infantry carriers, Israeli Missile Launchers, Recon Hovers, Brazilian tri-turret MTTs, jet-pack Hawk Teams, Air Cruisers and the first Ft. Ticonderoga class heavy launch vehicle, Helltank. Versatile rules portray future combat in a playable, yet realistic manner. covering movement firing. opportunity fire, missiles, air defense platforms and the special unit rules.&#10;&#10;Contents:&#10;&#10;    Rules&#10;    12x14 play map&#10;    126 unit counters&#10;&#10;&#10;&#10;&#10;Followed by:&#10;&#10;     Helltank Destroyer&#10;&#10;&#10;&#10;&#10;",
        "artist": "Norman Royal"
    },
    {
        "name": "Annihilator & One World",
        "description": "Microgame #14 in the Metagaming Microgames series.&#10;&#10;This is actually 2 games in one:&#10;&#10;     One world is the game of godly conflict for those who've dreamed secretly of divine power. Each player is a god who must contend with a pretentious challenger. Your &quot;children&quot; wage the struggle in their aspects of Blade, Stone, and Fog. Over the Singing Grasses, Runelines, the Faults of Chaos and on the Crystal Pylons the battle rages. OneWorld is a fast playing, humorous game, which features a diceless combat system. This is an excellent game for starters or an amusing diversion for the aficionado&#10;&#10;&#10;&#10;&#10;&#10;     Annihilator is a giant, planet killing, computer controlled spaceship. Pan-Human Alliance assault squads and demolition teams blast their way through the ship to get to Annihilator's brain core. The ship has security robots, repair bots, and automatic defenses to stop the humans.&#10;&#10;&#10;",
        "artist": "Robert Phillips"
    },
    {
        "name": "G.E.V.",
        "description": "Microgame #8 in the Metagaming Microgames series, the original release of G.E.V.  A follow-up to Ogre.  Units from Ogre are carried over, with expanded rules for terrain.  A larger map and more ambitious game.&#10;&#10;Second base game of the Ogre/GEV Family.&#10;&#10;Note: Ogre and G.E.V. were later reissued separately and then repackaged together as Ogre / G.E.V. by Steve Jackson Games. The Steve Jackson GEV edition has a different countermix to the original editions.&#10;&#10;",
        "artist": "Winchell Chung,David R. Deitrick,Denis Loubet,Dave Martin,Philip Reed,Brian Wilson"
    },
    {
        "name": "Ogre",
        "description": "OGRE and its sequel G.E.V., are tactical ground combat games set in the not-so-distant future. In 2085 A.D., armored warfare continues - faster and deadlier than ever. Hovercraft, tanks and infantry slug it out with tactical nuclear devices. But the most feared weapon of all needs no human guidance. It's a giant cybernetic tank called the OGRE.&#10;&#10;The basic OGRE game gives one player a force of infantry and armor, and a command post he must defend. The other player has only one unit - but it's an OGRE. It's an even match. Advanced games allow solitaire or multi-player action, with OGREs on both sides.&#10;&#10;Microgame #1 in the Metagaming Microgames series, and the original release of Ogre.  Origin of the Ogre/GEV Family.&#10;&#10;&#10;This is an entry on RPGG: &#10;GURPS Ogre  includes character and vehicle descriptions, a future timeline, a discussion of the world of the Ogres, and the Armor Unit Combat System, a quick way to resolve battles involving player characters and get back to the roleplaying!&#10;&#10;",
        "artist": "Denis Loubet,Clark Bradley,Winchell Chung,Alvin Helms,Barclay Lawder,Kyle Miller,Brandon Moore,Philip Reed,Gabby Ruenes,Brian Wilson,John Zeleznik"
    },
    {
        "name": "Six Cubes",
        "description": "&quot;Six Cubes- A Board Game Of Dice Strollegy. This is the most exciting combination dice board game ever. If you like to shake 'em up you'll love Six Cubes. Family fun for two or more players ages 10 to adult. Careful strollegy (the science of rolling dice into the most advantageous combinations) can lead you to be the winner.&quot;&#10;&#10;See: More Information (below)&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Eleusis",
        "description": "Eleusis (and later New Eleusis, 1976) is a card game that simulates the scientific method in action.  You need two packs of cards, a table and some paper and pencil to play.  The 4-8 player range works best.&#10;&#10;One player (&quot;God&quot;, &quot;Nature&quot; or the &quot;Demiurge&quot;) thinks up a rule (a &quot;law of nature&quot;) that governs the correct play of the cards.  Usually, the rule only involves the most recently correctly-played card, but it can be more complex.&#10;&#10;The other players (&quot;Scientists&quot;) take turns playing cards (&quot;performing experiments&quot;) and race one another to see who can come up with a good hypothesis about the rule.  The first player to correctly deduce the rule scores big; God also scores based on how long it took for the players to figure the rule out.  God should not choose a rule that is so hard to find out that nobody does, because then he doesn't score.&#10;&#10;Additionally, a player with an hypothesis can declare himself to be a &quot;prophet&quot; who can predict the results of the other player's experiments.  Other players can then try to bring about the overthrow of the prophet by trying to find experiments whose results cannot be predicted (falsification), thus gaining a chance to become prophet themselves.&#10;&#10;A very simple rule would be &quot;Alternate between black and red cards&quot;.  A simple but hard to discover rule would be &quot;Alternate between cards which have closed loops in their number or letter designations (e.g. 4, Q), and cards which don't (e.g. 2, K)&quot;.&#10;&#10;The game was first published in Martin Gardner's Scientific American column in June 1959. A revised version appeared in Gardner's July 1977 Scientific American column.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Star Trek Game",
        "description": "Boardgame themed on Star Trek: The Motion Picture.&#10;&#10;From the box:&#10;&#10;Join the crew of the Enterprise on their travels through space.&#10;&#10;Set out from your home starbase, crossing from one starpath to another on your intergalactic voyage. Take part in their exciting missions seeking out unexplored stars. As you hunt for secret Klingon outposts and investigate Black Holes, be on the alert for attacks from Hostile Aliens!&#10;&#10;Complete three missions and head for your home starbase. The first starship commander to reach home wins this challenging space adventure game!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Old Town",
        "description": "In Old Town, the players are trying to recreate an old ghost town as it looked in the late 19th Century. Remnants of the town are still visible, but where exactly had the Saloon been located? The players must try to collect all available information about the 19 building sites and see whether they can complete the puzzle. A few surviving gold diggers are around to contribute information, but their memories aren't always reliable! This was, originally a desk top published game designed  by Stephan Riedel. If you like problem solving games then this game could be for you.&#10;&#10;",
        "artist": "Christian Opperer,Stephan Riedel"
    },
    {
        "name": "Glory",
        "description": "(From the gamebox :)&#10;&#10;Glory is the first game in GMT's Gameplayers Series. Glory presents three American Civil War battles - First Manassas (1861), Second Manassas (1862) and the Battle of Chickamauga (1863) - as never before seen. The new game system combines sophistication with ease of accessibility: the rules are less than eight pages and there are practically no charts. The system combines mostly familiar mechanics with just enough new ones to add spice and challenge to comfortable familiarity. And while you can start playing in about 15-20 minutes, it will take far longer to master the nuances of play. To add to all of that, there are four different ways to play the game, from Igo-Hugo all the way to command oriented LIMs.&#10;&#10;Contents:&#10;&#10;    400 full-color 1/2&quot; &amp; 5/8&quot; counters&#10;    2 22&quot;x34&quot; full-color game maps&#10;    1 8-page rules booklet&#10;    1 Scenario Booklet&#10;    1 10-sided die&#10;&#10;&#10;&#10;&#10;Unit scale: Brigade&#10;Time Scale: 75 minutes per turn&#10;Map Scale: 250 yards per hex&#10;Players: 1-2&#10;&#10;",
        "artist": "Rodger B. MacGowan"
    },
    {
        "name": "Gnip Gnop",
        "description": "Players bang on their paddle switches trying to be the first to propel all of the balls through the hoops and onto their opponent's side of the game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Great Battles of Alexander",
        "description": "The Great Battles of Alexander contains four of the Macedonian conqueror's most famous and decisive battles, all chosen to highlight the developement of the Macedonian Art of War. The battles covered are: &#10;&#10;     Chaeronea &ndash; August 338 BC &#10;     Granicus &ndash; May 334 BC&#10;     Issus &ndash; November 333 BC&#10;     Gaugamela &ndash; October 331 BC&#10;&#10;&#10;&#10;&#10;The game mechanics use a combat system that emphasizes weapon/armor superiority and maneuverability over quantity. The battles can be fought separately or combined into a campaign version.&#10;&#10;Contents:&#10;&#10;&#10;     600 die-cut counters&#10;     Two 22&quot;x34&quot; mapsheets; 19mm hexes; backprinted&#10;     One rules booklet&#10;     Two charts &amp; tables sheets&#10;     One 10-sided die&#10;&#10;&#10;",
        "artist": "Ted Koller,Rodger B. MacGowan"
    },
    {
        "name": "Sniggle!",
        "description": "Not to be confused with the Sniggle game that is in the Sly set, this game is a race.&#10;&#10;A roll and move race game where you must get your 4 pawns numbered 1 through 4 into the corresponding number spaces on the other side of the board. Each player tries to manoeuvre his four coloured pieces to their ending positions before the others.  On your turn, you roll two dice and assign each die to a separate piece; doubles get you an extra go.  You can only move sideways and forward.  If you get landed on by your opponent your pawn gets sent back to the start. Spaces of your own color are safe, where you cannot be landed upon. First player to get all 4 of their pawns across the board wins.&#10;&#10;The end game zone channels all pieces through a narrow passage, increasing the likelihood of mayhem.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Samurai Blades",
        "description": "Samurai Blades is both a self-standing game and a companion for Siege and Cry Havoc. On its own Samurai Blades has five different scenarios. There is a further scenario for use with Cry Havoc. Rules for using the system for competitions are included at the end of the Scenario Booklet.&#10;&#10;Part of the Cry Havoc series.&#10;&#10;",
        "artist": "Peter Dennis"
    },
    {
        "name": "Omaha Beachhead",
        "description": "Omaha Beachhead is a grand tactical simulation of the American amphibious assault against the German-occupied coast of Normandy on June 6, 1944 and the subsequent ten-day battle for the beachhead. In turns representing one day, each player controls a force of infantry, artillery, tank, anti-tank, flak, and ranger units. The map, which was drawn from US Army maps actually carried in the battle, is a 1:50,000 representation of Normandy showing all of the geographical features that played a significant role in the campaign.&#10;&#10;",
        "artist": "Ted Koller,James Talbot"
    },
    {
        "name": "Sinai",
        "description": "From the rear cover:&#10;&#10;This game is a simulation of real-world events. It is played on a map that is a simplified terrain reproduction of the actual battlefield. A grid of hexagons printed over the map is used to regulate movement and position such as the squares on a chess board. The pieces in the game represent the actual military units that took part in the historical conflict. The large numbers on the pieces indicate the relative strength of these units. Each Player maneuvers his pieces on the map to engage those of the enemy. Battles take place when units are adjacent to enemy units. The total relative strengths of the involved units are compared. The attacking Player consults a simple probability table (the Combat Results Table) to determine the outcome of each battle. First one Player moves his units and conducts attacks, and then the other. The game proceeds this way (for a specified number of turns) as the Players try to achieve the historical objectives set forth in the rules. The final outcome of the game can be very different from the actual historical result. This gives Players a chance to &quot;change history.&quot; No prior knowledge of history or military tactics is required to play the game - just a little ingenuity and common sense.&#10;&#10;CONTENTS:&#10;&#10;22&quot; x 34&quot;, mounted terrain map&#10;255 die-cut cardboard playing pieces&#10;One rules folder&#10;One plastic storage tray&#10;One plastic die&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "The Game of Y",
        "description": "Players attempt to link three edges of a special triangularly shaped board with stones of their color.  Turns consist of placing a single stone, with turns strictly alternating.  There is no movement or capture.&#10;&#10;This game is a direct descendant of Hex.  It is a predecessor of Poly-Y, Star, and *Star.&#10;&#10;Generalized by Begird.&#10;&#10;Other Games played on Game of Y board:&#10;&#10;     Aliens and Amazons&#10;     Sexta&#10;     Singularity&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Montage",
        "description": "Montage is a partnership word game in which each player, in turn, thinks of a word, &quot;spells&quot; it on the crossword-like grid using color-coded tiles &ndash; each color corresponding to one vowel and five or six consonants, e.g. yellow is A/B/C/D/Z and green is U/T/V/W/Y/X &ndash; then gives a clue, in the hopes that his partner can guess the word before either of the opponents do.&#10;&#10;In 1992, Joli Quentin Kansil revived the idea behind Montage in &#194;&#161;Knock-on-Word!, a similar partnership word-guessing game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Star Wars: Destroy Death Star Game",
        "description": "A  Star Wars based game in which you command a squadron of three X-wing fighters and try to drop your proton torpedoes down the ventilation shaft of the Death Star before it can destroy Yavin IV.  A spinner dictates movement and determines the results of the battles.  Darth Vader can pop up to cause trouble, but watch for the Millennium Falcon coming to the rescue!&#10;&#10;Though named the same as Star Wars: Destroy Death Star Game, these are much different games.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Lord of the Rings Tarot Deck and Card Game",
        "description": "All players start out as Free Peoples of Middle-earth on a journey to Mount Doom with the hopes of destroying the One Ring so it won't fall into the evil hands of Sauron. The Journey is represented by the playing of cards from your hand onto the Journey Pile (discard pile). The players as a group reach Mount Doom (i.e., the round ends) as soon as one player has run out of cards. Along the way, players will be influenced by the forces in Middle-earth, and some may be pulled by the Dark Forces to join Sauron in his attempt to gain control of the Ring. This is represented by playing Dark Forces cards and earning Dark Points.&#10;&#10;Players earn Victory Points in their journey, representing bravery and their dedication to the cause of either Gandalf or Sauron. At the end of the game, the player or players with the most Victory Points is the winner. Three rounds constitute a game. Each round represents one of the three books in Tolkien's The Lord of the Rings trilogy.&#10;&#10;",
        "artist": "Peter Pracownik"
    },
    {
        "name": "Gorkamorka",
        "description": "This is a tabletop miniatures wargame that is based mainly on conflicts between Orks stranded on a dead planet, separated into two factions: those that believe in the god Gork and the others the god Mork; Gorkers and Morkers respectively.&#10;&#10;Players design Ork mobs comprised of a small number of warriors and their vehicles. The game uses a unique system of movement for trucks, wartraks and bikes to locate riches and beat up rival mobs. The game allows you to build up your mobs similar to Necromunda but does have more humorous appeal to it. One expansion was produced, Digganob, which added some more factions to the mix including Muties (mutant riders) and Diggas (Ork-obsessed humans), along with additional scenarios and special characters.&#10;&#10;",
        "artist": "John Blanche,Wayne England,Des Hanley,Neil Hodgson,Paul Smith,John Wigley"
    },
    {
        "name": "Star Trek: The Next Generation – Interactive VCR Board Game – A Klingon Challenge",
        "description": "Board is set up in view of a television/VCR and players watch a videotape of simulated action and narration filmed on the set of the Star Trek series. Players assume the roles of the few remaining on-board crew members of the U.S.S. Enterprise, which is docked for repairs.&#10;&#10;The players (watching the tape) see a renegade Klingon (named KAVOK) hijack the ship with only themselves aboard with him. He periodically appears on the television screen (which is a simulation of different communication view screens aboard the ship) and talks to the players during the game.&#10;&#10;KAVOK's intention is to use the Federation ship to to attack the Klingon Empire and instigate a Federation/Klingon war. He also plans to gloriously die in battle along with the remaining crew. KAVOK will create setbacks and obstacles for the players as they attempt to gain access to the bridge and regain control of the ship. The journey to the Klingon Empire takes 60 minutes of real time game-playing (displayed on screen). They play against the clock, and if nobody wins, they all lose.&#10;&#10;Play consists of rolling the die, moving around the board (which represents the Enterprise), drawing cards and interacting with the video of KAVOK until they reach the bridge and win, or the time expires and they lose.&#10;&#10;A sequel involving Q was planned for release the following year but was shelved due to licensing issues.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Booby-Trap",
        "description": "This classic game of the mid 60's featured a wooden box with a spring bar that was pulled back with dozens of small wooden circular pieces of different sizes sandwiched in it.&#10;&#10;The play consists of removing pieces from within the spring bar &quot;trap&quot; in hopes of not making it move. Different sized pieces are worth a certain amount of points each. Point penalties are incurred if the bar moves. The player who has accumulated the most points at the end of the game is the winner.&#10;&#10;Game ends when the number of pieces left in the board equal the number of players.&#10;&#10;",
        "artist": "Bildgården AB"
    },
    {
        "name": "Star Wars: Jedi Knights CCG",
        "description": "Each player must first construct decks using cards of their choosing. One player represents the ALLIANCE and the other is the EMPIRE. Each game of Jedi Knights writes its own Star Wars story. Battles rage across the galaxy as players clash in space with orbiting starships and on planets in character-to-character firefights.&#10;&#10;Player who wins control of three planets controls the universe and wins the game. If an opponent steals away one or two planets the game enters a final conflict stage, which uses the resources won from the first three planets combined with their remaining cards. Both sides must battle until only one player remains on the fourth and final planet. That player is the winner.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Kanev",
        "description": "Kanev: Parachutes Across the Dnepr, September 1943, is a war game that explores the confrontation between Soviet and German forces at the lower Dnieper river in September 1943, which featured the largest Soviet airborne offensive during World War 2.  Players assume command of either army and take turns to execute their orders for their forces.&#10;&#10;In this game, units exert a zone of control around them, forcing opposing units to maneuver around them to avoid being stopped in their tracks.  Engagements between units are resolved by consulting results of dice rolls modified by terrain, leadership, and other factors against charts.  Airborne assaults and air support are also part and parcel of the combat.  Keeping units in reserve is a strategical option, allowing players to immediately exploit breakthroughs and redeploy after battles.&#10;&#10;The game ends after a certain number of rounds.  The players total up their victory points (typically for occupying strategic locations with their units) and whoever has more is the winner.&#10;&#10;Game Scale:&#10;Turn: 8 hours&#10;Hex: 1.67 km&#10;Unit: Company to Division&#10;&#10;Game Inventory:&#10;One 21&quot; X 32&quot; mapsheet&#10;One countersheet (200 1/2&quot; counters)&#10;One 12 page rules booklet&#10;&#10;",
        "artist": "Ina Clausen,Rodger B. MacGowan"
    },
    {
        "name": "Commando",
        "description": "Commando allows players to play small unit raids in eras from WW1 to the cold war.&#10;&#10;Each unit represents a single man each with his own statistics for a roleplaying type game. The game has rules to play it with a gamemaster.&#10;&#10;NOTE: This item is also found in RPGGeek: Commando&#10;&#10;",
        "artist": "Redmond A. Simonsen,David Wenzel"
    },
    {
        "name": "Stack",
        "description": "Stack is a simple dice rolling and collecting game.  Players stack dice on top of their opponents dice to &quot;capture&quot; stacks.  Once a stack of dice reaches 4 high, it is frozen and points awarded to the owning player.  Players have the option of re-rolling a die before stacking it.&#10;&#10;The equipment consists of 14 six-sided dice in multiple colors.  The version I have is the &quot;4-player&quot; version.  The rules allow from 2-8 players.  This would be a good tavern or drinking game.&#10;&#10;",
        "artist": "Jeffrey L. Strunk"
    },
    {
        "name": "Hilarium",
        "description": "Hilarium is a party game where players draw cards with all kinds of wild actions on them.  Then everyone acts, yells or just sings out what's on their cards--all at once! Every card has an exact match, so try to find the player who is acting out what's on your card.  Find that match and you score!  But don't get stuck with the Gotcha Card...that one will cost you.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Triumphant Fox",
        "description": "Triumphant Fox uses a player interactive formation activation system similar to that used in Tunisia 43 and Piercing the Reich.&#10;&#10;Alea Magazine n&ordm;22 (Guerra Civil Espa&#195;&#177;ola: Expansi&#195;&#179;n no oficial para The Rise of the Luftwaffe) contained one new scenario, errata and additional rules&#10;&#10;",
        "artist": "John Kranz"
    },
    {
        "name": "Overlord",
        "description": "Overlord is an operational game of the allied invasion and breakout from the Normandy peninsula.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Bloody Kasserine",
        "description": "Covering the battle in Tunisia from February 14 to 24 in 1943.  It is also called &quot;A Valentine's Day surprise&quot;.&#10;Bloody Kasserine uses the same system as GDW's game of Race For Tunis. Rules in Race For Tunis allow you to combine the two games into one.&#10;&#10;",
        "artist": "LaMont Fullerton,Kirk Wescom"
    },
    {
        "name": "Octiles",
        "description": "Goal: Get all your pieces across the board first (Like in Chinese Checkers)&#10;&#10;Setup: Fill the board with 18 octagonal tiles(designating all the different permutations of connections between the 8 sides of a tile) starting face down, leaving one switch tile for exchanging.&#10;&#10;Place up to 5 colored runners on their starting circles. A turn consists of: Replacing a tile with the &quot;switch&quot; tile, then move one runner across it, either across one tile, or until the path ends.&#10;The board is beautifully made with colored felt holes designating the starting spaces. There are optional rules for solitaire, standard, and team play.&#10;&#10;2003 Mensa Select&#10;&#10;Online Play&#10;&#10;&#10;     Boardspace.net (real-time, AI option)&#10;&#10;&#10;Narrow is an unauthorized reproduction of Octiles&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "Star Trek: The Next Generation Game of the Galaxies",
        "description": "The object of the game is for each player (playing a ST:TNG character) to distinguish himself in the task of establishing peace throughout the galaxies (sic).  You attain this aim by collecting &quot;Peace Treaties&quot; from alien nations spread throughout six different galaxies.&#10;&#10;In the Lieutenant Rules (No Reading Required!), you race about the board collecting treaties.  Transporter spaces act as tunnels across the board.  The player with the most treaties collected wins.&#10;&#10;In the Captain Rules, each player gets one or two (depending on the number of players) photon torpedo cards, used to blast asteroid belts which block access to some planets.  Treaties come in two colours, the rarer ones being more valuable.  Random event cards complicate matters slightly.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Pro Tennis",
        "description": "Pro Tennis simulates tennis matches in the early 1980's, the era of Jimmy Connors, John McEnroe, Martina Navritolova and Chris Evert. Included are cards for 50 men and 50 women professionals. Each card has a column for &quot;Serve&quot;, &quot;Serve Return&quot;, &quot;Volley&quot; and &quot;Special&quot;. Play consists of rolling dice (two white dice, plus a red die that isn't added to the others but sometimes changes the outcome) and cross-indexing the number rolled with the proper column. The result will be a point for one of the players or an instruction to roll next in one of the other columns. Once in a while, a player gets to make a choice that varies a column's results, and random events, such as stomach cramps, broken rackets, arguments with the umpire and thunderstorms, are possible.&#10;&#10;To take an example, Connors is pitted against McEnroe. Connors has the serve. He rolls 1, 5 (white) and 3 (red). The dice roll is 15 (read the dice as digits, low roll first); the red is ignored unless it's a 5 or 6. A 15 in Connors' Serve column is &quot;I&quot;, which means that McEnroe can return the serve. He rolls 2, 2 (white) and 1 (red) - a 22, which yields a &quot;V&quot; in his Serve Return column. Connors must now roll against his Volley column. He gets 4, 6 (white) and 5 (red). Ordinarily, a 46 would be a point for him, but the red 5 allows McEnroe to make a clutch return. He rolls the white dice (only). A score equal to or less than his Clutch Value is a V result; anything higher loses the point. McEnroe's Clutch Rating is 33. He rolls a 3 and a 6 - not good enough, and Connors is ahead 15-love.&#10;&#10;Connors serves again: 4, 6 (white) and 5 (red). An ace for Connors; McEnroe doesn't even get a clutch return. 30-love.&#10;&#10;The next Connors serve: 2, 2 (white) and 2 (red). Triples generate a random event. (Many players think that random events are too common and limit their appearance to rolls of triple 1's.) Connors rolls the two white dice: 3, 4. He's gotten into an argument with the umpire (realism!) and draws a warning. If he argues again, he'll automatically lose a point.&#10;&#10;Back to serving: 1, 4 (white) and 2 (red). The result is &quot;I&quot;. McEnroe's return: 3, 4 (white) and 1 (red) - a &quot;V&quot;. Connors rolls 1, 2 (white) and 4 (red). A 12 on his Volley column is &quot;S&quot;, which means that he returned the shot but left his opponent in a good position. McEnroe can roll on the favorable &quot;Special&quot; column. Sure enough. He rolls 3, 5 (white) and 3 (red); a 35 on his Special column wins the point. 30-15.&#10;&#10;And so it goes.&#10;&#10;This not a game for anyone who wants to devise winning strategies. Rather, the players watch as the dice play. That is, however, the point of this kind of sports simulation: to project what would happen if real athletes competed in imaginary matches.&#10;&#10;The game also includes rules for doubles, mixed doubles and matches between men and women.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Fury in the West",
        "description": "Game of the Battle of Shiloh - April 6 and 7, 1862.&#10;&#10;From a Battleline catalog:&#10;&#10;Dawn.  April 6, 1862.  The Union Army of the Tennessee is beginning to stir beneath the shadow of a small frontier church in western Tennessee.  The troops of U.S. &quot;Unconditional Surrender&quot; Grant wait only for their junction with Buell's Army of the Ohio to begin their long planned advance into the heartland of the Confederacy.&#10;&#10;Then suddenly the spring morning is shattered by the rattle of gunfire and the piercing rebel yell of over 40,000 charging Confederate soldiers.  The battle is joined and the fate of the west hangs in the balance.  Can you as General A. S. Johnston drive the Union invaders from Southern soil?  Can you as U.S. Grant rally your forces and halt the rebel onslaught?  You'll never know until you've played Fury in the West'.&#10;&#10;Fury in the West is a realistic wargame played on an attractive five color 22 by 28 inch Mapboard with over 230 colorful extra-thick die-cut counters that accurately represent the opposing armies.  This game enables you to refight and study one of the least understood battles of the American Civil War.&#10;&#10;Fury in the West is one of the most accurate wargames of its kind.  Each detail has been pain-stakingly researched in order to achieve strict historical accuracy.  The system has been extensively playtested to ensure a fast moving, delicately balanced and exciting game.&#10;&#10;Rules cover such important facts as leadership, bayonet charges, gun boats, long range artillery, formations and facing and many more.  An innovative yet simple system enables players to record casualties and stragglers of their individual units.&#10;&#10;",
        "artist": "Rodger B. MacGowan"
    },
    {
        "name": "Waterloo",
        "description": "The classic Avalon Hill game.&#10;&#10;From the box:&#10;&#10;Refight the last great campaign of Napoleon, in this fast-moving game of military strategy. Over 160 die-cut counters representing the massed armies of France, Prussia, and the Dutch Anglo-Allies maneuver and engage in combat on a full-color, 22&quot; x 28&quot; mapboard.&#10;&#10;Avalon Hill Complexity rating - 2&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "World War I",
        "description": "(from the rules:)&#10;&#10;World War I is a simulation on the army level of the land combat in Europe from 1914 to 1918. the simulation is primarily a land conflict with the secondary influence of naval forces abstractly simulated. The game covers five years in semi-annual (six-month) turns.&#10;&#10;&#10;This is a small (100 counter) representation of World War I.&#10;&#10;",
        "artist": "Larry Hoffman,David McElhannon,Redmond A. Simonsen,Joe Youst"
    },
    {
        "name": "Curses!",
        "description": "Each player starts the party game Curses! by drawing one Curse card and placing it face-up on the table. What? Curses? How can this be a party?! Ah, but these Curses are fun, not malicious, something along the lines of &quot;You can't bend your elbows&quot; or &quot;You must declare eternal love to anyone who rings the bell during this game&quot;.&#10;&#10;After that, each turn in Curses! the active player takes two actions in this order:&#10;&#10;&#10;    Draw a Challenge card. This card presents you with an action you must perform &ndash; a role to act out, a story to tell, an opinion to explain.&#10;    Draw a Curse card and give it to another player. &quot;You, bark like a dog whenever the player on your right reads a card!&quot;&#10;&#10;&#10;So where's the game? You must obey the Curses placed upon you at all times &ndash; and if someone notices that you're not barking or declaring eternal love or doing whatever else it is you're supposed to be doing, then that player rings the central bell and reveals you for a louse and a nogoodnik. As a penalty, you must turn the Curse card you violated face down. And while you might think that lifting a Curse is good, break three Curses and you're out of the game. Eventually only one person will remain, and this Curse-loving looney wins the game!&#10;&#10;",
        "artist": "Michael Eidelberger,Olivier Fagnère"
    },
    {
        "name": "Basketball Strategy",
        "description": "As with other games in the Avalon Hill sports Strategy series, each player has an identical generic team to coach through a game. Included are a set of campaign game counters to allow players to draft unique teams. Player counters have 5 performance ratings which are used to determine shooting and passing outcomes.&#10;You make play by play decisions which are resolved by cross-referencing offensive and defensive choices on a matrix.&#10;As coach you make decisions about line up, defensive match-ups, time outs etc.&#10;A full (four quarter) game would take 2+ hours.&#10;&#10;",
        "artist": "W. Scott Moores,Thomas N. Shaw"
    },
    {
        "name": "Harry's Grand Slam Baseball Game",
        "description": "Part of the publisher's Heirloom Games Series, this is a reproduction of a game first printed in 1962.&#10;&#10;OVERVIEW&#10;Harry&rsquo;s Grand Slam Baseball Game simulates a real baseball game. The Visiting Team bats in the top half of each of the nine innings and the Home Team, in the bottom half. Runners move around the bases, and runs and innings are recorded on a stand-up scoreboard screen. The game uses a special deck of 54 cards, which represent typical baseball plays. When a manager&rsquo;s team is at bat, that manager will try to play cards that will help score runs. When not at bat, that manager will try to play cards that will result in outs for the other team.&#10;&#10;The designer on his original edition: &quot;The scoring rules are simple and logical, and differ only slightly from the official rules of baseball. The elements of luck and skill are balanced carefully, so as to make each game an interesting and different contest.&quot;&#10;&#10;The game includes rules for the Heirloom edition as well as the original 1962 rules, which contain instructions for playing with 3 or 4 players plus &quot;Slugfest&quot; and &quot;Shutout&quot; variants.&#10;&#10;GAMEPLAY&#10;Each player draws a hand of 3 cards, which when played will result in a play result. At the beginning of each half inning, the batting team plays a card for the first batter. The play is then resolved and the player draws a card to bring his hand back to three. The pitching team then plays a card to derive a result for the second batter and draws a card to replace into his hand. Play goes like this until three outs are made.&#10;&#10;There are two different types of special cards in the game. Substitute cards, when drawn, are immediately played face up in front of the player drawing them, along with another card drawn from the deck and placed, unseen, on top of it. A player may use the substitute card as a &quot;pinch hitter&quot; or &quot;relief pitcher&quot; in the game when his hand does not have a useful card (i.e. a hit when he is at bat or an out when he is pitching). The substitute card is then flipped over and played.&#10;&#10;Wild cards are those which only affect base runners and do not resolve an at bat (e.g. wild pitch, passed ball, stolen base, balk). When one of these cards is played, the result is noted, but then play passes back to the opponent, who will play a card to resolve the at bat.&#10;&#10;After every three innings, both players return their hands to the deck, reshuffle the deck, and receive a new hand of three cards. After nine innings, whoever has the most runs is the winner.&#10;&#10;",
        "artist": "Cathleen Quinn-Kinney,Lisa Teach-Swaziek"
    },
    {
        "name": "Sahara",
        "description": "Each player in turn moves one &quot;pyramid&quot; (tetrahedron, really, which is why you can move them in this fashion) by tipping it into a free adjacent space. When a pyramid enter a dark space, it can move again. A player who blocks an opposing pyramid wins the game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Family Feud",
        "description": "based on the classic TV game show of the same name. Players or teams try to match the most popular answers based on survey questions that were posed to 100 people.&#10;&#10;",
        "artist": "Design Edge"
    },
    {
        "name": "Hangman",
        "description": "This is the classic letter guessing game with plastic cases to place letters in and to indicate how close the opponent is to being hung.&#10;&#10;",
        "artist": "(Uncredited),Inna Semadar"
    },
    {
        "name": "Warhammer Epic 40,000",
        "description": "Warhammer Epic 40,000 was the third edition of the Epic system. The first edition and second editions of the Epic system had each been released as two separate games. The first edition comprised Space Marine (1st ed) and Adeptus Titanicus. Second edition comprised Space Marine (2nd ed) and Titan Legions. For the 3rd edition of the Epic system GW decided to release it as a single game and that game was Warhammer Epic 40k. For this reason Epic 40K is also known as 3rd ed. Epic 40k absorbed both the Titan Legions and Space Marine rules into one system, reducing and streamlining the rules in both those games into one more concise and coherent system.&#10;&#10;It's a miniature tabletop battle game set in the Warhammer 40,000 world using 6-10mm scale miniatures to simulate huge epic battles. The rules are fairly simple but very effective and allow for a lot of strategic ideas. While many fans felt the game lost too much distinction between units with the simplification,  to this day Jervis Johnson says this is the game he is most proud of and it has a very smooth playing style.&#10;&#10;Expansions:&#10;&#10;    Adeptus Titanicus II&#10;&#10;&#10;&#10;&#10;Reimplemented By&#10;&#10;    Epic Armageddon&#10;&#10;&#10;&#10;&#10;",
        "artist": "John Blanche,Wayne England,David Gallagher,Mark Gibbons,Des Hanley,Neil Hodgson,Paul Smith,John Wigley,Richard Wright"
    },
    {
        "name": "The Battle of the Little Big Horn",
        "description": "The Sioux and Cheyenne Indians were increasingly hostile to the prospectors pouring across North and South Dakota. Chief Sitting Bull gathered a force, by the Little Big Horn river, just north of the Montana-Wyoming border, ready to strike. Three columns of US Cavalry were dispatched to subdue the Indians.&#10;&#10;Now you can re-live this historic battle, and you can plan your own strategy. Can you find a way to get Custer, or at least his flag, clear of the battlefield?&#10;&#10;This game is based on the well known battle of Little Big Horn, where some united Native Americans won against General Custer's 7th cavalry. A simple game combining luck and strategy with different mechanics for different units.&#10;&#10;Movements and terrain effects are similar to wargames. Horses move faster than foot units and wearing a gun enables some ranged attacks.&#10;&#10;Winning conditions are different for the 2 opponents: Custer's men can either eliminate all Native American riders or cross the Little Big Horn River and try to reach one of 2 winning spaces on the board, the Native Americans must eliminate general Custer and his 2 officers.&#10;&#10;It was published by Rojas y Malaret in Spain, as the 3rd game in the GBM series at the end of 1952. The game was licenced and published by Hausser (Germany) in 1963. Later, the Waddington's Games, Inc. (UK) version in 1964 and the Capi&eacute;pa (France) version in 1965 could be non-authorized versions.&#10;&#10;",
        "artist": "Ray Ferrer,Jordi Longarón"
    },
    {
        "name": "LEGO Soccer",
        "description": "Lego Soccer - Move the ball methodically down the field and take the shot on goal. With more sets, you can vary the positions for the players to your content. Combine sets to build the ultimate Lego Soccer field.&#10;&#10;These sets can all be played right out of the box.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Split (Revised Edition)",
        "description": "The latest edition of Split published by Hasbro is similar to the previous edition (Split), except that now the goal has changed.&#10;&#10;The goal is no longer to connect across the board (which no longer comes with the game), but to garner the most points by collecting perfect, strong, and weak matches. When a match is made, the player gets a special action, depending on the match. Perfect matches allow the player to force another player to fill in a negative box on his scoresheet, strong matches allow the player to draw a card from the draw pile, and weak matches allow the player to exchange matches of the same type. More than one match may be made each turn and a special scoresheet is used to keep track of points.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Invasion: Norway",
        "description": "Invasion: Norway simulates this fascinating campaign using a streamlined version of the acclaimed Britain Stands Alone game system. Fully integrated land, air, and naval rules accurately portray the complex interplay of warfare in three dimension (land, sea and air) in a way that is easy to learn and play, and keeps both sides constantly involved in the game, because very action you take may be detected and reacted to by your opponent. Special rules are included to simulate such unique aspects of the campaign as:&#10;&#10;&#10;    The effect of the severe Arctic winter &#10;    The haphazard mobilization of the Norwegian Army &#10;    The use of shipwrecked sailors as ground troops &#10;    The impact of die-hard Norwegian commanders &#10;&#10;&#10;Game Features:&#10;Game counters portray the German, Norwegian, British, French and Polish armed forces as battalions and companies of ground units, and squadrons of aircraft, while naval units are either individual combat ships of cruiser size or larger, or groups of smaller vessels.&#10;&#10;Variant rules that allow players to experiment with a broad range of ahistorical options including:&#10;&#10;&#10;    A more aggressive British naval doctrine &#10;    Earlier Norwegian mobilization &#10;    More effective U-Boat attacks &#10;    A larger German fifth column in Norway &#10;&#10;&#10;Detailed coverage or armor and artillery effect, paratroops, coast artillery, frozen lake airbases, and the special capabilities of ski troops.&#10;&#10;Game Scale:&#10;Game Turn: 3 days&#10;Hex: 16 miles / 26 kilometers&#10;Units: Platoon to Battalion, Single Ships, and Air Squadrons&#10;&#10;Game Inventory:&#10;One 22 x 34&quot; full-color mapsheet&#10;One 17 x 22&quot; full-color mapsheet&#10;Two dual-side printed countersheets (560 1/2&quot; counters)&#10;One 32-page Invasion: Norway rulebook&#10;One 16-page Invasion: Norway QuickStart booklet&#10;One 12-page Invasion: Norway Scenario &amp; Historical booklet&#10;Six single-side printed Player Aid Cards&#10;One 10-sided die&#10;&#10;Solitaire Suitability: Medium&#10;Complexity Level: Medium&#10;Players: 2 or more&#10;Playing Time: 2-10 hours&#10;&#10;",
        "artist": "John Kranz,Rodger B. MacGowan,Joe Youst"
    },
    {
        "name": "Horse Soldiers: Forrest at Bay",
        "description": "Horse Soldiers: Forrest at Bay (1988), (Included in Issue #119 0f Strategy &amp; Tactics magazine), is part of the Great Battles of the American Civil War series (GBACW). This series is an offshoot of the Terrible Swift Sword (TSS) system.&#10;&#10;Included are two color map sheets and one sheet of 200 two-sided, die-cut counters and a 2nd half-sheet with 100 die-cut counters. These components represent the participants and locations of two ACW Confederate Cavalry engagements that involved the southern raider, General Nathan Bedford Forrest. The two battles, Brice's Crossroads and Tupelo, resulted from U.S. General William T. Sherman's campaign to remove Forrest as a threat to his flank and supply lines. Before the Union Army marched on Atlanta, Elements of Sherman's Army pursued Forrest, and others, into Mississippi and engaged his cavalry twice before its destruction at Tupelo.&#10;&#10;All game-turns represent approximately 1 hour real time, and each Strength Point is the equivalent of 50 men or 1 gun. In Brice's Crossroads, the map scale is 115 yards per hex. In Tupelo the scale is 160 yards per hex.&#10;&#10;This game is an excellent example of the, ever evolving, TSS/GBACW game system. New rules for Cavalry and a modified sequence of play are just couple of the many refinements. I've always wanted to adapt these refinements to the earlier TSS Cavalry game Rebel Sabers: Civil War Cavalry Battles by SPI (Simulations Publications, Inc.). The game components are on par with any game in the system.&#10;&#10;Nominee for the 1988 Charles S. Roberts awards for Best Pre-World War II Boardgame (Charles S. Roberts Awards).&#10;&#10;",
        "artist": "Rodger B. MacGowan,Randy Thompson"
    },
    {
        "name": "Talisman (third edition)",
        "description": "The third edition of one of Games Workshop's most popular boardgames. Differs from first & second edition Talisman significantly.&#10;&#10;Enter a world of fantastic heroic adventure, where magic really works and monsters roam the land. You are an adventurer on a quest to retrieve the fabled Crown of Command from its fearsome guardian, the Dragon King. You must find one of the Magic Talismans that will allow you to enter the Dragon King's lair and then defeat him in mortal combat. On your quest you will encounter powerful enemies, discover friends and magical artifacts, and meet strange beings. Finally, when you have gained sufficient power, you can confront the Dragon King in your bid to secure the Crown of Command.&#10;&#10;Part of the Talisman series of games and expansions published by Games Workshop Ltd..&#10;&#10;",
        "artist": "Wayne England,Geoff Taylor"
    },
    {
        "name": "Monopoly Junior",
        "description": "Join Rich Uncle Pennybags and his nieces and nephews for a thrill-filled day at the Amusements along the Boardwalk - the Roller Coaster, the Magic Show, the Water Slide, the Video Arcade and more.&#10;&#10;Of course the kids want to get into the act, so they set up Ticket Booths on the Amusements and collect fees from other players who land on them! Set up a Ticket Booth on two Amusements of the same color, and you can collect double the fee! Draw a Chance card and you may take a ride on a Miniature Railroad, win a free Ticket Booth...or pay $3 to visit the Rest Room!&#10;&#10;With all this money changing hands, sooner or later one of the players runs out - and the player with the most cash on hand wins...&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Lost Victory: Manstein At Kharkov, Winter 1943",
        "description": "Lost Victory: Manstein at Kharkov, Winter 1943,  puts you in command of the opposing forces in the winter 1943 campaign. A unique integrated Ops Phase lets you choose what your units do and when they do it without any artificial limits on when they can move and fight. This system is complemented by a system of combat bonuses that lets you choose just the right weapons for each battle you fight. Together, they give you unparalleled control over your armies. But watch out: if the wrong HQ is coordinating an attack or units from too many different formations are involved, you can find your perfect attack coming apart at the seams. Then you may face every commander's nightmare: the dreaded SNAFU that leaves your assault in shambles and your career in doubt.&#10;&#10;Game features:&#10;&#10;    Fast-paced game system built around integrated Ops Phase in which players can freely combine movement, combat, support and bombardment operations in any desired order.&#10;    Realistic combat system that includes artillery, tank, antitank, and engineer effects, assault bonuses for penal battalions and the influence of C3I. Special SNAFU system models -- what happens when military planning goes awry. *Multiplicity of unit types, including motorized infantry, panzergrenadiers, heavy tanks, assault guns, flammpanzers, recon, motorcycle, cavalry, partisans, ski troops, commandos, katayushas, armored trains and ersatz units. &#10;    Special rules for weather, recon, reaction, HQ's, fuel depletion, urban uprisings and Soviet recruitment. &#10;&#10;&#10;&#10;&#10;Game Scale:&#10;Game Turn: 3 days&#10;Hex: 4 miles / 6 kilometers&#10;Units: Company to Brigade&#10;&#10;Game Inventory:&#10;One 22 x 34&quot; full-color mapsheet&#10;Two  dual-side printed countersheets (480 1/2&quot; counters)&#10;One 32-page Lost Victory rulebook&#10;One 12-page Lost Victory Study Booklet (Designers Notes)&#10;Two 4-page dual-side printed Player Aid Cards&#10;One 10-sided die&#10;&#10;Solitaire Suitability: Medium&#10;Complexity Level: Medium&#10;Players: 2 or more&#10;Playing Time: 2-12 hours&#10;&#10;",
        "artist": "Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "Colorama",
        "description": "Colorama is a children's game for 1-6 players, Ages 3 - 8.&#10;&#10;This game is a child's introduction to colors and shapes. There are three variations for different ages. All variations involve placing 40 (*) plastic tiles of different colors (red, blue, green, yellow) and different shapes (circle, square, triangle, hexagon, trapezoid) in their proper positions on the gameboard. Some variants involve using two specialized dice (1 color die, 1 shape die).&#10;&#10;The game has quality components and is designed to encourage children to compare and arrange, and to practice manual dexterity and logical thinking.&#10;&#10;(*) Note that older editions had plastic tiles in 5 colors and 5 shapes. The fifth color was Orange, thus there were 5*5*2=50 tiles. It may be possible that even other distributions exist.&#10;&#10;",
        "artist": "Kinetic,Claudia ten Hagen"
    },
    {
        "name": "Von Manstein's Backhand Blow",
        "description": "Von Manstein's Backhand Blow is a low/intermediate complexity two player game using the well-received Turning the Tables system pioneered in earlier east front games produced by Moments in History. The game system itself is easy to learn and master. No two games will ever play out alike because a great deal of uncertainty and randomness is injected into each combat due to the Combat Chit Draw and Random Events Table. This uncertainty makes Von Manstein's Backhand Blow ideal as a solitaire game since combat results cannot be accurately predicted.&#10;&#10;Dirk Blennemann, the designer, has the reputation for creating excellent Orders of Battle for East Front simulations. Using detailed Russian and German language sources, he provides a broad array of maneuver units - Soviet division and corps on one side, and German units ranging from regiments down to the multitude of ad hoc German kampfgruppen thrown into the battle to stop the Soviet advance.&#10;&#10;",
        "artist": "Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "Chomp!",
        "description": "Chomp card game for 2-5 players, aged 6+.&#10;&#10;The game consists of a specialized deck of 52 cards which depict various sea creatures on a food chain--plankton, shrimp, little fish, big fish, seal, shark. The higher the creature is on the food chain, the more types of creatures it can chomp. Creatures cannot chomp their own kind, nor can they eat anything higher up on the food chain. Nobody can chomp an octopus or an electric eel, which are special action cards in the game. The game plays rather like the old card game War, with the superior creature &quot;chomping&quot; the others and taking the trick. The first player to collect all the cards wins the game.&#10;&#10;The rulebook includes several variations.&#10;&#10;",
        "artist": "Dave Clegg"
    },
    {
        "name": "Hordes of the Things",
        "description": "A fantasy miniatures game that is based on the same system as De Bellis Antiquitatis and De Bellis Multitudinis. The first edition was published in 1991, with a much more clearly written second edition being published in 2002. The game consists of a single rulebook.&#10;&#10;The player's miniatures are organized onto stands or 'elements', an army consisting of about 10-14 such elements. Troop types range from powerful Heroes, Magicians, and Dragons, through such things as Blades, Riders, and Spears and down to the humble Hordes of the game title.&#10;&#10;Movement is alternate, with each player dicing for action points (PIPs) which allow them to move single elements or groups of elements, deploy certain element types and use magicians to be-spell enemy troops. Combat between elements is resolved by each player rolling a die and adding the element's combat factor. Highest score wins, with some elements automatically destroying others and most others being destroyed if their final score is half, or less, than that of the opponent.&#10;&#10;The strength of the game is that there are no 'fixed' armies. With only a few restrictions (concerned with which elements can be generals and the proportion of 'powerful' troop types) you can construct your army any way you wish. This means you can create armies to represent those from any work of fantasy fiction, myth, legend, film, TV, anything else that your imagination desires. A large number of example army lists, from a variety of sources, are included in the rules book.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Dragon Hunt",
        "description": "In this exciting game by Wyvern creator Mike Fitzgerald, you are the leader of a mythical kingdom where Dragons and Dragon Slayers battle to capture your opponent's kingdom. Instruction booklet includes preset game for fast learning. For two players, ages 10 to adult.&#10;&#10;It has been described as a simplified, single deck version of the collectible card game Wyvern.&#10;&#10;",
        "artist": "Peter Pracownik"
    },
    {
        "name": "Lancelot",
        "description": "In this abstract strategy game, players take turns placing a single piece of their own color on the board. When you have N+2 pieces than the number of pieces of other players in that row or column, you take them as prisoners.&#10;&#10;This systems is some what similar of the more recent Kahuna, as &quot;chain reactions&quot; are quite the same. The game is totally abstract, but it works fine with any number of players (2-5). A crazier advanced mode allows players to consider even diagonals!&#10;&#10;",
        "artist": "Studio Tapiro"
    },
    {
        "name": "Oil War",
        "description": "Oil War - American Intervention in the Persian Gulf, is a brigade/squadron-level simulation of a hypothetical attempt by the United States and various other nations to take over the oil-producing areas of the Middle East. The simulation is primarily of land and air conflict. The game covers an arbitrary period of conflict (sixteen days), in which the issue would be decided. A total of three scenarios are available from which the players may choose.&#10;&#10;In addition to appearing in Strategy &amp; Tactics magazine #52, Oil War was also released as folio edition as well as a boxed edition.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "MechWar '77",
        "description": "Mech War '77 is a simulation of tactical combat in West Germany and Asia during the 1970's. The game is played by scenario. Eight scenarios revolve around a hypothetical Soviet-American clash in West Germany. One scenario is drawn from the Yom Kippur War. The tenth scenario pictures a Sino-Soviet clash.&#10;&#10;Scale: Each hex represents 200 meters from side to side. &#10;Time: Each Game-Turn represent one to six minutes of elapsed time.&#10;Counters: 400&#10;&#10;Uses the same rules system (but with additional &quot;modern&quot; elements) as Panzer '44&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "Wheedle",
        "description": "Wheedle 1. To persuade or attempt to persuade by flattery or guile. 2. The game of stock taking and deal making.&#10;&#10;&quot;WHEEDLE&reg; is the freewheeling stock trading game where 4-6 players jockey for corporate control. In a flurry of no-holds-barred trading, only the craftiest players will survive. . . Break out WHEEDLE and rise to the top!&quot;&#10;&#10;This game is Reiner Knizia's take on Pit. It consists of simultaneous trading of various stocks, trying to get a majority.&#10;&#10;Gameplay A card is placed facedown in the center, and the remainder of the deck is dealt out. When the central card is flipped over, players begin calling out what they're collecting or wanting to trade away: &quot;Anyone have N Securities?&quot; (or, more, likely, &quot;I've got yellow, who wants yellow?&quot;) You can trade with anyone, any number of cards, including unequal trades. You may also swap one of your cards with the central card. When a player obtains a majority of all the stock types they have in their hand (for example, 4 of the 7 green cards and 3 of the 5 blue cards), play stops and the round is scored.&#10;&#10;Scoring: The player who stops the play gets +5 (or -5 if they don't have a majority after all). You get +2 for each stock card if you have a monopoly of that stock, and +1 per card if you have a majority but not all of them. Warning: You get -1 for each card in your hand that matches whichever stock is the central (bankrupt) card when the round ends. You get 0 points for any card that is not part of either a majority or the bankrupt company. After each player has dealt once, the game is over and whoever has the most points wins.&#10;&#10;",
        "artist": "John Kovalic,Cathleen Quinn-Kinney"
    },
    {
        "name": "Kolin: Frederick's First Defeat – June 18, 1757",
        "description": "In June of 1757, Frederick the Great and his highly trained Royal Army of Prussia approaches an Austrian army encamped along a low range of hills. Hoping just one more victory will force the Austrians to sue for peace, Frederick sets in motion his master tactic, the &quot;oblique maneuver&quot; against the enemy right flank. Only now the Austrians are under a new commander, the imperturbable Field Marshal von Daun. He calmly redeploys his forces and the Prussian turning maneuver instead becomes a brutal frontal assault. That night some 10,000 Prussians lay dead on the field, with another 5,000 captured. Frederick suffers his first defeat in the Seven Years War.&#10;&#10;Based on the popular La Bataille system, Kolin offers the first authentic treatment of battles during the Age of Reason. Special command and movement rules reflect the inflexible and difficult nature of commanding armies of the day compared to their Napoleonic descendants. Players must master infantry, cavalry, and artillery tactics at a time when trained manpower is extremely valuable, and not mere &quot;cannon-fodder&quot;.&#10;&#10;Contents: &#10;&#10;    420 counters&#10;    3 34&quot; x 22&quot; period maps&#10;    2nd edition standard rules&#10;    Exclusive rules book&#10;    Separate charts and tables &#10;    Insightful historical commentary by Dr. Christopher Duffy.&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Amun-Re",
        "description": "Everyone knows of the pyramids on the Nile - eternal monuments of a powerful and beautiful culture, that can still take our breath away. The pharaohs choose their sites, build their pyramids, and thank Amun Re and the other Gods for their bounty.&#10;&#10;Each player wants, as pharaoh, to build the most pyramids. To accomplish this, he must first acquire a province, where he can trade and farm. With his profits, he can buy new provinces and building stones to erect pyramids. For all his actions, the player must make clever use of his power cards, and always offer appropriate sacrifices to Amun Re. Players must always keep their eyes on the goal of the building of the eternal pyramids or risk falling behind in points.&#10;&#10;",
        "artist": "Isidre Monés,Franz Vohwinkel"
    },
    {
        "name": "New England",
        "description": "A bidding and tile laying game with a theme of settling 17th Century New England. Each player represents a family that buys up and develops large tracts of land. The area of settlement is 98 squares (9 x 11, with one square missing). Each family starts with a double-sized tile of each of the three land types - settlement, cropland, pasture. Tiles have undeveloped and developed sides; naturally, they start undeveloped.&#10;&#10;In each round after the initial placement of the starting tiles, players bid for the right to buy more land tiles or development cards - up to two per round. A total of 9 combined tiles and cards are available each round for purchase. The advantage of bidding high (and thus paying more for each purchase) is that high bidders get the first choice, and the highest bidder gets to decide how many tiles and cards will be up for auction in the next round. Tiles or cards must be played immediately after purchase, unless barns are available to store cards (but not tiles) for later use. Those that can't be played may not be bought.&#10;&#10;Development cards are of two kinds. One lets a player buy pilgrims (who generate shillings, the game's currency), barns (to store development cards) or ships (to add extra tiles or cards to those on offer). The other is needed to develop land tiles. Development is possible only if the player owns undeveloped tiles of the same type, number and configuration as shown on the card, e. g., three cropland tiles forming a right angle, two adjacent pastures or a square of four settlements.&#10;&#10;Playing development cards earns victory points, the number depending on the difficulty of using the card. A square of tiles scores 10 points, while a pilgrim, barn or ship gains only one.&#10;&#10;Play continues until there are too few cards and tiles left to stock a full auction. At that point, the players tally their victory points, adding bonuses for most pilgrims, barns or ships. The winner is the player with the most points; shillings are the tie breaker.&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "La Grande Guerre 14-18",
        "description": "La Grande Guerre 14-18 (The Great War 14-18)&#10;&#10;The English rule set was released in 2002.&#10;&#10;La Grande Guerre is a strategic simulation of World War 1. Two maps cover all of Europe. Off map boxes represent Asia / Africa.&#10;&#10;Game year is broken down into 9 turns. Production takes place on the interphase every 3 turns. Either side may move first on a given turn. Two different combat systems are included. The initial combat system simulates the 1914 battles w/o trenches. Losses are lower and retreats are likely. In 1915 a new combat system is used. This new system is detailed, but does a good job showing the complexities of trench warfare (retreats are scarce and losses are real high). The game includes a limited fog of war. You may not look at opposing stacks, and units may be off board.&#10;&#10;The game is very complete in its depiction of WWI. (Similar to how World in Flames recreates WWII).&#10;&#10;Additional aspects of the game include:&#10;&#10;    Fortresses&#10;    Limits on coordination between different armies&#10;    Diplomacy&#10;    General Counters.&#10;    Technology&#10;    Naval War&#10;    National Will - Leads to uprisings, mutinies, strikes even the dreaded revolution (likely to be Russia, but not necessarily them or a communist revolution). Note NW is lost on losing units and battles, so these effects are not random.&#10;    Air / Armor&#10;&#10;&#10;&#10;&#10;Contents: &#10;&#10;    2 large map sheets (Europe, Middle East and World off-map boxes) - each map: 95 x 67.5cm (37.4 x 26.5 inch)&#10;    2 dices&#10;    Loss charts (to be photocopied) &#10;    7 Armies Boxes charts (front/back) - 3 blue (Allies) &amp; 4 brown (Centrals)&#10;        Russie-Serbie-Roumanie (Russia-Serbia-Rumania)&#10;        France-Angleterre (France-England)&#10;        Italie-Etats Unis / Turquie-Etats Unis (Italy-United States / Turkey-United States)&#10;        Autriche-Turquie / Autriche-Serbie-Gr&egrave;ce-Roumanie-Bulgarie&#10;        Allemagne Ouest-Italie&#10;        Allemagne Est&#10;        Allemagne 1918&#10;    &#10;    4 Rules &amp; scenario booklets: &#10;        Basic (for all 1914)&#10;        Trench (for 1915+)&#10;        Advanced (for Grand Campaign scenario: politics, diplomacy, technologies, air, production, naval)&#10;        Scenarios (campaign scenario 1914-18, 6 scenarios for 1914, 6 scenarios for 1916-18)&#10;    &#10;    8 Game Aid booklets: &#10;        Entry into war (1914)&#10;        Diplomacy&#10;        Events &amp; US entry chart&#10;        Combat &amp; movement (x2)&#10;        Germany&#10;        Austria-Hungary &amp; Turkey&#10;        France &amp; England&#10;        Russia, United States &amp; Italy&#10;    &#10;    7 Counter sheets (1811 counters) :&#10;        1 France, Bulgaria, Montenegro, Holland, Russia, Belgium, United States &#10;        2 Switzerland, Germany, Serbia, Rumania, Russia &#10;        3 Russia, United States, France, Germany&#10;        4 Austria-Hungary, Turkey, England &#10;        5 England, Italy, Turkey, United States, miscellaneous &#10;        6 Diplomatic (various) &#10;        7 Persia, Japan, technology sets, event chits &#10;    &#10;&#10;&#10;&#10;&#10;",
        "artist": "Bruno de Scorraille,Philippe Thibaut"
    },
    {
        "name": "Magna Grecia",
        "description": "From spielbox-online.de, translated via altavista babel fish (with a lot of manual tweaks):&#10;&#10;Magna Grecia (The cradle of the civilization) is the main attraction of the year with Clementoni. The game is a joint work of Leo Colovini and Michael Schacht.&#10;&#10;The southern region of Italy was called Magna Grecia and was settled 2,500 years ago by Greek merchants and adventurers. Before the arrival of the Greeks, the country was inhabited by only a few small tribes. Fruitful soil, navigable rivers, large forests, and bronze and silver mines offered enormous development possibilities. Larger cities developed, such as Tarantum, Syracuse, Katane, Locri, and Naxos. In addition, there were numerous villages of which no trace remains. A local road system promoted trade, and rich markets developed in the cities. More and more rivalries between the cities arose, particularly over control of the Oracle, which represented an important source for fame and wealth.&#10;&#10;Sufficient material for an evening of play. Each player must successfully settle and develop Magna Grecia. At favorable points, markets are built, villages are developed into cities and interconnected by a road system. Only thus may the interior be opened and the Oracle controlled. Constructing your own large city is often very expensive, and it is sometimes worthwhile to build instead in the neutral villages or opponents' cities.&#10;&#10;The board is covered with a hexagon grid on which pieces of road, towns, or markets are placed. A game is 12 rounds long. Each round is determined by an action map, which is set up at the beginning of play according to a certain pattern. The map specifies the player sequence and indicates to which extent the three basic actions (road construction, city building, and supply) may be used. There are also, of course, certain building rules to be considered. Additionally, markets can be established, the value of which depends on the number of connected locations. The Oracle is shown on the board. In order to control the Oracle, a player must connect one of his own cities to it by road. But if several cities are connected to an Oracle, the most important city takes precedence, determined by the number of locations connected to the city (not including Oracles).&#10;&#10;Markets and the Oracle determine when the game ends.&#10;&#10;",
        "artist": "François Bruel"
    },
    {
        "name": "Assassin: The Final Game",
        "description": "The object of the game is to arrange the assassination of all opposing players and thereby take control of world traffic &#10;in illegally obtained commodities (drugs, plutonium, munitions, oil, secrets, diamonds and gold).&#10;&#10;As you move around the board, you can buy and sell the commodities as indicated in each city.  All cards cost the same but have varying resale values (some are even worthless).  Complete sets are worth more, and some commodities are worth more than others.&#10;&#10;Assassination can be attempted if you land on one of the two Assassination squares, on the same square as your victim, or once per go around the board if you have enough money (500 k$, forfeiting your turn to do so).  Hired Assassins come in three classes (A through C), the cheaper being less proficient in weaponry than the more expensive ones (A: five weapons; C: three weapons).&#10;&#10;Assassinations are resolved by drawing an Assassin card and comparing it with a Location card; each location lists permissible weapons --if the assassin isn't proficient with at least one of those, too bad.  If he is, you draw a Weapon card to see if he managed to find/smuggle one of the needed weapons.  Assuming the three cards show a match, the designated weapon(s) lists a number that needs to be matched on the dice.  An assassinated player is eliminated.&#10;&#10;To defend, you may offer 1 M$ to the player who ordered the assassination just before the dice are rolled, or you may hire an assassin of your own as a bodyguard.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Bible Trivia",
        "description": "From the box:&#10;&#10;Questions and answers from the Old and New Testament, fully referenced and scripturally sound, based on the King James Version of the Bible. This is actually two games in one as there are separate groups of 1,400 questions for children and 4,000 more advanced questions for adults.&#10;&#10;Object of the game is to win by successfully answering questions and moving &quot;up the rainbow&quot; as each category is completed. First player to complete three trips up the rainbow wins.&#10;&#10;For 2-12 players Ages 7 and up. (Actually any number can play if players divide themselves into pairs or teams). Also makes a fine solitaire game.&#10;&#10;Not to be confused with the later game Bible Trivia also published by Cadaco.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "MindTrap II",
        "description": "Two players or teams compete to reach the last square on the playing board by correctly solving MindTrap questions.&#10;&#10;Question categories include: &#10;&#10;    Picture It (identify a photographed object)&#10;    Stick It (stick puzzles)&#10;    Shape It (tangram puzzles)&#10;    Brain Cramp (logic puzzles)&#10;    Murder Mysteries (deduction puzzles).  &#10;&#10;&#10;&#10;&#10;This game is the sequel to the original MindTrap game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Mad Gab Card Game",
        "description": "Two teams compete to solve ten word puzzles correctly (or five in the Mattel version).&#10;&#10;Puzzles consist of a set of unrelated words that, when read aloud, sound like familiar phrases, names, places, etc.&#10;&#10;For example, &quot;Isle of View&quot; sounds like &quot;I love you.&quot;&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "Best of TriBond",
        "description": "Players (or teams) advance their pawns along three separate tracks by correctly answers TriBond riddles, in which they attempt to determine the common link is between three seemingly unassociated objects.&#10;&#10;The first player to move all three pawns into the Home space is the winner.&#10;&#10;This Best of game contains the best TriBond riddles from the first ten years of publication of TriBond, plus 500 new riddles.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Raid on Iran",
        "description": "On April 24,1980, the United States launched a rescue mission to free 53 hostages held captive in Iran. Three helicopters failed on the way. The mission was aborted. But what if it had gone in?&#10;&#10;Raid on Iran is a simulation of what might have been ... The American commandos must find and free the embassy hostages while holding off Iranian mobs and militants.&#10;&#10;",
        "artist": "David R. Deitrick,Denis Loubet"
    },
    {
        "name": "Wealth of Nations",
        "description": "The players run around the world trying to acquire exploitation rights to various raw materials (metals, oil and basic vegetal products such as coffee and tobacco).  Each country is assigned (randomly) a royalty marker, which triggers payment of royalties to players controlling at least 30% of the corresponding titles when the country is visited. Player's actions on their turn are driven by the outer track.&#10;&#10;Victory is by elimination, as other players are driven to bankruptcy.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Planet Hollywood: The Game",
        "description": "Players play on teams in &quot;hot potato&quot; fashion, naming movies based on a card description (for example, Movies that start with &quot;M&quot;). When the timer runs out, the last team to name a movie gets the card. The backs of the cards fit together to form the Planet Hollywood logo.&#10;&#10;A team must collect all four cards to win the game.&#10;&#10;",
        "artist": "NA"
    }
]