[
    {
        "name": "Trailer Park Wars",
        "description": "From the publisher.&#10;&#10;You have finally landed the job of your dreams: Trailer Park Manager!&#10;To be the Best Darn Trailer Park Manager in town, you must place quality Tenants in your trailers, create a fun and friendly atmosphere by adding some sweet Amenities, and go about destroying the other trailer parks&#10;&hellip;no matter what it takes.&#10;&#10;Surface to Trailer Missile? Molotov Beer Can? A Tornado? You Bet.&#10;&#10;Game Contents:&#10;&#10;100 Plastic Flamingo Miniatures&#10;48 Trailer Cards&#10;130 Trailer Park Wars Cards&#10;24 Trailer Park Name Tiles&#10;Instructions&#10;&#10;The object of the game is to gain as many flamingos as you can. Flamingos represent points.&#10;&#10;Each player arranges 12 trailers in front of them shaped like a clock. In the middle are randomized cards that represent the name of the player's trailer park. This has no effect on game play.&#10;&#10;Players have seven cards to start. On each turn each player plays three cards, discards one and draw back up to seven. Each of the Trailer Park Wars cards are separated into one of 4 types:&#10;&#10;&#10;    Action Cards: can help the player or be used against an opponent.&#10;    Tenant Cards: with traits that include their job, age, what they can be placed near in your trailer park (for example an old man can't cannot be placed near a rock musician), also there is an icon depicting how many flamingos they are worth.&#10;    Amenities Cards: allow for more points when played.&#10;    Natural Disaster Cards: have a negative effect on an opposing player.&#10;&#10;&#10;Once all the flamingos are gone, the player with the most flamingos wins.&#10;&#10;",
        "artist": "Two Tree Art"
    },
    {
        "name": "Word Blur",
        "description": "In Word Blur, The object is to get your teammate(s) to shout out the mystery word (before your opponents) using only the word tiles as clues. 900 basic word tiles are spread out in the center of the table.  One player on each team scrambles to find the word tiles that will best describe the mystery word to their teammate(s). Tension mounts as teams get closer and closer to the correct answer. All teams play every round so there are no down times like some games. This is a non-stop party game filled with hilarious guesses, creative clues that will challenge the way you think. Boxes measure 8&quot;&times;5&quot;&times;2&quot; and weigh 2 pounds each. Game is for 3 or more players ages 10 &amp; up.&#10;&#10;Home Page: http://www.wordblur.com&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Ambush Alley",
        "description": "Ambush Alley is a modern miniature wargame that allows players to recreate the intense counter-insurgency actions in an urban environment that have become the hallmark of 21st century warfare. The rules revolve around a universal mechanic that is easy to grasp but supports a high level of detail and rewards sound tactical play. The game&rsquo;s dynamic turn sequence captures the turmoil of the modern city fight and integrated fog of war keeps things chaotic and unpredictable!&#10;&#10;Ambush Alley contains complete rules for all the key elements of modern counter-insurgency and street-fighting, including:&#10;&#10;&#10;     Civilians on the Battlefield &#10;     Full Vehicle Rules &#10;     Special Assets and Off-Board Support &#10;     Night Combat&#10;     UAVs &#10;     IEDs and VBIEDs &#10;     Building Clearing &#10;     And much more! &#10;&#10;&#10;Ambush Alley includes five scenarios and sample organizational charts for US, British, and Australian forces.&#10;&#10;The game can be played at any scale from 15mm up. 15mm scenarios call for a 2&rsquo;x2&rsquo; table, while 28mm games only require a 4&rsquo;x4&rsquo; table.&#10;&#10;Ambush Alley is easy on the pocketbook where miniatures are concerned. Few scenarios require more than ten figures for the Regular force and a dozen or so for the Insurgents.&#10;&#10;Ambush Alley also offers full solo-play rules, so players can still have fun pushing their figures around the table even when a flesh and blood opponent isn&rsquo;t available!&#10;&#10;Expanded by:&#10;&#10;&#10;     Ambush Alley: Day of the Rangers (2008)&#10;     Ambush Alley: Motor Pool (2007)&#10;     INVALID OBJECT ID=33973, type=thing (2007)&#10;     Ambush Alley: The Three Block War (2008)&#10;     Ambush Alley: Art of War (2008)&#10;     Ambush Alley: Operation &#226;&#128;&#147; Darkstar (2008)&#10;     Ambush Alley: Under the Black Flag (2008)&#10;     Ambush Alley: Lawyers, Guns & Money (2008)&#10;     Ambush Alley: Indian Country (2009)&#10;     The Wasteland (2010)&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Down Under",
        "description": "Down Under is a tile placing game where players place their tiles trying to increase their route. The player with the longest route at game end is the winner. As tiles also contain animals, players score or lose extra points for having groups of specific animals in their route.&#10;&#10;",
        "artist": "Ro Sato"
    },
    {
        "name": "The T-Shirt Game",
        "description": "The T-Shirt Game is the fashionable party game &quot;wear&quot; funny matters! Create your own T-shirt by matching ridiculous slogans to outrageous images. To create these laughable masterpieces, the &quot;judge plays a T-Shirt Card, while everyone else throws in the best Slogan Card. Whether it&rsquo;s funny, to the point, irrelevant, or irreverent, if the &quot;judge&quot; likes it, you win points.&#10;&#10;From the box:  Match ridiculous slogans to outrageous images, and create your own zany t-shirts.  So much fun, even monkeys* love to play!&#10;&#10;    (monkeys not included)&#10;&#10;&#10;&#10;&#10;Similar mechanics as in Apples to Apples.  Players take turns as &quot;The Judge&quot;, while the other players match slogan cards to cartoon images on a t-shirt card.  Winning matches score point cards with varying amounts.  First one to 3000 points is the winner.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Wypas",
        "description": "Wypas (Flock) is a simple party game for 3 - 6 players. Every player plays a role of a shepherd, trying to trim as many sheep as possible. Player trimming the most valuable sheep wins the game.&#10;&#10;The game contains the following components:&#10;&#10;- 110 cards&#10;- 1 victory track&#10;- 6 pawns&#10;- the rulebbok&#10;&#10;",
        "artist": "Marcin Gręźlikowski,Maciej Zasowski"
    },
    {
        "name": "Borneo",
        "description": "This game has been published by dV Giochi as a reward for winning the 2006/2007 edition of the Gioco Inedito &ndash; Best Unpublished game contest. Powered by Lucca comics &amp; Games and dV Giochi, the contest aims to identify the best new card game design from all prototypes received and to reward it by publishing the game in a fully professional and high-quality format, overseen directly by dV Giochi. All prototypes submitted must conform to the technical and style requirements, fixed components and a given theme which changes every year. Everybody can join the contest and this is a great opportunity for emerging game designers to see their idea published.&#10;For more information:&#10;giocoinedito@luccacomicsandgames.com&#10;www.luccacomicsandgames.com&#10;&#10;Players hold the role of merchants involved in the commerce of spices with the East Indies in the XVII century. Each merchant is a member of a number of different Merchantile Companies: it is therefore important to achieve the best position in the hierarchies at the right time, when the profit from the expedition is divided among them, either by monopoly of a single company or by shares of different companies.&#10;&#10;The same cards are used in three ways: to gain the control of a company on a certain harbour, to struggle for the status inside of a company, and finally as trade goods to collect to dispatch orders.&#10;&#10;The game is the winner of the Best Unpublished Game contest of Lucca 2006.&#10;&#10;The first limited edition has been published in form of a card game.&#10;&#10;The current edition has been expanded with more rules and materials to become a board game, containing:&#10;&#10;- 1 board&#10;- 60 shipment cards&#10;- 14 harbors&#10;- 18 merchants&#10;- 16 missions&#10;- 5 company rank markers&#10;- 5 summary cards&#10;- pirate&rsquo;s cove and pirate&rsquo;s ship&#10;&#10;",
        "artist": "Roberta Barletta,Alberto Bontempi"
    },
    {
        "name": "Darjeeling",
        "description": "Darjeeling has two main board areas.  The first is an array of squares representing one, two or three half-crates of tea in four different varieties (colors).  Each player has a marker which moves about in the array, picking up tea at the rate of one square per turn.  There are simple rules governing movement in this array and the players compete for the desirable squares.&#10;&#10;Eventually, several times per game, each player has enough squares of a single color to fit them together so that the half-crates all make whole crates.  Now he can make a tea shipment.  This pays off in victory points in three different ways.  First, there is a &quot;demand&quot; award of up to 6 VP depending on how long it has been since anyone shipped this variety.  Second, if the shipment was of at least four crates, there is a flat bonus of 1 VP per crate.&#10;&#10;Third and most pivotally, there are VP that will be awarded at the beginning of the player's next and subsequent turns.  Each tea shipment is represented with cubes of the player's color (not the tea variety color) on a sort of barge.  The new shipment of tea is always placed, in the other of the two main board areas, at the top of a column of all the recent shipments (the number of total shipments varying with the number of players in the game), so that as more shipments are made, the old shipments drift farther down the column and eventually out of play.  At the beginning of your turn, you look to see where your shipments are in this column, and they pay out VP with better multipliers the higher they still are in the column.  This constitutes the driving force of the game, as nobody else wants to see your shipment at the top of the column for several turns in a row.  Players thus have an incentive to make a shipment even if they haven't yet assembled a large number of crates.&#10;&#10;It's a race to 100 points.  A runaway leader can easily take over if the rest of the table is not vigilant, so the best games of Darjeeling are those among vigilant players.&#10;&#10;",
        "artist": "Christof Tisch"
    },
    {
        "name": "El Club de los Martes",
        "description": "The Tuesday Club Murders (El Club de los Martes) is formed when the host, is entertaining friends and they decide that each should tell a story of a mystery, without revealing the answer, so that the others can try to guess the outcome. It is felt that with their combined skills and variety of individual experience, they will be able to solve the problems presented. The players try to reconstruct the crime by asking, guessing and fiddling about.&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;=======&#10;&#10;How would it be if we formed a Club? What is today ? Tuesday? We will call it The Tuesday Night Club. It is to meet every week, and each member in turn has to propound a problem. Some mystery of which they have personal knowledge, and to which, of course, they know the answer. Let me see, how many are we? One, two, three, four, five. We ought really to be six... (Joyce Lempri&eacute;re)&#10;&#10;From this conversation in Agatha Christie&rsquo;s book &lsquo;The Tuesday Club Murders&rsquo;, a series of great detective stories come up, where perceptive characters rival Miss Marple, who teachs them a real lesson of shrewdness, explaining with talent and with all kind of misteries, no matter how strange or complicated they may be.&#10;&#10;This game is exactly that: a narrative game based on the classic detective stories. A group of five players cooperate and compete to solve a mistery proposed by a sixth player, known as the host, trying to emulate Sherlock Holmes himself, from Arthur Conan Doyle&rsquo;s books. Host and players find themselves entwined in a complicated game of cat and mouse, where the first one propose a mysterious enigma and the others must solve it by racking their brains. For a length of an hour, as that is the time limit to solve the mistery, an intense (intellectual) battle is fought, where the host challenges the rest of the members of the Tuesday Club to find a solution that almost never is near or within reach. The armchair detectives will have to use in a creative way the clich&eacute;s with which their dramatic characters have been defined, and they will have to make the appropriate questions in order to find the solution.&#10;&#10;Therefore, this is a game that puts the perceptiveness, intuition, and above all the logical and deductive intelligence of the participants to test. The constant interactivity among the players, the creation of intelligent questions with shrewdness, wit and creativity, and the dynamism of the intrigue make &lsquo;El Club de los Martes&rsquo; a perfect game to spend an hour of fun with family or friends.&#10;&#10;El Club de los Martes is many games in one.&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;=======&#10;&#10;A narrative game of deduction and logic. All players are armchair detectives meeting every Tuesday to engage on some crime solving. A host presents the case and in turns each player can ask questions and use his or her special abilities to gather more information. Asking questions and gathering information cost money -every player starts the game with 15 pounds - paid to a common pool. Proposing a solution is very expensive and other players may benefit economically from you failures. Only one player may win, but the solution relies on the information gathered by the whole group with certain cooperatives aspects. If no detective solves the crime after one hour, nobody wins. The player with the &ldquo;first player&rdquo; token has the advantage because she starts every round; but if that player passes, she loses the token that goes to the next player.&#10;&#10;Based in novel &quot;The Tuesday Club Murders&quot; by Agatha Christie.&#10;&#10;Rules one are available in Spanish language.&#10;&#10;",
        "artist": "Cecilia Jos,Javier Charro Martinez"
    },
    {
        "name": "Saba: Palast der Königin",
        "description": "Saba - the bead of the desert, legendary realm in the Orient. &#10;It's the 9th century in the Kingdom of Saba, the region, that is the Republic of Yemen today.&#10;&#10;One day, you are called to the courtyard of the mysterious Queen of Saba. As one of her advisors you are to create her a palace of singular splendour. Intelligently provide for supply of building materials, develop the perfect palace from alabaster and ebony and prevail skillfully against your competitors. Because only the best of her advisors will take his place besides the Queen of Saba as her new Grand Vizier .....&#10;&#10;Players use the materials available at the harbor to expand the queen's palace and enjoy her favor. All your efforts have been in vain, though, the moment another contender surpasses you with a more impressive building in the same palace destrict. Will you be the one in front at the decisive moment ?&#10;&#10;The game contains a three-dimensional palace (made of cardboard plugged together) on which the players' figures are placed.&#10;&#10;",
        "artist": "Christian Fiore"
    },
    {
        "name": "Liebe & Intrige",
        "description": "Each player represents a family trying to marry their three daughters. The daughters have three characteristics: Reputation, beauty, and education, all of which may increase and decrease in value during the course of the game. There are 14 gentlemen in the game, each of them demanding a minimum value in each characteristic. A daughter gets married immediately when she has collected three cards of the same gentleman, and meets the gentleman's standards in each of the three characteristics.&#10;&#10;The game ends when a family marries all of their daughters. Points are scored from husbands, action cards, and also from majorities in each characteristic.&#10;&#10;The game board depicts different parts of a town, each of them with a different number of available gentlemen cards.&#10;&#10;A player's turn consists of:&#10;1. Moving to a different region of the town.&#10;2. Doing a region-specific action, or trying to scheme against another daughter in the same region.&#10;3. Drawing an action card.&#10;&#10;Region-specific actions usually mean choosing a gentleman card from those available, but sometimes also cause changes in a daughter's characteristics. Scheming against another daughter means trying to steal a gentleman card from them, by rolling a die. Action cards can be played anytime during a player's turn, and sometimes also as a reaction to cards played by other players.&#10;&#10;",
        "artist": "Christian Fiore"
    },
    {
        "name": "Grzybobranie",
        "description": "Grzybobranie - &quot;The Mushrooming&quot; - is a very old children roll and move game (it was old in early 1970-s...).&#10;&#10;Players roll a single die and move their mug-shaped pawns along the road. When they stop on a space with one or more uncollected mushrooms (wooden or plastic pieces usually) they put them into their mugs. Red mushrooms are &quot;bad&quot;, other ones are &quot;good&quot;. Some spaces are event ones - like gain/lose a turn, go forward or backward, discard one or more mushrooms etc. When all the players reach the end of the track the one with most &quot;good&quot; mushrooms wins.&#10;&#10;The game is very popular in Poland - there are many versions by many publishers (they often differ in the shape of the path, the number of mushrooms to collect, and the adventures included).&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Fortuna",
        "description": "This game is a variation on the Monopoly theme, with a few differences:&#10;&#10;- There are 44 spaces on the board (not 40 as in Monopoly).&#10;&#10;- Instead of throwing dice players use sets of 12 tokens with numbers ranged 1-12 and move accordingly to the number shown on the chosen token. Thus Fortuna is much less random than Monopoly.&#10;&#10;- There are four &quot;restaurants&quot; and three &quot;railway stations&quot; spaces instead of 4 railway stations in original Monopoly.&#10;&#10;- In addition to a possibility of being sent to hospital (an equivalent of prison) players have an option to go to vacation.&#10;&#10;Other rules are very similar to the rules of Monopoly.&#10;&#10;The board represents Warsaw in 1901.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Caveman",
        "description": "CAVEMAN - can your tribe survive is a survival game where your objective is to become the dominant tribe on Volcano Island. It's a harsh world, where marauding dinosaurs cause chaos, other tribes attack you, and you struggle to help your cave kids survive into adulthood.&#10;&#10;Players start from the corner spaces of a hexagonal island, and slowly spread out over the island, looking for resources to help them survive and prosper. The winner is the first player to either expand their population to eight adults, collect all five available resource types, or the player who has made the most progress when the action card deck expires.&#10;&#10;As you will see if you read the reviews here, Caveman has a particular objective - to be a fun light hearted game for kids and adults.  Its a game of strategy amongst chaos, where good play will allow you to win usually but not without many setbacks.&#10;&#10;Thanks for all of the comments on here - they are very helpful to us as we evolve.&#10;&#10;Simon Hall&#10;MAG&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Club",
        "description": "The Club is a slightly satirical game about life in the fast lane - a board game about love and about people's need to meet one another.&#10;&#10;The whole game takes place in a nightclub and the game board is the dance floor. On their turn players push three new dancers to the dance floor from their own bar counter (edge of the game board) and as they come into play they push others towards the center of the dance floor. Once two dancers meet in the heat of the night they can be made into couples and the better the match the more players score. If only two of the four visible qualities match then the dancers have a one-night-stand which is not a very long term fun and is thus worth only one point. With three matching qualities the dancers actually like one another, start dating and that is worth four points. If all the four visible qualities match then the dancers get the &quot;happily ever after&quot; the one true love we all search for and thus it is worth full 5 points.&#10;&#10;Each dancer also has a secret quality that can and will alter the basic score. For example if a guy has a large... &quot;personality&quot; then the player gets two extra points unless the other dancer is drunk, because if she is she wouldn't notice the difference. Girl's beautiful roommate on the other hand only has a function in the one-night-stands and the fun the couple would have means now triple fun and thus the player gets triple points. There are 12 different secret qualities in the game ranging from heart-broken to those who still live with their mom.&#10;&#10;Occasionally the game gets spiced up by one of the three special charachters in the game. Bouncer can remove any of the dancer from the game board where as a Rock Star walks into the game normally, but once (s)he has gathered a fan crowd and he's completely surrounded player can take the Rock Star and four adjacent dancers back to his hotel room and form two couples out of them. The bully is the guy who harasses women and picks a fight with men and once he enters the game his mere presence prevents any dancer next to him to be part of a couple.&#10;&#10;In the end the player who has been the best cupido wins the game. In other words the best scorer wins.&#10;&#10;",
        "artist": "Antti Löytynoja"
    },
    {
        "name": "Die Wiege der Renaissance",
        "description": "From the publisher (site: http://www.ddd-verlag.de ).&#10;&#10;An innovative cardgame from Hanno and Wilfried Kuhn situated in Florenz - the cradle of the Renaissance. Artists such as Botticelli, Michelangelo and da Vinci worked in this city, the preacher Savonarola established a God state and Machiavelli wrote his works on the theory of power. Here the Medici prevailed and the city saw the birth of important discoverers such as Vespucci.&#10;&#10;As the head of an influential European aristocracy you will try to lead your family to a cultural and power-political top. In the face of the historical events of this time you promote cultural achievements such as architecture and religion, financing, the sciences and naturally also the voyages of discovery. Surround yourself with the powerful ones of this time and use all your diplomacy skills to achieve a crucial advantage against your competitors. Only the player with the most influence stones will win the game ...&#10;&#10;Box content:&#10;- 36 historical events &#10;- 40 culture cards&#10;- 27 person cards&#10;- 5 summary cards &#10;- 28 influence stones (7 in each of the colors yellow, red, black and white) &#10;- 4 genius figures (1 in each of the colors yellow, red, black and white)&#10;- 1 rules book&#10;&#10;",
        "artist": "Katharina Kubisch"
    },
    {
        "name": "About Time",
        "description": "Teams compete to guess closest to the year of a historic event, which is read out from a Question Card.  Winning teams collect tokens and roll the dice to move around the board in a race to the Center.&#10;&#10;The game includes a board, eight different characters to represent the teams playing, a sandglass timer, two dice, a scoresheet, six pencils, a novel magnetic category selection unit, question/answer cards, timecards, rules, and a mini-reference sheet.&#10;&#10;The game is played in rounds, the first of which is similar to a round of trivial pursuit.  The second round introduces timecards, which tweaks gameplay by giving teams various powers, such as stealing points.  The game sequence also changes to shake things up a bit.&#10;&#10;Very much like an exciting Trivial Pursuit, adding various new mechanics.&#10;&#10;Released at Spiel 2007.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Golden Compass",
        "description": "&#10;&#10;&#10;    &#10;        Disambiguation: This game is for the Golden Compass movie, the game for the book is located over here.&#10;&#10;    &#10;&#10;&#10;Players are part of Philip Pullman&rsquo;s creation, as portrayed in the motion picture: a world very much like our own, but existing in a parallel universe. The game features graphics and pictures taken from the movie. Players alternate in leading Lyra in her journey to rescue her friends, as she escapes from the Magisterium's clutches. As each turn unfolds, players collect items and clues, and help Lyra to understand the Alethiometer - the truth-measuring Golden Compass. During a turn a player uses the Alethiometer spindle: the spinning action reveals the two actions the player is allowed to choose from. A typical move involves playing or drawing Lyra cards, played in sets to collect Item tiles from the board (representing Lyra and Pan's actions and investigations) or placing Symbol tokens that will later let a player draw valuable Truth tokens (representing the interpretation of the Alethiometer). Character cards, showing the main heroes and villains of the story, can be used by players to alter the gameplay by applying their special abilities. The winner is the player that scores the most points by the end of the game.&#10;&#10;",
        "artist": "Francesco Nepitello"
    },
    {
        "name": "Cockroach Salad",
        "description": "In Cockroach Salad players create a common salad packed with lettuce, peppers, tomatoes and cauliflower &ndash; but they won't always be saying which ingredient they're adding to the bowl!&#10;&#10;The 128 cards &ndash; 120 vegetable cards in the four types and eight &quot;taboo&quot; vegetable cards, two of each type that bear cockroaches &ndash; are shuffled and divided among the players. On a turn, a player plays the top card from his deck onto the central pile of cards, naming the vegetable as he plays it, e.g., &quot;Pepper!&quot; &ndash; except in the following situations:&#10;&#10;&bull; If his vegetable matches the previously played vegetable, the player must lie.&#10;&bull; If his vegetable matches the claim made by the previous player (perhaps because that player lied), then the player must lie.&#10;&bull; If he plays a taboo card, he shouts &quot;Cockroach!&quot; and the next player starts a new pile next to the first one so that the taboo card remains visible.&#10;&bull; If his vegetable matches a visible taboo card, he must lie.&#10;&#10;Make a mistake or stumble or hesitate too long, and a player must pick up all cards played to that point in the game. The first player to run out of cards wins!&#10;&#10;Can be combined with Kakerlakensuppe.&#10;&#10;",
        "artist": "Rolf Vogt"
    },
    {
        "name": "Gipsy King",
        "description": "Players build caravan routes across the board&mdash;in the free lands near the wonderful lakes&mdash;vying to attain the most popular and lucrative caravan spots for their families. When all the lands have been filled with caravans, points are awarded for controlling lakes with gold coins and connected caravans groups. After a second round (which entails some minor changes), the player with the most points is crowned as the Gipsy King. Release: Essen 2007.&#10;&#10;",
        "artist": "Czarnè"
    },
    {
        "name": "Alles Kanone!",
        "description": "Alles Tomate! &ndash; and the subsequently rethemed spin-off games Alles Trolli! and Alles Kanone! &ndash; are memory games with identical game play while the theme changes from barnyards to travel to pirates from one edition to the next.&#10;&#10;In Alles Tomate!, players are farmers who keep forgetting where they put their belongings. To set up the game, seven topic cards with different colored backgrounds are laid out. The yard card deck consists of 49 cards &ndash; seven each with one of the seven background colors, with each card showing a different image. One card of each background color is laid out below the appropriate topic card, which depicts the seven images in that color. Each player tries to memorize the cards, which are then turned face down.&#10;&#10;On a turn, one player reveals a yard card and the first player to name the yard card of the same color currently face-down in the display claims that card, with the newly revealed card put in its place. If two players name the card at the same time, each player claims a card with extra drawn off the deck as needed; if no one names the card, the face-down card is placed back in the deck while the new card is put in its place. When the yard deck runs out, the player with the most cards wins.&#10;&#10;",
        "artist": "Gabriela Silveira"
    },
    {
        "name": "Wiochmen 2",
        "description": "A sequel to Wiochmen Rejser. The countryfellows want another race! This time the cards are more colorful (and there are more of them), the rules are more complicated, and the characteristic countryside-related humor is as good as it was before... The game is also more interactive.&#10;&#10;Now up to six peasants may race in their carts using... cards. Some cards represent parts of a narrow country road (with many holes and other traps), the others are played to speed up a player's cart or slow down the opponents.&#10;&#10;Cart Race! Dynamic play! Unforgettable fun!&#10;&#10;Do you want to be the first one to get to the local barn for the show with the greatest band in the neighborhood? Do you want to be the best in the whole district? Show how fast your cart is. Get your whip, call the kids for the ballast and hop on the buck - the race is about to start! In &quot;Wiochmen 2&quot; only the toughest men win. Be the best driver! Become The HyperCartMan.&#10;&#10;The game includes:&#10;&#10;- 88 cards&#10;- 20 markers&#10;- 8 pawns&#10;- the rulebook&#10;- a funny beret&#10;&#10;",
        "artist": "Marek Mydel,Piotr Stankiewicz"
    },
    {
        "name": "Palastgeflüster",
        "description": "Palastgefluster translates literally as &quot;Palace Whisperings&quot;&#10;&#10;&quot;At the royal court, discontent prevails, the royal household is dissatisfied. The first intrigues are schemed: The marshall lets the treasurer in on his plans, and the lady's maid whispers secretly with the magician. At the worst, persons of equal rank huddle together. In this case, dark whisperings are in the air which the king will penalise with severe sentences. But loyal subjects will secure the King's favour and win the game.&quot;&#10;&#10;Aim of the game:&#10;&#10;Each player tries to play their cards so that each character exists only once in their display. If they do not succeed in doing so, all the others rise in the king's favor and will be rewarded. At the end of the game, the player with the most points wins the game.&#10;&#10;",
        "artist": "Taira Akitsu,Aleksander Karcz,Kathy Kowal,Mira Lob,Dennis Lohausen,Pedro Soto"
    },
    {
        "name": "1848: Australia",
        "description": "1848 Australia, is a semi-historical railroad game from the 18xx set, and to which the designers credit some of this games' systems to the originator of the series - Francis Tresham.&#10;&#10;The game consists of two separate series of actions repeated until the game ends, these are stock rounds and operating rounds. During stock rounds, shares in the various railroading companies are bought &amp; sold by players and are tracked on the stock market mat. During operating rounds, the player/directors of those railroading companies are allowed to build track &amp; place station markers on the map, and then may buy trains from which to earn capital from running those trains along routes on the map. The capital earned may be paid out as dividends to shareholders or retained by the company for future expansion.&#10;&#10;The game ends at a pre-determined point, whereupon the player with the most worth,(cash on hand &amp; share certificate value) wins.&#10;&#10;As with many games in this series, there are similarities within the rules, but many feature slight differences, and it is these that give each individual 18xx game its character.&#10;&#10;1848 features an interesting array of differences described above. These include how private companies are purchased, the inclusion of The Bank Of England as a public company that extends loans and administers railroads that are in receivership, dealing with different track gauges between states and 'The Ghan' special train.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Mouse Match",
        "description": "Seven nimble mice scurry from passage to passage and are never where you expect them.&#10;The game is a carousel with 6 holes and 7 mice. Some pieces of cheese are in the middle of the carousel. Every cheese has a color. On your turn, you have to pull out a mouse out of its hole. When the color on the mouse is the same as the cheese, you get the cheese.&#10;The player with most cheese, wins.&#10;&#10;",
        "artist": "Lena Kappler,Johann Rüttinger,Rolf Vogt"
    },
    {
        "name": "Altamira",
        "description": "From the English rules:&#10;&#10;Altamira - Hunters of the stone age&#10;&#10;Altamira in the year 11,765 B.C. - You live together with other hunters in a cave. Sitting at the campfire, every evening you plan where you want to go stalking the next day to bring home food, furs, and material for new weapons. On the hunt you meet not only saber-toothed tigers, bison and cave bears, but mostly also hunters of neighboring tribes you have to stand up to. Whoever masters this best and captures the most prey will be honored as the most successful hunter.&#10;&#10;You send your hunters to hunting grounds where they make weapons; with adequate weapons, they can kill animals on the hunt that follows. This gives you prey points. The player with the most prey points wins the game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Bezzerwizzer",
        "description": "Bezzerwizzer is a quiz game from Denmark. It contains 5000 questions (English version has 3000 questions) from 20 categories. It takes its name from the german 'Besserwisser' meaning &quot;know-it-all&quot;.&#10;&#10;On your turn players draw the category tiles from a bag and sort them on their player board according to their knowledge. If you know the answer to the category questions that you thought you're worst at, you get one point. For your best category question you receive 4 points.&#10;&#10;Each players has 3 additional tokens. One is labeled with a &quot;Z&quot; the other two are labeled with a &quot;B&quot;. With the &quot;Z&quot; token you can swap one of your categories with another player. Afterwards it's out of the game for this round. You can use the &quot;B&quot; token when you think you can answer a question that your opponent might not know. This brings you additional points.&#10;&#10;It's a quick and funny party game that you can also play with teams.&#10;&#10;",
        "artist": "Jesper Bülow"
    },
    {
        "name": "Didi Dotter",
        "description": "A new game in the Chicken Cha Cha Cha series.&#10;A set of half eggs are on the table. Players have to try to combine the right halfs (with the same bird). All players do this at the same time.&#10;When all the eggs are completed, you have to check the combinations. If they are right, you may discard your token with that bird. Then you play a next round.&#10;First player to discard all tokens, wins.&#10;&#10;This Game is part of The Chicken Family of Zoch&#10;&#10;",
        "artist": "Doris Matthäus"
    },
    {
        "name": "Kogworks",
        "description": "The object of Kogworks is to turn the top cogwheel (gold), by creating a linked path from your base wheel to the top wheel. Or to block your opponent's cog wheels such that even after their move, they are unable to turn their base wheel!&#10;&#10;Home Page: http://www.kogworks.com/kogworks/index.htm&#10;&#10;Promo Video: http://au.youtube.com/watch?v=Ysq3qDDXimY&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Make You Gunfighters",
        "description": "This game is about a war between gunfighters who belong to various posses. Each posse faces off with the others, and attempts to take over the town. The winner takes all in this battle. If yours is the last posse standing when the gunfight is over and the dust settles, your gang will control the fate of the town!&#10;&#10;Players get 5 hand cards. On a player's turn, that player can play a card to &quot;hit&quot; another player.  The targeted player must discard all hand cards with the same name, or change a card.  When a player loses the last hand card, that player is eliminated.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Mafia",
        "description": "Mafia is a Polish partnership game based on the traditional game &quot;Mafia&quot;. This version has got the same interesting innovations (like action cards with special powers etc.).&#10;&#10;",
        "artist": "Dimitry Davidoff,Piotr Socha"
    },
    {
        "name": "The Battle for Hill 218",
        "description": "The Battle for Hill 218 is a card-based strategy game in which two players fight to control a hill by occupying bases on the opposite sides.&#10;&#10;Players must maintain supply lines and destroy enemy units to advance on the enemy home base, while ensuring that their own base is not taken.  Air strikes can aid your assault or help defend your base, but spend them wisely...you only have two.&#10;&#10;",
        "artist": "Kaile Dutton,Sarah Pinansky"
    },
    {
        "name": "Murder City",
        "description": "A game of detectives and justice&#10;&#10;Murder City is a strategy game for 2 to 5 players. You assume the role of a futuristic investigator, from hard-boiled detective to alien sleuth to company man. Your goal is to track down killers and prosecute them. The player to survive &quot;the life&quot; best and earn the most credits is the winner, the foremost jovan in the city.&#10;&#10;This game includes the following:&#10;&#10;&#10;     5 different detectives to play&#10;     25 Murder Cards, the cases you investigate&#10;     50 Legwork Cards, which advance your own cases or interfere in other players'&#10;    25 Hardship Cards, the troubles you suffer when getting too deep into your work&#10;     All the dice you need to play&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Politico",
        "description": "The king is dying, and the people bang at his gates, demanding democracy.  To appease his people, the kingdom's first election is being held to determine which of the king's children will assume the throne.&#10;&#10;To become the next ruler, players must choose either to politic with the members of the kingdom's four classes, or to use their political pull as royalty to change the lives of the people, for better or worse!  The first player to gain thirteen followers, with at least one follower from each class, becomes the next ruler and winner of POLITICO.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Barista",
        "description": "Be the best Barista by trying to brew the perfect cup of coffee. But, be careful. You may just spill your masterpiece.&#10;In Barista, players compete to be the first to brew a customer's specialty coffee drink, as ordered. The player who brews the cup first, or comes closest to it, will earn tips toward victory as the best Barista.&#10;Each round, 4 dice are rolled, each representing one aspect of the specialty coffee to be brewed. Generally on a player's turn, he will draw a card and discard a card, trying to match the symbols rolled on the dice. As players acquire these cards, they are played face-down in front of them. There are Action cards to turn the tables a bit, as well as cards to earn or lose tip money. Perhaps you will wish to make a 'Barista Challenge' against the other players. Think your coffee will beat someone else's? Go ahead, make their day. But, how about just making some coffee.&#10;The game comes with 56 cards, 4 special dice, a coffee mug dice cup/tip jar, 20 tokens (tips), a special token bag, and rules that could be written a bit better. All in all, a good experience for specialty coffee fans everywhere.&#10;&#10;",
        "artist": "Sandra Garavito,Ginormous Industries"
    },
    {
        "name": "Monsterpocalypse",
        "description": "Monsterpocalypse brings the kaiju (giant monster) genre to the tabletop in the form of an exciting and highly strategic war game.&#10;&#10;Designed by Matt Wilson, the award winning creator of Warmachine and Hordes, Monsterpocalypse utilises the critically acclaimed abilities of Privateer Press as a leading miniatures manufacturer to enter a new category of product with a property that will appeal to a world-wide fan base of all ages.&#10;&#10;The players take the role of different factions (dinosaurs, robots, aliens, monsters and so on) fighting with one large (Godzilla size) creature combined with a steady flow of smaller units to support it. The battlefield is a cityscape (poster map) with building models integral to the game's strategy and gameplay. The game uses dice pools of custom dice that are used for both attacking and taking actions, leading to an ebb and flow between monster and unit turns. The goal for both players is to eliminate the monster on the opposing side.&#10;&#10;Monsterpocalypse launched as a CMG in Fall 2008 with the 'Rise' block which consisted of a base set ('Rise') and two expansion sets ('I Chomp NY' and 'All Your Base'), both of which were released in 2009. The second block was released in Fall 2009 with the base set ('Now') and an expansion set ('Big in Japan') in 2010. The last expansion for the 'Now' block has still not been released as of 2015.&#10;&#10;Each set contains large-scale monsters, as well as smaller support units and interactive buildings. Figures were sold in semi-randomized starter packs and randomized booster packs, with limited figures available only through promotional events.&#10;&#10;In 2010 Privateer Press released the Monsterpocalypse 2 Player Battle Box, a semi-randomised set which contained everything 2 players needed to dive right into the game, including two full factions and a complete set of buildings (all from Set 1 'Rise'). In 2011 they also released Monsterpocalypse Dangerous Monster Zone or Monsterpocalypse DMZ for short. These worked as expansion packs for the 2 Player Battle Box, each containing completely fixed, faction specific sets of Set 2 'I Chomp NY' and 3 'All Your Base' miniatures. By buying the DMZs for the factions you got in your  initial battle box you would have 2 complete factions and a full set of buildings from the 'Rise' block, making Monsterpocalypse  much more accessible for newer players in a more non-collectible format.&#10;&#10;",
        "artist": "Kris Aubin,Roberto Cirillo,Benoit Crosse,Matt DiPietro,Brian Dugas,Kimberly Goddard,Jason Hendricks,Ron Kruzie,Dan LuVisi,Josh Manderville,Ben Misenar,Javier Rodriguez,Ben Saunders,Stuart Spengler,Chris Walton"
    },
    {
        "name": "Hero: Immortal King – The Lair of the Lich",
        "description": "Hero: Immortal King takes the concepts of a traditional role-playing game, and turns it into a head-to-head (or solitaire) card game between the adventurers and the dungeon.  One player leads the adventurers down three dangerous corridors (each represented by a deck of cards), while the other player manages the dungeon and its dangers.  The adventurers win by defeating the final monster in the dungeon.  The dungeon wins if the adventurers lose all their Courage - represented by tokens.&#10;&#10;Le repaire de la liche (The Lair of the Lich) has no traps for the adventurers, but that just means there are more monsters!&#10;&#10;",
        "artist": "Laurent \"Lohran\" Couturier,Stéphane Gantiez"
    },
    {
        "name": "Hero: Immortal King – The Den of Dementia",
        "description": "Hero: Immortal King takes the concepts of a traditional role-playing game, and turns it into a head-to-head (or solitaire) card game between the adventurers and the dungeon.  One player leads the adventurers down three dangerous corridors (each represented by a deck of cards), while the other player manages the dungeon and its dangers.  The adventurers win by defeating the final monster in the dungeon.  The dungeon wins if the adventurers lose all their Courage - represented by tokens.&#10;&#10;L&rsquo;antre de la folie (The Den of Dementia) is infested by all sorts of bubbleyes - nasty floating orbs with their eyes on the adventurers' demise!&#10;&#10;",
        "artist": "Emmanuel Beltrando,Bertrand Benoit,Laurent \"Lohran\" Couturier,Stéphane Gantiez"
    },
    {
        "name": "Hero: Immortal King – The Infernal Forge",
        "description": "Hero: Immortal King takes the concepts of a traditional role-playing game, and turns it into a head-to-head (or solitaire) card game between the adventurers and the dungeon.  One player leads the adventurers down three dangerous corridors (each represented by a deck of cards), while the other player manages the dungeon and its dangers.  The adventurers win by defeating the final monster in the dungeon.  The dungeon wins if the adventurers lose all their Courage - represented by tokens.&#10;&#10;La forge des enfers (The Infernal Forge) has an unhealthy mix of traps and monsters to wear the adventurers down.&#10;&#10;",
        "artist": "Laurent \"Lohran\" Couturier,Stéphane Gantiez,Lohran Gantiez"
    },
    {
        "name": "Scene It? Disney Second Edition",
        "description": "From the Publisher:&#10;&#10;Featuring Pirates of the Caribbean, Cars, and The Incredibles!&#10;Add the magic of Disney to your family fun time! Scene It? Disney 2nd Edition features more classic characters, more unforgettable songs, more favorite scenes from your favorite classics, old and new. Enjoy them all as you answer trivia questions and race around the game board. This game is guaranteed to keep your family smiling play after play. Ages 6 - Adult.&#10;&#10;Game Includes:&#10;Collectible Tin (Deluxe edition only)&#10;1 DVD (Deluxe edition includes bonus DVD) &#10;Flextime&reg; Game Board &#10;Party Play &#10;4 Collectible Metal Tokens &#10;160 Trivia Cards &#10;30 Buzz Cards &#10;1 Six-Sided Die &#10;1 Eight-Sided Die &#10;Set of Game Rules&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Scene It? Harry Potter Second Edition",
        "description": "From the publisher:&#10;&#10;More movie clips and more magic!&#10;Scene It? Harry Potter 2nd Edition is now loaded with new movie clips from the first four Harry Potter movies including previously unavailable footage from Harry Potter and the Goblet of Fire! Plus new questions, puzzlers and images from Harry Potter and the Order of the Phoenix! How much do you really know about &quot;The Boy Who Lived&quot;, Quidditch or the Dark Arts? You'll find out as you race your friends around the game board. Ages 8 - Adult.&#10;&#10;Game Includes:&#10;1 DVD&#10;Flextime&reg; Game Board &#10;4 Collectible Metal Tokens &#10;160 Question Cards &#10;30 House Points Cards &#10;4 Category Reference Cards&#10;1 Six-Sided Die &#10;1 Eight-Sided Die &#10;Set of Game Rules&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Scene It? Movie Second Edition",
        "description": "From the Publisher:&#10;&#10;All-new edition of America's favorite DVD trivia game!&#10;Scene It? Movie 2nd Edition picks right up where the original left off. From the moment you pop in the DVD, you'll experience the very best in motion picture trivia from movies like Walk the Line, Dodge Ball and Casablanca. If you're really into movies, then let Scene It? Movie 2nd Edition put your movie trivia knowledge to the ultimate test. Ages 13 - Adult.&#10;&#10;Game Includes:&#10;Collectible Tin (Deluxe edition)&#10;1 DVD (Deluxe edition includes bonus DVD) &#10;Flextime&reg; Game Board &#10;Party Play &#10;4 Collectible Metal Tokens &#10;160 Trivia Cards &#10;30 Buzz Cards &#10;1 Six-Sided Die &#10;1 Eight-Sided Die &#10;Set of Game Rules&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Black Stories Mystery Edition",
        "description": "How could that have happened? Black Stories are fiddly, morbid and mysterious riddles for teenagers and adults. The players try to reconstruct the crime by asking, guessing and fiddling about. Only yes/no answers are allowed. A spooky card game just right for any party. This version of the black stories has mysteries about vampires, aliens, undead and other fantasy based themes.&#10;&#10;",
        "artist": "Bernhard Skopnik"
    },
    {
        "name": "Spirits!",
        "description": "A quick card game by Reiner Knizia, showed at the 2007 Lucca Comics &amp; Games Italian fair and published by Raven Distribution and Red Glove.&#10;&#10;In the game players play ghost cards (with values from 1 to 3, in 6 suits) raising the fear level and trying to scare other players. When a player is faced with a total of 7 or more and cannot play a card of the same suit (reversing the flow of the game), he loses the game turn and have to take a ghost marker.&#10;&#10;The player with less markers at the end of the three rounds wins the game.&#10;&#10;",
        "artist": "Emmanuel Bourdelais,Silvio Neuendorf"
    },
    {
        "name": "Strut!",
        "description": "From the Game Designer's Website @&#10;&#10;http://store.canoegame.com/c-5-strut-ioriginali.aspx&#10;&#10;Object&#10;&#10;The object is to win the game by ridding yourself of all cards in your hand before your opponent[s].&#10;&#10;Game Summary&#10;&#10;Decide on a scorekeeper. Once the cards have been shuffled, the scorekeeper deals 3 cards face down to each player, along with an equal number of white dice, called a stash. The scorekeeper places the remaining cards face down off to one side of the table to form a deck.&#10;&#10;The scorekeeper begins the game by rolling two dice (1 black &amp; 1 white) in the center of the table. If no one scores, play rotates clockwise to the next player who rolls two dice. Any two die, including the black die can be rolled (see below). Before each roll players examine their cards to see what dice combinations will be needed to match a card in their hand.&#10;&#10;Two white dice from your stash, or. &#10;One die from your stash, and one (previously rolled) die from the table, or&#10;Two (previously rolled) dice from the table.&#10;&#10;Player&rsquo;s take turns rolling until someone shouts STRUT! indicating a player believes they have won the round. A round is won when you match a card in your hand with a dice combination on the table. Let&rsquo;s say you have a 4 of a Kind (card) in your hand. There are 8 dice on the table 1,3,4,6 and four 5&rsquo;s: 5, 5, 5. You quickly shout Strut! believing your dice combination (four 5&rsquo;s) matches the card (4 of a Kind) in your hand, thus winning the round. But have you? You have if one of your 5&rsquo;s is the black die. The black die must always be part of the score.&#10;&#10;Keeping score is very simple. All dice on the table are scored. The black die counts face value [1]=1 point, [2]= 2 points [3]=3 points, etc. White dice count 1 point each. In the example above, you scored a total of 12 points (5 points for the black die and 7 points for the white dice.)&#10;&#10;After each round the winner&rsquo;s points are totaled by the scorekeeper. After the scorekeeper has recorded the points, the winner discards his/her winning card, placing it &ldquo;face up&rdquo; under the deck. If the winner&rsquo;s accumulated score totals less than 30 points then he/she must draw one new card from the deck. If the winner has accumulated 30 or more points, no card is drawn allowing that player to begin ridding his/her hand of cards in an attempt to win the game. (Re-Action cards are an exception to the &ldquo;30 points&rdquo; rule.) All other players keep their cards. Dice on the table are evenly redistributed. Note: As you will see as the game progresses, tactics and strategies become a big part of each round.&#10;&#10;The winner begins the next round by rolling 1 black and 1 white die. Play continues until someone shouts Strut! The first player to accumulate 30 or more points with no cards remaining in their hand wins the game.&#10;&#10;The Black Rooster&#10;&#10;If an opponent throws the Black Rooster card down on your winning card, it spells disaster! You must turn in all the cards in your hand, and draw 3 replacements. Plus, you lose all your accumulated points.&#10;&#10;",
        "artist": "Kym Garraway"
    },
    {
        "name": "The Battle for Normandy",
        "description": "From the GMT Website:&#10;&#10;The Battle for Normandy is a game that represents the climactic campaign in Normandy from D-Day, 6 June 1944 to the first week of August 1944 at primarily battalion level. Numerous scenarios are included to play out various smaller battles in Normandy. It is intended for two players or player teams.&#10;&#10;The game uses a unique sequence of play and a system of fire combat throughout the airdrop and beach assault phases with company-level breakdown units, then a more traditional odds-type combat approach throughout the rest of the game. Initial beach defense deployments at start and daily air support and defense allocations, hidden to the opposing player; create a level of uncertainty that makes for a tense, challenging duel.&#10;&#10;The game combines a detailed, extensively researched order of battle with relatively fast-playing game mechanics to make it not only the largest representation of the Normandy campaign available to date, but a manageable one that is meant to be played, not shelved. Scenarios include &lsquo;Bloody Omaha&rsquo;, &lsquo;Operation Epsom&rsquo;, &lsquo;Cobra&rsquo;, &lsquo;The Fight for Cherbourg&rsquo; and more.&#10;&#10;A future expansion will extend the play area south, to include the Mortain and Falaise scenarios, and extend the campaign to late August and the 3rd Army breakout.&#10;&#10;Game Equipment: &#10;&#10;     One Rule Book &#10;     One Scenario Book &#10;     Five (5) 22x34&rdquo; full color Maps &#10;     Nine (9) full color counter sheets &#10;     8-1/2x11&rdquo; Allied Air Allocation Log (laminated) &#10;     8-1/2x11&rdquo; Axis AAA Allocation Log (laminated) &#10;     11x17&rdquo; Turn Record Track &#10;     8-1/2x11&rdquo; Terrain Effects Chart (x2) &#10;     8-1/2x11&rdquo; Repl/Recon/Weather chart (x2) &#10;     8-1/2x11&rdquo; German Record Track &#10;     8-1/2x11&rdquo; Allied Record Track &#10;     8-1/2x11&rdquo; Combat Results Table (x2) &#10;     Dice - 3d6 and 1d10 &#10;&#10;&#10;&#10;&#10;",
        "artist": "Danny Holte,Charles Kibler,Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "Cat in The Hat:  I Can do that!",
        "description": "From the Press Release:&#10;&#10;The high-energy game that combines balancing, jumping, sliding, giggling and more to celebrate your child&rsquo;s &ldquo;I Can Do That!&rdquo; attitude!&#10;&#10;The Cat in the Hat has come for a visit and he wants to see all the things that you can do!&#10;&#10;Start by flipping over three cards to discover your new challenge. What will it be? Can you jump up and down&hellip;while holding the fish&hellip;under your chin? Can you limbo under the trick-a-ma-stick&hellip;while balancing the boat&hellip;on your stomach? If you think you can, shout, &ldquo;I Can Do That!&rdquo;&#10;&#10;There are hundreds of hilarious possibilities. The player who earns the most stars wins!&#10;&#10;The Cat in the Hat &ndash; I Can Do That! Game brings to life the beloved Dr. Seuss book giving kids a new and incredibly fun way to experience this classic Dr. Seuss story.&#10;&#10;",
        "artist": "Theodor Seuss Geisel"
    },
    {
        "name": "Sequence: States & Capitals",
        "description": "A variant of Sequence that tests your knowledge of the United States 50 States and Capitals. Each card has the name of a capital with its location shown on the state. Players match the state's shape and color on the card to the same state shape and color on the board, then place a chip on that space. Five chips in a row form a Sequence which is the object to winning the game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Prawo Dżungli",
        "description": "&#10;&#10;&#10;    &#10;        UNAUTHORIZED PRODUCTION&#10;&#10;    &#10;    &#10;         The information that BGG has on this item indicates that Prawo D&#197;&#188;ungli is a non-authorized version of Jungle Speed/Arriba!. &#10;&#10;    &#10;&#10;&#10;In Prawo D&#197;&#188;ungli (which means &quot;Jungle Law&quot;), players must get rid of all their cards as fast as possible. Each turn, each player reveals one of their cards as a simultaneous action. If two or more cards are identical, their owners try to catch the &quot;sceptre&quot; as fast as possible. The fastest player then gives their card to one of the opponents. But if an incorrect person touches the sceptre they must take cards from other players.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Eylau 1807",
        "description": "Published in issue 77 of Vae Victis, Eylau 1807 is another installment of the Jours de Gloire series, based on a Richard H. Berg system. This time simulating the battle pitting Russians vs. French in Eastern Prussia in the dead of winter, the 8th February 1807.&#10;&#10;Regiment-Brigade system, 200-400 infantry, 150-300 cavalry or 2-4 cannon per Strength Point.&#10;&#10;As with all Vae Victis games, the counters need to be cut out and mounted. The rules are entirely in French, although translations are available online.&#10;&#10;SYSTEM: Jours de Gloire Series (JDG) &#10;- scale = 297 m/hex; &#10;- time = 75 min/GT; &#10;- strength = 200 men/SP.&#10;&#10;",
        "artist": "Didier Bourgeois,Christophe Camilotte"
    },
    {
        "name": "Camper Tour",
        "description": "Play and travel, travel and play &#10;Those who tour by Camper know that every journey is a short, yet wonderfully freeing adventure. However, for a truly winning holiday, you must work out the best moment to return home. This is exactly what you will have to do in &ldquo;Camper Tour&rdquo;. The aim of the game is to complete the longest journey, returning home and consuming all the available Camper points. The game is divided into two distinct phases: the outward journey and the return journey. The length of each player&rsquo;s outward journey depends on the decisions and strategies they adopt during the game. 4 campers start their journey building, along the way, the route: everyone has its expectations to satisfy (represented by the 25 tokens to be played during the game) and typical situations to face (positive or negative unforeseen events). Will you be able to put your energy to good use and complete the longest journey, returning home just at the right time?&#10;&#10;",
        "artist": "Floriano Bitturini"
    },
    {
        "name": "Mü & Lots More",
        "description": "While the game M&uuml; and much of the card art will be familiar to players of Mu & more, this release of &quot;the best trick-taking games&quot; has a different lineup of games (some revised) and their components, plus more cards.&#10;&#10;This edition includes these previously-released games:&#10;&#10;    M&#195;&#188;&#10;    Nyet!, revised&#10;    Was sticht?&#10;    Meinz&#10;&#10;&#10;&#10;&#10;",
        "artist": "Doris Matthäus"
    },
    {
        "name": "Neue Heimat",
        "description": "Tactical bidding game about building the highest scoring houses in three building rows.&#10;The levels are different coloured cubes with numbers from 1 to 6 on it, that are dealt via auction in each round. The first one of a new colour you purchase fixes this colour as yours for the rest of the game and the final scoring. Players also bid for additional pieces to shorten (or lengthen) the lanes and rooftops to finish the houses.&#10;You pay with cheques, each of 1 million euros and can establish an &quot;illegal cashbox&quot;, counting at the final scoring, too.&#10;The game ends, when there are two rows completed. The houses on these score positive points, regarding the numbers on the levels and the rooftops, the ones in the third row are scored negative.&#10;&#10;Tough bidding game, unforgiving and rather deep for the way it looks. Klaus Zoch and some friends established an extra mini-publisher called &quot;Chili-Games&quot; for games like this, which don`t fit into the more family-fun-program of his Zoch-verlag.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Hai-Alarm!!!",
        "description": "With 64 cards, but only two motives - 32 sharks and 32 Dolphins - and without numbers and letters, each player first tries to release five sharks and set off the shark alarm. If not successful, the player with the most dolphins win. One can win thus both with sharks and with dolphins - and make something good out of bad cards. Great illustrations by Rolf Vogt.&#10;&#10;",
        "artist": "Rolf Vogt"
    },
    {
        "name": "Innsmouth Escape",
        "description": "One player takes on the role of the escaped student.  He is the Human player, and he is trying to rescue his friends and escape Innsmouth.  By playing movement cards, he moves his pawn around the board to visit various locations, fights any Deep Ones there, then searches those locations for his friends and equipment to help in their escape.&#10;&#10;The other players play groups of Deep ones.  They are trying to prevent the Human player from escaping.  The Deep one players take turns moving their pawns around the board trying to trap the Human.  Certain locations on the board also allow them to draw cards, spawn additional Deep Ones or even summon a terrible Shoggoth.&#10;&#10;",
        "artist": "Dave Aikins,Miguel Coimbra,Sławomir Maniak"
    },
    {
        "name": "Axis Empires: Totaler Krieg!",
        "description": "From the back of the game box:&#10;&#10;Totaler Krieg!&#10;This game stretches from the fjords of Narvik to the sands at El Alamein, from the gates of Moscow to the sandy beaches of Normandy, from the Spanish Civil War to the last days in Berlin and everything in between. No game tells the story of World War II in Europe like Totaler Krieg!&#10;&#10;This new edition of our popular Krieg! game is still the same highly playable, unpredictable and enjoyable experience it always has been. What&rsquo;s new is a design and graphic update and expansion to give you more options -- especially if you want to explore the critical pre-war period from 1937 to 1939. What if the Republicans had won the Spanish Civil War? What if Germany and Russia hadn&rsquo;t signed their Non-Aggression Pact? What if France had modernized its army instead of building the Maginot Line? All of these options are literally in the cards that form the strategies of the three factions -- Axis, Soviet Allies, and Western Allies.&#10;&#10;Best of all, Totaler Krieg! can be linked with its new Pacific companion game, Axis Empires: Dai Senso!, to play the joint Axis Empires scenario, an eye-opening global look at all of World War II. The fate of the world is in your hands!&#10;&#10;Totaler Krieg means Total War in German. In the game, play moves from Pre-War (where players mobilize their forces and engage in diplomacy) to Limited War (when open conflict begins) to Total War -- at that point, it&rsquo;s all-out warfare to achieve victory!&#10;&#10;Includes:&#10;&#10;    Two 22 x 34 inch maps&#10;    840 counters on three countersheets&#10;    200 cards&#10;    A 64-page rulebook&#10;    A 24-page scenario book&#10;    Play aids and force pool displays&#10;&#10;&#10;&#10;&#10;",
        "artist": "Alan Emrich,Davide Gallorini,Larry Hoffman,Thomas Prowell,Joe Youst"
    },
    {
        "name": "Axis Empires: Dai Senso!",
        "description": "From the back of the box:&#10;&#10;Dai Senso!&#10;This game stretches from the border clashes at Marco Polo Bridge and Nomonhan to the titanic clashes at Midway, Guadalcanal and Leyte, to the firestorms of Tokyo, Hiroshima and Nagasaki and everything in between. No game tells the story of World War II in Asia and the Pacific like Dai Senso!&#10;&#10;Dai Senso! takes the playable, unpredictable and enjoyable Krieg! system used for World War II in Europe and adapts it to tell the story of Japan&rsquo;s struggle from a unique perspective. Most other Pacific wargames focus on the operational aspects of the 1941-45 war. DS starts in 1937 for a true strategic experience from the beginning of World War II in Asia. As the leader of Imperial Japan seeking complete domination (&quot;hakko ichiu&quot;), will you strike at China, Russia, the British Empire or the United States? Whichever way you choose, you must eventually face the grim struggle of total war. All of these options are literally in the cards that form the strategies of the three factions -- Axis, Soviet Allies and Western Allies.&#10;&#10;Best of all, Dai Senso! can be linked with its new European companion game, Axis Empires: Totaler Krieg!, to play the joint Axis Empires scenario, an eye-opening global look at all of World War II. The fate of the world is in your hands!&#10;&#10;Dai Senso! means Total War in Japanese. In the game, play moves from Pre-War (where players mobilize their forces and engage in diplomacy) to Limited War (when open conflict begins) to Total War -- at that point, it&rsquo;s all-out warfare to achieve victory!&#10;&#10;",
        "artist": "Alan Emrich,Davide Gallorini,Larry Hoffman,Thomas Prowell,Joe Youst"
    },
    {
        "name": "Tàin",
        "description": "&quot;Long-horned, fertile bulls and fat, milky cows are grazing on the grasslands of the neighbouring clan. War spoils pillaged from our grandfathers still hang on the walls of the enemy house. We will not suffer it any longer! It is time all the clansmen assembled to raid across the border. Let all, from the chieftain to the youngest lad seize as many of the herd as they can!&quot;&#10;&#10;T&agrave;in is a game of bluff and tactics, in which you become a leader of a Celtic clan in ancient Ireland. Your task is to make your clan prosper by raiding your opponents&lsquo; grasslands for their cattle. They do not waste their time either and send their own warriors to your pastures to steal your herds. Only by cleverly ordering your clansmen, guessing your opponents&lsquo; moves and tricking them without letting them guess your real plans you can secure a place for yourself in the great chronicles of clan rivalry.&#10;&#10;",
        "artist": "Tomasz Tworek"
    },
    {
        "name": "Mustang",
        "description": "&quot;The richest rancher in the neighbourhood has no living relatives. He will soon decide which of his neighbours receives his numerous cattle herds. He will pick a ranch with the most impressive horse husbandry. Cowboys set out to the prairie - who corrals the most beautiful mustangs will secure himself a wealthy future!&quot;&#10;&#10;Mustang is a dynamic card game for two to five players who take the roles of ranch owners somewhere in the prairies of the Wild West and with the help of cards capture mustangs to start a fine horse-breeding farm.&#10;&#10;",
        "artist": "Radosław Gruszewicz"
    },
    {
        "name": "Saigo no Kane",
        "description": "&quot;The first day of a new school year has just begun in the elite school of Kankyou Gakuen. According to the school tradition all who wish to be school president may now present their candidacy to the voters. In order to do that they organize events on the school playing field. All seems to proceed in an atmosphere of friendly rivalry. The truth is, however, that the first week of school is a time of merciless combat during which all is fair. At the end of the week  we will know who gets position and influence and who loses status and privilege.&quot;&#10;&#10;Saigo no Kane is a board game in which you will battle your friends for power and authority in a Japanese high school. With the help of students of the election committee (and their parents&rsquo; money) you will organize events to attract voters. The person with the most support after the fifth turn wins.&#10;&#10;Home Page: http://www.wolf-fang.pl/?strona=w_przygotowaniu/saigo&amp;mode=view&amp;lang=en&#10;&#10;",
        "artist": "Joanna Krótka,Agnieszka Miroslaw,Tomasz Tworek"
    },
    {
        "name": "Yukatán",
        "description": "&quot;The first stone cities are being built in the depths of the jungle and their citizens raise their eyes to the sky waiting for a sign from the gods. The capricious gods are pleased when humans worship them as much as they can - therefore it is obvious that they will grant favors to the city that builds them a sky-high pyramid. Warriors set out to the jungle to get workers to finish the structure as quick as possible.&quot;&#10;&#10;Jukatan is a strategic game with a pinch of bluff. During the game you will be a ruler of  an ancient city of an arising civilization. Your job is to finish the pyramid before your opponents do. To accomplish this goal you send your warriors to get workforce and try to deceive your opponents with smart moves.&#10;&#10;",
        "artist": "Tomasz Tworek"
    },
    {
        "name": "The Caucasus Campaign",
        "description": "The Caucasus Campaign: The Russo-German War - July - November, 1942&#10;&#10;In late July of 1942, Hitler sent two strong armies south across the Don to seize the fertile Kuban and the oil of the Caucasus. Germany's 17th Army and 1st Panzer Army steamrolled over all opposition until they reached the mountains. There the Russians slowed and then stopped the Germans at the outskirts of Novorossisk, on the road to Tuapse and along the Terek River. This infuriated Hitler who then took over personal command of Army Group A and poured replacements and reinforcements into the area that were badly needed at Stalingrad. Eventually 27 Axis divisions were fighting south of the Don.&#10;&#10;The Axis forces include 2 mountain divisions, 2 light (j&auml;ger) divisions, an SS motorized division (Wiking), and 3 panzer divisions -- two of which had three tank battalions while many on the east front have only one. The German army is accompanied by 1 Slovakian and 7 Romanian divisions.&#10;&#10;The ranks of the Soviet army in the Caucasus is filled with Armenians, Georgians, Azerbaijanis, Cossacks and Turkoman who have questionable loyalty. These divisions are reinforced by Soviet Guard and NKVD units sent across the Caspian, and by Soviet Naval troops stationed along the Black Sea.&#10;&#10;The Caucasus Campaign is a quick playing, moderately complex game with large hexes and easy-viewing 5/8 counters. The game system is based on the classic Igo-Ugo/movement-combat-exploitation system, but modified with elements from Ardennes '44 (specifically: Determined Attacks and Defense and unit morale). The tournament scenario (6 turns) can be completely in roughly 2 hours. The full game is 14 turns long and can be finished in one sitting (approximately 5 hours).&#10;&#10;Game Scale:&#10;Game Turn: 1 week&#10;Hex: 18 miles / 29 kilometers&#10;Units: Regiments to Divisions&#10;&#10;Game Inventory:&#10;One 22 x 34&quot; full color map&#10;One &amp; 1/2 dual-side printed countersheets (264 5/8&quot; counters)&#10;One 24-page The Caucasus Campaign rulebook&#10;Two dual-side printed Player Aid cards&#10;Ten small plastic baggies&#10;One 6-sided dice&#10;&#10;Solitaire Playability: High&#10;Complexity Level: Medium-High&#10;Players: 1 or more&#10;Playing Time: 3-6&#10;&#10;",
        "artist": "Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "Deathride: Mars-la-Tour 1870",
        "description": "&ldquo;Not everyone can command an army of 140,000. It is difficult to manage when one is not used to it&rdquo;&#10;Mar&eacute;chal Canrobert during the trial of Mar&eacute;chal Bazaine&#10;&#10;Death Ride covers the battle of 16 August 1870 between French units of the Imperial Arm&eacute;e du Rhin seeking to retreat west from Metz, and German Confederation forces seeking to deny the French escape by turning their southern flank. Neither side was fully aware of the other&rsquo;s position. Faced with the unknown both armies conformed to type with the French defending strongly and the Germans attacking. For once, though, the French far outnumbered the Germans. As a result a heavily outnumbered German army was forced to make a series of attacks to prevent the French discovering its weakness and to deny the French their retreat to the west.&#10;&#10;Had the French pushed the Germans aside they would have been able to combine their armies and possibly protect Paris. They might also have avoided the collapse of the Bonapartist cause.&#10;&#10;This version appeared in Against The Odds magazine #24&#10;&#10;Full color 22&quot;x34&quot; map&#10;140 full color die-cut 1/2&quot; and 88 5/8&quot; counters&#10;Rulebook length - 16 pages&#10;Complexity - Low&#10;Solitaire Suitability - Medium&#10;Playing Time - 4 hours&#10;&#10;Design - Charles Vasey&#10;Development - Paul Rohrbaugh&#10;Graphic Design - Craig Grando&#10;&#10;",
        "artist": "Craig Grando,Mike Siggins"
    },
    {
        "name": "Mapominoes: Europe",
        "description": "From the box:&#10;&#10;It's like dominoes but with maps, as you build a map of Europe, by connecting countries that share a common border. Stay one step ahead of your opponents, as you race to be the first player to play all your country cards on the table and win the game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Drive On Metz (second edition)",
        "description": "The complete game is published by Victory Point Games who, along with the designer, Jim Dunnigan, have allowed a version to be included in RBM's C3i Magazine Nr20. The designer has added new pieces and scenarios to this edition of the game.&#10;&#10;This 2-player game recreates General Patton's attempt to seize the key city of Metz and to get across the Moselle River before the retreating Germans can form an effective defense.  The U.S. forces comprised of three divisions of the 20th Corps had just completed an epic pursuit across France after the Allied breakout from the Normandy beachhead.  The exhausted Allied forces were at the end of their supply line and has barely enough resources left for one last push. If they had been able to get across the Moselle River, they would have compromised the entire German Westwall defenses. This would have enabled Patton to make an attempt at crossing the Rhine before the end of 1944 and might have ended the war months earlier.  The defending German forces, four divisions of the 82nd Corps of the German 1st Army, were a combination of hastily collected and organized units, including fresh units from the German interior and remnants of units that Patton had been pursuing across France. The battle, which began on 7 September 1944 and lasted for about a week, was a singular opportunity that could have gone either way. Historically, the Germans won, but just barely.&#10;&#10;Scale: Each unit is 1 regiment or brigade, each hex is 4 kilometers, and each turn is 1 day.&#10;&#10;Game Components:&#10;&bull; One 4-page, color instructions booklet&#10;&bull; 40 color, die-cut 5/8&rdquo; mounted game pieces&#10;&bull; One 11&rdquo; x 17&rdquo; color game map with tables&#10;&bull; One 4-page, color BATTLESSON (TM) booklet&#10;&bull; Game setup illustration, optional rules, and player&rsquo;s notes&#10;&#10;Reimplementation of:&#10;&#10;     The Drive on Metz (first edition)&#10;&#10;&#10;&#10;&#10;",
        "artist": "Alan Emrich,Ted Koller,Rodger B. MacGowan,Bob Ryer,Mark Simonitch,Redmond A. Simonsen"
    },
    {
        "name": "Humans!!!",
        "description": "You used to be a musician, doctor, miner, cheerleader, etc., but now you are a zombie and these pesky humans keep trying to kill you.  But why?  All you want is some nice, delicious brains.  They have plenty.  Perhaps if you infected more humans, it wouldn't be such a problem...&#10;&#10;In Humans!!! you choose a Zombie and your abilities are determined based on your pre-zombie occupation.  Now you wander around town trying to infect as many people as you can to help with your cause.&#10;&#10;This game is compatible with Zombies!!!, where players can choose to play the humans or the zombies.&#10;&#10;Part of the Zombies!!! series.&#10;&#10;Publisher's Page&#10;Humans&#10;&#10;Expanded by Humans!!! 2 - Sea Food, Humans!!! 3 - ZombieCon and Humans!!! 4 - Camp Zombie Lake.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Breakthrough: Cambrai",
        "description": "Breakthrough: Cambrai, On November 20, 1917, 324 British tanks, followed by 8 infantry divisions, advanced on a front of 10,000 yards against the German lines near Cambrai, in Flanders. A combined-arms assault, plus the use of new artillery techniques, initially smashed the German trench line.  In several places, the attackers suffered almost no casualties and, by the end of the day, recorded gains of three to four miles. Would it be possible, this time, to break through to the &ldquo;green fields beyond&rdquo;? British euphoria over the success of the offensive was dampered only by the loss of 47% of their tanks on the first day.&#10;&#10;A two player game simulating the British assault to breach the &ldquo;Hindenburg Line&rdquo; between November 20 and December 3, 1917. One player controls the British forces, the other the German forces. The object of the game is to control a certain number of areas on the map or, for the British, to exit units off the map into certain perimeter zones.  An area-movement game which uses impulse mechanics (where players alternate &quot;mini-turns&quot;) similar to popular games like Breakout: Normandy and Monty's Gamble: Market Garden. The impulse nature of the game means little or no down time for each player while waiting for the other to complete a move or attack.&#10;&#10;Game Scale:&#10;Game Turn: 1 day broken down into 4 phases and impulses&#10;Area: 1 inch equals 1/6 mile / 268 meters&#10;Units: Battalion to Brigades&#10;&#10;Game Inventory:&#10;One 22 x 34&quot; full color map&#10;Two dual-side printed countersheets (240 5/8&quot; counters)&#10;One 16-page Breakthrough: Cambrai rulebook&#10;One 12-page Breakthrough: Cambrai playbook&#10;Six single-side printed Player Aid Cards&#10;Four 6-sided dice&#10;&#10;Solitaire Playability: Medium&#10;Complexity Level: Medium&#10;Players: 2 or more&#10;Playing Time: 4-15&#10;&#10;",
        "artist": "Nicolás Eskubi"
    },
    {
        "name": "Chabyrinthe",
        "description": "In Chabyrinthe, players try to help cats reach a sweet home.&#10;&#10;The map is a 4X4 maze grid, in a turn, a player must rotate a card and then take a card or  rotate a card. If after these actions, a cat can reach a sweet home, the player takes the cat card.&#10;&#10;Each cat haves a different value, at the end of the game, the player with the most cat points wins the game.&#10;&#10;",
        "artist": "Stéphane Escapa,Arnu West"
    },
    {
        "name": "Senji",
        "description": "Senji lets you don the armor of a chief of a Japanese clan in medieval Japan.&#10;&#10;Your goal is obvious: to become the daimyo whose honor imposes respect over all the other clans. To achieve your goals and to gain honor, you will have to overcome your adversaries in terrifying bloody battles, by holding in respect the other clans grace, honoring hostages or alliances.&#10;&#10;Every turn of the game is divided into three phases:&#10;&#10;&#10;     Diplomatic Phase, where you will be able to exchange military advantages (which make it possible to decrease the randomness of the engagements), to trade and acquire hostages (thanks to whom you will be able to pressure  your adversaries at the time of the engagements).&#10;     Order Phase, where you will place orders on the territories which you occupy. There are three types of orders:  movement, production and raising troops.&#10;     Action Phase, where the honor is of utmost importance. The player with the most honor hosts the Emperor.&#10;&#10;&#10;And that enables him to choose in which order the territories and corresponding orders will be processed.&#10;&#10;You may well imagine, that combats are frequent. One player then rolls 9 dice (whose faces are decorated with the symbols of each clan) whose results are then modified by the  bonus acquired during the diplomatic phase. Only the attacker (and only when victorious obviously) can acquire Prestige (points of honor) due to the engagements. This honor is proportional to the troops vanquished at the time of the conflict. The more deaths there are, the more honor there is!&#10;&#10;",
        "artist": "Bertrand Benoit"
    },
    {
        "name": "War",
        "description": "Arguably one of the most popular boardgames in Brazil, War is a modified version of Risk, using concepts that were later introduced in the original game, like objective cards.&#10;&#10;The players maneuver armies on a world map, trying to conquer continents, and trying to fulfill their objectives.&#10;&#10;This is the flagship game of Grow Jogos e Brinquedos and it has spawned four sequels of its own --- War&bull;II, War Junior, War: Imp&eacute;rio Romano (35-year anniversary edition) and War: Batalhas Mitol&oacute;gicas (40-year anniversary edition).&#10;&#10;Widely accepted as the first (and, probably, only) mainstream wargame in Brazil. Players are given tons of little army units to place onto the map of the world.  When it's your turn, you use your units to attack other players' positions, hopefully with superior numbers.  Combat is a simple dice rolling affair that stresses attrition, and reinforcements are given to players who collect sets of cards.&#10;&#10;Re-implements:&#10;&#10;    Risk&#10;&#10;&#10;&#10;&#10;Re-implemented by:&#10;&#10;    War II&#10;     War Junior&#10;    War: Imp&#195;&#169;rio Romano&#10;    War: Batalhas Mitol&#195;&#179;gicas&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Hyper Slide",
        "description": "Be quick as you flick, slide or shoot the different-colored hyper discs under the arch. As the game unit calls out the sequence of colors for you to pass, the game knows if you've passed the right disc or not. Pass 'em fast before the buzzer blasts! Obey the voice commands, get your brain in the game and break the code, or guess which color will be called next. Play with a friend or practice solo. Tabletop slide-and-pass excitement features electronic lights and sounds, plus an announcer's voice that talks you through three fast-sliding game modes. Electronic game unit comes with four Hyper Discs, each a different color; plus Hyper Band and instructions.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Cranium WOW",
        "description": "Cranium WOW includes an all new gameboard, 600 new cards with 15 fun activities (we promise), a 10-sided die (the 9-sided die just wasn't working), a tub of lovely, lovely cranium clay, a timer, pads, pencils, 4 new character movers with custom hats and hairdos, and sass.  Cranium is a roll and move game with four distinct decks of cards that have the players perform, answer trivia, sculpt, and use their knowledge of popular culture to advance through the board to the center.  It is a very fun game and is designed for adults, or people who are &quot;adult-like&quot;.&#10;&#10;",
        "artist": "Gary Baseman"
    },
    {
        "name": "Wasabi!",
        "description": "Wasabi! is a light and fast game where you compete against other players to assemble your quota of unique sushi recipes in a rapidly dwindling space.  Players draw a variety of delicious ingredients into their hand from the pantry and play them one at a time onto the board, building off of each other's previously-placed ingredients in the attempt to complete recipes of varying difficulty.&#10;&#10;Completing a recipe earns you your choice of special actions from the kitchen to perform later (Chop!, Stack!, Switch!, Spicy!, and the dreaded Wasabi!) that will help you in your efforts or disrupt your opponents' carefully arranged creations-in-progress.&#10;&#10;Completing a recipe with style will earn you bonus points, but you might not always have the time to set up such stylish maneuvers... balancing speed with technique will be crucial if you plan to win the game!&#10;&#10;Victory comes as soon as the board fills up with ingredients.  Points for completed recipes plus bonuses are tabulated, and the winner is the player with the most points.  An extremely skilled player might score an instant victory by completing their quota of recipes before the board fills up.&#10;&#10;",
        "artist": "Josh Cappel"
    },
    {
        "name": "Burrows",
        "description": "Welcome to sunny Gopher Gulch, home of a unique gopher population known far and wide for their bright and colorful coats! Due to their particular diets, our local gophers have developed fur in remarkable shades of red, purple, and orange&hellip; this is a sight that has to be seen to be believed, and every season we get bus after bus of excited tourists like yourself, eager to see our little furry friends! Quite a few Gopher Ranchers have set up shop around town, and each of them will try to show you exactly what you&rsquo;ve come to see. Thanks for visiting Gopher Gulch, please remember to tell your friends!&#10;&#10;~The Gopher Gulch Tourism Board&#10;&#10;Players are gopher ranchers in the town of Gopher Gulch, each placing tiles to build their own warren of burrows, hoping to attract all three types of gophers. It&rsquo;s a delicate balancing act where every tile counts. Build your warren, forming burrows of three different colors. Complete a burrow of a particular color that is longer than the current shortest burrow in that color, and the gopher living there moves into the new one; it stays there until it gets lured away again by an even bigger burrow! There is one less gopher of each color than there are players, so not everyone will be able to host all three gopher types at once.&#10;&#10;Every once in a while the tour bus will arrive, and the tourists will be most excited to see the types of gophers promised to them by their tour schedule. If your ranch is missing those particular gophers, you&rsquo;ll get complaints from the tourists. At the end of the tourist season, the rancher with the fewest complaints wins!&#10;&#10;",
        "artist": "Josh Cappel"
    },
    {
        "name": "Magnet",
        "description": "Magnet won 2010 Runner Up Abstract Game of the Year in Games Magazine.&#10;&#10;An abstract game where players try to get their king to the middle of the board. Each player has 12 blocks, 11 of which can be promoted 1, 2, or 3 times, thus increasing their movement capability (the king cannot be promoted so don't promote all your other pieces, or you will give away your king's location). A &quot;magnet,&quot; a black pawn, is placed on a gridded point and affects all of a player's pieces on lines radiating out from that point, moving them closer to the magnet. You can capture other pieces in this way, removing them from the board.&#10;&#10;",
        "artist": "Andy Hull"
    },
    {
        "name": "Middle Kingdom",
        "description": "A fast card game where players blind bid for dynasty cards such as warriors, nobles, bureaucrats, peasants, and merchants. You must balance your claims to score well at the end. There are special cards gotten from having the most in a category that give you a bonus, often affecting the bidding process.  For example, the Palace lets you see all bids before placing yours and the Heir lets you claim an unclaimed dynasty card.&#10;&#10;From back of the box:&#10;&#10;Following the collapse of the Han Dynasty, warlords backed rival claimants to the Chinese Throne, while others sought influence among the merchants, nobles, farmers, and bureaucrats.&#10;&#10;Each round, players play Bid Cards to claim Dynasty Cards and take control of the Emperor, Heir, Palace, Market, and Harvest.  However, the heavens in the guise of a Celestial Dragon, can disrupt the best laid plans.  The game ends as the Emperor dies and whoever gains the most influence will ascen the throne.&#10;&#10;",
        "artist": "Oliver Castañeda,Paul Gerardi"
    },
    {
        "name": "Endeavor",
        "description": "It is a time when the maps of the world are still being filled in. Seagoing empires expand their frontiers by sending ships to the farthest reaches of the globe in search of new lands, new alliances, and new conquests. &#30;The wealth of the newly-discovered worlds abroad is a tempting prize for those with the strength and the cunning to seize it... and to hold it!&#10;You represent a growing empire engaged in a glorious endeavor to expand your&#10;influence and status at home and across the great oceans of the world. Th&#30;rough exploration and shipping, colonization and war, you will struggle with the other great powers to control the resources and the regions that unfold before you.&#10;&#10;&#31;The goal in Endeavor is to earn the most glory for your empire. Players earn glory by increasing their scores in Industry, Culture, Finance, and Politics, as well as by occupying cities, controlling connections between cities, and by holding certain Asset Cards and Building Tiles. Short-term goals of constructing useful buildings, gathering Trade Tokens, and obtaining Asset Cards must be balanced with the overall goal of attaining glory as you compete for control over the various regions of the world. Th&#31;e game only lasts seven rounds, and when it is over you want to be the one who has earned the most Glory points!&#10;&#10;Each round every player gets to build a new building, based on their Industry track. They then obtain new population markers based on their Culture track and retrieve used markers from building based on their Finance track. During the action phase, players take turns to either activate a building using a population marker or spend trade tokens to take an action: Ship, Occupy, Attack, Payment or Draw. Some buildings and tokens allow a player to take one or both of two actions. Shipping is used to open new regions for Occupation and Drawing, and gains you Trade Tokens. Once a shipping track is full, the player with the most influence in that region gains the powerful Governor card for that region. Occupation of a city results in glory and Trade Tokens, while Attacking steals a city from an opponent! Either Occupation or Attacking can result in claiming the connection between two cities, if both connected cities are controlled by the same player. Drawing gains a card from a region up to the maximum hand limit based on the player's Politics track. A player's influence in a region determines which cards they can draw. Once all players have passed, a new round begins.&#10;&#10;",
        "artist": "Josh Cappel,Klemens Franz,Hanno Girke"
    },
    {
        "name": "Monastery",
        "description": "From the publisher:&#10;&#10;Monastery is a tile laying game in which players construct different parts of a medieval monastery. The work is done by the monks of a player. The monks may move from tile to tile and in addition to building work they can also study, toil or pray. In the &lsquo;icon&rsquo; game monks can also make use of the special properties of some of the tiles.&#10;&#10;The tiles vary in value ranging from 1 point field and path tiles to 5 point Chapter House and Library. The higher the value of tile the more monks are needed to build it. Players can build independently, but often they are required to work collaboratively.&#10;&#10;The game spreads over two days of monastic life, with turns being allocated as time for study and toil or for services in the abbey. At each service a new abbot is elected and apart from going first in the turn the abbot also has some significant powers.&#10;&#10;In order to win the game players must collect the letters of the abbey&rsquo;s motto &lsquo;Libera Nos Quaesumus Ab Omnibus Malis Amen&rsquo;. The letters become progressively more expensive and players must decide whether to buy letters or recruit extra monks.&#10;&#10;Points at game end are also awarded for the &lsquo;blessings&rsquo; which players can collect throughout the game.&#10;&#10;",
        "artist": "Colin Jones,Geraldine O'Reilly"
    },
    {
        "name": "Genji",
        "description": "In an age when poetry and the arts reigned supreme, the nights of Kyoto were filled with romance. Gentlemen of the Imperial court, ordinary clerks and functionaries by day, went out at night to meet their secret lovers in furtive trysts. Writing by the light of the moon, each tried to craft the finest and most moving poetry in the form of the Tanka, a short verse composed of only five lines. The best poems evoked the scene, the season, and represented the depth of the courtier's knowledge of the fashionable themes at court. By far, the most successful such lover was a fictional one named Hikaru Genji, the Shining Prince. Genji was, for the ladies of the court, the symbol of the perfect lover. For the men of the court, he was the perfect example to emulate. &#10;In GENJI, players take the roles of courtiers out to woo fair princesses. Players score points for writing the finest poetry, or winning the most hearts. But beware: other courtiers will be waiting in the wings to steal those hearts away! Take your brush in hand, and set out on the night streets of Kyoto. The romance of the height of the Heian Period awaits you in GENJI.&#10;&#10;Home Page: http://www.zmangames.com/cardgames/genji.htm&#10;&#10;From BoardgameNews.com:&#10;&#10;&quot;Players in Genji try to learn from the historical figure of Genji and woo the ladies of the Imperial Court with their poetry. Twelve ladies, each bearing a symbol of one of the four seasons as well as one of three fashions &ndash; melancholy, nature, romance &ndash; are laid out in a circle, with a fashion card chosen at random to show players what type of poetry is in style.&#10;&#10;&quot;In each of the four seasons, each player will travel from his &ldquo;home&rdquo; &ndash; a lady chosen at the start of the game that bears his marker &ndash; around the circle in either direction. A player moves 1-3 spaces each turn, then either studies new material (discards poetry cards and draws new ones) or woos the lady he is currently visiting. If he has no rivals who have previously presented her with poems, he can present her with a poem on one or two cards. &ldquo;Each poem card has the top or the bottom of a classic Tanka poem (5 lines, 5,7,5,7,7 syllables each, respectively),&rdquo; says Kirk. &ldquo;A poem can be considered either a top, a bottom, or a match of the two cards.&rdquo;&#10;&#10;&quot;If another player has already presented a poem, then he can either complete the poem (assuming only a single card was played) or challenge it (by playing a poem card that increases the beauty of the poem, thus revealing the other player for the poser he is). In the latter case, you discard your contribution and the matching half, then add the remaining half poem to your hand to be used later. &#10;...&#10;&quot;The round ends once a player returns home and makes a final study or woo action. Players then score points if they have the most poems on the board for that season, have presented the most beautiful poem of the season, or pitched woo at the home of another player. Yes, being a scoundrel can pay off.&quot;&#10;&#10;",
        "artist": "Dylan Kirk"
    },
    {
        "name": "What?",
        "description": "From the publisher:&#10;&#10;What?&#10;WHAT A PARTY! WHAT A LAUGH! WHAT A THING TO SAY! WHAT A GAME. &#10; About the Game&#10;&#10;&bull; Ages 14 and up&#10;&bull; 5+ Players&#10;&#10;WHAT is a hilarious party game of who-said-what. Players are asked to write responses to humorous questions and situations, and everyone must guess who wrote what.&#10;&#10;There is no need to be truthful!!! There is no need to be tasteful!!! Feel free to be as silly or as funny as you want&hellip; honesty is not the best policy in this game. WHAT is the perfect game for get-togethers and parties!&#10;&#10;Contents&#10;&#10;&bull; 162 Cards &#10;&bull; Answer Sheet pad &#10;&bull; Scoring Sheet pad &#10;&bull; Scoring Sheet shield &#10;&bull; 12 pencils&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Starmada: The Admiralty Edition",
        "description": "Starmada is a board game of starship combat. At its most basic level, players take command of space fleets in a general attempt to reduce each other to just so much space junk. At its most advanced, the game can be customized to breathe life into any science fiction background that players might imagine.&#10;&#10;Novices shouldn&rsquo;t fret; the core set of rules has been designed with simplicity and ease of play in mind, accessible even to beginners. On the other hand, seasoned veterans should find the concise nature of the rules quite refreshing. It allows players to concentrate on the finer points of squashing their opponents rather than arguing about rules interpretations, without sacrificing any of the flavor or excitement of more complex games.&#10;&#10;Simple, but not simplistic, is the guiding principle.&#10;&#10;The Admiralty Edition represents the latest incarnation of the Universal Game of Starship Combat. Included in the 80-page Core Rulebook:&#10;&#10;&#10;     The &quot;essential&quot; Starmada rules, including a new inertia-based movement system. &#10;&#10;&#10;&#10;     Over 80 different options from which players may pick and choose to create the perfect game. &#10;&#10;&#10;&#10;     A fully-customizable weapon design system, with almost five million different combinations. &#10;&#10;&#10;&#10;     A complete set of rules for fighters, allowing for nearly half a million different types of small craft. &#10;&#10;&#10;&#10;     A comprehensive construction system, allowing players to design their own starships with which to do battle. &#10;&#10;&#10;In addition to the core rulebook and 48-page Starmada Universe guide, a number of different settings are planned for the near future, including collaborations with several other companies.&#10;&#10;Available both in Print and PDF print-n-Play.&#10;&#10;Expanded by:&#10;&#10;    Imperial Starmada Sourcebook&#10;    Starmada: Dreadnoughts&#10;    Starmada: Hammer and Claw&#10;    Starmada: Iron Stars&#10;    Starmada: The Admiralty Edition &#226;&#128;&#147; Rules Annex&#10;&#10;&#10;&#10;&#10;Integrates with:&#10;&#10;    Klingon Armada&#10;    Romulan Armada&#10;&#10;&#10;&#10;&#10;Later editions:&#10;&#10;    Starmada Nova Rulebook&#10;&#10;&#10;&#10;&#10;",
        "artist": "James M. Dugan,Daniel Kast"
    },
    {
        "name": "Weilong",
        "description": "From Rules:&#10;&#10;A wise man named Wei Fu had five sons who he loved dearly.  He loved each in his own way, but favored his oldest most of all.  In fact, he showed affection and appreciation to each son in descending order of their birth.  Over time, this greatly displeased his younger sons to the point of confrontation.  Being respectful to their father, the younger two sons did not accuse their father directly, but merely asked the question:  &quot;What more can I do to earn your respect?&quot;  At first the father was outraged that his younger sons would question his fidelity, but then he realized their defiance presented an opportunity.&#10;&#10;His land had been plagued by prankster Dragon that ate his crops, scared away his workers and generally caused chaos throughout his land.  He decided to put his younger sons to the test of ridding his land of this Dragon.  The sons agreed, but pleaded:  &quot;Should our older brothers be denied this opportunity to prove their devotion to you?&quot;  Knowing full well his sons' intent, Wei Fu agreed to send all five sons on the quest.  However, his older sons, fearful for their safety, begged for a reprieve.  Acquiescing, Wei Fu decided to ease the burden by declaring:  &quot;The Dragon is the quest!  However, I would still appreciate any son who brings me the finest examples of the Five Elements of Water, Wood, Fire, Earth, and Metal, which provide the very foundation of our world.&quot;  With this alternative quest, he would assign the easier tasks to his older sons&mdash;or so he thought.&#10;&#10;Weilong or &quot;Powerful Dragon&quot; is a simple dice game based loosely on the dice game One-O-Five and the Chinese card game Shou Ba Yi.  Each player represents the role of one of Wei Fu's sons on their quest to collect the Five Elements or capture the Dragon.  Each player rolls their dice and sets aside those dice showing their target number (Element).  The objective is to roll all five dice of the target number before any other player.  Target numbers are determined by drawing cards (Son Cards).   The Son Cards also have unique abilities for the players.&#10;&#10;Once a player has set aside all five dice of the target number or captured the Dragon (by collecting the dice 1, 2, 3, 4 and 5), the remaining players add up the total of the dice they have collected along with the penalty number at the bottom of the card and track those points.  Your goal is have the lowest point total each round and for the game.  The Son cards are then passed to the left and the next round begins (5 Player Game).  The winner is the player who has the least amount of points after 5 rounds.&#10;&#10;",
        "artist": "Andy Kurzen"
    },
    {
        "name": "S'quarrels: A Game of Absolute Nuts",
        "description": "Under a nearby acorn tree embark in the rigorous task of collecting acorns before winter sets in. Other Squirrels are all trying to take them before you do. Whirlwinds, Ambushing, Quarreling, and Hoarding are all just part of the fun. Get the coveted Gold Acorn but watch out for the dreaded Rotten Acorn. The more acorns you get the better chance you have of surviving winter! The player to store the most acorns when winter finally comes WINS! S'Quarrels is designed for playing in groups of 2 to 6 players.&#10;&#10;",
        "artist": "(Uncredited),Bryan R. Lovell"
    },
    {
        "name": "Funkenschlag: EnBW",
        "description": "This is Funkenschlag (Power Grid) in a version for the power supplier EnBW with a special double sided board. Baden-W&uuml;rttemberg is a complete new board and the other side has a board of Germany with Mannheim deleted and Karlsruhe added.&#10;&#10;From Box Back&#10;Imagine, you run a utility like EnBW. You have customers you must supply power, and you have stockholders and partners, the demands and expectations of your business. And of course there's the environment that will be spared, at which energy you use? What locations are suitable for which type of energy? Is the capacity of your power plants to your customers - private as well as industrial customers - safe, reliable, sustainable and environmentally compatible supply of energy?&#10;&#10;Two to six players from twelve years can present their strategic skills in this exciting game to the test.&#10;&#10;EnBW wishes you the playful power suppliers luck and have fun!&#10;&#10;Incorporated into:&#10;&#10;    Power Grid: Qu&#195;&#169;bec/Baden-W&#195;&#188;rttemberg (the map)&#10;&#10;&#10;&#10;&#10;",
        "artist": "Lars-Arne \"Maura\" Kalusky"
    },
    {
        "name": "The Red Dragon Inn 2",
        "description": "The Red Dragon Inn 2 is a standalone game that can be combined with the original The Red Dragon Inn to create adventuring parties of up to eight drunken players. The Red Dragon Inn 2 includes its own drink deck, player mats, counters, Gold, markers, and the following heroic adventurers:&#10;&#10;&#10;    Dimli the Dwarf: Grumpy, but tough and loyal, Dimli always seems to have a stash of gold secreted away somewhere. He can pretty much drink anyone else under the table. He's really, really good with his matched set of dwarven axes. He's not so good with darts, though. When he starts playing, duck. &#10;    Eve the Illusionist: Eve defies description, mostly because we don't know what she really looks like. Her powers of illusion have saved her friends countless times from the extremely gullible monsters of the deep dungeon. She's been known to use her skills on her fellow party members when she gets bored. &#10;    Fleck the Bard: Fleck is a dashing half-elf, ready with a smile or a song. His heroic tales and stirring lute-playing raises his friends' spirits, filling them with courage as they face the horrors of the deep dungeon. Fleck is always up for carousing, no matter the day or night. All the girls think he's so dreamy. &#10;    Gog the Half-Ogre: A hulking brute from the flinty mountains who unfortunately doesn't know his own strength. He's not the brightest torch in the dungeon, but he's a nice guy and he tries hard. Never, ever dance with Gog.&#10;&#10;&#10;",
        "artist": "Rose Besch,Cold FuZion Studios,Kennon James,Doug Kovacs,Rhonda Libbey,Beth Trott"
    },
    {
        "name": "Zombie in my Pocket",
        "description": "There are two versions of Zombie in my Pocket, go to Zombie in my Pocket for the 1-8 player Cambridge Games Factory version.&#10;&#10;Zombie in my Pocket is a print-and-play game solo game (see the files section below). The game is free, fits in your pocket, and the modular board combined with the development cards make it a different game every time.&#10;&#10;In Zombie in my Pocket, you're searching for the secret of the evil temple where you can find the item to destroy the zombies rising from the dead. You can pick up items to bash zombies along the way; a machete, golf club, chain saw, or even your former uncle's grisly femur.&#10;&#10;Find the zombie totem, then bury it in the backyard graveyard before midnight and you've saved the world. Otherwise, you're zombie food.&#10;&#10;Zombie in my Pocket (PnP) by Jeremiah Lee is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 3.0 Unported License. Share, re-theme then share, gift, re-make, but don't sell or make non-paper versions without asking.&#10;&#10;&#10;&#10;&#10;    &#10;        &#9;&#9;&#10;&#9;&#9;&#10;&#9;&#9;&#10;&#9;&#9;&#10;&#9;&#9;&#10;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#10;&#9;&#9;&#10;&#10;    &#10;&#10;&#10;",
        "artist": "Carol LaGrow,Kwanchai Moriya"
    },
    {
        "name": "Time's Up! Édition purple",
        "description": "Time's up! edition Purple adds a 4th round (the pose) to the classic Time's Up game, but can be played as a stand-alone game.&#10;&#10;The game has an edition for European players, and another one for Quebec players, each edition having different celebrities.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Mwahahaha!",
        "description": "Mwahahaha! is a resource management card game of Mad Scientists and Global Domination for 2-5 players. You assume the role of an evil genius who builds a criminal empire and constructs a doomsday device with which to cow a trembling humanity. But you're not the only one with grand machinations. Other players rival you for absolute mastery. He who completes his device first and collects the highest ransom is declared the winner &mdash; and ruler of the world!&#10;&#10;Players choose the doomsday device that they intend to build - keeping it hidden from their opponents until they are ready to unleash it on an unsuspecting humanity. They build up the resources needed to activate the machine by playing and drawing cards whilst using minion cards to steal resources from other players and protect their own.&#10;&#10;Once a player's device is ready they can threaten a city with it. If the city surrenders the player will gain resources towards building the next stage of their machine. If the city refuses to surrender then the player has to choose the humiliation of backing down or to activate the machine - thus destroying it.&#10;&#10;Each stage of the machine has a grander target, the winner is the player who forces the whole world to surrender.&#10;&#10;",
        "artist": "Mike Chaney,Casey Edwards"
    },
    {
        "name": "Der schwarze Pirat: Das Duell",
        "description": "A stormy, westerly wind buffets the vessel of the black pirate towards a treasure island! The notorious Vladimir Windjammer, however, has already pillaged the treasures ... and positions his cannon.&#10;&#10;Contents:&#10;2 pirate vessels&#10;2 cannons&#10;4 cannon balls&#10;2 sets of bellows&#10;2 pirates' islands&#10;10 treasure tiles&#10;1 wind die&#10;1 set of game instructions&#10;&#10;NOTE: Does not require a copy of &quot;The Black Pirate/Der Schwarze Pirat&quot; to play.&#10;&#10;",
        "artist": "Guido Hoffmann"
    },
    {
        "name": "Say Anything",
        "description": "Say Anything is a light-hearted game about what you and your friends think. It gives you the chance to settle questions that have been hotly debated for centuries. For instance, &quot;What is the most overrated band of all time?&quot; or &quot;Which celebrity would be the most fun to hang out with for a day?&quot; So dig deep into your heart or just come up with something witty - this is your chance to Say Anything!&#10;&#10;How to Play&#10;1) Ask a question from the card you draw.  For example:&#10;- If you could have a &quot;BIG&quot; anything, what would it be?&#10;- What's the most important invention of the last century?&#10;- Which website would be hardest to live without?&#10;- What's the best activity for a first date?&#10;- What's the worst thing to say to a cop after getting pulled over?&#10;&#10;2) Everyone else writes an answer and throws it face-up on the table as fast as possible.  No duplicate answers are allowed!&#10;&#10;3) Secretly choose your favorite response using a genuine state of the art SELECT-O-MATIC 5000: &#9;&#9;&#10;&#9;&#9;&#10;&#9;&#9;&#10;&#9;&#9;&#10;&#9;&#9;&#10;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#10;&#9;&#9;&#10;&#10;4) Everyone else has two betting tokens to bet on which answer you chose.  They can bet both tokens on one answer or split them between two different answers.&#10;&#10;Who Will Like This Game?&#10;Say Anything is a pure party game.  It was designed to get a party started as quickly as possible by prompting people to talk about interesting things and to make ridiculous statements.  If you are looking for great social interaction and lots of laughs, then you will probably enjoy playing Say Anything.&#10;&#10;History&#10;Say Anything was designed by Dominic Crapuchettes &amp; Satish Pillalamarri.  It was first work-shopped by game designers at Protospiel 2004 and refined at Protospiel 2005, PowWow 2005, the GoF 2005 - 2007, and weekly game nights at the Looney Labs.&#10;&#10;",
        "artist": "Jacoby O'Connor"
    },
    {
        "name": "Monkey Dash",
        "description": "The rules of 'The Bendy Banana Company' clearly state: &quot;Absolutely NO monkeys are allowed in the Warehouse&quot;, but as co-supervisor you were sure that the rules didn't apply to you. Now The Boss is coming for an impromptu inspection, so you must race against your opponent to be the first to retrieve your Monkey and return it to your Loading Bay, before The Boss arrives!&#10;&#10;Monkey Dash is a two player strategy game, in which players spend action points to move their Supervisor and Monkey, and to manipulate the Banana Crates to build a pathway across the board.&#10;&#10;The game requires you to employ a wide range of tactics, constantly modify your plans to balance offensive and defensive play, based upon the actions of your opponent.&#10;&#10;Two variants ship with the game: Pure Skill, removes all luck from the game, and Advanced, introduces a new banana skin playing piece, adding a new twist to the game.&#10;&#10;Monkey Dash launched at the UK Games Expo 2009, where it received the public vote for Best New Strategy Game.&#10;&#10;",
        "artist": "Rob Fisher"
    },
    {
        "name": "Trivial Pursuit Deluxe",
        "description": "Every card contains two easy, two medium and two hard questions. Your die roll decides, what difficulty level question you will get! If you answer correctly, you may throw the die again, but you also get to advance on a bonus track, where you get to steal points from your opponents, you get easier questions ect. The die roll resolves your destiny ... but your own knowledge seals it!&#10;&#10;In Finnish: Jokainen kortti sis&auml;lt&auml;&auml; kaksi helppoa, kaksi keskivaikeaa ja kaksi vaikeaa kysymyst&auml;. Nopanheittosi ratkaisee, mink&auml; tasoisen kysymyksen saat! Jos vastaat oikein, saat heitt&auml;&auml; noppaa uudelleen, mutta p&auml;&auml;set my&ouml;s etenem&auml;&auml;n bonusradalle, jolla p&auml;&auml;set varastamaan pisteit&auml; vastapelaajilta, saat helpompia kysymyksi&auml; jne. Nopanheitto ratkaisee kohtalosi ... mutta oma tiet&auml;myksesi sinet&ouml;i sen!&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "Whoowasit?",
        "description": "In Whoowasit?, players must find the magical ring that was stolen from the wise king by the evil wizard. Playing against a running clock, players move their playing pieces through the various rooms on the game board to uncover clues to who stole the precious gem. Along the way, talking animals help players solve the mystery of the stolen item with the help of a treasure chest that randomly supplies clues on behalf of the animals. Whenever players meet animals, they must feed them so the animals &mdash; that can only be understood by children &mdash; can provide the clues that advance gameplay. The clues supplied by the electronic treasure chest ensure that no two games are alike. All players must work together to find the stolen ring, and they win or lose as a group, depending on whether they can master an assigned task.&#10;&#10;Whoowasit? is the third electronic game by Reiner Knizia published by Ravensburger Spieleverlag GmbH.&#10;&#10;",
        "artist": "Graham Howells,Walter Pepperle"
    },
    {
        "name": "Flippin' Frogs ",
        "description": "From the publisher: Players must use the Lily Pad Launchers to spring their frogs toward the rotating tree to see who stays and who falls.  Whoever has the most frogs left in the tree wins that round. Includes 24 frogs, 4 launchers, base, tree trunk with tree top and 4 tree limbs and instruction sheet. Requires 3 &quot;AA&quot; batteries.&#10;&#10;The flexible, rubbery plastic frogs are shaped to hang easily from the tree branches, but when the branches pop up, these little amphibian friends tend to go flying.&#10;&#10;The brown tree trunk and blue game base are made with a sturdy, durable plastic. The green branches are made lighter for extra spring when the frogs land -- and when time is up. The lily pad-shaped catapults work really well -- so well, in fact, they'll fly too if you don't hold them down with a finger.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Battle Above the Clouds",
        "description": "(from MMP's website :)&#10;&#10;Battle Above the Clouds is the 8th game in the award-winning Great Campaigns of the American Civil War (GCACW) series. This is the first game covering a western theater campaign and will serve as the core area for a series of maps covering the entire corridor from Nashville, Tennessee to Atlanta, Georgia. The game includes both the Chickamauga campaign of August/September, 1863 and the Chattanooga campaign of October/November of the same year.&#10;&#10;Battle Above the Clouds uses the same GCACW Standard Basic Game Rules that were first published in MMP's Skirmisher magazine and Grant Takes Command. The game scale remains unchanged for the western campaigns, although two new terrain types (hills and ridges) have been added to properly represent the rugged terrain that dominates the Chattanooga area.&#10;[...]&#10;&#10;Battle Above the Clouds includes a wide variety of engagements in the Basic Game scenarios. The seven actions include two introductory scenarios, a cavalry raid, a fighting withdrawal, a series of operational maneuvers through mountainous terrain, and two large battles:&#10;    -McLemore&rsquo;s Cove (4 turns, September 10-13, 1863)&#10;    -Crossing Chickamauga Creek (1 turn, September 18, 1863)&#10;    -The Battle of Chickamauga (3 turns, September 18-20, 1863)&#10;    -Wheeler&rsquo;s Raid (8 turns, September 29-October 6, 1863)&#10;    -Opening the Cracker Line (1 turn, October 28, 1863)&#10;    -Lookout Mountain &amp; Missionary Ridge (2 turns, November 24-25, 1863)&#10;    -Ringgold Gap (2 turns, November 26-27, 1863)&#10;&#10;The two Advanced Game scenarios cover both major periods of campaigning in the region:&#10;    -The Chickamauga Campaign (32 turns, August 29- September 29, 1863)&#10;    -The Siege of Chattanooga (40 turns, October 28-December 6, 1863)&#10;&#10;The Advanced Game rule set has also been standardized so players will be able to quickly move to new campaigns in the series.&#10;&#10;Game Scale:&#10;Turn: 1 day&#10;Hex: 2000 yards / 1.15 mile&#10;Unit: Regiment to Division&#10;&#10;Battle Above the Clouds contains:&#10;    -GCACW Series Rules Booklet (approx 24 pgs)&#10;    -BATC Specific Rules Booklet (approx 48 pgs including scenarios/designer notes)&#10;    -Two 22&quot;x32&quot; full-color mapsheets&#10;    -A full-color 11&quot;x17&quot; Off-Map Display&#10;    -Two full-color Force Displays&#10;    -Three Countersheets&#10;    -Two 4-page color Charts and Tables&#10;    -Two 6-sided Dice&#10;&#10;",
        "artist": "Nicolás Eskubi,Charles Kibler,Mort Künstler"
    },
    {
        "name": "LeCardo",
        "description": "LeCardo is an exciting game that tests players' skill in adding words together to form compounds.  But that's not all: like all the best strategy games, players need to think several moves ahead in order both to maximize their scores and to frustrate their opponents.&#10;&#10;Each player starts with a hand of seven cards, all with different words on.  You play a card which is  placed next to cards in play to create compound words or phrases - as read down, or left to right.  The scores are the sum of the two cards - or more cards if in play.  You then draw a replacement card, keeping seven in hand.  The game ends when one player has played out their hand, or no player can play.  All remaining cards in hand are then deducted from the scores.&#10;&#10;",
        "artist": "Hugh Marshall,Priscilla McIntosh"
    },
    {
        "name": "Tulipmania 1637",
        "description": "The tulip, a flower native to central Asia, created quite a ruckus upon reaching the shores of Europe in the mid-1500s. When a virus attacks a tulip, the resulting colour patterns can be stunning, but the same virus weakens the tulip and makes reproduction a challenge. These rare tulips have always been quite expensive, even to this day. Many associate Tulipmania with these rare, high-priced tulips, but scholars report that this first bubble market, where buyers pay far more than something is physically worth because of the resale value, actually stemmed from the common tulip market over December 1636 and January 1637.&#10;&#10;The Dutch, well-known for their trading prowess, were the centre of the tulip trade. During this time, the bubonic plague was killing off 1 out of every 7 people per year, so the common man saw little reason not to invest foolishly with a chance of making a substantial profit. These conditions created a situation where the prices of tulips skyrocketed by the day, until the prices hit a point that could not be sustained. The wily investors knew when to sell off, so those who profited most are those who sold just as the market started to turn sour.&#10;&#10;You are playing one of those wily investors. You have a network of buyers and colleagues, all of whom are also trying to become wealthy. Your goal is to make smart investments, artificially raise prices, fleece your network at the best time, and then make your escape from Tulipmania with the most money.&#10;&#10;Online Play&#10;&#10;&#10;    JKLM Online (Real-Time and Turn-Based)&#10;&#10;&#10;",
        "artist": "Charlie Paull"
    },
    {
        "name": "Omega Centauri",
        "description": "Two millennia ago, a loose federation of planets combined to form the Galactic Empire. From that small beginning, the Empire ruthlessly expanded, enslaving or exiling all races that were a threat to their dominion. Recently, the Empire has suffered revolts from conquered races, and on the barren galactic rim, the exiled races gather their forces to strike at the weakened Empire. As the Empire's might and influence wane, a new era is dawning. Which new race will ascend to power?&#10;&#10;Omega Centauri is a game of galactic empire building for 2 to 4 players. The play map is made up of sector tiles, and at the beginning of the game the majority of the map is Empire-controlled resource sectors. A variety of map layouts are included and the size of the map depends on the number of players. During each round of play, you have the opportunity to perform three of five possible actions:&#10;&#10;&#10;     Assemble (place your fleets into sectors with shipyards)&#10;     Build (build monuments, construct shipyards, and erect planetary defenses)&#10;     Move (move fleets into a sector or out of a sector)&#10;     Politics (gain resources or increase your fleet capacity)&#10;     Research (select an available technology)&#10;&#10;&#10;In the base game, players take turns each round selecting and executing one action at a time until each player has taken three actions, then a new round begins. The base game offers a compelling mix of strategic planning and tactical play, as players must balance their long term goals for development and for technology acquisition with the need to take advantage of the opportunities that arise during action selection.  The base game provides a streamlined 4x experience that can be completed in about an hour.&#10;&#10;The advanced game differs from the base game in several important respects. First, the advanced game introduces improved technologies, racial powers, and other elements to provide a more complex and flavorful gaming experience. It also requires players to select all three of their actions (and the order that they will be performed in) at the start of every round. Thus, to succeed, you must carefully plan your turn, anticipate your opponents' actions, and more successfully execute your overall strategy. Reserve Fleet Actions are added, giving an important boost and a use for spare fleets, through these (and spending valuable resources) players can take an extra action. Finally, through the Politics Action, the full game allows players to select goals that award victory points at the end of the game based upon how well the player has carried out a specific agenda. The full game provides an epic 4x experience in around two hours with variable powers, advanced technologies, and numerous paths to victory.&#10;&#10;Throughout the game, you will be compelled to make important decisions regarding how to advance your civilization: Will you focus on obtaining technological or cultural superiority, or will you build an invincible armada to crush those who stand in your way? The winner of the game will be the player who has accumulated the most victory points at the end of the final round of play. Omega Centauri offers players many routes to victory, and you can accumulate victory points (VPs) by wresting control of sectors of space from the Empire (or from other players), by improving your infrastructure and planetary defenses, or by expanding your cultural influence. The player with the most VPs at the end of the final round is deemed to have ascended and established the new dominant Empire in the galaxy.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Yavalath",
        "description": "Yavalath is an abstract strategy game for two players. Players strive to make a straight line of 4 pieces of their colour, but lose if they make a line of 3 before doing so.&#10;&#10;The board (a hexagon 5 spaces on a side) is initially empty. Players take turns placing a piece of their colour on an empty cell.&#10;&#10;Yavalath was invented / discovered by a game-generating computer program developed by Cameron Browne as part of his Ph.D. research.&#10;&#10;",
        "artist": "Néstor Romeral Andrés"
    },
    {
        "name": "Panzer Grenadier: Elsenborn Ridge",
        "description": "From the Avalanche Press website:&#10;&#10;In late December, 1944, German armies rolled into the wooded hills of the Ardennes in eastern Belgium, striking a final blow against the American troops forcing their way toward German territory.  Panzer Grenadier: Elsenborn Ridge covers the fierce fighting on the &quot;north shoulder&quot; of the Battle of the Bulge between the American First Army and the German Sixth SS Panzer Army and Fifth Panzer Army. The heroic stand at St. Vith by 7th Armored Division, the &quot;panzer graveyard&quot; of Krinkelt, the destruction of 1st SS Panzer Division &mdash; it's all here, and more.&#10;&#10;Elsenborn Ridge is a stand-alone game in the Panzer Grenadier series: You do not need any other game in the series to play any of the 35 scenarios. These include fierce tank battles and infantry actions, including the failed drive of Jochen Peiper's battle group toward the Meuse River, 3rd Armored Division's destruction of 2nd SS Panzer Division, the American stand along Elsenborn Ridge and the collapse of the 106th Infantry Division.&#10;&#10;Pieces include American paratroopers, German Tiger II tanks, American P47 fighter-bombers, German &quot;Nebelwerfer&quot; rocket launchers, and much more. Both German regular army and Waffen SS troops are present. There are four semi-rigid mapboards, created by artist Guy Riessen.&#10;&#10;The 2015 printing of Elsenborn Ridge sports a new cover, and includes the Panzer Grenadier Fourth Edition rules.&#10;&#10;",
        "artist": "Guy Riessen"
    }
]