[
    {
        "name": "Modern Naval Battles",
        "description": "Modern Naval Battles is a novel card game for two to six players, based on present day sea power. The games is played in &quot;rounds,&quot; with players taking turns to maneuver the ships in their fleets, attack opponent&rsquo;s ships, and defend their own fleet against enemy attack. At the end of each round, players receive points for each enemy vessel they have sunk. The game can end when a player achieves a specific point total, or when all opposing fleets are sunk.&#10;The game is of medium complexity. There are two expansion sets, Modern Naval Battles II: The Campaign Game and Modern Naval Battles III.&#10;&#10;Expanded by:&#10;&#10;    Modern Naval Battles II: The Campaign Game&#10;    Modern Naval Battles III&#10;&#10;&#10;&#10;&#10;The revised re-released game consists of six modules:&#10;&#10;&#10;    Cold War Naval Battles (CWNB)&#10;    CWNB II Action!&#10;    CWNB III: Reinforcements!&#10;    CWNB IV: The Air Module&#10;    CWNB V: The Campaign Game&#10;    CWNB VI: Sister Ships&#10;&#10;&#10;This game has been revised and renamed as Cold War Naval Battles and re-released (by the designers) in PDF format (free for personal, non-commercial use). The PDF files are available from:&#10;http://relativerange.pancakeapps.com/Relative_Range/Cold_War_Naval_Battles.html&#10;&#10;Printed sets can also be purchased from the Relative Range site.&#10;&#10;The re-release of the expanded game system, under a new name, probably deserves a separate entry into the BGG database.&#10;&#10;A simpler version with a SciFi-theme is Star Force Terra #1: Contact!&#10;&#10;",
        "artist": "Rodger B. MacGowan"
    },
    {
        "name": "Mosby's Raiders",
        "description": "Mosby's Raiders puts you in command of the Partisan Rangers. Your mission is to infiltrate enemy lines to disrupt the Union war effort. As you succeed in your operations, your notoriety grows and the Union devotes additional troops to stopping you. You select the Union targets for your raids and decide which actions Mosby's Raiders will perform. You may be deep inside Union lines when the Union Army is alerted by your activities and begins to pursue your band.  As more Union troops join in the chase, you must either try to escape or stop to take on the Union units in combat. Events beyond your control may lead to Union sweeps that diminish your Confederate support or you may find yourself gaining unexpected reinforcements.&#10;&#10;",
        "artist": "Ted Koller,James Talbot"
    },
    {
        "name": "Open Fire",
        "description": "Open Fire is the solitaire game of combat, adventure, and heroism for everyone who ever wondered what World War II armored combat must have been like. Inspired by the award-winning Ambush! solitaire game system, Open Fire provides the player with a platoon of American armor, faced with a variety of missions against an ever-changing German foe. The variable events, innumerable tactical options, and wealth of unexpected occurrences make Open Fire a game unlike any tactical armor game you have ever played before. The easily learned rules are designed to get the player into action quickly, selecting his platoon and vehicles and providing each unit with command and initiative ratings, perception, weapon skill, driving skill, and movement capability. After selecting one of the six missions provided, you will send your platoon into operations, where your vehicle will move as you wish... until the sequenced action rounds are triggered by the shriek of an incoming 88mm anti-tank shell, and then the fun begins.&#10;&#10;Contents:&#10;210 Counters (1 Large Sheet)&#10;1 22&quot; x 32 &quot; Map&#10;1 Rules Booklet&#10;1 Paragraph Booklet&#10;79 Unit Characteristics Cards&#10;1 Mission Cartridge&#10;1 Cartridge View Sleeve&#10;1 Platoon Record Sheet Pad&#10;1 8&quot; x 22&quot; Display Sheet&#10;2 Decimal Dice&#10;1 Counter Storage Tray&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Ultimate Golf",
        "description": "Golf simulation board game which focuses on the tactical aspects of golf (club selection, shot strength, shot direction, etc.).  Hooks/slices and distance hit are determined by dice rolls.  Has specialty shots for chipping, bunkers, recovery shots, etc.  Nine double-sided boards recreate 18 holes from famous golf courses around the world.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Naval War",
        "description": "Players control a task force of historic WWII Ships.  The object is to sink 100 points worth of the other player's ships.  The game comes with 2 decks of cards: The Ship Deck contains 54 cards and the Play Deck contains 108 cards.  The Play Deck contains ammunition for your ships.  Ammunition must match the gun sizes of your ships to be usefull.  Other cards in the Play Deck are: smoke screen, repair cards, additional damage, sub attack, mine field, mine sweeper additional ship cards and the dreaded destroyer squadron card. This game is rated 1 (easy) on the AH complexity scale of 1 to 10.&#10;&#10;Expanded by:&#10;&#10;    Cards at Sea (VAIPA Express)&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Peloponnesian War",
        "description": "Peloponnesian War lets you chart the destiny of the war. This strategic game of ancient warfare allows the player, with a unique new solitaire system, to try an accomplish a lasting peace. All existing solitaire systems on the market have the player take one side for the entire game. Unfortunately this pits the player against a random system with poor strategic direction. In Peloponnesian War you get to play both sides, pitting yourself against the best you can offer. If the game system is winning, the player is forced to continue with the losing side. Success, on the other hand, will eventually force the player to change sides and recover the losing side's fortunes. The duration of the war and the player's performance determine victory. In this manner the player competes against himself in the classic tradition of the Greek tragedy.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Carrier",
        "description": "Carrier is a solitaire simulation of both historical and hypothetical carrier battles in the Southwest Pacific Theater during the hotly-contested naval campaigns of 1942 and 1943. As the U.S. commander, you maneuver your task forces and conduct air searches in a tension-packed contest to find the Japanese carriers before they locate and attack yours.  Simple game mechanics control Japanese movement and determine the timing and strengths of their attacks. You will not know that a Japanese air strike is headed your way until it actually appears in the skies above your task force. Once the enemy has been located, you face the very same, real-life, tactical dilemmas as your historical counterparts.&#10;&#10;Contents:&#10;1 22&quot; x 32&quot; Map&#10;780 Counters (3 Sheets)&#10;1 Rules Booklet&#10;2 Charts and Table Cards&#10;2 Charts and Table Screens&#10;1 Ten-sided Die&#10;1 Counter Tray&#10;&#10;",
        "artist": "Ned Schatzer"
    },
    {
        "name": "Elements",
        "description": "Another little card game from the designer of Traitor and Mutineer. Based around the five elements; earth, air, fire, water, and ether.&#10;&#10;First the players determine the order of the elements, in order to favour the suits in which they are strong. Then they try to win points by playing the best combinations of cards from their hands. But if they spend too many cards without winning, they may go away empty handed.&#10;&#10;",
        "artist": "Marcel-André Casasola Merkle"
    },
    {
        "name": "Tokyo Express",
        "description": "Tokyo Express is a solitaire and two-player simulation of the night naval battles off Guadalcanal.  In the solitaire version, you command the US fleet, awaiting the emergence of the Tokyo Express from the darkness.  You group your ships into formations, assigning them orders, and select the targets to attack with torpedoes and guns.  Simple mechanisms control Japanese maneuvers and target assignments in a realistic manner.  You never know when combat will occur until the explosion of torpedo salvos signals the presence of Japanese forces who detected you first and made their surprise attacks.  The two-player version modifies the solitaire game and pits players against each other in an exciting recreation of World War II naval combat.  Tokyo Express is graduated in complexity to help you learn the rules as you play.&#10;&#10;",
        "artist": "Ted Koller"
    },
    {
        "name": "The Challenge",
        "description": "&#239;&#187;&#191;The Challenge is an innovative card game of deadly combat and formidable magics. Action is fast paced and tension-filled as characters exchange blows, fire spells, and even attempt to backstab. It is the fantasy battle at its best. &#10;More than simply hack and slash, strategy IS the key to victory, with cunning and skill playmg a central role in your success. Game play is an exercise in diplomacy and subterfuge, as &#239;&#187;&#191;treaties and trickery can make all the difference between victory and defeat. &#10;While The Challenge is easy to learn (start playing in less than 15 minutes), it has a depth far beyond that of the typical card game. With its excitment filled, strategy oriented, fullthrottled action, The Challenge is sure to become a classic. If you always loved combat the best ... take The Challenge.&#10;&#10;Sequence of Play:&#10;&#10;The player who rolled the high die goes first. Play moves clockwise around the table. The player can either challenge an opponent, pass, or declare a defensive turn.&#10;&#10;&#239;&#187;&#191;1) Challenge another character by using a Weapon Action Card, casting a spell (Advanced), using a magic item (Advanced) or using a thief skill (Advanced) from one of your characters against another character in another party. Both Character Cards involved are turned face-up (if they are not already). Then the defending player may retaliate with any appropriate card or pass. The challenging player may then continue by playing an appropriate Action Card or passing, followed by the defending player, etc., until both players have passed or one of the two characters involved in the challenge has died. After the challenge is resolved, the player whose tum it is can move one of his characters from one rank to another, discard any number of Action Cards, and draw from the Action Deck(s) until he has seven cards. The player that was defending in the challenge cannot discard, but can refill his hand up to seven. It is then the next player's tum.&#10;&#10;&#239;&#187;&#191;2) Pass - Do no actions, moving of characters, or discarding of cards.&#10;&#10;&#239;&#187;&#191;3) Defensive turn - You can't play any Action Card that directly affects another party. Play party Defensive Cards (Advanced), allocate Magic Cards (Advanced) to characters, move any number of characters from one rank to another, discard any number of Action Cards, and draw up to seven cards from either the Weapon Action deck or the Mystic Action deck (Advanced). Remember, you can't do two defensive turns back-to- back.&#10;&#10;",
        "artist": "Chris Adams,Nicole Lindroos,Richard Thomas (I),Joshua Gabriel Timbrook"
    },
    {
        "name": "Intern",
        "description": "&quot;Now YOU are the physician!&quot;&#10;&#10;A sorta Monopoly clone that is setup in a hospital.   Each player is an intern trying to admit patients, diagnose them correctly, treat them and then discharge them from the hospital.  Instead of money, the interns try to collect hours of sleep (worth more than money in the hospital).  Interesting if you are in the medical field, maybe not otherwise.  Better than Medical Monopoly, anyway...&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Spy vs Spy",
        "description": "The object of the game is to build tunnels to bombs and bring them back to your home base.&#10;&#10;The bombs have various effects hidden on their base.  The tunnels are built through tile laying, so each player (best played with four) digs furiously from his manhole in the corner towards the bombs, hoping to reach 'em first.  If you connect tunnels, then you'll be able to try to steal another player's bomb before he brings it home.&#10;&#10;The basic turn goes like this:&#10;&#10;First, you move your pawn to another tunnel tile.&#10;Second, if you ended up or started on a bomb, test (with a special die) to see if it blows up.&#10;Third, draw a tunnel tile (you have a hand of four) and play one.&#10;Finally, if you get a bomb home safely, read its message.&#10;&#10;In addition to the tunnel tiles, there are white, black and grey spy tiles.  They are used to block tunnel tiles (each tunnel tile has a little black or white spy drawn in its middle, so you can play a White Spy only on black tunnel tiles and vice-versa; the Grey Spy can be played on either).&#10;&#10;",
        "artist": "Antonio Prohias"
    },
    {
        "name": "Red Empire",
        "description": "Each player is given a different assortment of cards representing leaders and other important figures in the Soviet Union.  As various catastrophes arise, players must cooperate to prevent the Union from collapsing even though they are constantly competing with each other in efforts to maneuver one of their own characters into the role of president.  This combination of competition and cooperation makes for an interesting game full of player interaction.&#10;&#10;",
        "artist": "Tim Bradstreet"
    },
    {
        "name": "Unexploded Cow",
        "description": "Europe. Summer 1997. You and your most creative friends have discovered two problems with a common solution: mad cows in England and unexploded bombs in France. You've decided to bring these two powder kegs together just to see what happens &ndash; and you wouldn't say &quot;no&quot; to a little money on the side, so round up your herd, march them through France, and set them loose behind the Cordon Rouge. If you're lucky, you'll come home rich before Greenpeace gets hold of you.&#10;&#10;Either way, there's something magical about blowing up cows.&#10;&#10;Unexploded Cow is a money game in which players are trying to collect enough points to win the pot. On every turn, you will buy cows and pay for special effects by putting money in the pot, then try to discover bombs with your own cows in an effort to take money out of the pot. All along, you will be earning points from the French as you liberate town after town from the terrors of unexploded bombs, and the player who scores the most points gets whatever's left in the pot.&#10;&#10;Unexploded Cow is best played as a series of short games, each of which takes about thirty minutes. The game is quite simple and very chaotic: You'll have a blast.&#10;&#10;",
        "artist": "Mike O'Connor,Cheyenne Wright"
    },
    {
        "name": "Whodunit",
        "description": "A suspenseful mystery game for super sleuths. Players snoop through an elegant mansion searching for clues that will identify suspects to the crime. Each player tries to outsmart his opponents and be the first to discover &quot;whodunit&quot;. But if a player falsely accuses an opponent he must leave the mansion. At the end, the player with all the correct clues solves the crime and is declared the winner.&#10;&#10;Includes gameboard, 1 card deck of each: whodunit, motive, scene, weapon, suspect, and detective, 1 pad of detective sheets, 20 clues and alibis, 6 pawns, and 2 dice&#10;(First and second editions differ in the cards each game has. The first edition includes 10 suspect cards and 44 Whodunit cards for a 54 card total. The second edition has separate card stacks for each of the categories as listed above.)&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Spoons",
        "description": "You pull from a regular deck of cards 4 of a kind for each person playing. Shuffle those all together and deal them out so each person has 4 cards. They can't look at them until the game starts though. Place spoons on the table (enough for all except one player). Position them fairly, so each person pretty much has the same chance to grab one. You have one person (this job rotates hand to hand) start calling out 'pass'. How you pass is to select one card from your hand, put it on the table face down next to the person on your right, then you pick up the card the person on your left put down. You keep doing this until 1) you get 4 of a kind or 2) someone else gets four of a kind. At this point you grab a spoon, and the person who doesn't get a spoon gets a 'pig' point. Once you get 3 pig points you are a hog. If you are a hog you have lost, but you can still be part of the game. Hogs can talk to game players, but if a game player talks to a hog they get a pig point. Of course the winner is the person left when everyone else is a hog.&#10;&#10;",
        "artist": "Janique Crépeau"
    },
    {
        "name": "Gladiator",
        "description": "Prior to publication by Avalon Hill, Gladiator was part of the two-in-one Battleline game Circus Maximus.&#10;&#10;The savage splendor and pageantry of ancient Rome lives again in this game of man-to-man gladiatorial combat. Each player assumes the role of one of a matched pair of gladiators pitted in a contest of arms to the death. Superbly trained and equipped for the sole purpose of entertaining the citizenry with their life and death struggles, each man must fight with all the skill  he can muster for his very survival. There is no question of bravery in the arena. It is kill or be killed and each man must muster all the skills and cunning he can summon in this most desperate of battles for survival. There can be only one victor in the arena and no second chance for the loser. For missus can be granted the fallen only at the whim of the emperor. And all too often mercy takes the form of a quick end on an opponent's blade. Let the games begin!&#10;&#10;",
        "artist": "Cathy Chastain,Dale Scheaffer,Mark Wheatley"
    },
    {
        "name": "Little Round Top",
        "description": "Little Round Top is an Avalon Hill game from 1979 for two players which recreates this critical battle.&#10;&#10;During a typical game turn, both players move their company sized forces over a map of the battle area, positioning them for rifle fire and bayonet charges. Fire and melee combat are resolved by a die roll on the appropriate Combat Results Table. Regimental officers and their command abilities are crucial for keeping the attack moving forward or the defense intact.&#10;&#10;It comes with a colorful map of the battlefield, 100 cardboard playing pieces, and a short rules booklet.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Legend of Robin Hood",
        "description": "One of the most well-known tales in the history of literature comes alive in Avalon Hill's new strategy game for two players, The Legend of Robin Hood. The setting is 12th century England, before the signing of the Magna Carta, as the daring outlaws of Sherwood Forest oppose the Sheriff of Nottingham, Sir Guy of Guisbourne, and the evil Prince John. In the absence of King Richard, it is a land beset by the oppressions of nobles and clergy whose only concern is their own well-being. As Robin Hood, you must enlist the support of the local populace (including Little John, Will Scarlet, and Friar Tuck) and rob the rich to give to the poor. As the Sheriff of Nottingham, you must insure the safe passage of the wealthy through the area, tax local villages to raise money, capture and hang the outlaw leaders, and help to prevent the return of good King Richard from the Crusades.&#10;In a typical Game-Turn, Robin Hood will move his forces from area to area, trying to best position them for recruiting new units and ambushing travelers passing through Sherwood Forest. The Sheriff Player will position his forces in an attempt to protect the travelers and possibly trap and capture the outlaws. Battles occur when both Players have forces in the same area, and are resolved by die rolls representing Archery and Melee Combat.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Hundred Days Battles",
        "description": "Hundred Days Battles is Avalon Hill's strategy game for two or three players which recreates the climax of the Hundred Days Campaign. The division sized units of both sides are represented on the map by leaders who command their corps and army formations. Leaders march, force march, and influence combat according to their individual abilities. Combat is resolved by rolling a die on the Combat Results Table. To win, the French must exit units off the map towards Brussels, or destroy the Allied armies. The Allies win by preventing French victory.&#10;&#10;",
        "artist": "Larry Catalano,Dale Scheaffer,Bruce Shelley,Elizabeth Thompson, Lady Butler"
    },
    {
        "name": "X-Men: Under Siege",
        "description": "A host of Evil Mutants has taken over the X-Mansion! Now an alert has been sent to all X-Men: return to the mansion and try to regain control! Choose which pair of X-Men - each with an extra ability - will form your team. Then deploy them to the six different levels of the Mansion. Now the strategy begins.&#10;&#10;Do you send your team to different floors so they can cover more ground or do they go together and back each other up?&#10;&#10;Do you join the fight already in progress or do you try to secure another area?&#10;&#10;If one of your team members is wounded, do you let him recover to full strength or do you risk it in the hopes of eliminating one more Mutant?&#10;&#10;Score a point for each room you explore, for each blood chip you get, for each Mutant you capture! After every room on every floor has been explored, the player with the most points wins!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Star Smuggler",
        "description": "Star Smuggler is a solitaire game of tense adventure in the far future. No opponent is necessary, as the Event Booklet takes you through a pre-programmed sequence of encounters which is different each time you play the game. For each event, you, as star smuggler Duke Springer, must make the decisions that will make you huge profits - or may cost you your life.&#10;&#10;Additional box copy: &quot;You know all the tricks, dirty or otherwise - all the seedy spaceport bars and the hard-up colonies where they don't ask too many questions.  You live your life one jump ahead of the law.  You're the scum of the Sector - you're a STAR SMUGGLER.&quot;&#10;&#10;A print-and-play version of this game is available for free, authorized download from http://dwarfstar.brainiac.com/ds_starsmuggler.html&#10;&#10;",
        "artist": "Bob Depew,David Helber,Tom Maxwell"
    },
    {
        "name": "Outpost Gamma",
        "description": "Outpost Gamma is a game of science fiction combat for two players. With its unpredictable storms and fast-playing combat system, Outpost Gamma captures the tension and rapid-fire action of high- versus low-technology combat in a hostile environment.&#10;&#10;A print-and-play version of this game is available for free, authorized download from http://dwarfstar.brainiac.com/.&#10;&#10;",
        "artist": "Frank Cirocco,David Helber"
    },
    {
        "name": "Toscana",
        "description": "Toscana has simple rules.  Both players have 16 tiles (which are divided into 8 squares in a 2x4 grid).  The squares show either red roofs or gray plazas.  One set, used by the 'roof' player, has roofs on 6 of the 8 squares on each tile.  The other set, used by the 'plaza' player, has plazas on 6 of the 8 squares on each tile.  Each player shuffles their stack of tiles and places them FACE UP before them.  (Thus you can see what your opponent's next tile will be.)  The tiles will be placed onto a 17x17 board.&#10;&#10;Players alternate placing tiles onto the board with a few placement restrictions:&#10;&#10;1) The first tile must cover the center square of the board.&#10;&#10;2) Later tiles must be placed so that at least one square of the player's color touches a square of the player's color on a previously placed tile.&#10;&#10;The object is to form as large area of connected roofs or plazas as possible by the end of the game.  Each tile you have in this connection scores one point.  There are little 'tiddly wink' markers to aid in this counting process.  Each player tallies the tiles in their largest connected group, and the player with the greatest total wins.  The rules call for two games, with players alternating sides in the two games.&#10;&#10;The only other feature of the game is the veto.  Each player has the opportunity to 'veto' an opponent's tile ONCE per game.  A chip is simply placed atop the tile atop your opponent's stack to indicate that you are 'vetoing' that tile. The tile is placed on the bottom of his stack and will likely never rise to the top during the game.&#10;&#10;The game is VERY easy to learn and plays quickly... 20 to 30 minutes.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Klondike",
        "description": "Each player on their turn draws three wooden marbles from a bag. Black &amp; grey marbles are gravel, yellow marbles are gold nuggets. The player places the marbles on the riddle - a circular aluminum plate - and tries to &quot;pan&quot; the gold. Other players bet on their results, adding a bluffing element to the game. (There are, as well, basic &amp; advanced rules.)&#10;&#10;Ages 6 and up&#10;&#10;",
        "artist": "Doris Matthäus,Renate Seelig"
    },
    {
        "name": "Kula Kula",
        "description": "Blatz has a robust reputation for exceptionally beautiful games, and Kula Kula is the one of their best examples.  A very light game, players simply race around the track collecting shells. Serious gamers will likely be bored, but it does have beautiful bits, a lovely board and real cowrie and puka shells as playing pieces.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Slapshot",
        "description": "Slapshot is a wheeling, dealing game for hockey nuts of all ages. Each participant in Slapshot assumes the role of a team manager. The object is to skillfully manage your team into the playoffs and then win the championship. During the regular season, you will be able to improve your team with trades and drafts. Injuries and luck will play a part, but it is your skill as manager that will guide your team to victory or defeat.&#10;&#10;Contents: 1 gameboard, 54 Player cards, 6 pawns, &amp; the  rulebook&#10;&#10;Phantoms of the Ice and Power Play are subsequent versions of this game with some different rules and new art by Doris Matthaus. Contents vary for these versions as well.&#10;&#10;",
        "artist": "Karim Chakroun,Tom Dalgliesh,Lance Gutteridge,Doris Matthäus,Kwanchai Moriya"
    },
    {
        "name": "UFO: Game of Close Encounters",
        "description": "UFO is a low complexity abstract game themed on an alien invasion of Earth.  The alien player must land 5 of 8 available ships on Earth to win.  The Earth player, with only eight rockets, must defend or perish.  Movement is along orbital paths that form 7 concentric rings around the Earth.  Each player rolls two dice and moves one rocket or UFO the exact count of for each die.  In addition to the UFOs and Earth's rockets speeding around, the moon orbits the Earth destroying all in its path.  Combat is not dice based, rather players capture opponents pieces by landing on them by exact orbital move of one die.&#10;&#10;The advanced game adds dummy counters for the alien player and space stations for additional defence of Earth.&#10;&#10;It feels really more like an abstract strategy game, but Avalon Hill classified as a wargame simulation.&#10;&#10;The game consists of&#10;&#10;-two 8&quot; x 16&quot; map boards with 2 black plastic clips to hold together.&#10;-die cut counters (8 rockets, 5 space stations, 1 moon, 8 saucers, 12 decoy UFOs)&#10;-2 six sided dice &#10;-1 double sided page of rules.&#10;&#10;Avalon Hill Complexity rating - 1&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Spices of the World",
        "description": "Developed in collaboration with a spice company as an &quot;educational game&quot;.  Pretty standard run-around-the-world to get the spices you need...&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Stellar Conquest",
        "description": "First published by Metagaming in 1975 (later in box form in 1979), this is a classic 4X (eXplore, eXploit, eXpand, eXterminate) board game.  Can be adapted for more than four players with extra sets of pieces.  It is also fairly easy to replace the deck of stars with random generation tables.&#10;&#10;",
        "artist": "Winchell Chung,Frank Kelly Freas,Dale Sheaffer,Brian Wilson"
    },
    {
        "name": "Trireme",
        "description": "Here is a thoroughly accurate recreation of Greek and Roman naval warfare in the heyday of ramming and boarding.&#10;&#10;A Tactical Game of Ancient Naval Warfare&#10;&#10;Trireme is actually 15 games in one; fleet and ship to ship games of varying complexity levels plus 11 scenario game, ranging in time-spans of 494 B through 370 AD. &#10;You control individual ships that maneuver to sink or capture the enemy. The &quot;fleet game&quot; is an easy version which uses a fast move system for high playability and quick action. &#10;The more advanced &quot;ship games&quot; use simultaneous movement and much more detail including optional rules for everything from tides and currents to the corvus boardin ramp.&#10; Re-create Great Historical Engagements&#10;&#10;Eleven different scenarios include action in historical battles such as Salamis or Actium, pirate raid, Veneti and Saxon ships, and even a point-system for designing your own battle in either the fleet or ship games.&#10;&#10;Game is played in chess-like fashion. Each player moves all the ships he so desire according to its historical ability. Each ship has &quot;movement points&quot; which reflect its speed per turn. Ships are moved across a playing board of &quot;the sea&quot; which is superimposed with a pattern of hexagons' each hex acting as square do in chess and checkers. Each ship's &quot;movement points&quot; are reflected in number of hexes it can move in any given turn. Battle occurs when ships are moved adjacent, such combat resolved by a unique die-roll combat results system that rewards the player with the greater tactical skill.&#10;&#10;Trireme comes complete with a detailed rule folder that gets you into play quickly. You only have to read 4 pages of a 40-page manual to play the &quot;fleet game.&quot;&#10;Also included are background synopses for all scenarios, plus a detailed &quot;designer's notes&quot; section explaining the historical significance of the game. Be forewarned. you're getting no trumped-up Hollywood extravaganza. You will get an historically accurate, yet quite playable game of ancient naval warfare in Trireme.&#10;Over 225 different ship come with the game, in addition to a plethora of playing aids that make Trireme easy to learn, and exciting to play.&#10;&#10;Components (Avalon Hill edition):&#10;&#10;    one Game Tables Card&#10;    one 40 page rules booklet&#10;    two different Log Sheet Pads&#10;    eight 8 1/2&quot; x 10 1/2&quot; mapboards depicting blue water with an hexagonal overlay&#10;    4 countersheets&#10;&#10;&#10;&#10;&#10;TRIREME is ideal for two players and teams, ages 12 and up.&#10;&#10;(source: back of Avalon Hill edition box and user's description)&#10;&#10;",
        "artist": "John Hagen,Arnold Hendrick"
    },
    {
        "name": "The Siege of Jerusalem (Third Edition)",
        "description": "Published by Avalon Hill in 1989 (for the Third edition).&#10;&#10;(from MMP's web site:)&#10;&#10;It is 70 A.D.  Dawn breaks on the combined might of four Legions arrayed on the heights of Mount Scopus, starting their methodical advance across the valley to the ancient walled city of Jerusalem.  Siege lines have been secured tight about the city.  There is no hope of escape.  The besieged must persist behind their stout walls or perish before a vengeful Rome.  Five grueling years of campaigning in Judea is now culminating in the Siege of Jerusalem.&#10;&#10;But the fortified city defies even the might of Rome.  The thick walls atop the steep slopes literally bristle with natural and manmade fortifications.  It will take all of Rome's considerable engineering skills to winch their war machines into position for an assault up the slopes to the city.  Only here in the north plain can the city's walls be taken by escalade.  The rhythmic approach of the Legions is muted by the rumble of the siege engines as an assortment of towers, rams, and artillery precede the maniples.  The distant walls seethe with the frenzied activity of an alerted populace as the antagonists draw near.  This majestic view is abruptly halted by the blare of trumpets which soon gives way to the cacophony of the clash of arms and screams of the dying.&#10;&#10;Morning turns to dusk before the walls are breached and the weary legions exact their vengeance.  The sky turns bright again, aglow in the reflection of a thousand fires as the northern outskirts burn.  But what price victory?  Another day such as this will break the Roman Army and only one of the city's ten walled sections has fallen this day.  They will have to find another way.  Shafts must be dug to undermine the walls or earthen ramps built with which to scale them.  It will be a long campaign.&#10;&#10;This is The Siege of Jerusalem...An epic battle simulation with all the trappings and majesty of a Cecil B. DeMille film spectacular.  Facing the greatest army of antiquity, the Judeans must rely on the stoutness of their walls to halt the unbeatable Roman legions and therein lies the fascination:  the immovable object vs the unstoppable force.  As Eliezar Ben Yair, leader of the Zealots, you must conduct a skilled defense of the city's ever shrinking perimeter - exacting from the Romans a price so terrible that they will be forced to lift their siege - or break out to continue your struggle for freedom at Massada.  As Titus, commander of the Roman army, you must decide when, where and how to renew the assault - gauging your troop needs against the progress of your siege works and the press of time caused by outside threats.  More than just conducting tactical combat, the Roman must formulate an overall strategic plan for the conduct of the siege.&#10;&#10;Vastly revised from its 1st &amp; 2nd edition printing from Historical Perspectives in the 70's, Siege of Jerusalem now boasts two-sided counters, a continuous combat system, a strategic interphase for conducting the entire siege, and the morale / panic rules so important in portraying ancient warfare.  An Introductory Scenario depicting the abortive assault of Gallus with the XII Legion three years previous allows players to learn how to handle a legion in a single day's play while training for eventual participation in the conduct of the epic siege.&#10;&#10;",
        "artist": "Charles Kibler,George I. Parrish, Jr.,Steve Weiss"
    },
    {
        "name": "Richthofen's War",
        "description": "The Red Baron flies again - now you can actually fly the same airplanes that blazed a path of glory over the skies of France during WWI. You can be Baron von Richthofen running up a score of 80 victories or Cpt. Roy Brown flying the same Sopwith Camel that shot him down in the game where planes perform exactly as pilots of Flying Circus Aerodrome say they did in real life.&#10;&#10;Each player, in complete control of one airplane, attempts to outmaneuver his opponent and mark up a victory on the way to becoming an Ace. Players pick the type of situation that they want to re-flight from one of seven different scenarios, or they can create their own situations from the wealth of information available in the Instructions and Briefing Manual. Each aircraft is unique in its own combination of: operational ceiling, rate-of-climb, diving speed, firepower, and armament. With over 32 different aircraft types to choose from, there are over 1200 possible combinations of opposing aircraft.&#10;&#10;A solo game is only recommended for scenario no. 7 - Balloon Busting.&#10;&#10;Simple rules allow one to start immediately after reading the Basic Instructions. Almost anyone can play the Basic Game, and little time is required to advance to the Tournament and Optional Games. Features 192 counters (which includes 7 blank ones)&#10;&#10;Avalon Hill Complexity Rating - 5&#10;&#10;Expanded by:&#10;&#10;    Richthofen's War Maneuver Cards&#10;&#10;&#10;&#10;&#10;",
        "artist": "Don Greenwood,W. Scott Moores,Randall C. Reed,Thomas N. Shaw"
    },
    {
        "name": "Showbiz",
        "description": "In the game, players take on the roles of theatre managers and must hire performers that will bring in the most money from the public.  There are six different styles of performers, and at different times in the game, public opinion will favour different styles.  Public preference is determined by dealing out cards from a special deck.  The current opinion is always known, and a possible (but not necessarily accurate) forecast of future preferences is also provided.&#10;&#10;Each turn, public opinion changes (sometimes to match the forecast, and sometimes into something completely random), then players use a bidding system to acquire contracts with performers.  Once contracts have been negotiated, profit is calculated depending on how well performers match the public's desires.&#10;&#10;By the time twelve turns have been played (and possibly one or two turns sooner), the game will come to an end and the player with the highest score is declared the winner.&#10;&#10;The game was originally published by the designer in 1985.  Hexagames published a German edition (which is the only one that handles up to 8 players) in 1988.  Avalon Hill published their edition (with very minor changes) in 1990.&#10;&#10;",
        "artist": "George I. Parrish, Jr."
    },
    {
        "name": "Maharaja",
        "description": "Based on the highly successful Britannia, which dealt with the migrations of peoples&#10;into the British Isles from the Romans to the Normans, Maharaja employs much&#10;the same system, transferred to a different geography and time period.  The map depicts&#10;the Indian sub-continent from the foothills of the Himalayas to the island of Sri Lanka&#10;(aka Ceylon, Serendib). The time period covered runs  from the Aryan invasions of 1500&#10;BC to the establishment of the British Raj in the mid-1800s.&#10;&#10;Re-published in French as Maharadjah by Descartes (with new box cover).&#10;&#10;Re-implements:&#10;&#10;    Britannia&#10;&#10;&#10;&#10;&#10;",
        "artist": "Stephen Langmead,Kurt Miller"
    },
    {
        "name": "Moonstar",
        "description": "First was published Corona (1974). Moonstar added planets and variants (variant number 8 is Corona, without sand timer). Orbit is new game from 1993. Harun is not new game, it is a rethemed copy of Moonstar! Finally, Randolph recycled most of the game into his Rasenden Robotern (Ricochet Robots) , although the course mechanism and the objective were completely changed.&#10;&#10;Quite possibly the first &quot;German&quot; game to cross the Atlantic...&#10;&#10;About the game (from the back of the box)&#10;&#10;Moonstar is a game unlike any other game for any number of people. All the action is governed by dice, yet there is no luck involved. The dice simply establish the situation. It is up to the players to act upon it. A game with endless variety.&#10;&#10;Playable by any number of people, from one to a hundred, Moonstar combines numbers calculations, memory, and quick-thinking into a fast-playing, action-packed, exciting contest of pure skill.&#10;&#10;The board represents the twelve constellations (stars) of the Zodiac and the playing pieces represent moons and planets. Each game consists of a number of rounds of play. In each round, the board and playing pieces are first setup by one of the players. Then the dice are thrown. A one-minute auction period begins. Each player may bid any number of times in the auction or not at all. Each bid, however, must be higher than the previous one. When the one-minute runs out, the highest bidder plays that round.&#10;&#10;The play of the round also lasts one minute. A player plays a round by placing one die on each moon on the, board and then moving that moon (and die) a number of stars equal to the number of the die. The die is then removed and the moon may not be moved again. This procedure is followed for each moon. The player must move each moon before the time runs out, or those moons which have not been moved may not move.&#10;&#10;The player's score is then totaled to see if he has made his bid, by scoring a number of points for each moon, depending on which stars and planets they have landed on, If a player makes his bid, he scores a number of points equal to his bid. If he fails, he scores nothing. Rounds are setup and played in this manner until one player has scored enough points to win.&#10;&#10;But this is only the beginning. Moonstar is actually twelve games in one. Game One is simply the Basic Game. Games Two-Twelve each change one or more parts of Game One, or add something to it. They introduce things like challenging bids, side bets, more moons, more dice, different planet values, no planets. and advanced scoring methods.&#10;&#10;Includes:&#10;&#10;    16&quot; x 16&quot; gameboard&#10;    15 moon pieces&#10;    21 planet pieces&#10;    1 minute sand timer&#10;    11 6-sided dice&#10;    rulebook&#10;&#10;&#10;&#10;&#10;Re-implements:&#10;&#10;    Corona&#10;&#10;&#10;&#10;&#10;Re-implemented by:&#10;&#10;    Orbit&#10;    Ricochet Robots&#10;&#10;&#10;&#10;&#10;",
        "artist": "Jean Baer,Margaret Lehman,Mark Wheatley"
    },
    {
        "name": "Knights of the Air",
        "description": "World War I aerial combat game.  Similar to Blue Max (q.v.) but with greater complexity and realism.  Was also adapted to miniatures rules (if only by individual GMs).  Supported by several articles in The General.&#10;&#10;Total counters = 188&#10;&#10;",
        "artist": "Joe DeMarco"
    },
    {
        "name": "Freedom in the Galaxy",
        "description": "First published by SPI and obviously inspired by Star Wars.  Some of the character names are anagrams of SPI employees.&#10;&#10;Freedom In The Galaxy is a medium complexity strategic and tactical game of galactic conquest.  Can a small band of valiant rebels withstand the oppression of the mighty galactic empire?&#10;&#10;The map board schematically represents over 30 solar systems.  Unit types include armed forces, spaceships, imperial characters and individual rebels.  The rebel player must start insurrections on various planets hoping to cause a domino effect and topple the empire's power base.  The Imperial player must garrison planets, quash rebellion and conduct diplomatic missions to maintain a high loyalty factor.  There are three levels of complexity to the game system.  Combat is dice based and cross-referenced on a probability table.&#10;&#10;The game consists of a map board, 140 character cards, 400 die cut counters, a galactic guide, numerous playing aids and a rulebook.&#10;&#10;",
        "artist": "Redmond A. Simonsen,David Wenzel"
    },
    {
        "name": "Foreign Exchange",
        "description": "From the back of the box:&#10;&#10;At last - a money game for adults!&#10;&#10;Be forewarned!  This game might not be for you...unless you are a student of the international money market.  Or, you are just plain curious as to why the US dollar is worth less and less despite the fact that we are still the strongest nation in the world.&#10;&#10;Simply put, Foreign Exchange is not a toy.&#10;&#10;A perfect simulation of the international currency situation, it is!&#10;&#10;International companies realize gains and losses when changing currency rates alter the value of their income and assets in foreign countries.  This game simulates this situation by letting players own and manage multi-national companies in various cities throughout the world.  As in the real world, changing conditions require each player to make constant decisions after considering his company's financial resources - and what he expects his opponents to make - against the cost of alternative protective strategies.&#10;&#10;The Iranian oil situation of early '79 is a classic real-life example.  Iran furnishes less than 7% of America's petroleum needs.  Yet its unavailability has done more to devalue the dollar against gold than any economic crises since the depression of 1939. Why so, you may ask.&#10;&#10;Playing Foreign Exchange will give you insight into this question, and you'll have fun doing so because the game focuses on the interplayer relationships.  Without such interplay relationships, no game is fun to play.  With it, Foreign Exchange might just be the greatest money game to come along since Monopoly.&#10;&#10;Ironically, it doesn't come with any money.  All financial transactions are recorded on a variety of accounting pads included.  If you're into pencils, you'll love this game (some enterprising money -market enthusiasts have already programmed this game on computer).&#10;&#10;You - as company head - decide where in the world (literally) you want to establish sales and manufacturing offices.  This is done at the beginning through a round of trading City Cards among players until everyone is satisfied they've outsmarted their opponents.&#10;&#10;From this point on, a variety of situations and happenstances will determine likely changes in currency rates.  You - the manufacturer - must plan the strategies you think best to maximize gains.&#10;&#10;Foreign Exchange was designed by a professional money-management expert and executive officer of the leading financial institution.  What is duck soup to him, however, might be unfathomable to the novice.  That's why the game comes in three versions: a &quot;Beginning&quot; version for game buffs intrigued by money games; the &quot;Intermediate&quot; game for those with a cursory knowledge of what's going on with foreign currency; and the &quot;Expert&quot; game for those people who really have a yen for this sort of thing.&#10;&#10;Includes:&#10;2-piece fold-out game board&#10;Foreign Exchange Worksheet pad&#10;Net Worth Worksheet pad&#10;Hedging Cost Worksheet pad&#10;24 City Cards&#10;4 Borrowing Cost cards&#10;16 Currency Exchange cards&#10;16 Risk cards&#10;5 player tokens&#10;40 colored markers for 4 different colors&#10;2 6-sided dice&#10;Rules&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Dark Emperor",
        "description": "Two-player boardgame of warfare and quest in a fantasy universe.  One player is a Dark Lord invading the world from another dimension; the other must rally the kingdoms of the world to fight the invaders.&#10;&#10;There is a race-for-time aspect to the game as the Dark Emperor becomes steadily stronger whilst the opposing player scrambles to put together an alliance.  The map is remarkable in that this world has obviously suffered extensive meteoric bombardment.&#10;&#10;",
        "artist": "James Talbot"
    },
    {
        "name": "Dragon Pass",
        "description": "Remake of Chaosium's White Bear & Red Moon. Also published by Oriflam as La Guerre des H&eacute;ros in 1993 (in French) and as &#227;&#131;&#137;&#227;&#131;&#169;&#227;&#130;&#180;&#227;&#131;&#179;&#227;&#131;&#145;&#227;&#130;&#185; Dragon Pass in Japanese by Hobby Japan.&#10;&#10;The role-playing World of Glorantha was created as a semi-public-domain project by Greg Stafford around 1966 as a mental exercise. Eventually, Greg published a wargame based on his world called White Bear and Red Moon. In fact, Chaosium was founded to allow Stafford to publish this boardgame! This game later became the excellent Dragon Pass game. White Bear and Red Moon was enough of a hit to spawn a second war game, Nomad Gods, and, more importantly, inspired some D&amp;D fans to write a gaming system that would allow role-playing in Glorantha. Thus was RuneQuest born.&#10;&#10;Re-implements:&#10;&#10;    White Bear & Red Moon&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Business Strategy",
        "description": "Business Strategy is a management game where players have to compete for the resources needed to produce their finished goods.  They then compete in the marketplace to sell their goods.  The winner is the last player to be in business.&#10;&#10;Games can also end by player agreement, as it is possible for all players to establish stable companies, particularly if everyone plays a cautious game.&#10;&#10;Reimplements: Tycoon: Business Game&#10;&#10;Components:&#10;&#10;     Family Game Rules card&#10;     Rules of Play folder&#10;     16&quot; x 16&quot; Playing Board&#10;     One Running Record Pad&#10;     One set of 18 Climate situation cards&#10;     4 sets of 4-colored Pawns (16 total)&#10;     Paper money&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Caesar's Legions",
        "description": "Caesar's Legions is a medium complexity wargame simulating the Roman campaigns in Germany at the operational level.&#10;&#10;Players choose from 5 scenarios ranging from Caesar's own Germanic campaigns to the Batavian revolt of 70 AD.&#10;&#10;Movement is hex based.  Tactical cards effect combat resolution which is dice based and cross-referenced on a probability table.  Roman units are divided into cohorts.  German units are divided into tribes and enjoy hidden movement when in forest terrain.&#10;&#10;The game consists of a 22&quot; x 28&quot; map board, over 400 counters (448 counters), playing aids, 16 tactical cards (2 sets of 1 - 8) and a 16-page rulebook.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Alpha Omega",
        "description": "In Alpha Omega, players assume the roles of the commanders of the Human, Drove and Rhylsh space fleets.  The game features scenarios set chronologically in the fictional distant future setting: from the civil wars of the fledgling Human space empire, to the first alien invasion by the Droves, and the confrontation and eventual alliance between the Humans and the Rhylsh.&#10;&#10;The Droves and the Human/Rhylsh factions have different technologies between them, affecting the way their units move and the weapons they have to destroy each other with.  Both sides can deploy fighters, assault ships, destroyers, carriers, battle cruisers, and various other vessels.  Mines can be laid to defend outposts and star bases, but can be swept aside with mine sweepers.  Cargo can be captured, and sensors can be jammed to help cloaked ships infiltrate further.&#10;&#10;Each scenario (battle) is resolved as follows.  In the first phase, each player secretly writes down the movement and actions of his units.  The orders of both sides are then simultaneously resolved in the following phases.  After the moves and actions have been resolved, the players repeat the cycle, secretly plotting their orders and openly enacting them.  Combat actions are resolved by rolling dice and consulting the effects from tables.  Play goes on until the scenario's duration has elapsed or a side's Victory Conditions have been met.&#10;&#10;",
        "artist": "Mike Williford"
    },
    {
        "name": "Bureaucracy",
        "description": "From the back of the box&#10;&#10;Bureaucracy is a somewhat less complicated version of The Great Chain of Being, a medieval, theological, parlor game, first uncovered in a small church in Urbino during the renovation of an ancient, holy, but clearly inadequate, sewage system.  Both the Church and the monastic Parkover Brothels deny the authenticity of the game.  As one official noted, &quot;that's a crock&quot;.&#10;&#10;Bureaucracy is designed to simulate the bureaucratic behavior which constitutes so much of what we call government.  It is convoluted, Byzantine, and entertaining.  It is also cost effective, feasible, and administratively impossible.  In its early stages, Bureaucracy required a fifteen story parlor, a six acre gameboard, 200,000 pieces, and a 15,000 page rulebook.  Of course, this prototype was unwieldy.  Consequently, we were forced to simplify the game.  The present version is good for two to eight players.&#10;&#10;Each player starts the game at the lowest organizational level.  The winner is the player who rises up through the masses to become the Director of the Bureaucracy.&#10;&#10;Players may select one of four lifestyles, each with its own advantages and disadvantages: lifer, over achiever, empire builder, or hustler.  To be promoted from level to level, a player will need the required number of promotional prerequisites and that's where the fun comes in.  All sorts of things can happen.  Players may be demoted.  They may be involved in scandals.  They may become involved in power plays.  They may have to go before a Grievance Committee.  A player may even go bankrupt and have to start all over from the bottom again.  There is no one sure formula for success.  Players will have to stay out of trouble and use all their cunning to succeed.&#10;&#10;This is a game that makes being a part of the bureaucracy fun  It will make you laugh at government and yourself at the same time.    For civil servants, it's required recreation.  For just you and me, it's a must.  Don't be surprised though, when you open the box and hear the call of the jungle.  It's a wild game.&#10;&#10;Game includes a 22 x 24 gameboard, 2 dice, 240 promotional prerequisite pieces, 20 power play pieces, 64 player tokens, a pack of money, 80 lifestyle cards, 20 memo cards, 20 consumer goods cards, 8 bucks, 1 power file, and two rulebooks (one to explain what it says in the simple game rules)&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "A Nightmare On Elm Street: The Game",
        "description": "Freddy Krueger, screen star and man of your dreams, wants to come to your house. Invite your friends over and get ready to stay awake far into the night! Using Freddy's own special deck of cards, you will try to escape from the nightmare that haunts Elm Street; you will run with maddening slowness through Freddy's dream maze; you will run for your life toward the clean light of wakefulness. But Freddy will be after you at every turn, and you never know which way he will be moving &ndash; unless you move him toward another player to save yourself! But you would never do that &ndash; would you?&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Alexander the Great",
        "description": "Macedonians vs. Persians in the climactic battle at Gaugamela.&#10;&#10;Alexander The Great is a medium complexity wargame recreating an ancient battle on the plain of Gaugamela in 331 B.C.  Players take on the roles of Alexander the Great and King Darius III as the Macedonian army clashes with the Persian Host.&#10;&#10;Movement is hex based.  Unit types include basic infantry, phalanxes, cavalry, chariots and elephants.  The turn sequence is movement, defensive fire and melee.  Combat is a dice roll cross-referenced on a probability table.  A sliding morale track determines which table will be used for combat resolution.&#10;&#10;The game consists of a 22&quot; x 28&quot; map board, a sheet of 108 die cut counters, playing aids and a 24-page rulebook.&#10;&#10;Avalon Hill Complexity Rating - 5&#10;&#10;",
        "artist": "W. Scott Moores"
    },
    {
        "name": "Summit",
        "description": "A simulation of the Cold War. Each player (a major power) allocates his resources to building military bases, steel mills or consumer goods factories both home and abroad. Since foreign presences are essentially mutually exclusive, a lot of shouldering aside goes on. Control of non-player states scores points, as well as consumer goods factories. Military bases don't score anything, but they protect your influence over another country.&#10;&#10;The players accumulate chips representing their overall power on the military, industrial or political spheres, and use those chips to exert pressure on other players. For example, you can &quot;demand&quot; that a player withdraw his steel mills from a country you consider to be &quot;yours&quot; by paying a chip (of any colour). The other player either complies or counters with a chip of his own. This can escalate until either player buckles. Escalate too much and you leave yourself open to &quot;attack&quot; by other players later on.&#10;&#10;Random events complicate matters. Alliances can be precious, but only one player will win...The game takes its name from the Summit events, which are scoring rounds.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Wide World",
        "description": "A simple game of racing about the world to pick up and deliver cargoes. In Wide World Travel Game the players fly around the world to a list of destinations collecting cargoes at each then attempt to return to their starting point before the other players. Each player is given a set of &quot;destination cards&quot; and looks at the first one. They then move their plane toward that location by rolling a die and moving that many places. If they roll a 6 or land on a red circle they must draw a &quot;travel agent&quot; card and follow the instructions on it. The only vaguely noteworthy twist is the Weather Overlay, a transparent plastic sheet covering a quarter of the board; now and then it moves to a different quarter, instantly transporting any planes that were on it with it.&#10;&#10;NOTE: Early editions of the game did not have the weather overlay.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Tintin",
        "description": "Professor Tournesol Kidnapped!&#10;Paris: We&rsquo;ve just learned that the famous Professor Tournesol has been kidnapped.&#10;After months of work in his laboratory, Professor Tournesol was on the verge of an invention that would, without a doubt, make the headlines. But, this last Monday, he did not show up for a gathering to which his friends had invited him. Tintin, the famous reporter, and Captain Haddock, the old sea-wolf, knew that, since the previous week, rumours abounded about the Professor&rsquo;s invention. They went to his laboratory, accompanied by Milou, Tintin&rsquo;s dog, and the detectives Dupond and Dupont, summoned in great haste. Once there, traces of a struggle were found that indicated that, without a doubt, the Professor had been kidnapped! Speculation is that the kidnappers intended to wrest the secret of his invention from the Professor.&#10;Immediately, Tintin and his friends launched themselves in pursuit of the kidnappers.&#10;&#10;The players move on the board trying to gather as much information as possible. They are trying to find out in which house Professor Tournesol is being held, and by whom.&#10;&#10;The game proceeds by elimination of possibilities, as one must rule out all other possible houses and suspects before reaching a conclusion. For example, the proof-cards (orange backed cards) show the following objects: a hat, sunglasses, a mustache, a crowbar and shoes. The two proof-cards on the board indicate which objects the kidnapper lost while fleeing Professor Tournesol&rsquo;s laboratory. The kidnapper will therefore *not* have those objects on him.&#10;&#10;The game won a parents' prize in Qu&eacute;bec.&#10;&#10;",
        "artist": "Hergé"
    },
    {
        "name": "Evade",
        "description": "Evade is an old (1971) 3M game, part of their  series of 'Gamettes', games which were released in very small, fold-over bookcase type boxes.  There were 9 games in this series, which were released near the end of the 3M venture into the gaming market.&#10;&#10;The game is extremely simple, yet requires quite a bit of 'bluffing' in order to win.  Each player begins with six metal pawns along the back row of a 6x6 grid.  The board fits snuggly into the box itself and is quite sturdy.  The game is, as is the entire Gamette series, ideal for bringing along while traveling.&#10;&#10;Each player secretly places a teeny magnet under two of his pawns.  The object is to be the first player to maneuver one of these 'magnet-bearing' pawns to the opposite side of the board.  If you manage to accomplish this feat, you win.&#10;&#10;Movement is simple.  You simply move one of your pawns one space to an adjacent space ... vertically, horizontally or diagonally.  If this lands you atop an opponent's pawn, you are both 'frozen' and can no longer move.  If you make the mistake of moving one of your 'magnet' pawns onto an opponent, he instantly wins.  &quot;Well&quot;, you say, &quot;Why wouldn't I just check the pawn to make sure it wasn't carrying a magnet before making such a questionable move?&quot;.  The rules allow for this, but if you do check, you are prohibited from 'freezing' an opponent that round.  So, it's best to remember which two of your pawns are carrying magnets.&#10;&#10;As mentioned, the game ends as soon as one player manages to get a magnet-bearing pawn to the opposite side of the board.  If both players fail to accomplish this, the game is a draw.&#10;&#10;The game is very simple and the primary tactic is 'bluff'.  Are you going to be bold and move one of your 'magnet' pawns to the front, figuring your opponent will guess that this cannot possibly be your magnet pawn as he could freeze it too easily?  Or, do you protect your magnet pawns and try to create a path that it can squeeze by your opponent's pawns and scoot to the opposite side?  As with most bluff-style games, there's some guesswork and plain old luck involved, but there is still enough maneuvering and tactics to keep it interesting.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Castle of Magic",
        "description": "A Monster is lurking in the depths of Castle Bondi.  The rulers of three neighboring countries journeyed to the Castle to vanquish the monster, but were themselves devoured.  When they died, the three items of Power -- a Crown, an Amulet, and a Scepter -- were lost with them.&#10;&#10;You and your mysterious companions have come to the Castle to regain these items and cast the Ritual Spell.  This Spell will either banish the monster forever or make it a Wizard's slave.  Each of you is a member of one of three Wizard Guilds -- the Eagle Lords, the Wolf Mages, or the Dragon Masters.  Some of your companions may be from your Guild, and perhaps you can work together.  Others may be from a Guild you oppose.  There are many secrets to be discovered in the Castle and dangers to avoid.&#10;&#10;Each of you vies for one of the three countries: Marus, Kida, or Sorrell.  Learn which Item of Power -- Crown, Amulet, or Scepter -- must be won to rule your country.  Discover how to cast the Ritual Spell so that the fate of the Monster is decided to your advantage.  There are eight possible results for the Ritual Spell, some of which lead to death!  Most importantly, uncover secrets about the other players and what devious goals they have.  Find other Wizards you can work with in order to win together.&#10;&#10;Expanded by:&#10;&#10;    The Castle Cursed&#10;    The Fall of Castle Bondi&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Monster Mash",
        "description": "This childrens game comes with 27 monster cards, 4 &quot;thwacker&quot; hands with suction cups, and a clever &quot;monster-maker&quot; machine. Each monster has one of three sets of eyes, one of three mouths, and one of three bodies. The monster maker consists of three panels that spin randomly, stopping to form one of the monsters. Players then scan the cards on the table to try to find the one that matches the monster. Whoever &quot;thwacks&quot; the right monster with their thwacker (a long-handled stick with a hand with a suction cup at the end) and picks up the card wins the point.&#10;&#10;The publisher's description:&#10;&quot;Imagine that you're a hunter in the deep, dark jungle. But it's not just any jungle. This one is filled with big, blobby monsters that run wild. Shhh! They're hiding everywhere. But not for long. Press the button on the Monster-Maker Machine and...aha...one appears in a flash! That's the one you've got to mash with your THWACKER hand. Can you do it before the other hunters do? If you think you can, then it's time you started off on this slaphappy adventure called MONSTER MASH. Happy hunting!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "A Question of Scruples",
        "description": "Scruples... The game that poses 252 moral dilemmas on issues of work, money, friends, family, neighbors and, of course relationships!&#10;&#10;User review: Each player is dealt five dilemma cards, each with a question of scruples, and one reply card. Each reply card says, &ldquo;Yes,&rdquo; &ldquo;No,&rdquo; or &ldquo;Depends.&rdquo; If the player can correctly match another&rsquo;s reply with a dilemma card from one&rsquo;s own hand, then the dilemma card is discarded. Otherwise, the dilemma card is replaced with another card from the dilemma card deck. Mismatched responses can be challenged and put to a vote of the other players. The first player to surrender all of one&rsquo;s own cards is the winner.&#10;&#10;Official rules: http://www.scruplesgame.com/rules.html&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Alien Hotshots",
        "description": "Join the odds and the evens in their interstellar struggle to bring peace to the universe.  Just as in the classic game of war, the highest card wins each hand.  Matching cards mean war!  Play powerful space ship cards to alter the outcome of cosmic encounters.  Collect all the cards to win and leave your opponent in outer space.  To do so you must face paralyzing space germs, the hungry even and odd eaters, and the treacherous black hole!&#10;&#10;",
        "artist": "Don Sullivan"
    },
    {
        "name": "Jumanji",
        "description": "The Game that Pursues You!  Stalking lions, Charging rhinos, Lunging, Snapping crocodiles, and more. In the wild world of Jumanji, they're only a dice roll away.&#10;&#10;Choose your pawn and set out on a deadly journey.  Decode rhyming card messages that could spell disaster! Roll 8-sided dice together to rescue a fellow player in danger! Fail to escape, and the jungle could swallow you whole!  The only way out is to finish the game.  Only then will the terrors of the jungle disappear...&#10;&#10;The game is based on the movie with the same name.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Im Märchenwald",
        "description": "Played in a Fairy Tale Forest composed of a grid of 7x7 cards, players must try to rescue a sick princess. Goblin, Witch and Crow cross the path and impede the search. Allows for solitaire play.&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Yacht Race",
        "description": "A simple, fast-moving sailing race game, Yacht Race is notable for its extraordinary components:  a beautiful oversized board representing a fictitious nautical chart, thick and elegant cards, and a set of weighted, felt-based brass sailboats designed to be picked up and moved about by their tall plastic sails.&#10;&#10;The game was originally published by a company called Saturday House. Parker Brothers  purchased it from them and printed a new (virtually identical) edition.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Advanced Heroquest",
        "description": "Advanced HeroQuest is a revised and expanded version of the Milton Bradley HeroQuest game.  The basic concept is the same: four heroes venture into a dungeon to fight monsters and gain treasure, but Advanced HeroQuest's rules are more detailed and complex.&#10;&#10;The major additions and changes include:&#10;&#10;    random dungeon generation system&#10;    modular game board&#10;    ranged combat&#10;    multiple colleges of magic and spell books&#10;    henchmen&#10;    critical hits and fumbles&#10;    fate points (the &quot;undo&quot; feature)&#10;&#10;&#10;&#10;&#10;Games Workshop set Advanced HeroQuest in the Warhammer universe, presumably to foster sales of their miniatures.  The campaign world is easy to ignore, however, should players rather keep things generic.  Advanced HeroQuest also includes rules for using the characters and monsters from HeroQuest, should players want to do so.&#10;&#10;The game is supplied with Skaven figures that make up the quest within the rulebook. The exact same Skaven, henchmen and hero miniatures were also included in Mighty Warriors, also by Games-Workshop.&#10;&#10;The following White Dwarf issues contain adventure scenarios, spell lists, or other information for Advanced Heroquest:&#10;&#10;Issue #121     The Quest for Sonneklinge (scenario and Jade spell list)&#10;Issue #122     The Priests of Pleasure&#10;Issue #125     The Dark Beneath the World (scenario and Amethyst spell list)&#10;Issue #134     The Trollslayer's Oath&#10;Issue #138     Henchmen (new followers for AHQ: the Dwarf Trollslayer, the Elf Wardancer, the Human Captain, and the Wizard's Apprentice -- this material is duplicated in Terror in the Dark)&#10;Issue #139     Treasure (This material is also duplicated in Terror in the Dark)&#10;Issue #145     The Eyes of Chaos (has rules for both AHQ and HQ)&#10;Issue #150     The Changing Faces of Tzeench&#10;Issue #159     Rivers of Blood&#10;&#10;Advanced HeroQuest: Paint Set has replacement heroes and additional minis.&#10;&#10;",
        "artist": "Gary Chalk,Mark Craven,Wayne England,John Sibbick"
    },
    {
        "name": "Fury of the Clansmen",
        "description": "Fury of the Clansmen is a tactical combat game set in the Mutant Chronicles universe.  Players control squads of Clansmen or Dark Legion minions in various missions on the planet Venus.  Each side has special objectives in each mission, and the team that accomplishes its goals first wins the game.&#10;&#10;Includes 32 detailed plastic miniatures.  Can be combined with Pressman's Siege of the Citadel game to create very large battles. Additional rules and statistics for this game can be found in two supplements for the Mutant Chronicles RPG: the Imperial Sourcebook (with stats for many of the Imperial Corporation's forces), and the Algeroth Sourcebook (with stats for the myriad of forces available to the &quot;Apostle of War&quot;).&#10;&#10;Another expansion appeared in the Swedish magazine &quot;Sinkadus&quot; issue 43, which offered new squads for both sides, a new board, and a scenario using map boards from Fury and Siege of the Citadel together.  The Klansman player can now play as the Brotherhood faction, who use supernatural &quot;Art&quot; cards.  The Dark Legion player can use &quot;Dark Symmetry&quot; cards.&#10;&#10;",
        "artist": "Paul Bonner"
    },
    {
        "name": "Fireball Island",
        "description": "A plastic tiki idol is placed in the raised middle of a molded, 3d board, where it can rotate freely. Players move their explorer pawns up the sides of the mountain along paths and through caves, trying to reach the top of the mountain, retrieve the idol's giant ruby, and take it down the other side to the waiting boat. However, both the idol and volcanic vents throughout the board periodically spit out &quot;fireball&quot; marbles, which physically roll down the mountain, either plowing through explorer pawns in their path, or toppling triggered bridges as they pass under them.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Aliens",
        "description": "Aliens allows players to recreate three key battle scenarios from the 1986 science fiction/horror film.  The scenarios include &quot;The Reactor Room&quot; (nine marines vs. the aliens in their lair), &quot;Operations and Air Ducts&quot; (the surviving marines face an alien assault and pursuit), and &quot;Ripley vs. The Queen&quot; (Ripley uses a powerloader in her final battle with the Alien Queen).  Includes a 17&quot; x 34&quot; game map, character cards, and counters, all featuring photos from the movie.&#10;&#10;Marines can have very short life spans in this game, especially if they don't work together. Game play is fast and intense - does a good job of creating the sense of urgency felt when watching the movie.Missions can be made more brutal with optional rules - plus some rule variants add to some fun &quot;what if&quot; scenarios. Add the Aliens Expansion and you can virtually re-write the entire movie script!&#10;&#10;",
        "artist": "Toni Dennis,Nadir Elfarra"
    },
    {
        "name": "Cosmic Coasters",
        "description": "(From the publisher:) A ten minute game of interplanetary invasion for two, played using fleets of seven coins on the moons of Jupiter. You've transported a ship to an enemy planet -- now what? Their teleport pad is under tight control. Looks like you'll have to overwhelm them with sheer numbers and do battle to the death to even send a single ship back home. You'll need cunning, and a good dose of luck to get through this alive -- and don't forget that special power you have up your sleeve... Sound complicated? Not to worry. You can always just use their entire planet as a place to put your drink.&#10;&#10;International readers should note that the components of Cosmic Coasters are printed paper fiber: Americans use &quot;coaster&quot; interchangeably to include what elsewhere might be called &quot;beermats.&quot;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Asteroid",
        "description": "In Asteroid, one player controls a team of adventurers attempting to destroy a runaway mining asteroid on a collision course with Earth; the other player controls the evil computer brain that runs the mining station. The good guys must overcome the station's defenses (including various nasty robots), turn off the computer brain, set the asteroid to self-destruct, and escape before it blows.&#10;&#10;Each of the adventurers has unique characteristics, including ranged and melee combat abilities, computer skills, demolition skills, stealthiness, psychic ability, luck and even emotional attachments to other characters.&#10;&#10;The computer brain player secretly determines the configuration of the modular boards to form a map of the mining station and deploys robots to prevent the adventurers from shutting it down.&#10;&#10;Victory levels for the adventurers include World Survival Victory, Personal Survival Victory, Common Decency Victory, Romantic Victory and even SPCA Victory (involving the outcome with respect to the dog character, Sasha).&#10;&#10;One of GDW's Series 120 games, the game includes eight 5.5&quot; x 8.5&quot; maps and 120 tile counters that represent the characters, robots, items, etc.&#10;&#10;It was resold from Kokusai-Tsushin in 2003.&#10;&#10;",
        "artist": "Rich Banner,Richard Hentz,Naoyuki Kato,William H. Keith, Jr."
    },
    {
        "name": "Dawn of the Dead",
        "description": "Dawn of the Dead (based on the classic 1978 horror film) can be played as a two-player game (humans vs. zombies), as a solitaire game, or as a cooperative game with two to four players controlling the human heroes. The game map represents the shopping mall from the movie.  Cardboard counters signify the human characters and zombies.  To win, the zombie player must kill any three characters; the human player must secure the mall by closing all four entrances and eliminating all zombies within.&#10;&#10;Microbadges&#10; Zombie Fan&#10;&#10; Dawn of the Dead fan&#10;&#10;",
        "artist": "John H. Butterfield,Redmond A. Simonsen"
    },
    {
        "name": "Berserker",
        "description": "&quot;Ugly&quot; John Carver shares development credit with Michael Stackpole.&#10;&#10;From the box:&#10;&#10;&#10;A tactical space conflict game based on the novels and stories by Fred Saberhagen.&#10;&#10;Berserkers, the fearsome robotic dreadnoughts of space, race towards Earth in their attempt to destroy the birthplace of mankind.  Fighting against extinction is a hastily gathered force of human ships.  Cruisers and C-plus guns batter the Berserkers from afar, while Earth's only hope - the ram ships - swarm like killer bees.  Inside the ram ships huddle the marines who must board the Berserker and destroy it from within...&#10;&#10;Berserker is an easy and thrilling game of the human struggle for survival against Berserkers.  Optional rules cover Earth Shadow, Veterans, Prisoners, and a lengthy campaign game.&#10;&#10;COMPLEXITY: fairly easy to intermediate level&#10;&#10;&#10;",
        "artist": "Michael Carroll,Steven S. Crompton,Denis Loubet"
    },
    {
        "name": "Knights of Camelot",
        "description": "Knights of Camelot ranks right alongside Divine Right; it is an early TSR game brimming with flavor.&#10;&#10;The players are freshly knighted and wander the Arthurian realm looking for damsels in distress, brigands, monsters, other knights to joust with, etc. The game uses a random table generation driver that can lead to an enormous variety of encounters. I remember fondly two incidents:&#10;&#10;In the first, a knight met a Dwarf on horse. Deciding to approach and meet him (instead of avoiding or charging), the dwarf turned out to be a knight in disguise --but not just any knight! It was Lancelot, the foremost knight of the realm! We had a sudden vision of the hollowed-out horse necessary to hide Lancelot's bulk...&#10;&#10;In another incident, a player led a charmed life and pulled ahead of the others in their quest for the Holy Grail. He met Merlin repeatedly and ended up with a special charger, magic lance, and magic shield --the works! England wasn't much of a challenge for him any more, so he decided to cross the Channel to France. Bad move! His ship sank in a storm so he washed up on the shore minus all his equipment and followers. Dejected, he trudges to the nearest castle to ask for help --but a giant jumps out of the moat and kills him in one blow!&#10;&#10;The game has heavy role-playing elements to it; articles in Dragon Magazine, Issue# 58 explained how one could play knaves (bad knights), and GMs have been known to use the game as an adventure generator for RPGs.&#10;&#10;",
        "artist": "Darlene,Jeff Dee,Eymoth,Dave LaForce,David C. Sutherland, III"
    },
    {
        "name": "Ancients",
        "description": "Rules and scenarios for Ancients battles.  King of Kings (itself later republished by 3W as Imperator) was a companion game.  Available for free download at this url:  http://home.comcast.net/~mpnagel/Relative_Range/Ancient_Battles_Deluxe.html&#10;&#10;As of August 6th 2016 the previous link is dead. Last archived version can be found at: http://web.archive.org/web/20150216114730/http://home.comcast.net/~mpnagel/Relative_Range/Ancient_Battles_Deluxe.html&#10;&#10;An new version of the old website could be found at http://www.relativerange.com/#!ancient-battles-deluxe/a4loq although it contains the rules for Ancient Battles Deluxe, not for Ancients.&#10;&#10;",
        "artist": "Ted Koller,Beth Queman"
    },
    {
        "name": "The Creature That Ate Sheboygan",
        "description": "A fabulous game where one gets to &quot;wreak havoc with the monster of your choice&quot;.  You design a monster (Godzilla, Mothra, The Really Big Slug, etc.) and then try to destroy as much of Sheboygan as possible; the opponent scrambles civilians out of the way, then sends in the police and eventually the Army.  Great fun!&#10;&#10;Spawned numerous imitators, such as the old Epyx computer game &quot;Crush, Crumble &amp; Chomp&quot;, or more recent games such as &quot;Super Giant Monster Showdown&quot;.&#10;&#10;",
        "artist": "Redmond A. Simonsen,Charles Vess"
    },
    {
        "name": "Dark Cults",
        "description": "An early story-telling card game from the co-designer of Divine Right and Knights of Camelot.&#10;&#10;It is a story-telling card game, foreshadowing Once Upon a Time: The Storytelling Card Game.  In it, the two players represent Life and Death, respectively, and each tries to guide a horror story to their corresponding outcome.  As well as horror, the creator suggests that the game could be used for a science-fiction or mystery story, although the game's cards may be poorly suited to this.&#10;&#10;The game was packaged with a magazine called The Cultist.  It proposed solo and four-player variants, and additional &quot;object&quot; cards for the game.&#10;&#10;",
        "artist": "Eymoth"
    },
    {
        "name": "King's Bounty",
        "description": "Released in 1991 by Task Force Games, this game is like its computer game counterpart: the players are rival bounty hunters, each riding through the kingdom, hunting down monsters and miscreants upon whose heads the king has put a prize.&#10;&#10;The King's Bounty was designed prior to the like-named turn-based fantasy computer and video game designed by Jon Van Caneghem of New World Computing in 1990. The computer game version is notably considered the forerunner of the Heroes of Might and Magic series of computer and video games. A sequel to the original computer game, called King's Bounty: The Legend was released in 2008.&#10;&#10;The computer game's origin began with fighting mechanics that were meant to have a similar flavor to that of the Avalon Hill board game Titan, but the computer game lacked a story-line or theme. At the same time as this computer development, the author of the King's Bounty board game was wrapping up the development of the board game, which at the time had a working title of &quot;Bounty Hunter.&quot; New World Computing decided to adopt a storyline and theme similar to that of the board game being prepared for production by Task Force Games, which New World Computing owned.&#10;&#10;New World Computing shut down development at Task Force Games and transferred ownership of the company prior to the board game production completing, which delayed its release. The major remaining component that had to be completed prior to release was final production and layout of the rule book, which is why interior artwork changed from that produced for other components. The cover graphic, already completed and originally contracted for the board game and then adopted by the computer game, remained unchanged. This answers the question implied by the earlier writer of this game entry, &quot;Interestingly, the cover of both the computer game version and the boardgame version are the same, implying some connection between the two.&quot;&#10;&#10;",
        "artist": "Lee McLeod,Erick Watson,Todd Winter"
    },
    {
        "name": "Rollout",
        "description": "The game of the risk-takers.&#10;&#10;You are the chairman of a multinational corporation selling products worldwide.  You decide on pricing, advertising, stock shares, etc.  Economic war.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Star Viking",
        "description": "Box back description:&#10;&#10;&quot;Raiding vessels sweep across the star systems to loot glittering worlds. In system after system, dark cruisers materialize from hyperspace, launching a cloud of fighters to vaporize the local in-system patrol boats -- then comes the savage plunder of whole planets by powersuited raiding parties and grav-armor detachments.&quot;&#10;&#10;&quot;Scattered thinly across the Outrim sector, the frigates of the Federate squadron desperately deploy, attempting to weld the undermanned planetary defenses and low-tech local militias into a cohesive force capable of resisting the star-born horror from beyond the rim -- the coming of the STAR VIKINGS.&quot;&#10;&#10;&quot;STAR VIKING is a game of interstellar raiding and plunder for two players. Using a unique system of 12 mapboard tiles to represent the various star systems in the Outrim sector, it captures the tense uncertainty and the sudden, flashing battles of an interstellar war. Units represented include Viking cruisers, sloops, and fighters. Federate and local frigates, battle-cruisers, and patrol boats, as well as raiding detachments, security forces, grav-armor units, specialized warfare pods, and conventional low-tech armed forces ranging from atmospheric aircraft to stone-age hordes.&quot;&#10;&#10;A print-and-play version of this game is available for free, authorized download from http://dwarfstar.brainiac.com/ds_starviking.html&#10;&#10;",
        "artist": "Bob Depew,David Helber,Arnold Hendrick"
    },
    {
        "name": "Risk: Édition Napoléon",
        "description": "This very special version of Risk was published by Tilsit exclusively in France, as a numbered edition of 10 000 copies.  Hasbro's signature is very discreet, appearing in the copyright line as &quot;(c) Hasbro International Inc. Under license of 3D Licensing France&quot;.&#10;&#10;In addition to standard Risk rules, advanced rules introduce fortress sieges, generals, maritime blockades, naval combat, alliances and personalities (Napol&eacute;on, Wellington, Bl&uuml;cher...).  An historical scenario reproduces the Napoleonic campaigns with fidelity.&#10;&#10;An extension was produced that introduces the Ottoman Empire as a sixth player.&#10;&#10;Online Play&#10;&#10;&#10;     http://www.denizengames.com&#10;&#10;&#10;Expanded by:&#10;&#10;    Risk &#195;&#137;dition Napol&#195;&#169;on: Extension Empire Ottoman&#10;&#10;&#10;&#10;&#10;",
        "artist": "Igor Polouchine"
    },
    {
        "name": "Pampas Railroads",
        "description": "Players vie for control of six railroads in Argentina.  A deck of cards (3 Offer Stock, 4 Develop Settlements, 5 Construct Track) is used each round to determine player actions.  The deck is passed to the left and an action taken until there is just one action card type left in the deck.  Dividends are then paid (based on railroad value and total number of shares), and a new round is started.  The game lasts for nine rounds, at which time a final payoff is made based on value, income, and actual shares sold.  There are only 5 shares of each railroad available, with the money from the stock purchase going into the railroad treasury.  Also, all track construction must be paid for out of railroad treasuries, and the track is drawn along pre-defined routes using plastic crayons.  Settlements are developed using player funds, which in turn increases the income available to a railroad.  The player with the most money after the final payoff wins.&#10;&#10;The fourth game in the Prairie Railroads Series.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Pay Day",
        "description": "Pay Day is played on a one-month calendar with 31 days.  During the game, players will have to deal with various bills and expenses, but will also have the opportunity to make deals on property and earn money.  At the end of each month, players are paid their salary (the same for each player) and must then pay off all outstanding bills, taking out a loan if necessary.  Most money (or least debt) wins after a certain number of months decided by the players (3 months usually takes 30 minutes to finish).&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Warlord: Saga of the Storm",
        "description": "Warlord: Saga of the Storm is a fast-paced game set in the fantasy world of the Lands of the Accord. You play the role of a powerful ruler, responsible for the defense of your lands and the destruction of all those who seek to destroy you. Your people are at war with your enemies, and you must crush your foes on the field of battle. There is no alternative.&#10;&#10;Your cards represent the forces, equipment, and tactics you have at your disposal as you play the sport of kings in pursuit of complete power. In addition, the cards will unfold a fantasy epic that evolves as new card sets are released.&#10;&#10;To win this devastating war, you must ultimately destroy the enemy Warlords! There is but one path to victory: survive. Whenever a player's Warlord is killed, that player is out of the game. The last player in the game wins the war.&#10;&#10;In January 2008, the license for Warlord changed hands: For the 4th edition, available July 31st 2008, PHOENIX Interactive GmbH in Germany is responsible for Warlord. For this major changes were instituted: The format was changed to a customizable card game, where all cards are available in fixed starters, and a new faction was introduced, The Chosen.&#10;&#10;",
        "artist": "Melissa Benson,Jonny Klein,Stephanie Pui-Mun Law,Henning Ludvigsen,Monte Moore,Chris Seaman,Charles Urbach"
    },
    {
        "name": "Mythos",
        "description": "In this card game based in H.P Lovecraft's Cthulhu Mythos, you play an investigator (represented by a double sized card that has your stats, special abilities and keeps your story organized) who must complete stories without going insane.  From a deck of at least 52 cards you draw 13 and take turns playing one at a time so it moves at a brisk pace.  You stock your deck with at least 20 points of stories (usually 3 or 4) and try to get the required cards into play.  As an example The card 'A Day in the Life of a M. U. Student' requires you to visit 3 Different Miskatonic University Locations, cast a spell, summon a monster, go to a country site and play an ally of the opposite sex.  When you have fulfilled the conditions you score the card and gain sanity.  In this card's case you score 8 points and gain 2 sanity.&#10;&#10;The types of cards you have are locations (you almost always occupy one), allies, monsters, events, tomes, spells, artifacts and adventures.  A round lasts until there are two passes, at which time all monsters played fight each other then go after the investigators to disable their allies or reduce their sanity.  You can throw allies in front of the monsters as cannon fodder to protect your investigator.  You then decide what cards you are going to keep in your hand (each investigator has a minimum and a maximum number of cards that must be kept) and draw back to 13 for the next round.  Because of this you blow through your deck very quickly and you will go through it a couple of times in most games.&#10;&#10;There are also some very nasty phobias and events to play on your opponents to interfere with their strategies.  There is a lot of interaction and the Lovecraftian atmosphere is keenly felt.&#10;&#10;",
        "artist": "Salvatore Abbinanti,Chris Adams,Thomas Garrett Adams,Stephen Barnwell,John Bridges,Dennis Calero,Tim Callender,Echo Chernik,Alan M. Clark,David Day,C. Brent Ferguson,Scott Fischer,David Fooden,Earl Geier,Lee Gibbons,Justin Hampton,Ovi Hondru,Andrew Kalichack,Drashi Khendup,Stephen King,Scott Kirschner,K. C. Lancaster,Todd Lockwood,Meghan McLean,Jeff Menges,Angelo Montanini,Lee Moyer,Michael A. Powell,Roger Raupp,Sam Shirley,R. Wayt Smith,Nick Smith (I),Tom Sullivan,Joseph P. Sutliff,Strephon Taylor,Susan Van Camp,Eric Vogt,Jason Voss"
    },
    {
        "name": "Zopp",
        "description": "Zopp can be played with 2 (singles) or 4 players (doubles). The rules roughly correspond to soccer. Each player has 3 stones representing his players (black and white), and a smaller stone (red) represents the ball. The stones are flicked using the Zopp-stick or fingers on the surface. Each side alternates attempts to knock the ball into a goal by flicking their own players. Player with the most goals wins the game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Inklings",
        "description": "This game received Games Magazine's Game of the Year award in 1993.&#10;&#10;Players form two teams of at least two players (equipment is provided for six total, although more players can be added if you improvise). Each player is given a card with seven words in a category, and a wipe-off board with space for clues for each of them. Players then attempt to write the shortest possible clues for their seven words. In turn, each player puts his or her board in the display rack. After announcing the category, their teammates have a limited amount of time to guess the words. If any are left unanswered, the other team is given a single shot to guess each word&#10;&#10;Won Games Magazine Game of the Year award in 1993.&#10;1993 Mensa Select&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Rüsselbande",
        "description": "The merry trunk gang consists of seven multicolored piglets, who love nothing more than running through the meadows - on roads, which are so narrow that they cannot pass the other pigs - except, if they stand on top of one another! Naturally, they know how to do this, as they are not normal piglets, but genuine circus piglets! And even if they do not run a race, they gladly demonstrate acrobatic exercises or set up themselves in marvelous pyramids.&#10;&#10;After the board has been constructed, players' take turns rolling a special die numbering 1-4 and moves his pig based on the number he rolled. If a black number is rolled the player may get to take another turn. If you land on the same space as another pig you now move with the bottom piglets piggyback style. Once a player makes it to the end of the track is declared the winner.&#10;&#10;Ages 4 and up.&#10;&#10;",
        "artist": "Rolf Vogt"
    },
    {
        "name": "Dilbert: Corporate Shuffle",
        "description": "A fast-paced card game of corporate one-upmanship starring Dilbert, the cartoon hero of the workplace.  In each round of Corporate Shuffle, the goal is to get rid of your cards as fast as you can.  The faster you get rid of your cards, the higher you'll scramble up the corporate ladder.&#10;&#10;Based on the Great Dalmuti card game (or Career Poker), with a Dilbert theme, and a few new cards and rules. Each card features a unique Dilbert comic. Players try to get rid of their cards as fast as possible, to move up the corporate ladder.&#10;&#10;",
        "artist": "Scott Adams"
    },
    {
        "name": "Spanish Main",
        "description": "A game of exploration and colonization of the new world.   At the start, each player decides what country they will be from and takes the appropriate counters.  The board represents a map of the Atlantic ocean with Europe in the NE and the North America to the WSW.&#10;&#10;The object of the game is to sail to the New World and load up your ships with wealth from your colonies to bring back to Europe.  The other players are trying to do the same but they can try to intercept your ships and either sink them or take your cargo.&#10;&#10;There were two main editions of the game. The first accommodated 2-6 players and came in a brown box (there were apparently actually two versions in a brown box, but the differences between them are apparently very minor). The second is in a blue box, takes only 2-4 players (there are also solo rules, but the gameplay is very different with them), and has some changes from the earlier edition. There was an expansion kit for this edition which added the other two players, but which appears not to have been widely distributed.&#10;There was also a &quot;Spanish Main Up-Date Kit&quot; to upgrade the 1st to 2nd edition.&#10;&#10;",
        "artist": "Ed Dovey"
    },
    {
        "name": "Mississippi",
        "description": "An abstract race game set on the Mississippi river. Each person has a boat (actually a hexagonal piece with the numbers 1-6 written on each of the 6 sides of the piece). The board is a long track of hexes that wind back and forth in an 'S' pattern. Each person places his 'boat' on the start space with one of the numbers facing forwards. Each person also starts with a number of 'Logs'. These are used to move your boat forward 1 space for each log spent. (You can also decide to move backwards - gaining 1 log for each space moved back).&#10;&#10;Now comes the complication - bumping. If your boat stops in a space that is adjacent to 1 or more others, bumping occurs. To determine where your boat ends up you look at the hex sides facing each other (on your boat and on the adjacent one(s)). You subtract the adjacent boat's hex side number from yours - and if it is positive your boat moves forward that number of spaces, and if negative - the other boat moves forward that number of spaces. Now you check to see if your boat is adjacent to another boat and if so repeat the bumping procedure.&#10;&#10;If your boat is next to more than 1 boat, and has at least 1 positive difference, your boat moves forward. If you have more than 1 positive, add them together and move forward that distance. If you have a negative difference the other boats move in clockwise order.&#10;&#10;For subsequent turns - you can freely change the facing (&amp; thus the hex side number facing forward) by 60 degrees. Moving it further than 1 hexside costs you 1 &quot;log&quot; per extra 60 degree facing change. You then decide whether to move forward or back and resolve any bumping.&#10;&#10;The first boat to the finish wins.&#10;&#10;",
        "artist": "Dietmar Keidel"
    },
    {
        "name": "Devil Bunny Hates the Earth",
        "description": "Second in the seemingly choose-random-words-for-a-plot Devil Bunny series, the idea behind this game is, frighteningly enough:&#10;&#10;You and your friends are honest, hard working taffy pulling machines working in Devil Bunny's taffy factory.  Devil Bunny hates the Earth, for reasons best left known to people who bother to think about such things, and has decided to have his revenge by releasing upon this world the most unsatisfying brand of saltwater taffy known to man.  You and your friends have devised a way to stop him, however.  By luring cute and cuddly little squirrels into the factory and getting them to gum up your works (presumably doing unpleasant things to the squirrel, too) you think you might be able to break yourself, thus foiling Devil Bunny's plot.  Sure, it's a half baked idea, but you're taffy pulling machines, not scientists.  Besides, Devil Bunny's plot isn't likely to succeed anyway.&#10;&#10;The game focuses on distribution of tokens (representing squirrels) in a linear fashion eventually leading to your machine.  However, on certain rolls of the dice, Devil Bunny will come out onto the board and repair (remove tokens from) a machine.  Wacky, fun, quick.&#10;&#10;Awards&#10;&#10;&#10;    2001 Origins Award Nominee: Best Abstract Board Game&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Proton",
        "description": "Proton is, at its basic level, a sliding tile puzzle no different than any number of sliding tile puzzles (like those annoying little things you can get at Stuckey's with numbers from 1 to 15).  However, instead of the traditional numbers, Proton has several tiles depicting two lines - one red and one white - going in various directions.  The idea is that one player tries to connect one of his own colored endpoints to the other of his colored endpoints before the other player does.  To do this, the players take turns moving one tile each, but not being able to take back their opponent's move.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Grant Takes Command",
        "description": "(from the back of the box:)&#10;&#10;Grant Takes Command simulates all the action of this pivotal campaign. This sev&shy;enth volume in the Great Campaigns of the American Civil War series recreates the marches, assaults, and defensive stratagems of these months using the series' interactive game system.&#10;&#10;As a player, you control either the Union or Confederate forces in turns representing one day of real time. The game's map is drawn exclusively from Civil War period maps from state and county archives. Twelve scenarios are provided, ranging in scope from one-day battles and cavalry raids that can be played in an hour to a grand campaign game that links in maps from other games in the series.&#10;&#10;The game focuses on Grant's Overland Campaign to Richmond with the Army of the Potomac but also captures the action in the Bermuda Hundred and Shenandoah Valley side theaters. Grant Takes Command is sure to appeal to anyone with an interest in this decisive chapter of the American Civil War.&#10;&#10;Contents:&#10;&#10;    2 22&quot;x32&quot; Mapsheets 3 Countersheets &#10;    2 Rule and Scenario Booklets &#10;    1 Off-Map Display Card &#10;    2 Charts and Tables Cards &#10;    2 6-sided dice &#10;&#10;&#10;&#10;&#10;Time Scale: One day per tum&#10;Map Scale: 2,000 yards per hex&#10;Unit Scale: Division, Brigade, and Regiment&#10;Players: One, two, or teams&#10;Playing Time: 1 to 24 hours depending on scenario&#10;&#10;&#10;(BGG description:)&#10;&#10;The seventh installment in the acclaimed Great Campaigns of the American Civil War series, Grant Takes Command covers Grant's overland campaign to Richmond in 1864.&#10;&#10;Grant Takes Command features the long-awaited GCACW standard rulebook (so now you can play all the games in the series from one set of rules), a by-now standard beautiful map by Rick Barber, a series of small tournament-style scenarios as well as  campaign games ranging from really big to monster, and - for those with plenty of time - two scenarios linking the map areas of Grant Takes Command, Stonewall in the Valley, and On To Richmond.&#10;&#10;",
        "artist": "Rick Barber,Keith Rocco"
    },
    {
        "name": "Wilderness War",
        "description": "(from GMT website:)&#10;&#10;Wilderness War takes two players into the French &amp; Indian War, 1755-1760, the climactic struggle between France and Britain for control of North America. It uses strategy cards and a point-to-point map similar to GMT's award winning For the People and Paths of Glory. Players maneuver and fight over a map stretching from Northern Virginia to Canada. As the leader of French or British forces in North America, you will need to defend your frontier, raid your enemy's frontier, build fortification networks through the harsh wilderness, recruit Indian allies, besiege forts and fortresses, and deal with events occurring in Europe that are above and beyond your control.&#10;&#10;Wilderness War includes a deck of strategy cards for conducting campaigns and incorporating the many events and personalities of the war. The French player can recruit up to sixteen different Indian tribes as allies, secure a continental alliance in Europe against Great Britain, sortie his squadron at Louisbourg, force a ministerial crisis in London, and work toward draining support for the war from the provincial assemblies. The British player can recruit Mohawks and Cherokees, plan for and conduct amphibious operations, implement a global strategy via William Pitt, destroy the French fleet at Quiberon Bay, and expel the Acadians. Relive the history of this exciting time when the fate of Canada hung in the balance.&#10;&#10;SCALE:&#10;&#10;    TIME 6 months per turn&#10;    MAP Point-to-point system&#10;    UNIT Battalions, Regiments, and war parties&#10;&#10;&#10;&#10;&#10;NUMBER OF PLAYERS:       Two&#10;&#10;COMPONENTS:&#10;&#10;    271 full-color, die-cut counters, including stand-up leader counters and circular Irregulars    &#10;    One 22x34&quot; full-color mapsheet Note that 2010 Reprint version includes a MOUNTED mapboard&#10;    70 Strategy Cards:&#10;    16-page Rulebook&#10;    24-page Playbook (including a 6-page Example of Play)&#10;    2 Player Aid sheets&#10;    One 6-sided die&#10;&#10;&#10;&#10;&#10;DESIGNER: Volko Ruhnke&#10;DEVELOPER: Rob Winslow&#10;MAP &amp; CARD ART: Mark Simonitch&#10;COUNTER ART: Mark Simonitch &amp; Rodger B. MacGowan&#10;&#10;&#10;&#10;(BGG description:)Wilderness War is a card-driven wargame, dramatically simpler and more streamlined than either For the People or Paths of Glory, but the complexity still exceeds the classic Hannibal: Rome vs. Carthage, but only just.&#10;&#10;In Wilderness War, the players get to re-fight the 7 Years War in North America. Although only a single deck of strategy cards is used, &agrave; la We the People, the two sides are dramatically different in character: the French are irregular-heavy (especially Indians) and rely on raiding to tie down the superior numbers of British Regular &amp; Provincial drilled troops, who will themselves be intent on sieges and trying to force a pitched battle. Like Hannibal: Rome vs. Carthage, the fortunes of war turn as the game goes on: the French are masters early, with the crushing British manpower advantage accruing late.&#10;&#10;A lot of the interesting aspects of this war are covered through rules or special cards, from the early recalcitrance of the colonial assemblies and infighting amongst the colonials to the very different natures of the battles of outposts and sieges and the raiding in the backwoods.&#10;&#10;Wilderness War is by the designer of the more recent Labyrinth: The War on Terror, 2001 &#226;&#128;&#147; ? and Andean Abyss and other GMT COIN Series games.&#10;&#10;",
        "artist": "Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "1829",
        "description": "1829 was the first of the 18xx series. First published in the mid-'70s it was way ahead of its time. The game works by alternating stock dealing rounds and operating rounds. Stock dealing rounds allow players to buy shares in the available railway companies. Operating rounds allow the presidents of those companies to build track, run trains &amp; generate revenue for shareholders.&#10;&#10;This basic system has been much copied and is an integral part of all 18xx games.&#10;&#10;The original board covered the southern half of Britain, from the south coast to Darlington. In 1981 a northern board was published covering northern Britain &amp; Scotland.&#10;&#10;Where 1829 differs from most others in the 18xx series is the means by which track is laid. Companies each have a token on the board called a Survey Party. Track is laid by moving the company's Survey token and placing a track tile in the area just vacated... if it is still vacant. This mechanism was discarded in the later 18xx titles, and creates much more of a tactical tile-laying game. It also slows down the game, and 1829 is one of the longer 18xx titles. A typical game can take anything from 4 to 10 hours to play.&#10;&#10;In 1994 Francis Tresham published 1825, which is largely a modular version of 1829 with simpler rules and a few other enhancements. It plays quite differently from 1829, though, as 1829 was always about competition for routes.&#10;&#10;The board gaming hobby has in its history a few landmark games, which redefine a part of board games in general, or even spawn an entire genre. 1829 is just such a landmark.&#10;&#10;Expanded By:&#10;&#10;    MSK 1 Extension Kit for 1829 (Northern & Southern Boards)&#10;    MSK 2 Extension Kit for 1829 (Southern & Northern boards)&#10;    MSK 3 Extension Kit for 1829 (Northern & Southern Boards)&#10;    MSK 5 Extension Kit for 1829 (Northern & Southern Boards)&#10;    MSK 6 Extension Kit for 1829 (Northern & Southern Boards)&#10;    1829 Conversion Kit&#10;    1829 Northern Board&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Trump: The Game",
        "description": "In Trump: the Game players compete in two parts.  In the first part, players circle the board, feeding money into the eight available properties, then bidding on those properties (not being able to see how much the property is worth) and collecting Trump cards :).  When all the properties are gone, the negotiation phase begins.  Players use their Trump cards to buy and sell properties, some cards award huge payoffs for specific sets.  After each player has passed their turn, the property values are revealed, and the player with the most money wins (usually in the $400-$600M range).&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Whatzit?",
        "description": "WHATZIT?&trade; are cunningly disguised names, phrases and sayings that are turned around, upside-down, sideways or jumbled up.&#10;&#10;You need to work out the hidden word or phrase on each card. It could be the size, position or direction that will give you a clue. Sometimes, the pictures combined with a word or a number will give you your answer&#10;&#10;1987 - BOARD GAME:&#10;&#10;In 'Whatzit?' the object is to solve rebus-like puzzles.  (PLAY PLAY might be &quot;double play&quot;)  The roll of a die determines if you play solo, against everyone, or challenge a specific opponent.  The winner moves the roll of a d6.  Special spaces allow you to take a shortcut by solving a tougher &quot;Wicked Whatzit&quot;.  First to the top of the board wins.&#10;&#10;The Rose Art edition of the game has new puzzles. The puzzles are divided  into three categories of difficulty. The more difficult the puzzle, the more points it is worth. Four puzzles from each category are placed randomly in a the three by four frame. Players must solve puzzles which are orthogonally to the previously solved puzzle. The first player to reach an agreed to number of points is the winner.&#10;&#10;HISTORY:&#10;&#10;Known as WHATZIT?&trade; in the USA and Canada, KATCH-ITS&trade; in Australia/NZ and DINGBATS&reg; in the UK and rest of world, are syndicated internationally, in newspapers, best-selling books and TV shows. The family board game was voted &lsquo;Game of the Year&rsquo; in the UK and &lsquo;Toy of the Year&rsquo; in the USA. Since then, over 2 million DINGBATS and WHATZIT board games, travel games and best-selling books have been created.&#10;&#10;2009/2010 - iPHONE &amp; iPOD TOUCH VERSION OF BOARD GAME:&#10;&#10;Celebrating the 30th Anniversary of 'WHATZIT?' (since the first 'WHATZIT?' were published in Newspapers in 1980), Paul Sellers, the inventor of 'WHATZIT?' has created a new version of the game for iPhone and iPod Touch.&#10;&#10;You can play against the clock and see if you can achieve the fastest time in the world. This highly-addictive assortment contains 15 levels of 'Sellers' favourite 180 mind-boggling puzzles for the first release and will be adding more card packs in future releases.&#10;&#10;'WHATZIT?' is available for download on the iTunes App Store now, and you can see the new website http://www.whatzit.com, which also has a link to the 'WHATZIT?' Boardgame for iPhone.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Chainsaw Warrior",
        "description": "It's the year 2032. A warp has opened up in the old Municipal Buildings in the heart of old Manhattan and bizarre creatures are flooding through into our dimension. Goading them on is Darkness, a malevolent entity who intends dragging the city of New York back through the warp - destroying it utterly!&#10;&#10;Many brave men died assailing Darkness' stronghold before they remembered you. In the past you have done the Special Forces Unit many favors... but now you must come out of retirement to face the toughest challenge of your glorious career. Equipped with all the latest in high-tech armaments you must battle your way into the very heart of Darkness' domain and defeat him within the hour - or the city you love will be destroyed!!&#10;&#10;Chainsaw Warrior is a nail-biting game for one strong-nerved player. Yes, it is a solo game - just you against the clock! Can you save New York? Remember, you only have one hour!&#10;&#10;Expanded by&#10;&#10;    Life & Death & An American Chainsaw&#10;&#10;&#10;&#10;&#10;",
        "artist": "Dave Andrews,Chris Baker,John Blanche,Colin Dixon,Brett Ewins"
    },
    {
        "name": "Risk 2210 A.D.",
        "description": "Risk 2210 A.D. is yet another entry in the long series of Risk variants.  Set in the not-so-distant future, battles are now fought by machines of destruction, known as MODs, for short.  Human commanders still lead these mechanized troops, but these commanders each have special powers and abilities.  These come into play via the use of Command cards, which add a new dimension to the game.  Now the battle is not just for the continents, but the sea and moon are also battlegrounds.&#10;&#10;Although much has been added, the basic flavor of the game is still Risk.  One welcome change is the institution of a five-turn game limit, which allows the game to play to completion in about three hours.  Further, players must also factor in economics in the form of energy.  This energy is used to purchase command cards, bid for turn order, and hire new commanders.  There is much more strategy and planning involved in this new version, but it should still appeal to the classic Risk fans.&#10;&#10;Re-implements:&#10;&#10;     Risk&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Nippon Rails",
        "description": "Explore the ancient land of Nippon! Build a railroad empire in the land of the rising sun. Use your initial investment to build track. Then pick up commodities where they are grown, mined, or manufactured and deliver them to a lucrative place of demand. Complete a delivery and make the money you need to buy larger, faster trains, and expand your railroad empire. Win the game by building the most effective railroad empire!&#10;&#10;With the countless variations of play provided, Nippon Rails &ndash; an Empire Builder game and part of the crayon_rail_games series &ndash; provides a challenging region for the creation of your network. Obstacles are rival tracks and Japan's great mountains, channels, and rivers and restrictive coastline. Capture the can-do spirit of Japan and build an empire.&#10;&#10;Nippon Rails is considered to be among the more challenging maps, given many narrow portions that are susceptible to purposeful blockage by opponents. The design includes a unique tunnel feature that links the main island Honshu to the northern island Hokkaido.&#10;&#10;The second edition of Nippon Rails is for 2-3 players, with a variant that allows for play with up to six.&#10;&#10;",
        "artist": "Brian Blume,Peter Y. Bromley,Chris Ferguson,Mike Russo"
    },
    {
        "name": "North American Rails",
        "description": "A standard of the crayon rail systems.  This particular version encompasses Canada, Mexico and the continental United States. It is part of the crayon rail games.&#10;&#10;",
        "artist": "Peter Y. Bromley,Mike Russo"
    },
    {
        "name": "Spree!",
        "description": "From the game cover:&#10;&quot;Springtime. Midnight. The Mall is beckoning.&#10;Welcome to LeGrand Mall, the oldest and most poorly secured indoor mall in the world. It's as airtight as the Titanic and as solid as a wet paper bag. This place just begs to be robbed.&#10;&#10;Enter you, and your infantile collection of friends. It's not enough to simply loot this mall. No, you have to do it with a certain amount of flair. Which boils down to an all-night looting race, with shopping carts, flashlights, and guns.&#10;&#10;The object? Park your car, dash into the mall, and load your shopping cart with the goodies on your list. You can snitch stuff out of the stores if you like, but it's even more fun (and easier) to steal it from your friends. And that would explain why you're carrying a huge gun.&quot;&#10;&#10;The 2nd edition is called Spree! Hong Kong Edition and includes a variant of &quot;a bunch of extra violence we've never tested&quot;, such as Running People Over. There is also the promise of a Mecha-Zoid Spree.&#10;&#10;",
        "artist": "Phil Foglio"
    },
    {
        "name": "The Willow Game",
        "description": "In The Willow Game, you play one (or more) of the characters from the movie.  Your characters are either Good or Evil.  If you are Good, you must try to keep the baby, Elora Danan, out of the evil Bavmorda's clutches and take the child to safety.  If you are Evil, you must try to find the baby, capture her, and take her to Nockmaar Castle.  One of the Good characters starts with Elora Danan, but the Evil players do not know who.  Thus the Evil players move around the board, searching for the Good characters and fighting them in an attempt to capture the baby.&#10;&#10;The Good characters begin weak, but become more powerful as the game progresses.  They move about the board, searching for Places of Power and gaining Treasures which make them more powerful or enable them to free people who will protect Elora Danan, which is one way for them to win the game.  The other is to become powerful enough to defeat Bavmorda in combat.&#10;&#10;",
        "artist": "Janet J. Kramer,Ron Miller,Romas"
    },
    {
        "name": "Scrutineyes",
        "description": "Players look at a cartoon drawing with lots of details.  A die is rolled, and half of the picture is obscured.  Players must then write down as many things as they can find in the picture starting with a nominated letter.  One point is awarded for each successful find.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Solarquest",
        "description": "Players command a spaceship around the solar system in an attempt to land on and purchase moons and planets in this game similar to Monopoly.  Players must also be aware of their fuel, as certain maneuvers cost fuel, while others are free.  Rent is charged when opponents land on your property, and players are eliminated by bankruptcy, being stranded, or blown to bits in a laser battle.&#10;&#10;",
        "artist": "Valen Brost"
    },
    {
        "name": "Word Yahtzee",
        "description": "Word Yahtzee is another addition to the Yahtzee family, which is one of the most recognised dice games in history. However instead of numbers, letters and words take center stage.&#10;&#10;Players still have a maximum of 3 rolls in a given turn but now players have 7 dice at their disposal. The dice in Word Yahtzee contain a set of letters similar to that on offer in Scrabble and each letter is also tagged with a value, which is used in creating a score when a player meets one of the criteria.&#10;&#10;The targets to aim for include words of certain lengths (top half of the score pad), whilst the bottom half includes categories such as 2 words, 3 words, all vowels and all consonants to name a few.&#10;&#10;To achieve a Yahtzee a player must be able to form a 7-Letter word.&#10;&#10;At the end of each game the highest score is declared the winner but like classic Yahtzee, players an play all 6 games featured on a single page and combine those scores to play a more epic game.&#10;&#10;Word Yahtzee is a word dice game.&#10;&#10;",
        "artist": "NA"
    }
]