[
    {
        "name": "Dragonlance",
        "description": "In the Dragonlance Boardgame, each player commands an army of dragons in search of the fabled Dragonlance.  The first player to snatch the Dragonlance from the top of the central tower and successfully deliver it back home wins!  But be careful!  Your opponents will attack your dragons, trying to make them crash-or even steal the Dragonlance and use it against you.  The game comes with a large hex mapboard, 30 dragons figures in six different colors, two sets of rules (Basic and Advanced), Cards, dice, altitude markers and more.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Shanghai Trader",
        "description": "Shanghai Trader is a game of wheeling and dealing, vice and corruption set in Shanghai. As an adventurous trading baron, you must rip off the economy for as much as you dare and escape the city with the largest international bank account before civil disorder ends the game and your life.  In making your fortune, you will have to establish a trading empire by hiring a number of different workers. However you always run the risk of being shanghai'ed to Old Chinatown, where all manner of skullduggery occurs. You will have to collude with other players, attend special events, or even resort to hiring the services of special contractors to... 'trouble' ...your rivals.&#10;&#10;",
        "artist": "Penelope Donavan"
    },
    {
        "name": "Ace of Aces: Handy Rotary Series",
        "description": "Ace of Aces is an innovative 1-on-1 combat game that simulates a dogfight between WWI aircraft. Each player has a book with pictures of what they see out the cockpit of their airplane. Each player selects a maneuver (bank left, barrel roll, etc.) and tells their opponent a page number to turn to. This new page, when cross indexed with the maneuver made, gives the page number that shows the results of the chosen maneuver. The object of the game is to get your opponent in your sights and shoot them down.&#10;&#10;There are advanced rules for fuel consumption as well as a campaign game.&#10;&#10;",
        "artist": "Joe DeMarco,Jerry Redding"
    },
    {
        "name": "The Hills Rise Wild!",
        "description": "[from a session report]&#10;&#10;The game is basically a miniatures game, but based on H.P. Lovecraft's Cthulhu Mythos.&#10;&#10;Each player has a &quot;family&quot; of misfits who are seeking to locate the legendary Necromonicon and bring it safely to &#10;their lair. Of course, to do this, they must do battle with the other families, attempting to slaughter them before they can find the treasured book. Yep ... it's mass carnage.&#10;&#10;Move, invoke special powers and battle. That's about it. Thankfully, the board is small, so you encounter your opponents by the second turn and from then on, it is a constant series of battles and deaths. That means dice rolling ... LOTS of it. Since each character has a special power, quite a bit of time is spent reading the player charts to discover what each character's powers are and how to use them.&#10;&#10;",
        "artist": "Dennis Detwiller"
    },
    {
        "name": "Crimean War Battles",
        "description": "The original SPI set is a quad game, containing four battles:&#10;&#10;    Alma&#10;    Tchernaya River&#10;    Balaclava&#10;    Inkerman&#10;&#10;&#10;&#10;&#10;The Decision Games version contained only:&#10;&#10;    Alma&#10;    Tchernaya River&#10;&#10;&#10;&#10;&#10;Crimean War is a tactical level game on the battles that were fought on the Crimean Peninsula in the mid-1800's. Units are (presumably) companies of infantry, cavalry and artillery. The game has Standard Rules and scenario specific Exclusive Rules. Standard Rules cover the game system and include things like movement, fire combat, melee combat and rallying. Exclusive Rules are special rules that apply to the scenario in question. Each game has one 22&quot; by 17&quot; map and a countersheet with 100 counters.&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "Dragonhunt",
        "description": "Dragonhunt is a game for two to six players. Each player portrays one of the valiant Hero Kings of Arawan. The winner of the game is the player who succeeds in slaying Brimstone the Dragon with the Kingdom's Magesword. That person alone will be acclaimed by all as winner and Paramount King of Arawan.  Avalon Hill Complexity - 3.&#10;&#10;",
        "artist": "Chris White (I)"
    },
    {
        "name": "Thunder Road",
        "description": "Thunder Road is Milton Bradley's answer to Mad Max. You rocket your team (three cars and a helicopter) down a stretch of post-apocalyptic highway and try to either wipe out the other teams or outdistance them and leave them in the dust. Each turn consists of a dice roll to determine car movement and a combat phase where you try to shoot or ram your opponents. The gameboard consists of two pieces of highway and when the lead car exits the front piece of highway, the back piece is placed in front (after dumping all the wrecks and slowpokes off of it) thus creating a never-ending gameboard.&#10;&#10;",
        "artist": "Paul Alexander"
    },
    {
        "name": "Buffy the Vampire Slayer: The Game",
        "description": "Now it's up to you to help Buffy and her friends stop the spread of Evil in Sunnydale!  Which villain and his minions will plague the town?  The Master?  The Judge?  The Mayor?  Or Adam?  Each game recreates one of Buffy's four most exciting challenges... use your own strength and skill to outwit them all!  Patrol the board.  Collect cards and gain power.  Roll dice to fight and cast spells.  Finally, rid Sunnydale of Evil to win!  But don't slack... or Evil will slay you first!  Comes with gameboard, pewter Buffy icon, Phases Chart centerpiece, 5 Good Player &amp; 13 Evil Player pawns and stands, 84 Evil, Weapon, Research, Help &amp; Artifact cards, 4 Villain tiles, 4 Good Player cardholders, 1 Evil card stand, 10 dice, 10 life counters.&#10;&#10;Same theme and nearly identical name, but a different game from Buffy the Vampire Slayer: The Board Game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Pipeline",
        "description": "2-4 players attempt to connect the wellhead in the center of the board to one of their oil tankers on the edge of the board. Each player has a hand of pipe tiles of different types (straight, elbow, T, cross, plug) with which to direct the line.&#10;&#10;Won Games Magazine Game of the Year award in 1992.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Rummikub",
        "description": "The game is based on the traditional middle-eastern game of Okey. First created in the 1930s and sold in hand-produced versions until the late 1970s.&#10;&#10;Similar to the Rummy that you play with cards - you try to get rid of all your tiles by forming numbers into runs of 3 tiles or more, or 3 to 4 of a kind. The colors of the numbers on the tiles are like card suits. This game may start rather uneventfully, but when the players start putting more and more tiles in play, the options for your upcoming turns can become more complex, challenging, and exciting (from areyougame.com).&#10;&#10;",
        "artist": "(Uncredited),Sławek Wiechowski"
    },
    {
        "name": "Goosebumps: Terror in the Graveyard Game",
        "description": "This is a game that is a favorite of the kids.&#10;&#10;This game must be assembled inside the game box. Once constructed, it presents a graveyard, with movement spaces, hedges that cannot be crossed, moving tombs, and a crypt containing a headless ghost. The ghost must be defeated in order to win.&#10;&#10;Each player has two character pawns--only one of which they may chose to move on each turn. They move as far as is permitted by the amount shown on their die roll. Also on each turn, the tomb die is rolled, and one of the tombs is moved. This tomb movement alters the playing field by changing what some of the spaces on the game board represent. In this way, a player might land on a square that is safe, but after a tomb is shifted--they suddenly find that they are left &quot;paralyzed with fear.&quot;&#10;&#10;There is complete freedom of movement, except as stated above, and players cannot cross their own path. One of the special spaces is a &quot;Goosebumps&quot; space. On this space, the player draws a Goosebumps card. Some cards require players to perform an action straight away, others allow players to play now or later. One card allows play at any time.&#10;&#10;During the game, players attempt to foil each other by picking up cards that allow them to turn other players into monsters, move other players onto bad spaces, steal each other's cards, etc. After a player has been turned into a monster, they can only be cured by landing on a &quot;magic potion&quot; square. If you are unfortunate, you can also fall into one of the open tombs--that character of yours is then stuck there until the end of the game. Characters can fall into tombs only by the movement of the tomb--In other words, they cannot be moved directly into a tomb.&#10;&#10;Once a player reaches the crypt, they may attempt to defeat the headless ghost. In order to do so, they first must have picked up a ring card. At the crypt, the player drops the skull down the chute--if it falls the right way, then the headless ghosts springs into the air and the player wins. If not, they can attempt to defeat the ghost on their next turn.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Aquarius",
        "description": "The groovy card game that's kind of like dominoes (only better!) Aquarius features three types of cards: Elements, Goals, and Actions. Element cards are played kind of like dominoes, with each player trying to win by connecting seven panels of one particular element. Goal cards determine which element each player is going after, and Action cards allow players to shake up the action in five different ways. The game is fast, fun, colorful, and easy to learn.&#10;&#10;",
        "artist": "Andrew Looney"
    },
    {
        "name": "Chrononauts",
        "description": "In Chrononauts, each player becomes a time traveler, with a unique identity and a secret mission. During the game, players travel backwards and forwards through history, doing all those things people have always dreamed of using a time machine to do: Visiting the great moments of the past, peeking into the future, collecting up impossible artifacts and priceless works of art (at the moment just before history records their destruction), coming to grips with the paradoxes of time travel, and of course, changing pivotal events and altering the course of history itself. How would the timeline be different if Lincoln and JFK had not been assassinated? And is that the version of reality that you came from originally... the one you must return to in order to win? It's all packed into a fast and easy Fluxx-style card game that will take you to the beginning of time and back again.&#10;&#10;Prequel:&#10;&#10;&#10;     Early American Chrononauts - can be played together in a combined game.&#10;&#10;&#10;Expanded by:&#10;&#10;&#10;     Chrononauts: Lost Identities&#10;     Chrononauts: The Gore Years&#10;     several promo cards, though many of these are available in the current base game&#10;&#10;&#10;Re-implemented by:&#10;&#10;&#10;     Back to the Future: The Card Game&#10;&#10;&#10;",
        "artist": "Alison Frane,Derek Ring"
    },
    {
        "name": "2038: Tycoons of the Asteroid Belt",
        "description": "2038 is a space mining adaptation of the 18xx series of games.  First, you have the ever important stock trading rounds followed by operating rounds where you try to deliver commodities mined from the asteroid belt.&#10;&#10;Instead of laying track, the players explore the asteroid belt and lay claims to various mining resources. During operation rounds, ships move from mine to mine limited only by their fuel and the players' refueling stations. Operation is thus more flexible than in most 18xx games, and the randomly generated map greatly increases replay value.&#10;&#10;",
        "artist": "Thomas Lehmann,Michael McLaughin,John Stoltenberg,Jeff Sturgeon"
    },
    {
        "name": "Axiom",
        "description": "Axiom is a two player strategy game that is played in three dimensions.  The board is made up of twelve cubes, six of each color. Each player has two pawns which snap into the indentations on the cubes.  The object is to capture one of the other player's pawns.  On a turn, a player can move one of their pawns over the surfaces of the cubes, or move one of their cubes to change the playing surface.&#10;&#10;At Essen 2008, a new version was released with a new physical design: smooth curved pawns, held into the indentations by magnets.&#10;&#10;",
        "artist": "Michael Seal"
    },
    {
        "name": "Carcassonne",
        "description": "Carcassonne is a tile-placement game in which the players draw and place a tile with a piece of southern French landscape on it. The tile might feature a city, a road, a cloister, grassland or some combination thereof, and it must be placed adjacent to tiles that have already been played, in such a way that cities are connected to cities, roads to roads, etcetera. Having placed a tile, the player can then decide to place one of his meeples on one of the areas on it: on the city as a knight, on the road as a robber, on a cloister as a monk, or on the grass as a farmer. When that area is complete, that meeple scores points for its owner.&#10;&#10;During a game of Carcassonne, players are faced with decisions like: &quot;Is it really worth putting my last meeple there?&quot; or &quot;Should I use this tile to expand my city, or should I place it near my opponent instead, giving him a hard time to complete his project and score points?&quot; Since players place only one tile and have the option to place one meeple on it, turns proceed quickly even if it is a game full of options and possibilities.&#10;&#10;",
        "artist": "Doris Matthäus,Anne Pätzke,Chris Quilliams"
    },
    {
        "name": "Lord of the Rings",
        "description": "This game should not be confused with Reiner Knizia's children's game (Lord of the Rings) with the same title, or with his very different two-player Lord of the Rings: The Confrontation.&#10;&#10;Lord of the Rings is a co-operative game where the object is to destroy the Ring while surviving the corrupting influence of Sauron. Each player plays one of the Hobbits in the fellowship, each of which has a unique power. The game is played on a number of boards: the Master board indicates both the physical progress of the fellowship across Middle Earth and the corrupting influence of Sauron on the hobbits, and a number of scenario boards which detail the events and adventures of particular locations. Progression across the boards is determined by playing cards (many of which represent the characters and items of Middle Earth), and the effects of corruption are represented by a special die. The game is lost if the ring-bearer is overcome by Sauron, or won if the ring is destroyed by throwing it into the volcanic fires of Mount Doom.&#10;&#10;Lord of the Rings - Limited Edition&#10;&#10;A special edition limited to 500 copies in the English language and 250 in German published by Sophisticated Games and Kosmos in November 2001. The Limited Edition has a silver 22 carat gold plated ring, pewter Hobbit playing pieces, and a signed and numbered John Howe print. Box signed by Reiner Knizia.&#10;&#10;",
        "artist": "Bluguy,John Howe"
    },
    {
        "name": "Screaming Eagles",
        "description": "Screaming Eagles is a jet fighter dogfight with a unique board that allows for some bizarre moves. players control 1 or 2 fighters &amp; try to shoot each other out of the sky with missiles or cannons. Movement direction is determined by card play and movement distance is determined by die roll. When your fighter moves off the front edge of the board, it &quot;loops&quot; back to the back of the board and continues. Damage is assessed by die roll and several hits are needed to bring down a plane (unless you hit the cockpit or the fueltank). A great quick play with some new strategy and an &quot;advanced&quot; version in the rules.&#10;&#10;Remade into Mission Command Air&#10;&#10;",
        "artist": "Paul Alexander"
    },
    {
        "name": "Cartagena",
        "description": "Cartagena takes as its theme the famous 1672 pirate-led jailbreak from the fortress of Cartagena. Each player has a group of six pirates, and you want to be the first to have all six escape through the tortuous underground passage that connects the fortress to the port, where a sloop is waiting for them.&#10;&#10;To move a pirate, you need to play a card from your hand. Each card bears one of six symbols (dagger, pirate hat, etc.), and when you play a card, you move one of your pirates forward to the next matching symbol in the tunnel, leapfrogging over matching symbols where another pirate already stands. The only way to get more cards, however, is to move backwards; more specifically, you move one of your pirates backwards to the first space that holds one or two pirates, drawing one or two cards after doing so. Each turn, you take 1-3 actions, whether moving forward or backward or both.&#10;&#10;When you move a pirate to the end of the track, it jumps on the sloop where it must await the other pirates in its crew. With every step toward victory, though, you have fewer and fewer pirates to move each turn, possibly locking you in to actions you don't want, so be sure to plan ahead and not leave yourself empty-handed!&#10;&#10;",
        "artist": "Christoph Clasen,Didier Guiserix,Martin Hoffmann,Tomasz Larek,Claus Stephan,Studio Tapiro"
    },
    {
        "name": "Attila",
        "description": "In 375 A.D., Attila's mounted Huns overran Europe causing the Germanic tribes in their path to flee and penetrate the outer provinces of the declining Roman empire. In Attila, the players influence the migrations of the Germanic tribes to the Roman empire. The winner is the player who has exerted the best influence on the most successful of the tribes.&#10;&#10;Players have a hand of cards which correspond to the invading tribes. A turn consists firstly of playing a card and placing the matching tribal marker onto an area of the board, expanding from their start areas, then secondly either repeating this or increasing their influence in that tribe. If a province now contains 5 tribal markers in total, war breaks out between the tribes. The basic strength of each tribe is the number of markers there, but each player can add matching cards from their hand to boost this. The weakest tribe is eliminated (or rather, all tribes with the lowest total), leaving the province at peace and with no possibility of further tribal markers being added. Scoring occurs four times during the game at the end of each century; the first century ends after one war, the second after a further two and so on. The player with the most influence in each tribe scores 1 point for each tribe marker, the player in second place scores one point per area the tribe is in (thus if there is only one tribal marker of one sort in each area both 1st and 2nd will score the same). The influence a player gains increases in each century, so large swings in control are possible.&#10;&#10;Players are thus aiming to expand tribes in which they have the most influence (and conversely, are gaining influence in the tribes they expand) whilst at the same time trying to manipulate the timing and provinces where wars happen with a view to protecting their own favoured tribes and eliminating others. Gameplay is therefore not just about playing out as many of 'your' tribes as you can as you will need matching cards to defend with, and in any case may simply not have the right cards in hand. And sometimes you will want to provoke a conflict, for example by adding a tribe you don't have much influence in to finish an area where one of your favoured tribes is strong.&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Wizards",
        "description": "This is Avalon Hill's game of Fantasy Adventure.&#10;&#10;This game uses hexagonal modular map sections used in Avalon Hill's Magic Realm and later utilized  in Mayfair's Catan, providing a different board layout for each game.&#10;&#10;Map tile-sections are placed on a blank mapboard to make up the arrangement of the Enchanted Islands for that game.&#10;&#10;Most of the game consists of performing various mini-quests by moving around the 18 islands to pick up marker counters for the specific quest.&#10;&#10;Each quest adds to the 10 quest per fortnight (14 days) requirement. Failure to reach this total of quests among all players causes one of the 18 islands to be flipped over and taken out of the game.&#10;&#10;In this way the players are competing mainly versus the game system.&#10;&#10;Endgame consists of players racing against each other to be first to collect 6 Gem Fragments and take them to the High Druid.&#10;&#10;",
        "artist": "Coral J. F. Mosbø"
    },
    {
        "name": "Battle of the Bands",
        "description": "Players race to get a set number of &quot;Superstar Points&quot;, through paid gigs and hit singles, using the familiar &quot;draw-one play-one&quot; method. You build your band using member cards, and equip them with instrument cards and reputation cards. When a &quot;gig&quot; card comes up, the players all roll 1d6, then add in the bonuses from their band members, the highest roller getting the gig. &quot;Contract&quot; cards allow you to start playing &quot;Hit Singles&quot; on yourself (for more &quot;Superstar Points&quot;), and other cards affect your band and gameplay in various different ways.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Schrille Stille",
        "description": "Players are the heads of 1 of 6 fictitious music companies, trying to predict/influence the popularity of 14 different musical acts. Each turn, players get 7 chits with +/- values on them, 5 of which they may use to secretly vote for the bands they want to support. Players are awarded points at the end of a round if one of their bands is in the top 6 slots. Players also have 2 special chits that either award extra points if played on a band that jumps to #1, or add/deduct points based on how far up (or down) a band moves from its original position. Some bands in the last 4 slots are removed at the end of a round depending on their original board position, and the top 3 are removed (one-hit wonders) once a player's score reaches the 30 and 50 point mark. The game ends once a player reaches 70 points total. Very nice artwork and goofy band names (as only the Germans can do it) are complemented by one of the cooler game components ever; a wooden &quot;CD Player&quot; that the DJ (dealer) uses to tally up the votes.&#10;&#10;Please be aware that, although this was formerly listed as a family game, a few of the band names contain adult language.&#10;&#10;Online Play&#10;&#10;&#10;     BrettspielWelt (real-time)&#10;&#10;&#10;",
        "artist": "Bluguy,Victor Boden"
    },
    {
        "name": "For the People",
        "description": "(from GMT website:)&#10;&#10;For the People is a grand strategy game of the American Civil War covering the conflict from Texas to Pennsylvania, from the firing on Fort Sumter to the end at Appomattox Court House. You take the role of either President Lincoln or President Davis and command the armies, promote and relieve generals, conduct amphibious assaults, dispatch cavalry raids, and even battle incompetency and political intrigue among members of your own cabinet.&#10;&#10;For the People includes a deck of strategy cards for conducting campaigns and incorporating the many events and personalities of the war. The Confederate player can build ironclads, naval mines (torpedoes), submarines, conduct overseas purchases, and work towards foreign intervention. The Union player can build up his naval blockade, his ironclad fleet, fight draft riots, secure the Border States, and issue the Emancipation Proclamation. Relive the history of this exciting time when our nation was torn asunder.&#10;&#10;TIME SCALE:     4 months per turn&#10;MAP SCALE:     Point-to-point system&#10;UNIT SCALE:    6,000 men per strength point&#10;NUMBER OF PLAYERS:    One or two&#10;&#10;COMPONENTS&#10;420 full-color, die-cut counters&#10;One 22x34&quot; full-color mounted mapsheet&#10;130 Cards [101 Kb pdf]&#10;40-page Rule and Scenario Book&#10;Player Aid Card&#10;Two 6-sided dice&#10;&#10;DESIGNER: Mark Herman&#10;DEVELOPER: Mark Simonitch&#10;MAP &amp; CARD ART: Mark Simonitch&#10;COUNTER ART: Mark Simonitch &amp; Rodger B. MacGowan&#10;&#10;&#10;(BGG description:)&#10;&#10;This is the 4th entry in the We the People system of games, following Hannibal and Successors (but pre-dating Paths of Glory, which is arguably more of a spin-off than a follow-on). The playing area is much larger than say Hannibal, there are lots more forces and generals, and there is a much more complicated political control/strategic will system - as well as quite a few other significant elements. While still clean and streamlined for a complicated wargame, this is nontheless more of a serious hobby game than any of the previous entries in the genre.&#10;&#10;&#10;(Note from Mark Herman:)&#10;&#10;The game was reprinted and the latest and final version of the rules has incorporated all of the previous FAQs plus has re-written some of the more troublesome rules sections (rivers). To date, after a grueling three-year on-line tournament, no rules questions of note have been forthcoming. The above write up is mistaken when it states that &quot;For The People&quot; is based on &quot;Hannibal v Rome&quot;, but was my second game in the &quot;We The People&quot; genre that I created. The game dropped my battle card system in lieu of a more traditional combat results table to speed play and increase historical accuracy.&#10;&#10;UPDATE:&#10;The 2006 edition, component description above, was recently released. Other than the use of color in the rules and the play aids, the only difference between this and the 2006 edition is I added some variant rules to the rulebook. This rulebook is available from GMT games as a free download.&#10;&#10;",
        "artist": "Rodger B. MacGowan,Kurt Miller,Mark Simonitch"
    },
    {
        "name": "Chronology",
        "description": "Chronology is a card game of all time. More specifically, during the game each player builds a timeline of cards, with each card listing an historical event and the year in which it occurred.&#10;&#10;At the start of the game, players are dealt two cards, which are then placed face up in chronological order. On her turn, a player is read an event from a new card; the player must then indicate the position on her own timeline where the card should be placed. If she's correct, she takes possession of the card and inserts it in her line; if not, the next player gets a crack at it, and so on. The first player with ten cards wins.&#10;&#10;Some versions of Chronology have players compete to create a timeline of only five cards.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Election",
        "description": "snipped from the box:&#10;&#10;Someone once said:  &quot;The General Election is like a game.  To win,  you have to be a crafty schemer,  a shrewd planner,  and an accurate mud slinger.&quot;&#10;&#10;Now the General Election is a game.  An entertaining game for adults and older children based authentically on the British General Election.  You're one of 6 parties:  Independent,  Nationalist,  Conservative,  Socialist,  Labour,  Liberal.&#10;&#10;As you move from area to area fighting for votes,  you challenge other players parties.  Can you,  for instance,  counteract the Socialist' appeal to workers in the North East?  Can you reduce the Independents' support among housewives in the midlands?&#10;&#10;Is a combination of a slur campaign and brilliant TV broadcasting enough to shift white collar workers in the South and West to your party?&#10;&#10;Your objective is to win enough votes to get a majority of the 635 seats in Parliament.  And if you have to make a few hollow promises . . . well that's politics.  This game is about as realistic as it's possible to be,  in fact.  There are no dice of course.  Who ever heard of an election with dice?&#10;&#10;GAME CONTENTS:&#10;Playing Board&#10;6 Party Leaders&#10;6 Indicators for Popularity Index&#10;25 Absentee Vote Tokens&#10;138 Electoral Tokens (23 For Each Party)&#10;24 Floating Vote Tokens&#10;50 Campaign Cards&#10;Instruction Book.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "New England Railways",
        "description": "This, the second game in the Early Railways Series following Lancashire Railways is set in New England. The game's core mechanics include bidding for the right to build track and then shipping goods over that track to gain income.&#10;&#10;Mechanically, this game is identical to Lancashire Railways, though the map is naturally unique to this game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Corsairs",
        "description": "Corsairs is essentially a card game where players attempt to assemble the correct combination of provisions in order to be able to board galleys, whilst possessing a strong enough crew in order to board the ship and fend off their opponents potential counterattacks. The game comes with 30 galleys tiles in five different colors. Four of these galleys are placed face-up on the table and are ripe for the taking. Each galley indicates the combination of provisions which must be played before a player can attempt to board it. In addition, each galley indicates the victory points it is worth, as well as the 'boarding' strength, which must be met or exceeded for it to fall prey to the pirates.&#10;&#10;Players are each dealt an initial hand of six cards, most of which depict one of six different types of provisions (water, bread, meat, rum, bananas or beans). In addition, several cards depict corsairs (pirates) with values ranging from 2 - 4.&#10;&#10;On their turn, players must play 3 cards. They may play them:&#10;&#10;a) beside a galley to begin amassing provision cards so as to eventually match the provision requirements indicated on the galley. &#10;b) to the discard pile, replacing them with cards chosen from rummaging through the discard pile&#10;c) 'fire a broadside' by playing any card to the discard pile and rolling dice. He may then steal matching provisions placed by the galley by other players.&#10;&#10;Once a player assembles all of the necessary provisions, he can attempt to board the ship. He needs to have enough corsairs, to add to the roll of two dice to beat the boarding value of the galley. Other players may also attempt to board the galley at the same time, and the one with the highest boarding value wins it. The others lose all the cards played next to the galley. A new galley is then made available.&#10;&#10;The winner is the player with most VP from galleys boarded.&#10;&#10;(precis from the review by gschloesser)&#10;&#10;",
        "artist": "Oliver Freudenreich"
    },
    {
        "name": "Razzia",
        "description": "There are six different (but equal) gambling joints where bits representing money are distributed at the beginning of each round. The object of the game is to finish with the most money. Players simultaneously choose a card from their hands to play. Each card corresponds to one of the six gambling joints and depicts either a gambler or a cop. The cards are revealed, and in each gambling joint where a gambler has been played, the money will be awarded, &agrave; la Hoity Toity/Adel Verplichtet, to the gambler unless a cop has also been played in the joint, in which case the cop gets it; if a cop  shows up but no gambler, the money stays where it is for the next round. When two gamblers or two cops both claim the money in the same joint, a negotiation mechanism which may involve the roll of a die comes into play. You have to do well in the simultaneity sweeps to get into contention at all, but doing well in the negotiation can make the difference between coming in first or second.&#10;&#10;The game comes in a small package about the size of a videotape and is attractively decorated in a sort of mid-1970s Gil Kane/Joe Giella DC Comics style.&#10;&#10;Re-implemented by:&#10;&#10;    Pick Picknic&#10;&#10;&#10;&#10;&#10;",
        "artist": "Comicon S.L."
    },
    {
        "name": "Circus Minimus",
        "description": "This game borrows its theme and rule basis from the Avalon Hill game, Circus Maximus.  This newer version has considerably fewer rules and variability to navigate, but this simplification isn't a bad thing.  Players are charged with racing around the ancient Roman Coliseum in a desperate bid for the finish line.  Players use a small allotment of gold coins at the beginning of the game to select combinations of weapons, chariots, or drivers.  Once the race starts, players use whips to urge their teams, or savage the other players or other players' teams.  A system also features driver fatigue, control checks and bodily damage.&#10;&#10;",
        "artist": "Dean Essig,David Pentland"
    },
    {
        "name": "Mausoleum",
        "description": "In this Edward-Gorey-inspired card game, players invite their wealthy relatives to parties where they meet with horrible accidents, and their inheritances are used to build lavish tombs, with the end goal being to build the largest Mausoleum. Cards represent your various relatives (Petulant Brats, Eccentric Widows, Bumbling Gardeners, Clever Nephews, etc.), the horrible accidents that befall them (Lost in the Hedge Maze, Fallen Down the Well, Mildly Suspicious Suicide, etc.), various graves, and &quot;incidents&quot; which have various affects, like causing an heir from an opponent's party to go &quot;On Holiday&quot; before (s)he could be done in, or causing an opponent's dead relatives to be &quot;Misplaced&quot;, and thus negating their value.&#10;&#10;Home Page: http://studiohunty.com/sg/mausoleum/info.html&#10;&#10;",
        "artist": "R. Hunter Gough"
    },
    {
        "name": "Feudal",
        "description": "Chess-like strategy game in the 3M Bookshelf Series utilizing medieval character pieces.&#10;&#10;The GENERAL Index Article List:&#10;&#10;     The GENERAL Vol.15,No.5&#10;        &ldquo;Feudal: A New Approach&rdquo; (Alternate Rules for Combat Resolution and Movement) Mike Chiappinelli&#10;    &#10;&#10;&#10;&#10;&#10;contents:&#10;-16in. x 16in. map board&#10;&#10;-6 armies with 14 characters each&#10;-a divider screen&#10;-4 screen holders&#10;-rulebook.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Tip Tap",
        "description": "In TohuWabohu, a.k.a. Tip Tap, players must race to finger the right items on the table &mdash; but winning an item isn't good enough as you need to protect it from being stolen while still hunting for more.&#10;&#10;In more detail, you set up the game by placing all of the multi-colored and strangely shaped cardboard bits on the table. Each round, one player is the director and takes charge of flipping over a card that depicts one or more of these bits. Everyone races to place a finger on the depicted items first, and once you've placed a finger on an item, you can't move it again. Once all the depicted items are found (assuming they were correctly figured), the fingerers place those items in front of themselves, then the director flips another card. If a card shows an item previously claimed, the owner of that item must secure it with a finger; if they don't, any opponent who touches it first will steal it away.&#10;&#10;If a player has seven or eight bits in front of them, then the round ends and everyone scores one point for each item that they collected. After playing as many rounds as the number of players, the game ends and whoever has scored the most points wins.&#10;&#10;",
        "artist": "Martin Hoffmann,Franz Vohwinkel"
    },
    {
        "name": "Golf Masters",
        "description": "Golf Masters is part of the line of physical dexterity games published by Goldsieber published under the DSF imprint (see also: Tennis Masters).&#10;&#10;The game is played like real golf over a series of 18 holes with a target number for par. Each hole is constructed from some combination of the six modular boards or a subset thereof. A recommended tournament course is provided. There are special rules for each of the course hazards, including trees, sand traps, and ponds.&#10;&#10;Included in each game are two golfers of molded plastic and a metal club that extends through the body to a crank. By twisting the crank, the golfer will swing the club to hit a small fuzzy ball down the course.&#10;&#10;The game is scored like real golf.&#10;&#10;Includes German, English, French, Italian, and Dutch rulebook.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Pop Belly",
        "description": "2-4 players feed the pigs... trying not to cause them to have Fette Bauche (full bellies). Unfortunately, when the pigs are full, they explode. (This is not considered good pig farming technique.) The player who &quot;popped the pig&quot; receives no points, while the other players get points equal to the number of chips they had in the pig. Memory plays a major part in this game,  as does wise dispersal of your chips.&#10;&#10;WHAT THEY'LL LEARN: Counting, Fine Motor Skills, Eye-Hand Coordination&#10;&#10;",
        "artist": "Gabriela Silveira"
    },
    {
        "name": "...und tschüss!",
        "description": "...und Tsch&uuml;ss! means &quot;So Long!&quot; and is a simple card game where players compete for successive scoring cards on the table by laying cards with the lowest total. The trick is, there is one scoring card fewer than the number of players, so someone always goes empty handed. A bit like musical chairs.&#10;&#10;The deck has blue cards numbered 1 to 15 and red cards numbered -5 and -10. According to the number of players, you're dealt a hand and then the scoring cards are laid out. So with 6 players, you get 9 cards and compete for 5 on the table. The scoring cards are sorted from lowest to highest and everybody chooses a card from their hand and shows it. The lowest value card wins the lowest scoring card (which could easily be a negative!). That player is out and the remaining players choose another card. Whoever has the lowest total takes the next lowest scoring card and is out, and so on , until there are 2 players left competing for the final scoring card. Again, you add a card to your total, and whoever now has the HIGHEST total wins the last scoring card. Which means that if you can't go for the prize, you try to duck out earlier. Get it wrong and you've no chance of getting points. Play twice through the deck and the highest points scored wins.&#10;&#10;Part of the Goldsieber &#195;&#160; la Carte line of games.&#10;&#10;",
        "artist": "Kai Fujiwara,Franz Vohwinkel"
    },
    {
        "name": "Doge",
        "description": "Three or four players try to gain the most influence by building palazzos in Venice. Influence is placed face-down into city sections. When all is placed, they are revealed in a predetermined order. Having the most influence in a section allows a player to build the most houses and also give control over the adviser for that section. The adviser can be placed somewhere else in the city and adds influence in a later vote. Houses can be traded for Palazzos, and the player with 6, 7 or 8 Palazzos in 6, 5 or 4 city sections is the winner.&#10;&#10;Part of the Goldsieber large box series&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Java",
        "description": "Java is a fascinating island with great potential for development&mdash;especially the undeveloped area of central Java with its fertile soil and rich natural resources.&#10;&#10;These riches are much desired by the rulers of the regions that surround central Java. Each player, as one of the Javanese rulers,  tries to develop the region for himself. Each wants to bring his culture and control to these undeveloped areas. The players irrigate the land and cultivate new rice fields. They build villages and palaces, and create cities from the villages.&#10;&#10;Each desires to be the dominant force in the development of this new area. Players earn fame points for building and enlarging palaces, for creating irrigation systems, and for arranging palace festivals. The player with the most fame points after the final scoring is the winner.&#10;&#10;Java is the second game of the Mask Trilogy.&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "New York, New York",
        "description": "A tile-laying game of sorts, though it could be seen as a card game, it&rsquo;s just that the &ldquo;cards&rdquo; are narrow, tall, and almost impossible to shuffle as they&rsquo;re backed by heavy card.  The object of the game is to build up the New York skyline, consisting of twelve numbered sections.    Each section has four pieces, one in each colour - 48 tiles in all.   Each player has a colour for which they will score.   You start with a hand of six tiles, a &ldquo;draw pool&rdquo; of six face-up, and the rest face-down.   On your turn; you lay a tile, you replace from the draw pool, you replenish the draw pool.   The game continues until all the tiles are laid; though you can stop laying tiles if you want (to &ldquo;protect&rdquo; some of your own colours on show), but once you&rsquo;ve stopped, that&rsquo;s it, and other players can still lay theirs.   At the end, you score for any face-up tile of your colour, with bonuses for getting tiles adjacent.&#10;&#10;",
        "artist": "Erika Binz-Blanke"
    },
    {
        "name": "Titanic: Der Mythos",
        "description": "Into the boats, Titanic is sinking. Card game based on the disaster, released when the big movie came out.&#10;&#10;",
        "artist": "Jürgen Martens"
    },
    {
        "name": "Blindes Huhn",
        "description": "A simple trick-taking game where you are trying to avoid collecting the Blind Hens. The cards are numbered 0-59 and are all dealt out (use a reduced deck with fewer players). Players then take time to sort out their hand as they want to play it. When everybody has fixed their hand, the first trick is lead. You may only play a card from either END of your hand, you may NOT re-order your hand or choose from the middle. Score the tricks you won. Each card with a Blind Hen has some eggs on it, the eggs count against you - minus one point each. But if a trick has more than one Blind Hen in it, you total the Hens and multiply with the total eggs to give the score for that trick.&#10;&#10;",
        "artist": "Design/Main"
    },
    {
        "name": "Illuminati",
        "description": "Illuminati is a classic Steve Jackson (I) game of world domination. Each player takes on the role of a secret society attempting to spread its tendrils into special interest groups throughout the world.&#10;&#10;The game consists of three different cards (illuminati cards, group cards, and special event cards) and money. During a player's turn, a new card is drawn from a deck containing both group cards and special event cards. If it is a special event, the player in turn keeps the card and plays it when desired. If it is a group card, it is turned up along with any other face-up cards. The player in turn may then attempt to take over any group. This can be either a group on the table or a group already controlled by another player. If another player already controls the group it is more difficult to take it over, but not impossible.&#10;&#10;How difficult it is to take over a group depends on the strength of the controlling group, the resistance of the group being taken over, the proximity of the group being taken over to the controlling player's illuminati card (if someone already controls it), and other factors. Once this is determined, both the attacking and defending player can modify the odds further by spending &quot;megabucks&quot;. Once a group is taken over, it has to be attached to the card structure the player already controls. How cards can be attached to each other is limited by in- and outbound arrows on the cards, and maintaining a well-structured tree of groups can be vital to success.&#10;&#10;The winning condition for each player is different and depends on what illuminati card that player has.&#10;&#10;This first edition contains 54 small black and white cards.&#10;&#10;Expanded by:&#10;&#10;    Illuminati Expansion Set 1&#10;    Illuminati Expansion Set 2&#10;    Illuminati Expansion Set 3&#10;&#10;&#10;&#10;&#10;Re-published as:&#10;&#10;    Illuminati:  Deluxe Edition&#10;&#10;&#10;&#10;&#10;CCG Version:&#10;&#10;    Illuminati: New World Order&#10;&#10;&#10;&#10;&#10;Magazine Articles:&#10;&#10;    Imagine (Issue 6 - Sep 1983)&#10;        European Illuminati - New cards.&#10;    &#10;    The Space Gamer (Issue 59 - Jan 1983)&#10;        Illuminating the Post Office - Converting six groups to Illuminati.&#10;    &#10;    Space Gamer (Issue 72 - Jan 1985)&#10;        Death to Deadheads! - Variant rules for Illuminati, The Evil Geniuses Are Here! - Variant new cards for Illuminati, More Groups Illuminated! - A couple more illuminated groups for Illuminati, The Monty Python Illuminati - The British Illuminati, 24 groups, and 3 special cards with a Monty Python theme.&#10;    &#10;&#10;&#10;&#10;&#10;",
        "artist": "Jeffrey D. George,Dave Martin"
    },
    {
        "name": "Weapons and Warriors:  Castle Combat Set",
        "description": "A simple action game.  Basically, you each have a base with 5 or 6 targets (some require multiple hits or hitting things in order).  You also have about 10 men.  You arrange a man on each target, and then place the rest on various grey dots on your base.&#10;&#10;You each have mechanisms to shoot little balls..catapults and crossbows and the like.  You take turns shooting 2-6 balls (depending on the die roll) at each other's targets.  You continue to take turns until you wipe out all of your enemy's targets.&#10; Connecting the two bases is a cardboard strip with trees and grey circles.  You can spend some of your shots to move a soldier towards your opponent on these circles.  You are allowed to place your shooting device closer to your opponent's base at this time...moving it up to be level with the advancing soldier.  However, advancing soldiers are quickly targeted.&#10;&#10;In play, the easy shots (soldiers and simple targets) get knocked out in the first few rounds.  The rest of the game is trying to make the tricky shots.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Mage Knight",
        "description": "WizKids' first game, Mage Knight cleverly applies the CCG concept to miniatures; a &quot;Starter Pack&quot; contains 10 random pre-painted, plastic miniatures, while &quot;Booster Packs&quot; contain 5. Figures' stats are kept track of via dials on their bases, which change depending on how much damage they've taken.&#10;&#10;As in most miniatures games, players each create an army with the same number of points (with each miniature having a different point value), then take turns moving and attacking until all of the opponent's forces are dead or captured, the opponent withdraws, or your pre-determined time limit expires.&#10;&#10;The same figures could be used in two other games:&#10;&#10;    Mage Knight Conquest&#10;    Mage Knight Dungeons&#10;&#10;&#10;&#10;&#10;",
        "artist": "Sandra Garavito,Bob Naismith"
    },
    {
        "name": "Landslide",
        "description": "In an actual Presidential election, one candidate must obtain at least one more than half of the total number of electoral votes in order to be elected, or the vote goes to the House Of Representatives. However, for the convenience of this game, as there may be as many as four candidates dividing 538 electoral votes, the winner is the player with the highest number of electoral votes at the end of the game.&#10;&#10;Oddly, the game uses &quot;votes&quot; as if it were money, and the players bid for states --they can even attempt to steal already &quot;bought&quot; states from each other.&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "Lie, Cheat & Steal",
        "description": "Lie, Cheat &amp; Steal is a political simulation in which the players are trying to be elected to public office. Unlike most political simulations, which are based on how elections are supposed to be run, Lie, Cheat &amp; Steal uses true political methods of vote buying, libel and under the table deals to advance to office. &#10;contents:&#10;-16 Black Eye cards&#10;-16 Feather-In-Your-Cap cards&#10;-24 $ cards**&#10;-game board&#10;-rulebook&#10;-6 pawns&#10;-2 dice&#10;-Money&#10;-vote cards&#10;&#10;&#10;         $ Cards - &#10;    &#10;&#10;&#10;2each (1 collect, 1 pay) &#10;nothing&#10;10,000&#10;20,000&#10;30,000&#10;40,000&#10;50,000&#10;60,000&#10;70,000&#10;80,000&#10;90,000&#10;4-100,000&#10;&#10;1-80,000&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Morisi",
        "description": "The object of the game is for the players to connect cities (gray hexes) via trade routes. These trade routes will pass through the various economic regions of Morisi: farmland (yellow), pastures (orange), wineries (red), timberland (green) and fisheries (blue). Before trade routes can be built, the players must gain knowledge about these various region types by traveling through them with their pawn. As cities are connected by trade, the players&rsquo; success is represented by the size and number of their trading houses in the connected cities.&#10;&#10;A multi-player reimplementation of:&#10;&#10;     Isi&#10;&#10;&#10;&#10;&#10;Reimplemented by:&#10;&#10;     Netzwerk&#10;&#10;&#10;&#10;&#10;",
        "artist": "Coline van Moorsel"
    },
    {
        "name": "Bongo!",
        "description": "Roll the dice, and quickly be the first to identify the right animal!  First, make sure you're looking for the right number from the two yellow dice.  Second, look at the animal dice and find that number of animals among all of them.  Are there more than one animal that match that number?  Then call the third animal!  If nothing matches the numbers, then call &quot;Nothing&quot;!  Call the correct animal, and you win a token for that animal, but be careful not to call the wrong animal, because if you do, then you lose all tokens for that animal.  Whoever is the first to collect two tokens for each animal wins the game!&#10;&#10;If the standard game isn't challenging enough for you, throw in the poacher dice to eliminate certain animals from the call.  If that STILL isn't enough, then include the ranger die (included in the second, boxed edition of the game), which interacts with the poacher dice to further challenge your brain.&#10;&#10;",
        "artist": "Frank Stark"
    },
    {
        "name": "Empires of the Ancient World",
        "description": "Going back to the age of Alexander the Great and Julius Caesar, you control the destiny of your empire--building armies, annexing neutral provinces, trading across the Mediterranean, and fighting battles. The heart of the game is its innovative card combat system. The full-color cards allow the use of pikes, swords, war bands, elephants, heavy cavalry, foot skirmishers, light horse, siege towers, artillery, and galleys. Special cards allow you to develop better military leaders, diplomats, traders, and engineers. However, winning the game is not just about having the largest empire. The player with the largest army will also lose the most victory points, so he had better use his forces well. If warfare is not to your taste then you can trade your way to victory, by having the largest trading empire.&#10;&#10;",
        "artist": "Peter Dennis"
    },
    {
        "name": "Fire",
        "description": "Who would like to spend an evening in front of a fireplace, listening to music that makes you dream, drinking a glass of red wine or even tea.  However, once and again you would have to put some more wood on to keep the atmosphere.&#10;&#10;Similar to dexterity games like Jenga, Fire involves removing rods of different sizes from a stack held in a form without causing the stack to shift, ending the game. Scoring is based on the sizes of rods with the larger rods being worth more points.&#10;&#10;You should also remember, that Fire is hot.&#10;&#10;Similar to:&#10;&#10;    Karamo&#10;    Log Jam&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "M",
        "description": "An abstract strategy game where players attempt to lay tiles such that they border as many other tiles as possible.  Players also collect 2 colors of tiles and avoid the other colors as they will negate your score.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Roads & Boats",
        "description": "In Roads &amp; Boats, players start with a modest collection of donkeys, geese, boards, and stone. With these few materials, players work to develop their civilization. The emphasis in the game is logistical transport as you bring goods to producers to make new goods. But beware, the only thing you own is what is on your transporters, and anyone can use any production facility, or pick up any goods left behind.&#10;&#10;In more detail, this massive set of pieces looks more like a modular game kit than anything else. You get a ton of Settlers-sized hexes in a number of colors for terrain type; hundreds of little counters for the commodities that are produced and the locations where they're produced; wooden disks for all of the donkeys, rafts, trucks, and other forms of transportation you can use; and a roll of acrylic with an erasable marker. The tiles are laid out in whatever scenario you wish to play, and then the clear plastic is taped over the top to secure the entire board. Roads and bridges are drawn on the plastic and chits are placed in the hexes to form the playing surface. The idea is that your transportation units (at first, a fleet of donkeys) travel about and pick items that part produced. However, the only thing that you own is that which is carried by your transports. So you might have a nice, shiny, new truck factory or a gold-filled mine, but anyone can use it or take it, if they collect the necessary components and can transport them to the factory. The ultimate goal is to collect wealth, which is progressively more valuable and harder to manufacture: gold, coins, or stock certificates; and also contribute to the game timer in the form of monument blocks for victory points.&#10;&#10;",
        "artist": "Herman Haverkort,Tamara Jannink"
    },
    {
        "name": "Tennis Masters",
        "description": "Goldsieber attempts to capture the feel of tennis in this oddball dexterity game.  Each player has a  still tennis player figure which is used to volley the ball back and forth across the net.  Under each player, and under the translucent surface of the board is the movement paddle for that player, which dictates how far the playing figure could move for the subsequent turn.  The game field is set up just like a tennis court, with the requisite lines and a net, and the players volley a soft tufted &quot;tennis ball&quot;.  One player serves the ball, and if it lands within the fair territory, the receiving player checks to see if it fell within their movement paddle space.  That player then moves the center of their paddle under the ball and uses their figure to return the ball, and so on until one player scores by their opponent knocking the ball out of play, or by playing the ball in a space where their opponent cannot reach it within their movement zone.  All of the ball volleying is performed by tensing back the racket of the playing figure, and then releasing it to launch the ball across the net.  Scoring is handled just like regular tennis scoring.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Troia",
        "description": "As archaeologists, the players try to reconstruct the individual layers of Troy by excavating puzzle pieces from the site. By publishing their results, players gain reputation (scientific prestige) and get additional digging permits. Whoever gets the highest reputation wins the game.&#10;&#10;",
        "artist": "Thomas Fackler"
    },
    {
        "name": "Wyatt Earp",
        "description": "The aim of the game for each player to earn the most money from capturing famous outlaws. 2 to 4 players take up the roles of Sheriffs who are hot on the outlaws tails, trying to capture the outlaws with most rewards on their heads.&#10;&#10;From the Box:&#10;The Wild West! Tough times and tough characters! Bandits, desperados, rustlers and thieves are everywhere. Take the rolls of the brave sheriffs riding on the heels of these legendary outlaws. Capture Jesse James! Hunt Butch Cassidy and the Sundance Kid! Rich rewards await those brave and daring enough. Just don't let them slip away...&#10;&#10;From the Publisher:&#10;In Wyatt Earp, the players are bounty hunters who work cooperatively and competitively to try to capture the most notorious outlaws of the old west. They do this by collecting and playing sets of cards for the various outlaws. When a player plays a set, he both adds to the reward and improves his chances for collecting the reward for that outlaw. At the end of each hand, players collect money for the outlaws that they helped in capturing. After several hands, the player who has collected the most money in rewards is the winner!&#10;&#10;While not officially included, Wyatt Earp is often considered part of the Mystery Rummy series.&#10;&#10;This game is #1 in the Alea small box series.&#10;&#10;",
        "artist": "Vincent Dutrait,Franz Vohwinkel"
    },
    {
        "name": "Ivanhoe",
        "description": "Take on the role of a knight and join the prestigious tournaments at the king's court. Use your cards to win the jousting competitions, and to fight with your sword, axe or morning-star. Rally your squires, gain the support of a maiden, and play action cards against your opponents.&#10;&#10;Clever use of action cards can change the type of tournament that is in progress. One card will 'unhorse' you, forcing everyone still in the jousting competition to switch to a weapon battle of the action card holder&rsquo;s choice.&#10;&#10;Other actions cause you to drop whatever other weapon you are using and resort to hand-to-hand battles in which the player with the most cards- not the highest point total- will win a token. Depending on the number of players in the game, the first player to win four or five different tournaments becomes the overall victor.&#10;&#10;There is a lot more strategy involved in the game than first meets the eye.&#10;&#10;Re-implements:&#10;&#10;    Attacke&#10;&#10;&#10;&#10;&#10;",
        "artist": "François Bruel,Rodger B. MacGowan,Kurt Miller,Mark Simonitch"
    },
    {
        "name": "Way Out West",
        "description": "In this western themed game, players are looking to drive cattle across the west, establishing towns.  If you don't like the way something is going, you can fight other players for control with your cowboys.  You can rob the bank, rustle cattle, and shoot those pesky farmers!&#10;&#10;Gameplay:  To Start each player receives a set of colored player counters, matching turn order token, and two black action tokens and either $20 or $25 depending on number of players.  The dice are rolled to determine the start player. Each player in turn order will place one of their cowboy counters in a town box of any of the 5 towns on the map until each player has placed 3 cowboys.&#10;&#10;Each turn the players will bid for turn order, take actions and move the turn marker one space.  To bid for turn order each player places an amount of money under their turn order token in current player order.  Players may either raise or drop out.  If a player drops out all money bid so far is paid to the bank and their turn order token is placed in the furthest available spot from start player space on the turn order track.  This continues until one player remains and becomes the start player for the round.&#10;&#10;During the action phase each player will take 1 action in turn order.  After everyone has taken a turn they repeat the procedure.  The actions available are limited in number so turn order is important in doing what a player wishes to do.  Actions available are: Buy Cattle in a town containing their cowboy(s), Purchase more Cowboys, Move Cowboys to different towns, Move Cattle from one town to another, Purchase Buildings or Transport counters in a town, Take a Farmer(reduces income and victory points from Cattle in the town they are placed), or Gunfight.&#10;&#10;There are six different building and transport counters: StageCoach (these earn $1 per cowboy when cowboys are placed in or moved from the town containing the player's StageCoach), Train (this doubles the income gained from all players Cattle in the same town and doubles victory points gained from Cattle at game end),  Bank (earns its owner $2 for each building or transport counter in the same town), Store (earns the owner $1 for each Cattle counter belonging to other players in the town and $2 per Farmer counter in town),  Hotel (earns $1 for each cowboy belonging to other players in same town), Jail (the sheriff in the Jail acts as an extra cowboy controlled by owner that can be added to Gunfights). Cattle and Farmers also earn money for players during an income round.  Each Cattle counter earns its owner $2 UNLESS the town also contains a Farmer (it only earns $1 if this is the case).  Oh, the Farmer and Cowmen can't be friends.&#10;&#10;Gunfights can be started to take over another players Building or Tranport counter, rustle Cattle, rob a Bank or remove a Farmer or Jail.  The player choosing the Gunfight selects the target of the attack.  All Cowboys belonging to each player in the town will be involved.  The remaining player's Cowboys in the town are not involved. However; the owner of the Jail can choose to help themselves, if they are attacking, or they can add the Sheriff to the defender if wished.  Farmers that are attacked defend as a single cowboy.  Banks and Trains both have an intrinsic 1 Cowboy defense in addition to those in town of owner's color.  The player with the fewest Cowboys fires first and immediately removes casualties.  Each 5 or 6 rolled kills a Cowboy.  If the number of Cowboys is tied then firing is simultaneous.  A player may retreat instead of firing by moving each cowboy involved to a different town (only 1 per town) and loses the engagement.  If the attacker wins they take control of the target of the attack and may replace the counter (up to 2 counters if rustling Cattle) with one of their color (except for Banks, Farmers and Jails).  A Jail or Farmer is removed from play and a Bank is robbed.  The successful robber rolls 3 die 6 and takes that amount of money from the owner of the Bank (the Bank remains under owner's control).  If the owner of the Bank cannot pay the full amount (then pays all they have to the robber and the Bank is removed).  Each time a player wins a Gunfight they take a Wanted Counter.  If none remain they take it from another player their of choice.&#10;&#10;Victory:  After taking turns 3,6,9 and 12 income is paid to players as delineated above.  The game ends after round 12.  Victory points are awarded for each Building or Transport counter (1 point per size of town).  So a building in a Town with 4 Building or Transport Counters including itself is worth 4 points to the owning player.  Each Cattle Counter is worth one victory point for the owner.  If a train is in the town each Cattle Counter is worth 2 points.  If a Farmer is in the town Cattle are worth 1 victory point less.  To illustrate, if a Farmer is in same town Cattle counters are worthless unless a Train is also present in the town.  In this case, they would be worth 1 point each.  The player with the most Building/Transport counters and Cattle in a town is considered to control the town and scores bonus points equal to the size of the town (Cattle do not affect town size but do affect control).  The Player with most money gains 5 victory points (2 each in case of a tie).  The Player with the most Wanted counters scores 4 victory points.  The player with most Points wins.&#10;&#10;",
        "artist": "Peter Dennis"
    },
    {
        "name": "Der Garten des Sonnenkönigs",
        "description": "A tactical bidding game.&#10;&#10;The highest bid determines not only the purchase price, but also which object will be sold next. So sometimes it's profitable to pay a little bit more than an object seems to be worth.&#10;&#10;It is a significantly revised version of Canaletto.&#10;&#10;Publication history:&#10;&#10;     First published with the garden motif in 1996 by Bambus as Le Jardin.&#10;     Then published in a fancier edition by Noris in 2000 as Der Garten des Sonnenk&ouml;nigs.&#10;&#10;&#10;&#10;&#10;",
        "artist": "Sabine Mielke,Heidemarie Rüttinger"
    },
    {
        "name": "Real Action Stockcar Championship",
        "description": "Game comes with 1 double-sided board (tracks), dice (used for movement, position challenges, track incidents), pawns for keeping track of lap count, 20 plastic cars (better to use Micro-machine sized toy cars), rulebook, lap sheets (for longer races).&#10;&#10;From their ( http://www.realaction.com ):&#10;&#10;The Real Action Stockcar Championship (RASC) stock car racing board game.&#10;RASC is a fast paced, exciting simulation of stock car racing. Our dynamic  RASC board game comes with 2 different race tracks demanding different racing strategies. Up to 20 drivers experience the thrills of being in the driver's seat of a stock car with the excitement of true racing. All drivers make their own pit and race strategies to win the race and eventually the RA Cup for winning the RASC  championship.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Cranium",
        "description": "Cranium bills itself as the &quot;whole-brain&quot; game.  It's a party game that borrows from a host of other popular party games of recent times.  Players have to successfully complete activities in each of four sections to win:  In &#10; - Creative Cat : A player must clue a word to his or her teammates by drawing it, sculpting it in clay, or drawing it with his or her eyes closed.&#10; - Data Head :  A variety of trivia questions.  &#10; - Word Worm : Players unscramble words, spell challenging words, guess definitions, identify words with letters left out, or spell words backwords.  &#10; - Star Performer : players must whistle a song, impersonate a celebrity, or act out a clue.&#10;&#10;Cranium has elements similar to those of Pictionary, Charades, Trivial Pursuit, Celebrities, Huggermugger, Claymania, etc.&#10;&#10;Expanded by:&#10;&#10;    Cranium Booster Box 1&#10;    Cranium Booster Box 2&#10;    Cranium New York Booster Pack&#10;&#10;&#10;&#10;&#10;",
        "artist": "Gary Baseman"
    },
    {
        "name": "APBA Pro Baseball",
        "description": "If you've ever wanted to manage a real big-league club, here's your chance. MLB Baseball 2000 makes you the manager of 600 real big-league players - 20 players for each of the 30 big-league teams. You call the shots on everything from pitching changes to pinch-hitters to double-switches. The game comes with a card set for the most recent baseball season On each card are the painstaking calculations, derived from formulas honed over 50 years of play-testing, which reproduce with uncanny accuracy that player's actual on-field performance in every aspect of the game. You can play with intact big-league clubs, start up your own league and draft from scratch, or switch things around any way you choose. Actually, with APBA you're really much more than just the manager.. You're the GM, owner and commissioner, too.&#10;&#10;MLB Baseball heads into the new century with a streamlined new look. Cards still provide the same informational wallop but feature striking full-color graphics. The rule book collects all the rules and rosters and play boards into a easy-to-use spiral-bound book, with APBA history, playing tips, league guidelines, and a fantastic quick-start guide that can have you playing APBA MLB Baseball in five minutes!&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "Movie Mania",
        "description": "Movie Mania is the exciting board game designed for complete family entertainment. Containing quotes, questions and phrases from the greatest movies of all time. Two to Four players or teams reveal lines from such classics as Gone With the Wind and Terminator II, then try to identify the movie title and actor/actress who said them. Players may act out scenes or impersonate their favorite actors to help their teammates guess the answers. Six categories are featured: Action/Adventure, Drama, Comedy, Classic/Western, Science Fiction/Horror, and Trivia.&#10;&#10;Includes gameboard, 1 six sided die, 60 second timer, 1 card box containing 330 question and answer cards, 50 score cards, 4 colored game pieces, and 2 pencils&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "City",
        "description": "The board shows a view of a shopping parade from above. Players mark the shops that they own and try to attract customers as they move around the square. The board has a scoring track and there is an element of swindling your opponents.&#10;&#10;From MNG-AJM Games Catalog 2005:  Players purchase shops and then enhance them and buy more shops as the game goes on.  The board shows an overhead view of a city centre around which customers wander - some normal, some big spenders and one thief. A special die is used to let you move a customer - the idea being to direct the spenders to your shops and away from those of opponents while making sure the thief stays away from your shops and goes to as many opponents' shops as possible.&#10;&#10;The game was redeveloped and published as The Market of Alturien, the first game in the Alturien series.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Meuterer",
        "description": "Meuterer is a role selection card game in which players take the roles of crewmembers aboard a merchant ship. Each round, each player reveals goods from their hands that they wish to sell. However, most ports deal in only one sort of good, and only the captain may decide where the ship goes. If a player chooses to become the mutineer, he/she will try to become captain in order to change the destination of the ship. Each player may also have an ally in the fight, and the side which played the most conflict points gets the final word on the ship's destination.&#10;&#10;The player with the most points at the end of the game is the winner. Every time a player sells more goods than the other players or reaches their destination, they score points. Allies to a mutiny also get points.&#10;&#10;",
        "artist": "Marcel-André Casasola Merkle"
    },
    {
        "name": "Hamsterrolle",
        "description": "Imagine a hamster's exercise wheel, divided into numerous segments and separated by low fences (built obviously for a National Hunt racing hamster).&#10;&#10;In Hamsterrolle, the players each receive seven wooden pieces, which they aim to place (one per person per turn) within the wheel without any pieces falling out. Any pieces dislodged are taken back as a penalty, and the first to get rid of her pieces wins.&#10;&#10;",
        "artist": "Andrea Hofbeck,Stefan Sälzer"
    },
    {
        "name": "Dream Factory",
        "description": "Reiner Knizia's auction game about producing movies. In four rounds, players bid on chips representing genuine directors, actors, camera, effects, music, guest stars and agents. These all get placed on players' film-strips, to complete the movie production. So one movie might need 2 actors, but no music or effects and so on. As films are completed, the points value is marked and another film-strip taken. There are two parties each round where players get to pick from offers without paying anything. There are bonus points for first films completed and best films, best directors, even worst film.&#10;&#10;The auction is a basic rising offer with passing until one winning bid remains. Players pay into the pot with contracts as money, and the rest of the players share the pot each turn. So it's a closed economy with players trying to time to bid on what they really need to complete films.&#10;&#10;See Movie Comparison - Traumfabrik for listings of movies and actors in each version.&#10;&#10;",
        "artist": "Damon S. Brown,Olivier Fagnère,Allison Kline,Doris Matthäus,Stéphane Poinsot"
    },
    {
        "name": "Abilene",
        "description": "Bring your cattle to Abilene. Hope that your opponents get only your sick cows. If they get another one, then there is the time for a shootout between your cowboys. The player who manages to bring the most herds to Abilene (and earns the most money) wins.&#10;&#10;The original Hexagames edition supports only 3 players. The Schmidt Spiele edition supports up to 6 players.&#10;&#10;",
        "artist": "Roland Siegers"
    },
    {
        "name": "Tally Ho!",
        "description": "What happens when the hunter becomes the hunted?&#10;&#10;In Tally Ho!, one player takes the role of the hunters and the lumberjacks; the other takes the role of the foxes and bears. Both players hunt each other!&#10;&#10;At first the forest lies peacefully under the face-down tiles. As the players turn the tiles over and move them on the board, the forest awakens and the hunt destroys the serenity of the forest. The lumberjacks cut swaths through the forest to provide hunting fields for the hunters. The bears then use these same aisles to track the hunters and lumberjacks. And both sides hunt the ducks who are just trying to live in peace!&#10;&#10;The two sides are balanced with luck dominating the early game, but skill taking over at the end. Good hunting!&#10;&#10;Originally published by Spear Spiele in 1973 as Jag und Schlag, Kosmos republished the game in 2000 as Tally Ho! / Halali! as part of its Kosmos two-player series.&#10;&#10;",
        "artist": "Rudi Hoffmann,Hanne Horstkötter,Franz Vohwinkel"
    },
    {
        "name": "Saturn",
        "description": "Players take turns placing various sized wooden balls on the carefully balanced structure that resembles the rings of Saturn.  Players must attempt to place their balls on the rings without making the ring touch the table.  Higher points are scored if balls are placed on the outer ring.  Also heavier balls score higher as well.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Kunst Stücke",
        "description": "Players take turns laying down tiles of varying colors and sizes attempting to reach a secret goal in the painting (e.g. 4 contiguous red shapes). Before or after placing a tile players can slide pieces around to adjust the painting to their liking.&#10;  &#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Empires of the Middle Ages",
        "description": "This classic SPI game from 1980 covers the economic and political landscape of Medieval Europe from 771 to 1467 on an area map.  Several scenarios allow players to do anything from a solitaire game during the Charlemagne's reign to the &quot;Grand Scenario&quot; that covers historical trends throughout the period.&#10;&#10;Decision Games published a second edition in 2004, with a differently styled map.  It added optional expansion rules &amp; counters for Armies, Fleets, and Civilization Markers, along with additional Event Cards -- raising their number from 56 to 164.&#10;&#10;At the start of each player's Round, Event Cards are drawn which change the strategic situation (such as Plague or Bounty) or benefit a player in various ways.  The descriptions of the Events contain a great deal of historical information, adding much interest to the game.&#10;&#10;Each player may attempt to perform up to five &quot;Endeavors&quot; per 25-year long Turn.&#10;&#10;There are six types of Endeavors:  Conquest, Pillage, Diplomacy, Defense, Fortification (including building Armies/Fleets) and Ruling. Additionally, moving Armies/Fleets and Taxation may always be performed.&#10;&#10;Endeavor resolution is diceless; instead &quot;Year Cards&quot; which show an array of results for each type of Endeavor are drawn.  The card might also require a Leader Stature Check, which can change the player's Combat, Administration, and Diplomacy ratings.&#10;&#10;Endeavor resolution is affected by the appropriate Leader rating, and the involved areas' language, religion, population, and Social State (which changes frequently).  Poor performance can lead to Unrest or Rebellion in an Area.&#10;&#10;An area's Social State value rises and falls as a result of Events and Endeavors, and improving the Social State of your empire is an important object of play.&#10;&#10;Optional rules add non-player Raiders and Magnates.&#10;&#10;",
        "artist": "Morgan Crusader Bible,Redmond A. Simonsen,Joe Youst"
    },
    {
        "name": "Pacific Victory",
        "description": "Pacific Victory covers the war in the Pacific during World War II using the Columbia Block game system. Units are represented by wooden blocks which remain upright and hide the type and strength of the unit. A fusion of Columbia's older &quot;Front&quot; system and its newer &quot;Victory&quot; system, the game focuses on the grand strategy of the Pacific war. It provides a number of scenarios that deal with specific stages of the war and also a grand campaign.&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;More Information&#10;&#10;The community of PV players on BGG has created a wiki page for Pacific Victory.&#10;&#10;",
        "artist": "Eric Hotz"
    },
    {
        "name": "Mystery of the Abbey",
        "description": "Mystery of the Abbey is a whodunit game with a twist. A monk has been murdered in a medieval French Abbey. Players maneuver their way through the Abbey examining clues and questioning each other to find out who is the culprit. A masterful game of deduction!&#10;&#10;",
        "artist": "Cyrille Daujean,Julien Delval,Emmanuel Roudier"
    },
    {
        "name": "Piraten-Pitt",
        "description": "Roll the die, move your pawn and grab treasures - but also, each player hides his treasures in a treasure chest having  two compartments. You must remember which side has your jewels and where this side currently is as the chest gets flipped and rotated by opponents.  If you run into Pete the Pirate, you want to be able to open the empty half.&#10;&#10;Contents: board, pirate, 4 play figures, 4 treasure chests, 20 precious gems, special die&#10;&#10;Ages 6 and up&#10;&#10;",
        "artist": "Renate Seelig"
    },
    {
        "name": "Rack-O",
        "description": "The object is to score points. Each round, you replace cards in your rack so their numbers read in any numerical progression from a low number at the front to a high one at the back (the racks hold the cards behind each other); achieving this ends the round. The cards are numbered from 1 to 60; you initially place them in your rack in the order they're dealt. On your turn, you draw from the deck or the discard pile, swapping the card with one from your rack.&#10;&#10;The original publisher was Milton Bradley.&#10;&#10;Re-implemented by:&#10;Super Rack-O&#10;Racko Plus&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "Ultimate Outburst",
        "description": "Ultimate Ouburst is a superset of the original Outburst! featuring 2 extra rounds of play.  ReverseBurst where you hear and answers and guess the topic and Challenge Outburst where you bid against the opponents.&#10;&#10;It also features updated topics.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Breakaway Rider",
        "description": "Simple card game of cycle racing. Players fight to hold the yellow jersey when the race ends.&#10;&#10;Players are dealt 6 cards and draw a 7th before playing a pace card, and any additional modifiers. There are 84 pace cards numbered between 39 and 50, Spurts (which add 2 to your pace), Headwind (which subtract -2 from your pace) and Mountains (which ensure that no one can take the lead from the current player).&#10;&#10;One player starts as the race leader with a yellow token, and plays a speed card. Successive players must match the leader's pace to stay in the Peleton (the race pack), and each enjoys a +2 to their pace card simulating the benefit of decreased wind resistance.  If a player falls more than 2 behind the pack, than they draw chips (representing minutes) equal to the difference from their card and the race pace.  If a player starts his turn not in the Peleton, than he does not get the +2 slipstream bonus.&#10;&#10;If a player plays a card that is faster than the race leader, they either take the lead, or make up time until they catch the Peleton.  If they take the lead, they take the yellow token, and successive players must now match their tempo.&#10;&#10;You must play Headwinds when you draw them, and you can use Spurts as you like.  You play Mountain cards on yourself or the race leader, and they prevent anyone from passing the leader, and they also remove the 2 km slipstream bonus that other player otherwise enjoy.&#10;&#10;The race ends when the deck runs out.  The player holding the yellow token wins and scores a point, the other players lose points equal to the chips in front of them.&#10;&#10;Timing is everything if you plan to win.&#10;&#10;",
        "artist": "Michael Ryba"
    },
    {
        "name": "Werewolf",
        "description": "Werewolf takes place in a small village which is haunted by werewolves.&#10;&#10;Each player is secretly assigned a role - Werewolf, Villager, or Seer (a special Villager). There is also a Moderator who controls the flow of the game.&#10;&#10;The game alternates between night and day phases. At night, the Werewolves secretly choose a Villager to kill. Also, the Seer (if still alive) asks whether another player is a Werewolf or not. During the day, the Villager who was killed is revealed and is out of the game. The remaining Villagers then vote on the player they suspect is a Werewolf. That player reveals his/her role and is out of the game.&#10;&#10;Werewolves win when there are an equal number of Villagers and Werewolves. Villagers win when they have killed all Werewolves. Werewolf is a social game that requires no equipment to play, and can accommodate almost any large group of players.&#10;&#10;",
        "artist": "Corey Fields,Michael Klarfeld,林 憲明 (Noriaki Hayashi)"
    },
    {
        "name": "Lift Off",
        "description": "In Lift-off, players rush to allocate resources for planetary missions.  Each planet is contested by two players, either (or both) of whom can add cards representing, for example, settlers, energy modules, terraforming, or mining to their side.  A given planet may provide mineral resources and a number of settlement points -- the minerals can be collected for victory points, and if the planet is sufficiently terraformed, the settlement points go to whichever player sent the most settlers.&#10;&#10;",
        "artist": "Marcel-André Casasola Merkle"
    },
    {
        "name": "Gerüchteküche",
        "description": "In &quot;Gossip Kitchen,&quot; players attempt to sort through the truth of the many rumors flying around. The deck consists of 10 types of rumors (each with its own symbol, such as a heart) with six cards each, for a total of 60 cards. To begin, one card is removed from play and all the remaining cards dealt out (distribution may be uneven). Players now seek to collect full sets of six rumor cards and deduce which rumor set is missing a card. Players ask another about their hand, e.g. &quot;Do you have three hearts?&quot; Players need only respond with an answer of &quot;more&quot; or &quot;less&quot; if the&#10;number asked is incorrect, and play passes clockwise from the asking player. If the number asked is correct, the questioner receives those cards and play passes to the&#10;answering player. Sets of six rumors collected are placed on the table and score three points. At any point, a player may guess which rumor group is missing, scoring 10 points &#10;for a correct guess and taking a penalty of 5 points for an incorrect guess.&#10;&#10;",
        "artist": "Thomas Hammer"
    },
    {
        "name": "The Great Dalmuti",
        "description": "A light card game where players gain status by going out first.&#10;&#10;The 80-card commercial deck contains cards ranked from 12 to 1, along with two Jesters. Each card bears a number, which is not only its rank, but also tells you how many of that card exist in the deck. In other words, there are twelve 12s, eleven 11s, four 4s and a single card ranked 1. The lower the number, the better the rank.&#10;&#10;The deck is dealt out to all players and the object is to get rid of your cards as fast as possible. The hand begins with one person playing one or more card to the center of the table. The cards played must all be of the same rank (although Jesters are wild, and may be played with any other cards). Each player in turn must now either play the same number of cards of a better rank, or pass. Play continues around the table until everyone has passed; at that point, the cards are cleared and whoever played the last set of cards leads the next round. After everyone has gone out, the players are ranked. For example, the person who first got rid of all his cards becomes The Great Dalmuti. Players change seat position to represent the new hierarchy and begin another round.  The Great Dalmuti is generally played for many rounds.&#10;&#10;Similar to:&#10;&#10;    Dilbert: Corporate Shuffle&#10;    Pyramid Card &#10;    Scum: The Food Chain Game &#10;    Deathtrap Dungeon: Card Game&#10;&#10;&#10;&#10;&#10;",
        "artist": "Sandra Garavito,Margaret Organ-Kean,Christophe Swal"
    },
    {
        "name": "Top Race",
        "description": "Re-issue of Kramer's Formel Eins with tweaks.&#10;&#10;Make as much money as possible, by becoming one of first at the finish line! If you place advanced RACE, you can also make money by betting!&#10;&#10;This game is based on running and betting;&#10;Each player gets 200.000 credits and the deck of &quot;Speed cards&quot; is shuffled and divided among the players, who now sort out the cards in the order they want.&#10;Now the &quot;Contestents cards&quot; are stacked face down. Each card matches the colours of the player pawns (Red, Yellow, Blue, Green, Purple and White). Now there will be an auction of the cards, where you figure our what to buy by the help of your &quot;Speed cards&quot;. Each bidding starts with 10.000 credits and is raised by 10.000 credits. All players have to have at least one (1) &quot;Contestent card&quot;.&#10;&#10;The last player to buy a card starts; (s)he plays a &quot;Speed card&quot; and move all the pawns as the card shows; a pawn can only be moved ahead; either straight or diagonaly; never backwards or sideways. Only one pawn is allowed on a spot, and it is NOT allowed to jump over another pawn.&#10;An example of a Speed card could be:&#10;Blue: 6 spaces&#10;White 4  - &#10;Black (means joker/free choise that is not on the card): 2 -&#10;Yellow: 1 -&#10;The speed cards also include &quot;Sprints&quot; and &quot;Injury&quot;&#10;&#10;The player who's colour is first over the finish line gets 200.000 in price money. Second place pays out 150.000, 3rd 100.000 and so on.&#10;Even if your colour have finished the race you continie playing your remaining speed cards.&#10;The race ends when the fifth player have crossed the Finish line or when all &quot;Speed cards&quot; have been played.&#10;&#10;The card dealing of both SC and CC plus the auction is now restarted and the next race goes on untill the agreed amount of races. The winner is the one with the most money.&#10;&#10;Other games in Wolfgang Kramer's racing series include Detroit-Cleveland Grand Prix and Daytona 500.&#10;&#10;",
        "artist": "(Uncredited),Ferdi Krähling,Mathieu Paquette,Hans-Georg Schneider,Wollinsky"
    },
    {
        "name": "New Orleans Big Band",
        "description": "Players compete to assemble a jazz band in the French quarter. But this singer won't work with that drummer, or that trumpet player won't play in a banjo band, or this saxophonist jumps in value with a clarinet player. Try to assemble the best band. After round 8, players may start trading. The starting player is the best singer. If there's an argument, have a sing-off!  Nominated for the SdJ in 1990.  The German text on the cards makes this difficult to enjoy for non-German speakers.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Die Kette von Saba",
        "description": "extrapolated from session report:&#10;&#10;The theme of the game is based on the legendary necklace of Saba, which went to the grave with its owner upon her death. Sadly, dastardly grave robbers plundered the tomb and the valuable gems which comprised the necklace were scattered across the globe. Now, a wealthy sheik is anxious to reassemble the necklace and present it as a gift to his lovely bride. Players are charged with the task of assisting the sheik, attempting to purchase the many gems at auction and then reassemble the necklace in the proper fashion.&#10;&#10;The board depicts the frame of the necklace, with space for its 36 missing gems. In total, there are 44 gems in the deck, many of which will ultimately prove to be forgeries. Depending upon the number of players, each player receives from 3 - 7 gems to begin the game, along with $20,000. Four gems are revealed from the remainder of the deck and positioned into the frame.&#10;&#10;The game is played in two major phases. During the first phase, players alternate placing a gem up for auction, ala Modern Art. The auctioneer receives the funds from the high bidder, who receives the gem. The winner has the option of keeping the gem, or placing it into the frame. If placed in the frame, the gem earns $2,000 for other gems it touches and those radiating from it in straight lines, including itself. During phase 2, the reward is reduced to only $1,000 per gem.&#10;&#10;Following an auction, the auctioneer has the opportunity to purchase another gem from the deck for $2,000.  &#10;Phase 1 ends when the gem deck expires. Phase 2 then begins with players reconstructing the necklace. In turn, each player places a gem into the frame and earns funds as described above.&#10;&#10;The twist in the game are the rules which must be followed in reconstructing the necklace. The main rules are:&#10;&#10;&#10;     The necklace must be symmetrical, with left and right halves containing the same jewels in the same places. All cards appear twice in the game, so what appears on the left side must appear in the same position on the right side. The only exception to this is the center column. Any duplicate pieces are considered forgeries and are worthless. &#10;&#10;&#10;&#10;     Pieces of jewelry containing the same type of gem must be placed in uniform columns. Thus, the first gem placed in a column dictates what kind of gem must appear in that same column. &#10;&#10;&#10;&#10;     The number of gems on a card can only be one greater than the number of gems on the cards directly above it. &#10;&#10;&#10;Once the first gem is placed in a column, it 'locks' that column AND the corresponding symmetrical column. Only gems which meet the above rules can subsequently be placed there.&#10;&#10;The game ends once the necklace is completed. The player with the most money is victorious.&#10;&#10;",
        "artist": "Wolfgang Friedrich"
    },
    {
        "name": "Australian Rails",
        "description": "Rail fans can experience the thrills of owning, building, and operating railroads in the land down under!&#10;&#10;Explore the outback, build your rail empire across mountains and deserts to build a fortune. But beware dangerous sandstorms and flooding rivers as you stretch your rails across this vast continent!&#10;&#10;Australia Rails is part of the award-winning Empire Builder&reg; series of games, but is a complete stand-alone adventure in the world of railroading. &#10; Using a specially designed board, you will use crayons to draw your rail lines.&#10;&#10;It is part of the crayon rail games.&#10;&#10;",
        "artist": "Peter Y. Bromley,Drew Perkett,Mike Russo"
    },
    {
        "name": "The Fury of Dracula",
        "description": "The premise of The Fury of Dracula is very similar to Scotland Yard, but with additional rules for combat, events, and encounters. One player secretly controls Dracula while the other three players are Vampire hunters cooperating to locate and defeat him.&#10;&#10;Dracula must move around the countryside, evading the hunters while leaving minions and encounters for them to uncover in his wake. If he can hide six new Vampires in Europe without the hunters destroying them, the dark prince will be declared victorious and rule the day!&#10;&#10;Meanwhile, the hunters try to locate and destroy Dracula before he succeeds in raising an empire of undead Vampires. When they occupy the same space as a dark minion, a vampire, or even Dracula himself, then a combat system is used to determine the results.&#10;&#10;Will the hunters be able to stem the tide of darkness, or will Europe be consumed by the Fury of Dracula?&#10;&#10;",
        "artist": "Dave Andrews,Jim Burns,Colin Dixon,Martin McKenna,Bill Sedgwick,Piotr Łukaszewski"
    },
    {
        "name": "1825 Unit 1",
        "description": "1825 is Francis Tresham's &quot;1829 revised&quot; 18xx game. It is released in 3 distinct modules, or units. 1825 Unit 1 and 1825 Unit 2 broadly cover the same area as the 1829 southern board. 1825 Unit 3 covers most of the remainder of England and Scotland, and with unit 2 will cover the same area as the 1829 northern board. Along with the units are a number of expansion kits, which introduce extra money, trains, tiles, companies, and phases. There are currently three, and will be four regional kits, which cover areas of England, Scotland and Wales not included in the three base units.&#10;&#10;The rules are largely 1829 with improvements. Survey parties are now optional, and track is built in much the same way as most other 18xx titles. The stock market is largely the same, but multiple leaps up the market are allowed if dividends are high enough. Trains can now run to, but not through tokened out stations, and company shares become available in &quot;bands&quot; of the same value. All shares in each band become available when one of the companies in the previous band is sold out.&#10;&#10;Play time varies enormously, depending on how much of the game you play. A single unit on its own will last 1 1/2 to 3 hours, and accommodate 2-4 or so players. Multiple units and expansions add to both the number of players and the playing time. Two units and all the expansions should accommodate 3-6 players (7 max. officially) and last for anything from 4 to 8 hours. All three units will work for 4-9 players, and a fair amount longer.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Enchanted Forest",
        "description": "One treasure is hidden under each tree in the forest. As you move from tree to tree, you get to peek at the treasures you find. Can you remember where each one is hidden? When the king asks where one of the treasures is, players race to reach the castle with the right information.&#10;&#10;The 1997 version Wizard of Oz has a few minor rules tweaks to accommodate a four-player game, but is essentially the same game.&#10;&#10;In 2007 Ravensburger released a Dutch version themed around the Fairy Tale Forest in the Efteling attraction park, titled Efteling Sprookjesspel.&#10;&#10;",
        "artist": "Büttner und Plümacher,Dynamo Limited,Walter Pepperle,Wolfgang Scheit,Ulrike Schneiders,Paul Windle"
    },
    {
        "name": "Star Wars: The Queen's Gambit",
        "description": "Based on the four battles at the end of Star Wars Episode One: The Phantom Menace -- the battle on the plain between the Gungan forces and the droid army; the attempt by Naboo forces, led by Queen Amidala, to storm the palace and capture the Trade Federation viceroys; the fight between Darth Maul and the two Jedi Knights; and the space battle in which Anakin's starfighter destroyed the Droid Control Ship.&#10;&#10;The forces are represented by 155 plastic miniatures on three separate boards, including a three-level palace.  The action is driven by two decks of cards for each side.  Each turn, each side simultaneously chooses four action cards from a hand of ten, and places them in order.  The actions are then carried out one at a time, alternating sides.  Combat is resolved using special attack and defense dice.&#10;&#10;",
        "artist": "Clark Mitchell (I)"
    },
    {
        "name": "Karawane",
        "description": "Karawane is for 3-5 players who are involved in a camel race. The object is to bid a limited supply of water chips each round to move your camel across the land to make it to certain oasis spots.  Players collect goods (silk) and the player who gets the most goods at the end of 3 legs of the desert race wins.&#10;&#10;",
        "artist": "Uwe Schildmeier"
    },
    {
        "name": "Turbo Taxi",
        "description": "Flickwerk is a neat little competitive puzzle game, similar in feel to Ricochet Robot. With multiple sets, even more players can participate in the same game.&#10;&#10;Each player has an identical set of 12 tiles displaying part of a network of computer cables. A further set is shuffled and placed face down in the centre of a 3x3 grid, representing the nine rooms through which the cabling will flow. Four markers are placed around the edge of the grid and these represent the only points at which the cabling can leave the grid. The top card of the centre pile is turned over and players have to re-arrange their own tiles in front of them to form a valid network, using the same centre tile as displayed and connecting up the four &ldquo;perimeter&rdquo; markers. First one to complete a valid network wins the centre tile (1 VP). He then rearranges the perimeter markers if he wishes and turns over the next card to be played for.&#10;&#10;The updated edition, Turbo Taxi, features city streets rather than computer cables. The markers on the edge of the grid are a yellow taxi, yellow house, black taxi and black house. Players must ensure that their tiles create valid routes leading the yellow taxi to the yellow house, and black taxi to the black house.&#10;&#10;This game can also be played solo as you try to complete a grid in the least amount of time.&#10;&#10;The contents of Turbo Taxi is:&#10;&#10;1 rulebook (the number may vary for multilanguage editions)&#10;1 city board&#10;&#10;60 cardboard tiles:&#10;&#10;     12 green player&#10;     12 yellow player&#10;     12 blue player&#10;     12 orange player&#10;     12 neutral (with a medal in its back)&#10;&#10;&#10;&#10;&#10;4 wooden pawns&#10;&#10;     2 black pawns&#10;     2 yellow pawns&#10;&#10;&#10;&#10;&#10;",
        "artist": "Lars-Arne \"Maura\" Kalusky,Claus Stephan"
    },
    {
        "name": "Ligretto",
        "description": "In Ligretto, each player has his own deck of forty cards, with cards 1-10 in four colors and a unique symbol on the back to identify which cards are his. At the start of each round, each player lays out 3-5 cards (depending on the number of players) face up in front of him to create his row; places a face-up stack of ten cards, seeing only the top card, next to his row to create his Ligretto stack; and holds the remaining cards in hand face down.&#10;&#10;Playing at the same time, each player tries to empty his Ligretto stack. If he has a 1 on the top of any face-up stack, he plays it to the center of the table. If he has a 2 of the same color as any 1 in the center of the table, he can place the 2 on the 1. All cards in the central piles must be played in ascending order and must be the same color.&#10;&#10;If a player can't play anything, he can reveal cards from the stack in his hand, counting them out in groups of three, then laying them face up while revealing only the top card. He can play this top card onto a central pile as long as he meets the rules for doing so.&#10;&#10;As soon as a player empties his Ligretto stack, the round ends. Each player scores 1 point for each of his cards among the central piles, then loses 2 points for each card remaining in his Ligretto stack. In some versions of the game, the player with the highest score wins; in other versions, players then sort all the cards and play another round, with the first player to reach 99 points winning.&#10;&#10;A rules variant for Ligretto allows a player to play cards from his Ligretto stack or the cards in hand onto the cards in his row, but only if the numbers are in descending order and the colors of adjacent cards are not identical.&#10;&#10;",
        "artist": "Michael Michaels"
    },
    {
        "name": "Mag·Blast",
        "description": "Mag-Blast is a space-themed card game in which each player tries to blast the other players from the universe. Each player assumes command of a race of beings whose powers are signified by the Flag Ship card at the center of their battle formation. The Flag Ship is surrounded on four sides with attack ships from the Ship Yard, up to 3 ships per side. On your turn you discard cards, draw back up to five, call for reinforcing ships (by playing combinations of 3 cards), and then play as many attack and defense cards as possible. Once you blast away an opponent's outer ship protection, you may attack his Flag Ship, hopefully destroying it, and eliminating it from the game.&#10;&#10;Re-implemented by:&#10;&#10;    Mag&#194;&#183;Blast (Second Edition)&#10;    Mag&#194;&#183;Blast (Third Edition)&#10;&#10;&#10;&#10;&#10;",
        "artist": "Bill Heagy,John Kovalic,Manchu,Scott Nicely,Brian Schomburg,B. Swansson"
    },
    {
        "name": "Trivia for Dummies",
        "description": "It's Trivia, done the &quot;Dummies&quot; way.  Players are given a hand of cards which contain all the answers -- the numbers 1-10, true, false, and several colors.  One player reads a question, and whoever plays the right answer first gets to advance around the board and then read the next question.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Dao",
        "description": "From the Designer/Publisher:&#10;&#10;Components:  A 4x4 board, 2 sets of 4 pieces, and 2 players.&#10;&#10;Beginning:  An X is formed with each player's piece aligned &quot;diagonally&quot; from the corners.&#10;&#10;The game consists of only one simple rule and three ways to win. Pieces move in a straight line, including diagonally, as far as possible with no jumps. The three ways to win are arranging your pieces in a straight line on the board (not diagonally), occupying the four corners, or forming a 2x2 square anywhere on the board.  However, the antisocial strategy of trapping an opponent's piece in a corner loses!!&#10;&#10;2001 Mensa Select&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Twixt",
        "description": "Twixt is a 2-player abstract game invented by Alex Randolph. TwixT is a &quot;connection-type&quot; game, very similar to Hex. Other related games are Havannah and The Game of Y. &quot;Connection type&quot; means the object is to form a path connecting something to something else. This requires very different thinking from the standard battle-type game such as chess or checkers.&#10;&#10;Some old US sets mention a 4-player variant, with 2 teams as in Bridge, but this probably wasn't Randolph's idea.  The game was popular in the 60s and 70s as part of the 3M Bookshelf Series. Avalon Hill then acquired the series and issued the game themselves. Several European publishers have sold the game as well.&#10;&#10;Twixt employs a pegboard, pegs and links.  The playing surface is a 24x24 square pegboard, usually minus the corner holes, with two opposite sides marked with one player's color and the other two sides marked with the other player's color.  Each player has a supply of pegs and links of their color.  50 of each piece type of each color, a total of 200, is an ample supply. Players alternate turns placing pegs and links, if possible, in attempt to have a continuous path of links connecting the two sides of the board with their color.&#10;&#10;After the 3M edition, Randolph added the pie rule. After the first peg is placed, the opponent has the option to swap sides. This reduces the imbalance from the first move advantage.&#10;&#10;On your turn you place one peg of your color on the board, and then add or rearrange your color links. Pegs may be placed in any vacant hole in the board except the corners and the last row on the sides of the opposing player. When two pegs of the same color are at opposite corners of a six hole rectangle (3x2 or 2x3), a link may be placed between those two pegs.  Links may not be placed such that they cross other links.  Multiple links may be added on a single move. Usually, all links are to the peg just placed, but on your move you are allowed to remove as many of your own links as you wish, and add your own links anywhere on the board as long as they are legal as described here.&#10;&#10;When a player connects his two sides with a continuous path of links, he prevents his opponent from doing the same, the game is over, and the player connecting his two sides wins the game. If neither side can complete such a path, the game is a draw.&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "Four Dragons",
        "description": "From the designer Frank Branham: A 4 player partnership trick taking game themed around the Mexican Day of the Dead. (A particular favorite holiday of ours, as Sandi and I were married on that day in Marietta Confederate Cemetery.) It is short (about 30 minutes), and rather brain bending.&#10;&#10;Dia De Los Muertos (Days Of The Dead) is played over three days as you send animals, then children, then adults on to the afterlife. It is a basic trick taking game, except that most cards have an action with them. You play as a partnership, and if your side wins scoring cards (the dead or food), you exchange a card with your opponent. Other cards allow swaps between partners, asking a question, cancelling other cards and so on.&#10;&#10;The first time you play, there's a lot of checking the rules, checking the crib sheet, remembering if you exchange cards. You spend more time figuring the game than playing the tricks. But after a couple of hands, it makes sense and you switch to game-playing mode. And here's where it pays. If you enjoy Bridge, can figure out what you partner signals when they swap a card, can read the deck based on what's been played, you will really enjoy Dia De Loa Muertos. If you don't like Bridge, or can't figure trick-taking games anyway, steer well clear. Rather brain-bending it is.&#10;&#10;The original game has nice native graphics of the dead abroad and has a variant for 3 players. The re-issue as Four Dragons has an oriental theme.&#10;&#10;Not to be confused with:&#10;&#10;     Dia de los Muertos (2007)&#10;&#10;&#10;&#10;&#10;",
        "artist": "José Guadalupe Posada,Jacob Walker,Sandi West"
    },
    {
        "name": "Football Strategy",
        "description": "Football Strategy boils the sport down to play calling skill. The game's structure is simple: The defensive player selects one of 10 formation cards (ranging from an 8-man line &quot;goal line stand&quot; to a pass prevent defense with five safeties); the offensive player calls a play (a choice of 20, plus punting). Cross-indexing the choices on a matrix shows what happened. Except for &quot;long gains&quot;, the outcome of each play against each defense is always the same. Dice are rolled only to determine the distance of long gains and the results of kickoffs and field goal attempts.&#10;&#10;Each play consumes a prescribed number of seconds, from 15 to 45. The players mark off the time and play four quarters, following the standard football rules.&#10;&#10;For variety, three types of offense (&quot;pro style&quot;, &quot;aerial game&quot; and &quot;ball control&quot;) are available, each with a different, though not radically different, results matrix.&#10;&#10;Simple though it is, the game is engrossing (see the &quot;More Information&quot; screen), and play generally follows realistic patterns, though the handling of punts and on-side kicks (both more effective than in real life) is questionable. Also, because the design changed little after its debut in 1959, the plays and defenses don't reflect the state of the art in contemporary professional football. This is the era of Otto Graham, not Eli Manning.&#10;&#10;For those who are so inclined, Football Strategy lends itself to mathematical analysis. Many years ago, an entrant into the tournament at Origins went to the trouble of using game theory to generate charts showing the optimal mix of plays in different situations. He reached the finals but, in a victory for human intuition over number crunching, lost the championship game by a touchdown and a field goal.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Pony Express",
        "description": "A very different betting and racing game for 2 to 6 players.&#10;Each player tries to gain control of 2 horses in the 7 horse field and then lead them to victory but first they must win the right to control those horses. There are two parts to each game. First a poker type part where players bet on the horses in an effort to gain control and then a race component where the owners now become jockeys and with the use of movement cards try to lead their horses to victory.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Super Giant Monster Showdown",
        "description": "A card based game of giant monster combat a la Godzilla. Players are dealt cards which they use to build their monsters, defining their abilities, powers, and appearance. Players then draw map cards to create the playing area and the stage is set for the showdown. Monsters move around the map, attacking the terrain and each other. Victory is determined by who destroys the most people, property, and other monsters. Event cards add to the excitement.&#10;&#10;",
        "artist": "NA"
    }
]