[
    {
        "name": "Mouse Chaos",
        "description": "Mouse Chaos is a memory + abstract strategy game.  You have a set of mice to which you need to get to your nest.  This is indicated by a color on the mouse's underside.  During the game, you discover the color of the mice and attempt to get your mice into your nest.  The endgame has a trading aspect where you trade a mouse of a color that is not the home nest's color to the proper owner who in turn may wind up having to trade as well.  Cats and chairs serve as devices to thwart your opponent's movement.  Cheese covers can be used to protect your mice.  The game is well themed with excellent bits.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "H2Olland",
        "description": "H2olland A Celebration Of A Nation!&#10;&#10;H2olland allows players to experience the height of Tulipmania as mayors of four small villages. Players attempt to drain Windmill Lake and quickly plant over the newly gained land in the hope of growing the most expensive tulips next to their Windmills. Players must attempt different activities in the four seasons to attempt to improve their progress in the the six year project. Players not only have to contend with the nasty weather of the North Sea, but also with the fact that the other players are constantly using up the little space the game has to offer.&#10;&#10;",
        "artist": "Richard van Vugt"
    },
    {
        "name": "Celtic Quest",
        "description": "&quot;It's AD 41 and Britain is ripe for invasion by Claudius' legions. You are a young Celt on the brink of adulthood and you have visited the High Druid who has foretold your destiny. In this game each player attempts to win by gathering victory points and fulfilling their destiny. Along the way you'll improve your abilities, trade with settlements, complete quests and help enchant the land. The game uses double sided hextiles so each game is different.&quot;&#10;&#10;",
        "artist": "Matthias Catrein"
    },
    {
        "name": "Kings Progress",
        "description": "From the producer's website:&#10;&#10;After the success of City and Guilds, Steve's new game Kings Progress was inevitable. This game is based upon the typical life of a late medieval English court. Many Kings came under the influence of a select inner group of courtiers who used their influence to gain gifts of land, titles, money etc.&#10;&#10;This game recreates the desperate race to get the best and the most gifts for yourself. The game is played over three rounds; each round the King visits a royal castle or house (The Kings Progress). Your aim is to gain the most prestige for your family by collecting courtier cards, melding them to build your influence and thus gain control of the courtiers, advancing those courtiers to the royal castle and then using the courtiers to select various gifts for yourself. Gifts and courtier control gain victory points at the end of each round. As the game progresses gifts become more valuable. Each courtier also has a character ability which can be used by the player in control to gain extra actions or other advantages.&#10;&#10;",
        "artist": "Matthias Catrein"
    },
    {
        "name": "Euphrates & Tigris: Contest of Kings",
        "description": "A fertile land between the Tigris and Euphrates rivers. Led by powerful leaders, kingdoms and dynasties developed here around 3000 BC. Attacks and coups by neighboring kingdoms are the order of the day. But he who plans well will become the stuff of legend. Haven't we heard this before? Absolutely, but not in this form. Because now, the 'card game conversion' trend among board games has reached Reiner Knizia's classic game Euphrat &amp; Tigris (Tigris and Euphrates). As Euphrates &amp; Tigris: Contest of Kings, it will offer simpler and faster play, but will still be nicely outfitted with about 200 cards and 16 printed wooden discs.&#10;&#10;",
        "artist": "Doris Matthäus"
    },
    {
        "name": "Gemblo",
        "description": "Gemblo is an abstract strategy game with translucent, colored pieces, each of which is made up of one to five hexagons. Each player has an identical set of pieces in a unique color. The goal is to get rid of all of your pieces by placing them on the hexagonal game board. Each piece that you place after the first cannot touch previously-placed pieces of the same color; instead each piece must be a distance of &quot;1&quot; from another piece of the same color, where 1 is the length of a side of one of the small hexagons. Another restriction is that the distance being measured can't directly cross another player's piece, but it can lie at the junction of two pieces. Once all players have placed as many pieces as they can, they count the number of hexagonal units in the pieces they couldn't place, and the player with the lowest score wins.&#10;&#10;Gemblo supports up to six players. In the two-player version of the game, each player uses two colors of pieces.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Soccer Tactics World",
        "description": "SOCCER TACTICS WORLD is the new English edition of Football Tactics 2006 (Fussball Taktik 2006). The box and the board are upgraded with better graphics. The new box is smaller. A new trophy is included and a shooting die for those who do not want to spin (shoot) for a gooooaaaaaallll! The rules are in English and Spanish, with short rules in E, S, French, Italian and Turkish. More languages will be added.&#10;&#10;Included: 2 Teams of WOODEN pawns (11 per team) and a wooden soccer disc, board, 2 score dials, 2 spinners, 2 dice, 1 shooting die, 10 yellow cards, 5 red cards, cool digital timer, &quot;The Beautiful Cup&quot;, rule booklet, short rules sheet.&#10;&#10;SOCCER TACTICS WORLD is not a trivia or historical game. This is fast-paced, real soccer (football)! Everything that you can do in soccer, you can do in this game. This is not only a fun game for kids, but for Fathers and Mothers against sons and daughters; and husband against wife.&#10;       Soccer Tactics WORLD - THE BOARD GAME THAT KICKS!&#10;                   www.soccertacticsWORLD.com&#10;&#10;Soccer Tactics WORLD combines the strategy of soccer with the heart of the game. Eleven players per team on a traditional full-length field. This game includes dribbling, passing and capturing the ball; and intense battles for ball control.&#10;&#10;But watch out! Yellow and red cards can be handed out. There are short and long passes, and offensive and defensive strategies. Free Kicks, Goal Kicks, Corner Kicks and Penalty Kicks. And don't be caught off-side!&#10;&#10;Play a full 90 minute game (or set your own time). This game plays like the real thing. Soccer Tactics WORLD is pure soccer emotion!&#10;&#10;",
        "artist": "Silke Stein"
    },
    {
        "name": "Trivial Pursuit: 1980s",
        "description": "Different to the original Trivial Pursuit: The 1980's that was produced in the early nineties, this edition made its entrance in the twenty-first century on the back of the popularity of all things eighties and the fact that the children of the late seventies and early eighties were now the &quot;High disposable income&quot; generation.&#10;&#10;With only six spaces between each Wedge Space and plenty of &quot;Shortcut&quot; spaces to get you to Wedge spaces quicker, this edition is clearly aimed at a younger generation wanting everything faster. A &quot;Gazumping&quot; Dice allowing you to steal wedges from people is optional to use.&#10;&#10;Categories in this version are:&#10;&#10;    News And Views&#10;    Entertainment&#10;    Living In The 80s&#10;    People And Personalities&#10;    Music And Music Makers&#10;    Sporting Moments&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "XIG: The Four Elements",
        "description": "XIG is a tile-laying game where players try to be the first to complete their own pathway - based on one of four elements: Earth, Water, Fire, and Air - as quickly as possible by laying down puzzle-piece style tiles. However, there are also cards that can help you advance or hinder your opponent. The pathways are sold in complete sets, and booster packs of cards are currently planned.&#10;&#10;Expanded by:&#10;&#10;    XIG 4E: Air Pathway&#10;    XIG 4E: Fire Pathway&#10;&#10;&#10;&#10;&#10;",
        "artist": "Tim Huesken"
    },
    {
        "name": "Wiochmen Rejser",
        "description": "Wiochmen Rejser (Countryfellow Racing)&#10;A Polish game of humor and racing (humor is very specific here and if some of the things are not treated as jokes, the game could be misinterpreted as cruel) where the humor is very much local-based (popular Polish jokes about the countryside and Poland in general) and the racing is one of a kind - carts full of hay (balanced by kids) on the road build with... concrete stolen from the former Russian military bases. Apart from the humor, the game has a very clever mechanics similar to the one from Arena Maximus.&#10;&#10;Cart Race! Dynamic play! Unforgettable fun!&#10;&#10;Do you want to be the first one to get to the local barn for the show with the greatest band in the neighborhood? Do you want to be the best in the whole district? Show how fast your cart is. Get your whip, call the kids for the ballast and hop on the buck - the race is about to start! In &quot;Wiochmen Rejser&quot; only the toughest men win. Be the best driver! Become The HyperCartMan.&#10;&#10;The game was released together with a specially composed for it song by 'Lydka Grubasa' (Fat man's Calf) titled of course 'Wiochmen Rejser'.&#10;&#10;Re-implemented in:&#10;&#10;    Wiochmen 2&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Catchphrase",
        "description": "In this game, each player has a common phrase, which the other players try to guess.  You get clues about the phrase by spinning a spinner, and following the directions, which can include things like how many words are in the phrase, how many letters in a word, or what letters might make up the word.  You track the answers on a board with spots for how many letters, what letters, etc.&#10;&#10;Not to be confused with the party game, Catch Phrase!.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Igels: Das Kartenspiel",
        "description": "Description from the publisher:&#10;&#10;Winter will be coming soon, and the forest creatures must look after their winter food supplies...&#10;Gone are the days where all of them could find enough to eat without having to look very hard ... nowadays, they must fight for it!&#10;&#10;In this card game, you'll take the side of hedgehogs, squirrels, rabbits or mice in the fight for the last food to be found in the forest. In the process, you can make use of all sorts of helpful items that people have &quot;forgotten&quot; in the woods. And there are lots of those items: an abandoned chainsaw, Cola cans, worn out, smelly shoes, illegally dumped oil containers and much more. If you're clever, you can also lure your opponents onto the roadway that people regularly travel through the woods.&#10;&#10;Igels is a fast-paced, funny card game in which the winner is the player with the most food points at the end of the game.&#10;&#10;",
        "artist": "Mario Coopmann"
    },
    {
        "name": "Elasund: The First City",
        "description": "This is the second game in the 'Abenteuer Catan' (Catan Adventures) series that started with Candamir: The First Settlers. The theme of Elasund is based on the 'Die Siedler von Catan' novel written by Rebecca Gabl&eacute;, itself based on the original The Settlers of Catan game. In Elasund, players compete and cooperate to build the premier city of Catan.&#10;&#10;",
        "artist": "Tanja Donner"
    },
    {
        "name": "Sun of York",
        "description": "From the back of the game:&#10;&#10;The Wars of the Roses (1453-1485) were the result of the struggle for the English crown between the Houses of Lancaster and York ... both descended from the Plantagenet line ... both with equal claim to the throne.  By the end of the bloody struggle, both houses would be extinct and the crown grasped by the first of the Tudors.&#10;&#10;Sun of York is a card game depicting the tactical battles fought between the two royal houses.  Represented by the cards are all the day's major leaders, including King Henry VI (too weak a leader to maintain control of the kingdom), Margaret of Anjou (Henry's strong-willed and manipulative queen), King Edward IV (organizational genius and longest holder of the Crown), King Richard III (charismatic leader of questionable morals) and Richard Neville, Earl of Warwick (the &quot;King Maker&quot;).  Troop cards include Levies, Longbowmen, Knights, Cavalry, and mercenaries from the Continent, among others.  Terrain features and Special event cards are also included.&#10;&#10;Every major engagement (and a few minor ones) is included in Sun of York, for a total of eighteen scenarios in all!  Rules for randomly generated scenarios are included as is a campaign system allowing players to fight out the Wars to their bloody conclusion.&#10;&#10;Components include 200 cards, two player aid sheets, and one sheet of 234 status markers.  &#10;[This is a desktop published game.  Players are required to assemble all game components.]&#10;&#10;Now also available (August 2011) through GMT Games as a boxed set!&#10;&#10;",
        "artist": "Charles Kibler,Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "Simpei",
        "description": "This a &quot;tic-tac-toe&quot; style game by the Japanese company Bandai. It features cute little figures which can be placed on some places of the board head-up and in some others head-down. The objective is to get three in a row, but there are some specific rules governing movement and placement.&#10;&#10;The name of the game is pronounced as &quot;shim-pay&quot;. It was named after the designer, Shimpei Takahashi.&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "Berserk: Trading Card Game",
        "description": "In the distant world of Laar wandering armies, led by powerful magicians live a life of battle. For eons they fought for survival in this world, once scorched by fires of the Cataclysm. Now you have the chance to gather your own army and become the maker of your own fate. Perhaps, your path will shape the fate of Laar as well... In fierce battles your life and lives of your trusted armies will only depend on your skill of a strategist and a warlord.  And then, when in the heat of battle you will once forget about your wounds, about the future and about the past - you will understand why this is not simply a game. It is Berserk.&#10;&#10;Over 3000 different cards to collect, 14 different editions.&#10;&#10;1. Battle of Realms (October 2003)&#10;1.1. Equillibrium (expansion) (Spring 2004)&#10;&#10;2. Fall of Darkness (Fall 2004)&#10;2.1. Birth of Heroes (expansion) (Spring 2005)&#10;&#10;3. Will of the Temple (Fall 2005)&#10;3.1. Grip of Chaos (expansion) (Winter 2005)&#10;3.2. Hour of Monsters (expansion) (Spring 2006)&#10;&#10;4. Hammer of Time (Fall 2006)&#10;&#10;5. Silent Watch (Spring 2007)&#10;&#10;6. Rage of Gods (Fall 2007)&#10;&#10;7. Nemesis Angels (Spring 2008)&#10;&#10;8. Interworld (Fall 2008)&#10;8.1. Lost Squadron (expansion) (Winter 2008)&#10;&#10;9. Black Wings (Spring 2009)&#10;&#10;10. Dertakh's Secret (Fall of 2009)&#10;&#10;11. Eclipse (December of 2009)&#10;&#10;12. Vengeance (May of 2010)&#10;&#10;13. Arhaal's Path (October of 2010)&#10;&#10;14. Cataclysm (March of 2011)&#10;&#10;15. Angheim (August of 2011)&#10;&#10;[Special - duel deck]  Orenkholm's Fate&#10;&#10;16.  Flying Fortress (October 2011)&#10;&#10;[Special - duel deck] Angels and Demons&#10;&#10;[Special - collector's pack] Promo Dragons 2012&#10;&#10;17. Shaken Earth (March 2012)&#10;&#10;[Special - duel deck] Curse of Blackwood&#10;&#10;18. Demise of Machines (August 2012)&#10;&#10;19. Voice of Laar (February 2013)&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Universal Fighting System: Penny Arcade",
        "description": "The Penny Arcade cards for the Universal Fighting System.&#10;&#10;From the website:&#10;&#10;&quot;Choose your fighter from the mega-hit webcomic Penny Arcade: the capricious prankster, Gabe, or the malevolent genius, Tycho. This February grab the Penny Arcade Card Game from Sabertooth Games and re-enact their ferocious - and comic - battle for the watch. Sit down with a friend, choose your character, and play out the hilarious battle with attacks and moves inspired by the comic. The card game comes with two sixty card decks in high quality deck boxes, containing everything you need to sit down and play immediately. The cards feature all new art and flavor text from the creators of the webcomic, Mike Krahulik and Jerry Holkins. The Penny Arcade Card Game is also fully compatible, and tournament legal, with the Universal Fighting System (UFS) Collectible Card Game by Sabertooth Games, allowing you to face Gabe and Tycho off against an ever expanding army of your favorite fighter game characters.&quot;&#10;&#10;",
        "artist": "Mohammed Haque,Mike Krahulik"
    },
    {
        "name": "Plext",
        "description": "from the rule book:&#10;&#10;Plext: The Game of Few Words&#10;&#10;The object of Plext is to find as few words as possible that contain, in order, the 14 letter dice.  Make a low bid to prove your vocabulary skills.  If you prove your bid is correct, you score points!  If you are not correct, the next lowest bidder will have a chance at the points.  After 8 rounds the player who has the most points wins!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Zathura: Adventure is Waiting",
        "description": "Based on the movie, players race to reach the planet Zathura. The game is a replica of the one in the film in many ways, incorporating a turn key which produces game cards, a robot which is moved along the board to thwart player progress, and a house puzzle which comes apart.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Scene It? Harry Potter",
        "description": "All aboard the Hogwarts Express!  Test your knowledge of one of the world's most famous wizards with film clips, puzzlers, and questions based on the Harry Potter movies.  How much do you really know about Quidditch, Transfiguration, or the Dark Arts?  You'll find out as you race your friends around the board.&#10;&#10;Fun for wizards and muggles!  You don't have to be a 5th year at Hogwarts to do well at Scene It?: Harry Potter.  On-screen challenges test your powers of observation, word play and puzzle-solving skills, so even if you don't know the first thing about how to brew a Polyjuice Potion, you'll still have a great time playing Scene It?: Harry Potter.&#10;&#10;You may well remember The Monster Book of Monsters, but do you remember how many eyes it has? Don't know?  Don't worry!  You'll see for yourself in the film clip!&#10;&#10;Think you know how to tackle Boggarts and Basilisk, Dementors and dragons?  Let Scene It?: Harry Potter put your Harry Potter film knowledge to the ultimate test!&#10;&#10;Includes&#10;&middot;    1 Game DVD&#10;&middot;    1 Flextime Game Board&#10;&middot;    1 Six-sided Numbered Die&#10;&middot;    1 Eight-sided Category Die&#10;&middot;    4 Category Reference Cards&#10;&middot;    4 Metal Tokens&#10;&middot;    30 House Points Cards&#10;&middot;    160 Question Cards&#10;&middot;    1 Instruction Sheet&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Big Manitou",
        "description": "During the hunting seasons, Indian tribes confront one another in order to establish which of them is the most prestigious one.  They hunt for very high stakes:  Buffaloes, Tipis, Horses and the Sacred Totem.  The player who will play their own Hunter and Hero cards clever and with skillfulness will be the winner&hellip;with Manitou&rsquo;s help!&#10;&#10;Based on Manitou.&#10;&#10;",
        "artist": "Mauro Laurenti,Corrado Mastantuono"
    },
    {
        "name": "Antike",
        "description": "From the publisher's website:&#10;Antike is a challenging strategy game about evolution and competition among ancient civilizations. Ancient nations create cities, build temples, sail the seas, and discover new principles of science and technology. Their legions and galleys open new settlements and defend their people against attacks from their enemies. Two scenarios can be chosen as the game board is two-sided. Players choose from Greeks, Romans, and Germanic tribes and Phoenicians, Carthaginians, Persians, Arabs, Egyptians, and Babylonians.&#10;&#10;Every nation tries to win ancient kings, scholars, generals, citizens, and navigators for themselves. The nation that acquires a specified number (depending on the number of players) of ancient personalities first will win the game!&#10;&#10;Lead one of these nations to victory! But watch out for your enemies, as they will want to conquer your cities to destroy your temples. The game depends not on the luck of dice or cards, but on thoughtful plans and skillful diplomacy.&#10;&#10;",
        "artist": "Mac Gerdts,Alexander Jung,Steffi Krage"
    },
    {
        "name": "Monopoly: Vintage Game Collection",
        "description": "Another edition of this classic game. This edition comes with vintage themed art work and, antique looking pieces, and a beautiful wooden box that is shaped like a book. It fits beautifully onto any bookshelf.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Mental Floss Game",
        "description": "Developed in partnership with mental_floss magazine is a quick and quirky trivia game that you brainiacs will be sure to enjoy. Prod your left brain with sciency stuff, nudge the right side with cultural topics, and do your best to sniff out The Big Fat Lie. All told, there are over 1500 freshly crafted trivia questions in here! Will the Enlightening Rounds propel you forward? Do you throw down that Mental Block card you&rsquo;re holding to slow down an opponent, or hang onto it to save yourself later? Correct answers will earn a Piece of Mind token, which you may lose if you slip up. Collect six, and win the game. Contains game board, 6 play pieces, 250 Floss Fact cards, 200 Enlightening Round cards, 12 Mental Block cards, 36 Pieces of Mind tokens, die, label sheet, and instructions.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "A Victory Lost",
        "description": "A Victory Lost: Crisis in Ukraine, is a simulation of the intense mobile fighting between the Axis and Soviet forces in the southwestern USSR, from the completion of the Soviet encirclement in December 1942 to German Field Marshall von Manstein's famous &quot;Backhand Blow&quot; counterattack.  The Soviet forces aims to trap and eliminate the Axis forces that are in full retreat from the Caucasus, while the Axis forces must successfully withdraw and attempt to restore the front line by launching a desperate counterattack.  The slightest mistake might turn victory into a rout.&#10;&#10;A harsh, cold wind blows across the steppes of Russia. With a flurry of thundering explosions, the Russian offensive Operation Saturn begins. Can the Russians encircle and trap the extended German armies?  Your orders await you...&#10;&#10;Part of the International Game Series game from Multi-Man Publishing&#10;&#10;Game Scale:&#10;Game Turn: 10 days&#10;Hex: 8 miles / 13 kilometers&#10;Units: Division to Corps&#10;&#10;Game Inventory:&#10;One 22 x 34&quot; full-color mapsheet&#10;One dual-side printed countersheet (280 1/2&quot; counters)&#10;One 16-page Victory Lost rulebook&#10;One single-side printed Player Aid Card&#10;One 6-sided die&#10;&#10;Solitaire Suitability: Medium&#10;Complexity Level: Medium&#10;Players: 2 or more&#10;Playing Time: 3-5 hours&#10;&#10;",
        "artist": "Nicolás Eskubi"
    },
    {
        "name": "Handy",
        "description": "The Amazing Five Finger Frenzy!&#10;&#10;Come one, come all to see the amazing Handy game! With your teammates, hold balls between your fingers while more and more balls are added to the &quot;hand tree.&quot; Can you hold steady long enough to win? Don't drop the balls -- and win&#10;&#10;",
        "artist": "Damon S. Brown"
    },
    {
        "name": "Freya's Folly",
        "description": "In Norse legend, Freya, the goddess of fertility and passion, owed at least part of her reputation for irresistable beauty to an enchanting necklace - the Brisingamen.&#10;&#10;You are a dwarf craftsman making jewelery of silver and precious gems. Use your team of dwarfs to mine jewels and set these into settings of fine silver which you can sell to earn prestige among your peers. Of course the grander the jewelery, the greater the prestige, but you have a quota to fill so you must work quickly. Various magical potions and abilities are available through the black market to aid you but you will need to use them wisely. Finish the Brisingamen for Frey and her favours will bring even more prestige than the finest jewelry.&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;==============&#10;&#10;Send your dwarfs racing into the mine to collect jewels with an interesting leap frog action that has them moving fastest when they work together. Once you get some jewels you can complete a piece of the Brisingamen or get a Setting card to create another piece of jewelry. Work on the Brisingamen and Freya rewards you with Free Action tokens that you can use for extra actions or for victory points. Ability cards let your dwarfs move faster, whisk jewels out of the mine, block other player's dwarfs or steal jewels.&#10;&#10;",
        "artist": "Don Bone,Darryl Butler,Barbara Chies,Catherine Eadie"
    },
    {
        "name": "Bone Wars: The Game of Ruthless Paleontology",
        "description": "From the publishers website:&#10;&#10;In BONE WARS, players take the role of paleontologists during the great &quot;Dinosaur Rush&quot; of the late 19th Century.&#10;&#10;Out in the field, fossil hunters must survive natural disasters and attempts by other players to steal and destroy dinosaur bones.&#10;&#10;Back at the museum, the conflict continues when the scientists carry their battle to the newspapers and scientific journals as they race to achieve scientific immortality!&#10;&#10;",
        "artist": "Bryant Johnson"
    },
    {
        "name": "Crossword Pyramids",
        "description": "From the company's Website:&#10;&#10;If you enjoy crossword games and puzzles, you'll love Crossword Pyramids! If you want to improve your family's and friends' spelling, strategic thinking, and mathematical abilities, then Crossword Pyramids is the game for you!&#10;&#10;Crossword Pyramids will provide endless hours of fun allowing players to really use their crossword and spelling skills.  If you want to spell a 12-letter word and dazzle your opponents, go ahead! Bigger is better in this game!  Use your own letters!  Steal your opponent's letters! And, use the letters on the board! The unique design of this game allows players to make words from a constantly changing selection of 60 letters!&#10;&#10;Waiting for your next turn has never been so exciting! Will your adversaries offer better choices or spoil your plan? Every word that your opponents remove from the board offers new opportunities and challenges.&#10;&#10;Challenging? Of course!  Complicated? Not at all! Crossword Pyramids is a superbly planned, easy to play, three-dimensional board game.&#10;&#10;In the tradition of all  CardChess  International games, we are sure that you will feel as if you have played Crossword Pyramids before.  Share in the excitement and remember our motto, &quot;spell to win&quot;.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "World of Warcraft Trading Card Game",
        "description": "This is a collectible trading card game published by Upper Deck in 2006 (Cryptozoic Entertainment took over the license and game in 2010) based on the massively multi-player online roleplaying game &quot;World of Warcraft.&quot;&#10;&#10;The World of Warcraft Trading Card Game draws from the rich lore of the Warcraft universe. Two factions are battling for supremacy over Azeroth&mdash;the Horde and the Alliance&mdash;and each time you play, you choose a hero from one of these factions to represent you. Your hero is the leader of your party who fights alongside your allies. The cards that you play will allow you to equip your hero with weapons and armor, use spells and talents, invite allies into your party, and complete quests. With each successive TCG set, the theme and cards echo the current max-level content from the online game.&#10;&#10;The object of the game is to defeat your opponents before they defeat you. Over the course of the game, your hero and allies will deal damage to your opponents&rsquo; heroes and allies, and that damage is permanent unless it is healed. If your hero takes damage equal to or greater than his or her health, you&rsquo;re out of the game.&#10;&#10;Sets released&#10;&#10;Heroes of Azeroth (released October 2006) &#10;Through the Dark Portal (released April 2007) &#10;Fires of Outland (released August 2007) &#10;March of The Legion (released December 2007) &#10;Servants of the Betrayer (released April 2008) &#10;The Hunt for Illidan (released July 2008) &#10;Drums of War (released November 2008) &#10;Blood of Gladiators (released March 2009) &#10;Fields of Honor (released June 2009) &#10;Scourgewar (released November 2009) &#10;Wrathgate (released May 2010) &#10;Class Starter deck (July 2010)&#10;Archives (released August 2010)&#10;Icecrown (released September 2010)&#10;Worldbreaker (released December 2010)&#10;War of the Elements (released April 2011)&#10;Twilight of the Dragons (released July 2011)&#10;Throne of the Tides (released October 2011)&#10;Crown of the Heavens (released February 2012)&#10;Tomb of the Forgotten (released June 2012)&#10;War of the Ancients (released October 2012)&#10;Betrayal of the Guardian (released February 2013)&#10;Reign of Fire (released July 2013)&#10; Raid Decks&#10;&#10;Onyxia's Lair (December 2006) - Featuring the black dragon Onyxia. Contains special rules for the deck. &#10;Molten Core (May 2007) - Includes ten epic bosses, from Lucifron to Ragnaros the Firelord. It has a different ruleset than the Onyxia's Lair Raid Deck. &#10;Magtheridon's Lair (January 2008) - Contains the Pit Lord Magtheridon, his shadow channelers, and the cubes required to interact with him. &#10;Black Temple (September 2008) - Based around Illidan Stormrage. Contains a 10 hero raid set with heroes such as Supremus and &quot;The Betrayer&quot;. &#10;Naxxramas (December 2009) - An undead necropolis, seat of the lich Kel'Thuzad. &#10;Assault On Icecrown Citadel (February 2011) - This four-player game has everything you and three friends need to play all out of the box. Play as Highlord Tirion Fordring, Lady Jaina Proudmoore, or Queen Sylvanas Windrunner and battle against the Lich King!&#10;Battle of the Aspects (August 2012) - The final confrontation with Deathwing, the corrupted Aspect of Earth.&#10;Caverns of Time (March 2013) - Take on iconic characters from the past, present, and future. Contains 8 raid heroes.&#10;&#10;Dungeon Decks&#10;&#10;There are now not just huge raids for players to play against but entirely new dungeons for you to explore and reclaim! Form a party with two friends to take on the dungeon denizens! You don't need a pilot for the Dungeon Deck as The deck plays itself! You can customize the Dungeon Deck for difficulty and your heros will level up as you gain experience and you can spend those experience points improving your player deck by adding cards. Each dungeon deck contains 60 cards per dungeon deck, Two Dungeon Boss cards, hero Character Sheets, Achievement Cards, and a Nine-card all-foil Treasure Pack (also sold seperately at $6.00 MSRP) for an MSRP of $20.00. These dungeon decks are specifically designed to be played against three Class Starter decks which are sold seperately, allowing for players to jump right into the experience without having to have a deep card collection.&#10;&#10;Shadowfang Keep (November 2011) &#10;Scarlet Monastery (Novemeber 2011)&#10;The Deadmines (November 2011)&#10;&#10;Periodically, bonus card sets are released independently to mark special events or dates.&#10;&#10;Feast of Winter Veil - A special collector's set released in November 2007 which corresponds with the holiday in the online game. This comes in a presentation box which contains a booster pack from Heroes of Azeroth, Through the Dark Portal or Fires of Outland, a deck box and 10 Winter Veil themed cards, as well as 2 vanity pets. &#10;Darkmoon Faire - A special collector's set released in September 2008 which includes 5 preset Darkmoon Faire themed cards and 2 Through the Dark Portal booster packs. &#10;Arena Grand Melee - A small collector's set released to supplement the Arena theme. This was released with two decks, one for the Alliance and one for the Horde. &#10;Burning Crusade Set - A set of 3 cards to mark the release of World of Warcraft: The Burning Crusade. Two Heroes of Azeroth starter decks were included alongside the exclusive cards. &#10;Wrath of the Lich King Set - 2 exclusive cards were included in the Collector's Edition of WotLK with 2 March of the Legion starter decks. &#10;Cataclysm set - Two exclusive hero cards, marking the first appearance of goblin and worgen heroes in the WOW:TCG. One 60-card deck from the new Wrathgate series featuring two extended art cards and visuals from several of fantasy's top creators.&#10;&#10;",
        "artist": "Rebecca Guay-Mitchell,Dave Kendall,Mike Krahulik,Todd McFarlane,Steve Prescott,James Ryman,Chris Seaman,Cyril Van Der Haegen"
    },
    {
        "name": "Fettnapf... in Sicht",
        "description": "In Fettnapf by Reinhard Staupe, the object of the game is to avoid collecting Fettnapf cards. Sounds simple, but as the game title suggests, little problems arise everywhere. In turn order, cards are played out and the values added together or subtracted: 24&hellip;29&hellip;32&hellip;25&hellip; but beware: if you say a number that someone has in hand, then you&rsquo;ve put your foot in it. Those with a talent for this will learn how to ship a Fettnapf around and win the game.&#10;&#10;Each player receives 3 cards (valued 0 to 9) and an island card (10 to 30). In turn order, each player plays a card and draws a new one into his hand. The played-out cards get added (up to 30) or subtracted (down to 10) and announced out loud: 24-28-32-26-18-9-12. Whenever a player goes over the limit, the right-hand player gets an island card. When a player announces a number that another player has in hand as an island card, then he&rsquo;s put his foot in it and receives a Fettnapf card. The game ends when a player has collected 4 Fettnapf cards. The winner is the player with the fewest Fettnapf cards.&#10;&#10;Re-implemented by:&#10;&#10;    Cowabunga&#10;&#10;&#10;&#10;&#10;",
        "artist": "Christof Tisch"
    },
    {
        "name": "Il Principe",
        "description": "An auction game where income and resources are automatically gained at the beginning of each turn.  Then the money is used to bid on more resources, then the resources can either be used (along with money) to build cities, or &quot;displayed&quot; to qualifying for &quot;roles&quot; (like political appointments) which gain influence/VP-graft plus a special power such as income boost, resource boost, VP-boost, or resource re-display.&#10;&#10;Building a city gains the player VP but also gives VP to the opponent(s) with matching role/graft color.&#10;&#10;The board does triple duty, containing the scoring track, a map of some part of Italy, and staging area for the &quot;role&quot; tiles.&#10;&#10;",
        "artist": "Oliver Freudenreich,Raphael"
    },
    {
        "name": "Angkor",
        "description": "In the jungles of southeast Asia, in Angkor, the players build huge temples and palaces. Unfortunately for the architects, the  jungle is a living thing, which grows all too well. and all too fast.&#10;&#10;Players have to get rid of these &quot;nature attacks&quot;, that are caused by  fellow game players, of course!&#10;&#10;",
        "artist": "Michael Menzel"
    },
    {
        "name": "Helden in der Unterwelt",
        "description": "Translation : &quot;Heroes in the Underworld&quot;&#10;&#10;This is the third release in the Return of the Heroes series. This time the journey goes into the Underworld, with characters and treasure from classical Greek mythology.  Several new gameplay elements are introduced, particularly the concept of corruption and direct player to player conflict.  This is a standalone game, but can optionally be combined with the other Return of the Heroes sets.&#10;&#10;Other games in the series:&#10;&#10;    Return of the Heroes&#10;    Under the Shadow of the Dragon&#10;    Die R&#195;&#188;ckkehr der Helden: Die Gralssuche&#10;&#10;&#10;&#10;&#10;",
        "artist": "Hans-Georg Schneider,Tom Thiel"
    },
    {
        "name": "Project Kells: Sacred Hill, High Kings of Tara  & Poisoned Chalice",
        "description": "(second edition, TG552)&#10;&#10;Inspired by the Book of Kells and its mesmerizing patterns woven amongst the vellum pages, Project Kells evolved.  Standing atop the Hill of Tara and contemplating the conjoined ringforts of Forradh and Teach Chormac, the games of Sacred Hill and High Kings of Tara were born.  Steeped in the ancient legends of Ireland&rsquo;s Celtic heritage and royal past, these unique games of pure strategy are appreciated by young and old alike.&#10;&#10;Tailten Games won the Games Magazine award for BEST ABSTRACT GAME 2006; the  Spiele f&uuml;r Zwei - Spiele Akademie 2005 (Austria); Index 100 - Showcase 2005 in Ireland; and the award for 'Best Irish-Style Traditional Gift' 2005 in Ireland for Project Kells.&#10;&#10;According to the designer, Murray Heasman,&quot;The game takes five minutes to learn, yet a lifetime to master.&quot; The sheer beauty of this game alone makes it a gift to treasure--but the three separate games  each pose a daunting task for any strategic or abstract gamer.&#10;&#10;In all there are eight variants to stimulate the mind, so take it to your own level.  From a more simple Sacred Hill, a go-like game with its' elemental challenges, to an all-out-brain-burner in the form of Poisoned Chalice... Project Kells combines the best of beauty, gameplay, theme, and replay value.&#10;&#10;You&rsquo;ll be amazed at the possibilities.  Once you&rsquo;ve learned the basics, be prepared to delve deeper, because you&rsquo;re likely to be already hooked on this game.  Scoring with knots (instead of kingdoms) will get you addicted.&#10;&#10;&#10;     This first game: Sacred Hill introduces the basic elements of play.  The aim of both games is the same -- to have the least number of kingdoms by the time the game is ended, a kingdom being a group of linked ring forts.  There are two phases to the game.  In manoeuvres (first phase) you are building a network of unconnected ring forts scattered around the board.  In Battle (second phase) you are adding ring forts next to your own, linking them together with bridge tiles, to form larger (and fewer) kingdoms.  This starts to magically create the Celtic knotwork.  Isolated ring forts that are besieged must be captured.  No ties are possible with either ringfort scoring or knot scoring.===&#10;     The second game:  High Kings of Tara introduces the kings.  Each player has three which do the work of building your ring forts. They move like the knight in chess and add many more twists and turns to the game, taking it to another dimension.  Kings can capture enemy ring forts and kings; they can also be immobilized.  Your own kings cannot work in tandem and they must always move to a vacant hill whenever possible.  Ties are possible, but the duality of scoring pursuits (ringforts versus captured kings) usually prevents this possibility.  This is especially true in tournament scoring...&#10;&#10;&#10;&#10;    Those who feel that they have mastered those variants are encouraged to try the real brain burner of the bunch.  Poisoned Chalice  Played at right angles to each other, each player tries to exert total control over each other from a position of inferiority. The end scoring is the same as in the Sacred Hill variant, but in this endeavor the limitations of placement create challenging strategic obstacles for both opponents.  It is possible to exert control over an opponent in such a way that at times they are limited to one possibility for tile placement.  However, there are twists that occur if a piece is captured (surrounded) on the board (like in 'go').  No ties are possible with either ringfort scoring or knot scoring.&#10;&#10;&#10;This is very probably the same game [system] as The High Kings of Tara.&#10;&#10;",
        "artist": "Murray Heasman,Bob Naismith"
    },
    {
        "name": "Battlestar Galactica Collectible Card Game",
        "description": "A collectible card game based on the SCI FI Channel series &quot;Battlestar Galactica&quot;.&#10;&#10;From the Press Release:&#10;&#10;Game play will mirror the intrigue of the television show: Players won&rsquo;t know whom to trust, who the Cylon agents are or where the next attack will come from! Players will battle for ownership of resources and influence in order to control the fleet.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Hordes",
        "description": "Hordes can be viewed as either an expansion to Warmachine, or a totally separate game using the same system.  Either way, it contains four new factions and is based on the same system.  It is 100% compatible with Warmachine.  Rather than the steampunk theme of Warmachine, Hordes focuses on the more primitive tribal powers:  Trollblood, Skorne, Legion of Everblight, Circle Orboros, Farrow (pig-men) and Gatormen.  They wage war with great warbeasts in place of warjacks and, instead of warcasters, have warlocks that draw power from their beasts.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Great Space Race",
        "description": "From the publisher:&#10;&#10;The Great Galactic Emperor has decreed the Great Space Race is on! Can you, as representative of your ill-fated species, pilot your starship to victory? You must, for those who fail to win doom their species to total annihilation. Keep your tentacles to the floor and your eyestalks on the finish line as you navigate your way through minefields, asteroids and wormholes, but just don't forget - stay away from the Space Amoeba!&#10;&#10;The Great Space Race is a board game for 3-6 players. The game consists of the track, ships, counters and 3 separate decks of cards. Players pilot their spaceship around the hex-based track, dodging all sorts of obstacles (mines, black holes, the other players' ships, etc) in an attempt to be the first to complete 3 laps.&#10;&#10;Movement is handled by simultaneous selection of movement cards, but unlike in RoboRally these cards are much more varied, combining forward movement, sliding movement, and turning into neat moves such as the Barrel Roll, the Dragons Tail, and the Broken Arrow.&#10;&#10;An average 3-lap game can last 3 hours, but the number of laps can be varied to adjust the game length.&#10;&#10;Re-implements&#10;&#10;    The Great Space Drag Race&#10;&#10;&#10;&#10;&#10;",
        "artist": "Craig Zipse"
    },
    {
        "name": "Berserker Halflings from the Dungeon of Dragons",
        "description": "The sixth game in the B-Movie Series of card games, this one blends humor, fast-playing strategy and fantasy movie cliches into a funny romp through &quot;classics&quot; like Krull, Conan, The Neverending Story and many more.&#10;&#10;Players create cliche fantasy movies by playing characters, props, and locations to their own movies, while playing creatures to attack the movies of the other players.  There are also Special Effects cards that can be played to perform special actions such as killing off particular character types or modifying an attack.  The goal of the game is to have the most points in your movie when the &quot;Roll the Credits&quot; card is played or the draw deck runs out of cards.&#10;&#10;The addition of Treasure props sets this game apart from other B-Movie Series games, as they provide an additional requirement to win the game.&#10;&#10;This is a stand-alone entry to the series, but may also be mixed with other B-Movie Series games.&#10;&#10;",
        "artist": "Steve Bryant,Paul Gerardi,Mike Jackson,Jason Millet"
    },
    {
        "name": "Terakh: A Creative Strategy Game",
        "description": "Whatever else might be said about it, there is no doubt that Terakh is unique.  See the definitive pictorial overview of the game and its unusual components here. It's a sci-fi themed war game on an abstract map with dice driven combat and magic cards that modify and affect outcomes.&#10;&#10;The game designer suggests the game is a hybrid of Risk and Magic: The Gathering, but most players seem to agree that this description is inadequate.  Some have suggested that as a light, quick game focused on combat that rewards offense it is closer in spirit to Nexus Ops.  Others regard it as a blend of war-game elements (particularly the movement and dice-based combat), mixed with elements of an abstract, mixed with elements of Magic: The Gathering.&#10;&#10;Home Page: http://www.terakh.com/&#10;&#10;",
        "artist": "Akhil Patel,Terence Wong"
    },
    {
        "name": "PÜNCT",
        "description": "P&Uuml;NCT, the fifth released game by design in project GIPF, is a connection game.&#10;The goal is to connect two opposite sides of the board. A player's turn consists of either bringing a new piece into play or moving one already on the board.&#10;&#10;This game is part of project GIPF.&#10;&#10;",
        "artist": "lu'cifer"
    },
    {
        "name": "Deduce or Die",
        "description": "This is a deduction game that was published in The Games Journal.&#10;&#10;You will need 3 decks of cards and the deduction sheets to play.  Here is the game description from the website:&#10;&#10;&quot;If you're a fan of deduction games such as Code 777, Clue, Sleuth or Black Vienna, here's an original design you may want to check out. I actually find it more challenging than any of the games I've listed, a statement that will be greeted with delight by some and with horror by others. If you're still with me, be prepared to sharpen both your pencils and your little gray cells. The game is afoot!&quot;&#10;-The Games Journal&#10;&#10;Theme:    Lawyers stranded on a remote island solving a murder.&#10;Goal:     Solve the evidence; identify the murderer; if you are the murderer then frame an opponent.&#10;Gameplay: Ask questions, answer questions, deduce based on information received.&#10;&#10;",
        "artist": "Justin Walduck"
    },
    {
        "name": "City of Heroes CCG",
        "description": "The City of Heroes Customizable Card Game (COHCCG) was designed by David Williams and produced by Alderac Entertainment Group (AEG). There were a total of two sets of cards released for the game. The first, Arena, was released in January, 2006. The second set, Secret Origins, was released in October, 2006. Since then, there have been no official releases.&#10;&#10;The COHCCG was designed to be a quick game. Rather than using a turn structure where each player takes multiple actions in a row, the game used an alternating action structure. This lead to faster and more interactive games. Each player was represented by a Hero card, which began play with 2 starting powers. As their action, a player had many choices, including:&#10;&#10;&#10;    Play a card, being:&#10;         a Sidekick&#10;         a Power that can be used by the Hero or a Sidekick&#10;         an Enhancement on a Power already in play&#10;         an Edge card with the keyword &quot;Action&quot; or &quot;React&quot;&#10;    &#10;    Activate a Power already in play&#10;    Move the Hero or a Sidekick&#10;    Search your draw deck for a Sidekick&#10;    Recharge your Powers&#10;    Play a Mission card&#10;    Use the Defeat text on a mission to complete it&#10;    Draw 2 cards&#10;&#10;&#10;Unless otherwise specified by the cards played, play continued until only one Hero remained, who was declared the winner.&#10;&#10;In addition to the 33 Heroes available in Arena and the 22 Heroes available in Secret Origins, players could create their own hero using &quot;Paragon&quot; Hero cards. These cards allowed a player to create new combinations of powers that were not available on existing Hero cards. Players could either play solely with the Paragon Hero cards available in the Arena set, or go online to access the HeroBuilder which allowed players to create Hero cards in the same template as the already available Heroes, including a picture uploaded by the player. Although the generic Hero cards listed all power sets available to the archetypes at the time, it wasn't until The Hamidon set was developed that many of those power sets were codified for use.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Indonesia",
        "description": "Judging by the smirk on the face of the Sultan of Solo, the businessman from North Sumatra has just made a mistake. And a costly one at that, too. He has paid way too much for merging his rubber company with the Sultan&rsquo;s extensive rubber plantations: there are no ships in the area to transport the rubber to the booming cities of Java. And the Sultan is now dripping in cash &mdash; he can bribe city authorities so that his ships will gain preferential access to those ports where they are competing. Or he might invest in building an oil imperium. But wait &mdash; what&rsquo;s that young fellow over there up to? Buying all the shipping lines? That might change the outlook &hellip; considerably, in fact &hellip; let&rsquo;s see&hellip;&#10;&#10;Indonesia is a game in which two to five players build up an economy, trying to acquire the most money. Players acquire production companies, which produce goods (rice, spices, microwaveable meals, rubber, and oil), and shipping companies, which deliver goods to cities. As cities receive goods, they grow, increasing their demands. Production companies earn money for each good delivered to a city, up to the city's capacity, but they must pay shipping companies for the distance traveled, even if they end up losing money. Players can research advantages, like greater shipping capacity or the ability to merge companies, possibly stealing ownership of lucrative plantations or shipping routes by buying out other players.&#10;&#10;Players keep their money hidden, trying to accumulate the most by the end of the third era. When only one type of a company is left, an era ends. New eras bring new cities, companies, and types of goods. At the end of the third era, the player with the most money wins. However, money earned from the last round of operations (selling/shipping goods) counts double, so it can be important to control the timing.&#10;&#10;",
        "artist": "Jeroen Kesselaar,Ynze Moedt"
    },
    {
        "name": "Cranium: The Family Fun Game",
        "description": "From the manufacturer:  Cranium Family Fun gives families the best way to play together as a team in an unforgettably fun game that gives everyone a chance to shine. Packed with 16 hilarious activities, Cranium Family Fun gets you building, flipping, sketching, sculpting, guessing, and laughing out loud together every time you play!&#10;&#10;From the back of the box:&#10;Cranium Family Fun features a variety of hilarious activities that will have everyone laughing, high-fiving, and working and playing together! With colorful Cranium Cubes and fun Flipper Frogs, The Family Fun Game delivers the ultimate family game night!&#10;&#10;Can Mom flip a frog through a hoop you've sculpted out of clay? Can you pass the Cranium Cubes to Dad ... without using your hands? Can you work together to write down three of the top five most popular pizza toppings?&#10;&#10;In Cranium Family Fun, everyone will have a chance to shine as you perform wacky stunts, act, sketch, guess, sculpt with Cranium Clay, and more! And the short play time (about 40 minutes) makes it easy to squeeze in some laugh-out-loud family fun before dinner or after school.&#10;&#10;Object: Be the first team to cross the finish line and you win the game!  The teams score points and move on the board by successfully completing their activities.&#10;&#10;How to play:&#10;&#10;1. Divide players into at least two teams. Instruct each team to choose its game piece and place it on the Planet Cranium starting space.&#10;&#10;2 Provide each team with paper and a pencil. Place the four card character boxes out on the board (Creative Cat, Star Performer, Word Worm, Date Head). Place the timer, the die and the Cranium Clay container on the table.&#10;&#10;3 The first team must choose its character box and draw a card. Follow instructions on the card. The player whose birthday is closest is the first player to go on the team.&#10;&#10;4 Roll the die and move the appropriate number of spaces only if your team has completed the character card activity successfully; otherwise, pass the play to the team on the left. Stop on any Planet Cranium spaces you pass over during your move forward. Advance forward to the next Planet Cranium if you roll purple.&#10;&#10;5 Advance to the inner fast track if you successfully complete the task from the Planet Cranium card. Remain on the outer scenic track if you do not complete the task.&#10;&#10;6 Pass the play to the team on the left after you have advanced your playing piece.&#10;&#10;7 Halt the game when a Club Cranium card is drawn. All teams follow the instructions on the card to compete simultaneously against each other in a bonus round. The winning team receives a bonus roll.&#10;&#10;8 The winning team rolls and moves. Continue play with the team whose turn it was before the bonus round.&#10;&#10;9 Enter the Cranium Central at the end of the game board. When you roll, advance to the appropriate character box as indicated by the color rolled on the die.&#10;&#10;10 Complete the activity in Cranium Central. Advance to the next character in clockwise motion. Wait for your next turn to complete that activity.&#10;&#10;11 A team wins when it is the first to complete the four activities in Cranium Central.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Martian Chess",
        "description": "Martian Chess is a 2-4 player game that uses Icehouse pieces, requiring one stash per player, and a chessboard. It was one of the games included in Icehouse: The Martian Chess Set and Pyramid Arcade.&#10;&#10;Much like its namesake, Martian Chess is a game of capturing pieces.  Like Chess, Martian Chess is turn based, and played on a chessboard.  In both games, players move and capture individual pieces, and each type of piece has distinct moving rules.&#10;&#10;However, Martian Chess differs from Chess in critical ways:&#10;&#10;     Piece ownership is determined not by color but by location.&#10;     Instead of capturing a specific piece, winning is determined by points, making it possible to force the end of the game and still win with no pieces left in that player's control.&#10;     Lastly, Martian Chess easily supports 4 players as well as two, and can also be played with 3, 5 or 6 players if you use geomorphic chessboard sections; see this photo for an example.&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Mix-max",
        "description": "Mixing and matching fun for all ages&#10;&#10;In part one, roll the die to make as many comical characters as you can, taking cards from the stack and combining cards from different figures. In part two, try to make complete figures by winning cards from the other players. Each complete character scores one point, and the player with the most points wins. For a bonus point, try to complete the magician.&#10;&#10;",
        "artist": "Willi Baum,Lea Koch-Auvo,Charlotte Töpert"
    },
    {
        "name": "Pentago",
        "description": "Pentago is an abstract strategy game for two players with four 3&times;3 grids arranged into a larger 6&times;6 grid. This game reimplements the well known Connect 4 with a twist: After placing a marble, the player has to twist one of the grids by 90&deg;, thus changing the board after every turn. The first player to get five marbles in a row wins.&#10;&#10;",
        "artist": "Mårten Skoger"
    },
    {
        "name": "Federation Commander: Klingon Border",
        "description": "From the designer of Star Fleet Battles, Federation Commander is the fast moving game of starship combat in the Star Fleet Universe.  Mounted game boards, laminated full color ship control cards and gorgeous full color counters highlight this re-imagining of the Star Fleet Universe with 21st century production values.&#10;&#10;This was the initial product for Federation Commander, and was the original base set.  There are other base sets and expansions for the Federation Commander Series.&#10;&#10;Much effort has gone into streamlining the game - there are 8 impulses rather than 32.  One die roll allocates up to 10 points of damage, rather than 2 dice per damage point that strikes the ship.   Color coded charts and ship cards reduce the mental overhead of remembering what goes where.&#10;&#10;Gone is the tax form of energy allocation, replaced by a free flowing dynamic &quot;on the fly&quot; power allocation system.  Maneuver has had countless special cases removed and streamlined.&#10;&#10;This is not an introduction to Star Fleet Battles, but a re-imagining of starship combat in the Star Fleet Universe, redesigned from the ground up to appeal to a wider audience and reduce rules lawyer-ism.&#10;&#10;Included in the rules are the 'free form&quot; (hexless) movement rules that have been in use for years; the hex map is scaled for miniatures bases, and the game is designed to be easy to port over to miniatures adaptations.&#10;&#10;",
        "artist": "Mark Evans (I)"
    },
    {
        "name": "Glory to Rome",
        "description": "In 64 A.D., a great fire originating from the slums of Rome quickly spreads to destroy much of the city, including the imperial palace. Upon hearing news of the fire, Emperor Nero Caesar races back to Rome from his private estate in Antium and sets up shelters for the displaced population.  Reporting directly to Nero, you are responsible for rebuilding the structures lost in the fire and restoring Glory to Rome.&#10;&#10;Glory to Rome is a card-based city building and resource management game with a novel mechanism. Each card may act as a building, a client, a raw material, or a valuable resource, frequently forcing players into difficult decisions regarding how each card should be used. In addition, much of the game is played from the discard pool, giving players some control over what cards are accessible to opponents.  Actions are triggered by a form of card-driven role selection -- the active player leader a role, and other players may follow if they discard a matching card from hand (to the pool).  Players who don't follow may 'think' to draw more cards.  There are thus strong interactions between the different uses of cards.  Scoring is a combination of completing buildings and storing resources, with end-of-game bonuses for storing a diverse assortment. Game length is player-controlled, and is triggered in a few different ways.&#10;&#10;The lighthearted artwork of the original editions was replaced by minimalist art in the 'black box' edition, and both have been the source of great controversy.  Many of the non-English editions use more conventional artwork.&#10;&#10;",
        "artist": "Ed Carter,Valerio Cioni,Klemens Franz,Felix Girke,Heiko Günther,Igor Wolski"
    },
    {
        "name": "Palatinus",
        "description": "From the publisher:&#10;&#10;780 B.C.: Italian Peninsula: The land that will host the foundation of Rome is a center for flourished trading and harsh fighting: from this struggle the population that ruled half of the world was born. Who will rule the city that is rising around the Palatinus?&#10;&#10;Palatinus is a tile-laying game settled on the Seven Hills of Rome.&#10;&#10;On a modular board changing at each game, players place their inhabitants (soldiers, merchants, farmers) trying to conquer the lands. Inhabitants interact between them and at the end of the game player will be awarded the control of one or more hills, or fame:&#10;&#10;- soldiers capture revolting farmers;&#10;- merchants and farmers dominate the hills;&#10;- farmers only get great benefits from being placed near a water spring.&#10;&#10;The usefulness and power of each inhabitant is relative to the number and kind of the inhabitants surrounding him, with a simple and elegant mechanism, in the classic tradition of the so-called German games.&#10;&#10;",
        "artist": "Toni Cittadini"
    },
    {
        "name": "Beetlez",
        "description": "From the publisher:&#10;&#10;When the band leaves the rehearsal room, you sneak out from your hiding place to assault the refrigerator: how great! How do you feel being a hungry beat-beetle? If your fingers are quick enough you could eat yourself fill... as long as the drummer doesn&rsquo;t get back to stop you!&#10;&#10;Beetlez is a new game in a new format in the Allegro line (same box of Fredericus). After the offering of four card games (Moby Pick, Mr. Bill, Abracadabra and Farfalia), Allegro line debuts with a board/tile game with still the same philosophy: easy and fast game for the whole family.&#10;&#10;Could you guess what? You&rsquo;re now a cute beetle frantically looking for food in the rehearsal room of a music band. Each beetle has his own preferences in terms of food, but the hunt is hectic: food tiles are displaced face down all over the table, with the players grabbing them, flipping them, looking at them, taking them or putting them back, all of these at the same time... at least until the light is turned on!&#10;&#10;The box contains 91 foods, 5 refuges, 4 light bulbs, 21 taste cards, 3 &ldquo;Gotcha!&rdquo;, 1 &ldquo;Greedy&rdquo;, 1 linen bag, rules. It guarantees a load of fun also to the ones hating beetles...&#10;&#10;",
        "artist": "Gianpaolo Derossi"
    },
    {
        "name": "Lucca Città",
        "description": "From the publisher:&#10;&#10;This game has been published by dV Giochi as a reward for winning the 2004/2005 edition of the Gioco Inedito &ndash; Best Unpublished game contest. Powered by Lucca comics &amp; Games and dV Giochi, the contest aims to identify the best new card game design from all prototypes received and to reward it by publishing the game in a fully professional and high-quality format, overseen directly by dV Giochi. All prototypes submitted must conform to the technical and style requirements, fixed components and a given theme which changes every year. Everybody can join the contest and this is a great opportunity for emerging game designers to see their idea published.&#10;For more information:&#10;giocoinedito@luccacomicsandgames.com&#10;www.luccacomicsandgames.com&#10;&#10;The theme of the award was &ldquo;Cities and Walls;&rdquo; Lucca Citt&agrave; is a very clever and elegant card game that won hands down, and daVinci is proud to introduce it to the public.&#10;&#10;It features a deck of 110 cards, divided in 96 Palace parts, 4 towers, 5 Coat of Arms, and 5 Quarters. Each player belongs to a Quarter and tries to increase his family&rsquo;s fame by building palaces and walls and by giving parties in the completed palaces.&#10;&#10;During his turn, the player chooses a triplet of cards from the table and uses them to build his buildings; resources and time are very limited, and you need careful planning and master play in order not to have at the end of the game too many unfinished palaces, have lots of parties and... be the winner!&#10;&#10;",
        "artist": "Gianpaolo Derossi,Valeria Luongo"
    },
    {
        "name": "Master of Movies",
        "description": "From the publisher's homepage:&#10;&#10;Master of Movies&#10;As action packed as &quot;The Terminator&quot;, as unpredictable as &quot;Usual Suspects&quot;, as funny as &quot;Waynes World&quot;, as cool as &quot;Men In Black&quot;, as exciting as &quot;Silence of the Lambs&quot; and almost as sexy as &quot;Lara Croft: Tomb Raider&quot;! MASTER OF MOVIES combines the very best of the silver screen -- the rest is up to you! So go ahead. Make your day! Make yourself the Master of Movies.&#10;&#10;Background&#10;THE ULTIMATE TRIVIA GAME FOR EVERYONE WHO LOVES MOVIES!&#10;In Master of Movies, the players are the Stars. It&rsquo;s all about how well you know the Movies -- What you&rsquo;ve seen on screen, but also how familiar you are with the Movie Stars when they&rsquo;re off the Silver Screen.&#10;You play to become Master of Movies. The 8 categories take you from Actors and Actresses in leading and supporting roles, Movie Titles, to who&rsquo;s dating who -- both on and off screen. At the very end it comes down to a memorable Movie Quote -- Who said it and in what movie?&#10;Master of Movies is funny, exciting, entertaining and you can never predict how it ends.&#10;&#10;Gameplay&#10;Just like any good action movie Master of Movies takes off the moment you open the box. You&rsquo;re ready to play right away, without complicated rules or introductions. You simply play your way through 7 of the 8 categories and when you&rsquo;ve gathered 7 rolls of film, you&rsquo;re going to have to ask yourself: &quot;DO YOU FEEL LUCKY, PUNK?&quot;&#10;The last and crucial category of the Game being a famous Movie Quote, you have to tell your fellow players which Movie the quote originated from. Then you&rsquo;ve earned the title Master of Movies.&#10;&#10;Master of Movies is the first game in a series of games with the title &quot;Master of . &quot;. The follow-up Master of Television  was released in 2006. Next games will be &quot;Master of Music&quot; and &quot;Master of Sports&quot;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Shiloh: April 1862",
        "description": "From the publisher:&#10;&#10;Shiloh was an important American Civil War battle fought in April 1862. A surprise Confederate attack, led by Albert Sydney Johnston, nearly swept encamped Union defenders into the Tennessee River. The next day, a reinforced Union army counter-attacked and drove the CSA line back in confusion and retreat. A CSA victory might have ruined the career of General Ulysses S. Grant. Instead, the battle ended with a Union victory, the death of Johnston, and the eventual demise of Confederate hopes in the West. Days 1 and 2 can be played separately or together.&#10;&#10;Shiloh was initially developed from the Gettysburg: Badges of Courage game system. However, the game mechanics have been completely overhauled. The map is divided into large areas and combat is resolved within areas. The game plays using the fast-paced Move-Move-Battle sequence seen in Hammer of the Scots and Julius Caesar. There are no cards involved; players activate leaders to command brigades of the same division or corps. The game plays smoothly and quickly; each player gets to play one day on offense and one day on defense for a great gaming experience. Game time is 2-4 hours for both days of Shiloh.&#10;&#10;",
        "artist": "Don Troiani"
    },
    {
        "name": "Hexxagon",
        "description": "Two players attempt to control the majority of spaces on a customizable board by spreading, jumping and infecting. Spreading involves adding a new piece adjacent to an existing one. Jumping means moving a piece two spaces away. Whenever a piece is placed adjacent to opposing pieces these are infected, meaning replaced with friendly ones. Hexxagon is an adaptation of the game Ataxx for a hexagonal grid instead of a square grid board. Like Ataxx, it has only been published as computer software.&#10;&#10;Online Play&#10;&#10;&#10;     Gamerz (turn-based, play by email or play by web)&#10;     Yucata (turn-based)&#10;     Vying Games (turn-based, featuring 2 or 3 players, and random blocks)&#10;     http://www.iggamecenter.com/ - igGameCenter (real-time, 2-3 players)&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "No Stress Chess",
        "description": "From the Publisher:&#10;&#10;You're guaranteed to be playing chess instantly.  Unlike any other chess teacher, No Stress Chess teaches you how to play using illustrated cards and an illustrated 2-sided board.&#10;&#10;&#10;No Stress Chess is a chess board with pieces and a deck of cards displaying how the chess pieces can move.  Designed to teach how the pieces moved, in the learning versions of the game, players play cards from their hand of either 3 or 5 cards in order to move the chess pieces on the playing field.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Ark",
        "description": "Noah is tearing out his beard as he doesn't have much time left to finish loading his ark. After all, the clouds are gathering and the rain could come at anytime. Meanwhile, the animals are gathering before the ark and waiting to be told who goes in which stalls. A handful of people have showed up to offer help, but they look like gamblers and game players!&#10;&#10;In Ark, the players need to help load animals and supplies into Noah's ark in preparation for the rains to come &ndash; but you can't just shove animals into stalls willy-nilly. If the meat eaters are boarded with plant eaters, you won't have those plant eaters around by the time the water recedes. Animals from cold and warm climates also need to be bunked separately so that they can all be comfortable. On top of all that, you have to worry about the weight of the animals; load too many on one side of the ark and you'll all be treading water for the next forty days and forty nights...&#10;&#10;The game consists of cards, animal tokens, and &quot;action&quot; discs.  Your goal is to place your animal tokens (as victory points) based on characteristics of the animal and provision cards loaded on the &quot;ark&quot;.  Each player takes turns either placing cards or drawing cards from a face-up draft pile (Card Drafting) and the supply stack.  Each card has characteristics (such as the animal size, diet, climate, scoring category, and special ability).  Animals and provisions must be placed according to rules that prevent animals from eating each other, eating the supplies, or tipping the &quot;ark&quot; with their combined weight.  When a card is played, the player may place a &quot;victory point&quot; animal token on one of the 5 scoring category cards.  In this way, the game combines Tile Placement of the cards with Set Collection for types of victory points.  The game ends when a fifth &quot;Rain Card&quot;, somewhat randomly shuffled into the deck, is drawn.  Players then score points for their animal tokens, and bonus points for having the most or second most tokens per category.&#10;&#10;",
        "artist": "Doris Matthäus"
    },
    {
        "name": "Rum & Pirates",
        "description": "Rum and Pirates is a relatively simple movement and collection game, known in German as Um Ru(h)m und Ehre (For Rum/Renown and Honor). The game was designed by Stefan Feld and is for 2-5 players ages 9 and up and plays in 60-75 minutes. On the Alea complexity scale of 1 (simple) to 10 (difficult), this game rates a 2. (Editor's Note: That is the same complexity as Chinatown, Wyatt Earp, and Edel, Stein & Reich)&#10;&#10;The players take on the roles of freebooters who, back in their pirates' hideout, spend their time with all kinds of competitions - drinking, fighting, etc. All players move the main playing figure, the captain, through the alleys of the village, with the goal of gaining as much rum and reknown as possible. The end of each of the five rounds is also marked by a highly variable fight to claim the best sleeping spaces on board the ship (bed or board?). The game is a mixture of tactics, strategy, and luck. The die plays an important role in the game, but you still get the feeling of being at the mercy of fate only rarely.&#10;&#10;The game contains 76 plastic pirate figures, 9 game board pieces that ensure the board is always different, about 200 tiles, and 1 die.&#10;&#10;Description adapted from the Gamewire Essen Preview.&#10;&#10;This game is #10 in the Alea big box series.&#10;&#10;",
        "artist": "Claus Stephan"
    },
    {
        "name": "Robber Knights",
        "description": "From the publisher:&#10;&#10;The knights set off from their castles to conquer the surrounding land. For the wealth of the big towns and the villages belonging to them is just too tempting.&#10;&#10;Of course, once in possession, no knight wants to lose his newly acquired properties, so this means: caution. For the other players&acute;knights are awake to any opportunity and the newly gained land may be lost again just as quickly to a new lord.&#10;&#10;Bring your landscape tiles and above all your knights skilfully into play, secure your properties on all sides and watch out for enemy knights at all time.&#10;&#10;",
        "artist": "Michael Menzel"
    },
    {
        "name": "SuDoku: Das Brettspiel",
        "description": "What could be more Knizia-like in its headache inducing mathematical problem-solving than Sudoku? It's no surprise, than, that the phenomenon sweeping the globe is coming to us as a boardgame by Reiner!&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Online play&#10;&#10;&#10;     YourturnMyturn (turn-based or with AI)&#10;     Brettspielnetz.de (turn-based), direkt Link to gamepage, direkt to Homepage&#10;&#10;&#10;",
        "artist": "Bertrand Born"
    },
    {
        "name": "London 1888",
        "description": "Jack the Ripper has just commited his first two murders. Now, the chase is on. Will you be fated to catch the most famous serial killer in history, or will be fated to save him?&#10;&#10;The game is played over three phases.&#10;&#10;The first phase finds players searching for weapons, items, and clues about Jack's true identity.&#10;&#10;In the second phase, players will discover the roles they will be playing in the drama to follow; either they will be working on the side of justice, trying to capture Jack, or they will be aiding his escape.&#10;&#10;The third phase will have the players teamed up based on their objectives. The rest is history... or is it?&#10;&#10;Expanded by London 1888: Whitechapel&#10;&#10;",
        "artist": "Stephan Kot"
    },
    {
        "name": "Canal Mania",
        "description": "Canal Mania is a game about the great canal-building era of the eighteenth and nineteenth centuries that captures the feel of the period and gives players plenty of decision making in their attempts to complete some of the most famous British canals.&#10;&#10;Players will engage brilliant engineers such as James Brindley and Thomas Telford in their efforts to create canals linking emerging manufacturing centers, thereby providing the waterways that supplied the goods generated by the Industrial Revolution.&#10;&#10;The goal of this game is to have more victory points than your opponents. You gain victory points by building canals (with 0-3 victory point for each hex and 2-8 victory points for the contract) and moving goods through canals (1 for each town you visit, including the first one).&#10;&#10;Each turn has 3 phases. In each Phase you can chose one action:&#10;&#10;First Phase:&#10;- Take a contract from parliament&#10;- Exchange engineers&#10;- Discard the five face up building cards&#10;Second Phase:&#10;- Pick up three face up build cards&#10;- Build tiles&#10;Third Phase:&#10;- Move one good token&#10;Any Phase Alternative:&#10;- Draw one card from the top of the build deck&#10;&#10;",
        "artist": "Colin Jones"
    },
    {
        "name": "Nacht der Magier",
        "description": "The basic premise is simple: the board, resting on a platform, is full of wooden discs and trees and other bits. There's a ring of light in the middle, covered by a cardboard disc and a blazing fire. Cauldrons circle that disc. The goal is to get one's own cauldron to the ring of light by pushing the bits on the board.&#10;&#10;You start pushing from the side of the board and push in one continuous movement until you hear a clack; something has fallen off the board. Your turn ends there. Next player is up, and this continues until someone's cauldron is in the ring of light.&#10;&#10;The gimmick: the game is played in pitch black. When played in the dark, the fire, cauldrons, wizards (used to push the pieces) and the ring of light all glow, while the trees and discs turn invisible. The game can also be played in the light of the day, but it loses a lot of its charm.&#10;&#10;Ages 6 and up.&#10;&#10;",
        "artist": "Rolf Vogt"
    },
    {
        "name": "Aton",
        "description": "From Queen Games website:&#10;&#10;The whole of Egypt is in uproar &ndash; Akhnaton, who has just acceded to the throne, wants to ban the old deity Amon from the temples of the land. Aton is to be worshiped as the new God.&#10;&#10;But the priests of the land are not willing to give up their temples without resistance so the 4 largest temples are fiercely disputed.&#10;&#10;The players are adversaries and fight out this battle of the Gods between them. Both have the same starting position, but who will be able to make better use of his abilities and help his God to victory?&#10;&#10;",
        "artist": "Harald Lieske"
    },
    {
        "name": "Sushi Express",
        "description": "The players pilot their maneuverable, little delivery cars around the city in order to serve as many customers as possible. When you pass by in your Sushi Express, you may choose a customer card. When doing so, you&rsquo;d like to get as many different types of cards as possible, as that&rsquo;s how you get the most victory points. But don&rsquo;t ignore the tips - whoever has the least at the end of the game gets minus points.&#10;&#10;",
        "artist": "Michael Schacht"
    },
    {
        "name": "Aloha",
        "description": "From the publisher:&#10;&quot;Aloha, Holiday Island. Island tourism grew explosively around 1960 and travel agents searched desperately for new paradise beaches. Your travel office asks you to explore new holiday destinations. Your task is to find the best beaches and the most attractive locations.&quot;&#10;&#10;Aloha is a nice mix of tile play and push-your-luck. Players are travel reps trying to secure the best beaches by placing sun loungers on beaches as they explore the island. The tiles show a good mix of land and water, with 1-3 golden beaches on most tiles. On your turn, you jump your rep to a new place, then draw a tile. This must be placed adjacent so you can walk straight onto it, otherwise your turn is over. If you walk on, and it has a beach, you have the option of dropping a lounger in your color onto it on its side.&#10;&#10;Then you can decide to push your luck and draw another tile. Each time you walk on, you may drop another lounger, but these go onto their sides. When you decide you've done enough or cannot move on anyway, you stop drawing and turn your loungers upright. But if you draw a tile you can't place so that you walk on, you lose all the loungers on their sides back to your pot. The tile still gets placed, and the game has a clever rule. Whenever a tile is placed, it must go where it touches the most tiles. So if the tile is going next to where you stand, sometimes you have no choice, the game forces its placement. But usually you have a few choices and these are crucial to pushing your luck.&#10;&#10;Finally, when all the tiles are down, the island is scored. The longest beach gets a 10pt marker, the next a 9pt marker and so on (with rules for tie-breaks). Then, the player with the most loungers on that beach collects to points markers (more tie-breaks). Also, any loungers still in your pot are also worth 1 pt each.&#10;&#10;At first, you think you must fight over owning beaches, and try to wrest back control of a beach. But in fact you will only win by occupying several beaches, and often you only need 3 or 4 markers to secure control. Being able to start a beach, get control, then extend it to get most points will win. Players can be unlucky and draw un-walkable tiles a few times, but this means you are not picking the correct places when jumping.&#10;&#10;As the game ends, your options reduce, but you should have done your work already. The result is a nice looking island, with lush jungle and bluewater inlets, dotted with lots of loungers.&#10;&#10;You have nothing to do till your turn, but if you make the right choices, you should have a winning chance. Knowing when to go one more tile matters, and knowing when to stop. Players with lots of loungers left in front of them can still win, but may have wasted their opportunities.&#10;&#10;",
        "artist": "Marten Scheeren"
    },
    {
        "name": "Terra Nova",
        "description": "In Terra Nova, players try to claim areas of land by moving control markers and placing fences. Each turn, a player must take three actions, first moving a control marker, then taking two further actions from these possibilities: &#10;&#10;     moving a control marker (whether the same one or a different one) and/or&#10;     placing a fence next to a control marker that moved this turn.&#10;&#10;&#10;&#10;&#10;Areas are scored once they're enclosed and contain no more than three types of landscape. Whoever has the majority of pieces in an area scores points based on the number of spaces and the number of types of landscape in the area, with fewer types scoring more points. Points are split in case of a tie. The game ends once all areas have been scored.&#10;&#10;Winner of Premio Archimede 2004.&#10;&#10;",
        "artist": "Michael Menzel"
    },
    {
        "name": "Ahoy",
        "description": "From the publisher:&#10;In this game the players participate in a race on the ocean and receive help from dolphins, sharks, turtles and orca.  You move from sea animal to sea animal to finish the course the quickest.  Time and again, different sea animals break the water surface. Remember where the different animals swim!&#10;&#10;",
        "artist": "Marten Scheeren"
    },
    {
        "name": "Badaboom",
        "description": "Badaboom is a humorous card game for 3-5 players. The 30-60 minutes of game play feature loads of explosive action, a high level of player interaction, a non-sequential order of play, fabulous contraptions, numerous chances to stick it to your opponents in nasty ways and stunning graphics from the artists behind Spank the Monkey and Kablamo. The game contains 64 cards, 50 Gold Coin markers, 2 Bomb Armed markers and a rules folder.&#10;&#10;The players of Badaboom take on the roles of wretched goblins in penal servitude under the cruel High Necromancer. Their task is to sit in an explosive-proof dungeon and try reverse engineering, tinkering style, on various explosive contraptions manufactured by their master&rsquo;s enemies. But the task to gain hands-on personal knowledge about what makes the devices go off and what damage they can do is no picnic, and not even a lifetime supply of resurrections can change that. The goblins want out, and the only way to succeed with this is to earn the gold coins needed for bribing their greedy guards.&#10;&#10;The fundamentals of Badaboom are quite simple, but there are lots of tricks and tactics that add depth. Basically, the players take turns holding and tinkering with the bomb while striving to do three things:&#10;&bull; Remove valuable mechanisms from the bomb.&#10;&bull; Change the nature of the bomb in a way that is favorable to the current player but not necessarily to the others.&#10;&bull; Make damn sure to stay away from the explosion when the bomb goes off.&#10;&#10;This may sound straightforward, but things are made complicated by the fact that any player can steal the bomb during other players&rsquo; turns. And it&rsquo;s very tempting to steal it. Not only do players get to tinker with the bomb when holding it. They may also draw a card from the deck, and as the deck is placed face up revealing the next card, the players know what they can gain by stealing the bomb. This makes the bomb skip and turn a lot during the game, keeping all players on their toes.&#10;&#10;To win, players need to perfect their timing, make every card count and, of course, avoid losing their heads.&#10;&#10;Reimplemented by&#10;&#10;&#10;    Big Badaboom&#10;&#10;&#10;",
        "artist": "Jesper Moberg,Peter Svärd"
    },
    {
        "name": "Warumono 2",
        "description": "Warumono 2 (&quot;The Evil&quot;) is a japanese game about the mafia and wil be released in Essen 2005.&#10;&#10;From a secretive underworld crime syndicate, a huge stockpile of illegal loot is stolen. The thieves are a group from the very same organization. However the real drama starts once the betrayal and ruthless deception and scrambling begins, as one of the thieves attempts to take the loot all for himself. Who will be the one to outfox their colleagues, evade the syndicate cronies, and make a getaway with a suitcase filled with loot? Enjoy the intense mind games played out against the backdrop of the criminal underworld.&#10;Comes with a multilingual rule book, including Japanese, English and German. Battle opponents regardless of the language barrier!&#10;&#10;http://www.grapac.co.jp/game/eng/eng_waru2/index.html&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Lord of the Rings: The Mines of Moria",
        "description": "This Games Workshop release is based on the movie The Lord of the Rings: The Fellowship of the Ring. The players go through the Mines of Moria in a step-by-step tutorial learning the nuances of play, culminating in the Battle of Balin's Tomb where everything they've learned will be put to use.&#10;&#10;This starter set contains a 32 page Beginner's Guide containing the basics of play, as well as a Core Rules book of 112 pages. Also included are plastic miniatures representing the Fellowship, numerous Goblins, and various terrain parts for building the mines in 3D.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Tekeli-li",
        "description": "An Anti-tricktaking game with a Cthulhu Mythos theme&#10;&#10;If you want to live long, you shouldn't cognize something.&#10;If you want to play happily, you shouldn't know about the existence of horrible deities who dominated old earth.&#10;Will you bear up and survive these distractions?&#10;It is up to you. Cross your fingers!&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Contents&#10;&#10;12 Fire(red)cards    (1 each :value 1-6, 3 each :value 7-8)&#10;12 Earth(black)cards (1 each :value 1-6, 3 each :value 7-8)&#10;12 Water(blue)cards (1 each :value 1-6, 3 each :value 7-8)&#10;12 Air(white)cards   (1 each :value 1-6, 3 each :value 7-8)&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Also you need&#10;&#10;About 30 unnamable markers&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Object of the game&#10;&#10;Escape from unknown horror. Remain far away from the Great Old Ones' insanity. At the end, players who have the most unnamable markers are frighteningly havocked.&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Apects&#10;&#10;Basically, do not take a trick. If you do, the Great Old Ones may come along (and unnamable markers).  Cards where both the number and color are the same cancel each other and allow the possibility of an escape from unnamable markers.&#10;&#10;",
        "artist": "Reina Asada"
    },
    {
        "name": "Red Vengeance",
        "description": "Red Vengeance is a sequel to Defiant Russia. Like that game, it is designed to be easy to learn and fun. The map portrays the western Soviet Union, Poland, Hungary, Romania and eastern Germany, with parts of Yugoslavia and Bulgaria as well.&#10;&#10;Players control the actual units that fought in this campaign. Axis units mostly represent army corps. These include German, Hungarian, Bulgarian and Romanian units; the latter two will eventually switch sides. The Axis player actually starts the game with more tank units, the real striking power in this game, than the Soviets. But as they&rsquo;re lost they are difficult to replace, while Soviet power just keeps surging.&#10;&#10;Like Defiant Russia, Red Vengeance isn't a very large game. The 17x22-inch map fits easily on a small table. There are 140 playing pieces, and it comes in a small box that's easy to store. The game plays very quickly, concluding in about 90 minutes, with a minimum of charts and tables to consult.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Red God of War: The Soviet Operation Mars, 1942",
        "description": "By the winter of 1942, the Red Army of Workers and Peasants had contained the German attacks of the previous summer and fall. Now came the time for a whole series of counter-offensive of its own, designed to cut off and destroy the weakened Nazi armies.&#10;&#10;The northernmost of these would be Operation &quot;Mars&quot;, aimed at the German Ninth Army around the city of Rzhev, west of Moscow in the winter of 1942. The Soviet plan, the work of the brilliant Marshal Georgi Zhukov, called for smashing the already-weakened Germans with a heavy commitment of tanks and fresh troops. When this first objective had been reached, a second operation, code-named Jupiter, would encircle and destroy the German 3rd Panzer Army to the south.&#10;&#10;Despite horrible weather and very rough forested terrain, the initial Soviet attacks went very well. But German resistance stiffened, and as the Red Army failed to make further progress Zhukov reacted by committing more and more men and tanks. Suicidal courage only added to the Soviet casualty lists, and by the time the offensive sputtered to a halt Soviet losses topped 335,000 men and 1,600 tanks.&#10;Little known thanks to Soviet government silence for 50 years, the offensive was designed as a companion to the &quot;Saturn&quot; offensive around Stalingrad. The fact that the offensive was repulsed with heavy losses meant it was not discussed in Soviet accounts of the Great Patriotic War. While the offensive failed to accomplish what the Soviet High Command and General Georgi Zhukov wished, it did provide what the Soviets needed most, a means of keeping German forces of Army Group Center in place while the Saturn offensive in the south ran its course.&#10;&#10;Red God of War covers Operation Mars using the same game system as Alsace 1945 and America Triumphant. Game pieces represent regiments, brigades and divisions. Headquarters are vital to activate units and send them into action; supply is also important to keeping your units at full efficiency and players must choose how to allocate their resources. There will never be enough of them to accomplish everything at once.&#10;&#10;Game Turn: 2 days&#10;Hex: 5 miles (8 kilometers) &#10;Units: Battalion to Corps&#10;&#10;Game Inventory:&#10;&#10;    One 22 x 34&quot; full color map&#10;    One dual-side printed countersheet (280 1/2&quot; counters)&#10;    One 16-page Red God of War rulebook&#10;    One 6-sided dice&#10;&#10;&#10;&#10;&#10;Solitaire Playability: Good&#10;Complexity Level: 1,5 out of 5&#10;Players: 2&#10;Playing Time: 60 to 120 minutes&#10;&#10;(Source: Avalanche Press website and user's description)&#10;&#10;",
        "artist": "Shannon Brown,Shane Ivey,Terry Moore Strickland"
    },
    {
        "name": "Railroad Dice 2",
        "description": "The sequel to Railroad Dice simplifies the game concept of the original, but still gives players the ability to build track made up of dice, and transport passengers.  On their turns, player may roll dice, build track, purchase engines, or transport passengers.  Players are only restricted on the dice-rolling phase; all other actions may be repeated until resources and/or money run out.&#10;&#10;An online tutorial exists to help new players learn the game.  The English rules are notoriously vague, and the tutorial is recommended for anyone new to the game (dated Oct 2005).&#10;&#10;The game comes with the original &quot;simple&quot; single-track dice and new orange &quot;complex&quot; dice with only multi-track options (these are different than the Railroad Dice: Crossing die that was given away at Essen 2004).  It also includes an expansion company tile and shares to be used with the original Railroad Dice.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Kutuzov",
        "description": "Kutuzov is an interactive, play it complete in one-sitting card-driven game of sweeping manoeuvres, epic battles, storied sieges, lethal attrition and crucial-to-win troop morale for one to four players from the designer of The Napoleonic Wars and Wellington.&#10;&#10;In the spring of 1812 Emperor Napoleon of France gathered the regiments of 20 nations together into the largest military force yet raised in Europe. That June he led this Grand Army of over 600,000 men across the Nieman River to begin what he believed would be his greatest and perhaps final triumph: the invasion and subjugation of Russia. As the defending armies fell back before this prodigious onslaught, Tsar Alexander turned to a pugnacious and crafty old warrior to help save his country, his people and his Romanov Dynasty: Marshal Mikhail KUTUZOV.&#10;&#10;Kutuzov uses the same basic rules system as found in The Napoleonic Wars, as it has been modified for even more interactive play in Wellington . As with the later title, there are no diplomatic or political rules: other than those which come into play should Imperial morale fall so low as to trigger the desertion of the Austrians or outright revolt of the Prussians. There are no naval rules other than a Russian ability to move between friendly ports and a &quot;Hornblower&quot; Home Card that allows for a Russian invasion on the Baltic Coast). Kutuzov is thus primarily a game of manoeuvre and combat, where players can recreate the sieges and legendary battles made so familiar to gamers as brought to life in such great books as Leo Tolstoy's War and Peace.&#10;&#10;As this is Russia, however, not all enemies stand in solid ranks before you. Players must contend not only with their opponents but with Cossack raiders, Polish Lancers, often brutally horrifying attrition, fragile morale, treacherous allies, political events from outside the theatre of war and, of course, &quot;Scorched Earth&quot; and &quot;General Winter&quot; himself, whose scourge effects both invader and defender of Holy Mother Russia.&#10;&#10;110 Cards, most with quotes from the actual participants in that great struggle, drive the game and bring to it the flavour of being in Russia during the 1812 Campaign. The Imperials and Tsarists each have mini- &quot;Home Decks&quot; of a dozen cards each to share, thus increasing the chance that events, forces and options that were presented to the original contenders will arise during play. The other 86 cards, which include many &quot;Must Play&quot; political events, however, ensure every playing of the game will be very different.&#10;&#10;Kutuzov comes with a campaign game that can last one, two, three or four turns - but which includes numerous mechanisms that can bring the game to a &quot;Sudden Death&quot; ending at the conclusion of or even DURING A TURN.&#10;&#10;Mark and Fred, in seeking to deliver more value, variation and enjoyable gaming have provided two other game start scenarios which allow for the game to begin at the commencement of what would be turn two (On to Smolensk!) or turn three (Napoleon in Moscow) of the campaign. A fourth and rather unique method of play allows for two players to each take ONE of the powers from EACH side, in a highly competitive and unusual game of labyrinthine think and double-think. A fifth version allows for two players to play the game using a SINGLE hand of cards each, with &quot;chips&quot; to buy additional cards for their side as the play progresses.&#10;&#10;The Campaign and the Scenarios:&#10;&#10;&quot;Invasion&quot;: A Turn One game start should see the French and their Allies' military juggernaut smash across the border and attempt to catch and annihilate the Russians before they can mass to defend their Motherland Can the players surpass their historical counterparts?&#10;&#10;&quot;On to Smolensk !&quot;: This permits players to avoid the border battles and initial French advances to begin play at a watershed of the Campaign: The Grand Army confronting concentrated Russian forces defending Smolensk immediately before Kutuzov arrives to take command. Will the French advance on Moscow as they did historically or seek victory through an alternative offensive direction&hellip;north to St. Petersberg or south to seize the Ukraine and other southern victory points?&#10;&#10;&quot;Napoleon in Moscow&quot;: In this version of Kutuzov the bloody Battle of Borodino has been fought. The Grand Army reposes in Moscow awaiting Russian surrender or at least agreement to terms. The first chill snow of Winter has fallen, harbinger what's to come: should the French remain deep in Russia hoping to conquer the country or is it time to withdraw to better defences for the 1813 Campaign?&#10;&#10;In all of the scenarios, the Imperial Powers have an initial advantage in numbers, leadership, Resources, and Morale. They are, after all, an Army that has never known defeat; a superb military instrument, led by the most powerful man in Europe with his devoted retinue of almost legendary Marshals. They face an enemy who has not tasted victory in Battle in nearly a generation, let alone full-scale war of the likes of which Napoleon wages. &#10;The French must take advantage of their superiority quickly, as that will soon dissipate in the immense marshes, unending steppes and fiercely fought over fields and cities of Russia. If they do not or can not succeed, then the advantage slips away to the forces of the Tsar, who, under Kutuzov, will not just be defending Russia, but will be advancing into the outer marches of that yet fragile empire led by their archenemy&hellip; Napoleon.&#10;&#10;",
        "artist": "Rodger B. MacGowan,Leona Preston,Guillaume Ries,Mark Simonitch"
    },
    {
        "name": "Monmouth",
        "description": "Battles of the American Revolution Series: Volume V&#10;&#10;At Monmouth Courthouse in east-central New Jersey, General Washington's Continental Army came of age. Leavened by their experiences during the winter encampment at Valley Forge, the Continentals would give as good as they got on that sweltering mid-summer's day: June 28th, 1778.&#10;&#10;Includes interesting rules that add historical context such as:&#10;--Lee's terrible command leaving some American troops following random orders&#10;--Washington arriving one-third of the way through the battle to relieve Lee&#10;--Generals on each side with varying degrees of skill, many limited to commanding only a few troops&#10;--Molly Pitcher, who rallies a single American artillery unit and then is attached to that unit throughout the rest of the game&#10;--Variable reinforcements&#10;&#10;",
        "artist": "Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "Pacific Typhoon",
        "description": "Pacific Typhoon is a strategy card game for 3-7 players, ages 10 to adult. The game uses the same system that first appeared in the popular 1998 Avalon Hill card game Atlantic Storm.&#10;&#10;The game setting is the naval and air war in the Pacific theatre during World War II. Pacific Typhoon depicts the history of the air-naval battles of the Pacific War with 40 battle cards, each of which represents an historical naval or air battle such as Pearl Harbor, Midway, Surigao Strait, etc. Players compete by fighting a non-sequential series of twenty of these battles. A battle lasts for one round of play, so each player gets to play once per battle. The round-leader starts by picking one of two battle cards (he discards the unpicked one). The chosen battle card determines the year of battle. The battle card is also worth a certain number of victory points and resources to whoever wins it. The round-leader alternates after each battle, and the game ends after 20 battles (when the Battle Card deck is exhausted).&#10;&#10;Players are not assigned to sides. Instead, each player has a hand of force cards that typically includes both Allied and Japanese cards. The force cards represent warships, submarines, aircraft, special weapons, and events. Non-event cards have three separate combat values: Air, Surface, and Sub. For example, the battlecruiser Kirishima has combat values of 1 air, 4 surface and 0 sub; the submarine Flasher has combat values of 0 air, 1 surface and 3 sub; the Zero fighter (Sakai) has combat values of 3 air, 0 surface and 0 sub. Force cards are also worth victory points because they can be destroyed in battle.&#10;&#10;After the round-leader selects the battle card, he announces the &quot;suit&quot; of battle: Air, Surface, Sub or Combined. Only the combat values in the announced suit will affect the outcome of the battle. In a Combined battle, the combat values of all three suits are added together. The round-leader also announces the time of battle: Day or Night. Some force cards are only playable in a day battle (for example, the aircraft carrier Lexington), a few are only playable in a night battle, but most are playable in day or night battles. The round-leader then gets to play from his hand. He may play on one side or the other (but not both sides together). Each player after him in turn may then play on one side or the other.&#10;&#10;",
        "artist": "Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "Aqua Romana",
        "description": "Loosely translated from the website:&#10;The citizens of the early Roman empire lack a substantial part of life: drinking water.&#10;&#10;Experienced architects and their workers take up the challenge and build the monumental Roman water system: the aqueducts.&#10;&#10;It's not always easy, since the architects need to oversee many building sites at one time. Therefore, not all water pipes can be completed.&#10;&#10;Plan ahead such that your workers build the longest aqueducts to earn the most fame at the end.&#10;&#10;Aqua Romana is a tile laying game for 2 to 4 players. During his turn a player can extend an aqueduct, close an aqueduct and earn points for closed aqueducts.&#10;&#10;To extend an aqueduct, the player chooses a worker and the corresponding architect, play the corresponding tile, move the workers forward and move the architect ahead.&#10;&#10;An aqueduct is closed when it ends at the side of the gameboard or a non-fitting neighboring tile.&#10;&#10;A closed aqueduct yields 1 point for every tile it is long. If an aqueduct crosses a tile for the second time, it yields two points.&#10;&#10;The game ends when no tile can be played for an entire round. Winner is the player with the most points.&#10;&#10;",
        "artist": "Michael Menzel"
    },
    {
        "name": "Dschamál",
        "description": "Released in Essen 2005.&#10;&#10;Dschamal offers four variants on a simple game of feeling in a black sack for oddly shaped wooden pieces. Not gentle, relaxed feeling, oh no. This is dog eat dog, fight like animals feeling, as two players each thrust their hand into the sack to grab a piece before the other. The rules call it a duel, and a duel it is! As the crowd watches the very entertaining spectacle of people trying to feel a shape without looking in, pulling the bag back and forth, and trying not to pull out the wrong shape, or a black shape, or to grab the camel piece and slam it down shouting &quot;I'm the camel!&quot;, they get to decide if players have cheated or failed the task. It's a very aggressive but fun game. First player to seven pieces win.&#10;&#10;The rules are suprisingly complex though, with several What If variants that you have to run through to understand all the possible outcomes. The other three games in the rules offer variants on what to do with the pieces, such as build a tower, but it's essentially still a duel. Along with Bausack and Bamboleo, Zoch seem to have cornered the market in oddly shaped wooden pieces. Dscahamal is nicely made and fun, but you may tire of it quickly, both physically and mentally.&#10;&#10;",
        "artist": "Eva Paster"
    },
    {
        "name": "Pecunia non olet",
        "description": "Pecunia non olet &ndash; &quot;Money doesn't Stink&quot;&#10;&#10;A card game in the old Rome, in which the players act as rental toilette owners, who have to earn their money from the Romans , who feel an urgent need...&#10;You have three toiletts to rent to several different types of Romans: Women, who can share a place, senators, who refuse to sit next to slaves, and citizens. Each Roman has a specific amount of time he/she will need and a sum of money he/she will pay afterwards. Whoever reaches a certain fortune (depending on the number of players) wins the game.&#10;&#10;The game includes 70 roman &quot;customer cards&quot;, 40 action cards, roman coins and wooden round markers&#10;&#10;",
        "artist": "Christian Fiore,Knut Happel"
    },
    {
        "name": "Double Agent",
        "description": "From the author's homepage:&#10;&#10;Double Agents is published as an insert in the french boardgame magazine &quot;Des Jeux sur un Plateau&quot;, in the October 2005 issue (#20). In this card game, each player is trying to manipulate five double agents with ambiguous loyalty, and to guess which ones are working for him and which one for his opponent. Hidden information, face down cards... it's a two player game, but it's also a classical Ludo or Bruno game, where you don't know what is sophisticated bluffing and what it just global chaos.&#10;&#10;From an earlier description on Bruno Faidutti's website:&#10;Double Agent is based on a simple idea : each player knows each agent's loyalty to him, but doesn't know his loyalty to his opponent. In such an ambiguous situation, it's hard to decide who you can trust with your precious top-secret documents, which must not end in enemy hands. Each player plays cards face down on his side of the gameboard. It is therefore a bluffing game, but it is also, as one can expect from a collaboration between Ludovic and me, a deliberately chaotic and often uncontrollable game&#10;&#10;",
        "artist": "Pierô"
    },
    {
        "name": "Toru",
        "description": "Unleash your inner dragon!&#10;&#10;Toru is a party game, where players pass chips to each other. Everybody simultaneously passes a chip to their left, chanting 'TO!', and picks up the chip given by their right neighbour, chanting 'RU'. This should proceed as fast as possible.&#10;&#10;Players start with seven chips, each carrying a symbol. There are ten different symbols. As soon as one player has a collection of four chips with one symbol, and three chips with another, he shouts 'TORU' and grabs one of the dragons that are placed in the middle of the table. All other players try the same. One player loses out, as there is always one dragon less than the number of players.&#10;&#10;All players who managed to grab a dragon score a point. If the colour of the dragon matches the colour of the secret counter they received at the start of the round, they get a bonus point. First to reach eight points wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Wits & Wagers",
        "description": "Not a trivia buff? It doesn't matter! In Wits &amp; Wagers, each player writes a guess to a question such as &ldquo;In what year did the bikini swimsuit makes its first appearance?&rdquo; or &ldquo;How many feet wide is an NFL football field?&rdquo; and places it face-up on the betting mat. Think you know the answer? Bet on your guess. Think you know who the experts are? Bet on their guess. The closest answer--without going over--pays out according to the odds on the betting mat. Strike it big and you&rsquo;ll be cheering like you just hit the jackpot!&#10;&#10;Wits &amp; Wagers is a trivia game that lets you bet on anyone&rsquo;s answer. So you can win by making educated guesses, by playing the odds, or by knowing the interests of your friends. It can be taught in 2 minutes, played in 25 minutes, and accommodates up to 20 people in teams.&#10;&#10;",
        "artist": "Jacoby O'Connor"
    },
    {
        "name": "Kaivai",
        "description": "Kaivai, by the Ostertag brothers, is a board game about a dynamically-growing island region and the various uses of the islands. The title is Polynesian and means &quot;Water eaters&quot;.&#10;The game is about catching fish to trade for shells and points. The shell money is used to build up the islands, in order to gain more points. At the start of the game the players bid for turn order. The highest bidder goes first and may move his ships - but must pay dearly for new islands. Those who bid less get to pay less for the islands, but don&rsquo;t get to move as much. The players can choose from six different player actions. When a player chooses and action for the first time, it&rsquo;s free. But if it&rsquo;s chosen a second time, it must be paid for and the payment increases each subsequent time that action is chosen. At the start of the next round, the value of the shells is reduced and the fish come closer to rotting. After 8 rounds comes the final scoring, in which the portions of the islands controlled by the players are counted.&#10;(Spielbox)&#10;&#10;Expanded by:&#10;&#10;    Kaivai Expansion&#10;&#10;&#10;&#10;&#10;",
        "artist": "Anselm Ostertag"
    },
    {
        "name": "Chaos Arena",
        "description": "CHAOS ARENA is a two player fantasy board game of SKILL, CARNAGE and SHEER BLOODY CHAOS where you take on the roll of MAGICK USERS in an all out duel to the death within the DECAYING and DEMON infested walls OF the CHAOS ARENA, floating FIVE THOUSAND FEET in THE fetid air. As a MAGE you are aided by a WARBAND of MERCENARIES and SLAVES to help you&#10;DESTROY YOUR ENEMY! To win you must simply... KILL THE OTHER WIZARD!&#10;&#10;Chaos Arena is a tactical simulation of armed conflict (war) made within the great tradition of classic two player beat-em-up board games like chess and hnefatafl, but set in fantasy world (quite possibly a disc).&#10;Chaos Arena has, unlike the static and linear chess, a random factor added to it. This takes the form of dice, chaos cards and a choice of spells to alter the flow of the game. Because during conflict - just as in life - nothing is static and linear. And so, while playing, you'll have to learn to change your tactics to suit the altered conditions of the game as it progresses.&#10;&#10;",
        "artist": "Steve Sic Evans van der Harten,Misja van Laatum"
    },
    {
        "name": "Comrade Koba",
        "description": "In Comrade Koba players bet on which three Soviet Communist Party Members will survive Stalin's Great Terror.&#10;&#10;The winner is the player who has one of his Comrades the closest to Stalin when the game and the Terror ends.&#10;&#10;",
        "artist": "Patrik Hultén"
    },
    {
        "name": "Bunte Runde",
        "description": "An adaptation of &quot;Wheel of History&quot; from New Games in Old Rome.  Marketed for children, but has variants for adults as well.  Nice-looking components (wooden pieces of different colors and shapes).&#10;&#10;Depending on the age of the players, players decide if they play with the 36 wooden pieces, or with the 25 picture tiles.  The other pieces are not needed in either case.&#10;&#10;The 36 wooden pieces or 25 picture tiles are mixed up and laid out in a circle.&#10;The game figure is placed on any of the wooden pieces or picture tiles.  &#10;The 36 (or 25, respectively) small gold coins, and the large gold coin are placed in the center of the circle.&#10;&#10;On a player&rsquo;s turn, he or she moves the game figure forward either one, two or three places clockwise along the circle.  The player then takes the wooden piece that the game figure is standing over, and places the piece in front of themself so it is visible to all players.  The game figure remains in the empty space.&#10;&#10;When a player takes the last piece of a color (ie. yellow) or the last of a shape (ie. triangle), the game is interrupted, and scoring takes place.  Every player who has a piece of this color or shape in front of them receives a small gold coin for each of these pieces. When playing with the picture tiles, scoring is based on the colors or animals. (with only 5 gold coins)&#10;If the taken piece is the last one of a color and shape, there is a double scoring: 6 (or 5) small coins for the appropriate color and 6 (or 5) for the appropriate shape (or animal) are distributed.&#10;&#10;The game ends if all 36 (or 25) small coins are distributed.  The player with most coins wins.&#10;&#10;",
        "artist": "Rolf Vogt"
    },
    {
        "name": "Liebrary",
        "description": "In Liebrary, one player reads the title, author, and synopsis of a real-life book (e.g. Julius Caesar, Jurassic Park, or Mr. Brown Can Moo).  The other players must each write and submit their best attempt at a first line for the book.  The first player reads all the submissions, including the real first line of the book, and then the other players each try to pick out the real one.  Players get points for choosing the real first line, getting other players to select their submission, and possibly knowing the real first line before it is revealed.  The reader gets points only if no players correctly guess the real first line, but the reader position rotates.&#10;&#10;This game is very similar to Balderdash and others of that nature, but using books instead of word definitions.&#10;&#10;Similar to:&#10;&#10;    Ex Libris&#10;&#10;&#10;&#10;&#10;",
        "artist": "Daryl Hannah,Alvin Madden,Hilary Shepard"
    },
    {
        "name": "FAB: The Bulge",
        "description": "The Fast Action Battle (FAB) Series - Volume 1: The Bulge&#10;&#10;From Rick Young, designer of Europe Engulfed, comes a series of fun, tense block games. FAB games focus on speed and playability with low-unit density while keeping the history both accurate and exciting.&#10;&#10;Volume 1: The Bulge brings you the Battle of the Bulge from December 16th through December 27th. You command the division and brigade level units using the historical orders of battle. You order your forces to key points, and decide how and when to order extra Assets to bolster them. Note that there are never enough of these Assets to give to all the units begging for them, so you need to weigh your decisions carefully.&#10;&#10;FAB delivers a new blend of units and decisions to the block game genre: your forces are a mixture of wooden blocks and die-cut counters.&#10;&#10;&#10;     Blocks: your divisions and brigades are multi-step wooden blocks with printed labels on one side only, with step-losses represented by rotating the blocks. FAB has a new twist on the units in that the pips on the edges of the blocks are color coded to represent troop quality, which can change as a Division suffers losses. Elite Units can lose their edge and become Veteran, while Green Units can harden and become Veteran as they experience the strains of combat. &#10;&#10;&#10;&#10;     Counters: Die-cut counters represent (1) additional Assets available to you as the Field Commander and (2) major Events that could have or did occur during the battle. &#10;&#10;&#10;&#10;     Assets represent engineers, army level artillery, independent armor and infantry regiments/battalions, and other small units that can be temporarily assigned to the battles that you deem important to your strategy. &#10;&#10;&#10;&#10;     Randomly drawn Events provide divisional replacements, air strikes, interdiction teams, parachute drops, and events unique to each battle in the Series. These Events represent unique opportunities which you can use to influence the outcome, although you cannot count on exactly when these opportunities will be available to you. &#10;&#10;&#10;Another strong element of FAB is the return of Special Actions, which have already been proven in GMT&rsquo;s Europe Engulfed design to give flexible, exciting game play. Special Actions give you tense choices in deciding how and when to seize initiative or interfere with a sudden move by your opponent.&#10;&#10;Series Designer: Rick Young&#10;Series Developer: John Foley&#10;Published: 2007&#10;Online Play&#10;&#10;&#10;     Wargameroom (real-time)&#10;&#10;&#10;",
        "artist": "Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "The End of the Triumvirate",
        "description": "Players take on the role of one of three leaders in ancient Rome: Caesar, Pompeius, or Crassus. Each is seeking to dominate the others by various means. You could try a military victory by creating a massive land block... or perhaps a political victory by being elected as Consul twice... or perhaps you can win by sheer skill by raising your talents...  This game is designed for exactly three players (tackling the usual problems games at this player count have) but comes with a variant to play with only two players as well.&#10;&#10;The turn play consist of 3 phases:&#10;1: Supply phase - Each province supplies gold or legions (based on the type of province)&#10;2: Move Phase - The player moves their Character to collect gold or to attack their opponents with Legions following their Character&#10;3: Action phase - can be used to do number of actions such as Persuade citizens, produce weapons or increase military or political competence.&#10;The player turn ends by moving the calendar stone one step down the track.&#10;&#10;The game can be won by three different ways and ends immediately if one of the conditions is achieved:&#10;Political victory: A player is elected for consul twice (by having most citizens in his forum at the end of a year)&#10;Military Victory: A player conquers their 9th Province&#10;Competence Victory: A player reaches VII on both Competence&#10;&#10;&#10;",
        "artist": "Andrea Boekhoff"
    },
    {
        "name": "Rotundo",
        "description": "Players try to put together the best marble collection by participating in auctions and collector&acute;s fairs.&#10;&#10;Essen 2005.&#10;&#10;",
        "artist": "Christoph Clasen"
    },
    {
        "name": "Sybarit",
        "description": "Trivia game about food. The first player draws a card which gives the category (food, drinks, etiquette, or a bit of everything) of which they should answer a question (and also a value, more about this later). They can choose a question for one point (easier) or one for three points (harder). If they answer the question correct they gain the points, if not no points. There are also a few jokers that give special rules for how many points a question should be awarded (including among others minus points, and &quot;as many points as the last player got&quot;). After the question is answered, the category cards are kept in a separate pile for each player.&#10;&#10;At the end of the game the card values for each player are summed up. The player with most gets awarded an additional five points. The player with most points after this is the winner.&#10;&#10;Awards&#10;&#10;2007 &#195;&#133;rets Voksenspil, Adult Game of the Year Denmark&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Der Weg nach Drakonia",
        "description": "Part of the &ldquo;Das Schwarze Auge Brettspiel&rdquo; (The Dark Eye Boardgame) line. (The Way to Draconia) is a card/board game  who each control a well-known adventuring group / race. Each race is comprised of typical RPG-style heroes. Each hero has special abilities that let him get ahead in the game. The game ends as soon as a hero reaches the goal space in Drakonia. The goal of the game is to move your heroes as far along the path as possible. Multiple cards in hand let the heroes slowly but surely move forward on the difficult path. Being with your own group naturally makes things move more quickly, but careful, other heroes might block your path. And faster than you&rsquo;d like, a hero might find himself injured on the side of the road or sent back to the start.&#10;&#10;",
        "artist": "Zoltan Boros,Michael Nietzer"
    },
    {
        "name": "Meikyu Kingdom Card Game: Make You Conquest",
        "description": "In the Meikyu Kingdom Card Game, each player tries to conquer dungeon cards using heroes and items selected from their hands.&#10;&#10;Each turn, a player draws a card and then performs one of the following actions: (1) Conquer a dungeon card, (2) develop a conquered card, (3) attack a dungeon card owned by another player, (4) draw an extra card.&#10;&#10;Conquering a dungeon card involves matching the value of the card with the &quot;Bravery&quot; values of adventure cards played from your hand or playing a lower value to which the value of one die roll is added.&#10;&#10;Each dungeon card shows a star-value, and by developing a dungeon card you can double this value. The player who is first to collect a 10 star value in dungeon cards wins the game.&#10;&#10;",
        "artist": "Ukkari Honpo"
    },
    {
        "name": "Six",
        "description": "Six is a deceptively simple-looking abstract strategy game in which two (or four) players take turns placing their colored hexagonal tiles while trying to create one of the three &quot;winning shapes&quot; &ndash; triangle, hexagon or line &ndash; out of six of their tiles. If all tiles have been placed from players' hands without someone winning, players then take turns picking up a previously placed tile and moving it to a new position.&#10;&#10;With the advanced rules, players are allowed to move a tile that will separate all the tiles into two or more groups; by doing this, some pieces are removed from the game, and this provides an alternate way to win by reducing the opponent to five or fewer pieces (as the opponent cannot possibly form a winning shape).&#10;&#10;",
        "artist": "Albertine Blass,Bernhard Kümmelmann,Ariel Laden,Karl Malepart,Steffen Mühlhäuser,Alex Weldon"
    },
    {
        "name": "Splash Attack",
        "description": "Splash Attack is a fast reaction game in which players must quickly react to the roll of the dice. The game comes with several chunky wooden fish in three different colors, with three of each color of fish, each having a different design on them consisting of either squares, circles, or triangles.&#10;&#10;On each turn, someone rolls the two special dice. One die has colored faces, and the other die has shapes. Players look at the die roll and quickly grab the matching fish from the table! For example, if blue and square is rolled, you would want to grab the blue fish with squares on it.&#10;&#10;However, if a player already has the matching fish in his play area, the players yell &quot;Splash Attack!&quot; and grab the red piranha. If the player that already had the matching fish is the first to do this, he gets to permanently keep the fish as a point. If a different player is quickest, however, the player loses the fish back to the center of the table. Thus, you must be the quickest to react to a matching pattern twice in a row to score. The first player to score three fish wins!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Big Kini",
        "description": "In this game, players explore a variable landscape to discover islands and try to gain influence and prestige. Influence is gained by taking over posts on the island which gives the player special abilities.&#10;&#10;Expanded by Big Kini Expansion: 5-6 Players and Action Cards&#10;&#10;",
        "artist": "Bert Elter"
    },
    {
        "name": "Marquis",
        "description": "In this card game 2-4 players try to obtain the title &ldquo;Marquis&ldquo;. To achieve this goal, players have to collect coins used to buy jewels. The player whose stock of jewels has the highest value wins the game.&#10;&#10;Every player has a set of 12 cards, each card showing a character the player can impersonate. Each of the characters has a special ability which can be used (the diamond dealer, for example, can buy diamonds twice, the pickpocket steals a coin from the richest player etc.). Although all of the players try to gather as many jewels as possible, these cannot be collected easily as they have to be purchased with coins first.&#10;&#10;The game ends as soon as one of the player cannot play any character during his turn. After this the jewels which have been collected are counted. Players score one point for each diamond and five points for each ruby they gathered.&#10;&#10;From the English rules:&#10;It is a time of intrigues over the marquis' domain. The Prosecutor, the extortioner and the countess covet the invaluable jewels of each other. To buy jewels at the best price, players will have to continuously impersonate new characters. Choose wisely between the 11 roles available and fortune will change hands relentlessly. But do not forget that money is only a mean to achieve your goal. At the end, the title of &ldquo;Marquis&ldquo; will go the one with the fullest jewel case. So be cautious!&#10;&#10;Forget &ldquo;Noblesse oblige&ldquo;, now play catch as catch can. Losers will want to turn the tables!!&#10;&#10;",
        "artist": "Czarnè"
    }
]