[
    {
        "name": "KLASK",
        "description": "The KLASK game board is shaped like a ball field with two deep holes functioning as goals in each end of the field. In the middle of the field, three white magnetic pieces serve as &quot;obstacles&quot; &ndash; do NOT attract them to your own gaming piece! Your gaming piece is a black magnet. You control it by holding a large magnet under the board. This magnet is connected to a small magnet placed on the field. The purpose of the game is to push the small, red ball around on the field with your magnet/gaming piece, shoot the ball past the obstacles and your opponent and into the goal hole (Klask). It&rsquo;s so much fun when your opponent suddenly is covered in white obstacles or you drop your gaming piece into the goal &ndash; something which might happen if you get a little too eager!&#10;&#10;Place the game board on a table between the two players. Place the three white magnetic pieces on the white fields on the board. Put two coins in each point slot next to the &quot;0&quot;. Each player has a black magnetic gaming piece in two parts. Place the short (thin) part on top of the board and the long (thick) part under the board in such a way, so the two parts &ldquo;catch&rdquo; each other. Place the ball in the corner start field. Steer it with the black gaming pieces.&#10;&#10;The youngest player starts the game. You score a point if:&#10;&#10;&#10;    The ball ends in your opponent's hole and stays in the hole.&#10;    Two or all of the three white magnetic pieces stick to your opponent's gaming piece.&#10;    The opponent accidentally pulls their gaming piece into their own goal hole.&#10;    If the opponent loses their gaming piece.&#10;&#10;&#10;Each time you get a point, you must move your coin one point forward in the point slot. The player who first reaches the KLASK field wins.&#10;&#10;During the game:&#10;&#10;&#10;    If one of the white magnetic pieces sticks to a gaming piece, the game continues; if two of the white magnetic pieces stick to one gaming piece, the opponent gets one point.&#10;    If the ball falls over the edges of the board, you must place the ball in the corner start field in the half from which the ball fell.&#10;    If one or more white magnetic pieces fall over the edges of the board, the game continues.&#10;    Each time a player scores a point, you must put the white magnetic pieces back on the white fields on the board, and the player who did not score a point places the ball in their corner start field.&#10;&#10;&#10;",
        "artist": "Mikkel Bertelsen"
    },
    {
        "name": "Flip 9",
        "description": "Flip 9 is a solitaire game that challenges a player to organize numbered cards in a row from 9-1.&#10;&#10;To start, the player shuffles the cards and lays them out in a row. For the first turn, the player takes any two cards, swaps them, then sums these numbers (summing the numbers again if the sum is larger than nine). For example, if the player swaps cards 6 and 8, their sum is 14, and the sum of those numbers is 5. For the next swap, the player must swap card 5 with some other card. If the player places the cards in descending order from 9-1, she wins.&#10;&#10;The cards in Flip 9 are double-sided, though, and should you become at ease with the basic game, you can advance to the harder one. To start, flip half the cards to show the other side, then lay them out in a row. Each turn you'll still swap two cards, with every swap after the first having one of the cards being determined by the sum of the previous swap &mdash; but now you must also flip over the two cards being swapped. To win, you must place the cards in descending order from 9-1 and have the same side face up on all of the cards.&#10;&#10;",
        "artist": "Chih-Fan Chen"
    },
    {
        "name": "Psycho Raiders",
        "description": "In 1978 four friends experience a nightmarish ordeal.  Steve, Randy, Ginger, and Dawn innocently set out to camp and enjoy the countryside near a small town on Halloween.  Unfortunately their car breaks down and they meet with pure darkness, the Psycho Raiders, once they are on your trail, they hunt to the death...&#10;&#10;This horrifying halloween night may not be survived.  The true story of what happened on this fateful evening comes alive in the pages and gameplay of Halloween Nightmares.&#10;&#10;Psycho Raiders is a horror simulation experience.  Unlike games that tend to aim for perfect balance, Psycho Raiders' main focus is delivering the terrifying experience that occurred on this Halloween night.   Characters and situations are not balanced to equal one another but created to simulate the actual experience.  The game begins very slanted to the raiders, they will assuredly destroy if fighting just ill prepared campers.  Through the use of finding weapons or alerting the nearby town folk of Crucible, the campers can possibly turn the tables on the raiders.  But there may also be a horrid realization that certain town folk are raiders themselves. The campers may not be able to trust anyone!  It might be best to run! RUN AS FAST AS YOU CAN!&#10;&#10;Psycho Raiders is a tactical hex and counter game with each token representing an individual character. Characters have sheets with some individual stats related to speed, strength and will to live. In the short game, the campers can win if any of them escape the north end of the map while hidden.&#10;&#10;Psycho Raiders is a very visceral experience and we have rated it X. Anyone one under the age of 18 is NOT permitted to play.   Pregnant or players with a fragile or nervous disposition are strongly encouraged NOT TO PLAY THIS GAME!&#10;&#10;GAME COMIC CREATED BY CHARLIE FOGEL!&#10;&#10;Note: Psycho Raiders is the first game featured in our &quot;Halloween Nightmares Horrorgame Magazine&quot;, a game magazine dedicated to Halloween and the Horrorgame genre.  Players will need to xerox elements and provide two D6 and pencils to play this game&#10;&#10;",
        "artist": "Commode Ministrels in Bullface,Charlie Fogel,Manifester,MarderIII,Wizard333"
    },
    {
        "name": "Der unendliche Fluss",
        "description": "In Der unendliche Fluss, the players need to help the three magicians find the right way to six ports, but instead of moving the figures and the boats, they'll move the entire game!&#10;&#10;Each round the children receive a secret assignment that tells them where their particular magician needs to go, but since the unending river is constantly in motion, they might accidentally bring some other mage to that destination...&#10;&#10;",
        "artist": "Rolf Vogt"
    },
    {
        "name": "Nightmare Forest: Dead Run",
        "description": "You and your fellow campers are making a dead run through a zombie filled forest, trying to escape the woods filled with zombified forest creatures all hungering for a taste of your brains!&#10;&#10;With a combination of cards and dice; this game is different every time you play and the challenge keeps shifting.  Not only do you have to run and escape, you have to live.&#10;&#10;You have a limited amount of dice each round to fight your way through while you and the other players can change the forest as you make your mad dash to safety.&#10;&#10;Beware the squirrel! He wants your brains, not your nuts!&#10;&#10;&#10;Game Play:&#10;You move across a game play area covered in hidden threats that want to eat you (cards) and you have to fight them with a limited and diminishing dice pool.&#10;&#10;You move and challenge a card to progress from the camp to the road.  When you challenge the card in front of you is revealed.  You have to then battle that card to move forward.  You have to decide how many of your attack dice to use.  You also have to decide what (if any) item cards in your stash you want to use to help you.  You can only use each dice once per turn so be careful.&#10;&#10;Be the first to escape the Nightmare Forest at a Dead Run and be victorious.  Fail...and become one with the flesh eating horde.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Space Hulk (fourth edition)",
        "description": "From the depths of space an ancient vessel drifts slowly towards the Imperium of Mankind - a space hulk. Within its confines, untold thousands of Genestealers slowly emerge from hibernation. The Space Marines must enter the cramped corridors and tomb-like chambers of the ancient ship to defeat this alien menace.&#10;&#10;Space Hulk is a board game for two players, recreating the battles fought between the Space Marines and Genestealers. One player commands the Space Marines as they carry out deadly missions in the ancient Space Hulk, and the other commands the horde of Genestealers opposing them. Space Hulk's fast-paced rules simulate the tense atmosphere of a mission deep inside the cramped confines of a derelict space hulk, where split-second decisions are needed for victory.&#10;&#10;This new version has 4 extra missions, Boarding Torpedoes, Damage Control Room, Breach Counters (for where the Boarding Torpedoes hit or something else), and a Turbo-lift Tile allowing for multiple levels to clear of Genestealers.&#10;&#10;Also new for this edition are three mini-campaign packs released for the iPad:&#10;-Space Hulk Mission Files: Dark Angels &ndash; Bringers of Sorrow&#10;-Space Hulk Mission Files: Ultramarines &ndash; Duty and Honour&#10;-Space Hulk Mission Files: Space Wolves &ndash; Return to Kalidus&#10;&#10;Each Mini campaign comprises 3 missions specific to the chapter, and rules for creating new missions, plus a brief Chapter history.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Liberty or Death: The American Insurrection",
        "description": "Volume V in GMT&rsquo;s COIN Series takes us back to the struggle of the American Patriots against their parent British government.   A unique multi-faction treatment of the American Revolution, Liberty or Death: The American Insurrection will take 1 to 4 players between lines of clashing red and blue infantry, Indian raids, European politics, British control of the seas, French intervention, and the propaganda war.&#10;&#10;Building off the good works of COIN Series Creator Volko Ruhnke and Series Designers Jeff Grossman, Brian Train, Mark Herman, and Andrew Ruhnke Designer Harold Buchanan applies his knowledge of the American Revolutionary period to take a new look at the struggle that built a nation. COIN Series Developer Mike Bertucelli continues his work on this project and Volko Ruhnke is an active advisor.&#10;&#10;Liberty or Death: The American Insurrection features the same card-assisted counterinsurgency game system as GMT's Andean Abyss, Cuba Libre, A Distant Plain, Fire in the Lake and Gallic War with a set of twists that take the COIN Series to the 18th Century, including:&#10;&#10;&#10;    Brilliant Strokes that trump initiative (Led by leaders like Washington, Rochambeau, Clinton and Joseph Brant) &#10;    Irregular troops (Patriot Militia and Indian War Parties) &#10;    Regular troops (British and French Regulars and Patriot Continentals)  for battles and skirmishes with line infantry &#10;    Rabble Rousing, Skirmishing, Tories, variable French entry, and Indian Raids&#10;    Variable impact of naval commitments between the British and French &#10;    French blockades to confound British plans&#10;    French financing options to feed the Patriot&rsquo;s war effort&#10;    A large deck of 110 + cards for great play variety &#10;    Short, medium, and long-length scenarios with period-event or random options. &#10;&#10;&#10;Each faction in Liberty or Death brings new capabilities and challenges:&#10;&#10;As the British, you have to deal with an Insurrection across a massive region.  With control of the seas (at least until the French arrive), you have extreme flexibility and can move across the coast and cities at will.  You will muster Tories to support your efforts.  They will march with you to battle, but they need your cover.  You can control any space you choose, but you cannot answer every threat on the map.  The Indians will work with you but, like the Tories, will need you to coordinate and protect them when the Patriots become aggressive.  With the leadership of Gage, Howe, and then Clinton, you will be able to strike a potentially decisive Brilliant Stroke if the stars align.  Each leader brings something new to the war effort.  If you can strike the decisive blow and Win the Day you will be able to build Support and reduce Opposition in short order.  If the option to Battle the French in the Colonies presents itself, it will be hard to pass up!&#10;&#10;As the Patriots, you initially aren&rsquo;t powerful enough to counteract the British Army.  You will need to pick your battles and initially spread the Militia to key areas.  Over time you can train a force of Continentals to take on the British Regulars.  Until then, Rabble-rouse and work with the French to challenge British dominance.  Skirmish with the British in small numbers to make their stay expensive.  Will the French be there when you need them?  Persuade the local population to give you resources to keep the heat up.  Watch the Indians on the Frontier because if they develop their forces unanswered you won&rsquo;t be able to win the game regardless of what happens with the British.&#10;&#10;As the Indian player, you have selected the lesser of two evils in aligning with the British.  You will work with them to lower Opposition using Raids but you will be developing your footprint by Gathering forces and building villages.  The British can help you to protect them from the Patriots and in return you can assist the British in controlling the region.  War Chief Joseph Brant and later War Chief Cornplanter give you the ability to mount a decisive attack with your War Parties but will it be worth exposing your villages to Patriot attack?&#10;&#10;As the French, you have the ability to be the thorn in the side of the British in North America.  With the Hortalez Rodrigue et Cie Company, formed to feed the Patriots resources, you can fund the Insurrection.  Your agents can rally assistance in and around Quebec and you can facilitate privateers to steal resources from the British. When you sign the Treaty of Alliance with the Patriots, you can bring French Regulars to America to March and Battle.  You can also increase French Naval Intervention, Blockade Cities, move Regulars by sea and Skirmish with the British.&#10;&#10;As with earlier COIN Series volumes, players of Liberty or Death: The American Insurrection will face difficult strategic decisions with each card.  The innovative game system smoothly integrates political, cultural, and economic affairs with military and other violent and non-violent Commands and capabilities.  Rabble-rousing, Indian Raids, Persuasion, Naval Pressure, Letter of Marque, Looting, Trading, Skirmishing, and Foraging and more options are available.  Flow charts are at hand to run any faction short a player&mdash;solitaire, 2-player, 3-player, or 4-player experiences are equally supported.&#10;&#10;COMPONENTS&#10;    A 22&rdquo; x 34&rdquo; mounted game board.&#10;    A deck of 110+ playing cards.&#10;    150+ red, green, tan, blue, and white wooden playing pieces, some embossed.&#10;    6 black and 6 white wooden pawns.&#10;    4 foldout Faction player aid sheets.&#10;    2 foldout Non-player Faction aid sheets.&#10;    2 Sequence sheets.&#10;    A Random Spaces sheet.&#10;    A sheet of markers.&#10;    Rulebook.&#10;    Playbook.&#10;    4 6-sided dice&#10;&#10;DESIGNER: Harold Buchanan&#10;SERIES DEVELOPER: Mike Bertucelli&#10;SOLITAIRE SYSTEM DEVELOPER: Orjan Ariander&#10;MAP ART: Terry Leeds&#10;COUNTER ART: Charles Kibler, Terry Leeds, and Mark Simonitch&#10;&#10;TIME SCALE:    One year per Campaign between Winter Quarters&#10;MAP SCALE:     Area movement&#10;NUMBER OF PLAYERS:     1 to 4&#10;&#10;(source: GMT website)&#10;&#10;",
        "artist": "Charles Kibler,Terry Leeds,Rodger B. MacGowan,Howard Pyle"
    },
    {
        "name": "Spike",
        "description": "It's the early 1900's and you are the owner of one of the fastest growing rail companies in the eastern USA.&#10;&#10;In Spike, you expand your rail network as you connect cities in order to pick up and deliver more goods; complete contracts and routes to bring in money to modernize your train; upgrade your engines, tenders and railcars to transport the most freight; and build farther, transport more, and amass wealth on your way to become &quot;King of the Rails&quot;.&#10;&#10;&#10;Game Summary &#10;Setup&#10;- Randomly distribute the 12 goods tokens into the chart on the board.&#10;- Shuffle track deck, place 4 in display.&#10;- Place the 3 game timer cards on the track on the board, the first one face up.&#10;- Each player:&#10;... gets a random contract showing a starting city, an end city, and several cities along the way. At end of game, earn $ based on city furthest along path to which you connected, +$1 per city along the way.&#10;... gets 3, 4, or 6 (4, 3, or 2 players) contracts, all of which correspond to a different type of good. Contracts have several possible destinations, paying more $ for more distant deliveries.&#10;... gets 5 random track cards; 1st player gives one to last player&#10;... sets up their train: level 1 engine (moves 1 space), level 2 card drawing, one cargo space&#10;... in turn order, players place their loco in any starting city&#10;&#10;Your Turn&#10;- If you have a train on the tracks, advance it up to a number of spaces equal to engine level (1 at first; max 3).&#10;... Move only along your own tracks. &#10;... May not change direction while on track.&#10;... As you move, may jump over cities you don't want to enter.&#10;... If you enter a city, may deliver a good on your train; earn $ according to value showing on contract. &#10;... You may only deliver to any particular city ONCE; may only deliver each type of good ONCE.&#10;- Take one action:&#10;... start train moving (up to your engine level)&#10;... draw cards (up to your card drawing power); may draw from display and/or deck; only replenish display at end of your turn&#10;... build track: play track cards corresponding to tracks on the board; must build a complete link to a city. May play n+1 cards of one type, to count as n cards of another type. The first time you connect to a city, move the corresponding track marker to the bottom row of the chart; earn $1-3 depending on which row the marker started on. Shift the other markers up to fill in the empty space.&#10;... move train one additional space&#10;&#10;Game End&#10;- When the draw deck runs out, flip the next round marker card face up. Shuffle the Display and the discard pile and create a new Display and draw deck.&#10;- When the 3rd timer is face up, shuffle all 3 into the bottom half of the new draw deck. When the 3rd card is drawn, the game ends immediately.&#10;- The player with the most money (tracked on score track) wins.&#10;&#10;",
        "artist": "Pedro Soto"
    },
    {
        "name": "Spellcaster",
        "description": "Legend speaks of the enchanted Sapphire Island. Shrouded in mist and magic, the island summons mages to battle in the ultimate test of magical combat &mdash; but only those who survive the supernatural duels are granted great prestige and riches.&#10;&#10;Spellcaster is a card game pitting two to four mages in a duel of supremacy. You win by exhausting your opponent's  energies or by collecting enough sorcery sapphires to overpower them. Sixty different spells are included from four fields of study: Combat, Conjuring, Healing and Sorcery. Cast one or more spells each turn to overcome your opponent and become the Grand Master Mage!&#10;&#10;",
        "artist": "Kerem Beyit"
    },
    {
        "name": "Safe Breaker",
        "description": "Safe Breaker (a.k.a. Merkurya) is a simple-to-learn game of memory and deduction! The game consists of 12 objects: six showing colors and six showing numbers. (In the original version of the game, these objects were cards; in newer versions, they're castle towers that stick together magnetically.)&#10;&#10;Each player receives one color and one number, keeping these values secret since they form that player's combination. Play starts with one player asking the player to the left if they have a certain color and number. If they have either of those values, they say &quot;yes&quot; and they become the next player; otherwise they say &quot;no&quot; and the question passes to the next player to the left to answer.&#10;&#10;When a player thinks they know an opponent's combination, on their turn they can name that player's color and number. If the guess is correct, that opponent is out of the game and the player gets another turn &mdash; but if they're wrong, they are out of the game instead and the wrongly accused opponent now has the next turn.&#10;&#10;As far as the rules go, that's it! How much do you talk to your opponents? Do you keep quiet or suggest questions for them to ask? Do you remind them who answered what, and if you do, did you remember correctly?! Are you spinning disinformation?&#10;&#10;",
        "artist": "Matt Maddock"
    },
    {
        "name": "Mangrovia",
        "description": "In Mangrovia, a light &quot;gamer's game&quot;/family game with a Caribbean mangrove setting, a clever role selection mechanism allows the players to choose two different bonuses/actions as well as the turn order in which they want these actions to be carried out &mdash; all by placing just one marker. Victory is achievable through a number of viable options, which guarantees high re-playability.&#10;&#10;The game is a fight over acquiring the best locations for your huts in this appealing and unspoiled landscape. If you manage to do so, you will become the rightful successor of the old chief and win the game. You gain Chief points by having the most huts (and the secondmost huts) along each of the eight divine paths monitored by the statues of Gods. Additional Chief points are earned by controlling sacred locations, by collecting amulets, and simply by building huts at lucrative spaces.&#10;&#10;Building a hut requires that the space's landscape is &quot;active&quot; and that you can pay the exact price (not overpay) for the space. Therefore, the game feels tight even from the very start. The game gets tighter and tighter towards the end of the game as you have fewer choices of spaces, and as the actions you choose become more and more crucial.&#10;&#10;In order to succeed in this game, you should carefully choose and time the best possible combination of actions, called &quot;ritual sites&quot;. A boat goes from ritual site to ritual site, first on the west side, then on the east side (in opposite order), triggering each action. If, for instance, you choose a ritual site high up, you will have an early choice of cards, but a late choice of space to build your huts or to collect amulets (and vice versa). A fourth action type is to select &quot;active landscapes&quot; and become starting player, which makes it possible to control the next round. After all players have performed two actions, the round ends. The game is usually played over 10-14 rounds and ends when one player builds his last hut.&#10;&#10;Collecting amulets may be key in this game. Instead of keeping them as Chief points, you may use them to build huts on designated spaces which require payment in amulets instead of cards &mdash; and still to the exact price. Building huts on such spaces may be exactly what you need to get the majority along one or two divine paths. In order to gain enough amulets &mdash; and amulets of the appropriate values &mdash; you should position some of your huts on amulet spaces. The more huts you build on such spaces, the more amulets you can draw. The probability of getting the amulets you need will therefore increase.&#10;&#10;The game board is built as a matrix system, with some spaces being part of two divine paths while other spaces belong to just one. The spaces that are part of two divine paths are obviously most tempting, but can you afford to build your huts there?&#10;&#10;",
        "artist": "Victor Boden"
    },
    {
        "name": "Beasty Bar",
        "description": "The animals are dressed up and ready to enter the &quot;Beasty Bar&quot; nightclub. Who will actually make it through the door?&#10;&#10;Beasty Bar is a fun &quot;take that&quot; card game about party animals. The players play animal cards into a line, and each animal has a special power that can manipulate the order of the cards. Whenever five animals are present at the end of a turn, the two animals up front get to party while the one at the rear has to go home. Whoever manages to send more of her animals to the party than anyone else wins.&#10;&#10;",
        "artist": "Alexander Jung"
    },
    {
        "name": "Jolly Roger: The Game of Piracy & Mutiny",
        "description": "In the card game Jolly Roger: The Game of Piracy &amp; Mutiny, you're a crew member aboard a pirate ship and have just elected a new captain. This man will lead you toward either fortune or disaster &mdash; and thankfully no matter what course of action he takes, if you don't agree with his choices, you can always start a mutiny and become the next captain yourself...&#10;&#10;Each turn, the captain chooses a destination for the ship, a target that it will attack. Once the ship is attacking, the players (more or less!) co-operate to defeat their victim, then they divide the treasure amongst themselves &mdash; but your gold is never secure until you bury it on Treasure Island.&#10;&#10;As you carry out the attack, unrest is always brewing in the kettle. Each time the captain makes a choice, it's possible for one of the other players to call &quot;Mutiny&quot; and try to overthrow him to become the new captain. And when the mutiny begins, you need to decide how to use your cards during the mutiny and the looming battle. How much will you co-operate when you assault an enemy, and what will you keep to yourself to prepare for when the next mutiny starts?&#10;&#10;As is fitting for a pirate, your greatest desire is for gold, and you'll do anything to reach your goal. In the end, whoever collects the most gold becomes the richest pirate in Tortuga!&#10;&#10;",
        "artist": "Loïc Billiau,Fabio Maiorana"
    },
    {
        "name": "Royals",
        "description": "In Royals, players take on the roles of the great noble houses of the 17th century, fighting for supremacy in Europe at that time. With the help of the right country cards, they occupy influential positions and obtain bonuses for this in the form of victory points. The higher the rank of the title associated with the position, the more country cards required. Already-occupied positions can be contested by playing intrigue cards.&#10;&#10;The game proceeds over three periods, with a scoring taking place after each of them. During scoring, the players with the greatest influence in each of the four countries score victory points. After the third period scoring, the game ends with the scoring of the individual titles. The player with the most victory points wins.&#10;&#10;",
        "artist": "Jason Engle,Michael Menzel"
    },
    {
        "name": "Munchkin Treasure Hunt",
        "description": "Game description from the publisher:&#10;&#10;Munchkin Treasure Hunt is a fun board game for up to six players, ages 6 and up &ndash; now everyone in the family can be a Munchkin! Treasure Hunt comes with a board, two custom six-sided dice, 96 colorful cards, four blank cards (so you can write your own!), six character standees, and a rulesheet.&#10;&#10;The munchkins (that's you!), move around the board. If you land on a monster, use the Monster cards to find out how tough it is, then roll a dice and use your Treasures (like Protective Kittens or a Broccoli Smoothie &ndash; EEEUUWW, YUCK) to beat it. When you run out of Treasure cards, whoever has the most gold in their hand wins the game!&#10;&#10;",
        "artist": "John Kovalic"
    },
    {
        "name": "Bucket of Doom",
        "description": "The death-dodging party game.&#10;&#10;When the shit hits the fan you need a plan. Escape from seriously bad situations with the help of seriously useless objects.&#10;&#10;Ever wondered what you&rsquo;d do if you woke up buried alive in an airtight coffin? Or you discover you had an alien parasite in your stomach? Well, we have. And we&rsquo;ve made it into a delightfully dark party game.&#10;&#10;Bucket of Doom is a card based game in a hot pink toxic bucket. Players take it in turns to share their daring escape from impending doom using one of their personal object cards to escape. Players vote for their favourite story, best plan wins.&#10;&#10;",
        "artist": "Ben Drummond"
    },
    {
        "name": "Matcha",
        "description": "The Japanese tea ceremony is a tradition centred on spirituality and servitude. Preparing and presenting a beautiful matcha (tea) for your guest is the ultimate expression of culture, ceremony and respect.&#10;&#10;In Matcha, players attempt to collect the utensils (chadogu) they need to perform a tea ceremony by matching tea ceremony (otemae) cards on the table by either their number (1-4) or suit (tea, water, bowl, &amp; scoop.) Cards are played secretly, and sometimes it will be to your advantage not to match at all.&#10;&#10;With just 18 otemae cards and an assortment of chadogu tokens, Matcha provides plenty of strategy for players who must decide when and where to play their cards to the table.&#10;&#10;Game #4 in 'The Mike Line' of games from Grail Games.&#10;&#10;",
        "artist": "TJ Lubrano"
    },
    {
        "name": "Meteor",
        "description": "There is a storm of meteors heading directly toward our planet! Estimated time of impact is five minutes. We need to work together to destroy them all or the world will be blown to bits. Are you brave and resourceful enough to save our planet? If even one meteor gets through our defenses and hits the planet, life as we know it will be no more. Good luck citizens. It&rsquo;s up to you.&#10;&#10;Meteor is a real-time, cooperative, resource management card game.&#10;&#10;You need to work together building and launching rockets as the time ticks down and the meteors get closer and closer to destroying the planet. Will you blow up all the meteors in time? Only one way to know for sure.&#10;&#10;Meteor plays as a real-time card game. Each player has a hand of cards and a build area (build areas are shared in the six player game). A number of meteor cards are placed in the center of the table. Players must co-cooperatively build rockets to launch at the meteors before the time runs out.&#10;&#10;&#10;Differences from earlier edition:&#10;&#10;The Mayday Games edition includes more cards and additional gameplay options over the earlier edition of Meteor. The Mayday Games version is for 1-5 players; The Game Crafter edition was for 1-6 players.&#10;&#10;",
        "artist": "Marco Echevarria,Allison Litchfield,Benjamin Shulman"
    },
    {
        "name": "Dark Tales",
        "description": "The card game Dark Tales is inspired by classic fairy tales, retold in a dark style. The land of Dark Tales is populated by disturbing creatures and sinister characters, and the interaction between cards and magic items is the key to success: A character, event, or sword used at the right time can determine the fate of the game! Thanks to the many setting cards, the items you collect change their power from game to game.&#10;&#10;",
        "artist": "Oriuzio \"Dany Orizio\" Daniele"
    },
    {
        "name": "Bomb Squad Academy",
        "description": "This is the final field exam of your bomb disposal training course. The instructor has rigged three training bombs for you and your team to defuse, but little do you know that there is no way to actually defuse them! The bombs will explode eventually, and if you want to graduate at the top of the class then you&rsquo;ll want to cut high-value wires without triggering the explosives! Grab your wire cutters and steady that shaky hand, because it&rsquo;s going to be an explosive night!&#10;&#10;In Bomb Squad Academy there are four decks of cards representing the four &ldquo;wires&rdquo; of the bomb, and a trigger track next to each deck. Every round, each player secretly decides (then simultaneously reveals) the wire that they will cut this round (or perhaps they&rsquo;ll chicken out, or even call &ldquo;Wait!&rdquo; preventing a wire from being cut). After actions are revealed, the chosen wires are &ldquo;cut&rdquo; by flipping cards from those decks. When a card is flipped, its value dictates how far the trigger moves down the trigger track and how many points are earned; cutting wires alone is worth a lot more than cutting the same wire as other players. Push the triggers too far and the bomb will explode! Whoever causes the bomb to explode loses points. Players earn useful Tools during the game that they can use to break the rules. Get through three gruelling bombs with the cleverest cuts to finish your final exam with the most points!&#10;&#10;",
        "artist": "Josh Cappel"
    },
    {
        "name": "Blend Off!",
        "description": "&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;The Story&#10;&#10;Blend it Like Becca&mdash;a small-town smoothie shop sensation!&#10;&#10;It&rsquo;s been a slow night, and Becca the shop owner, her young son Kevin and the Master Mixers -- including you! -- have started closing up shop. One minute before close, the door swings open. Outside, you see parked school buses and a line of people all the way to the street corner! The high school girl&rsquo;s volleyball tournament has just gotten out, and everyone is craving a smoothie for the ride home. Becca cuts a deal: whoever blends the most smoothies tonight gets free smoothies for a month!&#10;&#10;The Blend Off has begun, and only one can win. There&rsquo;s just one problem: Kevin. Skittish at best on normal days, he flies into a frenzy, grabbing fruit for you from the fridge at random. Grab the fruit, complete the Orders, and blend your way to victory!&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Overview&#10;&#10;Blend Off! is a game of skill and speed for two to four players from designer Scot Eaton. Master Mixers roll the die (Kevin) to collect fruit to fill Orders from the deck (Becca). When a Master Mixer's fruit matches the Order, they can blend the ingredients and claim the Order for gold stars. There are no turns; everyone plays at the same time in a race for the finish. The winner is the player with the most gold stars at the end of the game.&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Gameplay&#10;&#10;The actions the player may take at any time are: Collect, Blend, Dump, and Blunder.&#10;&#10;Collect - Roll your die to send Kevin to the fridge for fruit. You may take one of the fruit from the table and put it on one of your Blenders. You don&rsquo;t have to take the fruit; you may reroll the dice until Kevin brings you what you want.&#10;&#10;Dump - You may dump the fruit out of one of your Blenders. Because the fruit is already mixed together, you may not dump just one or two ingredients; you must dump the whole Blender. You may, however, choose to dump one Blender into another, combining ingredients.&#10;&#10;Blend - When the fruit in one of your Blenders matches the recipe on one of the faceup Orders, shout out &ldquo;Blend!&rdquo;&#10;&#10;Blunder - If you catch another player make a mistake like calling &ldquo;Blend!&rdquo; with wrong or extra ingredients in their Blender, shout &ldquo;Blunder!&rdquo; They must correct their mistake by dumping their Blender and, returning the Order card for their botched recipe to Becca&rsquo;s deck.&#10;&#10;",
        "artist": "Lina Cossette,Scot Eaton,David Forest,Luis Francisco,Wayne Koenig"
    },
    {
        "name": "The Staufer Dynasty",
        "description": "In The Staufer Dynasty, the players are nobles in the 12th century, accompanying Henry VI on his tour of the areas of Europe brought under control by the Staufer family, an area that included much of modern-day Germany, from the Baltic Sea in the north to Sicily in the south. You're eager to improve your own lot in the land by placing envoys and nobles in positions of power in the six regions represented in this game.&#10;&#10;The game lasts five rounds with each player having three actions per round. Players take actions in order of their family members on the action board from top to bottom; on a turn you either take a supply action (moving to one side of the action board) or a move/deploy action (moving to the other side).&#10;&#10;For a supply action, you pick one of the spaces on the supply table, move the indicated number of envoys and nobles from the province to your personal court, then claim any chests underneath that space. The treasure chests come in different colors, with each color having a different function in the game: the brown treasure chests score points based on how many you collect, the orange ones provide immediate points or figures, the blue ones provide a one-shot bonus, and the purple ones let you collect one of the privilege cards on display. The privilege cards often modify other actions or give you a bonus for doing a particular thing.&#10;&#10;For a move/deploy action, you decide which office seat you want to occupy in a particular region. If this seat isn't in the region where the king is located, you need to spend one envoy as you move clockwise away from the king, placing each envoy in the top part of those regions, until you reach the region that you want to occupy. You then pay the cost of the office seat, placing one figure &mdash; possibly a noble if the seat demands it &mdash; in that seat and all the other figures in clockwise order, one per region. When you occupy a seat, you claim the chest underneath it.&#10;&#10;After everyone has finished their actions, you score for the round &mdash; but you score only in the region indicated in the current row of scoring tiles (Aachen, Nijmegen, Palermo, etc.) and the region that best meets the condition laid out in a separate part of the current row of scoring tiles (fewest chests, most occupants, where the king is located, etc.) If these two regions turn out to be the same one, you score that region only once. Players score points for having the most office seats in a region (or the second- or thirdmost most office seats) based on the point tile placed in the region at the start of the game. Each region also has a printed bonus that players receive, such as bonus chests or additional envoys.&#10;&#10;To end the round, you remove all of the office occupants of the region that scored, add new chests under each office seat in those scoring regions and each space on the supply table, then sweep the king clockwise 1-3 regions. As the king moves, he returns all of the envoys that he encounters in the regions that he enters to their owners. After five rounds, players score for their treasure chests as well as for how well they completed their secret job cards, and the player with the most points wins.&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Demonslayer: Siege of Mt. Kunlun",
        "description": "Demonslayer: The Siege of Mt. Kunlun is what is called a 'deck-building game,' for up to four players. The game is based on the story &ldquo;Warriors of Magic Mountain.&rdquo; Each player takes control of one Sect of the Kunlun Immortals, and they must compete with each other in defeating the dread forces of the Heart-Eaters. By defeating the Heart-Eaters, each player accumulates Cultivation. At the end of the game, once all the Heart-Eaters are defeated, the player with the most Cultivation is the winner.&#10;&#10;Every turn, players play a &ldquo;hand&rdquo; of cards, building up the player&rsquo;s &ldquo;ready deck&rdquo; and attacking the demon enemies. In each turn, players can &quot;obtain&quot; a card once, and attack once. Players can obtain spells as well as obtain &quot;meditation&quot; cards which are used to obtain more, stronger cards.  Players may also &quot;obtain&quot; Immortal warriors from their Immortal Roster area; Immortals are the foot-soldiers in the war against the Heart-Eaters.&#10;&#10;Each turn of the game is strategically important; one wrongly played hand can mean the difference between first and last place.&#10;&#10;There are four Sects of Immortals in Demonslayer, and each plays differently from each other. The Kunlun Sect excels at bringing high-powered Immortal warriors out quickly, each building on the other&rsquo;s strength. The Qicheng sect is good at calling on reserve Immortals to join the battle. The Kongtong Sect is proficient at Alchemy; creating powerful artifacts which help the Sect in it&rsquo;s battle&rsquo;s against the Heart Eaters. The noble Wuyi Sect Immortal Warriors sacrifice themselves for devastating combo attacks. Every sect also has 1 Sect Leader Immortal, who provides special powers which serve to define how the sect plays.&#10;&#10;The enemy of the game are the &ldquo;Heart-Eaters;&rdquo; demonic warriors who have attained immortality by reveling in lustful destruction and excess. Many of the heart eaters have spiritual parasites &ndash; called &ldquo;Miasma&rdquo; which infect the players after slaying. However, players also sometimes attack &ldquo;Treasure Beasts&rdquo; which can grant players special abilities once they are won.&#10;&#10;In one &quot;wave&quot; of Demonslayer, there are 8 Heart Eaters and one &quot;Overlord;&quot; a leader of that wave of Heart-Eaters. Demonslayer: Siege of Mt. Kunlun is not, strictly speaking, a game of inter-player competition. Players compete with each other to have the honor of being the most successful at protecting the heavens and Earth from the demon hoards. Yet, players are are essentially cooperating to defeat the enemy.&#10;&#10;This English-language version of the game already incorporates one expansion, called The Alchemist's Fortune. In time, we will release new expansions for you to enjoy, incorporating more players, more cards, more options, more strategy, and most of all &ndash; more fun.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Hellweg westfalicus",
        "description": "Up through the Middle Ages, the Westphalian Hellweg, a road between Duisburg and Paderborn that's more than five thousand years old, was of great importance for trading.&#10;&#10;In Hellweg westfalicus, players try their hand at trading, trying to buy salt, beer, and ironware at low prices, then sell them for maximum profit. If you wait too long, you might get a good purchase price, but only for what little is still left to sell. You can create trade routes with the help of coaches and thus supply distant towns. The player who owns the most money after twelve rounds wins.&#10;&#10;Hellweg westfalicus includes the expansion module &quot;Warehouse and Privileges&quot; for expert players.&#10;&#10;",
        "artist": "Michael Schacht"
    },
    {
        "name": "DragonFlame",
        "description": "You are a Dragon. Like all respectable dragons you must find yourself a Princess and horde some treasure. There are some nearby towns just ripe for the plunder. You must strafe these villages with your dragonflame until they submit and hand over their treasures. But of course, you're not the only Dragon out there!&#10;&#10;In DragonFlame you will take turns placing 3 cards on to the Castle cards in the center of the table. This will create piles of cards that you will get to choose from at the end of the round. The pile you choose will also determine your turn order for the next round.&#10;&#10;Once you've taken a pile you place the cards in front of you for end game scoring. Any DragonFire cards you have acquired give you the ability to flame the villages for a area-control over these cards (more victory points).&#10;&#10;Since sometimes you may place a card face down, this becomes a game of reading the other players and choosing the right (sometimes poisoned) piles. Do you take that pile with a lot of cards and risk the minus points or just go for the safe face up treasures?&#10;&#10;There are several types of treasures to collect. You will only score 1 of the types of chests and the others count against you. Some treasures are just straight forward points. Some are even powerful magic items with special abilities.&#10;&#10;",
        "artist": "Clay Gardner,Rob Lundy"
    },
    {
        "name": "Bottom of the 9th",
        "description": "It's the bottom of the ninth inning. The game is tied. It's down to the home team to score one run to win it all. Unfortunately, the home team is staring down the league's best closer.&#10;&#10;A dice and card game for two players, Bottom of the 9th brings all the excitement of the final three outs of a baseball game into a compact 5-20 minute game session. With variable player strengths, bluffing/deduction, and die-rolling, only the pitcher knows what's coming and the batter needs to keep his eyes peeled. Bottom of the 9th is played over the course of three outs, or four hits (for one run scored) &mdash; whichever occurs first.&#10;&#10;Bottom of the 9th includes tons of variable player powers, myriad customizable line-ups, the possibility of two added expansion packs, and rules for advanced league and solo play to keep gamers wanting to play ball time and time again.&#10;&#10;",
        "artist": "Adam P. McIver"
    },
    {
        "name": "Peptide: A Protein Building Game",
        "description": "Peptide is an open-drafting card game with resource management elements. Basically, players compete to link amino acids side-by-side, forming what&rsquo;s called a Peptide Chain (in biology, this process is called RNA Translation). In order to do so, players must first select from a number of available open-drafted face up cards, which in the game represent cellular organelles. Each organelle rewards players with either molecular resources or cellular actions. Final scores are based upon the types of amino acids in your Peptide Chain, and the player with the most points at the end of the game wins!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Time of Soccer",
        "description": "In Time of Soccer you'll take control of a football team along one season. In the game you'll have to sign football players and club employees, like coaches, scouts, community managers.... &#10;For you can do this, you have to manage the economy of the club, for example, you can sign advertising and tv contracts.&#10;&#10;Every week you'll compete in the city for the best football players, and the end of this, you'll play in an exciting match where the level of your team will be considerate.&#10;&#10;Enjoy alone or with your friends in Time of soccer.&#10;&#10;Spanish description:&#10;&#10;En Time of Soccer tomas el control de un club de f&uacute;tbol a lo largo de una temporada. Durante el juego tendr&aacute;s que realizar fichajes de futbolistas, contratar entrenadores, ojeadores, secretarios t&eacute;cnicos... y todo ello, mediante la gesti&oacute;n de la econom&iacute;a de tu club, firmando los mejores contratos televisivos y publicitarios.&#10;&#10;Cada semana en el juego competir&aacute;s en la ciudad por los mejores fichajes, finalizando esta con un emocionante y r&aacute;pido partido donde se tendr&aacute; en cuenta el nivel de tu equipo.&#10;Disfruta emocionantes partidas en solitario o contra tus amigos, en Time of Soccer.&#10;&#10;",
        "artist": "Borja Arturo Segura Cerdeira,Marcos Arnáiz Ramos"
    },
    {
        "name": "Artificium",
        "description": "As a medieval ruler your aim is to develop crafts, build efficient production chains, and make your city thrive. Produce, transform, gather resources, and don't forget to hinder your opponents!&#10;&#10;Artificium is a card-driven development game. Some cards produce resources or transform one type of resources into another and award victory points, while others let you perform actions. Carefully planning the chain of cards that you will play during the game turn is the key to success.&#10;&#10;Artificium lasts four turns. At the start of each turn, players have five cards in hand, with six cards being face-up on the table as a card market. During the turn, players first have a chance to exchange some cards from their hands with those in the market, then they play and resolve their cards step by step, performing actions, trading and gathering resources, and most importantly, refining certain resources into other resources to earn victory points. Crystals on the players' individual resource boards keep track of their resources as they are bought and sold. Crystals placed beside the board represent player's coins. The final score is determined after the fourth turn, with players selling any remaining resources to score additional victory points (one point per four coins). The player with the most victory points is considered to be the wisest medieval ruler and is declared the winner.&#10;&#10;",
        "artist": "Timofey Shargorodskiy"
    },
    {
        "name": "Spyfall",
        "description": "Spyfall is a party game unlike any other, one in which you get to be a spy and try to understand what's going on around you. It's really simple!&#10;&#10;Spyfall is played over several rounds, and at the start of each round all players receive cards showing the same location &mdash; a casino, a traveling circus, a pirate ship, or even a space station &mdash; except that one player receives a card that says &quot;Spy&quot; instead of the location. Players then start asking each other questions &mdash; &quot;Why are you dressed so strangely?&quot; or &quot;When was the last time we got a payday?&quot; or anything else you can come up with &mdash; trying to guess who among them is the spy. The spy doesn't know where he is, so he has to listen carefully. When it's his time to answer, he'd better create a good story!&#10;&#10;At any time during a round, one player may accuse another of being a spy. If all other players agree with the accusation, the round ends and the accused player has to reveal his identity. If the spy is uncovered, all other players score points.  However, the spy can himself end a round by announcing that he understands what the secret location is; if his guess is correct, only the spy scores points.&#10;&#10;After a few rounds of guessing, suspicion and bluffing, the game ends and whoever has scored the most points is victorious!&#10;&#10;",
        "artist": "Sergey Dulin,Uildrim"
    },
    {
        "name": "Darkrock Ventures",
        "description": "DESCRIPTION: Darkrock Ventures is a worker placement game about mining and exporting in a hostile outer space. Players will be controlling a mining company working in harsh conditions to acquire the most credits.&#10;&#10;GENERAL INFO: A euro game for 1-5 players that plays in about 30-45 minutes.&#10;&#10;THEME: Science Fiction. Space is a hostile environment with a known alien presence. Resources are scarce and it is commonplace for companies to mine asteroids to acquire them. It is known that aliens raid these asteroids and therefore mining companies are geared accordingly in preparation of being attacked. Lives are lost in this line of work daily, but if you run a good crew you can make it out alive and rich!&#10;&#10;HOOK: Richly thematic euro incorporating dice and dice manipulation, with worker placement, resource farming and exporting.&#10;&#10;WINNING CONDITION: Highest Credits when the end of the game is triggered. Credits are acquired primarily from exporting minerals mined from the asteroid.&#10;&#10;MECHANICS: A round begins with rolling a set of Power Dice, these are community dice that players will use in order to successfully mine the asteroid. Players then take turns placing workers throughout different space stations and on a mineral rich asteroid.&#10;&#10;After all the workers have been placed a third and more volatile Power Die is rolled. A player starts his/her turn by rolling his/her Rig Dice, these represent the a power element of his/her mining equipment that is to be paired with the community Power Dice in order to successfully mine resources from the asteroid. Then he/she resolves all his/her workers. As soon as players begin exporting minerals, hostile alien ships begin patrolling and will attack every round making it more difficult to resolve all the workers successfully.&#10;&#10;Throughout the game, players will be increasing their worker count, gaining and spending credits (which are the victory points), gaining additional Rig Dice and acquiring explosive Neutronium bombs to protect them from the alien attacks.&#10;&#10;When 3 of the 6 resource nodes on the asteroid are void of minerals the end of the game is triggered. The round is finished and the player with the most credits wins the game.&#10;&#10;Darkrock Ventures will also include special 2-player game rules, as well as a Solo/Co-Operative variant.&#10;&#10;",
        "artist": "Darrell Louder,Naomi Robinson"
    },
    {
        "name": "In Flanders Field",
        "description": "In Flanders Field takes the player to the very heart of what it would have been like to be a CO in the trenches of Flanders. At every move you must make decisions that will determine the fate of the men you command. Your troops must face bombardment from the enemy's artillery, tanks and aeroplanes. How many men will you risk on a particular course of action?&#10;&#10;A game for 2-4 players where you take a role as a British Company Commander attempting to be the first to reach the &quot;Objective Line&quot;. You start from your own trench and must advance across &quot;No Man's Land&quot; while trying to limit your casualties. It's a &quot;push your luck&quot; game where you roll dice and play cards matching the roll, after which you can decide to try to advance further, or stop and carry out card actions. Pushing too far could incur heavy losses.&#10;&#10;",
        "artist": "Peter Dennis"
    },
    {
        "name": "Cubo",
        "description": "Cubo is a fast-paced dice rolling game played in six rounds with all players rolling their dice simultaneously. The colors and pallet of Cubo are inspired by the Holi Festival of Colors, Happiness and Peace, a festival that celebrates a wonderful message and ties in nicely with the social and friendly event of boardgaming.&#10;&#10;Cubo has a real-time mechanism that is brought forth not with a timer, but rather by a limited resource: the four dice in the center of the table. Gain as many points as possible with your nine dice by composing straights and trips.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Tramways",
        "description": "The 1920s: Small City was founded just a few years ago and is still a fledgling town at this stage. Nonetheless, the Town Center is prosperous, and the managers of the weird CliniC have been duly incarcerated for years by this point. Now it is time to reach a new step: Building a new map transit.&#10;&#10;In Tramways, you take the role of one of the managers of the local CliniC who were fired last month when it was discovered that you had acquired wealth on the backs of patients and their poor health. You are now at the head of a team of engineers, ready to build the best and most effective network possible for Small City. Your aim is to find the best places between buildings and citizens so that they can use your networks (and not those of your opponents, who are always ready to buy the most interesting development areas). Be assured that a happy citizen who is able to move where and when he wants will thank the best transport companies. There is nothing that satisfies a chief manager more than seeing citizens happy...&#10;&#10;The game is divided into six rounds, each of which is divided into two halves:&#10;&#10;&#10;     During the first half of a round, players compete to acquire the best development cards to create their most efficient deck. An original auction phase also determines turn order &mdash; and being the first player increases your stress level.&#10;&#10;&#10;&#10;     During the second half, they play a train game, using their deck to try to build a great network between the different buildings of Small City. They try to move passengers without stressing them during the transit, in the end obtaining happiness points, which is the aim of the game.&#10;&#10;&#10;The more that players use the symbols on their cards, the more actions they can do, but they also increase their stress level at the same time, which leads to negative victory points...&#10;&#10;",
        "artist": "Paul Laane,Sampo Sikiö"
    },
    {
        "name": "Bounce-Off",
        "description": "Bounce-Off is a ball-bouncing game for two to four players where the object is to use the balls to make a pattern shown on a card. If you're playing with two two-player teams, each team gets four balls. If you're only playing with two players, each player gets eight balls. Flip over one of the pattern cards to see which pattern you need to create. The green cards are easier than the blue cards. Then, you can either take turns bouncing your balls into the grid or bounce the balls all at once. If your balls create the pattern first, you win that card. The first team or player with three cards wins the game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Prime Time",
        "description": "As a big shot executive you need to keep your network stacked with the best shows in Prime Time. A basic goal for any TV show is to &quot;win&quot; its time slot for the network by having the highest ratings, and thus the highest ad revenue. As you add talented actors, producers and writers to the show, you&rsquo;ll have to decide how to arrange your TV Guide to win over the most viewers. Will you be putting your best shows early in the week? What will you leave for the Friday night death slot? Make your choices wisely so you can become the #1 network.&#10;&#10;Prime Time is played over six rounds, divided into two seasons of three rounds each. During each round, players will bid for and take their actions - buy shows, hire and fire talent, or play golf, among other things.&#10;&#10;Each round follows 4 phases:&#10;&#10;&#10;    Development phase &ndash; Players take 3 actions each. &#10;    Broadcasting phase &ndash; Players set up their TV schedule and try to attract demographics. &#10;    Award show phase (only in rounds 3 and 6) &ndash; Players score points based on their performance.&#10;    Income phase &ndash; Get paid, clear the board and set up for the new round.&#10;&#10;&#10;At the end of the 6th round, each player counts their remaining cash and gains 1 VP for each full $3.&#10;The player with the most VP wins the game!&#10;&#10;",
        "artist": "Naomi Robinson"
    },
    {
        "name": "Bakerspeed",
        "description": "Investigate quickly! LeStrade is already on his way to the crime scene, so you'll need to do a fast investigation in order to find the culprits &mdash; but are the clues sufficient for you to find the suspects first?&#10;&#10;Bakerspeed is a quick-playing dice-based game in which players need to &quot;solve&quot; crimes quickly. In the game, a player rolls a die, then everyone else simultaneously races to play the matching card.&#10;&#10;",
        "artist": "Klemens Franz"
    },
    {
        "name": "Paititi",
        "description": "In the world of the ancient Incas, players in Paititi are archaeologists who unearth artifacts and assemble them for exhibitions.&#10;&#10;Players use excavation cards to obtain artifact cards of various types and values. When a player initiates an exhibition, all players can discard matching artifact cards to gain victory points. There are three different types of exhibitions, each of which is scored differently.&#10;&#10;",
        "artist": "Klemens Franz"
    },
    {
        "name": "San Juan (second edition)",
        "description": "San Juan is a card game based on Puerto Rico. The deck of 110 cards consists of production buildings (indigo, sugar, tobacco, coffee, and silver) and &quot;violet&quot; buildings that grant special powers or extra victory points. Cards from the hand can be either built or used as money to build something else; cards from the deck are used to represent goods produced by the production buildings, in which case they are left face-down. A seven-card hand limit is enforced once per round.&#10;&#10;In each round (or governorship), each player in turn selects from one of the available roles, triggering an event that usually affects all players, such as producing goods or constructing buildings. The person who picks the role gets a privilege, such as producing more goods or building more cheaply.&#10;&#10;Though similar in concept to Puerto Rico, the game has many different mechanisms. In particular, the game includes no colonists and no shipping of goods; goods production and trading are normally limited to one card per phase; and trades cannot be blocked. Victory points are gained exclusively by building, and the game ends as soon as one player has put up twelve buildings.&#10;&#10;This second edition of San Juan includes all the cards of the original game as well as the additional building cards from the alea Treasure Chest but not the event cards from that expansion. This edition also contains a new building card not previously available : &quot;The Hut&quot;, a building that grants a card when nothing is sold in the trader phase.&#10;&#10;",
        "artist": "Harald Lieske,Mia Steingräber"
    },
    {
        "name": "Dragon's Ransom",
        "description": "Hark! Another hero approaches. Prepare the minions. Get them in line. The dragon's ransom must never be claimed!&#10;&#10;In Dragon's Ransom, you take on the role of Master of the Dungeon, sending waves of minions towards ill-prepared heroes. Link minions to create devastating combos, but beware- the heroes may be fools but they will fight back.&#10;&#10;Dragon's Ransom is a reverse dungeon crawl solitaire &amp; co-operative card game for 1 - 4 players. On your turn you will draw cards from the minion deck and play minions and traps against the heroes that oppose you. Once they're built up, play Attack! cards to send your chains rushing forward to attack the heroes. Spend too much time building the chains and the heroes will strike back, breaking apart your ranks. Defeat all the heroes to win or exhaust your minion supply to suffer defeat.&#10;&#10;Dragon's Ransom is a primarily solitaire game with official rules and components for multiplayer up to 4.&#10;&#10;",
        "artist": "Tim McBurnie"
    },
    {
        "name": "Richard I",
        "description": "England, a land so harsh that forged heroes and conquerors, where the people are so indomitable that not even the Roman Empire managed to subjugate them. England has built an extensive empire on which the sun never set, vastly extending its domain beyond the British Isles on the spur of the Plantagenets, a royal lineage that dominated much of medieval European history, a dynasty forged from steel and blood, a lineage that would prevail for more than half a millennium. Plantagenet is a name that inspires admiration among enemies and fear among allies.&#10;&#10;Henry II, the first Plantagenet king to extend and stabilize his domains, contracted a political marriage with Eleanor of Aquitaine, a marriage intended to generate heirs to the throne. This strategic alliance by marriage produced four heirs: children who would rebel against their own father, more than once, leading to war, bloodshed and pacification, the stuff history is made of.&#10;Who is going to inherit the throne? Who will prove to be worthy of the illustrious name of Plantagenet? After years of battles and rivalry, only two of the heirs survived.&#10;&#10;The first, opposed by his own father, is a man with a destiny marked out by his own land, which he rarely set foot on as he was preoccupied for his entire life in conquests beyond the British Isles. The hope of an entire era would depend on his choices. The difference between being the usurper or the chosen one would depend on his actions. He is Richard I of England, better known as Richard the Lionheart.&#10;The other, the last born, was far removed from the throne. Overshadowed by his own family, derided by his own people and saddled with the unfortunate title of &ldquo;Lackland&rdquo;, John Lackland had the opportunity of a lifetime: Richard left for the Crusades and John could claim the throne for himself in Richard&rsquo;s absence. But would he have the mettle of a king? Would he surpass his more illustrious brother Richard? Would he be able to counter his brother&rsquo;s supporters?&#10;&#10;A wise choice as to with whom to form an alliance is crucial to one&rsquo;s place in history. Only brave choices will crown the true king of England, and only those who loyally and valiantly supported him in the conquest and administration of the kingdom would be remembered in history. This is a choice that only the strong and the wise would make.This is history.&#10;&#10;In Richard I, the players assume the role of the characters who remained in England when King Richard I left for the Crusades. They have to decide which side to take without knowing whether Richard I will return home a victor with glory and riches, or he won't come back at all (but there are many possible intermediate outcomes).&#10;&#10;During the game, the players take turns to influence the different characters available in order to earn prestige points (PPs) for themselves, but also to use their powers to influence the Crusade from far away by sending resources. A player might even decide to betray his own side, if worrying news were to come from the East...&#10;&#10;At the end of the game, the outcome of the Crusade leads to an increase of PPs for the players who were deployed by the faction which has achieved its goal, but the game has only one winner: the player who has accumulated the most PPs, regardless of the faction to which he belongs!&#10;&#10;The object of the game is to amass the most Prestige Points (PP) by wisely choosing alliances and exerting influence on the performance of the Crusade.&#10;&#10;",
        "artist": "Diana Cammarano,Daniele Solfrini"
    },
    {
        "name": "Skull Tales",
        "description": "25th August 1703&#10;&#10;It still smells like burning gunpowder. The deck is completely full of remains of combat after the boarding. We could be enjoying our looting in Isla Tortuga but our Captain insisted on coming to this goddamned island instead.&#10;&#10;In the meantime, our gunner &lsquo;Mad&rsquo; Harry does not stop telling us stories and legends about some fantastic creatures that dwell in this place. The Doctor seems uneasy, grabbing the hilt of his sword, sweating a lot more than usual after listening to Harry&rsquo;s tales.&#10;&#10;-Old Sanders lost his leg after having cut it himself. He escaped alive from the jaws of that shark-headed abomination in human form &hellip;- Harry was explaining at the same time he was miming with all his body doing so, acting out the scene with his eyes moving all directions as if they were about to jump off his face, in a way of magnifying the facts.&#10;&#10;-I would not like to lose my leg&hellip;or my arm, or any other limb from my body. I appreciate every single limb and organ of mine- was murmuring the Doctor who was more and more nervous. &ndash;Do you think there will be more monstrosities like those?&#10;&#10;The conversation was interrupted by the sound of two swords pulling out from their sheath together with the cracking in the wood due to a firm step. It was the ruthless Mary Jane who, with a satisfied smile in her face, expressed her wish. &ndash;That&rsquo;s what I'm looking for&hellip;&#10;&#10;Williams the Lookout's logbook.&#10;&#10;Yo ho ho! Skull Tales is an adventure game in which each player performs the role of a pirate character in order to fulfill any pirates' dream: to become the ship's Master and to reach the most precious booty.&#10;&#10;Pirates will have to fight against any kinds of fantastic enemies, by solving mysteries, by sailing the Caribbean Sea and exploring islands... all aimed to conquer the highest score in prestige points (PP) and, of course, to reach the long awaited dream of becoming the Master. How is that? Each character will use different abilities to solve mysteries in each scenario or island (by means of modular boards) to fulfill secondary missions; they will roll dice and play cards in order to move, fight enemies or sail depending of how many PP they still have left. All in a cooperative way to escape alive from all this because dead men tell no tales...&#10;&#10;",
        "artist": "David Illescas"
    },
    {
        "name": "Antike II",
        "description": "Antike II is a challenging strategy game about evolution and competition among ancient civilizations. Ancient nations create cities, build temples, sail the seas, and discover new principles of science and technology. Their legions and galleys open new settlements and defend their people against attacks from their enemies. Two scenarios can be chosen as the game board is two-sided.&#10;&#10;Every nation tries to win ancient kings, scholars, generals, citizens, and navigators for themselves. The nation that acquires a specified number (depending on the number of players) of ancient personalities first wins the game!&#10;&#10;Lead one of these nations to victory&mdash;but watch out for your enemies as they will want to conquer your cities to destroy your temples. The game depends not on the luck of dice or cards, but on thoughtful plans and skillful diplomacy.&#10;&#10;Antike II differs from the 2005 Antike in several ways, according to designer Mac Gerdts. To start, players now own city tokens, which allows them some degree of choice as to which resource a newly founded city shall produce. Military units have become more expensive, and the rules for the conquest of cities are considerably easier. The scientific progresses were altered as well. Neutral temples now exist, which may be destroyed, gaining VPs of a general, without harming other players. The game features two new maps in a new graphical design, and a new card named &quot;BELLONA&quot; (the ancient Roman goddess of war) has been introduced to counter the starting player's advantage.&#10;&#10;Gerdts notes that the main goal of all of these changes was to make the rules for a conquest of cities easier, while also opening more possibilities to win the game without the need to attack other players.&#10;&#10;",
        "artist": "Julia Domeyer,Marina Fahrenbach,Mac Gerdts,Alexander Jung"
    },
    {
        "name": "Villainous Vikings (Second Edition)",
        "description": "For 3 to 5 players, Villainous Vikings (Second Edition; Voyage to Valhalla) is a rousing game of Viking exploration and conquest. With players confronted by constant Raid or Trade dilemmas, the decisions will take you to the highest seat in Asgard next to Odin.&#10;&#10;Your goal in Villainous Vikings is to amass as many Valhalla Points as possible so that after Ragnar&ouml;k occurs your Captain has the best seat in Valhalla to tell his tales of battle and drink his mead. You will gain Valhalla Points by raiding, trading, and battling the other Captains who are also vying for Odin&rsquo;s favor.&#10;&#10;After one of the players has been declared the victor of Ragnar&ouml;k, each player will tally up their Valhalla Points to determine their overall standing with Odin the All-Father and the other Gods; whoever is in the best standing is considered the greatest Viking(s) in history!&#10;&#10;In this Second Edition, almost everything in the box has been revised for better balance and clarity: the map, the cards, the rules, and even the counters.&#10;&#10;",
        "artist": "Brett Mitchell"
    },
    {
        "name": "Web of Spies",
        "description": "Web of Spies is a game of espionage, exotic locations and powerful assets. Players send their agents to travel the world, acquire powerful assets &amp; eliminate enemy agents in an epic struggle of spycraft, action, and intrigue! It plays for 2 to 4 players in a little over an hour, and ends when any player is eliminated, revealing the strongest agency as the winner!&#10;&#10;Each turn, you have 5 cards (drawn from your own personal deck) that you can use in multiple ways:&#10;&#10;MOVE: Spend any card to move a spy on the board.&#10;&#10;ACQUIRE: Spend any card(s) towards acquiring an asset in a city you control. In this way each player develops a unique set of resources which will define their play style throughout the game.&#10;&#10;SABOTAGE: Many of the cards have clever effects you can use to manipulate your opponents and gain the upper hand.&#10;&#10;ATTACK: Engage your opponent's spies using vehicles, weapons and more from the arsenal you build throughout the game!&#10;&#10;This is where the tactical fun of Web of Spies happens. With just 5 cards, you have a lot of choices to make. Where will you move? What assets will you acquire? Will you attack now, or wait until the moment is just right? Balancing your efforts between acquiring powerful assets and using them at the right time is the strategy of Web of Spies!&#10;&#10;",
        "artist": "Christine MacTernan,Kyle Van Meurs"
    },
    {
        "name": "Wizards of the Wild",
        "description": "In Wizards of the Wild, each player is an animal wizard battling in the ultimate magic showdown at Stonehenge. Each species has a special power: Fox, Hare, Owl, Raccoon, and 4 more! The Acolytes of the Lost Masters &mdash; Cats and Dogs &mdash; run the games by setting up many challenges and spells. If you win, you will be crowned the new King of the Forest!&#10;&#10;Wizards of the Wild is a fast paced engine-building card and dice game for 2-4 players that plays in about 30 minutes. Players roll custom dice to acquire spells, defeat challenges, and bribe acolytes. As the game progresses, your spells and special abilities combine in a unique way to increase your power. Dark magic gives you the ability to enfeeble other wizards, but you have to avoid too much of it lest it turn on you!&#10;&#10;",
        "artist": "Shawna J.C. Tenney"
    },
    {
        "name": "Of Dungeons Deep! (Second Edition)",
        "description": "Of Dungeons Deep (Second Edition) is a vastly expanded version of the original game. It now play 1-4 players and consists of numerous Heroes and Henchmen to choose from to delve in the dungeon below. Here are some game highlights.&#10;&#10;1)Bluffing and Blind Bidding. Players are attempting to destroy the nasty creatures below in the dungeon to gain fame by playing cards face down and revealing simultaneously. Each enemy has a set number of hit points based on the number of players. There are three enemies to deal with in each level of the dungeon, so strategy, tactics, and bluffing are a must. There is also two rounds of bidding so players gain insight into what other players are up to.&#10;&#10;2)Deck Building. When a player defeats an enemy, that card is rotated 180 degrees and then added to the player's discard pile. The bottom of each monster card indicates what item the enemy is carrying. These items add power to your character in future rounds, and act as an organic and thematic way to show that your characters are advancing.&#10;&#10;3)Draft Your Unique Party. Before play begins, players complete a draft in order to create their starting hand of twelve cards. Each player gets one Hero and one Henchman. All characters are very unique and play quite differently from one another. This sets the bar high for replay value!&#10;&#10;4)No Down Time! Since all play is done simultaneously, no players are ever waiting on others for very long. This makes Of Dungeons Deep! one of the fastest dungeon delvers out there.&#10;&#10;",
        "artist": "Derek Bacon"
    },
    {
        "name": "Medina (second edition)",
        "description": "The year is 1822. After years of decay, it is time to rebuild the medina, located at the foot of the Atlas mountains. The architects and engineers of the city work to erect large and beautiful palaces and to renovate the damaged city wall. As the reconstruction of the old city progresses, the city's inhabitants flock through the alleys, and the contours of the new city gradually reappear!&#10;&#10;Each turn, players must place two pieces on the board (except when allowed to skip this with a tea tile), either augmenting an existing building (or starting a new building if the current building of that color is finished), or expanding one of the other features of the city, like the market or the walls. Each player will claim one building of each of the four colors by the end of the game, giving one point per wooden piece attached to the building.&#10;&#10;Also, if you own the largest building of a particular color you get a bonus for that color. Finally, there are bonuses for palaces around the well, as well as for the player who most recently connected one of their buildings to the walls, which grow from the four corners of the city.&#10;&#10;Medina is a tense game by the great designer Stefan Dorra. This latest edition of the game features a double-sided game board (enabling a two-player game), almost 200 detailed wooden pieces, and updated gameplay, as well as rules and components never before published for this game!&#10;&#10;See Medina for the original edition of this game.&#10;&#10;",
        "artist": "Eduardo Bera,Hans-Georg Schneider"
    },
    {
        "name": "Circular Reasoning",
        "description": "Circular Reasoning is an abstract strategy game developed by two students at the University of Texas at Dallas, Tomer Braff and Edward Stevenson, under the name &quot;Giant Shoulder Productions&quot;. After being featured at IndieCade 2014, Circular Reasoning was then picked up by Ad Magic and is now being published under Breaking Games.&#10;&#10;The board consists of a goal in the center and three concentric tracks of 16 spaces each. Each track has a gate to the next level, but the gates rotate around the board according to the number of tokens found in each level.&#10;&#10;Each player gets a square, a triangle, and a circle, which move four, three, or two spaces respectively. In addition to racing toward the center, tokens can be used to block other tokens from using the gates to advance. Because of this, players must predict and work around their opponents moves to secure victory.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Bellz!",
        "description": "Bellz! is deceptively simple, yet supremely challenging at the same time. Open the travel pouch, and you're ready to play!&#10;&#10;The pouch opens to become the game arena. Inside are forty custom bells in four colors and three different sizes. Players use the magnet wand to pick up bells of only one color. Make a string off the end of the magnet wand, or create a cluster &mdash; just don't pick up bells of any other color or your turn ends. Each player must decide how far to push their luck on every turn. The first player to collect all ten bells of one color wins!&#10;&#10;",
        "artist": "Connor Reid"
    },
    {
        "name": "Sheep & Thief",
        "description": "Breed some sheep, and watch them prosper, but watch out for those shifty sheep thieves.&#10;&#10;This is a drafting type game.  &#10;Players can play sheep cards to add sheep to the board, or play the sheepdog card to herd the sheep into their pens.  Once they are in the pens they are safe.  If a thief card is played the thieves will move, if the encounter a sheep they will steal the sheep.&#10;&#10;",
        "artist": "Wee Yee Chong,Tansan & Co."
    },
    {
        "name": "Ashes: Rise of the Phoenixborn",
        "description": "Description from the publisher:&#10;&#10;In Ashes: Rise of the Phoenixborn, a two-player expandable card game, players take on the roles of Phoenixborns, demi-gods and protectors of this world. These characters are the great saviors of their civilizations. Before they came into existence, the humans were plagued by monsters like chimeras that took away their lands and forced them to live in walled-off cities. When the Phoenixborns came, they fought off the chimeras and freed the lands for humans to take over once again.&#10;&#10;But the time of peace was short-lived. A prophecy arose that if one Phoenixborn was able to absorb enough Ashes of others, they would ascend into full gods and take mastery over this world. This, as well as humans' greed for land, fueled the War of Ashes. The great cities now fight among each other, each one of them with a Phoenixborn at its helm, and you will decide who will rise and who will fall to ashes.&#10;&#10;",
        "artist": "David Richards,Fernanda Suárez"
    },
    {
        "name": "Warsaw Rising Up 1945-1980",
        "description": "Warsaw Rising Up 1945-1980 is a board game for 3-5 players, where participants take the roles of Polish urban planners, architects, engineers and builders &ndash; members of design and building studios functioning within the Bureau for the Rebuilding of the Capital. They face the challenges of restoring Warsaw destroyed during World War 2, bringing back the city&rsquo;s prestige and importance in the fields of administration, culture and industry.&#10;&#10;The goal of the game is to rebuild Warsaw after the war and develop the city. The players have to get concrete, use the materials acquired from the debris of the destroyed Capital and various social funds that were used in reality during the rebuilding of Warsaw. However, not only the reconstruction itself is important, but also the appropriate location of the objects on the city map and competent delegation of the members of one&rsquo;s studio to work. One of the several tactical elements of the game is managing the project cards and workers. Using their extra abilities may be the key which will benefit one player and make the work much harder for another. But even for a moment they should not forget about acquiring building materials from prefabricated elements and building new panel blocks.&#10;&#10;The game covers the period of thirty-five years, so in subsequent stages many various tasks appear. They are related to political doctrines, tendencies in architecture as well as the general economical and developmental situation in Poland in the given period. But the most important feature of the game is that each time the players are able to rebuild Warsaw in a different way from this known from history. They decide whether the historical rebuilding plan will be realized and where &ndash; if at all &ndash; the Palace of Culture and Science will stand. The players also have an access to the plans that were never realized, both from the Six-Year Plan and later urban development concepts. The game includes a futuristic element, too &ndash; the players have plans of two subway lines at their disposal. Such plans actually existed in post-war Warsaw, but they were never realized due to economic problems. In this game it is possible.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Barony",
        "description": "In Barony, players are ambitious barons trying to extend their dominion over the land! Who will succeed and become the new king?&#10;&#10;At the beginning of the game, players create the board at random with nine tiles per player; each tile is comprised of three hexagons, with each hexagon being one of five landscape types: forest, plains, field, mountain, lake. Players then each place three cities on the game board, with a knight in each city. They then take turns in clockwise order, with each player taking exactly one action from the six possible actions:&#10;&#10;&#10;    Recruitment: Add two knights to a city, or three knights if the city is adjacent to a lake.&#10;    Movement: Move one or two of your knights one space each. A knight can't enter a lake (blub), a mountain with an opposing pawn, or any space with an opponent's city or stronghold or two knights of the same opposing color. If you move a second knight into a space with an opposing pawn or village, remove those tokens and take one resource from the village owner.&#10;    Construction: Remove one or more of your knights from the game board and replace each with a village or stronghold, gaining one resource token matching the landscape under the structure.&#10;    New City: Replace one of your villages with a city and earn 10 victory points (VPs).&#10;    Expedition: Remove two knights from your reserve, placing one back in the box out of play and the other on any empty space on the edge of the game board.&#10;    Noble Title: Discard at least 15 resource points, then upgrade your title: baron to viscount, then count, marquis and finally duke.&#10;&#10;&#10;Once any player has gained the title of duke, finish the round, then tally the VPs, with players scoring for resources still in their possession, their rank in the game, and the number of cities they built. Whoever has the most VPs wins.&#10;&#10;",
        "artist": "Ismaël Pommaz"
    },
    {
        "name": "Magic: The Gathering – Arena of the Planeswalkers",
        "description": "In the Magic: The Gathering &ndash; Arena of the Planeswalkers, players customize the battlefield by designing the map then placing terrain and powerful glyphs. Then players choose one of five different Planeswalkers and move their figure and unique creature squads around the map in a race to out-maneuver opponents and gain tactical advantages! Cast devastating spells, summon powerful squads, and tap into your unique Planeswalker abilities to defeat your opponents. Be the last Planeswalker standing to win!&#10;&#10;The game takes place on the drifting, mana-rich world of Shandalar.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Moral Dilemma",
        "description": "Moral Dilemma is a rude, adult party game where the right answer is always determined by your peers. This party game of ethical debate will put you and your friends in a position to discuss some of the most outrageous predicaments with some of the most terrible resolutions that we could think of. Two unique sets of rules will create two very different ways to play the game! In one set, argue for what you believe, and in the other you argue for whatever the cards tell you.&#10;&#10;On your turn, you pull a card and read. You then secretly vote for one of two choices on the card. The rest of the group (society) then votes as a team. If you agree with society, then you get the point!&#10;&#10;Includes hundreds of unique moral dilemmas (with a few classics thrown in there) that can sprout hours of fun and debate!&#10;&#10;What&rsquo;s in the box:&#10;&#10;385 Cards&#10;Game Instructions&#10;&#10;",
        "artist": "Martyna Szczykutowicz"
    },
    {
        "name": "DC Comics Deck-Building Game: Teen Titans",
        "description": "Teen Titans go! You've played with the old guard. Now play as the youthful up-and-comers. Play as Raven, Beast Boy, Wonder Girl, Red Robin and more. The Teen Titans are all about proving themselves, and with this set you can save your best cards for when you really need them. When you&rsquo;re ready, unleash everything you&rsquo;ve got and the results will be spectacular.&#10;&#10;The big new focus of DC Comics Deck-Building Game: Teen Titans revolves around Ongoing abilities: Cards that stay in play until you need them. Every time you put an Ongoing card into play, it essentially gives you an extra card to utilize on a future turn. Previously, only Locations and a couple of other cards could ever stay in play. Now every card type at every power level has multiple different cards with Ongoing. Sometimes they help you every turn. But mostly they stay in play until you choose to discard them for their mighty effects. If you can build up several Ongoing cards, unleash as many as you need to take down the Super-Villains!&#10;&#10;This set also pays attention to the different card types you have in play. Playing cards from your hand puts cards into play as usual. But with Ongoing cards out there, you often have several card types in play already. Such synergy!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Terraforming Mars",
        "description": "In the 2400s, mankind begins to terraform the planet Mars. Giant corporations, sponsored by the World Government on Earth, initiate huge projects to raise the temperature, the oxygen level, and the ocean coverage until the environment is habitable. In Terraforming Mars, you play one of those corporations and work together in the terraforming process, but compete for getting victory points that are awarded not only for your contribution to the terraforming, but also for advancing human infrastructure throughout the solar system, and doing other commendable things.&#10;&#10;The players acquire unique project cards (from over two hundred different ones) by buying them to their hand. The projects (cards) can represent anything from introducing plant life or animals, hurling asteroids at the surface, building cities, to mining the moons of Jupiter and establishing greenhouse gas industries to heat up the atmosphere. The cards can give you immediate bonuses, as well as increasing your production of different resources. Many cards also have requirements and they become playable when the temperature, oxygen, or ocean coverage increases enough. Buying cards is costly, so there is a balance between buying cards (3 megacredits per card) and actually playing them (which can cost anything between 0 to 41 megacredits, depending on the project). Standard Projects are always available to complement your cards.&#10;&#10;Your basic income, as well as your basic score, is based on your Terraform Rating (starting at 20), which increases every time you raise one of the three global parameters. However, your income is complemented with your production, and you also get VPs from many other sources.&#10;&#10;Each player keeps track of their production and resources on their player boards, and the game uses six types of resources: MegaCredits, Steel, Titanium, Plants, Energy, and Heat. On the game board, you compete for the best places for your city tiles, ocean tiles, and greenery tiles. You also compete for different Milestones and Awards worth many VPs. Each round is called a generation (guess why) and consists of the following phases:&#10;&#10;1) Player order shifts clockwise.&#10;2) Research phase: All players buy cards from four privately drawn.&#10;3) Action phase: Players take turns doing 1-2 actions from these options: Playing a card, claiming a Milestone, funding an Award, using a Standard project, converting plant into greenery tiles (and raising oxygen), converting heat into a temperature raise, and using the action of a card in play. The turn continues around the table (sometimes several laps) until all players have passed.&#10;4) Production phase: Players get resources according to their terraform rating and production parameters.&#10;&#10;When the three global parameters (temperature, oxygen, ocean) have all reached their goal, the terraforming is complete, and the game ends after that generation. Count your Terraform Rating and other VPs to determine the winning corporation!&#10;&#10;",
        "artist": "Isaac Fryxelius"
    },
    {
        "name": "Roll Through the Ages: The Iron Age with Mediterranean Expansion",
        "description": "Roll Through the Ages: The Iron Age, a sequel to the highly-awarded Roll Through the Ages: The Bronze Age, lets you build an Iron Age civilization in under an hour! Do you build provinces, raise armies, and conquer barbarians or build ports and ships to gain trade goods? Explore the strategies of Greece, Phoenicia, and Rome as you erect monuments, fend off disasters, and strive to feed your people.&#10;&#10;Roll Through the Ages: The Iron Age gives players different ways to build their empires: the Trade and Naval strategies of the Phoenicians, the conquests of Alexander the Great, and the engineering prowess and gradual absorption of new provinces by the Roman Republic.&#10;&#10;Some copies of the game include the Roll Through the Ages: The Iron Age &#226;&#128;&#147; The Mediterranean Expansion in the base game box. The only indication of this was a sticker on the shrink that read &quot;MED expansion&quot;.&#10;&#10;The Mediterranean expansion adds overseas settlements to the mix via a central pegboard that all players share. Players race to reap the benefits of strategic colonies: Crete for fleets; Spain for mining; Carthage for wheat; Gaul for armies; while Syracuse, the home of Archimedes, and Alexandria provide vital innovations.&#10;&#10;The Mediterranean expansion is not available separately. Eagle Games has implied that this might change in the future.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Gang Up!",
        "description": "Gang Up! is casual card game where you compete to become the ultimate crime lord! Recruit legendary gang members and commit crazy daring crimes. Use criminal influences and team up with other players to get ahead. And when they least expect it, backstab them to win the game!&#10;&#10;What's so good about Gang Up!?&#10;&#10;Well...!&#10;&#10;&#10;    Constantly choose between helping or backstabbing friends!&#10;    Use weird card combos and advanced tactics&#10;    Always influence the game, even when it's not your turn!&#10;    Never get stuck at last place; we put you back in the race!&#10;    An overload of crazy criminals &amp; crimes!&#10;    Beautiful artwork, no shabby back alley illustrations here.&#10;    And it's easy to learn &amp; quick to play!&#10;&#10;&#10;Version 1: Kickstarter edition (english, 2015)&#10;verion  2; published by HOT Games (english, 2016) &amp; Czacha Games (polish, 2017)&#10;&#10;",
        "artist": "Robin Keijzer"
    },
    {
        "name": "Grifters",
        "description": "Grifters is a hand-building game that has all the fun of deck-building games, without the deck. Set in the Dystopian Universe, players take on the role of powerful crime bosses, building their criminal organizations by carefully recruiting new operatives with specialized skills and directing their team&rsquo;s nefarious deeds. All of your specialists are either in play or in your hand, ready to be used as you command. This unique hand-building mechanism gives you total control of your strategy.&#10;&#10;Grifters is all about stealing as much money as you can from the corrupt government, malicious corporations, and your rival players. Each player starts the game with a hand of six Specialist cards, each with unique abilities. Your objective is to use this team of six Specialists to recruit more criminals, complete jobs, steal from the government coffers and swindle your opponents.&#10;&#10;Each specialist has a special ability and skill. On your turn you can play a single specialist to perform their ability, or you can play a team of specialists to use their combined skills to complete a job. This means every specialist is a valuable asset to your criminal enterprise, earning immediate benefit through abilities and valuable end-game bonuses by completing jobs against the same target. And because all the cards in your deck are always available, you decide how to maximize your play.&#10;&#10;Grifters uses a unique card &quot;cooldown&quot; system to control the use of your cards. On your turn, you play one or more specialist cards into the first &quot;Night&quot; of your hideout. If you already have a specialist card, or a team of specialist cards, in night one those cards advance to night two and push other cards through your hideout.&#10;&#10;When a card is pushed out of the third night of your hideout it enters the refresh area. Any cards in your refresh area will return to your hand at the end of your turn.&#10;&#10;The game ends when the coffers run out of money, there are no more jobs left to complete, or if there are no more specialists cards left for recruiting. End game bonuses are calculated for completing multiple jobs against the same target.  The player with the most money wins.&#10;&#10;---&#10;&#10;The Grifters (1st Ed) was first released via Kickstarter with the following backer exclusives:&#10;&#10;Upgraded player tableaus - A thick chipboard tableau with linen finish will replace the cardstock tableaus found in the base game.&#10;&#10;4 x New &quot;Ringleader&quot; cards - Informants are a new ringleader (every player starts with one of each of the ringleaders) that add an element of bluff and deception to the game.&#10;&#10;With Informants in play, you can play any card face down and take the Informant action.  Any other player may challenge the Informant. When challenged, the active player reveals the card that was played. If that card is the Informant, the challenger must give the active player 2M ISK. If that card is not the Informant, no payments are due from any player to the active player, the challenger steals 2M ISK from the active player and gets to take the action on the card that was played.&#10;&#10;Informants are a really fun addition to the game and totally fitting with the Dystopian Universe.&#10;&#10;A set of these promo specialist cards.&#10;&#10;You are Awesome - Bonus #1: 3 x The Security Specialist promo&#10;You are Awesome - Bonus #2: 3 x Crooked Warden promo&#10;You are Awesome - Bonus #3: 3 x Veteran promo&#10;You are Awesome - Bonus #4: 3 x Underboss promo&#10;You are Awesome - Bonus #5: 3 x Negotiator promo&#10;&#10;",
        "artist": "Dave Fulton,Stephanie Gustafsson,Jarek Nocoń"
    },
    {
        "name": "Saboteur: The Duel",
        "description": "Saboteur: Duel is a standalone version of the famous card game Saboteur for one and two players. When playing alone, you want to collect as much gold as possible by digging new tunnels in the mine; when playing with an opponent, you'll just want to collect more than that player, but naturally your opponent will try to block your progression by all means.&#10;&#10;In this card game, you play path or action cards. The path cards form a maze in the direction of the six goal cards, which contain a variable number of gold stones. The action cards are used to hinder your opponent or to help you to repair broken equipment. A greedy troll also lurks in the mine, and you will have to pay him to progress and he doesn't give back any change!&#10;&#10;",
        "artist": "Andrea Boekhoff"
    },
    {
        "name": "Project Dreamscape",
        "description": "Study Parameters&#10;The mind really can shape reality! Scientists have invented a machine that can tap into a person&rsquo;s dreams and make them real. However, only the strongest minds--those who can control their dreaming--are able to utilize the machine. Thus Project Dreamscape was created to find the ultimate dreamer.&#10;&#10;Study Goal&#10;Participants will collect dream cards on their turns with the goal of chaining matching dream types together. The more dream cards a participant chains together, the more points that chain will score. The participant with the most points at the end of the game is the winner!&#10;&#10;There are 8 dream types in the 52-card sleep deck, each of which appears exactly 13 times. Each dream card depicts 2 different dream types. Whenever you collect a dream card, you must choose one of the dream types to perform and follow its directions.&#10;&#10;",
        "artist": "Julie Okahara"
    },
    {
        "name": "Battle for Sularia",
        "description": "Welcome Battle Commanders! The future of your faction's survival is depending on you! Gain influence and expand your forces to strategically defeat the opposing faction. You win the battle when you reduce your opponent&rsquo;s health to zero. However, a Battle Commander must be cautious if their opponent is off-initiative. Since Battle for Sularia is a round-based card game, if your opponent is off-initiative, they have the chance to strike back and reduce your health total below theirs and thereby defeating you and winning the game!&#10;&#10;FEATURES INCLUDE:&#10;&#10;Multiple Play Modes&#10;With one box, you and your friend can play with the preconstructed 60 card play decks in a head-to-head 2 player game. The two players can then play in our &quot;60/90&quot; constructed format by customizing their play decks with the additional 60 cards provided in the box! If draft play is more your style, one box also supports 2-4 player draft play! An 8 player draft simply requires one additional box. Of course, the game is fully expandable for a variety of casual play modes &ndash; one box supports up to 2 players in casual mode, but there is simply no limit on how many players and formats are available with additional boxes.&#10;&#10;Construction Point Values&#10;Unique &quot;60/90&quot; deck construction system. Each card has a construction point value of 1 to 4 points. Each deck must have a minimum of 60 cards and a deck cannot exceed a total construction value of 90 points. This system pushes the envelope on deck construction and maintains value and interests for all cards within the set &ndash; not just a few select overpowered options.&#10;&#10;Two-resource System&#10;Engaging two-resource system which includes influence and sularium. Influence increases once per round, while each player uses their influence to establish sites on their turn to help build their sularium stockpiles. Sularium is used to deploy combatants, which are used to attack your opponent's sites. The two-resource system in turn provides additional strategies for repeatable game play.&#10;&#10;Round-based Game&#10;Simultaneous combat! The game runs on a round-based system, which allows each player to complete their turn before the round is over.&#10;&#10;Lore and Art&#10;In addition to our engaging game play, we've forged our own path in terms of game setting. This allows us to explore new content and visuals without restrictions, which in turn provides new players with a fresh start and removes the barrier of entry associated with older legacy games and stories.&#10;&#10;EXPANSIONS:&#10;&#10;&#10;&#10;&#10;    &#10;         Command Packs&#10;&#10;    &#10;    &#10;         2016 Releases&#10;&#10;         Release Date&#10;&#10;    &#10;    &#10;         Blood, Profit, and Glory &#10;         Jul 2016&#10;&#10;    &#10;    &#10;         Faction Pack: Exsularian &#10;         Oct 2016&#10;&#10;    &#10;    &#10;         Faction Pack: Protoan &#10;          2016&#10;&#10;    &#10;&#10;&#10;",
        "artist": "Justine Cruz,Phillip Dudek,Artun Gokcen,John Kimmel (I),Ascary Lazos,Ceasar \"Wizyakuza\" Muyuela,Chunli Thien Nguyen,Thong Nguyen,Garrett Post,Brian “Tots” Valerz"
    },
    {
        "name": "oddball Aeronauts 2: Double the Trouble",
        "description": "oddball Aeronauts 2 : Double the Trouble can be played standalone out of the box or it forms an addition to the oddball Aeronauts card game - a simple, light strategy, played-in-the-hand (no surface required) card game of hi-jinks airship dogfights, set in an oddball fantasy world. Players take their airship officers, crew and bots, and go head-to-head in a duel in the sky of an oddball, steampunk-esque world.&#10;&#10;oddball Aeronauts 2 : Double the Trouble adds 2 new factions to the game - the Mechinauts and the Free Kingdoms - as well as rules for 3 or 4 players.&#10;&#10;Note - by downloading the rules to the original oddball Aeronauts game, you can play oddball Aeronauts 2 : Double the Trouble as a 2 player game right out of the box with no need to purchase the original game.&#10;&#10;",
        "artist": "Lloyd Ash Pyne"
    },
    {
        "name": "Mistfall",
        "description": "Mistfall is a fully co-operative adventure game set in a fantasy world of mystery, eldritch powers and high adventure.&#10;&#10;At the start of the game each player chooses a hero with a fixed deck of equipment and power cards, before embarking on a dangerous journey through a set of monster-ridden locations. Each hero also comes with a pool of advanced abilities that can be added to their basic deck during the game to customize and expand their powers. A variable board setup, randomized encounters and enemies, a simple but robust monster AI &ndash; all that makes for a game that is a varied and challenging experience both solitaire as well as with a group of up to three friends.&#10;&#10;Gather up your resolve, check your gear and get ready to brave the unrelenting Mists. A world of perilous adventures awaits!&#10;&#10;",
        "artist": "Enggar Adirasa,Agnieszka Kopera"
    },
    {
        "name": "Bohnanza: Ladies & Gangsters",
        "description": "Bohnanza: Ladies &amp; Gangsters is an English language compilation of two stand-alone Bohnanza games previously available only in German: Ladybohn: Manche m&#195;&#182;gen's heiss! and Al Cabohne.&#10;&#10;Ladies is a three- to five-player game that includes female versions of the beans used in Bohnanza. You get more money if a field is harvested with a lady bean as the top card. You get no money if a field is harvested with a baby bean on top. There are some new rules about reordering beans on the fields.&#10;&#10;Gangsters is a one- or two-player game where you must pay off the Bean Mafia. Each turn, the Bean Mafia will take beans from your fields if yours match what they are growing. They will also take matching cards when drawn. This game also includes a few new beans with irregular beanometers.&#10;&#10;",
        "artist": "Björn Pertoft"
    },
    {
        "name": "The World of Smog: On Her Majesty's Service",
        "description": "Set in the fantastic steampunk The World of Smog created by Panache Animation, On Her Majesty's Service is a stylish board game for two to four competing players. You'll need to navigate the rotating tiles that make up the game board, trading Ethers and Artefacts in order to fulfill the quest set by Queen Victoria, all the while dealing with the Agents of the Shadow Master.&#10;&#10;",
        "artist": "Mathieu Harlaut,Christophe Madura"
    },
    {
        "name": "Between Two Cities",
        "description": "It is the early 1800s, a time of immense construction and urbanization. You are a world-renowned master city planner who has been asked to redesign two different cities. Projects of such significance require the expertise of more than one person, so for each assignment you are paired with a partner with whom to discuss and execute your grandiose plans. Will your planning and collaborative skills be enough to design the most impressive city in the world?&#10;&#10;Between Two Cities is a partnership-driven tile-drafting game in which each tile represents part of a city: factory, shop, park, landmarks, etc. You work with the player on your left to design the heart of one city, and with the player on your right to design the heart of another city. On each turn you select two tiles from hand, reveal them, then work with your partners separately to place one of those tiles into each of your two cities before passing the remaining hand of tiles around the table.&#10;&#10;At the end of the game, each city is scored for its livability. Your final score is the lower of the livability scores of the two cities you helped design. To win, you have to share your attention and your devotion between two cities. The player with the highest final score wins the game.&#10;&#10;The game features play for 3-7 players in 20-25 minutes, a 2-player variant for head-to-head competition as well as a solo variant (Automa).&#10;&#10;",
        "artist": "Beth Sobel"
    },
    {
        "name": "X-Men: Mutant Revolution",
        "description": "In the aftermath of the Phoenix event, new mutants are appearing all over the earth. Wolverine, Cyclops, Magneto, and Storm each have a vision for the future, but will they unite humans with mutants &mdash; or will they tear the world apart?&#10;&#10;X-Men: Mutant Revolution is a head-to-head battle for the future of mutantkind in which 3-4 players play as Wolverine, Cyclops, Magneto, or Storm, leading their individual schools with unique powers and abilities and recruiting heroes and students in order to train them and send them on missions to spread their vision for mutants to the world.&#10;&#10;X-Men: Mutant Revolution is based on Spartacus: A Game of Blood and Treachery from Gale Force Nine and will include four character miniatures with the HeroClix dial technology.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Dragon Racer",
        "description": "Welcome to the world of dragon racing! A strange racetrack filled with all manner of wondrous and mighty dragons awaits you. Recruit dragons from the racetrack and fire them up to get them racing. The key to your success lies in supplying your racing team with a stream of support from other dragons on the racetrack. In the end only the fastest racer will be victorious!&#10;&#10;Dragon Racer is a fast-paced card drafting strategy game that combines card drafting and set collection. Compete for cards to fire up your team of dragons and advance along the racetrack. After seven turns, the player who has gone the farthest wins! You can combine two copies of Dragon Racer to play with up to eight players.&#10;&#10;In more detail, each player gets three random level 1 dragon cards and places them face up next to their character to create their racing team. Shuffle the other level 1 and level 2 dragons to create the starting dragon deck. Remove one random upper track tile and one random lower track tile, then place the six remaining upper/lower track tiles colored-side down between the corner tiles.&#10;&#10;On each turn, reveal the next face-down racetrack tile and add its associated dragons to the dragon deck. Assign trophy cards to players according to their position in the race. (Skip this step on the first turn.) Deal each player a number of dragon cards (two + the turn number) from the dragon deck. Players simultaneously draft these cards face down until all cards are taken.&#10;&#10;One at a time, in reverse trophy order (i.e. last place goes first), players take turns racing. During this phase you reveal all of the cards you drafted, then use them to fire up dragons on your racing team or to attack other players. At the end of the phase you may swap one of the dragon cards you collected with a dragon on your racing team. Finally, the players with the most dragons from each racetrack type are awarded an extra boost, moving them even further along the racetrack.&#10;&#10;",
        "artist": "Rocky Hammer"
    },
    {
        "name": "Love Letter: Batman",
        "description": "Love Letter: Batman is a game of risk, deduction, and luck for 2&ndash;4 players based on the original Love Letter game by Seiji Kanai. The deck consists mostly of criminals, with Joker being the most valuable card at #8, Harley Quinn at #7, and so on, with Robin showing up at #4 and Batman as #1, which is the guard in the original Love Letter. Your goal is either to hold &mdash; that is, have captured &mdash; the highest valued card at the end of the round or to be the final player active in the round.&#10;&#10;From a deck with only sixteen cards, each player starts with only one card in hand; one card is removed from play. On a turn, you draw one card, and play one card, using the power on that card to expose others and (possibly) knock them out of the round. If you use Batman's ability to KO someone (other than Robin), you score one point, with points being tracked via Batsignal tokens. If you're the final player active in the round or the player with the highest card when the deck runs out, then you score a point.&#10;&#10;The game ends following the round in which someone has seven or more points, and the player with the most points wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Artifacts, Inc.",
        "description": "New York, 1929: A frenzy of interest in antiquity is sweeping the nation! With museums hungry for mysterious and exotic artifacts &mdash; and you hungry for adventure &mdash; you start up your own archeology company. Untold wonders await within dangerous jungles, harsh deserts, and wind-swept mountains. Will you gain a reputation as the most intrepid and famous adventurer of all time?&#10;&#10;In Artifacts, Inc., 2-4 players compete to grow the most famous archeology company. Players roll dice, which represent their troop of adventurers, and place them on cards in order to find artifacts, sell them to museums, and purchase new cards representing their company assets. Players can choose to focus on making lots of money by selling artifacts, having museum majorities, creating the best combination of expeditions and buildings, or searching below the waves for lost cities and hidden treasures. The first player to reach 20 reputation triggers the end of the game, and the player with the most total reputation wins!&#10;&#10;",
        "artist": "Ryan Laukat"
    },
    {
        "name": "Flip City",
        "description": "Build your own town in Flip City! In this deck-building game, you have no hand at all; instead, you play cards directly from the top of your deck. Winning the game requires delicate strategies...and some luck as well!!&#10;&#10;A turn consists of two phases: card playing and building.&#10;&#10;Players play cards directly from the top of their deck and may choose to continue unless they have three cry-face icons in play, which ends their turn immediately. When they choose to stop, they move to the building phase.&#10;&#10;During the building phase, a player can use the coins gained from their previously played cards to buy a new card or to upgrade a card in their personal discard pile. To upgrade a card, pay the cost and flip it over; upgraded cards remain in the discard pile.&#10;&#10;Since all cards in this game are double-sided, be careful not to flip them over accidentally when placing cards into your discard pile or when shuffling your deck.&#10;&#10;Whenever a player gains eight or more VP during a single card playing phase, the player wins immediately!&#10;&#10;",
        "artist": "Chih-Fan Chen,Adam P. McIver"
    },
    {
        "name": "The Werewolves of Miller's Hollow: The Pact",
        "description": "The Werewolves of Miller's Hollow: The Pact consists of The Werewolves of Miller's Hollow base game as well as the three existing expansions for that game as of 2014: New Moon, Characters, and The Village.&#10;&#10;The Werewolves of Miller's Hollow is a game that takes place in a small village which is haunted by werewolves. Each player is secretly assigned a role - Werewolf, Ordinary Townsfolk, or special character such as The Sheriff, The Hunter, the Witch, the Little Girl, The Fortune Teller and so on... There is also a Moderator player who controls the flow of the game. The game alternates between night and day phases. At night, the Werewolves secretly choose a Villager to kill. During the day, the Villager who was killed is revealed and is out of the game. The remaining Villagers (normal and special villagers alike) then deliberate and vote on a player they suspect is a Werewolf, helped (or hindered) by the clues the special characters add to the general deliberation. The chosen player is &quot;lynched&quot;, reveals her role and is out of the game. Werewolf is a social game that requires no equipment to play, and can accommodate almost any large group of players.&#10;&#10;Some versions of The Pact also contain a few promo cards for Dixit that feature art inspired by The Werewolves of Miller's Hollow.&#10;&#10;",
        "artist": "Christine Deschamps,Stéphane Poinsot,Alexios Tjoyas"
    },
    {
        "name": "Beyond Baker Street",
        "description": "A heinous crime has been committed. A team of the Kingdom's finest detectives has been assembled and put on the case. They have a prime suspect, they have a motive, and they know what the opportunity to commit the crime was. Now all they have to do is prove it.&#10;&#10;Using powers of deduction and communication, the players work as a team to eliminate dead leads and find clues to prove who, how, and why. All the relevant clues are available to them to do so. They just won't know it. On top of that, Sherlock Holmes himself is already on the case. Can they solve the crime before he does?&#10;&#10;At the start of Beyond Baker Street, players select one of the crimes to solve, and a number of suspects, motives, and opportunities will be available for the players to convict of the crime. Each player holds a set of clues, but they won't be able to see their own clues &mdash; only those of their counterparts. Each turn, a player must take exactly one of the following actions:&#10;&#10;&#10;    ASSIST another detective &#10;    INVESTIGATE crime scene &#10;    CONFIRM evidence &#10;    ELIMINATE dead leads &#10;    PURSUE new leads&#10;&#10;&#10;Players win together if they can gather enough evidence to make a conviction before Holmes does; otherwise, they crumble under the stress of the case.&#10;&#10;",
        "artist": "Marie-Elaine Bérubé,Atha Kanaani"
    },
    {
        "name": "Kigi",
        "description": "A wealthy patron commissions a lovely landscape mural, hiring the greatest (and most competitive) painters in the world... you! Interfere with each other&rsquo;s paintings and compete to win the world&rsquo;s greatest treasure: Points!&#10;&#10;On your turn, draw a card from the central display. If it is a Commission card, keep it at your side for scoring at the end of the game.&#10;&#10;If it is a tree card, you may add it to any player's tree. If you make a contiguous limb of cards sharing one or more features, you score 1 point for each instance of those features in that contiguous group.&#10;&#10;If you score more than 10 points in a turn, remove the scoring cards and the owner of the tree collects them as &quot;pruned&quot; branches.&#10;&#10;Then reveal a new card in the central display. If there are ever three Commissions in the display, discard them all and replenish the display with three new cards from the deck.&#10;&#10;",
        "artist": "Daniel Solis"
    },
    {
        "name": "The Hen Commandments",
        "description": "The Hen Commandments is a chicken-based religion-building party game. Players are disciples of the Holy Chicken, who has been sent to earth to redeem humankind. Her commandments appear encoded on a series of eggs and it's your job as a devout disciple to not only work out the true meaning of the message, but to convince all the other disciples that your reading is the correct and only Truth.&#10;&#10;The Laying:&#10;The Holy Chicken lays 6 eggs, on each is written a word that together forms a sentence&#10;&#10;The Reading:&#10;All disciples have 1 minute to select the virtue card they think best covers the commandment&#10;&#10;The Preaching:&#10;Disciples reveal their chosen virtue card and each disciple with a unique virtue gets a further minute to explain their reading of the commandment in detail, with regard to their virtue.&#10;&#10;The Judgement:&#10;All the other disciples become judges for the round, and vote on which disciple gave the most compelling explanation of the commandment.&#10;&#10;The Reward:&#10;The disciple who gets the most votes is rewarded with 2 pieces of corn. Or, if the vote is split, those disciples get 1 piece of corn each.&#10;&#10;Canonisation:&#10;Play ten rounds, each time revealing a new commandment. The disciple who has collected the most corn is made into a Saint and rewarded with the record of all 10 commandments so they can go forth and start their own sect of Heninism.&#10;&#10;It's a simple, creative, funny group game that scales well and plays out in about 45 minutes.&#10;&#10;The cool thing is that while each disciple is competing to have their individual opinion heard and recorded, together, you collaboratively create what is essentially a new religion in the course of a game.&#10;&#10;",
        "artist": "Tom Morgan-Jones"
    },
    {
        "name": "BANG!: Heroes of the Storm",
        "description": "BANG!: Heroes of the Storm pits heroes and villains from World of Warcraft, Diablo and StarCraft against one another in a cross-universe battle for supremacy. BANG!: Heroes of the Storm is based on the world's best-selling shoot 'em up card game BANG!, as seen through the worlds of Heroes of the Storm.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Epic PVP: Fantasy",
        "description": "Epic PVP: Fantasy is a head-to-head battling card game. At the start of the game, each player chooses a class deck and a race deck, then shuffles them together to create unique character combinations, such as a Human Paladin or Goblin Druid. Each combination creates unique tactics and strategies to use when you battle.&#10;&#10;The goal of the game is to defeat your opponent by reducing them to zero life. Players do this by playing moves that act as both attacks and blocks as well as with special cards and abilities granted by the player's choice of class and race.&#10;&#10;During a turn, a player adds cards to their &quot;aggression pile&quot;, then chooses how many cards to draw from their aggression pile into their hand. The player uses the aggression provided by the cards that remain in their aggression pile to play move cards to block incoming enemy attacks. If an attack isn't blocked, the player takes damage, specifically one damage per unblocked enemy attack. Then all the moves played by that player become attacks for the opponent to deal with on the opponent's next turn. There's more to it than that, but those are the basics...&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Rum & Bones",
        "description": "Avast ye pirates! Gather your crews and set sail for adventure on the high seas in Rum &amp; Bones!&#10;&#10;Based on online MOBA (Multiplayer Online Battle Arena) style games, Rum &amp; Bones has 2-6 players taking control of legendary pirate heroes, each with unique powers and abilities, as their crews fight over Davy Jones' legendary treasure!&#10;&#10;Players will each control up to five heroes at any time, moving them across the game board in an attempt to destroy various key features across their opponents ship. Victory is obtained by destroying enough of these features. Your heroes are not alone, however, as your crew also consists of deckhands and bosuns who, while not controlled by the player, will work on a simple AI to wreak havoc on the enemy!&#10;&#10;Of course, what would pirates be without plunder? And in Rum &amp; Bones the most sought after treasure are Davy Jones' mythical pieces of eight! Players will amass these powerful coins during gameplay to unleash devastating abilities and attacks from their Heroes, crushing all enemies before them until only they remain!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Die Kutschfahrt zur Teufelsburg",
        "description": "Die Kutschfahrt zur Teufelsburg is a 3-10 player card game.&#10;&#10;Turn actions:&#10;&#10;    Trade&#10;    Duel&#10;    Pass&#10;    Declare Victory by naming your team and who has the three items, starting with yourself&#10;&#10;&#10;&#10;&#10;If a trade is rejected that is the end of that player's turn.&#10;&#10;Duels: Beginning with the player to the attacker's left, players declare their support for attacker or defender in order. Apart from the attacker and defender, players can abstain.&#10;&#10;Victory: Declare Victory by naming your team and who has the three items, starting with yourself, then one by one. If you name players on your team incorrectly or they don't have the object(s) you lose.&#10;&#10;",
        "artist": "Eckhard Freytag,Lukas Zach"
    },
    {
        "name": "Bonje in de stal",
        "description": "Chaotic reaction game for the whole family.&#10;&#10;You have to fill your stables with 1 male animal and at least 1 female animal of the same kind. &#10;If you have 2 male animals in 1 stable, than you have &quot;trouble in the stable&quot; or in Dutch &quot;Bonje in de stal&quot;.&#10;&#10;All players flip a card at the same time, grab and play as fast as possible a card of your choice.&#10;Animals you win have to put in your own stable. You can block or empty other stables with elephants, mad cows and crazy horses.&#10;If you have a truck, you can put the animals in other stables.&#10;&#10;Can you be the first player who fills 5 stables?&#10;&#10;Given to the visitors of Spellenspektakel 2014 in Eindhoven, The Netherlands.&#10;&#10;",
        "artist": "François Bruel"
    },
    {
        "name": "Race to the North Pole",
        "description": "Ahoy, adventurer! The Arctic is merciless: Your expedition team has to endure the unforgiving wilderness, the unexpected weather and the other fame hungry teams. Only one will be remembered as the conqueror of the North Pole. If you think you can adapt the ever-changing harsh conditions better than the others, start gearing up &mdash; the race is on!&#10;&#10;In Race to the North Pole each player has an expedition team which they have to navigate to the North Pole on the middle of the game board. The first player to get all of his or her pawns there wins the game. Game is played by moving with cards that are in front of you. Some cards allow movement while others also ambushing other players. But ambushing has a price! When ever you tackle another player you have to grab an &quot;Ice Mask Tile&quot;, which include equipment and some nasty hazards that might ruin your well planned schemes.&#10;&#10;Race to the North Pole also features a unique rotating board that simulates the Arctic weather. When a storm hits the board, everything changes! Your movement cards travel on the board and you receive a new set, the arctic maze that is formed out of cracks changes completely and the players travel around the board with the weather. This design has deep strategical elements that make every playthrough exciting and challenging to the very end.&#10;&#10;The game includes a free app Dized that gives players loads of new content, localizations, and mechanisms to use with the game through their smart devices.&#10;&#10;",
        "artist": "Markus Norrgran,Eric Verspoor"
    },
    {
        "name": "Corrupted Kingdoms",
        "description": "Corrupted Kingdoms is a fun strategy and negotiation game set in a fantasy world, where you take on the role of an evil corporate monster, fighting for power over the pathetic united kingdoms and its political elite. To advance your hidden agenda, and enrich the lives of your friends and associates, you will use your horde of minions to corrupt and subvert the assembly of the realm. Use the right kinds of &quot;persuasion&quot;, increase your own power, and push backroom deals through the assembly, all while looting the kingdom and its people of all its worth.&#10;&#10;At the start of the game, each player will choose a fantasy corporation to play as (Dragons, Sorcerers, Giants, Witches, Vampires or Orcs), a Hidden Agenda which will guide their evil plan, and some starting minions (Zombies, Demons, Goblins, or Golems).&#10;&#10;Over the course of the game players will influence the assembly of the realm (Humans, Elves, Dwarves, and Gnomes) using their minions and influence. Propose bills through lobbying efforts, buy useless and pretty luxuries, and get the politicians who represent the (ahem) &quot;people&quot; to push their nefarious legislation into law.&#10;&#10;",
        "artist": "Heiko Günther"
    },
    {
        "name": "Smash Up: Pretty Pretty Smash Up",
        "description": "Think only pirates, time travelers, vampires and bears can smash bases? Well, get ready to be taught a lesson &mdash; in the nicest way possible!&#10;&#10;Pretty Pretty Smash Up brings the sweetest factions ever to the vicious fight for victory! Kitty Cats use their incredible cuteness to take control of enemy minions. Princesses ply their royalty, beauty and even their love to get their way. Fairies' fickle tricks give you options like never before, while the herds of Mythic Horses work together for dominance. Get ready &mdash; your opponents will never know what hit them!&#10;&#10;Pretty Pretty Smash Up can be played on its own as a two-player game or combined with other Smash Up titles to allow for up to four players to compete at the same time.&#10;&#10;Integrates with:&#10;&#10;&#10;    Smash Up&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Marvel Dice Masters: Age of Ultron",
        "description": "Marvel Dice Masters: Age of Ultron is a collectible dice-building tabletop game designed by Quarriors! creators Michael Elliott and Eric M. Lang.&#10;&#10;In this game, each player fields one of the superhero teams, with each hero &mdash; Rocket Raccoon, Groot, Captain Marvel, Daredevil, Kang and more &mdash; being represented by custom-tooled dice; each team must be composed of 15 dice, and a player can &quot;purchase&quot; dice only from his team. Each hero also has one or more character reference cards, which show the special abilities for the characters based on the die rolls. Different versions of these cards will be available in booster packs, allowing for more customization of your team. Players use these dice to collect energy, recruit new heroes, and battle head-to-head. In addition, each player brings two basic action cards to the game, which are placed in the center of the table; both players can purchase these cards. A player wins once the opposing player has been reduced to zero life.&#10;&#10;The Marvel Dice Masters: Age of Ultron starter set comes with 44 custom dice, 38 cards, two dice bags, and a core rulebook. Booster packs include two dice with two matching character cards.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "London After Midnight",
        "description": "Heroes and monsters fight to death in the streets of victorian London!&#10;&#10;Each player take a secret faction card, that will say if he is at the side of the &quot;Heroes&quot; or at the side of &quot;Monsters&quot;.&#10;&#10;During the game, a player can either play a card from his hand or draw a new card. Each card will give you &quot;black&quot; points (if you are a Monster) or &quot;white&quot; points (if you are a Hero). Also, each card represents a character with a special skill that you can use in your favor. Dracula can control the forces of darkness. Van Helsing can destroy the undead. Frankenstein's monster can run havoc. Arsene Lupin can steal a card from another player. Jekyll and Hyde discard each other...&#10;&#10;The game ends when the last card is drawn. Then, each player reveals his faction and count his points. There can be only one winner!&#10;&#10;London After Midnight is very easy to learn and very fun to play. There is a total of 18 different characters, in a deck of 30 cards. Some of these characters are unique and deadly, like the werewolf, but others are more common and less powerful, like the brave young men. In addition to this, each faction card will give you an extra point if you have a certain character in front of you at the end of the game. That means that some cards are more useful for some players than for others.&#10;&#10;&bull;&bull;&bull;&#10;&#10;&iexcl;H&eacute;roes y monstruos combaten a muerte en las calles del Londres victoriano!&#10;&#10;Cada jugador coge una carta de facci&oacute;n secreta, que dir&aacute; si est&aacute; del lado de los &quot;H&eacute;roes&quot; o de los &quot;Monstruos&quot;.&#10;&#10;Durante la partida, un jugador puede, o bien jugar una carta desde su mano, o bien robar una nueva carta. Cada carta proporciona puntos negros (si est&aacute;s del lado de los monstruos) o blancos (si est&aacute;s del lado de los h&eacute;roes). Adem&aacute;s, cada una de estas cartas representa a un personaje con una habilidad especial que puedes usar en tu beneficio. Dr&aacute;cula puede controlar las fuerzas de la oscuridad. Van Helsing puede destruir a los no-muertos. El monstruo de Frankenstein puede provocar el caos. Arsene Lupin puede robar una carta a otro jugador. Jekyll y Hyde se descartan mutuamente...&#10;&#10;El juego termina cuando se roba la &uacute;ltima carta del mazo. Entonces, cada jugador revela su carta de facci&oacute;n y cuenta los puntos. &iexcl;S&oacute;lo puede haber un ganador!&#10;&#10;&quot;London after midnight&quot; es muy f&aacute;cil de aprender y muy divertido de jugar. Contiene 18 personajes distintos, en un mazo con un total de 30 cartas. Algunos de estos personajes son &uacute;nicos y letales, como el hombre lobo, mientras que otros son m&aacute;s comunes y menos poderosos, como los j&oacute;venes aguerridos. Adem&aacute;s, cada carta de facci&oacute;n te dar&aacute; un punto extra si tienes a cierto personaje frente a ti al final del juego. Esto significa que algunas cartas son m&aacute;s &uacute;tiles para unos jugadores que para otros.&#10;&#10;Tendr&aacute;s que enga&ntilde;ar, jugar de forma estrat&eacute;gica y traicionar a tus amigos. &iexcl;&iexcl;Si te gustan los juegos de cartas r&aacute;pidos y las pel&iacute;culas de terror antiguas, &quot;London after midnight&quot; est&aacute; hecho para ti!!&#10;&#10;",
        "artist": "Juancho Capic,James Castillo Murphy"
    },
    {
        "name": "Slaughterville",
        "description": "For anyone who ever said to a horror movie: Don&rsquo;t go in there! Now they can live those, oftentimes poor, choices. While you and your friends are taking a vacation in Slaughterville, a great evil awakens just to ruin the your day. Slaughterville will take players on a thrilling adventure through the fictional town that just happens to be host to numerous supernatural and horrific events. Yet still, it remains a popular vacation spot for college students looking for a good time.&#10;&#10;Playing as one of the typical horror movie staples, the player will interact with one of the main locations in Slaughterville in an effort to find the Clues necessary to stop the Villain from winning and ruining their summer plans. Players will travel through portions of the town represented as separate boards. As they encounter each space, they will draw a card and react to the events on the card. Ultimately, through this interaction, they will gather the materials and Clues necessary to finally defeat the Villain!&#10;&#10;Slaughterville is a game of exploration and atmosphere for 1-6 players.&#10;&#10;",
        "artist": "Christopher Brown,George Rubio"
    },
    {
        "name": "Flick 'em Up!",
        "description": "The cities in the West are not the safest place to be. In the disc-flicking game Flick 'em Up!, you can become an outlaw and rob banks, free prisoners, attack innocent bystanders... or you could become the Sheriff and try to protect the people of your city from these bandits!&#10;&#10;Relive the great adventures of the West, face your enemies in street duels, use different guns and tactics to get what you want. You can follow the scenarios or create your own&mdash;the choice is yours, cowboy!&#10;&#10;",
        "artist": "Marie-Elaine Bérubé,Philippe Guérin,Chris Quilliams"
    },
    {
        "name": "Stone Garden",
        "description": "In Stone Garden (&#230;&#158;&#175;&#229;&#177;&#177;&#230;&#176;&#180;, which also translates as &quot;rock garden&quot; or &quot;Japanese rock garden&quot;), players are gardeners attempting to make the most aesthetic garden by placing tiles of sand and moss side by side on their respective garden boards. When meditating by one's garden, virtue points are earned that can be spent on favorite rocks to elevate the garden further. Through famous garden architects from history, special effects affecting the garden can be achieved.&#10;&#10;",
        "artist": "Yusuke Mamada"
    },
    {
        "name": "Letter Tycoon",
        "description": "Letter Tycoon is the word game for 2-5 capitalists!&#10;&#10;In the game, players take turns forming a word using a seven-card hand and a three-card community card pool, scoring money and stock rewards based on their word. Players may use their earned money to buy one letter &quot;patent&quot; in the word they make. In the future, whenever another player uses one of your owned letters on their turn, you earn money from the bank. Letters that are used less frequently have special abilities, increasing their power.&#10;&#10;When enough of the alphabet has been claimed, players finish the current turn, then score all money, stock and letter patents owned. Create the most valuable empire and you can become the letter tycoon!&#10;&#10;",
        "artist": "Mackenzie Schubert,Peter Vaughan"
    },
    {
        "name": "A Game of Thrones: The Card Game (Second Edition)",
        "description": "In A Game of Thrones: The Card Game, the warring factions of Westeros await your command, inviting you to engage in a life-or-death struggle. In every game, you select devious plots and challenge your opponents on the field of battle, through back alley intrigue, and in the political arena. Whether you play a against a single opponent, in a game known as a joust, or engage in a battle of three or more players, called a melee, winning challenges against your opponents is the way to victory.&#10;&#10;Your ultimate goal in A Game of Thrones: The Card Game is to gain influence over the greatest seat of power in Westeros: the Iron Throne! To achieve this goal, you must call upon iconic characters, such as Tywin Lannister, Robb Stark, Stannis Baratheon, Daenerys Targaryen, Euron Crow's Eye, The Red Viper, and dozens of others. You must maneuver the members of your House and your allies in a constant battle to gain power. The first player to claim fifteen power wins!&#10;&#10;In the game, each player has two decks: a draw deck and a plot deck. Your draw deck contains the tactical elements of your struggle, including the characters, locations, attachments, and events that you call upon in your struggle to claim the Iron Throne. You can command characters from throughout A Song of Ice and Fire, and you can march forth from the icy walls of Winterfell or muster your armies around Casterly Rock. You may even equip your characters with storied weapons, such as the Valyrian steel blades Ice or Widow's Wail. The draw deck holds these powerful characters, locations, attachments, and events. This deck is randomly shuffled and players draw their hands from this deck.&#10;&#10;At the start of each round, each player simultaneously chooses and reveals one of the plot cards from their individual seven-card plot decks. Your plot for a round determines how much gold you can spend on cards, which player starts with initiative, and how powerful your challenges are. Your plot also bears a reserve value, which determines how many cards you can keep in your hand past the end of the round. Plots may also offer powerful effects that can trigger when the plots are revealed or persist to shape the entire game round. You may scorch the earth with a deadly wildfire assault, or call upon all players to support the faith of the Seven.&#10;&#10;A Game of Thrones: The Card Game (Second Edition) differs from the first edition of the game due to elements being cut, elements being revised or updated, and elements being added. Influence was a holdover from the game's origin as a CCG and is now unnecessary, while crests offered nothing to distinguish them from traits and made the game more difficult for new players to learn. Existing keywords have been pruned, and some new keywords have been added to showcase the most interesting and essential interactions.&#10;&#10;The timing rules &mdash; such as the details of moribund, passive effects with triggers, and save/cancel responses &mdash; will be replaced with a more straightforward timing system that takes advantage of the Interrupt, Reaction, and Forced triggers that have been successfully employed in some of FFG's newer LCGs.&#10;&#10;The second edition also includes two new factions beyond the six Houses in the first edition. New deck-building rules empower players with more options in combining factions, alongside a means of building more focused and specialized plot decks.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Pixel Tactics Deluxe",
        "description": "Pixel Tactics is a head-to-head game of tactical combat for two players. Each player has an identical deck of 25 cards, from which they draft a leader. The leader's abilities alter vastly the strategy and playability of every other card in the deck, making the game playable in 25 different ways.&#10;&#10;In the game, players take turns placing cards and attacking. Each card can activate in various ways, taking on offensive capabilities in the front rows of the unit, or support powers in the back rows. Cards can also be played as orders &ndash; powerful single-time effects that can turn the tide of battle.&#10;&#10;Play continues until either player's leader is defeated. A typical game is best of three or five rounds.&#10;&#10;Pixel Tactics Deluxe is a perfect place to start playing the game. This large box contains enough cards for two players, rules, punch tokens, and storage space for all the other Pixel Tactics games in print. Whether you're a veteran of the series, or just looking to get your feet wet, it's a great place to start.&#10;&#10;All 25 heroes in Pixel Tactics Deluxe are brand new!&#10;&#10;",
        "artist": "Fábio Fontes"
    },
    {
        "name": "Pixel Tactics 4",
        "description": "Pixel Tactics 4 introduces a brand new mechanic of Traps! The set has a theme of counterplay and counter-counterplay, with many cards designed to surprise and intimidate your opponents.&#10;&#10;",
        "artist": "Fábio Fontes"
    },
    {
        "name": "City of Spies: Estoril 1942",
        "description": "Estoril is small town near Lisbon, Portugal. Having a casino, beach and wonderful weather, the region was a center of diplomacy -- and spying -- during World War II.&#10;&#10;In&nbsp;City Of Spies: Estoril 1942, players are competing against each other to form the most powerful and influential secret organization of spies. Based on historical facts, the game takes place on famous locations in Estoril.&#10;&#10;Six locations are randomly selected to be used for the first round, such as casinos, hotels, beaches, etc. Control of these will be fought over in each of the four rounds of the game. Special Agents are then placed on each location as the reward for who have the most influence on that location.&#10;&#10;Players begin the game with the same hand of Agents (tiles) and will take turns placing these tiles in the open spaces of the various locations on the board. At the end of each round players check each location to see which player gains the reward for that location.&#10;&#10;At the end of the fourth round, players will total up the points of their Agents plus any special game objective they might have completed. Whoever has the most points wins.&#10;&#10;",
        "artist": "Mihajlo Dimitrievski"
    },
    {
        "name": "Birds of a Feather",
        "description": "Every year, the most enthusiastic (or maybe just crazy) birders across the country embark on a big trip, where they try to see as many birds as they can. For some reason, you've decided that this year will be your big year. You'll explore wonderful habitats on a quest to see as many beautiful birds as you can. But whenever you see a bird, word will get out. Anticipate the crowd to see more birds than anyone else!&#10;&#10;Birds of a Feather is a fast, friendly, easy to learn card game for 2-7 players. The game is easy enough for children to learn and enjoy, but surprisingly strategic, making it a great filler for more hard core gamers.&#10;&#10;At the beginning of the game, each player is dealt a large hand of cards. The game takes place over several rounds. In each round, each player chooses a card to play simultaneously. This determines not only which bird that player sees that round, but which habitat that player visits. Players check off the birds they see on a score sheet, seeing their own bird plus any other birds in the same habitat. Additionally, all birds are available to be seen for an additional round, giving players the opportunity to see rare birds they missed the first time.&#10;&#10;Once all players have played through their hands, scores are tallied based on which birds each player saw. Seeing all birds in a habitat gives a substantial bonus. In the end, whoever saw the widest variety of birds is the winner!&#10;&#10;",
        "artist": "Trevor Fristoe,Slim Mittens"
    },
    {
        "name": "Waterloo 200",
        "description": "The sun rose on the morning of 18th June, 1815.  Napoleon Bonaparte breakfasted with his generals at Rossomme on the Brussels's road. The conversation returned to the weather; It had poured rain throughout the night and Drouot, the commander of the Emperor's artillery was worried about the effect on his guns. Napoleon acquiesced to a delay in starting the attack. This was the first of many fateful decisions to be made on that day...&#10;&#10;Waterloo 200 is a new concept game covering the epic Waterloo Battle fought in Belgium in June 1815.&#10;&#10;Developed on wooden blocks, over a colorful 86x64 cm mapboard, 400g thick.&#10;The over 200 wooden/plastic components have been created by the best Italian artisinal industry and painted &quot;A buratto&quot;, a technique usually adopted for painting car parts and accessories.&#10;&#10;Historical Background&#10;On June 18 1815, Napoleon's Arm&eacute;e du Nord and a coalition led by Wellington, clashed over the plains of Waterloo in Belgium for a decisive battle.&#10;&#10;Waterloo is a game for two or three players, one controls the French Army and the other one/two control the Seventh Coalition.&#10;Although based on history, players in command of the two sides can modify the evolution of the battle and of the history in the Europe of XIX centuries.&#10;&#10;Rules Introduction&#10;The rules are easy - 6 pages - players can start playing the game without too many rules to remember and the game is 5 turn long (90-120 minutes)&#10;Then the 10 Optional Rules provide more specific and detailed rules for an enhanced realism, such as special Cavalry abilities (Charge, Scouting, Impetus), Artillery Bombardment, Retreat, Combined Attack, Morale...&#10;&#10;Scale&#10;A cm is approximately 70 meters.&#10;A turn is 2 'hours' long.&#10;A full strength counter represents a Leader or a Brigade (30-50 guns, 1000 Cavalrymen, or 3,000 infantrymen) depending on the unit's type, training, morale and leadership.&#10;&#10;Fog of War&#10;The game must be played with the Fog of War on (wooden blocks are placed on the map in such a way the opponent player can not see them).&#10;&#10;Language: English, German, French, Spanish and Italian&#10;Genre: Tactic&#10;Turns: Turn-Based&#10;Complexity: Entry Level to Basic, depending on which rules are used&#10;Period: Napoleonic&#10;&#10;Microbadge: &#10;&#10;",
        "artist": "Emanuele Santandrea"
    },
    {
        "name": "How To Serve Man",
        "description": "Step into the shoes of an intergalactic Chef, competing against other Chefs in a knock down, no-holds-barred Cooking competition! The featured ingredient for the this contest&hellip; Human Beings!&#10;&#10;Impressing the Celebrity Judges with your culinary prowess while making sure your ingredients don&rsquo;t run away is not an easy task, but one that must be mastered if you are to become the champion of Space Kitchen Stadium!&#10;&#10;In this light worker placement game, players gather resources, cook them up, and combine them to create Dishes to present to the Celebrity Judge panel. Each Judge claimed awards bonus points for future Dishes and helps shape the Chef's overall strategy.&#10;&#10;The Chef that does this the best, while watching the clock as well as dealing with the inevitable hazards of outer space, wins!&#10;&#10;",
        "artist": "Jamie Toon"
    },
    {
        "name": "Pathfinder Adventure Card Game: Wrath of the Righteous – Base Set",
        "description": "Game description from the publisher:&#10;&#10;The Abyss awaits! When the city of Kenabres is destroyed by a horde of demons, only you can save the world! In Wrath of the Righteous, the epic new Adventure Path for the Pathfinder Adventure Card Game, you will travel to the Abyss to battle the malevolent minions of the demon lord Deskari. Along the way, you'll become mythic heroes that rival the greatest legends the world of Golarion has ever known. The saga begins in the Pathfinder Adventure Card Game: Wrath of the Righteous Base Set.&#10;&#10;This cooperative strategy card game lets 1-4 players enter the hellish Worldwound. Choose from seven characters, each with a different style of play. Build a deck of powerful boons which will grow according to your desires as you advance in power by conquering challenges. Eventually, you'll gain a mythic card, which will allow you to warp the rules of the game and use the first-ever 20-sided die to appear in a Pathfinder Adventure Card Game release.&#10;&#10;The Pathfinder Adventure Card Game: Wrath of the Righteous Base Set contains:&#10;&#10;&#10;    More than 500 cards featuring a new set of boons for your characters to collect, and never before seen monsters and barriers of a decidedly abyssal nature.&#10;    Seven character classes, including the all-new arcanist, cavalier, inquisitor, and summoner.&#10;    The Worldwound Incursion Adventure Deck, a 110-card deck that begins the Wrath of the Righteous Adventure Path.&#10;    A complete set of six polyhedral dice, including the first d20 in the Pathfinder Adventure Card Game.&#10;&#10;&#10;",
        "artist": "NA"
    }
]