[
    {
        "name": "Monopoly: Spanish",
        "description": "The name of the game speaks for itself. In this Spanish Version you'll be able to tour the streets of Madrid buying them with your no longer existent &quot;pesetas&quot;, building houses and hotels from Lavapi&eacute;s until the Paseo del Prado.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Faerie Tales",
        "description": "For Faerie Tales&#10;In this strategy and fantasy board game, you take control of one of the kingdoms after dragons awake. The game begins with tiles placed face down to build the territory.  Players explore the territory while fighting enemy troops with knights, soldiers, a Pegasus, and captured dragons.  War is only one strategy to play -- players can also try to take the princess to the enemy castle and force her marriage to the local prince.&#10;&#10;For Draco Mundis&#10;The players have the responsibility of a team of various adventurers trying to gain victory points by exploring the jungle. All players start with exactly the same team.&#10;&#10;First they must lay down their pawns (characters, terrains) and then, in turn, realize two actions, like move, fight, or explore.&#10;&#10;In order to gain victory points, they can kill their opponents or manage to place some of their characters in strategic points on the map.&#10;&#10;Each pawn has its own constraints, e.g. all cannot move in every direction, or have the same movement points and fight points. Some have special abilities.&#10;&#10;",
        "artist": "Alberto Bontempi,Christophe Madura"
    },
    {
        "name": "Midgard: Das Brettspiel",
        "description": "The game tries to recreate the Midgard role playing feeling in a boardgame. It addresses former Midgard RPG players, who don't find the time for role playing anymore, as well as fans of fantasy boardgames. As the complexity level is rather high and the game offers multiple options for players, Midgard is rather successful in achieving it's goal. The difficulty is still light to medium, despite dozens of cards that influence the game and the characters.&#10;&#10;The game is based on tiles (major cities of Midgard) players move across, collecting rare items and fulfilling adventures. Often this ends in the local city jail or in clashes with monsters. Additional threats like terror cards or riots pop up in cities during the game.&#10;&#10;Tests are made with a 20-sided die and the mechanics are just the same as in the Midgard RPG. Movement and actions are controlled by action cards from a four-card-hand which allows tactical gaming. Each action card has different abilities and some may even interrupt another player's turn.&#10;&#10;Players may form groups for the duration of a game turn to help each other solve adventures or make difficult tests. Sticking together earns each player of a group experience points and treasure cards. As only one player can finally win the game, forming groups is a two-edged sword as it helps your opponents too. The goal of the game is to get 3 treasure rewards, rise to character level 3 and find 2 artifacts first. If you deliver the treasures and artifacts to the correct city you have won the game.&#10;&#10;Included are pre-generated characters like Sorcerer or Warrior but players will be able to create their own characters in the final release version.&#10;&#10;This information is derived from the website of Phantastische-Spielewelten.&#10;&#10;http://www.phantastische-spielewelten.de&#10;&#10;",
        "artist": "Swen Papenbrock,Lisa Wilkens"
    },
    {
        "name": "Die Drachenbändiger von Zavandor",
        "description": "In this game, players fight Dragons with swords and nets.&#10;The 80 numbered playing cards show one of the following:&#10;&#10;1 sword&#10;1 net&#10;2 swords&#10;2 nets&#10;1 sword &amp; 1 net&#10;&#10;Every dragon card shows 1-5 swords and 0-3 nets.&#10;&#10;One dragon is revealed from the dragon pile. All players choose one of the five playing cards in their hand and play them simultaneously. Starting with the lowest number on the played cards the number of swords are counted. The player who played the sword that equals the number of swords on the dragon has &quot;tamed&quot; the dragon. If the dragon card shows any number of nets the remaining cards played by the players are checked for any nets. If the number of nets equals the number of nets on the dragon card the player who played the corresponding net cards catches the dragon. If the number of nets played is lower than the one on the dragon the dragon &quot;tamer&quot; wins the dragon card.&#10;&#10;The players draw cards from the draw pile and the next dragon card is revealed.&#10;&#10;",
        "artist": "Klemens Franz,Cyril Saint Blancat"
    },
    {
        "name": "Deal or No Deal: Electronic Game",
        "description": "Compete against the bank or up to three other players in a battle to win big in this electronic home version of the international hit television show.  The rules are simple.  Each player selects a briefcase.  As each round progresses, players may keep their original briefcase or make a &ldquo;Deal&rdquo; with the bank to accept a cash offer in exchange for whatever dollar amount is in their selected briefcase.  The rotating electronic gameboard keeps track of all players' choices and their subsequent &ldquo;Deals&rdquo;&hellip;or &ldquo;No Deals,&rdquo; which are kept secret until the end of the game.  For ages 8 and up.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Dungeon Twister Collectors Box",
        "description": "With the purchase of the collector's box comes membership into the exclusive Dungeon Twister Club. The club offers additional information, puzzles, tournament invitations, specials, etc. Membership is free and limited to 1000 members.&#10;&#10;The collector's box is limited to 1000 copies!&#10;&#10;",
        "artist": "Eric Bourgier,Thierry Masson,Wayne Reynolds"
    },
    {
        "name": "Tavern",
        "description": "&quot;Dwarfs, elves, orcs and other strange beings visit your tavern. Try to serve them enough drinks, but don't let it get out of hand!&quot;&#10;Each player is the owner of a tavern. They try to attract customers with musician cards. They collect points by serving their guests drinks and keeping them in their tavern as long as they can (for example, if there are many dwarfs in your tavern, all the elves will go out). The player who has collected most points after 2 rounds (day and night) is the winner of the game.&#10;&#10;",
        "artist": "Thomas Jansen"
    },
    {
        "name": "Monstermaler",
        "description": "Description from 2F-Spiele:&#10;&#10;What do you do if you are supposed to quickly draw the left side of Queen Elizabeth II? You draw half a crown, a dress ... but already everybody but you has shouted stop and you only just started to draw the Queen's face. And you still wanted to draw Buckingham Palace in the left corner ... Now it's up to your left neighbor to save you both. Unfortunately, you hear her mourning once she reads whom she's supposed to draw. But maybe some good idea will strike her?&#10;&#10;Idea of the game: &#10;4 and more players try simultaneously to recognizably draw one side of a person chosen before. If you are ready, you shout &quot;Stop!&quot;. The slowest player must not finish. Fold the sheet, and let your left neighbor complete the right side of the person chosen - without looking at the left side.&#10;Monstermaler is the perfect game for the party, for warming up or cooling down and for people who don't like games. By the way, it's rather a disadvantage to know how to draw when playing Monstermaler.&#10;&#10;Components:&#10;1 A6-pad of 120 sheets, German rules are printed on the inner side of the cover. Add a pen and if needed a shade for every player.&#10;&#10;Separate French (Monstre-moi un dessin) and English (Split Personality) versions of this game are available from Canada's KiKi Gagne?.&#10;&#10;While the list of people on the back of each sheet is focused on Canadians, it is more accessible to those in the United States than that from the German edition.&#10;&#10;Re-implemented by:&#10;&#10;&#10;     Tadaaam!&#10;&#10;&#10;",
        "artist": "Michael Menzel,Marcel-André Casasola Merkle"
    },
    {
        "name": "Affentennis",
        "description": "Affentennis (Monkey Tennis) is a dexterity game with a good strategic design. The tennis court is overlaid with a hex grid, and players use a rubber-band mechanism to hit the ball. The Monkeys are used only to note the location of the player on the court -- they could have just been cubes, but look much better this way. The Monkeys, by the way, are from south German television commercials.&#10;&#10;The game includes options you might not expect from the name or from an unknown small publisher. Each player has a limited amount of movement when hitting or returning a shot, and then can &quot;borrow&quot; from their next move but this puts them under pressure and thus limits their ability to shoot most effectively. Other clever options include the ability to serve and volley using a clever wooden block idea, the ability to lob over a volley using a ramp, and the ability to smash a volley.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Ausgerechnet Uppsala",
        "description": "In this re-themed edition of Ausgerechnet Buxtehude, we are now trying to learn the geographical locations of cities and sights all over Europe.&#10;&#10;Players place cards on the table according to their relative location. Other players may doubt the accuracy of the placement you made. Should the accusations turn out to be true, you would have to give out a scoring marker. The player with the most scoring markers in the end wins.&#10;&#10;The game includes 200 location cards with longitude, latitude, and other information on the locations.&#10;&#10;Re-implements:&#10;&#10;&#10;     Ausgerechnet Buxtehude&#10;&#10;&#10;",
        "artist": "Daniele Barletta,Sabine Kondirolli,Volker Maas"
    },
    {
        "name": "Claim It!",
        "description": "From the website:&#10;&#10;Stake your claim! Get the best patch of land in these gold-filled hills. Roll the dice to claim an area as your own. Steal claims from other players, or double your claim and make an area permanently yours. Keep rolling as long as you want, claiming more land on each roll. But watch out: if you make a bad roll, you lose everything you claimed this turn. Build the biggest system of mines and win it all!&#10;&#10;How to Play&#10;&#10;Players will claim spaces on the board by rolling three dice. You may keep rolling and claiming more spaces, or you may stop at any time. When you stop, you replace all the white &quot;Squatter&quot; markers with markers of your own color. If you keep rolling, you risk losing what you gained this turn. If you roll a combination of numbers that you cannot use, you bust and all the spaces that you claimed this turn are lost. When the game ends, the player with the largest connected group of spaces wins.&#10;&#10;",
        "artist": "Mike Raabe"
    },
    {
        "name": "Monopoly: Euro",
        "description": "Monopoly Euro is a Monopoly version celebrating the upcoming Euro. The towns are replaced by EU countries and stations are big European airports as Heathrow. The pawns are well-known EU tourist attractions such as the Eiffel Tower and Coliseum.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Fruit Fair",
        "description": "You secretly assign your pickers and planters to the different orchards.  Then everyone executes their actions.  The people later in the round may get cut out of the fruit picking.&#10;Next each person in order has a chance to send their fruits to the fair to win prizes (vp) or hire another worker.&#10;After that who ever has the most fruit in each of the four types wins a special ability.  The ability you can win with each fruit can change at the end of the turn.  When there are only a certain number of prizes left the game ends and you add up your prizes and remaining fruit to see who wins.&#10;&#10;Despite the name, no food fighting involved.&#10;&#10;",
        "artist": "Quinton Hoover,Mike Raabe"
    },
    {
        "name": "Manymals",
        "description": "Sarah and Dinah are standing totally amazed in the zoo in front of the sea lions. Something is laying next to a rock with feathers on its back? &quot;Does a sea lion have feathers like a bird or does it have fur like a dog?&quot; Suddenly somebody claps their hands and the duck that was hiding behind the sea lions flies off quacking. Relieved, both of them laugh at each other after seeing that the sea lion doesn't have any feathers after all.&#10;&#10;In Manimals, players compete to find as many animals as possible with a certain characteristic. To start play, shuffle the animal cards, then spread forty of them on the table so that everyone can see them. Flip over one card, see the characteristic identified on this card, then race to pick up all animals that feature this characteristic. Once everyone has finished picking up cards, check all the cards collected to see whether anyone made a mistake; if so, that player must return the mistaken card and one correctly collected card.&#10;&#10;Players repeat this process six more times, first laying out three more cards from the deck each time, then they see who has collected the most cards and won!&#10;&#10;Manimals includes rule variants that allow for play with children as young as four.&#10;&#10;",
        "artist": "Peter Braun"
    },
    {
        "name": "Pick & Pack",
        "description": "There used to be friendly competition among co-workers at the Apple Factory during Bonus Week, as workers made a special effort to Pick &amp; Pack those crates with quality apples.&#10;&#10;But this year the mechanical arm has broken down...&#10;&#10;Now it takes two people to get it to work. One set of controls operates left and right, the other set operates up and down. Now you are competing directly with your partner to get the most apples. Can you grab the premium apples while leaving your partner with wholesale fodder? Can you exploit a rush order, or throw a wrench in the works? Quality control and order mix-ups also add to the fun.&#10;&#10;In the end, the player with the most apples in their crates wins.&#10;&#10;",
        "artist": "Régis Moulun"
    },
    {
        "name": "A las Barricadas!",
        "description": "On 18 July 1936, various generals in the Spanish army rose up against the government of the Second Republic. The failure of the coup as it had been originally planned gave way to a civil conflict between the defenders of the democratic government and the backers of the military coup. Machado&rsquo;s two Spain's fought each other for nearly three years in a battle which reflected the political and social tensions affecting the world at that time.&#10;&#10;The  opposing armies were very different: on one hand, the Republican army possessed a limited number of professional soldiers and many popular militias belonging to political parties and labor unions. To this were added the International Brigades, formed from foreign volunteers of diverse origin; a fighting force which was highly motivated, but poorly coordinated and typically poorly organized. On the other hand, the Franco&acute;s army had most of the professional military, along with Carlist and fascist militias, many native Moroccan troops, and the volunteers of the Condor Legion and the Corpo Trupe Voluntarie, sent by Hitler and Mussolini, respectively.&#10;&#10;From a military point of view, the Spanish Civil War presaged the global conflict which would soon erupt. In the mid-1930s, military high commands from all over the globe theorized on the possibilities of motorized armies and &ldquo;lightning war&rdquo;. Both Nazis and Soviets rehearsed armored tactics in Spain, and tested various types of weapons. In addition, the importance that air superiority would have on all later conflicts was made clear. All of these elements make the Spanish Civil War a fascinating conflict from an historical point of view and with regard to military strategy.&#10;&#10;To the Barricades!, the first title in the War Storms series, is a game which attempts to simulate, at platoon and company level, the battles which took place on the different fronts of the war. The rules are oriented towards the tactical simulation of combat involving armored vehicles, infantry, artillery, and aircraft, and as such they are especially suited to represent almost any 20th century armed conflict as it actually happened.&#10;&#10;",
        "artist": "Nicolás Eskubi"
    },
    {
        "name": "Kreta 1941",
        "description": "2nd Polish strategy game.&#10;&quot;Kreta 1941&quot; is low-complexity tactic game about German airborne landing on Crete in spring 1941. It comprises a full colour map, counters that need to be cut. Battalion-company scale. Effect of struggle between units can be retreat or elimination. The rules are in Polish.&#10;&#10;",
        "artist": "Zbigniew Kasprzak"
    },
    {
        "name": "WeyKick On Ice",
        "description": "WeyHockey is an updated to the popular and fun Weykick game. The game uses the same board (2-player, 4-player, or 6-player), but uses new pieces that each hold a hockey stick. Now, insetad of a frantic soccer simulation to kick the ball, you must be much more accurate to turn the figures with the magnets to shoot like hockey. WeyHockey makes a good game even more useful by adding a new dimension with just a new set of pieces.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Nomads of Arabia: The Wandering Herds Game",
        "description": "Follow the Pilgrim on the path to Mecca, capturing wild camels, goats, donkeys and horses on the way. The desert shifts -- don't let your herds get lost in the desert! In cities along the way you can sell your animals and find new handlers to help you capture different animals. When you reach Mecca, the Nomad who makes the largest offering to Allah wins the game!&#10;&#10;Choose a first player. Players will take turns in clockwise order. On a turn, you will move your Nomad (or not), use Handlers to capture or call wild animals, shift the desert, or sell your animals in the cities. Nomads must keep moving to avoid being lost in the desert, and the Pilgrim travels constantly toward Mecca. When the players reach Mecca, the Nomad who is able to make the most generous offering becomes most blessed in the eyes of Allah and wins the game.&#10;&#10;72 Dinar cards 43x66mm&#10;&#10;",
        "artist": "Mike Raabe"
    },
    {
        "name": "LovePigs (Porcellini)",
        "description": "LovePigs (Porcellini) is a party fun game, presented as a Prototype at LuccaGames06 in Italy. &#10;In 2007 Post Scriptum published LovePigs, in ModCon 07 the 1st National Tournament. &#10;All PhotoReports on www.warangel.it the designer's website.&#10;&#10;It is a game that tests the feeling between couples, partners may be: dad and daughter, wife and husband, teammates, school friends, co-workers, grandmother and nephew... The more you know about your LovePig, the more you are able to create questions that you are sure your friend answers in the way YOU will recognize, in relationship to answers given by other gamers.&#10;&#10;Since 2010, the card game &quot;Porcellini&quot;, same cards and illustrations, is presented by Angelo Porazzi Games in lots of Italian Fairs with simply rules for Kids, Schools, Families. You can see and read these rules in English on official page of the game&#10;&#10;http://warangel.it/LovePigsE.html&#10;&#10;",
        "artist": "Angelo Porazzi"
    },
    {
        "name": "Clash of Monarchs",
        "description": "The Seven Years War In Europe, 1756-1763&#10;&#10;Clash of Monarchs lets two to four players recreate the titantic struggle that raged across Europe and the world, pitting Frederick the Great&rsquo;s Prussia and its Hanoverian allies against Maria Theresa&rsquo;s Coalition of Austrian, French, Russian, Saxon, Swedish, and Holy Roman Empire forces.  Each player directs the effort of one or more of the major powers, plus their minor allies, using the card-driven operations and point-to-point movement system of many of GMT&rsquo;s most highly-regarded games.  The cards help players enact Frederick&rsquo;s pre-war invasion planning, Austrian minister Kaunitz&rsquo;s diplomatic triumph in the 2nd Treaty of Versailles, the operational ascendancy of Prussian and Hanoverian light troops, formation of the Austrian General Staff, huge financial loans, court intrigue at Versailles, Vienna, and St. Petersburg, and dozens of other key political, economic, and military events.  COM also uses split decks, which foster play of each power&rsquo;s events in two phases -- Early War (usually through mid-1758), and Wider War (1758 to conclusion) &ndash; and allow a multi-player game to use exactly the same rules as a 2-player contest.  COM augments the CDG system with a Colonial Conflict sub-game, a fully-integrated treatment of light unit operations, and a Fortunes of War chit pull, which varies the occurrence and/or timing of events beyond players&rsquo; control each year -- severe weather, desertion, attrition, possible deaths of English king George II, Empress Elizabeth of Russia, et al, and Madame Pompadour&rsquo;s political influence over the French commanders, to add further uncertainty and drama to the campaigns.&#10;&#10;",
        "artist": "Rodger B. MacGowan,Mark Mahaffey,Mark Simonitch"
    },
    {
        "name": "Successors (third edition)",
        "description": "When Alexander the Great died in 323 BC, he left no clear heir to the immense empire he had conquered. It was not long after his death that the Macedonian generals began to war among themselves over who would be the regent or successor to Alexander&rsquo;s empire. By 305 BC they had given up on succession and began to carve out their own kingdoms. Successors III is a four-player game based on those wars.&#10;&#10;Successors was first published in 1995 by Avalon Hill. Some years later a second edition rulebook was published that gave more options for the Tyche cards. Successors III builds on the foundation of the Successors II rules set plus expansion cards that appeared in the Boardgamer. Minor refinements have been made to make the game easier to play and increase enjoyment. The map is very similar to the original with some minor changes around Macedonia. Counters have the same excellent artwork for the generals and new GMT artwork for the combat units and control markers. The Tyche cards have received the most changes&mdash;nearly every card has had some minor modifications and a few new cards have been added.&#10;&#10;In addition to the changes, the rules have been cleaned up and improved. Years of questions and answers on Consimworld have been used to clarify the rules. The rules also include hints on strategy from a number of long-time Successors players, and an extended example of play.&#10;&#10;",
        "artist": "Jean André Castaigne,Rodger B. MacGowan,Kurt Miller,Patrick O'Brien,Mark Simonitch,Eric Williams (I)"
    },
    {
        "name": "Chandragupta",
        "description": "Chandragupta brings the art of war in ancient India to GMT&rsquo;s &ldquo;Great Battles of History&rdquo; Series.  Beginning with Chandragupta Maurya&rsquo;s victories over the Nanda clan, the game follows the brief but rapid rise of the Mauryan dynasty, from Chandragupta&rsquo;s expulsion of Seleucus from the Indus river valley to the conquest of the last independent kingdom on the subcontinent, Kalinga, by his grandson Ashoka.  The Mauryan empire became the largest and most powerful in India&rsquo;s history &ndash; a distinction that would remain unchallenged until the arrival of the Mughals some 1,700 years later.&#10;&#10;Chandragupta simulates the traditional &ldquo;four-fold&rdquo; division of the Indian military system, with the elephant corps reigning supreme, and the hordes of light infantry regarded as little more than fodder for chariots&rsquo; wheels and trampling pachyderms.  Chariots still play a prominent role on the Indian battlefield of the era, but the cavalry, with its versatility and endurance, is a potent competitor.  In Chandragupta, victory goes to the commander who can master the unique aspects of the differing Indian military &ldquo;classes&rdquo; &ndash; the professional, lifelong soldiers called Maulas, the mercenary levies, unpredictable tribal allies, and the militias of the powerful trade guilds.  While Maulas and mercenaries are commanded under a single hierarchical command structure, the tribals and the trade guilds are led by independent chiefs.&#10;&#10;Units include cataphracted elephants, &ldquo;heavy&rdquo; four- (and sometimes eight-!) wheeled chariots, and even an &ldquo;elCH&rdquo; unit &ndash; yes, elephant-pulled chariots.  Rules include Combined Chariot/Infantry and Elephant/Infantry lines, Dharmayudda or &ldquo;just&rdquo; warfare, Guild enmity, and Tribal loyalty.  EL units can even breach camp walls and pull down city gates (if they don&rsquo;t rampage first).&#10;&#10;Fans of GBoH will appreciate the exciting variety in Chandragupta&rsquo;s scenarios, from huge set-piece battles on flat plains, to tribal suppressions, a night assault on a military camp, and street fighting in the city of Takshashila.  Chandragupta is the 13th volume in the series.&#10;&#10;Battles:&#10;&#10;&#10;     Pataliputra (319 BC) &ndash; Chandragupta&rsquo;s mentor, the Brahmin Chanakya, brashly challenges the Nanda dynasty with a cadre of mercenaries.&#10;     Maghada (317 BC) &ndash; Chandragupta again confronts the Nandas, who are this time led by the formidable general Bhadrasala.&#10;     Mayalaketu (317 BC) &ndash; Chanakya attacks the turncoat general Mayalaketu and his rebel army in camp.&#10;     Takshashila (316 BC) &ndash; the Thracian general Eudamus, allied to Indian king Ambhi, defends the city of Takshashila against Chandragupta&rsquo;s assault.&#10;     Gandhara (304 BC) &ndash; former officer of Alexander the Great, now &ldquo;Master of Babylonia,&rdquo; Seleucus I Nicator crosses the Indus river to invade Gandhara, and is confronted by the Mauryan army at the river&rsquo;s banks.&#10;     Revolt in the Provinces (275 BC) &ndash; Chandragupta&rsquo;s grandson, Ashoka, brings a relief force to lift a rebel siege of Takshashila and rescue the aging Chanakya who is holed up in the city&rsquo;s palace.&#10;     Khashas (274 BC) &ndash; Chandragupta&rsquo;s son, Bhindusara, puts down a confederation of the independent Khasha kings with an attack on their mountain strongholds.&#10;     Kalinga (261 BC) &ndash; the most famous battle of the Mauryan era, Ashoka&rsquo;s army attacks the kingdom of Kalinga in a huge &ndash; and bloody -- set-piece battle.&#10;&#10;&#10;",
        "artist": "Mike Lemick,Rodger B. MacGowan,Leland Myrick,Mark Simonitch"
    },
    {
        "name": "PQ-17: Arctic Naval Operations 1941-43",
        "description": "PQ-17 is a 2-player game of World War II air-naval operations in the Barents and Norwegian Seas, where the Allied player strives to pass convoys to and from north Russia in the face of appalling weather and determined opposition from his Axis opponent. PQ-17 highlights the impact of reconnaissance, fuel, and the extreme climate without the drawbacks of a double-blind system or tedious bookkeeping.&#10;&#10;Each of the 1&quot; square ship counters in the game depicts an individual capital ship or cruiser or a group of smaller ships, submarines, or merchant vessels. Virtually every vessel that sailed arctic waters in 1942 is included, along with others that fought (or might have) in key actions. Counters are formatted much like the units in traditional block wargames, allowing step reduction to show damage or reduced numbers without cumbersome markers or rosters. These large counters never appear on the map, however; they remain off-map on players' Task Force Displays until battle is joined.&#10;&#10;Instead, players maneuver blocks on a mapboard stretching from Greenland and Ireland to Kiel and the Kara Sea. Each block is a force of submarines or surface ships, its identity hidden from the enemy player until it is located by a successful search and the block is turned up. It may represent one ship or one hundred - or none at all, as it may be a dummy. Reconnaissance is critical, as you must locate the enemy in order to attack him. Cards are used to resolve searches quickly and efficiently: a successful search yields intelligence of varying accuracy, while failure to relocate the enemy in a timely manner results in lost contact and generation of another dummy.&#10;&#10;Players must also cope with fuel restrictions, reflecting limited endurance (particularly for destroyers) and Axis shortages. Simple rules and the use of markers on the Task Force Displays preclude the need for record keeping while preventing unrealistic freedom of action.&#10;&#10;To show the key role of air power in the campaign, PQ-17 also includes over 100 air units. Circular counters represent RAF Coastal Command and Fleet Air Arm squadrons and Luftwaffe Staffeln and Gruppen that participated in naval operations in the theater, as well as selected air defense units. Many VVS air regiments are also included, along with the USAAF squadrons that defended Iceland.&#10;&#10;Because the focus of the game is operational, battles are fought on an abstract Combat Display. Simple procedures and multiple Combat Results Tables reproduce historical levels of damage from all forms of combat: submarine attacks, antisubmarine warfare, bombing and aerial torpedo attacks, anti-aircraft fire, air-to-air combat, and naval surface actions.&#10;&#10;PQ-17's environmental model is based upon historical meteorological and oceanographic records to accurately reflect the extreme conditions and their effects. Summer operations, conducted in round-the-clock daylight, play much differently than those undertaken in the near-total darkness of winter. The polar ice pack advances and ebbs with the seasons, varying the sea routes available and posing a hazard for naval forces venturing too close. And besides each other, players must also battle some of the worst weather in the world, potentially damaging their ships and affecting movement, searches, and combat.&#10;&#10;PQ-17 features nine historical scenarios, including all the major actions of the campaign: the Fleet Air Arm torpedo attack on Tirpitz, the decimation of convoy PQ-17, the climactic battle of PQ-18, the Battle of the Barents Sea, and the 1943 Battle of North Cape. To add uncertainty, each side is subject to a special condition in every operation, which may impose additional requirements or restrictions - or afford additional opportunities - while remaining secret from the opponent. Just like their historical counterparts, Allied players can never be certain that the Germans will not attempt to break out into the Atlantic with one or more heavy ships, and Axis players must beware of a possible attack on Norway; both players may face conflicting priorities and demands that must be met with limited resources. In addition, a 1942 &quot;random&quot; scenario enhances replay value by further disguising starting forces and objectives. Each operational scenario can be played to conclusion in 3-4 hours, and for players seeking a richer experience, a 1942 campaign scenario reflects the challenges of continuing operations over the course of this key year.&#10;&#10;Game Components&#10;&#10;&#10;     One 22x34&quot; map &#10;     58 15mm blocks &#10;     140 1&quot; square counters &#10;     140 1/2&quot; square counters &#10;     136 circular counters in three sizes &#10;     80 cards &#10;     One 24-page Rule Book &#10;     One 20-page Scenario Book &#10;     Two 11x17&quot; + one or two 8.5x11&quot; Play Aids &#10;     Two 8.5x11&quot; Task Force Displays &#10;     One 8.5x11&quot; Battle Display &#10;     Five 10-sided Dice &#10;&#10;&#10;Old Home Page at Publisher: http://www.gmtgames.com/pq17/main.html&#10;New Home Page at Publisher: http://www.gmtgames.com/p-126-pq-17.aspx&#10;&#10;",
        "artist": "Nicolás Eskubi,Charles Kibler,Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "Dragon Parade",
        "description": "Dragon Parade is a simple game by Reiner Knizia which is played on a small, beautifully decorated board depicting Chinese New Year fireworks in and around the Forbidden City.&#10;&#10;Players alternate playing cards to move the dragon pawn back and forth along the street in front of the Forbidden Palace:  red cards to move it one direction, yellow to move it the other.  Each player gets a random hand of six movement cards and will play only four of them before the dragon's final position is settled.&#10;&#10;Players individually deploy their three pawns (&quot;street sellers&quot;) somewhere along the red/yellow number line, one at a time after each of the first three cards played, in the effort to be nearest to the dragon once it stops moving.  Then coins (VP) are collected by each street seller depending on proximity to the dragon, the top payoff of 5 going only to the pawn on the exact same space.&#10;&#10;You play as many hands as there are players, with each player going first once.  It's a game of groupthink and should move pretty quickly once everyone gives in to the idea that it's not an exact science!&#10;&#10;",
        "artist": "Josh Cappel"
    },
    {
        "name": "Cold War Commander",
        "description": "Cold War Commander is a wargame that allows you to re-create battles from the First Indo-China War right up to the present day using miniatures on a tabletop. Command anything from a company right up to a division and get a result in 2-3 hours. Suitable for any scale miniatures from 2mm right up to 28mm and no re-basing required.&#10;&#10;The rules come as a 140-page A4-sized bound book with over 60 full color pictures. These feature real miniatures as you see them on the gaming table. You also get a double-sided A4-sized quick reference sheet.&#10;&#10;The main features of the game include:&#10;&#10;&#10;     Command system that emphasizes the fog of war in a simple but effective manner.&#10;     The same mechanism for casualty resolution throughout.&#10;     Rules for infantry, tanks, artillery, aircraft, helicopters, missiles, engineers and fortifications.&#10;     Flexible figure ratio meaning a base of infantry represents either a section or a platoon.&#10;     Minimal set-up time - simply assemble your forces and play.&#10;     Unique points system that allows for unequal forces but an equal chance of victory.&#10;     33 well-presented army lists for 28 nations covering 12 conflicts.&#10;     16 generic scenarios suitable for any nation &amp; theater plus a simple campaign system.&#10;     Suitable for solo, 2-player &amp; multi-player games at home, club, or tournament.&#10;     One double-sided quick reference sheet included.&#10;     No supplements - all you need to play in one book.&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Boxers or Briefs?",
        "description": "From the back of the box:&#10;&quot;Grab some friends and get ready for rounds of laughter as each player is put on the hot seat.  The hilarity begins when you have to choose from the wild &amp; wacky statements your friends pick to describe you.  Will they reveal hidden quirks or will you all share a good laugh at their absurd choices?&#10;&#10;This easy-to-learn game will get the party started!  More than 2000 unique and funny phrases provides hours of entertainment&quot;&#10;&#10;Each turn a new player will roll a die and then everyone else choose a card from their hand based on the line the dice rolled.  The player then chooses the funniest and the truest.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "High School Drama!",
        "description": "Play as a student in a high school drama. Hook up with other students, spread vicious lies and rumors about your rivals and pretend to bond with your fake friends. Earn yearbook signatures by going to special events like homecoming and sci-fi movie openings or by earning student standouts like cutest couple and most artistic. Each player controls one main student but quickly forms a growing clique by hooking up with other students and organizations. Everyone starts as freshmen, but only the player who has the most yearbook signatures at the end of graduation wins!&#10;&#10;Nominated as an ORIGINS AWARDS finalist for Best Non-Collectible Card Game of 2006.&#10;&#10;",
        "artist": "Chris Kennedy"
    },
    {
        "name": "Rome At War III: Queen of the Celts",
        "description": "From the Avalanche Press website:&#10;  &#10;Rome at War: Queen of the Celts&#10;&#10;In the year 43 AD, Roman legions splashed ashore in Kent, unopposed by the Britons led by Caractus, who had sworn to repel them. The Emperor Claudius had dispatched Aulus Plautius and 45,000 men to conquer the mist-covered island where Julius Caesar had failed almost a century earlier.&#10; Over the next 40 years, Roman would clash with Celt in a series of battles that neither realized would determine the future of Western civilization.  The Romans broke the Britons, whose furious courage could not match Roman discipline. The island would pass under Roman rule for the next several centuries, implanting a Latin-oriented culture and shoving Celtic ways to the very fringes of Europe. All that would remain were their legends; not least among them the fiery leadership of Boudicca, warrior-queen of the Iceni and resolute enemy of Rome.&#10;&#10;The Rome at War series covers Roman battles against both their neighbors and each other. The first game, Rome At War I: Hannibal at Bay, covered the last battles of Carthage&rsquo;s favorite son. The second, Rome at War II: Fading Legions, focused on the empire&rsquo;s latter years, when it was beset by barbarian invasion, an implacable rival, and civil war.&#10;&#10;Rome at War: Queen of the Celts is the third installment in the series. Rome has outstanding heavy infantry, good light cavalry (provided by her allies) and even an elephant. The Britons depend on the fury of their Celtic charge, and also chariots and slingers. Plus they have Druids to help inspire them. &#10; There are nine scenarios, or game situations, included in Queen of the Celts.&#10;&#10;&#10;",
        "artist": "Beth Donahue,Lorenzo Sperlonga"
    },
    {
        "name": "Homesteaders",
        "description": "Homesteaders is an auction and resource management game in which players bid on the opportunity to build certain types of buildings, then spend resource cubes to build one of several buildings of that type. The buildings confer abilities, income, and points; some automatically and some requiring a worker.&#10;&#10;The game lasts ten rounds, with each round consisting of an auction phase followed by a building phase. After the last round, players take one final income phase and have one last chance to buy and sell goods and use their building abilities before scores are tallied.&#10;&#10;Players score for their buildings, bonuses conferred by buildings, and points earned throughout the game from selling resource cubes. The player who builds the best combination of buildings and best manages the nine different resources in the game will score the most points and win &ndash; as long as they don't take on too much debt!&#10;&#10;",
        "artist": "Hans Janssen,Ariel Seoane"
    },
    {
        "name": "Xēko Mission: Madagascar",
        "description": "X&#196;&#147;ko (pronounced &quot;zeeko&quot;) is a collectible card game which has four editions (referred to as &quot;Missions&quot;). These are Mission: Madagascar, Mission: Costa Rica, Mission: Indonesia, and Mission: China. Each Mission highlights common and endangered plants and animals from in the region, and cards from all Missions can be mixed together.&#10;&#10;In X&#196;&#147;ko, each player's objective is to create the strongest, most balanced environment. The game begins with a Hotspot card on to which players can link their &ldquo;Species&rdquo; cards. Players link Species cards with other Species cards and battle other players in &ldquo;Turf Wars&rdquo; in order to collect &ldquo;Eco-points&rdquo; before one of the player&rsquo;s decks runs out of cards. In addition, &ldquo;Boost&rdquo; cards aid the players in Turf Wars, and &quot;X&#196;&#147;ko&quot; cards may help or hurt players in acquiring additional Eco-points by permitting changes to the standard game rules. When a player&rsquo;s deck is depleted, each player counts the Eco-points on his or her cards and the player with the most points wins.&#10;&#10;Each Mission: Madagascar Starter Set includes 2 endangered Cards, 10 Rare Cards, 2 Hotspot Cards, 36 Common Cards, 1 Extra Large Play Mat, 2 Learn-to-Play Guides, and 1 Rule Book. X&#196;&#147;ko cards are made from 100 percent recycled materials and 4 percent of game net sales are donated to Conservation International.&#10;&#10;It should be noted that it is not necessary to purchase a starter set  (around $20 to $30) to play the game. Booster packs (around $4) are just fine for building a deck, and contain a greater variety of cards - including Hotspot cards.&#10;&#10;",
        "artist": "Ed Andres,Dean Beagle,Michel Gagné,Bo Geddes,Beth Gonzales,Mike Gorman,Jordan Kotzebue,Travis Kotzebue,BJ Nartker,Ed Pun"
    },
    {
        "name": "Forceball",
        "description": "Forceball is a fast and futuristic sport card game for 2 players. Each match consists of three periods. A period starts with a face-off to decide who's the attacker and who's the defender, and then progresses with the players taking turns either attacking or defending. The period ends when all cards in the deck have been used, and the deck is then reshuffled for the next period.&#10;&#10;During a period the attacker uses his attack maneuvers &ndash; Pass, Dribble or Shot &ndash; to try to score a goal. The defender uses his defense maneuvers &ndash; Block, Tackle or Interception &ndash; to try to prevent a goal. If the attacker scores a goal or the defender intercepts the ball, the roles are reversed and the game continues.&#10;&#10;In addition to the regular attack and defense maneuvers, the players can use special maneuvers to score a lucky shot or intercept the ball using the goalie. It's also possible to foul by making illegal maneuvers, but beware &ndash; you don't want the referee to see you.&#10;&#10;Forceball consists of 56 cards and is a complete game in itself, not a trading card game. The game is easy to learn, easy to carry around in your pocket, and a period takes less than 15 minutes. It's suitable both as a filler and for lengthy tournaments.&#10;&#10;",
        "artist": "Lukas Thelin"
    },
    {
        "name": "Tannenberg 1914",
        "description": "The Russo-German battle of the I World War. The game comprises a full colour map, counters need to be cut. The rules are in Polish.&#10;&#10;Expanded by:&#10;&#10;&#10;     Ba&#197;&#130;kany 1912 (Balkans 1912)&#10;     Galicja 1914 (Galicia 1914)&#10;&#10;&#10;Related Microbadges&#10; Dragon fan&#10;&#10;",
        "artist": "Zbigniew Kasprzak"
    },
    {
        "name": "The Really Nasty Motor Racing Game",
        "description": "From the publisher's web site:&#10;&#10;&quot;No driving ability needed - only those prepared to plot, scheme, and make bitter enemies of their closest friends will take the road to victory. Only the downright devious will triumph!&#10;&#10;Conjure up a spot of wet weather just as your opponent leaves the pit lane with dry weather tires, or cause a failure in their pit crew's equipment. Increase your chances with a craftily-placed oil spill, or decide to give the leading driver a puncture as they near the finish line.&#10;This is no ordinary race... this is a Really Nasty race!&quot;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Monopoly: Star Wars Limited Collector's Edition",
        "description": "A game where becoming the wealthiest player by buying, renting, and selling property will win the game. Set in a galaxy far far away.  You can choose to represent the Rebel Alliance, by playing Luke or Leia, Han Solo, Chewbacca, or R2-D2.  You can choose to represent the Galactic Empire by playing Darth Vader, Boba Fett, or a Stormtrooper.  The components of the game include brass imperial coins, and very nice pewter characters.  Instead of houses, star wars vehicles stake your claim on property, including x-wing fighters, TIE fighters, Corellian Freighters and Star Destroyers.  May the Force Be With You!!!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Shenandoah: Jackson's Valley Campaign",
        "description": "From Columbia website:&#10;&#10;Shenandoah covers the remarkable Valley Campaign of May/June 1862. Led by Thomas 'Stonewall' Jackson, a smaller Confederate army with audacious marching and fighting, paralyzed and defeated three enveloping Union armies. Military students worldwide study Jackson's strategy and tactics to this day.&#10;&#10;The CSA player has the advantage of central position, but must use it aggressively to prevent the Union armies from combining against him. The USA player has a clear advantage in numbers, but must cope with a command system that penalizes the wide separation of his three forces.&#10;&#10;",
        "artist": "Tom Dalgliesh,John Paul Strain"
    },
    {
        "name": "Ukraine '44",
        "description": "Ukraine &lsquo;44 is a simulation game that focuses on one of the pivotal moments of the Soviet Winter Offensive in Ukraine in 1943 and 1944.&#10;&#10;Over the course of a week, the Axis 1st Panzer Army was cut off and encircled by strong Soviet forces of the 1st and 2nd Ukrainian Fronts and like its brothers at Stalingrad and Korsun, expected to be destroyed. In what would called the battle of the Kamenets-Podolsky Pocket (or Hube&rsquo;s Pocket), the Germans would fight and claw their way out and finally escape. Hube&rsquo;s successful operation to escape encirclement is still studied to this day as a model of how to breakout from a pocket.&#10;&#10;Ukraine '44 is part of the International Games Series (IGS) from Multi-Man Publishing (MMP).&#10;&#10;Originally published in Special Ops magazine issue #2 (Winter 2012).&#10;&#10;Game Scale:&#10;Turn: 2 days&#10;Hex: 3.1 miles / 5 km&#10;Units: Division to Corps&#10;&#10;Game Inventory (Special Ops #2 edition):&#10;One 22 x 34&quot; full-dolor mapsheet&#10;One dual-side printed countersheet (280 1/2&quot; counters)&#10;One 8-page Ukraine '44 rule booklet&#10;&#10;",
        "artist": "François Vander Meulen,Sawshun Yamaguchi"
    },
    {
        "name": "Panzerblitz: Hill of Death",
        "description": "Panzerblitz: Hill of Death: The Battle for Hill 112, Normandy 1944, covers the epic battle between British &amp; German forces for the dominant terrain feature, Hill 112 and the control of Normandy. Take command of Infantry and Armor units to control key terrain features on Hill 112 and the surrounding countryside. This battle waged for over 4 weeks with the hill and surrounding objectives changing hands several times.&#10;&#10;This is not the PanzerBlitz of the 70's, but rather a modernized system which uses many of the core concepts of PanzerBlitz while removing some of the 'gameyness' of the original system.&#10;&#10;Panzerblitz: Hill of Death is the first game in the Panzerblitz 2 series from Multi-Man Publishing&#10;&#10;Game Scale:&#10;Turn: 15 minutes&#10;Hex: 273 yards / 250 meters&#10;Units: Platoon&#10;&#10;Game Inventory:&#10;One 22 x 32&quot; full-color mapsheet&#10;Three dual-side printed countersheets (352 5/8&quot; counters &amp; 140 1/2&quot; counters)&#10;One 18-page Panzerblitz: Hill of Death rules booklet&#10;One dual-side printed Player Aid card&#10;Four dual-side printed Scenario cards&#10;&#10;",
        "artist": "Nicolás Eskubi"
    },
    {
        "name": "Space Junkyard",
        "description": "Space has become a giant dumping ground for jettisoned components and derelict spacecraft.  But the tide could be turned by clever star pilots hoping to expand their tiny ships.  Navigating through a sea of asteroids and recyclable parts, pilots collect resources and salvaged ship modules in a quest to build the largest and most complete starship. (From the first paragraph of the revised game instructions)&#10;&#10;",
        "artist": "Orlando Ramirez"
    },
    {
        "name": "Machina II: Przeładowanie",
        "description": "&quot;Machina II: Przeladowanie&quot; is a re-edition of very popular  game called &quot;Machina&quot; published in 2002 in Poland. Every player is an Engineer working on his unique prototype. The aim of the game is to construct your own prototype using particular Elements (tiles) listed on your Prototype Card. Lack of Elements in game makes players steal and sabotage each other on almost every turn!&#10;&#10;",
        "artist": "Adam Hammudeh"
    },
    {
        "name": "Von 0 auf 100",
        "description": "From the game:&#10;&#10;Vrrrm, the racing cars set off at full throttle! Due to oil stains they risk skidding. Who, by bluffing, good tactics and a bit of luck, will cross the target line first? A zippy circuit competition for 2-5 racing drivers. With warm-up variation for younger players.&#10;&#10;Appropriate for ages 6 and up.&#10;&#10;Habermaa&szlig; / HABA Game# 4492&#10;&#10;Other titles:  Full Speed Ahead!, Go 0 to 100, A toute vitesse,  Van 0 tot 100.&#10;&#10;Rules available in German, English, French, Dutch.&#10;&#10;",
        "artist": "Oliver Freudenreich"
    },
    {
        "name": "Kragmortha",
        "description": "From the website of the publisher:&#10;&#10;Oh clever goblins, will you be able to avoid the wrath of the Dark Lord (Rigor Mortis, the Master of all Evils) while he wanders in his study? Terrible spells will be cast upon those who are hit by the glances of the Dark Lord!&#10;&#10;Kragmortha is a party game for 2-8 players that will be afflicted by exhilarating penances. No one will resist its humor!&#10;&#10;BEWARE! This game produces physical penances and is nocive (definition of nocive is : Hurtful or injurious) to the health!&#10;&#10;Kragmortha shares artwork with Aye, Dark Overlord! The Red Box&#10;&#10;",
        "artist": "Mad4GameStyle"
    },
    {
        "name": "Escalation!",
        "description": "Players in Escalation! want to collect as few cards as possible. Each player starts with a hand of six cards from a deck that contains cards numbered 1-13, three jokers that can be worth 1-7, and two &quot;pass&quot; cards. One player opens by playing a single card or multiple cards with the same value, then calls out the sum of the cards played. The next player &mdash; and each player after that &mdash; must play cards to surpass that sum or else collect all of the cards played so far, after which they open with one or more cards. As soon as one player is out of cards, everyone else adds their cards in hand to the cards that they've collected and tallies their score.&#10;&#10;After playing as many rounds as the number of players at the table, whoever has the lowest score wins!&#10;&#10;",
        "artist": "Beth Trott,長谷川 登鯉 (Tori Hasegawa)"
    },
    {
        "name": "The War Game: World War II",
        "description": "Fans often call it &quot;Axis and Allies on Steroids&quot;.  The rules and mechanics are similar enough to Axis and Allies, but there are a few differences and additions.  The game, like Axis and Allies, covers the entire war from a strategic level with areas corresponding mostly to countries, with larger countries broken down.  The map is a gargantuan 4' x 8' with eight major powers dividing up the non-neutral world (Germany, Italy, Japan, Russia, UK, USA, China, and France)&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Ladybohn: Manche mögen's heiss!",
        "description": "Amigo's Ladybohn: Manche m&ouml;gen's heiss! (Some like it hot!) is a standalone game, which is the marriage of Bohnanza and the Ladybohn expansion, with babies added to the mix.&#10;&#10;This game features 112 cards, which include reworked distributions of the basic beans from Bohnanza:  For instance, in Ladybohn: Manche m&ouml;gen's heiss!, there are still 6 Gartenbohnen, but now 4 are male, 1 is female, and 1 is a baby; there are 21 Blauen Bohnen, 11 of which are male, with 5 females and 5 babies.  As with Ladybohn, the female beans have better beanometers than the male beans, so if you harvest a field with a lady on top, its worth is greater.  The new babies have no beanometer, meaning that harvesting a field topped by a baby is worthless; however, when a baby is planted in a field, a female bean in the field can ascend past two cards, so the babies can bring the superior females where they are needed most.&#10;&#10;Part of the Bohnanza family of games. It is now included in the stand-alone expansion Bohnanza: Ladies & Gangsters.&#10;&#10;",
        "artist": "Björn Pertoft"
    },
    {
        "name": "Moai",
        "description": "Easter Island is a tiny triangular speck of land at the eastern edge of Polynesia in the middle of the Pacific Ocean. The island has fascinated travelers, mystics, and scientists for years as people have wondered how such a small, isolated area could have been home to a society that created the world's most spectacular outdoor museum. In the 1940s, Norwegian archeologist Thor Heyerdahl sailed the reed boat Kon-Tiki from South America to Easter Island to show that the technology available made it possible for Polynesia to be settled from the Americas. In the 1970s, Erich Van Daniken popularized the idea that the world was visited by ancient astronauts and the beautiful and enormous stone statutes, the Moai, of Easter Island were used as some of his &quot;evidence.&quot;&#10;&#10;Today, scientists around the world generally agree that Easter Island was settled from other Polynesian islands to its west, and the extreme culture that produced hundreds of stone Moai is related to other cultures in the region. The history of the island is a history of constraint, and the carving of the Moai, the rapid deforestation of the island, and the limited food sources available all worked together to build an extreme culture that became the victim of its own consumption. In this way, Easter Island today represents more than just a wonderful place to travel, but also is a reminder of the greater resource limits of our entire planet. As populations continue to grow and we put further strains on sources of fuel and food, are we heading toward the same fate that this small island suffered hundreds of years ago? The island today is owned by Chile, and the small population thrives with a few weekly flights to mainland South America and the occasional cargo ship visit.&#10;&#10;Moai is a game that closely follows the developments and excesses of the island until the arrival of Dutch Admiral Jacob Roggeveen, the first European to discover the island and name it for the day of his discovery. Combining many of the historical features of the island's culture in an exciting and well-playing strategic game, players can have fun reliving the dramatic history of this exciting little island.&#10;&#10;",
        "artist": "Lars Grant-West,Cyril Van Der Haegen"
    },
    {
        "name": "Kingdom Hearts TCG",
        "description": "Kingdom Hearts is a Japanese trading card game based on the the video game Kingdom Hearts.  In this game, you fight against the forces of evil and darkness.  In order to do so, you call on allies from the worlds of Final Fantasy and Disney.  With their help, you can overcome the hordes of &quot;heartless&quot;, evil minions of darkness and despair.&#10;&#10;Home Page: http://www.fantasyflightgames.com/kingdomhearts/&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Dorn",
        "description": "Dorn is a fantasy strategic role-playing game. One of the players is the Dorn Keeper, who each turn spawns various new monsters. Five heroes need to battle the monsters, collect three sacred artifacts and finally defeat the Dorn Keeper.&#10;&#10;The game uses no dice in combat (a hero kills a weak monster, wounds a stronger one; more than one monster is needed to wound a hero), has superb graphics and includes variety of options and skills to ensure replayability - players can choose from nine heroes, various items can be found on the board, some passages are randomly blocked, the Dorn Keeper can cast different special spells in each game, etc.)&#10;&#10;Both heroes and the Dorn Keeper can advance in levels, thus gaining new skills (heroes by gaining experience from slain monsters, Dorn Keeper by causing enough wounds to heroes).&#10;&#10;Home Page: http://www.dorn.cz (Czech)&#10;&#10;",
        "artist": "Jan Dřevíkovský,Jana Šouflová,Tomáš Zahradníček"
    },
    {
        "name": "Container",
        "description": "Container is a game about big ships and big production.  Each player will play both as a producer and shipper of goods.  Players will decide which products they want to produce, and which of the OTHER players' goods they want to ship out to a remote island.  During these phases, players will be able to set the prices for their goods and try to maximize their cash!&#10;&#10;Once the goods have reached the island, players will play the part of the purchaser for their tiny island. Players bid for the goods arriving each day by ship, and the highest bidder collects these goods for conversion into points at the end of the game.&#10;&#10;Sounds simple?  It is! But the real challenge is turning your home production into goods for your island.  Your government is willing to subsidize your purchases, but just how much money do you want to give to your competitors for that lovely crate of goods your island desperately needs?&#10;&#10;Online Play&#10;&#10;     Boardspace.net (real time, AI option)&#10;&#10;&#10;&#10;&#10;",
        "artist": "Mike Doyle (I)"
    },
    {
        "name": "1989: Dawn of Freedom",
        "description": "&quot;History punishes those who come too late.&quot; - Mikhail Gorbachev&#10;&#10;1989: Dawn of Freedom is an exciting, fast paced game simulating the end of the Cold War in 1989. During this amazing year, a series of democratic revolutions ended the 40 year Soviet empire in Eastern Europe. 1989 simulates the political, social and economic aspects of these revolutions using a card-driven system similar to Twilight Struggle.&#10;&#10;&quot;No man is so old he cannot live one more year.&quot; - Leszek Kolakowski&#10;&#10;One player plays the Communist. At the start of the game he holds unquestioned power across the six nations of the Warsaw Pact. But there are ominous clouds on the horizon. The new leader in Moscow has declared no more will Soviet tanks prop up tottering Communist governments. The economies, after decades of central planning and stagnation, have reached various stages of crisis. Inside the churches and among the students and their professors there are dissident movements that have been emboldened. From crushing dissent to offering concessions, the Communist player will have to use a variety of strategies in a struggle to hold on to his empire.&#10;&#10;&quot;A bad regime is never in so great danger as when it tries to improve.&quot; - Alexis de Tocqueville&#10;&#10;The other player plays the Democrat. At the dawn of 1989, behind the iron curtain, no one considers revolution possible. The goal of dissidents is to create a civil society outside the control of the Communist regimes. On their side are students who are fascinated with the style and pop culture of the west, and the Church. Against them is the vast apparatus of the Communist state. Their challenge is to persuade the workers, who are the bulk of society, to join their cause.&#10;&#10;&quot;Mr. Gorbachev, open this gate. Mr. Gorbachev, tear down this wall!&quot; - Ronald Reagan&#10;&#10;",
        "artist": "Donal Hegarty,Rodger B. MacGowan,Leland Myrick,Mark Simonitch"
    },
    {
        "name": "China: The Middle Kingdom",
        "description": "A Britannia-like game set in China, covering Chinese history from 400 BC to today.&#10;&#10;From the publishers website:&#10;&#10;&quot;In this epic game, four players each control several countries simultaneously, with each country having their own objectives and situations, earning points for reaching various objectives, such as conquering certain provinces. The winner is the player who scores the most points at the end of the game.&#10;This is a breathtaking game, unfolding on an illustrated map of China and over 400 separate army pieces, covering over 40 separate countries and peoples, all of the major dynasties of Chinese history, the arrival of the European powers, both World Wars and the invasion of the Japanese, right up to the present day situation, with the Communists in Mainland China and the Nationalists in Taiwan. The game occurs over 24 turns, each about 100 years long, starting from 403 BC, during the &quot;Warring States&quot; period as China begins to rise from its feudal age.&quot;&#10;&#10;",
        "artist": "Callie Cummins,Joe Youst"
    },
    {
        "name": "Veritas",
        "description": "Game description from the publisher:&#10;&#10;Veritas is a Euro-style board game about the preservation of truth in Dark Ages France. Each player represents some &quot;truth&quot; that's trying to be preserved for posterity by diligent book-copying monks. Players place and copy book tokens in monasteries, then pick up stacks of books and spread them around France. Each turn, a monastery will burn down, and the books in it may be destroyed. After the monasteries have burned down, players can move through them, so travel on the board gets faster as the game progresses. When scoring chips are drawn, each player whose ideology dominates a region scores points. The first player to score 100 points wins, becoming the dominant truth as the Dark Ages end.&#10;&#10;",
        "artist": "James Ernest"
    },
    {
        "name": "Duel in the Dark",
        "description": "From the publisher's website:&#10;&#10;World War 2 air combat game depicting the nighttime air raids of British bombers hitting German cities.&#10;&#10;As the head of the British Bomber Command, you plan the attacks on Germany in order to undermine the morale of the civilian population. Or as a General of the German Air Force (Luftwaffe), you defend using your ace squadrons and organizing an effective civil defense.&#10;&#10;The gameboard enables you to set up countless variations of these historic events. You play as many nights as you wish - each night takes 30-45 minutes to resolve.&#10;&#10;Immerse yourself in the strategic and tactical thinking needed to survive in those dark times.&#10;&#10;Gameplay allows for easy entry into the action with some advanced rules for the hearty wargamer. The game rules include weather conditions, full moon/new moon bonuses and penalties, clouds and thunderclouds, fog, flak, searchlights, balloon barriers, target markers, and much more.&#10;&#10;The British player secretly plots the course of the bomber while the Mosquito acts as escort or decoy. The German player tries to figure out where the bomber is going, making sure to efficiently use the fuel to get as many hits on the bomber as possible.&#10;&#10;",
        "artist": "Friedemann de Pedro"
    },
    {
        "name": "Bomber Command",
        "description": "(from GMT website:)&#10;&#10;The Night War Over the Reich, 1943-1945&#10;&#10;&quot;We all love him; he's so bloody inhuman.&quot;&#10;- A 5 Group squadron commander on Sir Arthur 'Bomber' Harris&#10;&#10;March 1944. More than 700 British bombers are dispatched to the distant city of N&#194;&#129;&#194;&#129;&uuml;rnberg. As the bomber stream crawls across the German Reich, it is set upon by swarms of nightfighters. Following the bombers' contrails the figthers infiltrate the stream in great numbers and before the moon can set they pick off bomber after bomber. The mauled stream makes a desultory attack on the target city, scattering much of their payload of high explosive and incendiaries harmlessly into the surrounding countryside. Then the raid struggles bak towards England while fresh formations of nightfighters snap and bite at the retreating formation. More than ninety bombers fail to make it home safely. Soon afterward, the C-in-C of Bomber Command, Arthur &quot;Bomber&quot; Harris, calls off the Battle of Berlin.&#10;&#10;BOMBER COMMAND is a game of the night war in the skies over the Reich in World War II.&#10;The game recreates the great RAF bombing raids against the heart of Germany and the defence of the German Luftwaffe's night fighter arm.&#10;&#10;Based on an air combat system derived from the award-winning Downtown and The Burning Blue 'raid-scale' games, Bomber Command details the tactics of night fighting.&#10;&#10;The German player must manage flak, Himmelbett zones, Wild Boar and Tame Boar tactics. RAF 'main force' raids are supported by Mosquito diversions, &quot;Gardening&quot; operations (mining of seaways) and decoy raids. Two card decks--one for each player--are used to resolve the complex interactions of electronic countermeasures and radars, along with other operational factors such as Mahmoud patrols, Flower raids, and Beleuchter illumination units. A detailed bombing resolution system depicts the difficulties of marking targets and area bombing at night.&#10;&#10;There are two scenarios:&#10;&#10;1. Berlin covers raiding from the 1943 Hamburg firestorm to the great Battle of Berlin and the RAF's defeat over Nuremburg in March 1944.&#10;&#10;2. Downfall recreates the period from the Summer of 1944 to the collapse of the Luftwaffe in the face of fuel shortages and the RAF's &quot;bomber support&quot; effort.&#10;&#10;The game is fast-playing and raids typically resolve in 2 hours or less.&#10;&#10;COMPONENTS&#10;&#10;    One 8.5&quot; x 11&quot; Play Aid Card (2-sided)&#10;    One 8.5&quot; x 11&quot; Bombing Card (2-sided)&#10;    One 8.5&quot; x 11&quot; Planning Map (2-sided)&#10;    One sheet of 5/8&quot; counters &amp; markers&#10;    One sheet of 1/2&quot; counters &amp; markers&#10;    Four 8.5&quot; x 11&quot; City Map Sheets&#10;    One deck of 55 British cards&#10;    One deck of 55 German cards&#10;    One Rule book&#10;    One Play book&#10;    Two 22&quot; x 34&quot; maps &#10;&#10;&#10;&#10;&#10;DESIGNER: Lee Brimmicombe-Wood&#10;MAP &amp; COUNTER ART: Lee Brimmicombe-Wood&#10;AIRCRAFT ART: Ian Wedge&#10;&#10;",
        "artist": "Lee Brimmicombe-Wood,Rodger B. MacGowan,Ian Wedge"
    },
    {
        "name": "Animalia",
        "description": "This game was designed and then published as a contract order from a Swiss insurance company ASSURA SA. It is intended to promote one of their product, ANIMALIA, an insurance for pets and animals.&#10;&#10;One of the goals set early in the process was to design a &quot;real game&quot;, not a mere advertising product, playable with the whole family. That's how the game ended up being playable for 2 to 6 players, age 7 and up. It's a light card game, which is enjoyable among adults and children alike, the latter ones having a chance of winning thanks to the luck factor induced by card-drawing.&#10;&#10;&quot;You're determined to be awarded the title of Best Breeder and you have three season to win as many medals as you can with your show animals. But beware, your opponents are all trying to do the same thing and they certainly won't hesitate to use their animals' special powers to spoil your plans. Stay alert, keep an eye on your opponents' animals as well as your own - and see who gets to the top of the medal table!&quot;&#10;&#10;The players are animal-breeders who compete to present the finest collection of show-animals over the&#10;course of 3 seasons and each season is split into 3 phases.  In the first phase, players take turns drafting 5 animals into their collection.  In the second phase, players compare the elegance of their animals by counting the stars at the top of their cards.  Bonuses are awarded to the 2 players with the most elegant animal collections.  Medals are awarded in phase 3 at the end of each season.  Players earn animal medals for having multiple animals of the same family, or 5 different animals. The breeder with the highest number of medals at the end of the third season is declared the winner!&#10;&#10;",
        "artist": "Mathieu Leyssenne"
    },
    {
        "name": "J'te Gage Que...",
        "description": "J'te Gage Que... (aka, I Betcha...) can be played during almost any other social activity, including another game.&#10;&#10;At the start of the game, each player receives a card that features three challenges, e.g., &quot;Speak three sentences in a foreign language&quot; or &quot;Suck your thumb for 30 seconds&quot;. Players agree on an ending time for the game, perhaps 1-2 hours, then each player must perform or act out his three challenges during that time in a subtle manner, but with witnesses. If no one says anything for 30 seconds after a player has completed a challenge, he can whip out his card and show everyone the challenge he's just performed. This nets him a number of points specified on the card for that challenge.&#10;&#10;If, however, another player says, for example, &quot;I bet you had to suck your thumb&quot; and the guesser is right, then the guesser earns two points; if she's wrong, she loses one point.&#10;&#10;Whoever has the most points at the end of the game wins.&#10;&#10;Can be integrated with:&#10;&#10;    J'te Gage Que... 2&#10;&#10;&#10;&#10;&#10;",
        "artist": "Stéphane Crépeau,Heiko Eller,Olivier Fagnère"
    },
    {
        "name": "Kingsburg",
        "description": "In Kingsburg, players are Lords sent from the King to administer frontier territories.&#10;&#10;The game takes place over five years, a total of 20 turns.  In every year, there are 3 production seasons for collecting resources, building structures, and training troops.  Every fourth turn is the winter, in which all the players must fight an invading army.  Each player must face the invaders, so this is not a cooperative game.&#10;&#10;The resources to build structures and train troops are collected by influencing the advisers in the King's Council.  Players place their influence dice on members of the Council. The player with the lowest influence dice sum will be the first one to choose where to spend his/her influence; this acts as a way of balancing poor dice rolling. Even with a very unlucky roll, a clever player can still come out from the Council with a good number of resources and/or soldiers.&#10;&#10;Each adviser on the King's Council will award different resources or allocate soldiers, victory points, and other advantages to the player who was able to influence him/her for the current turn.&#10;&#10;At the end of five years, the player who best developed his assigned territory and most pleased the King through the Council is the winner.&#10;&#10;Many alternate strategies are possible to win: will you go for the military way, disregarding economic and prestige buildings, or will you aim to complete the big Cathedral to please the King?   Will you use the Merchant's Guild to gain more influence in the Council, or will you go for balanced development?&#10;&#10;",
        "artist": "Mad4GameStyle"
    },
    {
        "name": "Age of Discovery",
        "description": "Not to be confused with Age of Empires III: The Age of Discovery.&#10;&#10;In Age of Discovery the players supply famous expeditions of well-known explorers like Columbus and Magellan with their ships. They have to purchase these ships and cleverly direct them to the most successful expeditions. Of course, they need a lot of money for this! The players receive income by accepting trade assignments with their ships. In the end, the player who received the most victory points by assigning ships to expeditions and fulfilling his special contract wins the game.&#10;&#10;From the publisher (Phalanx Games B.V.):&#10;&quot;During the 15th and 16th centuries, the great royal houses of Europe sent explorers and conquerors all over the world, hoping to discover and secure new areas of influence and sources of wealth. Without the right naval vessels, these voyages would have been impossible. But even the incredible wealth of the royal houses could not sustain these expeditions for long. So they were happy that private entrepreneurs were ready to finance these expensive journeys. Now your king has come to offer you the opportunity to invest in the great voyages of famous explorers like Columbus and Magellan. You will need to purchase a fleet of ships, and assign them to the most successful expeditions. Of course, you will need a lot of money! To earn money, you must fulfill trade contracts. Can you balance the needs of trade with the demands of the great explorers? It is time to seek wealth and glory in the Age of Discovery!&quot;&#10;&#10;",
        "artist": "Harald Lieske,Koen Wijffelaars"
    },
    {
        "name": "Ponte del Diavolo",
        "description": "Ponte del Diavolo by Martin Ebel is a game that honors both game designer Alex Randolph and Twixt, one of Randolph's most enduring designs.&#10;&#10;In this tactical 2-player placement game (ostensibly set in Venice, but this is an abstract), players place wooden squares to build &quot;islands&quot; and then attempt to connect them with bridges. Sounds simple, but it's not. With strict rules governing island size and bridge placement, Ponte del Diavolo becomes a tight game of positioning. Much like Randolph's Twixt, the need to think several moves ahead is critical to out-maneuvering your opponent.&#10;In honour of the late Alex Randolph (1922 - 2004), who passed away in Venice, there is a picture of him on the box of the game.&#10;&#10;Online Play&#10;&#10;     Boardspace.net real time, AI option&#10;     Yucata (turn-based)&#10;     http://www.brettspielnetz.de (German: turn based on a bigger board: 12x12) direct link&#10;     Jijbent.nl (Dutch: turn based on a bigger board: 12x12)&#10;     YourTurnMyTurn.com (English: turn based on a bigger board: 12x12)&#10;&#10;&#10;&#10;&#10;",
        "artist": "Julien Delval,Christof Tisch"
    },
    {
        "name": "Vikings",
        "description": "Vikings is a fast economic game.  Despite the nominal &quot;Viking&quot; theme, no actual exploration or pillaging is involved.&#10;&#10;The resources in the game consist of coins and several types of ship tiles, island tiles and meeples.   In each of 6 rounds, a random set of 12 tiles and 12 meeples becomes available.  Players take turns buying and placing pairs of meeples and tiles.   There is no direct player interaction, only indirect contention for resources during the buying phase.&#10;&#10;The most unusual aspect of the game is the pricing wheel, which pairs meeples with tiles and sets their prices.&#10;&#10;",
        "artist": "Harald Lieske,Michael Menzel"
    },
    {
        "name": "Bananagrams",
        "description": "A Scrabble-like game without the board -- much like Pick Two!, but without the letter values.&#10;&#10;Using a selection of 144 plastic letter tiles in the English edition, each player works independently to create their own 'crossword'. When a player uses up all their letters, all players take a new tile from the pool. When all the tiles are gone, the first player to use up all the tiles in their hand wins.&#10;&#10;There are also variants included in the rules, and the game is suitable for solo play.&#10;&#10;",
        "artist": "Sandy Nathanson,Aaron Nathanson"
    },
    {
        "name": "Silent Death: The Next Millennium Deluxe Edition",
        "description": "From the publisher website:&#10;&#10;Silent Death: The Next Millennium is an exciting, quick-playing, and easy-to-learn table-top game of star fighter combat set against the backdrop of a disintegrating high-tech empire in the far future.&#10;&#10;The universe of Silent Death: TNM is our own future 9,000 years from now. Space travel is common for those species that hold the technology, and humans have come to live on hundreds of worlds all across the Orion arm of our galaxy.&#10;&#10;This Deluxe Box Set allows for a wide diversity of weapon types, crew quality, and tactical situations. Exciting new features include ship-building rules that allow you to design ships from scratch and 24 updated, beautifully illustrated ship designs.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "AtmosFear: Khufu – The Mummy",
        "description": "Treasure, tricks or trouble - is this your lucky night?&#10;&#10;Atmosfear: Khufu - The Mummy is an amplified experience in home entertainment.  With its unique combination of board game and interactive DVD, this game of chance and skill is a race against time.  Once you press play you only have 45 minutes to lay down all your scarabs then take on the Great Pharaoh himself in Khufu's ultimate challenge.&#10;&#10;Race around the board to collect treasures, and face the challenges in each of the four Chambers of the Great Pyramid, where fortunes are won and lost at the roll of the dice.&#10;&#10;With interactive game play, random selection that ensures a different game every time, and awesome atmospheric digital surround sound and picture, this speedy, spooky, spectacular DVD board game promises hours of fun and laughter for players 12 years and over.&#10;&#10;So come on in and match wits with your host, the fiendish pharaoh Khufu.  He really wants you to win!&#10;&#10;Or does he...??&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Owner's Choice",
        "description": "Owner's Choice is an economic game in which the players must look to manipulate the stocks of four companies by trying to buy low and sell high. The players that own the most stock in a company assume the role of the President, with other players assuming the role of investors.&#10;&#10;Owners have greater control over the fortunes of their companies' stock and they can make great profits but can also lose big as well. Importantly the Owner of a company can sell it for the market price at game end, whereas Investors can only make money by earning dividends, which are far less than the company price. As the game unfolds the players must decide how best to make money and potentially undermine some companies to reduce the fortunes of their competition.&#10;&#10;The game's length is dictated by a pawn that moves around the board, which is a square similar to Monopoly. The players have some control over how many spaces the pawn can move in each turn, and the kind of space it lands on allows for a variety of things to happen.&#10;&#10;Once the pawn reaches the Goal square it is time for Owners to sell their companies and Investors to cash in their stocks for dividends. The player with the most money wins the game.&#10;&#10;",
        "artist": "Gou Ikeda,Hiroyuki Imahori,Yosuke Yamaguchi"
    },
    {
        "name": "Venedig",
        "description": "N&uuml;rnberg 2007 release for 2-5 players aged 10 and above. Contents: 86 swamp tiles, 42 buildings, 42 building cards, 20 treasure tiles, 5 gondolas, 4 builders, 1 board, 1 rules booklet.&#10;&#10;The players use cards to construct buildings in Venice, which is one way of advancing their respective gondolas.&#10;In addition, players collect treasure tiles if they place a building in a district adjacent to their gondola, and drain swamps to collect swamp tiles. Swamp and treasure tiles can also be used to advance a player's gondola. At the end of the game, the player whose gondola has moved the farthest, wins.&#10;&#10;Online Play&#10;&#10;&#10;     BrettspielWelt (real-time)&#10;&#10;&#10;",
        "artist": "Oliver Freudenreich"
    },
    {
        "name": "Portobello Market",
        "description": "London, 1901. At the world famous Portobello Market, the goal in the morning is to secure the best places to build stalls. Try to place your stalls in the most lucrative manner, cut off your opponents, and grab the most profitable alleys for yourself. You can build only where the Bobby stands&mdash;but a little cash will make the Bobby stand where you want him to!&#10;&#10;East India Railway was the prototype title for this game, and it became Portobello Market when published by Schmidt.&#10;&#10;",
        "artist": "Michael Menzel,Christof Tisch"
    },
    {
        "name": "Danger 13",
        "description": "The active player each turn draws cards from the deck equal to the number of players but does not look at these cards. He then turns one card face-up and gives it to one of the players, including himself; he repeats this process until each player has received exactly one card.&#10;&#10;Each card includes a number from 0 to 5&mdash;the lower the better&mdash;and might also have an action or victory points! Each time a player receives a card, he checks to see whether his total equals 13 or more. If it does, each other player receives VPs from his own cards. The unlucky player with the total of 13 or more discards all his cards.&#10;&#10;Possible actions on the cards include veto cards (in order to say no to a card in the future), 13 --&gt; 18 (raising your bust total to 18), lose your last card, and receive 1 or 2 VPs immediately.&#10;&#10;The German title of the game translates into English as 'That takes the biscuit'.&#10;&#10;",
        "artist": "Sebastian Lohfert"
    },
    {
        "name": "Caylus Magna Carta",
        "description": "The general theme and mechanics of Caylus Magna Carta are similar to the Caylus board game. However, there is no board or score track and the tactical nuts and bolts of the game are somewhat different. In terms of components, the game consists of cards, money, worker pawns, resource markers, the provost, and castle building stones. Each player has a set of identical cards, which are shuffled and used as a face-down draw deck. Players start with an opening random draw of cards, and on his turn a player can either:&#10;&#10;&#10;    extend the road by building a new building &#10;    pay 1 to draw a new building card &#10;    pay 1 to discard his hand and draw a fresh hand (with the discard deck being shuffled for a new draw deck once the draw deck is exhausted) &#10;    pay 1 to place a worker on one of the existing building cards &#10;    build one of the common prestige building cards (some of which are placed at the beginning of the game as part of the setup) or &#10;    pass&#10;&#10;&#10;Once everyone has passed, the cards are resolved up to the provost (which can be moved in passing order by paying money).&#10;&#10;Ownership of the non-common buildings is shown by the card color. When a worker is placed on a card, the owner earns either resources or money as a reward instead of victory points. Players may also choose to help build the castle. Starting with the first player to have passed, players can pay resources to obtain castle stones. The stones are worth three different values (2-4 points). Players collect the most valuable ones first. In addition, the player who collects the most building stones each round is rewarded with a gold resource marker.&#10;&#10;From round to round, 1st player privileges rotate to the left, and the provost starts two cards further down the path from the castle.&#10;&#10;The winner of the game is the player who has accumulated the most victory points once the game end has been triggered the turn the castle is finished. Victory points are awarded for castle stones, cards built, and resources and money in hand at the end of the game.&#10;&#10;",
        "artist": "Arnaud Demaegd"
    },
    {
        "name": "Origo",
        "description": "Description with permission from www.boardgamenews.com-&#10;&#10;&quot;Europe, about 400 CE. Harsh customs rule the day. Five courageous tribes have set out to conquer new lands: the Huns, the Langobardens, the Goths, the Anglo Saxons, and the Vandals. As you seek new settlement areas for your tribe, you'll strengthen it by enlarging clans, establishing or conquering new countries, and building a powerful sea presence. Whoever scores the most points will stand far ahead of others on the tribe leader path and win the game.&#10;&#10;Origo is a family game for 2-5 players from ages 10 and up, in which luck and tactics are mixed well. Depending on the number of players, the game duration is 30-90 minutes.&#10;&#10;The flow of the game is driven by cards on the one hand (expanding, attacking) and by the movement of figures on the boards on the other (hiking, sailing). The player whose turn it is carries out the following actions in any sequence: expanding, attacking, hiking, sailing. Whoever occupies the final field in a country founds that country and receives points. There are further points in three large tribe evaluations during the game for the largest tribes, control of the seas, and control of the countries. &#10;Contents: gameboard, scoreboard, 5 tribe leaders, 188 tribe shields (in five colors), 12 foundation stones, 1 action stone, 2 short rule sets, instructions.&quot;&#10;&#10;The game is, in many aspects, very similar to Captain Future&#10;&#10;Home Page: http://kramer-spiele.privat.t-online.de/neuerscheinungen/origo.htm (German)&#10;&#10;",
        "artist": "Daniel Reeve"
    },
    {
        "name": "Alchemist",
        "description": "It's a contest of cubes and numbers!  Define a recipe of 1-5 cubes and you're awarded 2 cubes (according to the square where you define it) and you're awarded 1-10 VP (according to your choice of the numbers 1-10 that remain).  Henceforth anyone who duplicates that recipe gets the same 2 cubes and the same VP while paying you 1 cube from your recipe -- but you can never duplicate your own recipe.  Except for the 1 cube paid to the originator of the recipe, cubes used making recipes are out of the game, and the game ends when there are only two colors left in the general supply.&#10;&#10;That's the basic scramble for points, plus an end-game bonus for the player who had the most success getting his secret cube color out of the game.&#10;&#10;Online Play&#10;&#10;&#10;     Yucata (turn-based)&#10;&#10;&#10;",
        "artist": "Volkan Baga"
    },
    {
        "name": "Bungee",
        "description": "From the Amigo website:&#10;Play a card and draw a card&mdash;it's that simple. Whoever has at most five points in her hand can call &quot;Bungee&quot; and has...almost won. In the end, though, the winner is the player with the fewest points.&#10;&#10;",
        "artist": "Haim Shafir"
    },
    {
        "name": "Smart Ass",
        "description": "Smart Ass the board game is the ultimate fun trivia game for 2 to 12 players, where everybody plays every turn, the game doesn't labor on for hours, and even if you are a &quot;Dumb Ass&quot;, you can win!&#10;&#10;Smart Ass is an all play game. With every question asked, every player can yell out the answer at any time and as soon as they think they know the answer.&#10;&#10;There are four question categories: Who am I? Where am I? What am I? and Hard Ass! The 500 questions are formulated into lots of clues. The clues get easy as the question is being read out, but don't wait too long to answer, as the first person to yell out the right answer, wins the round and moves closer to the Smart Ass. If you yell out the wrong answer, then you are out of that round and have to wait 'till the next question is asked.&#10;&#10;Beware of the &quot;Dumb Ass&quot; and &quot;Kick Ass&quot; squares, as penalty awaits!&#10;&#10;The first person to land on the donkey's butt is declared the &quot;Smart Ass&quot;.&#10;&#10;Smart Ass was created by Rob Elliott, the long time host of Australian Channel Seven's &quot;Wheel of Fortune&quot;. So come and enjoy the real Aussie flavor of this inclusive and fun, but still competitive game&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Dragon Ball Z CCG",
        "description": "The Dragonball Ball Z CCG was created by Score and had a good number of expansions or sets before finally dying.&#10;&#10;All players start the game with a character from the series, called the main personality. Each main personality character usually has three levels, to a maximum of five. Throughout the game, the main personality can get stronger via gaining anger, replacing the previous version played.&#10;&#10;Decks are divided into seven different styles: Blue, Red, Orange, Black, Saiyan, Namekian and Free-Style. Each style focuses on a different aspect of combat. For instance, the Red style focuses on gaining anger, while the Namekian style focuses on life and energy. If a player uses nothing but one color or style in his or her deck, the player would be able to declare a Tokui-waza at the start of the game, allowing various benefits, such as certain cards allowing additional powers, as stated in the card's text box.&#10;&#10;Later expansions allowed you to play Mastery cards that allowed abilities that always stayed in play. Sensei cards were also eventually introduced, allowing for sideboards to cater against one's opponent.&#10;&#10;There are three ways to win the game. First is to reduce your opponent's deck to zero cards. Second is to win via having the most powerful personality, via gaining anger. This win condition may sometimes be not available, depending on who one's main personality is. Third is to play or capture, all seven Dragon Balls. Again, this win condition may sometimes be unavailable, depending on how decks are constructed.&#10;&#10;The bulk of the Dragon Ball Z CCG focuses on combat. Players alternate as attacker and defender. Attacks are divided into physical and energy attacks. Physical attacks reduce the opponent's power levels, eventually dealing life damage. Energy attacks deal damage directly, but usually costs two power levels to perform. Players must strike a balance between offense and defense, as cards are discarded from one's deck upon taking damage, making it possible for a certain card to be discarded from play, even before being used.&#10;&#10;The game was criticized to be highly random and greatly dependent on having better cards than one's opponent, as opposed to simply being the better player. Nonetheless, the tournament scene was quite popular during the game's existence, and the secondary market remains strong even after the game has died out.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Activity 2",
        "description": "New edition of the well known party game Activity where you have to describe words verbal, pantomimic or by drawing. This edition comes with 2500 new ideas. The board has been redesigned and the rules slightly changed. Now you can choose from three different card stacks which allow you to move 3, 4 or 5. Your opponent has to go back one space when you reach the same field.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Galactic Emperor",
        "description": "Galactic Emperor is a fast paced empire-building game of exploration, conflict, and struggle for dominance. The last Galactic Emperor has met with a sudden and quite fatal accident.  Now there is a power vacuum in the galaxy, and you&rsquo;re one of the Planetary Dukes who wants to fill it.  Each player controls a space sector with a home planet, and for a time, shares the power of the galactic throne.  During the fight for control, the central Omega Sun is heading toward collapse&hellip; a cataclysm that will only accelerate the chaos!&#10;&#10;The game plays over several rounds, and within each round, the roles players choose determine what happens next.   There are 7 different types of roles:  Explorer, Steward, Merchant, Engineer, Warlord, Regent, and Scientist. All players get a turn to act during each role.  Players discover planets, gain resources, build ships, and attack space fleets in a desperate effort to grind foes into cosmic dust!&#10;&#10;The player with the most victory points at the end of the game wins, becoming the ultimate Galactic Emperor!&#10;&#10;Designer:&#10;Adam West&#10;&#10;Contents:&#10;&#10;Board and rules&#10;1 Full Color Galaxy Board&#10;1 Rule Booklet&#10;&#10;Ships (74 plastic ships)&#10;48 Small sized Fighters&#10;24 Medium sized Cruisers&#10;12 Huge sized Dreadnoughts&#10;&#10;Resource Cubes (94 wooden cubes)&#10;40 Food Resource Cubes (green)&#10;36 Metal Resource Cubes (blue)&#10;18 Energy Resource Cubes (yellow)&#10;&#10;Hexagon Tiles&#10;38 Sector Tiles&#10;&#10;Counters&#10;6 Home Starbase Tokens&#10;66 Colorful Empire Tokens&#10;66 Victory Chits (value 1, 3, 5 - dark blue)&#10;70 Galactic Marks Chits (value 1, 5 - silver &amp; gold)&#10;&#10;Cards&#10;1 Direction Card&#10;1 Throne Card&#10;6 Ship Reference Cards&#10;6 Storage Facility Cards&#10;7 Unique Role Cards (Merchant, etc.)&#10;12 Technology Cards (Robotics, etc.)&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Bloom",
        "description": "In Bloom, gardeners strive to gather various flowers to make beautiful bouquets.  The challenge is that each gardener can only afford the space to plant one type of flower.  Of course, a gardener could just take what he needs from his neighbors' flowers.  Naturally, that means that he must jealously guard his own fields, as well.  Each gardener has an animal, and the two of them defend their garden's fields from unwelcome harvests.&#10;&#10;Each player has nine field tiles, each three parcels by three parcels in size.  Each parcel can be cultivated with its matching flower, or simply plowed instead.  Players harvest flowers by covering them on theirs or others parcels with their own field tiles, which are placed partially overlapping the existing field tiles.&#10;&#10;A winner of the 2006 Concours International de Cr&#195;&#169;ateurs de Jeux de Soci&#195;&#169;t&#195;&#169; (as La Bonne Soupe).&#10;&#10;",
        "artist": "Alexandre Roche"
    },
    {
        "name": "The Very Hungry Caterpillar Card Game",
        "description": "Discover the magical world of Eric Carle through The Very Hungry Caterpillar Card Game! &#10; Players of all ages will enjoy this intriguing game (all while learning the days of the week!) which follows the caterpillar as he eats his way through fruits and party foods and , just like in the book , turns into a beautiful butterfly!&#10;&#10;Children practice their fine motor, counting and color recognition skills as their caterpillar game pieces eat their way across the board&#10;&#10;Perfect for preschoolers, their parents and teachers'&#10;&#10;Includes:&#10;54 Very Hungry Caterpillar Cards &#10;Instructions&#10;&#10;",
        "artist": "Eric Carle"
    },
    {
        "name": "Vineta",
        "description": "In Vineta, 2 to 6 players take on the roles of angry Norse Gods, seeking to sink the city of Vineta beneath a succession of pounding waves. However, each player is secretly assigned one of nine city districts to protect. Likewise, each player secretly protects one color of houses.&#10;&#10;By use of cards, players send waves against districts, joining together to sink them and moving houses in and out of threatened districts. At the end of each round, the district that has the most waves played against it &mdash; along with any houses in that district &mdash; are removed.&#10;&#10;After eight rounds of play, only one district (and any houses it contains) will remain. Players score for houses claimed during the game, and bonuses are given to whoever was secretly protecting the remaining district and its remaining houses, if any.&#10;&#10;",
        "artist": "Martin Hoffmann,Tomasz Larek,Claus Stephan"
    },
    {
        "name": "Island Fortress",
        "description": "In Island Fortress, you play a master builder chosen by Governor Cortland Hansen to help construct the mighty Fort Aldenford using the penal colony on Alcott Island. Your goal is to become the most distinguished architect with the help of your Taskmaster, Workers, and the Governor himself!&#10;&#10;In the game, all players use identical decks of five Role Cards to plot their actions such as purchasing workers, building the wall, collecting money from the treasury, and more. In addition to scoring points for having built the majority of blocks on each row of the fortress wall, players can also gain various bonuses for completing favors for the Governor by building the walls in specific ways, following the Governor's preferred patterns.&#10;&#10;Island Fortress, formerly known as Huang Di and sporting a Great Wall of China theme, won the first ever ProtoSlam competition held by Cambridge Games Factory in August 2006 and is the first published game by designer Bryan Johnson.&#10;&#10;",
        "artist": "Cody Jones,Dann May"
    },
    {
        "name": "Zooloretto",
        "description": "In Zooloretto, each player uses small, large, wild, and exotic animals and their young to try to attract as many visitors as possible to their zoo &ndash; but be careful! The zoo must be carefully planned as before you know it, you might have too many animals and no more room for them. That brings minus points! Luckily, your zoo can expand. A zoo of a family game in which less is sometimes more...&#10;&#10;Can be combined with&#10;&#10;&#10;     Aquaretto&#10;     Zooloretto Mini&#10;&#10;&#10;",
        "artist": "Design/Main,Annemarie van Lierop,Marianne Riem,Michael Schacht"
    },
    {
        "name": "Hit or Miss",
        "description": "Sharpen your pencils - and your intuition - for this quick playing &quot;think-in-sync&quot; party game. Draw a category card and in 45 seconds, list as many related words that come to mind. When the timer runs out, roll the die - if it lands on HIT, pick a word that you think everyone wrote; if it lands on MISS, pick one that only you wrote. Choose wisely and score big points. The player with the highest score wins. Hit or Miss - the cant MISS game that will turn your next party into a HIT!&#10;&#10;2007 Mensa Select&#10;&#10;",
        "artist": "Tim Weiffenbach"
    },
    {
        "name": "Numbers League: Adventures in Addiplication",
        "description": "From the Publisher:&#10;A Superhero themed math based standalone card game for ages 8 and up.&#10;&#10;Villains lurk in the streets of Infinity City and the only hope is the Numbers League. Assemble your team of Superheroes, use the sum of their incredible powers and ingenious devices to capture as many villains as you can.&#10;&#10;Numbers League - Adventures in Addiplication is a stand alone superhero themed card game where your basic math skills can save the day. The more you play the sharper these skills will become until no villain is safe from your numerical onslaught.&#10;&#10;Included in the box are 24 double-sided Villain cards (different values on each side), 21 Device cards, 75 Superhero body part cards (25 heads, 25 chests, and 25 legs), four note pads and a 16-page full-color rules booklet with instructions in English, German, French, and Spanish.&#10;&#10;Note&#10;The current printing comes in a much smaller box, omitting the note pads and replacing the rule book with an English-only full-color trifold.&#10;&#10;",
        "artist": "Ben Crenshaw,Chris Pallace"
    },
    {
        "name": "Code Cracker",
        "description": "You have to crack the safe codes by throwing dice to earn victory points. Each safe card is worth 2 through 5 points. The player with the most points at the end of the game wins.&#10;&#10;When it is your turn you throw all 5 dice. You have to put at least one dice aside. The pips of this dice tell you on which number you can put a marker on one of the three revealed safe cards.&#10;&#10;Now you have to decide to stop or go on. If you go on you throw the remaining dice and have to put at least another dice aside and so a counter on a safe card. &#10;If you stop you can take a safe card on which all code numbers are covered by markers.&#10;&#10;If you throw only pits that are not on a revealed safe card your turn ends immediately and you get no safe card.&#10;&#10;Re-themed by:&#10;&#10;    IGOR: The Monster Making Game&#10;&#10;&#10;&#10;&#10;",
        "artist": "Celia Johnson"
    },
    {
        "name": "Pictionary: 15th Anniversary",
        "description": "The main difference between this edition and the regular edition of Pictionary is the &quot;Challenge Die&quot;.  The Challenge Die may be used at the start of your turn to change the way you must draw.  These special dice components can make you:&#10;- Draw 2 pictures in less than 1 minute.&#10;- Draw with your eyes closed.&#10;- Draw a picture using only one line (don't lift your pencil).&#10;- Draw with your 'off hand' (righties use their left hand, and vice versa).&#10;- Play with the regular rules&#10;&#10;A nice change of pace for those who like this classic drawing game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Pictionary: 20th Anniversary",
        "description": "There are two main differences between this edition and the regular edition of Pictionary: the &quot;Challenge die&quot; and &quot;Fun phrase&quot; cards.&#10;&#10;The Challenge die is rolled at the start of each turn to change the way players must draw.  The possible challenges are:&#10;- Draw 2 pictures in less than 1 minute.&#10;- Draw with your eyes closed.&#10;- Draw a picture using only one line (you cannot lift your pencil).&#10;- Draw with your 'off hand' (righties use their left hand, and vice versa).&#10;- Play with the regular rules&#10;&#10;The Fun phrase cards have common phrases on them, but are more challenging to draw.  On any turn, the Picturist (the person drawing) may choose to play one of the Fun Phrase cards instead of the regular cards.  If the team guesses correctly, they may add two points to their next roll of the standard die.&#10;&#10;A nice change of pace for those who like this classic drawing game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Talisman (Revised 4th Edition)",
        "description": "Theme:&#10;&#10;Talisman is an adventure board game set in a high fantasy medieval world.  Players have 14 characters to choose from all based on role playing archetypes, such as heroes, wizards, villains, thieves, monsters, etc.  The game makes players feel they are traveling the world to find equipment, weapons, ancient relics, and companions that will help them on their quest to acquire the Crown of Command.  Along the way they visit various locales in the worlds, battle each other and fantastic creatures to make their way to the top.&#10;&#10;Goal:&#10;&#10;Each player is trying to move from the outer world and ultimately to the inner world. Players wander the outer, middle, and inner worlds trying to acquire equipment, weapons, and companions.  They will also improve statistics with equipment, companions, and encounters and battles with fantasy creatures and each other.  Once they complete a Talisman quest, players will enter the inner world and face its challenges to finally reach the Portal of Power to claim the Crown of Command.  Then the other players must race to stop this player before he eventually kills them all with the Command spell.&#10;&#10;Gameplay:&#10;&#10;To begin, players select a character card from among the 14 provided.  Characters have basic statistics to start.  These are Life [hit points], Strength [physical prowess], and Craft [Magic and Intelligence].  Some characters are naturally more gifted in combat and others in magic, while others are mix of the two.  Additionally characters are often differentiated with unique abilities, starting equipment, and starting spells.  This all makes the players actually feel different during play.  In addition items and companions players acquire during play also add to statistics, increasing Strength, Craft, Life or adding new abilities, etc.&#10;&#10;Actual game play is relatively simple, making the game easy to pick up with novices.  On a player's turn they throw a die for movement.  Player then chooses which direction, left or right, or if meeting qualifications may be able to move from outer to middle world, or middle to inner world.  Once on space, player follows instructions on space, or encounters face up cards already in space, or other player if in space.  Most spaces have a player draw a number of cards to encounter.  These can be creatures, companions, weapons, equipment, treasure, or relics.  Players must fight creatures and win before acquiring any other items or companions.  If another player is in the space, players may attack with either Craft or Strength but are not required to do so.  The defender defends with same statistic attacked with.  If the defender loses, he loses a life and an item or companion of attackers choice.  If the attacker loses, he loses a life.&#10;&#10;Players start in the outer world, and build up their character's statistics and items to try and move to the middle world.  There are two ways to move up to the middle world, one requiring a test of strength and the other a boat man's ride for a price.  Once in the middle world, play proceeds in the same manner, but the challenge generally is increased with more threats such as the desert and temple.  However, there is more potential for encounters and items as most spaces now draw more than one card.&#10;&#10;In the middle world, players may also acquire a Talisman quest, that once completed, will grant them a Talisman.  The Talisman is required to unlock the Crown of Command and pass through the Portal of Power in the Inner World.&#10;&#10;Once players have a Talisman and have enough Strength or Craft to enter the Portal of Power, they will try to enter the Inner World.  There they must face and survive the guardians there, like the Vampire's Tower and Werewolf before claiming the Crown of Command.  Once a player claims the Crown of Command, they can cast the Command Spell, automatically forcing a player to lose a life.  It then becomes a race for the Crown as the other players try to take the player with the Crown down before he finishes them all off.&#10;&#10;Revised using:&#10;&#10;    Talisman Upgrade Pack&#10;&#10;&#10;&#10;&#10;",
        "artist": "Massimiliano Bertolini,Ralph Horsley,Jeremy McHugh,WiL Springer,Sean Turtle"
    },
    {
        "name": "Warhammer Fantasy Battle: Battle For Skull Pass",
        "description": "Similar to the &quot;Battle Of Macragge&quot; set for Warhammer , the Battle for Skull Pass is an introductory set for Warhammer Fantasy Battles, but it is a stand alone game, with Dwarf and Goblins. It comes with dice, templates, measuring sticks, 2 armies, scenery, a pocket rulebook, and a Scenario book.&#10;&#10;From the Games Workshop online store:&#10;&#10;&quot;Re-enact the infamous Battle for Skull Pass, where resolute Dwarfs and sneaky Night Goblins clash for the possession of ancient mines. This boxed game Contains two complete armies - Goblins and Dwarfs - and several introductory scenarios, allowing you to start playing straight away.&#10;&#10;The starter booklet provides an excellent entry-point into the world of fantasy battles. New players will find easy to follow examples for all the main parts of the Warhammer game, as well as profiles for all the models in the box. The 144-page pocket-sized rulebook is a useful resource for all hobbyists. All the information you need to play the game is right here. This boxed game contains over 100 Citadel Miniatures, a pocket-sized rulebook, starter booklet, dice, templates and scenery.&quot;&#10;&#10;Reimplements&#10;&#10;    Warhammer (7th Edition)&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Apache",
        "description": "Each player controls a small Indian tribe, made up of Hunters, Maidens, Warriors and Chiefs. The Indians want to claim as much booty as possible. So the Hunter, for example, keeps an eye out for buffalo, while the Maiden collects necklaces etc.&#10;&#10;Players take turns revealing one of the prairie cards in the middle of the table and players may play a hand card that can claim booty placing it as quickly as possible onto the Pow-Wow board. If nobody chooses to play a hand card, then players continue to take turns revealing prairie cards until someone chooses to play a hand card, interrupting the revealing of prairie cards.&#10;If the player plays a correct card he may claim a booty. &#10;If a player plays a hand card with which he could not have claimed any booty, then he must give up&#10;the top two cards in his victory pile.&#10;&#10;After the last prairie card has been revealed, all players have one last chance to try and claim booty.&#10;Thereafter, the game is over. Each player counts the cards in his victory pile. The player with the most cards wins.&#10;&#10;",
        "artist": "Studio Mattigatti"
    },
    {
        "name": "Nacho Loco",
        "description": "Challengers will outwit, out score and out match opponents to be crowned champion of this spicy new strategy game.&#10;&#10;The object of the game is to acquire points by getting rid of all your unique triangular (tortilla chip!) cards while blocking opponents from doing the same.&#10;&#10;Each player is dealt six cards, and a card from the deck is flipped to create a playfield. Opponents place their three-sided cards in the playfield by matching colors. There are three segments on a card, which may include colors, actions, or an unmatchable Black X. Action cards including &ldquo;Skip Next&rdquo;, &ldquo;Opponent Draws Three&rdquo;, and &ldquo;Go Again.&quot; If you cannot play, you draw a card; if you match 2 or 3 sides of your card the other players draw 1 or 2 cards. The field is Closed when no plays are possible. The player Closing then deals a card to each opponent and starts a new playfield. The first player to discard all cards is awarded one point per card remaining in their opponents' hands. First player to 20 points wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "1936: Guerra Civil",
        "description": "1936 Guerra Civil (1936 civil war) is a card game in which each player plays one of the sides in the conflict, either the Republic or the Nationalists. A player must design his deck from the cards available for his side (a pool of over one hundred), with a minimum selection of 36 of them. Besides the cards belonging to one of the two sides, there are cards representing political and military objectives, for which the sides fight. Each objective gives victory points to the player who wins them. Victory can be achieved by military victory points, by political victory points, by a combination of the two of them or by the demoralization of the enemy.&#10;&#10;The game is for two players, although some possible variants for four players are also provided.&#10;&#10;There are different types of cards: objectives (political or military), characters, military units and management cards. Each side is made up of factions (ten factions for the Republic and eight factions for the Nationalists). A side may also benefit from having appointed a leader if certain conditions are met.&#10;&#10;All cards have images from public Spanish archives and contain detailed historical information.&#10;&#10;(A note on the language barrier: it's not as big as it seems. If your first language is French, Italian or Portuguese most game terms will be either the same or very similar. Even with English there are many easily understandable text parts. Additionally, all game text and rules are available to download in French and English from the game's website).&#10;&#10;Game components:&#10;&#10;     252 unique cards&#10;     4 game boards (one for each side, one for managing military objectives and one for managing political objectives)&#10;     24 small markers to be used on the boards&#10;     1 rulebook 36 pages long, plus two additional double-side reference sheets&#10;&#10;&#10;&#10;&#10;The game was slowly developed between 2000 and 2006 and it was finally self-published by the author himself through Ediciones Rotura as a limited and numbered edition of 1936 copies, being released in Madrid on December 29, 2006.&#10;&#10;The game entered the BGG ranking on July 18th 2007 (anniversary of the outbreak of the war).&#10;&#10;A small expansion ('Guernica') was released in September 2009 through Spanish magazine ALEA (#33). Several Print&amp;Play expansions have been released since October 2009 linked to the game reaching certain milestones: number of fans in Facebook, number of distributed games, presence during gaming events.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Ultimate Werewolf: Whitebox Edition",
        "description": "This edition is out of print as of September 2008 and has been replaced by Ultimate Werewolf: Ultimate Edition&#10;&#10;Ultimate Werewolf is a group game/activity where each of the players take on secret roles in a village that's being terrorized by werewolves. Some of the players are werewolves, many are plain, simple villagers, but many players have special abilities, such as being able to tell who is a werewolf and who isn't, and the Magician, who can save or kill any other player instantly. Each night the werewolves eat a villager. Each day, the village convenes and attempts to lynch one of their own, trying to find the werewolves that are secretly living among them.&#10;&#10;The Ultimate Werewolf: Whitebox Edition package from Bezier Games makes this game easier to play than ever before, and supports up to 31 players! Ultimate Werewolf: Whitebox Edition includes a number of components to make your games faster, more intriguing, and more fun than ever before:&#10;&#10;31 Sleeved Player Cards: These lavishly illustrated full-color cards contain the name of the role and a short description of that role's abilities. There's no confusion as to what each card is and what that role does. Each player card comes in a plastic sleeve with a sliding insert that covers the card face. There's no chance of accidentally flipped, dropped, or otherwise revealed cards.&#10;&#10;Getting Started with Ultimate Werewolf Guide: This handy guide provides information and advice about everything related to setting up and moderating an Ultimate Werewolf game, from how to set up the chairs for the players to how to keep the game moving along.&#10;&#10;Player Reference Cards: 30 full-size reference cards with a complete role listing and explanation on one side, and a detailed walk-through of the gameplay on the other.&#10;&#10;Moderator Reference Cards: Reference cards for the Moderator with a detailed walk-through (including what to say at each step of the game) on one side, and role identity charts to fill out during the first night - never get confused over who is the hunter or any other role!&#10;&#10;Role Suggestion Card: A handy reference card that suggests the right mix of werewolves, villagers, and special roles for players in any number from 7-31.&#10;&#10;Name Card Tents: Included are 30 name card tents so all players can address each other by name; great for large groups, visitors, and team-building events.&#10;&#10;The Amulet of Protection: One player secretly has an Amulet of Protection that will prevent him from dying one time. At night he may pass the Amulet to another player. Any role may have the Amulet, which is a smaller card that is inserted between the role card and the sliding insert.&#10;&#10;Custom Cards: If you're an experienced player who likes to play with a certain role not included in the base set, you can select an additional role from a list, or even have custom cards made and enclosed with your order.&#10;&#10;Unique custom roles found only in Ultimate Werewolf: Whitebox Edition: The Village Idiot, Wolf Cub, Aura Seer and Spellcaster.&#10;&#10;Re-implements:&#10;&#10;    Werewolf&#10;&#10;&#10;&#10;&#10;Re-implemented by:&#10;&#10;    Ultimate Werewolf: Ultimate Edition&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Star System",
        "description": "At the beginning of the last century, in the USA some brave enterpriser's foresee the possible economic developments of the invention of the Lumi&egrave;re brothers and founded the first production companies. In a short time their studios became the source of dreams that every American could believe. Initially the actors came from theater, but soon the cinema started to count upon stars more and more famous, liked by the public, able to ensure the success of the movies just with their presence.&#10;&#10;A deduction game for 2 players.&#10;Some actors (and actresses) are dealt to both players, while the rest are kept face down on the table.&#10;You try to guess which actors (and actresses) are in the hand of your opponent (i.e. compose her cast).&#10;To do so, there are several actions available: each player can choose only one per turn and those not chosen are still implemented in a sort of &quot;neutral&quot; way (helping both players).&#10;&#10;",
        "artist": "Paolo Vallerga"
    },
    {
        "name": "1960: The Making of the President",
        "description": "From the author:&#10;&#10;&quot;Sometimes the history of a nation can be defined by the relationship between two individuals. The Election of 1960 is the story of two men, John F. Kennedy and Richard M. Nixon. One is the scion of a wealthy, politically powerful family from New England. The other is the son of a Quaker grocer in Whittier, California. While they belong to opposing political parties, they start out as friends. The complex development of that friendship, however, would shape a pivotal presidential election and cast a long shadow over American history for the remainder of the 20th century.&#10;&#10;&quot;In 1960: The Making of the President, you take on the role of one of these great protagonists vying for the right to lead his country into the heart of the Cold War. However, it is not just foreign policy that poses a challenge to American leadership; this is also an era of great social turmoil and progress. As the United States continues to build upon the promise of its founding, candidates must contend with the question of civil rights and balance their positions on social justice against the need for valuable Southern electoral votes. Of course, the ever-present issue of the economy also rears its ugly head, and both Nixon and Kennedy will compete to be the candidate with the voters' pocket books in mind.&#10;&#10;&quot;The contest is fought out on an electoral map of the United States as it stood in 1960&mdash;a map where Louisiana and Florida share the same number of electoral votes, as do California and Pennsylvania. Using a card-driven game system, all the major events which shaped the campaign are represented: Nixon&rsquo;s lazy shave, President Eisenhower&rsquo;s late endorsement, and the 'Catholic question' are all included as specific event cards. The famous televised debates and final election day push are each handled with their own subsystems. Candidates vie to capture each state&rsquo;s electoral votes using campaign points in the four different regions of the country. At the same time, they must build momentum by dominating the issues of the day and attempt to gain control of the airwaves.&#10;&#10;&quot;As with any election campaign, the challenge is to adapt your game plan as the ground shifts out from under you. There are never enough resources or time to do everything, but you need to make the tough calls to propel yourself into the White House. This fast-playing strategy game for two players challenges you to run for the most powerful elective office in the world, at one of its most unique crossroads. Will you recreate history, or rewrite it? 1960: The Making of the President provides you the opportunity to do both.&quot;&#10;&#10;",
        "artist": "Josh Cappel"
    },
    {
        "name": "Catan Dice Game",
        "description": "Like all the other games of the &quot;Settlers of Catan&quot; series, this game is about building settlements, roads, cities and hiring knights. This time, there is no board on which to place little figures: Every player has his own score card called the building sheet, which depicts a mini Catan (compare with Die Siedler von Catan: Paper & Pencil). You build by drawing the settlements and roads on your score card.&#10;&#10;To build you still require resources. These are collected by a Yahtzee-like mechanism that involves throwing six special dice (depicting the different resource symbols) up to three times. After each roll, the player can select which dice to keep and which to roll again. In the end, he may build using the thusly determined resources, and is awarded victory points for any finished buildings, which are recorded on the score card.&#10;&#10;The game lasts fifteen turns or about 15-30 minutes, after which the player with the most victory points wins.&#10;&#10;Note that the game has been designed for 1-4 players, meaning there is a solitaire version of the game, as well.&#10;&#10;Recent versions include double-sided map sheets and instructions for Catan Dice Game Plus.&#10;&#10;",
        "artist": "Volkan Baga,Tanja Donner,Michaela Kienle,Harald Lieske,Michael Menzel"
    },
    {
        "name": "Tintenherz",
        "description": "Together against the Shadow!&#10;To free the world of the feared Shadow and his sinister master Capricorn must the players find the proper words.This is done by answering various questions such as &quot;Name a bird!&quot;&#10;However, only letters visible on the board may be used in the answer. Everybody will immediately try to find a suitable word. When enough words have been found will Meggie, the heroine of the story, move towards goal; if not will Capricorn move forwards. Only if Meggie manage to reach goal first will the gamers win the game!&#10;&#10;The game is based upon the highly succesful children's book &quot;Inkheart&quot; by Cornelia Funke. The novel is about the power of the word, and game designer Klaus Teuber of &quot;Settlers of Catan&quot; fame have captured the enthralling and tantalizing atmosphere of the struggle of young Meggy and her father Moe on one side against the evil Capricorn and his henchmen on the other.&#10;&#10;Moe has the fantastic ability to read characters out of a story and into life. By this he brought Capricorn, the super-villain, into our world, who strifes to get all of his evil henchmen out of his book to help him with his bad deeds. But for this, he requires Moes services...&#10;&#10;The trilogy has captivated children all over the world, and a major movie was released in March 2008.&#10;So hopefully will we soon see an English language edition of this game.&#10;&#10;This is a game in the Kosmos line of literature-based games.&#10;&#10;",
        "artist": "Franz Vohwinkel,Imelda Vohwinkel"
    },
    {
        "name": "Trapper",
        "description": "From the designer, translation courtesy of BoardgameNews.com:&#10;&#10;Trapper is an adventurous family game for 2-4 trappers from 10 years old, in which players gather tiles lying on the table. Trapper is suited especially well for two players.&#10;&#10;Players are trappers in the Canadian wilderness, catching wild animals in the forests and lakes and searching for fungus and herbs. You ship your prey in canoes. As soon as one of your canoes is full, you sell the goods at the market. Both in the gathering of your prey and in the filling of your canoes, you need clever plans and foresight. Who will make the most valuable captures? The winner is the player who possesses the most money.&#10;&#10;The game offers two different versions: A basic version in which luck plays a larger share and a somewhat more demanding version for tactically-minded players.&#10;&#10;The basic game of Trapper is a simple game in the style of Verflixxt and Celtica that's suitable for a wide target audience. Good luck and tactics are about equal on the scales.&#10;&#10;The somewhat more demanding version offers more tactical possibilities. How should one advance with the animal gathering? Which is more lucrative, getting a few larger and very valuable canoes or bringing many small canoes with different species to the market? Both strategies can lead to success.&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "Dead of Night",
        "description": "Dead of Night is a 1 to 6 player game based on scenarios you might recognize from various zombie films. There is no 'Zombie Master' here: all the players are on the same side, all working together to survive, although the option to use other players as zombie bait while you grab all the guns and lock yourself in the cellar is there if you prefer.&#10;Either way, you will need to use strategy and your (fresh and spicy) brains as well as chainsaws and shotguns to make it through the night.&#10;&#10;Each scenario has a location to be explored, and an objective to be fulfilled, but if things don't go well just survival may be enough. Cards drawn throughout the game may help or hinder your progress, but as the night draws on you can be sure things are going to get much worse before you see the sun again.&#10;&#10;The game ends when somebody fulfils the main objective (eg, escaping in a fuelled up vehicle), or at daybreak, which brings respite in the form of an advancing army patrol. If you can survive until the end of the game, you are a winner. The survivor who best fulfils their objectives will come out on top.&#10;&#10;Expanded by:&#10;&#10;    Mall of the Dead&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Hearts and Minds: Vietnam 1965-1975",
        "description": "Hearts and Minds: Vietnam 1965-1975 is a card-driven game covering the American buildup of troops and arms in Southeast Asia as to our decision to begin troop withdrawal: 1965-1975. The game is quick (3-6 hours) and clean (map using area movement). Hearts and Minds uses most major events of the period, including proposed events such as the Macnamara Line which was never actually built. Although nominally a combat game, the mechanisms actually revolve around both sides occupying South Vietnamese provinces for propaganda purposes. The heart of the game is political influence. There is little doubt that the Allied player will eventually withdraw his American boys from the quagmire, but the question is, how quickly and in what numbers?&#10;&#10;Hearts and Minds contains 80 cards, tokens to represent the American army, the ARVN army, the NVA army, VC units of varying hidden strength, the Cambodian army, the Laotian army and a small contingent of international allies. Turn tokens, withdrawal tokens, reduced movement tokens as well CAS (Close Air Support), communist Air Suppression and artillery are also included. More rules cover Air Cavalry, naval support, Riverine interdiction, and bombers. Untried troops are a liability in the game; Veteran troops are a necessity. Ultimately, the Communist player must deal the American such a crushing public relations disaster that he will abandon his Southeast Asian allies before the momentum of those allies stalemates the irreversible infiltration of South Vietnam.&#10;&#10;",
        "artist": "Sean Cooke"
    },
    {
        "name": "Colosseum",
        "description": "In Colosseum each player is a Roman impresario - producing great spectacles in his or her arena in the hopes of attracting the most spectators. Players earn wealth and glory for each event run, using it to create ever more ambitious events. They will need to improve their arena, find the best performers, lure the Emperor and his nobles, and manage assets for long-term success to be granted the title of Grand Impresario, with tales of your extraordinary spectacles acclaimed throughout the empire.&#10;&#10;As commanded by the Emperor, the greatest celebration in Roman history has continued unabated for 99 days. All of Rome has borne witness to the grandest spectacles the empire has ever seen&mdash; all to commemorate the opening of the Amphitheatrum Flavium, the Colosseum.&#10;&#10;Tens of thousands have flocked to the city to experience the sight of a hundred gladiators in battle...rare and exotic animals prowling the arena floor...and to hear and see the greatest musicians and entertainers from throughout the empire. But these events have only been a prelude to today &mdash; the closing finale! As a master impresario you have prepared for this moment your entire life. Titus himself has taken his seat in the Emperor&rsquo;s Loge. At the drop of his hand, the final spectacle will begin. Your moment in the sun has come...&#10;&#10;",
        "artist": "Cyrille Daujean,Jacqui Davis,Julien Delval,Daniel Solis"
    },
    {
        "name": "Catan Junior",
        "description": "Die Siedler von Catan: Junior  is, as you might expect, a junior edition of The Settlers of Catan, and while the game play remains mostly the same &ndash; with players collecting and trading resources in order to build things, gain more resources and score points &ndash; the setting is new.&#10;&#10;Instead of being settlers, though, the players are now pirates, with pirate warehouses located on islands in the waters around Catan and ships sailing in those waters. Pirate warehouses are equivalent to settlements in Catan, and the player receive resources from these warehouses whenever a die roll matches the number showing on that island. These resources take the form of equipment cards, and the resources are wood, wool, rum, sabers and gold. With these, players construct ships and more pirate warehouses or buy development cards. Instead of a robber, players must now beware of a Ghost Pirate, which can block the resources normally provided by a warehouse.&#10;&#10;Each player starts with two pirate warehouses, and the first player to build seven warehouses wins. In order to build a new warehouse, however, a player must go by ship from an existing warehouse to a new construction site, which thus keeps players alternating between constructing ships and warehouses.&#10;&#10;Aside from the change in theme, other changes between The Settlers of Catan and Catan: Junior include the elimination of cities (i.e., warehouses can't be upgraded) and the distance rule between settlements, resources allocated by the roll of one die instead of a pair of D6s, and the introduction of a marketplace that allows trading with the bank. At the start of the game, one equipment card of each type is placed in the marketplace; on a player's turn, he can exchange one card in hand for a card in the marketplace. At certain times in the game, the marketplace is cleared and reset to feature one equipment card of each type.&#10;&#10;",
        "artist": "Michaela Kienle,Annette Nora Kara,Patricia Raubo,Klaus Teuber"
    }
]