[
    {
        "name": "SPQR (Deluxe Edition)",
        "description": "SPQR (Deluxe Edition) is a re-working of the classic GMT game of warfare in the age of the Roman Republic, out of print for many years now.  The deluxe edition contains the five scenarios, maps and counters from the original SPQR, plus nine additional scenarios (and the requisite maps and counters) taken from various expansion modules.  This major revision makes available again a key part of the brilliant Great Battles of History Series.&#10;&#10;Contents:&#10;&#10;     5 full-color countersheets&#10;     5 backprinted full color maps&#10;     Rules Booklet&#10;     Scenario Booklet&#10;     Charts and Tables&#10;     One 10-sided die&#10;&#10;&#10;&#10;&#10;Battles: (and the modules they appeared in originally)&#10;&#10;     Heraclea - 280 BC (Pyrrhic Victory)&#10;     Ausculum - 279 BC (Pyrrhic Victory)&#10;     Beneventum - 275 BC (SPQR)&#10;     Bagradas Plains - 255 BC (SPQR)&#10;     Trebbia - 218 BC (Consul for Rome)&#10;     Cannae - 216 BC (SPQR)&#10;     Baecula - 208 BC (Africanus)&#10;     The Metaurus - 207 BC (Consul for Rome)&#10;     Ilipa - 206 BC (Africanus)&#10;     The Great Plains - 204 BC (C3i No.4)&#10;     Zama - 202 BC (SPQR)&#10;     Cynoscephalae - 197 BC (SPQR)&#10;     Magnesia - 190 BC (War Elephant)&#10;     The Muthul River - 109 BC (Jugurtha)&#10;&#10;&#10;&#10;&#10;Time Scale: 20 minutes per game turn&#10;Map Scale: 70 yards per hex&#10;Unit Scale: Each Strength Point = 100&ndash;150 infantry, 100 cavalry&#10;Players: 1&ndash;4&#10;&#10;",
        "artist": "Rodger B. MacGowan,Leland Myrick,Mark Simonitch"
    },
    {
        "name": "Scene It? Sports powered by ESPN",
        "description": "From the Manufacturer:&#10;&#10;The Sports trivia game with real video clips of the greatest moments in sports! Scene It? Movie is the first ever DVD-based board game combining a cool social interactive board game with sports trivia and the visual excitement of the fast growing DVD technology. Now Scene It? Sports turns a flat board game into a 3-D multimedia match where players can relive great moments in sports, challenge sports knowledge and have fun with friends. Includes DVD, Flextime game board, one six-sided dice, one eight-sided dice, four metal character movers, four category reference cards and 160 trivia cards with three questions each and 30 buzz cards. For two or more players. Requires TV and a DVD player (sold separately).&#10;&#10;Features:&#10;&#10;- Flextime game board folds up for shorter games&#10;- For 2 to 4 players or teams&#10;- Challenges sports fans with trivia using cards and real sports clips&#10;- 1,100 trivia questions; DVD contains more than 100 sports clips and visuals&#10;- Randomized sports clips make game different every time&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "ChickenFoot",
        "description": "ChickenFoot is a domino game.  This version bills itself as &quot;The One &amp; Only Official Game of ChickenFoot(R)&quot;   The following is found on the game box:&#10;&#10;&quot;Puremco's Chickenfoot is the original, official, and only authorized version of this classic game - beware of knock-off brands! Chickenfoot has just the right mix of simplicity and intrigue to get any group together for some fun! Puremco's Professional Size Dominoes are thicker and have jumbo, bright, colored dots that are uniform in size and easy to see.  The Dominoes stand alone keeping you hands free for refreshments and fun.  The leatherette, vinyl case is compact and easy to store when traveling or at home.&quot;&#10;&#10;The game includes 55 double-nine dominoes, a domino centerpiece, and rules to ChickenFoot and other domino games including a solitaire dominoes game.&#10;&#10;Chickenfoot itself is at heart a tile laying network game.  Where you start with a double domino.  You play 10 rounds, each round starts with a different double domino working your way down from double-nine to double-blank.  You must first fill the double chickenfoot with the 8 tiles that go around it. If you can't fill you must draw a new tile, it is like Uno in this aspect.  Once the chickenfoot is played you may play a new domino, either putting a number against a number or playing a double tile in a T arrangement across another domino, this becomes a new chickenfoot and must be filled before continuing, a player draws a tile if they can't finish the Chickenfoot.  The round ends when one player has no tile, or there are no tiles left to play on a chickenfoot.&#10;&#10;A fun game that can be played by gamers and non-gamers alike.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Diabolo",
        "description": "It&rsquo;s a thin line between good and evil, and you&rsquo;re going to have to find the right balance and avoid ending up&#10;In Limbo!&#10;&#10;Play your cards on either the good or evil side of each of the five colors, as you tip the balance towards good on some colors and bad on others. However, since you only score on the cards left in your hand, you&rsquo;ll need to carefully weigh the consequences of each of your choices.&#10;&#10;With a lot of strategy and a little luck, you can do yourself a world of good even if things heat up for your opponents.&#10;&#10;",
        "artist": "Michael Schacht"
    },
    {
        "name": "Bohnkick",
        "description": "With the 2006 World Championships in Germany, Amigo releases Bohnkick at N&uuml;rnburg 2006.&#10;&#10;Bohnkick is a quick soccer cardgame for two or four players. Each player or team attempts to pass the ball and make a successful shot on the goal. Some shots are stronger than others, but sometimes even a lucky shot can get past the goaltender. There are also numerous fouls which can occur, perhaps even resulting in a penalty kick.&#10;&#10;Ages 8 and up&#10;&#10;Contents:&#10;&#10;    109 game cards&#10;    1 game overview&#10;&#10;&#10;&#10;&#10;Bohnkick is part of the Bohnanza family of games.&#10;&#10;",
        "artist": "Björn Pertoft"
    },
    {
        "name": "To Court the King",
        "description": "In this game, the players are petitioners at the royal court, trying to gain the King's favor. To do so, they must first gain the help of the servants and petty officials at the court, who can then help them gain access to the nobility, who, in turn, can help to reach the king.&#10;&#10;The game is played in turns. On their turn, a player will gather his dice, roll them, set aside at least one, and roll the remaining dice again, until all dice have been set aside. After that, he gets to select a character who will help him. Each character requires a certain combination of dice (such as two pairs or dice that show at least 30 points). The character will give the player some benefits on later rolls, such as an additional die or the ability to modify the results of a roll.&#10;&#10;The game ends when a player gains the support of the Queen (and temporary favor of the King, winning ties in the final roll-off). Now, all players try to gain a dice result of as many equal dice as possible (7x 2s, 8x 6s, etc). The player who gets the longest, highest result gains the favor of the King and wins.&#10;&#10;Contents: 12 Dice, 60 character cards, 5 player aids, 1 marker, rules.&#10;&#10;Online Play&#10;&#10;&#10;     BrettspielWelt (real-time)&#10;     Yucata (turn-based)&#10;&#10;&#10;",
        "artist": "Taira Akitsu,Volkan Baga"
    },
    {
        "name": "Cincinnati",
        "description": "Dicegame. Players try to score money in 12 rounds by rolling certain combinations of dice. N&uuml;rnberg 2006.&#10;&#10;",
        "artist": "Giulia Riccio,Claus Stephan"
    },
    {
        "name": "Number Chase",
        "description": "Overview:&#10;In each round a different player is the &quot;Writer.&quot;  The Writer thinks of a number from 1 to 50 and secretly writes it down on a slip of paper.  One at a time, each of the other players tries to guess the number.  If the guess is wrong, the number is turned over to reveal a question, and the answer will be a clue to help out the other players.  If the guess is correct, the player receives that number card as a point.  The first person to collect three cards is the winner!&#10;&#10;",
        "artist": "Design Edge,Oliver Freudenreich"
    },
    {
        "name": "Aquädukt",
        "description": "Building houses isn't hard - but providing water is much more so. By following this ancient Roman building principle, a prosperous landscape is settled by the players. But the beautiful houses are useless without water. If a player doesn't provide water for his houses before the neighborhood is completely built up, then the inhabitants - good or bad - must move out and the house brings no victory points. He who uses tactical cunning and a little dice luck to build wells and canals at the right time and secure the best building spots will win!&#10;&#10;Contents: 1 game board, 112 building tiles (8 tiles with 1 house, 8 tiles with 2 houses, 8 tiles with 3 houses, and 4 tiles with 4 houses... in each of the four colors), 8 mountains, 5 (glass) springs, 36 (wooden) canals, 1 20-sided die.&#10;&#10;",
        "artist": "Claus Stephan,Mirko Suzuki"
    },
    {
        "name": "Mad Scientist University",
        "description": "A party game originally from Raiding Party Games, and republished by Atlas Games in 2007, Mad Scientist University is a storytelling game where each player in turn takes on the role of an evil genius Teacher's Assistant (TA) at the Mad Scientist University.&#10;&#10;Each TA holds a class challenging the students (everyone else) to come up with a way to meet a goal given certain elements listed on distributed cards (Create Perpetual Motion with Lawn Gnomes, for example).  Each student brainstorms and then gives a short presentation detailing their plan, and the TA awards the card with the goal to the 'best' plan by whatever criteria the TA wishes (evil geniuses get to be snarky, after all).  The winner is the student with the most won goal cards after everyone has led a course.&#10;&#10;Expanded by:&#10;&#10;    Mad Scientist University Course Packet: Home Economics&#10;    Mad Scientist University Course Packet: Independent Study&#10;    Mad Scientist University Course Packet: Medicine&#10;    Mad Scientist University Course Packet: Physical Education&#10;    Mad Scientist University Course Packet: Physics&#10;    Mad Scientist University Course Packet: PSI PHI&#10;    Mad Scientist University Course Packet: Spring Break&#10;    Mad Scientist University Course Packet: Theater&#10;    Mad Scientist University Course Packet: Winter Break&#10;    Mad Scientist University Course Packet: Zoology&#10;&#10;&#10;&#10;&#10;",
        "artist": "Steven Sanders"
    },
    {
        "name": "Scene It? Music",
        "description": "Want to rock and roll all night and party everyday? Then pick up the Music Edition of Scene It? where your favorite music moments take center stage. &quot;What was the first video ever played on MTV?&quot; &quot;By what name is Gordon Mathew Sumner better known?&quot; Real video clips and music, trivia questions and on-screen challenges are guaranteed to rock your world every time you play.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Big Fish Lil' Fish",
        "description": "In this fast-paced, feeding-frenzy card game, players use their Big Fish to eat Lil' Fish.  But beware of the prickly PUFFER fish that can't be eaten or you'll wind up with the whole pile of fish cards.  The first person to get rid of all of their cards wins!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Mana",
        "description": "Abstract strategy game for 2 players. Players try to capture the opponent's Damyo with their own Damyo or one of their 5 Ronins.&#10;&#10;Game contains one 6&times;6 Leather Board (12 single spaces, 12 double spaces &amp; 12 triple spaces), 2 Damyo (one for each player) and 10 Ronin (5 for each player).&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Fiji",
        "description": "1777, European visitors arrive in Fiji looking to trade with the locals. The Pacific Islanders have highly valued shrunken head treasures which the players wish to acquire for museums back home. Players offer colored glass beads in exchange, but must participate in the elaborate Fijian KAWA ritual to determine whose bead offers are most auspicious.&#10;&#10;In Fiji players make offerings of colored beads over a series of four rounds. To win a round players aim to have the most or fewest beads of each color. A set of condition and effect cards is laid out for each round which determines who will win extra beads, depending on their offers. Players select the number of beads to offer in a series of three exchanges, after each of which the condition and effect cards are evaluated, distributing additional beads depending on who offered the most or the fewest of each color. At the end of the round shrunken head tokens are awarded depending on whose set of remaining beads best matches the current arrangement of goal cards.&#10;&#10;After each round the goal cards, condition cards and effect cards are replaced. To win players must think ahead to understand whether an offer will likely give them more beads or less, depending on the cards in effect for the round. If players tie for a particular condition, the tied players are cancelled out, leaving the next player to follow the specified effect. This gives the game a rock-scissors-paper like feel where winning the round often depends on guessing how many beads the other players will offer.&#10;&#10;High quality components consist of pleasing plastic beads, iconic card art, and shrunken head tokens that are both charming and macabre. Players must use tactical logic and guesswork to get an edge in this puzzling auction style game.&#10;&#10;",
        "artist": "Fréderic Bertrand,Lars-Arne \"Maura\" Kalusky"
    },
    {
        "name": "Scene It? Friends",
        "description": "From the publisher:&#10;&#10;Friends trivia from ALL TEN seasons to challenge the fan in everyone&#10;&#10;From foosball matches and hanging out at Central Perk to Marcel and Smelly Cat, you&rsquo;ll find all your favorite Friends moments in Scene It? Friends Edition. Now you can relive ALL TEN seasons from this hit show, with real show clips, trivia questions and other custom Friends on-screen puzzlers. How well do you really know Monica, Phoebe and Rachel? Or Chandler, Joey and Ross? You&rsquo;ll find out as you play the game that celebrates one of the greatest comedy series ever to grace the airwaves.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Jericho",
        "description": "Each player tries to build the longest walls in different colors by playing out wall cards.&#10;Using trumpet cards, the players can remove pieces off the walls.&#10;During scoring, the players with the longest wall in a color are rewarded with cards from the supply. The cards that end up in the supply are decided by the players themselves.&#10;At the end of the game, the player with the most cards is the winner.&#10;&#10;",
        "artist": "Christof Tisch"
    },
    {
        "name": "Snake Lake",
        "description": "From the publisher: &quot;The game is about a group of snakes wandering in the woods trying to eat the apples that fall down from the trees (and avoiding eating the poisonous mushrooms). The snakes' frenzy bring them to run between the trees and players must me able to &quot;pilot&quot; them to the apples, avoiding mushrooms, trees and the other snakes. The game is card driven (the cards are describe the possible movements).&quot;&#10;&#10;SnakeLake is a cross between the old computer game Snake and the board game Robo Rally, but is much simpler and faster than RR. You have a simple board with a grid and place some apple trees around, then each player chooses a starting point.&#10;&#10;Each player uses cards to program their next three moves in secret on their own chart, with the 2nd and 3rd move sliding down each turn when the 1st card is used and a new card going in the 3rd slot. The cards simply show forward, left, right (twice each) and one stop card. They also tell you to draw an Event card, which add some randomness.&#10;&#10;If your snake runs into a tree, or off the board when incomplete, or into another snake's body, you start over again somewhere else, reprogramming your next three snake moves. If you hit another snake's head, they go off and you score a point for each segment of their body. If you get your whole snake on the board and then get your head off the board, you score points for the length of your snake.&#10;&#10;But the big points come from eating apples which fall from the apple trees. These have 8-12 points on them, and your snake runs over them to eat them and reveal the points scored. Likewise, there are some mushrooms which deduct points if eaten. The apples and mushrooms are placed when an Event card indicates. The other events include removing an apple, sending an opponent's snake to sleep (miss a turn), and make your snake's body longer or shorter.&#10;&#10;Snake Lake is a light, fast, fun game and will suit children more than adult's. The best strategy seems to be eat an apple then get knocked off the board to start somewhere else, near more apples. Getting your whole snake on and off is hard work, and scores few points in comparison.&#10;&#10;The components are nicely made, good shiny cards that should wear well. The rules need a little proof-reading but were clear enough. Snake Lake might be better for 3 or 4 players than 6 though, it got very crowded very quickly, even on the large side of the board.&#10;&#10;",
        "artist": "Demis Savini,Gianni Sedioli"
    },
    {
        "name": "Krumble",
        "description": "From the publisher:&#10;&#10;The game is about the adventures of a group of explorer/archaeologists inside an Aztec Pyramid. Inside there was the big treasure they were looking for but also the traps that this old temple hides. The stones are moving and the Pyramid starts to crumble. Here starts the game: players must desperately try to reach the exit before everything collapses over them!&#10;&#10;",
        "artist": "Demis Savini,Guglielmo Signora"
    },
    {
        "name": "Scene It? Squabble",
        "description": "From the publisher:&#10;&#10;Gals are you ready for that oxymoron known as Men's Culture? Guys are you man enough to handle a &quot;Chick Flick?&quot; Find out when you play Scene It? Squabble, the high-spirited game that decides which sex is truly the master of their own domain. &quot;Do you know what Lip Venom is?&quot; &quot;What's the average PSI for most tires?&quot; Couples will test their mental muscles through real movie and TV clips, visual puzzlers and trivia questions guaranteed to redefine your sense of sexual stereotypes. Scene It? Squabble - an equal opportunity entertainer.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Nottingham",
        "description": "From boardgamenews.com:&#10;&#10;The Sheriff of Nottingham is in trouble! His time in power is nearing its end, and he hasn&rsquo;t quite managed to get enough cash together to buy another year in office. So he sends his Deputies out to collect the overdue taxes and promises to promote the most successful Deputy to the rank of Chief Assistant. Is it any wonder, then, that the Deputies think nothing of occasionally picking their colleagues&rsquo; pockets?&#10;&#10;Contents: 1 Scoreboard, 8 Playing Pieces, 110 Cards, 1 Rules Insert&#10;&#10;",
        "artist": "Christof Tisch"
    },
    {
        "name": "Mr. Jack",
        "description": "In Mr. Jack, one of the two players represents Jack the Ripper, who will be one of the eight characters on the board. This player knows which character is Mr. Jack, and his goal is to flee from the district as soon as possible (or avoid being accused for eight turns). The other player represents an independent investigator (not represented on the board) who tries to guess the identity of Jack &mdash; but he can make only one accusation during the game!&#10;&#10;During each turn, the players move the characters, using their special powers and placing them either in shadow or light.  At the end of each turn, the witnesses declare whether Jack is visible &mdash; that is, in light or adjacent to another character &mdash; or not (alone in the shadows). This allows the investigator to know which characters are innocent. As the turns progress, the investigator tries to eliminate suspects while Jack tries to escape. Intuition, logic, and cold blood will be necessary for each of the two participants.&#10;&#10;",
        "artist": "Pierô"
    },
    {
        "name": "Talavera",
        "description": "From MMP's site:&#10;&#10;July, 1809. The uneasy alliance of Wellesley's Army of Portugal and Cuesta's Army of Extremadura was being pressed from every direction by the King of Spain, Joseph Bonaparte's, Army.&#10;&#10;Forced to make a stand, a two day battle occurred which mauled both sides but allowed the Allies to escape towards Portugal.&#10;&#10;Talavera is MMP's newest game in the Napoleonic Brigade Series (NBS) and features the end result of half a decade of brainstorming and intensive playtesting - the 3.0 NBS rules set. It is fast playing. It is furious. And, finally, it is about leading armies. MMP, Dean, and the Honchos think you will enjoy them very much.&#10;&#10;BUT THATS NOT ALL!&#10;&#10;Talavera also contains the mini-game on the small, but decisive, 1808 battle of  Vimieiro.&#10;&#10;Fought outside of Lisbon in August of 1808 between the British and French Armies of Portugal, French General Junot was defeated and surrendered both his army and Portugal to the British - setting the stage for the Peninsula War.&#10;&#10;Napoleon Brigade Series (NBS) &#10;- scale = 180-200 m/hex (197-219 yrd/hex);&#10;- time = 30 min/GT (60 min/Night-GT);&#10;- strength = 150 inf (100 cav)/SP&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "1914: Twilight in the East",
        "description": "(From the GMT website:)&#10;&#10;Twilight in the East: The Eastern Front, 1914 models the battles that took place in Poland and Galicia during the first year of World War One. Beginning with the Russian invasions of Prussia and Galicia in August and ending after the Battle of Lodz in December, it recreates the ebb and flow of the huge forces sent marching across the Eastern Front in 1914.&#10;&#10;The game features an innovative combat system which takes into account the magnitude of the forces involved in each individual combat and various factors such as amount and type of artillery present, flank attacks, and fieldworks, among other things. It also features a fluid Movement, Counter-Movement, Forced March movement system and Combat Effectiveness Level tracking system that requires formations to periodically rest and recuperate.&#10;&#10;All the scenarios except the introductory scenario allow both sides to be simultaneously on the offensive and defensive on different parts of the battlefield. Additionally, armies that were on the offensive one game turn can quickly find themselves on the defensive a game turn later.&#10;&#10;The game includes five scenarios: First Battle of the Masurian Lakes, Lublin, Battle for Galicia, Tannenberg Campaign and the Grand Campaign game.&#10;&#10;The CSR Award winning support magazine 1914: Dispatches http://www.boardgamegeek.com/weblink/118300/1914-dispatches-oregon-consim-journal includes two new scenarios. The Battle for Ivangorod is a learning scenario. The Battles of Lodz and Krakau is a massive scenario that uses almost the entire counter mix.&#10;&#10;GMT's C3i magazine #26 contains a CSR Award winning article and expansion scenario The Dragoni Variant (includes new counters).&#10;&#10;",
        "artist": "Marcus Brown,Rodger B. MacGowan,Michael Resch,Mark Simonitch"
    },
    {
        "name": "Thurn and Taxis",
        "description": "In Thurn &amp; Taxis, players build post office routes across Bavaria and the regions around, collecting bonus points in various ways. The board shows a map of all the cities, with roads leading from each one to some of its neighbors. There are various colored regions around the board, most with two or three cities, and a large region with all the Bavarian cities in the center.&#10;&#10;Players build postal routes from city to city to city so that each city is adjacent to the next city on the route and there is a road connecting these two cities.  Each route must consist of at least three cities.  Players may only build one route at a time.  Routes are represented by melded city cards arranged in the order of the route.&#10;&#10;Players start with a supply of 20 post offices in their color, a carriage house card and a player aid card.  The board is populated with bonus tiles, carriage cards and city cards.  On a turn a player will draw a card from a display of six, face up, city cards (or the top of the face down deck) and meld one card, either starting a new route or adding to the current one.  If after adding to the route, the length of the route is at least three cities, the player may declare it finished and score it.  The player may, depending on the length of the route and which cities are in the route, place post offices in the cities, collect bonus tiles, and acquire a higher value carriage.  Optionally, the player may receive support from one postal official in the form of: drawing a second card, melding a second card, refreshing the six city card display, or acquiring a higher value carriage than the route length when finishing a route.  Once a route is scored the city cards of that route are discarded, and the player begins a new route on his next turn.&#10;&#10;When a player exhausts his supply of post offices or acquires a value 7 carriage the end of the game is triggered.  Play continues until the player who is last in turn order finishes his turn, and the game ends.  Players score points for their highest valued carriage and bonus tiles, and lose points for unplaced post offices.  The player with the most points wins.&#10;&#10;The fact that you *must* add at least one city to your route each turn or lose the whole route gives the game an enjoyable planning element.&#10;&#10;",
        "artist": "Michael Menzel"
    },
    {
        "name": "Masons",
        "description": "In Masons, players represent architects, who together establish cities on the landscape of the game board. When a city is completed, all players score points for &quot;guild cards&quot; they play, with the right timing in playing the right card making all the difference.&#10;&#10;Each turn, a player first establishes a new wall somewhere on the board. Each wall will be enclosed by two towers, and will have one house placed on each side of it. It's possible for a wall to need only one, or zero, new towers by putting it next to existing towers. It's possible for only one house to be placed, if the wall is placed along the outside of the game board.&#10;After placing the wall, the player rolls three dice to determine the color of one of the towers (the color of a possible second tower may be freely chosen), and that of the two houses (if only one house is placed, then the player may choose which of the dice to pick for the color of the house).&#10;Finally, if the newly placed wall causes a piece of land to be fully enclosed, a new city has been established. If the new city borders one or more existing cities, it may be combined with one of those cities. Two houses of the same color inside the city are upgraded to a palace. A scoring round is now triggered, during which all players get to play one or two &quot;guild cards&quot;, and then draw one new card. Each guild card will score a feature of either the just completed city, or outside it. Possible features are the number of houses &amp; palaces or towers of a specified color, the number of fields of the city, the number of houses inside a &quot;district&quot; on the board, the number of palaces inside a city, the different number of colors inside a city, or the total number of completed cities. At the end of a scoring round, whichever player is in last place may discard as many guild cards as desired, and draw new ones to replace them.&#10;&#10;The game ends when all pieces of a certain type have been played, and the winner is whoever has the most points.&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "HysteriCoach",
        "description": "This is an original party game for 4 to 14 players. Players are split into two &quot;football teams&quot; composed of a single &quot;coach&quot; and a number of &quot;players&quot;.&#10;&#10;Each &quot;player&quot; sits opposite a &quot;player&quot; from the opposing team, with all players of a team on one side of the table and their coach standing behind the rival team on the opposite side of the table so they clearly watch him.&#10;&#10;The board is composed by a &quot;football field&quot; gridded board, 2 small dice, 3 normal dice and some &quot;action cards&quot; showing the position that each wooden &quot;soccer player&quot; will have to reach in the field.&#10;In addition each team has 2 team-rose(?) cards and 8 full color wooden soccer figures with a number on the back and front.&#10;&#10;The prototype I tried contained 3 teams: Japan, Greece and Eastern-Europe. The soccer player names are quite hard to say because the author deliberately invented really strange and long names.&#10;&#10;To win you have to put the ball in the net more times than other team.&#10;&#10;The game is noisy and hilarious. Each coach gets an action card. Each player get a &quot;number&quot; that represent the t-shirt number of the figures they will control (more than one there are less than 14 players).&#10;&#10;Only the coach see the action card and have to call BY NAME (of soccer players not of the people playing the game) to indicate where to move to without talking, without indicating the wooden soccer players. The only way to communicate is to give him indications with his hands or miming something as real coach do.&#10;&#10;Every time a wooden soccer player is in the right position the coach scream &quot;PASS IT&quot; and so on the other wooden soccer player until the last is positioned and the coach screams &quot;SHOOOOOT!!!&quot;&quot;&#10;&#10;All the players stop play. If the team is positioned exactly as the action card requires, the last player who moved a wooden soccer player for the team throws a die to score a goal.&#10;&#10;Some penalties are given to the coach for performing forbidden actions (like calling wooden soccer players by number or indicating it by pointing) and if the action card is not correctly reproduced.&#10;&#10;RETHEMED : HysteriCoach Hockey&#10;&#10;",
        "artist": "Robert Cepo,Paolo Vallerga"
    },
    {
        "name": "Apples to Apples: Bible Edition",
        "description": "APPLES TO APPLES&reg;: BIBLE EDITION is the wild, party game that provides instant fun! for everyone! It&rsquo;s as easy as &quot;comparing apples to apples&quot;... just open the box, deal the cards, and you&rsquo;re ready to play! Select the card from your hand that you think is best described by a card played by the judge. If the judge picks your card, you win that round. And everyone gets a chance to be the judge!&#10;&#10;Each round is filled with surprising and outrageous comparisons from a wide range of people, places, things and events from our Christian history. Fast moving and refreshing, Apples to Apples is perfect for any get together with family and friends!&#10;&#10;Part of the Apples to Apples Series.&#10;&#10;",
        "artist": "John Kovalic,Cathleen Quinn-Kinney"
    },
    {
        "name": "Sherwood",
        "description": "Each player has a group of forest robbers from Sherwood.  In each round players simultaneously attack three travelers with a hidden count of robbers.  According to the robbers, properties for each traveler is determined by which group attacked him.  Successful groups take some reward.  Victory points are earned from a range of one's own villages.  Some rewards allow the player gain a village and score points from them.&#10;&#10;",
        "artist": "David Cochard"
    },
    {
        "name": "Mont Saint Michel",
        "description": "The Mystery of Mont Saint Michel&#10;&#10;(the following text is translated from www.schmidt.de)&#10;&#10;Have you heard? Secret messages are circulating on the famous monastery mountain. But which ones are true, and which ones are false? It's not surprising that mistrust accompanies the secret meeting. You need intuition and deduction to solve the mystery. But things could be so simple - the messages can be found in the playing pieces.&#10;&#10;This is a Nuremberg 2007 release.&#10;&#10;Ages 8 and up.&#10;&#10;",
        "artist": "Rolf Vogt"
    },
    {
        "name": "UNO H2O Splash",
        "description": "This version of UNO includes transparent, waterproof cards similar to UNO H2O and a special Whirlpool device. The Whirlpool has random effects that appear when shook (it works like a Magic 8-Ball).&#10;&#10;The rules are simplified. For example, the winner conditions are no longer points based. The first player to win three hands wins the game. Also gone are rules regarding playing Wild Draw 4 Cards when you can play another card.&#10;&#10;The Whirlpool is activated by playing a special Splash card or playing a 0 or a 2. The next player must then shake the Whirlpool and follow the results:&#10;1) Draw H2O - draw until they get a blue, 2, 0 or wild card.&#10;2) Wave Right - show a card to the player on the right.&#10;3) Wave Left - show a card to the player on the left.&#10;4) Wipeout - reverse order of play (player who started the Splash must use the whirlpool)&#10;&#10;Other possible Whirlpool results are draw, discard and give cards.&#10;&#10;The cards and Whirlpool are contained in a sturdy plastic box, with a slide on/off lid.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Los Mampfos",
        "description": "From the publisher:&#10;&#10;&quot;Buenos Dias!&quot; - Ages 6 and up, along with their families are welcome in the world of Los Mampfos, a game about feed, hungry donkeys and the millstones that determine their fate. In this 20 to 30 minute game, 3 donkeys with more or less full stomachs are always in motion and demand a good memory.&#10;&#10;",
        "artist": "Gabriela Silveira"
    },
    {
        "name": "Figaro",
        "description": "Figaro is a card game by Reiner Knizia, for 3-6 players. It&rsquo;s set in the world of Viva il Re! / King Me!, but with totally different mechanics&hellip; and one rule in common!&#10;&#10;",
        "artist": "Roberta Barletta,Daniele Barletta,Didier Guiserix"
    },
    {
        "name": "Blue Moon City",
        "description": "Blue Moon City - the board game - picks up where the two-player game, (Blue Moon), ended: the reconstruction of the destroyed city of Blue Moon. The board, illustrated by Franz Vohwinkel as well as many well-known American fantasy artists, consists of 21 large building tiles, which show building plans on one side and the buildings in their reconstructed glory on the other. As in the 2-player game, the game includes 3 large molded plastic dragons.&#10;&#10;At the start of the game, the board tiles all show their building plan sides. The object of the game is to use cards featuring the races of Blue Moon to help rebuild the city and, at the end, put the large Crystal of the Obelisk in the middle of the city back together. Whenever a building is completely rebuilt, its tile is turned back over to its rebuilt side. The players who helped with a building get crystals and dragon favors, which can be traded in for crystals at certain times.&#10;&#10;The player who first manages to add the required number of markers by paying crystals to the Obelisk wins the game. (four markers in a 4-player game, five markers in a 3-player game, and six markers in a 2-player game)&#10;&#10;There are two mini-expansions for this game (Blue Moon City: Expansion Tile Sets 1 & 2), each consisting of two tiles that can be added to the main game either separately or combined.  The first mini-expansion was included with the Der Knizia Almanach.  The second mini-expansion was included in the 6/06 issue of Spielbox.&#10;&#10;&#10;     Original Knizia design--after dragon scales score, ALL players discard scales.  This rule was modified by the publisher.&#10;&#10;&#10;",
        "artist": "Daren Bader,Scott Fischer,Lars Grant-West,Todd Lockwood,John Matson,James Nelson,Michael Phillippi,Franz Vohwinkel"
    },
    {
        "name": "Augsburg 1520",
        "description": "From Alea:&#10;&#10;The game is about Jakob Fugger, who was probably the wealthiest man of his time. &ldquo;Jakob the Rich,&rdquo; as he was named in his time, owned so much money that he loaned money to a host of counts and kings. Often, they were not able to repay him in cash, so they awarded him special privileges, such as trade rights and offices.&#10;&#10;2 to 5 players ages 12 and up assume the role of the merchants from Augsburg and try to get what they can -- by means of auctions -- from the nobility, thus increasing their wealth and particularly their social status.&#10;&#10;The game play uses a simple bidding mechanism. Each round, players offer cards of varying values in a series of five auctions. Once a bid is made, players either raise the bid, call, or drop. The winning player may choose from a set of possible actions that increase abilities (and more importantly, points).  After a number of rounds (dependent on the number of players), scores are tallied. It's that simple.&#10;&#10;This is a game by Karsten Hartwig, whose other game &ldquo;Chinatown&rdquo; was already published by Alea. Game length varies -- depending on the number of players -- between 25 to 90 minutes. The difficulty level is a 4 on the Alea 1-10 scale (the same as Ra).&#10;&#10;Besides the players&rsquo; tableaus and a game board, there are 90 game cards and various game chits.&#10;&#10;This game is #3 in the Alea medium box series.&#10;&#10;",
        "artist": "Czarnè"
    },
    {
        "name": "Leonardo da Vinci",
        "description": "Theme:&#10;Florence, fifteenth century. The inventors of the Renaissance created amazing machines for the Lord of the city. Become the protagonist of this age of unbelievable discoveries by realizing your inventions! You'll direct your team into the laboratories, workshops, among the shops and perhaps learn the intrigues of the palace. Only the best can rival the great Leonardo!&#10;&#10;Summary:&#10;A worker-placement game for 2-5 players with an interesting bidding mechanic. In many other worker-placement games, if an opponent beats you to a spot, you're out of luck. Not so in Leonardo de Vinci. Here, you can bid more workers to jump ahead in line. And people at the back of the line, can still get something, but they have to pay more to get it. The competition for resources is very dynamic and fun.&#10;&#10;Your same workers that compete for resources may also power your laboratory, so you must balance acquiring resources with working in the laboratory so that you can complete inventions and not run out of Florins (i.e. manage cash-flow).&#10;&#10;The key is planning your resources and production capacity to maximize the number of inventions you can make and therefore maximize the amount of Florins you can earn.  The last two rounds of the game require extra careful planning because new resources cannot be acquired.&#10;&#10;Meta:&#10;A &quot;gamers' game&quot; by Acchittocca (a team of Italian game designers). Nr. 1 in the QWG Master Print Edition series&#10;&#10;",
        "artist": "Stefano de Fazi,Mike Doyle (I)"
    },
    {
        "name": "Crazy Kick",
        "description": "2006 is the year of the football world championship and ligretto, the fast paced action card games pays it tribute.&#10;&#10;Online Play&#10;&#10;&#10;     BrettspielWelt (real-time)&#10;&#10;&#10;Winner of the &quot;Schweizer Spielepreis 2006&quot; (best family game)&#10;&#10;",
        "artist": "Artworkatelier Grafe & Roedszu,Reiner Stockhausen"
    },
    {
        "name": "Marvel Heroes Battle Dice",
        "description": "From the Instruction Manual:&#10;&#10;The Marvel Heroes Battle Dice game recreates the epic battles of the heroes and villains in the Marvel comic domain.  With this starter set, you and a friend get everything needed to play the Battle Dice basic game, including figures, battle dice, battle mats and these rules.&#10;&#10;&#10;     * *&#10;&#10;&#10;In Marvel Heroes Battle Dice, you and your opponent place your Marvel figures in your battle dice to fight each other in epic battles.  Every time you win a fight, you capture your opponent's figure.  Once you capture all of your opponent's figures (your foes), you win!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "RAN",
        "description": "(from GMT website:)&#10;&#10;RAN is the 12th volume in the &quot;Great Battles of History&quot; Series, and the second game on the battles of the Samurai (following GMTs Samurai (Vol. V). RAN covers several of the less famous of the Sengoku Jidai, the Age of Warring States (more or less), in which powerful Daimyo - Japanese feudal lords - strove to both maintain and extend their power bases while seeking to attain the office of Shogun, the power behind the throne of the Emperor.&#10;&#10;RAN simulates the highly personal form of warfare developed by the Japanese samurai, wherein formal battles played out almost as backdrops to individual feats of courage, bravery and devotion much of it outstanding, some of it rather foolhardy, all of it very Homeric. Although political and tactical victory was the bottom line, collecting the severed heads of enemy samurai reigned a very close second in importance. In terms of tactics, this was, as in Europe, the Dawn of Modern Warfare, with the introduction of guns - arquebuses - by the Portuguese. Even with the revelatory effect of musketry, Japanese battles were still pretty much a swirling, non-linear affair.&#10;&#10;RAN, the name the famous Japanese film director, Kurosawa, chose for his samurai version of King Lear, roughly means &ldquo;Chaos.&rdquo;&#10;&#10;The Battles of RAN (all battles are one-half map, except for Tennoji):&#10;&#10;&#10;    MIMASETOGE (6 October 1569): The Takeda are trying to return to their castle base, and the Hojo are trying to intercept and ambush them with twice their number. A startling Takeda victory.&#10;&#10;&#10;&#10;    MIMIGAWA (11 November 1578) Interrupted while besieging Takajpo Castle, the Otomi retreat into the woods, then burst out to attack the Shimazu relief force, only to be outwitted by clever Shimazu tactics.&#10;&#10;&#10;&#10;    NAGAKUTE (17 May 1582): Tokugawa vs Ikeda, in a nice, small battle (less than 10,000 men each). Set piece affair fought over very difficult terrain &hellip; mountains, rice paddies, etc.&#10;&#10;&#10;&#10;    NUNOBEYAMA (14 February 1570): The Amako vs The Mori&#10;&#10;&#10;&#10;    OKITANAWATE (24 March 1584): The Ryuzoji vs The Shimazu&#10;&#10;&#10;&#10;    SURIAGEHARA (5 June 1589): Date Masamune (and his 23,000 men) hold off an initially effective attack by Asahina Yosohiro's 16,000 man army on relatively flat terrain. Key use of reserves.&#10;&#10;&#10;&#10;    TENNOJI (7 May 1615): One of the biggest battles of the era (and the only full map battle in the box). After Sekigahara, Hideyori, son of Hideysohi, challenges Tokugawa... the result is a battle with over 250,000 men and a swirling affair with lots of arriving reinforcements. &#10;&#10;&#10;COMPONENTS&#10;&#10;    5 Countersheets&#10;    2 22 x 33 battle maps, backprinted&#10;    1 Battle Rules Book&#10;    1 Battle Scenario Book&#10;    5 Charts &amp; Tables Cards&#10;    2 Record sheets&#10;    1 ten-sided die&#10;&#10;&#10;&#10;&#10;DESIGNERS: Mark Herman and Richard Berg&#10;ART DIRECTOR: Rodger B. MacGowan&#10;MAP ART: Leland Myrick&#10;&#10;",
        "artist": "Rodger B. MacGowan"
    },
    {
        "name": "Perikles",
        "description": "Perikles is a game from Martin Wallace. Players assume the role of a noble family seeking to become the leader of one or more of 6 ancient Greek city-states. The game plays out in two phases:&#10;&#10;In the first, players vie for area control in each of the six states, which end in elections. Players who win the election in each state can then &quot;control&quot; that state's army.&#10;&#10;In the second phase, players use cards to move their armies to attack or defend one of seven battles (each tied to a state, and you can't attack your own!) that are up for grabs that round.&#10;&#10;The gameplay mechanic is straightforward, with elements drawn from other Euro-style wargames (especially Martin Wallace's Struggle of Empires). What makes Perikles unique is the smooth integration of the area control/voting phase and the military phase.&#10;&#10;From the back of the box:&#10;&#10;&quot;Together the Greek City States had defeated the greatest power in the world, the Persians.  Now, though, pride and envy have led them to fight amongst themselves in what we know today as the Peloponnesian War.&#10;&#10;Each player represents a powerful Greek family with political influence spread across the six major city states of ancient Greece.  Players strive to become leaders of these cities, thus taking control of their military forces.  With these forces players will aim to win glory on the battlefield.&quot;&#10;&#10;",
        "artist": "Peter Dennis"
    },
    {
        "name": "Treehouse",
        "description": "Treehouse is a simple-yet-challenging Icehouse game that comes with 15 Icehouse pyramids, with three pyramids each in five different colors. A special D6 gives each player the option to Aim, Hop, Tip, Swap or Dig each turn, with the player trying to rearrange his initial &quot;tree&quot; of pyramids to match the three in the &quot;House&quot;, which serves as the goal for all players.&#10;&#10;Also included in Pyramid Arcade.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Giro Galoppo",
        "description": "Giro Galoppo is a horse racing game driven by cards for players 6 years and up.  Its mechanic is similar to &quot;Ave Caesar&quot;.  First, players take turns placing obstacles (jumps). All players receive an identical set of card with values 1-6.  Each turn the players simultaneously select one of their cards and show it.  The player with the lowest value (and for ties, farther back), moves first.  If your horse and rider land on another player's figure, you displace them backward.  If your figure's movement would land you on an obstacle, you lose your turn.  First &amp; farthest across the finish line wins.&#10;&#10;",
        "artist": "Barbara Kinzebach"
    },
    {
        "name": "Doktor Schlüsselbart",
        "description": "DOCTOR KEY-BIT is proof that even the best magic is nothing compared to good intuition. Doctor Key-Bit, the famous doctor of alchemy, comes home from his meeting of magical doctors and finds out that he has locked the doors to his enchanted castle by magic spell. But now he has forgotten the magic spell to reopen them.&#10;&#10;Players try to move Doctor Key-Bit on the game board from one room to another. They&rsquo;ll need good intuition, because they search through their bags &ndash; which are filled with different keys &ndash; for a key that fits. Each player moves Doctor Key-Bit to one of four different elixir bottles that are located in the rooms on the game board. Since each player looks for different elixirs, you&rsquo;ll need a perfect sense of touch to be successful.&#10;&#10;The first to move Doctor Key-Bit to four elixirs wins the game and helps the magician to prepare his potion for opening the doors.&#10;&#10;DOCTOR KEY-BIT trains the intuition, helps you become quick on the uptake, and teaches you to recognize extraordinary shapes.&#10;&#10;",
        "artist": "Victor Boden"
    },
    {
        "name": "Lightning Reaction Extreme",
        "description": "The game consists of four handles, each equipped with a button. Each player grabs a handle and the game is started. A red light starts to blink and a nasty wailing sound is played. Then, suddenly, the light will turn green and sound goes silent. At that point, players must push the button in their handle. The last player to do that gets an electrical shock. Players will also be shocked if they push the button while the light is still red.&#10;&#10;Lightning Reaction Extreme also includes an option to switch to &quot;Extreme&quot; mode.  In this mode ONLY the fastest button pusher is safe, while the rest are shocked.  In the original only the slowest is shocked.  Obviously this only makes a difference with 3 or 4 players.  With 2, it plays identical to the original.&#10;&#10;The game uses three AAA batteries, so the shock isn't dangerous but it certainly adds an element of tension to the otherwise rather simple test of reacting speed.&#10;&#10;Re-implements:&#10;&#10;    Lightning Reaction&#10;    Lightning Reaction Revenge&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Karo",
        "description": "Karo contains 24 black wooden tiles and 16 player pieces with unique markings on each side (8 red - 8 white).&#10;&#10;With these components you can play three different abstract games:&#10;&#10;VIER KREISE: A variant of &quot;Four in Row&quot;.&#10;SCHLEICHER &amp; H&Uuml;PFER: A race game.&#10;NIX WIE WEG: Try to move your pieces out of the playing field.&#10;&#10;More info: http://www.steffen-spiele.de/&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "ZombieTown",
        "description": "The dead are rising from the graveyard which is conveniently located in the middle of your residential neighborhood. There is no way out of the neighborhood, so you must scrounge as much stuff (weapons, barricades, survivors, etc.) from your neighbors to last until help arrives. The game lasts for 10 days, and by the 10th day the neighborhood is filled with zombies to say the least...&#10;&#10;In this game, designed for 3-6 players, each player represents one of the survivors in a neighborhood being overrun by zombies.  Players try to hole up and fight off the zombies while collecting victory points.  Points are awarded for killing zombies, finding guns or survivors and taking over houses in the neighborhood.&#10;&#10;Publisher's Page : http://www.twilightcreationsinc.com/zombietown/&#10;&#10;Expanded by&#10;&#10;    ZombieTown 2: Road Rage&#10;    ZombieTown 3: Big Boom Theory&#10;&#10;&#10;&#10;&#10;",
        "artist": "Dave Aikins,Sławomir Maniak,Patrick McEvoy,Kurt Miller"
    },
    {
        "name": "I Ain't Been Shot, Mum",
        "description": "From the publisher's web site:&#10;&#10;I Ain't Been Shot Mum is designed for company sized games in WWII, where each figures represents one man, each model tank one real AFV.  The game is designed to put the emphasis on command and control on the battlefield, with the players commanding a company a side plus a range of support platoons.  The rules cover infantry and armour combat between 1939 and 1945 and may be used with our four theatre specific handbooks which provide full information on organisational structures and weapon capabilities.&#10;&#10;The smallest tactical unit in I Ain't Been Shot Mum is the infantry section or squad of the weapons team with support weapons such as mortars or machine guns.  The basic command units are the platooons.  The rules handle fire by section or weapons team and the turn sequences are dictated by the Game Deck of cards which can be tailor made to suit any specific situation.  With sections covering infantry and armored combat, artillery and air support, and morale covered by the elegant and &quot;test-free&quot; shock system, the rules allow smooth flowing games where the players have minimal contact with the rules and maximum contact with the tactical situation.&#10;&#10;Included in the rules is the Normandy Handbook which covers the periond June to August 1944.  There is a scenario generator which will provide fast set-up games with no advanced planning, a section on writing historical scenarios and four specific scenarios, two starter games and two historical actions.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Travel Sequence",
        "description": "Travel Sequence is a trimmed down travel version of the original Sequence game.  The rules are the same, but the game differs from the original version in several ways:&#10;&#10;* The board contains 6x8 card rows vs. 10x10 in the original&#10; * Uses a single deck of cards rather than 2 decks&#10; * For 2 players only instead of 2-4 players&#10;&#10;It comes in a small, plastic playing case that contains a deck of miniature playing cards (standard poker deck) and 2 colors of pegs that mark players' cards on the cardboard playing board, which is integrated with the lid of the case.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "TEG: La Revancha",
        "description": "TEG - La Revancha (&quot;The Revenge&quot;) is a sequel and redevelopment of the original T.E.G. (T&aacute;ctica y Estrategia de Guerra - Tactics and Strategy of War), the version of Risk that is the most popular game of Argentina. This version introduces new features on the original game like missiles and  treaties among players.&#10;&#10;",
        "artist": "María M. Aramburu"
    },
    {
        "name": "Reversi",
        "description": "Introduction taking from the rules:&#10;&#10;Brain Trainer / Reversi is a game of concentration in which the players are able to develop their ability of logical thought and planning independently of each other. The game is a typical family game in which everyone participates with equal enthusiasm. Two persons play at a time. Also, you can play alone, trying to solve the code with as few moves as possible.&#10;&#10;Underneath the gameboard at the top you will find four sheets of different colours. These sheets are called code boards. The game is supplied with the green side A at the top. Place the pegs corresponding to this patten. Before playing you must turn the green board so that the reverse side B faces up. A pattern now appears with the colours arranged in vertical rows. Try - with the fewest possible moves - to place the pegs so that they coincide with this pattern.&#10;&#10;Unrelated to Othello.&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "Baron",
        "description": "The sixth game in the Tilsit Collection is Baron, a tactical hexagonal tile-laying game for 2 to 5 players set in the 11th century. Similar to 2002&rsquo;s release Himalaya, Baron was previously available as a free download under the name &quot;Combats des fiefs&quot; (Fiefdom Wars). Its warm reception by French gamers secured a publishing deal for its designer, Franz Gaudois.&#10;&#10;",
        "artist": "Olivier Fagnère"
    },
    {
        "name": "Destruct 3",
        "description": "One player builds a block tower in the center of the board, then the other players attempt to destroy the stack using either a ramp, catapult, or pendulum.  The destruction method each player uses is determined by a die roll.  Points are awarded to players (including tower builder) based on how successful/unsuccessful the destruction attempts are.  Tower building duties rotate among players.  First player to reach the end of the scoring track wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Double or Nothing",
        "description": "Double or Nothing is a fast paced, press-your-luck game that is perfect fun for groups of 3-6 players. How far will you push yourself to score points? Players take turns scoring or flipping over cards, looking to increase their points. Turn over the wrong cards and you will be out of the round.&#10;&#10;The last player in the round is forced to play Double or Nothing which can lead to mega-points or nothing at all. Once the seventh bonus card is turned over the game ends and the person with the most points wins.&#10;&#10;",
        "artist": "Damon S. Brown,Allison Kline,Arthur Wagner"
    },
    {
        "name": "Fleeced!",
        "description": "Wallace and Gromit's cracking new sheep rustling board game! It's 'Shear' fun and frustration for all the family! Devised by Nick Park himself - the creator of W&amp;G this promises to be huge fun.&#10;&#10;Wallace &amp; Gromit's Fleeced!: Sheep Rustling Game is a board game where players work their way around the streets seeking out fugitive sheep. Rustling them from their hideouts or from other players and herd them in long lines safely back home. But beware! Sheep rustling's a gamble! The more sheep you rustle - the more other rustling rascals will have their greedy eyes on your flock.&#10;&#10;",
        "artist": "Bill Kerwin"
    },
    {
        "name": "Cleopatra and the Society of Architects",
        "description": "Designed by Bruno Cathala and Ludovic Maublanc, Cleopatra and the Society of Architects is a fun and engaging family game that includes a true, three-dimensional palace that players compete to build. Players strive to become the wealthiest of Cleopatra&rsquo;s architects by constructing the most magnificent and valuable parts of her palace.&#10;&#10;Players, however, will be tempted to deal with shady characters and trade in materials of dubious origins in order to help them build faster. While these corrupt practices might allow an architect to stay a step ahead of the rest, they come with a high price &ndash; cursed Corruption Amulets honoring Sobek, the Crocodile-god. When Cleopatra finally strolls into her new palace, at the end of the game, the most corrupt architect (the one with the most amulets) will be seized and offered as a sacrifice to her sacred crocodile! Only then will the wealthiest architect, from among those still alive, be selected and declared the winner of the game.&#10;&#10;&ldquo;The component design in Cleopatra is the most innovative we&rsquo;ve undertaken to date,&rdquo; said Days of Wonder CEO, Eric Hautemont. &ldquo;While it&rsquo;s still a board game, the dozens of 3D pieces &ndash; Column walls, Doorframes, Obelisks, Sphinxes, and Palace Throne &ndash; all create the sense that you&rsquo;re constructing a royal palace.&rdquo;&#10;&#10;&ldquo;The game play really forces players into continually weighing the risks and rewards between taking enough corruption to enhance your position in the game, but not so much that you are forced out of the game at the end,&rdquo; said the game&rsquo;s co-designer, Bruno Cathala. &ldquo;It&rsquo;s a classic &lsquo;push your luck&rsquo; dilemma that continually raises the tension level higher and higher until the game reaches its climax.&rdquo;&#10;&#10;Description from the publisher.&#10;&#10;",
        "artist": "Cyrille Daujean,Julien Delval"
    },
    {
        "name": "EastFront II",
        "description": "Eastfront II is a update to the classic EastFront. It details the conflict between Germany and the Soviet Union during WWII. Players have to contend with production, supply, command control and weather to try and break the other side's lines.  Individual, linkable 6-month scenarios cover the war from June 1941 through May 1945.&#10;&#10;This title uses Columbia Games Block system, wooden blocks that stand upright with unit details only shown on one side, and rotate to take step reductions in strength. This provides a &quot;fog of war.&quot;&#10;&#10;EastFront II is part of a re-release of the entire EuroFront series; the new series consists of EastFront II, WestFront II, and EuroFront II.&#10;&#10;EastFront II includes two maps: each 22&quot; x 34&quot; for a 44&quot; x 34&quot; playing area. The map area includes the Trans-Volga area, the Balkans, and Baku and Finland. All of the original EastFront scenarios are included and the larger playing area improves them.&#10;&#10;",
        "artist": "David Pentland"
    },
    {
        "name": "WestFront II",
        "description": "Westfront II is the second edition of WestFront. It details the conflict between Germany and the Western allies during WWII. Players have to contend with production, supply, command control and weather to try and break the other sides' lines.  Individual, linkable 6-month scenarios cover the war from June 1943 through May 1945.&#10;&#10;This title uses Columbia Games Block system,wooden blocks that stand upright with unit details only shown on one side, and rotate to take step reductions in strength. This provides a &quot;fog of war&quot;&#10;&#10;WestFront II is part of a re-release of the entire EuroFront series. The new series consists of EastFront II, WestFront II, and EuroFront II.&#10;&#10;WestFront II includes two maps: each 22&quot; x 34&quot; for a 44&quot; x 34&quot; playing area. The map area spans all of western Europe from Spain to Norway. All of the original WestFront scenarios are included&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Chez Guevara",
        "description": "A new, stand-alone game with the same mechanics as Chez Geek. This time, the game revolves around &quot;Reluctant Revolutionaries.&quot;  Not completely compatible with other Chez games, but some cards can be used with the others, and vice versa.&#10;&#10;112 cards, Art by Greg Hyland.&#10;&#10;",
        "artist": "Greg Hyland,John Kovalic"
    },
    {
        "name": "HeroQuest Advanced Quest",
        "description": "HeroQuest Advanced Quest Edition (also known by the German version name &quot;HeroQuest Master Edition&quot;) is Milton Bradley's approach to a Dungeons &amp; Dragons-style adventure game.  One player acts as game master, revealing the maze-like dungeon piecemeal as the players wander.  Up to four other players take on a character (wizard, elf, dwarf or barbarian) and venture forth into dungeons on fantasy quests.  Miniature plastic characters and doll-house style furniture make this game very approachable.  Expansions were also released for this system.&#10;&#10;The HeroQuest series consists of the main game and number of expansions.&#10;&#10;HeroQuest Advanced Quest Edition adds 12 miniatures (&quot;black guards&quot;) with 4 kinds of detachable weapons and a new 13 part adventure &quot;The Dark Company&quot; to the basic HeroQuest Box.&#10;&#10;",
        "artist": "Les Edwards"
    },
    {
        "name": "Great Wall of China",
        "description": "This game lets each player take on the role of a Northern Chinese prince. His task: the construction of a massive wall. His reward: Honor everlasting! To gain the honor, though, requires some sweat. The requirements are the same for each player. Each player has a set of cards in his color: seven wall cards (worth 1 point), three gate cards (worth 2 points) and one watchtower card (worth 3 points). Additionally, each player gets nine more cards of varying point value and which may also allow special actions to be carried out.&#10;&#10;At the start of the game, each player shuffles his deck of 20 cards and places it face-down in front of himself. He then draws five cards from the deck. Now, depending on the number of players, 2 to 4 pairs of prestige tiles (with values from 1 to 8) are set out as the starts of card rows.&#10;&#10;On a player's turn, he first checks to see if he has a point majority in any of the card rows. Then, he carries out two additional actions. He has the choice of either drawing another card from the deck or adding cards to one of the rows. The added cards must  be identical. It is then the next player's turn.&#10;&#10;If, when checking point totals, a player sees that he does have one or more majorities, then he chooses one of the prestige tiles and puts it onto one of his cards in that row. That prestige comes at a price: as long as the second prestige tile isn't claimed, the value of the prestige is subtracted from that player's total for that row. Once the second tile is claimed (which can be by the same player on a later turn), then both winning players set the tiles they won aside to score. Two new prestige tiles are revealed and the prestige for that row replenished.&#10;&#10;The fight for prestige is also influenced by cards with special actions. For example, if a 'noble' card (1) is played, then the values of all cards in that row are reduced to 1. A 'dragon' card (1) can be played onto another player's card, neutralizing it. 'Cavalry' (2) are worth 2 points, and, equally valuably, do not cost an action. 'Infantry' (5) are strong in groups. A single 'infantry' card is only worth 1 point, but the next one is worth 2, and then 3, etc.&#10;&#10;The game ends either when one player has played his last card or when the last prestige tile is taken. Afterwards, each player gets one last turn and then all card rows are resolved in turn order. The player with the most prestige at the end of the game wins.  Players only receive prestige for tiles they have set aside for scoring.  Tiles remaining on wall segments do not score.&#10;&#10;",
        "artist": "Ted Nasmith,Marek Szyszko"
    },
    {
        "name": "Fischmarkt",
        "description": "Fischmarkt (or Fish Market) is, quite literally, a game of a fish market! Players take the roles of fishmongers who have to bid for the fish on the ships that dock at the harbor, then try to sell them off to the other players based on what each players market is demanding. There is no room for mercy here. Every deal is haggled to its final dollar, every offer cut-throat. At the end, only the shrewdest bargainer will emerge as the victor with the most money, at the expense of his competitors of course!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Hart an der Grenze",
        "description": "In Hart an der Grenze (Close to the Border), players are people trying to cross a border with luggage full of legal and also illegal goods.&#10;&#10;Each one declares what he is carrying, but of course he only declares what the law allows (even if it means telling a lie).&#10;&#10;Each turn one of the players takes the role of sheriff. The sheriff must choose who to spot check.&#10;In case the sheriff picks someone whose luggage does not have exactly what was declared, the person must open the luggage and show his goods. The not-declared goods are lost and a fine is paid.&#10;However, before opening the luggage, the person may always suggest that the sheriff take some of his dollars so as to be kind and let him pass. If they come to an agreement, good for them!&#10;During the whole game, players may also stock goods for the end, when the border is closed and the price is doubled. But only a limited amount of each good can be sold at this time. And the bigger traders in each kind of good will have the advantage of selling first.&#10;&#10;To sum up, Hart an der Grenze is a game with bluffing, negotiation, strategy and a lot of good laughs.&#10;&#10;Re-implemented by:&#10;&#10;    Robin Hood&#10;&#10;&#10;&#10;&#10;",
        "artist": "Michael Menzel,Anke Pohl,Thilo Rick"
    },
    {
        "name": "Toppo",
        "description": "From the Rio Grande Games website:&#10;&#10;Toppo is a fast card game with all players acting at once. Each player tries to get rid of his cards as quickly as possible by matching sets of three (or more) with the set showing on the layout on the table.&#10;&#10;Scan the Layout! Match your cards! Strike fast and win!!&#10;&#10;",
        "artist": "Christof Tisch"
    },
    {
        "name": "Times Square",
        "description": "An unusual, complex, yet tightly balanced board/card game for two from the prolific Reiner Knizia.  The original title, &quot;Auf der Reeperbahn...,&quot; alludes to a popular German movie from 1954.&#10;&#10;Near the center of a 17-space track start the six game figures which the players compete to attract to their opposite ends of the board.  You play as many cards of the same color on your turn as you wish, and much of the movement is a direct result of card play:  e.g., by playing a red 4 you bring the red figure (&quot;Rote Lola&quot; or &quot;Dancing Deb&quot;) 4 spaces closer to your end of the board.&#10;&#10;However, there are special tricks and restrictions which must be learned and held firmly in mind before the sense of the game begins to emerge.  The central green figure (&quot;Brilli-Lilli&quot; or &quot;Saucy Sue&quot;) which wins for you if the game ends with her on your half of the board, for example, can only move within the bounds of her &quot;bodyguards,&quot; two grey figures.  The yellow figure (&quot;Blonde Hans&quot; or &quot;Handsome Hal&quot;) can summon, without benefit of a card played, any of these three figures to his square.  The companion green figure (&quot;Schampus-Charly&quot; or &quot;Champagne Charlie&quot;) which can also win the game if you get him into one of the two spaces at your end of the board (your &quot;nightclub&quot;), only moves toward you if the board situation at the end of your turn involves both bodyguards on your half of the board and/or one of the other figures in your nightclub.  And so on.&#10;&#10;The game, part of the Kosmos two-player series, is one of attack and counterattack, defense and forward thinking, and can be won early or on the turn of the last card on the second time through the deck.  At 10-15 minutes, it begs to be played again immediately.&#10;&#10;",
        "artist": "Claus Stephan,Mirko Suzuki"
    },
    {
        "name": "Narnia Risk Junior",
        "description": "The popular series of Risk variants continues with this incarnation of Risk Junior set in the magical world of Narnia. Tying in with the hit film &ldquo;The Lion, The Witch, and the Wardrobe&rdquo;, this Risk variant allows you to recreate the climactic battle of the story.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Don Peperoni",
        "description": "Here is a description of the game from Spielbox:&#10;&#10;Don Peperoni, by Volker Cullman, is a 'fantastic adventures' game. In the sleepy village of Peperoni, all hell has broken loose. The mayoral election will be taking place soon, and multiple leaders of the community are vying for the prestigious position. No wonder that things are a little shady beforehand. Villagers are bribed, spies slink about, pistol-packing mercenaries and judges asked for help (or set onto opponents) - the police barely have the situation under control. And in the midst of all that, sometimes even the cleaning lady can make the competition shy. Don Peperoni is a not-really-meant-seriously bluffing game. June 2006.&#10;&#10;",
        "artist": "Christine Conrad,Hans-Georg Schneider,Tom Thiel"
    },
    {
        "name": "Zig-Zag",
        "description": "Hartmut Witt always has original game concepts, and he, along with Frank Schaubrenner, has created a fast-paced grab- and collecting-game that will thrill even expert speed-type game players. Rather unusual landscape types need to be crossed in this game: Clay flats, fields, hot sand, green lawns, water and cobblestones, even some rare blue-white or beige tiles. These landscapes are found on 28 large landscape cards, each of which again is made up of 18 landscape spaces, arranged in random fashion.&#10;&#10;The landscape cards get mixed up and distributed among the players (7 each with 3p and 4p, 8 with 2p - the rest go back in the box). Now, each player gets to set two particularly difficult cards aside and places the rest on the table to form a race circuit (the narrow sides of the cards are joined together). Thus, a different track with different challenges is created for each player. A goal card marks the goal for each player.&#10;&#10;Before the game can begin, 48 small cards are placed in the middle of the table as a face-down, spread out pile. Each card shows one of the landscape types mentioned above.&#10;&#10;As soon as the game starts, all players wildly grab through the pile of cards on the table. Cards, once revealed, are left face-up if they're not of immediate use. Cards that a player wants to keep are taken in hand. The order of the cards being collected, though, cannot be altered in any way. The collection phase ends when there's only face-up cards left on the table and a player calls &quot;stop&quot; because he thinks he has enough cards.&#10;&#10;Now, the players will see how far they get along their track with the cards they collected. The player who called &quot;stop&quot; starts. He turns the first card he collected over. If it's sand, for example, he puts his marker on a sand space at the start of his course. Thereafter, each subsequent card must show a landscape type that is next to the one his marker is on (either sideways, forwards or diagonally forwards) for him to move forwards. As soon as a card comes up that doesn't allow him to move his marker, his turn is over. Collected cards that are left over are put back into the middle of the table (face-down), and the figure stays where it managed to get to. Each player in turn order then does the same, moving their figure and returning leftover cards. Continue in this manner, round after round, until one player reaches the goal, ending the game. That player is of course the winner.&#10;&#10;Description of the game from Kosmos.&#10;&#10;",
        "artist": "Michael Menzel"
    },
    {
        "name": "Asterix & Obelix",
        "description": "This is a game in the Kosmos two-player series.&#10;&#10;Description from Kosmos:&#10;&#10;In this two-player game featuring Gallic heroes Asterix &amp; Obelix, the occupying Romans wear the usual costume for those stationed here: bumps and bruises.&#10;&#10;New Roman overseer Zenturio has let the money-hungry Gallic chief Moralelastix convince him to mount an operation against his little village. As usual, the question isn't &quot;Will the Romans get beat up?&quot;, it's &quot;How badly will the Romans get beat up?&quot;&#10;&#10;The two players play as Asterix and Obelix. Each takes the matching playing figure as well as a set of 15 beating cards (3 cards in each of 5 different colors), which he places in front of himself as a face-down deck. Each player takes the top 5 cards in hand. In addition to the beating cards, there are Roman cards. Most of them show Roman Legionnaires (in 5 different colors), but there are also Pirates, Wild Boars, the traitor Moralelastix and 5 Village Feast cards.&#10;&#10;The 40 cards are well shuffled and placed as a face-down pile. Then, the top 16 cards are drawn and placed face-down on the table in classic Phalanx formation (4x4 grid). The remaining cards act as a draw pile.&#10;&#10;The player with the longest mustache (or alternately the biggest belly) begins. He places his figure in front of one of the four Phalanx rows and turns the topmost card over. A red Roman! Red Romans can only get beat up by Red beating cards. If the active player doesn't have any, then the Roman card is turned back over again and that player's turn is over. If he does has a red card, though, then he has to choose whether to end his turn (taking the beaten Roman as a trophy) or turn another card over, hoping to press his luck.&#10;&#10;A player can keep going until (in an extreme case) he's cleared an entire row of the Phalanx. In that case, the active player gets to refill his hand to 5 cards and then start in on another row. Of course, that may not be such a good idea. Because if he keeps going and finds a Roman card he can't beat up, then his turn is over and he receives nothing. All of the Romans he would have won are removed from the game instead. Players can reduce the luck a little bit, in that they can discard one card from their hand to look at the last card in the row where they placed their figure.&#10;&#10;When a player ends his turn (freely or because he was forced to), then he refills his hand to five cards and it is the other player's turn. Any holes in the Roman Phalanx are also filled back in with cards from the draw pile. Lastly, the player whose turn just ended gets to block the next player from trying one of the rows (either horizontally or vertically).&#10;&#10;Of the 40 Roman cards, only 30 show actual Romans (as well as Zenturios himself). The remaining 10 cards are: 3 Pirates, 1 Wild Boar, Moralelastix, and 5 Evening Feasts. Pirates are easy to beat: Any card will do. To get Moralelastix, two cards of a single color are needed. The Wild Boar ends the player's turn immediately, but he gets to keep the Romans he beat up on so far. If a Feast is revealed, nothing happens and the player gets to keep going. Revealed Feasts are set aside, and once the fifth Feast shows up the game is over.&#10;&#10;Now, the players count their victory points. The purple point goes to the player who got Moralelastix. A brown point is for the most pirates. The majorities in the five Roman colors are worth the red, blue, yellow, green and black points, respectively. The player with the most victory points wins.&#10;&#10;",
        "artist": "René Goscinny,Albert Uderzo"
    },
    {
        "name": "12 Thieves",
        "description": "In 12 Thieves, first published as The thief of Baghdad, each player leads a group of thieves and tries to gain the best booty for themselves, but the treasure is well-guarded in the palaces of Baghdad, so you must slip your thieves into the guard corps and attempt to bribe those you can't represent with one of your own.&#10;&#10;The player who plays their cards best and reacts most cleverly to the different situations will succeed in getting their thieves and guards well distributed in Baghdad, and therefore be the first to collect four pieces of treasure.&#10;&#10;",
        "artist": "Patricia Limberger,Michael Menzel"
    },
    {
        "name": "Buccaneer",
        "description": "Each player starts with five chips.  To take one of the ship cards, you have to have a stack of chips, the minimum number of chips for each ship being shown on the card.  Making the stacks higher is the game's signature gimmick (originating in Die Safeknacker):  On your turn, you can take one of your chips, or one of your stacks, and put it on top of one chip or stack of another player, and are then the proud owner of the entire stack.  Trouble is, you can't SPEND the stack on a ship until your next turn, by which time somebody else may have taken it away from you by the same process.&#10;&#10;Scoring in Die Safeknacker was very streamlined and elegant:  You scored the value of the card when you took it and paid off the other players the values of their chips in your stack.  In this new version there are complications (tokens to collect, a consolation prize for the player next to the top in the stack) which give you a little more to think about.&#10;&#10;Re-implements:&#10;&#10;&#10;     Die Safeknacker&#10;&#10;&#10;",
        "artist": "Jo Hartwig"
    },
    {
        "name": "Winged Horse: Campaigns in Vietnam, 1965-66",
        "description": "Winged Horse: Campaigns in Vietnam, 1965-66, is a simulation of the critical fighting that marked the first months after massive conventional US intervention into the Second Indochina War.&#10;&#10;This is a two player wargame of intermediate complexity designed by Joseph Miranda. One player controls the Communists, the other the Free World Forces. Each game turn equals one week, and each hexagon represents 25 miles. The units of maneuver for both sides range from battalions up through regiments, brigades and full divisions. The game includes one full-size (34x22&quot;) large-hex map and 280 half-inch, NATO-style, counters. All of South Vietnam, plus the border regions of Cambodia, Laos and North Vietnam are on the map, and the orders of battle include all the units of both sides that participated historically.&#10;&#10;There are two scenarios: one short, with only five game turns in the autumn of 1965, and the other long, covering the entire period of the early American war with a full 20 game turns. The rules contain approximately 16,000 words, which works out to two experienced players being able to get through the campaign game in one long session of about six to eight hours.&#10;&#10;",
        "artist": "Nicolás Eskubi"
    },
    {
        "name": "Yspahan",
        "description": "1598. Yspahan the fair becomes the capital of the Persian empire. Thus, being placed at the center of the world, the city enjoys a period of cultural and economic blossoming. The cities and villages of the region intend to take advantage of this expansion. Caravans loaded with goods and jewels set out for the desert, bearing the promises of a radiant future....&#10;&#10;The players embody merchants trading with Yspahan. Meaning to take advantage of the coming of the Shah&rsquo;s supervisor, they score points by placing their merchandise in the right shops, by sending them to the caravan, and by constructing buildings.&#10;&#10;In Yspahan, players draft their action for the turn in order, but a roll of the dice determines which actions are available and how powerful they will be. You can earn points in the short-term by claiming shops in the city or by sending your traders to the caravan. You can also improve your infrastructure by constructing buildings that improve your actions or picking up action cards that give you extra options. Every 7 turns (each &quot;week&quot;), points are scored in the city and caravan, and after 3 weeks, the wise traders will see who among them has profited the most...&#10;&#10;",
        "artist": "Arnaud Demaegd,Mike Doyle (I)"
    },
    {
        "name": "Pecking Order",
        "description": "Here is a description of the game from Spielbox:&#10;&#10;Pecking Order was first known as Auf die Palme (&quot;Onto the palm tree&quot; - This is a reference to the German proverb &quot;to bring someone onto the palm tree&quot;). It is a card game by Richard Garfield and George Elias. Two players fight it out with 12 birds of varying values, trying to claim the 10 best feeding locations in the palm of a hand. But since only one bird is allowed at any one space, there's competition. The object of the game is to cleverly place your birds, bluff, and not cheat - even if the engaging theme makes you want to. The player who claims the best feeding spaces is the winner.&#10;&#10;From the box:&#10;For 2 players ages 8 and up.&#10;&#10;",
        "artist": "Doug Kovacs"
    },
    {
        "name": "Duplik",
        "description": "Duplik, first published as Portrayal (then Identik) is a funny, fast-paced, family and party game that tests each player's ability to describe, draw, and evaluate wacky images.&#10;&#10;In each round of Duplik, one player (the Art Director) describes a unique and utterly bizarre image while the other players (the Artists) attempt to draw the image based solely on the Art Director's description.&#10;&#10;Once time is up, Artists trade drawings and the ten hidden criteria for the image are uncovered. It&rsquo;s up to each Artist to decide whether the drawing he or she is judging meets the criteria and receives points.&#10;&#10;",
        "artist": "William Jacobson,Amanda Kohout"
    },
    {
        "name": "Steel Wolves: The German Submarine Campaign Against Allied Shipping – Vol 1",
        "description": "(from Compass Games website:)&#10;&#10;Steel Wolves is a solitaire simulation of the German submarine war against British and Allied shipping, the follow-on title to the award winning Silent War. Volume I covers the period from the start of the War in 1939 to the early months of 1943. You serve as BdU, Befehlshaber der U-Boote; the Supreme Commander of Uboats, Kriegsmarine. Your mission is to deploy your forces with maximum effect to destroy British and Allied shipping, while limiting your own submarine losses.&#10;&#10;Featured scenarios cover actions ranging from famous short single sub patrols, through short campaigns, ending with the full campaign covering 1939 to 1943. The game map breaks the Atlantic, Mediterranean, South Atlantic, and Western Indian Oceans into historical Operations Areas through which subs patrol in search of shipping.&#10;&#10;Special rules feature historical events such as the invasion of Norway and Torch; b-dienst, ULTRA, and the intelligence war; torpedo improvements, German wolfpack tactics, Super-Skippers, large vs. small U-boat philosophy, appeals to Berlin for resources, and many others. Every German sub deployed between 1939 and 1943 (as well as some what-if classes) is represented with its very own counter, each meticulously and accurately drawn and shown from their side in full-color. Players familiar with Silent War will find Steel Wolves takes the system to new depths, while those trying it for the first time will be able to quickly get into action!&#10;&#10;",
        "artist": "Brien J. Miller"
    },
    {
        "name": "Spartacus",
        "description": "From the Publisher's website:&#10;&#10;Spartacus is a two player, card-driven, point-to-point simulation pitting a loose coalition of forces under Sertorius against the Roman Republic as restructured under Sulla and his lieutenants.&#10;&#10;As the Sertorian coalition, your objective is to force the Republic into collapse in order to rebuild it as it was before the Sullans changed the constitution. This is done through putting pressure on the Republic by territorial conquests, by exacerbating the tensions in the Republic, forcing it to utilize the services of new, potential Sullas to counter your armies in the field, or by taking Rome itself!&#10;&#10;As the Republic, you must defeat and neutralize Sertorius quickly, before he can conclude an alliance with Mithradates VI and cause a two-front war. However, the levying of too many troops to fight the enemy coupled with the utilization of ambitious generals can bring on the very circumstances you are trying to avoid, collapse of the Republic. In addition, care must be taken with Italy itself because in the background, civil war looms in the guise of Lepidus, and even worse, a slave revolt under the able gladiator-leader, Spartacus.&#10;&#10;Both sides can battle their adversaries using conventional forces, conduct guerrilla and pacification operations with the intention of denying your opponent control of strategic spaces and provinces, and attempt to hasten or delay the political collapse of the Republic. The central mechanism that influences all actions in the simulation is the Republican Crisis Track, which monitors the level of crisis in the Republic. All actions on the battlefield, the state of the empire, the strain of recruiting legions and utilizing ambitious generals, and the use of power politics, are ultimately reflected on the Crisis Track. The Sertorians hope to move the track towards heightened crisis while the Republic hopes to keep it well away from a political collapse. In the end, if the Republic manages to avoid collapse, it can still lose by having a strong, Sertorian presence on the board.&#10;&#10;Spartacus requires the player to successfully exercise many facets of military-political acumen in order to defeat his opponent while preserving the most precious asset of all, survival.&#10;&#10;",
        "artist": "Mark Mahaffey"
    },
    {
        "name": "Red Storm over the Reich",
        "description": "(from Compass Games website):&#10;&#10;Red Storm Over the Reich is a Ted Raicer game covering the epic final campaigns of WWII on the Eastern Front, as the forces of the Soviet Union smashed the German armies defending Poland, East Prussia, and Pomerania, and advanced across the Oder to Berlin. Included in the game are three scenarios.&#10;&#10;The first scenario is historical, which finds the German forces out of position. Their armies will likely be shattered on the first turn, but the victory conditions are tough on the Soviets&ndash; they must do at least as well as historically.&#10;&#10;Scenario two has the historic forces, but allows the Germans to implement Operation Sleigh-ride, a sane pull-back of the main defense line along the Vistula out of range of the opening Russian barrage (an operation historically nixed by Hitler) that at least allows for a more orderly flight.&#10;&#10;Scenario three combines Sleigh-ride with reinforcements from other fronts. It assumes that Hitler has had an incapacitating stroke in late November or early December, and the new Nazi leadership is sufficiently uncertain of its position that it defers in military matters to Guderian. The Ardennes Offensive is cancelled, as are the attempts to relieve Budapest, as well as substantial forces are evacuated from the Courland pocket. This increases German strength on the main eastern front by approximately 50% and doubles German tank strength, which, when combined with Sleigh-ride gives the Germans some serious fighting strength.&#10; Scenarios one and two can be completed in 8-12 hours and scenario three in 12-16 hours, depending on your individual playing style.&#10;&#10;Red Storm is the opposite of 1941 East Front Games: The Soviets have assembled a massive force and will rip gaping holes in the German lines through blitzkrieg-style attacks. The German player must somehow piece together a desperate defense only to have it repeatedly blown apart by the enemy. But time is the enemy of both players in this game. The Soviets need to accomplish their victory by the end of the last turn, satisfying the historical timeline, or they lose the game, and the Germans must delay the Soviet assault on Berlin long enough to prevent the Soviet win.&#10;&#10;The rules for Red Storm Over the Reich are moderate in complexity but feature enough chrome for both sides to recreate this desperate campaign. Special rules include: the creation of Kampfgruppe divisions (or not), naval evacuations, panzerfausts, Volksturm divisions, Leaders, Soviet Logistical Constraint, Hitler mandated attacks and more!&#10;&#10;Included with each game are two maps each 22&rdquo; by 34&rdquo;, two sheets of counters (456 total), rules, set-up charts, tables, dice and game box.&#10;&#10;",
        "artist": "Todd Davis"
    },
    {
        "name": "aBRIDGEd",
        "description": "&quot;A Revolution in Bridge! aBRIDGEd is a streamlined version of the classic Bridge card game. This engaging and easy-to-learn game [20 minutes to learn] plays just like Bridge &mdash; but without the complex bidding.&quot; Two decks are included, each with colored cards numbered 2-14. Teams are chosen and 13 cards dealt to each player. Then each player declares Pass or Play, depending on whether they think their team can win at least 10 of the tricks. If a player says Play in Round 1, they are the &quot;dummy.&quot; They lay all their cards down and declare which color will be trump (or no-trump). Each player then declares their hand's pip strength (small dots on some cards) and color count (largest quantity of one color in their hand). Starting on the dummy's left, cards are played. You must follow suit if you can; highest card  of the 4 wins. [Note: if no one calls play in Round 1, players will bid on how many tricks their team can win.] After 13 tricks, one team scores points as indicated on a chart. If the declaring team fails to make their bid, the opposing team scores. Play ends after four rounds.   &#10;&#10;&#10;",
        "artist": "John Kovalic"
    },
    {
        "name": "T.E.G.: Plan Táctico y Estratégico de la Guerra",
        "description": "This is a Risk version that is played in Argentina.&#10;This game is about a war that takes place over a map divided in 50 countries. Each player has a secret objective to achieve, and must expand his domain and reorganize his forces which will demand undertake attacks and defend from attacks from his opponents.&#10;As well as the secret objective, there's also a shared objective to every player: occupy 30 countries. The first player to accomplish his secret objective or the shared objective, wins.&#10;&#10;",
        "artist": "María M. Aramburu"
    },
    {
        "name": "10 Days in Asia",
        "description": "From the back of the box:&#10;&#10;You have 10 DAYS in ASIA - touring by train, airplane, ship, or on foot. Chart your course from start to finish using destination and transportation tiles. With a little luck and clever planning, you just might outmaneuver your fellow travelers. The first traveler to make connections for a ten day journey wins the game.&#10;&#10;In this fourth installment of the 10 Days in series, the players are touring Asia, arranging their tiles on the ten days (open spots) of their trays to create a string of consecutive steps that, once completed, creates one consecutive journey. Tiles of neighboring countries may be placed side-by-side on the tray, with trains, ships and airplanes connecting distant countries depending on where they are located. Tiles cannot be rearranged in a tray, but must be replaced one at a time from the few face-up tiles available to all players, or from a random draw.&#10;&#10;This installment introduces railroads which allow players to connect any countries that have stops along a selected rail line. These work in addition to the now-familiar airlines (connecting countries of the same color), and ocean liners (although now you have two oceans to contend with).&#10;&#10;",
        "artist": "John Kovalic,Cathleen Quinn-Kinney"
    },
    {
        "name": "MixUp",
        "description": "MixUp - The Game Where Color Takes on Shape!&#10;&#10;In this two-player abstract, players try to place tiles in an arrangement of 4-in-a-row or a 2x2 square &mdash; one player goes for shapes, the other is using colors. There are three shapes in three colors, 54 tiles total, one shape per tile. The board is a tilted easel; you slide your tile down one of the 7 grooves till it reaches the lowest available spot. After that it can't be moved. The four-in-a-row may be vertical, horizontal or diagonal. The trick is to concentrate on your objective (color or shape) while keeping an eye on what your move does for your opponent. The first player to complete a row or square of a common color or shape is the winner.&#10;&#10;",
        "artist": "John Kovalic,Cathleen Quinn-Kinney"
    },
    {
        "name": "1066: End of the Dark Ages",
        "description": "1066: End of the Dark Ages is a wargame of intermediate complexity, designed by Joseph Miranda, simulating the historic struggle to gain control of Britain during that crucial year of the 11th century.&#10;&#10;That struggle saw the Anglo-Saxons, under King Harold, defeat the Vikings, only to in turn be defeated by the Normans from France led by Duke William. His victory eventually led to the establishment of the modern British nation. 1066: End of the Dark Ages can be played by two, three or four, each representing a different side: Anglo-Saxons, Normans, Vikings and Britons (the latter representing an amalgamation of the various peoples then indigenous to the island).&#10;&#10;Each of the 12 game turns represent a calendar month. Each fully iconic, large-size, unit represents roughly 1,000 to 5,000 fighting men or key individual leaders along with their elite 'household' troops. Each square on the 34x22&quot; map represents 40 miles across, with all of England, Wales and southern Scotland, as well as the north coast of France, depicted on it.&#10;&#10;Each player has a variety of military and political instruments with which he can attempt to gain control of Britain. Every tactic and stratagem available historically to the would-be kings of England &ndash; from diplomacy through treachery, the laws of fealty and homage, vassalage, appeals to the Pope, assassination, pillage, shield walls, fortification, heavenly omens, gold, spies, rebellion, navies and, of course, savage warfare &ndash; are again in play here.&#10;&#10;The game contains one scenario, with adaptive rules that allow it to be played by two, three or four opponents. The rules contain approximately 14,000 words, which will allow experienced players to get through a complete game in about four to six hours.&#10;&#10;",
        "artist": "The Bayeux Tapestry,Nicolás Eskubi"
    },
    {
        "name": "Battles of Napoleon: The Eagle and the Lion",
        "description": "&quot;Battles of Napoleon&quot; is a new boardgame series with the goal of re-creating Napoleonic warfare at a tactical and operational level, using 1/72 figures to represent units and formations on modular game boards.&#10;&#10;The rules are of average complexity, with enough detail to simulate the most important features of the battles of the Napoleonic age, such as formations, maneuver, the relevance of combined arms. At the same time, they are simple enough to be fun and playable for beginners.&#10;&#10;Each set in the &quot;Battles of Napoleon&quot; series will include unpainted figures, modular boards, terrain elements, cards, dice, rules and scenarios. Different sets can be combined together to create larger battles.&#10;&#10;",
        "artist": "Mike Doyle (I)"
    },
    {
        "name": "Guru",
        "description": "From the makers of Kaivai, this game sees players controlling Guru who try to influence the masses to come under their sway.&#10;&#10;A card game.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Axis & Allies: Battle of the Bulge",
        "description": "From Avalonhill web site:&#10;&#10;German tanks thunder into the snow-covered Ardennes forest, opposed only by a few unsuspecting divisions of exhausted American troops. As Axis forces plunge into the countryside, Allied troops must struggle to hold the front line in order to repel the all-out offensive. Axis &amp; Allies: Battle of the Bulge challenges you to control territory and contend with supply shortages, while directing infantry, artillery, tanks, and aircraft in one of the most decisive conflicts of World War II.&#10;&#10;Scheduled for release in November, 2006, Axis &amp; Allies Battle of the Bulge will feature detailed game components including a new truck piece, a hex-based game board with new original artwork, and original artwork commissioned exclusively for the Battle of the Bulge game box. Other elements of this new Axis &amp; Allies variant include crucial elements that were key factors in the historical battle, such as supply shortages and late-battle air support, mechanics for overland vs. road movement and randomized casualties of war&#10;&#10;Axis &amp; Allies depicts Wacht am Rhein (Watch on the Rhein), the German code name for this counteroffensive that took place toward the end of World War II. The objective: to capture the port city of Antwerp. It was expected that the capture of Antwerp would cause a great disruption in the flow of Allied supplies, and also have the effect of breaking apart the great Anglo-American alliance.&#10;&#10;One player controls Germany, whose massive build up of forces have gone undetected by the Allies and are poised to unleash all their fury on the Allies. The other player controls the forces of the United Kingdom and the United States and they must stem the tide of German armor and hold their positions until reinforcements arrive.&#10;&#10;Axis &amp; Allies Battle of the Bulge is designed for two players and can be played in three to four hours. Axis &amp; Allies Battle of the Bulge is the fourth Axis &amp; Allies variant, following the successful Axis &amp; Allies D-Day, Axis &amp; Allies Europe and Axis &amp; Allies Pacific versions. Axis &amp; Allies Battle of the Bulge is available on November 17th, 2006.&#10;&#10;Box Dimension: 15.8 x 10.5 x 3&#10;&#10;",
        "artist": "Blake Beasley,Leon Cortez,Tommy Lee Edwards"
    },
    {
        "name": "On the Dot",
        "description": "On the Dot - The Super Spotted Brain Teaser&#10;&#10;A card representing a combination of several colored dots is placed on the table. Each user has 4 transparent plastic cards also with colored dots in different positions and has to superimpose them to obtain the same combination as the card on the table. This is done by rotating and flipping the cards and trying them in different orders. One difficulty is that you will have to hide some of the dots on cards you placed underneath, to obtain the right combination. The first player to match the pattern shouts &quot;Vitrail!&quot; (or &quot;On the Dot!&quot; or &quot;En el Punto!&quot;) and if their copy is correct they win the card. The game can also be played solo, by seeing how many cards you can re-create in a set amount of time.&#10;&#10;The box (an oversized tin) contains: &#10;16 (4&quot;x4&quot;) transparent cards (four sets of four identical cards, with one each of red, yellow, green and purple dots scattered on them)&#10;64 one-sided combination cards&#10;Rules&#10;&#10;",
        "artist": "Ségoléne de le Gorce"
    },
    {
        "name": "Prussia's Defiant Stand",
        "description": "In 1756, Frederick the Great launched a preemptive strike on Saxony and his archenemy Austria, sparking the Seven Years War and pitting the most powerful countries of Europe against the fledgling state of Prussia. Frederick's gamble nearly destroyed Prussia, but a few stunning victories over numerically superior forces, many delaying actions, British gold, and the timely death of Tsarina Elizabeth of Russia saved Prussia and ensured Frederick's place in history as a great general.&#10;&#10;Prussia's Defiant Stand recreates the fierce struggle for mastery of Central Europe. Using the well-proven, card-driven action system the game showcases the importance of maneuver, fortresses, sieges, supply, and the potentially costly option of winter campaigning. The countries of Prussia, Austria, France, Russia, and Sweden are represented with units for leaders and artillery, heavy and light infantry, cavalry, Cossacks, and fortresses.&#10;&#10;Players will have difficult choices in managing their cards as some can be used for &quot;commands&quot; to move units, or used to modify combat odds.  The game mechanics reflect the period's focus on maneuver for position and a &quot;Frictions of War&quot; table beautifully models the indecisiveness of many allied leaders.  This explains more than anything how the small nation of Prussia was able to withstand the combined weight of the most powerful states of the day.  Frederick himself attributed Prussia's survival more to the timidity of allied commanders than to his own actions.&#10;&#10;This game is available now at www.worthingtongames.com&#10;&#10;",
        "artist": "Sean Cooke,Anna Dorothea Lisiewska-Therbusch"
    },
    {
        "name": "Universal Fighting System: Street Fighter",
        "description": "Collect the major fighters of the Street Fighter video games and unleash their powers against your opponent by playing maneuver/power cards from your hand. The objective is simply to reduce your opponent's vitality to zero, but they can play their own defense cards to thwart your efforts.&#10;&#10;The combat system employs a &quot;progressive difficulty&quot; mechanism, which means the more you do in a turn, the harder your later actions become.&#10;&#10;UFS is modular and works with other games in the system, so you can have those epic Street Fighter vs. Soul Calibur or Penny Arcade battles.&#10;&#10;Compatible with:&#10;&#10;     Universal Fighting System: Soul Calibur III&#10;     Universal Fighting System: Penny Arcade&#10;&#10;&#10;&#10;&#10;",
        "artist": "Studio Sakka Team,Mark Anthony Taduran"
    },
    {
        "name": "Deluxe Camping",
        "description": "For the annual opening of the Deluxe Camping, tourists will try to occupy the best spots.&#10;&#10;Preparation:&#10;2 players : 6 camping-cars and 1 bungalow per player&#10;3 players : 4 camping-cars and 1 bungalow per player&#10;4 players : 2 camping-cars and 1 bungalow per player&#10;&#10;At each turn, each player can move his camping-cars and place fences to delimit territories.&#10;At the end of the game, the player with the biggest territory wins (adding and removing points if territory encloses swimming pool, ice cream man, ...).&#10;&#10;Online Play&#10;&#10;&#10;     Bo&#195;&#174;te &#195;&#160; jeux (turn-based)&#10;&#10;&#10;",
        "artist": "Stéphane Poinsot"
    },
    {
        "name": "HorrorClix",
        "description": "Players assemble teams of monsters from across the horror spectrum &mdash; including vampires, zombies and werewolves &mdash; and then protect the innocent, eat them or both in a delightful, gore-filled romp! HorrorClix uses plot twist cards, a heavy emphasis on scenario play and new character cards to explode the boundaries of CMGs and the patented Clix system.&#10;&#10;HorrorClix raises the bar for all miniatures games by shifting the game focus from hack-and-slash combat to inventive scenario- and story-based play. Additionally, it uses the combat dial to provide literally hundreds of tailor-made supernatural (and super-gruesome!) powers and abilities. Character cards flesh out each monster with fiction and detailed explanations of each creature&rsquo;s capabilities, including mechanics never before seen in miniatures games!&#10;&#10;All miniatures come pre-painted with stat cards, and are available in a starter set, boosters and special collectors sets including H P Lovecraft's Ancient One; The Great Cthulhu!&#10;&#10;Sets released:&#10;&#10;Horrorclix: Starter Set&#10;Base Set (Booster Expansion)&#10;The Lab (Booster Expansion)&#10;AVP Aliens Collectors Set&#10;AVP Predators Collectors Set&#10;AVP Alien Queen Collectors Set&#10;Freakshow (Booster Expansion)&#10;The Great Cthulhu Collectors Set&#10;Nightmares (Booster Expansion)&#10;Freddie vs. Jason Collectors Set&#10;Hellboy and the BPRD Collectors Set (Not technically a Horrorclix release- more a Heroclix release which can also be used with Horrorclix!)&#10;&#10;Horrorclix was considered discontinued as of 2010.&#10;&#10;",
        "artist": "Shane Hartley,David Wahlstrom"
    },
    {
        "name": "Ingenious: Travel Edition",
        "description": "It's Einfach Genial/Ingenious in a 2-player travel version.&#10;&#10;The game is played on a hex board. 57 equally sized pieces, each consisting of two joined hexes come with the game. There are symbols on each hex that makes up the piece (sometimes identical symbols). The pieces are drawn randomly in the game. Each player receives six pieces to start the game, which are placed onto a rack and visible to them alone.&#10;&#10;The goal of the game is, through clever placement, to obtain points in the different symbol colours. Points are claimed by placing a piece into any open space such that the symbols on it lie next to already-placed pieces with the same symbol. So, for example, if a player places a piece with a purple circle on it such that it sits next to an unbroken line of four other purple circles already on the board, then the player scores four purple points. A newly placed symbol can lie next to at most five individual rows of symbols.&#10;&#10;Each player uses a scoring track to keep track of his points &ndash; one track for each colour going from 0 to 18. If a player reaches the 18th space with any colour, then he gets to call out &ldquo;Genial!&rdquo; and take another turn.&#10;&#10;At the end of their turn, players draw as many tiles out of the bag as required to bring their rack back up to six.&#10;&#10;The game ends when no more tiles can be placed onto the board. Now each player looks to see how many points they scored in the colour they scored the least in. Whoever has the most points in their least-scored colour is the winner.&#10;&#10;In the full game, there are 5 of each double and 6 of each pair of colors, the travel edition has 2 of each double and 3 of each pair.&#10;&#10;Einfach Genial - Reiseedition is part of the Kosmos two-player series.&#10;&#10;",
        "artist": "Michaela Kienle"
    },
    {
        "name": "Terra Prime",
        "description": "From the back of the box:&#10;&#10;It was on October 24th that Admiral Jaffee took the fleet and departed back to Terra &ndash; a war-torn wasteland that used to be rich with life.&#10;&#10;The Terran Federation has commissioned this space station, at the farthest reaches of the known universe, because they believe there are habitable planets here. I know you are young fledgling captains and you have your doubts, but know this... You must complete Terra Prime and colonize these planets! The great Terran fleet may never return; it&rsquo;s up to you to develop a stronghold for humanity here. Watch out for hostile aliens, and don&rsquo;t forget Federation Military code 626.B.7.i...  One of you will become admiral.&#10;&#10;Good luck, Captains... our future is in your hands!&#10;&#10;&#10;     Explore uncharted space.&#10;     Deploy cryogenically frozen colonists.&#10;     Gather and utilize the rare resources Bluium, Greenium, Yellium, and Brownium.&#10;     Customize your ship with Weapon, Shield, Cargo, and Thruster modules.&#10;     Use upgraded technology to improve your capabilities.&#10;     Fight aliens!&#10;     Dodge Asteroids!&#10;&#10;&#10;",
        "artist": "Josh Cappel"
    },
    {
        "name": "Straw",
        "description": "Straw is a light-hearted family card game that takes place in the world of Arabian Nights. In Straw, you try to pack as many items as you can on top of a camel without breaking its back. If you can't, you lose the round &ndash; but other players must be careful not to load the camel too close to its limit because if you can break the camel's back with the Straw card, you win instead of losing!&#10;&#10;Will you be the one who breaks the camel's back?&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Four Battles of Army Group South",
        "description": "Four Battles of Army Group South consists of four completely separate regimental/divisional level games, each with its own 17&quot; x 22&quot; five-color map, unit counters and rules.&#10;&#10;All four games use a set of Standard Rules derived from Panzergruppe Guderian as the basic core game rules.  Each game then, has it's own set of Exclusive rules.&#10;&#10;Kiev: The Battle of Encirclement, 1941, is a simulation of the German Blitzkrieg campaign from 29 August to 26 September 1941.  It ended with the largest encirclement in history: 665,000 Soviets were destroyed; 3718 guns and 884 armored fighting vehicles captured; and the remains of the great Soviet prewar army of April 1941 was finished as a fighting force.&#10;2 days per turn, 5 miles / 8 kilometers per hex.&#10;&#10;Rostov: The First Soviet Counter-Attack, 1941, depicts the German drive across the Donets Basin in the fall of 1941.  Army Group South, accompanied by various Axis-Allied Armies, attempted to seize the valuable communications junction at Rostov and establish bridgeheads across the Donets and lower Don rivers.  In the fighting around Rostov, the Germans suffered their first strategic setback in their campaign against Russia, as the Soviet Army drove the German mechanized spearhead from this vital area. &#10;2 days per turn, 10.5 miles / 17 kilometers per hex.&#10;&#10;Operation Star: The Soviet Winter Offensive, 1943, the Soviet offensive towards Kharkov and Dnepr in February 1943 and the German counterattack that followed.  Strong Soviet forces attempted to take Kharkov and sweep to the south and west, cutting off all of Army Group Don.  Von Manstein formulated a daring counter-operation that called for the aggressive use of all available Panzer reserves. &#10;5 days per turn, 6.5 miles / 10.5 kilometers per hex.&#10;&#10;Korsun: The German Pocket on the Dniepr, 1944, depicts the battle of the encirclement - known to the Soviets as the Korsun Pocket and to the Germans as the Cherkassy Pocket - fought in late January and early February 1944, the largest German pocket since Stalingrad, only half the trapped German soldiers escape. &#10;2 days per turn, 4.6 miles / 7.5 kilometers per hex.&#10;&#10;Last in the series of SPI Quads.&#10;&#10;Game Inventory:&#10;Four 17 x 22&quot; five-color mapsheets&#10;Two dual-side printed countersheets (800 1/2&quot; counters)&#10;Two 8-page Army Group South Standard Rules rulebooks&#10;Two 4-page Army Group South Charts &amp; Tables booklets&#10;Four 4-page game specific rulebooks&#10;One 8-page AGS Historical Background booklet&#10;One 6-sided die&#10;&#10;Solitaire Playability: High&#10;Complexity Level: Medium&#10;Players: 2 or more&#10;Playing Time: 3 - 4 hours&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "Stargate Trading Card Game",
        "description": "Prepare to step through the Gate! In the Stargate TCG, you'll guide a team of characters on journeys to other worlds, overcoming obstacles, defeating adversaries, and completing missions along the way. All the fun and adventure of the hit television series is here to enjoy!&#10;&#10;As a trading card game, the Stargate TCG isn't limited to a single deck of cards that never changes. Hundreds of different available cards make for a huge variety of strategies, as you build your own decks from your personal collection.&#10;&#10;",
        "artist": "Colton Hoerner,Steve Thoma"
    },
    {
        "name": "Wings of War: The Dawn of World War II",
        "description": "1939. The German war machine starts steamrolling over Europe. Earth and sky are aflame with battles. It&rsquo;s the dawn of the largest war fought by mankind, and supremacy in the air can mean victory or defeat.&#10;&#10;The WW2 series of Wings of War is an easy, fun to play, fast and furious system which previous fans of the game will be able to start playing minutes after opening the box! New game mechanics support a simulation which must encompass planes with very different flight capabilities and firepower, while still keeping the flow of the combat simple as it is in the WW1 series. The innovations to maneuver cards and to the fire deck system provide all the needed historical accuracy with no headaches to the players!&#10;&#10;&ldquo;Dawn of War&rdquo; is the first set in the new series of Wings of War games, which will allow you to re-create dogfights, bombing missions, escorts, and endless other aerial combat situations set in World War Two. Including fighter planes from the first years (1939-1941) of the war, but also used later in the conflict, &ldquo;Dawn of War&rdquo; provides the foundation for a new, exciting evolution of the Wings of War system. Pilot a Spitfire, a Messerschmitt, a Hurricane, a Wildcat, a Zero... Up to 6 planes can fly with the contents of this set, for scenarios with 2 to 6 players.&#10;&#10;Part of the Wings of War series&#10;&#10;Re-Implemented by:&#10;&#10;     Wings of War: WW2 Deluxe set&#10;     Wings of War: WW2 Airplane Packs&#10;     Wings of Glory: WW2 Starter Set&#10;&#10;&#10;&#10;&#10;",
        "artist": "Vincenzo Auletta,Fabio Maiorana"
    },
    {
        "name": "Age of Empires III: The Age of Discovery",
        "description": "Designed by Glenn Drover, this boardgame allows you to revisit the age of exploration and discovery.  Take on the role of a colonial power seeking fame, glory, and riches in the New World.  As you proceed through three ages, you can launch expeditions of discovery, colonize regions, expand your merchant fleet, build capitol buildings that give your nation distinct advantages, develop your economy, and, if necessary, declare war.&#10;&#10;Though originally published for 5 players, the game is playable by 6 with the original components and board configuration with addition of a set of figures in another color.  This was originally offered as an &quot;expansion&quot; and an incentive to pre-order the game. A 6 player expansion is also in the Glenn Drover's Empires: Builder Expansion, along with new capital buildings and National Advantage tiles.&#10;&#10;Not to be confused with Age of Discovery.&#10;&#10;",
        "artist": "Paul Niemeyer,Jacoby O'Connor,James Provenzale"
    },
    {
        "name": "Risk: Star Wars Original Trilogy Edition",
        "description": "2 to 5 players    &#10; ages 10 and up&#10;&#10;There are 3 factions in the game, each with its own victory conditions.&#10;&#10;&bull;    The Rebellion must find and destroy the Emperor, who will be hiding at one of his Imperial Bases.   &#10;&bull;    The Empire must eliminate all Rebel forces.  &#10;&bull;    The Hutts must take control of 10 out of the 13 resource planets.&#10;&#10;Players choose to play as the Rebels, Empire, or Hutts and battle for domination of the Galaxy.  The Empire can use the Death Star to terrorize all and the Rebels can grow in the Force as the game goes on by attacking Imperial Bases.  Heroes and villains like Luke, Han, Darth Vader, and Boba Fett come into play on the many faction cards that can be played throughout the game. Each faction can enhance their attack with ships.&#10;&#10;The game includes 2 Death Stars and enough sculpted pieces representing the Rebels, Empire, and Hutt factions for 5 players.  The Risk game play has been updated and enhanced with cards, ships, and The Force to represent the Star Wars Original Trilogy.&#10;&#10;Re-implemented by:&#10;&#10;    Risk: Mass Effect Galaxy at War Edition&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "The Halls of Montezuma",
        "description": "(from GMT website:)&#10;&#10;The Halls of Montezuma is a fast paced game of the Mexican War which takes you back to the era of Manifest Destiny. The Halls of Montezuma is a Card Driven Game, allowing players the opportunity to recreate the various events and actions in Mexico from 1846 to 1848. The historical cast of characters is here, from Doniphan to Arista, Scott to Santa Anna. Even Lee, Jackson, Beauregard and Grant make appearances.&#10;&#10;Strategy card play allows you to move your forces, make events happen, activate the fleet, secure control of your lines of communication, and even invade Mexico with General Scott.&#10;&#10;The outcome is never a foregone conclusion. Victory comes from driving Mexico's political will down to zero; but each battle's outcome is in doubt - a few troops performing superbly can defeat many troops performing poorly. Mexico can achieve a quick sudden-death victory before the U.S. has declared war and can bring its force to bear.&#10;&#10;Will Santa Anna arrive early and retake Tejas?&#10;&#10;Can General Scott take Mexico City?&#10;&#10;Play The Halls of Montezuma and find out!&#10;&#10;Components:&#10;&#10;&#10;     Rules booklet&#10;     Deck of 110 Strategy &amp; Action cards&#10;     One 22x34 mapsheet&#10;     Player aid cards&#10;     Quick Start card&#10;     Two 5/8-inch counter sheets &#10;&#10;&#10;DESIGNERS Michael Welker &amp; David Fox&#10;DEVELOPER William Cooper&#10;COUNTER ART Rodger B. MacGowan &amp; Mark Simonitch&#10;MAP ART Tim Schlief&#10;CARD ART Mike Simonitch&#10;&#10;&#10;(BGG description:)&#10;&#10;HoM offers a single campaign scenario playable in two to three hours, given sudden death victory conditions. This makes the game ideal for an evening of friendly play as well as for tournaments and play-by-email.&#10;&#10;If you enjoy the other CDG's, HoM brings you the Mexican-American War in a format that hearkens to the design elegance and playing time of We The People &trade;, the ground-breaking game by Mark Herman. HoM uses mechanics and cards to capture the excitement, tension, and uncertainty of this rarely simulated conflict from American history, the war that was a training ground for so many generals who would become fierce enemies in a later conflict.&#10;&#10;Can Mexico emerge as a new North American power or will the United States fulfill its Manifest Destiny?&#10;&#10;",
        "artist": "Tom Lovell,Rodger B. MacGowan,Timothy Schleif,Mark Simonitch"
    },
    {
        "name": "Won by the Sword",
        "description": "(from GMT website:)&#10;&#10;Situation:&#10;&#10;The war raged across Germany from 1618 to 1630 with the Habsburg, Holy Roman Emperor retaining the upperhand. Then the tide of war changed when King Gustav Adolf of Sweden, the &quot;Lion of the North,&quot; revitalized the cause of the Protestant princes of Germany. Bankrolled by France, the Swedes pushed their advantage towards the Emperor's most valuable ally, Maximilian of Bavaria. Though Catholic, France sought to keep the power of the Habsburgs in check by financially supporting the Swedish King.&#10;&#10;From 1632 to 1648, Bavaria and the surrounding area became a crucial battlefront to knocking Bavaria out of the war. The Swedes enjoyed success until fate removed their King and their over-extended forces could not hold onto their gains. After the Swedes suffered a sharp defeat at N&ouml;rdlingen in 1634, France was forced to play a more active role or lose all she had paid for. A series of seesaw campaigns ensued as the French Arm&eacute;e d'Allemagne secured crossings of the Rhine and pushed the war back into the heart of Bavaria. The area became the proving ground of the greatest generals of the age - Turenne, Cond&eacute;, Mercy, de Werth. Neither side possessed a clear superiority of forces so it was a dangerous game of cat-and-mouse, march, counter-march, siege, and surprise attacks. After several years, a combined French-Swedish campaign finally broke the back of the Bavarians in 1646 and Maximilian made a separate peace. It did not last long; after a year he reluctantly rejoined the Imperial cause. Repeating the winning combination of 1646, the French-Swedish army ended Maximilian's enterprise at Zusmarshausen in 1648.&#10;&#10;&#10;The Game:&#10;&#10;Won by the Sword is the first game in Ben Hull's Great Campaigns of the Thirty Years War series. It is a two-player game of operational warfare in the 17th Century. Armies maneuver on a point to point map of Southern Germany based on the road network available at the time. Each game is centered around a major battle or full campaign season. A Turn is a month divided into a variable number of impulses. Each army has a hand of Campaign Cards that control the amount of activity it may perform, the supplies it must expend, and a special action. Each impulse features one card play per army. Forces are concealed off map so players are faced with limited knowledge of the enemy. The major activities are maneuver, foraging, besieging fortifications, and an occasional battle. Won by the Sword is a low-complexity game with emphasis on the players maneuvering their forces, but many decisions await. The low rules complexity allows each player, rather than being encumbered with rules, to focus on choices regarding how to manage his campaign.&#10;&#10;Battle Games:&#10;&#10;    N&ouml;rdlingen 1634&#10;    Tuttlingen 1643&#10;    Freiburg 1644&#10;    Mergentheim 1645&#10;    Alerheim 1645&#10;&#10;&#10;&#10;&#10;Full Campaigns:&#10;&#10;    1632 - The Lion of the North Goes South - Gustav Adolf's Campaign against Bavaria&#10;    1634 - Swedes are pushed out of the South&#10;    1638 - Weimar's Triumph - Duke Bernhard of Saxe-Weimar leads his German corps in French service to turn the tide of the war in the South&#10;    1644 - French battle to secure the Breisgau and Baden, Bavarians defend masterfully&#10;    1645 - Struggle for W&uuml;rttemburg - French and Bavrians fight a seesaw battle for control of W&uuml;rttemburg and N&ouml;rdlingen area&#10;    1646 - Turenne's Triumph - French and Swedes launch a joint campaign to bring Bavaria to her knees&#10;    1648 - The Bitter End - Zusmarshausen, again a combined French - Swedish force strikes into the heart of a resurgent Bavaria&#10;&#10;&#10;&#10;&#10;&#10;TIME SCALE: 5 to 7 days per Turn &#10;MAP SCALE: Point to Point&#10;UNIT SCALE: &#10;&#10;    Infantry Regiments = 800-1000 men&#10;    Cavalry Regiments = 400-500 men&#10;    Detachments = 200-300 men&#10;    Artillery Units = 8-10 guns&#10;&#10;&#10;&#10;&#10;COMPONENTS:&#10;    One 34&quot;x22&quot; map&#10;    Four countersheets&#10;    One deck of 55 cards&#10;    One Rules Booklet&#10;    One Campaign Booklet&#10;    One 8.5&quot;x11&quot; Battle Board&#10;    Two 8.5&quot;x11&quot; Player Force Cards&#10;    Two 11&quot;x17&quot; Player Aid Cards&#10;    One 10-sided die&#10;&#10;&#10;DESIGNER: Ben Hull&#10;DEVELOPER: Stephen Brasseur&#10;MAP ART: Knut Gr&uuml;nitz&#10;COUNTER &amp; CARD ART: Mark Simonitch, Charlie Kibler, and Rodger B. MacGowan&#10;&#10;",
        "artist": "Knut Grünitz,Charles Kibler,Rodger B. MacGowan,Carl Wahlbom"
    },
    {
        "name": "Crystal Faire",
        "description": "In a round, the first player makes two offers of four to six marbles to the other players.  Each of the other players make a counter offer.  The first player then picks one of the counter offers, and the person whose offer they picked then chooses one of the first bidders offers.  They then exchange marbles.  This leads to a round where the amounts that each color is worth.  Whomever bids the highest wins the amount of cash that the color is worth.  The person with the highest amount of cash at the end of the game is the winner.&#10;&#10;",
        "artist": "NA"
    }
]