[
    {
        "name": "Hexagony",
        "description": "This game was originally published by the designer as Bin'Fa under the company name Taoist Arts, Inc. It was released a few years later as Hexagony by Avalon Hill, and then again as Bin'Fa by the designer under the company name Kenterprises. The Avalon Hill version has slightly different rules. Alan Moon is credited with development of this version. Bin'Fa will be re-released February 2015 after undergoing numerous alterations and rule changes from its previous incarnations.&#10;&#10;Bin'Fa/2015 Edition is described by the Publisher/Designer:&#10;&#10;Bin&rsquo;Fa is a game of strategy for 2 to 6 players, each of whom controls an army of twelve units, a general and a supply pawn. In multiple army games, each player controls either two or three armies. The object of the game is to capture the opposing army units by surrounding them, thereby removing them from play.&#10;&#10;The game board is divided into six separate triangles, which offer almost limitless possibilities for new terrain each game. Each player places his armies at the start of the game in his home battle sector. The board also contains terrain markers and vortex markers, which the armies can use to jump around and appear unexpectedly behind enemy lines, presenting a sudden and unforeseen threat to the rear.&#10;&#10;The terrain transforms what would otherwise be a featureless playing area into one that more closely resembles the terrain over which actual battles are fought. With an almost incalculably large number of possible different terrain configurations, strategy cannot be decided in advance. The beginner always stands a chance against the experienced player.&#10;&#10;Bin&acute;Fa armies use up supplies when they move just as real armies do. On taking possession of the dice, players must choose between moving their army units on the battle sector (which uses up supplies) or using their turn to move the supply marker in hope of obtaining fresh supplies.&#10;&#10;One of the most exciting aspects of Bin&acute;Fa is the &quot;cavalry charge.&quot; As long as a player has sufficient supplies and is lucky enough to avoid rolling a double, it is possible to send a force dashing across the board to attack enemy units and (hopefully) return.&#10;&#10;The game of Bin&acute;Fa brings together two strands whose origins go back to very ancient times. Sun Tzu was a famous Chinese general and student of warfare. Bin&acute;Fa is based on the precepts contained in his classic work on the subject, &quot;The Art of War,&quot; written 2,300 years ago. They provide the structural framework for the game.&#10;&#10;",
        "artist": "Jean Baer,Ken Hodkinson,Margaret Lehman"
    },
    {
        "name": "The Republic of Rome",
        "description": "The Republic of Rome is an abstraction of over 250 years of history.  It simulates the politics of the Roman Senate during the republic.  The players take the part of various factions vying for the control of the senate.  They control the various powerful families of the time, who compete for state offices, military command, economic concessions and new adherents.  To win the player must get their faction to become the most powerful in Rome.  While doing this, however, a balance must be maintained.  A hostile world situation, and the vagaries of the public of Rome means that the players must also cooperate so that Rome herself doesn't go down under this pressure.  If Rome does not last, neither does the senate, and all players lose!&#10;&#10;Players make proposals to the Senate which other players then vote on. A player's ability to make proposals is determined by which Offices his/her Senators hold. A player's influence in votes is determined by the number of Senators they have recruited and the level of influence those Senators have obtained. Proposals may include assigning Senators to governor provinces (generating revenue), recruiting an army to fight an external foe, addressing the concerns of the Roman people, assigning offices or prosecuting previous office holders. Players have to co-operate to overcome the various threats that the game sends against Rome (wars, famine, unrest, bankruptcy) whilst working to build their own Senators' and Generals' positions and undermine that of their opponents. A powerful General or an influential Senator may become Emperor (thus winning the game) but equally may suddenly fall to the plague or an assassin's blade.&#10;&#10;",
        "artist": "Dave Dobyski,Charles Kibler,Kurt Miller,George I. Parrish, Jr.,Patrick Turner Studios,Mark Poole"
    },
    {
        "name": "Yali",
        "description": "This game is all about balance. The board itself is hinged and moves as players move their metal balls across the boards' surface.&#10;&#10;Which ever way the board is tilting towards decides whose turn it is.&#10;&#10;It is possible that a player might get two turns in a row if the board still tilts towards them after they move a ball.&#10;&#10;The first player to get all 8 of their balls to the other side of the tilt-table wins.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Upwords",
        "description": "Players take turns forming words on either an 8x8 matrix gameboard (in the current new classic version offered by Winning Moves) or on a 10x10 matrix gameboard (in the currently offered Hasbro Euro edition). Words may be formed horizontally or vertically on the grid, as in Scrabble, but as the title suggests the letters may also be stacked, so already-played words can be changed into different words by having letters stacked (up to a limit of 5 high). EXAMPLE: Change LATE to CATER and then change CATER to BELATED. Scoring is different from Scrabble; there are no prescribed letter values per tile; instead, when a new word is formed, the number of tiles used in that word is counted and used as the score as follows: A word that is flat (no stacked tiles) scores 2 points per tile, but the words that score the most are those that have many stacked tiles, with tiles underneath the spelled word also being counted. The impact of these rules provide for scoring-per-turn increasing as the game continues.&#10;&#10;Winning Moves classic 8x8 version: &#10;http://www.amazon.com/Winning-Moves-1194-Classic-Upwords/dp/B00V82MFSY?ie=UTF8&amp;keywords=upwords&amp;qid=1464366613&amp;ref_=sr_1_1&amp;sr=8-1&#10;&#10;Hasbro Euro 10x10 version:&#10;http://www.amazon.com/Upwords-The-3D-Word-Building-Game/dp/B01276CYHQ?ie=UTF8&amp;keywords=upwords&amp;qid=1464366613&amp;ref_=sr_ph_1&amp;sr=sr-1&#10;&#10;August 2016 will have a new Hasbro version 10x10 game available in the United States.&#10;&#10;An app for UPWORDS play is available both for iphone and android devices, by Lonely Star Software, under license from Hasbro. Players can play alone, against an AI component of varying skill level, or against another player anywhere in the world.&#10;&#10;Hasbro is the worldwide licensee of UPWORDS rights from Rudell Design LLC.&#10;&#10;Upwords Deluxe has an 11 x 11 rotating grid, 121 tiles and 28 challenge tiles, and electronic timer.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "USAC Auto Racing",
        "description": "Billed as the Official Game of the United States Auto Club this is one of Avalon Hill's early Sports Illustrated branded games. The game was created by Jim Barnes who sold the game at a booth that he set up at Indy and other race track promenades in the 1970s. Mr. Barnes struck a deal with Avalon Hill and the game was changed a little by the development team at AH and published with the SI logo on the box.  On an oval track you can run up to 33 cars. Each car has its own driver card derived from the performance of the actual drivers of the featured Indy race. Ongais, Foyt, Unser, Sneva, Mears, Rutherford etc, every driver that was in the that year's Indy has a card with a color photo on one side and game racing charts on the other side.  One Card set, for an even year Indy race from 1978 through 1986, was included in the box with the other card sets offered through the AH mail order program.&#10;&#10;Each driver card has 6 tables on the back. Three of the tables for movement, you chose whether you are going to drive normally, charge or back off and then roll 2 dice, referencing the appropriate table. The result will tell you how far you can move or if you have encountered car trouble. There are 2 trouble tables that can slow you down or knock you out of the race. There is also a pit stop table which controls how many turns you must sit in the pits before re-entering the race.&#10;&#10;The game is driven on Stats and can be played solitaire.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Ani-Mayhem",
        "description": "In this CCG you lay sites to build the game board. You then place items and disasters at the sites. You chose 4 starting characters and create a deck with other characters, actions, equipment etc. You also have a separate deck of combat cards that you can use to enchant your fight or charm ability. You move your characters in groups around the board trying to get items. As you do you will set off disasters that have to be dealt with. Sometimes they guard a site but a lot of them start roaming the board looking for fights. You win by acquiring over half the items or by having the most when all items have been acquired.&#10;&#10;The first set (0) consists of 303 cards and has art from the films Bubblegum Crisis, El Hazard, Ramma 1/2, and Tenchi Muyo.&#10;&#10;The second set (1) consists of 220 cards and has art from Armitage III, Dominion Tank Police, Phantom Quest Corp., Project A-Ko, and Oh My Goddess.&#10;&#10;In the third set (Dragon Ball Z) consists of 232 cards and all art is exclusively from Dragon Ball Z the series.&#10;&#10;There are also a fairly large number (32) of promotional cards.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Executive Decision",
        "description": "First, you decide on what finished goods you want to sell and how much, based on your capital.  Based on that, you buy the raw materials necessary to do that. You combine raw materials to make finished goods. You sell the finished goods.&#10;&#10;You have to bid on the purchase price of the raw materials and the sales price of the finished goods. When supply exceeds demand the prices drop. When demand exceeds supply the prices rise. If you bid less than the going price, you get nothing.&#10;&#10;Easy to learn, but interesting strategies. Somewhat mechanical, but a good game by Sid Sackson.&#10;&#10;Part of the 3M Bookshelf Series.&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "Kult",
        "description": "Reality as you know it is a lie.  The world we see around us is an illusion hiding True Reality, a horrible illusion fabricated to keep humanity at bay, and to prevent our awakening.&#10;&#10;That is the premise to the darkest of the CCGs.  You play an Archon or an Angel of Death.  You lay beings or regions around you and to the side in a Tarot type layout.  On these cards you can play influence cards.  Your spell casters can play spells and there are commandments that you can play that have instant effects.  On your turn you try to influence the population at large by moving population counters onto your outer cards then to your inner cards then onto the card representing you.  With 2 players there are 9 population markers and the first to sway 5 wins.  Of course along the way your beings will be throwing everything but the kitchen sink at each other.&#10;&#10;Between the subject matter and the dark and very graphic cards this is not a kids game.&#10;&#10;Online Play&#10;&#10;&#10;     CCG Workshop (no longer available)&#10;&#10;&#10;",
        "artist": "Tony Bagge,Les Edwards,Nils Gulliksson,Peter Andrew Jones,Jens Jonsson,Renato Olivares Machias,Terry Oakes,Paolo Parente,Harvey Parker,Jamie Sims,Adrian Smith,Stefan Thunberg"
    },
    {
        "name": "Monad",
        "description": "The object of the game is to collect round cards known as &quot;Monads,&quot; which look like yin-yang symbols. The players do this by Trading, Buying, and Leaping with other cards.&#10;&#10;Monad / Die 1. Million uses a deck of cards with six colors (Red, Orange, Yellow, Green, Blue, and Purple). Half of these are called &quot;Warm&quot; colors (Red, Orange, and Yellow), and the others are &quot;Cool&quot; colors (Green, Blue, and Purple). The majority of cards has one symbol on them (known as &quot;Commons&quot;), but there is one card of each color with 2-5 colors on them (known as &quot;Bis,&quot; &quot;Tris,&quot; &quot;Quads,&quot; and &quot;Quints&quot;). At the start of the game, each player is assigned one of the six colors as their &quot;identity&quot; and is dealt six Commons and one &quot;Bonus&quot; card (which shows three pairs of colors). The Bis, Tris, Quads, and Quints are placed face up in separate piles in the center of the table.&#10;&#10;On their turn, a player attempts to get higher numbered cards into their hand. The easiest way is by &quot;Trading.&quot; To trade, a player turns in a pair of cards with the same number of symbols but of opposite colors (one warm and one cool) and takes the top card from the stack with the next highest number of symbols. When they turn in two Quints, they gain a Monad. If the two cards turned in match one of the pairs on their bonus card, they may also draw the top card from each of the lower stacks. They may also use cards of the same color as their Identity as wild cards, which are treated as having any number of symbols.&#10;&#10;The player can turn in more than two cards and &quot;Leap&quot; to a higher stack. This allows them to select a card with a higher number of symbols. Finally, they can &quot;Buy&quot; a card. Buying cards uses the numbers located on each card. The player turns in a number of cards which total greater than the number on the card they are after. Monads can be purchased for 80 points.&#10;&#10;A player can also draw the top card from the deck but doing so prevents them from taking any other action that turn.&#10;&#10;The first player to accumulate a given number of Monads (which varies depending on the number of players in the game) is the winner.&#10;&#10;Belongs to the 3M Gamette Series&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "Get Out",
        "description": "Get Out is a Monopoly-style game with three tracks instead of one, and a couple of nice mechanical twists. The squares on the outer board are jobs, and the squares on the middle board are apartments. You can take as many jobs as you want, but each one slows you down, making it harder to get to Payday. Money doesn't really matter anyway; the real point of the game is to spend four months in the terrifying center ring. Not that they necessarily have to be four months in a row....&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Fight City",
        "description": "Fight City is a strategy card game in which each player needs his own deck. Each player's deck is composed of 50-60 cards, like Locations, Fighters, Weapons and Events. Players take turns bringing cards into play and using their cards to fight. The object of the game is to run your opponent out of money.&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Versions&#10;&#10;Original cardstock&#10;&#10;    Deluxe boxed (both A and B decks)&#10;    Deck A: Power&#10;    Deck B: Fear&#10;&#10;&#10;&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Awards&#10;&#10;&#10;    1999  Origins Award Nominee: Best Traditional Card Game&#10;&#10;&#10;",
        "artist": "Brian Snoddy"
    },
    {
        "name": "Dixie: Bull Run",
        "description": "Gather your armies and fight over 3 positions.  Cards represent infantry or cavalry regiments or artillery batteries.  The uniform colors and styles are the uniforms that the regiments actually wore (according to the designers).  You also have cards representing the participating generals , terrain and the ever present special events.&#10;&#10;It is a collectible card set but with a flat rarity.  There is the original set of 200 cards representing the Battle of Bull Run.  The second set at 400 cards was the Battle of Shiloh.  The third set at 250 cards was the Battle of Gettysburg.&#10;&#10;All artwork and graphics in the Dixie series were created by RPG/Historical artist, Eric Hotz (www.hotzartworks.com).&#10;&#10;",
        "artist": "Eric Hotz"
    },
    {
        "name": "Bitin' Off Hedz",
        "description": "&quot;Prehistory.&#10;&#10;Hot. Primordial. Dull.&#10;&#10;You've been dominating the earth for longer than you can remember.&#10;&#10;Then again, with a brain the size of a walnut, you've also been standing there for longer than you can remember.&#10;&#10;Nevertheless, you're completely positive that it's been ten million years since anything interesting has happened.&#10;&#10;So you decide to cajole your buddies into a suicide race across skull island. The winner is the first to hurl himself into a big volcano in the middle. The losers are everyone who got their hedz bitten off along the way.&quot;&#10;&#10;A very simple race game: throw your dice and move your dino. The track is rather long though and when parts of the track pass close to another part, players may throw rocks at each other which place you back at the start.&#10;&#10;",
        "artist": "James Ernest,Toivo Rovainen"
    },
    {
        "name": "Chief Herman's Holiday Fun Pack",
        "description": "Chief Herman's Holiday Fun Pack contains more than thirty previously published by James Ernest and Cheapass Games, as well as an essay and game bibliography.&#10;&#10;&#10;     Six Dice-Coin Games: Bogart; Crash; Flip; Dogfight; Pennywise; Road Trip&#10;     Six Card Games: Spots; El Paso; Hey, Bartender!; Following Suit; Last Man Standing; Brain Baseball&#10;     Three Bluffing Games: Big Dumb Five; The Lost Pueblo of Doctor Green; Candy&#10;     Four Board Games (with 3 Boards): Galaxy; The Celebrated Jumping Frog Game; Stumpy the Cave Boy; Tishai&#10;     Three Paper (and pencil) Games: Strange Words; WoRDWeRX; Divide and Conquer&#10;     Two Group Games: The Con Game; Love and Marriage&#10;     Keeping it Simple (a game design article by James Ernest)&#10;     Nine Poker Variants: Rosencrantz and Guildenstern; Suck; Girl's Best Friend; Countdown; How Stupid Are You?; Night Baseball of the Living Dead; Frankenstein; Rescue 9-1-1 with Media Crew; River of Blood; The Order of Poker Hands&#10;     Ludography (a list of games designed by James Ernest)&#10;&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;Gaming_Industry_Awards&#31;135&#31;&#10;&#10;*2000 [[Origins Award Nominee: Best Abstract Board Game&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Dark Age: Feudal Lords",
        "description": "Get a band of mercenaries together and go beat up someone else's band of mercenaries.&#10;&#10;You must first spend resource points to try and sway mercs to fight for you.  You then arm them to the teeth and give them skills.  Each character has a life value (how much damage it can take), a control value (used to recruit the person), a skill number (max amount of skills that can be played on the person), a weapon number (quantity of weapons that may be carried) and combat strings.&#10;&#10;The combat is quite involved and owes more to miniature gaming than to card games.  First you roll for ranged attacks and compare rolls to your DF string.  Each roll that meets or exceeds a number of the string hits so it possible to score multiple hits with one combatant.  The defender then gets to fire back in the same manner.  After DF is resolved you go to Close Combat.  Close combat is handled much the same way except you also have a blocking string so it is possible to block hits.&#10;&#10;Special mention must be made of the artwork on the cards. It is stunning.&#10;&#10;Online Play&#10;&#10;&#10;     CCG Workshop (no longer available)&#10;&#10;&#10;",
        "artist": "Rick Berry,John Bolton,Tim Bradstreet,Gerald Brom,Dave Dorman,Les Dorscheid,Phil Hale,Henry Higgenbotham,Patrick Ho,John Matson,R. K. Post,John Zeleznik"
    },
    {
        "name": "Ritter ohne Furcht und Tadel",
        "description": "Depending upon the number of players, each player receives 1 or 2 knights.  Each of these knights lists a series of dice pips on the card, some of which are red in color.  These red numbers are the knights defensive abilities, and he will block these numbers if rolled by an opponent during a competition.  For instance, Upollonius Wolkenburg has a 1, 2 and 3 in red.  Thus, he will block one of each of these numbers each time dice are rolled by an opponent in a competition.  Some knights have less numbers in red, but they usually have a greater attack strength, meaning they can roll more dice in combat.  This mechanism borrows very heavily from many role playing and fantasy games.&#10;&#10;In addition to these 'defense' numbers and the attack dice chart, each knight card also has charts for prizes won (1 - 15) and damage points (1 - 10).  There are also nice illustrations on each card ... about the only kind thing I can say about the game.&#10;&#10;Each player also receives a 'lady' card.  Each lady possesses a number of characteristics, including hair color, build, height and personality.  When granting her favor to a knight (which is indicated by placing a corresponding token onto a knight card), the idea is to seek out a knight who desires similar characteristics in a lady.&#10;&#10;The start player challenges an opposing knight with one of his knights.  A challenge cannot be refused.  These two enter battle, which involves each player tossing a number of dice equal to their attack strength into the tournament field.  In mounted combat, any 1's, 2's or 3's thrown strike a blow, unless these are blocked by the opponent.  If any of these dice strike, the knight falls from his horse and the knight suffers hit points equal to the number of blows which were landed.  If only one knight is struck and falls from his horse, the opponent wins and earns a prize for himself and for his lady.  If both knights fall from their horse, then the match continues on foot.  This involves more dice rolling, but 4's, 5's and 6's now strike.  This continues until one knight concedes or reaches 10 damage points, at which time he is out of the tournament (and out of the game).&#10;&#10;The next player in turn order then challenges a knight.  This process is repeated until there is only one healthy knight remaining. The round then ends and victory points are doled out to the knight and lady who won the most prizes.  There are also potential bonuses which add to the players' scores.&#10;&#10;",
        "artist": "Andreas Metzger,Nicolas Neubauer"
    },
    {
        "name": "Ghost Chase",
        "description": "One player takes the role of Max, the ghost.  Max hides himself in the Canterville castle.  The other players are the ghost chasers and search for Max in the castle.  Max and the ghost chasers begin the game in rooms of their choice.  The Max and his chasers move room to room.  Max moves invisibly, showing himself only from time to time.  The creatures living around the castle determine when Max must show himself.  After each game round, one animal is removed from the board.  When all animals of one type have been removed, Max must show which room he is in and how he got there.  Max has a code of honor and will not enter the same room twice during the chase.&#10;&#10;Unlike Max, the chasers may enter each room as often as they like.  They try to force Max into a dead end to catch him.  All the chasers win if one of the chasers enters the room where Max is.  If the last animal is removed from the board with Max having not been found, the player playing the role of Max is the winner!&#10;&#10;",
        "artist": "Doris Matthäus"
    },
    {
        "name": "Jump!",
        "description": "The premise is quite simple: jump out of airplanes and get your guys to land as close to the coast as possible. The closer you are to the coast, the more points you score. If you splash down into the water, however, you will score negative points. The further from the shore you are in the water, the more negative points you will suffer. &#10;The board depicts a section of land, followed by a beach and ocean. There is a lake on one space of the land section, and a one-space island in the ocean. The board also has two 'landing' tracks running parallel to each other. The tokens are placed on these tracks once they have leapt from the planes. Finally, the board also has a scoring track to tabulate the points ultimately scored following a round, as well as a cumulative scoring track which runs the perimeter of the board.&#10;&#10;Each player loads his or her tokens (which vary with the number of players) into the two airplanes. There are four rows of seats in the airplanes, and where your tokens are positioned will be important when considering the timing of your jumps. Players then each receive six cards plus one 'jump' card. These cards dictate the actions that will occur during the turn. Most of the cards move one of the planes (red or yellow) forward or backward a certain number of spaces. Other cards allow a player to switch seats in or between the planes, cancel any jump attempts that round or blow a jumper off course a space. Finally, the jump card causes one of the player's token to leap from the plane and land on the space directly below where he was seated.&#10;&#10;The mechanics are quite simple. Each player lays a card face down, and then all reveal their cards simultaneously. Beginning with the start player (which rotates each round), each player carries out the action his card depicts. However, if a player reveals a 'jump' card, then opponents who played a 'wind' or 'cancel jump' card must reveal them, taking the appropriate action. The 'wind' card can be disastrous, as that player gets to bump the jumper one space up or down. This may have the effect of landing the jumper in the water. Cards played are discarded, with the exception of the 'jump' card, which is retrieved back into the player's hand.&#10;&#10;When a token leaps from a plane (due to the play of a 'jump' card), he is placed on the outside track of the landing track. If another token leaps into the same space, it is placed along the inside track. Any other tokens that land on that same space are shoved back to the next empty space on the landing track. This can result in a scoring reduction if the token is being moved further from the coast, but can also be a positive occurrence if this causes the token to be moved onto the land as opposed to falling into the water.&#10;&#10;Play continues until all tokens have jumped from the planes. They are then moved one-by-one to the scoring track, beginning with the token furthest from the shore. There is a positive scoring track for those tokens that were fortunate enough to land on solid ground, and a negative scoring track for those jumpers who splashed into the water. The more tokens that successfully landed on the ground, the more points the players closest to the shore will score. The converse is also true!&#10;&#10;Once all tokens have been repositioned onto the scoring tracks, each player tallies his final results and these are marked on the cumulative scoring track. This entire process is then repeated two more times and the player with the most cumulative points following the third round is victorious.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Formula-1",
        "description": "A simple racing game where speed and movement is decided by the driver and not the dice. Only when exceeding safety speeds on the bends are dice used to decide the penalty incurred.&#10;  The players use &quot;dashboards&quot;, cardboard cutouts resembling dashboards, complete with a speedometer and tire and brake wear gauges.  Maximum acceleration is fixed, tire and brake wear may happen as a result of cornering too quickly&mdash;then there are the dreaded spinouts.  A few tight spots exist, so blocking is also an effective tactic.&#10;Tactic cards (you get 5 for the entire race) put a few aces up your sleeve.  They can give you an extra burst of speed or of cornering ability.&#10;Pit stops will get you fresh brakes and tires but you must reach them by exact count&mdash;otherwise you're forced into another lap.  Also, pit cards throw a monkeywrench in&mdash;usually you'll lose a turn, but now and then you'll get extra fast service, a burst of speed in coming out of the pit, or special brakes good for one extra corner.&#10;The race runs for up to 10 laps; the player furthest past the finish line when all players have had the same number of turns wins.&#10;The game's simplicity makes it accessible to younger players, whilst it remains enjoyable by adults.  I just like the dashboards (reminds me of Gametime's Sopwith or Yaquinto's Shooting Stars).  ;-)&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Lord of the Fries",
        "description": "Game Synopsis: Lord of the Fries is a thematic sequel to Give Me The Brain!. It takes place at the same restaurant, has the same cast of characters, and requires roughly the same equipment. But the game is entirely different. &#10;Players choose orders (sometimes randomly, sometime not) from the figuratively colorful Friedey's menu, and try to fill them with cards from their hands. Some orders are easy, like the Cowabunga. One Cow Meat, one Bun. Some are a little harder, like the Chickabunga Conga: same as a Chickabunga (Bird Meat plus Bun), plus Fries and a Drink. Sound easy? Now try your hand at a Lord of the Fries, a Meat Munch, or the infamous Patriarch (Fish Meat, Cheese, Bun, Fries, Drink, and the oft-maligned Strawberry Pie).&#10;&#10;Awards&#10;&#10;1998 Origins Award Nominee: Best Traditional Card Game&#10;2003 Listed in GAMES Magazine's GAMES 100&#10;&#10;Online Play&#10;&#10;&#10;     GameTable Online (free, multiplayer, real-time)&#10;&#10;&#10;Versions&#10;&#10;&#10;     1998 cardstock version (out of print)&#10;     2003 Special Edition (color) as Lord of the Fries De-lux&#10;     2008 Third Edition (color)&#10;&#10;&#10;Third Edition card count - 12 Drink, 12 Bun, 12 Fries, 12 Veggies, 12 Cow, 10 Bird, 8 Cheese, 8 Sauce, 8 Fish, 4 Pie&#10;&#10;",
        "artist": "Brian Snoddy"
    },
    {
        "name": "C&O/B&O",
        "description": "Is this any way to run a railroad?&#10;&#10;It is if you can pick up more passenger and freight revenues than your opponent!  An authentic railroad dispatching game based on the actual C&amp;O/B&amp;O railroad.  Players compete against each other as well as the elements (floods, derailments, collisions, mountain slides) to operate the most efficient railroad system.&#10;&#10;Contents:&#10;Dispatcher's Manual containing colorful history, photos and memorabilia of C&amp;O/B&amp;0 railroading plus diagrams and examples of play.&#10;97 train counters&#10;instructions for 1.2 or more players&#10;time table&#10;departure cards&#10;situation cards&#10;freight load counters&#10;2 part game board&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "BattleTech",
        "description": "BattleTech is a science fiction tactical wargame in which players maneuver giant fighting robots (&quot;BattleMechs,&quot; or &quot;'Mechs&quot;) against each other (or vehicles and/or infantry). The game system includes details such as varying weapon ranges, heat generation, and discrete hit locations (torso, arms, legs, etc.). 'Mechs vary greatly by mobility and firepower, and players can choose from provided designs or take the time to create their own 'Mechs from scratch. The base game (reprinted in many different editions) includes an introductory rulebook for new players; recent editions also include quick-start rules for an even faster orientation. The game is typically played on one or more mapsheets or (more recently) mounted map boards, and there are many mapsheet and &quot;hex&quot; (mounted-board) packs available for purchase or even download. Optional rules are also available for hexless play a la many miniatures games. An extensive line of pewter figurines ('Mechs, vehicles, and the like) are available in the United States from Iron Wind Metals. (Many earlier BattleTech figures were produced and sold by Ral Partha, which still handles the figure lines in Europe.)&#10;&#10;The main component of the current generation of BattleTech is a series of core rulebooks, the central one being Total Warfare (in print and PDF), which contains the main (tournament-legal) rules for the game. (The 2011 Catalyst reprint is up-to-date in terms of errata fixes.) TechManual (in print and PDF) contains construction rules for 'Mechs and other units. A series of three &quot;advanced rules&quot; books adds on to the standard rules: Tactical Operations (in print and PDF) covers on-planet actions over a period of hours; Strategic Operations (in print and PDF) covers in-system actions over a period of weeks; and Interstellar Operations (forthcoming; 2012?) covers system-level actions over a period of months. The final core rulebook available is A Time of War: The BattleTech RPG (in print and PDF), a revised version of the BattleTech RPG rules, which have previously gone under the names MechWarrior and Classic BattleTech RPG. A one-volume tome on the BattleTech universe was announced years ago but has no scheduled release.&#10;&#10;BT is also supplemented by a variety of Technical Readouts, which provide gameplay and background data on 'Mechs and other units at various time periods in the game-universe history; map sets, including the new Hex Pack hard-mounted maps with tile overlays; sourcebooks; and pregenerated record sheets, as well as the aforementioned miniatures (which are not required for play).&#10;&#10;As in earlier editions of BattleTech, the current generation includes an introductory box set. The current version (released Q1 2011) is the 25th Anniversary Box Set, which features everything necessary to play the game, including:&#10;&#10;24 unpainted, ready-to-play plastic BattleMech miniatures.&#10;    2 unpainted, premium-quality plastic BattleMech miniatures.&#10;    One 12-page full-color quick-start rulebook&#10;    One 80-page full-color rulebook&#10;    Inner Sphere at a Glance, a 56-page full-color book of universe background and BattleMech technical data&#10;    A 36-page book of pregenerated BattleMech Record Sheets&#10;    One 16-page full-color Painting and Tactics Guide&#10;    Two heavy-duty cards of compiled tables (Many sets came only with one.)&#10;    Two 18&Prime; x 24&Prime; double-sided game-board quality maps.&#10;&#10;In 2009, the adjective &quot;Classic&quot; was dropped from the BattleTech line.&#10;&#10;Introductory Rules&#10;&#10;     Battletech Introductory Box Set&#10;&#10;&#10;&#10;&#10;Core Rulebooks&#10;&#10;     Classic Battletech: Total Warfare (Standard Game Rules)&#10;     Classic Battletech: Tech Manual (Standard Unit Construction)&#10;     Classic Battletech: Tactical Operations (Advanced Ground Rules &amp; Construction)&#10;     Classic Battletech: Strategic Operations (Advanced Aerospace Rules &amp; Construction, Complete Battleforce Rules)&#10;     A Time of War: The BattleTech RPG (RPG rules)&#10;     A Time of War Companion (RPG supplement)&#10;     Battletech: Alpha Strike (Fast-Play Rules)&#10;     BattleTech: Interstellar Operations (forthcoming: 2014?)&#10;&#10;&#10;&#10;&#10;Introductory Supplements&#10;&#10;     Technical Readout: 3039&#10;     Record Sheets: 3039 (print version is abridged; PDF is unabridged)&#10;     Classic Battletech Starterbook: Sword and Dragon&#10;     Battletech Hexpack:  Lakes and Rivers&#10;     Battletech HexPack: Cities and Roads&#10;     Battletech HexPack: Mountains and Canyons&#10;&#10;&#10;&#10;&#10;Other Supplements (partial list)&#10;&#10;     Classic Battletech: Dawn of the Jihad&#10;     Battletech: Chaos Campaign&#10;     Classic Battletech Starterbook: Wolf and Blake&#10;     Classic Battletech Map Compilation 1&#10;     Classic Battletech Map Compilation 2&#10;     Classic Battletech: Mercenaries Supplemental&#10;&#10;&#10;&#10;&#10;Rules Expansions for Previous Editions (partial list)&#10;&#10;     BattleTech: CityTech&#10;     BattleTech: AeroTech&#10;     BattleTech: AeroTech 2&#10;     Classic Battletech RPG&#10;&#10;&#10;&#10;&#10;",
        "artist": "Tom Baxa,Tara Gallagher,Earl Geier,Alan Gutierrez,Ernie Hernandez,Jeff Laubenstein,Todd Lockwood,James Nelson"
    },
    {
        "name": "Calamity!",
        "description": "Calamity is Games Workshop game published in association with  the Sentry Group of Insurance companies. A typical insurance game, where you, as a company, insure risks in this dangerous world. Designed by Andrew Lloyd Webber (yes the famous one). Mechanics from Derek Carver and Ian Livingstone. (OOP 1983)&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Dragon Quest",
        "description": "Fantasy miniature game. A typical Dragons &amp; Dungeon game. Requires a Game Master. The original game comes with 6 Ral Partha metal miniatures, 180 cards (featuring monsters, treasures, objects and traps), a dungeon board, D&amp;D dice, and three pre-made adventures (ISBN 1-56076-552-b)&#10;&#10;",
        "artist": "Gerald Brom,Clyde Caldwell,Jeff Easley,Larry Elmore,Fred Fields,Carol Heyer,Roger Loveless,Keith Parkinson,Robin Raab"
    },
    {
        "name": "Beyond Balderdash",
        "description": "Beyond Balderdash is the expanded second edition of Balderdash.  Balderdash is based on bluffing your opponents into guessing your false definitions to obscure words.  Beyond Balderdash adds several new categories to the mix:  Movies (make up a plot), Dates (say what happened on it), People (say what the person did), and Initials (make up what they stand for).  The real answers are often even more outrageous than the bluffs, so the game offers plenty of laughs.&#10;&#10;The UK version of Absolute Balderdash is a different variation with different questions.  Notably, the UK Absolute Balderdash features a &quot;Law&quot; category, where you complete the law given on the card. Beyond Balderdash is lacking that category, and features in its place a &quot;Date&quot; category, where you are given a date and must come up with the historical significance.  The Canadian and Australian versions of Absolute Balderdash also feature the Date category instead of Law.&#10;&#10;Absolute and Beyond were merged into the game Balderdash at least by 2003 (there is a 1997 edition of Beyond Balderdash still with the Dates category).  Now, the vanilla version of Balderdash is the five-category edition with Laws instead of Dates.  Balderdash with a single category (word definitions) has not existed since at least 2003.&#10;&#10;Re-implemented by:&#10;&#10;    Kokkelimonke Jubileum&#10;&#10;&#10;&#10;&#10;Re-implements:&#10;&#10;    Balderdash&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Flowerpower",
        "description": "A beautiful tile-laying game where players strive to build large plots of single variety flowers.  The larger the plot, the higher the score.  Players plant their own gardens but also compete in a central connecting strip.  Players also get the chance to plant weeds into the opponent's garden, spoiling their best laid plans.&#10;&#10;Flowerpower is part of the Kosmos two-player series.&#10;&#10;",
        "artist": "Grafik Studio Krüger"
    },
    {
        "name": "Janus",
        "description": "The aim of the game is to remove as many of the tablets lying on the board as possible by means of clever manipulation of the playing figure (column)and thus to win as much as possible of the square made up of four fields. The tablet that is removed is always that which the column stood on last. The person who removes the last of the four tablets, wins that square and occupies the payment circle with one of his or her coins. The points are added up at the end of the game.&#10;&#10;",
        "artist": "Claus Fritzmann"
    },
    {
        "name": "Password",
        "description": "Based on the classic game show that began in 1961, with many editions printed starting in 1962. Each edition featured a different set of words, although later anniversary editions used words from previous sets.&#10;&#10;The object is for one person to get their teammate to say the password given a one-word clue for 10 points. Each time a clue is given, the other player can guess the password; if they get it right, the team scores. If they get it wrong, the other team gets to try for 9 points. This goes back and forth, with the word value continuing to decrease, until A) the word is guessed; B) ten clues are given without a correct guess; or C) the password is said by a clue-giver, in which case the word is thrown out.&#10;&#10;Hyphenated words (i.e., &quot;lovey-dovey&quot;) are considered two words, and hence are inadmissible.&#10;&#10;",
        "artist": "Design Edge"
    },
    {
        "name": "Sub Search",
        "description": "A unique variation on the format of Battleship.  The game is different in having a three dimensional board.  Players hide their submarines and a mine on the three underwater levels on one side, and place their surface ships on the top surface level of the other side.  Players move a ship to a desired grid location and then fire a depth charge, marking off hits, near misses, and misses on their opponent's submarines.  Submarines can fire a torpedo at surface vessels that are in the same column.  Play alternates back and forth until one player sinks all three of his opponent's subs or all of his opponent's surface ships (almost never happens).&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Illuminati: New World Order",
        "description": "Collectable Card Game based on the popular Illuminati game.&#10;&#10;Secret conspiracies try to take over the world. Each player represents a different conspiracy (or different factions of the same conspiracy!) each of which can win either by controlling enough &quot;groups&quot; like the Republican Party or France or by fulfilling their own special goals.&#10;&#10;Also published as a non-collectable 'One With Everything' full-set manufacturer's edition, with its own rules on how to play with one of *every* card.&#10;&#10;A set of additional cards was published in booster packs as INWO Assassins, and later the Church of the Subgenius.&#10;&#10;",
        "artist": "John Kovalic,David Martin (II),Shea Ryan,Dan Smith"
    },
    {
        "name": "Dungeon Dice",
        "description": "From the box description:&#10;&#10;ESCAPE... is all you think of when you live in a cold, dark dungeon.  But DUNGEON DICE can set you free!&#10;&#10;The dice are tunneling tools.  Shovels - Keys -- Daggers -- Ladders and Lanterns.  And, with every roll, you might be one step closer to freedom.&#10;&#10;You match the dice to earn the tunnel cards that pave the way to your great escape.&#10;&#10;But passage is perilous!  Gruesome guards and fellow prisoners will challenge your getaway.  So plan your moves with care.&#10;&#10;If you're the first to dig out of this dark and dismal dungeon, victory will be yours.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Tenjo",
        "description": "From the publisher's website:&#10;&#10;TENJO captivates players from a wide range of age groups with diverse gaming interests. Strategies combine elements of combat, resources, wealth, negotiations, and timing. The warfare is ruthless, diplomacy is crucial, and emotional engagement is intense.&#10;&#10;A highly flexible set of rules allows 2 to 4 players to adopt a limitless number of scenarios and methods with ease. Expected game time varies from 3 to 10+ hours. No two games are the same. This is truly a war game of infinite possibilities!&#10;&#10;4 Samurai Chip racks&#10;360 Samurai Chips, 90 in each of the four colors (Red, Blue, Green &amp; Yellow)&#10; - Each set of 90 Samurai Chips is made up of 15 in each amount of Samurai: 1,000, 2,000, 3,000, 5,000, 10,000, 25,000&#10;20 Daimyo General Pawns, 5 in each of the four colors&#10;20 Shadow Warrior Figurines, 5 in each of the four colors&#10;149 Game Cards&#10; - 35 Element Cards (7 in each of the 5 Elements: Water, Wind, Fire, Earth 7 Void)&#10; - 66 Ring Cards (22 1-Ring, 22, 3-Ring &amp; 22 5-Ring)&#10; - 12 Castle Cards (2 each of 6 different varieties)&#10; - 24 Fate Cards (5 Ring, 5 Element, 2 Castle, 4 Samurai, 4 Koku 7 4 Daimyo)&#10; - 12 Family Cards (A Wife, Son &amp; Daughter card in each of the four colors)&#10;120 Paper Koku Notes (30 each of 1,000 Koku, 3,000 Koku, 5,000 Koku &amp; 10,000 Koku)&#10;2 20-Sided Dice: one red, one blue&#10;1 10-Sided Red Die&#10;1 Round Red Season Marker&#10;30&quot; x 30&quot; Game Board&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Rogue Trooper",
        "description": "You are the Rogue Trooper, a Genetic Infantryman - one of the last survivors of the infamous Quartz Zone Massacre. Now, you and your friends search the face of Nu-Earth, a battle ravaged Hell-World, for the Traitor who destroyed the GIs. Ahead of you are hostile Nort forces and many other dangers, but also companions, equipment and much-needed information on the identity and whereabouts of the Traitor. But hurry, as once he is unmasked, there will be a deadly chase through Nu-Earth and Milli-Com until he is killed.&#10;&#10;",
        "artist": "Dave Gibbons,Pete Knifton"
    },
    {
        "name": "Wabbit's Wevenge",
        "description": "They skinned his kin. And they're going to pay&hellip;The ulitmate mayhem goes to town!&#10;&#10;Play Wambo Wabbit and avenge the helpless, hideless bunnies twapped at Mayor McGreedy's Fur Factory.&#10;&#10;Or play any of several vicious critters who turn Wambo's kin into fur coats and profits; the Mayor himself, Bernie the Dog, or Randy Andy the Dump Cat.&#10;&#10;Move fast and atack first is the name of this cutthroat strategy game. But before&hellip;grenades, tanks, zeppelins - not even the disintegrator ray gun may stop Wambo from tearing the town apart!&#10;&#10;",
        "artist": "Andria Hayday,Stephen Sullivan"
    },
    {
        "name": "Hero",
        "description": "The publisher's description:&#10;Hero is a wild, no holds barred man-to-man (or beast) game on two levels. Players control their own Hero in their portion of the maze as well as monsters in their opponents portion.  Each Hero is composed of several categories: Intelligence, Physical Appearance, Class, Strength, Luck, Hits, and Weapons Proficiency.  Each of these must be determined by the player from a fixed number of points.  To make a Hero super-strong will mean that some other category must suffer (super-strong and a lackwit?).  Monsters include such loathesome creatures as trolls, ogres, zombies, goblins, lycanthropes, men, and the horribly alluring succubus.  Each has an offensive potential as well as a defensive capability based on the type of creature vs. the Hero's weapon and how mightily he wields it.  Your Hero must avoid traps, slaughter monsters, gather gold, and make it to the end of the labyrinth to win the hand of the stunning, voluptuous daughter of the most powerful wizard in the land.  If the Hero does not there are always other challenges, unless he has become a Dead Hero.&#10;&#10;Components: &#10;Thin album box &#10;3 panel folder (Yaquinto catalog), Space Gamer Magazine advertising&#10;flyer.&#10;&#10;Thick album box &#10;Yaquinto price sheet dated &quot;Feb 1 1982&quot;, rules booklet marked &quot;Second&#10;Printing, March 1981&quot;.&#10;&#10;Both editions&#10;12 page rules booklet, card with 3 perforated hero set-up sheets, &#10;2 plastic ziplock bags.&#10;&#10;Summary Counter Manifest: 52 3/8&quot; counters, 130 1/2&quot; counters &#10;(9 white, 1 blank, and 3 identical sets of 40 colored red, blue, or green.)&#10;&#10;",
        "artist": "John Hagen"
    },
    {
        "name": "Clue Master Detective",
        "description": "This is the same as the basic Clue game, but with more of everything.&#10;&#10;The publisher's description:&#10;Was it Madame Rose in the Carriage House with the Poison?  Monsieur Brunette in the Trophy Room with the Horseshoe?  Or was it our old friend Colonel Mustard whodunit in the Library with his trusty service Revolver?&#10;&#10;You'll need your sharpest detective skills to solve the ever-changing CLUE MASTER DETECTIVE mystery, because in this expanded version of our classic game of detection, there are more rooms, more weapons, more suspects -- more mayhem!&#10;&#10;The late Mr. Boddy's country manor has a total of twelve possible Murder Locations, both outdoors and indoors, with secret passages, plus new &quot;Snoop Spaces&quot; that let you broaden your investigation.  A vial of Poison and a Horseshoe bring the number of Weapons up to eight.  And the devious bunch of Supsects has grown to ten with the addition of Miss Peach, Monsieur Brunette, Madame Rose and Sergeant Gray.&#10;&#10;With all these additional people, places and things to unravel, your most expert powers of interrogation and deduction will be called into play.&#10;&#10;So shuffle the Suspect, Weapon and Murder Location cards, slip one of each into the Confidential Case File envelope -- and start sleuthing!&#10;&#10;Turn by turn you probe, collecting evidence and pinpointing certain culprits, means, and rooms.  Then, when you think you've got it, make your accusation: Whodunit? Where? With which weapon?&#10;&#10;CLUE MASTER DETECTIVE ... it's so entertaining, it's criminal!&#10;&#10;",
        "artist": "Tim Hildebrandt"
    },
    {
        "name": "Rise and Decline of the Third Reich",
        "description": "Rise and Decline of the Third Reich is a realistic simulation of the grand strategic situation as it existed in Europe during WWII. It features 6 games in 1; a campaign game of 24 turns which runs from the invasion of Poland to Germany's final defeat or victory, an advanced game providing additional complexity, a multi-player version (in which even the Italian player can be the winner), and three 12-turn scenarios which allow you to play faster games. Third Reich is not for the faint of heart or the beginner simulation gamer. For 2 to 6 players. 560 counters which includes 1 blank one&#10;&#10;Rise and Decline of the Third Reich is a classic &quot;grand strategy&quot; wargame covering the European theater of WWII.  The game is huge in scope.  Players take on the roles of all of the major national powers and can simulate the entire war effort from 1939 until the end (often isn't until 1946).  This game is a favorite of many because of an excellent balance between politics and military might, and it gives players a chance to try things that did not happen historically to see if they might have worked better (e.g., Germany invading Spain).  This game is definitely not for the novice gamer. The rules are intricate, and there are many factors for players to deal with: resources, unit production, negotiation, and, of course, strategic warfare.&#10;&#10;Avalon Hill Complexity rating - 10&#10;&#10;",
        "artist": "Don Greenwood,Rodger B. MacGowan,W. Scott Moores"
    },
    {
        "name": "Simply Cosmic",
        "description": "The game that breaks its own rules...&#10;&#10;This is a lighter version of the Cosmic Encounter game.   All of the same elements are there, they've simply reduced the number of alien races.  The races and cards have been chosen for use in an introductory game. &#10;Contents: 4 planetary system hexes and 1 warp hex&#10;    80 tokens (20 bases for each color)&#10;    2 decks of cards (including Destiny, Flare, Edict, Reinforcement, Compromise and Attack)&#10;    1 hyperspace cone&#10;    8 Alien Power cards&#10;&#10;",
        "artist": "Edward Beard, Jr."
    },
    {
        "name": "Space Crusade",
        "description": "SPACE CRUSADE is a cooperative effort between Milton Bradley UK and Games Workshop.  It takes the role-playing elements from Milton Bradley's HEROQUEST and merges them with Game Workshop's dark vision of the future.&#10;&#10;From the manual....&#10;&#10;&quot;One player must control the aliens.  This player is called the ALIEN PLAYER.  The other players control the three Commanders and their Space Marines.  The players are called the MARINE PLAYERS.&#10;&#10;Each game is a mission.  The missions are detailed in the Mission Manual.  The game starts with the Alien Player reading out one of the missions.  A map in the Mission Manual then shows the Alien player how to setup the game boards and Docking boards.  The Mission Manual also tell the Alien player how many, and which, Blip tokens he should take, as well as which Reinforcement tokens he may use.&quot;&#10;&#10;Expansions&#10;&#10;     Space Crusade: Mission Dreadnought &#10;     Space Crusade: Eldar Attack&#10;&#10;&#10;&#10;&#10;",
        "artist": "Jim Burns,Manhar Chauhan,David Sque"
    },
    {
        "name": "Sirocco",
        "description": "Publisher's description:&#10;&quot;SIROCCO is an exciting game of desert combat for two players.  Simple and easy to learn, battle develops fast and furiously!&quot;&#10;&#10;Each player represents one side in a highly abstracted WWII North Africa desert battle.  Using order cards, they maneuver various units and attempt to capture or kill their opponents' general. Basic and advanced rules are included.&#10;&#10;",
        "artist": "Linda Bakk,John Meyers,Picard Didier, Inc."
    },
    {
        "name": "Sanctuary",
        "description": "Can you survive among fiction's most notorious cutthroats! Find out in this challenging game of law and disorder in fantasy's meanest and seediest city based on Robert Asprin's anthologies.&#10;&#10;The object of Sanctuary game is to gain silver pieces by committing various successful thefts in the city of Sanctuary. To do so, you must overcome the many hazards to life in the city -  getting caught in the act, the Hell Hounds (elite guards), and the multitude of unusual other residents.&#10;&#10;",
        "artist": "Gerald O'Malley,Walter Velez"
    },
    {
        "name": "Situation 4",
        "description": "Here is a game and a puzzle combined. Each player or team has a complete puzzle, identical except for color. Both puzzles are played on the same area. The object is to cover more area than your opponent and score more points. Additional pieces give you special abilities, like bridges to cross rivers, tanks to protect pieces, and paratroopers that allow you to land pieces in their area.&#10;&#10;Also see Situation 7.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Tactics II",
        "description": "The hobby of wargaming was born in the 1950s with the publication of the game Tactics. TACTICS II is a direct descendant of this original board wargame.&#10;&#10;TACTICS II is sort of like military chess. Different pieces, called &quot;units&quot; in wargames, have different capabilities just like chess pieces. The major difference is that a player can move all his pieces each turn, and after all his pieces are moved, battles are resolved against the enemy units his pieces are next to (adjacent to).&#10;&#10;The other major difference between wargames and chess is that wargames have a mapboard, divided into squares or hexagons for movement purposes. TACTICS II has a 22&quot; x 28&quot; mapboard portraying a fictional continent with two countries, Blue and Red. Terrain includes roads, rivers, woods, mountains, beaches, and cities. The Blue Capital can only be reached over a vast plain, bordered on the left by mountains and on the right by woods. The Red Capital is on an island and can only be reached across one of several bridges or by an amphibious invasion.&#10;&#10;Game features include special functions for headquarters units, terrain effects, invasions, airborne assaults, weather effects, replacements, isolation, and even nuclear weapons. Units represent infantry, armor, mountain, airborne, headquarters, and amphibious troops. Over 100 counters in all.&#10;&#10;TACTICS II was almost always part of the Avalon Hill game line, primarily because it was sold as an introductory wargame for a number of reasons. The rules introduced many basic board wargaming concepts and were relatively low in complexity. The rulebook is divided into a basic game and a tournament game (advanced game). Both are balanced and relatively quick playing. As the opposing armies are identical in size and composition, victory is gained by a combination of logic, foresight, luck, common sense, and skill in military strategy and tactics.&#10;&#10;In 1981, an unauthorized hex map version, called Opera&#195;&#167;&#195;&#163;o MX-1, was released in Brazil. It is sometimes referred to as &quot;Tactics III&quot;.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Gettysburg (1977 Edition)",
        "description": "The booming of over 200 cannons fill the air as both armies prepare for the Confederate onslaught. Success will mean the probable capture of Baltimore and Washington. Failure will mean the end to the Confederate offensive.&#10;&#10;The original version of this game was the first historical wargame on the market. Revised several times in the 60s, this, the 77 version is the ultimate game on the Battle of Gettysburg.&#10;&#10;The basic game is in the 'Classic' tradition; simple, quick, and furious. Each side has about 25 counters on the board.&#10;&#10;The intermediate game is a large step up in complexity. Each player has 60 to 80 counters in play. Added game features include terrain effects, strategic movement, voluntary retreats, a more sophisticated combat system, disorganization. command control, breastworks, and artillery fire.&#10;&#10;The advanced game is the final word in Civil War strategy and tactics. Features include unit formations (column, line, battle, etc.), unit experience, more detailed command control, unit activities for each turn, unit facing, unit range of influence, expanded combat sequence, individual leaders, and the most detailed battle of order for the Battle of Gettysburg possible.&#10;&#10;Avalon Hill Complexity Ratings&#10;  Basic Game - 3&#10;  Intermediate Game - 6&#10;  Advanced Game - 10&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Gettysburg (125th Anniversary edition)",
        "description": "Gettysburg is a game played by moving blue and gray units representing the infantry, cavalry and artillery formations present at the historic battle on detailed mapboard representing the actual battlefield's terrain. You can be Gen. Robert E. Lee and command the hard-hitting Confederate Army of North Virginia&hellip; or You can be Gen. George G. Meade and command the stubborn but unlucky Union Army of the Potomac in its greatest crisis. Will history repeat itself or can it be changed? Your decisions will make the difference.&#10;&#10;Note: The Smithsonian edition is (c)1992.&#10;&#10;AH edition = 96 counters total (which includes 6 'blanks')&#10;&#10;",
        "artist": "George I. Parrish, Jr."
    },
    {
        "name": "Source of the Nile",
        "description": "Designed to be an educational and challenging game in which players compete primarily with Nature and with each other, luck tends to be an element in the game, but can be overcome by careful play. Because the situation is forever changing, there is no single best strategy; however,players must weigh risks against gains with every decision they make and good judgment will pay off.&#10;&#10;The game is played on a mapboard showing Africa from Khartoum to Capetown and Lagos to Mombasa. The periphery of this map, showing the territory known ca. 1820, is filled-in; the center is blank. A hexagonal grid is superimposed on the map to regulate movement and to delimit territory explored. In the course of play, each player moves a token (representing his explorer) from explored hexagons to blank hexagons one at a time.; terrain, native tribes and other discoveries within the hexagons are then semi-randomly determined, with allowance made for previous discoveries in adjacent hexagons. The player interacts with the discoveries (e.g. negotiates with new natives for guides) and records them on the mapboard using wax crayons. The mapboard surface is erasable. If the explorer dies before returning to Europe to publish his discoveries, all hexagons which only he has explored will be erased and &quot;subsequent explorers will find that his discoveries were only rumors&quot;; i.e., when other players explore the erased hexagons later they will have to generate new discoveries there.&#10;&#10;When explorers do return to civilization, however, they may publish their discoveries, after which they are safe from erasure. Players may also emulate real explorers by withholding some of their discoveries since they will enjoy some advantages when moving through terrain or dealing with natives known only to them. Points are scored for discoveries as they are published and once scored will not be lost if the explorer dies or is retired by his player. A player may retire his explorer at any time and then start a new explorer in Europe.&#10;&#10;Before each trip to Africa, explorers will have to raise money to support their expedition. New explorers with no discoveries to their credit must do this by drawing chance cards for several turns until they feel their finances are adequate. Experienced explorers can accelerate this process by publishing discoveries, which allow them to draw additional chance cards.&#10;&#10;Originally published by Discovery Games and re-published by Avalon Hill as a more card-based rather than dice-based system. A form of the original rules are preserved in the AH rules book under the rubric &quot;Game II&quot;.&#10;&#10;The rules to the AH version have a serious glitch in sections 12.61 - 12.63 where the die roll modifiers for guides and proceeding cautiously are reversed.&#10;&#10;The GENERAL Index  Article List:&#10;&#10;    The GENERAL Vol.18,No.6&#10;        Source of the Nile &ndash; &ldquo;Native Policy in Source of the Nile&rdquo; (Strategy) Michael Anchors&#10;        The Question Box - Source of the Nile&#10;    &#10;    The General Vol.21,No.3&#10;        &quot;Source of Strength&quot; (Variant)Source of the Nile With A Vengeance, Tim Williams&#10;    &#10;&#10;&#10;&#10;&#10;Online Play&#10;&#10;     amarriner.com (PBEM)&#10;&#10;&#10;&#10;&#10;Expanded by:&#10;&#10;    Tributary: A Supplement to Source of the Nile (Discovery Games version)&#10;&#10;&#10;&#10;&#10;",
        "artist": "Dale Sheaffer"
    },
    {
        "name": "RoadKill",
        "description": "Description text from the back of the game-box:&#10;&#10;Cross-Country Demolition Racing in the 21st Century (or &quot;Armored Leapfrog&quot; as it&rsquo;s adherents refer to it) brings visions of Mad Max in all his infinite glory to your tabletop in an easily played card game format. Each player competes in an armored racer equipped with an assortment of &quot;accessories&quot; not commonly found in your average Auto Parts store. Road hog won't let you pass? No problem&hellip; debate the right of way with a burst of your front machine-guns. Annoyed by that tailgater? &hellip;a few well-timed grenades should scrape him off your bumper. Reckless passer? &hellip;well, if your smoke screen doesn&rsquo;t discourage him, a nudge from your scythe-blade hubcaps should do the job. And these are just the &quot;standard&quot; accessories. In the Advanced Game, you can customize your car into something even James Bond would envy.&#10;&#10;Running low on fuel &hellip; better pull into the next Rest Stop, but beware of sabotage or theft. Only losers nap during RoadKill. Besides, what better time to salt the track with tire spikes or change a road sign or two. Everything goes in Roadkill, an uproarious game of highway combat more vicious than the Santa Monica Freeway.&#10;&#10;Players vie for the lead so they may lay the next section of the course. For example, a player with a Nuclear Fuel Cell will want to lead the others on a merry chase through mountainous terrain to sap their fuel. However, someone already running on fumes will opt for a desert straight-away to finish the race before he must pit and relinquish the lead. But pole position has its price - attracting more than its share of misfortune, while slipstreaming provides opportunities back in the pack.&#10;&#10;As if the players don't heap enough mayhem upon each other, the game throws an endless series of monkey wrenches into play as cars breakdown, the road widens and narrows or comes to a temporary stop in a blizzard, rock slide, or drawbridge (or does it?). You never know what is around the bend in Roadkill.&#10;&#10;",
        "artist": "C. Brent Ferguson,Charles Kibler"
    },
    {
        "name": "Wrasslin'",
        "description": "Wrasslin' is a quick-playing strategy card game that simulates the rough and tumble world of professional wrestling. Wrestlers of varying size, skill, and disposition wreak havoc upon one another by playing various Hold cards to batter their opponents senseless en route to a quick fall or submission.&#10;&#10;Each of the 24 wrestlers has his own unique set of abilities (Strength, Agility, Skill, Weight, Recovery, etc.) that determine what he can do in that spotlit ring on your table at home. Using Action Cards depicting a variety of holds - both legal and illegal - you must use your wrestler's strengths to their best advantage and minimize his liabilities in order to overcome your opponent. Victory depends solely on your skill in using your wrestler's abilities and the Action Cards that come your way.&#10;&#10;Play is fast and furious; most matches last but a few minutes. This is a simple, light-hearted, yet challenging game - ideal for family or social events, and for those rainy days when the lastest ringside seat at the arena isn't available. Whether you are a fan of the glittering world of pro wrestling, or a skeptic, you've just got to crawl into that ring at least once. And you can do so Wrasslin'.&#10;&#10;Handicap, Tag Team and Battle Royale rules allow any number to play. Hold your own tournament to crown the champion of your own Weird Wrassling Federation.&#10;&#10;Online Play&#10;&#10;&#10;     tbwrestling.com (turn-based)&#10;&#10;&#10;",
        "artist": "Chris White (I)"
    },
    {
        "name": "Legends of Robin Hood",
        "description": "What red-blooded lad hasn't imagined himself fighting at the side of Robin Hood against the evil Prince John and the Sheriff of Nottingham? Cops and robbers, cowboys and Indians, Robin Hood and his Merry Men are all part of a young man's rite of passage from childhood flights of fancy. Long the stuff of screen legend, Robin Hood now lives again in a game format for the entire family.&#10;&#10;So come with us back to the greenwood in twelfth century England as our heroes Robin, Little john, Friar Tuck, Will Scarlet and Allan A&rsquo; Dale scour the countryside with quarter staff and long bow rob the rich and save the poor from the oppressions of nobles and clergy. Each player assumes the role of an outlaw clad in Lincoln green and tries to outdo his fellows in amassing the most gold by winning archery contests, recruiting stout yeomen, or robbing wealthy travelers. But beware; the woods are full of the Sheriff's men. Ambushes by Prince John or Sir Guy of Guisbourne could land you in irons in a castle dungeon.&#10;&#10;Play is extremely simple as each player maneuvers his band across the map using playing cards that both dictate the action and define the sequence of play with little or no reference to the rules. Yet, strategy is important. You can opt to stick to the relative safety of the woods and dine on the King's deer or don a disguise to sneak into Nottingham Castle to cudgel the Sheriff himself.&#10;&#10;",
        "artist": "Dave Dobyski,Charles Kibler,George I. Parrish, Jr."
    },
    {
        "name": "London Cabbie Game",
        "description": "Armed with a cab you travel the twisted streets of London picking and dropping off fares.&#10;&#10;Each car has 20 points of movement each turn. Passenger cards with the pickup point listed are placed in 5 piles. Any player can pickup any passenger showing. When a passenger is picked up the player takes the card and a new card is turned over in that pile keeping 5 passengers available at all times. You can only have one passenger at a time. Upon picking up a passenger you also draw a destination card and you must drop off the passenger at that location. The fare is paid out from a chart that is very much like the payout chart in Rail Baron. Fares also pay out a small tip. Once a player has obtained 3 pounds (it's a British game) he can add another cab but you still have only 20 movement points to use.&#10;&#10;The very large board is a true maze of one way and two-way streets. Cabs cannot move through other cabs and this can block streets that only have one lane. There are also 2 traffic jams placed each turn that block areas from movement and this also adds to the mayhem. Because of this the second cab can come in handy as it can allow you to use your full 20 points each turn but it will add to the congestion.&#10;&#10;The victory conditions are left up to the players. &quot;The winner is the player with the most money earned in a specified time. Say an hour and a half, or two hours. Or a money limit can be set on the game. The first player to make 15 (pounds) or 20, being the winner.&quot;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Sicily: Triumph and Folly",
        "description": "Sicily: Triumph and Folly:  The Campaign to Capture Sicily, 1943, is the 7th game in The Gamers popular OCS (Operational Combat System) series of games, and covers Operation Husky from the invasions to the fall of Messina.&#10;&#10;It breaks ground within the series: the first to use the 2.5 mile per hex scale (instead of the usual 5 mile per hex scale)and the first to cover a major amphibious operation.&#10;&#10;Each turn represents 1/4 of a week instead of 1/2 week. This retains the system wide standard ground movement allowances and movement point costs. Air unit ranges have been doubled (to reflect raw range) as they are not affected by the time scale change. Land units represent Brigades, Regiments, Battalions, Companies &amp; KamfGruppes.&#10;&#10;The game includes a few shorter scenarios plus several different start-dates for the campaign games, based on the various critical events of the campaign. &#10;Playing time can be a couple of hours for the shorter scenarios, but as with all the OCS games the real money is in the various campaigns, which - while quite manageable on the scale of these things - still can take from one to two full weekends to play to completion.&#10;&#10;This is certainly the most rules-intensive of all the OCS games with air, ground, and naval units (including aircraft carriers!), airdrop capability on both sides, and the invasion and naval supply transport rules.&#10;&#10;Game Scale:&#10;Game Turn: 1/4 week&#10;Hex: 2.5 miles / 4 Km&#10;Units: Company to Corps&#10;&#10;Game Inventory:&#10;Two 22 x 34&quot; full-color maps&#10;Five dual-side printed countersheets (1,540 1/2&quot; counters)&#10;One 40-page OCS v2.0i system rules booklet&#10;One 36-page Sicily specific rules booklet&#10;Two OCS Charts &amp; Tables booklets&#10;Two 6-sided dice&#10;&#10;",
        "artist": "Dean Essig,David Pentland"
    },
    {
        "name": "Barbarossa: Army Group Center, 1941",
        "description": "This is one of a very popular series of games from GMT covering the first months of the invasion of the USSR; units are battalions through divisions, hexes are about 5 miles, and turns are two days. The system encompasses (as of 6/2001) Barbarossa: Army Group North (2000), Barbarossa: Army Group Center (1998), and Barbarossa: Army Group South (1996). Typhoon! (1995) is the progenitor of these games, and its system is quite similar, but it is unfortunately subtly incompatible with the later games.&#10;&#10;While not simple, these games are also not overly complex and present an excellent simulation of the early war. Most of the details of the campaigns are covered in a playable manner. Perhaps the most obviously interesting detail is the sequence of play, which is asymmetrical to account for the difficulties the Soviets labored under. Make no mistake, the Soviets are going to take a lot of abuse, but this is no walkover for the Germans and both sides are interesting to play.&#10;&#10;",
        "artist": "Rodger B. MacGowan,Mark Simonitch"
    },
    {
        "name": "Burma",
        "description": "Burma - The Campaign for Northern Burma, March-August, 1944, is the sixth game in the Operational Combat Series (OCS) from The Gamers, and covers covers the 1944 campaigns beginning with the Japanese &quot;U-Go&quot; offensive and ending up as what would be know as Imphal-Kohima, the most dramatic defeat ever inflicted on a Japanese army.&#10;&#10;In the spring of 1944, two equally matched opponents faced each other in the jungles and mountains of Northern Burma. During that spring and summer, three independent, but simultaneous, dramas unfolded. In the west, the Japanese launched an all-out offensive to capture Imphal. In the center, the Chindits landed in the Japanese rear area. In the east, the Chinese/US forces moved toward Myitkyina against stubborn Japanese defenses. These battles took place in horrible terrain under the most difficult conditions imaginable with troops whose quality ranged from the world&rsquo;s best to the world&rsquo;s worst.&#10;&#10;Burma contains British, Indian, US, and Chinese troops of varying qualities with ample opportunities for both sides to attack and defend.&#10;&#10;While mainly a British and Indian show, the campaign would end up involving US (Galahad) and Chinese troops as well. Burma is the most markedly different of the OCS games, with a wide variety of unit types and qualities, the extremely dense terrain and lack of roads creating a challenging supply situation for both sides, and a more balanced situation as both sides have opportunities to attack and defend. There is more of the &quot;cool stuff&quot; too, with Galahad, Chindits, Gurkhas, lots of air supply and transport options creating some interesting situations, and the ever-enigmatic and unusual Japanese Army. Imphal-Kohima is by far the most interesting ground campaign of the PTO (from an operational perspective), and it's conversion to OCS is remarkably smooth, with a fairly modest set of game-specific rules.&#10;&#10;Unlike some other OCS games, Burma has an excellent range of scenarios, from a couple very short scenarios (1-2 hrs) through to a good selection of longer (6hr) scenarios and on up to 3 monster campaign games (30-60 hrs).&#10;&#10;Scenario Info:&#10;&#10;    Learning Scenario: 1/8th of Map B; 5 turns&#10;    Short Scenario 1 - Operation Thursday: 1/4 of Map B; 9 turns&#10;    Short Scenario 2 - U-Go: 3/4 map of Map B; 10 turns&#10;    Short Scenario 3 - Merril's Marauders: 3/4 map, but requires both maps to play; 24 turns&#10;    Short Scenario 4 - Sato's Dilemna: 1/2 map of Map A; 11 turns&#10;    Short Scenario 5 - Imphal: 1/2 map of Map A; 17 turns&#10;    Campaign Scenarios 1, 2, and 3 (which use both maps, obviously); 45, 41, and 31 turns respectively&#10;&#10;&#10;&#10;&#10;Game Scale:&#10;Turn: 1/2 week&#10;Hex: 5 miles / 8 Km&#10;Units: Battalion to Division&#10;&#10;Game Inventory (Burma II - printed 2008):&#10;Two 22 x 34&quot; full-color mapsheets&#10;Three dual-side printed countersheets (2 combat, 1 markers - 840 1/2&quot; counters)&#10;One 48-page OCS version v4.0 rules booklet&#10;One 40-page Burma II specific rules booklet&#10;Two 4-sided OCS v4.0 Charts &amp; Tables booklets&#10;Two 6-sided dice&#10;&#10;Players: 1 or more (also suitable for solitaire and team play)&#10;Playing Time: 1 to 60 hours&#10;Complexity: High&#10;Solitaire Suitability: Moderate&#10;&#10;",
        "artist": "Nicolás Eskubi,Dean Essig,David Pentland"
    },
    {
        "name": "The Hobbit Adventure Boardgame",
        "description": "Each player is a hobbit who is attempting to gather the experience, equipment, and information that will enable him to defeat (outwit) the Dragon at Carn D&ucirc;m.  A player wins when he defeats the Dragon.&#10;&#10;Released almost simultaneously by Queen in Europe and ICE in North America.  The game looks good but is maybe a little too light&mdash;strategy is rather minimal as you simply run around trying to get stuff.  I mostly wish the player interaction were greater.&#10;&#10;Similar to Flying Turtle's Kalahen.&#10;&#10;From the back of English edition game box: &quot;It only takes about 15 minutes to master the The Hobbit Adventure Boardgame rulebook. Then you just unfold the full-color, mounted mapboard, select a plastic Hobbit, deal out the coins and life points, and start your journey across Middle-earth. Along the way, you'll explore sites, battle monsters, discover treasure, acquire artifacts, and challenge your opponents with tricky riddles. Once you're strong enough, you'll journey north to Angmar (at Carn D&ucirc;m) to battle with a foul Dragon, hoping to be the first halfling to secure his great hoard.&quot;&#10;&#10;Game Box Contents:&#10;&#10;     A beautifully-rendered, mounted mapboard, painted by the award-winning German artist Jo Hartwig and detailing northwestern Middle-earth&#10;     One Rules leaflet (4 pages)&#10;     One Special cards sheet (front and back)&#10;     4 plastic Hobbits, each a different color and standing over an inch tall&#10;     5 Dice (3 red custom combat dice, an illustrated blue movement die, and a standard green D6)&#10;     16 Talisman rings (4 each in 4 different colors - blue, red, green, yellow)&#10;     35 yellow plastic Money Markers (10 large, 25 small)&#10;     24 black plastic Life Markers (8 large, 16 small)&#10;     142 full color playing cards divided into eight categories: 6 Danger, 12 Peril, 20 Rest, 36 Adventure, 14 Magic, 8 Money, 15 Riddle, and 31 Equipment&#10;&#10;&#10;&#10;&#10;",
        "artist": "Jo Hartwig"
    },
    {
        "name": "Bauernschlau",
        "description": "The theme of this game is building sheep farms. Each farmer (player) owns a farm consisting of hexes radiating out from the center of the board, and whose boundaries (and therefore, sizes) are initially undefined. The placement of fences -- each of which is shared by the two surrounding farms -- defines the boundaries. Some hexes are clearly going to be in certain farms; others will be fought over (either to acquire or avoid!) fiercely.&#10;&#10;The goal is to complete one's own farm by having the fences on both its sides reach the outer edge of the board before the game ends (without which one cannot win), and to have the most enclosed points among all such completed farms (which wins).&#10;&#10;The sheep are on thick cardboard disks, printed on one side with values ranging from 5 (the best) down to -3. One sheep can fit onto each board hex.&#10;&#10;On a turn, a player gets to do one of several actions:&#10;&#10;1) place a sheep blindly from the supply face-down onto an empty board space after secretly looking at it; 2) turn up a face-down sheep tile in place (thereby freezing it for the rest of the game); 3) use the cool wooden sheepdog to blindly &quot;herd&quot; a face-down sheep from one hex to another, where it is then flipped up and frozen; or 4) lay a fence piece on either of the two fences surrounding his farm.&#10;&#10;Certain board hexes, symmetrically distributed, act as multipliers for the sheep that ends up in that space.  There are a few special situation rules and a few rules governing fence placement. There are strong elements of bluff and memory in this game.&#10;&#10;The game ends when one player's completed farm is filled with pieces (either face-up or down sheep, or the dog). Whoever has the highest number of points on face-up sheep in his/her farm after applying multipliers is the winner.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Star Fleet Battles",
        "description": "Initial publication of the games in the Star Fleet Battles series.  This was one of the first Task Force Games Pocket Games.  It was re-implemented and expanded several times after the original &quot;Pocket Game.&quot;&#10;&#10;This is the classic game of tactical Starship combat set in the Star Trek universe (the original TV show), though you will never see &quot;Star Trek&quot; anywhere in the game (licensing limitation).  Players command one or more ships from the Federation, Klingon, Gorn, Romulan, or Kzinti fleets, sporting all of the expected Star Trek weaponry like phasers, disruptor bolts, photon and plasma torpedoes, and tractor beams.  Also includes other weaponry not commonly seen such as drones (homing missiles).&#10;&#10;Players allocate energy and plot movement before each turn, then move all of the ships simultaneously.  Weapons are fired at will during the turn (i.e., not plotted before-hand like movement).  Ships have shields and armor for protection.  When these are breached, various ship systems are damaged, potentially crippling the combat capability of the ship, and eventually resulting in ship destruction.&#10;&#10;Game comes with various scenarios for players to reenact battles from the TV series, or provide for solo play.&#10;&#10;Re-implemented by:&#10;&#10;     Star Fleet Battles (Designer's Edition)&#10;     Star Fleet Battles (Commander's Edition)&#10;     Star Fleet Battles Captain's Edition (Current Edition)&#10;&#10;&#10;&#10;&#10;",
        "artist": "Alvin Belflower,R. Vance Buck,Stephen V. Cole,Allen D. Eldridge,Stephen G. Wilcox"
    },
    {
        "name": "Stocks & Bonds",
        "description": "Stocks &amp; Bonds will transport you to Wall Street.  You shrewdly invest in the game's 10 securities, buying and selling each year (each round) in an attempt to become the wealthiest stockholder in the game.  The game has a unique calculator which will tell you if you've had a Happy Monday or a Black Friday.&#10;&#10;Stocks &amp; Bonds is for two to eight players, teen through adult.  The bookshelf case contains a Stock Board, marker, dice, calculator, record sheets, situation cards, stock certificates and instructions.&#10;&#10;Their are several different versions available, though the external boxes look the same.&#10;&#10;The original 1964 version in the 3M Bookshelf Series, with the block-style spine, has a single-sided market calculator, and requires that players pay $10 per transaction.  In the later version, with the filigree spine, the $10 per transaction is dropped, and the market calculator has a &quot;bear&quot; and a &quot;bull&quot; side.  Additionally, the later version has a &quot;margin&quot; variant that allows players to purchase stock on credit, but pay for a percentage of their credit.&#10;&#10;&#10;     reimplemented as Stock Market Guru&#10;&#10;&#10;",
        "artist": "(Uncredited)"
    },
    {
        "name": "Ploy",
        "description": "This game in the 3M Bookshelf Series has a chess-like feel.  Players move different types of pieces on the board, trying to eliminate their opponents or capture the &quot;Commander&quot; (king).  As a bonus, the box features &quot;futuristic&quot; art which could have only been produced in the late 1960's.&#10;&#10;The publisher's description:&#10;&quot;Ploy is the stimulating space-age strategy game.  The object--to eliminate the opponent's Commander or all of his forces.  Since pieces only move along paths in line with the indicators radiating from their centers, the strategy lies in knowing when to move and when to rotate a piece to change direction.  For 2 or 4 players.  Bookshelf case contains four sets of spacial playing pieces, futuristic playing board and instructions.&quot;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Down with the King",
        "description": "Down With The King is a political game set in a fantasy world.&#10;&#10;Players are nobles who plot to overthrow the king. Players must cooperate to defeat the king, but only one of them can take the crown thus backstabbing is always a concern.  The game is played through various decks of cards.  Players strive to gain prestige and influence points so that they can recruit characters to their side.  They also use natural disasters, plagues, interrogations, and other political problems against their opponents. Of 19 possible actions each turn, a player can only perform 2, thus creating a tension and need for strategy. Player interaction is very high because players can perform actions during opponent turns and because nobody is eliminated early from the game. A player who is killed just misses a turn and then returns as the former player's heir, usually with revenge in mind.&#10;&#10;",
        "artist": "Ulrich Allgaier,Jost Amman,Albrecht Dürer,Charles Kibler,Thomas Lamm,Alan R. Moon,Dale Sheaffer,Mark Wheatley,Charles Wheatley"
    },
    {
        "name": "Federation Space",
        "description": "Federation Space is a strategic-level science-fiction combat game set in the Star Trek universe from the original TV series.  Players control an entire fleet of starships for one of eight different races of the Star Fleet universe in an attempt to destroy the fleets of their opponents.  In addition to a general melee or &quot;free for all&quot;, 26 different scenarios are provided that cover everything from a Klingon rebellion to the death of the Federation.&#10;&#10;Tactical combat can be resolved using the simple system included or the more detailed Star Fleet Battles rules, if desired.  This gives players the ability quickly resolve those conflicts that are unimportant or heavily weighted towards one side, and use the detailed Star Fleet Battles rules for engagements that are pivotal or very closely matched.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Streetcar",
        "description": "Given a a secret set of stations and trolley line, players use tiles to build a common network of track.  They attempt to build a path that travels from one terminal to the other while passing the required stations.  After all their connections are made, a player may begin to race their trolley through the network. The first player to race their trolley from one terminal to the other and visit all their required stations wins.&#10;&#10;The game was originally published as Linie 1 by Goldsieber.  In 1996, it was published by Mayfair as Streetcar with different end-game rules and artwork.  Later, it was published by Olsen in Sweden as San Francisco, again with different artwork.  Some versions, e.g. the Finnish one, seem to accommodate 2-6 players.&#10;&#10;",
        "artist": "Chris Vande Voort,Franz Vohwinkel"
    },
    {
        "name": "Olympica",
        "description": "Microgame #7 in the Metagaming Microgames series.&#10;&#10;From the back cover of the rule book:&#10;&#10;&quot;THE WEBBIES WANT YOUR MIND...&#10;&#10;OLYMPICA simulates the U.N. Mars raid to capture the Web Mind Generator from a heavily defended area near Nix Olympica's massive caldera. The Webbie revolutionaries are deep in their tunnel complexes surrounded by strong points and infantry. The raiders will use infantry, laser tanks, lifters and the tunnel blasting BOAR drill. If they fail man's future may fall to the telepathic, religion/machine Web Mind of Mars.&#10;&#10;OLYMPICA is the clever tactical creation of Lynn Willis. His future history of the Martian revolution of 2206 hinges on the crucial U.N. raid. The game is easy to learn, fast playing, and challenging. Like the other Microgames, it is ideal for beginners and fun for pros. OLYMPICA is the perfect game for those who've never tried science fiction games.&#10;&#10;Components for the game include a 24 page rules booklet, play counters, and hex gridded map of the Nix Olympica region.&quot;&#10;&#10;",
        "artist": "Jennell Allyn Jaquays"
    },
    {
        "name": "StarGate",
        "description": "SPI's Space Capsule game #2.  SPI seeing the popularity of Metagaming's Microgames started publishing small format science fiction and fantasy games in the late 1970's and early 1980's.  From the rulebook&#10;&#10;&quot;Streaming through the mysterious stargates, the power-hungry Virunian forces have wracked the Milky Way for nearly 80 years in the War of Purification.  Remnants of the civilizations devastated by the Virunian Tri-Ships, banded together in a determined coalition, awaited the moment to launch their counter-stroke.  In 2519 AD, the moment had arrived: the Virunians encounter their nemesis and, retreating headlong to the source of their power, find themselves dispersed and without their potent unified command.  Coalition telepaths, sensing the Virunian confusion, direct their forces to the Nullgate, arriving just as the first helpless Virunian vessels tumble forth from the stargates.  The battle to ensue will decide the Virunian fate in the galaxy.  StarGate re-creates this climatic battle using a stylized, semi-abstract system of movement that allows combatants to conceal themselves from one another in the various planes and dimensions created by the Nullgate.  Players use cardboard playing pieces, representing units of the Virunian and Coalition forces, to maneuver and engage in combat.  Simple probability charts reveal the outcome of combat and various game functions.&quot;&#10;&#10;",
        "artist": "Rick Bryant,Redmond A. Simonsen,Charles Vess"
    },
    {
        "name": "Cortez",
        "description": "Players are either Spanish or Aztec leaders, all of whom are (ostensibly) allied with Hernan Cortez in the subjugation of Moctezuma and Tenochtitlan.  There is a limited element of cooperation between players of the same nationality but, in the end,  each is competing to gain the sole upper hand in the capital city through control of resources, judicious combat, and pawn movement into key areas in Tenochtitlan.&#10;&#10;",
        "artist": "Franz Vohwinkel"
    },
    {
        "name": "The Mad Magazine Game",
        "description": "Each Player starts with $10,000.  The board is Monopoly-like, with 2 inner tracks that can also be used.  Play is counter-clockwise and you must roll the dice with your left hand.  Certain spaces, and the ever present 'Card' cards send you elsewhere, make you pay money (good), make you get money (bad), switch seats with someone else or exchange money with another player.&#10;&#10;First to lose all their money wins.&#10;&#10;",
        "artist": "Jack Burton Davis"
    },
    {
        "name": "Blurt!",
        "description": "Players attempt to be the first to move their pawn all the way around the board.  Each turn a reader will read the actual definition to a word as found in a children's dictionary (so they're simple).  The first player/team to correctly blurt out the word that fits the definition gets to move their pawn forward the number of spaces rolled on the die.  There is no penalty for guessing incorrectly, so things tend to get a bit raucous!&#10;&#10;The player to the reader's left becomes the new reader and a new round begins.  If a pawn land on certain spaces or the same space as an opponent, a &quot;one-on-one&quot; contest is held just between those two players with the victor getting to stay on the spot and the loser having to move back to where the trailing player started.&#10;&#10;In Blurt! The Uproarious Word Race Game, you can always catch up and no one is ever out of the game until the final BLURT!&#10;&#10;Updated content: 1,800 clues on 300 cards with rules for two levels of play.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Ambush!",
        "description": "from the back of the box:&#10;&#10;Ambush! is the solitaire game of combat, adventure, and heroism in World War Two France. Using a ground-breaking development of the programmed paragraph solitaire system, Ambush! gives the player control of an American squad, faced with a variety of missions against an ever-changing, hidden German foe.  The variable events, innumerable tactical options, and wealth of unexpected occurrences make Ambush! a solitaire gaming experience unlike any that has gone before. The easily learned rules are specially designed to get the player into the action within minutes.  The player selects and arms his squad, providing each soldier with command and initiative ratings, perception, weapons skill, driving skill, and movement capability. After selecting one of the eight missions provided, the player sends his squad into a mission map to conduct operations called for in the mission.  Soldiers move freely, as far as the player wishes, checking for events each time they move...until the sequenced action rounds are triggered by the whine of German bullets!&#10;&#10;I wouldn't say the rules are easy and there is no way you are playing this &quot;..within minutes..&quot;&#10;&#10;",
        "artist": "John H. Butterfield,Ted Koller,James Talbot"
    },
    {
        "name": "Bullwinkle and Rocky Role Playing Party Game",
        "description": "From the box.&#10;&#10;&quot;And now here's something you'll really like!&quot;&#10;&#10;&quot;Join the fun at Frostbite Falls and Wossamotta U. with Bullwinkle, Rocky and all their pals!  The Bullwinkle and Rocky game lets you play the role of your favorite character - from Dudley Do-Right and Mr. Peabody to Boris Badenov and Snidely Whiplash!  Easy to learn, the Bullwinkle and Rocky game is really three games in one!&quot;&#10;&#10;&quot;The narration Game has all the fun of roleplaying with none of the complex rules!  Using cards as cues, you and your friends take a Bullwinkle and Rocky story, a Fractured Fairy Tale, or any other story and retell it - your way!  The only limit to the looniness is your own imagination as the story takes dramatic turnes, implausible twists, ans silly leaps of logic!  And incredibly easy to learn too.&quot;&#10;&#10;&quot;In the Everybody Can Do Something Game, you play an actual Bullwinkle and Rocky character, in adventures based on your favorite TV cartoons!  Boris and Natasha have another fiendish plan - can Bullwinkle and Rocky stop them?  Will Bullwinkle ever pull a rabbit out of his hat?  No dice in this game - take a spin on one of the six character-customized spinners to find out how things turn out!&quot;&#10;&#10;&quot;The Mr. Know-it-All Graduate Game gives you even more freedom and flexibility.  Make up your own characters!  Design your own adventures!  Use your favorite Bullwinkle and Rocky characters...or don't!  It's completely up to you!&quot;&#10;&#10;Puppets: Hand puppets of your favorite characters.  Raise silliness to new heights.&#10;&#10;Character Cards: Pictures and statistics for all the zany characters from the cartoons.&#10;&#10;Spinners: Who will succeed? Spin each character's Rotational Randominzer to find out!  Spinners aren't just for kids anymore.&#10;&#10;Cards: Filled with strange places and unusual happenings.  Use them to prompt the action.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Which Witch?",
        "description": "Classic three dimensional haunted house race game from the seventies. Players move their pawns around the board trying to be the first to escape the house. Along the way players draw cards that either: a) turn you into a mouse (can't move), b) turn you back into a child if you are a mouse, or c) have you drop the &quot;whammy&quot; ball down the chimney. The whammy ball comes out in one of the four quadrants of the game board and makes something move (witch's broom, secret door, etc.). If a player's pawn (or mouse) is hit by the ball or moving object it is sent backwards to a &quot;safe&quot; spot. Ages 6 - 12.&#10;&#10;Which Witch came out in two editions: a large box version in 1970 with an unfolded board, and a narrow box edition in 1971 with a folding board.&#10;&#10;Finnish version known as Kummituslinna did not use cards for events but came with wheel you spin around. Kummituslinna had high quality plastic tower and staircase instead of cardboard.&#10;&#10;Italian version of the game was published by MB and it was called &quot;Brivido!&quot;. It came with a plastic central tower and a phosphorescent skull instead of the ball. Also, the plastic &quot;scared guy&quot; markers glow in the dark and the cards are replaced with a spinner (the Greek version also came with the glowing skull and the spinner).&#10;&#10;Hungarian version of the game is known as &quot;Szellemkast&eacute;ly&quot; and also came with a plastic central tower, a wheel instead of cards and a skull which glows in the dark.&#10;&#10;The UK version of the game, called Ghost Castle, also featured the black plastic central tower, glow-in-the-dark skull, and spinner.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Remember the Alamo",
        "description": "Remember the Alamo! is a fast and furious game about the final Mexican assault on the Alamo. The rules are short and easy to learn, but written so players can experience the thrill of this desperate battle.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Icebergs",
        "description": "You are the captain of the Yukon Lady, an oil supertanker. You are locked in a frantic race with your competitors through perilous Arctic waters to win the race for oil. Your voyage is fraught with dangers from icy waters and treacherous icebergs. You must navigate your supertanker through these hazards under the eerie Northern Lights.&#10;&#10;",
        "artist": "Harry Quinn"
    },
    {
        "name": "French Foreign Legion",
        "description": "(from the back of the box:)&#10;&#10;The French Foreign Legion is based on a genre of movies and serials that feature hard-cased Legionnaires defending a desert fort against hordes of fanatical tribesmen. The action is fast, furious, and unpredictable as the Bedouins rush the walls, throw their grappling hooks, and climb up for furious melees with the tough defenders. Can the walls be held, or is it time to fall back to the inner buildings? Will dynamite breach the walls, and will the heat cause men to be seized by &quot;the madness&quot;? What about the mutiny that was brewing? Can the discipline and strong defenses stop overwhelming numbers? Tune in next week for chapter 5, or play a game of THE FRENCH FOREIGN LEGION.&#10;&#10;",
        "artist": "Rodger B. MacGowan"
    },
    {
        "name": "Decline and Fall",
        "description": "Decline and Fall is a four-player game in which some of the forces which led to the breakup of the Roman empire are represented. Each player is provided with counters representing peoples or armies which move across a map of the ancient world and engage in conflict with other units. Through strategic movement, conflict and diplomacy each player tries to achieve certain goals.&#10;&#10;The four sides are: Rome, the Goths, The Huns and the Vandals.  The four sides have asymmetrical strengths and units.&#10;&#10;A game consists of 15 turns, each divided into 4 player-turns which in turn consist of three main stages: movement, conflict, and movement again. A full turn represents about 5 years of real time.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Mutant Chronicles: Siege of the Citadel",
        "description": "Precursor of the Mutant Chronicles miniatures Game and a kissing cousin of Heroquest stands Mutant Chronicles: The Siege of the Citadel&#10;&#10;Setting: In Mutant Chronicles, players control one of five corporations: Imperial, Cybertronic, Mishima, Capitol, or Bauhaus. Each player begins with two of their own unique Doomtroopers imbued their Corporation's special ability.  They make decisions and plan strategies to prevent the Dark Legion and its leader, the vile Nepharite, Alakhai, from conquering the solar system. Each successful mission brings a new one with the modular Citadel and events that can help or hinder you in battle. Each promotion gives credits to access more powerful weaponry!  Grab a Punisher Shortsword and Plasma Carbine to make your mark in the Mutant Chronicles!&#10;&#10;Gameplay:  The game begins by choosing which of the 5 players will be the Dark Legion Player for the current mission.  A player fulfills this role by setting their Doomtroopers aside for the current mission and controlling the enemies.  The Dark Legion player can earn promotion points for their inactive Doomtroopers by wounding the other player's Doomtroopers.  Thus, taking a turn as the baddies is not totally thankless.  10 different scenarios are included with the game.&#10;&#10;The Corporation players take their Player tray and 2 Doomtrooper miniatures, two Doomtrooper cards and a Secondary Mission card if specified by mission (these allow extra points if the requirements of the card can be met).  The Dark Legion Player sets up the current mission's Citadel layout with the modular boards and gathers his mission specified Force Cards.  The Force cards are deployed in rooms face-down and are revealed when a Doomtrooper enters and the corresponding Dark Legion miniatures are placed on board.  All miniatures may move 3 squares per move action and most figures get 2 actions per turn.  A figure can do one of the following: Move then Attack, Attack then Move, Attack twice or Move twice.  Corporation Players go first.  Order is determined by flipping over a face-down Corporation token.  The revealed Corporation player then takes their turn with both Doomtroopers and the next Corporation token is flipped.  Play is semi-cooperative for the Corporation players as they compete for points, but want the overall mission to succeed.   The weapon card the Doomtrooper has equipped determines whether he can attack long range, close combat or both.  There are various miscellaneous equipment that can be equipped in addition to the weapon (healing kits, laser targeting, Grenade launcher etc...).  Attacks are carried out by rolling dice and comparing the number of hits to the armor value of the target.  If the number of hits exceeds the armor value of the creature it is eliminated.  In addition Doomtroopers can use a Doomtrooper card to affect the game in some way.  These cards list two effects but only one can be used per card and are then discarded.  The possible effects range from modification of combat or movement to messing with your opponents (jamming their gun for example).  After all Corporations have taken their turns it is the Dark Legion players turn.&#10;&#10;The Dark Legion(DL) Player at the start of his turn draws the top event card, reads it out loud and follows the instructions.  The DL player then receives the reinforcements listed on the card and places them on the board.  The DL player then looks to see if any Force cards are still face-down. If there are, the player reveals one and places the revealed units in the same room the card was in.  The DL player then takes his actions with all of his creatures.  Play continues in this way until mission is successful or the time runs out and it fails.&#10;&#10;Game End: Successful Doomtroopers receive promotion points for the creatures killed in battle and credits specified for the mission.  If they gain rank Doomtroopers improve the combat dice they use and gain extra actions.  With their credits Doomtroopers can purchase improved weaponry and gadgets (Gehenna Puker, Nimrod Autocannon).  The Dark Legion player's inactive Doomtroopers gain 1 promotion point per point of damage inflicted upon the opposing players' Doomtroopers by creatures.&#10;&#10;A rare poster-magazine called &quot;Sinkadus&quot; 41# &amp; 42# that was produced by Target Games AB only in Sweden, added an expansion to Siege of the Citadel.  It added to the base game Brotherhood Characters (Inquisitor Nicodemus and Mortificator Sebastian Crenshaw), new equipment, spells, and two new baddies: the Pretorian Stalkers. All the minis were given their own stats and paper models for representation.&#10;&#10;",
        "artist": "Paul Bonner"
    },
    {
        "name": "Strata 5",
        "description": "The Strata 5 challenge is to build and scale a structure that's 5 levels or 5 strata high. To do so, you must move your pawns and position building block playing pieces&hellip;and you must do both of these actions on every turn. As you and your opponent position blocks, move your pawns up the levels searching for the fastest way to the 5th strata. On each turn, you must move two pawns and position one block. If you climb with caution and construct with cunning, you'll move one of your pawns onto the tip-top strata first and win the game. When moving and building, try to trap the enemy pawns inside the structure, blockade them so they cannot move, or capture them and move them as your own. Strata 5 enforces strict building codes on pawn movement and block placement. But if you're &quot;level-headed&quot; enough to build, climb, block, and capture strategically, you'll reach the 5th level first!&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Space Station Zemo",
        "description": "The game Space Station Zemo is a rare game published in September 1998 by Inquest Magazine (issue #41). Some assembly and dice were required to play, the game was not complete when purchased.&#10;&#10;The game takes place on the Space Station Zemo. From the Rules/description:&#10;&#10;&quot;Zemo: the final frontier. These are the escapades of the inhabitants of Space Station Zemo. Their mission: to boldy blow up where no one has blown up before-- or to get the hell of the station before it explodes...&quot;&#10;&#10;There are five different characters the players can pick or choose randomly. Chuckie the Zombie, Floyd the Droid, Mush the Abomination, Pete the Cook, and The Rats. The players attempt to find the security card, set the controls to their password, and escape the station before it blows up.&#10;Killing all the other people also works.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Pokémon Jr. Adventure Game: Pokémon Emergency!",
        "description": "The Pok&eacute;mon Adventure: Pok&eacute;mon Emergency! game was intended to be the first of twelve &quot;Pok&eacute;mon RPG&quot; supplements, but due to licensing matters, the rest were never published.&#10;&#10;The game is a simplified RPG style game where the players take the role of Pok&eacute;mon Trainers.  The (D/G)M takes the controls of the game and narrates the players through some adventures.&#10;&#10;The components of the game are several of the basic Pok&eacute;mon and a D6.  The attacks of each Pok&eacute;mon have a difficulty, and if you roll one of the numbers that make the attack succeed, the attack succeeds.&#10;&#10;A clever and simple system, the D6 system is a very good way to run some simplified RPG games with your non-dicechucking friends.  It goes great with games similar to Heroquest for those who don't like difficult rules.&#10;&#10;This game is also a great way of getting younger players into the gaming hobby and introduce them to RPGs.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Krull",
        "description": "From the rulebook:&#10;&#10;&quot;You and your opponents are battling to save Princess Lyssa from the Beast. (He's taken her from Prince Colwyn and carried her off to the Black Fortress!) You must capture the Glaive card. Don't let opponents take it from you! And locate the Black Fortress card, while keeping its whereabouts a secret from others. Once you have the Glaive and can expose the Black Fortress, battle the Beast and try to rescue the Princess. Defeat the Beast and you're winner!&quot;&#10;&#10;Based on the movie of the same name&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "XXXenophile",
        "description": "The XXXenophile collectable card game is a game based on introducing different people, places, and things and hope they &quot;pop.&quot; Based on the erotic comic of the same name by Phil Foglio, the game retains the humor of the comic, but the images are  less explicit. Where the comic is definitely rated  'X',  the card game's pictures, for the most part, could be seen in a PG-13 Movie. Since there is a PG-13 rated image on each card, however, the artwork would receive an &quot;R&quot; rating.&#10;&#10;The basic mechanic of the game is laying out the cards in a certain pattern face down, flipping one of the cards, and then attempting to match the edges of the cards with edges of the same color. Each card has a different point total, and the first player to 100 points wins.&#10;&#10;Each player brings his or her own deck to play, and the decks get hopelessly intermingled during play. Half the fun of the XXXenophile game is gaining cards that you did not originally have.&#10;&#10;The artwork of the cards is NOT for young children, yet young adults of the age of fourteen or fifteen would enjoy it. The cards are not painted in an insulting way, and there is material for people of all sexual preferences within the artwork.&#10;&#10;Cheapass Games&rsquo;s James Ernest, the game designer who designed Kill Doctor Lucky and Button Men, created the design for play of the game.&#10;&#10;",
        "artist": "Rob Alexander,George Barr,Daniel Buckley,Ernie Chan,David Cherry,Tim Collier,Liz Danforth,Mike Dashow,Robert DeJesus,Gerard Donelon,Colleen Doran,Lela Dowling,Mark E. Rogers (I),Duncan Eagleson,Robert Eggleton,James Ernest,Steve Fastner,Phil Foglio,Kaja Foglio,Leah Hirch,Quinton Hoover,Matt Howarth,Julia Lacquement-Kerr,Rich Larson,April Lee,Monika Livingstone,Todd Lockwood,Lubov,Anson Maddocks,Harold Arthur McNeill,Mark A. Nelson,Justin Norman,Stormin' Gus Norman,Mitch O'Connell,Margaret Organ-Kean,Zak Pasco,Mike Raabe,Doug Rice,Toivo Rovainen,Tomoko Saito,Doug Shuler,Dan Smith,Brian Snoddy,Michelle Spaulding,Diana Harlan Stein,Mark Tedin,Ruth Thompson,Krik Van Wormer,Pete Venters,Neil Vokes,Charlie Wise,Jim Woodring,V. M. Wyman"
    },
    {
        "name": "Elric",
        "description": "Based on Michael Moorcock's Elric series, this wargame attempts to bring the various nuances of the novels together. War, politics, magic, and the balance between Chaos and Law are all simulated.&#10;&#10;While armies, as in most wargames, are essential, individual characters also play a vital role. Magic is also important as spell casting affects the cosmic balance between Chaos and Law.&#10;&#10;There are 6 scenarios provided for 1 to 4 players plus an encouragement to create your own.&#10;&#10;All in all a very faithful rendition of the books.&#10;&#10;",
        "artist": "Yoshitaka Amano,William Church,Steve Leialoha,Kenn Nishiuye,Steve Oliff,V. M. Wyman"
    },
    {
        "name": "Air War: Modern Tactical Air Combat",
        "description": "(from the box lid:)&#10;&#10;Air War: Modern Tactical Air Combat is a unique, ultra-complex simulation of almost every facet of modern aerial combat.  Thirty of the most important aircraft types to emerge since 1952 - from the Soviet Union, United States, Great Britain, France, Israel and other nations - do battle in historical scenarios from the Middle East to Vietnam, from Korea to India-Pakistan, and in various hypothetical scenarios that include World War Three.  The game is played on a geomorphic map across which playing pieces move through a hexagonal grid, which functions like the squares of a chessboard in regulating movement.  Probability charts reveal the outcome of various game functions.&#10;&#10;Contents: 48-page rules booklet; 16-page booklet of additional rules &amp; scenarios; 72-page chart booklet; 700 die-cut cardboard playing pieces; eight 8-1/2&quot; x 11&quot; soft map sections; and various play aids.&#10;&#10;Level of Complexity: Very High&#10;Average Playing Time: 2 hours&#10;Suitability for Solitaire Play: Very Low&#10;&#10;&#10;(BGG description:)&#10;&#10;At one point called the most complicated wargame ever. This modern air combat game has a scale of 1 airplane per counter, 500 feet per hex and 2.5 seconds per turn.&#10;&#10;The rule book is 48 pages long with 28 of those being rules. There is a large display for keeping track of each plane (4 per display) with a separate track for throttle, weapons, acceleration, turning at 5% increments, altitude and attitude giving each plane a true xyz position.&#10;&#10;Included is a 16 page booklet of 39 charts and tables. There are also individual sheets for each plane with info, charts and tables. There are also individual charts and tables for each type of missile.&#10;&#10;The game rightly suggests that you fly an individual plane around at first to learn how a plane operates before adding weapons. The game for all its detail is not without controversy as to realism. The energy rules and the claim that some aspects of the game are based on educated guesses because of the info on some planes being top secret, have caused this feeling of fudging.&#10;&#10;All in all one of SPI's most ambitious projects. There is also an expansion - Air War Update Kit.&#10;&#10;",
        "artist": "Rodger B. MacGowan,Keith Parkinson,Redmond A. Simonsen"
    },
    {
        "name": "Barbarian Prince",
        "description": "From the game box:&#10;&#10;Barbarian Prince is a solitaire game of heroic adventure in a forgotten age of barbarism and sorcery.  No opponent is necessary, as the Event Booklet takes you through a pre-programmed sequence of encounters which is different each time you play the game.  For each event, you, as the Barbarian Prince Cal Arath, must make the decisions which will make your quest successful - or may cost you your life.&#10;&#10;Barbarian Prince is a new concept in Adventure Gaming.  No rules reading is required; the programmed event sequence lets you begin play as soon as you open the box.&#10;&#10;",
        "artist": "Frank Cirocco,Cynthia Sims Millan"
    },
    {
        "name": "Shapeshifters",
        "description": "Two wizards bent on killing each other have the ability take on the forms of a wide variety of different animals, some real, some mythic.&#10;&#10;Using replaceable spell points the wizards change forms to get an upper hand on each other.  There is a cost for transforming and maintaining a form so it is not always best to transform to a large, dangerous animal.  Animals are rated for movement, movement type (flying, ground, diving), size, attack, defense, reflexes and special ability.  There is a flow chart showing cost of changing from one form to another.  The game is played on a hexagonal grid map.&#10;&#10;",
        "artist": "Brian Griffin,Kenneth Levine,Marc \"Ninjaboy\" Siry"
    },
    {
        "name": "Spies!",
        "description": "Spies is a game of espionage and intrigue for up to five players, set in the turbulent European era of 1933-1939.  You control the secret service of one of the major powers of that era - Germany, Italy, Russia, France, and Britain - in the constant struggle to gather your opponents secrets and return them safely to your own capital while protecting your own country's secrets.&#10;&#10;",
        "artist": "Redmond A. Simonsen"
    },
    {
        "name": "Warhammer Quest",
        "description": "Warhammer Quest is the original game in the Warhammer Quest Series.&#10;&#10;From the Main Rulebook:&#10;&#10;In Warhammer Quest each player takes the role of a warrior, one of four brave adventurers willing to test their courage in the search for wealth and glory. Each hero comes from a different people. The Barbarian has traveled far from the savage north, a land of bitter cold and ferocious warriors. The Wizard hails from the cities of the Empire, the largest and most important of the realms of men. The Dwarf is drawn by the goldlust for which his race is famous. Dwarfs are grim and rather abrupt, but they are good fighters and loyal friends who remember debts of gratitude as readily as debts of coin. The Elf comes from the green woods of Loren where his kin spend their days hunting and making merry, protected from evil by the strange magic of their land. Elves are incredibly quick and agile, and they are also the best archers in the world.&#10;&#10;In the Warhammer Quest game the players enter a dark and forbidding dungeon. Together they must face the horrific dangers that wait for them. They will be attacked by monsters such as Orcs, Goblins, Skaven and Minotaurs. Other perils lurk in the darkness: scurrying venomous things like spiders, deadly pit traps, and decayed tunnels that cave in at the slightest touch. If they complete their quest the players will be rewarded with gold, treasure and artefacts of magical power. The more gold and treasure you can discover the better.., and the player whose warrior amasses the greatest fortune has done best of all!&#10;&#10;Warhammer Quest is probably unlike other games you have played. Rather than each player competing against the others, all the players must co-operate if they are to win. Also, there is no single board. Instead, the different rooms and corridor sections are clipped together to make a dungeon that is different every time you play. The game rules may seem a little complex at first - but don't worry a lot of the rules are designed to extend the game and are not vital to begin with. The actual game rules you need to play are in this book or printed on the various cards. The hugely thick Role-play Book is all extra and alternative material that introduces you to a whole new hobby of role-playing Warhammer Quest.&#10;&#10;- Warhammer Quest Contents -&#10;&#10;    4 Warrior models: Barbarian, Dwarf, Elf and Wizard&#10;    6 Orc Warrior models&#10;    6 Orc Archer models&#10;    6 Goblin Spearmen models&#10;    6 Night Goblin Archer models&#10;    12 Skaven models&#10;    3 Minotaur models&#10;    12 Giant Spider models&#10;    12 Giant Bat models&#10;    12 Giant Rat models&#10;    12 Snotling models&#10;    10 Dungeon Doorways&#10;    32 Page Rule Book&#10;    16 Page Adventure Book&#10;    192 Page Role-play Book&#10;    1 How to Play sheet&#10;    50 Page Adventure Record Pad&#10;    19 Event Cards&#10;    23 Dungeon Cards&#10;    30 Treasure Cards&#10;    17 Blank Event Cards&#10;    15 Spell Cards&#10;    4 Warrior Cards&#10;    4 Battle-level Cards&#10;    4 Equipment Cards&#10;    4 Warrior Counters&#10;    6 Dungeon Rooms&#10;    5 Objective Rooms&#10;    7 Corridors&#10;    1 Steps&#10;    3 T-junctions&#10;    1 Corner&#10;    1 Portcullis Marker&#10;    1 Cave-in Marker&#10;    3 Pit of Despair Markers&#10;    6 Webbed Counters&#10;    15 Power Tokens&#10;    10 Luck Counters&#10;    18 Scenery Markers&#10;    6 Large Dice &amp; 12 Small Dice&#10;&#10;&#10;&#10;&#10;",
        "artist": "John Blanche,Wayne England,David Gallagher,Mark Gibbons,Geoff Taylor,Richard Wright"
    },
    {
        "name": "Demonlord",
        "description": "Demonlord is a game of strategy for two players. It vividly recreates the grand sweep of empires in conflict in an age of sorcery and enchantment. Infantry and cavalry sweep across the land to meet in battle or besiege fortresses, as winged troops wheel overhead. Priests invoke friendly spirits, as magicians prepare potent battlefield magic, or summon great beasts to their aid. And controlling it all, the dread Demonlord, and the Captains of the Hosar alliance with their retinue of personalities and special powers.&#10;&#10;A print-and-play version of this game is available for free, authorized download from http://dwarfstar.brainiac.com/.&#10;&#10;",
        "artist": "David Helber,Arnold Hendrick,Cynthia Millan,Charles Vess"
    },
    {
        "name": "The Quest of the Philosopher's Stone",
        "description": "A unique game that combines strategy with puzzle solving.  Players or teams move their pawn around the board trying to gain two wisdom cards for each of the four territories.  Wisdom cards are earned by correctly answering brain teaser questions from the Book of Challenges.  Wisdom cards, in turn, allow a player to obtain an alphabetical clue for that territory.  The four alphabetical clues, correctly unscrambled, form a word related to the medieval theme of the game.  The first player to correctly decipher the word wins the game.  The board also contains areas to help the players move around the board and/or interfere with the progress of their opponents.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Bounty",
        "description": "Bounty is a game for 2 - 8 players from 6 years of age and older. The goal is to make as much money - 'Dubloons' - as quickly as possible! Players start from Home Port as merchants and set out on a trading voyage. By throwing the die, they sail to exotic ports like the Pearl Coast, the Jewel Coast and the Spice Islands. When they arrive at a port they pay a trading fee and draw a card which tells them what cargo they have bought. Cargoes range from codfish and coal to precious spices, pearls and diamonds,!&#10;&#10;Players might also draw a pirate card while trading. They then have to decide whether to rob other players - or continue as honest merchants. Players could also draw a warship card - in which case any pirate who attacks them or anyone else nearby will be in for a nasty shock! The top card in each player&rsquo;s pack shows whether they are merchants, pirates or warships. Since they don&rsquo;t show each other their cards - no-one really knows what they are (until someone decides to turn pirate by attacking another ship).&#10;&#10;Players who are robbed can get their revenge by calling in the Navy and chasing the pirate down before he or she can reach Home Port! Things are made even more exciting by the &lsquo;Treasure Chest&rsquo; cards which players draw every time they roll a &lsquo;one&rsquo;. They then find out whether they have landed without any wind in the doldrums, - or been blown by a hurricane to a distant port, - or have found buried treasure - or other such twists of fortune!'&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "War of 1812",
        "description": "(from Columbia Games website:)&#10;&#10;War of 1812 is an elegant strategy wargame depicting the Anglo-American struggle to control the Great Lakes and Canada.&#10;&#10;War of 1812 sets up in five minutes and plays in 1-2 hours. This classic game has been enjoyed by thousands of gamers for over 30 years.&#10;&#10;Unit types in this edition include artillery, cavalry, infantry, and navies. The map board is unchanged from previous editions.&#10;&#10;&#10;(see War of 1812 webpage for full history of this war)&#10;&#10;",
        "artist": "Eric Hotz"
    },
    {
        "name": "Spammers",
        "description": "FROM the SESSION REPORT:&#10;&#10;Each player is competing to pull off the most lucrative scams. You do this by spamming mailing lists. The more closely related the mailing list is to the type of scam you're trying to pull, the easier it is to score.&#10;&#10;Scams come in 4 types - sex, internet, money and free stuff. The text and art flavor are quite wonderful. Of course the sex scams appeal the most - highlights were the Virtual Jellorama, Walter's Wankery and Disgusting Dog Tricks. If you're geeky, some of the internet scams are witty. All the standard 'make money doing nothing' and free stuff scams are there as well.&#10;&#10;You play scam cards in front of you (up to 5) and then play mail-out cards (spams) trying to lure people in. There are a number of mailing lists of various sizes in the middle for anyone to mail to, plus each player has some private mailing lists that only they can spam. The action is to play a 'mail' card, nominating both a scam and the list that you're mailing the scam offer to. If you roll a d6 less &lt;= the size of the list, you succeed, and that scam scores a point. If you roll way under (4 or more), your scam scores 2 points. Some lists specialize in one of the 4 scam types ... if your scam and the list matches, you get a modifier of +2 making it easier to score, plus the mail-out cards have modifiers between 0 and +5.&#10;&#10;Simple so far, but every time a mailing list gets spammed, it decreases in size by 1 (1 million thematically which equals 1 on the die) - these are subscribers getting disgruntled by the amount of spam they're receiving who leave the list.&#10;&#10;The winner is the first person to get 20 points across all their scams, or who gets a single scam of 12 points BUT it's only checked at the start of your next turn.&#10;&#10;A turn consists of 3 actions surrounding 2 decks - list cards and action cards. An action is pick up a card, play a card or merge 2 lists (making one bigger list you can then mail to). The action cards consist of scams, mail-outs or hardware cards. Hardware cards are played in front of you and allow you to break the game rules in a prescribed way (eg can mail other's private lists). Mail-out cards also list special effects which vary from mundane to wildly powerful but generally allow you to hose other players. When you play one, you say whether you're mailing or playing the special effect.&#10;&#10;To the game play itself. You try to get a mail-out going every turn (you're only allowed one) and pick a scam / list combination that gives you the best chance of scoring 2 points rather than 1 point. If you only get 1 point, you may well be falling off the pace. You're generally picking up at least one card each turn, and this can be a slow process as any special action needs to be read and understood to work out whether you want to use the card as a mail-out or for the special effect. So it's not the fastest game in the world. These hostage cards also make it a big hit the leader game. If you're going to make a dash for the lead have plenty of protection cards because you have to maintain your winning score for a full round before you win - everyone gets a shot at you.&#10;&#10;",
        "artist": "David Gatzmer,John Nephew,Jeff Tidball"
    },
    {
        "name": "Colonisator",
        "description": "A space war between two races. The goal of the game is colonizing the higher number of planets. The two armies contain the same units, but only a few units are already deployed in the beginning, so a strategical option is to choose which kind of unit are to be produced every turn. Transport ships are the way for the colonization, but they are weak and unarmed... Other units are Fighters, Cruisers, and Mobile Bases.&#10;&#10;The first edition published by International Team was Kroll &amp; Prumni; Euro Games cleaned up the rules for Colonisator.&#10;&#10;This is your basic two-player SF game of colonization &amp; war.&#10;&#10;",
        "artist": "Enea Riboldi"
    },
    {
        "name": "The Lord of the Rings Adventure Game",
        "description": "Milton Bradley marketed this game as a tie-in with Ralph Bakshi's &quot;Lord of the Rings&quot; animated feature film. However, aside from the artwork and the piece names, the game only bears a superficial resemblance to either the movie or Tolkien's works.&#10;&#10;Each player chooses a character from the Fellowship. The object of the game is to have that character cast a magic Ring into Mount Doom. Along the way from the Shire to their final destination, players have opportunities to pick up *several* Rings. These rings may be spent to get past opposing creatures. However, to win the game, a player must have at least one Ring when they reach Mount Doom.&#10;&#10;Cards allow a player to move 1-3 clear spaces ahead, to defeat Orcs or Nazgul, to bypass the various opposing creatures on the board, or to traverse mountain terrain, dictate movement. Cards are also useful for stealing rings from an opponent, relocating Nazgul on the board, and other functions. Each player has a hand of 5 cards with which to play the game.&#10;&#10;Die rolling comes into play for fighting Orcs, Nazgul, Shelob and Gollum when you don't have a card to defeat (or escape from) them, or to traverse the mountains. A special die tells players how many turns they will be bogged down in a mountain space once they enter it.&#10;&#10;Card and Ring management afford strategy opportunities, while the rules remain simple enough (and the game quick enough) to allow the game to be played by a wide variety of ages. Despite its divergence from the main story, the game itself offers a measure of challenge that makes it enjoyable - far more so than it would have been as a simple &quot;roll-and-move&quot; game with a strict adherence to the movie or book theme.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Vertigo",
        "description": "You head an industrial nation and must look after your citizens' welfare.  You must develop your country as fast or faster than your competitors ---but the price to pay is pollution, which affects every one.  The players must negotiate with each other through the United Nations' Council and agree on how to develop their countries.&#10;The winner is the country with the most industrial plants at the end ---if there is a winner!&#10;&#10;The rules are simple and there is no clear winning strategy.  There is some downtime during other players' turns, but Vertigo should nevertheless be a solid addition to your game library.&#10;&#10;",
        "artist": "Pascal Trigaux"
    },
    {
        "name": "Coup",
        "description": "A simple two-player game pitting the revolutionaries against the entrenched leader.  Think of it as two-player Junta.&#10;The components are really flimsy (map and counters).&#10;&#10;The map is real simple, city and outlying sections, with victory locations (Radio/TV, Armoury, Capitol, etc.) scattered about.  Small, but fun.&#10;&#10;Try this: You lose points for rubble-izing the city hexes...so you -have- to overrun...&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Double Crossing",
        "description": "&quot;A game that combines adventure, danger, strategy, luck of the dice, etc.  A quick thinking and dastardly deed for up to 6 players.&quot; You drive your train around the board collecting cars and eventually selling them.  Cards help you, hinder you, or allow you to hinder your opponents.&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Smokers Wild",
        "description": "In this anti-smoking game, the players try to accumulate money while avoiding addiction to cigarettes.  At the start of the game, each player picks a profession likely to benefit from the smoking of others (Doctor, Undertaker, etc.) and then starts moving around the board.  If a player lands on an advertising space, there's a chance that he or she will begin smoking.  When a smoker ends up sharing a space with another player, there's a chance he'll pawn one of his brand habits to him.  The more a player smokes, the faster they advance on the Life-O-Metre, which ends with death.  The game ends once the first player dies (in the short game) or when only one player remains alive (in the longer game).&#10;&#10;The game is extremely simple to play and is filled with all kinds of horrible (but sometimes amusing) puns.  The game's claim that it has the power to cause smokers to quit and to discourage people from ever picking up the habit is rather questionable, but since it's easy enough to be played by young children, its anti-smoking message might actually be able to reach an audience that hasn't heard it all before.  Unfortunately, the game's simplicity may well work against it; for some players, once all the jokes have been heard (and there aren't all that many), there's really not much reason left to play the game.  On the plus side, there's a lot of player interaction as your profession gets called upon or when you pass your cigarettes to another.&#10;&#10;Smokers Wild seems related to Drinkers Wild so it may have been originally published by Gamma Two.&#10;&#10;Similar to:&#10;&#10;    Drinkers Wild&#10;    Lovers Wild&#10;&#10;&#10;&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Space Pigs",
        "description": "In a galaxy far, far away...&#10;&#10;The pig clans are in a furious competition to control the planets which produce the precious acorns from which the Beer can be brewed.  The Beer is a source of power and strength for those who drink it.  You are the head one of the six great pig clans; you must impose your Beer recipe and thus become the most powerful pigs in the Universe!&#10;You will have to fight, negotiate, cheat, corrupt...&#10;&#10;Space Pigs is a humorous game of conquest which freely borrows from Star Wars, Dune, and all those SF chestnuts.&#10;&#10;",
        "artist": "Greg Cervall"
    },
    {
        "name": "Napoleon: The Waterloo Campaign, 1815",
        "description": "On June 18, 1815, one of the most decisive battles in military history was fought in Belgian fields twenty miles southeast of Brussels. Within a short 100 days, Napoleon, former emperor of France, had returned from exile on the island of Elba, again seized power, quickly assembled an army, and marched to defeat the dispersed British and Prussian armies now preparing to invade France.&#10;&#10;Napoleon invaded Belgium on June 15th, defeated the Prussians at the Battle of Ligny on the 16th and after a day of pursuit, faced the British and Dutch army commanded by Wellington. Aided by superb defensive tactics and the timely arrival of Prussian reinforcements, Wellington defeated the French in the great Battle of Waterloo, ending forever the military ambitions of the great Napoleon.&#10;&#10;Highlights:&#10;&#10;&#10;     Mapboard which is a color map of southern Belgium. &#10;&#10;&#10;&#10;     Wooden Blocks as counters provide step-reduction and fog of war with no muss or fuss &#10;&#10;&#10;&#10;     Two or three player game - Napoleon can be played by two or three players. With three, the allied side has two players, one British and one Prussian, and some special rules apply. &#10;&#10;&#10;&#10;     Note that there are essentially three different versions of the game which means that the rules are somewhat different. Key Differences in the various editions:&#10;         1st and 2nd edition had 48 blocks--shorter (60+ min.) play time -- vs.-- 3rd edition has 84 blocks--more accurate division level&#10;          3rd edition had Bl&uuml;cher, Napoleon, and Wellington leader blocks that give slight combat and movement bonuses. Although units have increased nearly two fold, the 3rd edition map remains same size, leading to overcrowding.&#10;          4th edition has 56 blocks and a larger map - play time is usually 90 minutes or less.&#10;    &#10;&#10;&#10;",
        "artist": "Jacques-Louis David,Eric Hotz,Howard David Johnson,Elizabeth Thompson, Lady Butler"
    },
    {
        "name": "Clue: Dungeons & Dragons",
        "description": "Game description from the publisher:&#10;&#10;Who killed the Archmage? Was it Tordek in the Dragon's Lair with the Flaming Battle Axe? Or Mialee in the Dungeon with the Staff of Power?&#10;&#10;In Clue: Dungeons &amp; Dragons, a group of heroic adventurers has been called to the Archmage's castle, but one of those heroes isn't who he appears to be; one of the heroes is a doppelganger, a monster that can look like anyone! In the darkest part of the night, the doppelganger kills the Archmage, triggering a spell that seals the castle until the monster is caught. Now, in the grand tradition of Clue, the six suspects must determine which one of them is the doppelganger: Regdar the Human Fighter, Tordek the Dwarf Fighter, Lidda the Halfling Rogue, Mialee the Elf Wizard, Ember the Human Monk or Nebin the Gnome Wizard. The heroes try to figure out Who killed the Archmage, Where the crime occurred, and Which magical weapon was used.&#10;&#10;For the most part, gameplay in Clue: Dungeons &amp; Dragons is identical to standard Clue as players roll a die, move into different locations on the game board, then make accusations against a particular combination of who/where/which cards and a particular opponent; if that opponent holds one of those cards, she must reveal it to you. Eventually someone will narrow down the possibilities and make an accusation as to exactly which cards have been removed from the game; if correct the player wins, and otherwise she's out of the game and play continues for everyone else.&#10;&#10;One optional element in Clue: Dungeons &amp; Dragons is the Wandering Monsters deck. After landing on a &quot;claw-marked&quot; space on the game board, the player draws the top card from this deck, then battles the creature shown by rolling a die. If she wins, she gains a magic item that confers a single-use special ability, such as looking at a random card from an opponent's hand or taking an extra turn. If she loses, her token is placed in the center of the game board, from where it will take several turns to move back into a room (and get back into the game).&#10;&#10;",
        "artist": "NA"
    },
    {
        "name": "Battle Hymn",
        "description": "Battle Hymn is a solitaire game of combat, adventure, and heroism in the Pacific during World War II. Using the revolutionary programmed paragraph approach pioneered in the Ambush! game system, Battle Hymn gives you a squad of American Marines and challenges you to fight your way through a variety of Missions against a deceptive and ever-changing Japanese foe. Unexpected events and innumerable tactical options offer virtually endless solitaire enjoyment, and the easily learned rules start even relatively inexperienced players on their first Mission quickly. Select you squad, arm them, and choose their Mission. Move your men out, advancing them as you wish, until something triggers an Event - until a peaceful walk in the steaming jungle turns out to be a fight for your life!&#10;&#10;",
        "artist": "Ted Koller,James Talbot"
    }
]