[
    {
        "title": "Sweet Tooth Farina with Peanut Butter Chips",
        "ingredients": [
            "1 2/3 cups whole milk ADVERTISEMENT",
            "1/4 teaspoon sea salt ADVERTISEMENT",
            "1/3 cup dry farina cereal (such as Cream of Wheat®) ADVERTISEMENT",
            "2 tablespoons peanut butter chips (such as Reese's®), divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring milk and salt just to a boil in a saucepan over medium-high heat. Stir in farina gradually; return to boil, stirring constantly. Reduce heat to low; simmer until cereal thickens, about 2 1/2 minutes.\nRemove cereal from heat; cool for 3 minutes. Pour cereal into 2 bowls; stir 1 tablespoon peanut butter chips into each bowl.\n",
        "picture_link": "SSbfyyhcyBmlm9kBzDVsEq7bgTTfwLK"
    },
    {
        "title": "Slow Cooker Oxtail Soup",
        "ingredients": [
            "2 tablespoons butter, or as needed ADVERTISEMENT",
            "1 pound beef oxtail, cut into pieces ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1/2 (750 milliliter) bottle red wine, or to taste ADVERTISEMENT",
            "water to cover ADVERTISEMENT",
            "1 pound potatoes, peeled and cubed ADVERTISEMENT",
            "2 carrots, chopped ADVERTISEMENT",
            "2 ribs celery, chopped ADVERTISEMENT",
            "1 cup green beans ADVERTISEMENT",
            "1 (14.5 ounce) can stewed tomatoes ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat butter in a large skillet over medium heat. Add oxtail and onion; cook until oxtail is until browned, 5 to 7 minutes per side. Transfer oxtail and onion to a slow cooker.\nPour wine into the skillet and bring to a boil while scraping the browned bits of food off the bottom of the skillet with a wooden spoon. Pour wine mixture into slow cooker; add water to cover.\nSet slow cooker to Low; cook soup for 8 hours. Add potatoes, carrots, celery, and green beans; cook soup for 4 hours more.\nCool soup slightly; refrigerate until fat has risen to top and solidified, about 1 hour. Scoop off fat; stir in tomatoes. Reheat soup on stove before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pad Thai with Tofu",
        "ingredients": [
            "1 (12 ounce) package tofu, drained and cubed ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "3 tablespoons vegetable oil, divided ADVERTISEMENT",
            "8 ounces dry rice stick noodles ADVERTISEMENT",
            "Sauce: ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1/4 cup sriracha hot sauce ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 tablespoon tamarind concentrate ADVERTISEMENT",
            "1 teaspoon red pepper flakes ADVERTISEMENT",
            "1/2 onion, sliced ADVERTISEMENT",
            "1 egg (optional) ADVERTISEMENT",
            "2 tablespoons chopped spring onions ADVERTISEMENT",
            "1 tablespoon crushed peanuts ADVERTISEMENT",
            "1 lime, cut into wedges ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Coat tofu with cornstarch in a bowl. Heat 2 tablespoons vegetable oil in a wok or large skillet over medium heat; fry tofu until lightly browned on all sides, 1 to 2 minutes per side.\nPlace noodles in a bowl and pour in enough boiling water to cover; soak until softened, about 3 minutes. Drain.\nCombine water, sriracha, soy sauce, sugar, tamarind concentrate, and red pepper flakes in a saucepan over low heat. Cook and stir sauce until flavors blend, about 5 minutes.\nHeat 1 tablespoon vegetable oil in a wok over medium-high heat. Add tofu, noodles, and sliced onion; cook and stir until tofu is golden brown; about 3 minutes. Stir in sauce gradually until noodles are well-coated.\nPush noodle mixture to one side of the wok. Crack egg onto opposite side of wok; stir until beginning to set, 30 seconds to 1 minute. Stir egg into noodles gently. Garnish with green onions, peanuts, and lime wedges.\n",
        "picture_link": "/5s4ZZzjL1IMfJGMg3ioaKaU5HEGF9u"
    },
    {
        "title": "Mom's Feel-Good Oatmeal",
        "ingredients": [
            "10 cups water ADVERTISEMENT",
            "1 cup steel cut oats ADVERTISEMENT",
            "1/4 cup flaxseed meal ADVERTISEMENT",
            "1/4 cup chia seeds ADVERTISEMENT",
            "3/4 cup goji berries ADVERTISEMENT",
            "3/4 cup raisins ADVERTISEMENT",
            "3/4 cup dried cranberries ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1/4 cup pumpkin seeds ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water to a boil in a large pot. Add oats, flaxseed meal, and chia seeds, whisking well after each addition to prevent clumps. Add goji berries, raisins, cranberries, brown sugar, pumpkin seeds, and cinnamon. Reduce heat and simmer, stirring occasionally, until oatmeal reaches desired consistency, 40 to 45 minutes.\n",
        "picture_link": "SNZw1q5qCg1HD6kAts1ZJuvxK25bGEO"
    },
    {
        "title": "Lima Bean Hummus",
        "ingredients": [
            "3 tablespoons safflower oil, or more as needed ADVERTISEMENT",
            "2 tablespoons tahini ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "1 tablespoon white vinegar ADVERTISEMENT",
            "1 1/2 teaspoons tamari (gluten-free soy sauce) ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon Celtic sea salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 (1x4 inch) piece kombu seaweed (such as Emerald Cove®) (optional) ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "1 3/4 cups cooked lima beans ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine safflower oil, tahini, lemon juice, vinegar, tamari, cumin, salt, black pepper, garlic, kombu, and cayenne pepper in a blender or food processor; blend until smooth. Add lima beans and blend until smooth, adding more oil as desired. Add parsley and pulse just until mixed.\n",
        "picture_link": "0HV3PAL67p6qecYJNobidlwg/Li7AvW"
    },
    {
        "title": "Basic Cream of Wheat",
        "ingredients": [
            "7 cups cold water ADVERTISEMENT",
            "2 cups hard white wheat berries (such as Palouse®) ADVERTISEMENT",
            "8 cups almond milk, or more as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring cold water to a boil in a saucepan; add wheat berries. Reduce heat to medium-low, cover saucepan, and simmer until wheat berries are tender yet firm to the bite, about 30 minutes. Drain.\nCombine wheat berries and almond milk in a large saucepan over medium; heat just until about to boil, about 5 minutes. Transfer mixture to a blender, working in batches if needed. Blend mixture on high until creamy, adding more milk to reach desired consistency, about 30 seconds.\n",
        "picture_link": "IHSywCGO0/WWQlpS.OMzG/iq9nW1tnS"
    },
    {
        "title": "Cauliflower Potato Salad",
        "ingredients": [
            "6 red potatoes ADVERTISEMENT",
            "1 (2 pound) head cauliflower, cut into small florets ADVERTISEMENT",
            "6 hard-boiled eggs, peeled and chopped ADVERTISEMENT",
            "1 bunch green onions, chopped ADVERTISEMENT",
            "1 cup chopped celery ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/4 cup stevia powder ADVERTISEMENT",
            "1 teaspoon cornstarch ADVERTISEMENT",
            "1 (5 ounce) can evaporated milk ADVERTISEMENT",
            "1/4 cup apple cider vinegar ADVERTISEMENT",
            "1/4 cup white vinegar ADVERTISEMENT",
            "1 teaspoon yellow mustard ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 cup olive oil mayonnaise ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes in a large pot; add water to cover. Bring to a boil and cook until easily pierced with a fork, about 15 minutes. Drain. Let cool until easily handled, about 15 minutes. Peel and dice. Transfer to a large bowl.\nFill a saucepan 2/3 of the way with water and bring to a boil. Add cauliflower florets; cook until tender, 8 to 10 minutes. Drain in a colander and rinse with cold water to stop the cooking process, 1 to 2 minutes. Drain well. Blot with paper towels to remove excess moisture.\nPlace potatoes, cauliflower, hard-boiled eggs, green onions, celery, and black pepper in a large bowl; toss to combine.\nWhisk eggs, stevia, and cornstarch together in a saucepan. Stir in evaporated milk, apple cider vinegar, white vinegar, and mustard. Cook over medium heat, stirring frequently, until dressing thickens, about 10 minutes. Remove from heat; stir in butter. Refrigerate until cool, about 30 minutes.\nFold mayonnaise into dressing. Stir into potato mixture gently until evenly coated.\n",
        "picture_link": "4y/tDmw/H8cgbaaA/CLUtbQQw9Xet.u"
    },
    {
        "title": "Shrimp and Tofu Pad Thai",
        "ingredients": [
            "6 ounces extra-firm tofu ADVERTISEMENT",
            "1 1/2 cups soy sauce ADVERTISEMENT",
            "1 teaspoon Chinese five-spice powder ADVERTISEMENT",
            "4 ounces maifun (rice noodle sticks) ADVERTISEMENT",
            "boiling water to cover ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "2 tablespoons lime juice ADVERTISEMENT",
            "2 tablespoons fish sauce ADVERTISEMENT",
            "1 tablespoon rice wine vinegar ADVERTISEMENT",
            "2 tablespoons peanut oil, or more as needed ADVERTISEMENT",
            "1 cup chopped green onions (green parts only), divided ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "2 eggs, well-beaten ADVERTISEMENT",
            "1/2 cup frozen cooked salad shrimp, thawed ADVERTISEMENT",
            "1/4 cup coarsely chopped kimchi ADVERTISEMENT",
            "3 ounces fresh bean sprouts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Drain tofu and wrap firmly in cheese cloth; place between 2 cake pans or plates and place a 5-pound weight on top. Refrigerate for 12 to 16 hours.\nCombine soy sauce and 5-spice in a shallow bowl; add tofu. Marinate tofu in refrigerator for 15 minutes; flip tofu and marinate for 15 minutes more.\nPlace rice noodles in a bowl and pour in enough boiling water to cover; allow to sit until noodles have softened, about 10 minutes. Drain and cut noodles into thirds.\nCombine brown sugar, lime juice, fish sauce, and vinegar in a bowl and stir until sugar is dissolved and sauce is smooth.\nRemove tofu from marinade and cut into 1/4-inch wide strips.\nHeat peanut oil in a large skillet or wok over medium-high heat; add tofu pieces, 2 to 4 at a time, and cook, stirring constantly, until lightly browned and cooked through, about 30 seconds per side. Transfer cooked tofu to a paper towel-lined plate, reserving oil in the skillet.\nPlace 2/3 of the green onions and garlic in the same skillet, adding more oil if needed; cook and stir until fragrant, about 30 seconds. Add eggs; cook and stir until scrambled and cooked through, 2 to 3 minutes. Add shrimp; cook and stir until warmed through, about 30 seconds. Add noodles and toss until evenly mixed.\nStir brown sugar sauce into noodle mixture and toss to coat. Add kimchi and toss until well mixed and pad Thai is heated through, about 1 minute more. Transfer pad Thai to serving plates and top with bean sprouts and remaining green onions.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Masala Cabbage Soup",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 serrano chile peppers, halved (optional) ADVERTISEMENT",
            "2 cloves garlic, sliced ADVERTISEMENT",
            "1 teaspoon chopped ginger ADVERTISEMENT",
            "1 cup coarsely chopped onion ADVERTISEMENT",
            "1 cup chopped potatoes ADVERTISEMENT",
            "2 cups coarsely chopped cabbage ADVERTISEMENT",
            "5 cups chicken stock ADVERTISEMENT",
            "1 teaspoon garam masala, or to taste ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a saucepan over medium heat. Cook and stir serrano peppers, garlic, and ginger in the hot oil until fragrant, 15 to 20 seconds. Add onion; cook and stir until softened and transparent, 10 to 15 minutes.\nMix potatoes into onion mixture and cook for 2 minutes. Add cabbage and cook for 2 minutes more. Pour chicken stock over cabbage mixture; bring to a boil. Reduce heat and simmer until potatoes are softened, 10 to 15 minutes. Season soup with garam masala and salt.\nPour soup into a blender no more than half full. Cover and hold lid down; pulse a few times before leaving on to blend. Puree in batches until smooth. Return soup to saucepan and cook until warmed, 2 to 3 minutes.\n",
        "picture_link": "v5aypOC6HdAlyEvr8smFFdOAeYekcY6"
    },
    {
        "title": "Chicken Gorgonzola",
        "ingredients": [
            "Pesto: ADVERTISEMENT",
            "1 cup fresh basil leaves ADVERTISEMENT",
            "2 1/2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "2 1/2 tablespoons chopped walnuts ADVERTISEMENT",
            "2 1/2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "3 cloves garlic, peeled ADVERTISEMENT",
            "Chicken: ADVERTISEMENT",
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "4 boneless, skinless chicken breasts ADVERTISEMENT",
            "1 cup sliced baby bella mushrooms ADVERTISEMENT",
            "1/2 cup thinly sliced onion ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup Gorgonzola cheese, divided ADVERTISEMENT",
            "1/4 cup white wine ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "2 tablespoons chicken broth ADVERTISEMENT",
            "1 teaspoon brown sugar ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 tomatoes, seeded and chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine basil leaves, 2 1/2 tablespoons olive oil, walnuts, Parmesan cheese, and garlic in a food processor; process until pesto is smooth.\nHeat 1 tablespoon olive oil in a large skillet over medium-high heat. Cook chicken until golden brown, about 5 minutes per side. Transfer to serving platter.\nCook and stir mushrooms in a single layer in the same skillet until tender, about 5 minutes. Add onion; cook until translucent, about 5 minutes. Add garlic and cook until fragrant, about 30 seconds. Add half of the Gorgonzola cheese; cook until slightly melted. Pour in wine and stir to scrape up brown bits from the bottom of the skillet. Stir lemon juice, chicken broth, brown sugar, salt, and black pepper into the sauce.\nBring chicken broth mixture to a boil; reduce heat and simmer until sauce is reduced by 1/4, 3 to 5 minutes. Stir in pesto and return chicken to the skillet. Cook until an instant-read thermometer inserted into the center reads at least 165 degrees F (74 degrees C), about 5 minutes more. Add remaining Gorgonzola cheese and chopped tomatoes.\nServe each chicken breast on a plate topped with sauce.\n",
        "picture_link": "NvsvUJ44vKWlPXoMfr/U5ng4jhAwpZG"
    },
    {
        "title": "Spam® Tacos",
        "ingredients": [
            "1 (12 ounce) can lite luncheon meat (such as Spam®) ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "1/2 (1.25 ounce) package taco seasoning mix, or more to taste ADVERTISEMENT",
            "2 tablespoons water, or more as needed ADVERTISEMENT",
            "8 (6 inch) flour tortillas ADVERTISEMENT",
            "8 ounces shredded lettuce ADVERTISEMENT",
            "8 ounces Cheddar cheese, shredded ADVERTISEMENT",
            "2 (2.25 ounce) cans sliced olives, drained ADVERTISEMENT",
            "1 small tomato, diced ADVERTISEMENT",
            "1 small onion, diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Shred luncheon meat onto a large plate using a cheese grater.\nSpray a large skillet with cooking spray and heat over medium-high heat. Add shredded luncheon meat; cook and stir until it begins to brown, about 5 minutes. Stir in taco seasoning and water. Cook and stir until luncheon meat is evenly seasoned and lightly browned, 5 to 7 minutes. Reduce heat to low to keep warm.\nSpray another skillet with cooking spray and heat over medium-high heat. Place 1 tortilla in the skillet and cook until heated through, about 30 seconds per side. Repeat with remaining tortillas.\nTop warm tortillas with luncheon meat, lettuce, Cheddar cheese, olives, tomato, and onion.\n",
        "picture_link": "eTZ2WJi.5eEO7AzAqVgNCNBLK9DOfGK"
    },
    {
        "title": "Ukrainian Easter Cheese (Paska)",
        "ingredients": [
            "16 ounces farmer cheese ADVERTISEMENT",
            "12 ounces cream cheese (such as Philadelphia®), softened ADVERTISEMENT",
            "1/2 cup unsalted butter, softened ADVERTISEMENT",
            "4 hard-boiled egg yolks ADVERTISEMENT",
            "1 cup superfine white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1 teaspoon grated lemon zest, or more to taste ADVERTISEMENT",
            "1 teaspoon grated orange zest, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine farmer cheese, cream cheese, butter, and egg yolks in the bowl of a stand mixer fitted with a paddle attachment; mix on low speed to combine. Add sugar, vanilla extract, lemon juice, lemon zest, and orange zest; mix until Paska mixture is smooth.\nLine a sieve with dampened cheesecloth, leaving an overhang on all sides. Place over a plate that will catch any additional liquid that drains out.\nSpoon Paska mixture into cheesecloth. Fold the ends of the cheesecloth over the mixture. Cover with a plate and set a heavy weight on top.\nChill until Paska is firm, overnight to 24 hours.\nRemove weighted plate and unfold cheesecloth ends. Use cheesecloth ends to lift Paska out. Invert onto a plate and peel away cheesecloth.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Tuna Alfredo with Penne Pasta",
        "ingredients": [
            "1 cup penne pasta ADVERTISEMENT",
            "24 ounces tuna, drained ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 (16 ounce) jar Alfredo sauce ADVERTISEMENT",
            "2 ounces grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of water to a boil; add penne and cook, stirring occasionally, until tender yet firm to the bite, about 11 minutes. Drain pasta; return to pot.\nPlace tuna in a skillet over low heat; season with onion powder and salt. Cook until lightly browned, about 5 minutes. Stir tuna into cooked pasta. Add Alfredo sauce; stir until combined. Garnish with grated Parmesan cheese.\n",
        "picture_link": "hMtMdrrc99gol0be2JdHTZdI1eZu/GS"
    },
    {
        "title": "Pad Thai Egg Rolls ",
        "ingredients": [
            "1 (12 ounce) package extra-firm tofu, cut into small cubes ADVERTISEMENT",
            "cooking spray (such as Pam®) ADVERTISEMENT",
            "4 cloves garlic, diced ADVERTISEMENT",
            "1/4 onion, diced ADVERTISEMENT",
            "1/2 cup chopped green onions ADVERTISEMENT",
            "1/2 small head red cabbage, chopped ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/4 cup peanut butter ADVERTISEMENT",
            "2 tablespoons chili sesame oil, or to taste ADVERTISEMENT",
            "1 tablespoon lime juice (optional) ADVERTISEMENT",
            "1 teaspoon soy sauce to taste ADVERTISEMENT",
            "1 teaspoon chili-garlic sauce ADVERTISEMENT",
            "1 teaspoon tamarind paste, or to taste ADVERTISEMENT",
            "1 teaspoon grated lime zest (optional) ADVERTISEMENT",
            "20 egg roll wrappers ADVERTISEMENT",
            "2 teaspoons peanut butter, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place tofu on several layers of paper towels. Cover with more paper towels. Let drain, pressing down occasionally, about 30 minutes.\nHeat a nonstick skillet over medium heat; spray with cooking spray. Add garlic; cook and stir until fragrant, about 1 minute. Transfer to a large bowl. Cook and stir onion and green onions until softened, about 5 minutes. Stir into garlic in the bowl. Cook red cabbage until slightly tender, about 3 minutes. Add to garlic and onion mixture. Cook eggs, stirring frequently, until scrambled, about 3 minutes. Stir into bowl.\nStir 1/4 cup peanut butter, chili sesame oil, lime juice, soy sauce, chili-garlic sauce, tamarind paste, and lime zest into bowl; toss until vegetable and egg mixture is evenly coated.\nPreheat oven to 400 degrees F (200 degrees C).\nSpoon a small amount of filling into the middle of an egg roll wrapper. Fold over bottom and sides to enclose filling. Roll wrapper upwards to a form a neat roll shape. Use a pea-sized dot of peanut butter on the flap to seal. Repeat with remaining filling and wrappers.\nArrange rolls on a baking sheet. Lightly spray all sides with cooking spray.\nBake in the preheated oven until edges are slightly browned, 15 to 20 minutes.\n",
        "picture_link": "yK64Uy9S6AESiB7QGabZZCL7H2HufCO"
    },
    {
        "title": "Batida de Coco Rapida (Brazilian Coconut Cocktail)",
        "ingredients": [
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "14 fluid ounces vodka ADVERTISEMENT",
            "1 1/2 cups ice cubes, or as desired ADVERTISEMENT",
            "1/2 cup coconut milk ADVERTISEMENT",
            "7 teaspoons shredded coconut, or as desired (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine condensed milk, vodka, ice, and coconut milk in a blender; blend until smooth. Pour cocktail into glasses and sprinkle coconut over each.\n",
        "picture_link": "dhbJ8XdO2QCHsN7/60R5tjhYU3r.LGy"
    },
    {
        "title": "Florida Chicken Wellington",
        "ingredients": [
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves, thinly sliced ADVERTISEMENT",
            "2 teaspoons Creole seasoning ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "2 sheets frozen puff pastry, thawed ADVERTISEMENT",
            "4 slices cooked bacon, crumbled ADVERTISEMENT",
            "4 ounces Brie cheese, cut into 4 slices ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease a baking sheet.\nHeat olive oil in a skillet over medium heat. Season chicken breasts with Creole seasoning, salt, and pepper; cook until evenly browned, about 2 minutes per side. Transfer to a plate to cool.\nCut each puff pastry sheet in half. Place 1 sliced chicken breast on each half; top with 1/4 of the bacon and 1 Brie cheese slice. Fold top and bottom of pastry over chicken. Press pastry seams together with your fingers to seal; place seam-side down on prepared baking sheet.\nCook in the preheated oven until pastry is golden brown and chicken is no longer pink in the center, 15 to 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "giN3I25eNY4k.rk6hnxiHNpuMdtTyxa"
    },
    {
        "title": "Protein Power Eggs with Mushrooms and Kale",
        "ingredients": [
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "1 cup chopped kale leaves ADVERTISEMENT",
            "1/2 cup sliced mushrooms ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "1 tablespoon milk ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "1 stick low-fat string cheese, sliced on a bias into 1/8-inch pieces ADVERTISEMENT",
            "1 tablespoon Sriracha hot sauce ADVERTISEMENT",
            "1 sprig fresh parsley (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a skillet over medium heat; cook and stir kale, mushrooms, salt, and pepper until until mushrooms are tender, 5 to 10 minutes.\nWhisk eggs, egg whites, and milk together in a bowl until frothy.\nSpray a non-stick skillet with cooking spray and place over medium heat; cook and stir egg mixture until cooked through, about 5 minutes. Transfer eggs to a plate and top with string cheese and kale mixture. Garnish eggs with Sriracha and parsley.\n",
        "picture_link": "oTQ/mIhbli1EnvBLc/QKAGJRtk59JXK"
    },
    {
        "title": "Curried Potato and Spinach Soup",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/2 onion, finely chopped ADVERTISEMENT",
            "1 dried bay leaf ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "1 teaspoon curry powder ADVERTISEMENT",
            "1 teaspoon ground turmeric ADVERTISEMENT",
            "1/4 teaspoon ground coriander ADVERTISEMENT",
            "6 potatoes, peeled and cut into small cubes ADVERTISEMENT",
            "4 cups chicken broth ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "1 cup chopped canned tomatoes with juice ADVERTISEMENT",
            "2 teaspoons garlic and herb seasoning (such as Spike®) ADVERTISEMENT",
            "1 (10 ounce) package chopped frozen spinach ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large pot over medium heat. Add onion and bay leaf; cook and stir until onion is translucent, about 5 minutes. Add cumin, curry powder, turmeric, and coriander; cook, stirring frequently, until fragrant, 1 to 2 minutes. Stir potatoes, chicken broth, water, canned tomatoes, and seasoning into the pot; bring to a boil.\nReduce heat and simmer until potatoes are mostly cooked through, about 15 minutes. Add spinach; stir well to combine. Mash some of potatoes to thicken soup. Continue cooking until potatoes are soft, about 10 minutes more.\n",
        "picture_link": "mCWahl41dJqODDKseg32fJuBBpWjEym"
    },
    {
        "title": "Grilling Thick Steaks - The Reverse Sear ",
        "ingredients": [
            "1 (2 1/2 pound) 2-inch thick porterhouse steak, at room temperature ADVERTISEMENT",
            "sea salt to taste ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "hickory wood chips, soaked (optional) ADVERTISEMENT",
            "olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season steak generously with salt and black pepper on both sides.\nPlace wood chips in the smoker box of your gas grill according to manufacturer's instructions.\nPreheat one side of the grill to about 250 degrees F (121 degrees C).\nPlace steak on the cool side of the grill. Cook until an instant-read thermometer inserted into the center reads about 100 degrees F (37 degrees C), 25 to 30 minutes. Transfer steak to a plate. Brush with olive oil and cover with aluminum foil.\nIncrease heat on the grill to 600 degrees F (315 degrees C) by turning both burners up to maximum.\nCook steak until crust forms and an instant-read thermometer inserted into the center reads 125 degrees F (52 degrees C), about 3 minutes per side. Transfer steak back to plate. Cover with aluminum foil and let rest before serving, about 5 minutes.\n",
        "picture_link": "fYtwHvfCjcxKgppYX3./Xykce.qbA2m"
    },
    {
        "title": "Bolo Baeta (Brazilian Milk Cake)",
        "ingredients": [
            "4 cups all-purpose flour ADVERTISEMENT",
            "1 quart milk ADVERTISEMENT",
            "3 cups confectioners' sugar, or more to taste ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "1 lime, zested ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Grease and flour a 9-inch tube pan.\nBlend flour, milk, sugar, eggs, butter, lime zest, and salt together in a blender until smooth. Pour batter into prepared tube pan.\nBake in the preheated oven until cake is golden brown, about 30 minutes.\n",
        "picture_link": "ytXg4HY4Pq7xuJTMBD6LAkIlEfi6Ni."
    },
    {
        "title": "Layered Margarita Jell-O® Shots",
        "ingredients": [
            "2 1/2 cups boiling water, divided ADVERTISEMENT",
            "1 (3 ounce) package lime-flavored gelatin mix (such as Jell-O®), divided ADVERTISEMENT",
            "1 cup tequila, divided ADVERTISEMENT",
            "2 (0.3 ounce) packages sugar-free orange gelatin mix (such as Jell-O®) ADVERTISEMENT",
            "1/4 cup triple sec ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour 1 cup boiling water over half of the lime-flavored gelatin in a glass measuring cup; stir until dissolved. Stir in 1/2 cup tequila. Pour lime and tequila mixture 1/3 of the way up twelve 2-ounce cups.\nRefrigerate until set, about 4 hours.\nCombine 1/2 cup boiling water and orange gelatin mixes in glass measuring cup; stir until dissolved. Stir triple sec into orange gelatin mixture. Remove cups from the refrigerator. Pour an orange gelatin layer about half as tall as the lime layer into each cup.\nRefrigerate until set, about 4 hours.\nCombine 1 cup boiling water and remaining lime-flavored gelatin in glass measuring cup; stir until dissolved. Stir in remaining 1/2 cup tequila. Remove cups from the refrigerator. Pour a layer of lime and tequila mixture on top about the same size as the bottom layer.\nRefrigerate until set, about 4 hours.\n",
        "picture_link": "FmWTxRGhmO0geSQom.hKUvv4YMW39HW"
    },
    {
        "title": "French 75 Jell-O® Shots",
        "ingredients": [
            "1 cup boiling water ADVERTISEMENT",
            "1/2 (3 ounce) package lemon-flavored gelatin mix (such as Jell-O®) ADVERTISEMENT",
            "1/4 cup gin ADVERTISEMENT",
            "1 3/4 cups sparkling wine, divided ADVERTISEMENT",
            "3 (.25 ounce) envelopes unflavored gelatin ADVERTISEMENT",
            "1 drop red food coloring ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour boiling water over lemon-flavored gelatin in a glass measuring cup; stir to combine. Stir in gin. Pour mixture into sixteen 2-ounce cups. Arrange cups in muffin tins, tilted to one side.\nRefrigerate until set, about 4 hours.\nCombine 1 1/4 cup sparkling wine and unflavored gelatin in a small pot. Let sit, about 3 minutes. Heat over low heat, stirring constantly, until gelatin is dissolved, 3 to 5 minutes. Add remaining 1/2 cup wine and food coloring; stir to combine.\nRemove muffin tins from refrigerator. Set cups upright; pour wine mixture over lemon mixture.\nReturn to the refrigerator and chill until set, about 4 hours.\n",
        "picture_link": "mlGVzFeVv8tavL.VdnMBcJgNZhcdTmS"
    },
    {
        "title": "Easy \"No Measure\" S'mores Bars",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "3/4 cup butter, melted ADVERTISEMENT",
            "2 individual packages graham crackers, crushed ADVERTISEMENT",
            "1/2 (12 ounce) bag chocolate chips, or more to taste ADVERTISEMENT",
            "1/2 (12 ounce) package butterscotch chips ADVERTISEMENT",
            "1/2 (10.5 ounce) package miniature marshmallows ADVERTISEMENT",
            "1/2 (14 ounce) can sweetened condensed milk, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease an 8x8-inch square pan with cooking spray.\nMix melted butter and graham cracker crumbs together; press into an even layer at the bottom of the pan. Top with chocolate chips, butterscotch chips, and marshmallows. Drizzle sweetened condensed milk on top.\nBake in the preheated oven until bubbly, 17 to 20 minutes.\nLet cool, about 30 minutes. To make it easier to cut into bars, cover with plastic wrap and chill, about 30 minutes.\n",
        "picture_link": "snM.ssG1WVjAi3pytOihWXxRO9W56gi"
    },
    {
        "title": "Shami Kabab (Bun Kabab)",
        "ingredients": [
            "2 pounds ground beef ADVERTISEMENT",
            "1 tablespoon garlic paste ADVERTISEMENT",
            "1 tablespoon ginger paste ADVERTISEMENT",
            "1 teaspoon ground coriander, or more to taste ADVERTISEMENT",
            "1 teaspoon ground cumin, or more to taste ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "1/2 teaspoon garam masala ADVERTISEMENT",
            "1/2 teaspoon ground red chile pepper, or to taste ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/2 cup chana dal ADVERTISEMENT",
            "1/2 cup chopped cilantro ADVERTISEMENT",
            "Breading: ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 tablespoon chopped fresh cilantro ADVERTISEMENT",
            "1/2 teaspoon ground red chile pepper, or to taste ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1/4 cup bread crumbs, or as needed (optional) ADVERTISEMENT",
            "1/4 cup vegetable oil, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a stockpot over medium heat; add ground beef. Stir in garlic paste, ginger paste, coriander, cumin, turmeric, garam masala, 1/2 teaspoon ground red chile, and salt to taste. Add water and dal; simmer until meat is fully cooked and all water has evaporated, 30 to 35 minutes.\nBlend beef and dal mixture together using an immersion blender in the stockpot. Add 1/2 cup cilantro; blend to combine. Roll spoonfuls of beef and dal mixture into into walnut-sized balls; shape into smooth flat patties.\nWhisk eggs, 1 tablespoon cilantro, 1/2 teaspoon ground red chile, and salt to taste together in a bowl. Place bread crumbs on a plate. Dip each patty into egg mixture, then roll in bread crumbs.\nHeat oil in a skillet over medium heat. Fry patties in a single layer until golden brown and crisp, 2 to 4 minutes per side.\n",
        "picture_link": "0jRWZ/V9gftxUy7KmR7Hj4Y/4x6Z1Du"
    },
    {
        "title": "Dreamy Cashew Butter Smoothie with Banana, Berry, Dates, and Flax",
        "ingredients": [
            "1 ripe banana ADVERTISEMENT",
            "1/2 cup cold unsweetened almond milk ADVERTISEMENT",
            "1/3 cup frozen blueberries ADVERTISEMENT",
            "2 dates, pitted and chopped, or more taste ADVERTISEMENT",
            "1 1/2 tablespoons flax seeds ADVERTISEMENT",
            "1 tablespoon cashew butter, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend banana, almond milk, blueberries, dates, flax seeds, and cashew butter together in a blender on high speed until smooth.\n",
        "picture_link": "Ghme4kJmEdTGMBZXOw.hrYezwWQZRbS"
    },
    {
        "title": "Vegetable Tofu Soup with Lemongrass and Coconut Milk",
        "ingredients": [
            "5 tablespoons vegetable oil, divided ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 tablespoon finely chopped garlic ADVERTISEMENT",
            "1 tablespoon finely chopped ginger ADVERTISEMENT",
            "2 tablespoons curry powder ADVERTISEMENT",
            "3 cups vegetable stock ADVERTISEMENT",
            "1 (14 ounce) can coconut milk ADVERTISEMENT",
            "1 large yam, cut into chunks ADVERTISEMENT",
            "2 large carrots, cut into chunks ADVERTISEMENT",
            "2 ribs celery, chopped ADVERTISEMENT",
            "1/2 cup red lentils ADVERTISEMENT",
            "1/4 cup minced lemongrass ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 (12 ounce) package medium-firm tofu, cubed and patted dry ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 2 tablespoons oil in a large pot over medium heat. Add onion; cook and stir until lightly browned, about 7 minutes. Stir in garlic and ginger; cook until fragrant, about 2 minutes. Add curry powder; cook and stir until fragrant, about 1 minute.\nPour vegetable stock and coconut milk into the pot. Add yam, carrots, celery, lentils, lemongrass, and sugar. Increase heat to medium-high; bring to a boil. Reduce heat slightly; simmer until vegetables soften, 10 to 15 minutes. Season soup with salt.\nHeat remaining 3 tablespoons oil in a large nonstick skillet over medium heat. Add tofu in a single layer; cook until lightly browned, about 4 minutes per side. Stir tofu into soup.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Strawberry-Banana Fritters ",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/3 cup confectioners' sugar ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 bananas, chopped ADVERTISEMENT",
            "1/2 cup chopped strawberries ADVERTISEMENT",
            "1/4 cup vegetable oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sift flour, baking powder, cinnamon, and salt together in a bowl.\nWhisk eggs and confectioners' sugar together in a large bowl. Add milk, 1 teaspoon oil, and vanilla extract; mix well to combine. Add flour mixture; stir until just combined. Gently fold bananas and strawberries into batter.\nHeat 1/4 cup oil in a large nonstick skillet over medium heat. Scoop 1/4 cup batter at a time into the oil and fry fritters, in batches, until light golden brown, 2 to 3 minutes per side. Drain on paper towels.\n",
        "picture_link": "qwz1RBdLq4LsWJc1tFCGpb1UxQxpo.O"
    },
    {
        "title": "Steel Mill Chili",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 (15 ounce) can black beans ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "1 (15.25 ounce) can sweet corn ADVERTISEMENT",
            "1 (1.25 ounce) package chili seasoning mix ADVERTISEMENT",
            "1/8 teaspoon ground cumin, or to taste ADVERTISEMENT",
            "1/8 teaspoon chili powder, or to taste ADVERTISEMENT",
            "1 pinch salt to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium-high heat. Cook and stir beef and onion in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease.\nMix black beans, diced tomatoes, and sweet corn into beef mixture; add chili seasoning mix, cumin, chili powder, and salt and mix well. Bring liquid to a boil; reduce heat and simmer until chili is cooked through and flavors have combined, about 30 minutes.\n",
        "picture_link": "TDF6oKjH1j9ohrCkpF7/FSmJMLwxgme"
    },
    {
        "title": "Japanese Salted Chicken Wings",
        "ingredients": [
            "14 ounces chicken wings ADVERTISEMENT",
            "1 tablespoon sake (Japanese rice wine) ADVERTISEMENT",
            "1 tablespoon chopped garlic ADVERTISEMENT",
            "1 1/2 teaspoons sesame oil ADVERTISEMENT",
            "1 teaspoon chopped fresh ginger root ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon dashi (Japanese seasoning) ADVERTISEMENT",
            "2 cups vegetable oil for frying ADVERTISEMENT",
            "3 tablespoons cornstarch ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine chicken wings, sake, garlic, sesame oil, ginger, dashi, and 1/2 teaspoon salt in a large bowl. Cover with plastic wrap and place in the refrigerator to marinate, at least 1 hour.\nHeat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).\nPlace cornstarch in a shallow bowl. Dip marinated chicken wings in cornstarch and coat both sides.\nFry chicken wings until crispy brown and crunchy on the outside and no longer pink at the bone, 10 to 15 minutes per batch. Drain on paper towels and sprinkle with salt and black pepper before serving.\n",
        "picture_link": "r/oikLHL7ZwcZvLg7yxQE6DTI1T3wV6"
    },
    {
        "title": "Reverse Sear Skillet-Grilled Steak Done Right!",
        "ingredients": [
            "1 (12 ounce) 1 1/2-inch thick rib eye steak, thawed ADVERTISEMENT",
            "1/4 cup unsalted butter, melted ADVERTISEMENT",
            "2 tablespoons steak sauce (such as A1®) ADVERTISEMENT",
            "1 tablespoon grated garlic ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place steak, butter, steak sauce, garlic, salt, and black pepper in a large resealable plastic bag; shake until marinade is well-mixed. Seal the plastic bag most of the way but keep one small corner open on one end.\nFill a deep baking pan with warm water. Submerge plastic bag in the water slowly, allowing the pressure of the water to push all the air out and mold the bag around the steak. Seal the bag completely and let sit in the water, about 2 hours.\nPreheat oven to 235 degrees F (112 degrees C).\nPour water out of the baking pan. Line pan with aluminum foil. Remove steak from the bag and place it on the pan. Pour marinade around steak. Gather sides of the aluminum foil into a tight ball around the steak.\nBake in the preheated oven until an instant-read thermometer inserted into the center reads 130 degrees F (54 degrees C) for medium, about 20 minutes.\nRemove steak from oven. Uncover and season both sides generously with salt and black pepper. Allow steak to rest.\nPreheat an outdoor grill for high heat. Place a cast iron skillet on the grill and heat to 500 degrees F (260 degrees C).\nCook steak in the hot skillet until it forms a crust and an instant-read thermometer inserted into the center reads 140 degrees F (60 degrees C) for medium, about 1 minute per side.\n",
        "picture_link": "ADk.fOT4a3pMjV1GaxlP4ItqnPvzke6"
    },
    {
        "title": "Granny's Remoulade Sauce",
        "ingredients": [
            "1 cup mayonnaise ADVERTISEMENT",
            "3 hard-cooked eggs, chopped ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "2 tablespoons ketchup ADVERTISEMENT",
            "2 tablespoons minced green onion ADVERTISEMENT",
            "1 tablespoon tarragon vinegar ADVERTISEMENT",
            "1 tablespoon minced fresh parsley ADVERTISEMENT",
            "2 teaspoons minced capers ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 teaspoon horseradish ADVERTISEMENT",
            "1 teaspoon mustard ADVERTISEMENT",
            "1/4 teaspoon minced fresh savory ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine mayonnaise, hard-cooked eggs, lemon juice, ketchup, green onion, tarragon vinegar, parsley, capers, garlic, horseradish, mustard, and savory in a bowl; mix until well-blended. Cover with plastic wrap and chill for flavors to combine, at least 1 hour or overnight.\n",
        "picture_link": "p7lUZwA8kN6i4tC7fuW/gUnyKROYlPi"
    },
    {
        "title": "Indian Onion Dipping Sauce",
        "ingredients": [
            "1 onion, chopped, or more to taste ADVERTISEMENT",
            "1 1/2 tablespoons lemon juice ADVERTISEMENT",
            "1 teaspoon ketchup, or more to taste (optional) ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "1/2 teaspoon Hungarian paprika ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 pinch white sugar (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place onion in a food processor and pulse until onion is minced. Add lemon juice, ketchup, cayenne pepper, paprika, salt, and sugar and pulse until evenly combined. Transfer sauce to an airtight container and refrigerate until flavors combine, 2 to 3 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Black Chana with Potato",
        "ingredients": [
            "1 cup dried black chickpeas (garbanzo beans) ADVERTISEMENT",
            "1 1/2 teaspoons salt, divided ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 quart water ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 clove garlic, chopped, or more to taste ADVERTISEMENT",
            "1 (1 inch) piece chopped fresh ginger ADVERTISEMENT",
            "3 tablespoons water ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "1/4 teaspoon cumin seeds ADVERTISEMENT",
            "2 pinches asafoetida powder ADVERTISEMENT",
            "4 potatoes, peeled and quartered ADVERTISEMENT",
            "1 teaspoon ground coriander ADVERTISEMENT",
            "1 teaspoon garam masala ADVERTISEMENT",
            "1/4 teaspoon ground turmeric ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "3 tablespoons tamarind paste, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sort and clean chickpeas and wash them under cold water; drain. Combine chickpeas, 1/2 teaspoon salt, and baking soda in a large bowl; add 1 quart water. Soak chickpeas for 24 hours; drain.\nCombine onion, garlic, and ginger in a blender; add 3 tablespoons water. Blend mixture at high speed until a smooth paste forms.\nHeat vegetable oil in a 4-quart pot over medium-high heat. Add cumin seeds and asafoetida; cook and stir until asafoetida expands and cumin seeds darken, about 1 minute. Stir onion paste into cumin mixture, taking great care to avoid splattering. Cook and stir mixture until well mixed and fragrant, about 5 minutes.\nStir chickpeas, potatoes, 1 teaspoon salt, coriander, garam masala, turmeric, and cayenne pepper into onion-cumin mixture; add 2 cups water. Bring liquid to a boil and cover pot; reduce heat and gently simmer for 1 hour. Stir tamarind paste into chickpea mixture; cook, stirring occasionally, for 10 minutes more.\n",
        "picture_link": "0YqV.Cx3KGyVUnl1mFPSVfliEgRwyv."
    },
    {
        "title": "Aaku Pappu (Dal with Greens)",
        "ingredients": [
            "1 cup hulled, split pigeon peas (toor dal) ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "salt, to taste ADVERTISEMENT",
            "1 (8 ounce) bunch amaranth greens, chopped ADVERTISEMENT",
            "2 teaspoons cooking oil ADVERTISEMENT",
            "1 teaspoon skinned split black lentils (urad dal) ADVERTISEMENT",
            "1 teaspoon mustard seed ADVERTISEMENT",
            "1 teaspoon cumin seed ADVERTISEMENT",
            "4 dried red chile peppers ADVERTISEMENT",
            "1 pinch asafoetida powder ADVERTISEMENT",
            "2 green chile peppers, cut into large chunks ADVERTISEMENT",
            "1 sprig fresh curry leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook the pigeon peas with 2 cups water in a pressure cooker until the water is absorbed and the peas are tender, about 5 minutes.\nBring 2 cups of water to a boil with the turmeric and salt; add the amaranth greens and cook until tender, about 5 minutes; drain. Stir the cooked peas into the greens; set aside.\nHeat the oil in a small skillet; cook the lentils, mustard seed, cumin seed, and red chile peppers in the oil until the seeds begin to splutter. Add the green chile peppers, curry leaves, and asafoetida powder and continue cooking another 30 seconds; immediately stir into the peas and greens.\n",
        "picture_link": "Xl8mYWkNXrEtnPS0RVR1JDSXXEWroYW"
    },
    {
        "title": "Menthi Majjiga (Buttermilk with Fenugreek)",
        "ingredients": [
            "2 cups buttermilk ADVERTISEMENT",
            "1/4 teaspoon ground turmeric ADVERTISEMENT",
            "salt, to taste ADVERTISEMENT",
            "1 sprig fresh curry leaves ADVERTISEMENT",
            "2 green chile peppers, sliced into thin rings ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "2 dried red chile peppers ADVERTISEMENT",
            "1/4 teaspoon fenugreek seeds ADVERTISEMENT",
            "1/2 teaspoon mustard seeds ADVERTISEMENT",
            "1/2 teaspoon cumin seeds ADVERTISEMENT",
            "1 pinch asafoetida powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir the buttermilk, turmeric, and salt together in a bowl. Add the curry leaves and green chiles, but do not stir into the mixture.\nHeat the vegetable oil in a small skillet; add the chile peppers, fenugreek seeds, mustard seeds, cumin seeds, and asafoetida powder to the oil. Fry the mixture until the seeds splutter. Pour the mixture over the curry leaves and green chiles. This will quickly fry them and release a nice aroma. Serve cold or at room temperature.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Nimakayya Poori Koora",
        "ingredients": [
            "3 potatoes ADVERTISEMENT",
            "2 tablespoons cooking oil ADVERTISEMENT",
            "2 dried red chile peppers, broken into pieces ADVERTISEMENT",
            "1 teaspoon skinned split black lentils (urad dal) ADVERTISEMENT",
            "1 teaspoon cumin seeds ADVERTISEMENT",
            "1 teaspoon mustard seeds ADVERTISEMENT",
            "3 green chile peppers, chopped ADVERTISEMENT",
            "1 sprig fresh curry leaves ADVERTISEMENT",
            "1 tablespoon minced fresh ginger root ADVERTISEMENT",
            "1/4 teaspoon asafoetida powder ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 teaspoon ground red pepper ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 tablespoon chickpea flour (besan) ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "1/4 cup fresh lime juice, or to taste ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the potatoes into a large pot and cover with salted water. Bring to a boil; reduce heat to medium-low, cover, and simmer until tender, about 20 minutes. Drain and allow to steam dry for a minute or two. Remove and discard the skins; mash the flesh of the potatoes into coarse chunks.\nHeat the oil in a large skillet over medium heat. Fry the red chile peppers, urad dal, cumin seeds, and mustard seeds in the hot oil until the seeds begin to splutter; add the green chile peppers, curry leaves, ginger, and asafoetida powder and fry together for 1 minutes. Stir the potatoes, turmeric, and 1 cup water into the mixture; season with salt and ground red pepper.\nMix the chickpea flour and 1 tablespoon water together in a small bowl to make a paste; stir into the potato mixture and cook until it thickens, 2 to 3 minutes. Pour the lime juice over the dish and garnish with cilantro to serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sweet Potato Cooked in Ginger Syrup",
        "ingredients": [
            "1 pound sweet potatoes, peeled and cut into chunks ADVERTISEMENT",
            "1 quart water ADVERTISEMENT",
            "1 (1/2 inch) piece ginger, peeled and sliced ADVERTISEMENT",
            "1 cup palm sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the sweet potatoes with the water in a pot and soak for 30 minutes.\nRemove the potatoes from the water. Bring the water to a boil and return the potatoes to the boiling water with the ginger slices. Cook the potatoes at a boil until fork-tender, 20 to 25 minutes. Stir the sugar into the water until completely dissolved. Remove the sweet potatoes to individual bowls and spoon the ginger syrup over the potatoes to serve.\n",
        "picture_link": "EyDJ3qkUbxbbHu1hVS1muR02An7APlm"
    },
    {
        "title": "Easy Holiday Ribbon Bowl",
        "ingredients": [
            "2 1/4 cups boiling water, divided ADVERTISEMENT",
            "1 (3 ounce) package JELL-O Lime Flavor Gelatin ADVERTISEMENT",
            "1 cup ice cubes ADVERTISEMENT",
            "1 (3 ounce) package JELL-O Strawberry Flavor Gelatin ADVERTISEMENT",
            "1 (8 ounce) tub COOL WHIP Whipped Topping (Do not thaw), divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Add 3/4 cup boiling water to lime gelatin mix in medium bowl; stir at least 2 min. until completely dissolved. Add ice; stir until gelatin is slightly thickened. Remove any unmelted ice. Pour into 1- to 1-1/2-qt. serving bowl. Refrigerate 15 min. or until set.\nStir remaining boiling water into strawberry gelatin mix in large bowl at least 2 min. until completely dissolved. Add 2/3 of COOL WHIP; stir with whisk until COOL WHIP is melted and mixture is well blended. Refrigerate remaining COOL WHIP for later use. Carefully spoon strawberry gelatin mixture over lime layer.\nRefrigerate 2 hours or until set. Top with remaining COOL WHIP just before serving.\n",
        "picture_link": "u3W9U2qb0NRusG8PHEGkDk1QRRKrSRq"
    },
    {
        "title": "Shahi Tukra (Sweet Bread Dessert)",
        "ingredients": [
            "1 quart vegetable oil ADVERTISEMENT",
            "15 slices white bread, cut into 2-inch squares ADVERTISEMENT",
            "4 cups whole milk ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "4 cardamom pods ADVERTISEMENT",
            "4 whole cloves ADVERTISEMENT",
            "2 cinnamon sticks ADVERTISEMENT",
            "1 pinch saffron ADVERTISEMENT",
            "1/2 cup toasted sliced almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).\nFry the bread squares in the oil until crispy and brown; remove to a plate lined with paper towels to drain.\nStir the milk and sugar together in a saucepan; bring to a boil and reduce heat to medium-low. Add the cardamom pods, cloves, cinnamon sticks, and saffron; simmer together for 15 minutes. Remove and discard the whole spices. Set the mixture aside to cool to room temperature.\nArrange the bread in a flat-bottomed serving dish. Gently pour the milk mixture over the bread until all pieces are covered. Chill in refrigerator 2 to 3 hours. Garnish with the almonds to serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Steamed Pandan Tapioca Pearl Cakes",
        "ingredients": [
            "1 (8 ounce) package grated coconut ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "5 pandan leaves, chopped ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "1 (6.5 ounce) package small tapioca pearls ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "3 tablespoons tapioca flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss the coconut and salt together in a small bowl; set aside.\nBlend the pandan leaves with 3/4 cup water in a blender or food processor until smooth; strain through a piece of cheesecloth. You should get about 1/2 cup pandan juice.\nBring 3 cups water and the tapioca pearls to a boil in a sauce pan; cook at a boil until the pearls are translucent and soft, about 10 minutes. Stir the sugar and tapioca flour into the mixture until the sugar is completely dissolved; add the pandan juice and stir until you have a thick batter. Remove from heat and pour into foil cups.\nBring a couple inches of water to boil in a large pot. Place a few of the cups at a time in a steamer insert and place over the boiling water. Steam until the cakes are cooked through, 10 to 15 minutes. Top the cakes with the coconut to serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Eastern Shore Soft Crabs",
        "ingredients": [
            "4 soft shell blue crabs ADVERTISEMENT",
            "4 slices center-cut bacon ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 cup pancake mix ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Wrap each crab with a slice of bacon, then dip it into the eggs followed by the pancake mix.\nHeat the oil in a large skillet over medium-high heat. Place the bacon-wrapped crab into the skillet, and cook, turning occasionally, until evenly browned, 5 to 7 minutes on each side.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Fresh Sangrita",
        "ingredients": [
            "1/4 cup fresh lime juice ADVERTISEMENT",
            "1 paper-thin onion slice ADVERTISEMENT",
            "1 cup fresh orange juice ADVERTISEMENT",
            "1 dash Mexican-style hot sauce (such as Valentina® or Cholula®), or to taste ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the lime juice and onion slice in a bowl, making sure the onion is completely covered with the juice. Allow to soak 2 to 3 hours; remove the onion and discard.\nStir the orange juice, hot sauce, and salt into the lime juice; chill the sangrita before serving.\n",
        "picture_link": "tWy9pZqH9TpdKk4Lc.2jnz7mKmtOeOa"
    },
    {
        "title": "Bitter Melon and Brinjal (Eggplant) Relish",
        "ingredients": [
            "1 bitter melon, seeded and cut into matchsticks ADVERTISEMENT",
            "1 eggplant, cut into matchsticks ADVERTISEMENT",
            "1 carrot, cut into matchsticks ADVERTISEMENT",
            "4 cloves garlic, sliced thin ADVERTISEMENT",
            "2 green chile peppers, seeded and sliced thin ADVERTISEMENT",
            "1 small sweet onion, diced ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/2 cup distilled white vinegar ADVERTISEMENT",
            "2 (2 inch) pieces minced fresh ginger root ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a pot of water to a boil. Add the bitter melon and eggplant to the boiling water and return to a boil; cook at a boil for 2 minutes. Drain. Rinse with cold water to stop from cooking further.\nToss the bitter melon, eggplant, carrot, garlic, green chile peppers, and sweet onion in a large bowl; cover with plastic wrap and set aside.\nStir the water, vinegar, ginger, sugar, and salt together in a pot; bring to a boil until the sugar has dissolved completely. Set aside to cool completely. Pour the cooled vinegar mixture over the vegetables in the bowl, assuring the vegetables are completely submerged. Cover and refrigerate. Serve cold.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Spicy Crab Curry - Bangla Style",
        "ingredients": [
            "2 fresh Dungeness crabs, cleaned and with their shells cracked ADVERTISEMENT",
            "2 teaspoons ground turmeric ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 tablespoon mustard seed ADVERTISEMENT",
            "1 tablespoon hot water ADVERTISEMENT",
            "1 tablespoon mustard oil ADVERTISEMENT",
            "3 cups sliced red onion ADVERTISEMENT",
            "1 3/4 cups boiling potatoes, peeled, halved lengthwise, and cut crosswise into 1/4-inch slices ADVERTISEMENT",
            "2 whole cloves ADVERTISEMENT",
            "1 (1 inch) piece cinnamon stick ADVERTISEMENT",
            "2 pods green cardamom pods ADVERTISEMENT",
            "5 whole black peppercorns ADVERTISEMENT",
            "2 large tomatoes, coarsely chopped ADVERTISEMENT",
            "4 Thai green chiles ADVERTISEMENT",
            "1 1/2 teaspoons garlic paste ADVERTISEMENT",
            "1 1/2 teaspoons ginger paste ADVERTISEMENT",
            "1 teaspoon cayenne pepper ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "Garnish: ADVERTISEMENT",
            "1 wedge fresh lemon ADVERTISEMENT",
            "1/2 cup chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rub the crabs with 1 teaspoon of the turmeric and 1/2 teaspoon salt; let them marinate for 1 hour. Combine the mustard seed and hot water in a small bowl and let stand for 10 minutes. Use a mortar and pestle to grind the seeds into a coarse paste.\nHeat the oil in a wok or kadhai over medium heat. Add the crabs and stir fry until they change color, about 4 minutes. Remove the crabs from the oil and set aside.\nAdd the sliced onions to the wok and cook and stir over medium heat until the onions are translucent, about 5 minutes. Raise the heat to high, add the potatoes, and cook, stirring constantly, for about 2 minutes. Add the cloves, cinnamon stick, cardamom pods, and peppercorns, and stir for thirty seconds.\nStir in the tomatoes, ginger paste, and garlic paste. Halve three of the chiles and add them to the wok. Cook and stir for an additional minute or two over high heat. Reduce the heat to medium; add the remaining 1 teaspoon turmeric, the cayenne pepper, and the mustard paste and stir to combine. Add the crabs to the wok and pour in just enough water to cover the vegetables. Bring the water to a boil and stir in the sugar and salt to taste.\nCover the wok, reduce the heat, and simmer until the potatoes are tender and the water is reduced by half, about 10 minutes. Remove the lid, stir, and simmer until the gravy is thickened, about 5 minutes more.\nSqueeze the lemon wedge over the finished dish. Garnish with chopped cilantro and sliced green chile and serve hot, with rice.\n",
        "picture_link": ".pzT9x2u0TNfWMzCIFy6nj5AdElWLIm"
    },
    {
        "title": "Tofu Fruit Julius",
        "ingredients": [
            "1 (12 ounce) package silken tofu, cut into cubes, or to taste ADVERTISEMENT",
            "2 cups fresh strawberries ADVERTISEMENT",
            "2 cups soy milk ADVERTISEMENT",
            "4 cups crushed ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Layer tofu, strawberries, and soy milk in a blender; blend. Add ice cubes, 1 cup at a time, while blender is running; blend until smooth.\n",
        "picture_link": "C5W/UF7u6OdJDPk4ub9XLEAvqCSCvnK"
    },
    {
        "title": "Latik (Fried Coconut Milk Curd)",
        "ingredients": [
            "2 cups freshly grated mature coconut ADVERTISEMENT",
            "2 cups warm water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the grated coconut with the warm water in a large bowl. Scoop the coconut into a sheet of cheesecloth and squeeze over the bowl to express as much coconut juice as possible; repeat a few times until you feel you've gotten as much as you can from the coconut; strain into a non-stick skillet. Discard the coconut.\nBring the liquid to a boil and cook until the mixture is dry, about 20 minutes; it will curdle as it dries, leaving coconut oil and the solids, which are called 'latik.'\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sweet Corn Pudding",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "2 ears fresh corn, kernels cut off ADVERTISEMENT",
            "1/4 cup tapioca flour ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "1 cup superfine sugar ADVERTISEMENT",
            "1 cup unsweetened coconut cream ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring 2 cups water to a boil in a small saucepan; cook the corn kernels in the boiling water until tender. Stir the sugar into the mixture.\nWhisk the tapioca flour with 1/3 cup water in a bowl until you have a thick slurry; stir the slurry into the corn mixture and cook until the mixture thickens. Remove from heat. Divide into 4 separate bowls.\nCombine the coconut cream and salt in a separate small saucepan and heat over medium-low heat to a simmer, being careful to not bring to a boil, until thoroughly heated; drizzle over the pudding to serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Yam Taeng (Spicy Cucumber Salad)",
        "ingredients": [
            "3 cucumbers - peeled, seeded, and grated ADVERTISEMENT",
            "3 tablespoons crushed dried shrimp ADVERTISEMENT",
            "2/3 pound long beans, sliced thin and mashed ADVERTISEMENT",
            "5 cherry tomatoes, halved ADVERTISEMENT",
            "5 Thai chilies, sliced thin ADVERTISEMENT",
            "1 tablespoon palm sugar ADVERTISEMENT",
            "2 tablespoons fish sauce ADVERTISEMENT",
            "juice of 1 lime, or more to taste ADVERTISEMENT",
            "3 tablespoons roasted peanuts, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss the cucumbers, dried shrimp, beans, and tomatoes together in a bowl.\nStir the Thai chilies, palm sugar, fish sauce, and lime juice together in a small bowl; pour over the cucumber mixture. Toss to combine. Adjust seasoning to your taste. Sprinkle chopped peanuts over the mixture to serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Shakkara (Sweet) Pongal",
        "ingredients": [
            "1/2 cup ghee (clarified butter) ADVERTISEMENT",
            "1/4 cup cashews ADVERTISEMENT",
            "1/4 cup raisins ADVERTISEMENT",
            "1/2 cup split yellow lentils (moong dal) ADVERTISEMENT",
            "1 cup basmati rice ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "1 cup jaggery (palm sugar) ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon ground cardamom ADVERTISEMENT",
            "1 pinch edible camphor (kacha karpoor) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the ghee in a large skillet over medium heat; fry the cashews and raisins in the melted ghee until the cashews are brown and the raisins begin to plump, about 5 minutes. Remove the cashews and raisins from the skillet and set aside. Add the lentils to the skillet and fry in the ghee until fragrant; stir the rice, milk, jaggery, and sugar into the lentils. Reduce heat to low and cook until the rice is tender, adding water as needed to keep moist, about 30 minutes. Mix the cashews, raisins, cardamom, and edible camphor into the mixture to serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Kobbari Louz",
        "ingredients": [
            "2 cups grated fresh coconut ADVERTISEMENT",
            "1 cup grated jaggery (palm sugar) ADVERTISEMENT",
            "1/4 cup milk powder ADVERTISEMENT",
            "1/2 teaspoon ground cardamom ADVERTISEMENT",
            "2 teaspoons ghee (clarified butter) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the coconut and jaggery together in a heavy-bottomed skillet over low heat, stirring frequently, until most of the moisture evaporates and the coconut and jaggery begin to bind together, about 10 minutes. Sprinkle the milk powder over the mixture and stir. The milk powder helps absorb moisture and bind the mixture. Coconuts vary in their water content. If the mixture is still too loose, add a bit more milk powder. Add cardamom powder and mix.\nGrease a rimmed plate (or a thali if you have one) with the ghee. Spread the coconut mixture evenly and press and flatten with your hands. Cool completely. Cut into desired shape and serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Ullipaya (Onion) Tomato Chutney",
        "ingredients": [
            "1 tablespoon cooking oil ADVERTISEMENT",
            "1 teaspoon skinned split black lentils (urad dal) ADVERTISEMENT",
            "1 teaspoon mustard seed ADVERTISEMENT",
            "4 dried red chile peppers ADVERTISEMENT",
            "2 green chile peppers, chopped ADVERTISEMENT",
            "1 pinch asafoetida powder ADVERTISEMENT",
            "1 tablespoon cooking oil ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "2 tomatoes, chopped ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1/4 cup chopped cilantro leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a small skillet over medium heat; cook the lentils, mustard seed, and red chile peppers in the hot oil until the seeds start to burst. Remove from heat and add the green chile peppers and asafoetida powder; stir. Allow to cool slightly; grind the mixture to a coarse powder using a mortar and pestle.\nReturn the skillet to the heat with 1 tablespoon oil; cook the onion in the hot oil until softened, about 5 minutes. Stir the tomatoes into the onion and continue cooking until most of the liquid has evaporated, about 3 minutes. Add the mixture to the lentil mixture; grind until the onions are completely crushed into the mixture. Season with salt; fold the cilantro leaves into the chutney to serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Poppy Seed Almond Slices",
        "ingredients": [
            "1 cup margarine ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups blanched almonds, finely chopped ADVERTISEMENT",
            "1/2 cup poppy seeds ADVERTISEMENT",
            "1/2 cup white sugar for rolling ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat the margarine, brown sugar, and 1/2 cup white sugar with an electric mixer in a large bowl until smooth. Beat in the egg and vanilla extract. Mix in the flour 1/2 cup at a time, then stir in salt until just incorporated. Fold in the almonds and poppy seeds; mixing just enough to evenly combine. Divide the dough in half. Roll each into a 12 inch log and wrap with waxed paper. Refrigerate for 3 hours.\nPreheat an oven to 325 degrees F (165 degrees C). Coat logs in the remaining 1/2 cup of sugar. Cut the logs into 1/2 inch slices and place on a baking sheet.\nBake in the preheated oven until the cookies begin to brown, 15 to 20 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Egg and Coconut Custard Jellies",
        "ingredients": [
            "2 eggs ADVERTISEMENT",
            "1/4 cup palm sugar ADVERTISEMENT",
            "1 1/2 cups unsweetened coconut cream ADVERTISEMENT",
            "3 pandan leaves, cut into 1-inch pieces ADVERTISEMENT",
            "1 tablespoon agar-agar powder ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To make the custard, beat the eggs with the palm sugar, coconut cream, and pandan leaves in a bowl so the pandan aroma is imparted to the eggs. Strain the mixture and set aside.\nCombine the agar-agar powder and water in a small saucepan over medium heat; cook and stir until the powder is completely dissolved. Whisk the sugar into the mixture until dissolved, but do not bring to a boil. Stir the custard into the mixture allow to cook for about 2 minutes. Pour the mixture into 1-cup molds. Store in refrigerator to allow to set, about 2 hours. Remove the jellies from the molds to serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Vinegar Pie VIII",
        "ingredients": [
            "1 (9 inch) pie shell ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 tablespoon lemon zest ADVERTISEMENT",
            "1/2 cup cider vinegar ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nIn a large saucepan, combine sugar, flour, and lemon rind. Mix well, then whisk in vinegar and water. Cook mixture over medium heat, stirring constantly, until it comes to a boil. Continue to boil and stir for 1 minute. Remove from heat.\nPlace eggs in a medium bowl. Slowly whisk 1/2 cup of sugar mixture into eggs. Whisk egg mixture back into remaining sugar mixture. Stir in butter or margarine. Pour mixture into pastry shell.\nBake in preheated oven for 10 minutes. Reduce heat and bake 30 minutes more. Filling will still be liquidy but will firm as pie cools. Cool completely before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Piereth Pie II",
        "ingredients": [
            "2 (1 ounce) squares unsweetened chocolate ADVERTISEMENT",
            "1 (9 inch) pie shell, baked ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/2 cup slivered almonds ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 (3.4 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "1/2 cup grated semisweet chocolate ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a microwave-safe bowl, microwave chocolate until melted. Stir occasionally until chocolate is smooth.\nIn a large bowl, cream together the butter and sugar until light and fluffy. Stir in nuts and melted chocolate. Add the eggs one at a time, beating well with each addition. Pour mixture into baked pastry shell and place in refrigerator.\nPrepare pudding according to package directions. Pour over chocolate layer and return to refrigerator. Chill at least 2 hours. Before serving, spread whipped topping over pudding layer and sprinkle with grated chocolate.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Forty Garlic Chicken",
        "ingredients": [
            "1 (2 to 3 pound) whole chicken ADVERTISEMENT",
            "3 1/2 cups sweet vermouth ADVERTISEMENT",
            "3 medium heads unpeeled garlic ADVERTISEMENT",
            "1 bunch fresh parsley, chopped ADVERTISEMENT",
            "1 1/4 cups chicken stock ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of salted water to a boil. Put in chicken, boil until meat falls away at the bone. Pull out as many bones and as much skin as you like.\nStir in the vermouth, garlic cloves (don't peel - you will use them for the bread), parsley and chicken stock. Reduce heat to low and let simmer and reduce for about 2 hours. Serve hot with slices of bread. Take the soft garlic and spread on fresh bread as 'garlic butter'. Yum!\n",
        "picture_link": "fEWI2V7srTY.5gl.0qTJ6QdkpX5h4Xa"
    },
    {
        "title": "Nesselrode Pie II",
        "ingredients": [
            "1 (9 inch) prepared graham cracker crust ADVERTISEMENT",
            "1 (.25 ounce) package unflavored gelatin ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "4 egg yolks, beaten ADVERTISEMENT",
            "1 1/4 cups milk ADVERTISEMENT",
            "1 tablespoon rum ADVERTISEMENT",
            "1 teaspoon lemon zest ADVERTISEMENT",
            "4 egg whites ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "4 ounces mixed candied fruit, diced ADVERTISEMENT",
            "1 (1.3 ounce) envelope whipped topping mix ADVERTISEMENT",
            "1/2 cup red and green candied pineapple chunks, slivered ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a 1 quart saucepan, stir gelatin with salt and 3 tablespoons sugar until well mixed. In a separate bowl, beat egg yolks with milk until thoroughly combined. Stir egg yolk mixture into gelatin mixture.\nCook mixture over medium-low heat, stirring constantly, until thick enough to coat the back of a spoon. Remove from heat and stir in rum and grated lemon rind. Refrigerate until cold but not firm, about 40 minutes.\nIn a large glass or metal bowl, beat egg whites until soft peaks form. Gradually sprinkle in 1/4 cup sugar, continuing to beat until whites form stiff peaks.\nRemove gelatin mixture from refrigerator and gently fold into beaten whites along with the mixed diced candied fruit. Spread mixture into graham cracker crust. Refrigerate 1 hour or until set. Prepare whipped topping mix as directed on the package. Before serving, cover pie with whipped topping and sprinkle with candied pineapple.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cookies with Chocbit Topping",
        "ingredients": [
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "7 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "7 tablespoons butter ADVERTISEMENT",
            "4 teaspoons golden syrup ADVERTISEMENT",
            "2 tablespoons chopped peanuts ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "1 (1 ounce) square semisweet chocolate, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine flour, sugar, baking powder, salt, butter, syrup, and milk in a bowl until smooth. Stir in nuts. Chill dough in refrigerator for 1/2 hour.\nPrepare 1 inch round biscuits. Paste 3 chocbits on each biscuit.\nBake at 325 degrees F (165 degrees C) for 12 to 15 minutes, or until golden.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "White Cookie Cake",
        "ingredients": [
            "1 cup margarine ADVERTISEMENT",
            "1 2/3 cups white sugar ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "1 (12 ounce) package vanilla wafers, crushed ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "1/4 cup applesauce ADVERTISEMENT",
            "1 3/4 cups flaked coconut ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 275 degrees F (135 degrees C). Grease and flour a 10 inch tube pan.\nIn a large bowl cream the margarine and sugar. Beat in eggs one at a time. Mix in the crushed cookies, and coconut alternately with the milk. Stir in the applesauce.\nPour batter into prepared pan. Bake in preheated oven for 1 hour, or until the top springs back when lightly touched.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Christmas Wreath Cake",
        "ingredients": [
            "1 1/2 cups raisins ADVERTISEMENT",
            "1 cup red and green candied cherries ADVERTISEMENT",
            "3/4 cup dates, pitted and chopped ADVERTISEMENT",
            "3/4 cup finely diced candied pineapple ADVERTISEMENT",
            "3/4 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup flaked coconut ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "1 teaspoon lemon zest ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C). Line a tube pan with 2 layers of brown paper, and grease well.\nIn a large bowl, whisk together flour, baking powder, and salt. Mix in raisins, dates, cherries, pineapple, nuts, and coconut. Stir until all fruit is coated.\nIn another large bowl, cream the butter or margarine with the white sugar. Add lemon rind, lemon juice, and eggs; mix well. Stir in fruit mixture. Spread batter into prepared pan.\nBake for 2 hours. Cool.\n",
        "picture_link": "H6nc/cpIdlMcvmPCKO1PdvupIL4SeoS"
    },
    {
        "title": "Sherry Chiffon Pie",
        "ingredients": [
            "1 (9 inch) prepared chocolate cookie crumb crust ADVERTISEMENT",
            "1 (.25 ounce) package unflavored gelatin ADVERTISEMENT",
            "1/4 cup cold water ADVERTISEMENT",
            "2 cups scalded milk ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "2 eggs, separated ADVERTISEMENT",
            "1/2 teaspoon almond extract ADVERTISEMENT",
            "2 tablespoons sherry ADVERTISEMENT",
            "1/4 cup chopped almonds ADVERTISEMENT",
            "4 teaspoons white sugar ADVERTISEMENT",
            "1/2 cup chopped almonds (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Soften gelatin in cold water for 5 minutes.\nIn a double boiler pan combine milk, salt, and 1/4 cup sugar. Stir until dissolved. Whisk in egg yolks and cook in double boiler until thickened, stirring constantly. Stir gelatin into custard mixture until thoroughly dissolved. Cool mixture.\nStir almond extract, sherry, and 1/4 cup almonds into custard.\nIn a medium mixing bowl whip egg whites until frothy. Add 4 teaspoons of sugar, one at a time, whipping constantly until whites form soft peaks. Fold egg whites into custard.\nPour custard mixture into pie shell. Sprinkle with chopped almonds. Serve chilled.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Fruit Bread I",
        "ingredients": [
            "3 eggs ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup grated carrots ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup flaked coconut ADVERTISEMENT",
            "1/2 cup candied cherries, chopped ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease one 9x5x3 inch loaf pan.\nIn a large bowl beat eggs until frothy. Add sugar and oil. Beat to blend. Stir in milk, vanilla, and carrot.\nIn another bowl, combine flour, baking powder, soda, cinnamon, salt, coconut, cherries, raisins, and walnuts. Mix well to combine evenly. Pour all at once over batter. Stir to moisten. Turn into greased 9x5x3 inch loaf pan.\nBake at 350 degrees F (175 degrees C) for 1 hour until it tests done. Cool 10 minutes. Remove from pan. Cool and wrap.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Mock Pecan Pie II",
        "ingredients": [
            "1 (9 inch) unbaked pie crust ADVERTISEMENT",
            "1/4 cup unsalted butter ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1 pinch ground cloves ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 cup dark corn syrup ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 1/4 cups wheat and barley flake cereal ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium mixing bowl, cream together butter or margarine and brown sugar. Mix in cinnamon, cloves, and salt. Add corn syrup and blend until smooth. Add eggs one at a time, mixing after each addition. Gently stir in cereal. Pour mixture into pastry shell.\nBake in preheated oven for 45 minutes, until knife inserted in center comes out clean. Cool before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pousse Cafe",
        "ingredients": [
            "2 1/4 cups pastry flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 1/2 teaspoons baking powder ADVERTISEMENT",
            "3/4 cup shortening ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3 tablespoons cognac ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup light cream ADVERTISEMENT",
            "2 cups heavy whipping cream ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon instant coffee granules ADVERTISEMENT",
            "1 tablespoon cognac ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease thoroughly a fluted 2 quart ring mold, and dust lightly with flour.\nSift pastry flour, salt, and baking powder together.\nIn a large bowl, cream shortening well. Gradually blend in 1 1/2 cups sugar, eggs, vanilla, and 3 tablespoons cognac; beat until light and fluffy. Gently blend sifted ingredients alternately with the milk and cream into the creamed mixture. Pour batter into ring mold.\nBake for 45 to 50 minutes, or until cake springs back when lightly touched. Remove from pan, and allow to cool.\nIn a clean, cold bowl, beat the 2 cups whipping cream until peaks form. Stir in 1/4 cup sugar and coffee powder. Frost the cake with whipped cream. When serving, drizzle cake with a few drops of cognac.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Psycho Vico",
        "ingredients": [
            "1 (1.5 fluid ounce) jigger Swiss chocolate almond liqueur ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger white chocolate liqueur ADVERTISEMENT",
            "4 fluid ounces milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a tall glass over ice, pour the Swiss almond chocolate liqueur and white chocolate liqueur. Fill glass with milk; stir and serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Date Sour Cream Pie",
        "ingredients": [
            "1 1/2 cups sour cream ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "3 tablespoons cornstarch ADVERTISEMENT",
            "3 egg yolks ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 cup chopped dates ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup walnuts ADVERTISEMENT",
            "1 (9 inch) pie shell, baked ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "1/4 teaspoon cream of tartar ADVERTISEMENT",
            "6 tablespoons white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nTo Make Filling: Combine sour cream, 3/4 cup sugar, cornstarch, yolks and cinnamon in a heavy saucepan; cook until thick, stirring continously. Stir in dates, then remove from heat and let stand for 15 minutes, or until dates are softened. Add vanilla and walnuts to mixture; pour into pie shell.\nTo Make Meringue: In a large glass or metal mixing bowl, beat egg whites and cream of tartar until foamy. Gradually add remaining sugar, continuing to beat until whites form stiff peaks. Spread meringue over pie, covering completely. Bake in preheated oven for 10 minutes, or until meringue is lightly browned.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Easter Deja Vu",
        "ingredients": [
            "4 cups ground ham ADVERTISEMENT",
            "1/3 cup evaporated milk ADVERTISEMENT",
            "5 hard-cooked eggs, peeled ADVERTISEMENT",
            "3 leaves spinach ADVERTISEMENT",
            "5 small spears asparagus ADVERTISEMENT",
            "3 green onions ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 (15 ounce) can cream of asparagus soup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the ground ham with the 1/3 cup evaporated milk; place these ingredients in a plastic bag and mix until just blended (don't over mix this).\nLay plastic wrap or wax paper on a flat surface. Place meat on top of the plastic wrap and pat it out to a very thin oblong shape, approximately 12x14 inches. Fix any holes or openings in the meat. It should be about as thin as a taco shell. Salt and pepper lightly. Lay the spinach leaves on the flat crust leaving a 1/4 inch border clear on the edges.\nPreheat oven to 350 degrees F (175 degrees C).\nArrange eggs, touching end to end, on one end of the crust. Arrange the onion stalks and asparagus to the side of eggs. Keep all of the food just inside of the spinach leaves (not into the border). Salt and pepper lightly.\nSlowly roll the meat and contents jelly roll fashion. Seal or press the meat onto itself at the end. Use the plastic wrap to lift into a bread size loaf pan, seam-side down. Down the center of the ham roll, spread the contents of the asparagus soup, undiluted. Heaping dollops on top.\nBake in a preheated 350 degrees F (175 degrees C) oven for 1 hour.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Christmas Pie",
        "ingredients": [
            "1 (9 inch) pie shell, baked ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 tablespoon unflavored gelatin ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "1/4 teaspoon cream of tartar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "1 cup shredded coconut ADVERTISEMENT",
            "1/2 teaspoon almond extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour cold water into a small bowl. Sprinkle gelatin on top of water and allow it to soften for 5 minutes.\nIn a medium saucepan, mix together 1/2 cup sugar, flour, and milk. Cook over medium heat until mixture thickens and boils, stirring constantly. Boil and stir 5 minutes. Cool slightly. Stir in gelatin mixture and allow to cool completely.\nIn a large glass or metal bowl, beat egg whites until foamy. Add cream of tartar. Continue to beat while gradually adding 1/2 cup sugar, until stiff peaks form. Fold in whipped topping, coconut, and almond extract.\nPour cooled milk mixture into pastry shell. Top with meringue mixture. Refrigerate pie for at least 2 hours before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Simnel Cake",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3/4 cup butter ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups golden raisins ADVERTISEMENT",
            "1/4 cup raisins, chopped ADVERTISEMENT",
            "1/2 cup chopped candied mixed fruit peel ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease one 9 inch tube pan.\nSift flour, baking powder, and salt together.\nCream butter or margarine and sugar together. Beat in the eggs one at a time. Stir in the vanilla and the sifted flour mixture. Fold in the raisins, and candied peel mixing well. Spoon batter into the prepared pan.\nBake at 325 degrees F (165 degrees C) for 1 hour and 45 minutes to 2 hours. Makes about 16 servings.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Mincemeat I",
        "ingredients": [
            "1 pound Golden Delicious apples - peeled, cored and chopped ADVERTISEMENT",
            "1/2 pound golden raisins ADVERTISEMENT",
            "1/2 pound dried currants ADVERTISEMENT",
            "1/2 pound raisins ADVERTISEMENT",
            "1/2 pound shredded beef suet ADVERTISEMENT",
            "1/2 teaspoon ground allspice ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 pound brown sugar ADVERTISEMENT",
            "4 ounces candied mixed citrus peel ADVERTISEMENT",
            "1/2 cup sliced almonds ADVERTISEMENT",
            "2 lemon, juiced and zested ADVERTISEMENT",
            "1/4 cup brandy ADVERTISEMENT",
            "2 teaspoons ground ginger ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place apples, golden raisins, currants, raisins, suet, allspice, cinnamon, brown sugar, citrus peel, almonds, lemon rind, lemon juice, brandy, ginger, and nutmeg in a large bowl and mix thoroughly. Cover and store in refrigerator for 2 days to allow flavor to mature.\nSterilize enough canning jars and lids to hold mincemeat.\nPack mincemeat into sterilized jars, making sure there are no spaces or air pockets. Fill jars all the way to top. Screw on lids.\nPlace a rack in the bottom of a large stock pot and fill halfway with boiling water. Carefully lower jars into pot using a holder. Leave a 2 inch space between jars. Add more boiling water if necessary, until tops of jars are covered by 2 inches of water. Bring water to a full boil, then cover and process for 30 minutes.\nRemove jars from pot and place on cloth-covered or wood surface, several inches apart, until cool. Once cool, press top of each lid with finger, ensuring that seal is tight (lid doesn't move up or down at all). Mincemeat should be aged 2 or 3 months before using, but can be stored up to a year.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Mostaccioli (Mustaches)",
        "ingredients": [
            "1 cup hazelnuts ADVERTISEMENT",
            "1 cup walnuts ADVERTISEMENT",
            "1/3 cup honey ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "1 tablespoon unsweetened cocoa powder ADVERTISEMENT",
            "1/8 teaspoon ground cinnamon ADVERTISEMENT",
            "1/8 teaspoon ground cloves ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1/3 cup all-purpose flour ADVERTISEMENT",
            "1/3 cup confectioners' sugar for decoration ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "1 egg white, beaten ADVERTISEMENT",
            "1/2 tablespoon orange liqueur ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 275F. Grease baking sheet.\nFinely grind nuts in food processor. Add honey, egg white, cocoa, spices and salt. Blend to paste. Add flour and mix using on/off turns until just incorporated. (NOTE: Dough will be sticky.)\nPlace dough on work surface heavily dusted with sifted confectioners' sugar. Sift more powdered sugar over dough. Gently roll dough out to thickness of 3/8\". Cut into 1x1 1/2 inch bars using knife that has been dusted with powdered sugar. Arrange on greased sheet, spacing 1inch apart.\nBake cookies at 275 F (135 degrees C) until firm and tops appear dry, about 25-30 minutes. Cool cookies completely on racks.\nTo Make Icing: Blend 1/2 cup confectioners' sugar and 2 teaspoons egg white. Mix in enough liqueur to make thick but pourable icing. Set racks on waxes paper; arrange cooled cookies on racks with edges touching. Drizzle icing over cookies in irregular lines. Separate cookies. Let stand until icing is dry. Store in airtight container.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Orange Party Cake with Chocolate Coating",
        "ingredients": [
            "1/2 cup margarine, softened ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "6 tablespoons grated orange zest ADVERTISEMENT",
            "3/4 cup fresh orange juice ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "2 cups cake flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon orange food coloring ADVERTISEMENT",
            "1 (.25 ounce) package unflavored gelatin ADVERTISEMENT",
            "2 tablespoons cold water ADVERTISEMENT",
            "2 cups heavy whipping cream ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "1/3 cup orange juice ADVERTISEMENT",
            "4 (1 ounce) squares semisweet chocolate ADVERTISEMENT",
            "1 1/2 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Grease and line with buttered wax paper two 8 inch round pans.\nCream together margarine and 1 1/4 cup white sugar until light and fluffy. Beat in eggs and orange rind until thoroughly combined. Stir in 1/2 cup orange juice and milk. Combine flour, baking powder, salt, and baking soda; stir into creamed mixture, and beat with an electric mixer at medium speed for 2 minutes. Blend in orange food coloring. Pour batter into prepared pans.\nBake for 25 minutes. Cool 10 minutes, and then remove layers from pans. Peel off wax paper, and cool completely on wire racks. Split each layer of cake, making 4 thin layers. Sprinkle layers with 1/4 cup orange juice.\nSprinkle gelatin on the cold water in a small cup; let stand 5 minutes. Place cup in boiling water bath, and stir until gelatin is dissolved. Remove from heat, and set aside for a minute. Whip cream with confectioners' sugar until just starting to thicken. Continue beating while you add the orange juice. Slowly pour in gelatin, and combine thoroughly. Beat until stiff. Fill layers with orange flavored whipped cream.\nIn a double boiler, combine squares of chocolate and butter or margarine; stir until melted. Let cool until chocolate thickens somewhat. Pour chocolate on top of cake, letting it drizzle down the sides. Refrigerate cake for 24 hours. Let cake sit at room temperature at least 1 hour before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Coconut Raffaello® Candies",
        "ingredients": [
            "1 (14 ounce) bag flaked coconut ADVERTISEMENT",
            "1 (16 ounce) package confectioners' sugar ADVERTISEMENT",
            "1 1/2 cups margarine, softened ADVERTISEMENT",
            "1 1/3 cups powdered milk ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 teaspoon almond extract ADVERTISEMENT",
            "50 hazelnuts (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Process coconut in a food processor until finely minced. Measure 1/2 cup coconut pour into a shallow bowl.\nStir confectioner's sugar, margarine, powdered milk, milk, and almond extract together in a bowl until smooth. Mix remaining coconut into milk mixture by hand. Cover the bowl with plastic wrap and refrigerate until slightly chilled, about 20 minutes.\nRoll milk mixture into walnut-sized balls, press a hazelnut into the center of each ball, and roll balls in reserved coconut. Place candies in a sealable container and refrigerate until serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Ultimate Gooey Blueberry Pie",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "6 cups frozen blueberries ADVERTISEMENT",
            "1/4 cup cornstarch, or as needed ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/4 cup freshly squeezed orange juice ADVERTISEMENT",
            "1 orange, zested ADVERTISEMENT",
            "1 teaspoon pure vanilla extract ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1 pastry for a double-crust 9-inch pie, at room temperature ADVERTISEMENT",
            "1 egg white, lightly beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Spray a 9-inch pie dish with cooking spray.\nMix blueberries and cornstarch together in a bowl until all the blueberries are coated. Add sugar, orange juice, orange zest, vanilla extract, and cinnamon to blueberries; stir until well mixed.\nPress 1 pie crust into the prepared pie dish. Brush the bottom crust with ½ of the beaten egg white. Pour blueberry mixture into the pie crust.\nLay the second crust over the blueberry filling, crimping the 2 crusts together to seal. Cut 4 1/2-inch slits into the top crust. Brush the top crust with the remaining egg wash. Cover crust edges with strips of aluminum foil to prevent burning.\nBake in the preheated oven until crust is golden brown and the filling is bubbling, 50 to 60 minutes.\n",
        "picture_link": "GKeO9NCM8pLjS9lG2PcgmFfCgKk.qq2"
    },
    {
        "title": "Steamed Currant Cake",
        "ingredients": [
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup lard ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "2/3 cup chopped raisins ADVERTISEMENT",
            "2/3 cup dried currants ADVERTISEMENT",
            "2/3 cup chopped dates ADVERTISEMENT",
            "1 cup fresh bread crumbs ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "3/4 cup confectioners' sugar ADVERTISEMENT",
            "1/8 cup boiling water ADVERTISEMENT",
            "1/8 cup brandy ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grease and flour a 9x5 inch loaf pan and line bottom with parchment paper. Sift together the flour, cinnamon, nutmeg, baking soda and salt. Set aside. Place a rack in the bottom of a large pot, over medium heat, and fill to the top of the rack with boiling water.\nIn a large bowl cream the lard and sugar until fluffy. Beat in the eggs. Mix in the walnuts, chopped raisins, currants, dates, bread crumbs, and orange juice. Stir in the flour mixture until smooth. Pour into prepared pan.\nCover the top with 2 layers of parchment paper and tie down with string. Place the pan on the rack. Cover pot and steam cake for 3 hours. Make sure to add water as it evaporates. Serve warm with Hard Sauce.\nTo make the Hard Sauce: In a saucepan cream 2 tablespoons butter and 3/4 cup confectioners' sugar. Add 1/8 cup boiling water and 1/8 cup brandy. Cook, stirring, until clear and pour over individual servings.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chocolate Cookie Pudding Pops",
        "ingredients": [
            "2 cups milk ADVERTISEMENT",
            "1 (3.4 ounce) package cook-and-serve chocolate pudding mix ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "12 chocolate sandwich cookies, broken into pieces ADVERTISEMENT",
            "ice-pop molds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat milk and pudding mix together with a wire whisk in a saucepan until powder is dissolved into liquid; bring to a full, rolling boil and remove immediately from heat. Let pudding cool slightly, about 10 minutes.\nFold whipped topping into the pudding mixture; add cookies and stir. Pour the mixture into ice pop molds.\nPut molds in freezer until the pudding mixture is firm, 4 to 5 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Scot's Au Gratin Shepherd's Pie",
        "ingredients": [
            "1 (3.95 ounce) package Idahoan® Au Gratin Homestyle Casserole ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "Salt and pepper, to taste ADVERTISEMENT",
            "1 1/2 pounds diced lamb (or diced sirloin beef) ADVERTISEMENT",
            "Flour for coating ADVERTISEMENT",
            "1/4 cup onion, finely diced ADVERTISEMENT",
            "1/4 cup carrot, finely diced ADVERTISEMENT",
            "3 tablespoons tomato paste ADVERTISEMENT",
            "2 cups beef stock ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F.\nHeat oil and butter in a stock pot. Season the meat with salt and pepper.\nCoat the meat completely in flour and saute in the stock pot. Get it good and brown over medium heat. Don't be afraid to get the meat nice and dark.\nOnce browned, add the vegetables and tomato paste. Mixture should be good and thick. Slowly add the beef stock while stirring the meat till meat is covered with liquid and continue to stir. Add bay leaf.\nCover and let simmer on low heat for about 30 minutes to really incorporate the flavors as well as thicken.\nIn a 1-quart casserole dish, pour stew into dish. Prepare a box of Idahoan Au Gratin potatoes following package directions for stove top and pour over the stew mixture.\nPlace in a pre-heated oven covered for 15 minutes then remove cover and continue baking for another 15 minutes.\n",
        "picture_link": "1yvBoXnijx2mHoUg5cDIsDVeZhYUzcS"
    },
    {
        "title": "Knock-Your-Socks-Off Vegan Chocolate Cake",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "3 cups unbleached all-purpose flour ADVERTISEMENT",
            "1/2 cup unsweetened cocoa powder ADVERTISEMENT",
            "2 1/2 teaspoons xanthan gum ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon kosher salt ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "2 cups demerara sugar ADVERTISEMENT",
            "3/4 cup vegetable oil ADVERTISEMENT",
            "2 tablespoons white vinegar ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray a 9x13-inch baking dish with cooking spray.\nWhisk flour, cocoa powder, xanthan gum, baking soda, and salt together in a bowl. Add water, sugar, vegetable oil, vinegar, and vanilla extract to dry ingredients; mix until batter is just moistened and pour into the prepared baking dish.\nBake in the preheated oven until a toothpick inserted in the center of the cake comes out clean, about 40 minutes.\n",
        "picture_link": "..fk.Y2vVnyU7pbexL.JUyv92p0/kD."
    },
    {
        "title": "Sweet Pink Popsicle® Suckers",
        "ingredients": [
            "1 1/3 cups pink lemonade ADVERTISEMENT",
            "18 heart-shaped cinnamon candies ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour lemonade into the cubes of an ice cube tray. Drop one cinnamon heart into each cube. Freeze until lemonade cubes are frozen, 8 hours to overnight.\nDip the ice cube tray into hot water until cubes release from the tray, 10 to 15 seconds.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Five Can Soup",
        "ingredients": [
            "1 (15 ounce) can prepared chili with beans (such as Hormel®) ADVERTISEMENT",
            "1 (14 ounce) can whole kernel corn ADVERTISEMENT",
            "1 (10.75 ounce) can vegetable beef soup (such as Campbell's®) ADVERTISEMENT",
            "1 (10.75 ounce) can tomato soup (such as Campbell's®) ADVERTISEMENT",
            "1 (10 ounce) can diced tomatoes with green chile peppers (such as RO*TEL®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir chili, corn, vegetable beef soup, tomato soup, and diced tomatoes with green chile peppers together in a saucepan over medium-high heat; cook until hot, 5 to 10 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Super-Easy Strawberry Shortcake",
        "ingredients": [
            "1 (16 ounce) package frozen strawberries ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1 (9 inch) angel food cake, sliced ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping (such as Cool Whip®), thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix strawberries and sugar together in a bowl until evenly coated. Refrigerate until strawberries are thawed, 8 hours to overnight.\nPlace a slice of angel food cake on each plate; top with whipped topping and sweetened strawberries.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Carob Ice Cream - The Winning Try",
        "ingredients": [
            "1 (14 ounce) can coconut milk ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 cup roasted carob powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend coconut milk, sugar, and carob powder together in a blender until smooth.\nPour coconut milk mixture into your ice cream maker and process according to manufacturer's instructions until smooth and frozen, about 45 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Imperial Vegetables and Noodles",
        "ingredients": [
            "1 (500 gram) package Europe's Best® Imperial Blend vegetables ADVERTISEMENT",
            "1 (12 ounce) package Cantonese-style steamed chow mein noodles ADVERTISEMENT",
            "1 1/2 cups Imagine® Organic Vegetable Broth ADVERTISEMENT",
            "2 tablespoons naturally brewed soy sauce ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "1 1/2 teaspoons sesame oil ADVERTISEMENT",
            "1 tablespoon Spectrum Naturals® Canola Oil ADVERTISEMENT",
            "1 (170 gram) package Yves Veggie Cuisine® Chick'n or Beef Veggie Tenders ADVERTISEMENT",
            "1 tablespoon grated fresh ginger ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1/4 cup chopped green onion ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Thaw vegetables; drain well. Set aside.\nPrepare noodles according to package directions. Set aside and keep hot.\nPrepare sauce: In a small bowl, mix together broth and soy sauce. Whisk in cornstarch. Stir in sesame oil. Set aside.\nIn a large non-stick skillet over medium-high heat, heat oil. Add veggie chick'n tenders, ginger and garlic; stir-fry for 1 minute. Add vegetables; stir-fry for 2 minutes. Stir in sauce; reduce heat and simmer for about 2 minutes, until thickened.\nPour vegetable mixture over noodles. Top with green onion. Grab your chopsticks and dig in!\n",
        "picture_link": "1tqCa3emfHVN.91Uq5iaGgwlXXnoeBO"
    },
    {
        "title": "Quick Almond Butter Cookies",
        "ingredients": [
            "1 1/3 cups brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup almond butter ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup chocolate chips (optional) ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBeat brown sugar and eggs together in a bowl until smooth; add peanut butter and beat until well-combined. Stir flour, chocolate chips, and baking soda into peanut butter mixture until dough forms. Roll dough into balls, and place 2-inches apart on a baking sheet. Flatten dough balls with the back of a spoon.\nBake in preheated oven until golden brown, 15 to 25 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Grandma Cathy's Pineapple Poppy Seed Cake",
        "ingredients": [
            "Cake: ADVERTISEMENT",
            "1 (15.25 ounce) package yellow cake mix ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 (5.1 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/2 cup pineapple juice ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1 tablespoon poppy seeds ADVERTISEMENT",
            "Sauce: ADVERTISEMENT",
            "1 cup sugar ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1/4 cup pineapple juice ADVERTISEMENT",
            "3 tablespoons confectioners' sugar for dusting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 10-inch fluted tube pan (such as Bundt(R)).\nBeat yellow cake mix, eggs, instant pudding mix, water, pineapple juice, oil and poppy seeds together in a large bowl; pour into prepared pan.\nBake in preheated oven until a toothpick inserted into the center of the cake comes out clean, about 45 minutes.\nRemove cake from oven, rest on wire cooling rack. Run knife between cake and sides of pan to release. Using a skewer, poke holes in the cake at 1/2-inch intervals. Pour sauce over cake and let rest in pan for 45 minutes to cool.\nStir sugar, pineapple juice, and butter together in a saucepan over medium heat until the butter melts, 1 to 2 minutes; bring to a boil and cook for 1 minute more. Remove saucepan from heat and pour sauce over the cake.\nLet cake cool and absorb the sauce at room temperature for at least 45 minutes.\nRemove cake from pan and dust with confectioners' sugar.\n",
        "picture_link": "L0XY3hwYvNN4egmpbw0mUIBVFhVFwiC"
    },
    {
        "title": "Peanut Butter Cup Pie Pudding Pops",
        "ingredients": [
            "2 cups cold milk ADVERTISEMENT",
            "1 (3.4 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "2 tablespoons peanut butter, slightly melted ADVERTISEMENT",
            "2 1/2 tablespoons semisweet chocolate chips, or more to taste ADVERTISEMENT",
            "vegetable oil cooking spray ADVERTISEMENT",
            "1 1/2 cinnamon graham crackers, finely crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat milk and instant pudding mix together with a whisk or electric mixer until pudding mix is completely dissolved, about 2 minutes. Refrigerate until slightly set, at least 5 minutes.\nStir 1/2 of the pudding and peanut butter together in a bowl until peanut butter is evenly distributed.\nMelt chocolate chips in a microwave-safe glass or ceramic bowl in 30-second intervals, stirring after each melting, for 1 to 3 minutes (depending on your microwave). Stir remaining 1/2 of the pudding and melted chocolate together in a bowl.\nSpray 7 ice-pop molds with cooking spray. Pour crushed graham crackers into molds and shake to coat all surfaces in the mold. Drop 1 spoonful peanut butter-pudding mixture into each mold; top with 1 spoonful chocolate pudding. Repeat layering until molds are full. Top with ice-pop top or stick and freeze until frozen, at least 4 hours.\n",
        "picture_link": "oWe7dshRE42F5pyXWydeHMyIqpuwpC6"
    },
    {
        "title": "Noemi's Tropical Ice Cream",
        "ingredients": [
            "2 ripe bananas ADVERTISEMENT",
            "4 pods fresh jackfruit ADVERTISEMENT",
            "2 cups heavy whipping cream ADVERTISEMENT",
            "1 (14 ounce) can coconut milk ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon sea salt ADVERTISEMENT",
            "1/2 cup sweetened flaked coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend bananas, jackfruit pods, and cream in a blender until jackfruit is mostly chopped into small pieces.\nCombine coconut milk and sugar together in a saucepan over low heat; cook and stir until sugar is dissolved, 5 to 10 minutes. Remove saucepan from heat and stir the banana mixture into the coconut milk mixture. Stir vanilla extract and sea salt into coconut milk mixture.\nPour 1/2 of the coconut milk-banana mixture into a blender. Cover and hold lid down; pulse a few times before leaving on to blend until smooth. Pour blended mixture into a long rectangular pan or glass tray. Repeat blending the remaining coconut-banana mixture until smooth; pour into the pan. Stir flaked coconut into pureed coconut-banana mixture. Cover pan with a lid or aluminum foil and place in the freezer, stirring 1 time every hour, for 5 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sweet and Spicy Carrots",
        "ingredients": [
            "2 (16 ounce) packages baby carrots ADVERTISEMENT",
            "1 cup orange juice ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1/2 cup apricot preserves ADVERTISEMENT",
            "3 tablespoons Dijon mustard ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground white pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix carrots and orange juice in a large saucepan; bring to a boil, place a cover on the pan, reduce heat to low, and cook at a simmer until carrots are tender-crisp, 8 to 10 minutes. Drain carrots, reserving 1/4 cup of the orange juice.\nReturn carrots and reserved juice to the pan and place over medium heat. Stir honey, apricot preserves, Dijon mustard, butter, brown sugar, salt, and black pepper with the carrots and juice; cook and stir until sugar dissolves completely and the carrots are glazed and tender, about 10 minutes.\n",
        "picture_link": "1Q8WHezQjcyzIstfQF69Vjcrg6sCtL."
    },
    {
        "title": "Halloween Gingerbread Cupcakes",
        "ingredients": [
            "6 tablespoons butter, softened ADVERTISEMENT",
            "1/2 cup granulated sugar ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground ginger ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/2 cup molasses ADVERTISEMENT",
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "Orange and black decorating sugar ADVERTISEMENT",
            "Cinnamon Vanilla Frosting: ADVERTISEMENT",
            "1/3 cup butter, softened ADVERTISEMENT",
            "1/3 cup sour cream ADVERTISEMENT",
            "1 teaspoon vanilla ADVERTISEMENT",
            "4 cups powdered sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F. Line muffin pans with 12 to 18 Reynolds(R) StayBrite(R) Baking Cups with a black swirl design.\nBeat butter and sugar together in a large bowl with an electric mixer on medium speed for 30 seconds. Add baking powder, cinnamon, ginger, baking soda, and salt. Beat until combined, scraping down sides of the bowl as necessary. Beat in eggs, one at a time.\nWhisk together the milk and molasses in a medium bowl. Alternately add flour and milk mixture to the butter mixture, beating on low speed after each addition just until combined. Spoon batter evenly into prepared muffin cups, filling each about three-fourths full.\nBake 18 to 20 minutes or until a wooden toothpick inserted near centers comes out clean. Cool in pans on a wire rack for 5 minutes. Carefully remove cupcakes from pans; cool completely on a wire rack.\nFrost with Cinnamon Vanilla Frosting. Sprinkle colored decorating sugars.\nCinnamon Vanilla Frosting: Combine butter, sour cream, and vanilla in a large mixing bowl. Beat with an electric mixer on medium speed for 30 seconds. Gradually beat in powdered sugar and ground cinnamon. Thin with 1 to 2 tablespoons milk, if needed to reach desired consistency.\n",
        "picture_link": "nLE90pLpa2cLEoRM2RtUkEnJ559lNr2"
    },
    {
        "title": "Cheese and Potato Rissoles",
        "ingredients": [
            "2 pounds potatoes, peeled ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "6 egg yolks ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 pinch ground white pepper, or to taste ADVERTISEMENT",
            "10 1/2 ounces shredded Cheddar cheese ADVERTISEMENT",
            "1/2 large onion, diced ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 cup sifted all-purpose flour, or as needed ADVERTISEMENT",
            "1 cup soft bread crumbs, or as needed. ADVERTISEMENT",
            "1 quart vegetable oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain potatoes and mash in the bottom of the pot until no lumps remain.\nPut pot over low heat. Stir butter into the mashed potatoes; cook, stirring constantly, until the butter has melted and the potatoes are no longer moist. Spread potatoes into the bottom of a wide bowl and refrigerate until cooled completely, at least 30 minutes.\nBeat egg yolks into cooled potatoes; season with salt and white pepper. Stir Cheddar cheese and diced onion into the potatoes. Shape potato mixture into tennis ball-sized spheres, arrange into a baking dish, and refrigerate until chilled completely through, at least 1 hour.\nBeat eggs and water together in a bowl. Spread flour and bread crumbs into two separate wide bowls.\nGently roll potato balls in flour to coat and shake to remove excess flour. Dip each into the beaten egg, turning to coat. Press each egg-coated ball into bread crumbs, again turning to coat on all sides. Gently toss between your hands so any bread crumbs that haven't stuck can fall away. Place the breaded balls onto a plate while breading the rest; do not stack.\nHeat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C).\nDeep-fry potato balls in batches in hot oil until golden brown, about 5 minutes. Add more oil and return to 375 degrees F (190 degrees C) between batches. Drain fried balls on a plate lined with paper towel.\n",
        "picture_link": "6wm9Di.gwI0QVrL2AW8HaortORZoI6G"
    },
    {
        "title": "Stuffed Peppers with Ancient Grains and Roasted Peppers",
        "ingredients": [
            "1 (180 gram) package Casbah® Ancient Grains Blend ADVERTISEMENT",
            "2 cups Imagine Organic Vegetable Broth ADVERTISEMENT",
            "6 large sweet peppers (green, yellow, orange or red) ADVERTISEMENT",
            "1 tablespoon Spectrum Naturals® Olive Oil ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 (340 gram) package Yves Veggie Cuisine® Original Veggie Ground Round ADVERTISEMENT",
            "3/4 cup chopped assorted bell peppers ADVERTISEMENT",
            "1 medium tomato, chopped ADVERTISEMENT",
            "1/3 cup chopped fresh parsley ADVERTISEMENT",
            "3/4 cup shredded Cheddar or mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook ancient grains according to package directions, using vegetable broth. (Do not lift lid or stir while cooking.)\nMeanwhile, halve peppers lengthwise through stems; remove seeds and ribs. Boil peppers in a large pot of boiling water for 5 minutes or until tender; drain on paper towel. Set aside; keep warm.\nHeat oil in a large non-stick skillet over medium heat. Add onion; cook, stirring, for 6 minutes, until soft. Stir in garlic, cook for 1 minute. Stir in ground round, roasted peppers and pizza sauce. Cook for about 3 minutes, stirring occasionally, until heated through.\nStir in ancient grains, tomato and parsley.\nPlace prepared pepper halves in large baking dish. Fill each with ground round mixture, mounding high. Top with cheese. If desired, place under broiler to melt cheese.\n",
        "picture_link": "acXeEI6RTPmRzBXb6SchZmr29QsOJI2"
    },
    {
        "title": "The Perfect Rustic Marinara",
        "ingredients": [
            "2 (3.5 ounce) links Italian sausage, sliced ADVERTISEMENT",
            "2 (15 ounce) cans tomato sauce ADVERTISEMENT",
            "1 large tomato, coarsely chopped ADVERTISEMENT",
            "1/2 cup red wine ADVERTISEMENT",
            "1 head garlic, minced ADVERTISEMENT",
            "1/3 cup minced onion ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "2 tablespoons chopped fresh basil ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 tablespoon fresh thyme leaves ADVERTISEMENT",
            "1 tablespoon fresh oregano ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "1 teaspoon red pepper flakes ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a stockpot over medium-high heat. Cook and stir sausage in the hot stockpot until browned, 5 to 7 minutes; drain and discard grease.\nBlend tomato sauce, tomato, red wine, garlic, onion, Parmesan cheese, balsamic vinegar, basil, olive oil, thyme, oregano, black pepper, red pepper flakes, salt, and brown sugar together in a blender until desired consistency is reached. Pour mixture over sausage; bring to a boil. Reduce heat and simmer, stirring occasionally, until wine has cooked off, at least 30 minutes.\n",
        "picture_link": "T6gI7J8vBjgl1OjcFk/C79.ThOKHQEW"
    },
    {
        "title": "Coconut Streusel Cherry Pie",
        "ingredients": [
            "1/4 cup white sugar ADVERTISEMENT",
            "1/4 cup cornstarch ADVERTISEMENT",
            "6 cups pitted Bing cherries ADVERTISEMENT",
            "3 tablespoons almond-flavored liqueur (such as Disaronno®) ADVERTISEMENT",
            "1 (9 inch) baked pie crust ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "3/4 cup flaked coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nStir 1/4 cup sugar and cornstarch together in a saucepan; add cherries and almond-flavored liqueur. Cook and stir mixture over low heat until thickened, 10 to 15 minutes. Spoon mixture into pie crust.\nWhisk flour and 3/4 cup sugar together in a bowl. Cut butter into flour mixture until texture of coarse crumbs; stir in coconut. Sprinkle topping over filling to within 2 inches of center.\nBake in the preheated oven until coconut is toasted and topping is browned, 15 to 20 minutes.\n",
        "picture_link": "JEYrMQiogu7HlyyBtc9oUkfx4BHLcfW"
    },
    {
        "title": "Peppermint Margarita",
        "ingredients": [
            "1/4 cup red colored sugar, or as needed ADVERTISEMENT",
            "1/4 cup white sugar, or as needed ADVERTISEMENT",
            "1 fresh lime, cut into wedges ADVERTISEMENT",
            "1 cup white tequila (such as Jose Cuervo Clasico®) ADVERTISEMENT",
            "1 cup simple syrup ADVERTISEMENT",
            "1 (6 ounce) can frozen limeade concentrate ADVERTISEMENT",
            "4 1/2 fluid ounces peppermint schnapps, or to taste ADVERTISEMENT",
            "1/2 cup triple sec ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "8 cups ice cubes, or as needed ADVERTISEMENT",
            "1 tablespoon grenadine syrup, or as desired ADVERTISEMENT",
            "1 fluid ounce brandy-based orange liqueur (such as Grand Marnier®) (optional) ADVERTISEMENT",
            "1 tablespoon crushed candy canes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour 1/4 to 1/2 inch of red sugar onto a small, shallow plate. Pour 1/4 to 1/2 inch of white sugar onto another small, shallow plate. Moisten the rims of margarita glasses with a wedge of lime, dip the moistened glasses into the red sugar, then the white, alternating sugars so that the edge of the glass looks like stripes on a candy cane; set aside.\nBlend tequila, simple syrup, limeade, peppermint schnapps, triple sec, and lemon juice in a blender until smooth. Pour tequila mixture into a quart jar.\nFill blender with ice cubes. Pour 1/4 the tequila mixture over the ice and blend until smooth. Add grenadine for color while the mixture is blending. Pour mixture into prepared margarita glasses, add a splash of orange liqueur, and sprinkle crush candy canes over each margarita. Repeat with remaining tequila mixture and ice cubes.\n",
        "picture_link": "1K0pOYicUHCrc1oGXAqcDGM6m/OfZwu"
    },
    {
        "title": "Red Pepper and Onion Relish",
        "ingredients": [
            "24 red bell peppers - halved, seeded, and thinly sliced ADVERTISEMENT",
            "7 onions, halved and thinly sliced ADVERTISEMENT",
            "3 cups white sugar ADVERTISEMENT",
            "3 cups vinegar ADVERTISEMENT",
            "3 tablespoons salt ADVERTISEMENT",
            "10 half-pint canning jars with lids and rings ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine red bell peppers, onions, sugar, vinegar, and salt in a large pot; bring to a boil. Reduce heat and simmer until vegetables are tender, about 30 minutes.\nSterilize the jars and lids in boiling water for at least 5 minutes. Pack relish into hot, sterilized jars, filling to within 1/2 inch of the top. Run a knife or thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids and screw on rings.\nPlace a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for 15 minutes.\nRemove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sally Lunn Bread",
        "ingredients": [
            "1 cup milk ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "3 1/2 cups unbleached all-purpose flour ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "2 (.25 ounce) packages active dry yeast ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon almond extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat milk in a saucepan over medium-low heat; add butter and water. Stir mixture until butter melts, about 5 minutes. Remove milk mixture from heat and cool to lukewarm, 5 to 10 minutes. Pour milk mixture into a bowl of a stand mixer.\nStir flour, honey, eggs, yeast, salt, vanilla extract, and almond extract into milk mixture; beat using the paddle attachment of the mixer until well blended, about 3 minutes. Cover bowl with a damp towel and place in a warm spot of the kitchen until doubled in size, about 1 hour.\nPreheat oven to 350 degrees F (175 degrees C).\nPunch down dough and transfer to a 9- or 10-inch tube pan.\nBake in the preheated oven until lightly browned, about 50 minutes.\n",
        "picture_link": "TpO4WQQpKDsceBjjMhKQoz3a9kz9w8C"
    },
    {
        "title": "Apple-Raisin Turkey Stuffing",
        "ingredients": [
            "8 apples - peeled, cored, and chopped ADVERTISEMENT",
            "2 cups water, or to taste ADVERTISEMENT",
            "1 (15 ounce) package raisins ADVERTISEMENT",
            "1 (14 ounce) package unseasoned dry bread stuffing mix ADVERTISEMENT",
            "1 cup white sugar, or to taste ADVERTISEMENT",
            "4 eggs, beaten ADVERTISEMENT",
            "1 teaspoon ground cinnamon, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix apples, water, raisins, stuffing mix, sugar, eggs, and cinnamon together in a large bowl. Stir more water into the apple mixture to get to your desired level of moistness.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Christmas Tree Treats",
        "ingredients": [
            "3/4 cup butter, softened ADVERTISEMENT",
            "2 tablespoons butter, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon almond extract ADVERTISEMENT",
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 drop green food coloring, or as desired ADVERTISEMENT",
            "18 wooden craft sticks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat 3/4 cup and 2 tablespoons butter and sugar together in a bowl using an electric mixer on medium speed until smooth. Add almond extract to butter mixture and beat until well blended.\nWhisk flour, baking powder, and salt together in a bowl. Gradually add flour mixture, about 1/4 cup at a time, to butter mixture, beating well after each addition until dough is just mixed. Beat green food coloring into dough until desired color is reached. Divide dough in half and shape each half into a 1-inch wide log. Wrap each log in plastic wrap and refrigerate until firm, about 2 hours.\nPreheat oven to 275 degrees F (135 degrees C). Lightly grease baking sheets or line with parchment paper. Arrange wooden sticks on prepared baking sheet.\nCut dough into 1/4-inch thick slices. Arrange 3 slices next to each other on each wooden stick, about halfway up the stick. Place 2 dough slices above the 3 dough slices, overlapping middle slices slightly, forming a tree-shape.\nBake in the preheated oven until edges are lightly browned, about 30 minutes. Cool cookies on baking sheet for 5 minutes before transferring to a wire rack to cool completely.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Vegan Avocado-Coconut Milk Ice Cream",
        "ingredients": [
            "3 ripe avocados - halved, pitted, and peeled ADVERTISEMENT",
            "lemons, juiced ADVERTISEMENT",
            "2 limes, juiced ADVERTISEMENT",
            "1 lemon, zested ADVERTISEMENT",
            "1 lime, zested ADVERTISEMENT",
            "1 (14 ounce) can unsweetened coconut milk ADVERTISEMENT",
            "1 cup agave nectar, or more to taste ADVERTISEMENT",
            "1/4 cup corn syrup (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend avocados, lemon juice, lime juice, lemon zest, and lime zest together in a food processor until smooth; add coconut milk, agave nectar, and corn syrup and blend until smooth. Cover bowl of food processor and refrigerate for at least 1 hour.\nPour avocado mixture into ice cream maker and process according to manufacturer's instructions.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Uncle Bob's Ceviche",
        "ingredients": [
            "1 pound swordfish, cut into bite-sized pieces ADVERTISEMENT",
            "1 pound halibut, cut into bite-sized pieces ADVERTISEMENT",
            "1 pound squid, cut into thin rings ADVERTISEMENT",
            "3 limes, juiced ADVERTISEMENT",
            "1 bunch cilantro, chopped ADVERTISEMENT",
            "1/2 cup bloody mary mix (such as Mr. & Mrs. T®) ADVERTISEMENT",
            "1/2 cup chopped pimento-stuffed green olives ADVERTISEMENT",
            "1/2 cup chopped black olives ADVERTISEMENT",
            "1/2 cup chopped yellow onion ADVERTISEMENT",
            "1/2 cup chopped pimento peppers ADVERTISEMENT",
            "1/2 cup diced canned jalapeno peppers ADVERTISEMENT",
            "1/4 cup frozen corn kernels, or to taste ADVERTISEMENT",
            "1/4 cup frozen peas, or to taste ADVERTISEMENT",
            "1 tablespoon cumin seeds ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon ground cumin, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put swordfish, halibut, and squid in a large, resealable plastic bag; add lime juice and mix to coat seafood with the lime juice, squeeze bag to remove excess air, and seal the bag. Marinate in the refrigerator 8 hours to overnight.\nPour seafood mixture into a large serving bowl. Stir cilantro, bloody mary mix, green olives, black olives, yellow onion, pimento peppers, jalapeno peppers, corn, peas, cumin seeds, and Worcestershire sauce with the seafood mixture. Sprinkle ground cumin over the mixture to cover completely.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    }
]