[
    {
        "title": "Baked Ziti Casserole",
        "ingredients": [
            "1 (16 ounce) package ziti ADVERTISEMENT",
            "1 (15 ounce) container ricotta cheese ADVERTISEMENT",
            "1 1/2 cups tomato sauce ADVERTISEMENT",
            "1 (8 ounce) package shredded mozzarella cheese ADVERTISEMENT",
            "1 egg, slightly beaten ADVERTISEMENT",
            "1 teaspoon salt, or to taste ADVERTISEMENT",
            "1/2 teaspoon ground black pepper, or to taste ADVERTISEMENT",
            "2 cups tomato sauce, divided ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook ziti in boiling water until cooked through but firm to the bite, about 13 minutes; drain. Rinse ziti with cold water until cool; drain.\nPreheat oven to 375 degrees F (190 degrees C).\nMix ziti, ricotta cheese, 1 1/2 cups tomato sauce, mozzarella cheese, egg, salt, and pepper in a large bowl.\nSpread 1/2 cup tomato sauce into the bottom of a 2 1/2-quart shallow baking dish. Pour ziti mixture into the dish. Top with remaining 1 1/2 cup tomato sauce and Parmesan cheese.\nBake in preheated oven until sauce and cheese layer is bubbly and lightly browned, about 30 minutes. Let cool 10 minutes before serving.\n",
        "picture_link": "cDuQLEjA3FDnvhvVkoQtEgPPM6mtVqa"
    },
    {
        "title": "Grilled Zucchini Pizza with Goat Cheese",
        "ingredients": [
            "1 large zucchini, cut into 1/2-inch rounds ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/4 cup pizza sauce ADVERTISEMENT",
            "1/2 cup chopped red onion ADVERTISEMENT",
            "1/2 cup chopped roasted red pepper ADVERTISEMENT",
            "1/2 cup chopped fresh mushrooms ADVERTISEMENT",
            "1/4 cup crumbled goat cheese ADVERTISEMENT",
            "2 ounces shredded mozzarella cheese ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 teaspoon Italian seasoning ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill for medium heat and lightly oil the grate.\nBrush one side of each zucchini round with olive oil; brush the opposite side with pizza sauce. Evenly divide red onion, roasted red pepper, mushrooms, goat cheese, mozzarella cheese, garlic, and Italian seasoning over each zucchini round.\nGrill zucchini pizzas over preheated grill until zucchini is tender, about 10 minutes.\n",
        "picture_link": "7af94e4nKonUq8b05r8CBBz6AoYAkhC"
    },
    {
        "title": "Ham Pinwheels",
        "ingredients": [
            "5 (10 inch) flour tortillas ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "2 (2 ounce) packages thinly sliced deli ham (such as Buddig®) ADVERTISEMENT",
            "1 (8 ounce) package shredded Cheddar cheese ADVERTISEMENT",
            "1 cucumber - peeled, seeded, and thinly sliced ADVERTISEMENT",
            "1 head lettuce, separated into leaves ADVERTISEMENT",
            "bacon bits, or to taste ADVERTISEMENT",
            "1/4 teaspoon southwest seasoning (such as Emeril's Southwest Essence®), or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place a tortilla onto a work surface and spread about 2 tablespoons cream cheese evenly over the tortilla. Layer 3 slices of deli ham over half the tortilla, followed by about 2 tablespoons Cheddar cheese, 3 or 4 cucumber slices, 2 or 3 lettuce leaves, a small sprinkle of bacon bits, and a pinch of southwest seasoning. Leave half the tortilla uncovered by fillings except the cream cheese.\nStarting from the layered half of the tortilla, tightly roll into a log and secure with toothpicks. Slice rolls into 1/2-inch thick slices to serve.\n",
        "picture_link": "qzk.m.O78I7/nWZNS5IGwhPTDSVoQsG"
    },
    {
        "title": "Gluten Free Blueberry Muffins",
        "ingredients": [
            "1 1/2 cups confectioners' sugar ADVERTISEMENT",
            "1 cup almond meal ADVERTISEMENT",
            "3/4 cup butter, melted ADVERTISEMENT",
            "1/2 cup gluten-free flour ADVERTISEMENT",
            "6 egg whites, beaten ADVERTISEMENT",
            "1/4 teaspoon xanthan gum ADVERTISEMENT",
            "3/4 cup fresh blueberries ADVERTISEMENT",
            "2 tablespoons confectioners' sugar for dusting (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease 12 muffin cups.\nMix 1 1/2 cup confectioners' sugar, almond meal, butter, flour, egg whites, and xanthan gum together in a bowl until just combined. The mixture will be slightly grainy. Spoon batter into prepared muffin cups. Scatter blueberries onto batter.\nBake in the preheated oven until a toothpick inserted in the center of a muffin comes out clean, about 25 minutes. Cool muffins in pan for 10 minutes before transferring to a wire rack. Dust with about 2 tablespoons confectioners' sugar.\n",
        "picture_link": "Mg2EkPcqFDx5GWZRsMRJ7hfaMGDmEQi"
    },
    {
        "title": "Summer Time Cucumber Sandwiches",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1 (1 ounce) package ranch dressing mix ADVERTISEMENT",
            "15 slices cocktail rye bread ADVERTISEMENT",
            "1 large cucumber, peeled and sliced ADVERTISEMENT",
            "1 teaspoon dried dill weed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mash cream cheese, mayonnaise, and ranch dressing mix together in a bowl with a fork until smooth; chill for at least 1 hour to blend flavors.\nAbout 10 minutes before serving, remove cream cheese mixture from refrigerator and let stand to soften. Spread about 1 tablespoon of the cream cheese mixture evenly onto each slice of cocktail rye bread, top each with a cucumber slice, and sprinkle with dill.\n",
        "picture_link": "bdg8/lgANUyAl3y.fHPIE4B2cBEd8dO"
    },
    {
        "title": "Kohlrabi and Egg Noodles",
        "ingredients": [
            "4 cups egg noodles (such as No Yolks®) ADVERTISEMENT",
            "2 tablespoons butter or margarine ADVERTISEMENT",
            "3 cups grated kohlrabi ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook egg noodles in boiling water, stirring occasionally, until cooked through yet firm to the bite, about 5 minutes; drain.\nMelt butter in a skillet over medium heat. Add kohlrabi, season with salt and pepper, and cook until the kohlrabi is tender, 7 to 10 minutes. Stir the drained egg noodles into the kohlrabi; cook and stir until the noodles are slightly fried, 5 to 7 minutes.\n",
        "picture_link": "1WHuGtfBcAMCIOe4oLxv.UA4FBo6FVq"
    },
    {
        "title": "Thai Chicken Broccoli Slaw",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 large skinless, boneless chicken breast halves, cut into bite-size pieces ADVERTISEMENT",
            "1 (12 ounce) package broccoli coleslaw mix ADVERTISEMENT",
            "1 teaspoon sesame oil, or to taste ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/2 cup peanut sauce (such as House of Tsang®), or to taste ADVERTISEMENT",
            "1 pinch salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a skillet over medium-high heat; cook and stir chicken until no longer pink in the center and juices run clear, about 5 minutes. Add broccoli slaw mix, sesame oil, and water; simmer on medium-low heat until liquid is reduced and broccoli slaw is tender, about 15 minutes. Fold in peanut sauce and salt.\n",
        "picture_link": "KK24sxd.afNNTgKri13cHpt9eApAQJ6"
    },
    {
        "title": "Slow Cooker Beef Tips and Rice",
        "ingredients": [
            "1 (32 fluid ounce) container beef broth ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup with roasted garlic ADVERTISEMENT",
            "1/4 large onion, chopped ADVERTISEMENT",
            "1/4 large onion, sliced ADVERTISEMENT",
            "1 (2 pound) beef rump roast ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "4 cups cooked brown rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix beef broth, mushroom soup with roasted garlic, chopped onion, and sliced onion together in a slow cooker until thoroughly combined; place the beef rump roast into the soup mixture, cover the cooker, and cook on Low until beef is very tender, at least 7 hours.\nOne hour before serving time, remove the roast from the cooker and cut into bite-size pieces; remove and strain 2 cups of beef broth and set aside. Return beef pieces to the slow cooker.\nMelt butter in a heavy skillet over medium heat and stir in flour to make a paste. Reduce heat to low and cook and stir the flour mixture until it bubbles and turns golden brown, about 15 minutes. Watch carefully because the mixture burns easily. Whisk about 1/4 cup of the reserved beef broth into flour mixture at a time and bring gravy to a simmer.\nTo serve, spoon brown rice onto serving plates and top with beef pieces; pour gravy over beef.\n",
        "picture_link": "XJf2hxZ4ur8ibEYu97F7gjA1/UHU0Ci"
    },
    {
        "title": "Carrot and Zucchini Casserole",
        "ingredients": [
            "2 cups sliced carrots ADVERTISEMENT",
            "2 cups peeled and sliced zucchini ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 1/2 cups half-and-half ADVERTISEMENT",
            "2 cubes chicken bouillon ADVERTISEMENT",
            "1/2 cup shredded Colby-Jack cheese ADVERTISEMENT",
            "1/2 teaspoon dry mustard ADVERTISEMENT",
            "1/2 teaspoon dried dill weed ADVERTISEMENT",
            "seasoned dry bread crumbs ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease the inside of a 2-quart casserole dish.\nBoil carrots in a pot of lightly salted water until slightly tender, about 10 minutes. Add zucchini and onion; boil until zucchini is tender, 5 to 10 more minutes. Drain.\nMelt 2 tablespoons butter in a large skillet over medium heat. Whisk flour into melted butter forming a paste, 1 to 2 minutes. Stir half-and-half into paste, stirring constantly, until mixed. Add bouillon cubes and stir until dissolved, 1 to 2 minutes. Add Colby-Jack cheese, mustard, and dill; whisk until cheese is melted, 2 to 3 minutes. Stir in vegetables. Transfer mixture to prepared casserole dish.\nMix bread crumbs with 1/4 cup melted butter in a bowl until butter is fully incorporated. Sprinkle over top of casserole.\nBake casserole in the preheated oven until bubbling and topping is browned, about 45 minutes.\n",
        "picture_link": ".ydR9v/OOJ1/DXC4sjjYhFP4oPXlT/i"
    },
    {
        "title": "Captain Jack's Peach Pie",
        "ingredients": [
            "1 (15 ounce) package double crust ready-to-use pie crust ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/3 cup all-purpose flour ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground cardamom ADVERTISEMENT",
            "1/4 teaspoon ground allspice ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "8 fresh peaches - peeled, pitted, and sliced ADVERTISEMENT",
            "2 tablespoons rum ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease a 9-inch pie dish with butter.\nPress one pie crust into the prepared pie dish.\nMix sugar, flour, cornstarch, cinnamon, cardamom, and allspice together in a bowl. Slowly stir butter into the sugar mixture until fully incorporated.\nToss peaches and rum together in a separate bowl; add sugar mixture to peaches. Gently toss to coat peaches. Pour peach mixture into pie crust. Top with remaining pie crust; seal the two crust edges together. Cut 4 to 5 slits in the top crust for ventilation. Brush with milk.\nBake in the preheated oven for 15 minutes. Lower heat to 350 degrees F (175 degrees C); bake until top is golden brown, about 30 more minutes. Turn off the oven and let the pie rest in the oven as it cools, at least 1 hour.\n",
        "picture_link": "nCu9EpIGOSrzwDHFhoqEwOHNCZpiI2K"
    },
    {
        "title": "Creamy Apple Blueberry Pie",
        "ingredients": [
            "3 cups sliced apples ADVERTISEMENT",
            "1 cup blueberries ADVERTISEMENT",
            "1 (9 inch) unbaked deep dish pie crust ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon, or more to taste ADVERTISEMENT",
            "1 cup plain yogurt ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "1/2 cup rolled oats ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Toss apples and blueberries in the unbaked pie crust.\nMix 1/4 cup flour, white sugar, salt, nutmeg, and cinnamon in a bowl. Stir in yogurt, egg, and vanilla extract; pour batter over apples and blueberries.\nCombine 1/2 cup flour, pecans, oats, and brown sugar in a mixing bowl. Cut in butter with a knife or pastry blender until the mixture resembles coarse crumbs; set aside.\nBake in preheated oven for 15 minutes; reduce heat to 350 degrees F (175 degrees C) and continue baking pie crust is lightly browned, about 30 minutes. Sprinkle crumb mixture over pie and bake until golden brown, about 15 minutes more. Cool before serving.\n",
        "picture_link": "yA8crNJn2TbKp2LEHBt2mhlTy8J2LiS"
    },
    {
        "title": "Perfect Garlic and Parmesan Potatoes",
        "ingredients": [
            "1 sheet (12x36 inches) Reynolds Wrap® Non-Stick Aluminum Foil ADVERTISEMENT",
            "4 medium red potatoes, cut into bite-size pieces ADVERTISEMENT",
            "2 tablespoons olive oil or vegetable oil ADVERTISEMENT",
            "4 cloves garlic, finely chopped ADVERTISEMENT",
            "1/2 teaspoon dried rosemary ADVERTISEMENT",
            "Salt and pepper ADVERTISEMENT",
            "1/2 cup shredded Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F or grill to medium-high.\nCenter potatoes evenly on sheet of Reynolds Wrap(R) Non-Stick Aluminum Foil with non-stick (dull) side toward food. Drizzle with oil. Sprinkle with garlic, rosemary, salt and pepper.\nBring up foil sides. Double fold top and ends to seal making one large foil packet, leaving room for heat circulation inside.\nBake 30 to 35 minutes on cookie sheet in oven.\nOR grill 15 to 20 minutes in covered grill. Sprinkle with Parmesan cheese before serving.\nSprinkle with Parmesan cheese before serving.\n",
        "picture_link": "NTey.Q77e0dj13As8RUApUnQaC4mowq"
    },
    {
        "title": "Oktoberfest Chicken and Red Cabbage",
        "ingredients": [
            "4 slices bacon ADVERTISEMENT",
            "1 tablespoon bacon drippings ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon kosher salt ADVERTISEMENT",
            "1/2 teaspoon smoked paprika ADVERTISEMENT",
            "2 pounds skinless chicken thighs ADVERTISEMENT",
            "1 red onion, sliced ADVERTISEMENT",
            "1 large apple, cored and sliced ADVERTISEMENT",
            "1 head red cabbage, cored and sliced ADVERTISEMENT",
            "1/2 cup red wine vinegar ADVERTISEMENT",
            "1/4 cup dry red wine ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace bacon in a large oven-safe or cast-iron skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on paper towels. When cool, crumble bacon; leave bacon drippings in the skillet.\nWhisk flour, kosher salt, and smoked paprika together in a bowl. Coat chicken thighs in the seasoned flour and brown on both sides in the hot bacon fat over medium heat, about 5 minutes per side; transfer chicken to a plate. Drain bacon grease except for 1 tablespoon; cook and stir onion and apple until onion is translucent and apple is softened, about 5 minutes. Stir red cabbage and bacon into onion-apple mixture, sprinkle with a pinch of kosher salt, and cook, stirring often, until cabbage is softened, 5 to 8 minutes.\nPour red wine vinegar and red wine into skillet. Stir in brown sugar and cinnamon and bring cabbage mixture to a boil; cook until sauce is reduced by half, stirring often, about 10 minutes. Arrange chicken thighs on top of cabbage in the skillet.\nBake in the preheated oven until cabbage is tender and chicken is cooked through, about 40 minutes. An instant-read meat thermometer inserted into the thickest part of a thigh should read at least 160 degrees F (70 degrees C).\n",
        "picture_link": "5Gw2Wb2cd12lzO0P0oc8OcHCyNnG6EO"
    },
    {
        "title": "German Twists",
        "ingredients": [
            "1 (.25 ounce) package active dry yeast ADVERTISEMENT",
            "1/4 cup warm water ADVERTISEMENT",
            "3 1/2 cups bleached all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 cup butter, sliced ADVERTISEMENT",
            "3/4 cup sour cream ADVERTISEMENT",
            "1 large egg ADVERTISEMENT",
            "2 large egg yolks ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup white sugar, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sprinkle yeast over warm water in a bowl and let activate while you complete remaining steps.\nPlace flour and salt into a food processor and pulse once or twice to combine. Scatter butter slices over flour and process until butter is thoroughly mixed into the flour, about 1 minute.\nWhisk yeast mixture, sour cream, egg, egg yolks, and vanilla extract together in a bowl; pour mixture into food processor. Pulse several times, just until the dough starts to hold together and clean the sides of the bowl (do not overmix). Remove dough from food processor and divide in half; form each half into a thick disk, wrap in plastic wrap, and refrigerate at least 2 hours. For best texture, refrigerate overnight.\nPreheat oven to 375 degrees F (190 degrees C). Line several baking sheets with parchment paper.\nSprinkle a work surface generously with sugar and roll out one of the dough disks into an 8x16-inch rectangle. Sprinkle dough with a generous amount of sugar. Fold the dough over in thirds, letter-style, and roll out again; fold as before and roll out and fold a third time, sprinkling dough with sugar each time. Finally, roll dough into a 4x14-inch rectangle, about 1/4 inch thick. Repeat process with second dough disk.\nCut strips from the short side of the dough rectangles, making them 1/2 to 3/4 inch wide. Place strips onto the parchment-lined baking sheets, twisting and slightly stretching them. If preferred, form into horseshoe shapes.\nBake in the preheated oven until lightly golden brown, 12 to 15 minutes. Cookies will puff up a bit to reveal delicate layers. Let cookies cool for about 5 minutes on sheets before transferring to wire cooling racks.\n",
        "picture_link": "Y8Q5hQoMrJDSm76/AHb3qzM4ZgnKiy6"
    },
    {
        "title": "Hawaiian Pork Tenderloin",
        "ingredients": [
            "2 pounds boneless pork tenderloin ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 cup pineapple preserves ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "1 orange bell pepper, cut into long strips ADVERTISEMENT",
            "1 red bell pepper, cut into long strips ADVERTISEMENT",
            "1/2 (15 ounce) can mandarin oranges, drained and juice reserved ADVERTISEMENT",
            "1 (8 ounce) can crushed pineapple, drained and juice reserved ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace pork tenderloin in a shallow 9x13-inch; sprinkle with brown sugar, chili powder, garlic powder, and black pepper. Spread pineapple preserves over tenderloin. Arrange onion, orange bell pepper, and red bell pepper on and around tenderloin. Mix reserved juice from mandarin oranges and crushed pineapple in a small bowl; pour in at least 1/2 cup reserved juice.\nBake in the preheated oven until tenderloin is no longer pink in the center, 45 to 60 minutes. Spoon mandarin oranges and pineapple over tenderloin in the last 20 minutes of cooking. An instant-read thermometer inserted into the thickest part of pork should read at least 145 degrees F (63 degrees C).\n",
        "picture_link": "GLL78eLXBYc.9G7a5DFVJGvnksRFimy"
    },
    {
        "title": "Mini Chocolate Chip Shortbread Cookies",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 (12 ounce) package miniature chocolate chips, divided ADVERTISEMENT",
            "1 tablespoon vegetable shortening ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix flour, butter, sugar, and vanilla extract in a bowl until dough is smooth. Reserve 1/4 the chocolate chips; stir remaining chips into dough until evenly distributed. Roll dough into 24 small logs and place a baking sheet.\nBake in preheated oven until slightly golden around the edges, 15 to 20 minutes. Cool in baking sheet for 10 minutes before removing to cool completely on a wire rack.\nMelt shortening in a small saucepan over medium-low heat; stir in reserved chocolate chips until melted, about 5 minutes. Dip cookies into chocolate and return to baking sheet. Refrigerate until firm.\n",
        "picture_link": "9AczGF/mLetDJW6lNSdW6nvoEMOKD4m"
    },
    {
        "title": "Stacey's Chicken and Stuffing Casserole",
        "ingredients": [
            "1 pound skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1 (10.75 ounce) can cream of celery soup ADVERTISEMENT",
            "1 (5 ounce) can evaporated milk ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1/4 cup melted butter ADVERTISEMENT",
            "8 ounces corn bread stuffing mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Boil chicken breasts in a pot of lightly salted water until no longer pink in the center and are beginning to fall apart, about 30 minutes. Remove chicken breasts from water using a slotted spoon and shred.\nPreheat oven to 350 degrees F (175 degrees C).\nMelt 1 tablespoon butter in a skillet over medium heat; cook and stir onion in the melted butter until translucent, about 10 minutes. Add shredded chicken; mix well. Pour cream of celery soup and evaporated milk into chicken mixture; spoon mixture into an 8x8-inch baking dish.\nMix chicken broth and melted butter together in a bowl. Empty cornbread stuffing mix into a large bowl; pour chicken broth mixture over stuffing. Toss to combine. Pour stuffing over chicken mixture.\nBake in the preheated oven until bubbling and stuffing is lightly browned, about 45 minutes.\n",
        "picture_link": "ElkdXRWZ6Uxh/V7J8MmNvWL2y7dF4Me"
    },
    {
        "title": "Becky's Baked Oatmeal",
        "ingredients": [
            "3 cups oatmeal ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "2 ripe bananas, mashed ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/4 cup flaxseed oil ADVERTISEMENT",
            "1/4 cup applesauce ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "2 1/4 teaspoons baking powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nStir oatmeal, eggs, bananas, milk, white sugar, flaxseed oil, applesauce, brown sugar, and baking powder together in a bowl using a spoon; pour into a square baking dish.\nBake in preheated oven until the edges begin to brown, about 40 minutes.\n",
        "picture_link": "ckcd1RHmI3HQXGBWjmrwayV5EZ87N5y"
    },
    {
        "title": "Creamy Pasta Casserole",
        "ingredients": [
            "1 (12 ounce) package farfalle (bow tie) pasta ADVERTISEMENT",
            "1/2 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 (24 ounce) jar pasta sauce ADVERTISEMENT",
            "1 teaspoon Italian seasoning ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 onion, minced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of lightly salted water to a boil. Cook the bow-tie pasta at a boil, stirring occasionally, until cooked through yet firm to the bite, about 12 minutes; drain and return pasta to pot. Melt cream cheese into the pasta. Stir pasta sauce, Italian seasoning, and red pepper flakes into the pasta mixture.\nHeat a skillet over medium heat. Break ground beef into small pieces and add to the skillet; cook and stir until some of the fat has rendered, 2 to 3 minutes. Add onion and garlic to the beef, continue cooking until the ground beef is completely browned, about 5 minutes more. Stir beef mixture into the pasta mixture.\nPour pasta-and-beef mixture into a 3-quart casserole dish. Sprinkle mozzarella cheese over the dish.\nBake in preheated oven until the mozzarella cheese melts, 5 to 10 minutes.\n",
        "picture_link": ".SbGCDcEFsS71VFq1VrXa6EcH1zW0xW"
    },
    {
        "title": "Greek Yogurt Coleslaw",
        "ingredients": [
            "1 (12 ounce) container plain nonfat Greek yogurt ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/4 cup white vinegar ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "1 tablespoon skim milk, or as needed ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 (12 ounce) packages coleslaw mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir yogurt, mayonnaise, vinegar, and honey together in a large bowl. Gradually beat milk into the yogurt mixture until you reach your desired consistency; season with salt and pepper. Add coleslaw mix and toss to coat.\nCover bowl with plastic wrap and refrigerate until chilled, about 1 hour.\n",
        "picture_link": "uSAN5il8DW/G6kIFy6SLLNk/5vCiYry"
    },
    {
        "title": "Spicy Southwest Squash Casserole",
        "ingredients": [
            "2 teaspoons olive oil ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "1/4 cup sliced fresh mushrooms ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1 (10 ounce) can diced tomatoes with green chile peppers (such as RO*TEL®) ADVERTISEMENT",
            "1 (15 ounce) can black beans, drained and rinsed ADVERTISEMENT",
            "1 cup salsa ADVERTISEMENT",
            "2 tablespoons chili powder ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 cup fresh spinach leaves, or to taste ADVERTISEMENT",
            "4 yellow squash, cubed ADVERTISEMENT",
            "1 (4 ounce) packet saltine crackers, crushed ADVERTISEMENT",
            "1 cup shredded Cheddar cheese (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nHeat olive oil in a large skillet over medium heat; cook and stir onion, red bell pepper, mushrooms, and garlic in the hot oil until vegetables are tender, about 10 minutes.\nMix tomatoes with green chile peppers, black beans, salsa, chili powder, cumin, cayenne pepper, salt, and black pepper into onion mixture; simmer, stirring occasionally, until cooked through, about 5 minutes. Add spinach; cover skillet and simmer until spinach turns bright green, 1 to 2 minutes.\nSpread squash into an 8x8-inch casserole dish; top with tomato mixture. Sprinkle crackers over tomato mixture.\nBake in the preheated oven until crackers are browned, 35 to 40 minutes. Sprinkle casserole with Cheddar cheese.\n",
        "picture_link": "wV8fieIE9drtoi6TM3Yc.v7eWS0zWvG"
    },
    {
        "title": "Bonnie's Crab Cakes",
        "ingredients": [
            "1 pound lump crabmeat ADVERTISEMENT",
            "1 1/2 tablespoons dry bread crumbs ADVERTISEMENT",
            "1 1/2 tablespoons seafood seasoning (such as Old Bay®) ADVERTISEMENT",
            "2 teaspoons chopped fresh parsley ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 tablespoons mayonnaise ADVERTISEMENT",
            "1 teaspoon Dijon mustard ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix crabmeat, bread crumbs, seafood seasoning, parsley, salt, and pepper together in a bowl.\nBeat egg with mayonnaise, and mustard in a separate bowl. Stir egg mixture into crabmeat mixture; shape into 6 patties.\nLightly grease a baking sheet. Arrange patties onto baking sheet; refrigerate 30 minutes.\nPreheat oven to 400 degrees F (200 degrees C).\nBake patties in preheated oven until golden brown, about 30 minutes.\n",
        "picture_link": "xQaM4tDXt2gCTlS1N9pN31k7Y0dN1KK"
    },
    {
        "title": "Carrot, Apple, and Zucchini Muffins",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 cup shredded unpeeled zucchini ADVERTISEMENT",
            "1 cup shredded carrots ADVERTISEMENT",
            "1 large apple, cored and shredded ADVERTISEMENT",
            "1 cup nonfat plain yogurt ADVERTISEMENT",
            "1 cup sucralose and brown sugar blend (such as Splenda® brown sugar blend) ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup unsweetened applesauce ADVERTISEMENT",
            "1/2 cup skim milk ADVERTISEMENT",
            "2 tablespoons canola oil ADVERTISEMENT",
            "1 lemon, zest only ADVERTISEMENT",
            "1 orange, zest only ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 cups whole wheat flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon ground allspice ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Coat 24 muffin cups with cooking spray.\nStir zucchini, carrots, and apple together in a large bowl. Mix in yogurt, sucralose and brown sugar blend, eggs, applesauce, skim milk, canola oil, lemon zest, and orange zest until thoroughly combined.\nWhisk all-purpose flour, whole wheat flour, baking powder, baking soda, salt, cinnamon, nutmeg, and allspice in a separate bowl. Gently stir dry ingredients into wet ingredients until just combined. Fold walnuts into batter. Pour batter into prepared muffin cups.\nBake in the preheated oven until a toothpick inserted into the center of a muffin comes out clean, 20 to 25 minutes.\n",
        "picture_link": "AeIV8xtWteFWKVVt2lGWR.GbALVIVUC"
    },
    {
        "title": "Baked Pumpkin Custard from EAGLE BRAND®",
        "ingredients": [
            "3 large eggs ADVERTISEMENT",
            "1 cup 100% pure pumpkin ADVERTISEMENT",
            "1 1/2 teaspoons pumpkin pie spice ADVERTISEMENT",
            "1 (14 ounce) can EAGLE BRAND® Sweetened Condensed Milk ADVERTISEMENT",
            "1 1/3 cups whole milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "Sweetened whipped cream ADVERTISEMENT",
            "Ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 350 degrees F. Whisk eggs in large bowl. Stir in pumpkin and pumpkin pie spice until blended. Whisk in sweetened condensed milk, milk, vanilla and salt until blended.\nPour into 6 (6-ounce) custard cups. Place custard cups in a 13 x 9-inch baking dish. Place dish on oven rack in center of oven. Pour boiling water into pan around custard cups to a depth of 1 1/4 inches.\nBake 35 minutes or until centers are almost set. Remove custard cups from baking dish and cool on wire rack. Serve warm or cold. Top with whipped cream and sprinkle with cinnamon just before serving.\n",
        "picture_link": "k1sZV5NZS07ZXauSmIR1P2TSxfJ0k12"
    },
    {
        "title": "Spicy Egg Salad English Muffins",
        "ingredients": [
            "3 hard boiled eggs, roughly chopped ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "2 teaspoons coarse-grain Dijon-style mustard ADVERTISEMENT",
            "2 teaspoons honey ADVERTISEMENT",
            "1 teaspoon prepared horseradish ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1 dash hot pepper sauce ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 English muffins, split and toasted ADVERTISEMENT",
            "4 slices Canadian-style bacon ADVERTISEMENT",
            "1/3 cup shredded pepperjack cheese ADVERTISEMENT",
            "2 tablespoons chopped green onion (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nStir eggs, mayonnaise, mustard, honey, horseradish, cayenne pepper, and hot pepper sauce together in a bowl; season with salt and black pepper.\nPlace English muffins, cut-side up, on an ungreased baking sheet. Place 1 slice Canadian bacon on each muffin. Spoon 1/4 cup of egg mixture on top of bacon and sprinkle with pepper jack cheese. Top with green onions.\nBake in preheated oven until cheese melts, 6 to 8 minutes.\n",
        "picture_link": "pTjMHVtdI6PoCwNlzkqqCbUL9kl1iM."
    },
    {
        "title": "Baked Goat Cheese Caprese Salad ",
        "ingredients": [
            "2 tablespoons olive oil, divided ADVERTISEMENT",
            "3 tablespoons basil chiffonade (thinly sliced fresh basil leaves), divided ADVERTISEMENT",
            "1 (4 ounce) log of fresh goat cheese, halved ADVERTISEMENT",
            "16 cherry tomatoes, cut in half on the diagonal ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nDrizzle about 1 1/2 teaspoons olive oil into the bottom of each 6-ounce ramekin and sprinkle about 1 tablespoon basil per ramekin over the oil. Place 1 goat cheese piece over the basil in each ramekin; surround with sliced cherry tomatoes. Top with cracked black pepper and cayenne. Spread 1 1/2 teaspoon of the remaining basil on top of each portion, place ramekins on a baking sheet, and drizzle each serving with 1 1/2 teaspoons more olive oil.\nBake in the preheated oven until bubbling, about 15 minutes. Serve warm.\n",
        "picture_link": "45bPjPckefhGG/9.28uKjw9MYihcfKS"
    },
    {
        "title": "Easy Omelet in a Bag",
        "ingredients": [
            "2 extra large eggs ADVERTISEMENT",
            "2 tablespoons crumbled cooked bacon ADVERTISEMENT",
            "2 tablespoons shredded Cheddar cheese ADVERTISEMENT",
            "2 teaspoons diced onion ADVERTISEMENT",
            "1 teaspoon diced bell pepper ADVERTISEMENT",
            "1 teaspoon thinly sliced mushroom ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon ground paprika ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1 pinch salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put eggs, bacon, Cheddar cheese, onion, bell pepper, mushrooms, black pepper, paprika, garlic powder, and salt in a resealable sandwich bag; seal. Shake vigorously until thoroughly mixed. Squeeze out any excess air and reseal.\nBring a pot of water to a boil. Place bag in the boiling water; cook until egg is completely cooked, about 13 minutes. Remove bag using tongs or a large strainer. Carefully open bag and roll omelet onto a plate.\n",
        "picture_link": "6t7Mcd6r4DzI/aL/q2LmoBvyFGYxG1S"
    },
    {
        "title": "Baked Corn on the Cob",
        "ingredients": [
            "1 quart water, or as needed ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup salt ADVERTISEMENT",
            "2 ears corn ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir water, sugar, and salt together until the sugar and salt dissolves in a container large enough to hold the corn.\nSubmerge corn in the brine; soak at least 1 hour.\nPreheat oven to 350 degrees F (175 degrees C).\nRemove corn from the brine, shake to remove excess liquid, and cook directly on an oven rack for 1 hour.\n",
        "picture_link": "g6hVlQ8qSHrCJPtD2L5gjRKE01If2nW"
    },
    {
        "title": "Curry Fish and Rice",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "1/4 cup diced onion ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 1/2 teaspoons curry powder ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "3/4 cup white rice ADVERTISEMENT",
            "2 frozen white fish fillets, unthawed ADVERTISEMENT",
            "2 tablespoons sliced almonds ADVERTISEMENT",
            "1 cup frozen peas, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat water, onion, butter, curry powder, and salt in a large skillet over medium heat until butter is melted, about 2 minutes. Stir rice into onion mixture and arrange frozen white fish over rice. Sprinkle with almonds.\nReduce heat to medium-low, cover, and simmer until the rice is tender and the liquid has been absorbed, about 20 minutes. Fish should be heated through, and the flesh should be opaque and flake easily. Mix in peas and fluff rice with a fork before serving.\n",
        "picture_link": "7koAbsJPIzr0XP3.ZynEFv1UKT13iCG"
    },
    {
        "title": "Roasted Zucchini Casserole",
        "ingredients": [
            "3 zucchinis, sliced ADVERTISEMENT",
            "2 onions, sliced ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 (16 ounce) package penne pasta ADVERTISEMENT",
            "1 (28 ounce) jar marinara sauce ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nToss zucchinis and onions in a large bowl with olive oil until evenly coated. Spread vegetables into a large baking dish.\nRoast vegetables in the preheated oven until golden, about 30 minutes. Season with salt and pepper. Reduce oven heat to 350 degrees F (175 degrees C).\nFill a large pot with lightly salted water and bring to a boil. Stir in penne and return to a boil. Cook pasta uncovered, stirring occasionally, until cooked through but still firm to the bite, about 11 minutes; drain.\nLightly grease a 9x13-inch baking dish.\nHeat marinara sauce in a saucepan over medium heat until sauce is hot. Spread hot marinara sauce into the prepared baking dish, followed by penne pasta and zucchini mixture. Sprinkle Parmesan cheese atop vegetables.\nBake in the preheated oven until sauce is bubbly, 35 to 40 minutes. Allow casserole to rest for 5 minutes before serving.\n",
        "picture_link": "pLFPD.bUPw./waciQdM9R5Dlz7jV/.m"
    },
    {
        "title": "Homemade Garlic Basil Mayonnaise",
        "ingredients": [
            "1 cup fresh basil leaves ADVERTISEMENT",
            "2 egg yolks ADVERTISEMENT",
            "3 cloves garlic, finely minced ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "3/4 teaspoon salt, or to taste ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "1 teaspoon Dijon mustard ADVERTISEMENT",
            "1 1/2 cups vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a saucepan of water to a boil. Prepare a bowl of ice water and have it standing nearby.\nPlace basil leaves into boiling water and blanch until leaves are bright green and slightly soft, about 10 seconds. Remove basil leaves with a fine mesh strainer and place into ice water to stop the cooking process. Drain basil, wrap in a paper towel, and gently squeeze to remove excess moisture.\nPlace egg yolks into a container with a base slightly larger than the base of a stick blender, such as a measuring cup or large beer glass. Add garlic, lemon juice, salt, cayenne pepper, black pepper, basil leaves, and Dijon mustard to egg yolks. Pour vegetable oil over the top.\nPush stick blender all the way to the bottom of the container. Pulse blender 6 or 8 times, about 1 second per time, until mixture begins to emulsify on the bottom. Once mayonnaise begins to form, raise the stick blender slightly in the container and continue to blend until all oil has run through the blender, mayonnaise is thick, and basil is finely chopped, 10 to 20 more seconds. Taste and adjust seasonings. Transfer to a bowl. Mayonnaise will keep, refrigerated, for 2 to 3 days.\n",
        "picture_link": "oWwGLPoHXmrDP/4Gsh4FVCuk4fj6BdK"
    },
    {
        "title": "Quick-and-Easy Steak Marinade",
        "ingredients": [
            "2 (8 ounce) boneless rib-eye steaks ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 pinch garlic powder, or to taste ADVERTISEMENT",
            "1 pinch Montreal steak seasoning, or to taste ADVERTISEMENT",
            "Marinade: ADVERTISEMENT",
            "1/3 cup extra virgin olive oil ADVERTISEMENT",
            "1/3 cup Worcestershire sauce ADVERTISEMENT",
            "1/3 cup soy sauce ADVERTISEMENT",
            "1/3 cup balsamic vinegar ADVERTISEMENT",
            "3 tablespoons Dijon mustard ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "1 dash liquid smoke flavoring ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place steaks in a flat baking dish or container. Cut slits at 1-inch intervals in the fat around the edges of the steaks. Gently pierce both sides of each steak a few times with a fork.\nSprinkle each steak with salt, pepper, garlic powder, and Montreal steak seasoning. Pat seasonings into steaks.\nWhisk olive oil, Worcestershire sauce, soy sauce, balsamic vinegar, Dijon mustard, garlic, and liquid smoke together in a bowl. Pour marinade over steaks to coat. Cover container or baking dish with plastic wrap and marinate steaks in the refrigerator for 2 hours. Turn steaks over and marinate for another 2 hours.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate.\nCook the steaks on the preheated grill until they start to firm, and are reddish-pink and juicy in the center, 8 to 10 minutes per side for medium-rare. An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C).\n",
        "picture_link": "RuIYJ1x26gfM1D4jwLZQR7f/0TOthlS"
    },
    {
        "title": "Blueberry Yogurt Pound Cake",
        "ingredients": [
            "1 (18.25 ounce) package yellow cake mix with pudding included ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1 cup low-fat vanilla yogurt ADVERTISEMENT",
            "1/2 cup applesauce ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 teaspoon maple flavoring ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon, plus more for dusting ADVERTISEMENT",
            "1 1/2 cups blueberries ADVERTISEMENT",
            "1/4 cup confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 10-inch fluted tube pan (such as Bundt(R)).\nMix cake mix and brown sugar together in a bowl; add yogurt, applesauce, water, vegetable oil, eggs, maple flavoring, and cinnamon. Beat on low speed with an electric hand mixer until blended. Scrape bowl and beat on medium speed for 4 more minutes.\nToss blueberries with enough cinnamon to evenly dust each berry in a bowl. Fold blueberries into the batter. Pour batter into the prepared pan.\nBake in the preheated oven until a toothpick inserted in the center of the cake comes out clean, 55 to 60 minutes. Let cool in pan for 10 minutes, then turn out onto a wire rack to cool completely. Dust with confectioners' sugar.\n",
        "picture_link": "15E2xLQaTMESCQlYFqRdSQy3aPSjAzK"
    },
    {
        "title": "Very Veggie and Beef Chili",
        "ingredients": [
            "1 pound lean ground beef ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 yellow bell pepper, chopped ADVERTISEMENT",
            "1 carrot, diced ADVERTISEMENT",
            "1 zucchini, diced ADVERTISEMENT",
            "1 yellow squash, diced ADVERTISEMENT",
            "1 (28 ounce) can crushed tomatoes ADVERTISEMENT",
            "1 (16 ounce) can kidney beans, rinsed and drained ADVERTISEMENT",
            "1 (16 ounce) can black beans, rinsed and drained ADVERTISEMENT",
            "1 (15 ounce) can diced tomatoes ADVERTISEMENT",
            "1 cup frozen white corn kernels ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1 1/4 tablespoons chili powder ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon ground cayenne pepper ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Break ground beef into small pieces into a large pot over medium heat; cook and stir until beginning to brown, 3 to 5 minutes. Add onion, green bell pepper, yellow bell pepper, and carrot to ground beef; cook and stir until the vegetables begin to soften, 5 to 7 minutes. Stir zucchini and yellow squash into the beef mixture; continue cooking until the beef is completely browned, 3 to 5 minutes more. Drain excess liquid from the pot and return to medium heat.\nStir crushed tomatoes, kidney beans, black beans, diced tomatoes, corn, and garlic into the beef mixture; bring to a boil. Season mixture with chili powder, brown sugar, paprika, oregano, cayenne pepper, cumin, salt, and black pepper.\nReduce heat to low, place a cover on the pot, and cook chili at a simmer for 30 minutes.\n",
        "picture_link": "YOg.KWfZm3AKta/wFHN0S3Ow2Zmbx.G"
    },
    {
        "title": "Italian-Style Strawberry Shortcake  ",
        "ingredients": [
            "1 quart ripe strawberries, sliced ADVERTISEMENT",
            "1/3 cup white sugar, or to taste ADVERTISEMENT",
            "1 (8 ounce) container mascarpone cheese ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping (such as Cool Whip®), thawed ADVERTISEMENT",
            "1 (10 inch) prepared angel food cake, torn into bite-size pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Set aside a few pretty strawberry slices for garnish; sprinkle remaining strawberries with sugar in a bowl and let stand for 10 minutes for juice to form.\nMix mascarpone cheese and whipped topping together in a separate bowl. Place torn pieces of angel food cake into a trifle dish; spread strawberries and their juice on cake pieces and top with mascarpone mixture. Decorate with retained strawberry slices. Refrigerate until serving time.\n",
        "picture_link": "h5eTaUBgidsuJ20Q9s/ql8EkWzTUPIy"
    },
    {
        "title": "Gyros",
        "ingredients": [
            "1/4 cup chopped red onion ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1 tablespoon dried marjoram ADVERTISEMENT",
            "1 tablespoon ground dried rosemary ADVERTISEMENT",
            "2 teaspoons kosher salt ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1 pound 93%-lean ground beef ADVERTISEMENT",
            "1 pound ground lamb ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nProcess red onion in a food processor until finely minced. Scoop onion into a piece of cheesecloth and squeeze as much moisture from the onion as possible. Return onion to food processor; add garlic and process until the garlic is well integrated. Blend marjoram, rosemary, kosher salt, and black pepper into the onion mixture.\nGradually blend ground beef and ground lamb with the onion and seasoning mixture by alternately adding small amounts of each meat to the mixture and processing until well incorporated before adding the next batch.\nFirmly pack the meat mixture into a loaf pan, assuring no air pockets are trapped in the meat.\nBake in the preheated oven until no longer pink in the center, about 75 minutes. An instant-read thermometer inserted into the center should read at least 175 degrees F (80 degrees C). Drain grease and slice thinly to serve.\n",
        "picture_link": "clMKK9DrX9KgCOu76yLRjvnUOQNROIe"
    },
    {
        "title": "Rancheros",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1 cup shortening ADVERTISEMENT",
            "1 1/4 cups packed brown sugar ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3/4 cup shredded coconut ADVERTISEMENT",
            "2 cups quick cooking oats ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "3/4 cup chopped peanuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nSift together flour, salt, baking soda and baking powder and set aside.\nCream together shortening, brown sugar and white sugar until light and fluffy. Beat in eggs, vanilla and coconut.\nAdd sifted ingredients and mix well. Stir in oatmeal, chocolate chips and nuts. Mix thoroughly.\nDrop by teaspoonful onto ungreased baking sheets. Bake for 8--12 minutes until golden brown.\n",
        "picture_link": "a8Uwf701WEZaYDBLkSnptCqhzEEUuZy"
    },
    {
        "title": "Olga's Potica",
        "ingredients": [
            "1 1/2 teaspoons active dry yeast ADVERTISEMENT",
            "1/4 cup milk, lukewarm ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "4 tablespoons white sugar ADVERTISEMENT",
            "6 egg yolks ADVERTISEMENT",
            "5 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 1/3 cups milk ADVERTISEMENT",
            "1 cup butter, melted ADVERTISEMENT",
            "12 ounces honey ADVERTISEMENT",
            "2 cups raisins ADVERTISEMENT",
            "1 1/2 pounds chopped walnuts ADVERTISEMENT",
            "1 pinch ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease one large baking sheet.\nDissolve yeast in 4 tablespoons lukewarm milk. Add 1 teaspoon sugar and 3 tablespoons flour. Stir well and set aside.\nCream 1 cup butter with 4 tablespoons sugar. Add egg yolks, one at a time. Add yeast mixture and mix well.\nAdd 5 cups sifted flour, salt and 1 1/3 cup milk and beat well. Beat dough for 10 minutes or until bubbles form. Cover with flour and let rise 2 hours.\nCut dough in half and roll out each half as thin as possible on floured board. Spread each half with melted butter, honey, raisins, walnuts and douse with cinnamon.\nRoll up like jelly roll, place on baking sheet, allow to rise and bake for one hour.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Potato Casserole I",
        "ingredients": [
            "2 (2 pound) packages frozen hash brown potatoes ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed cream of chicken soup ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "2 tablespoons chopped fresh chives ADVERTISEMENT",
            "1/4 pound butter, melted ADVERTISEMENT",
            "1 (8 ounce) container sour cream ADVERTISEMENT",
            "1/2 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "1 tablespoon bacon bits (optional) ADVERTISEMENT",
            "1/2 cup crushed potato chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a six quart casserole dish, mix together the hashbrowns, onion, chicken soup, mushroom soup, chives, butter, sour cream and cheese. Bake covered for 45 minutes.\nRemove from oven, sprinkle with bacon and potato chips. Bake uncovered for 15 to 25 minutes.\n",
        "picture_link": "ZdO2zC9E8ffk0fM3OwY4fvaLpMZQH/O"
    },
    {
        "title": "Jesse's Toffee Bars",
        "ingredients": [
            "6 graham crackers ADVERTISEMENT",
            "1 cup blanched slivered almonds ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup packed light brown sugar ADVERTISEMENT",
            "11 (1.55 ounce) bars milk chocolate candy bar, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat over to 400 degrees F (200 degrees C). Spray 11 x 15 inch jelly roll pan with non-stick spray.\nCompletely cover with a single layer of graham crackers. Sprinkle with almonds.\nCombine butter, vanilla, and brown sugar in a heavy saucepan. Place over medium heat and bring to a full boil, stirring constantly. Boil for 1 minute.\nCarefully pour evenly over crackers (this mixture is hot!). Bake for 8 minutes. Let cool for 3 to 4 minutes.\nEvenly space chocolate bars over cracker/toffee mixture. Wait 1 minute and spread chocolate to cover. When completely cool, cut into 2 inch squares or break into pieces.\n",
        "picture_link": "/rTjGrFRYwcPnSUOVjrXehb7L9IQo26"
    },
    {
        "title": "Spanish Chicken",
        "ingredients": [
            "2 pounds boneless chicken thighs ADVERTISEMENT",
            "1 quart boiling water ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "5 onions, cut into 2 inch pieces ADVERTISEMENT",
            "5 large green bell peppers, cut into 2 inch pieces ADVERTISEMENT",
            "1 (8 ounce) jar chili sauce ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "1 cup ketchup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken in a large slow cooker. Pour in enough boiling water to completely cover the chicken, and add 1/2 teaspoon salt. Cover, and set slow cooker to HIGH. Cook until the chicken meat turns white.\nAdd the peppers and onions. Simmer until peppers and onions get a little tender, about 10 minutes. Stir in tomato sauce, chili sauce, and ketchup. Cover, set slow cooker to LOW, and cook for about 6 hours.\n",
        "picture_link": "5R8tl21VllMo.12J5VF8ZvXAflKa2ay"
    },
    {
        "title": "Shortbread Wheels",
        "ingredients": [
            "1 1/8 cups all-purpose flour ADVERTISEMENT",
            "1/4 cup super fine sugar ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 tablespoon cocoa ADVERTISEMENT",
            "1 tablespoon sweet chocolate, grated ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F(175 degrees C).\nSift all but 2 tablespoons of flour into a bowl, then add the sugar. Rub, or cut in butter until the mixture is crumbly. Divide in half. Work in the remaining 2 tablespoons of flour to one half, then the cocoa and ground chocolate to the other half. Knead each portion well with your fingers to form a smooth dough.\nTurn onto a lightly dusted with cornstarch surface, and roll out each portion to 1/4 inch thick circles. Using a 2 1/2 inch round cookie cutter, cut out 7 circles from each piece of rolled out dough. Out of these circles, cut two more circles, one 1 1/4 inch, and one 3/4 inch. Now you should have fourteen 2 1/2 inch rings, fourteen 1 1/2 inch rings and fourteen 3/4 inch circles.\nConstruct wheels on greased baking sheets by starting with the largest rings, then alternating the colors to fill in. You should end up with 7 cookies that have a chocolate ring on the outside, a plain ring in the middle and a chocolate circle in the center; and 7 cookies that have a plain ring on the outside, a chocolate ring in the middle and a plain circle in the center.\nBake for 12 minutes. Leave on sheets for 2 minutes, then remove with a flat knife. Cool completely on wire racks.\n",
        "picture_link": "J9XQOdApM0OmiTSufirY0ISJsTgDNIm"
    },
    {
        "title": "Hawaiian Macadamia-Coconut Squares",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "2 cups packed brown sugar ADVERTISEMENT",
            "1 tablespoon instant coffee powder ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 cups flaked coconut ADVERTISEMENT",
            "2 cups chopped and toasted macadamia nuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (170 degrees C). Grease a 9 X 13 inch baking pan; set aside.\nIn a large mixing bowl, beat butter, 1 cup brown sugar, instant coffee powder, 1/4 teaspoon cinnamon and 1/4 teaspoon salt until light and fluffy.\nStir in flour 1/2 cup at a time, blending well after each addition. Spread evenly in prepared pan.\nBake 20 minutes. Cool in pan on rack 15 minutes.\nIn a large bowl, beat eggs and vanilla with remaining 1 cup brown sugar, 1/4 teaspoon cinnamon and 1/4 teaspoon salt. Stir in coconut and macadamias.\nSpread evenly over cooled baked layer. Bake 40 to 50 minutes, or until golden brown and firm to the touch.\nUse a knife to loosen cookies around edges while warm. Cool completely in pan on rack. Cut into 48 (about 1 1/2 inch) squares, cutting 6 strips one way and 8 strips the other way. Store in an airtight container at room temperature 1 week; freeze for longer storage.\n",
        "picture_link": "qHOwqej8ujUwJ.UYGe5LeDqvZ0Wx7XO"
    },
    {
        "title": "Chocolate Crinkles I",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "4 (1 ounce) squares unsweetened chocolate ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/3 cup confectioners' sugar for decoration ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter and chocolate either in a microwave or over low heat on the stove. Allow to cool slightly.\nStir in remaining ingredients, except powdered sugar. Mix well.\nCover dough and chill for 30 minutes.\nPreheat oven to 300 degrees F (150 degrees C).\nShape dough into 1 inch balls. Roll in powdered sugar to coat heavily. Place 2 inches apart on an ungreased cookie sheet. Bake for 15 to 18 minutes or until edges are set. Remove from cookie sheet and cool on rack.\n",
        "picture_link": "wuyPmT6I4ChWzOh8BysG.AMHUyc.QVO"
    },
    {
        "title": "Aunt Mazo's Dessert",
        "ingredients": [
            "4 (14 ounce) cans sweetened condensed milk ADVERTISEMENT",
            "4 pints heavy whipping cream ADVERTISEMENT",
            "1 (4 ounce) jar maraschino cherries ADVERTISEMENT",
            "1 cup chopped almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Remove labels from the cans of milk and put them unopened into a large pot of gently boiling water. Boil for about 3 hours. Make sure the water doesn't boil away or the cans will explode (or so I'm told).\nAfter 3 hours, take the cans out and cool in fridge.\nWhen chilled, open the cans and put the results into a bowl.\nBeat the whipping cream, and fold into the \"caramel sauce\" (cooked, cooled condensed milk). Mix in the nuts and cherries.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Roast Goose with Stuffing",
        "ingredients": [
            "10 slices French bread, cut into cubes ADVERTISEMENT",
            "1 cup dried currants ADVERTISEMENT",
            "4 apples - peeled, cored and sliced ADVERTISEMENT",
            "1 tablespoon dried thyme ADVERTISEMENT",
            "4 tablespoons butter, melted ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 (10 pound) goose ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 carrot, chopped ADVERTISEMENT",
            "1 stalk celery, chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "3 whole cloves ADVERTISEMENT",
            "1 sprig fresh thyme ADVERTISEMENT",
            "1 sprig fresh marjoram ADVERTISEMENT",
            "1/4 cup white wine ADVERTISEMENT",
            "1 teaspoon tomato paste ADVERTISEMENT",
            "1 (10.5 ounce) can condensed chicken broth ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine bread, currants, apples, crumbled thyme, salt, pepper, and melted butter or margarine.\nWash goose inside and out. Pat dry. Stuff, truss, and tie goose. Prick bird all over with fork.\nHeat oil in roasting pan on top of stove. Brown goose lightly on all sides, then drain off pan drippings. Set goose breast side up in roasting pan. Add a little water, cover, and roast at 375 degrees F (190 degrees C) for one hour. Discard fat from roasting pan.\nIn a mixing bowl, combine chopped onion, carrot, celery, garlic, bay leaf, cloves, fresh thyme and marjoram, and sprinkle around the goose. Continue roasting uncovered for 20 to 25 minutes per pound, draining off fat at intervals. Add more water as required. Transfer cooked goose to platter, and keep warm by covering loosely with foil.\nSkim off remaining fat in pan, and heat drippings and vegetables on top of stove until mixture is reduced. Stir in white wine, tomato paste, and chicken broth. Simmer for 10 to 15 minutes, then strain gravy. If necessary, add a little cornstarch mixed with water to thicken gravy.\n",
        "picture_link": "u.TupIRNMB3YTlBTaNTduAAFhX8FZdS"
    },
    {
        "title": "Zippy Chocolate Chip Cookies",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground white pepper ADVERTISEMENT",
            "3 cups semisweet chocolate chips ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (180 degrees C).\nCream butter or margarine and sugars. Add already beaten eggs and vanilla.\nMix dry ingredients together and mix with creamed mixture. Add chocolate chips and nuts.\nBake 8 to 10 minutes until done. These are not HOT HOT -- Just a little surprise, definitely a little kick, goes well with the chocolate.\n",
        "picture_link": "CIG3DjiO4BhSqCDfBJ4RRDlhfHYj.Bq"
    },
    {
        "title": "Lime Salad",
        "ingredients": [
            "1 (6 ounce) package lime flavored Jell-O® mix ADVERTISEMENT",
            "3/4 cup boiling water ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3/4 cup cold water ADVERTISEMENT",
            "1 cup shredded cabbage ADVERTISEMENT",
            "1/2 cup grated carrots ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dissolve gelatin mix in boiling water. Stir in salt. Stir in cold water. Chill until slightly thickened.\nFold cabbage, carrots, and nuts into thickened gelatin. Pour mixture into an 8 inch mold that has been sprayed with a non-stick spray. Chill until firm.\nSet mold in a sink of hot water for a few seconds when ready to unmold. Place serving plate on top of mold, and turn over. Lift off mold.\n",
        "picture_link": "vIFeio0o66jVjxbz4O.65mzfzNsb0om"
    },
    {
        "title": "Simple Sugar Cookies",
        "ingredients": [
            "1/3 cup white sugar ADVERTISEMENT",
            "1/3 cup shortening ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2/3 cup honey ADVERTISEMENT",
            "1 teaspoon lemon extract ADVERTISEMENT",
            "2 3/4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease cookie sheets.\nMix sugar, shortening, egg, honey, and lemon extract.\nStir in remaining ingredients and mix well.\nRoll dough 1/4 inch thick. Use cookie cutters to cut into desired shapes. Place 1 inch apart on lightly greased cookie sheet. Bake 7 to 8 minutes or until no indentation remains when touched. Cool and decorate.\n",
        "picture_link": "IrzHmKoimbqBEhN8ncq.fj4jnxdc2Te"
    },
    {
        "title": "Cheese Corn Casserole",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "1 cup sliced onion ADVERTISEMENT",
            "1 (8.5 ounce) package corn bread mix ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 cup cream-style corn ADVERTISEMENT",
            "1 dash hot pepper sauce ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray one 10x10 inch pan with non-stick cooking spray.\nina medium skillet, saute onions in butter over medium heat until soft; set aside.\nIn a medium sized bowl, combine corn muffin mix, milk, corn and hot sauce.\nPour cornbread into baking dish and layer with onions, followed by sour cream and cheese.\nBake for 25 to 30 minutes, cover for last 15 minutes.\n",
        "picture_link": "0VRCLQE4o7v4fYsyI4gpneiZc8GLwNq"
    },
    {
        "title": "Oatmeal Cinnamon Drops",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 tablespoon molasses ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "2 cups quick cooking oats ADVERTISEMENT",
            "1/2 cup semisweet chocolate chips ADVERTISEMENT",
            "2/3 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F. Grease cookie sheets.\nCream together the butter and sugar. Add eggs, molasses and vanilla.\nIn a separate bowl, combine the flour, cinnamon, and baking soda. Gradually add to the cream mixture.\nStir in oatmeal, raisins, nuts and chocolate chips.\nDrop by teaspoonfuls onto greased cookie sheet. Bake for 12 minutes or until light brown.\n",
        "picture_link": "tNkFm4sglHmZoN6TWou1RKgj8bHrq6O"
    },
    {
        "title": "Drop Nut Cookies",
        "ingredients": [
            "1 cup shortening ADVERTISEMENT",
            "2 cups packed brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 cup sour milk ADVERTISEMENT",
            "3 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons cream of tartar ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCream together the shortening and the sugar. Add the eggs and beat for 2 minutes. Beat in the vanilla, salt, sour milk, flour, cream of tartar, baking soda and cinnamon. Stir in the chopped walnuts. Drop cookies 3 inches apart on a baking sheet.\nBake at 350 degrees F (175 degrees C) for 12 minutes. Chopped dates can be added for extra flavor.\n",
        "picture_link": "gWR9Q.DI00Iq1w0wvgGzOIYEbsQK0Pq"
    },
    {
        "title": "Greek Egg Biscuits",
        "ingredients": [
            "2 cups unsalted butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "5 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3 tablespoons baking powder ADVERTISEMENT",
            "1/4 cup sesame seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In large mixing bowl, beat butter until light and fluffy. Add the sugar and beat for 10 minutes on medium speed. Add four of the eggs, one at a time, and beat well after each addition. Beat in the vanilla. Combine the flour, baking powder, and salt in a separate bowl. Add to the butter mixture and stir to form soft, cohesive dough. Add flour if dough is too soft to handle easily.\nPreheat oven to 350 degrees F. Grease cookie sheets\nLightly flour a work surface. Break off 1 inch lumps of dough and roll on floured surface into ropes about 7 inches long and 1/4 inch in diameter. Cross the ends and twirl dough in a loop in the opposite direction, forming a braid. Place on cookie sheets about 1 inch apart.\nBeat remaining egg. Brush onto braids for glaze and sprinkle with sesame seeds. Bake 20 to 25 minutes. Let cool on cookie sheets for 10 minutes, then remove to racks to cool completely.\n",
        "picture_link": "k6Pt2RqsZVOqx.DVJ7Val1OYe7Wo1IG"
    },
    {
        "title": "Rich Dark Fruitcake",
        "ingredients": [
            "6 cups sultana raisins ADVERTISEMENT",
            "3 cups dried currants ADVERTISEMENT",
            "1 1/2 cups pitted dates ADVERTISEMENT",
            "6 cups raisins ADVERTISEMENT",
            "3 cups candied mixed citrus peel ADVERTISEMENT",
            "1/2 pound candied cherries ADVERTISEMENT",
            "2 cups almonds ADVERTISEMENT",
            "2 cups butter ADVERTISEMENT",
            "3 1/4 cups all-purpose flour ADVERTISEMENT",
            "3 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 teaspoons ground allspice ADVERTISEMENT",
            "4 teaspoons ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1 tablespoon almond extract ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "12 egg yolks ADVERTISEMENT",
            "1/2 cup molasses ADVERTISEMENT",
            "12 egg whites ADVERTISEMENT",
            "1/2 cup grape juice ADVERTISEMENT",
            "1/2 cup strong brewed coffee ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Wash and dry the raisins and the currants. Wash, dry, pit, and chop the dates. Chop the raisins and the citrus peel. Slice the cherries. Blanch the almonds, and slice them lengthwise. Combine fruits and nuts in large bowl.\nGrease and line 3 standard Christmas cake pans (these round pans are at least 3 inches deep and come in a set of three sizes- 5, 7, and 9 inch across) with 4 layers of heavy waxed paper, or 3 layers of brown paper. Grease again. Preheat oven to 275 degrees F (135 degrees C).\nSift together flour, baking powder, soda, salt, and spices onto a piece of waxed paper. Remove 1 cup of this flour mixture, and combine with fruit and nuts. Mix until fruit is well coated.\nCream the butter until fluffy. Add extracts. Gradually add sugar, mixing until creamy. Beat egg yolks until light and lemon-colored, and beat into the butter mixture. Stir in the molasses, and beat together well. Add half of the remaining flour mixture, and blend thoroughly.\nBeat egg whites until stiff but not dry; fold into batter. Stir in lightly the remaining flour mixture alternately with combined fruit juice and coffee. Add floured fruit and nuts, blending in until fruit is well distributed.\nTurn batter into prepared cake tins, filling each about 2/3 full and spreading batter evenly. Bake in center of oven. Bake small cake 2 1/2 hours, medium cake 3 1/2 hours, and large cake 4 to 4 1/2 hours. Remove from oven and allow to stand 5 minutes, then turn out on wire rack to cool.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Linguine with Clams and Porcini Mushrooms",
        "ingredients": [
            "1 ounce dried porcini mushrooms ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "10 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon dried red pepper flakes ADVERTISEMENT",
            "36 fresh clams, cleaned ADVERTISEMENT",
            "2 cups dry white wine ADVERTISEMENT",
            "4 tomatoes, cubed ADVERTISEMENT",
            "3 (8 ounce) jars clam juice ADVERTISEMENT",
            "1 1/2 cups chopped fresh parsley ADVERTISEMENT",
            "1 (16 ounce) package linguine pasta ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Soak mushrooms 20 to 30 minutes in cold water to rehydrate. Dry, and coarsely chop.\nHeat oil in a medium saucepan over medium heat. Stir in mushrooms, garlic, and red pepper. Cook until browned. Stir in clams and white wine. As clams open, remove to a medium bowl, discarding those that remain closed.\nMix tomatoes, clam juice, and parsley into the mushroom mixture. Simmer until slightly thickened, about 15 minutes.\nBring a large pot of lightly salted water to a boil. Add linguine, and cook for 8 to 10 minutes or until al dente; drain.\nReturn clams to the broth mixture and cook until heated through. Thoroughly mix in cooked linguine just before serving.\n",
        "picture_link": "EiX27BnsuhbKJXDmvPQkNXpWQxbmrTS"
    },
    {
        "title": "Flax Seed Carrot Cake",
        "ingredients": [
            "3 egg whites ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "1/4 cup nonfat milk ADVERTISEMENT",
            "1/3 cup applesauce ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 teaspoon almond extract (optional) ADVERTISEMENT",
            "1 1/3 cups whole wheat flour ADVERTISEMENT",
            "2/3 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons ground flax seed ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/3 cup chopped walnuts ADVERTISEMENT",
            "1/4 cup raisins ADVERTISEMENT",
            "1/2 (8 ounce) can crushed pineapple, drained ADVERTISEMENT",
            "1 cup grated carrot ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly oil a 9x5 inch loaf pan with vegetable cooking spray.\nWhisk together the egg whites, sugar, milk, applesauce, vanilla, and almond extract in a small bowl; mix until well blended. In a large bowl, sift together the flour, whole wheat flour, flax seed, cinnamon, nutmeg, cloves, and baking soda. Mix the egg into the flour; stir until well blended. Fold in the walnuts, raisins, carrot, and drained pineapple. Pour batter into the prepared pan.\nBake in preheated oven until a toothpick inserted into the center comes out clean (but not necessarily dry), about 40 minutes. Set aside to cool for 10 to 20 minutes before refrigerating overnight.\n",
        "picture_link": "besu5CmDAIjkRDs6asow6V1TsWCfQqe"
    },
    {
        "title": "Indonesian Fried Rice",
        "ingredients": [
            "1/2 cup uncooked long grain white rice ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "2 teaspoons sesame oil ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 green chile pepper, chopped ADVERTISEMENT",
            "1 small carrot, sliced ADVERTISEMENT",
            "1 stalk celery, sliced ADVERTISEMENT",
            "2 tablespoons kecap manis ADVERTISEMENT",
            "2 tablespoons tomato sauce ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "1/4 cucumber, sliced ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring the rice and water to boil in a pot. Cover, reduce heat to low, and simmer 20 minutes.\nHeat the oil in a wok, and cook the onion, garlic, and green chile until tender. Mix in the carrot and celery. Stir in the rice, and mix in kecap manis, tomato sauce, and soy sauce. Continue cooking about 1 minute, until heated through. Transfer to bowls, and garnish with cucumber slices.\nPlace eggs in the wok, and cook until set. Place in the bowls over the rice and vegetables.\n",
        "picture_link": "mRg8vEGjvQdu01i07C2D8aRvO8Jlfgu"
    },
    {
        "title": "Red Snapper Baked Alaska Style",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "2 pounds red snapper fillets ADVERTISEMENT",
            "salt and white pepper to taste ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "Dijon mustard ADVERTISEMENT",
            "1 teaspoon dried tarragon ADVERTISEMENT",
            "3 tablespoons fresh bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Spread butter into the bottom of a 9x13 inch baking dish. Arrange fish fillets in a single layer over the bottom of the pan, and sprinkle with salt and pepper.\nBake for about 12 minutes in the preheated oven. Meanwhile, whip egg whites in a clean dry bowl until stiff peaks form. Fold in the parsley, mustard and tarragon. Spread the egg white mixture over the fish in a layer about 1 inch thick. Sprinkle bread crumbs over the top.\nReturn to the oven, and bake for about 6 more minutes, or until meringue is golden, and fish flakes with a fork.\n",
        "picture_link": "EhfWfL2LHLz38qFTMVfPsckOZCpCOAe"
    },
    {
        "title": "Carrot Ring",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 cups grated carrots ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9 inch ring mold.\nIn a medium bowl, cream together butter and brown sugar. Blend in eggs and lemon juice. Gradually mix in flour, baking powder, baking soda, and salt. Fold in carrots. Transfer the mixture to the prepared ring mold.\nBake 40 minutes in the preheated oven, until a knife inserted in the center comes out clean.\n",
        "picture_link": "FHmzpmEeSy2QYbUu7y/NYRbrOgLFxdO"
    },
    {
        "title": "Green Eggs and Ham Breakfast Sandwich",
        "ingredients": [
            "1 (10 ounce) container refrigerated extra large biscuit dough ADVERTISEMENT",
            "1/2 pound sliced bacon ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1/2 medium onion, chopped ADVERTISEMENT",
            "1 jalapeno pepper, seeded and chopped ADVERTISEMENT",
            "4 roasted green chile peppers, seeded and chopped ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon pepper ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 cup shredded Monterey Jack cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare biscuits according to the directions on the package. Place bacon in a large, deep skillet. Cook over medium-high heat until evenly brown. Drain, and set aside.\nHeat olive oil in a large skillet over medium heat. Add onion, jalapeno, green chile, salt, and pepper. Fry, stirring, until onions are soft. Whisk together the eggs and milk; pour into the skillet. Stir frequently until eggs are scrambled and cooked through.\nSplit biscuits in half. Place some of the scrambled egg mixture on the bottom half, criss-cross two slices of bacon over the eggs, then top with shredded Monterey Jack cheese. Place the other half of the biscuits on the top, and serve.\n",
        "picture_link": "fUPiy6k8ugUdJJrtoZyJUH4PKLcf6oG"
    },
    {
        "title": "Frikadeller (Danish Meatballs)",
        "ingredients": [
            "1/2 pound ground veal ADVERTISEMENT",
            "1/2 pound ground pork ADVERTISEMENT",
            "1/4 cup milk, or as needed ADVERTISEMENT",
            "1/4 cup finely grated onion ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup bread crumbs, or as needed ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup seltzer water ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/4 cup margarine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the veal and pork together in a bowl, and stir in the milk, onion, and egg. Mix the bread crumbs into the meat. Sprinkle in the flour, and knead well to mix. Stir in the seltzer water, season to taste with salt and pepper, and mix well. The mixture should be very moist, but not dripping.\nChill the meat mixture for 15 to 30 minutes in the refrigerator, to make the meatballs easier to form.\nHeat the margarine in a large skillet over medium heat.\nTo form meatballs, scoop up about 2 1/2 tablespoons of meat mixture with a large spoon, and form the mixture into a slightly flattened, oval meatball about the size of a small egg. Place the meatballs into the heated skillet, and fry for about 15 minutes per side, until the meatballs are well-browned and no longer pink in the center.\n",
        "picture_link": "OvUQ3FdwS0.e.ceTXM8vMO3dcUJICvC"
    },
    {
        "title": "Mushroom Stuffed Beef Rouladen",
        "ingredients": [
            "3 tablespoons vegetable oil, divided ADVERTISEMENT",
            "1 clove garlic, chopped ADVERTISEMENT",
            "1 pound assorted mushrooms (brown, oyster, portobello), thinly sliced ADVERTISEMENT",
            "1 pinch dried thyme ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1/4 cup bread crumbs ADVERTISEMENT",
            "8 (3 ounce) pieces top round, pounded thin ADVERTISEMENT",
            "1/4 cup dry red wine ADVERTISEMENT",
            "2 1/2 cups beef stock ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 2 tablespoons of oil in a large saute pan over medium-high heat. Stir in garlic and mushrooms. Cook until the mushrooms have softened, then stir in dried thyme, remove from heat, and allow to cool to room temperature. Once cool, season to taste with salt and pepper, then mix in the beaten egg and breadcrumbs.\nEvenly divide the mushroom mixture among the top round slices. Roll each Rouladen around the filling into a tight cylinder and secure with a toothpick.\nPreheat oven to 350 degrees F (175 degrees C).\nHeat the remaining 1 tablespoon of oil in a skillet over medium-high heat. Brown the Rouladen, then transfer to a 8x8 inch baking dish. Pour wine into the hot skillet and bring to a simmer. Meanwhile, stir the beef stock into the flour, and mix until smooth. Pour the beef stock into the skillet and return to a simmer. Cook until thickened, then stir in the Dijon mustard. Pour this sauce over the Rouladen.\nCover, and bake 60 to 75 minutes in the preheated oven, until the meat is tender.\n",
        "picture_link": "pTJoJkhUI0ivY.CFfkp4zD1abOw2WsS"
    },
    {
        "title": "Manjar (Dulce de Leche) from Scratch",
        "ingredients": [
            "1 quart whole milk ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring milk, sugar, and vanilla extract to a boil in a saucepan over high heat. Reduce heat to medium-low, and continue cooking, and continuously stirring until the milk has thickened and turned a caramel color, about 1 hour or more.\nStir in baking soda. Continue cooking until the caramelized milk has reached a pudding consistency. Pour manjar into a bowl and cool completely in the refrigerator.\n",
        "picture_link": "TP6dye3VFsm9O46E89vMjr6fzNcwreW"
    },
    {
        "title": "Austrian Tea Cakes",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1/4 cup powdered sugar ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 cups ground hazelnuts or almonds ADVERTISEMENT",
            "powdered sugar for dusting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nIn a large bowl, cream together the butter, 1/4 cup powdered sugar, and vanilla until smooth and light. Add the flour, salt, and ground hazelnuts; stir together until well combined. Chill dough for 1 hour, then drop onto greased cookie sheets in rounded teaspoons.\nBake in preheated oven for 25 minutes. Allow to cool for 10 minutes, then roll in powdered sugar. Cool completely on a wire rack, then roll in powdered sugar once again.\n",
        "picture_link": "u5w7kStrADINg8BjZmPJKuz8.ApKroy"
    },
    {
        "title": "Frozen Greek Yogurt",
        "ingredients": [
            "3 cups plain whole-milk Greek yogurt ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "5 tablespoons honey ADVERTISEMENT",
            "10 chopped fresh mint leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together the yogurt and lemon juice until smooth in a freezer-safe metal bowl. Combine the honey and mint in a small bowl. Pour the honey on top of the yogurt, then give the yogurt a few quick stirs so that the honey forms \"ribbons\" in the yogurt but is not blended in completely. Cover bowl and freeze for 1 to 2 hours.\n",
        "picture_link": "bQNQt7yJ2X2JpHlAMwYhOUT496Yx2s."
    },
    {
        "title": "Mexican Pizza",
        "ingredients": [
            "1/2 (16 ounce) can spicy fat-free refried beans* ADVERTISEMENT",
            "1 cup salsa, divided ADVERTISEMENT",
            "1 (12 inch) pre-baked Italian pizza crust ADVERTISEMENT",
            "2 cups shredded hearts of romaine lettuce ADVERTISEMENT",
            "3 medium green onions, thinly sliced ADVERTISEMENT",
            "1/4 cup ranch dressing ADVERTISEMENT",
            "1/4 cup crumbled tortilla chips ADVERTISEMENT",
            "1 cup shredded pepper Jack or Monterey Jack cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Adjust oven rack to lowest position, and heat oven to 450 degrees. Mix beans and 1/2 cup salsa in a medium bowl. Place crust on a cookie sheet, then spread the bean mixture over crust. Bake until it's crisp and warm, about 10 minutes.\nRemove from oven; top with lettuce, green onions and dollop with the remaining salsa. Drizzle (or, if dressing has an easy-pour top, squirt) dressing over pizza. Top with chips and cheese, then return to oven and bake until the cheese melts, about 2 minutes longer. Cut into 6 slices and serve.\n",
        "picture_link": "XcOxssIpzjKl8FPYZ5uOiiIOErzsif6"
    },
    {
        "title": "Soccer Salad",
        "ingredients": [
            "3 ounces blanched slivered almonds ADVERTISEMENT",
            "1/4 cup sesame seeds ADVERTISEMENT",
            "5 slices bacon ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "2 tablespoons distilled white vinegar ADVERTISEMENT",
            "1 teaspoon monosodium glutamate (such as Ac'cent®) ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1/2 teaspoon minced garlic ADVERTISEMENT",
            "2 heads leaf lettuce - rinsed, dried and torn into bite-size pieces ADVERTISEMENT",
            "1 cup chow mein noodles ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 325 degrees F (165 degrees C).\nSpread the almonds and sesame seeds onto an ungreased baking sheet.\nBake in the preheated oven until the almonds are just turning golden brown, about 8 minutes. Set aside to cool completely. Meanwhile, place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate, cool, and crumble.\nCook the bacon in a large, deep skillet over medium-high heat until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate and allow to cool; crumble.\nMake the dressing by shaking the sugar, vinegar, monosodium glutamate, vegetable oil, and garlic in a glass jar with a sealable lid until mixed. Combine the cooled almonds, sesame seeds, crumbled bacon, lettuce, and chow mein noodles in a bowl. Pour the dressing overtop and gently toss until coated.\n",
        "picture_link": "0KjX7sP0CKhXgXbUAKNXp9XKVzUi7Bi"
    },
    {
        "title": "Ancho Chile Rubbed Venison Steaks with Lime-Cilantro Butter",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 tablespoon lime juice ADVERTISEMENT",
            "1 tablespoon chopped fresh cilantro ADVERTISEMENT",
            "2 tablespoons steak seasoning ADVERTISEMENT",
            "1 tablespoon ancho chile powder ADVERTISEMENT",
            "4 (1/2 pound) venison steaks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whip together the butter, lime juice, and cilantro in a small bowl until well combined. Transfer the butter mixture onto a large piece of plastic wrap, gently wrap and form the butter into a log. Freeze until ready to use.\nPrepare a grill for medium-high heat.\nMix together the steak seasoning and ancho chile powder in a small bowl. Rub the seasoning blend onto both sides of the venison steaks.\nGrill the steaks to preferred doneness, 5 to 8 minutes per side for medium. Top each steak with a slice of the lemon-cilantro butter to serve.\n",
        "picture_link": "Nl9yiXf0nogqfhgBgzxJy//GxDKYDoa"
    },
    {
        "title": "Mocha",
        "ingredients": [
            "1 1/4 cups 2% milk ADVERTISEMENT",
            "2 tablespoons chocolate syrup ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger brewed espresso ADVERTISEMENT",
            "1 tablespoon sweetened whipped cream (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour milk into a steaming pitcher and heat to 145 degrees F to 165 degrees F (65 to 70 degrees C) using the steaming wand. Measure the chocolate syrup into a large coffee mug. Brew espresso, then add to mug. Pour the steamed milk into the mug, using a spoon to hold back the foam. Top with whipped cream.\n",
        "picture_link": "uB2/X6ClEQss4lltw.ap9mNxag3oUwu"
    },
    {
        "title": "Condiment Chops",
        "ingredients": [
            "3 tablespoons mayonnaise ADVERTISEMENT",
            "1/4 cup prepared yellow mustard ADVERTISEMENT",
            "1/3 cup ketchup ADVERTISEMENT",
            "1/4 cup Worcestershire sauce ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 tablespoon cayenne pepper ADVERTISEMENT",
            "1 pinch dried cilantro ADVERTISEMENT",
            "1 pinch dried sage ADVERTISEMENT",
            "black pepper to taste ADVERTISEMENT",
            "6 pork chops ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nWhisk the mayonnaise, mustard, ketchup, Worcestershire sauce, lemon juice, garlic powder, cayenne, cilantro, sage, and black pepper together in a large bowl. Dip the pork chops into the sauce to coat thickly. Place chops in a 9x13 inch baking dish.\nBake chops in the preheated oven until the juices run clear, about 50 minutes.\nPlace a large skillet over medium-high heat. Pan fry the baked chops in the hot skillet, basting chops with sauce from the baking dish. Cook until glazed, about 3 minutes per side.\n",
        "picture_link": "xvhQCatXmQ.J.FcQVNmBQocmeXNr0Ga"
    },
    {
        "title": "Almond Orange Chicken",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "2/3 cup sliced almonds ADVERTISEMENT",
            "6 (6 ounce) skinless, boneless chicken breast halves ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "3 tablespoons butter, melted ADVERTISEMENT",
            "1 1/2 cups whipping cream ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "2 tablespoons orange marmalade ADVERTISEMENT",
            "1/8 teaspoon red pepper flakes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt 1 tablespoon butter in a skillet over medium heat. Stir in the almonds, and cook until light brown and toasted, about 4 minutes.\nPlace the chicken breasts between two sheets of plastic wrap or waxed paper; flatten using a meat mallet or rolling pin. Season with salt and pepper to taste. Melt 3 tablespoons butter in a large skillet over medium meat; add the chicken breasts, and cook 1 minute on each side. Combine 1/2 cup almonds, cream, Dijon mustard, marmalade, and red pepper flakes with chicken, stirring to blend. Cook until sauce thickens, about 10 minutes. Serve chicken topped with sauce and remaining almonds.\n",
        "picture_link": "VscqCbhzDVvW89XCc7NtXe1WY7ONhca"
    },
    {
        "title": "Strawberry-Yogurt Shake",
        "ingredients": [
            "1 (16 ounce) package fresh strawberries, hulled ADVERTISEMENT",
            "2 bananas, peeled and sliced ADVERTISEMENT",
            "3 cups ice cubes ADVERTISEMENT",
            "1 (16 ounce) container plain low-fat yogurt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend strawberries, bananas, half of the ice cubes, and yogurt in a blender on high until smooth. Add the remaining ice and blend further until smooth again. Serve immediately.\n",
        "picture_link": "BKsy6fPViUB9QgyBKC5wwXbD4jWUT0e"
    },
    {
        "title": "Green Beans With Orange Olive Oil",
        "ingredients": [
            "3/4 pound fresh green beans, trimmed and halved ADVERTISEMENT",
            "4 1/2 teaspoons extra-virgin olive oil ADVERTISEMENT",
            "1 tablespoon orange zest strips ADVERTISEMENT",
            "kosher salt to taste ADVERTISEMENT",
            "1 teaspoon grated orange zest ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place green beans in a steamer basket over 1 inch of boiling water and cover. Cook until the beans are tender but still firm, 2 to 4 minutes. Drain, and keep warm.\nMeanwhile, stir together olive oil and 1 tablespoon orange zest strips in a large skillet over medium-low heat. Cook and stir until the olive oil has been infused with the flavor of the orange zest, about 2 minutes. Discard zest strips.\nToss drained green beans with flavored olive oil and kosher salt over medium heat until the beans are hot and coated with oil. Place onto a serving dish and sprinkle with remaining 1 teaspoon grated orange zest to garnish.\n",
        "picture_link": "vly5cO7vW6UsfCvQyOQcKAaMwJpcCI."
    },
    {
        "title": "New Year Three-Bean and Artichoke Salad",
        "ingredients": [
            "1 (15.5 ounce) can Great Northern beans, drained ADVERTISEMENT",
            "1 (15.5 ounce) can garbanzo beans, drained ADVERTISEMENT",
            "1 (15.5 ounce) can black-eyed peas, drained ADVERTISEMENT",
            "1 (13.75 ounce) can marinated artichoke hearts, drained and chopped ADVERTISEMENT",
            "4 green onions, chopped ADVERTISEMENT",
            "2 large tomatoes, diced ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "3 tablespoons balsamic vinegar ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "2 teaspoons crushed dried oregano ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the Great Northern beans, garbanzo beans, black-eyed peas, artichokes, green onions, tomatoes, and garlic together in a bowl. Toss with the olive oil, balsamic vinegar, parsley, oregano, and black pepper until well mixed. Refrigerate for 1 hour before serving.\n",
        "picture_link": "Hs/M17Dh0TGzw4a2Co.hoQa.3Q/um9O"
    },
    {
        "title": "Panhandle Grits",
        "ingredients": [
            "1/2 pound smoked sausage, thinly sliced ADVERTISEMENT",
            "1 cup diced cooked ham ADVERTISEMENT",
            "1/2 pound sliced bacon, diced ADVERTISEMENT",
            "1 onion, finely chopped ADVERTISEMENT",
            "1/2 cup chopped green bell pepper ADVERTISEMENT",
            "3 cups chopped fresh tomato ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 tablespoon hot pepper sauce (e.g. Tabasco™) ADVERTISEMENT",
            "1 cup yellow stone-ground grits ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large saucepan over medium-high heat. Add sausage, ham and bacon; cook and stir until browned. Remove the meat from the pan and set aside. Reserve 2 tablespoons of grease in the pan.\nReturn the pan to medium heat and add the onion, bell pepper, tomatoes and garlic powder. Cook and stir until onion is tender. Pour in the water and season with Worcestershire sauce, pepper, salt and hot pepper sauce; bring to a boil.\nGradually stir in the grits, cover and reduce the heat to low. Simmer, stirring frequently, until the mixture is thick, 5 to 10 minutes. Return the meat to the pot and stir in cheese. Heat through until cheese is melted.\n",
        "picture_link": "3.3qVIVrAew8U3NtS4W.BvXcwUckdpO"
    },
    {
        "title": "Slow-Roasted Tomatoes with Feta, Olives and Pinenuts",
        "ingredients": [
            "12 medium plum tomatoes, halved lengthwise and seeded ADVERTISEMENT",
            "1 1/4 teaspoons salt ADVERTISEMENT",
            "1/2 cup pinenuts ADVERTISEMENT",
            "2 cups crumbled feta cheese ADVERTISEMENT",
            "1 (3 ounce) package cream cheese ADVERTISEMENT",
            "2/3 cup coarsely chopped kalamata olives ADVERTISEMENT",
            "2 teaspoons dried oregano ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sprinkle tomatoes with salt and turn, cut side down, to drain for 30 minutes on a wire rack set over a cookie sheet with a rim. Meanwhile, warm a small skillet over low heat. Add pinenuts; saute, stirring constantly until golden brown, 3 to 4 minutes.\nAdjust oven rack to center position and heat oven to 325 degrees. Mix feta, cream cheese, olives, pinenuts and oregano in a medium bowl. Turn tomatoes cut side up and fill with about 2 Tbs. of the feta mixture.\nBake until tomatoes are soft but still hold their shape, about 30 minutes. Remove from oven and brush with oil. Serve hot, warm or at room temperature.\n",
        "picture_link": "8toW5XrqtUOUnObhxqB9dOlx.ZOp9A."
    },
    {
        "title": "Lebanese Rubbed Salad",
        "ingredients": [
            "1 (10 ounce) bag mixed baby salad greens ADVERTISEMENT",
            "1 English cucumber, diced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 (10 ounce) basket cherry tomatoes, halved ADVERTISEMENT",
            "1/3 cup crumbled Feta cheese ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons aged balsamic vinegar ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the salad greens in a large bowl. Add the cucumber, garlic, cherry tomatoes, and Feta cheese. Sprinkle with salt and pepper, toss to blend. Drizzle with vinegar and olive oil.\nUsing clean hands (all rings removed), rub the salad ingredients together for 2 minutes to thoroughly work the oil, vinegar, and seasonings into the greens.\n",
        "picture_link": "IeLDLObRe0..cfcvnz1NdV/V51bxK0C"
    },
    {
        "title": "Orange Vegetables Soup",
        "ingredients": [
            "1 butternut squash, halved and seeded ADVERTISEMENT",
            "1 small pumpkin, halved and seeded ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 celery ribs, chopped ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "4 cubes vegetable bouillon ADVERTISEMENT",
            "5 cups boiling water ADVERTISEMENT",
            "3 medium carrots, peeled and chopped ADVERTISEMENT",
            "1 large sweet potato, peeled and diced ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 (12 fluid ounce) can evaporated milk ADVERTISEMENT",
            "1/4 cup fresh orange juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nPlace the squash and pumpkin in a large baking dish. Pour about 1-inch of water into the dish and cover with aluminum foil.\nBake in preheated oven until the squash and pumpkin are tender, 1 hour to 1 hour and 15 minutes.\nHeat the oil in a stockpot over medium heat. Combine the onion, celery, cinnamon, nutmeg, and cloves in the hot oil and cook and stir 3 to 5 minutes. Crumble the vegetable bouillon into the onion mixture; stir. Slowly add the boiling water to the mixture while stirring. When the water returns to a boil, add the carrots and sweet potato; season with salt; cover and cook until the potato and carrots are tender, 20 to 25 minutes; remove from heat. Scrape the flesh from the baked squash and pumpkin and add to the soup. Allow soup to cool for 15 minutes.\nLadle batches of the soup into a blender or food processor and blend on high until smooth. Repeat until all soup has been blended. Return blended soup to stockpot over medium heat. Stir in the evaporated milk and orange juice. Cook soup until entirely heated, 10 to 15 minutes.\n",
        "picture_link": "OvNrny8mvqsm9TqSp0b.0KLqYMiWj/y"
    },
    {
        "title": "Chocolate Bliss Cheesecake",
        "ingredients": [
            "18 OREO Chocolate Sandwich Cookies, finely crushed ADVERTISEMENT",
            "2 tablespoons butter or margarine, melted ADVERTISEMENT",
            "3 (8 ounce) packages PHILADELPHIA Cream Cheese, softened ADVERTISEMENT",
            "3/4 cup sugar ADVERTISEMENT",
            "1 teaspoon vanilla ADVERTISEMENT",
            "8 (1 ounce) squares BAKER'S Semi-Sweet Baking Chocolate, melted, cooled slightly ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F if using a silver 9-inch springform pan (or to 300 degrees F if using a dark nonstick 9-inch springform pan). Mix cookie crumbs and butter; press firmly onto bottom of pan.\nBeat cream cheese, sugar and vanilla in large bowl with electric mixer on medium speed until well blended. Add melted chocolate; mix well. Add eggs, 1 at a time, mixing on low speed after each addition just until blended. Pour over crust.\nBake 55 min. to 1 hour or until center is almost set. Run knife or metal spatula around rim of pan to loosen cake; cool before removing rim of pan. Refrigerate 4 hours or overnight. Store leftover cheesecake in refrigerator.\n",
        "picture_link": "iUNL5Mg6fBYNzWuRDcO1HN444GUO6r6"
    },
    {
        "title": "Grecian Baklava",
        "ingredients": [
            "Syrup: ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/4 cup orange juice ADVERTISEMENT",
            "1 1/2 cups honey ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "Pastry: ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/8 teaspoon ground nutmeg ADVERTISEMENT",
            "2 cups ground walnuts ADVERTISEMENT",
            "1 (16 ounce) package phyllo dough ADVERTISEMENT",
            "1 1/2 cups melted butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Make the syrup by bringing the water, 3/4 cup sugar, orange juice, honey, and 1 tablespoon cinnamon to a boil in a saucepan over medium-high heat. Reduce heat to medium-low and simmer 10 minutes. Remove from heat and allow to cool to room temperature.\nPreheat an oven to 325 degrees F (165 degrees C). Butter a 10x15 inch baking dish.\nStir together 3/4 cup sugar, 1/2 teaspoon cinnamon, nutmeg, and ground walnuts until evenly blended; set aside.\nPress 2 sheets of phyllo into the prepared dish and brush with melted butter. Continue adding phyllo sheets brushed with butter two at a time until you have 12 sheets total. Sprinkle 1/3 of the walnut mixture evenly over the phyllo, then add another 6 sheets, buttering between every two. Sprinkle 1/2 of the remaining walnut mixture evenly over the phyllo; top with another 6 buttered phyllo sheets. Finally, sprinkle the remaining walnut mixture onto the phyllo. Place the remaining phyllo on top of the baklava, buttering every two sheets. Brush the remaining butter onto the top of the baklava.\nBake in the preheated oven until the phyllo is golden brown and crispy, about 1 hour. Remove from the oven; pour the cooled syrup over the hot baklava. Cool to room temperature before cutting into 1-inch squares or diamonds to serve.\n",
        "picture_link": "F8h.9jjJmslQkpCrgLdh8HF/dNMqOEq"
    },
    {
        "title": "Filipino Spaghetti",
        "ingredients": [
            "2 pounds spaghetti ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 head garlic, minced ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 pound ground pork ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 (26.5 ounce) can spaghetti sauce ADVERTISEMENT",
            "1 (14 ounce) jar banana ketchup ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 pound hot dogs, sliced diagonally ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the spaghetti, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 12 minutes. Drain well in a colander set in the sink.\nHeat the vegetable oil in a skillet over medium heat. Stir in the garlic and onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Stir in the beef and pork; season with salt and pepper. Cook and stir until the meat has browned. Pour in the spaghetti sauce, banana ketchup, sugar, and water. Simmer until the sauce has thickened, about 15 minutes. Stir in hot dog slices and continue to cook until hot dogs are heated through. Serve over spaghetti with Cheddar cheese sprinkled on top.\n",
        "picture_link": "0VYfk.feJQnKC5q0JQy9KSCLltKzfg6"
    },
    {
        "title": "Easy Raspberry Sorbet",
        "ingredients": [
            "1 cup boiling water ADVERTISEMENT",
            "1 pkg. (4 serving size) JELL-O Brand Raspberry Flavor Gelatin ADVERTISEMENT",
            "1 (6 ounce) can frozen lemonade concentrate (do not thaw) ADVERTISEMENT",
            "3 cups fresh raspberries ADVERTISEMENT",
            "1 (8 ounce) tub COOL WHIP Whipped Topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir boiling water into dry gelatin mix in large freezer proof bowl at least 2 min. until gelatin is completely dissolved. Stir in frozen lemonade concentrate. Refrigerate 15 min. or until slightly thickened (consistency of unbeaten egg whites).\nMash raspberries with fork. Add to gelatin mixture along with whipped topping; stir with wire whisk until well blended, Cover.\nFreeze 4 hours or until solid. Remove from freezer 15 min. before serving. Let stand at room temperature to soften slightly. Scoop into cones or dessert dishes. Store any leftover dessert in freezer container in freezer.\n",
        "picture_link": "G4jXuC4FAI4AxzK6Z72QUWrnwhIyauy"
    },
    {
        "title": "Kaiserschmarren",
        "ingredients": [
            "4 eggs, separated ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2/3 cup raisins (optional) ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "2 tablespoons confectioners' sugar ADVERTISEMENT",
            "2 cups applesauce (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat the egg whites in a clean bowl until soft peaks form. Lift your beater or whisk straight up: the egg whites will form soft mounds rather than a sharp peak. Beat the egg yolks in a separate bowl until smooth; mix in the milk, sugar, salt, flour, and raisins until just moistened. Fold in the egg whites.\nMelt the butter in a large skillet over medium heat. Pour the batter into the skillet and cook until golden brown; flip and cook until set on the other side, about 1 minute. Tear the kaiserschmarren into pieces using two forks and continue cooking until golden brown, about 2 minutes. Sprinkle with confectioners' sugar to garnish and serve with applesauce.\n",
        "picture_link": "R4f1INsgEGgFGRY5tRR.rBdBeR0gLRy"
    },
    {
        "title": "Peggy's Broccoli Casserole",
        "ingredients": [
            "2 (10 ounce) packages frozen chopped broccoli ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1/4 cup bacon ranch dressing ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/4 cup chopped onion, or to taste ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "1 cup herb-seasoned stuffing mix ADVERTISEMENT",
            "1 tablespoon melted butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Prepare a 2 quart casserole dish with cooking spray.\nPlace the frozen broccoli into a large saucepan and cover with water, and bring to a boil over high heat. When the water has come to a boil and the broccoli is no longer frozen, drain in a colander set in the sink.\nWhile waiting for the broccoli to come to a boil, beat the cream cheese and eggs in a large bowl until smooth. Add the condensed soup, ranch dressing, sour cream, mayonnaise, onion, and flour; mix well. Stir in the drained broccoli along with the Cheddar cheese until evenly mixed. Pour into the prepared baking dish. Toss the dry stuffing mix with the melted butter, and spread evenly over the top of the casserole.\nBake in the preheated oven until the sauce is bubbly, and the top is golden brown, 30 to 35 minutes. Let stand 10 minutes before serving.\n",
        "picture_link": "WCanVJhTGQJerx5wYRelKWyIWP/wCTC"
    },
    {
        "title": "Toffee Bar Brownies",
        "ingredients": [
            "1 (20 ounce) package brownie mix ADVERTISEMENT",
            "1 pkg. (4 serving size) instant chocolate pudding mix ADVERTISEMENT",
            "8 (1.4 ounce) bars chocolate-covered English toffee bars, divided ADVERTISEMENT",
            "2 (8 ounce) containers frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare brownies according to the package directions, and let cool. Crumble the surface of the brownies with a fork.\nPrepare the chocolate pudding mix according to the package directions, and immediately pour over the brownies. Allow the pudding to set.\nUsing the handle of a wooden spoon or table knife, crush the toffee bars, still in their wrappers, and sprinkle 7 crushed toffee bars over the pudding.\nSpread the whipped topping over the crushed toffee bars with a spatula, and sprinkle 1 crushed toffee bar over the top for decoration.\n",
        "picture_link": "V1PsjmfgsfEGX3sBqZF4DmnII6eVd/6"
    },
    {
        "title": "Summer Tomato Casserole",
        "ingredients": [
            "6 vine ripened tomatoes, sliced ADVERTISEMENT",
            "1 tablespoon mayonnaise (such as Hellman's®) ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace a layer of tomato slices in an 8x8 inch baking pan. Spread a thin layer of mayonnaise on the tomatoes and sprinkle with about 1/4 of the Cheddar cheese and salt and pepper. Repeat layers, ending with the rest of the shredded cheese.\nBake until tomatoes are softened and cheese is melted and bubbly, 20 to 25 minutes.\n",
        "picture_link": "z2SeYuUhasuG8OTTVA6ZDGYg.ttEQNO"
    },
    {
        "title": "Cheesy Jalapeno Crab Dip",
        "ingredients": [
            "1 pound lump crabmeat ADVERTISEMENT",
            "6 ounces Monterey Jack cheese, shredded ADVERTISEMENT",
            "2/3 cup mayonnaise ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1/2 cup diced pickled jalapeno pepper slices ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "2 teaspoons hot pepper sauce ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 1/2 cups sourdough croutons ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C).\nStir together the crabmeat, Monterey Jack cheese, mayonnaise, garlic, jalapeno peppers, Worcestershire sauce, hot pepper sauce, and salt in a bowl. Scrape into an 8x8 inch, glass baking dish, and smooth the top with a spatula. Sprinkle evenly with croutons and Parmesan cheese. Dust with the paprika.\nBake in the preheated oven until the dip is bubbly and the top is golden brown, about 25 minutes. Remove from the oven and allow to stand 5 minutes before serving.\n",
        "picture_link": "VW3qwydPZMB1r6LTArynlByDU08YluS"
    },
    {
        "title": "Apple Cider Floats",
        "ingredients": [
            "4 (1/4 cup) scoops vanilla ice cream ADVERTISEMENT",
            "2 cups fresh apple cider ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place two scoops of ice cream into each glass. Pour 1 cup of apple cider into each glass, and serve.\n",
        "picture_link": "1OCSD6sAgiQSEWyTtB7sItksEcAcn6u"
    },
    {
        "title": "Mu Shu Pork",
        "ingredients": [
            "2 tablespoons soy sauce ADVERTISEMENT",
            "2 tablespoons white wine ADVERTISEMENT",
            "1 teaspoon sesame oil ADVERTISEMENT",
            "2 teaspoons cornstarch ADVERTISEMENT",
            "1 pound pork tenderloin, cut into thin strips ADVERTISEMENT",
            "1 3/4 ounces dried shiitake mushrooms ADVERTISEMENT",
            "1/2 cup sliced green onions ADVERTISEMENT",
            "3 tablespoons minced garlic ADVERTISEMENT",
            "2 tablespoons peeled and minced fresh ginger ADVERTISEMENT",
            "1 head Napa cabbage ADVERTISEMENT",
            "3 tablespoons soy sauce ADVERTISEMENT",
            "3 tablespoons white wine ADVERTISEMENT",
            "1/2 teaspoon cornstarch ADVERTISEMENT",
            "1/2 teaspoon white sugar ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 tablespoon vegetable oil, plus more if needed ADVERTISEMENT",
            "1 teaspoon sesame oil ADVERTISEMENT",
            "2 large eggs, beaten ADVERTISEMENT",
            "2 tablespoons white wine ADVERTISEMENT",
            "1 cup hoisin sauce ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1 teaspoon sesame oil ADVERTISEMENT",
            "16 frozen Chinese moo shu pancakes, thawed and warmed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place 2 tablespoons of soy sauce, 2 tablespoons of white wine, 1 teaspoon of sesame oil, and 2 teaspoons of cornstarch in a nonreactive bowl, and stir until smooth. Stir the pork strips into the marinade until thoroughly coated, and refrigerate for 1 hour.\nPour hot water over the shiitake mushrooms in a bowl, and allow to soften for 15 to 20 minutes. Drain, pat dry, remove any hard stem pieces, and finely chop the mushrooms. Combine the mushrooms, green onions, garlic, and ginger in a bowl, and set aside.\nRemove the leaves from the Napa cabbage, and tear the green leafy portions from the central stalks of the leaves. Slice the stalks the long way into thin slices, then cut them into 1-inch pieces. Finely chop the green leafy portions, and set aside the sliced stems and chopped leaves in separate bowls.\nIn a small bowl, stir together 3 tablespoons of soy sauce, 3 tablespoons of white wine, 1/2 teaspoon of cornstarch, sugar, and ground black pepper. Set the mixture aside.\nHeat vegetable oil and 1 teaspoon of sesame oil in a wok over medium-high heat, and cook and stir the marinated pork until cooked through, no longer pink, and the edges have begun to brown, about 5 minutes. Remove the pork to a bowl.\nPour the beaten eggs into the hot wok, adding more vegetable oil if necessary, and cook and stir until the eggs are scrambled, firm, and well-broken up, about 2 minutes. Stir in the mushroom mixture, and cook and stir 1 to 2 minutes; then stir in the Napa cabbage stem pieces. Cook and stir until the stem pieces are hot but still crunchy, about 1 minute, and then add the chopped cabbage leaves. Pour in 2 tablespoons of white wine, cook and stir the mixture until hot, about 1 more minute, then mix in the cooked pork and the reserved cornstarch mixture. Stir everything together until slightly thickened and hot, about 2 minutes.\nMix the hoisin sauce, 1 tablespoon of soy sauce, and 1 teaspoon of sesame oil in a small bowl until thoroughly combined. To serve, spread about 1 tablespoon of hoisin mixture on each pancake, top with about 1/2 cup of the pork mixture, roll, and serve.\n",
        "picture_link": "9YTcvVlKlRIyF7fI913XjRJt/pPiE4u"
    },
    {
        "title": "Whipped Cream Zabaglione",
        "ingredients": [
            "7 egg yolks ADVERTISEMENT",
            "1/2 cup Marsala wine ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1 cup heavy cream, whipped to stiff peaks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large saucepan with several inches of water, and bring to a boil over high heat. Reduce the heat until the water maintains a strong simmer. Place the egg yolks, Marsala wine, and sugar into a metal mixing bowl. Place the bowl over the simmering water. Beat constantly with a wire whisk until the zabaglione turns pale yellow and thickens to the consistency of softly whipped cream. Scrape the zabaglione into a clean mixing bowl, and set over ice, stirring occasionally until cold. Once cold, fold in the whipped cream.\n",
        "picture_link": "qGU2mQuIZkhxHWuAjuslOm.DlByzQ4m"
    },
    {
        "title": "Pork Chops with a Riesling Peach Sauce",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "4 boneless pork chops ADVERTISEMENT",
            "1 cup Riesling wine ADVERTISEMENT",
            "3 under ripe peaches, pitted, and cut into 12 wedges each ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Cover a baking sheet with aluminum foil.\nHeat the olive oil in a large skillet over medium-high heat. Season the pork chops with salt and pepper. Brown the pork chops in the hot oil until golden brown on both sides, about 3 minutes per side. Place the pork chops on the prepared baking sheet and bake in the preheated oven until the pork is no longer pink in the center, about 20 minutes. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C).\nWhile the pork chops are baking, pour the Riesling wine into the skillet, and bring to a simmer, using a wooden spoon to scrape up all of the browned bits of pork. Simmer until the wine has reduced to half its original volume then add the peaches and sprinkle in the cinnamon, nutmeg, and brown sugar. Reduce the heat to medium, and cook until the peaches are tender but not mushy, about 15 minutes. Spoon the peach sauce over the pork chops to serve.\n",
        "picture_link": "NejXj.koTeX/CefxXqXJFRSdn/vDp/u"
    },
    {
        "title": "Lavender Lemon Bars",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "2 teaspoons dried lavender buds ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/4 cup virgin coconut oil, softened ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 dash salt ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "4 eggs, beaten ADVERTISEMENT",
            "1/2 cup lemon juice ADVERTISEMENT",
            "1/2 teaspoon lemon extract (optional) ADVERTISEMENT",
            "1/2 teaspoon dried lavender buds ADVERTISEMENT",
            "1/4 cup confectioners' sugar, for dusting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Grease an 8x12 inch baking dish.\nMake lavender sugar by blending the sugar and 2 teaspoons lavender buds in a blender; blend until the lavender is powdered.\nBlend together with an electric mixer 1/4 cup of the lavender sugar, butter, coconut oil, 2 cups flour, and salt in a bowl until a dough forms; press into the bottom of the prepared dish.\nBake in the preheated oven until the top begins to turn golden brown; about 15 minutes.\nWhile the dough bakes, mix together the remaining lavender sugar, 1/4 cup flour, eggs, lemon juice, lemon extract, and 1/2 teaspoon lavender buds; pour over the baked crust and return to the oven to bake until the center is set, about 20 minutes. Allow to cool completely and dust with confectioners' sugar before serving.\n",
        "picture_link": "yR4BmAorWhxvW3/VXkxVmMT2EbHdU8m"
    },
    {
        "title": "Summer Rainbow Salad",
        "ingredients": [
            "3 vine-ripe tomatoes, diced ADVERTISEMENT",
            "2 mangos - peeled, seeded, and cubed ADVERTISEMENT",
            "2 avocados - peeled, pitted, and cubed ADVERTISEMENT",
            "1 orange bell pepper, chopped ADVERTISEMENT",
            "1 cup fresh blueberries ADVERTISEMENT",
            "1 red onion, chopped ADVERTISEMENT",
            "1/2 bunch cilantro, chopped ADVERTISEMENT",
            "1/4 cup fresh lime juice ADVERTISEMENT",
            "1/2 cup pineapple juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the tomato, mango, avocado, bell pepper, blueberries, onion, and cilantro into a large bowl. Pour the lime juice and pineapple juice overtop. Stir gently until evenly combined. Serve immediately for the freshest taste.\n",
        "picture_link": "MXUjBNRtBi5WY557qTsR85mrIyFIbYa"
    },
    {
        "title": "Ham Glaze",
        "ingredients": [
            "1/2 cup brown sugar ADVERTISEMENT",
            "3 cloves garlic ADVERTISEMENT",
            "1/2 cup mango chutney ADVERTISEMENT",
            "2 teaspoons orange zest ADVERTISEMENT",
            "1/8 cup orange juice ADVERTISEMENT",
            "1/4 cup Dijon mustard ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine brown sugar, garlic, mango chutney, orange zest, orange juice, and mustard in the work bowl of a food processor. Process until smooth.\n",
        "picture_link": "kAoF09vG7q5hOSxdUurL.fK.TDCmyQm"
    },
    {
        "title": "Taco Sauce",
        "ingredients": [
            "1 clove garlic, minced ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground mustard ADVERTISEMENT",
            "1 dash cayenne pepper ADVERTISEMENT",
            "1 tablespoon distilled white vinegar ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the garlic, sugar, cumin, salt, mustard, cayenne pepper, and vinegar in a bowl. Whisk in the olive oil until incorporated.\n",
        "picture_link": "wEJfLyYV09Q0TGpoP2mYfZLVKT00tpS"
    },
    {
        "title": "Maltese Rabbit Stew",
        "ingredients": [
            "1/4 cup oil ADVERTISEMENT",
            "1 (3 pound) rabbit, cleaned and cut into pieces ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "1/2 cup red wine ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1 cube beef bouillon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "2 tablespoons tomato paste ADVERTISEMENT",
            "1/4 teaspoon white sugar ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "4 large potatoes, peeled and quartered ADVERTISEMENT",
            "2 carrots, chopped ADVERTISEMENT",
            "1/2 cup peas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a large saucepan over medium heat; cook the rabbit, onion and garlic in the hot oil until the garlic and onion are fragrant and the rabbit is brown. Stir in the wine, bay leaf, beef bouillon, nutmeg, tomato paste, and sugar; season with salt and pepper. Add the potatoes, carrots, and peas. Pour enough water over everything until covered. Bring stew to a boil; reduce heat to low and allow to simmer until the potatoes are completely cooked through, about 1 hour.\n",
        "picture_link": "3sqU8V164hmB9IkkoXCCzk24Kp/LGJO"
    },
    {
        "title": "Fast and Easy Ricotta Cheese Pizza with Mushrooms, Broccoli, and Chicken",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "1 skinless, boneless chicken breast, cut into bite-sized chunks ADVERTISEMENT",
            "1 (8 ounce) container ricotta cheese ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 (12 inch) pre-baked pizza crust ADVERTISEMENT",
            "2 cups shredded mozzarella cheese ADVERTISEMENT",
            "1/2 cup chopped fresh broccoli ADVERTISEMENT",
            "1 (3 ounce) can sliced mushrooms, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 325 degrees F (165 degrees C).\nMelt 1 tablespoon butter in a skillet over medium heat. Cook the chicken in the butter until no longer pink and the juices run clear, 7 to 10 minutes; remove from heat and set aside.\nCombine the ricotta cheese, 1 tablespoon butter, garlic powder, oregano, salt, and pepper in a microwave-safe bowl. Heat in microwave for 1 minute; stir to combine. Spread the mixture over the pizza crust. Scatter the mozzarella cheese evenly over the pizza. Arrange the cooked chicken, broccoli, and mushrooms evenly on top of the pizza.\nBake in the preheated oven until the cheese is melted, about 20 minutes.\n",
        "picture_link": "RmqEi0WpFV7Ovu5hB6M8a36JdampoSG"
    },
    {
        "title": "Scampi-Style Scallops Over Linguine",
        "ingredients": [
            "1 (16 ounce) package linguine ADVERTISEMENT",
            "1 (2 ounce) can anchovy fillets with oil ADVERTISEMENT",
            "1/2 onion, minced ADVERTISEMENT",
            "3/4 cup chicken stock ADVERTISEMENT",
            "1/4 cup white wine ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1/2 teaspoon dried parsley ADVERTISEMENT",
            "1/8 teaspoon seafood seasoning (such as Old Bay®) ADVERTISEMENT",
            "12 ounces bay scallops ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the linguine, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 11 minutes. Drain well in a colander set in the sink.\nHeat a large skillet over medium heat; cook and stir the anchovies with the oil in the skillet until the anchovies melt into the oil, about 2 minutes; add the onion and cook until translucent, 3 to five minutes. Stir in the chicken stock, wine, garlic, parsley, and seafood seasoning; lie the scallops into the liquid; season with salt and pepper. Bring the mixture to a boil and cook until the scallops are opaque, about 7 minutes. Serve over the cooked linguine.\n",
        "picture_link": "UyRN50faVdziTGgtVwFjct7dtOxf/a."
    },
    {
        "title": "Easy Curry Rice",
        "ingredients": [
            "2 cups uncooked white rice, rinsed ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "3 tablespoons mild curry powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir the rice, water, and curry powder together in a rice cooker; cook for 1 full cycle or until all the water is absorbed, 15 to 20 minutes.\n",
        "picture_link": "hv9jidGzprMZlE8iIK8tpMvKqLVuuQm"
    },
    {
        "title": "Kim's Stir-Fried Ginger Garlic Chicken",
        "ingredients": [
            "3 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 (2 inch) piece fresh ginger root ADVERTISEMENT",
            "2 tablespoons coconut oil ADVERTISEMENT",
            "2 1/2 teaspoons pressed garlic ADVERTISEMENT",
            "1/3 cup hoisin sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Slice the chicken breasts into strips across the grain, and set aside. Peel and grate the ginger root and set aside.\nHeat the coconut oil in a wok over medium-high heat until the oil is melted and hot. Stir in the ginger and garlic, and cook and stir for about 20 seconds, to release the flavor. Toss the chicken strips into the hot oil, and scoop the hoisin sauce over the chicken. Cook and stir for 5 to 7 minutes, until the sauce coats the chicken and the meat is no longer pink inside.\n",
        "picture_link": "sfBZ/elZny1SUgiM.dKX83NLywtKJku"
    }
]