[
    {
        "title": "My Favorite Pot Roast",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 (4 pound) beef pot roast ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 tablespoon dry mustard ADVERTISEMENT",
            "1/4 teaspoon black pepper ADVERTISEMENT",
            "3 large potatoes, quartered ADVERTISEMENT",
            "3 carrots, peeled and cut into 2-inch pieces ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "1/3 cup vinegar ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nHeat vegetable oil in a Dutch oven over medium heat. Cook beef in Dutch oven until browned on all sides, 2 to 3 minutes per side.\nMix brown sugar, salt, mustard, and black pepper together in a small bowl; sprinkle evenly over the roast. Arrange potatoes, carrots, and onion in the Dutch oven around the roast. Pour vinegar and water over the vegetables.\nPlace a cover on the Dutch oven and put in preheated oven. Cook until the roast is hot in the center, and just turning from pink to grey, about 4 hours. An instant-read thermometer inserted into the center should read 150 degrees F (65 degrees C).\n",
        "picture_link": "bCbSnDUECRZz//r29VYkk3CUiQmNQ26"
    },
    {
        "title": "Dragon Eggs",
        "ingredients": [
            "6 eggs ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "2 tablespoons molasses ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "8 tea bags ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "1/3 cup mayonnaise ADVERTISEMENT",
            "2 tablespoons minced red bell pepper ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 cup salsa ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place eggs in a saucepan and cover with water. Bring to a boil, remove from heat, and let eggs stand in hot water for 15 minutes. Drain hot water and fill saucepan with cold water; allow eggs to sit until cooled, 15 to 20 minutes. Drain water. Gently tap or roll eggs on the counter so the shell is cracked but still intact.\nReturn eggs to saucepan and pour in enough water to cover eggs; add soy sauce, molasses, salt, and tea bags. Bring to a boil, reduce heat, and simmer until eggs have absorbed color, about 30 minutes. Remove saucepan from heat and leave eggs in water to cool to room temperature.\nPeel eggs and trim bottom of each egg so it will stand upright. Cut each egg lengthwise and scoop yolks into a bowl. Mix mayonnaise, red bell pepper, salt, and pepper into egg yolks until evenly combined.\nSpoon yolk mixture back into egg whites; smooth filling to be level with egg white. Put each egg back together.\nPour salsa onto a plate and assemble eggs upright into the salsa.\n",
        "picture_link": "rmg8iUL.1.jSCe9Oore30F.FZZz8nzu"
    },
    {
        "title": "Old Hamburger Bun Croutons",
        "ingredients": [
            "olive oil, or as needed ADVERTISEMENT",
            "4 hamburger buns, cut into 1-inch cubes ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/8 teaspoon dried oregano ADVERTISEMENT",
            "1/8 teaspoon ground thyme ADVERTISEMENT",
            "1/8 teaspoon dried basil ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "coarsely ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nDrizzle olive oil over hamburger bun cubs in a large bowl; toss to coat. Spread cubes onto a baking sheet. Sprinkle garlic powder, oregano, thyme, basil, salt, and black pepper over the cubes.\nBake in preheated oven until brown and crispy, 8 to 10 minutes. Cool completely before storing in airtight container.\n",
        "picture_link": "Fpck1Lkokw1ei/iuN9paInv76dom6Gu"
    },
    {
        "title": "Chocolate Chip Cookie Layer Cake",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 (12 ounce) bag semisweet chocolate chips ADVERTISEMENT",
            "Frosting: ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3 cups confectioners' sugar ADVERTISEMENT",
            "2/3 cup cocoa powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease 3 large baking sheets. Cut three 10-inch rounds of parchment paper and set each round on each baking sheet.\nBeat 1 cup butter, brown sugar, and white sugar together in a bowl using an electric mixer until fluffy and smooth. Mix eggs, 2 teaspoons vanilla extract, baking soda, and salt into creamed butter until just combined; stir in flour until dough is just combined. Fold chocolate chips into dough.\nDivide dough into 3 parts; press 1 part onto each parchment round.\nBake in the preheated oven until cookie rounds are browned and crisp around the edges and set in the middle, 15 to 20 minutes. Remove from oven and cool completely.\nStir melted butter, milk, and 1 teaspoon vanilla extract together in a bowl. Beat confectioners' sugar and cocoa powder together in a separate bowl until evenly combined. Beat butter mixture into cocoa mixture until frosting is smooth and thickened.\nPeel parchment paper off the bottom of each cookie round. Set aside the prettiest round to be used for the top layer. Spread 1/2 the frosting onto 1 cookie round and top with a second cookie round. Spread remaining frosting onto second cookie round and top with the third cookie round.\n",
        "picture_link": "ay81C19CXpyjmf6VBckeq47RqZYzK.W"
    },
    {
        "title": "John's Baked Pork Chops Stuffed with Smoked Gouda and Bacon",
        "ingredients": [
            "2 ounces smoked Gouda cheese, shredded ADVERTISEMENT",
            "4 slices cooked bacon, crumbled ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "2 (2 1/4-inch thick) center-cut boneless pork chops ADVERTISEMENT",
            "1 teaspoon olive oil ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup bread crumbs ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 apple, cored ADVERTISEMENT",
            "1 green onion ADVERTISEMENT",
            "2 pieces red grapes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine Gouda cheese, bacon, parsley, and 1/8 teaspoon black pepper together in a bowl.\nCut each pork chop from one side through the middle horizontally to within 1/2 inch of the other side. Open the two sides and spread them out like an open book. Stuff cheese mixture into each pocket and close; secure with a wooden toothpick. Coat each stuffed pork chop with olive oil.\nWhisk egg in a bowl. Mix bread crumbs, salt, and black pepper to taste together in a separate bowl. Carefully dip each stuffed pork chop in the egg; press chop into bread crumb mixture until evenly coated. Place breaded pork chops in a 9x13-inch casserole dish.\nBake in preheated oven until no longer pink in the center, about 45 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C). Garnish pork chops with cored apple, green onion, and red grapes.\n",
        "picture_link": "/NjOoxDp5KhS7VVqRs.5hzfMm1UCGvW"
    },
    {
        "title": "How to Make Homemade Butter",
        "ingredients": [
            "2/3 cup cold heavy whipping cream ADVERTISEMENT",
            "1 1-cup canning jar with lid and ring ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour cream into the jar and screw on the lid. Shake jar until butter forms a soft lump, 15 to 20 minutes. Continue to shake until buttermilk separates out of the lump and the jar contains a solid lump of butter and liquid buttermilk.\nPour contents of the jar into a fine mesh strainer and strain out the buttermilk, leaving the solid butter. Remove the lump of butter and wrap in plastic wrap. Refrigerate until needed.\n",
        "picture_link": "AkMQJM9cyxAlkAmKKXnm4gmPFfDQj1G"
    },
    {
        "title": "Creamy Slow Cooker Green Chili Chicken Soup",
        "ingredients": [
            "2 tablespoons canola oil ADVERTISEMENT",
            "2 skinless, boneless chicken breasts, cut into cubes ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon ground white pepper ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "1 (4 ounce) can chopped green chilies ADVERTISEMENT",
            "1 (15 ounce) can pinto beans, rinsed and drained ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "2 cups chicken broth ADVERTISEMENT",
            "1 (10.75 ounce) can cream of chicken soup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour canola oil into slow cooker and tilt to coat bottom of crock. Put chicken into bottom of slow cooker.\nMix salt, chili powder, onion powder, garlic powder, cumin, white pepper, and cayenne pepper together in a bowl; sprinkle about half the mixture over the chicken. Turn the chicken and sprinkle remaining spice mixture over the chicken.\nLayer tomato sauce, green chiles, pinto beans, and diced tomatoes atop the chicken, respectively.\nWhisk chicken broth and cream of chicken soup together in a bowl; pour evenly over the diced tomato layer.\nCook on High for 1 hour. Stir to spread ingredients evenly throughout the soup. Continue cooking, stirring occasionally, for 5 hours more.\n",
        "picture_link": "3J/u.qa2X4.4SST3iE.dAPa900tWYc2"
    },
    {
        "title": "Oven Roasted Ribs",
        "ingredients": [
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "1/2 cup chopped onions ADVERTISEMENT",
            "2 cloves minced garlic ADVERTISEMENT",
            "3/4 cup chili sauce ADVERTISEMENT",
            "1/2 cup beer ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1/2 teaspoon dry mustard ADVERTISEMENT",
            "3 1/2 pounds country style pork ribs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a saucepan over medium-high heat. Cook and stir onions and garlic in hot oil until fragrant and softened, 4 to 6 minutes.\nStir chili sauce, beer, honey, Worcestershire sauce, and dry mustard into onion mixture; bring to a boil, reduce heat to low, and simmer until sauce thickens and flavors develop, 20 minutes.\nPreheat oven to 350 degrees F (175 degrees C).\nBake ribs in a baking dish in the preheated oven for 1 hour. Spread sauce over ribs and return to oven; bake until sauce bubbles and ribs are tender, 1 hour.\n",
        "picture_link": "r9GIdLNq2ugTv2THFahhPkkYBb1e9zK"
    },
    {
        "title": "Glazed Brussels Sprouts with Bison Bacon",
        "ingredients": [
            "8 slices bison bacon ADVERTISEMENT",
            "2 pounds Brussels sprouts, trimmed and halved ADVERTISEMENT",
            "1 tablespoon olive oil, or as needed ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup balsamic vinegar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F. Cook bison bacon over medium heat in a large skillet for 5 to 6 minutes or until crisp, turning occasionally. If necessary, drain on paper towels. Cool slightly. Cut into bite-size pieces; set aside.\nSpread Brussels sprouts in a single layer in a 15x10x1-inch baking pan. Drizzle with oil. Bake for 20 to 25 minutes or until crisp-tender, stirring once or twice.\nMeanwhile, for glaze, melt butter over medium heat in a large skillet. Cook garlic in hot butter for 30 seconds. Add balsamic vinegar, salt, and pepper. Cook and stir for 5 to 7 minutes or until sauce is thickened and reduced to about 1/4 cup. Add Brussels sprouts to skillet; stir to coat.\nTo serve, sprinkle bison bacon pieces over Brussels sprouts.\n",
        "picture_link": "5/nvyQe5288jKVqyy4bjbTeXr6QA9Qm"
    },
    {
        "title": "Tor-Tunas",
        "ingredients": [
            "2 (5 ounce) cans tuna, drained ADVERTISEMENT",
            "3 tablespoons mayonnaise ADVERTISEMENT",
            "1 1/2 tablespoons pickle relish ADVERTISEMENT",
            "1 tablespoon chopped onion ADVERTISEMENT",
            "1 tablespoon chopped celery ADVERTISEMENT",
            "1 teaspoon lemon juice, or to taste ADVERTISEMENT",
            "1 pinch garlic salt, or to taste ADVERTISEMENT",
            "4 leaves lettuce (optional) ADVERTISEMENT",
            "4 (8 inch) flour tortillas, warmed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix tuna, mayonnaise, pickle relish, onion, celery, lemon juice, and garlic salt together in a bowl. Lay 1 lettuce leaf on each tortilla. Spoon tuna mixture in a line across the middle of each tortilla. Fold opposing edges of the tortilla to overlap the filling. Roll 1 of the opposing edges around the filling in a burrito-style.\n",
        "picture_link": "pIRT.TRpr/u32BtU3wweogIusgJ6jom"
    },
    {
        "title": "Stuffed Red Pepper with Quinoa and Chickpeas",
        "ingredients": [
            "1 teaspoon olive oil, or as needed ADVERTISEMENT",
            "1 1/3 cups water ADVERTISEMENT",
            "2/3 cup quinoa ADVERTISEMENT",
            "1 (16 ounce) can garbanzo beans (chickpeas), drained and rinsed ADVERTISEMENT",
            "1 (16 ounce) can stewed tomatoes (such as Del Monte® Stewed Tomatoes with Onions, Celery, and Green Peppers) ADVERTISEMENT",
            "1/4 cup walnut pieces ADVERTISEMENT",
            "1/2 cup golden raisins ADVERTISEMENT",
            "1 bunch green onions, sliced, white parts and tops separated ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "1/2 teaspoon chili powder ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon dried mint leaves ADVERTISEMENT",
            "1 pinch ground cinnamon ADVERTISEMENT",
            "2 large red bell peppers, halved lengthwise, seeds and membrane removed ADVERTISEMENT",
            "1/4 cup crumbled goat cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish with olive oil.\nBring water and quinoa to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until quinoa is tender and water has been absorbed, 15 to 20 minutes.\nMix garbanzo beans, stewed tomatoes, walnuts, raisins, white parts of green onions, lemon juice, chili powder, garlic powder, mint, and cinnamon together in a bowl; stir in cooked quinoa.\nArrange red bell pepper halves, hollow-side facing upwards, in the prepared baking sheet. Spoon quinoa mixture into each red bell pepper half.\nBake in the preheated oven until bell peppers are tender, about 30 minutes. Spoon a few teaspoons of drippings from the bottom of the baking dish over each stuffed pepper; top each with 1 tablespoon goat cheese and green parts of green onions.\n",
        "picture_link": "Asze6y7fGe7o90SnyP/PRwre36er1M2"
    },
    {
        "title": "Shrimp Orzo Pesto",
        "ingredients": [
            "8 ounces orzo pasta ADVERTISEMENT",
            "1 tablespoon pesto, divided ADVERTISEMENT",
            "3 tablespoons extra-virgin olive oil, divided ADVERTISEMENT",
            "2 cups frozen cooked shrimp, thawed ADVERTISEMENT",
            "1/2 cup diced red bell pepper ADVERTISEMENT",
            "1 teaspoon capers ADVERTISEMENT",
            "1/4 teaspoon dried oregano ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon red pepper flakes ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1 tablespoon olive oil, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook orzo in the boiling water, stirring occasionally until cooked through but firm to the bite, about 11 minutes. Drain and transfer to a bowl; mix 2 teaspoons pesto and 2 tablespoons extra-virgin olive oil into orzo.\nHeat remaining 1 tablespoon extra-virgin olive oil in a skillet; cook and stir shrimp, red bell pepper, and capers in hot oil until shrimp is heated through, 3 to 5 minutes. Stir remaining 1 teaspoon pesto, oregano, garlic powder, red pepper flakes, salt, and pepper into shrimp mixture; cook and stir until combined, 1 to 2 minutes.\nMix orzo into shrimp mixture; sprinkle with Parmesan cheese and drizzle with olive oil.\n",
        "picture_link": "wNU9TlOVVHIzmp9xBpZh8MVhhKOghTy"
    },
    {
        "title": "Mashed Butternut Squash",
        "ingredients": [
            "2 butternut squash, halved and seeded ADVERTISEMENT",
            "1 cup water, or as needed ADVERTISEMENT",
            "3/4 cup sour cream ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 sprigs fresh parsley, or as desired ADVERTISEMENT",
            "1 tablespoon sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPierce butternut squash skin with a small knife and place cut-side down in a baking dish; pour in enough water for a depth of 1/2 inch. Cover dish with aluminum foil.\nBake in the preheated oven until squash is tender, about 1 hour.\nScoop squash into a bowl; add 3/4 cup sour cream, butter, brown sugar, cinnamon, salt, and pepper. Mash mixture using a potato masher or fork until smooth. Garnish with parsley and 1 tablespoon sour cream.\n",
        "picture_link": ".gV5gX5eQcOkLoZY6wWp6S.T09ZsUmO"
    },
    {
        "title": "Oven-Grilled Chicken and Vegetables",
        "ingredients": [
            "1 (14 ounce) bag Birds Eye® Recipe Ready Grilling Blend ADVERTISEMENT",
            "1 pound boneless, skinless chicken breast halves, cut into bite-sized pieces ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 tablespoon balsamic or red wine vinegar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon black pepper ADVERTISEMENT",
            "2 tablespoons shredded Parmesan cheese (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven broiler.\nCombine all ingredients, except Parmesan cheese, in large bowl; toss to coat.\nTransfer vegetables and chicken to broiler pan. Broil, stirring and turning vegetables once, 10 minutes or until chicken is done and vegetables are tender.* Sprinkle with Parmesan cheese.\n",
        "picture_link": "3LrlwoCzAi8kMFN1odaimoN2azKLtIu"
    },
    {
        "title": "Cherry Cobbler",
        "ingredients": [
            "3 3/4 cups cherry pie filling ADVERTISEMENT",
            "1 package yellow cake mix ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/2 cup butter, cut in small pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Line the inside of a Dutch oven with aluminum foil.\nSpread cherry pie filling in an even layer into the bottom of the Dutch oven. Sprinkle cake mix over the pie filling; top with a layer of brown sugar. Dot the top with butter pieces. Put lid on the Dutch oven.\nBake in preheated oven until the top is golden brown, 45 to 90 minutes.\n",
        "picture_link": "UZvKILMmrczqGdFvy63bE/tdHDawt.O"
    },
    {
        "title": "Beet and Cucumber Salad",
        "ingredients": [
            "1/2 cup cold water ADVERTISEMENT",
            "1/2 cup vinegar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 onion, thinly sliced ADVERTISEMENT",
            "1 cucumber, cut into bite-size pieces ADVERTISEMENT",
            "2 hard-boiled eggs, cut into bite-size pieces ADVERTISEMENT",
            "3 cups diced cooked beets ADVERTISEMENT",
            "1/3 cup mayonnaise ADVERTISEMENT",
            "1 hard-boiled egg, sliced ADVERTISEMENT",
            "1 tablespoon finely chopped dill ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix water, vinegar, and sugar together in a bowl; add onion and cucumber. Set aside to marinate, at least 20 minutes.\nCombine 2 hard-boiled eggs cut into bite-size pieces and beets together in a bowl.\nDrain liquid from onion and cucumbers. Toss onion and cucumbers with beet mixture. Stir mayonnaise into beet mixture. Arrange sliced hard-boiled egg atop salad; sprinkle with dill, salt, and pepper.\n",
        "picture_link": "tdhjPr5YxF5ElcInAKFtuNTrxeYSyG."
    },
    {
        "title": "Habanero BBQ Sauce",
        "ingredients": [
            "4 cups cider vinegar ADVERTISEMENT",
            "4 habanero peppers, minced (wear gloves) ADVERTISEMENT",
            "3 tablespoons minced onion ADVERTISEMENT",
            "2 cloves minced garlic ADVERTISEMENT",
            "1 tablespoon red pepper flakes ADVERTISEMENT",
            "1 tablespoon cayenne pepper ADVERTISEMENT",
            "2 teaspoons dry mustard ADVERTISEMENT",
            "2 teaspoons white pepper ADVERTISEMENT",
            "1 teaspoon seasoned salt ADVERTISEMENT",
            "2 cups dark brown sugar ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring vinegar to a boil in a saucepan; add habanero peppers, onion, garlic, red pepper flakes, cayenne pepper, mustard, white pepper, and seasoned salt. Allow mixture to return to a boil, then stir in brown sugar and ketchup.\nBoil sauce for 15 minutes, stirring constantly. Reduce heat to medium-low and simmer, stirring occasionally, until thickened, 30 to 45 minutes. Cool and serve.\n",
        "picture_link": "uMtIry8TEXSHXKnWeW6fYf1YBoONPWu"
    },
    {
        "title": "Brasato Stile Italiano (Pot Roast Italian Style)",
        "ingredients": [
            "1 (3 pound) bottom round roast ADVERTISEMENT",
            "2 teaspoons kosher salt, or to taste ADVERTISEMENT",
            "2 teaspoons ground black pepper, or to taste ADVERTISEMENT",
            "1 teaspoon granulated garlic, or to taste ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/2 onion, diced ADVERTISEMENT",
            "3 celery stalks, cut into 1-inch pieces ADVERTISEMENT",
            "3 large cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons dried oregano ADVERTISEMENT",
            "1 tablespoon dried basil ADVERTISEMENT",
            "1/4 cup dry cooking sherry ADVERTISEMENT",
            "1 (28 ounce) can whole tomatoes with juice, lightly crushed with hands and pulp removed ADVERTISEMENT",
            "1 (5.5 ounce) can tomato-vegetable juice cocktail (such as V8®) ADVERTISEMENT",
            "2/3 cup Cabernet Sauvignon wine ADVERTISEMENT",
            "2 cups 1-inch Yukon Gold potato chunks ADVERTISEMENT",
            "2 cups 1-inch carrot chunks ADVERTISEMENT",
            "1 1/2 onions, cut into 1-inch pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Generously season roast on all sides with salt, black pepper, and granulated garlic.\nHeat olive oil in a large pot or Dutch oven over high heat until oil begins to smoke. Add roast to pot and sear to form a crust, about 5 minutes per side. Remove roast and lower heat to medium.\nStir onions, celery, and garlic into pot; cook and stir, scraping any brown bits off the bottom, for 1 to 2 minutes. Add oregano and basil to onion mixture; cook until fragrant, about 1 minute.\nPour dry sherry into onion mixture; bring to a boil while scraping any browned bits of food off of the bottom of the pan with a wooden spoon. Cook, stirring, until the liquid is reduced, about 5 minutes. Add canned tomatoes and cook until mixture just begins to bubble.\nStir vegetable juice cocktail and wine into tomato mixture. Return roast and any accumulated juices to pot, reduce heat to low, cover, and simmer for 45 minutes.\nStir potatoes, carrots, and onions into pot and simmer until meat and vegetables are tender, about 2 1/2 hours. Remove meat to rest; remove vegetables to a bowl. Slice meat and serve topped with vegetables and sauce.\n",
        "picture_link": "DEjD4o/Jh1nsJMcaDChOQ7UrOd5uiK."
    },
    {
        "title": "Squash and Green Bean Saute Side Dish",
        "ingredients": [
            "2 yellow squash, sliced ADVERTISEMENT",
            "1 1/2 cups green beans ADVERTISEMENT",
            "1 1/2 cups halved cherry tomatoes ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "1 tablespoon dried parsley ADVERTISEMENT",
            "1/2 teaspoon ground coriander ADVERTISEMENT",
            "1/8 teaspoon salt, or to taste ADVERTISEMENT",
            "1/8 teaspoon ground black pepper, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook and stir squash and green beans in a nonstick skillet over medium heat until slightly softened, 2 to 3 minutes. Stir tomatoes, lemon juice, parsley, coriander, salt, and black pepper into squash mixture; cook and stir until tomatoes have softened, 5 to 10 minutes.\n",
        "picture_link": "WLodGE3zaAtk9yFAtoGSIGlpAATe7la"
    },
    {
        "title": "White Chocolate Fudge with Pecans",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "4 cups confectioners' sugar ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 (12 ounce) package white chocolate chips ADVERTISEMENT",
            "3/4 cup chopped pecans (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grease an 8x8-inch baking dish with butter.\nBeat cream cheese in a bowl with an electric mixer until light and fluffy. Gradually beat in confectioners' sugar and vanilla extract until smooth.\nMelt chocolate in a microwave-safe bowl in 30-second intervals, stirring after each melting, for 1 to 3 minutes (depending on your microwave). Beat chocolate into cream cheese mixture until smooth. Stir in pecans. Pour chocolate mixture into prepared baking dish. Chill until set.\n",
        "picture_link": "DN7CZtgBseYHEQuS0UzeskkpMSVlN5C"
    },
    {
        "title": "Fresh Strawberry Cheesecake Pie",
        "ingredients": [
            "1 (9 inch) unbaked deep dish pie crust ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "2 tablespoons strawberry-flavored Jell-O® mix ADVERTISEMENT",
            "1 quart fresh strawberries, hulled and sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nBake pie crust until lightly browned, about 10 minutes.\nRemove crust from oven and turn oven temperature down to 350 degrees F (175 degrees C).\nBeat cream cheese, eggs, 1/2 cup sugar, and 2 tablespoons lemon juice in a bowl until smoothly combined.\nPour filling into crust.\nBake until filling is set, about 30 minutes.\nRemove from oven and let cool completely.\nWhisk together 1/2 cup sugar, cornstarch, water, 1 tablespoon lemon juice, and strawberry gelatin in a saucepan until smooth; place over medium heat and bring to a simmer. Cook, stirring constantly, until the gelatin has dissolved and the glaze has thickened, 5 to 10 minutes. Remove from heat and allow to cool slightly.\nArrange the sliced strawberries atop the cheese filling.\nPour warm glaze over sliced strawberries. Chill thoroughly in refrigerator before serving.\n",
        "picture_link": "CdUZ6TixX/x6qpCWEJvFk/89fco63OC"
    },
    {
        "title": "Spicy American Spanish Rice",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "1 cup long-grain converted rice ADVERTISEMENT",
            "1 green bell pepper, diced ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "2 (15 ounce) cans tomato sauce ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes with green chilies (such as RO*TEL®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a skillet over medium heat. Cook and stir rice in the melted butter until rice is lightly browned, 3 to 4 minutes. Stir bell pepper and onion into rice and cook until bell pepper is softened and onion is translucent, 5 to 8 minutes.\nBreak the ground beef into the rice mixture; cook and stir until beef is completely browned, 8 to 10 minutes. Stir tomato sauce and diced tomatoes into ground beef mixture. Cover, reduce heat, and simmer until rice is tender and liquid is absorbed, about 20 minutes.\n",
        "picture_link": "mDn0ZMSewHNIuaigXB9xNqqbprKxqyu"
    },
    {
        "title": "Thai Stuffed Tofu",
        "ingredients": [
            "2 (12 ounce) packages extra firm tofu ADVERTISEMENT",
            "1/4 cup dried shiitake mushrooms ADVERTISEMENT",
            "1 zucchini, coarsely chopped ADVERTISEMENT",
            "1 onion, halved ADVERTISEMENT",
            "3 cloves garlic ADVERTISEMENT",
            "1 jalapeno pepper, seeded and coarsely chopped ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "2 tablespoons minced fresh ginger, or to taste ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1 tablespoon hoisin sauce ADVERTISEMENT",
            "1/4 cup shredded cabbage ADVERTISEMENT",
            "1/4 cup vegetable oil, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Drain tofu and cut each piece into 4 squares; cut each square diagonally into 2 triangles. Set tofu triangles aside.\nPlace shiitake mushrooms into a bowl of hot water and allow to rehydrate until moist and plump, about 20 minutes. Cut out woody stems and finely chop mushrooms.\nPlace zucchini, onion, garlic, and jalapeno pepper into a food processor and process until the vegetables are almost a paste; transfer to a bowl and stir in shiitake mushrooms, egg, soy sauce, ginger, cornstarch, and hoisin sauce. Fold shredded cabbage into the stuffing.\nHeat 2 tablespoons vegetable oil in a large skillet over medium heat. Pat tofu triangles dry with paper towels and pan-fry in the hot oil until browned on all sides except 1 narrow side for stuffing, 2 to 3 minutes frying time per side. Remove tofu triangles and let cool until you can handle them.\nWith a sharp paring knife, cut a slit into the unbrowned side of a tofu triangle; scoop out center of the tofu with a grapefruit spoon, leaving the walls of the triangle about 1/4-inch thick. Use a spoon to fill each triangle generously with the stuffing, letting stuffing mound out of the tofu piece.\nHeat remaining 2 tablespoons vegetable oil in skillet over medium heat; place tofu triangles, stuffing sides down, into the hot oil and pan-fry until stuffing edge is browned and stuffing is hot and set inside, about 5 minutes. Turn triangles on their sides and refry for a minute or two in the hot oil to rewarm.\n",
        "picture_link": "7ugGqPiqCnDBT7semlk.Mk8HxTo12jW"
    },
    {
        "title": "Mean Green Guacamole Salsa",
        "ingredients": [
            "10 fresh tomatillos, husks removed ADVERTISEMENT",
            "2 fresh jalapeno peppers, stems removed ADVERTISEMENT",
            "1 bunch fresh cilantro, stems trimmed ADVERTISEMENT",
            "3 avocados, peeled and pitted ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a pot of water to a boil and stir in tomatillos and jalapenos. Boil until tomatillos turn bright green and soft, about 10 minutes.\nPlace cilantro, avocados, cooked tomatillos, and cooked jalapenos into a blender, working in batches if necessary. Blend until smooth, 1 to 2 minutes. Add about 1 tablespoon of tomatillo cooking water, or as needed, if salsa is too thick.\nStop the blender, and season the salsa with garlic powder and salt to taste. Blend again briefly to mix in the seasonings. Transfer to a bowl for serving.\n",
        "picture_link": "b0XLcoW9P3ZWxAg.OxdLZpGigetovN2"
    },
    {
        "title": "Miki's Jicama (Pico de Gallo Salsa)",
        "ingredients": [
            "12 roma (plum) tomatoes, finely diced ADVERTISEMENT",
            "2 jicamas, peeled and finely diced ADVERTISEMENT",
            "4 poblano peppers, finely diced ADVERTISEMENT",
            "1 red onion, finely diced ADVERTISEMENT",
            "6 jalapeno peppers, seeded and finely diced ADVERTISEMENT",
            "3 tablespoons chopped garlic ADVERTISEMENT",
            "4 limes, juiced ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "3 tablespoons white balsamic vinegar ADVERTISEMENT",
            "1/4 cup salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss diced tomatoes, jicamas, poblano peppers, red onions, and jalapeno peppers with garlic, lime juice, cilantro, white balsamic vinegar, and salt together in a large mixing bowl.\n",
        "picture_link": "yzTXEB2ZP5VtrzZpUlqNiGh8M8LyRAi"
    },
    {
        "title": "Chicken Curry and Potatoes",
        "ingredients": [
            "1 (3 pound) chicken, cut into pieces ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "8 cloves garlic, chopped ADVERTISEMENT",
            "1/4 cup mild curry powder ADVERTISEMENT",
            "2 tablespoons hot curry powder ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "5 russet potatoes, peeled and cut into 1-inch pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken into a large saucepan and cover with water; bring to a boil. Reduce heat to medium and simmer until chicken is no longer pink in the center, about 20 minutes.\nMeanwhile, heat vegetable oil in a large skillet over medium heat; cook and stir onion and garlic until onion is tender, about 5 minutes. Stir mild curry powder, hot curry powder, black pepper, and salt into onion mixture; continue to cook and stir for 5 minutes, then transfer mixture to chicken and broth.\nStir potatoes into chicken mixture. Simmer until potatoes are tender, about 20 minutes more.\n",
        "picture_link": "36r52fPXGFKO29Oa.AMJP4GGApH483e"
    },
    {
        "title": "Spicy Mac and Cheese Soup",
        "ingredients": [
            "2 (7.25 ounce) packages macaroni and cheese mix ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "2 cups chicken broth ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes with green chile peppers ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon dry mustard powder ADVERTISEMENT",
            "1/2 teaspoon ground black pepper, or to taste ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "3/4 cup sour cream, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil and stir in macaroni from the packages, retaining cheese mix packets for later use. Cook macaroni at a rolling boil over medium heat, stirring occasionally, until tender but still slightly firm, 8 to 10 minutes. Drain and rinse macaroni with cold water. Return cooked macaroni to the pot.\nMix butter, chicken broth, and tomatoes with macaroni and bring mixture to a simmer over medium heat; stir in garlic powder, cumin, dry mustard, pepper, and contents of cheese mix packets. Stir in milk and reduce heat to low; heat soup almost to a simmer. Do not boil.\nServe soup in bowls and top each serving with about 2 tablespoons of sour cream.\n",
        "picture_link": "FbiQGACqDZrL70kqCxAy1pVUC7UeLSK"
    },
    {
        "title": "Brownie Cupcakes with Hazelnut Buttercream",
        "ingredients": [
            "Brownies: ADVERTISEMENT",
            "1 (19.5 ounce) box Pillsbury® Family Size Chocolate Fudge Brownie Mix ADVERTISEMENT",
            "1/2 cup Crisco® Pure Vegetable Oil ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "2 large eggs ADVERTISEMENT",
            "1/2 cup chopped hazelnuts, plus ADVERTISEMENT",
            "additional chopped hazelnuts, for garnish ADVERTISEMENT",
            "Hazelnut Frosting: ADVERTISEMENT",
            "1/4 cup Crisco® All-Vegetable Shortening ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "1/3 cup Jif® Chocolate Flavored Hazelnut Spread ADVERTISEMENT",
            "1 1/4 cups powdered sugar ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1 tablespoon milk, or more as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 350 degrees F. Line 12 muffin cups with paper baking cups. Prepare brownie mix according to package directions using oil, water and eggs. Stir in 1/2 cup of chopped hazelnuts. Fill baking cups 3/4 full.\nBake 30 to 32 minutes or until centers are set. Cool 2 minutes. Remove from pan. Cool completely on wire racks.\nFor Frosting: Beat shortening, butter and chocolate hazelnut spread in a large bowl, with an electric mixer on medium speed until smooth. Add powdered sugar, vanilla, salt and 1 tablespoon of milk. Beat slowly until combined. Beat on high, 3 to 5 minutes, adding an additional 1 tablespoon milk at a time until desired consistency is achieved.\nFrost cupcakes by placing frosting into corner of resealable plastic bag. Cut 1/2-inch off corner of bag. Starting at outside edge, work in circular motion to build up frosting moving towards center, creating a swirl effect. Sprinkle with reserved chopped hazelnuts.\n",
        "picture_link": "w.r0SNHy//kDBOemZ3.gbNrllV7glk6"
    },
    {
        "title": "Savory Gorgonzola Bread Pudding",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "4 cups cubed Italian bread ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1/2 onion, diced ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 cup chicken stock ADVERTISEMENT",
            "1/4 cup heavy cream ADVERTISEMENT",
            "1 teaspoon fresh thyme leaves ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "1 ounce crumbled Gorgonzola cheese ADVERTISEMENT",
            "1 tablespoon crumbled Gorgonzola cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 200 degrees F (95 degrees C).\nGenerously grease 4 ramekins with 1 tablespoon butter. Set aside.\nPlace bread cubes in a single layer on a baking sheet and bake in the preheated oven until dry, about 20 minutes.\nPreheat oven to 400 degrees F (200 degrees C).\nMelt 1 tablespoon butter in a skillet over medium heat. Stir in onion and salt; cook, stirring, until onions are light golden brown, 5 to 7 minutes.\nStir chicken stock, cream, thyme, and black pepper into skillet; bring mixture to a boil and remove from heat.\nStir bread cubes and chicken stock mixture in a large bowl until well combined. Stir in 1 ounce crumbled gorgonzola cheese. Divide mixture evenly between 4 prepared ramekins. Top each with a small crumble of gorgonzola.\nBake in the preheated oven until golden brown, 15 to 20 minutes.\n",
        "picture_link": "9fPxNzLolXRKTOD/mddCE1ruTTmvqkq"
    },
    {
        "title": "Lew's Famous Lobster Pot Pie",
        "ingredients": [
            "1 (3 ounce) package dry crab boil (such as Zatarain's® Crab & Shrimp Boil) ADVERTISEMENT",
            "5 small lobster tails ADVERTISEMENT",
            "1 (15 ounce) package double crust ready-to-use pie crust (such as Pillsbury®) ADVERTISEMENT",
            "5 tablespoons butter ADVERTISEMENT",
            "1/2 cup diced onion ADVERTISEMENT",
            "1/2 cup diced celery ADVERTISEMENT",
            "1/3 cup all-purpose flour ADVERTISEMENT",
            "1 1/2 cups chicken broth ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "1 teaspoon seafood seasoning, such as Old Bay™ ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1 1/2 cups frozen mixed vegetables, thawed ADVERTISEMENT",
            "1/2 cup diced potato ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nBring water and crab boil bag to a boil in a large saucepan.\nStir in lobster tails and boil until they turn bright red and the meat becomes opaque, 5 to 8 minutes.\nDrain and cool lobster tails. Remove shells, and dice lobster meat. Transfer to a bowl.\nPlace a pie crust into the bottom of a 9-inch pie pan and set aside.\nHeat butter in a skillet over medium heat.\nCook and stir onion and celery in butter until tender, 5 to 8 minutes.\nStir flour into onion and celery mixture until vegetables are coated with flour.\nCombine chicken broth and milk in a bowl.\nSlowly stir broth and milk into onion, celery, and flour mixture until thickened.\nStir seafood seasoning, garlic powder, and ground black pepper into thickened sauce.\nMix thawed vegetables, diced potato, and cooked lobster meat into the sauce; simmer until potato is tender, about 8 minutes.\nPour lobster filling into the prepared pie crust.\nCover with remaining pie crust ,and seal by crimping the edges of the two crusts together.\nCut an 'X' into top of pie crust with a sharp knife to allow steam to escape during baking.\nBake pie in the preheated oven until crust is golden brown, 40 to 45 minutes.\nRemove from oven and let stand for 10 to 15 minutes to allow sauce to thicken.\n",
        "picture_link": "YDrEVLaM9Gkls0AbCBoFClwGricXGLi"
    },
    {
        "title": "Healthier Juicy Roasted Chicken",
        "ingredients": [
            "1 1/4 pounds winter squash, peeled, seeded and cut into chunks ADVERTISEMENT",
            "1 pound fingerling potatoes, split lengthwise ADVERTISEMENT",
            "1/2 pound carrots, split lengthwise and cut into 2-inch pieces ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 (3 pound) whole chicken, giblets removed ADVERTISEMENT",
            "1/2 cup butter, divided ADVERTISEMENT",
            "1 stalk celery, leaves removed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (218 degrees C).\nToss squash, potatoes, carrots, olive oil, salt, and pepper in a roasting pan. Spread into a single layer and place a V-rack on top. Season chicken generously inside and out with salt and pepper. Place 1 tablespoon butter in the chicken cavity. Arrange dollops of remaining butter between skin and flesh of breast meat. Cut celery into 3 or 4 pieces and place in cavity of chicken.\nBake in preheated oven for 30 minutes. Turn heat down to 375 degrees F (190 degrees C) and continue baking until no longer pink at the bone and juices run clear, about 30 minutes. An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 165 degrees F (74 degrees C). Remove the chicken from the oven, cover with a doubled sheet of aluminum foil, and allow to rest in a warm area for 10 minutes before slicing.\n",
        "picture_link": "CSeqRIXpb7ho450ooarODompTssR.pm"
    },
    {
        "title": "Barley Black Bean Burgers",
        "ingredients": [
            "1/2 cup quick-cooking barley ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 (16 ounce) can black beans, drained and rinsed ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 cup mushrooms, minced ADVERTISEMENT",
            "1/2 onion, minced ADVERTISEMENT",
            "1/2 red bell pepper, minced ADVERTISEMENT",
            "1/4 cup fresh parsley, minced ADVERTISEMENT",
            "2 large eggs ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 cup bread crumbs, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for high heat and lightly oil the grate. Generously grease a sheet of aluminum foil with oil.\nBring barley and water to a boil in a saucepan. Cover, reduce heat to low, and simmer until the barley is tender, 10 to 15 minutes.\nMash black beans with a fork in a large bowl until thick and pasty. Stir barley, Cheddar cheese, mushrooms, onion, red bell pepper, parsley, eggs, garlic, salt, and black pepper into mashed black beans. Mix enough bread crumbs into bean mixture to form a sticky batter that holds together.\nDivide batter into 4 to 6 patties; place on prepared aluminum foil.\nGrill patties on the aluminum foil for about 8 minutes on each side.\n",
        "picture_link": "xEay8pcjJgH7.hpw6tSga8s52r7JxnO"
    },
    {
        "title": "Mocha Punch with Ice Cream",
        "ingredients": [
            "1 1/2 quarts water ADVERTISEMENT",
            "1/2 cup powdered chocolate drink mix ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 cup instant coffee granules ADVERTISEMENT",
            "1/2 gallon vanilla ice cream ADVERTISEMENT",
            "1/2 gallon chocolate ice cream ADVERTISEMENT",
            "1 cup frozen whipped topping, thawed ADVERTISEMENT",
            "1/4 cup shaved milk chocolate (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water to a boil in a large saucepan; remove from heat and stir in chocolate drink mix, sugar, and coffee granules. Cover and refrigerate for 4 hour or overnight.\nPour chocolate mixture in a large punch bowl about 30 minutes before serving. Scoop vanilla and chocolate ice cream into the bowl, stirring until partially melted. Garnish with dollops of whipped topping and shaved milk chocolate.\n",
        "picture_link": "pp2jf04CxYReHvi68qa7pjhjYV56irW"
    },
    {
        "title": "Cosmopolitan Cocktail",
        "ingredients": [
            "1 1/2 fluid ounces vodka ADVERTISEMENT",
            "1/4 fluid ounce lime juice ADVERTISEMENT",
            "1/4 fluid ounce triple sec ADVERTISEMENT",
            "1/4 fluid ounce cranberry juice ADVERTISEMENT",
            "1 cup ice ADVERTISEMENT",
            "1 lime wedge for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine vodka, lime juice, triple sec, and cranberry juice in a cocktail shaker. Add ice, cover and shake until chilled. Strain into a chilled cocktail glass.\nGarnish with a lime wedge.\n",
        "picture_link": "8.WdkRyRmKal9wHjyidZx4AAp4/F726"
    },
    {
        "title": "Hot Off the Grill Potatoes",
        "ingredients": [
            "3 tablespoons Melt® Organic Buttery Spread ADVERTISEMENT",
            "5 medium potatoes, scrubbed and thinly sliced ADVERTISEMENT",
            "1/4 cup chopped green onions ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "2 tablespoons chopped fresh dill ADVERTISEMENT",
            "2 tablespoons chopped fresh chives ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon paprika ADVERTISEMENT",
            "1/4 teaspoon black pepper ADVERTISEMENT",
            "3 slices bacon, cooked and crumbled (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fold a 48 by 18 inch piece of heavy foil in half to make a 24 by 18 inch rectangle. Grease the foil with about 1 Tbsp of Melt(R) Organic Buttery Spread\nPlace the potatoes in the center of the foil. Sprinkle with all of the herbs, cheese, and spices. Top with bacon if using. Dot with the remaining 2 Tbsp Melt. Bring up two opposite edges of the foil and seal with double fold. Fold remaining ends to completely enclose the potatoes, leaving room for steam to build.\nFor a gas grill, preheat the grill. Reduce heat to medium. Place foil packet on grill rack over heat. Cover and grill for 30 to 40 minutes or until potatoes are tender, turning packet every 10 minutes. For a charcoal grill, place packet over medium coals for the same amount of time.\n",
        "picture_link": "O3AkdDneWdlsxfI3rhVhrEoqGq.pGGi"
    },
    {
        "title": "Valentine's Day Steak Rub",
        "ingredients": [
            "2 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "2 teaspoons dried oregano ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon onion powder ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together the cinnamon, oregano, chili powder, cumin, salt, black pepper, garlic powder, onion powder, and cayenne pepper in a bowl. Place the mixture into an airtight container or empty seasoning bottle.\n",
        "picture_link": "mRVsrZOLfkG9XzUaP3rbBV4AOhbZHKG"
    },
    {
        "title": "Strawberry Shortcake Drink ",
        "ingredients": [
            "1/4 cup frozen strawberries, thawed ADVERTISEMENT",
            "1 1/4 fluid ounces amaretto liqueur ADVERTISEMENT",
            "2 (1/2 cup) scoops vanilla ice cream ADVERTISEMENT",
            "1 dash vanilla extract ADVERTISEMENT",
            "1/2 cup crushed ice ADVERTISEMENT",
            "1/4 fluid ounce vanilla-flavored vodka (optional) ADVERTISEMENT",
            "1 tablespoon whipped cream ADVERTISEMENT",
            "1 fresh strawberry ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place thawed frozen strawberries, amaretto liqueur, vanilla ice cream, vanilla extract, crushed ice, and vanilla vodka into a blender.\nCover and blend until smooth.\nPour into a glass and garnish with whipped cream and a fresh strawberry.\n",
        "picture_link": "Jq6MZ8ZnU5dEq4pjLIfHLz8aH/nQFBm"
    },
    {
        "title": "Baybreeze Cocktail",
        "ingredients": [
            "1 cup ice ADVERTISEMENT",
            "2 fluid ounces cranberry juice ADVERTISEMENT",
            "2 fluid ounces pineapple juice ADVERTISEMENT",
            "1 1/2 fluid ounces vodka ADVERTISEMENT",
            "1 lime wedge for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine ice, cranberry juice, pineapple juice, and vodka in a highball glass. Garnish with a lime wedge.\n",
        "picture_link": "jCAGVOkXq68bSMtG6icYjbk0IsGN3LC"
    },
    {
        "title": "Bacon Bourbon Burgers",
        "ingredients": [
            "1/2 pound lean ground beef ADVERTISEMENT",
            "1 tablespoon bourbon (such as Four Roses®) ADVERTISEMENT",
            "2 teaspoons Worcestershire sauce ADVERTISEMENT",
            "2 teaspoons brown sugar ADVERTISEMENT",
            "2 teaspoons steak seasoning (such as Montreal Steak Seasoning®) ADVERTISEMENT",
            "1/2 teaspoon garlic salt ADVERTISEMENT",
            "2 slices cooked bacon, cut into halves ADVERTISEMENT",
            "2 slices Cheddar cheese ADVERTISEMENT",
            "2 hamburger buns, split ADVERTISEMENT",
            "2 tomato slices ADVERTISEMENT",
            "2 leaves lettuce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for high heat and lightly oil the grate.\nMix ground beef, bourbon, Worcestershire sauce, brown sugar, steak seasoning, and garlic salt in a bowl; divide and shape into 2 patties.\nCook on the preheated grill for about 5 minutes; turn, top each burger with bacon and Cheddar cheese, and continue cooking until the burgers are cooked to your desired degree of doneness, about 5 minutes more for well done. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C). Serve on split buns topped with tomato and lettuce.\n",
        "picture_link": "d04sc3N4G7oLJEkd1OnHQ3SdIEKZOZ."
    },
    {
        "title": "Brie's Very Vanilla Dog Treats",
        "ingredients": [
            "2 1/4 cups whole wheat flour ADVERTISEMENT",
            "1/2 cup cornmeal ADVERTISEMENT",
            "1/2 cup rolled oats ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/2 cup unsweetened applesauce ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "3 tablespoons low-sodium peanut butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 400 degrees F (200 degrees C).\nLightly grease 2 large baking sheets.\nMix the whole wheat flour, cornmeal, rolled oats, and baking powder together in a bowl.\nLightly mix the water, applesauce, and vanilla extract into the flour mixture.\nStir the eggs and peanut butter into the mixture.\nTurn the dough onto a floured surface and knead until no longer sticky, about 1 minute.\nRoll out the dough to 1/4-inch thickness; cut into 75 small squares and arrange onto baking sheets.\nBake in the preheated oven for 15 minutes. Turn the oven off and allow the treats to sit in the oven as it cools another 30 minutes.\nRemove the treats from the oven; allow the treats to cool on the baking sheets for 10 minutes before removing to a wire rack to cool completely.\n",
        "picture_link": "eoMAVSQ.mYtCMbc0Xu3H1iGQvKTXNtO"
    },
    {
        "title": "Kelaguen Chicken",
        "ingredients": [
            "1 tablespoon salt ADVERTISEMENT",
            "1 (3 pound) whole chicken, cut into pieces ADVERTISEMENT",
            "1/2 cup lemon juice ADVERTISEMENT",
            "1 cup grated fresh coconut ADVERTISEMENT",
            "1 hot chile pepper, minced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sprinkle chicken with salt and place pieces on a broiler pan. Broil for about 10 minutes, turn and broil for another 5 minutes or until chicken is cooked, but still moist.\nBone, and finely chop cooked chicken pieces.\nIn a medium bowl combine the chicken, lemon juice, coconut, and hot peppers. Chill for at least one hour and serve.\n",
        "picture_link": "/ZFKp7jRGBIWLgX25V.8NxayZXjrl7u"
    },
    {
        "title": "Old Fashioned Kentucky Nut Cake",
        "ingredients": [
            "2/3 cup shortening ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "2 2/3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/3 cups chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sift together flour, salt, and baking powder.\nIn a large bowl, cream shortening and sugar until fluffy. Beat in eggs one at a time. Combine milk and vanilla, and add alternately with flour mixture to egg mixture. Fold in nuts. Pour into a greased and floured 9 x 13 inch cake pan.\nBake at 350 degrees F (175 degrees C) for 35 to 40 minutes. Cool on a wire rack.\n",
        "picture_link": "e2VMZUlB2fyHbnMz1pSFLau3JWYPR5C"
    },
    {
        "title": "The Most Popular Cake in America Cake",
        "ingredients": [
            "1 egg ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup sour milk ADVERTISEMENT",
            "1/3 cup lard ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9 inch square cake pan.\nBeat egg until light. Gradually add sugar, lard, milk and baking soda.\nSift together flour, cocoa, salt and baking powder. Add to batter and mix in. Add vanilla.\nBake at 350 degrees F (175 degrees C) for 30 minutes or until a toothpick inserted into cake comes out clean.\n",
        "picture_link": "jkjhxx9kEW9YJdn.YsQeMP6RaZ3XXDS"
    },
    {
        "title": "Apple Walnut Pound Cake",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "2 tablespoons buttermilk ADVERTISEMENT",
            "1 cup chopped apples ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Butter a 9x5x3-inch pan. Preheat oven to 350 degrees F (175 degrees C).\nCream butter, add sugar slowly, and continue to beat until light and lemon-colored. Beat in eggs.\nSift flour with salt, baking soda, and baking powder. Add to the butter mixture alternately with the buttermilk, beginning and ending with the dry ingredients. Stir in the apples, nuts, and vanilla. Spoon batter into prepared pan.\nBake in a preheated 350 degree F (175 degrees C) oven for 50-60 minutes, until the loaf pulls away slightly from the sides of the pan or until a cake tester comes out clean. Cool in the pan for about 5 minutes, then loosen from pan and turn onto a rack to cool completely before slicing.\n",
        "picture_link": "Aed6OCxCEABRPY.F7fHTZlsLBwj3SLa"
    },
    {
        "title": "Food For The Gods II",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 cups chopped walnuts ADVERTISEMENT",
            "1 cup pureed dates ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan.\nMelt butter. Add sugar, eggs, dates and nuts.\nMix flour with baking soda. Add to date mixture and combine.\nSpread into 9x13 inch pan. Bake at 350 degrees F (175 degrees C) for 30 minutes. Cool and cut into bars.\n",
        "picture_link": "R.iRIEnBGs5gQH/8boN7oso36supIse"
    },
    {
        "title": "Southern Chicken Salad",
        "ingredients": [
            "1/2 cup mayonnaise ADVERTISEMENT",
            "3 tablespoons buttermilk ADVERTISEMENT",
            "1/4 cup minced green onions ADVERTISEMENT",
            "2 tablespoons chopped fresh dill ADVERTISEMENT",
            "1/4 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1 pound skinless, boneless chicken breasts ADVERTISEMENT",
            "1 cup dry white wine ADVERTISEMENT",
            "1 sprig fresh dill weed ADVERTISEMENT",
            "1/8 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1 1/2 cups seedless grapes ADVERTISEMENT",
            "1 cup thinly sliced celery ADVERTISEMENT",
            "8 leaves red leaf lettuce - rinsed ADVERTISEMENT",
            "1/2 cup chopped salted cashews ADVERTISEMENT",
            "5 sprigs fresh dill weed, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "TO MAKE DRESSING: Whisk the mayonnaise, green onions, buttermilk, dill and ground black pepper in a small bowl to blend (can be made 1 day ahead). Cover and chill.\nTO MAKE SALAD: Arrange the chicken in a heavy, medium size skillet. Add the wine, dill and ground black pepper. Season with salt. If necessary, add water to cover the chicken. Simmer over medium low heat until chicken is just cooked through, turning once (about 11 minutes). Transfer chicken to a plate and let cool.\nCut chicken into 1/2 inch pieces. Place in a large bowl. Add the grapes and the celery and mix in the dressing to thoroughly coat the mixture. Season with salt and pepper to taste. Cover and refrigerate for at least 20 minutes to develop the flavors. (Can be prepared up to 3 hours ahead).\nArrange the lettuce leaves on plates, mound on the salad and sprinkle with nuts. Garnish with fresh dill and serve.\n",
        "picture_link": "Y6hWO4JekRGYbduhaRM8HuGNtAFY1ZC"
    },
    {
        "title": "Applesauce Rum-Raisin Cake",
        "ingredients": [
            "1/2 cup golden raisins ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1/3 cup dark rum ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 cup whole wheat flour ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 tablespoon unsweetened cocoa powder ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1 1/2 cups applesauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place all the raisins in a small bowl with the rum and let sit overnight or at least 4 hours.\nPreheat oven to 375 degrees F (190 degrees C). Grease and flour a 9x13-inch baking pan.\nIn a large bowl, beat butter and sugar with an electric mixer until light and fluffy. Beat in the eggs one at a time; mix in applesauce.\nIn another bowl, stir together the flours, cornstarch, baking soda, cinnamon, nutmeg, salt, and cocoa. Gradually add flour into the batter, mixing until fully incorporated. Stir in the raisins, along with any rum that was not absorbed, and the walnuts. Turn batter into the prepared pan.\nBake in preheated oven until a tester inserted in the middle of the cake comes out clean, about 25 minutes. Cool on wire rack.\n",
        "picture_link": "CzPvbcKZdGduTEajrdDz/YuWs7lhXwW"
    },
    {
        "title": "Taffy Apple Cake",
        "ingredients": [
            "1 1/2 cups butter, softened ADVERTISEMENT",
            "4 1/2 cups sifted confectioners' sugar ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "3 1/4 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground allspice ADVERTISEMENT",
            "16 individually wrapped caramels, unwrapped ADVERTISEMENT",
            "1 1/2 cups apples - peeled, cored and diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease one 10 inch tube or bundt pan.\nUnwrap and cut each caramel into 8 pieces.\nIn a large mixer bowl cream the butter, confectioners' sugar and vanilla until light and fluffy. Add the eggs, one at a time, beating well after each one.\nGradually add the flour, ground cinnamon and ground allspice to the egg mixture. Blend at low speed until thoroughly combined. By hand stir in the caramel pieces and the chopped apples. Pour the batter into the prepared pan.\nBake at 325 degrees F (165 degrees C) for 85 to 90 minutes or until cake tester comes out clean. Cool upright in pan for 15 minutes before inverting onto a serving platter. Serve cake warm or cool. If desired top slices with ice cream and caramel sauce. Alternately bake in a 9x13 inch cake pan for 75 to 80 minutes.\n",
        "picture_link": "Wluk.tqISzL7DaCoxyoqi98Z0hCdazy"
    },
    {
        "title": "Pecan Cheesecake",
        "ingredients": [
            "2 cups graham cracker crumbs ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "3 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup pecan liqueur ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1/4 cup confectioners' sugar ADVERTISEMENT",
            "1 teaspoon pecan liqueur ADVERTISEMENT",
            "1 cup ground pecans ADVERTISEMENT",
            "1/2 cup finely ground graham cracker crumbs ADVERTISEMENT",
            "1 1/2 tablespoons white sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "3/4 cup pecan halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine 2 cups graham cracker crumbs, 1/2 cup white sugar, 1 teaspoon cinnamon, and melted butter or margarine. Press firmly into the bottom of a 10 inch springform pan.\nIn a large bowl, blend the cream cheese and 1 1/4 cup white sugar with an electric mixer at medium speed until well blended. Add the eggs, one at a time, blending well. Add vanilla extract. Add 1/2 cup liqueur, and blend for 5 minutes. Pour the filling on top of the crust\nPreheat the oven to 350 degrees F (175 degrees C). Bake for approximately 1 hour. The cake should be golden brown, and will have risen to the top of the pan. Turn off the heat, and let cool in the oven for 2 1/2 hours. When cool, remove the rim of the springform pan.\nIn a small bowl, mix the sour cream, confectioners' sugar, and 1 teaspoon liqueur together. Spoon onto the top of the cooled cheesecake.\nIn a small bowl, combine the finely ground pecans, finely ground graham cracker crumbs, 1 1/2 tablespoons white sugar, and cinnamon. Sprinkle the pecan topping on the cheesecake. Carefully press the pecan topping into the sides of the cheesecake. Garnish the top and sides with pecan halves.\n",
        "picture_link": "M1a1Q5rDPCBhHIHBGntQOyED3Q2soW."
    },
    {
        "title": "Mocha Blanca Cheesecake",
        "ingredients": [
            "Crust: ADVERTISEMENT",
            "1 cup crushed vanilla wafers ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 tablespoon unsweetened cocoa powder ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "1 tablespoon instant coffee powder ADVERTISEMENT",
            "2 tablespoons coffee-flavored liqueur (such as Kahlua®) ADVERTISEMENT",
            "4 (1 ounce) squares semisweet chocolate, grated ADVERTISEMENT",
            "2 pounds cream cheese, room temperature ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "4 eggs, room temperature ADVERTISEMENT",
            "Topping: ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon coffee-flavored liqueur (such as Kahlua®) ADVERTISEMENT",
            "1 teaspoon unsweetened cocoa powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To make the crust, combine vanilla wafer crumbs, 2 tablespoons melted butter, 1 tablespoon sugar, and 1 tablespoon cocoa; toss with a fork to mix. Press into bottom of a 9-inch springform pan. Wrap the pan bottom in aluminum foil. Refrigerate while preparing the filling.\nPreheat oven to 350 degrees F (175 degrees C). Bring a kettle of water to a boil.\nGrate or finely chop the semisweet chocolate and put it into the top of a double boiler. Place over hot water. When almost melted, remove from heat and stir until completely melted. (Chocolate can also be melted in a microwave in 30-second increments, stirring frequently.) Set aside.\nCombine cream cheese and 1 cup sugar; mix with an electric mixer until well blended.\nDissolve coffee powder in 2 tablespoons coffee liqueur. Add the coffee mixture and the cooled melted chocolate to the cream cheese batter; mix until combined.\nAdd the eggs one at a time, mixing just until incorporated. Pour the filling into the prepared crust; tap the pan on the countertop to smooth the surface and settle the batter.\nPlace springform pan in a large baking dish. Place baking dish on oven rack; carefully pour boiling water into the baking pan until it comes halfway up the sides of the cheesecake pan.\nBake in a preheated oven for 1 hour.\nRemove the pan from the oven, and remove the springform pan from the water bath; discard any remaining water.\nFor the topping, stir together the sour cream, 2 tablespoons sugar, 1 teaspoon coffee liqueur and 1 teaspoon of cocoa. Spread over the top of the hot cheesecake. Return cheesecake to the oven for 5 minutes. Remove from oven and allow to cool to room temperature.\nRefrigerate at least 4 hours or overnight before serving.\n",
        "picture_link": "j.7W2BC9hNZfEm/o9yUMsJ1zmknWiny"
    },
    {
        "title": "Zucchini Cake IV",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "2 cups grated zucchini ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour 4 loaf pans.\nIn a medium bowl, mix together flour, salt, baking powder, baking soda and cinnamon. Set aside.\nIn a large bowl, combine sugar, oil, eggs and vanilla. Beat until smooth. Add flour mixture, and beat until smooth. Fold in walnuts and grated zucchini.\nDivide batter into 4 well greased loaf pans. Bake at 350 degrees F (175 degrees C) for 60 minutes or until toothpick inserted into middle of cake comes out clean.\n",
        "picture_link": "TqW0ptqb/VO0HX/86hISrLIfaHdWQ7m"
    },
    {
        "title": "Pecan Pound Cake",
        "ingredients": [
            "1 1/2 cups butter ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon butter flavored extract ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "1/4 cup confectioners' sugar for dusting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream together butter and sugar. Add eggs one at a time beating after each one.\nBlend in the flour, vanilla extract, butter extract and pecans. Pour into a greased and floured bundt or tube pan.\nBake in a preheated 325 degrees F (165 degrees C) oven for 1 to 1 1/2 hours or until a toothpick inserted comes out clean. Remove from oven and remove cake from pan right away, cool then sprinkle with confectioners' sugar.\n",
        "picture_link": "njDUbEu9kqdtzXb87by9Kk7Lgtoggeq"
    },
    {
        "title": "Blackberry Jam Cake I",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 egg yolks ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon unsweetened cocoa powder ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground allspice ADVERTISEMENT",
            "1 cup blackberry preserves ADVERTISEMENT",
            "1 cup sifted confectioners' sugar ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1 tablespoon butter, softened ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine flour, baking powder, salt, cocoa, cinnamon, and allspice.\nDissolve soda in buttermilk, stirring well.\nCream butter or margarine and sugar, beating well. Add egg yolks, beating mixture well. Mix flour mixture into the creamed mixture alternately with the buttermilk mixture, beginning and ending with flour mixture. Fold in blackberry jam. Pour batter into a greased and floured 10 inch bundt pan.\nBake at 350 degrees F (175 degrees C) for 45 to 50 minutes, or until cake tests done. Cool in pan for 15 minutes. Remove from pan, and cool complete.\nCombine confectioners' sugar, milk, butter or margarine, and vanilla. Beat until mixture is smooth. Spoon over cooled cake\n",
        "picture_link": "SUk0Mw3x8sHfOH02lycYtDcKugUvG3C"
    },
    {
        "title": "War Cake",
        "ingredients": [
            "1 cup packed brown sugar ADVERTISEMENT",
            "1 1/4 cups water ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup chopped candied citron ADVERTISEMENT",
            "1/3 cup shortening ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "5 teaspoons baking powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking pan.\nIn a large saucepan over medium heat, combine brown sugar and water. Add raisins, nuts, candied citron, shortening, salt, nutmeg, and cinnamon; bring to a boil and boil 3 minutes. Remove from heat and cool.\nSift in flour and baking powder; stir until well blended. Pour into prepared pan.\nBake at 350 degrees F (175 degrees C) for 45 minutes or until a toothpick inserted in center comes out clean. Remove from oven and cool on a wire rack. Leave in pan and cut into squares. .\n",
        "picture_link": "LpqqV7Tb/Hs/Qsu/dNdBRxXMp0652Um"
    },
    {
        "title": "Chicken Fry",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "1 teaspoon ginger garlic paste ADVERTISEMENT",
            "2 green chile peppers, chopped ADVERTISEMENT",
            "3 teaspoons ground coriander seed ADVERTISEMENT",
            "1 teaspoon garam masala ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "1 tablespoon fresh chopped cilantro, for garnish ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a pan. Add onions, green chilies, garam masala powder, ginger-garlic paste and fry until onions turn golden brown. Add chicken pieces, turmeric, nutmeg, pepper and chili powders and let cook for 5 to 6 minutes. Add salt and additional coriander powder to taste and cook until done. Garnish with cilantro if desired, and serve.\n",
        "picture_link": "dchDUkhCZyavZsBeHEN8qWBdNGjdpiS"
    },
    {
        "title": "Carrot Cheesecake with Crumb Crust",
        "ingredients": [
            "3/4 pound carrots, cut into 2 inch pieces ADVERTISEMENT",
            "2/3 cup finely ground graham cracker crumbs ADVERTISEMENT",
            "2/3 cup gingersnap cookie crumbs ADVERTISEMENT",
            "2/3 cup ground pecans ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "4 tablespoons unsalted butter, softened ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 teaspoon orange zest ADVERTISEMENT",
            "1 teaspoon minced fresh ginger root ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground mace ADVERTISEMENT",
            "1/4 teaspoon ground allspice ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese, diced and softened ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/4 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring 4 cups of water to a boil, and cook carrots until very tender about 45 minutes. Drain cooked carrots. Return them to a moderate heat for a minute or so to cook off excess moisture.\nPreheat oven to 400 degrees F (205 degrees C). In a medium bowl, combine graham cracker crumbs, gingersnap crumbs, 2/3 cup ground nuts, and sugar; toss well. Work in butter until mixture is crumbly. Pat over bottom and up sides of a buttered 9 inch springform pan. Bake the crust for 7 minutes. Turn oven down to 350 degrees F (175 degrees C).\nTransfer carrots to food processor and puree for 30 seconds. Scrape down side, and puree again until absolutely smooth. Add brown sugar, ginger, lemon juice, orange zest, cinnamon, mace and allspice to the processor, and puree for 30 seconds. Scrape down sides, and repeat. Let mixture stand until cool.\nAdd cream cheese to cooled carrot mixture, and puree for 1 minute; scrape down sides every 20 seconds. Beat in eggs, one at a time. Pour batter into crust, and sprinkle with remaining 1/4 cup chopped nuts.\nBake for about 50 minutes; cake tester will come out clean. Let cool. Cover loosely, and refrigerate at least 4 hours before serving.\n",
        "picture_link": ".CtvPUjsj2mzHKFhbbZ40p.RV/JI11G"
    },
    {
        "title": "Gail's Raisin Cake",
        "ingredients": [
            "2 cups raisins ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "3 1/4 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan.\nIn a saucepan, combine raisins and water. Bring to a boil and let boil for 10 minutes. Remove from heat and add butter, sugar and brown sugar. Stir to mix and allow to cool.\nIn a large bowl, mix the flour, salt, cinnamon and baking soda. Add the raisin mixture and the nuts. Stir together until smooth.\nPour batter into a 9x13 inch pan. Bake at 350 degrees F (175 degrees C) for 35 to 45 minutes, or until a toothpick inserted into the cake comes out clean.\n",
        "picture_link": "Pg1CCrFTZguobb3yd4evWY8tKR6/qOW"
    },
    {
        "title": "Mom's Old Fashioned Fried Chicken",
        "ingredients": [
            "1 (4 pound) chicken, cut into pieces ADVERTISEMENT",
            "2/3 cup all-purpose flour ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 teaspoons garlic powder ADVERTISEMENT",
            "1 quart vegetable oil for frying ADVERTISEMENT",
            "1 cup sherry ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put the flour, salt, pepper and garlic powder in a brown paper bag. One by one, coat the chicken parts with mixture.\nIn a large skillet, fry the chicken in 1 inch of hot oil until golden brown. Remove the chicken from the pan and drain the oil.\nPut the chicken back into the pan and cover the pieces with cooking sherry. Cover the pan and reduce to simmer. Let simmer for 20 minutes. Serve.\n",
        "picture_link": "mmDHMkxFMLPfB21NdeijaW9bSejniFi"
    },
    {
        "title": "Sinful Flourless Espresso Cake",
        "ingredients": [
            "12 (1 ounce) squares semisweet chocolate, chopped ADVERTISEMENT",
            "4 (1 ounce) squares unsweetened chocolate, chopped ADVERTISEMENT",
            "2 cups unsalted butter, cubed ADVERTISEMENT",
            "1 cup espresso coffee ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "8 eggs ADVERTISEMENT",
            "3 (10 ounce) packages frozen raspberries, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line the bottom of a 9 inch round cake pan with parchment paper.\nBring butter, espresso, and sugar to a boil in a medium saucepan, stirring to dissolve sugar.\nPlace chocolate in a large bowl, and add boiling hot espresso mixture. Whisk until smooth. Cool slightly. Whisk in eggs. Pour batter into prepared pan.\nPlace cake pan in a roasting pan. Pour enough hot water into the roasting to come half way up the sides of the cake pan. Bake until center of cake is set, and a tester inserted comes out clean with a few moist crumbs attached, about 1 hour. Remove from water. Chill overnight.\nPuree raspberries in processor. Chill. Serve with chilled cake.\n",
        "picture_link": "0D6W7/TMf.w4GRK9WqZr5VuCqHdKYn2"
    },
    {
        "title": "Almond Cookies II",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1 teaspoon almond extract ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup white rice flour ADVERTISEMENT",
            "2 cups crisp rice cereal ADVERTISEMENT",
            "2 tablespoons chopped almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCream butter or margarine and sugar together until light and fluffy. Add almond extract and egg. Beat well. Stir in flour, crispy rice and almonds.\nShape into balls one inch in diameter and place on ungreased baking sheets. Press with a floured fork to flatten slightly. Bake for 12 to 15 minutes until lightly browned.\n",
        "picture_link": "Iyl3FqQbitpkR5cYLNfXquI4E8WJPuW"
    },
    {
        "title": "Gram's Snow Balls",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon superfine sugar ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "1/3 cup confectioners' sugar for decoration ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (180 degrees C).\nMix together all ingredients except the confectioner's sugar. Roll dough into small balls and place on cookie sheets.\nBake for 25 - 30 minutes. Roll in confectioner's sugar while cookies are still warm.\n",
        "picture_link": "CGc91fmMxYQ8vU2B3dVn0x1Ru785y0O"
    },
    {
        "title": "Kolacky",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "3 ounces cream cheese, softened ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1/4 cup any flavor fruit jam ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon cold water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine margarine and cream cheese in large bowl; beat with mixer at medium speed until smooth and creamy. Beat in vanilla.\nCombine flour and salt in small bowl; gradually add to margarine mixture, beating until mixture forms soft dough.\nDivide dough in half; wrap each half in plastic wrap. Refrigerate until firm.\nPreheat oven to 375 degrees F (190 degrees C).\nRoll out half of dough on lightly floured pastry cloth or board to 1/8 inch thickness. Cut with top of glass or biscuit cutter into 3 inch rounds.\nSpoon 1/2 teaspoon fruit preserves/jam onto center of each dough circle. Beat egg with water in small bowl; lightly brush onto edges of dough circles. Bring three edges of dough up over fruit; pinch edges together to seal. Place on ungreased cookie sheets; brush with egg mixture. Repeat with remaining dough and fruit.\nBake 12 minutes or until golden brown. Let stand on cookie sheets 1 minute. Transfer kolackys to wire rack; cool completely. Store in tightly covered container.\n",
        "picture_link": "abFXz6.YkufHnLsn1TFhxzTCXjpVi3G"
    },
    {
        "title": "Dishpan Chocolate Chip Cookies",
        "ingredients": [
            "2 cups butter ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 cups packed dark brown sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "5 cups rolled oats ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "5 cups semisweet chocolate chips ADVERTISEMENT",
            "8 ounces finely grated chocolate bar ADVERTISEMENT",
            "3 cups chopped walnuts ADVERTISEMENT",
            "1 cup golden raisins ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "1 1/2 cups flaked coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "First find a plastic dishpan (this keeps you from burning up your mixer). Blend oatmeal in blender until a fine powder.\nCream butter and both sugars. Add eggs and vanilla. Mix together with flour, oatmeal, salt, baking powder and baking soda. Add chips, candy, nuts, raisins, and coconut.\nRoll into balls and place 2 inches apart on cookie sheet. Bake for 6 minutes at 375 degrees F (190 degrees C). Makes 6 dozen.\n",
        "picture_link": "dg0GjsrJCeQ2ZCxkc/nc12F/4rTvgYS"
    },
    {
        "title": "Soft Molasses Cookies III",
        "ingredients": [
            "1 cup shortening ADVERTISEMENT",
            "1 cup dark brown sugar ADVERTISEMENT",
            "2 cups dark molasses ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1/4 teaspoon cream of tartar ADVERTISEMENT",
            "1 tablespoon baking soda ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "9 cups all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream shortening and sugar. Add molasses slowly, stirring constantly. Mix spices with cream of tartar and add to mixture.\nMix baking soda and buttermilk. Add alternately with the flour to the sugar and spices mixture. You may not need the whole 9 cups of flour but you should end up with a fairly stiff dough. Chill dough overnight.\nPreheat the oven to 350 degrees F (175 degrees C).\nRoll dough out to at least 1/4-inch thick (the thicker the better), using as little flour as possible. Keep dough refrigerated when not rolling and cutting. Cut into cookies and brush with beaten egg. Bake for 10-12 minutes at 350 degrees F (175 degrees C). Alternately, you can form the dough into golf ball size round, roll in white sugar, place on a cookie sheet and then flatten slightly.\n",
        "picture_link": "uof.Xv84LTt75A4ik/OZyatm08mjl/G"
    },
    {
        "title": "Ruthie Cheese Cake",
        "ingredients": [
            "16 ounces cream cheese ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease one 8x8 inch square pan.\nPlace the cream cheese, milk, sugar, corn starch and vanilla in a blender and puree. Add the eggs one at a time after the last egg has been added blend mixture for 7 minutes. Pour batter into the prepared pan and sprinkle top with cinnamon.\nBake at 350 degrees F (175 degrees C) for 1 hour. Let cheese cake cool in oven for one hour. Then place in the refrigerator for at least 3 to 4 hours before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chocolate Crackle Cookies",
        "ingredients": [
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "2/3 cup butter ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1/4 cup light corn syrup ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt chocolate chips in double boiler. Remove from heat.\nBeat butter and sugar till creamy. Add egg and syrup, mix well. Stir in melted chocolate. Add all dry ingredients and mix well.\nRoll dough into 1 1/2 inch balls and roll in sugar.\nPlace 3 inches apart on a ungreased cookie sheet. Bake at 350 degrees F (175 degrees C) for 12 minutes. Let cool briefly before removing from pan.\n",
        "picture_link": "mWStWsp.tkX7aIrM/coWHokKtr/kiqO"
    },
    {
        "title": "Kristil's Frat House Cookies",
        "ingredients": [
            "2 cups butter ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "4 cups semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nCream butter and sugars together until fluffy. Add eggs and blend well. Stir in salt, baking soda and flour. Blend until the flour is incorporated. Stir in the chocolate chips.\nUse a melon baler sized ice cream scoop to scoop out chunks of dough. Place onto greased or parchment lined cookie sheets. Bake at 350 degrees F (175 degrees C) for 12 to 15 minutes or until lightly browned. Cool cookies on a rack and place on a serving platter. Enjoy!\n",
        "picture_link": "o8BtELoMSXzyitk8FPzO6hceU9alZhG"
    },
    {
        "title": "Baby Carrot Bars",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "3/4 teaspoon ground cinnamon ADVERTISEMENT",
            "3/4 cup vegetable oil ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "7 1/2 ounces junior baby food carrots ADVERTISEMENT",
            "1/2 cup fresh carrots, ground ADVERTISEMENT",
            "1/4 cup raisins ADVERTISEMENT",
            "1/4 cup chopped walnuts ADVERTISEMENT",
            "1 (12 ounce) container softened cream cheese ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together the sugar, cinnamon, eggs, vanilla and oil in a large bowl. Add in the baking soda, salt and flour. Stir in the jar of baby carrots, raw carrots, raisins and walnuts. Mix well.\nBake in a greased and floured 13x9 inch pan at 350 degrees F (175 degrees C) for 20 minutes. Check after 20 minutes by inserting clean knife into center. Knife should come out clean. Cool thoroughly before cutting.\nTo Make Frosting: Cream together the cream cheese, 1/4 cup butter, confectioners' sugar and vanilla. Frost cooled bars.\n",
        "picture_link": "7xnGBZmqdBFLtKTDpx6vKJClUwiXTPW"
    },
    {
        "title": "Surprise Meringues",
        "ingredients": [
            "2 egg whites ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon cream of tartar ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "6 ounces semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C). Line baking sheets with parchment paper.\nBeat egg whites, salt, cream of tartar, sugar and vanilla until the meringue is stiff.\nFold in the chocolate chips.\nPlace 1 teaspoonful of meringue on the lined cookie sheets. Bake at 300 degrees F (150 degrees C) for 25 minutes.\n",
        "picture_link": "RAVt81L1gA7ThGn0Xh4kJbsjF7JhQXi"
    },
    {
        "title": "Scout Cookies",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a mixing bowl, cream butter and sugar. Add eggs, one at a time, beating well after each addition. Add milk and vanilla; beat until light and fluffy.\nIn a separate bowl, combine flour and baking powder; gradually add to creamed mixture and mix well.\nChill at least 2 hours or overnight.\nOn a lightly floured surface, roll the dough to 1/4 inch thickness. Cut with trefoil cookie cutter available at Girl Scout stores, or use small cutter of your choice. Place cookies on ungreased baking sheets.\nPlace cookies on ungreased baking sheets. Bake at 350 degrees F (175 degrees C) for 8-10 minutes or until lightly browned. Cool on wire racks.\n",
        "picture_link": "FLlJQ312uw9d.zZiG0vWP4j6KUJDZDW"
    },
    {
        "title": "Basic Sugar Cookies",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "2 cups Basic Cookie Mix ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter over low heat and add to 2 cups Basic Cookie Mix.\nLightly beat the egg and add to mixture. Stir in vanilla and mix well.\nWith lightly floured hands shape into 1 inch balls and arrange about 2 inches apart on a greased cookie sheet.\nBake at 350 degrees F (180 degrees C) for 12 to 15 minutes until golden.\nCool a couple of minutes before removing from cookie sheet to racks to complete cooling.\n",
        "picture_link": "RwGbks..Z7e31y6C4ZTGRnNmfFYDwWe"
    },
    {
        "title": "Pineapple Cookies I",
        "ingredients": [
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 cup shortening ADVERTISEMENT",
            "1 cup crushed pineapple with juice ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "3 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 teaspoon ground nutmeg (optional) ADVERTISEMENT",
            "1/2 cup chopped walnuts (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (180 degrees C).\nMix all ingredients in the order given. Drop by tablespoonful onto cookie sheet.\nBake for 8 - 10 minutes until brown.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Baby Food Cake I",
        "ingredients": [
            "1 (18.25 ounce) package moist yellow cake mix ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 (4 ounce) jar apricot baby food ADVERTISEMENT",
            "1 (4 ounce) jar plum baby food ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (175 degrees C). Grease and flour one 9 or 10 inch Bundt pan.\nCombine the cake mix, sugar, vegetable oil, eggs, apricot baby food and plum baby food. Mix for 2 minutes. Stir in walnuts and pour batter into the prepared pan.\nBake at 375 degrees F (190 degrees C) for 1 hour. Wonderful with a light dusting of confectioner's sugar or with an almond frosting.\n",
        "picture_link": "evUG67OHDkH8C9lQGe9dmTYxMEkeFxi"
    },
    {
        "title": "French Crullers",
        "ingredients": [
            "4 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon orange zest ADVERTISEMENT",
            "4 tablespoons shortening ADVERTISEMENT",
            "1 cup hot water ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 1/2 tablespoons shortening ADVERTISEMENT",
            "1 1/2 cups confectioners' sugar ADVERTISEMENT",
            "3 tablespoons cream ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put 4 tablespoons sugar, salt, shortening and orange rind in saucepan with 1 cup hot water. Bring to a boil. Mix in 1 cup of flour. Cook until thick, stirring constantly. Remove from heat, and cool slightly. Beat in one egg at a time, beating each one in thoroughly before adding another.\nUsing a rose tip, press dough through pastry bag, in desired shape, onto a well-greased square of heavy paper. Turn paper upside down and let crullers drop into deep, hot fat (375 degrees F - 190 degrees C). Fry until well puffed up and golden brown in color, about 6 to 7 minutes. Drain on unglazed paper. Ice with confectioners' frosting.\nTo Make Frosting: Cream 1 1/2 tablespoons shortening and continue creaming while slowly adding sugar. Add cream, salt, and vanilla and mix smooth.\n",
        "picture_link": "00Or8khUvGWe5Taw.5WqViwIedE/IrW"
    },
    {
        "title": "Snappy Turtle Cookies",
        "ingredients": [
            "1 1/2 cups sifted all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 egg, separated ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "1/8 teaspoon maple flavored extract ADVERTISEMENT",
            "42 pecan halves ADVERTISEMENT",
            "2 (1 ounce) squares unsweetened chocolate ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 cup sifted confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sift together 1 1/2 cups flour, baking soda and salt. Cream 1/2 cup butter and gradually add 1/2 cup brown sugar, creaming well. Add egg and egg yolk and beat well. Blend in vanilla and maple flavoring. Add the dry ingredients gradually, mixing thoroughly. Chill to slightly firm dough.\nPreheat oven to 350 degrees F (180 degrees C).\nArrange pecan halves in groups of five on greased baking sheets to resemble head and legs of a turtle. Shape dough into balls; dip bottom into unbeaten egg white and press lightly onto nuts. Use a rounded teaspoon of dough for each, so tips of nuts will show when cookies are baked. Bake for 10 to 13 minutes. Do not overbake. Cool; frost tops generously with Chocolate Frosting.\nTo Make Frosting: Combine 2 (1-ounce) squares of unsweetened chocolate ( or 1/3 cup semi-sweet chocolate pieces), 1/4 cup milk and 1 Tablespoon butter in top of double boiler. Heat over boiling water until chocolate melts; blend until smooth. Remove from heat; add 1 cup sifted confectioners' sugar. Beat until smooth and glossy. If too thin, add more confectioners' sugar until the desired consistency.\n",
        "picture_link": "RBEirr4v5RuiCpYyuqXp5xyWuXECY5K"
    },
    {
        "title": "Italian Wine Cookies",
        "ingredients": [
            "2 1/2 cups vegetable oil ADVERTISEMENT",
            "2 1/2 cups red wine ADVERTISEMENT",
            "water ADVERTISEMENT",
            "12 cups all-purpose flour ADVERTISEMENT",
            "1 quart vegetable oil for frying ADVERTISEMENT",
            "1 cup honey, warmed slightly ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Warm the wine and oil over medium heat. Remove from heat and add 12 cups of flour. Stir in water, 1/2 cup at a time, until the dough comes together in a soft ball. Knead well.\nRoll the dough into a snake and cut into two inch pieces. Run each piece over a basket or use a fork to get ridges in the dough.\nHeat oil for frying in a large pot. Deep fry cookies until medium brown. Drain on paper towels.\nWarm honey in a frying pan until very liquid. Roll the cookies in the honey, and then place in a dish. Allow the honey to cool and serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Special Chocolate Cake I",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "3/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup cold, brewed coffee ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 1/2 cups confectioners' sugar ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine and sift together 2 cups flour, 2 cups sugar, cocoa, salt, baking soda and baking powder. In a small bowl, blend together eggs, oil, 1 cup milk and 1 teaspoon vanilla; combine with dry ingredients. Mix thoroughly and then stir in one cup cold coffee (may use instant coffee). Batter will be very thin but it bakes into a rich, dark, moist cake.\nPour into a greased 9 x 13 inch pan. Bake for about 40 minutes.\nTo Make Whipped Cream Frosting: Combine 1/4 cup flour and 1 cup milk, adding milk slowly and beating until smooth. Set over moderate heat and stir constantly until thickened. Set aside to chill completely. Combine 1 1/2 cups confectioners sugar with 1/2 cup butter and 1/2 cup shortening beating until light and fluffy; stir in well cooled flour-milk mixture and beat at high speed until thick and creamy. Add 1 teaspoon vanilla and beat until thoroughly combined. Spread frosting over cooled cake. Enjoy!\n",
        "picture_link": "vIxe6Y2d0F/0vy7WsSXUbsApdsHUULO"
    },
    {
        "title": "Black Pepper Cookies",
        "ingredients": [
            "3 eggs ADVERTISEMENT",
            "2 cups packed light brown sugar ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground cloves ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 cup finely chopped walnuts ADVERTISEMENT",
            "2 1/2 cups raisins ADVERTISEMENT",
            "2 tablespoons chopped candied citron ADVERTISEMENT",
            "1/3 cup confectioners' sugar for decoration ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat eggs with brown sugar. Stir in flour with baking soda, salt, spices and pepper. Add nuts, raisins and citron and stir to coat. Pour the egg-sugar mixture into flour mixture and stir to make a stiff dough. Chill.\nUsing rounded teaspoonful of dough roll into balls with floured hands. Put on greased cookie sheet. Bake at 375 degrees F (190 degrees C) for 10 to 12 minutes. Sprinkle with confectioners' sugar.\n",
        "picture_link": "gh0YDeWf0SGD2f071EFpo1xEqhixgK2"
    },
    {
        "title": "Amish Friendship Cake",
        "ingredients": [
            "1/2 teaspoon active dry yeast ADVERTISEMENT",
            "1 fluid ounce warm water ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 tablespoon distilled white vinegar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "3 cups milk ADVERTISEMENT",
            "1 cup sourdough starter ADVERTISEMENT",
            "2/3 cup vegetable oil ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To Make Starter: Dissolve yeast in warm water. Add 1 tablespoon white sugar, 1 tablespoon vinegar, 1/2 teaspoon salt, 1 cup of the flour, and 1 cup of the milk in a non-metal bowl and stir with a non-metal spoon until creamy. Cover bowl with plastic wrap and let stand in a warm place for two days to ferment. It will become bubbly and have a sour odor. Do not place in refrigerator. On second day, third day, and fourth day: stir. On fifth day, add 1 cup flour, 1 cup sugar, 1 cup milk, and stir. On sixth, seventh, eighth, and ninth day: stir. On tenth day add 1 cup flour, 1 cup sugar, and 1 cup milk. Reserve 1 cup starter; pour remaining starter, 1 cup each, into 3 containers to give away to friends if desired. Starter is enough for 8 loaves.\nTo Make Cakes: Preheat oven to 350 degrees F (175 degrees C). Grease two 8 or 9 inch loaf pans.\nMix 1 cup of the starter, oil, baking powder, eggs, 1 cup of the sugar, 2 cups of the flour, 1/4 teaspoon of the salt, vanilla, and chopped nuts. Stir in the baking soda just before pouring the batter into the prepared pans.\nBake at 350 degrees F (175 degrees C) for 45 minutes to 1 hour. Bananas, dates, or raisins can be added for variety.\n",
        "picture_link": ".iPmbqSl/dNcvM1502RXOkiNIbeY2Y."
    },
    {
        "title": "Simple and Flavorful Salisbury Steak",
        "ingredients": [
            "2 pounds lean ground beef ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 cup Italian seasoned bread crumbs ADVERTISEMENT",
            "1 (1 ounce) package dry onion soup mix ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 (10 ounce) can beef broth ADVERTISEMENT",
            "1 (10.75 ounce) can cream of mushroom soup ADVERTISEMENT",
            "1/2 teaspoon dry mustard ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix ground beef, eggs, bread crumbs, dry soup mix, salt, and pepper together in a large bowl; add about 1/2 the can of beef broth and continue mixing until beef mixture is thoroughly moistened. Divide mixture into six portions and shape into patties.\nHeat a Dutch oven over medium heat. Brown patties in the hot pot, 3 to 5 minutes per side. Spoon excess grease from the pot.\nStir remaining beef broth with cream of mushroom soup and dry mustard in a bowl until smooth; pour over the browned patties.\nBake in preheated oven until patties are no longer pink in the center, about 45 minutes. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C).\n",
        "picture_link": "B4n3t2rOZKUxuYYpSjVFLr.TcVHSXXe"
    },
    {
        "title": "Green Beans with Warm Dijon Vinaigrette",
        "ingredients": [
            "1 pound fresh green beans, trimmed ADVERTISEMENT",
            "2 teaspoons white wine vinegar ADVERTISEMENT",
            "1 teaspoon sugar ADVERTISEMENT",
            "1 tablespoon finely minced red onion ADVERTISEMENT",
            "1 clove garlic, finely minced ADVERTISEMENT",
            "1 teaspoon Dijon mustard ADVERTISEMENT",
            "1/2 teaspoon Spice Islands® Thyme ADVERTISEMENT",
            "1/8 teaspoon Spice Islands® Sea Salt ADVERTISEMENT",
            "1/4 teaspoon Spice Islands® Fine Grind Black Pepper ADVERTISEMENT",
            "5 tablespoons Mazola® Corn Oil ADVERTISEMENT",
            "1/4 cup toasted sliced almonds ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To blanch beans, fill a large stock pot half-way with water. Leave enough room for the beans. Bring to a boil over high heat; add beans and return to a full boil. Boil beans 5 minutes. Drain beans and immediately place in large bowl filled with ice water. Let sit 3 minutes; drain thoroughly. Pat dry with paper towel. Set aside.\nWhisk together vinegar, sugar, onion, garlic, mustard, thyme, salt and pepper in a mixing bowl. Whisk in 4 tablespoons oil slowly; set aside.\nHeat 1 tablespoon oil in large nonstick skillet. Add beans and saute 3 three minutes. Add vinaigrette; stir beans to coat and saute an additional 3 minutes or until heated through. Transfer beans to serving platter; top with almonds and Parmesan cheese. Serve immediately.\n",
        "picture_link": "Ja9NEnNFM8VbY93gt.2pocLDOAk7W7W"
    },
    {
        "title": "Easy Pumpkin Chocolate Chip Bread",
        "ingredients": [
            "1 2/3 cups all-purpose flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "1 cup pumpkin puree ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a loaf pan.\nStir flour, sugar, cinnamon, baking soda, baking powder, salt, and nutmeg together in a large bowl.\nWhisk pumpkin, butter, and eggs together in a separate bowl. Stir in chocolate chips. Fold pumpkin mixture into flour mixture. Pour pumpkin batter into prepared loaf pan.\nBake in the preheated oven until a toothpick inserted in the center of the loaf comes out clean, 1 hour.\n",
        "picture_link": "bXpoOMWgF7mtelgjgqksEtkY.Pf6voK"
    },
    {
        "title": "Cheesy Poblano Chicken Enchiladas",
        "ingredients": [
            "2 cups shredded cooked chicken ADVERTISEMENT",
            "1 (10.75 ounce) can Campbell's® Condensed Creamy Poblano & Queso Soup ADVERTISEMENT",
            "1/4 cup Pace® Chunky Salsa ADVERTISEMENT",
            "1/2 cup shredded Monterey Jack cheese or crumbled queso fresco ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "6 (6 inch) corn tortillas, warmed ADVERTISEMENT",
            "1/2 cup chopped tomato ADVERTISEMENT",
            "2 tablespoons sliced green onions ADVERTISEMENT",
            "1 tablespoon chopped fresh cilantro leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oven to 400 degrees F. Stir the chicken, 1/2 cup soup, the salsa and cheese in a medium bowl.\nStir the remaining soup and the milk in a small bowl.\nDivide the chicken mixture among the tortillas. Roll up the tortillas around the filling. Place the filled tortillas, seam-side down, into an 11x8x2-inch baking dish. Pour the soup mixture over the filled tortillas. Cover the baking dish.\nBake for 30 minutes or until the enchiladas are hot and bubbling.\n",
        "picture_link": "yLEu/rB/NQKfG5BSnFPfYuct7tL4R56"
    },
    {
        "title": "Gluten-Free Waffles",
        "ingredients": [
            "1 1/3 cups milk ADVERTISEMENT",
            "1 cup buckwheat flour ADVERTISEMENT",
            "1 cup almond flour ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat a waffle iron according to manufacturer's instructions.\nStir milk, buckwheat, almond flour, vegetable oil, eggs, baking powder, sugar, and salt together in a bowl until batter is smooth.\nWorking in batches, ladle batter into preheated waffle iron and cook until waffles are golden and crisp, 3 to 5 minutes.\n",
        "picture_link": "hIvvxcPxnaZKSwuezD.1AlNWAXD4ejC"
    },
    {
        "title": "Twice Baked Mashed Potatoes",
        "ingredients": [
            "6 Yukon Gold potatoes, peeled ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1/2 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "3 cups shredded Cheddar-Monterey Jack cheese blend, divided ADVERTISEMENT",
            "2 tablespoons butter, cut into small pieces ADVERTISEMENT",
            "1 tablespoon bacon bits, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, 20 to 25 minutes. Drain and transfer to a large bowl.\nPreheat oven to 350 degrees F (175 degrees C).\nMash potatoes with 1/4 cup butter until butter is melted. Beat sour cream and cream cheese into potato mixture until smooth; mix in 2 cups Cheddar-Monterey Jack cheese. Spread potato mixture into a 9x13-inch baking dish; sprinkle with remaining 1 cup Cheddar-Monterey Jack cheese, 2 tablespoons butter pieces, and bacon bits.\nBake in the preheated oven until bubbling, cheese is melted, and edges are crisp, 20 to 25 minutes.\n",
        "picture_link": "QniSfB5LErEgy5SfDKyou7zAwadnQHe"
    },
    {
        "title": "Angel Hair Pasta and Scallops with Margherita® Prosciutto",
        "ingredients": [
            "12 ounces angel hair pasta ADVERTISEMENT",
            "1 1/2 pounds fresh scallops ADVERTISEMENT",
            "1 ounce olive oil ADVERTISEMENT",
            "8 ounces sliced Margherita® Prosciutto or julienned Margherita® Genoa Salami ADVERTISEMENT",
            "2 garlic cloves, chopped ADVERTISEMENT",
            "8 ounces sliced grape tomatoes ADVERTISEMENT",
            "1 pound sliced crimini mushrooms ADVERTISEMENT",
            "1 pound fresh baby spinach ADVERTISEMENT",
            "8 fluid ounces dry white wine ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "4 ounces cold unsalted butter ADVERTISEMENT",
            "4 ounces fresh basil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook pasta according to package instructions. Cover to keep warm; set aside.\nHeat 12-inch saute pan over medium high, add 1 ounce olive oil. Sear scallops for 2 minutes on each side, remove from pan and cover.\nAdd sliced Margherita(R) Prosciutto or julienned Genoa Salami to heated pan, saute for two minutes. Add garlic, tomatoes and mushrooms. Saute for another two minutes. Add wine and lemon juice, cook to reduce by half by deglazing the pan. Add salt and pepper, then stir in butter until melted.\nAdd scallops back into pan and cook until they are heated through. Add fresh spinach and cook until spinach is wilted.\nPlace cooked pasta in the pan. Mix until pasta is well covered in sauce.\nGarnish with fresh basil and serve.\n",
        "picture_link": "ZSVvhztlsmUKFwbyFCqm2m6fvtWN7/q"
    },
    {
        "title": "Shredded Apple Pork",
        "ingredients": [
            "1 cup MUSSELMAN'S® Apple Butter ADVERTISEMENT",
            "1/4 cup MUSSELMAN'S® Apple Cider Vinegar ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "2 tablespoons garlic, minced ADVERTISEMENT",
            "2 tablespoons whole grain Dijon mustard ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon pepper ADVERTISEMENT",
            "2 medium apples, cored and chopped ADVERTISEMENT",
            "1 medium onion, chopped ADVERTISEMENT",
            "6 boneless pork chops ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In small bowl, whisk together apple butter, vinegar, brown sugar, garlic, Dijon mustard, salt and pepper.\nPlace chopped apples and onions in slow cooker. Add pork chops and pour apple butter mixture over top.\nCook on low for 5 to 6 hours, covered. Shred pork with two forks in cooker, and let meat marinate on low in sauce for 20 minutes, uncovered. Serve warm over rice or mashed potatoes.\n",
        "picture_link": "DmgT6SWsLc1muxYIyckunTvngC7seta"
    },
    {
        "title": "Philly Cheesesteak Quesadillas",
        "ingredients": [
            "1 (1 pound) beef top sirloin, thinly sliced ADVERTISEMENT",
            "2 small onions, sliced ADVERTISEMENT",
            "2 green bell peppers, sliced ADVERTISEMENT",
            "1 cup barbeque sauce (such as Bull's-Eye® Texas-Style Bold Barbeque Sauce) ADVERTISEMENT",
            "8 (10 inch) flour tortillas ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nHeat a skillet over medium heat; cook and stir beef until browned, 5 to 7 minutes. Add onions and green bell peppers to beef; cook and stir until softened, 5 to 10 minutes. Pour barbeque sauce over beef mixture and simmer until sauce is slightly reduced, about 10 minutes.\nLay 4 tortillas on a baking sheet and top each with beef mixture and Cheddar cheese. Top each Cheddar cheese layer with a tortilla.\nBake in the preheated oven for 10 minutes; flip the quesadillas and cook until cheese is melted, about 5 minutes more.\n",
        "picture_link": "EG3fI.fSDTlEDxHAstoCsCGJ5YyGZNy"
    },
    {
        "title": "Salt and Pepper Ribeye Steak",
        "ingredients": [
            "6 (8 ounce) rib-eye steaks ADVERTISEMENT",
            "1 tablespoon Diamond Crystal® Kosher Salt ADVERTISEMENT",
            "1 1/2 teaspoons ground black pepper ADVERTISEMENT",
            "1 tablespoon vegetable oil, or as needed ADVERTISEMENT",
            "2 tablespoons unsalted butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Two days before cooking, salt both sides of each steak with 1/2 teaspoon Diamond Crystal(R) Kosher Salt per steak. Place steaks in an airtight container and refrigerate until ready to cook.\nRemove the steaks from the refrigerator about 30 minutes prior to cooking. Sprinkle both sides of steak with black pepper.\nHeat cast iron pan over medium-high heat until very hot. Add vegetable oil and heat until oil shimmers.\nCarefully place steaks in pan. Cook until brown and hard-seared on one side, 4 to 5 minutes.\nTurn steaks and top with one teaspoon butter. Cook for 3 to 4 more minutes or to desired doneness. You may need to cook the steaks in batches depending on the size of your cast iron pan. Keep the cooked steaks in a 170 degree F oven until ready to serve.\n",
        "picture_link": "gKeDY58ntAAtQw0M.A6h2EZlDR5tWfu"
    },
    {
        "title": "How to Make Turkey Manicotti ",
        "ingredients": [
            "Crepes: ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon olive oil ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "1 cup diced cooked turkey ADVERTISEMENT",
            "1 cup whole-milk ricotta cheese ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup freshly shredded Parmigiano-Reggiano cheese ADVERTISEMENT",
            "1/2 cup shredded mozzarella cheese ADVERTISEMENT",
            "1/4 teaspoon dried marjoram ADVERTISEMENT",
            "1/8 teaspoon red pepper flakes ADVERTISEMENT",
            "1/4 cup chopped Italian parsley ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 teaspoon olive oil, or as needed ADVERTISEMENT",
            "1 1/2 cups marinara sauce, divided ADVERTISEMENT",
            "2 teaspoons olive oil, divided ADVERTISEMENT",
            "1/3 cup freshly shredded Parmigiano-Reggiano cheese ADVERTISEMENT",
            "1 tablespoon freshly shredded Parmigiano-Reggiano cheese for garnish, or as desired ADVERTISEMENT",
            "1 tablespoon chopped Italian parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nWhisk 2 eggs, flour, water, salt, and 1/2 teaspoon olive oil together thoroughly in a bowl to make a very smooth batter. Cover bowl with plastic wrap and refrigerate batter for 1 hour.\nMix turkey, ricotta cheese, 1 egg, 1/2 cup Parmigiano-Reggiano cheese, mozzarella cheese, marjoram, red pepper flakes, and 1/4 cup Italian parsley in a bowl until thoroughly combined. Season with salt to taste.\nPlace a nonstick skillet over medium-high heat and brush generously with 1 teaspoon olive oil or as needed. Swirl about 1/4 cup batter into the bottom of the pan and tilt to form a thin pancake covering the bottom of the skillet. Cook until bottom of crepe is dry, 60 to 90 seconds. Flip crepe and cook until other side has small browned spots, 60 to 90 seconds more. Repeat with remaining batter to make 6 crepes. Transfer crepes to a plate as you make them.\nSpread about 1/2 cup marinara sauce into the bottom of a 9x12-inch baking dish. Use a brush to spread about 1/2 teaspoon of olive oil in a thin layer up the sides of the dish. Place a crepe, dimpled side down, onto a work surface; spread about 1/3 to 1/2 cup filling onto crepe in a line down the middle. Roll crepe over filling and tuck in ends if desired. Lay filled crepe into the baking dish. Repeat with remaining crepes and filling to make 6 manicotti.\nSpread remaining 1 cup marinara sauce onto the manicotti in a line down the middle of the crepes, covering middle 1/3 of manicotti. Sprinkle 1/3 cup Parmigiano-Reggiano cheese all over manicotti. Drizzle manicotti with remaining 1 1/2 teaspoon olive oil.\nBake in the preheated oven until manicotti are slightly browned and puffy, about 45 minutes. Let stand 5 minutes to cool. Garnish with 1 tablespoon Parmigiano-Reggiano cheese or as desired and 1 tablespoon Italian parsley before serving.\n",
        "picture_link": "hiJ.ENMvmkXcFFY8cYjUsCUFAFeslu2"
    },
    {
        "title": "Roasted Garlic Cauliflower Mash",
        "ingredients": [
            "6 cloves garlic, crushed ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 large head cauliflower, coarsely chopped ADVERTISEMENT",
            "1 teaspoon kosher salt ADVERTISEMENT",
            "1 teaspoon dried parsley ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace garlic in a casserole dish and drizzle with olive oil.\nRoast garlic in the preheated oven until tender and fragrant, about 15 minutes.\nPlace a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add cauliflower, cover, and steam until tender, about 10 minutes.\nMash cauliflower and roasted garlic with olive oil together in a bowl. Stir salt, parsley, and pepper into mashed cauliflower until completely incorporated. Spread cauliflower mixture into casserole dish.\nBake mashed cauliflower in the preheated oven until hot and flavors blend, about 15 minutes.\n",
        "picture_link": "FBXOWNJBF506TzRQuyw97xjaz3V4gQu"
    },
    {
        "title": "Leftover Turkey Soup (Slow Cooker)",
        "ingredients": [
            "2 quarts chicken broth ADVERTISEMENT",
            "1 turkey carcass, skin and meat removed ADVERTISEMENT",
            "1 onion, quartered ADVERTISEMENT",
            "2 carrots, halved lengthwise ADVERTISEMENT",
            "3 celery stalks, halved lengthwise ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "1 cup chopped carrots ADVERTISEMENT",
            "1/3 cup chopped celery ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "2 cups penne pasta ADVERTISEMENT",
            "3 cups chopped cooked turkey ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine chicken broth, turkey carcass, onion quarters, carrot halves, celery halves, and bay leaves in a slow cooker.\nCook on High for 4 hours. Carefully strain broth, discard solids, and transfer broth to a bowl. Rinse slow cooker.\nPour broth back into slow cooker; add chopped carrots, chopped celery, and chopped onion.\nCook on Low for 3 hours. Add penne pasta to slow cooker; cook for 2 1/2 more hours.\nMix turkey meat and cream of mushroom soup into soup and cook for 30 more minutes.\n",
        "picture_link": "sLtP8K0tB8SOeFGD6z8xfKGYQNROJta"
    },
    {
        "title": "Amazing Pineapple Cranberry Sauce",
        "ingredients": [
            "1 (16 ounce) can pineapple chunks with juice ADVERTISEMENT",
            "water as needed ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 (12 ounce) bag fresh cranberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Drain juice from canned pineapple into a measuring cup. Fill the measuring cup with enough water to equal 1 cup liquid altogether.\nStir pineapple juice mixture and sugar together in a saucepan; bring to a boil, stirring constantly. Add cranberries and return to a boil. Reduce heat to low and simmer until cranberries burst, about 10 minutes.\nMix pineapple chunks into cranberry mixture. Cool to room temperature before serving.\n",
        "picture_link": "Z3bLXcWSMQQvFxv4JLuJSS6xnDPQpYu"
    },
    {
        "title": "Slow Cooker Chicken Tinga Tacos",
        "ingredients": [
            "2 1/2 pounds boneless, skinless chicken breasts, cut into 2- to 3-inch pieces ADVERTISEMENT",
            "1/4 cup Mazola® Corn Oil ADVERTISEMENT",
            "3 cups roughly chopped onion ADVERTISEMENT",
            "5 plum tomatoes, cored and chopped ADVERTISEMENT",
            "2 individual chipotle peppers in adobo sauce (or more to taste), finely chopped (from a 7-ounce can) ADVERTISEMENT",
            "2 teaspoons Spice Islands® Minced Garlic ADVERTISEMENT",
            "1 1/4 cups chicken broth ADVERTISEMENT",
            "Warm corn or flour tortillas or crisp 6-inch tostadas ADVERTISEMENT",
            "Toppings for Tacos or Tostadas: ADVERTISEMENT",
            "Shredded lettuce ADVERTISEMENT",
            "Diced tomatoes ADVERTISEMENT",
            "Shredded or crumbled Mexican cheese ADVERTISEMENT",
            "Fresh cilantro ADVERTISEMENT",
            "Avocado slices or guacamole ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pat chicken dry using paper towels. Heat 2 tablespoons oil in a large skillet over medium-high heat. Add half of the chicken to skillet and cook until lightly brown on one side, 3 to 4 minutes. Transfer chicken to 6-quart slow cooker. Repeat with remaining chicken. Add 2 tablespoons oil and onions to skillet and cook for 3 to 4 minutes or until onions begin to soften.\nAdd to slow cooker with tomatoes, chipotles, garlic and chicken broth. Mix well. Cook for 3 to 4 hours on HIGH or 4 to 6 hours on LOW. The Tinga Chicken is ready when the chicken is tender and can be easily pulled apart. Shred chicken pieces using two forks. Serve Tinga with warm tortillas or crisp tostadas and arrange toppings in small bowls. Top as desired.\n",
        "picture_link": "abGLAr9CvAWrtoVFlcqJWslc0dSV93e"
    },
    {
        "title": "Paleo Oatmeal (Not Really Oatmeal At All)",
        "ingredients": [
            "1 apple, diced ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1 teaspoon coconut oil ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon pumpkin pie spice ADVERTISEMENT",
            "1 banana ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/4 cup almond milk ADVERTISEMENT",
            "1 tablespoon almond butter ADVERTISEMENT",
            "1 splash vanilla extract ADVERTISEMENT",
            "1/4 cup ground walnuts, or to taste ADVERTISEMENT",
            "1/4 cup ground pecans, or to taste ADVERTISEMENT",
            "1 tablespoon maple syrup, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir apple, raisins, coconut oil, cinnamon, and pumpkin pie spice together in a saucepan over medium heat. Bring to a simmer and cook to blend flavors, about 5 minutes.\nBlend banana, eggs, almond milk, almond butter, and vanilla together in a food processor. Add walnuts and pecans to banana mixture and blend.\nStir banana mixture and maple syrup into apple mixture; bring to a simmer and cook until thick, 5 to 10 minutes.\n",
        "picture_link": "zhIbJjuYoXh2TF643FhkFNMGwQF8PuC"
    },
    {
        "title": "Simple Broccoli Soup with Cheddar Croutons ",
        "ingredients": [
            "4 slices bread, toasted ADVERTISEMENT",
            "4 ounces shredded sharp Cheddar cheese ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 clove garlic, chopped ADVERTISEMENT",
            "1 quart chicken stock ADVERTISEMENT",
            "2 heads broccoli, florets separated and stems chopped ADVERTISEMENT",
            "1/3 cup heavy whipping cream ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Top each toast slice with Cheddar cheese. Melt cheese with a kitchen torch until bubbling and golden, 30 seconds. (footnote: broiler)\nMelt butter in a pot over high heat. Cook and stir garlic in hot butter until fragrant and sizzling, about 15 seconds. Add stock to pot and bring to a boil. Stir broccoli into stock, pushing broccoli down into liquid; return to a boil and cook until broccoli is tender, 7 to 8 minutes.\nPuree broccoli mixture using an immersion blender until soup is smooth.\nStir cream, cayenne pepper, and salt into soup; puree with immersion blender again until smooth, about 30 seconds. Ladle soup into bowls and top with cheese toast.\n",
        "picture_link": "cczJB2xcdJlztx8yQhpYaPMnU4htXUa"
    },
    {
        "title": "Spicy Cajun Pretzels",
        "ingredients": [
            "1 (16 ounce) package mini sourdough pretzels or sourdough pretzels, broken into bite size pieces ADVERTISEMENT",
            "1 cup Mazola® Corn Oil ADVERTISEMENT",
            "1 (1 ounce) packet ranch dressing mix ADVERTISEMENT",
            "1 tablespoon Cajun seasoning ADVERTISEMENT",
            "1 teaspoon Spice Islands® Cayenne Pepper ADVERTISEMENT",
            "1 teaspoon Spice Islands® Dried Dill Weed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 200 degrees F.\nPlace broken pretzels in a large baking pan or roaster. Combine corn oil, ranch dressing mix, Cajun seasoning, cayenne pepper and dill. Pour over pretzels; stir to coat evenly.\nBake for 2 hours, stirring every 30 minutes. Remove from oven and drain on paper towels to absorb excess oil. Store in tightly covered container.\n",
        "picture_link": "hcn4rngsBFH/8p8esvUdoxDYrflxhYm"
    },
    {
        "title": "Sam's Favorite Pulled Pork",
        "ingredients": [
            "1 (2 pound) package pork tenderloin, fat trimmed ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/4 cup apple cider vinegar ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "3 dashes hot pepper sauce ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "3 tablespoons white vinegar ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1 pinch lemon pepper, or to taste ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season pork tenderloin with salt, black pepper, and 1/2 teaspoon cayenne pepper.\nHeat oil in a skillet over medium-high heat; fry pork in hot oil until browned on all sides, about 10 minutes. Transfer meat to a slow cooker. Add water, brown sugar, cider vinegar, Worcestershire sauce, garlic, and hot sauce.\nCook on Low for 7 hours. Remove tenderloin to a platter and drain cooking liquid, reserving about 1/2 cup. Shred pork and return to slow cooker. Add enough reserved liquid to moisten meat.\nWhisk mayonnaise, white vinegar, garlic powder, lemon pepper, and 1 pinch cayenne pepper together in a bowl. Serve mayonnaise sauce with shredded pork.\n",
        "picture_link": "mybRRJEzc59KQASgEWUB/6LhrFneoku"
    },
    {
        "title": "Moroccan Lentil Soup with Veggies",
        "ingredients": [
            "1/4 cup olive oil ADVERTISEMENT",
            "4 large carrots, chopped ADVERTISEMENT",
            "1 large white onion, finely chopped ADVERTISEMENT",
            "2 teaspoons kosher salt ADVERTISEMENT",
            "2 teaspoons chopped fresh parsley ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon dried tarragon ADVERTISEMENT",
            "1/2 teaspoon cumin ADVERTISEMENT",
            "1 (16 ounce) package dry lentils ADVERTISEMENT",
            "1 cup crushed tomatoes ADVERTISEMENT",
            "2 quarts vegetable broth ADVERTISEMENT",
            "1 (10 ounce) package spinach ADVERTISEMENT",
            "1 large zucchini, cut into small pieces ADVERTISEMENT",
            "1 pinch salt to taste ADVERTISEMENT",
            "1 teaspoon olive oil, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1/4 cup olive oil in a large pot over medium heat. Cook and stir carrots, onion, salt, parsley, black pepper, ginger, tarragon, and cumin in the hot oil until the onion is translucent, 5 to 7 minutes.\nStir lentils and tomatoes into the carrot mixture. Pour vegetable broth over the vegetables, stir, and bring to a boil. Reduce heat to low, place a cover on the pot, and simmer until the lentils are tender, 45 to 50 minutes.\nStir spinach and zucchini into the broth mixture; simmer until the zucchini is tender, about 7 minutes more. Remove pot from heat and season soup with salt. Drizzle 1 teaspoon olive oil over the soup before serving.\n",
        "picture_link": "KOY6gyXwdRA34UsEFCALmVhIufltW4."
    },
    {
        "title": "Grammy's German Potato Salad",
        "ingredients": [
            "8 white potatoes, peeled and cut into cubes ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "1/2 teaspoon dry mustard ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 cup cider vinegar, divided ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until just tender, about 15 minutes; drain.\nPut potatoes into a large bowl; add onion and stir.\nMix sugar, mustard, and salt together in a bowl. Stir just enough vinegar into the sugar mixture to form a paste; season with black pepper.\nWhisk remaining vinegar and vegetable oil together in a separate bowl until smooth; stream into bowl with the paste, whisking continually to incorporate. Pour the dressing over the potato and onion mixture.\nCover the bowl with plastic wrap and let salad cool slightly, 5 to 10 minutes.\n",
        "picture_link": ".meIQ.QYJ0UDyjkulVACO50t34tNHtS"
    }
]