[
    {
        "title": "Sweet Potatoes With Feta Cheese",
        "ingredients": [
            "2 large sweet potatoes, peeled and sliced ADVERTISEMENT",
            "1 (4 ounce) package tomato basil feta cheese ADVERTISEMENT",
            "1 tablespoon balsamic vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the slices of sweet potatoes into a microwave safe dish, and add just enough water to cover. Cook for 10 minutes in the microwave, or until starting to become tender.\nPreheat the oven's broiler. Place the sweet potato slices onto a greased broiler pan. Slice the feta cheese the best you can, and place a piece on top of each potato slice. Drizzle balsamic vinegar over all.\nPlace under the preheated broiler for about 6 minutes, or until cheese is lightly browned.\n",
        "picture_link": "HN0zGyenWUxM93JeEQIrFD6qvmr4RUa"
    },
    {
        "title": "Shredded Potato Salmon Cakes",
        "ingredients": [
            "3 medium potatoes, peeled and shredded ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 teaspoon Italian seasoning ADVERTISEMENT",
            "1/2 pound cooked flaked salmon ADVERTISEMENT",
            "3 green onions, chopped ADVERTISEMENT",
            "2 tablespoons capers, drained ADVERTISEMENT",
            "1 red bell pepper, seeded and chopped ADVERTISEMENT",
            "3/4 cup chopped canned banana peppers ADVERTISEMENT",
            "3/4 cup sliced fresh mushrooms ADVERTISEMENT",
            "3/4 cup dry bread crumbs ADVERTISEMENT",
            "1 cup oil for frying, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Squeeze as much liquid from the potatoes as you can, and place in a large bowl. Beat the eggs with salt, pepper, and Italian seasoning, and mix with the potatoes. Mix in salmon, green onions, capers, red bell pepper, banana peppers, mushrooms and bread crumbs. Form into about 12 patties about 3/4 inch thick.\nHeat 1/4 inch of oil in a large heavy skillet over medium-high heat. Fry the patties for about 3 minutes per side, or until golden brown. Drain on paper towels quickly before serving. Try to fry all the patties at one time, otherwise the mixture becomes stiff.\n",
        "picture_link": "0Ih59WAKLTK1f2LGtkmPHm1Z1lz31we"
    },
    {
        "title": "Sweet Irish Bread",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon cream of tartar ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x5 inch loaf pan. I use a glass one.\nIn a medium bowl, cream together the butter and sugar until smooth. Beat in the eggs one at a time, then stir in the sour cream. Sift together the flour, baking soda, cream of tartar and salt; stir into the sour cream mixture until just blended. Fold in raisins. Transfer the batter to the prepared loaf pan.\nBake for 50 to 60 minutes in the preheated oven, or until a small knife inserted into the crown, comes out clean.\n",
        "picture_link": "MmVapsG.h8gjdzHM0k5FE2.OWM4Bbge"
    },
    {
        "title": "Black-Eyed Pea and Bacon Soup",
        "ingredients": [
            "1/2 pound bacon, diced ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3 quarts water ADVERTISEMENT",
            "4 cubes chicken bouillon ADVERTISEMENT",
            "2 1/2 cups dry black-eyed peas ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon pepper ADVERTISEMENT",
            "6 small potatoes, diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Brown the bacon in a large pot over medium heat. Drain grease, and place onion in the pot. Cook and stir until tender. Pour in the water. Mix in the bouillon cubes until dissolved. Stir in black-eyed peas, and season with salt and pepper. Bring to a boil, reduce heat to low, and simmer 45 minutes.\nPlace the potatoes in the pot, and continue cooking 15 minutes, or until beans and potatoes are tender. Serve warm.\n",
        "picture_link": "1OG/QfzmrheygclZ1Xlx/3hbYyGFB.m"
    },
    {
        "title": "Hillbilly Punch",
        "ingredients": [
            "4 cups ice cubes ADVERTISEMENT",
            "1 fluid ounce white rum ADVERTISEMENT",
            "1 fluid ounce peach schnapps ADVERTISEMENT",
            "1 fluid ounce amaretto liqueur ADVERTISEMENT",
            "1 1/2 cups cranberry juice cocktail, chilled ADVERTISEMENT",
            "1 cup lemon-lime flavored carbonated beverage, chilled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a (1 quart) canning jar with ice. Measure in rum, peach schnapps and amaretto liqueur. Pour in cranberry juice until glass is 3/4 full. Fill with lemon-lime soda.\n",
        "picture_link": "qpUTbBOzBo8iTrxJToZe2NTsj9wvoJu"
    },
    {
        "title": "Black Walnut Cake",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "3 cups sugar ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup chopped black walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 325 degrees F (165 degrees C). Grease and flour a 10 inch tube pan.\nIn a large bowl, cream together the butter, shortening, and sugar until light and fluffy. Beat in the eggs one at a time, mixing just until the yellow disappears. Combine the flour, baking powder, and cinnamon; stir into the creamed mixture alternately with the milk. Stir in the vanilla and walnuts, and pour into the prepared pan.\nBake for 1 hour and 30 minutes, or until a knife or toothpick inserted into the crown comes out clean. Cool in the pan for about 15 minutes before turning out of the pan onto a wire rack to cool completely.\n",
        "picture_link": "az/Aas70PgCLkuWU9a4kuJJu2cAZ8wS"
    },
    {
        "title": "Cut-Out Cookies Made with Oat Flour",
        "ingredients": [
            "1 1/2 cups confectioners' sugar ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 cup oat flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, cream together the confectioners' sugar and butter until smooth. Beat in the egg and vanilla. Combine the all-purpose flour, oat flour, and baking soda; stir into the creamed mixture. Cover the dough, and chill for about 1 hour.\nPreheat the oven to 375 degrees F (190 degrees C). On a lightly floured surface, roll the dough out to 1/8 inch thickness. Cut into desired shapes using cookie cutters. Place cookies 2 inches apart onto an ungreased cookie sheet.\nBake for 7 to 8 minutes in the preheated oven, or until the edges begin to brown. Remove from baking sheets to cool on wire racks. When cool, eat plain, or frost with your favorite cookie frosting.\n",
        "picture_link": "lTDc8/w1GpF/Doyukd99h8ZhXy21JtK"
    },
    {
        "title": "Fresh Peach Cobbler II",
        "ingredients": [
            "3 cups sliced fresh peaches ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 teaspoon grated lemon zest ADVERTISEMENT",
            "1/4 teaspoon almond extract ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/3 cup shortening ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease an 8x8 inch square baking dish.\nPlace sliced peaches in prepared baking dish. Mix together 1 cup sugar, lemon juice, lemon zest, and almond extract. Place in oven while preparing shortcake (heating peaches first helps prevent dough from getting soggy).\nIn a large bowl, combine flour, 1 tablespoon sugar, baking powder, and salt. Cut in shortening until mixture resembles coarse crumbs. Add milk and egg; stir just until flour is moistened. Spread over hot peaches. Sprinkle top with remaining sugar.\nBake in preheated oven for 35 to 40 minutes, or until top is golden brown.\n",
        "picture_link": "FDeK6xxBbEKAgMcUQSyFM47vvw23Ytu"
    },
    {
        "title": "Steak N Gravy",
        "ingredients": [
            "4 (4 ounce) venison steaks ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons ground bay leaves ADVERTISEMENT",
            "1 pinch salt and pepper ADVERTISEMENT",
            "4 tablespoons olive oil, divided ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "6 fresh mushrooms, sliced ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1 (10.5 ounce) can beef gravy ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut all fat and gristle off the meat, and pound each steak out with a meat tenderizer until they are thin but not tearing. In a shallow bowl, combine flour, bay leaf, salt and pepper. Dredge steaks in the flour mixture until evenly coated.\nHeat 1 tablespoon olive oil in a large heavy skillet over medium heat. Saute onions until soft and translucent. Stir in mushrooms and garlic, and cook until tender. Remove from skillet and set aside. Heat remaining oil, and fry each steak for 2 minutes on each side, or until golden brown. Return onion mixture to skillet. Stir in gravy and milk. Reduce heat, cover, and simmer for 30 to 40 minutes. Stir occasionally to prevent sticking.\n",
        "picture_link": "PnotmGzH1Kmfb68CHvovkPBH8dajx0G"
    },
    {
        "title": "Veal Angelica",
        "ingredients": [
            "8 (2 ounce) veal cutlets, pounded to 1/4 inch thickness ADVERTISEMENT",
            "8 (1 ounce) slices provolone cheese ADVERTISEMENT",
            "8 fresh asparagus spears ADVERTISEMENT",
            "4 (1/2 ounce) slices prosciutto ADVERTISEMENT",
            "1 pinch salt and pepper to taste ADVERTISEMENT",
            "1 pinch garlic powder to taste ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 cup seasoned dry bread crumbs ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "2 cups sliced fresh mushrooms ADVERTISEMENT",
            "1/2 cup chopped Vidalia onion ADVERTISEMENT",
            "1/2 cup sliced roasted red peppers ADVERTISEMENT",
            "1 cup red wine ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season each veal cutlet with salt, pepper, and garlic powder. On each of four of the cutlets, place 1 slice of cheese, 2 spears of asparagus, one slice of prosciutto, and another slice of cheese on top. Top each stack with a second cutlet, folding under and pressing the edges together to make a package.\nIn a shallow bowl, whisk together egg and milk. Place the bread crumbs on a plate. Dredge both sides of the veal packages in flour. Dip each one in the egg mixture, then coat with bread crumbs. Place on a plate, and refrigerate for 30 minutes.\nPreheat the oven to 350 degrees F (175 degrees C). Heat olive oil in a large cast-iron skillet over medium-high heat. The skillet should be large enough to hold all four packages. Brown the veal on both sides, about 5 minutes per side. Add the onion and red peppers, and cook over medium heat until they are translucent. Pour in the wine, and simmer until the alcohol has cooked away - it will no longer smell as strongly. Pour in the chicken broth, and add the mushrooms.\nPlace the skillet and its contents into the preheated oven, and bake for about 30 minutes, or until the internal temperature of the veal has reached 160 degrees F (70 degrees C). The sauce should also be reduced by about half.\n",
        "picture_link": "3GgAaL1dWpfY7NLW6ciFGWD46UbGhqu"
    },
    {
        "title": "Carmel Apple Martini",
        "ingredients": [
            "2 fluid ounces best-quality vodka ADVERTISEMENT",
            "1 fluid ounce sour apple schnapps ADVERTISEMENT",
            "1/2 fluid ounce butterscotch schnapps ADVERTISEMENT",
            "1 cup crushed ice ADVERTISEMENT",
            "1 slice dried apple ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine vodka, schnapps, and crushed ice in a shaker. Shake vigorously to chill. Pour into martini glass, garnish with dried apple, and serve.\n",
        "picture_link": "URf.zIJOfp90o.ZF66yhiL0iBTQWFoq"
    },
    {
        "title": "Snapper Veracruz",
        "ingredients": [
            "1/4 cup olive oil ADVERTISEMENT",
            "1 small green bell pepper, chopped ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1/4 teaspoon ground white pepper ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "1/2 cup pimento-stuffed green olives, sliced ADVERTISEMENT",
            "1/4 cup canned diced green chiles, drained ADVERTISEMENT",
            "3 large tomatoes, seeded and coarsely chopped ADVERTISEMENT",
            "4 (8 ounce) fillets red snapper ADVERTISEMENT",
            "1 tablespoon capers, rinsed and drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large skillet over medium-high heat. Add green pepper, onion, and garlic, and cook until pepper is soft, about 5 minutes. Mix in the white pepper, cinnamon, lime juice, olives, and chiles; cook for 2 more minutes, to blend the flavors. Stir in the tomatoes, and cook until thickened, about 10 minutes.\nPreheat the oven to 350 degrees F (175 degrees C). Place the snapper filets into a lightly greased 9x13 inch baking dish. Pour the tomato sauce over the filets, and bake for 10 to 15 minutes in the preheated oven, or until fish flakes easily with a fork. Stir in the capers just before serving.\n",
        "picture_link": "MOkFmV2jXUGzyJ3S2l37BeNpiuaXGBG"
    },
    {
        "title": "Nutty Granola II",
        "ingredients": [
            "1/2 cup canola oil ADVERTISEMENT",
            "1/3 cup hot water ADVERTISEMENT",
            "2/3 cup honey ADVERTISEMENT",
            "6 cups rolled oats ADVERTISEMENT",
            "3/4 cup sliced almonds ADVERTISEMENT",
            "3/4 cup chopped pecans ADVERTISEMENT",
            "3/4 cup chopped walnuts ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "1 1/2 cups golden raisins ADVERTISEMENT",
            "1/2 cup dried cherries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 325 degrees F (165 degrees C).\nIn a medium bowl, whisk together the oil, hot water and honey. In a large bowl, stir together the oats, almonds, pecans, and walnuts. Pour the honey mixture into the oat mixture and stir until the oats and nuts are evenly coated. Spread out the granola onto 2 baking sheets.\nBake for 10 minutes, stir, and bake 10 more minutes, or until toasted. Allow granola to cool completely before stirring in the raisins, golden raisins and dried cherries. Granola will harden as it cools. Break apart any large lumps, and store in an airtight container at room temperature.\n",
        "picture_link": "Gvj8kcW9SnrT125htfexT8DafTDyeF6"
    },
    {
        "title": "Cholesterol King Heart Stopper 2000",
        "ingredients": [
            "1 (1 pound) loaf French bread, halved lengthwise ADVERTISEMENT",
            "4 tablespoons butter, softened ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 cup grated Parmesan cheese ADVERTISEMENT",
            "1 head lettuce, shredded ADVERTISEMENT",
            "1 pound sliced cooked ham ADVERTISEMENT",
            "1 pound sliced deli turkey meat ADVERTISEMENT",
            "1 pound sliced cotto salami ADVERTISEMENT",
            "1 pound sliced mozzarella cheese ADVERTISEMENT",
            "1 pound sliced Swiss cheese ADVERTISEMENT",
            "1 pound sliced provolone cheese ADVERTISEMENT",
            "2 tomatoes, sliced ADVERTISEMENT",
            "1 sweet onion, sliced ADVERTISEMENT",
            "1 (10 ounce) can pitted black olives, sliced (optional) ADVERTISEMENT",
            "1 (4 ounce) jar sliced mushrooms, drained (optional) ADVERTISEMENT",
            "1 green bell pepper, seeded and thinly sliced (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). In a small bowl, mix together the butter and garlic. Spread garlic butter on both halves of bread, and sprinkle liberally with Parmesan cheese. Place in preheated oven until cheese is golden brown. Remove from oven and allow to cool slightly.\nOn the bottom half of the bread, place a layer of lettuce. Alternating between meat and cheese, arrange layers of ham, turkey, salami, mozzarella, Swiss cheese and provolone. Add a layer of tomatoes, onion, black olives, mushrooms, green peppers and anything else you like. Place the remaining half of bread on top.\nPlace the sandwich on a cutting board, and slice into individual servings.\n",
        "picture_link": "pJCjcSnlem6p39kQoAlEM/t/gpHsmyC"
    },
    {
        "title": "Cilantro Egg Salad",
        "ingredients": [
            "5 hard-cooked eggs, finely chopped ADVERTISEMENT",
            "3/4 cup mayonnaise ADVERTISEMENT",
            "3/4 cup chopped fresh cilantro ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1 teaspoon lime juice ADVERTISEMENT",
            "1 stalk celery rib, finely diced ADVERTISEMENT",
            "4 fresh mushrooms, finely diced ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, stir together the eggs, mayonnaise, cilantro, mustard, lemon juice, lime juice, celery, and mushrooms. Season with salt and pepper to taste. Serve on bread or toast.\n",
        "picture_link": "gsMxKWyPrENtU5cuKlf33LfduN/lqTa"
    },
    {
        "title": "Baked Chicken-Fried Steak with Mushroom Gravy",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "6 (4 ounce) cube steaks ADVERTISEMENT",
            "1 cup peanut or vegetable oil, for frying ADVERTISEMENT",
            "1 pinch seasoned salt, or to taste ADVERTISEMENT",
            "1 pinch garlic powder, or to taste ADVERTISEMENT",
            "1 pinch black pepper, or to taste ADVERTISEMENT",
            "2/3 cup finely diced onion ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "2 (4.5 ounce) cans sliced mushrooms with juice ADVERTISEMENT",
            "1/2 (10.75 ounce) can water, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x12 inch baking dish. Place flour in a shallow dish. Dredge steaks in the flour to coat evenly.\nHeat peanut oil in a skillet over medium heat, and cook the steaks for about 5 to 8 minutes per side, until golden brown.\nPlace 3 fried cube steaks in the bottom of the prepared baking dish. Sprinkle the steaks lightly with seasoned salt, garlic powder, and pepper, and scatter 1/3 cup of diced onions over the steaks. Layer the remaining 3 steaks on top, repeat the seasoning, and sprinkle with the rest of the onion.\nPour the condensed soup in a bowl, and drain the juice from the canned mushrooms into the empty soup can. Pour in enough water to fill the can, and whisk the liquid and mushrooms into the soup. Pour the soup mixture over the layered steaks.\nCover and bake for 30 minutes in the preheated oven. Reduce heat to 300 degrees F (150 degrees C) and bake for an additional 30 to 45 minutes, until the onions are tender and the gravy is thick and bubbling.\n",
        "picture_link": "ieoS4zacQ6Fy8iaczLbAyLbbkU3X8UK"
    },
    {
        "title": "Creamy Beet With Dill Soup",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 1/2 pounds raw beets, cut into 1-inch chunks ADVERTISEMENT",
            "1 large onion, cut into large dice ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 pinch sugar ADVERTISEMENT",
            "3 large garlic cloves, thickly sliced ADVERTISEMENT",
            "1 teaspoon toasted caraway seeds* ADVERTISEMENT",
            "1/8 teaspoon cayenne pepper ADVERTISEMENT",
            "3 cups chicken broth, homemade or from a carton or can ADVERTISEMENT",
            "2 tablespoons fresh dill ADVERTISEMENT",
            "1 1/2 cups half-and-half (or whole milk) ADVERTISEMENT",
            "Salt and freshly ground pepper, to taste ADVERTISEMENT",
            "Garnish: chopped hard-cooked egg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil over medium-high heat in a large, deep saute pan until shimmering.\nAdd beets, then onion; saute, stirring very little at first, then more frequently, until squash start to turn golden brown, 7 to 8 minutes.\nReduce heat to low and add butter, sugar and garlic; continue cooking until all vegetables are a rich spotty caramel color, about 10 minutes longer.\nAdd caraway seeds and cayenne pepper; continue to saute until fragrant, 30 seconds to 1 minute longer.\nAdd broth; bring to a simmer over medium-high heat. Reduce heat to low and simmer, partially covered, until beets are tender, about 10 minutes.\nUsing an immersion blender or traditional blender, puree (adding fresh dill) until very smooth, 30 seconds to 1 minute. (If using a traditional blender, vent it either by removing the lid's pop-out center or by lifting one edge of the lid. Drape the blender canister with a kitchen towel. To 'clean' the canister, pour in a little half-and-half, blend briefly, then add to the soup.)\nReturn to pan (or a soup pot); add enough half-and-half so the mixture is souplike, yet thick enough to float garnish. Taste, and add salt and pepper if needed. Heat through, ladle into bowls, garnish and serve.\n",
        "picture_link": "fkaJzzt74TzJOi/GBnzS.Z48SSFrGbK"
    },
    {
        "title": "Chicken Roche",
        "ingredients": [
            "1 cup uncooked long grain white rice ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves - cut into strips ADVERTISEMENT",
            "1 (15 ounce) can black beans, drained ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "1 (14.5 ounce) can green beans, drained ADVERTISEMENT",
            "1 tablespoon Creole seasoning ADVERTISEMENT",
            "1 1/2 tablespoons chili powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a pot, bring the rice and water to a boil. Reduce heat to low, cover, and simmer 20 minutes.\nHeat the oil in a skillet over medium heat, and cook the chicken strips 10 minutes, or until browned and juices run clear.\nIn a saucepan over medium-low heat, mix the black beans, diced tomatoes, green beans, Creole seasoning, and chili powder. Cook, stirring occasionally, until heated through.\nMix the chicken into the bean and tomato mixture, and continue cooking 5 minutes. Serve over the rice.\n",
        "picture_link": "D3b0EOZigrjvSDA/wZLlIeBN4TAdffa"
    },
    {
        "title": "Marinated Black-Eyed Pea Salad",
        "ingredients": [
            "1 yellow bell pepper, finely chopped ADVERTISEMENT",
            "1 red bell pepper, finely chopped ADVERTISEMENT",
            "1/2 onion, finely chopped ADVERTISEMENT",
            "2 jalapeno chiles, seeded and finely chopped ADVERTISEMENT",
            "4 (15 ounce) cans black-eyed peas, rinsed and drained ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 cup red wine vinegar ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "4 slices cooked bacon, crumbled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the yellow and red peppers, onion, jalapeno chiles, black-eyed peas, parsley, and garlic together in a large bowl.\nWhisk the red wine vinegar and balsamic vinegar together in a small bowl. Gradually add the olive oil, whisking constantly to thoroughly blend with the vinegars. Stir in the cumin, salt, and black pepper. Pour the dressing over the vegetable mixture, tossing to coat evenly. Cover and refrigerate 3 to 4 hours. Just before serving, stir in the crumbled bacon.\n",
        "picture_link": "0lbd2Ii.iZ00.DzAuTrbTsOkum0zyCW"
    },
    {
        "title": "Asian-Inspired Honey-Vanilla Chicken",
        "ingredients": [
            "3 tablespoons soy sauce ADVERTISEMENT",
            "1 tablespoon orange juice ADVERTISEMENT",
            "1 teaspoon hot pepper sauce, or to taste ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 tablespoon light brown sugar ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1/2 teaspoon minced garlic ADVERTISEMENT",
            "1/2 tablespoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon Italian seasoning ADVERTISEMENT",
            "1/2 teaspoon sesame oil ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "2 pounds skinless, boneless chicken breast meat - cut into strips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together soy sauce, orange juice, hot pepper sauce, vanilla, brown sugar, and honey until dissolved. Season with minced garlic, garlic powder, and Italian seasoning. Whisk in sesame oil and vegetable oil until combined.\nToss chicken with marinade, cover, and refrigerate for at least 20 minutes.\nAdjust oven rack to its top position, and turn oven on to Broil.\nPlace chicken into a baking dish or baking sheet. Broil until golden brown, 5 to 8 minutes. Turn chicken over, and continue broiling until no longer pink, about 5 minutes more.\n",
        "picture_link": "nO1CFJnHRP9BsEAtES6WwXp/3j4NbGO"
    },
    {
        "title": "Red, White and Blue Burgers",
        "ingredients": [
            "2 pounds ground beef sirloin ADVERTISEMENT",
            "1 red onion, diced ADVERTISEMENT",
            "1/2 (1 ounce) package dry ranch salad dressing mix ADVERTISEMENT",
            "4 ounces crumbled blue cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium-high heat, and lightly oil the grate.\nLightly mix together the ground sirloin, onion, ranch salad dressing mix, and blue cheese in a bowl. Form into 6 patties.\nGrill the burgers for about 5 minutes per side on the prepared grill, until well done.\n",
        "picture_link": "HDGhTuZ5RsK8Z2ohJsNMp8.L2apgWfG"
    },
    {
        "title": "Jewish Apple Cake",
        "ingredients": [
            "2 cups peeled apples, thinly sliced ADVERTISEMENT",
            "5 tablespoons white sugar ADVERTISEMENT",
            "2 tablespoons ground cinnamon ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "2 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "1/4 cup orange juice ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "1/3 cup orange juice ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 325 degrees F (165 degrees C). Grease and flour a 9 inch tube pan.\nMix apples, 5 tablespoons sugar, and 2 tablespoons ground cinnamon in a bowl and set aside. Beat the oil and 2 cups of sugar with an electric mixer in a large bowl. Add the room-temperature eggs one at a time, allowing each egg to blend into the sugar mixture before adding the next. Beat in the vanilla and 1/4 cup of orange juice with the last egg. Combine the flour, baking powder, and salt in a small bowl and stir into the sugar mixture; mixing until just incorporated. Pour half of the batter into the prepared tube pan. Layer the apple mixture on top, then pour the remaining batter over the apples.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 1 hour and 25 minutes. Allow cake to cool completely in the pan before removing.\nTo make glaze: Combine butter, 1/3 cup of orange juice, and 2/3 cup of sugar in a bowl. Pour over the warm cake while still in the pan.\n",
        "picture_link": "QFsvRHIzcILBK/Y531YvHLJPxWncble"
    },
    {
        "title": "Tomato-Cornbread Salad with Avocado and Cilantro",
        "ingredients": [
            "5 cups 1/2-inch cubed cornbread made from an 8.5-ounce box mix ADVERTISEMENT",
            "1 1/2 pounds tomatoes, stemmed and cut into medium dice ADVERTISEMENT",
            "salt, to taste ADVERTISEMENT",
            "2 medium garlic cloves, minced ADVERTISEMENT",
            "1/2 large red onion, cut into small dice ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "2 ripe avocados cut into medium dice ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "2 tablespoons red wine vinegar ADVERTISEMENT",
            "Ground black pepper, to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Adjust oven rack to center position and heat oven to 250 degrees.\nPlace cornbread cubes on a cookie sheet with a rim; bake until bread is dried out, about 30 minutes, then set aside to cool.\nSalt the tomatoes, stir in the garlic and let stand until juicy, about 30 minutes.\nPrepare remaining ingredients; toss with tomatoes. Add bread; toss. Let stand 10 minutes before serving.\n",
        "picture_link": "cb5KIs85tmqie.0oD6m/TOitI7Qicgy"
    },
    {
        "title": "Fresh Fruit Flan",
        "ingredients": [
            "Crust: ADVERTISEMENT",
            "2 1/8 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon cream of tartar ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "Fruit: ADVERTISEMENT",
            "3 cups fresh strawberries, hulled and halved ADVERTISEMENT",
            "1 cup fresh blueberries, rinsed and dried ADVERTISEMENT",
            "3 kiwifruit, peeled and thinly sliced ADVERTISEMENT",
            "Glaze: ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 10-by-15 inch jelly roll pan.\nFor the crust, sift together the flour, cream of tartar, and baking soda into a mixing bowl. In a separate bowl, cream together white and confectioners' sugars, butter, vegetable oil, egg, and vanilla. Add the dry ingredients. Blend well. Spread the dough evenly on the bottom of the greased pan. Bake until golden brown, 10 to 12 minutes. Allow to cool completely.\nFor the filling, cream together the cream cheese, sugar, and vanilla. Spread over the cooled crust. Arrange the fruit on the cream cheese filling and refrigerate.\nFor the glaze, mix together the sugar and cornstarch in a small saucepan. Whisk in the water, orange juice, and lemon juice. Bring to a boil over medium heat; boil gently for one minute. Remove from heat and allow to cool completely.\nSpoon or brush the glaze evenly over the fruit. Refrigerate until ready to serve.\n",
        "picture_link": "Ick9UeAAbvsiF1cPY7DCtTIr7DbYUey"
    },
    {
        "title": "Sugar and Spice Bacon",
        "ingredients": [
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1 teaspoon coarsely ground black pepper ADVERTISEMENT",
            "1 pound thick cut bacon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nPlace flour, sugar, and pepper into a resealable plastic bag and shake to mix. Shake bacon with flour mixture a few strips at a time to coat. Place coated bacon onto a baking sheet or broiler pan.\nBake in preheated oven for 15 minutes or until bacon has cooked to desired doneness.\n",
        "picture_link": "yOdQwkN3AUi8VAIzg8NRqhcz8HufBGi"
    },
    {
        "title": "Spanish-Style Chicken Stew",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "3 red onions, cut into 1-inch cubes ADVERTISEMENT",
            "3 cloves garlic, coarsely chopped ADVERTISEMENT",
            "1 (28 ounce) can Italian plum tomatoes ADVERTISEMENT",
            "1 (15 ounce) can garbanzo beans ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "2 teaspoons paprika ADVERTISEMENT",
            "1 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 carrots, cut into chunks ADVERTISEMENT",
            "1 potato, cubed ADVERTISEMENT",
            "4 chicken thighs ADVERTISEMENT",
            "4 ounces Spanish chorizo sausage, casing removed, sliced 1/4-inch thick (see note) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large saucepan over medium-high heat. Stir in onions and garlic, cook until the onion has softened and turned translucent. Pour in tomatoes, garbanzo beans, and water; season with paprika, red pepper flakes, salt, and pepper. Stir in carrots and potatoes, then place chicken thighs skin-side up on top of the vegetables.\nBring to a boil over high heat, then reduce heat to medium, cover, and simmer until the chicken is tender, about 25 minutes.\nPreheat oven to 400 degrees F (200 degrees C).\nRemove chicken from the stew and set aside. Stir in the chorizo slices, then pour the stew into a glass baking dish. Place the chicken thighs on top, skin-side up.\nBake in preheated oven until the stew has thickened and the chicken skin is crispy, about 15 minutes.\n",
        "picture_link": "FELvrXXESVZp74bqPZMoiibbSumXEyq"
    },
    {
        "title": "Mexican Atole",
        "ingredients": [
            "1/2 cup masa (corn flour) ADVERTISEMENT",
            "5 cups water ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "5 tablespoons piloncillo, brown sugar cones ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the masa, water, cinnamon and piloncillo in a blender. Blend until smooth, about 3 minutes.\nPour the contents of the blender into a sauce pan and bring the mixture to boil over medium heat, stirring constantly. When the mixture reaches a boil, turn the heat to low and continue to whisk for 5 minutes.\nRemove the pan from the heat and stir in the vanilla. Pour into mugs and serve hot.\n",
        "picture_link": "R3zdZXR4AEZtzMhkbG4YcyoF0hcd8Cq"
    },
    {
        "title": "Newfoundland Jigg's Dinner",
        "ingredients": [
            "1 (3 pound) boneless corned beef brisket ADVERTISEMENT",
            "1 1/2 cups yellow split peas ADVERTISEMENT",
            "1 large head cabbage, quartered ADVERTISEMENT",
            "1 medium turnip, peeled and cubed ADVERTISEMENT",
            "6 carrots, peeled and cut in chunks ADVERTISEMENT",
            "6 large potatoes, peeled and quartered ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "Dumplings: ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cover the corned beef with cold water and soak overnight in the refrigerator.\nDrain the beef and place in a large Dutch oven. Cover with fresh water. Place the yellow peas in a triple layer of cheesecloth and tie securely. Place the bag inside the Dutch oven with the beef. Bring to a boil, then reduce to a simmer and cook for 2 hours.\nAfter 2 hours, add the chopped cabbage, turnip, and carrots to the pot. Simmer for 25 minutes.\nAdd the chopped potatoes and simmer an additional 20 to 25 minutes, or until all of the vegetables are fork tender.\nWhile the vegetables are cooking, prepare the dumpling dough as follows: Combine the flour, sugar, and baking powder in a bowl, then add the water a little bit at a time to make a pasty dough. You may not need to add all of the water. Divide the dough into 6 balls. Be careful not to over-handle the dough.\nDuring the last 5 to 10 minutes of simmering the vegetables, place the dough balls on top of the vegetables and cover with a lid. Allow the dumplings to steam in the pot for 7 minutes.\nWhen the dumplings are cooked through, remove all ingredients from the pot and arrange on a warm serving platter. Remove the cooked peas from the cheesecloth bag and mash with the butter and black pepper. Serve alongside the beef and vegetables.\n",
        "picture_link": "DZC582lB87N3nUaZZmYvKEQlenZkbe6"
    },
    {
        "title": "Mom's Shredded Elk Sandwiches",
        "ingredients": [
            "1 1/2 cups ketchup ADVERTISEMENT",
            "3 tablespoons brown sugar ADVERTISEMENT",
            "1 tablespoon dry mustard powder ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 tablespoon liquid smoke flavoring ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "2 teaspoons celery salt ADVERTISEMENT",
            "2 teaspoons ground black pepper ADVERTISEMENT",
            "2 teaspoons Worcestershire sauce ADVERTISEMENT",
            "1/8 teaspoon ground nutmeg ADVERTISEMENT",
            "3 drops hot pepper sauce ADVERTISEMENT",
            "1 (4 pound) elk roast, cut in half ADVERTISEMENT",
            "10 hamburger buns, split ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the ketchup, brown sugar, mustard powder, lemon juice, liquid smoke, onion powder, garlic powder, celery salt, black pepper, Worcestershire sauce, nutmeg, and hot pepper sauce in a bowl. Place the elk roast into a large slow cooker, and pour the sauce overtop.\nCover, and cook on High until the meat shreds easily with a fork, about 5 hours. Shred, and serve on the hamburger buns.\n",
        "picture_link": "j96iRkozPN/k5FRR/91RdiJyRDfYRWS"
    },
    {
        "title": "Spicy Lentil Nachos",
        "ingredients": [
            "1 teaspoon coconut oil ADVERTISEMENT",
            "1 cup finely chopped onion ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 cup dried lentils ADVERTISEMENT",
            "2 1/2 cups chicken broth ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 cup cooked black beans ADVERTISEMENT",
            "1 cup corn kernels ADVERTISEMENT",
            "1 cup salsa ADVERTISEMENT",
            "1 cup shredded Monterey Jack cheese ADVERTISEMENT",
            "1 (13.5 ounce) package tortilla chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat coconut oil in a skillet over medium heat. Place onion in skillet and cook, stirring, until tender, about 5 minutes. Add garlic and cook another minute.\nStir in lentils, broth, chili powder, cumin, and oregano. Bring to a boil, reduce heat to low, and simmer until lentils are tender, about 30 minutes. Season with salt and pepper.\nCombine black beans and corn in a saucepan (if using canned beans and corn, drain first). Cook over medium heat, stirring occasionally, until heated through about 8 minutes.\nSpread tortilla chips on a serving platter. Spoon a layer of lentils on the chips, then a layer of black beans and corn, and then salsa. Sprinkle with shredded cheese. Serve while still warm.\n",
        "picture_link": "pM8WHFY0ZMl48KPfU7B3Uidj8tuW2hi"
    },
    {
        "title": "Couscous Feta Salad",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "1 1/3 cups couscous ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "2 tablespoons red wine vinegar ADVERTISEMENT",
            "1 1/2 tablespoons Dijon mustard ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "1 cucumber, seeded and chopped ADVERTISEMENT",
            "1 (4 ounce) container crumbled feta cheese ADVERTISEMENT",
            "6 green onions, chopped ADVERTISEMENT",
            "1/2 cup chopped fresh parsley ADVERTISEMENT",
            "1/4 cup toasted pine nuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring the water to a boil in a saucepan over high heat. Remove from the heat, and stir in the couscous. Cover, and let stand for 10 minutes. Scrape the couscous into a mixing bowl, fluff with a fork, and refrigerate until cold, about 1 hour.\nOnce the couscous is cold, make the dressing by whisking together the salt, black pepper, red wine vinegar, and Dijon mustard in a small bowl. Slowly drizzle in the olive oil while continuing to whisk until the oil has thickened the dressing. Fold the cucumber, feta cheese, green onions, parsley, and pine nuts into the couscous. Pour the dressing overtop, and stir until evenly moistened. Chill 30 minutes before serving.\n",
        "picture_link": "FwmLPWu7hAnMR/iB0gpmus4wAdCorDu"
    },
    {
        "title": "Cream Cheese and Prosciutto Stuffed Chicken",
        "ingredients": [
            "1 (8 ounce) package reduced-fat cream cheese ADVERTISEMENT",
            "1/2 cup minced red onion ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "8 slices prosciutto ADVERTISEMENT",
            "8 leaves fresh basil ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 cup white wine (optional) ADVERTISEMENT",
            "2 cups chicken broth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the cream cheese, red onion, garlic, and black pepper together in a small bowl; set aside. Place the chicken breasts between two sheets of waxed paper on a solid, level surface. Firmly pound the chicken with the smooth side of a meat mallet to a thickness of 1/4 inch.\nSpread the cream cheese mixture over the flattened chicken breasts, then place two slices of prosciutto and two leaves of basil over the cream cheese on each breast. Roll the chicken breasts over the filling, and secure with toothpicks. Cover, and refrigerate 1 hour to overnight.\nHeat the olive oil in a large skillet over medium-high heat. Add the chicken breasts; cook until browned on all sides, about 10 minutes. Remove the chicken from the pan, and set aside. Whisk the butter and flour into the skillet until the butter melts and the flour turns golden, about 1 minute. Stir in the white wine, and cook for 1 minute. Pour in the chicken broth, and return to a boil. Reduce heat to medium-low; simmer for a few more minutes. Return the chicken breasts to the skillet, and cover; cook until the chicken is no longer pink in the center, about 5 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "q87f9zp3oQ53Gegq5YA6glt1heIU56e"
    },
    {
        "title": "Arugula and Watermelon Salad",
        "ingredients": [
            "2 (5 ounce) packages arugula ADVERTISEMENT",
            "1/2 large watermelon, seeded and cubed ADVERTISEMENT",
            "1 red onion, sliced ADVERTISEMENT",
            "1 cup crumbled feta cheese ADVERTISEMENT",
            "1 1/2 cups balsamic vinaigrette ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss the arugula, watermelon, red onion, and feta cheese with the balsamic vinaigrette in a large bowl. Serve cold.\n",
        "picture_link": "LnZBJkHUG2VjgLr0WPmmfikzyBuVsbq"
    },
    {
        "title": "Indian Hot Curried Mangos with Tofu",
        "ingredients": [
            "1 tablespoon sesame oil ADVERTISEMENT",
            "5 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon minced ginger ADVERTISEMENT",
            "1 firm mango, peeled and sliced ADVERTISEMENT",
            "3 tablespoons yellow curry powder ADVERTISEMENT",
            "2 tablespoons chopped cilantro ADVERTISEMENT",
            "1 (14 ounce) can light coconut milk ADVERTISEMENT",
            "1 (14 ounce) package extra firm tofu, cubed ADVERTISEMENT",
            "1/4 teaspoon salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the sesame oil in a large pan over medium-high heat. Cook the garlic and ginger until fragrant and light brown, about 1 to 2 minutes. Add the mango and cook for another minute to soften slightly. Stir in the curry powder and cilantro; cook for another minute to release the flavor of the curry.\nPour in the coconut milk and bring to a simmer. Stir in the tofu and season to taste with salt and pepper. Simmer until the liquid is reduced by half, stirring occasionally, about 5 minutes.\n",
        "picture_link": "T4ApTY9FXFwG8HxWyAgbVo1gTOjYUTe"
    },
    {
        "title": "Caramel Apple Crumble Pie",
        "ingredients": [
            "FOR THE CRUMBLE TOPPING ADVERTISEMENT",
            "1 cup rolled oats ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup slivered almonds ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 cup butter, cubed ADVERTISEMENT",
            "FOR THE PIE ADVERTISEMENT",
            "1 (9 inch) single pie crust ADVERTISEMENT",
            "6 apples - peeled, cored, and thinly sliced ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/2 cup caramel sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C).\nTo make the topping, combine the oats, 1/2 cup brown sugar, 1/4 cup flour, slivered almonds, and 1/4 teaspoon cinnamon. Cut in the butter until the mixture resembles coarse crumbs; set aside.\nRoll out the pie dough into a circle and transfer it to a 9-inch pie plate. Trim the pastry and crimp the edge. Toss the apples with the lemon juice in a bowl to prevent browning. Combine the 1 tablespoon flour, 1/2 cup brown sugar, and 2 teaspoons cinnamon; toss with the apples to coat. Drizzle 1/4 cup of caramel sauce over the bottom of the pie shell. Add the spiced apple mixture; drizzle with remaining 1/4 cup of caramel sauce. Sprinkle the crumble topping evenly over the apples.\nBake the pie in the preheated oven for 50-60 minutes, or until the apples are tender and the crust is browned.\n",
        "picture_link": "cY/nYIN6.d4ZUnbNTtjejSXoTAH6dK2"
    },
    {
        "title": "Old-Fashioned Peach Cream Pie",
        "ingredients": [
            "3/4 cup white sugar ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 egg, lightly beaten ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups sliced peaches ADVERTISEMENT",
            "1 unbaked pie crust ADVERTISEMENT",
            "1/3 cup all-purpose flour ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nWhisk together the 3/4 cup sugar, the 2 tablespoons flour, and salt. Beat in the sour cream, egg, and vanilla. Stir in the sliced peaches. Pour the mixture into the pie crust.\nBake in the preheated oven for 12 minutes. Reduce the oven temperature to 350 degrees F (175 degrees C), and continue baking until the filling is set, about 30 minutes. Remove from oven.\nRaise oven temperature to 400 degrees F (200 degrees C).\nWhisk together the 1/3 cup flour, 1/3 cup sugar, and cinnamon in a small bowl. Mix in the butter with a fork until mixture resembles coarse crumbs. Sprinkle the crumb topping evenly over the pie.\nReturn the pie to the preheated oven and bake until topping is golden, about 10 minutes. Let pie cool slightly before slicing.\n",
        "picture_link": ".MqhERukxMGvpuTSJA7Rq7FUiD4fUBi"
    },
    {
        "title": "Argentinean Chimichurri",
        "ingredients": [
            "1/2 cup olive oil ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1/3 cup minced shallot ADVERTISEMENT",
            "1/3 cup minced fresh parsley ADVERTISEMENT",
            "1 teaspoon chopped fresh basil ADVERTISEMENT",
            "1 teaspoon chopped fresh thyme ADVERTISEMENT",
            "1 teaspoon chopped fresh oregano ADVERTISEMENT",
            "Salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir olive oil and lemon juice together with garlic, shallot, parsley, basil, thyme, and oregano; season to taste with salt and pepper. Allow to stand for 2 hours at room temperature before serving; store remaining chimichurri in refrigerator.\n",
        "picture_link": "RrrNY1LXx5h0CmirFhgnVOvRXEIMMla"
    },
    {
        "title": "St. Patrick's Colcannon",
        "ingredients": [
            "3 pounds red potatoes, quartered ADVERTISEMENT",
            "1 head cabbage, cored and shredded ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "4 green onions, sliced, white parts and tops separated ADVERTISEMENT",
            "white pepper to taste ADVERTISEMENT",
            "1 1/4 cups hot milk ADVERTISEMENT",
            "1 pound leftover corned beef, cut into pieces and warmed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes in a large saucepan and add water to cover by 1-inch. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until tender, about 20 minutes.\nMeanwhile, bring a large pot of salted water to a boil. Stir in cabbage along with 2 tablespoons of butter; cover, and simmer until the cabbage has softened. Drain.\nMelt 1/2-cup butter over medium heat. Stir in garlic and the white parts of the green onions. Cook until the garlic has softened and mellowed.\nDrain the potatoes and mash with white pepper to taste. Fold in melted butter, milk, cabbage, and corned beef. Sprinkle with green onion tops to serve.\n",
        "picture_link": "tEyqZSrfd7h760Lhu1Z4YplDSxhZ0Ti"
    },
    {
        "title": "Orange Cream Frosting",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "3 1/2 cups confectioners' sugar ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "2 tablespoons orange juice ADVERTISEMENT",
            "2 tablespoons light corn syrup ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 drops orange food coloring ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, beat softened butter, confectioners' sugar and salt until smooth. Add orange juice, corn syrup and vanilla. Beat until smooth and creamy. Tint with orange food coloring.\n",
        "picture_link": "TloTf/pWOA37.JAEj457YKibpFJWQ6e"
    },
    {
        "title": "Indiana Potato Salad",
        "ingredients": [
            "8 baking potatoes, peeled and cubed ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "8 ounces processed cheese food, cubed ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "8 ounces sliced bacon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nPlace potatoes into a pot and fill with enough water to cover. Bring to a boil and cook until easily pierced with a fork, about 12 minutes. Drain and pour into a 9x13 inch baking dish. Mix with mayonnaise, processed cheese and onion.\nWhile the potatoes are boiling, fry the bacon in a large skillet over medium heat until crisp. Drain and break into large pieces. Place on top of the potatoes.\nBake for 1 hour in the preheated oven, until cheese is browned.\n",
        "picture_link": "3CzD7BXVFx.P4L/Ia0wMC8JT73gRfeu"
    },
    {
        "title": "Oven Fried Sesame Potatoes",
        "ingredients": [
            "4 medium potatoes, cut into wedges ADVERTISEMENT",
            "2 teaspoons canola oil ADVERTISEMENT",
            "1 teaspoon seasoning salt ADVERTISEMENT",
            "1 teaspoon ground paprika ADVERTISEMENT",
            "1 tablespoon sesame seeds ADVERTISEMENT",
            "1 teaspoon chili powder, or to taste ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 400 degrees F (200 degrees C). Line a large baking sheet with aluminum foil.\nPlace the potato wedges in a plastic bag, or bowl with a lid. Add oil, and toss to coat. Season the potatoes with seasoning salt, paprika, chili powder, and pepper, and add the sesame seeds. Replace lid or close bag, and shake to coat evenly. Spread the potato wedges out in a single layer onto the prepared baking sheet.\nBake for 50 to 60 minutes, stirring every 15 minutes or so, until the potatoes are tender and golden.\n",
        "picture_link": "X8P9oTozqk9oiaJRsyjKP/gglEJuq/a"
    },
    {
        "title": "Rushin' Casserole",
        "ingredients": [
            "1 (16 ounce) package wide egg noodles ADVERTISEMENT",
            "4 cups plain yogurt ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add noodles and cook for 8 to 10 minutes or until al dente. Drain, and transfer to a serving dish. While the pasta is cooking, mix together the yogurt and garlic in a medium bowl. Cover, and refrigerate until serving.\nIn a large skillet over medium heat, brown the ground beef with the onion. Season with cinnamon while cooking. Drain off excess grease, and stir in lemon juice and salt. Adjust seasoning to taste. Toss the meat mixture with noodles, and serve hot with cold yogurt sauce spooned over.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Ozarks Potato Salad",
        "ingredients": [
            "5 pounds red potatoes ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "2 1/2 cups creamy salad dressing, e.g. Miracle Whip ™ ADVERTISEMENT",
            "1/4 cup prepared yellow mustard ADVERTISEMENT",
            "6 hard-cooked eggs, diced ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the potatoes in a large pot and fill with enough water to cover. Bring to a boil, then reduce heat to medium and cook until tender enough to pierce with a fork, about 15 minutes. Drain and cool slightly. Remove the peels and cut into cubes. Set aside to cool completely.\nIn a large bowl, mix together the onion, salad dressing and mustard. Stir in the hard-cooked eggs and cooled potatoes. Try not to mash the potatoes very much. Season with salt and pepper.\n",
        "picture_link": "NqlfSkbyu6xLxJe7Kbe6Jt.1KXjKhoy"
    },
    {
        "title": "Pan Fried Filets with Mushroom Sauce",
        "ingredients": [
            "1 (8 ounce) can chopped mushrooms - drained, liquid reserved ADVERTISEMENT",
            "1/4 cup unsalted butter, softened ADVERTISEMENT",
            "1/4 cup minced onion ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "fresh ground black pepper to taste ADVERTISEMENT",
            "4 (4 ounce) beef tenderloin filets ADVERTISEMENT",
            "3 tablespoons strawberry jelly ADVERTISEMENT",
            "1/2 teaspoon fresh lemon juice ADVERTISEMENT",
            "5 tablespoons vanilla ice cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mince mushrooms, then mix with butter, minced onion, salt, and pepper in a small bowl. Reserve half of butter mixture, and divide other half over the 4 filets.\nHeat a large skillet over medium-high heat. Place steaks, butter side down, in hot skillet. Spread remaining butter mixture over steaks. Cook to desired doneness, turning once. Transfer filets to a plate, cover loosely with foil, and keep warm.\nReturn skillet to medium-high heat. Stir in reserved mushroom liquid, and scrape up any browned bits from the bottom of pan. Add jelly and lemon juice, and simmer until liquid is reduced by half. Stir in ice cream, and cook until sauce is thickened, about 2 minutes. Pour over filets, and serve immediately.\n",
        "picture_link": "1aMPHjgLMZEh8FD5cHwcIG9pjnj1WQe"
    },
    {
        "title": "Portobello Lemon Chicken",
        "ingredients": [
            "1 large yellow onion, chopped ADVERTISEMENT",
            "2 portobello mushroom caps, chopped ADVERTISEMENT",
            "2 pounds bone-in chicken pieces ADVERTISEMENT",
            "garlic salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "2 large lemons, juiced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nSpread the chopped onion and mushrooms evenly in the bottom of a 9x13 inch baking dish. Arrange chicken pieces over the vegetables, skin side up. Squeeze lemon juice over the chicken pieces, and season with garlic salt and pepper.\nBake chicken uncovered for 20 minutes in the preheated oven. Carefully turn the pieces over, and continue cooking 15 minutes more.\nSet oven to broil. Cook chicken for 5 minutes, or until chicken skin is crisp.\n",
        "picture_link": "UuJdAMQ2.chdg/8xFpArPvNLj.gkV8S"
    },
    {
        "title": "Bar Harbor Cranberry Pie",
        "ingredients": [
            "2 cups cranberries ADVERTISEMENT",
            "1 1/2 cups white sugar, divided ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup margarine, melted ADVERTISEMENT",
            "1/4 cup shortening, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 325 degrees F (165 degrees C). Butter a 9 inch glass pie plate.\nSpread cranberries over the bottom of the buttered pie plate. Sprinkle 1/2 cup of sugar and pecans over the berries. In a medium bowl, mix together the eggs and remaining sugar until well blended. Stir in flour, margarine and shortening, beating well after each addition. Pour over the cranberries.\nBake for 1 hour in the preheated oven, until the filling is set, and the top is lightly browned.\n",
        "picture_link": "18VP2aj6PPCPjCSKtw32ZX6/i.ZLiqW"
    },
    {
        "title": "Cinnamon Spice Drop Cookies",
        "ingredients": [
            "1 1/2 cups butter flavored shortening ADVERTISEMENT",
            "2 cups light brown sugar ADVERTISEMENT",
            "1/2 cup dark brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "2 tablespoons vanilla extract ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1 1/2 teaspoons baking soda ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "2 cups cinnamon chips ADVERTISEMENT",
            "1 cup chopped pecans (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nIn a large bowl, cream together the butter flavored shortening, light brown sugar and dark brown sugar. Beat in the eggs one at a time, then stir in the milk and vanilla, blending until the mixture is light and fluffy. Combine the flour, cinnamon, nutmeg, cloves, baking soda and salt; stir into the batter until well blended. Mix in cinnamon chips and if using, pecans. Drop rounded spoonfuls of dough onto the prepared cookie sheets about 2 inches apart.\nBake for 8 to 10 minutes in the preheated oven, just until the cookies lose their gloss. Remove from the cookie sheets to wire racks to cool.\n",
        "picture_link": "0tMibcvrA3tjLNFCQPnEV7pIQXZu3vu"
    },
    {
        "title": "French Fry Casserole  ",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 1/2 pounds lean ground beef ADVERTISEMENT",
            "1/2 onion, diced ADVERTISEMENT",
            "1/2 green bell pepper, diced ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "3/4 cup processed cheese sauce (such as Cheez Whiz®) ADVERTISEMENT",
            "1/2 (28 ounce) package frozen shoestring potato fries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C), and grease a 9x13 inch baking dish.\nHeat the oil in a skillet, and cook and stir the ground beef, onion, and green pepper over medium heat for about 15 minutes, until the meat is crumbly and no longer pink and the onion is translucent. Season with salt and pepper to taste, and stir in the condensed mushroom soup. Bring the mixture to a simmer over medium-low heat.\nScoop the cheese sauce into a microwaveable bowl, and melt on low power for about 30 seconds.\nPlace the ground beef mixture into the bottom of the prepared baking dish, and spread an even layer of the melted cheese sauce over the ground beef. Top with frozen shoestring fries. Bake in the preheated oven for about 20 minutes, until the fries are starting to turn golden.\n",
        "picture_link": "3ODEIvMQbRpCJNrpqUrWAxNiVeN90au"
    },
    {
        "title": "Crookneck Squash and Tomatoes",
        "ingredients": [
            "4 yellow squash, sliced ADVERTISEMENT",
            "4 medium tomatoes, sliced ADVERTISEMENT",
            "2 green onions, chopped ADVERTISEMENT",
            "2 tablespoons red wine vinegar ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon freshly ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease a 1 quart casserole dish.\nAlternate slices of the squash and tomatoes in the prepared casserole dish, and sprinkle with green onions. Mix the vinegar, oil, mustard, salt, and pepper in a bowl, and drizzle over the vegetables.\nBake 15 minutes in the preheated oven, or until squash is tender. Cool 15 minutes before serving.\n",
        "picture_link": "VEHf3y1RKySfQruh2n7if2sgmegxQMC"
    },
    {
        "title": "Beer Pizza",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 pound pepperoni sausage, diced ADVERTISEMENT",
            "1 pound bacon, diced ADVERTISEMENT",
            "1 (4 ounce) can sliced mushrooms, drained ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 (28 ounce) can tomato sauce ADVERTISEMENT",
            "1 cup beer ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 unbaked pizza crusts ADVERTISEMENT",
            "1 (8 ounce) package shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nHeat the oil in a skillet over medium heat, and saute the pepperoni and bacon until evenly browned. Mix in the mushrooms, onion, and green pepper. Cook and stir about 5 minutes, until tender.\nIn a medium saucepan over medium heat, mix the ingredients from the skillet with the tomato sauce and beer. Season with garlic, oregano, thyme, and salt. Allow the mixture to simmer for about 15 minutes, until slightly thickened. Spread over the 2 pizza crusts, and top with cheese.\nBake 20 to 25 minutes in the preheated oven, until the cheese is melted and the crust is golden brown.\n",
        "picture_link": "UOLPsVtccJxNTIzkL9NQlCGnWZmQvZq"
    },
    {
        "title": "Springtime Spinach Salad",
        "ingredients": [
            "2 eggs ADVERTISEMENT",
            "4 slices bacon ADVERTISEMENT",
            "5 cups fresh spinach, rinsed and torn into bite-size pieces ADVERTISEMENT",
            "1/2 cup sliced fresh mushrooms ADVERTISEMENT",
            "1 cup sliced fresh strawberries ADVERTISEMENT",
            "1/2 cup thinly sliced onion ADVERTISEMENT",
            "1 kiwi, sliced ADVERTISEMENT",
            "1/2 mandarin orange, peeled and segmented ADVERTISEMENT",
            "1/4 cup ketchup ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "2 tablespoons cider vinegar ADVERTISEMENT",
            "1/2 teaspoon spicy brown mustard ADVERTISEMENT",
            "1 dash garlic powder ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 cup seasoned croutons ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the eggs in a saucepan with enough cold water to cover. Bring to a boil and immediately remove from heat. Cover, and let eggs stand in hot water for 12 to 15 minutes. Remove from hot water and cool. Peel, chop, and set aside.\nCook the bacon in a skillet over medium high heat until crisp and evenly brown. Drain, crumble and set aside.\nIn a large bowl, toss together the eggs, bacon, spinach, mushrooms, strawberries, onion, kiwi, and orange.\nIn a separate bowl, mix the ketchup, water, olive oil, brown sugar, cider vinegar, and brown mustard. Season with garlic powder, salt, and pepper. Pour over the salad mixture, and top the salad with croutons.\n",
        "picture_link": "u69uXqS5VU/jVYaZVUPwl8doqDikqxa"
    },
    {
        "title": "Spicy Peruvian Pork",
        "ingredients": [
            "2 1/2 pounds boneless pork shoulder, cubed ADVERTISEMENT",
            "1/4 cup white vinegar ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "1 tablespoon ground turmeric ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon salt, or to taste ADVERTISEMENT",
            "1/4 teaspoon ground black pepper, or to taste ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 cup orange juice ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 tablespoon dried minced onion ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place pork into a large bowl. In a small bowl, mix together the vinegar, cumin, turmeric, garlic powder, salt and pepper. Pour over the pork, and stir to coat. Cover and refrigerate for 1 hour.\nHeat oil in a large skillet over medium-high heat. Remove pork from the marinade, reserving the marinade, and place in the hot skillet. Cook until nicely browned on the outside. Add orange juice, 1/2 cup water, dried onion, and the reserved marinade. Reduce heat to low, cover, and simmer for about 30 minutes, or until the pork is fork tender.\nIn a small cup, stir together the flour and 2 tablespoons of water. Stir into the skillet, and simmer uncovered until thickened, 2 to 4 minutes.\n",
        "picture_link": "pGw2DSva0twig71JnvadtYKmbulDh8y"
    },
    {
        "title": "Strawberry Brownies",
        "ingredients": [
            "1 egg ADVERTISEMENT",
            "1 cup melted butter, cooled ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1 pound sliced fresh strawberries, divided ADVERTISEMENT",
            "1 cup sugar ADVERTISEMENT",
            "1/2 cup cocoa powder ADVERTISEMENT",
            "1 1/2 cups cake flour, more as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9 inch pie plate.\nWhisk together egg, melted butter, and vanilla in a large bowl. Puree about 1/4 cup of the sliced strawberries and whisk into the butter. Sift together the sugar, cocoa powder, and cake flour. Fold into the butter, and mix until well incorporated. Use more flour if needed to end up with a mixture in between a cake batter and a cookie dough (the strawberries will add additional moisture). Gently fold in the remaining sliced strawberries and pour the batter into prepared pie plate.\nBake in preheated oven until a toothpick inserted into the center comes out clean, 30 to 40 minutes.\n",
        "picture_link": "EWtvOjL5/fAHNmgGaSF3mdxh1qqgRrC"
    },
    {
        "title": "Tomato Soup III",
        "ingredients": [
            "1 (28 ounce) can tomato sauce ADVERTISEMENT",
            "5 cups water ADVERTISEMENT",
            "3 cubes vegetable bouillon ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon Italian seasoning ADVERTISEMENT",
            "1 1/2 teaspoons dried parsley ADVERTISEMENT",
            "1 1/2 teaspoons sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon pepper ADVERTISEMENT",
            "1/8 teaspoon hot red pepper sauce ADVERTISEMENT",
            "2 stalks celery, sliced ADVERTISEMENT",
            "2 carrots, peeled and sliced ADVERTISEMENT",
            "1 small zucchini, chopped ADVERTISEMENT",
            "1 cup frozen corn ADVERTISEMENT",
            "1/2 cup uncooked ditalini pasta ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot, mix the tomato sauce, water, vegetable bouillon, bay leaf, onion, garlic, Italian seasoning, parsley, sugar, salt, pepper, and hot red pepper sauce. Bring to a boil, reduce heat to low, and simmer at least 30 minutes.\nStir in the celery, carrots, zucchini, and corn. Cover, and continue to simmer 30 minutes.\nStir ditalini pasta into the pot, and continue cooking 10 minutes, or until pasta is al dente.\n",
        "picture_link": "/tSYjXsC5zjWd61f4Lgtq1NkL6hxHW2"
    },
    {
        "title": "Crispy Wontons",
        "ingredients": [
            "3/4 pound ground pork ADVERTISEMENT",
            "8 canned water chestnuts, finely chopped ADVERTISEMENT",
            "1/4 cup finely chopped green onions ADVERTISEMENT",
            "1 tablespoon Kikkoman Soy Sauce ADVERTISEMENT",
            "1 teaspoon cornstarch ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon grated fresh ginger root ADVERTISEMENT",
            "1 (16 ounce) package wonton skins ADVERTISEMENT",
            "Vegetable oil for deep-frying ADVERTISEMENT",
            "Tomato ketchup and hot mustard or Kikkoman Sweet & Sour Sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine pork, water chestnuts, green onions, soy sauce, cornstarch, salt and ginger in medium bowl; mix well. Place 1/2 teaspoonful pork mixture in center of each wonton skin. Fold wonton skin over filling to form a triangle. Turn top of triangle down to meet fold. Turn over; moisten 1 corner with water. Overlap opposite corner over moistened corner; press together firmly.\nHeat oil in wok or large saucepan over medium-high heat to 375 degrees F. Deep-fry wontons, a few at a time, 2 to 3 minutes, or until brown and crispy. Drain on paper towels. Serve warm with ketchup and mustard or sweet & sour sauce, as desired.\n",
        "picture_link": "XITZt5zJJ.9cdOHM7ZJDgApT5dwJtqC"
    },
    {
        "title": "Dr. Bird Cake",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "2 cups banana, coarsely chopped ADVERTISEMENT",
            "1 (8 ounce) can crushed pineapple, with juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 10 inch tube pan.\nIn a large bowl, mix together the flour, sugar, baking soda, cinnamon and salt. Make a well in the center and pour in the eggs, oil, bananas and pineapple. Mix well and pour into prepared pan.\nBake in the preheated oven for 70 to 80 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pan for 10 minutes, then turn out onto a wire rack and cool completely.\n",
        "picture_link": "AUR5YRQZt0OsQSbPnoIh92mUzbGapX."
    },
    {
        "title": "Spicy Thai Vegetable Soup",
        "ingredients": [
            "1 cup uncooked brown rice ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 sweet onion, chopped ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1/4 cup chopped fresh ginger root ADVERTISEMENT",
            "1 cup chopped carrots ADVERTISEMENT",
            "4 cups chopped broccoli ADVERTISEMENT",
            "1 red bell pepper, diced ADVERTISEMENT",
            "1 (14 ounce) can light coconut milk ADVERTISEMENT",
            "6 cups vegetable broth ADVERTISEMENT",
            "1 cup white wine ADVERTISEMENT",
            "3 tablespoons fish sauce ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "3 Thai chile peppers ADVERTISEMENT",
            "2 tablespoons chopped fresh lemon grass ADVERTISEMENT",
            "1 tablespoon Thai pepper garlic sauce ADVERTISEMENT",
            "1 teaspoon saffron ADVERTISEMENT",
            "3/4 cup plain yogurt ADVERTISEMENT",
            "fresh cilantro, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring the rice and water to a boil in a pot. Cover, reduce heat to low, and simmer 45 minutes.\nHeat the olive oil in a large pot over medium heat, and cook the onion, garlic, ginger, and carrots 5 minutes, until tender. Mix in broccoli, red bell pepper, coconut milk, broth, wine, fish sauce, soy sauce, Thai chile peppers, lemon grass, garlic sauce, and saffron. Simmer 25 minutes.\nPour soup in batches into a blender or food processor, and blend until smooth and creamy. Return to the pot, and mix in yogurt and cooked rice. Top with cilantro to serve.\n",
        "picture_link": "7BE.DOYtumIOGIzXaL8pkveskhOCDMu"
    },
    {
        "title": "Fruit Cocktail Cake VI",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "2 pinches salt ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 (15.25 ounce) can fruit cocktail with juice ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 (5 ounce) can evaporated milk ADVERTISEMENT",
            "1 (7 ounce) package flaked coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan. Sift together the flour, baking soda and salt. Set aside.\nIn a large bowl, Beat eggs and 1 1/2 cups white sugar together until smooth. Beat in flour mixture and fruit cocktail with juice. Spread into prepared pan. Mix together the brown sugar and chopped nuts; sprinkle on top of cake.\nBake in the preheated oven for 35 to 40 minutes, or until a toothpick inserted into the center of the cake comes out clean. Remove from oven and immediately poke holes in cake with fork. Pour topping over cake.\nTo make the topping: In a small saucepan, combine sugar, butter and evaporated milk. Bring to a boil, and stir in coconut.\n",
        "picture_link": "f5asMXu9L4/mI14CDcXHt3IHZS4oWIW"
    },
    {
        "title": "Shrimp and Cheesy Grits with Bacon",
        "ingredients": [
            "1 1/2 cups chicken broth ADVERTISEMENT",
            "1 1/2 cups evaporated milk ADVERTISEMENT",
            "3/4 cup quick-cooking grits ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 cup chopped raw bacon ADVERTISEMENT",
            "2 tablespoons bacon drippings ADVERTISEMENT",
            "1 pound uncooked medium shrimp, peeled and deveined ADVERTISEMENT",
            "1/2 cup diced green bell pepper ADVERTISEMENT",
            "1/2 cup diced onion ADVERTISEMENT",
            "1 tablespoon shredded Cheddar cheese, or as desired ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring chicken broth and evaporated milk to a boil in a large saucepan; stir in grits and salt and return to a boil. Reduce heat to low, cover, and simmer grits until thick, stirring often, about 5 minutes. Stir in 1 cup Cheddar cheese until melted. Set grits aside and keep warm.\nCook and stir bacon in a large skillet over medium heat until crisp, 8 to 10 minutes. Transfer bacon to a bowl. Drain all but 2 tablespoons of bacon drippings from the skillet and cook and stir shrimp, green bell pepper, and onion in bacon drippings until shrimp are bright pink and no longer translucent inside and green pepper is tender, 5 to 8 minutes. Stir bacon into shrimp mixture.\nSpread grits into a serving dish, top with shrimp mixture, and sprinkle with 1 tablespoon Cheddar cheese for garnish.\n",
        "picture_link": "FZcnw5A.4YXGKv561pnq/llwginlrdK"
    },
    {
        "title": "Wasabi Trout",
        "ingredients": [
            "1/4 cup soy sauce ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 teaspoons wasabi paste ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1/4 teaspoon crushed oregano, or more to taste ADVERTISEMENT",
            "1 pinch ground black pepper, or to taste ADVERTISEMENT",
            "4 (4 ounce) fillets trout ADVERTISEMENT",
            "1 pinch Cajun seasoning (such as Tony Chachere's), or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C). Line a baking dish with aluminum foil and grease with olive oil.\nMix soy sauce, olive oil, wasabi paste, garlic, oregano, and black pepper in a bowl. Cut a diagonal slash across each piece of fish and coat fish with wasabi mixture; spoon remaining wasabi mixture over fish and into the diagonal cuts. Place fish into prepared baking dish and sprinkle with Cajun seasoning.\nBake in the preheated oven until fish is opaque and flakes easily, 7 to 9 minutes.\n",
        "picture_link": "8J50jkDptne3XzE9Hbb5UcUQoYLa4SG"
    },
    {
        "title": "Brown Sugar and Mustard Ham Glaze ",
        "ingredients": [
            "1 cup brown sugar ADVERTISEMENT",
            "2 tablespoons prepared mustard, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix brown sugar with mustard in a bowl to make a smooth glaze. If mixture is too thick, stir in more mustard.\n",
        "picture_link": "8rjwVlBAfuFJg7ehnKXWtrLlzaNTxw6"
    },
    {
        "title": "Honey Glazed Brussels Sprouts",
        "ingredients": [
            "1 cube chicken bouillon ADVERTISEMENT",
            "1 (16 ounce) package frozen Brussels sprouts ADVERTISEMENT",
            "1/2 pound smoked bacon, diced ADVERTISEMENT",
            "1 large onion, minced ADVERTISEMENT",
            "3 tablespoons honey ADVERTISEMENT",
            "3 tablespoons soy sauce ADVERTISEMENT",
            "1/2 cup raisins (optional) ADVERTISEMENT",
            "3 tablespoons pine nuts (optional) ADVERTISEMENT",
            "1 tablespoon toasted sesame seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a pot of water to a boil; dissolve bouillon cube in the boiling water. Add Brussels sprouts; cook until tender, about 10 minutes. Drain.\nPlace bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Transfer bacon to a paper towel-lined plate, leaving bacon drippings in the skillet.\nCook and stir onion in bacon drippings until transparent and tender, about 10 minutes. Add honey and soy sauce; stir until liquid starts to bubble, 1 to 2 minutes. Stir in Brussels sprouts, bacon, raisins, and pine nuts; cook until Brussels sprouts are heated through and well coated, 3 to 5 minutes. Garnish with sesame seeds before serving.\n",
        "picture_link": "xctO2LtsN7VVOCdiId.nB2GkD4RcKJK"
    },
    {
        "title": "Homemade Deviled Ham Spread",
        "ingredients": [
            "1 1/2 cups cubed cooked ham ADVERTISEMENT",
            "3 tablespoons mayonnaise ADVERTISEMENT",
            "2 teaspoons prepared mustard ADVERTISEMENT",
            "5 drops hot pepper sauce ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1/2 teaspoon celery salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "1 pinch caraway seeds, or to taste ADVERTISEMENT",
            "1/4 cup finely chopped onion ADVERTISEMENT",
            "1/4 cup finely chopped celery ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ham, mayonnaise, mustard, hot pepper sauce, garlic powder, onion powder, celery salt, black pepper, paprika, and caraway seeds in a large mixing bowl. Stir to combine.\nUse an immersion blender or food processor to puree the ingredients to your desired texture; stir in onion and celery. Chill before serving.\n",
        "picture_link": "/B6XvIAuLtupJc0a5qK0CbnScQiPXjG"
    },
    {
        "title": "Lemon Piccata Whitefish",
        "ingredients": [
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon lemon pepper, or to taste ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 pound trout fillets ADVERTISEMENT",
            "2 tablespoons vegetable oil, or as needed ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 cup dry white wine ADVERTISEMENT",
            "1 1/2 teaspoons lemon zest ADVERTISEMENT",
            "1/4 cup fresh lemon juice ADVERTISEMENT",
            "2 tablespoons capers, drained ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 200 degrees F (95 degrees C). Place a serving platter into oven to warm.\nMix flour, lemon pepper, and salt in a shallow bowl and firmly press trout fillets into the seasoned flour to coat both sides; shake off excess. Heat vegetable oil in a skillet over medium heat and pan-fry the fish in the hot oil until golden brown, about 2 minutes per side. Keep fillets warm on heated platter in oven.\nPour off all but a thin film of oil in the skillet over medium heat; cook and stir garlic until fragrant, about 20 seconds. Pour white wine into skillet and dissolve brown bits of food in the wine. Stir lemon zest into wine and bring to a boil; cook until sauce reduces to about 2/3 cup, stirring often. Mix in lemon juice and capers and cook until sauce thickens slightly, about 5 more minutes. Whisk butter into sauce.\nLay trout fillets in the sauce and turn to coat; serve on the warmed platter and garnish with parsley.\n",
        "picture_link": "AYDt85/kvI6J5eB/zc0WRbF5dAG9FIW"
    },
    {
        "title": "Crunchy Fish Tacos",
        "ingredients": [
            "Fish Tacos: ADVERTISEMENT",
            "9 Old El Paso® taco shells ADVERTISEMENT",
            "2 teaspoons Old El Paso® taco seasoning mix ADVERTISEMENT",
            "1 pound tilapia fillets ADVERTISEMENT",
            "8 (6 inch) Old El Paso® flour tortillas for soft tacos & fajitas ADVERTISEMENT",
            "Toppings: ADVERTISEMENT",
            "1 cup pico de gallo salsa ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 425 degrees F. Line cookie sheet with foil.\nPlace taco shells in 1-gallon resealable food-storage plastic bag. Seal bag; crush shells with rolling pin. Add taco seasoning mix; shake until well mixed.\nCut tilapia fillets into 3x1-inch pieces. Add fillet pieces to bag, pressing crumbs onto pieces to coat. Place on cookie sheet. Bake 15 minutes, turning halfway through bake time. Place 2 pieces on each tortilla. Add toppings. Roll up tortillas.\n",
        "picture_link": "jFQnyRe33gbBu8SbxnWxBkfWECU8qG6"
    },
    {
        "title": "Pan-Roasted Chicken with Lemon-Garlic Brussels Sprouts and Potatoes",
        "ingredients": [
            "4 slices bacon, chopped ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 lemon, thinly sliced ADVERTISEMENT",
            "5 tablespoons olive oil ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon kosher salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 pound Brussels sprouts, trimmed and halved ADVERTISEMENT",
            "8 small red potatoes, quartered ADVERTISEMENT",
            "4 bone-in, skin-on chicken breast halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until lightly browned but still soft, about 5 minutes. Drain the bacon slices on a paper towel-lined plate.\nPreheat an oven to 450 degrees F (230 degrees C).\nCoat a large baking dish or cast iron skillet with 1 tablespoon olive oil.\nArrange lemon slices in a single layer on the bottom of the baking dish.\nStir remaining 5 tablespoons olive oil, lemon juice, garlic, kosher salt, and black pepper together in a large bowl.\nToss Brussels sprouts in lemon juice mixture to coat; transfer to the prepared baking dish with a slotted spoon, draining excess liquid back into the bowl.\nPlace bacon on top of the Brussels sprouts.\nToss potatoes in the same lemon juice mixture used for the Brussels sprouts.\nRemove potatoes with slotted spoon and arrange along the inside edge of the baking dish.\nCoat chicken breast halves thoroughly in the remaining lemon mixture.\nPlace chicken breasts skin-side up in the skillet; pour any remaining lemon juice mixture over chicken.\nBake in the preheated oven until chicken no longer pink at the bone and the juices run clear, about 60 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).\n",
        "picture_link": "qLzREDSPsbN0VeRMIvNIBsbKjkCtUP6"
    },
    {
        "title": "Chef John's Asparagus Souffle",
        "ingredients": [
            "1 bunch asparagus, trimmed and cut into 1/2-inch pieces ADVERTISEMENT",
            "2 tablespoons unsalted butter ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 cup cold milk ADVERTISEMENT",
            "1 teaspoon kosher salt ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "1/2 clove garlic, minced ADVERTISEMENT",
            "4 eggs, separated ADVERTISEMENT",
            "1/2 cup grated sharp white Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook asparagus in a saucepan of boiling water until bright green but still crisp, about 2 minutes. Transfer asparagus to ice water to stop the cooking process. Drain and set aside.\nMelt butter in a saucepan over medium-low heat. Whisk in flour and stir until mixture becomes paste-like and light golden brown, about 2 minutes.\nWhisk milk into butter-flour mixture; bring to a simmer and cook until thick, 2 to 3 minutes. Season with salt and cayenne pepper.\nPlace milk mixture, garlic, and asparagus in a blender and puree until smooth.\nPour asparagus mixture into a large bowl; stir in egg yolks and Cheddar cheese.\nPreheat oven to 375 degrees F (190 degrees C)\nGenerously butter 4 (6-ounce) ramekins\nBeat egg whites in a large glass or metal mixing bowl until soft peaks form. Lift your beater or whisk straight up: the egg whites will form soft mounds rather than a sharp peak\nStir half of egg whites into asparagus cheese mixture until just combined. Gently fold remaining egg whites into mixture.\nFill prepared ramekins about 3/4 full and place on a baking sheet; bake in the preheated oven until edges are golden brown, about 20 to 25 minutes\n",
        "picture_link": "/IDmLzj8FppmDMST4kIN6MsvALNuUWe"
    },
    {
        "title": "Butternut Mascarpone Gnocchi",
        "ingredients": [
            "1 pound butternut squash ADVERTISEMENT",
            "1 cup mascarpone cheese ADVERTISEMENT",
            "1/2 cup finely grated Parmigiano-Reggiano cheese ADVERTISEMENT",
            "2 large eggs ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 cup all-purpose flour, divided ADVERTISEMENT",
            "1/2 cup unsalted butter ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 cup thinly sliced fresh sage leaves ADVERTISEMENT",
            "1 tablespoon finely grated Parmigiano-Reggiano cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Trim stem and cut butternut squash in half lengthwise. Place in a microwave-safe dish, cover with plastic wrap, and microwave until tender, about 8 minutes. Transfer to paper towels to cool. Discard skin and set squash aside.\nWhisk mascarpone cheese, 1/2 cup Parmigiano-Reggiano cheese, eggs, salt, and black pepper in a bowl until smooth. Whisk in butternut squash until blended.\nWhisk in 1/2 cup flour until just incorporated. Whisk in remaining 1/2 cup flour, stirring until flour just disappears. Cover and refrigerate for at least 8 hours or overnight.\nBring a large pot of salted water to a boil.\nMelt about 1/3 of the butter in large nonstick skillet; remove from heat.\nScoop out approximately 1 1/2 teaspoons of the butternut squash dough with a spoon. Using a second spoon, push the dough off the first spoon and into the boiling water. Repeat with remaining dough, working in batches of 12 to 15 gnocchi at a time. When a gnocchi rise to the surface, cook for 1 additional minute, then transfer with a slotted spoon to the melted butter in the skillet.\nPlace the skillet over medium-high heat; cook gnocchi until golden brown on one side, about 3 minutes. Season with cayenne pepper, salt, and black pepper. Turn gnocchi over and stir in sage leaves. Cook until second side is golden, 2 to 3 minutes. Transfer to plate and drizzle with browned butter from the skillet. Garnish with 1 tablespoon Parmigiano-Reggiano cheese and serve.\n",
        "picture_link": "Ic2PDR0G7Junfa7jvx5/VqcE2Bu7R/m"
    },
    {
        "title": "Quick and Easy Spanish Rice",
        "ingredients": [
            "1/4 cup chopped onion ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "3 cups uncooked instant rice (such as Minute®) ADVERTISEMENT",
            "2 1/4 cups chicken broth ADVERTISEMENT",
            "1 cup vegetable juice (such as V8®) ADVERTISEMENT",
            "1 1/2 teaspoons taco seasoning ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook and stir onion, garlic, and vegetable oil in a skillet over medium heat until onions are softened, about 5 minutes.\nStir rice into onion mixture and cook, stirring often, until rice becomes slightly opaque, 1 to 2 minutes.\nStir chicken broth, vegetable juice, and taco seasoning into rice mixture and bring to a boil. Cover and simmer over low heat until rice has absorbed most of the liquid, about 5 minutes.\n",
        "picture_link": "Q.Sp/YEYbTESmYs0e8bZmLdKrO.4ysi"
    },
    {
        "title": "Salmon Burgers",
        "ingredients": [
            "1 (14.75 ounce) can salmon, drained and flaked ADVERTISEMENT",
            "3/4 cup rolled oats ADVERTISEMENT",
            "1/2 onion, sliced ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix salmon, oats, onion, egg, lemon juice, mustard, salt, and black pepper in a bowl until evenly combined. Divide and shape mixture into four patties.\nHeat vegetable oil in a large skillet over medium-high heat; pan-fry salmon patties until heated through, about 7 minutes on each side.\n",
        "picture_link": "q349.RGmuYgRAeT4dzaDjsIygfVybJm"
    },
    {
        "title": "Soft Chocolate Cookies",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup light brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup cocoa powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup semi-sweet chocolate chips ADVERTISEMENT",
            "1/4 cup confectioner's sugar, for dusting (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBeat butter, white sugar, and brown sugar with an electric mixer in a large bowl until smooth. Beat in one egg until completely incorporated; beat in last egg along with vanilla extract. Combine flour, cocoa, baking soda, and salt in a bowl. Stir flour mixture into butter mixture until just incorporated; mix in chocolate chips.\nRoll dough into 2-inch balls, or drop spoonfuls of dough 2 inches apart, onto ungreased baking sheets.\nBake in preheated oven until edges of cookies are firm, 10 to 12 minutes. Remove to wire racks. Dust warm cookies with confectioners' sugar, if desired.\n",
        "picture_link": "9gJ00JylMvgF4cG8lsn7urRBoDnDpUG"
    },
    {
        "title": "Black Bean Tacos",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1 (15 ounce) can black beans, rinsed and drained ADVERTISEMENT",
            "1 (7 ounce) can green salsa (salsa verde) ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon chili powder ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "6 taco shells (optional) ADVERTISEMENT",
            "2 ounces shredded Mexican cheese blend (optional) ADVERTISEMENT",
            "1 tomato, diced (optional) ADVERTISEMENT",
            "1 avocado, sliced (optional) ADVERTISEMENT",
            "1 cup shredded lettuce (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a saucepan over medium-low heat; cook onion in hot oil until tender, about 5 minutes. Stir black beans, green salsa, garlic powder, chili powder, and cumin with the onion. Reduce heat to low and cook the mixture at a simmer until it thickens, 5 to 10 minutes.\nServe with taco shells, Mexican cheese blend, tomato, avocado, and shredded lettuce.\n",
        "picture_link": "7K9jdYqIoUFs8OoyhBxSvExHXFBPrvW"
    },
    {
        "title": "Deep-Dish Cast Iron Pizza",
        "ingredients": [
            "2 1/4 teaspoons active dry yeast ADVERTISEMENT",
            "1/2 teaspoon brown sugar ADVERTISEMENT",
            "1 1/4 cups warm water (110 degrees F (43 degrees C)) ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons garlic salt ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon grapeseed oil ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "1/3 cup bulk pork sausage ADVERTISEMENT",
            "1 (3.5 ounce) link bulk Italian sausage ADVERTISEMENT",
            "2 tablespoons grapeseed oil ADVERTISEMENT",
            "1/2 cup pizza sauce ADVERTISEMENT",
            "1/3 cup shredded mozzarella cheese ADVERTISEMENT",
            "24 slices pepperoni ADVERTISEMENT",
            "1/3 cup shredded mozzarella cheese ADVERTISEMENT",
            "1 tablespoon butter, softened (optional) ADVERTISEMENT",
            "1/8 teaspoon Italian seasoning (optional) ADVERTISEMENT",
            "1/8 teaspoon garlic powder (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sprinkle yeast and brown sugar over warm water in the bowl of a stand mixer fitted with a dough hook. Let stand 5 to 10 minutes until the yeast softens and begins to form a creamy foam.\nTurn mixer to the lowest setting and slowly add 2 cups flour 1/2 cup at a time. Add garlic salt and 1/4 cup butter. Integrate remaining 2 cups flour and knead until dough is smooth and elastic, 5 to 7 minutes.\nCoat a large glass bowl with 1 tablespoon grapeseed oil. Shape dough into a ball and place in bowl, turning to coat all sides with oil. Spray a piece of plastic wrap with cooking spray and loosely cover bowl. Cover bowl with a towel and let rise in a warm area until dough has doubled in size, about 45 minutes. Punch down dough and allow to rest for 20 minutes.\nWhile dough is resting, heat a skillet over medium heat; cook and stir bulk sausage until browned and crumbly, about 5 minutes. Transfer cooked sausage to a bowl with a slotted spoon, retaining drippings in the skillet. Fry Italian sausage link in drippings until browned and no longer pink in the center, about 10 minutes. Slice sausage.\nPreheat oven to 400 degrees F (200 degrees C). Grease a 12-inch cast iron skillet with 2 tablespoons grapeseed oil.\nPress dough into and up the sides of the prepared skillet. Poke holes in dough with a fork to prevent air bubbles. Spread pizza sauce around the base of the crust. Sprinkle 1/3 cup mozzarella cheese over sauce; layer half the bulk sausage, half the sliced sausage, and half the pepperoni over cheese. Repeat the layers of meat. Top with remaining 1/3 cup mozzarella cheese.\nBake in preheated oven on the bottom rack until crust is golden brown, about 25 minutes. Brush crust with 1 tablespoon butter; season with Italian seasoning and garlic powder. Remove pizza from skillet and let rest for 3 to 5 minutes before slicing.\n",
        "picture_link": "sQbPv0GJ8oWOFNHOx8VwkGFbXW6P/Ta"
    },
    {
        "title": "Cross Rib Roast",
        "ingredients": [
            "1 (5 pound) beef cross rib roast ADVERTISEMENT",
            "1/3 cup Dijon mustard ADVERTISEMENT",
            "10 large cloves garlic, crushed ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon salt, or to taste ADVERTISEMENT",
            "1 tablespoon dry mustard powder ADVERTISEMENT",
            "2 tablespoons light olive oil ADVERTISEMENT",
            "1 tablespoon paprika, plus more for sprinkling ADVERTISEMENT",
            "1 1/4 cups water ADVERTISEMENT",
            "1/2 cup red wine ADVERTISEMENT",
            "1 (1 ounce) package dry onion soup mix ADVERTISEMENT",
            "2 beef bouillon cubes ADVERTISEMENT",
            "3 cloves garlic, crushed, or to taste ADVERTISEMENT",
            "1 (10.75 ounce) can condensed golden mushroom soup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nPlace the roast into a roasting pan. In a bowl, mix the Dijon mustard, 10 cloves of garlic, black pepper, garlic powder, salt, dry mustard powder, olive oil, and 1 tablespoon of paprika into a paste. Spread the paste over the top and sides of the roast. Pour the water and red wine into the roasting pan, and sprinkle in the dry onion soup mix. Drop in the beef bouillon cubes. Sprinkle the top of the roast generously with more paprika and 3 more crushed cloves of garlic. Cover the roast with aluminum foil.\nRoast in the preheated oven for 1 hour, and reduce temperature to 350 degrees C (175 degrees C). Roast until the meat is tender, about 2 more hours, basting occasionally with pan liquid. Remove foil during last 30 minutes of roasting to help brown the meat. Remove roast to a platter.\nPlace roasting pan over medium heat, and bring the liquid to a simmer. Scrape up and dissolve any brown flavor bits from the bottom of the pan into the liquid. Stir the golden mushroom soup into the pan drippings until the gravy is smooth and thickened. To serve, slice the roast, pour hot gravy over the slices, and serve with remaining gravy.\n",
        "picture_link": "qkOwsaU9NX59ctkBUQYYFr8NlTM9UVG"
    },
    {
        "title": "Slow Cooker Posole with Pork and Chicken",
        "ingredients": [
            "1 canned chipotle pepper in adobo sauce ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1/2 pound boneless pork loin roast ADVERTISEMENT",
            "1/2 pound skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 (15.5 ounce) can white hominy, drained ADVERTISEMENT",
            "1 (4 ounce) can chopped green chilies ADVERTISEMENT",
            "1 medium onion, chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "2 (14.5 ounce) cans chicken broth ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1/4 teaspoon ground black pepper to taste ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the chipotle chile and water into a blender, and puree until smooth. Pour into a slow cooker, and add the pork, chicken, hominy, green chilies, onion, garlic, and chicken broth. Season with oregano, cumin, pepper, and the bay leaf.\nCover, and cook on Low 6 to 7 hours until the meats are tender. Remove the bay leaf before serving.\n",
        "picture_link": "jyDAwJjLrNKHimMEH.ZDVXoUXM1u2MW"
    },
    {
        "title": "Panna Cotta With Fresh Strawberry Sauce",
        "ingredients": [
            "1 1/2 cups milk ADVERTISEMENT",
            "1 (.25 ounce) envelope unflavored gelatin ADVERTISEMENT",
            "1 1/2 cups whipping cream ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 quart fresh strawberries, quartered ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the milk into a bowl; sprinkle the gelatin over the milk. Allow mixture to sit until the gelatin softens, about 5 minutes.\nCombine the cream and 1/4 cup sugar in a saucepan over medium heat. Stir in the gelatin mixture; cook and stir until gelatin dissolves completely, about 3 minutes. Add the vanilla extract. Pour the mixture evenly into ramekins; cover and chill at least 4 hours.\nTo make the strawberry sauce, combine the strawberries, 2 teaspoon vanilla extract, 1/4 cup sugar, and water in a saucepan over medium heat. While the mixture cooks, crush the strawberries with a potato masher. Simmer the sauce until the sugar has dissolved and the sauce has thickened, about 10 minutes; cool.\nRemove chilled ramekins from the refrigerator shortly before serving. Dip the bottoms of the cups in warm water to help loosen the custard. Run a thin-bladed knife around the inner edge of each ramekin to loosen the dessert; turn onto a dessert plate to unmold. Spoon strawberry sauce over panna cotta to serve.\n",
        "picture_link": "UIlVPCMqUkk6A2wMogNxFSUIMbsf6cm"
    },
    {
        "title": "NuNu's and Hot Dogs",
        "ingredients": [
            "4 hot dogs, cut into 1/2-inch pieces ADVERTISEMENT",
            "1 (8 ounce) package broad egg noodles ADVERTISEMENT",
            "3 tablespoons unsalted butter, softened ADVERTISEMENT",
            "1 tablespoon dried parsley ADVERTISEMENT",
            "1 tablespoon grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly-salted water to a boil; add the pasta and cook until al dente, about 5 minutes; drain.\nMelt 1 tablespoon butter in a skillet. Cook the hot dog pieces in the butter until browned. Add the hot dogs to the drained noodles with 2 tablespoons butter, parsley, and Parmesan cheese; stir until butter is melted and the hot dogs are coated.\n",
        "picture_link": "7Gi8sWQ/2.V1QiUJlQHJF6DE/DsFI8."
    },
    {
        "title": "To-Die-For Chicken Pot Pie",
        "ingredients": [
            "6 carrots, chopped ADVERTISEMENT",
            "6 stalks celery, chopped ADVERTISEMENT",
            "1 cup fresh or frozen peas ADVERTISEMENT",
            "1 cup fresh or frozen green beans, thawed ADVERTISEMENT",
            "1 cup corn kernels ADVERTISEMENT",
            "1 yellow onion, diced ADVERTISEMENT",
            "1 cup quartered red potatoes ADVERTISEMENT",
            "3 cups chicken broth ADVERTISEMENT",
            "1 teaspoon thyme ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "4 (.87 ounce) packages dry chicken gravy mix ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "1 (15 ounce) package double crust ready-to-use pie crusts (such as Pillsbury®) ADVERTISEMENT",
            "1 whole roasted chicken, bones and skin removed, meat shredded ADVERTISEMENT",
            "1/4 cup butter, cut into pieces ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Place a baking sheet on the a rack on which you'll bake the pie.\nCombine the carrots, celery, peas, green beans, corn, onion, red potatoes, and chicken broth in a large pot. Season the vegetable mixture with thyme, salt, and black pepper; bring to a boil. Reduce heat to medium-low, cover, and simmer until the vegetables are tender, about 15 minutes. Drain the vegetables and set aside.\nPlace dry chicken gravy mix into another saucepan and gradually whisk in the water until smooth. Bring the mixture to a boil, reduce heat to medium-low, and simmer until thickened, about 1 minute. Set gravy aside and allow to continue to thicken as it cools.\nPress one of the pie crusts into the bottom of a 9-inch pie dish. Spoon a layer of gravy (about 1/3 cup) into the crust. Layer the cooked vegetables and shredded chicken into the crust until the filling is level with the top of the pie dish. Pour the rest of the gravy slowly over the filling until gravy is visible at the top. Scatter butter pieces over the filling; top with second crust. Seal the 2 crusts together and crimp with a fork.\nWhisk the egg and milk together in a bowl, and brush the egg wash over the top crust. Pierce the top crust several times to vent steam.\nBake the pot pie in the preheated oven until the filling is bubbling and the crust is golden brown, about 45 minutes to 1 hour. Check periodically to see if the edge of the crust is browning too quickly; if needed, cover the edge with a strip of aluminum foil to prevent over-browning.\n",
        "picture_link": "AgeTBYsa0dIqd6w28b3ZTUZWY4svhOC"
    },
    {
        "title": "Shrimp Enchiladas Suizas",
        "ingredients": [
            "3 fresh jalapeno peppers, stems removed ADVERTISEMENT",
            "1 1/2 pounds fresh tomatillos, husks removed ADVERTISEMENT",
            "3 green onions ADVERTISEMENT",
            "1 small onion, quartered ADVERTISEMENT",
            "1 bunch fresh cilantro, stems trimmed ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 pound frozen fully cooked salad shrimp, thawed ADVERTISEMENT",
            "1 (9 ounce) bag baby spinach leaves ADVERTISEMENT",
            "2 teaspoons vegetable oil, divided ADVERTISEMENT",
            "10 (6 inch) corn tortillas ADVERTISEMENT",
            "8 ounces shredded Monterey Jack cheese ADVERTISEMENT",
            "1/2 cup sour cream (optional) ADVERTISEMENT",
            "1 tablespoon green pepper sauce (e.g., Tabasco®) (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 400 degrees F (200 degrees C). Lightly oil a 9x13 inch baking dish.\nPlace jalapeno peppers, tomatillos, green onions, quartered onion, and cilantro in a food processor. Pulse until mixture is coarsely chopped, about 8 pulses. Pour mixture into a saucepan over medium heat and bring to a simmer; cook about 5 minutes. Stir in cream and chicken broth; season with salt and pepper. Return to a simmer and cook until slightly thickened, about 10 minutes. Set aside.\nPlace shrimp and spinach in a skillet over medium heat. Cover tightly and cook until spinach wilts and shrimp are heated through, about 3 minutes. Remove from heat.\nWipe skillet dry and pour in 1 teaspoon of the oil; heat oil over medium heat. Place a tortilla in skillet about 10 seconds; turn and heat on second side about 5 seconds to soften for easier handling. Fill tortilla with a tablespoon of the shrimp and spinach mixture and about a tablespoon of shredded cheese. Repeat with each tortilla adding more oil to the skillet as needed. Place filled tortillas snugly in prepared baking dish.\nPour sauce over tortillas and sprinkle with remaining grated cheese and any remaining filling. Top with dollops of sour cream and some green pepper sauce, if desired.\nBake in preheated oven for 15 to 20 minutes or until hot and bubbly.\n",
        "picture_link": "ra.Np7gbPd2wPI4xxekghybM6OElckG"
    },
    {
        "title": "Easy Crescent Taco Bake",
        "ingredients": [
            "1 (8 ounce) can Pillsbury® refrigerated crescent dinner rolls ADVERTISEMENT",
            "1 pound lean (at least 80%) ground beef ADVERTISEMENT",
            "3/4 cup Old El Paso® Thick 'n Chunky salsa ADVERTISEMENT",
            "2 tablespoons Old El Paso® taco seasoning mix (from 1-oz package) ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "Shredded lettuce, as desired ADVERTISEMENT",
            "Diced tomato, as desired ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 375 degrees F. Unroll dough; separate into 8 triangles. Place in ungreased 9-inch square pan or 10-inch pie plate; press over bottom and up sides to form crust.\nIn 10-inch skillet, cook beef over medium heat 8 to 10 minutes, stirring occasionally, until thoroughly cooked; drain. Stir in salsa and taco seasoning mix; simmer 5 minutes. Spoon meat mixture in crust-lined pan; sprinkle with cheese.\nBake 20 to 25 minutes or until crust is deep golden brown and cheese is melted. Served topped with lettuce and tomato.\n",
        "picture_link": "5jKLe6B9EMzTDxysqi9AgyPiHOL8yKe"
    },
    {
        "title": "Red Pepper Vinaigrette",
        "ingredients": [
            "1 red bell pepper, seeded and cubed ADVERTISEMENT",
            "1/4 cup balsamic vinegar ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bell pepper, vinegar, olive oil, honey, salt, and black pepper into a blender. Puree until smooth.\n",
        "picture_link": "cfRB1yu3ioxl9EDtBgCNCrXcwzzr2qW"
    },
    {
        "title": "Simple and Delicious Sponge Cake",
        "ingredients": [
            "1/2 cup margarine ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup self-rising flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Grease an 8 inch cake pan and line with a circle of parchment paper.\nBeat the margarine and sugar with an electric mixer in a large bowl until light and fluffy. The mixture should be noticeably lighter in color. Add the eggs one at a time, allowing each egg to blend into the margarine mixture before adding the next. Fold in the flour until only small lumps remain; pour into the prepared pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 30 minutes. Cool in the pan for 10 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "OEMpFbp5Y3Xhu1bgOuOb6jft6/PxkWu"
    },
    {
        "title": "Slow Cooker Mexican Chicken and Rice",
        "ingredients": [
            "3 cups chicken broth ADVERTISEMENT",
            "1 1/2 cups converted long-grain white rice ADVERTISEMENT",
            "1/2 large white onion, sliced ADVERTISEMENT",
            "1 (24 ounce) jar salsa ADVERTISEMENT",
            "1 (4 ounce) can chopped green chilies ADVERTISEMENT",
            "1 (1 ounce) packet dry taco seasoning mix, divided ADVERTISEMENT",
            "2 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 (15 ounce) can black beans, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the chicken stock into a slow cooker, and stir in the rice, onion, salsa, green chilies, and half the taco seasoning. Rub the remaining taco seasoning over the chicken breasts, and place into the cooker. Place the lid on the cooker, and set to high setting.\nCook until the rice is thickened and most of the liquid has been absorbed, about 3 hours. About 20 minutes before serving time, turn the cooker to warm setting. Remove the chicken breasts, and slice them. Stir the chicken and the black beans into the slow cooker. Return lid to cooker, allow the beans to heat, and serve.\n",
        "picture_link": "3O69B7oXsoFgX5Do5GKpUQBKTTJ22k6"
    },
    {
        "title": "Roasted Creole Potatoes",
        "ingredients": [
            "2 pounds cubed white potatoes ADVERTISEMENT",
            "12 ounces andouille sausage, sliced ADVERTISEMENT",
            "1/2 cup chopped green bell pepper ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 tablespoon paprika ADVERTISEMENT",
            "1 tablespoon Creole seasoning ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nPlace the potatoes, sausage, green pepper, and onion into a high-sided roasting pan. Drizzle with olive oil, and toss to coat. Sprinkle with paprika, Creole seasoning, garlic powder, and black pepper; toss again to coat.\nRoast in preheated oven until the potatoes are tender and beginning to turn golden brown, 45 minutes to 1 hour. Stir occasionally during roasting.\n",
        "picture_link": "hNiKEm99nMPOTd/p97ABqS2YIKGlTiq"
    },
    {
        "title": "Grandma's Sweet Hubbard Squash Custard Pie",
        "ingredients": [
            "2 1/2 pounds hubbard squash - cut into chunks and seeds removed ADVERTISEMENT",
            "1/2 cup firmly packed dark brown sugar ADVERTISEMENT",
            "3 large eggs ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "1 1/2 teaspoons apple pie spice ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 tablespoons salted butter, softened ADVERTISEMENT",
            "1 (9 inch) unbaked pie crust ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line a large baking sheet with aluminum foil.\nArrange squash on lined baking sheet. Roast in preheated oven until the skin is browned and flesh is tender, about 45 minutes; allow to cool before handling. Remove flesh from squash using a spoon.\nReduce temperature setting on oven to 375 degrees F (190 degrees C).\nPlace 2 cups of squash in a food processor and process until smooth. Add the brown sugar, eggs, cream, apple pie spice, salt, and butter; process until smooth.\nPour the squash mixture into the pie crust. Bake until the filling rises, about 1 hour.\n",
        "picture_link": "wG1vvhL/xEhkiWOlWMwZa5UqC6kMRM6"
    },
    {
        "title": "Lemon Basil Pesto Flat Iron Steak",
        "ingredients": [
            "4 cloves garlic ADVERTISEMENT",
            "2 cups packed fresh basil leaves ADVERTISEMENT",
            "1/3 cup pine nuts ADVERTISEMENT",
            "1/2 cup extra-virgin olive oil ADVERTISEMENT",
            "1/2 cup freshly grated Parmesan cheese ADVERTISEMENT",
            "1 1/2 tablespoons fresh lemon juice ADVERTISEMENT",
            "3/4 teaspoon red pepper flakes ADVERTISEMENT",
            "6 (6 ounce) flat iron steaks ADVERTISEMENT",
            "2 large cloves garlic, minced ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Chop 4 garlic cloves in a food processor until minced. Add the basil and pine nuts, and pulse a few times to combine. With the food processor running, slowly pour in the olive oil, stopping once or twice to scrape down the sides. Place the Parmesan cheese, lemon juice, and red pepper flakes into the food processor, and pulse until blended. Season to taste with salt and pepper.\nRub the flat iron steaks with 2 cloves minced garlic, season to taste with salt and pepper, then set aside. Preheat an outdoor grill for medium-high heat and lightly oil grate.\nGrill the steaks to desired degree of doneness on preheated grill, about 4 minutes per side for medium. Baste the steaks occasionally with a little of the pesto sauce. Once done, serve topped with the remaining pesto.\n",
        "picture_link": "me6LJCDgpTm2dD7tLOOgyHjrI2bLLCy"
    },
    {
        "title": "Dreamy Orange Cupcakes",
        "ingredients": [
            "1 (18.25 ounce) package orange cake mix ADVERTISEMENT",
            "3/4 cup creamy salad dressing (such as Miracle Whip®) ADVERTISEMENT",
            "1 (1.3 ounce) envelope dry whipped topping mix (such as Dream Whip®) ADVERTISEMENT",
            "3/4 cup freshly squeezed orange juice ADVERTISEMENT",
            "3 large eggs ADVERTISEMENT",
            "2 tablespoons grated orange zest ADVERTISEMENT",
            "1 (13 ounce) jar marshmallow creme ADVERTISEMENT",
            "1/2 cup unsalted butter at room temperature ADVERTISEMENT",
            "1/2 cup vegetable shortening ADVERTISEMENT",
            "1/2 cup unsalted butter at room temperature ADVERTISEMENT",
            "1/2 cup vegetable shortening ADVERTISEMENT",
            "1/4 cup freshly squeezed orange juice ADVERTISEMENT",
            "1 tablespoon orange zest ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "2 drops orange paste food coloring, or as desired ADVERTISEMENT",
            "4 cups confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line 24 muffin cups with paper liners.\nBeat together the orange cake mix, creamy salad dressing, whipped topping mix, 3/4 cup orange juice, eggs, and 2 tablespoons orange zest in a large bowl with an electric mixer on low speed until mixture is moist, about 1 minute. Scrape down the sides of the bowl with a spatula, then increase speed to medium and continue beating until well blended, about 2 minutes more. Fill the prepared cupcake cups about 2/3 full of batter.\nBake in the preheated oven until a toothpick inserted into the center of a cupcake comes out clean, about 15 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack before frosting.\nTo make cream topping: Beat the marshmallow creme, 1/2 cup unsalted butter, and 1/2 cup shortening in a bowl with an electric mixer until smooth and creamy. Top each cooled cupcake with a 1/2-inch thick layer of the cream topping, using a knife to spread the the topping flat. Allow about 1/2 inch of the orange cupcake to show below the white layer.\nTo make orange butter cream: Beat 1/2 cup unsalted butter and 1/2 cup shortening together in a bowl until light and fluffy. Mix in 1/4 cup orange juice, zest of 1 orange, vanilla extract, and food coloring until well combined. Gradually beat in the confectioners' sugar until smooth.\nTransfer the frosting to a piping bag fitted with a large star tip, and pipe a decorative layer of orange butter cream, ending in a peak, over the cream topping on the cupcakes.\n",
        "picture_link": "ZLRNfeU6gGUajW/b5mhdOdBUb3BqGda"
    },
    {
        "title": "Eggplant Stuffed with Lamb and Feta",
        "ingredients": [
            "2 large eggplants, halved lengthwise ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 pound ground lamb ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1/2 green bell pepper, chopped ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground allspice ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 1/4 cups marinara sauce ADVERTISEMENT",
            "1 (8 ounce) package crumbled feta cheese ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/2 cup dry bread crumbs ADVERTISEMENT",
            "1/2 cup shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil.\nBrush the cut surfaces of the eggplant halves with half of the olive oil. Place cut-side-up onto the baking sheet, and place into the oven. Bake the eggplant for 30 minutes until tender. Once done, remove and allow to cool slightly. Scoop out the flesh, leaving the shells 1/2 inch thick. Remove as many of the seeds as you can, then coarsely chop the flesh, and place into a large mixing bowl.\nMeanwhile, heat the remaining olive oil in a skillet over medium-high heat. Add the ground lamb, and cook for a few minutes until it begins to crumble. Stir in the onion, bell pepper, garlic, cinnamon, allspice, and black pepper. Cook until the onion has softened, and the lamb is no longer pink, about 5 minutes. Place the meat mixture into the bowl with the eggplant, and stir in the marinara sauce, feta cheese, eggs, and bread crumbs until well mixed.\nEvenly divide the lamb mixture into the eggplant shells, then return the eggplant to the oven. Bake for 10 minutes, then sprinkle with the mozzarella, and reduce the oven temperature to 375 degrees F (190 degrees C). Bake until the filling has set, and the mozzarella has turned golden brown, about 25 minutes more.\n",
        "picture_link": "/firj9Oxm4nSvvkDMs7dkIj3Vzb9yI2"
    },
    {
        "title": "Broiled Asparagus with Lemon Tarragon Dressing",
        "ingredients": [
            "1 bunch asparagus spears, trimmed ADVERTISEMENT",
            "4 teaspoons olive oil ADVERTISEMENT",
            "kosher salt and ground black pepper to taste ADVERTISEMENT",
            "1 tablespoon fresh lemon juice ADVERTISEMENT",
            "1 shallot, minced ADVERTISEMENT",
            "1 teaspoon dried tarragon ADVERTISEMENT",
            "1/4 teaspoon Dijon mustard ADVERTISEMENT",
            "1 teaspoon olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven's broiler and set the oven rack at about 6 inches from the heat source.\nToss the asparagus with 4 teaspoons olive oil, salt, and pepper. Spread out onto the prepared baking sheet, and broil in the preheated oven until the asparagus spears are just tender and begin to turn lightly brown, about 8 minutes. Turn the spears over halfway through cooking.\nWhile the spears are cooking, prepare the dressing by whisking together the lemon juice, shallot, tarragon, mustard, and olive oil in a small bowl; season to taste with salt and pepper. Once the asparagus is done, place it onto a serving platter and pour the dressing overtop.\n",
        "picture_link": "X25xKWcLp56qDjWwIh/2EU02XdqDlY."
    },
    {
        "title": "Cool Summer Cucumber and Tomato Toss",
        "ingredients": [
            "1 large cucumber, peeled and sliced ADVERTISEMENT",
            "2 ripe fresh tomatoes, chopped ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cucumber and tomatoes in a bowl. Pour in olive oil and balsamic vinegar. Season with salt and pepper. Toss gently to coat. Refrigerate until ready to serve.\n",
        "picture_link": "vpyfW/5ZLZsYfKZFo33vSwjfHTU9QfS"
    },
    {
        "title": "Beef Tenderloin in a Port Shiitake Reduction",
        "ingredients": [
            "1 1/2 pounds beef tenderloin, cut into 1-inch cubes ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil, divided ADVERTISEMENT",
            "2 cups shiitake mushrooms, thinly sliced ADVERTISEMENT",
            "2 cups port wine ADVERTISEMENT",
            "1 tablespoon seedless raspberry jam ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1 cup beef broth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season the tenderloin cubes with salt and pepper to taste and set aside at room temperature as you continue preparing the recipe.\nHeat 1 tablespoon olive oil in a large skillet over medium-high heat. Stir in the shiitake mushrooms, and cook until they have wilted and are beginning to turn golden brown, about 5 minutes. Remove the mushrooms from the skillet and set aside; heat the remaining olive oil in the skillet until it begins to smoke, the sprinkle in the cubed beef tenderloin. Cook on all sides until browned on the outside and the meat is cooked just under your desired degree of doneness, about 5 minutes for medium rare. Remove the steak from the skillet and set aside.\nPour the port wine into the skillet and bring to a boil over high heat. Boil until the port has reduced by half, then whisk in the raspberry jam, Worcestershire sauce, beef broth, and shiitake mushrooms. Continue cooking until the sauce has reduced to 1/2 cup, about 30 minutes. Once reduced, stir in the tenderloin cubes, and reheat.\n",
        "picture_link": "chC1vh0u0Vd8iQhtSG69900w4M4CA4S"
    },
    {
        "title": "Kowloon's Chinese Chicken Wings",
        "ingredients": [
            "3 pounds chicken wings ADVERTISEMENT",
            "3 tablespoons salt ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "6 tablespoons water ADVERTISEMENT",
            "6 tablespoons soy sauce ADVERTISEMENT",
            "1 tablespoon gin ADVERTISEMENT",
            "1/4 teaspoon ground ginger ADVERTISEMENT",
            "1 quart vegetable oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "FOR MARINADE: Combine the salt, sugar, water, soy sauce, gin and ginger. Put mixture in a zipper style plastic bag, add chicken and marinate for 24 hours or as long as possible, turning bag frequently.\nIn a large skillet over medium high heat fry marinated chicken wings in hot oil until golden brown, about 8 minutes each side. Ready to serve!\n",
        "picture_link": "Raq7V9mLBggxfjs66stapWSdKW/asEi"
    },
    {
        "title": "Cake and Ice Cream Cake",
        "ingredients": [
            "1 (10 inch) angel food cake ADVERTISEMENT",
            "1/2 gallon strawberry ice cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Take ice cream out of freezer to soften. It should be easy to spread and not melted.\nRip the angel food cake into chunks (about 2 inches). Place a layer of cake on the bottom of one 9 or 10 inch tube pan. Spread a layer of the softened ice cream on top. Repeat layers until cake and ice cream are gone.\nPut cake in freezer for at least 2 to 3 hours. When ready to serve remove cake from freezer and place cake onto a serving dish, removing pan.\n",
        "picture_link": "awGf93MHT0TeZh8DSNLXTlle9WkO7/."
    },
    {
        "title": "Eggless Ginger Cookies",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "1 cup shortening ADVERTISEMENT",
            "1 cup dark molasses ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Lightly grease cookie sheets.\nIn a large bowl, cream together the sugar and shortening until smooth. Stir in the molasses. Combine the baking soda, ginger,cinnamon and 3 3/4 cups of the flour; blend into the molasses mixture. Add more flour if necessary to make dough stiff enough to roll out. Use remaining flour to dust rolling surface. Roll dough out to 1/4 inch thickness and cut with cookie cutters.\nBake for 5 to 7 minutes in the preheated oven. remove from baking sheets to cool on wire racks.\n",
        "picture_link": "2HiLyYzeqEC8hL5AvtZRhsJhjXanC2C"
    },
    {
        "title": "Banana Pudding Sugar Cookies",
        "ingredients": [
            "2/3 cup shortening ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 (3.5 ounce) package instant banana pudding mix ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, cream together shortening and sugar until light and fluffy. Beat in eggs one at a time. Stir in vanilla extract, baking powder, salt, and instant banana pudding mix. Mix in 2 cups flour. Gradually mix in remaining 1/2 cup flour as needed to form a workable dough. Cover, and chill in the refrigerator at least 2 hours.\nPreheat oven to 375 degrees F (190 degrees C). Grease baking sheets. Shape dough into walnut sized balls, and place 2 inches apart on the prepared baking sheets. Flatten balls to a thickness of about 1/4 inch.\nBake 8 to 10 minutes in the preheated oven, or until lightly browned.\n",
        "picture_link": "cy8aFBXIDTcB.fLp/k/vxujm2z2vIwK"
    },
    {
        "title": "Hazelnut Chicken",
        "ingredients": [
            "1 cup dried bread crumbs, seasoned ADVERTISEMENT",
            "1/2 cup ground hazelnuts ADVERTISEMENT",
            "4 skinless, boneless chicken breasts ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1/8 cup butter ADVERTISEMENT",
            "8 fresh mushrooms, sliced ADVERTISEMENT",
            "1 1/2 fluid ounces brandy ADVERTISEMENT",
            "2 fluid ounces hazelnut liqueur ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a shallow dish or bowl, mix together bread crumbs and hazelnuts. Dip chicken breasts in egg beat, then in crumb/nut mixture to coat. In a large saucepan, melt butter or margarine over medium high heat. Brown chicken on both sides. Add the mushrooms, and a little more butter or margarine if necessary. Saute until mushrooms are soft, about 2 minutes.\nRemove saucepan from heat and add the brandy. Light with a match, let flame evaporate alcohol. When flame goes out, add hazelnut liquor. Light with a match and let flame evaporate alcohol. When flame goes out, return saucepan to heat and simmer to reduce liquid/sauce until it is thick. Then serve!\n",
        "picture_link": "KfqlmcVfkkFW/ttR4wkaxSYvYczgFqe"
    },
    {
        "title": "Mom's Traditional Creamed Onions",
        "ingredients": [
            "1 cup pearl onions ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "6 tablespoons butter ADVERTISEMENT",
            "6 tablespoons all-purpose flour ADVERTISEMENT",
            "3 cups milk ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Peel onions, and drop into boiling water. Cook until tender. Drain, reserving liquid. Set onions aside while you make the sauce.\nMelt butter or margarine in a saucepan over medium heat. Whisk in flour to make a paste. Mix together cooking water and milk. Add milk mixture slowly to the saucepan, stirring constantly, and cook until thickened. Add salt and pepper to taste. Add onions, and transfer to a serving dish.\n",
        "picture_link": "Q.xLQMftC3hFbuJ8mt1AXNo1ViSltuK"
    },
    {
        "title": "Moist German Chocolate Cake",
        "ingredients": [
            "1/3 cup butter ADVERTISEMENT",
            "1/3 cup plain yogurt ADVERTISEMENT",
            "4 (1 ounce) squares German sweet chocolate ADVERTISEMENT",
            "1 cup cola-flavored carbonated beverage ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 1/3 cups white sugar ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 cup buttermilk ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour two 9 inch pans.\nIn a medium saucepan, heat butter, yogurt, chocolate and cola until chocolate is completely melted.\nIn a large bowl, mix flour, sugar, and baking soda. Add chocolate mixture, buttermilk, eggs and vanilla. Beat until smooth. Pour batter into two 9 inch round pans.\nBake at 350 degrees F (175 degrees C) for 30 to 35 minutes, or until a toothpick inserted into cake comes out clean.\n",
        "picture_link": "Tas6pdpJUJtjhqWXBrXJpkJbGmg7SPK"
    },
    {
        "title": "Nanaimo Bars II",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "2 (1 ounce) squares semisweet chocolate ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1 1/2 tablespoons pasteurized egg ADVERTISEMENT",
            "1 cup rolled oats ADVERTISEMENT",
            "1 1/2 cups flaked coconut ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "3 tablespoons butter, softened ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "2 1/2 tablespoons milk ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "2 (1 ounce) squares semisweet chocolate ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan, melt 1/2 cup butter or margarine with 2 squares chocolate. Remove from the heat, and stir in white sugar, egg, rolled oats, coconut, chopped nuts, and 1 teaspoon vanilla extract. Press mixture into a greased 9 inch square pan, and chill for 1 hour.\nCombine confectioners' sugar with 3 tablespoons softened butter, 1/2 teaspoon of the vanilla, and milk. Mix until it has an icing-like consistency, and spread it over the oat mixture in the pan. Chill for 1/2 hour.\nMelt remaining 1 tablespoon butter or margarine with remaining 2 squares chocolate. Spread over the top of the bars. Chill for 4 to 5 hours.\nCut into squares using a hot knife; dip knife in hot water, and let it melt through the chocolate.\n",
        "picture_link": "Ws8hj0Hn96XxIgalvMEUGhognJXrj8W"
    },
    {
        "title": "Sour Cream Cut-Outs",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "6 1/2 cups cake flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn a large bowl, cream together the butter and sugar until smooth. Beat in the eggs one at a time, then stir in the sour cream and vanilla. Stir in baking soda, baking powder and salt; gradually mix in flour to form a dough that is stiff enough to roll out. More or less flour may be necessary.\nRoll out dough on a lightly floured surface and cut into shapes using cookie cutters. Place cookies 2 inches apart on ungreased cookie sheets.\nBake for 10 minutes in the preheated oven, or until firm and the center appears dry. Cookies will stay white, so be careful not to overbake.\n",
        "picture_link": "OX9M7dEfsm1aOBFvgpziuHBBSWXt.YC"
    }
]