[
    {
        "title": "Marinated Peppers",
        "ingredients": [
            "1 red bell pepper ADVERTISEMENT",
            "1 green bell pepper ADVERTISEMENT",
            "1 yellow bell pepper ADVERTISEMENT",
            "1 1/2 cloves garlic, sliced ADVERTISEMENT",
            "1 tablespoon balsamic vinegar ADVERTISEMENT",
            "1/4 cup extra virgin olive oil ADVERTISEMENT",
            "1/2 teaspoon chopped fresh basil ADVERTISEMENT",
            "1/2 teaspoon chopped fresh parsley ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 450 degrees F (200 degrees C). Place the whole red, green and yellow peppers in the oven directly on the rack. Roast for about 15 minutes, turning if needed, until the skin is well scorched. Immediately place in a bowl covered with plastic wrap or in a paper bag, and allow to cool.\nRemove the skins from the peppers by rubbing with your hands, and rinse under cold water. Cut in half, remove stem and seeds, then cut into strips.\nPlace peppers into a medium serving bowl, and stir in the garlic, vinegar, oil, basil, parsley, salt and pepper.\n",
        "picture_link": "Lxg/CeK5Q2GytfrAMY5J72KgMh6sMYu"
    },
    {
        "title": "Ham Croquettes",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "1/2 cup onion, chopped ADVERTISEMENT",
            "3 medium green onions, chopped ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1 (16 ounce) package sliced honey ham, finely chopped ADVERTISEMENT",
            "1 1/2 cups shredded Cheddar cheese ADVERTISEMENT",
            "3 cups dried breadcrumbs, divided ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "2 cups oil for frying ADVERTISEMENT",
            "1/8 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large skillet over medium heat. Stir in onion, green onions, and garlic; cook until tender, about 10 minutes.\nTransfer contents of skillet to a large bowl. Stir in ham, Cheddar cheese, and 1 1/2 cups of bread crumbs. Beat 3 eggs; stir into ham mixture. Sprinkle with salt and pepper. Using your hands, make golf ball-size balls out of the ham mixture.\nHeat vegetable oil in a large skillet over medium heat. Spread remaining bread crumbs onto a plate. In a large bowl, beat 1 egg; stir in water. Dip balls into egg mixture, and roll in bread crumbs. Place balls in hot oil being careful not to crowd. Fry until golden brown. Remove to paper towels to soak up grease.\n",
        "picture_link": "1hBQpBneV5bDE7YroSO52QeqgMjQUtG"
    },
    {
        "title": "Rich Green Bean Casserole",
        "ingredients": [
            "8 ounces processed cheese food, cubed ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "2 (15 ounce) cans green beans, drained ADVERTISEMENT",
            "1 teaspoon Cajun seasoning ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 (2.8 ounce) can French-fried onions ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nPlace the processed cheese into a large microwave-safe bowl along with the cream of chicken soup. Heat on full power for 2 minutes, stirring occasionally, or until cheese is melted. Season with salt, pepper, and Cajun seasoning. Stir in the green beans. Pour into a 1 1/2 quart casserole dish, and sprinkle the French fried onions over the top.\nBake for about 20 minutes in the preheated oven, or until the top is crispy.\n",
        "picture_link": "NgWxVXuF36Wo4Ee9.dV0PUJ9kHVixaa"
    },
    {
        "title": "Chicken Marsala with Portobello Mushrooms",
        "ingredients": [
            "3/4 cup butter, divided ADVERTISEMENT",
            "2 tablespoons vegetable oil, divided ADVERTISEMENT",
            "4 portobello mushroom caps, sliced ADVERTISEMENT",
            "1 clove garlic, chopped ADVERTISEMENT",
            "3/4 cup all-purpose flour, divided ADVERTISEMENT",
            "1 (14.5 ounce) can beef broth ADVERTISEMENT",
            "1/2 cup dry Marsala wine ADVERTISEMENT",
            "kosher salt and ground black pepper to taste ADVERTISEMENT",
            "1 tablespoon browning sauce ADVERTISEMENT",
            "6 skinless, boneless chicken breast halves - pounded to 1/2 inch thickness ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMelt 1/2 cup butter and heat 1 tablespoon vegetable oil in a skillet over medium heat. Cook and stir the mushroom slices in the skillet until tender. Remove from heat, cover to keep warm, and set aside.\nMelt the remaining butter and heat the remaining oil in a saucepan over medium-high heat. Cook and stir the garlic until tender, then gradually whisk in the flour. Increase heat to high, and pour in the beef broth and Marsala wine. Season with kosher salt and pepper, and whisk in the browning sauce. Bring to a boil, and reduce heat to low. Mix in the mushrooms, reserving remaining butter and oil in the skillet. Cover saucepan, remove from heat, and set aside.\nSeason chicken with salt and pepper, and dredge in the remaining flour. Over medium heat, reheat the remaining butter and oil in the skillet used to cook the mushrooms. Cook the chicken 2 minutes per side, until browned. Arrange the chicken in the bottom of a 9x13 inch baking dish, and cover with the sauce and mushroom mixture.\nCover baking dish, and bake 25 minutes in the preheated oven, or until chicken juices run clear.\n",
        "picture_link": "mOVH2tYpIApixRsCKGpKDT2UfFgGNFS"
    },
    {
        "title": "Russell's Fish Stew",
        "ingredients": [
            "1/4 cup olive oil ADVERTISEMENT",
            "4 stalks celery ADVERTISEMENT",
            "1/2 onion, diced ADVERTISEMENT",
            "3 carrots, diced ADVERTISEMENT",
            "3 cloves garlic, diced ADVERTISEMENT",
            "1 (14 ounce) can stewed tomatoes ADVERTISEMENT",
            "2 1/2 cups water ADVERTISEMENT",
            "1 cup white wine ADVERTISEMENT",
            "1 (8 ounce) bottle clam juice ADVERTISEMENT",
            "1/4 cup sherry ADVERTISEMENT",
            "2 cubes chicken bouillon ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/2 bunch cilantro ADVERTISEMENT",
            "1/2 pound medium shrimp - peeled and deveined ADVERTISEMENT",
            "1/2 pound white fish, cut into small chunks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a large pot over medium heat. Mix in the celery, onion, carrots, and garlic. Cook and stir until onion is tender. Stir in the tomatoes, water, wine, clam juice, and sherry. Dissolve bouillon cubes in the stew, and season with red pepper, salt, and pepper. Bring to a boil, reduce heat to low, and simmer 1 hour.\nMix the cilantro, shrimp, and fish into the stew. Continue cooking 5 minutes, or until shrimp is opaque and fish is easily flaked. Remove from heat, and allow to sit 10 minutes before serving.\n",
        "picture_link": "t.VRK8hh1y2rDy4kEStIdXb7w5e4Aie"
    },
    {
        "title": "We Be Jammin' Jamaican Banana Bread",
        "ingredients": [
            "2 tablespoons unsalted butter, softened ADVERTISEMENT",
            "2 tablespoons cream cheese ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1 cup mashed overripe bananas ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "2 tablespoons dark rum, or rum flavoring ADVERTISEMENT",
            "1/2 teaspoon lime zest ADVERTISEMENT",
            "2 teaspoons lime juice ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 cup chopped toasted pecans ADVERTISEMENT",
            "1/4 cup flaked coconut ADVERTISEMENT",
            "Topping ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "2 teaspoons unsalted butter ADVERTISEMENT",
            "2 teaspoons lime juice ADVERTISEMENT",
            "2 teaspoons dark rum, or rum flavoring ADVERTISEMENT",
            "2 tablespoons chopped toasted pecans ADVERTISEMENT",
            "2 tablespoons flaked coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease two 8x4 inch loaf pans.\nBeat together 2 tablespoons of softened butter and cream cheese in a large bowl until fluffy. Slowly beat in sugar until well incorporated. Add the egg and mix well. Sift together the flour, baking powder, baking soda, and salt in a separate bowl. In a different bowl, mix together the bananas, milk, 2 tablespoons rum, lime zest, lime juice, and vanilla extract; stir well. Pour 1/3 of the flour mixture into the butter and mix well. Mix in 1/2 of the mashed bananas. Continue with another 1/3 of the flour, followed by the remaining banana mixture, and finally the remaining flour. Fold in 1/4 cup pecans and 1/4 cup coconut flakes.\nPour the mixture into the loaf pans, and bake in the preheated oven until a toothpick inserted into the center comes out clean, about one hour. When finished, cool for 10 minutes in the pan, remove, and finish cooling on a wire rack.\nAfter you take the banana bread out of the oven, prepare the topping by stirring together the brown sugar, remaining butter, lime juice, and 2 teaspoons of rum in a small saucepan over medium-high heat. Bring to a simmer stirring constantly; cook until the sugar has dissolved and the mixture is smooth, about one minute. Remove from heat, and stir in 2 tablespoons pecans, and 2 tablespoons coconut. Spoon this topping over the loaves while they are still warm. The topping will harden slightly when the loaf cools.\n",
        "picture_link": "PTsY3VOrz5f8Q0UMZxwCuNF5vT7k5pq"
    },
    {
        "title": "Japanese Okonomiyaki",
        "ingredients": [
            "12 ounces sliced bacon ADVERTISEMENT",
            "1 1/3 cups water ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 medium head cabbage, cored and sliced ADVERTISEMENT",
            "2 tablespoons minced pickled ginger ADVERTISEMENT",
            "1/4 cup tonkatsu sauce or barbeque sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fry the bacon in a large skillet over medium heat until slightly crispy. Remove to paper towels to drain and set aside.\nIn a large bowl, stir together the water and eggs. Gradually stir in the flour and salt until smooth. Add the cabbage and ginger; stir until evenly distributed.\nHeat a skillet over medium heat and coat with cooking spray. Pour about 1/4 of the batter into the center of the skillet. Place 4 slices of cooked bacon in the center. Use a spatula to shape the pancake into a circle. Fry for about 5 minutes or until the edges are dry. Flip and cook on the other side until the center is stable and it is browned on both sides. Remove from the pan and drizzle with tonkatsu sauce to serve. Continue with remaining batter and bacon.\n",
        "picture_link": "RGzPk12XO5t095RgkYqlZWbp1t481.i"
    },
    {
        "title": "Caramel Pie",
        "ingredients": [
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 (9 inch) prepared graham cracker crust ADVERTISEMENT",
            "1 (12 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot, place the can of sweetened condensed milk with the label taken off, in the pot and cover with water. Cook on high until water comes to a boil, then turn on medium/high for 4 hours, only adding water to keep the can covered.\nCarefully open can and pour into pie shell. Cool pie in refrigerator. When completely cooled, top with frozen whipped topping. Serve.\n",
        "picture_link": "yr8DCC2zJPIzd6wpoo/GwG61VtOnCVO"
    },
    {
        "title": "Chicken Enchiladas III",
        "ingredients": [
            "1 (1 pound) loaf processed cheese food, cubed ADVERTISEMENT",
            "1 (16 ounce) container sour cream ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed cream of chicken soup ADVERTISEMENT",
            "8 fluid ounces evaporated milk ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 (10 ounce) can chicken chunks, drained ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "1 (4 ounce) can chopped green chile peppers ADVERTISEMENT",
            "10 (10 inch) flour tortillas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium size microwave safe bowl, combine the processed cheese food, sour cream, 1 can of soup, and evaporated milk. Stir together, and heat in microwave oven until smooth, stirring at intervals. Add cumin to taste, and set aside.\nIn a medium size bowl, combine the chicken, remaining can of soup, shredded cheese, and green chile peppers. Drop spoonfuls of chicken mixture in center of tortillas, and roll up. Place in a lightly greased 9x13 inch baking dish. Pour reserved sour cream mixture over all.\nBake in the preheated oven for 20 minutes.\n",
        "picture_link": "Emz7pJ45.seheCGQp.ijCKEbipraRkm"
    },
    {
        "title": "Chicken Stroganoff I",
        "ingredients": [
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "2 cups all-purpose flour for coating ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1 1/4 cups half-and-half cream ADVERTISEMENT",
            "1 (1 ounce) package dry onion soup mix ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 cups fresh sliced mushrooms ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1 teaspoon browning sauce ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1/8 cup chopped green onion for topping (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a shallow dish or bowl, season flour with salt and pepper to taste. Dredge chicken in seasoned flour to coat. In a large skillet, brown coated chicken in melted butter or margarine until golden.\nIn a medium bowl combine the soup, half-and-half, dry onion soup mix, parsley, garlic, mushrooms, nutmeg and browning sauce. Mix all together and pour mixture over chicken in skillet. Reduce heat to low and let simmer, covered, for 1 hour.\nStir in sour cream and heat through, but DO NOT BOIL! Top with chopped green onion and serve over noodles or rice, if desired.\n",
        "picture_link": "BBywISbfS2KcTkH.C0R8nVCGqLwB2ey"
    },
    {
        "title": "Sugarless Bars",
        "ingredients": [
            "1/2 cup pitted dates ADVERTISEMENT",
            "1/2 cup pitted prunes ADVERTISEMENT",
            "1/2 cup chopped raisins ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/2 cup margarine ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut dates and prunes into small pieces. Boil dates, prunes, raisins, and water for 5 minutes. Add margarine. Mix and set aside to cool.\nPreheat oven to 350 degrees F (180 degrees C).\nMix the eggs, vanilla and nuts. Add to the fruit mixture. Sift the flour, baking soda and salt and add to the fruit mixture. (If you want a spicy bar add 1/2 tsp. Cinnamon and 1/4 tsp. Nutmeg to the flour.)\nSpread in 7 x 11 inch pan and bake for 25-30 minutes.\n",
        "picture_link": "jq7cLAuevZ9tTqC4Rl.K.dqr/bWtg3W"
    },
    {
        "title": "Caramel Pie II",
        "ingredients": [
            "1 (9 inch) prepared graham cracker crust ADVERTISEMENT",
            "2 (14 ounce) cans sweetened condensed milk ADVERTISEMENT",
            "1 (16 ounce) package frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the condensed milk into a heatproof bowl. Set over a pan or pot of simmering water. Cook, stirring occasionally for about 2 hours, replacing water as needed. (It is extremely important not to let the water run out!) When ready, the milk should be deep golden brown and thick.\nPour the caramelized milk into graham cracker crust and allow to cool. Top with whipped topping before serving.\n",
        "picture_link": "8Q5/wDF36Xeld8wyhM4rsTiriSlJsA2"
    },
    {
        "title": "Creme Fraiche Chicken",
        "ingredients": [
            "6 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1/4 cup white wine ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 (8 ounce) package pasta, your choice of shape ADVERTISEMENT",
            "1 large white onion, chopped ADVERTISEMENT",
            "1 tablespoon chopped garlic ADVERTISEMENT",
            "2 (8 ounce) packages sliced fresh mushrooms ADVERTISEMENT",
            "2 cups creme fraiche ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese for topping ADVERTISEMENT",
            "3 tablespoons sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet, saute chicken breasts in oil over medium high heat. Once breasts are browned, add white wine and salt and pepper to taste. Let simmer for 15 to 20 minutes, or until chicken is cooked through and juices run clear.\nMeanwhile, To Cook Pasta: Bring a large pot of salted water to a boil. Add pasta to boiling water, cook for 8 to 10 minutes or until al dente. Drain.\nWhen chicken is cooked, remove from skillet and cube. Set aside. Saute onion and garlic in remaining juices. Once onions are translucent, add mushrooms and saute until soft. Add cubed chicken, creme fraiche and sour cream (to desired thickness). Stir all together and heat through. Put hot cooked pasta on plate, top with chicken and sauce and sprinkle with grated Parmesan cheese.\n",
        "picture_link": "Fc3TCu7XBFaEoLWVSscSMpoQUVG6Ow2"
    },
    {
        "title": "Taffy Apple Salad I",
        "ingredients": [
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "2 tablespoons cider vinegar ADVERTISEMENT",
            "1 (8 ounce) can crushed pineapple, drained with juice reserved ADVERTISEMENT",
            "4 large apples, cored and diced with peel ADVERTISEMENT",
            "2 cups unsalted peanuts ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan combine the flour, sugar, egg yolk, vinegar and reserved pineapple juice. Cook over medium heat until thick. Remove from heat and chill.\nin a large bowl combine the pineapple, apples, peanuts and chilled cooked mixture. Fold in whipped topping and chill for at least 1 hour before serving.\n",
        "picture_link": "gcOZKhrsT1ODc07rHQ1YMrVdI1PSgYa"
    },
    {
        "title": "Steak Fajitas",
        "ingredients": [
            "1 pound lean steak, cut into strips ADVERTISEMENT",
            "1/2 cup fresh lime juice ADVERTISEMENT",
            "1/2 tablespoon ground black pepper ADVERTISEMENT",
            "1 tablespoon chopped fresh cilantro ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 large onion, cut into thin strips ADVERTISEMENT",
            "1 julienned green bell pepper ADVERTISEMENT",
            "2 lemons, quartered ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "6 (12 inch) flour tortillas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the lime juice, ground pepper and cilantro in a shallow dish. Place steak strips into the marinade and refrigerate for two to four hours.\nHeat 1 tablespoon vegetable oil in a large skillet over medium-high heat. Add steak strips, and fry until cooked to your liking. Remove meat and set aside.\nAdd remaining oil and onions to the skillet. Cook over medium low heat, until translucent, stir in green peppers and steak. Squeeze the juice of 1 lemon over the top and stir. When the green bell peppers are just tender remove the pan from the heat. Season with salt and pepper to taste. Serve the steak fajitas with tortillas and lemon wedges on the side.\n",
        "picture_link": "5MSKD3NBoFJFmYMEtYbAbtpMp1qssbG"
    },
    {
        "title": "Fruit Ball",
        "ingredients": [
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "2 (15.25 ounce) cans fruit cocktail, drained and chopped fine ADVERTISEMENT",
            "1 (5 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "3/4 cup chopped almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium size mixing bowl, mix together cream cheese, fruit cocktail, and instant pudding mix. Add 1/4 cup almonds, if desired. Shape mixture into a ball, and then roll in the remaining almonds.\n",
        "picture_link": "/LNQmsrHigCXOdU38nYEvWJIHK4lnOu"
    },
    {
        "title": "Artichoke Dip",
        "ingredients": [
            "1 (14 ounce) can artichoke hearts, drained and chopped ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1 cup grated Parmesan cheese ADVERTISEMENT",
            "1 (4 ounce) can diced green chiles ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine the artichoke hearts, mayonnaise, cheese and green chilies. Mix well and pour into a 2 quart casserole dish.\nBake for 20 to 25 minutes or until lightly browned. Garnish with chopped green onions and chopped tomato if desired.\n",
        "picture_link": "YRFglBG4BFY.qwW8ee/4kmgRqAssMbe"
    },
    {
        "title": "Tapenade",
        "ingredients": [
            "1 clove garlic, chopped ADVERTISEMENT",
            "1 3/4 cups whole, pitted kalamata olives ADVERTISEMENT",
            "1 (2 ounce) can anchovy fillets, rinsed ADVERTISEMENT",
            "2 tablespoons capers ADVERTISEMENT",
            "1 teaspoon chopped fresh thyme ADVERTISEMENT",
            "1 teaspoon chopped fresh rosemary ADVERTISEMENT",
            "3 tablespoons lemon juice ADVERTISEMENT",
            "4 tablespoons olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine garlic, olives, anchovies, capers, thyme, rosemary and lemon juice in an electric blender. Slowly drip the olive oil into the blender while you are blending the ingredients together. Blend until a paste is formed.\n",
        "picture_link": "hWgZWPfvav/fYXSyr8B42X2tajz7YYy"
    },
    {
        "title": "Stroganoff Sandwich",
        "ingredients": [
            "1 (1 pound) loaf French or Italian-style bread ADVERTISEMENT",
            "1/4 cup chopped green onions ADVERTISEMENT",
            "1 tablespoon milk ADVERTISEMENT",
            "1/8 teaspoon garlic powder ADVERTISEMENT",
            "1 green bell pepper, sliced in rings ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "2 tablespoons butter, softened ADVERTISEMENT",
            "2 tomatoes, sliced ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut loaf in half. Wrap in foil and heat at in a preheated 375 degrees F (190 degrees) oven for 10 to 15 minutes.\nIn a large skillet over medium-high cook beef and green onions until beef is cooked through; drain. Stir in milk, garlic powder, sour cream, Worcestershire sauce, salt and pepper to taste. Heat but do not let boil.\nButter cut surface of bread. Spread with half of meat mixture on each half. Arrange tomatoes and green bell pepper alternately on top and sprinkle with cheese.\nPlace on baking sheet. Bake at 350 degrees F (175 degrees C) for 5 minutes or until heated through completely.\n",
        "picture_link": "BhMm3bDM.dGZLszmT45AxIitqmmeZAu"
    },
    {
        "title": "Dee's Special Chicken",
        "ingredients": [
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 teaspoon dried rosemary ADVERTISEMENT",
            "1 teaspoon dried sage ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "6 cloves garlic ADVERTISEMENT",
            "1 (12 fluid ounce) can or bottle beer ADVERTISEMENT",
            "2 sprigs fresh parsley, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Salt and pepper the chicken breasts and broil them until golden brown.\nPlace the chicken in a slow cooker with the rosemary, sage, thyme, garlic and beer. Cook on high for 3 to 4 hours. Remove the chicken breasts, garnish with parsley and serve.\n",
        "picture_link": "sbvkHpaaHImMQrC9oRekG5T1.vBphMi"
    },
    {
        "title": "Savory Onion Bread",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "3 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 tablespoons margarine ADVERTISEMENT",
            "1/2 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "1/2 cup finely diced onion ADVERTISEMENT",
            "1 tablespoon margarine ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (205 degrees C). Grease one 8 inch round or one 8x8 inch square pan.\nCombine flour, baking powder and salt, cut in 2 tablespoons of the butter until mixture is crumbly. Stir in 1/2 cup of the grated cheese. Make a well in the center of the mixture.\nFry the onion in 1 tablespoon of the butter or margarine until clear and golden. Set aside.\nIn a small bowl beat the egg and stir in the milk and the cooked onion. Pour egg mixture into the well in the flour mixture. Stir until just moistened. You will have a soft dough. Pat dough into the prepared pan. Sprinkle remaining 1/2 cup grated cheese over top.\nBake at 400 degrees F (205 degrees C) for 25 minutes. Serve hot. Makes about 6 servings.\n",
        "picture_link": "nh5dcKrAAAWcAyoCAlzFyLWiadoqstm"
    },
    {
        "title": "Poppy Seed Dressing II",
        "ingredients": [
            "3/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon mustard powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/3 cup cider vinegar ADVERTISEMENT",
            "1 onion, grated, juice reserved ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "1 1/2 tablespoons poppy seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the sugar, mustard, salt, vinegar, onion juice, oil and poppy seeds. Cover and refrigerate until ready to serve.\n",
        "picture_link": "tO3NXwq7T7z5Dc2f.vBpyfkpK4RjPNG"
    },
    {
        "title": "Creamy Shrimp and Corn Soup",
        "ingredients": [
            "1 pound medium shrimp - peeled and deveined ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1/4 cup margarine ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1 (10.75 ounce) can low-fat cream of celery soup ADVERTISEMENT",
            "1 (16 ounce) package frozen corn kernels ADVERTISEMENT",
            "1 (14.5 ounce) can chicken broth ADVERTISEMENT",
            "1 cup skim milk ADVERTISEMENT",
            "1 pinch dried rosemary ADVERTISEMENT",
            "1 pinch dried thyme ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot over medium high heat, saute the shrimp and the onions in the butter or margarine for about 5 minutes or until onions are tender. Add the cream of chicken soup, cream of celery soup, corn, broth, milk, rosemary, thyme, nutmeg and salt and pepper to taste. Reduce heat to low and simmer for 20 minutes. Serve with French bread.\n",
        "picture_link": "DQXAFv5obWfLb2Q3BD7iR2KDcZh.bvS"
    },
    {
        "title": "Pea Salad I",
        "ingredients": [
            "8 eggs ADVERTISEMENT",
            "8 slices bacon (optional) ADVERTISEMENT",
            "2 heads romaine lettuce - rinsed, dried, and torn into bite-size pieces ADVERTISEMENT",
            "1 (16 ounce) package frozen green peas ADVERTISEMENT",
            "2 cups mayonnaise ADVERTISEMENT",
            "1/8 cup skim milk ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "3 cups shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place eggs in a saucepan, and cover completely with cold water. Bring water to a boil for one minute. Cover, remove from heat, and let eggs stand in hot water for 10 to 12 minutes. Remove from hot water, and cool. Peel. Slice egg with an egg slicer, or just crumble.\nPlace bacon in a large skillet. Cook, turning frequently, over medium high heat until evenly browned.\nSpread Romaine lettuce evenly over the bottom of a 9x13 inch baking dish. Layer crumbled bacon, thawed peas, and eggs over the lettuce.\nIn a small bowl, mix together mayonnaise, milk, and sugar until smooth. Pour evenly over salad, and top with cheese. Chill in the refrigerator for 2 hours. Serve.\n",
        "picture_link": "TjmdN3RzO.hTXbXr2tkng.kmHdihtxe"
    },
    {
        "title": "Spicy Pork Stir-Fry",
        "ingredients": [
            "2 tablespoons soy sauce ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "1 pound pork tenderloin, cubed ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "2 tablespoons rice vinegar ADVERTISEMENT",
            "1 teaspoon cornstarch ADVERTISEMENT",
            "3 teaspoons dark sesame oil ADVERTISEMENT",
            "1 tablespoon peanut oil ADVERTISEMENT",
            "3 teaspoons minced fresh ginger root ADVERTISEMENT",
            "2 green chile peppers, chopped ADVERTISEMENT",
            "1/2 cup julienned carrots ADVERTISEMENT",
            "1/2 cup sugar snap peas, julienned ADVERTISEMENT",
            "2 teaspoons chili oil ADVERTISEMENT",
            "1/4 cup chopped green onions ADVERTISEMENT",
            "1/4 cup finely chopped peanuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, combine 2 tablespoons soy sauce, 1 tablespoon cornstarch and water. Mix all together until smooth and stir in the pork cubes. Cover and refrigerate for 30 to 45 minutes.\nIn a small bowl combine the lime juice, 1 tablespoon soy sauce, vinegar, 1 teaspoon cornstarch and sesame oil. Mix together and set aside.\nRemove pork and marinade from refrigerator. In a large skillet or wok heat peanut oil until hot. Stir in ginger and chile pepper and saute for 1 minute. Then stir in pork with marinade, carrots, and sugar peas and stir-fry for 6 to 8 minutes or until pork is tender.\nPour in lime mixture, reduce heat and simmer until sauce thickens, about 6 to 8 minutes. Remove from heat and stir in hot chile oil, green onions and peanuts. Serve!\n",
        "picture_link": "a9.oMtnL7POOoCSzSul.AD9keicIveK"
    },
    {
        "title": "Basic Brine for Smoking Meat",
        "ingredients": [
            "1/4 cup kosher salt ADVERTISEMENT",
            "1/4 cup packed brown sugar ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, combine the salt, sugar and water. Whisk vigorously until all the salt and sugar is dissolved. Then pour this mixture over the meat, poultry, or fish that you are preparing. Soak for several hours, or overnight. (Note: Make certain the meat is fully submerged in the brine, and make more brine as needed to fully cover the meat.)\n",
        "picture_link": "eSmMYOi4iu/q8jypgf3HG3Z.C485TMa"
    },
    {
        "title": "Broccoli Cornbread",
        "ingredients": [
            "1 cup cornmeal ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "4 teaspoons baking powder ADVERTISEMENT",
            "1 1/2 teaspoons white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped broccoli ADVERTISEMENT",
            "12 ounces cottage cheese ADVERTISEMENT",
            "5 tablespoons margarine, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl mix together the corn meal, flour, salt, baking powder, and sugar together. Make a well in the center of the bowl.\nIn a separate bowl, combine the eggs, thawed broccoli, cottage cheese, and melted butter or margarine. Pour into well of flour mixture. Stir until just combined.\nPour batter into a greased 9x13 inch baking dish.\nBake in a preheated 350 degree F (175 degrees C) oven for 30 minutes, or until golden brown.\n",
        "picture_link": "Kg4kacYlDKMmIUhzShVHQE7sx4R/EwC"
    },
    {
        "title": "Passover Apple Cake",
        "ingredients": [
            "2 eggs ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 1/2 cups matzo meal ADVERTISEMENT",
            "1/2 cup potato starch ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "8 large apples - peeled, cored and sliced ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C and grease a 9x13 inch glass baking dish.\nCombine eggs, oil and sugar in large bowl with electric mixer. Stir in matzo meal, potato starch and 1 teaspoon cinnamon.\nIn a separate bowl, toss apples with brown sugar, 1 teaspoon cinnamon and nutmeg.\nLayer half of the dough into the prepared 9x13 inch dish. Pour the apples into the dish then pat remaining dough over the apples. Sprinkle with some brown sugar, if desired.\nBake in a preheated 350 degrees F (175 degrees C) oven for 45 minutes.\n",
        "picture_link": "WtxnxZbN3lutSxe9vHSOTiqH3iqko8m"
    },
    {
        "title": "Dog Biscuits I",
        "ingredients": [
            "2 1/2 cups whole wheat flour ADVERTISEMENT",
            "1/2 cup powdered milk ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 tablespoon wheat germ ADVERTISEMENT",
            "1 teaspoon beef bouillon granules ADVERTISEMENT",
            "1/3 cup bacon grease ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup ice water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl, stir together the whole wheat flour, powdered milk, garlic powder, wheat germ and beef bouillon granules. Stir in the bacon grease and egg. Add ice water 1 tablespoon at a time until dough is wet enough to stick together. On a lightly floured surface, roll the dough out to 1/2 inch thickness and cut with cookie cutters. Place biscuits 1 inch apart onto an ungreased baking sheet.\nBake for 25 to 30 minutes in the preheated oven, until firm. Cool before serving.\n",
        "picture_link": "qi7IpT0irpmxS.SsM4uiQqCbPqfNcoO"
    },
    {
        "title": "Jambalaya Salad",
        "ingredients": [
            "1 1/3 cups water ADVERTISEMENT",
            "2/3 cup uncooked long-grain white rice ADVERTISEMENT",
            "6 slices bacon ADVERTISEMENT",
            "1 (6 ounce) can tiny shrimp, drained ADVERTISEMENT",
            "1/2 cup cubed ham ADVERTISEMENT",
            "1/2 cup chopped green bell pepper ADVERTISEMENT",
            "1/2 cup sliced celery ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "1 cup chopped fresh tomato ADVERTISEMENT",
            "3/4 cup Italian-style salad dressing ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "1/4 teaspoon chili powder ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan, bring water to a boil. Stir in the rice. Cover, reduce heat, and simmer 20 minutes.\nWhile the rice is cooking, place bacon in a large, deep skillet over medium-high heat. Cook until evenly brown. Drain, cool, and crumble.\nIn a large bowl, mix the cooked rice, crumbled bacon, shrimp, ham, bell pepper, celery, onion, and tomatoes.\nPrepare the dressing by whisking together the salad dressing, thyme, chili powder, garlic, and salt. Pour over rice mixture, and toss to coat. Cover, and chill in the refrigerator until serving.\n",
        "picture_link": "vpnnkHCXPd6D1CP5OzwGaZ24U6oQSPq"
    },
    {
        "title": "Double Chocolate Cookie Bars",
        "ingredients": [
            "24 chocolate sandwich cookies ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 325 degrees F (165 degrees C).\nSet aside 6 cookies and grind the rest in a food processor or blender. In a small bowl, stir together the cookie crumbs and butter until well blended. Press into the bottom of an 11x13 inch pan.\nOver a double boiler or in the microwave, melt 1 cup of chocolate chips together with the condensed milk and vanilla. Stir frequently until smooth. Spread evenly over the crumb crust. Sprinkle the remaining cup of chocolate chips over the top. Break remaining cookies into pieces by hand and sprinkle over the top.\nBake for 20 to 25 minutes in the preheated oven. Chill completely before cutting into bars or it will make a big mess.\n",
        "picture_link": "Pd5UAQqOQGNfrGF73gSHHQVMkUkVthO"
    },
    {
        "title": "Wild Rice Chowder",
        "ingredients": [
            "2 tablespoons margarine ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "2 carrots, chopped ADVERTISEMENT",
            "1 1/2 cups uncooked wild rice ADVERTISEMENT",
            "8 cups chicken stock ADVERTISEMENT",
            "1 bay leaves ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "1 cup boneless chicken breast half, cooked and diced ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter or margarine in a large pot over medium heat. Add the onion, celery and carrots and saute for 5 to 10 minutes, or until onion is translucent and carrots start to get tender.\nAdd the rice and stir to coat. Then add the chicken stock and the bay leaf. Reduce heat to low and simmer for 1 hour, or until rice is tender, stirring occasionally.\nAdd the heavy cream and puree 2 cups of the soup in a blender or food processor. Return this to the pot and add the chicken. Stir well and allow to heat through. Season with salt and pepper to taste.\n",
        "picture_link": "sUhKfykNhhAZQ6C2jY/tAlLXGqbkuWC"
    },
    {
        "title": "Mom's Oatmeal Blueberry Pancakes",
        "ingredients": [
            "1 1/2 cups rolled oats ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 1/2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 cups buttermilk ADVERTISEMENT",
            "1 cup frozen blueberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a lightly oiled griddle or frying pan over medium high heat.\nIn a large mixing bowl, mix together oats, flour, sugar, salt, baking soda and baking powder. Stir in eggs and buttermilk. Fold in blueberries.\nPour or spoon the batter onto the griddle, using approximately 1/4 cup for each pancake. Brown on both sides and serve hot.\n",
        "picture_link": "PM7D4GSzktkH/NNzbG8MoqiCUR0OR32"
    },
    {
        "title": "Garlic and Herb Marinade",
        "ingredients": [
            "1/3 cup water ADVERTISEMENT",
            "1/3 cup vinegar ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "1 teaspoon dried Italian-style seasoning ADVERTISEMENT",
            "1 teaspoon poultry seasoning ADVERTISEMENT",
            "1 teaspoon dried rosemary, crushed ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, combine the water, vinegar, oil, garlic, thyme, Italian-style seasoning, poultry seasoning, rosemary, salt and ground black pepper. Mix well and apply to your favorite meat.\n",
        "picture_link": "Ih.Q.Xnp749vzOSNYV/X8YIJ1cugB66"
    },
    {
        "title": "Summer Beer I",
        "ingredients": [
            "4 cups ice cubes ADVERTISEMENT",
            "1 (6 ounce) can frozen lemonade concentrate ADVERTISEMENT",
            "1 (12 fluid ounce) can or bottle beer ADVERTISEMENT",
            "12 fluid ounces vodka ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender crush the ice. Pour in the lemonade concentrate, beer and vodka. Blend until smooth. Pour into frozen glasses.\n",
        "picture_link": "rPxUpSkH.QkONFJQB6URfVouQnLmuiq"
    },
    {
        "title": "Chicago Style Stuffed Pizza",
        "ingredients": [
            "2 teaspoons white sugar ADVERTISEMENT",
            "1 cup warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "1 teaspoon active dry yeast ADVERTISEMENT",
            "3 cups unbleached all-purpose flour, divided ADVERTISEMENT",
            "1/2 cup warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "1/2 cup yellow cornmeal ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/4 pound spicy Italian sausage - browned, drained and crumbled ADVERTISEMENT",
            "9 ounces shredded mozzarella cheese ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1/3 cup diced pepperoni ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "1/8 cup chopped green bell pepper ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "3 cloves garlic, sliced ADVERTISEMENT",
            "1/2 cup tomato sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To Make Dough: In a small bowl, dissolve sugar in 1 cup warm water; in a separate small bowl combine the yeast, 1/2 cup flour, and 1/2 cup warm water. Mix together and let rest in bowl for about 20 minutes, until foamy.\nMeanwhile, in a medium bowl mix together remaining 2 1/2 cups flour with cornmeal and salt; remove half of this mixture from bowl and stir 1 cup sugar water into bowl. When well mixed, return second half of flour/cornmeal mixture to bowl and mix all together; then stir in yeast mixture. Knead dough on a lightly floured surface until smooth and elastic, about 8 to 12 minutes. Place dough in a lightly oiled bowl and cover with plastic wrap. Let rise until doubled in volume.\nPreheat oven to 450 degrees F (230 degrees C). To Make Stuffing: In a large bowl combine the sausage, mozzarella cheese, Parmesan cheese, pepperoni, onion, bell pepper, oregano and garlic. Mix well.\nPress half of the dough in the bottom and up the sides of a lightly greased deep dish pan. Bake crust in preheated oven for 4 minutes, then add the stuffing mixture to the bottom crust and cover with top crust; seal edges together with fingers, and trim excess. Slit top crust to allow steam to vent during baking; top with tomato sauce.\nBake on lower rack at 450 degrees F (230 degrees C) for 45 minutes, or until crust is golden brown. Remove from oven and allow to cool for 5 minutes, then cut and serve.\n",
        "picture_link": "1aDlCBKKHsc28OOn9omDfKE3ec2enLC"
    },
    {
        "title": "Round Steak and Gravy I",
        "ingredients": [
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "garlic powder to taste ADVERTISEMENT",
            "3 pounds round steak ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "1 tablespoon beef bouillon ADVERTISEMENT",
            "1 (6 ounce) package beef flavored stuffing mix ADVERTISEMENT",
            "1/3 cup warm water ADVERTISEMENT",
            "4 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a small bowl, mix together the flour, seasoned salt, ground black pepper and garlic powder to taste. Cut the steak into 3x3 inch squares and coat with the flour mixture.\nHeat the oil in a large skillet over medium high heat. Add the steaks and saute until browned on both sides. Remove meat and set aside in a 9x13 inch baking dish. Add the soup, water, onion and bouillon to the skillet, allow to heat through and pour over the meat.\nIn a separate small bowl, combine the stuffing mix, water and butter or margarine. Mix well and spread over the steaks and gravy.\nBake at 350 degrees F (175 degrees C) for at least one hour, or until steak is tender.\n",
        "picture_link": "BIdkRpyjeWOdMxdpQf3Exwww.tO.hui"
    },
    {
        "title": "Crabbies",
        "ingredients": [
            "1/4 cup margarine, softened ADVERTISEMENT",
            "2/3 (5 ounce) container sharp processed cheese spread ADVERTISEMENT",
            "8 ounces cooked crabmeat ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon dried parsley ADVERTISEMENT",
            "8 English muffins, split ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven on broiler setting.\nIn a medium bowl, mix together margarine and cheese spread. Stir in crabmeat, mayonnaise, garlic powder, and parsley. Spread the mixture on the split English muffins. Arrange on a cookie sheet.\nBroil until the cheese mixture is bubbly.\n",
        "picture_link": "haz0hgf670NAHvCC4T9Ma5UKAX9tb5S"
    },
    {
        "title": "Dill and Butter Squash",
        "ingredients": [
            "2 sliced zucchini ADVERTISEMENT",
            "2 yellow squash ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 teaspoons dried dill weed ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Slice the zucchini and yellow squash. Place the sliced vegetables in a large skillet or saucepan with the butter. Saute over a medium-low heat for 10 minutes before seasoning with salt, pepper and dill.\nContinue to saute for 10 additional minutes before adding the lemon juice. Stir the vegetables well and remove from heat. Serve hot.\n",
        "picture_link": "RYU4knQybKOmCH6Mw3kkMNHDRFUchsW"
    },
    {
        "title": "Roomali Roti",
        "ingredients": [
            "2 cups bread flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "2/3 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, sift together flour and salt. Add oil and mix in with a fork until flour is crumbly. Mix in water until the dough pulls together. Turn dough out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes. Cover and set aside for 45 minutes.\nKnead dough again until smooth; divide into six equal parts. Form each part into a round. Roll out each round as thinly as possible; dust with flour to keep from sticking.\nInvert a heavy cast iron pan over burner and heat. Spread roti over pan and cook. Roti will cook in 40 to 50 seconds. Tiny black spots will appear when it is finished. Fold Roti and serve hot.\n",
        "picture_link": "/uUAHCuwlxspp9G3nJRw6p60mXoRCs."
    },
    {
        "title": "Amish Friendship Bread II",
        "ingredients": [
            "1 cup Amish Friendship Bread Starter ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1/2 cup applesauce ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 (5 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1/2 cup dates, pitted and chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Lightly grease two 9x5 inch loaf pans.\nIn a large bowl, stir together Amish Friendship Starter, oil, applesauce, sugar, vanilla, eggs and milk. Combine the flour, baking powder, baking soda, salt and cinnamon. Stir into the starter mixture. Mix in the vanilla pudding mix. Fold in the chopped nuts, raisins and dates. Pour the batter evenly into the prepared pans.\nBake for 60 minutes in the preheated oven, until a knife inserted comes out clean. Cool for 10 minutes in pans before removing to a wire rack to cool completely.\n",
        "picture_link": "bmvGA4OYND6e/ChBGeg2Psy1KbbWbZO"
    },
    {
        "title": "Dried Beef Ball",
        "ingredients": [
            "5 ounces dried beef, chopped ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "6 green onions, chopped ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1/2 teaspoon seasoned salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Reserve about a half cup of chopped dried beef.\nIn a separate medium bowl, combine the remaining beef, cream cheese, green onions, Worcestershire sauce and seasoned salt. Mix well and roll into a ball.\nRoll the ball in the reserved beef, coating the entire outside of the ball.\n",
        "picture_link": "oPllds/jvTFPtwx5m/BPX45kKatAOei"
    },
    {
        "title": "Blueberries n' Cheese Squares",
        "ingredients": [
            "2 cups graham cracker crumbs ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "2 tablespoons confectioners' sugar ADVERTISEMENT",
            "1 (21 ounce) can blueberry pie filling ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, stir together the graham cracker crumbs and butter. Set aside 1/2 cup for topping, and press the rest of the crumbs into the bottom of a 7x11 inch baking pan. Set aside to chill in the refrigerator.\nIn a small bowl, beat the cream cheese, sugar and milk until smooth. Spread evenly over the chilled crumb layer. Spread the pie filling over the cream cheese layer, and chill while preparing the whipped cream. In a chilled bowl, whip the heavy cream, sugar and vanilla until stiff, spread over the top of the blueberry layer. Sprinkle the top with the remaining graham cracker crumb mixture and keep chilled until serving time.\n",
        "picture_link": "TQ9wz/od40Tf9dz2HPNSPdva.8729tu"
    },
    {
        "title": "Sour Cream Raisin Pie V",
        "ingredients": [
            "1 (9 inch) pie crust, baked ADVERTISEMENT",
            "4 1/2 teaspoons cornstarch ADVERTISEMENT",
            "1 1/8 cups white sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1 1/2 cups sour cream ADVERTISEMENT",
            "3 egg yolks, beaten ADVERTISEMENT",
            "1 1/2 cups raisins ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "1/4 teaspoon cream of tartar ADVERTISEMENT",
            "6 tablespoons brown sugar ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nIn a medium saucepan, mix together cornstarch, white sugar, salt, and nutmeg. Mix in sour cream. Add egg yolks, raisins, and lemon juice. Stir until thoroughly combined. Cook mixture over medium heat, stirring constantly, until mixture thickens and boils. Boil and stir 1 minute. Pour mixture into pastry shell.\nIn a large glass or metal bowl, beat together egg whites and cream of tartar until foamy. Add brown sugar 1 tablespoon at a time, continuing to beat until whites are stiff and glossy. Beat in vanilla extract. Spread evenly over raisin filling, sealing meringue to crust edges.\nBake in preheated oven for 10 minutes, until delicately browned.\n",
        "picture_link": "/AQ113oecmt54nl8hwLXvU1xq4h7mUm"
    },
    {
        "title": "Jewish Chicken Soup",
        "ingredients": [
            "1 whole chicken ADVERTISEMENT",
            "1 medium yellow onion, chopped ADVERTISEMENT",
            "8 carrots, peeled and sliced ADVERTISEMENT",
            "1 parsnip, chopped ADVERTISEMENT",
            "3 cloves garlic, crushed ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "1 bunch fresh dill weed, chopped ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 1/2 cups matzo meal ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "6 tablespoons vegetable oil ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the chicken into a large pot with the breast side down. Fill with enough cold water to reach about 3 inches from the top of the pot. Add the onion, carrot, parsnip, celery and dill. Bring to a simmer over medium heat, and cook, partially covered for 2 hours. Do not let the soup boil. Skim any fat from the top of the soup, and add the garlic cloves. Partially cover, and simmer for another 2 hours for best flavor.\nIn a medium bowl, mix together the matzo meal, eggs, oil, salt, and 1/4 cup of the broth from the chicken soup. Refrigerate for about 20 minutes to set up.\nBring a separate pot of water to a rolling boil. Roll the matzo mixture into about 16 balls. Wet your hands to keep the dough from sticking to them. Drop the balls into boiling water, cover, and cook for about 35 minutes.\nWhile the matzo balls are cooking, strain the broth from the chicken soup. Return the broth to the pot. Remove the bones and skin from the chicken and cut into pieces. Return to the soup, or leave the soup as a broth, and reserve the chicken for other uses. Remove the matzo balls from the water, and serve in the hot chicken soup.\n",
        "picture_link": "ZSIFcHsMPmE2.4Be913pUR3woh8iV5K"
    },
    {
        "title": "Caribbean Rum Punch",
        "ingredients": [
            "1 cup fresh lime juice ADVERTISEMENT",
            "2 cups simple syrup ADVERTISEMENT",
            "3 cups amber rum ADVERTISEMENT",
            "4 cups orange juice ADVERTISEMENT",
            "4 dashes bitters ADVERTISEMENT",
            "freshly grated nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a pitcher, combine lime juice, simple syrup, rum and orange juice. Add a few dashes of bitters and some grated nutmeg to taste. Serve chilled over ice.\n",
        "picture_link": "pkOahj7j4iCZ4dMpxX7DRz/K91iZA9i"
    },
    {
        "title": "Poppy Seed and Banana Muffins",
        "ingredients": [
            "1 1/4 cups whole wheat flour ADVERTISEMENT",
            "1 cup wheat bran ADVERTISEMENT",
            "1/2 cup wheat germ ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt (optional) ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 cup mashed bananas ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "1/3 cup poppy seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 12 cup muffin pan.\nIn a large bowl, mix whole wheat flour, wheat bran, wheat germ, baking soda, baking powder, and salt.\nIn a medium bowl, beat together eggs, honey, and vegetable oil. Stir in bananas, milk, lemon juice, and poppy seeds.\nMake a well in the center of the wheat flour mixture, and pour in egg and banana mixture. Stir until just blended. Spoon into the prepared muffin pan.\nBake 25 to 30 minutes in the preheated oven, until a toothpick inserted in the center comes out clean.\n",
        "picture_link": "Iky1UbSCet8EdxU4vOTFEt0d6YvsqMm"
    },
    {
        "title": "Maureen's Baked Beans",
        "ingredients": [
            "1 (15 ounce) can green beans, drained ADVERTISEMENT",
            "1 (14.5 ounce) can wax beans, drained ADVERTISEMENT",
            "1 (15.5 ounce) can butter beans, drained ADVERTISEMENT",
            "1 (15 ounce) can kidney beans, drained ADVERTISEMENT",
            "1 (16 ounce) can baked beans with pork ADVERTISEMENT",
            "1 tablespoon mustard powder ADVERTISEMENT",
            "3/4 cup packed brown sugar ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "1 (10.75 ounce) can condensed tomato soup ADVERTISEMENT",
            "1 (16 ounce) package ground pork breakfast sausage ADVERTISEMENT",
            "2 medium onions, chopped ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 300 degrees F (150 degrees C).\nIn a small roaster or Dutch oven, mix together the green beans, wax beans, butter beans, kidney beans, and baked beans. Mix in the dry mustard, brown sugar, chili powder, Worcestershire sauce, tomato sauce, and tomato soup.\nHeat a large skillet over medium-high heat. Brown the pork sausage, crumble, and drain the excess fat from the pan. Saute the onion and garlic with the pork until tender, about 5 minutes. Stir the pork mixture into the bean mixture.\nBake, covered, for 3 to 5 hours in the preheated oven, removing the lid for the final 45 minutes.\n",
        "picture_link": "wkTpAZQRAcdX51yTNbFnYXarjVjPLgy"
    },
    {
        "title": "Mom's Gourmet Grilled Cheese Sandwich",
        "ingredients": [
            "2 slices sourdough bread ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 tablespoon grated Parmesan cheese ADVERTISEMENT",
            "1 slice American cheese ADVERTISEMENT",
            "1 slice Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a skillet over medium heat. Butter one side of each slice of bread. Sprinkle Parmesan cheese onto the buttered sides. Place one slice buttered side down in the skillet, and place a slice of American cheese and a slice of Cheddar cheese on it. Top with the remaining slice of bread, butter side up. Fry until golden on each side.\n",
        "picture_link": "I9X2ebYB9EIBsuPZmKQes83OJKSF4SG"
    },
    {
        "title": "Vegetable Lovers' Fried Rice",
        "ingredients": [
            "1 1/2 cups uncooked long-grain white rice ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "2 tablespoons vegetable oil, divided ADVERTISEMENT",
            "1/3 cup chopped onion ADVERTISEMENT",
            "1 clove garlic, peeled and minced ADVERTISEMENT",
            "5 eggs, beaten ADVERTISEMENT",
            "1/4 cup soy sauce, divided ADVERTISEMENT",
            "2 stalks celery, thinly sliced ADVERTISEMENT",
            "4 ounces mushrooms, sliced ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 (8 ounce) can bamboo shoots, drained ADVERTISEMENT",
            "2 carrots, shredded ADVERTISEMENT",
            "3/4 cup snow peas ADVERTISEMENT",
            "3 green onions, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place rice and water in a medium saucepan, and bring to a boil. Reduce heat, cover, and simmer 20 minutes, or until rice is tender. Transfer to a medium container, and place in the refrigerator 1 hour, or until chilled.\nHeat 1 tablespoon oil in a medium skillet over medium heat. Stir in the onion and garlic, and cook until tender.\nIn a medium bowl, blend eggs and 1 tablespoon soy sauce. Stir into the medium skillet, and cook until no longer runny. Remove onion, garlic, and eggs from heat, and set aside. Chop any large egg chunks into small pieces.\nHeat the remaining oil in a large, heavy skillet over medium heat. Stir in the celery, mushrooms, and green pepper. Cook until tender but firm. Stir in rice, bamboo shoots, carrots, and snow peas. Season with remaining soy sauce. Cook and stir 5 minutes, or until rice is heated through. Mix in the onion, garlic, and eggs.\n",
        "picture_link": "zndTOfoI5AI9V35FANlDPfGJBII3rV6"
    },
    {
        "title": "No Bake Lime Mousse Torte",
        "ingredients": [
            "2 cups gingersnap cookie crumbs ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "5 tablespoons melted butter ADVERTISEMENT",
            "1 (.25 ounce) envelope unflavored gelatin ADVERTISEMENT",
            "2/3 cup lime juice ADVERTISEMENT",
            "2 1/2 cups heavy cream, divided ADVERTISEMENT",
            "9 ounces white chocolate, chopped ADVERTISEMENT",
            "3 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 tablespoons grated lime zest ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine cookie crumbs and sugar in a large bowl. Pour in melted butter, and mix thoroughly. Press into the bottom and one inch up the sides of a 10-inch springform pan.\nSprinkle the gelatin over the lime juice in a small bowl, and set aside to soften. Bring 1/2 cup of whipping cream to a simmer in a heavy pan. Remove from heat, and pour over the chopped white chocolate. Let soften for two minutes, then whisk until smooth. Mix the gelatin into the warmed chocolate until melted; set aside to cool to room temperature. Beat remaining 2 cups of cream to stiff peaks in a large bowl, and set aside.\nBeat the cream cheese with the sugar with an electric mixer until well blended. Slowly blend white chocolate mixture into cream cheese, then mix in lime zest. Fold the whipped cream into the cream cheese mixture, and pour into prepared crust. Cover pan with plastic wrap, and refrigerate overnight.\n",
        "picture_link": "1KGVQsS37YtC2oo4pn/nbxyahOyRqqK"
    },
    {
        "title": "Granny's Ice Cream",
        "ingredients": [
            "4 egg whites ADVERTISEMENT",
            "2/3 cup sour cream ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "vanilla ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large glass or metal mixing bowl, beat egg whites until foamy. Gradually add white sugar and vanilla, continuing to beat until soft peaks form. Carefully fold in sour cream until well blended. Fold in any additional flavorings or goodies at this time.\nPlace the mixture into the freezer and stir every 30 minutes or so until frozen. This can be made without stirring, but the texture will be icy rather than creamy. If you have an ice cream maker, you can put the ice cream mixture in the maker, and follow the manufacturer's instructions.\n",
        "picture_link": "Hl1UfgqueFH/6cOUcmMtl0/x0y1OYlO"
    },
    {
        "title": "Angel's Ravioli Alfredo with Mushrooms",
        "ingredients": [
            "1 (20 ounce) package cheese ravioli ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1 (8 ounce) package fresh mushrooms, sliced ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 (10 ounce) container Alfredo sauce ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "2 green onions, finely chopped ADVERTISEMENT",
            "1/4 teaspoon crushed red pepper flakes to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of water to a boil. Add ravioli and cook for 5 to 8 minutes or until al dente; drain.\nHeat the butter in a skillet over medium heat. Stir in the mushrooms and garlic, and cook until tender.\nIn a medium saucepan over low heat, toss the cooked ravioli with the Alfredo sauce to coat. Mix in the mushrooms and garlic. Cook and stir until sauce is heated. Top with Parmesan cheese, green onion, and red pepper to serve.\n",
        "picture_link": "tP5UoHRMXY7lNDCqBp1Pwm/.5vsHkzy"
    },
    {
        "title": "Applesauce Sandwich",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "2 slices bread ADVERTISEMENT",
            "3 tablespoons applesauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a skillet over low heat. Spread butter on one side of each slice of bread. Place bread slices, buttered side down, in skillet. Divide applesauce onto both slices of bread, and spread to the edges.\nCook until lightly browned, about 5 minutes. Fold slices together, and cool 5 minutes. Cut into quarters.\n",
        "picture_link": "kbQavopNcRrK.ALnyfEb0shZvgZmYaS"
    },
    {
        "title": "Banana and Strawberry Smoothie",
        "ingredients": [
            "1 banana ADVERTISEMENT",
            "5 strawberries, hulled ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 cup cold milk ADVERTISEMENT",
            "1 drop red food coloring (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the banana, strawberries, cinnamon, milk, and food coloring in a blender; blend until smooth; serve immediately.\n",
        "picture_link": "LYt5CuOBIuSGjn0E3Qx.lNdhq3gAoOC"
    },
    {
        "title": "Hamantashen",
        "ingredients": [
            "1 1/2 cups butter or margarine, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "6 tablespoons orange juice ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "4 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 (12 ounce) can poppyseed filling ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, cream together the butter and sugar until smooth. Beat in the eggs one at a time, then stir in the orange juice and vanilla. Mix in the baking powder, then gradually stir in the flour until the dough forms a ball. Cover and refrigerate at least 2 hours. I like to do mine overnight.\nPreheat the oven to 375 degrees F (190 degrees C). Grease cookie sheets.\nOn a lightly floured surface, roll the dough out to 1/4 inch thickness. Cut into 3 inch circles using a cookie cutter or drinking glass. Place circles on the prepared cookie sheets. Spoon 1 teaspoon of filling onto the center of each circle. (Any more and it will ooze out) Pinch the sides of each circle to form a triangle, covering as much of the filling as possible. The cookies may be frozen on the cookie sheets if desired to help retain their shape while cooking.\nBake for 8 to 10 minutes in the preheated oven, until light golden brown. These are best undercooked slightly. Cool on the baking sheet for a few minutes before removing to wire racks to cool completely.\n",
        "picture_link": "qXbBVmmnDakgvBLbI6Iic7hMT9d7TvS"
    },
    {
        "title": "Shrimp Red Thai Curry",
        "ingredients": [
            "2 (14 ounce) cans coconut milk ADVERTISEMENT",
            "2 tablespoons red Thai curry paste ADVERTISEMENT",
            "1 tablespoon fish sauce ADVERTISEMENT",
            "1 fresh red chili pepper, seeded and minced ADVERTISEMENT",
            "24 large shrimp, peeled and deveined ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a wok, combine coconut milk, curry paste, fish sauce, and minced pepper. Slowly bring to a simmer over medium low heat, stirring frequently.\nReduce heat to low, and add shrimp. Cook uncovered, stirring frequently, until prawns are cooked and flavors mellow, about 15 minutes.\n",
        "picture_link": "ZFPzgikqAK7LsGK6qSRM6bcwUOcJ4Z6"
    },
    {
        "title": "Hot Sweet Onion Dip",
        "ingredients": [
            "2 cups chopped sweet onions ADVERTISEMENT",
            "2 cups mayonnaise ADVERTISEMENT",
            "2 cups shredded Swiss cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease an 8x8 inch baking dish.\nIn a medium bowl, mix together sweet onions, mayonnaise and Swiss cheese.\nTransfer mixture to the baking dish. Bake in the preheated oven 20 to 30 minutes, or until bubbly and lightly browned. Cool before serving.\n",
        "picture_link": "egQv/gY2LPPg4KJXuYORpr30eAG/gN2"
    },
    {
        "title": "Bean Salad",
        "ingredients": [
            "1 (14.5 ounce) can black beans ADVERTISEMENT",
            "1 (14.5 ounce) can dark red kidney beans ADVERTISEMENT",
            "1 (15 ounce) can garbanzo beans ADVERTISEMENT",
            "1 (14.5 ounce) can pinto beans ADVERTISEMENT",
            "1 (10 ounce) package frozen corn kernels, thawed ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 teaspoon cumin ADVERTISEMENT",
            "2 tablespoons chili powder ADVERTISEMENT",
            "1 teaspoon lime juice ADVERTISEMENT",
            "1 (8 ounce) jar chunky salsa ADVERTISEMENT",
            "1 pinch dried parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour beans into a colander, and rinse under running water.\nIn a large mixing bowl, toss beans and corn together with oil, cumin, chili powder, lime juice, and salsa. Sprinkle with parsley, cover, and chill.\n",
        "picture_link": "gDER8DlvCnDiH8eJ1EvtObZZD5gOs.2"
    },
    {
        "title": "Carne Con Papas",
        "ingredients": [
            "1/2 green bell pepper, seeded and chopped ADVERTISEMENT",
            "1/2 small white onion, chopped ADVERTISEMENT",
            "3 cloves garlic, crushed ADVERTISEMENT",
            "1/4 teaspoon ground cumin ADVERTISEMENT",
            "1/4 teaspoon salt, divided ADVERTISEMENT",
            "1/8 cup olive oil ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 tablespoons achiote powder ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "2 (8 ounce) cans tomato sauce ADVERTISEMENT",
            "2 pounds beef stew meat, cut into 1 inch cubes ADVERTISEMENT",
            "2 white potatoes ADVERTISEMENT",
            "1 cup white wine ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "6 cubes beef bouillon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender, combine green pepper, onion, garlic, 1/4 teaspoon cumin and salt. Pulse, while pouring 1/8 cup olive oil through top of blender. Blend until smooth; set aside.\nHeat 1 tablespoon olive oil in pressure cooker on medium heat. Saute green pepper mixture for 1 minute, then stir in achiote powder and 1 teaspoon cumin. Cook for 1 minute, then stir in tomato sauce. Return to a simmer, then add beef; let simmer for 5 minutes. Stir in potatoes, then pour in wine and water. Drop in the bouillon cubes. Bring to a boil, and cook for 1 minute; add water, if necessary, to cover.\nCover with lid of pressure cooker. Following manufacturer's directions, cook under 15 pound pressure for about 30 to 45 minutes.\n",
        "picture_link": "ClbhRyIWoy2wBhj9PdpQazb2UGUaMS6"
    },
    {
        "title": "Hedgehogs",
        "ingredients": [
            "2 1/4 pounds ground beef ADVERTISEMENT",
            "3/4 cup uncooked long-grain white rice ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 (26 ounce) can condensed tomato soup ADVERTISEMENT",
            "26 fluid ounces water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine the beef, rice and egg beat. Mix well with hands, making mixture into medium sized meatballs. Set aside.\nPour soup into a large saucepan, and dilute with 1 can of water. Heat to simmering over medium heat.\nLower heat to low, drop meatballs into soup and simmer for 20 to 30 minutes.\n",
        "picture_link": "QMN1g91G86aLbxjPfhmmMmy6JebCeLu"
    },
    {
        "title": "Stromboli",
        "ingredients": [
            "2 (16 ounce) packages refrigerated pizza crust dough ADVERTISEMENT",
            "1 (28 ounce) jar spaghetti sauce ADVERTISEMENT",
            "1/4 pound cooked ham, sliced ADVERTISEMENT",
            "1/4 pound Capacola sausage, sliced ADVERTISEMENT",
            "1/4 pound salami, sliced ADVERTISEMENT",
            "1/4 pound pepperoni sausage, sliced ADVERTISEMENT",
            "garlic powder to taste ADVERTISEMENT",
            "1/4 pound mozzarella cheese, shredded ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "6 mushrooms, sliced ADVERTISEMENT",
            "1 green bell pepper, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Let dough rise according to package instructions, then punch down, and divide into 4 pieces.\nOn a floured surface, roll each piece of dough into a long oval shape. Spread each with sauce, then layer with ham, capacola, salami, and pepperoni. Sprinkle with garlic powder, then top with mozzarella, onion, mushrooms and bell pepper. Bring the long sides together over the center, and pinch together to seal. Turn over, so that the seam is on the bottom, and place on an ungreased baking sheet. With a sharp knife, cut 3 diagonal slices to allow the steam to escape.\nBake in preheated oven for 20 to 30 minutes, or until golden brown.\n",
        "picture_link": "/Sx8I9kgZlTSDBJJ1T13sYVDdXbxug2"
    },
    {
        "title": "Amy's Lavender Lemonade",
        "ingredients": [
            "1 tray ice cubes ADVERTISEMENT",
            "1/4 cup dried lavender ADVERTISEMENT",
            "2 cups boiling water ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "8 lemons ADVERTISEMENT",
            "5 cups cold water, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ice cubes into a 2 quart pitcher. Place the lavender into a bowl, and pour boiling water over it. Allow to steep for about 10 minutes, then strain out the lavender and discard. Mix the sugar into the hot lavender water, then pour into the pitcher with the ice.\nSqueeze the juice from the lemons into the pitcher, getting as much juice as you can. Top off the pitcher with cold water, and stir. Taste, and adjust lemon juice or sugar if desired. Pour into tall glasses, pull up a lawn chair and a good book, and relax!\n",
        "picture_link": "qJGJZ4eCal9z.9kXuZIPMcTZFwT2Grm"
    },
    {
        "title": "Vietnamese Salad Rolls",
        "ingredients": [
            "1 (8 ounce) package rice vermicelli ADVERTISEMENT",
            "8 ounces cooked, peeled shrimp, cut in half lengthwise ADVERTISEMENT",
            "8 rice wrappers (6.5 inch diameter) ADVERTISEMENT",
            "1 carrot, julienned ADVERTISEMENT",
            "1 cup shredded lettuce ADVERTISEMENT",
            "1/4 cup chopped fresh basil ADVERTISEMENT",
            "1/2 cup hoisin sauce ADVERTISEMENT",
            "water as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a medium saucepan of water to boil. Remove from heat. Place rice vermicelli in boiling water, remove from heat, and let soak 3 to 5 minutes, until soft. Drain, and rinse with cold water.\nFill a large bowl with hot water. Dip one rice wrapper in the hot water for 1 second to soften. Lay wrapper flat, and place desired amounts of noodles, shrimp, carrot, lettuce and basil in the center. Roll the edges of the wrapper slightly inward. Beginning at the bottom edge of wrapper, tightly wrap the ingredients. Repeat with remaining ingredients.\nIn a small bowl, mix the hoisin sauce with water until desired consistency has been attained. Heat the mixture for a few seconds in the microwave.\nServe the spring rolls with the warm dipping sauce.\n",
        "picture_link": "kwjTn9lb7o.oMJdF7xaXRINnu0ULxNO"
    },
    {
        "title": "Tiger Butter",
        "ingredients": [
            "1 pound white chocolate, chopped ADVERTISEMENT",
            "1/4 cup semisweet chocolate chips ADVERTISEMENT",
            "1/3 cup crunchy peanut butter ADVERTISEMENT",
            "1/2 cup crispy rice cereal ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line a 9x9 inch dish with waxed paper.\nCombine white chocolate, chocolate chips and peanut butter in a 2 quart microwave safe dish and microwave on low one minute. Stir until smooth. Stir in the rice cereal and spread into prepared pan. Let cool completely before cutting into squares.\n",
        "picture_link": "TEsZzZh4BAF7O9G1Tytsf4cPkA3Ys/K"
    },
    {
        "title": "Easy Vegetarian Spinach Lasagna",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "9 lasagna noodles ADVERTISEMENT",
            "1 bunch fresh spinach ADVERTISEMENT",
            "1 (8 ounce) container ricotta cheese ADVERTISEMENT",
            "1/2 cup shredded mozzarella cheese ADVERTISEMENT",
            "1 egg, lightly beaten ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "1 pinch dried basil ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 cup pasta sauce ADVERTISEMENT",
            "1/2 cup shredded mozzarella cheese ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Spray a 1 1/2-quart casserole dish with cooking spray.\nBring a large pot of lightly salted water to a boil. Cook lasagna in the boiling water, stirring occasionally, until cooked through but firm to the bite, about 8 minutes. Drain.\nPlace a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add spinach, cover, and steam until tender, 2 to 6 minutes. Drain spinach.\nMix spinach, ricotta cheese, 1/2 cup mozzarella cheese, egg, nutmeg, basil, salt, and black pepper in a bowl until thoroughly combined.\nSpread 1/4 cup pasta sauce on the bottom of the prepared casserole dish; top with 3 lasagna noodles, 1/2 of the ricotta mixture, and 1/4 cup pasta sauce. Repeat layers of 3 more noodles, 1/2 cup ricotta mixture, and 1/4 cup pasta sauce. End with remaining 3 lasagna noodles and 1/4 cup pasta sauce. Sprinkle 1/2 cup mozzarella cheese and Parmesan cheese on top. Cover casserole with aluminum foil.\nBake in the preheated oven for 25 minutes. Uncover casserole and continue baking until lasagna is bubbling and lightly browned, about 25 more minutes. Let lasagna stand 5 minutes before serving.\n",
        "picture_link": "XmSSTnugrXE8ijLk8hLgBxruo98GjLK"
    },
    {
        "title": "Potato Potluck Dish",
        "ingredients": [
            "2 pounds potatoes, diced ADVERTISEMENT",
            "2 teaspoons onion powder ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "2 cups sour cream ADVERTISEMENT",
            "2 1/2 cups condensed cream of mushroom soup ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "2/3 cup shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large saucepan of salted water to a boil. Place potatoes in the saucepan and cook until tender but firm, about 15 minutes. Drain and cool.\nPreheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking dish.\nIn a large bowl, mix the potatoes, onion powder, minced garlic, sour cream, cream of mushroom soup and Cheddar cheese. Pour into the baking dish. Sprinkle with mozzarella cheese.\nBake in the preheated oven 45 minutes, or until browned and bubbly.\n",
        "picture_link": "OlFXoA6.ghe0m/T.qgYTWmfffyQU5kG"
    },
    {
        "title": "Savory Sweet Potato Fries",
        "ingredients": [
            "2 large sweet potatoes, peeled and cut into French fry-size pieces ADVERTISEMENT",
            "1 tablespoon olive oil, or as needed ADVERTISEMENT",
            "2 tablespoons minced fresh rosemary, or to taste ADVERTISEMENT",
            "coarse sea salt and coarsely ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nToss sweet potatoes, olive oil, rosemary, salt, and pepper together in a large bowl until evenly coated. Arrange sweet potatoes on a baking sheet.\nBake in the preheated oven until tender, 20 to 30 minutes.\n",
        "picture_link": "mp7w2n7k7uDXN7kcO9d6jsWSKpSAaUe"
    },
    {
        "title": "Forgotten Cookies II",
        "ingredients": [
            "2 egg whites ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "1 cup salted peanuts (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line cookie sheets with parchment paper or aluminum foil.\nIn a large glass or metal mixing bowl, beat egg whites and salt until foamy. Gradually add sugar, continuing to beat until whites form stiff peaks. Fold in the vanilla and chocolate chips. Add peanuts if desired. Spoon onto the prepared cookie sheets.\nPlace the cookies into the preheated oven, shut the door and turn off the oven immediately. Let cookies sit in the turned off oven for 5 to 6 hours or overnight.\n",
        "picture_link": "B3tTUQ.QDUvEwdYiDVus8HDwrHPvhB."
    },
    {
        "title": "Lemon Ice I",
        "ingredients": [
            "1 lemon, juiced and zested ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "4 cups milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, stir together lemon juice and zest with sugar until smooth. Stir in milk. Pour into a 9x9 inch dish and place in freezer, stirring once when it begins to harden, until firm, 2 hours. Or pour into the freezer canister of an ice cream maker and freeze according to manufacturers' directions.\n",
        "picture_link": "CZuHtDSPRl/TwQNyZmGBzt.QfkL/5AO"
    },
    {
        "title": "Cheesy Ham and Asparagus Bake",
        "ingredients": [
            "1 1/2 cups chopped cooked ham ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1/4 cup chopped red bell peppers ADVERTISEMENT",
            "1 (10 ounce) package frozen cut asparagus, thawed ADVERTISEMENT",
            "8 eggs ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "3/4 teaspoon dried tarragon ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Lightly grease a 9x13 inch baking dish.\nMix the ham, onion, red bell peppers, and asparagus in the prepared baking dish. In a large bowl, beat together the eggs, milk, flour, Parmesan, tarragon, salt, and pepper. Pour over the ham mixture.\nBake 20 minutes in the preheated oven, or until a knife inserted in the center comes out clean. Sprinkle with Cheddar cheese. Continue baking 3 to 5 minutes, or until cheese is melted. Let stand 5 to 10 minutes before serving.\n",
        "picture_link": "Qo3DDtHFCNkj.S3AbNzYfWBS3nMRGRy"
    },
    {
        "title": "Easy Baked Chicken Thighs",
        "ingredients": [
            "4 chicken thighs ADVERTISEMENT",
            "4 teaspoons garlic powder ADVERTISEMENT",
            "4 teaspoons onion flakes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nPlace thighs in a baking dish. Season chicken thighs on all sides with garlic powder and onion flakes.\nBake chicken in the preheated oven until no longer pink at the bone and the juices run clear, about 30 minutes. An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 165 degrees F (74 degrees C).\n",
        "picture_link": "Z7Vo77HS7FHShEkxa55I0SKliWpGbT6"
    },
    {
        "title": "Pasta and Beans",
        "ingredients": [
            "1 1/2 tablespoons extra virgin olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 tomatoes, chopped ADVERTISEMENT",
            "1 (15 ounce) can cannellini beans ADVERTISEMENT",
            "2 cups penne pasta ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium size saucepan heat the olive oil. Saute onion until tender. Stir in tomatoes and entire can of beans. Let simmer for 10 minutes.\nBring a large pot of lightly salted water to a boil. Add penne pasta and cook for 8 to 10 minutes or until al dente; drain.\nMix pasta with bean mixture and salt as desired.\n",
        "picture_link": "AP2pV/z1LFzIDjFU1zFO/1Yvv/Q2bMO"
    },
    {
        "title": "Strawberry Cream Cheese French Toast",
        "ingredients": [
            "12 slices home-style white bread, cut into 1-inch cubes, divided ADVERTISEMENT",
            "2 (8 ounce) packages cold cream cheese, cut into 1-inch cubes ADVERTISEMENT",
            "1 1/2 cups sliced fresh strawberries ADVERTISEMENT",
            "2 cups half-and-half ADVERTISEMENT",
            "12 large eggs ADVERTISEMENT",
            "1/3 cup pure maple syrup ADVERTISEMENT",
            "Sauce: ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "1 cup sliced fresh strawberries ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Generously grease a 9x13-inch baking dish.\nArrange half the bread cubes in the prepared baking dish. Evenly distribute cream cheese cubes over the bread cube layer; sprinkle 1 1/2 cups sliced strawberries atop cream cheese layer. Layer the remaining bread cubes over strawberry layer.\nPour half-and-half into a blender; pulse for a few seconds. Blend eggs into half-and-half until fully incorporated. Add maple syrup and blend until smooth. Pour mixture evenly over bread mixture. Cover the baking dish with aluminum foil and refrigerate 8 hours or overnight.\nRemove baking dish from refrigerator 45 minutes before baking.\nPreheat oven to 350 degrees F (175 degrees C).\nBake the covered casserole in the preheated oven for 30 minutes. Remove aluminum foil and continue baking until French toast is puffed and golden brown, about 30 more minutes.\nStir sugar, water, and cornstarch together in a small saucepan. Cook, stirring occasionally, over medium heat until mixture has thickened, about 5 minutes. Mix 1 cup sliced strawberries into the sugar mixture; cook and stir until strawberries are softened, about 10 minutes. Add butter and stir sauce until butter is melted.\n",
        "picture_link": "ZHeUYt1A4NQCE3K0v73YXZcvkhwzEGe"
    },
    {
        "title": "Asparagus Mushroom Bacon Crustless Quiche",
        "ingredients": [
            "6 ounces bacon, diced ADVERTISEMENT",
            "1/2 pound asparagus, cut into 1-inch pieces ADVERTISEMENT",
            "4 ounces baby bella (cremini) mushrooms, sliced ADVERTISEMENT",
            "4 ounces shredded Swiss cheese ADVERTISEMENT",
            "1 1/2 cups heavy whipping cream ADVERTISEMENT",
            "4 large eggs ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Position oven rack to center position. Preheat oven to 400 degrees F (200 degrees C). Butter a 10-inch pie plate.\nHeat a large skillet over medium heat; cook and stir bacon in the hot skillet until crisp, 5 to 10 minutes. Remove bacon and drain all but 2 tablespoons grease from skillet. Cook and stir asparagus and mushrooms in the remaining bacon grease until asparagus is tender, about 5 minutes.\nRemove skillet from heat and toss bacon into asparagus mixture. Spread asparagus-bacon mixture into the prepared pie pan. Sprinkle Swiss cheese over mixture.\nWhisk cream, eggs, salt, and pepper in a bowl. Pour egg mixture over asparagus-cheese mixture.\nBake in the preheated oven until quiche is set and a knife inserted in the center comes out clean, about 30 minutes.\n",
        "picture_link": "KnAqVIZUcr11VyttLPdMinGHXuP.RGC"
    },
    {
        "title": "Creamy Chicken Gnocchi Soup",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "1 large zucchini, diced ADVERTISEMENT",
            "2 stalks celery, diced ADVERTISEMENT",
            "1 yellow onion, diced ADVERTISEMENT",
            "1/2 red bell pepper, diced ADVERTISEMENT",
            "2 carrots, shredded ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "3 cups chicken broth, or more as needed ADVERTISEMENT",
            "1 cup half-and-half ADVERTISEMENT",
            "1 pint fat-free half-and-half ADVERTISEMENT",
            "2 cups shredded rotisserie chicken meat ADVERTISEMENT",
            "1 (16 ounce) package small gnocchi ADVERTISEMENT",
            "2 cups torn fresh spinach ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 teaspoon ground thyme ADVERTISEMENT",
            "1/4 teaspoon freshly grated nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter with olive oil in a large soup pot over medium heat. Cook and stir zucchini, celery, onion, red bell pepper, carrots, and garlic in the hot butter and oil until vegetables are soft, 8 to 10 minutes. Stir flour into mixture, coating vegetables; cook 2 more minutes.\nStir chicken broth into vegetables, stirring until flour paste combines with broth and soup is thick and smooth, about 5 minutes. Pour in both kinds of half-and-half; bring to a simmer. Cook until slightly thickened, about 5 more minutes. Gently fold chicken, gnocchi, and spinach into soup. Season with salt, black pepper, thyme, and nutmeg. Adjust thickness by adding more chicken broth, if desired.\n",
        "picture_link": "SVdea28nwd4QZ1xkb/4oIihL/4swcH6"
    },
    {
        "title": "Tomato Spinach and Bean Burrito",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 cup diced onion ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons chili powder, or to taste ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "4 cups chopped fresh tomatoes ADVERTISEMENT",
            "1 (15 ounce) can kidney beans, drained and rinsed ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped spinach, thawed and drained ADVERTISEMENT",
            "4 (10 inch) flour tortillas ADVERTISEMENT",
            "1 ripe avocado, sliced ADVERTISEMENT",
            "4 tablespoons sour cream ADVERTISEMENT",
            "4 tablespoons salsa ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large skillet on medium-high heat. Saute onion and garlic for 5 minutes. Stir in chili powder and cumin, and cook 1 minute. Stir in water, tomato, kidney beans and salt. Bring to a boil, then reduce heat and simmer for 20 minutes.\nStir in spinach and cook 5 minutes more. Spoon 1/4 of the bean mixture into the middle of a warm tortilla. Wrap and garnish with avocado, sour cream and salsa.\n",
        "picture_link": "BLmWj2gfXfkNYSfzGcsckAHT9yc8tPC"
    },
    {
        "title": "No Bake Peanut Butter Bars",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "2 cups creamy peanut butter ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "3 cups crispy rice cereal ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Butter a 9x13 inch baking dish. In a medium bowl, stir together the butter, peanut butter and confectioners' sugar until well blended. Mix in the rice cereal so that it is evenly distributed. Press the mixture into the prepared pan.\nIn the microwave or over a double boiler, melt chocolate chips, stirring occasionally until smooth. Spread the melted chocolate evenly over the peanut butter bars. Refrigerate until set before cutting into bars.\n",
        "picture_link": "udvC6ldDQFlz0DDjv73RjQYqIsz6QhG"
    },
    {
        "title": "Pecan French Toast",
        "ingredients": [
            "4 eggs ADVERTISEMENT",
            "2/3 cup orange juice ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/4 teaspoon nutmeg ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 (1 pound) loaf Italian bread, cut into 1 inch slices ADVERTISEMENT",
            "1/3 cup butter, melted ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "2 tablespoons grated orange zest ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, beat together eggs, orange juice, milk, sugar, nutmeg and vanilla extract. Place bread slices in a tightly spaced single layer in the bottom of a flat dish or baking pan. Pour milk mixture over bread, cover and refrigerate overnight, turning once.\nWhen ready to cook, preheat oven to 350 degrees F (175 degrees C).\nCoat a jelly roll pan or rimmed baking sheet evenly with the melted butter. Arrange soaked bread slices in a single layer on pan. Sprinkle evenly with orange peel and pecans.\nBake in preheated oven until golden, 20 to 25 minutes. Check slices during last 10 minutes of baking time to avoid burning.\n",
        "picture_link": "1ILbnUnzhzjXAGPTqJtr3V9y6YqfjyK"
    },
    {
        "title": "Lemon Basil Grilled Chicken",
        "ingredients": [
            "6 (4 ounce) boneless, skinless chicken breasts, trimmed of excess fat ADVERTISEMENT",
            "1 teaspoon freshly grated lemon peel ADVERTISEMENT",
            "1/4 cup fresh lemon juice ADVERTISEMENT",
            "2 teaspoons minced fresh garlic ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 tablespoons Mazola® Corn Oil ADVERTISEMENT",
            "1/2 cup loosely packed fresh basil leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Lightly pound chicken to an even 3/4-inch thickness. Pat chicken dry using paper towels and place in a large resealable plastic bag.\nCombine lemon peel, lemon juice, garlic, salt, oil and basil in a blender or food processor. Pulse for 30 seconds or until well blended.\nPour the marinade over the chicken, seal the bag and turn to coat chicken thoroughly. Marinate in the refrigerator for at least 15 minutes to overnight.\nPreheat grill to medium-high heat or about 400 degrees F.\nRemove chicken from marinade and discard marinade.\nGrill for 4 to 6 minutes per side or until cooked through.\nTransfer to serving plate and garnish with additional basil, if desired.\n",
        "picture_link": "tNpqioDozutYp.ifyjHyhIRg9/6rzhq"
    },
    {
        "title": "Bread Pudding with Whiskey Sauce",
        "ingredients": [
            "2 eggs, beaten ADVERTISEMENT",
            "3 tablespoons butter, melted ADVERTISEMENT",
            "2 tablespoons vanilla extract ADVERTISEMENT",
            "2 1/2 cups milk ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 (1 pound) loaf French bread, cut into 1 inch cubes ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "1/4 cup whiskey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Lightly grease a 9x13 inch pan.\nIn a large bowl, stir together eggs, butter, vanilla and milk. Gradually add 1/4 cup sugar and mix thoroughly until sugar is dissolved.\nPlace bread cubes in bottom of prepared pan. Pour liquid over bread, fully saturating all bread. Sprinkle pecans on top.\nBake in preheated oven for 60 minutes, until golden. Meanwhile, combine 1/2 cup white sugar, 1/2 cup butter, cream and whiskey in a small saucepan. Warm over low heat, stirring constantly, until sauce is gently boiling. Pour sauce over baked bread pudding and serve.\n",
        "picture_link": "AXlZGscInENgQl1RPWTzCuVL0PMe7IS"
    },
    {
        "title": "Pretzel Salad II",
        "ingredients": [
            "CRUST ADVERTISEMENT",
            "2 1/2 cups crushed pretzels ADVERTISEMENT",
            "3 tablespoons confectioners' sugar ADVERTISEMENT",
            "3/4 cup melted butter ADVERTISEMENT",
            "FILLING ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "1 cup frozen whipped topping, thawed ADVERTISEMENT",
            "TOPPING ADVERTISEMENT",
            "1 (6 ounce) package strawberry flavored Jell-O® mix ADVERTISEMENT",
            "1 1/2 cups boiling water ADVERTISEMENT",
            "1 (16 ounce) package frozen strawberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn a medium bowl combine crushed pretzels, 3 tablespoons confectioner's (powdered) sugar and melted butter. Mix well and press into a 9 x 13 inch casserole dish.\nBake in preheated oven for 10 minutes. Cool.\nTo make the filling, combine in a medium bowl the cream cheese and 1 cup confectioner's (powdered) sugar; beat until smooth. Stir in whipped topping; spread mixture in crust and refrigerate.\nMeanwhile, combine gelatin mix and boiling water; add strawberries. Let gelatin mixture thicken slightly, and then pour over the crust and filling layers. Refrigerate for 4 hours.\n",
        "picture_link": "ZgFdK8PGXYDGpRk6OLXFwcEY11Y25xK"
    },
    {
        "title": "All Natural Strawberry Lemonade",
        "ingredients": [
            "8 large strawberries, halved ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "7 cups water, divided ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 cups freshly squeezed lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place strawberries in a blender; top with 2 tablespoons sugar. Pour 1 cup water over sugared strawberries. Blend until strawberry chunks transform into juice.\nCombine strawberry juice, 6 cups water, 1 cup sugar, and lemon juice in a large pitcher; stir until blended. Chill before serving.\n",
        "picture_link": "ARlfPMfVboTnBNUDydSV3O73AWawDQ."
    },
    {
        "title": "Easy Kielbasa Skillet Dinner",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "1 (16 ounce) package kielbasa sausage, sliced ADVERTISEMENT",
            "1/2 head broccoli, cut into florets ADVERTISEMENT",
            "3 potatoes, peeled and sliced ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spray a large skillet with cooking spray and heat over medium-low heat. Cook and stir onion in the hot skillet until translucent, about 5 minutes. Add kielbasa; fry until sausage is lightly browned, stirring occasionally, about 5 minutes more.\nStir broccoli and potatoes into sausage mixture; season with salt and pepper. Cook, without stirring, until broccoli begins to soften, about 15 minutes. Stir mixture and continue to cook until vegetables are completely tender, 10 to 15 minutes more.\n",
        "picture_link": "XgAvejEhuK9WU2sIPHDdCBpkh04J9jK"
    },
    {
        "title": "Peach Whirligigs",
        "ingredients": [
            "5 large fresh peaches - peeled, pitted, and sliced ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "1 1/3 cups buttermilk baking mix ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "2 tablespoons margarine, melted ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "2 tablespoons margarine, softened ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nIn large saucepan over medium heat, combine peaches, water, 1 1/2 cups sugar and cornstarch. Cook, stirring constantly, until mixture boils. Boil for one minute, then reduce heat to low to keep warm.\nIn a large bowl, stir together baking mix, 2 tablespoons sugar, melted margarine and milk to form a soft dough. Remove to floured surface and knead 8 to 10 times. Roll out into a 9 inch square.\nSpread softened margarine over dough. Combine 1/4 cup sugar with cinnamon, and sprinkle mixture over dough. Roll dough into a log shape and cut into 6 - 1 1/2 inch slices. Pour hot peach mixture into an 8x8 inch baking dish. Place roll slices, cut side up, on top of peach mixture.\nBake in preheated oven 20 to 25 minutes, until puffed and golden. Serve warm.\n",
        "picture_link": "MDSwOVENAFwRFzkbdieLyCEY598V4Wa"
    },
    {
        "title": "Aunt Kate's Green Beans in Tomatoes",
        "ingredients": [
            "2 cloves garlic, chopped ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 (14.25 ounce) can diced tomatoes with basil and oregano ADVERTISEMENT",
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "1 pound fresh green beans, trimmed and snapped ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan, saute garlic in oil over medium-low heat until garlic is slightly browned. Stir in diced tomatoes and tomato sauce, cover, and cook for 30 to 45 minutes.\nStir green beans into tomatoes, and cook until tender. Season with salt and pepper to taste.\n",
        "picture_link": "nikcvW1pCkJuAYYlPPkinNnVAlEbeui"
    },
    {
        "title": "Pork Chops German Style",
        "ingredients": [
            "4 center cut pork chops ADVERTISEMENT",
            "1/2 cup prepared mustard ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "1 (10.5 ounce) can condensed chicken and rice soup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare the pork chops by coating both sides of each one with mustard. Dredge the coated chops in flour. Heat the oil in a large skillet over medium-high heat. Place pork chops into the hot oil, and cook until browned on both sides. Remove from pan, and discard any excess oil in the pan.\nReturn the chops to the pan, and reduce heat to low. Pour undiluted soup over the chops, making sure to put an ample amount of rice on each one. Cover, and cook on low for 30 minutes, or until pork is no longer pink, and the juices run clear. Baste the chops occasionally, and add water if necessary.\n",
        "picture_link": "YCAutXGCjc4Ppm3h.NzENImqaUiLPJu"
    },
    {
        "title": "Portabella Nirvana",
        "ingredients": [
            "2 large portobello mushrooms ADVERTISEMENT",
            "1 (8 ounce) bottle Italian-style salad dressing ADVERTISEMENT",
            "1 tablespoon minced onion ADVERTISEMENT",
            "1 1/2 teaspoons minced garlic ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 stalk celery, diced ADVERTISEMENT",
            "1/2 cup crab meat, fresh or canned ADVERTISEMENT",
            "20 buttery round crackers, crushed ADVERTISEMENT",
            "2/3 cup Italian blend shredded cheese, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat your oven's broiler. Clean mushrooms, and remove stems, reserving them for later. Marinate the mushroom caps in Italian dressing for 15 minutes. Remove from marinade, and place into a baking dish.\nBroil at least 6 inches from heat for about 10 minutes. Check occasionally to make sure they do not burn. Turn off the broiler, and preheat the oven to 400 degrees F (200 degrees C).\nMelt butter in a skillet over medium-high heat. Chop reserved mushroom stems. Sautee onion, garlic, mushroom stems and celery until tender. Add the crabmeat, and heat until cooked through, about 5 minutes. Transfer the skillet mixture to a medium bowl, and mix in crackers, 1/3 cup of the cheese blend, and mix until well blended. Use some of the Italian dressing marinade to hold the mixture together if necessary. Pack the crab mixture into the cavities of the mushrooms. Season with salt and pepper to taste.\nBake for 10 minutes in the preheated oven. Remove from the oven, and sprinkle remaining cheese over the tops, then return to the oven for 3 minutes, or until cheese has melted.\n",
        "picture_link": "mdaSt3TbPVjEeWmZ5Swve6QsiQJy4n."
    },
    {
        "title": "Portobello Mushroom, Fresh Peppers and Goat Cheese Pizza",
        "ingredients": [
            "1 (10 ounce) can refrigerated pizza crust dough ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 red bell pepper, sliced ADVERTISEMENT",
            "1 yellow bell pepper, sliced ADVERTISEMENT",
            "2 portobello mushrooms, thinly sliced ADVERTISEMENT",
            "1 (6.5 ounce) jar marinated artichoke hearts, drained and chopped ADVERTISEMENT",
            "4 ounces goat cheese, crumbled ADVERTISEMENT",
            "3 tablespoons balsamic vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Grease a baking sheet, or round pizza pan.\nSpread pizza dough out evenly on the prepared pan. Drizzle with olive oil. Sprinkle the garlic over the crust. Arrange red and yellow bell peppers, mushrooms and artichoke hearts on top, then dot with pieces of goat cheese. Drizzle balsamic vinegar over the top.\nBake for 15 to 20 minutes in the preheated oven, until the edges are golden brown.\n",
        "picture_link": "VRSZOO.B0d6GIQb/zy3FeEC7dk6OjPy"
    },
    {
        "title": "Wonderful Chicken Curry Salad",
        "ingredients": [
            "5 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "3/4 cup chutney ADVERTISEMENT",
            "1 teaspoon curry powder ADVERTISEMENT",
            "1/4 teaspoon pepper ADVERTISEMENT",
            "2/3 cup chopped pecans ADVERTISEMENT",
            "1 cup seedless grapes, halved ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan, simmer chicken breasts in water for about 7 to 10 minutes, or until cooked through. Drain, cool, and tear into small pieces with a fork.\nIn a large bowl, combine mayonnaise, chutney, curry powder, and pepper. Stir in chicken, pecans, grapes, and onions. Chill.\n",
        "picture_link": "PFRc68XSGAkwUMs4/Vy9OHOh4fg.D5G"
    },
    {
        "title": "Crabmeat Quiche",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "2 tablespoons chopped green onion ADVERTISEMENT",
            "3 tablespoons chopped red bell pepper ADVERTISEMENT",
            "1 cup crabmeat, drained and flaked ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 tablespoons white wine ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "1 cup half-and-half cream ADVERTISEMENT",
            "1 (9 inch) pie shell, partially baked ADVERTISEMENT",
            "1/2 cup shredded Swiss cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nHeat butter in a large skillet over medium heat. Saute green onion and red bell pepper until soft. Stir in crabmeat, and season with salt and pepper. Add wine, and cook for 1 minute. Remove from heat, and allow to cool.\nIn a large bowl, beat eggs until light. Whisk in half-and-half, and crab mixture. Pour into pie crust, and sprinkle with Swiss cheese.\nBake in preheated oven for 25 to 30 minutes, or until puffed and golden brown.\n",
        "picture_link": "OAd0rFa0yEYb/bI6cYT8TTCKviONMya"
    },
    {
        "title": "Emily's Famous Chocolate Shortbread Cookies",
        "ingredients": [
            "2 cups confectioners' sugar ADVERTISEMENT",
            "1/2 cup Dutch process cocoa powder ADVERTISEMENT",
            "3 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups unsalted butter, chilled and cubed ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup chopped semisweet chocolate ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, stir together the confectioners' sugar, cocoa, flour and salt until well blended. Cut in the butter until lumps are no larger than peas. Add eggs and vanilla; mix until a stiff dough forms. It may take a minute to come together.\nOn a lightly floured surface, roll out dough to 1/4 inch thickness and cut into desired shapes using cookie cutters. If the dough is too sticky, chill for a little bit. Place cookies 2 inches apart onto an ungreased baking sheet.\nBake for 8 to 10 minutes in the preheated oven, or until the surface appears dry. Allow cookies to cool for a couple minutes on the baking sheet before removing to wire racks to cool completely. When cookies are completely cool, melt the chocolate over a double boiler or in the microwave. Stir frequently until smooth. Dip cookies or drizzle with the chocolate and place on waxed paper to set.\n",
        "picture_link": "Qbh8Teo2A/sGdEGDHSwtUqlRkPEqfyu"
    },
    {
        "title": "Oven Baked Sweet Potato Fries",
        "ingredients": [
            "2 large sweet potatoes, peeled, cut into 1x3-inch wedges ADVERTISEMENT",
            "3 tablespoons soybean oil (often labeled \"vegetable oil\") ADVERTISEMENT",
            "1/2 teaspoon sea salt ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1/4 teaspoon paprika ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Position rack in upper third of oven and preheat oven to 425 degrees F. Spray baking sheet with non-stick spray.\nPlace sweet potatoes and soybean oil in large bowl, toss lightly. Sprinkle with salt, pepper and paprika.\nArrange potatoes in a single layer on prepared baking sheet, being sure not to overcrowd.\nBake until tender and golden brown, turning occasionally. Cooking time is 18 to 24 minutes. Cool 5 minutes before serving.\n",
        "picture_link": "f9IRby9z4L8RvED138SiBMVrsv3V4sO"
    },
    {
        "title": "Amazing Fried Pork Chops!",
        "ingredients": [
            "2 tablespoons olive oil, or as needed ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "2 cups Italian-seasoned bread crumbs, or more as needed ADVERTISEMENT",
            "1/4 cup garlic powder ADVERTISEMENT",
            "1/4 cup onion powder ADVERTISEMENT",
            "1/4 cup seasoned salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 tablespoon olive oil, or as needed ADVERTISEMENT",
            "6 thick-cut boneless pork chops ADVERTISEMENT",
            "1/3 cup Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Pour about 2 tablespoons olive oil into the bottom of a deep baking pan to generously coat.\nWhisk eggs and milk together in a bowl. Mix bread crumbs, garlic powder, onion powder, seasoned salt, and black pepper together in a shallow dish.\nCoat the bottom of a skillet with about 1 tablespoon olive oil and heat over medium-high.\nCoat pork chops in the egg mixture, allowing excess liquid to drip back into the bowl. Press each coated pork chop into the bread crumb mixture until evenly coated on all sides.\nPlace pork chops in the hot oil and cook until golden brown, about 4 minutes per side. Transfer browned pork chops to the prepared baking dish and top with Parmesan cheese.\nBake in the preheated oven until pork chops are cooked through, 25 to 30 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C).\n",
        "picture_link": "Nye/MrUyWyOSeJJr6SIKr5KwwGfYI02"
    },
    {
        "title": "Skillet Chicken Bulgogi",
        "ingredients": [
            "1/4 cup chopped onion ADVERTISEMENT",
            "5 tablespoons soy sauce ADVERTISEMENT",
            "2 1/2 tablespoons brown sugar ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "2 tablespoons sesame oil ADVERTISEMENT",
            "1 tablespoon sesame seeds ADVERTISEMENT",
            "1/2 teaspoon cayenne ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 pound skinless, boneless chicken breasts, cut into thin strips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk onion, soy sauce, brown sugar, garlic, sesame oil, sesame seeds, cayenne pepper, salt, and black pepper together in a bowl until marinade is smooth.\nCook and stir chicken and marinade together in a large skillet over medium-high heat until chicken is cooked through, about 15 minutes.\n",
        "picture_link": "mZaUW1zv0DuGgPaY5cs7Kk1OxG8rF3q"
    },
    {
        "title": "Italian Stewed Tomatoes",
        "ingredients": [
            "24 large tomatoes - peeled, seeded and chopped ADVERTISEMENT",
            "1 cup chopped celery ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1/4 cup chopped green bell pepper ADVERTISEMENT",
            "2 teaspoons dried basil ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan over medium heat, combine tomatoes, celery, onion, bell pepper, basil and sugar. Cover and cook for 10 minutes, stirring occasionally to prevent sticking.\n",
        "picture_link": "tizu7xFuMGjSb5dJFMIwTFYRCJ1qnFS"
    },
    {
        "title": "Ultimate Lemon Cake",
        "ingredients": [
            "3/4 cup butter ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "8 egg yolks ADVERTISEMENT",
            "3 teaspoons baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "3 cups confectioners' sugar ADVERTISEMENT",
            "1/2 cup lemon juice ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease and flour a 10 inch Bundt pan. Mix together the flour, baking powder and salt. Set aside.\nIn a large bowl, cream together the butter and sugar until light and fluffy. Beat in the egg yolks one at a time, then stir in the vanilla and lemon juice. Beat in the flour mixture alternately with the milk, mixing until blended.\nPour batter into prepared pan. Bake in the preheated oven for 60 minutes, or until a toothpick inserted into the center of the cake comes out clean.\nTo make the hot lemon glaze: In a saucepan, combine 3 cups confectioners' sugar and 1/2 cup lemon juice. Bring mixture to a boil and cook for 1 minute. Keep mixture warm until ready to use.\nTo make the Icing Glaze: In a small bowl, mix 1/4 cup lemon juice and 1 1/2 cups of confectioners' sugar. If mixture is too thin, add more sugar until desired consistency is reached.\nAssemble the cake: Pour 3/4 of hot lemon glaze over warm cake while it's in the pan. Let cake cool for 60 minutes, then remove from pan. Reheat the remaining hot lemon glaze to the boiling point, then brush glaze onto the top and sides with a pastry brush. Using a fork, drizzle Icing Glaze over cake. Refrigerate for at least 2 hours before serving.\n",
        "picture_link": "RYb9LIOaO/lnOAKcWg3jNpfUcUAeslu"
    },
    {
        "title": "Potatoes and Peppers",
        "ingredients": [
            "1/3 cup olive oil ADVERTISEMENT",
            "6 potatoes, sliced ADVERTISEMENT",
            "2 large red bell peppers, sliced into rings ADVERTISEMENT",
            "1 large sweet onion, peeled and chopped ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large frying pan over medium-high heat. Fry the potatoes for 5 minutes, then add the peppers and onions. Season with salt and pepper. Cook for at least 15 minutes, turning potatoes frequently, or until potatoes start to look mushy.\n",
        "picture_link": "yu/fwi74J1LjPNKH.LtlYXaMfrg1Oy."
    },
    {
        "title": "Mary's Cheesecake",
        "ingredients": [
            "2 1/2 cups graham cracker crumbs ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/2 cup margarine, softened ADVERTISEMENT",
            "4 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 pint heavy cream ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "7 eggs ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). In a medium bowl, mix graham cracker crumbs, 1/4 cup sugar and margarine until well blended . Press mixture into a 9 inch springform pan.\nIn a large bowl, beat cream cheese with sugar until smooth. In a separate bowl, combine cream, flour, eggs, lemon juice and vanilla. Beat together, and then pour into cream cheese mixture. Mix well. Pour filling into prepared graham cracker crust.\nBake in the preheated oven for 65 minutes. Turn off oven, and cool cake in oven for 30 minutes. Prop door open and cool in oven for an additional 30 minutes. Remove from oven and cool completely. Refrigerate for as long as possible before serving.\n",
        "picture_link": "V3rETS9UaJJPtsqNaHhAUg.yTBr6dHe"
    },
    {
        "title": "Angel Pudding",
        "ingredients": [
            "1 (10 inch) angel food cake ADVERTISEMENT",
            "6 cups cold milk ADVERTISEMENT",
            "1 (5.9 ounce) package instant chocolate pudding mix ADVERTISEMENT",
            "1 (5 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "2 (2.1 ounce) bars chocolate-covered crispy peanut butter flavored candy (e.g., Butterfinger, ™), crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place half of cake cubes in the bottom of a 9x13 inch dish. Prepare chocolate and vanilla puddings with cold milk according to package directions. Spread prepared chocolate pudding over cake cubes in dish. Top with half the crushed candy. Distribute remaining cake cubes over candy and top with vanilla pudding and remaining candy. Chill until serving.\n",
        "picture_link": "xod1mQsODSf0Y0kOTGxAbKR2GjABaqq"
    }
]