[
    {
        "title": "Delicious Salmon",
        "ingredients": [
            "1/3 cup soy sauce ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "2 teaspoons lemon pepper ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 pound skin-on salmon fillet ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the soy sauce, olive oil, brown sugar, lemon pepper, and garlic in a shallow dish; lay the salmon fillets into the mixture with the skin side facing up. Allow to marinate in the refrigerator 4 to 8 hours or overnight.\nPreheat the oven's broiler and set the oven rack about 6 inches from the heat source. Remove salmon from the marinade and arrange on a baking sheet. Discard the marinade.\nCook the salmon under the broiler until lightly browned and the flesh flakes easily with a fork, 7 to 10 minutes. Allow the salmon to rest 5 minutes before slicing and serving.\n",
        "picture_link": "m8ZZsB84J0fhGndBjk/FvEgAgAgvxjS"
    },
    {
        "title": "Crispy Fish Fillets",
        "ingredients": [
            "1 egg ADVERTISEMENT",
            "2 tablespoons prepared yellow mustard ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups instant mashed potato flakes ADVERTISEMENT",
            "1/4 cup oil for frying ADVERTISEMENT",
            "4 (6 ounce) fillets sole ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a shallow dish, whisk together the egg, mustard, and salt; set aside. Place the potato flakes in another shallow dish.\nHeat oil in a large heavy skillet over medium-high heat.\nDip fish fillets in the egg mixture. Dredge the fillets in the potato flakes, making sure to completely coat the fish. For extra crispy, dip into egg and potato flakes again.\nFry fish fillets in oil for 3 to 4 minutes on each side, or until golden brown.\n",
        "picture_link": "97OPcpsSFNdvVjLmwk0OJ3xwKnCarr6"
    },
    {
        "title": "Pan-Seared Chicken Breasts with Shallots",
        "ingredients": [
            "3 tablespoons unsalted butter, divided ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves - pounded thin ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 shallots, chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/3 cup dry white wine ADVERTISEMENT",
            "1/2 cup chicken broth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt 1 tablespoon butter and heat olive oil in a large skillet over medium heat. Season chicken with salt and pepper, and brown on both sides in the skillet. Cover, and continue cooking 10 minutes, or until chicken juices run clear. Set aside, and keep warm.\nMix shallots and garlic into skillet over medium heat, and cook until tender. Stir in wine, and cook until heated through. Stir in broth, and continue cooking 5 minutes, or until reduced and slightly thickened. Mix in the remaining butter until melted. Serve the sauce over the chicken.\n",
        "picture_link": "..KIvxuaMEeDc7UI5hijuLE5aHnqNW."
    },
    {
        "title": "White Chocolate Macadamia Cranberry Dreams",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "3/4 teaspoon baking soda ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 cup packed light brown sugar ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1 cup vanilla baking chips ADVERTISEMENT",
            "1 cup chopped macadamia nuts ADVERTISEMENT",
            "1 cup dried cranberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl set aside flour, baking soda and salt.\nCream together white sugar, light brown sugar and butter (do not use shortening). Add slightly beaten eggs and vanilla.\nAdd flour mixture until just mixed. Stir in vanilla chips, macadamia nuts and dried cranberries.\nPreheat oven to 350 degrees F (175 degrees C). Place on ungreased cookie sheet by small scoop or rounded teaspoon. Bake for 10 minutes or just until set. Remove from oven and let cool. Cookies will sink slightly.\nVariations: To make chocolate cookies - omit 1/2 cup flour and replace with 1/2 cup cocoa. To make refrigerator cookies - Roll dough into 2 rolls, wrap with plastic wrap and chill or freeze. (If you freeze the dough - thaw for at least 1/2 hr). Slice 1 inch slices - cut into 4 and place on baking sheet point up. For fancier cookies: Drizzle melted white chocolate on chocolate cookies and melted dark chocolate on the white cookie. Enjoy\n",
        "picture_link": "LcrHKc9bUwCwUfWpkoMzoJDCnhbIu3a"
    },
    {
        "title": "Roasted Red Pepper Cream Sauce",
        "ingredients": [
            "2 large red bell peppers ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "1/4 cup fresh basil ADVERTISEMENT",
            "3 tablespoons extra virgin olive oil ADVERTISEMENT",
            "2 cups half-and-half ADVERTISEMENT",
            "1/4 cup grated Romano cheese ADVERTISEMENT",
            "4 tablespoons butter ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat broiler. Lightly coat the red peppers with olive oil. Grill peppers under the broiler until the skin is blackened, and the flesh has softened slightly. Place peppers in a paper bag or resealable plastic bag to cool for approximately 45 minutes.\nRemove the seeds and skin from the peppers (the skin should come off the peppers easily now). Cut peppers into small pieces.\nIn a skillet, cook and stir the garlic, basil, and red peppers in 3 tablespoons olive oil over medium heat. Cook for 10 minutes, so that the flavors mix.\nPlace mixture in blender (careful it is hot), and puree to desired consistency. Return puree to skillet, and reheat to a boil. Stir in the half-and-half and the Romano cheese; cook and stir until the cheese melts. Add the butter, and stir until melted. Season with salt and pepper to taste. Simmer for 5 minutes.\n",
        "picture_link": "RP9ow9OPdKzRM.Jw8kIhGILpQQqfQVm"
    },
    {
        "title": "Alfredo Mostaccioli",
        "ingredients": [
            "1 (16 ounce) package mostaccioli ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1 cup chopped fresh parsley ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1/8 teaspoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nCombine heavy cream and butter in a Dutch oven or large, heavy saucepan over medium heat. Heat until butter melts, stirring occasionally; be careful not to bring mixture to a boil. Stir in Parmesan cheese, parsley, salt, pepper and garlic powder. Toss with cooked pasta and serve immediately.\n",
        "picture_link": "4WxVMIeErv4XbX2GKV6LwxjMHfA86c2"
    },
    {
        "title": "Asian Salad",
        "ingredients": [
            "2 (3 ounce) packages ramen noodles, crushed ADVERTISEMENT",
            "1 cup blanched slivered almonds ADVERTISEMENT",
            "2 teaspoons sesame seeds ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 head napa cabbage, shredded ADVERTISEMENT",
            "1 bunch green onions, chopped ADVERTISEMENT",
            "3/4 cup vegetable oil ADVERTISEMENT",
            "1/4 cup distilled white vinegar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium skillet over low heat brown ramen noodles, almonds, and sesame seeds with melted butter or margarine. Once browned, take off heat and cool.\nIn a small saucepan bring vegetable oil, sugar, and vinegar to boil for 1 minute. Cool. Add soy sauce.\nIn a large bowl , combine shredded napa cabbage and chopped green onions. Add the noodle and soy sauce mixture. Toss to coat. Serve.\n",
        "picture_link": "WPgeJVXLl02aG2VMRoMFBTwEzo54fuK"
    },
    {
        "title": "Absolute Best Pancake Syrup",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1 cup sugar ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1 tablespoon corn syrup ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring butter, sugar, buttermilk, vanilla extract, corn syrup, and cinnamon to a simmer in a large saucepan over medium-high heat. Once simmering, whisk in baking soda, and cook for 10 seconds before removing from heat. Serve warm.\n",
        "picture_link": "Tc3Yeq.dqmoUc9xUu/tK2QZWJXQ5J0u"
    },
    {
        "title": "Soft Peanut Butter Cookies",
        "ingredients": [
            "1/2 cup margarine, softened ADVERTISEMENT",
            "1/2 cup peanut butter ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "3/4 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine margarine, peanut butter, sugars, egg, and vanilla. Blend together very well.\nAdd flour, baking soda and salt with mixer. Chill dough 15 minutes in the refrigerator. Roll into balls by hand.\nPlace on sprayed cookie sheet and bake in a preheated 350 degrees F (175 degrees C) oven until edges very lightly browning (about 7 to 10 minutes). Don't overcook. We store them in a plastic storage containers, and they stay soft!\n",
        "picture_link": "CKZV9pSVnkkh9e7vf645SJCpoWK7ySe"
    },
    {
        "title": "Cheese Cake Cups",
        "ingredients": [
            "16 vanilla wafer cookies ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line muffin pans with cupcake papers.\nPlace one wafer cookie in the bottom of each cupcake paper. In a medium bowl, cream together cream cheese and sugar. Beat in eggs and vanilla until smooth. Pour over wafers in cupcake papers.\nBake in preheated oven 15 minutes, until golden and set.\n",
        "picture_link": "H0qtMmQaKNdfPipu5bvwN9cjcgTbaDi"
    },
    {
        "title": "French Onion Soup I",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "3 onions, thinly sliced ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "2 1/2 cups water ADVERTISEMENT",
            "1/2 cup red wine ADVERTISEMENT",
            "2 (10.5 ounce) cans condensed beef broth ADVERTISEMENT",
            "1 French baguette ADVERTISEMENT",
            "8 ounces sliced Swiss cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter or margarine in a 4 quart saucepan. Stir in sugar. Cook onions over medium heat for 10 minutes, or until golden brown.\nStir in flour until well blended with the onions and pan juices. Add water, wine, and beef broth; heat to boiling. Reduce heat to low. Cover soup, and simmer for 10 minutes.\nCut four 1 inch thick slices of bread from the loaf. Toast the bread slices at 325 degrees F (165 degrees C) just until browned, about 10 minutes. Reserve the remaining bread to serve with the soup.\nLadle soup into four 12 ounce, oven-safe bowls. Place 1 slice toasted bread on top of the soup in each bowl. Fold Swiss cheese slices, and fit onto toasted bread slices. Place soup bowls on a cookie sheet for easier handling.\nBake at 425 degrees F (220 degrees C) for 10 minutes, or just until cheese is melted\n",
        "picture_link": "5gjQ0vWle5u.l6eqdhUJ0sNlzhfpPmy"
    },
    {
        "title": "Chocolate Pudding Fudge Cake",
        "ingredients": [
            "1 (18.25 ounce) package devil's food cake mix ADVERTISEMENT",
            "1 (3.9 ounce) package instant chocolate pudding mix ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "6 tablespoons butter ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 10 inch Bundt pan.\nIn a large bowl, combine cake mix, pudding mix, sour cream, milk, oil, water and eggs. Beat for 4 minutes, then mix in 2 cups chocolate chips.\nPour batter into prepared pan. Bake in the preheated oven for 40 to 50 minutes, or until a toothpick inserted into the center of the cake comes out clean. Cool 10 minutes in the pan, then turn out onto a wire rack and cool completely.\nTo make the glaze: Melt the butter and 1 cup chocolate chips in a double boiler or microwave oven. Stir until smooth and drizzle over cake.\n",
        "picture_link": "pOL2WM7VIEOvyZ7u8XZZNa6TZFe425S"
    },
    {
        "title": "Chicken Tortilla Soup II",
        "ingredients": [
            "6 tablespoons vegetable oil ADVERTISEMENT",
            "8 (6 inch) corn tortillas, coarsely chopped ADVERTISEMENT",
            "6 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup chopped fresh cilantro ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 (29 ounce) can diced tomatoes ADVERTISEMENT",
            "2 tablespoons ground cumin ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "3 bay leaves ADVERTISEMENT",
            "6 cups chicken broth ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground cayenne pepper ADVERTISEMENT",
            "5 boneless chicken breast halves, cooked ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large stock pot heat oil. Add tortillas, garlic, cilantro and onion. Saute for 2 to 3 minutes.\nStir in tomatoes and bring to a boil. Add cumin, chili powder, bay leaves and chicken stock. Return to a boil, reduce heat to medium and add salt and cayenne. Simmer for 30 minutes remove bay leaves and stir in chicken. Heat through and serve.\n",
        "picture_link": "YIR4YxY.KAsGN0nLUt2g4MYNBOwpo5S"
    },
    {
        "title": "Easy Turkey Tetrazzini",
        "ingredients": [
            "1 (8 ounce) package cooked egg noodles ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 (6 ounce) can sliced mushrooms ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon pepper ADVERTISEMENT",
            "2 cups chopped cooked turkey ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of celery soup ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain. Preheat oven to 375 degrees F (190 degrees C).\nMelt butter in a large heavy skillet. Saute mushrooms for 1 minute. Season with salt and pepper, and stir in turkey, condensed soup, and sour cream. Place cooked noodles in a 9x13 inch baking dish. Pour sauce mixture evenly over the top. Sprinkle with Parmesan cheese.\nBake in preheated oven for 20 to 25 minutes, or until sauce is bubbling.\n",
        "picture_link": "ARVdqYgO3Pk32ORSEAAeXcaz/DQBmc2"
    },
    {
        "title": "Honey Ribs",
        "ingredients": [
            "1 (10.5 ounce) can beef broth ADVERTISEMENT",
            "3 tablespoons honey mustard ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/4 cup honey barbeque sauce ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "1/4 cup maple syrup ADVERTISEMENT",
            "3 pounds baby back pork ribs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In the crock of a slow cooker, mix together the beef broth, honey mustard, honey, water, barbeque sauce, soy sauce, and maple syrup. Slice ribs apart, leaving an even amount of meat on each side of the bone. Place them into the slow cooker so that they are covered by the sauce. If there is not enough sauce, you may add a little water or beef broth to compensate.\nCover, and cook on High for 5 hours, or until the meat falls easily from the bones.\n",
        "picture_link": "NmYcr5t24hzFc7hL9bh.sx/ae7r1Co2"
    },
    {
        "title": "Chicken with Chipotle",
        "ingredients": [
            "8 chicken leg quarters ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "2 chipotle peppers in adobo sauce ADVERTISEMENT",
            "2 tablespoons chicken bouillon granules ADVERTISEMENT",
            "1 tablespoon margarine ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nRoast the chicken legs in the preheated oven until the skin is crispy, and the meat is cooked through, 30 to 40 minutes.\nWhile the chicken is roasting, puree the milk, sour cream, chipotle peppers, and chicken bouillon granules in a blender until smooth. Melt the margarine in a large pan over medium heat. Pour in the chipotle puree, bring to a simmer, reduce heat to low, and season with salt to taste. Add the cooked chicken legs, and simmer for about 10 minutes, until chicken has taken on the flavor of the sauce.\n",
        "picture_link": "2NZ7YrM9s1kQXat.XOPXTCnygbuu9Za"
    },
    {
        "title": "Best Baked Chicken",
        "ingredients": [
            "8 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "2 teaspoons soy sauce ADVERTISEMENT",
            "2 teaspoons celery salt ADVERTISEMENT",
            "2 teaspoons garlic salt ADVERTISEMENT",
            "1 dash pepper ADVERTISEMENT",
            "1 (6 ounce) package herb-seasoned stuffing mix, crushed into crumbs ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease a baking dish.\nIn a medium bowl, mix the sour cream, lemon juice, soy sauce, celery salt, garlic salt, and pepper. Dip each chicken breast in the sour cream mixture, then roll in the stuffing mix to coat. Arrange chicken in the prepared baking dish. Drizzle with the melted butter.\nBake 40 to 50 minutes in the preheated oven, until the chicken is no longer pink and the juices run clear.\n",
        "picture_link": "2fbdMvuS2ZrUiuOerprsOqouQ8gLC4G"
    },
    {
        "title": "Sesame Seared Tuna",
        "ingredients": [
            "1/4 cup soy sauce ADVERTISEMENT",
            "1 tablespoon mirin (Japanese sweet wine) ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "2 tablespoons sesame oil ADVERTISEMENT",
            "1 tablespoon rice wine vinegar ADVERTISEMENT",
            "4 (6 ounce) tuna steaks ADVERTISEMENT",
            "1/2 cup sesame seeds ADVERTISEMENT",
            "wasabi paste ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, stir together the soy sauce, mirin, honey and sesame oil. Divide into two equal parts. Stir the rice vinegar into one part and set aside as a dipping sauce.\nSpread the sesame seeds out on a plate. Coat the tuna steaks with the remaining soy sauce mixture, then press into the sesame seeds to coat.\nHeat olive oil in a cast iron skillet over high heat until very hot. Place steaks in the pan, and sear for about 30 seconds on each side. Serve with the dipping sauce and wasabi paste.\n",
        "picture_link": "lwOGJj1E0sjYH.BkKtZz40MWvaiG0W."
    },
    {
        "title": "Terry's Texas Pinto Beans",
        "ingredients": [
            "1 pound dry pinto beans ADVERTISEMENT",
            "1 (29 ounce) can reduced sodium chicken broth ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 fresh jalapeno pepper, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup green salsa ADVERTISEMENT",
            "1 teaspoon cumin ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "water, if needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the pinto beans in a large pot, and pour in the chicken broth. Stir in onion, jalapeno, garlic, salsa, cumin, and pepper. Bring to a boil, reduce heat to medium-low, and continue cooking 2 hours, stirring often, until beans are tender. Add water as needed to keep the beans moist.\n",
        "picture_link": "TUxdln5UoZ6wNEAlp9sPMZb6BC76hUy"
    },
    {
        "title": "Bubble Pizza",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1/4 pound sliced pepperoni sausage ADVERTISEMENT",
            "1 (14 ounce) can pizza sauce ADVERTISEMENT",
            "2 (12 ounce) packages refrigerated buttermilk biscuit dough ADVERTISEMENT",
            "1/2 onion, sliced and separated into rings ADVERTISEMENT",
            "1 (10 ounce) can sliced black olives ADVERTISEMENT",
            "1 (4.5 ounce) can sliced mushrooms ADVERTISEMENT",
            "1 1/2 cups shredded mozzarella cheese ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease a 9x13 inch baking dish. Place ground beef in a large, deep skillet. Cook over medium high heat until evenly brown. Stir in pepperoni, and cook until browned. Drain excess fat. Stir in pizza sauce. Remove from heat, and set aside.\nCut biscuits into quarters, and place in the bottom of baking dish. Spread meat mixture evenly over the biscuits. Sprinkle top with onion, olives and mushrooms.\nBake uncovered in preheated oven for 20 to 25 minutes. Sprinkle top with mozzarella and Cheddar cheese. Bake an additional 5 to 10 minutes, until cheese is melted. Let stand 10 minutes before serving.\n",
        "picture_link": "sIoyQc3TKOaRinl.vif3VzVtMjsQL9W"
    },
    {
        "title": "Acapulco Chicken",
        "ingredients": [
            "2 skinless, boneless chicken breast halves - cut into bite-size pieces ADVERTISEMENT",
            "1 tablespoon chili powder, divided ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 cup chopped green bell pepper ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "2 jalapeno peppers, seeded and minced ADVERTISEMENT",
            "1 large tomato, cut into chunks ADVERTISEMENT",
            "10 drops hot pepper sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season chicken with 1/2 tablespoon chili powder, salt and pepper. Heat oil in a large skillet over medium high heat and saute seasoned chicken for 3 to 4 minutes, or until no longer pink. Remove from skillet with a slotted spoon and keep warm.\nIn same skillet, stir fry bell pepper and onion until soft. Add jalapeno peppers, tomatoes, remaining 1/2 tablespoon chili powder and hot pepper sauce. Cook, stirring, for an additional 3 to 5 minutes; add chicken and stir fry for 2 minutes more.\n",
        "picture_link": "gln1Kmc6a6S0TUVEJ.em/1xgf5CHWjq"
    },
    {
        "title": "Oven Baked Jambalaya",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1 large onion, diced ADVERTISEMENT",
            "1 large green bell pepper, chopped ADVERTISEMENT",
            "4 stalks celery, chopped ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "3 bay leaves ADVERTISEMENT",
            "3 tablespoons Creole seasoning blend (such as the one linked in the footnote) ADVERTISEMENT",
            "4 teaspoons Worcestershire sauce ADVERTISEMENT",
            "2 (28 ounce) cans whole peeled tomatoes ADVERTISEMENT",
            "7 cups chicken stock ADVERTISEMENT",
            "3 cups chopped cooked ham ADVERTISEMENT",
            "3 cups cooked andouille sausage, sliced ADVERTISEMENT",
            "3 cups cooked chicken, cut into bite-sized pieces ADVERTISEMENT",
            "3 cups frozen cooked shrimp ADVERTISEMENT",
            "4 cups uncooked long-grain white rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMelt butter in large stock pot. Saute onion, green pepper, celery and garlic until tender, being careful not to burn the garlic. Add tomato paste and cook to brown slightly, stirring constantly. Stir in bay leaves, Creole seasoning blend and Worcestershire sauce. Pour into a large roasting pan. Squeeze tomatoes to break up into pieces, and add to mixture in pan. Stir in juice from tomatoes, chicken stock, ham, sausage, chicken, shrimp and rice. Mix well. Cover tightly with aluminum foil.\nBake in preheated oven for 1 1/2 hours, stirring once halfway through baking time. Remove bay leaves before serving.\n",
        "picture_link": "7YPB.ZRb07nJzL1tukp15Lj04Fzw7Wm"
    },
    {
        "title": "Tangy Grilled Pork Tenderloin",
        "ingredients": [
            "2 pounds pork tenderloin ADVERTISEMENT",
            "2/3 cup honey ADVERTISEMENT",
            "1/2 cup Dijon mustard ADVERTISEMENT",
            "1/4 teaspoon chili powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place meat in a large resealable plastic bag. In a medium bowl, mix together honey, Dijon mustard, chili powder, and salt. Pour marinade over tenderloins, seal, and refrigerate for at least 4 hours.\nPrepare the grill for indirect heat.\nLightly oil grill grate. Remove meat from marinade, and discard liquid. Grill for 15 to 25 minutes, or until an instant-read thermometer inserted into the center reads 145 degrees F (63 degrees C).\n",
        "picture_link": "dU9xHOfhCjDz8R0b82hF0DUNh5DYUt6"
    },
    {
        "title": "Easy Beer Bread Mix",
        "ingredients": [
            "2 1/2 cups self-rising flour ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "3/4 teaspoon Italian seasoning ADVERTISEMENT",
            "1 (12 fluid ounce) can beer ADVERTISEMENT",
            "1/4 cup butter or margarine, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease a 9x5 inch baking pan.\nIn a bowl, mix the self-rising flour, all-purpose flour, brown sugar, baking powder, salt, onion powder, and Italian seasoning. Pour in the beer, and mix just until moistened. Transfer to the prepared baking pan. Top with the melted butter.\nBake 45 to 55 minutes in the preheated oven, until a toothpick inserted in the center comes out clean. Cool on a wire rack.\n",
        "picture_link": "soxuTrO3sa1mgyikQd79swUx/vHwmHy"
    },
    {
        "title": "Caramel Apple Dip",
        "ingredients": [
            "16 individually wrapped caramels, unwrapped ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan over medium-low heat, or in the microwave, melt caramels with water, stirring frequently. Remove from heat. In a medium bowl, cream together cream cheese and sugar. Fold in caramel mixture. Serve immediately.\n",
        "picture_link": "lml/BKij8haBpwzGm0uN.ZJrjL.p9Ia"
    },
    {
        "title": "Jo Jo's Favorite Banana Muffins",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup mashed ripe banana ADVERTISEMENT",
            "1/2 cup margarine ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "6 tablespoons milk ADVERTISEMENT",
            "2 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl mix flour, baking powder, baking soda, salt, and cinnamon and set aside.\nIn a separate bowl cream margarine and sugar, add eggs and mix until smooth. Stir in milk and mashed banana and mix well.\nFold in flour mixture into the liquid ingredients until combined.\nFill greased muffin tins two-thirds of the way full.\nBake in a preheated 350 degree F (175 degrees C) oven for 25 to 30 minutes.\n",
        "picture_link": "5A4TUNar6svoC1wkq4IzmSInR3sJhnm"
    },
    {
        "title": "Aunt Johnnie's Pound Cake",
        "ingredients": [
            "1/2 cup shortening ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "2 1/2 cups white sugar ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "2 teaspoons almond extract ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "3 cups cake flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C). Lightly grease and flour a 10 inch Bundt pan.\nCream shortening, butter and sugar until light and fluffy (for best results use an electric mixer). This will take a while. Add eggs one at a time, beating well after each addition. Beat in almond extract.\nCombine baking powder and flour. Stir into creamed mixture alternately with the milk, starting and ending with flour. Pour batter into prepared pan.\nBake in the preheated oven for 1 to 1 1/2 hours, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pan for 10 minutes, then turn out onto a wire rack and cool completely.\n",
        "picture_link": "6OYMjdT833llUA2Z6KKpO0UAL5m5lTG"
    },
    {
        "title": "Chinese Cabbage Salad I",
        "ingredients": [
            "1 (3 ounce) package ramen noodles, crushed ADVERTISEMENT",
            "10 ounces cashew pieces ADVERTISEMENT",
            "1 (16 ounce) package shredded coleslaw mix ADVERTISEMENT",
            "1 bunch green onions, chopped ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1/4 cup cider vinegar ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a preheated 350 degree F oven (175 degree C), toast the crushed noodles and nuts until golden brown.\nIn a large bowl, combine the coleslaw, green onions, toasted ramen noodles and cashews.\nTo prepare the dressing, whisk together the sugar, oil, vinegar and soy sauce. Pour the dressing over the salad, toss and serve.\n",
        "picture_link": "pFiJfkz/.lhlKuTasQf94UpX1VizVp."
    },
    {
        "title": "Erica's Delicious Slow Cooker Beef Roast",
        "ingredients": [
            "2 pounds boneless beef roast ADVERTISEMENT",
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 onion, quartered ADVERTISEMENT",
            "16 baby carrots ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet over medium high heat, saute the roast in the oil for 15 minutes, or until all sides are well browned. Season with salt and pepper to taste and set aside.\nPlace the onion, carrots, garlic and parsley in the bottom of a slow cooker. Place the roast on top of the vegetables and pour the soup over the roast and the vegetables.\nCover the slow cooker and cook on low setting for 8 to 10 hours, stirring once.\nTransfer roast to a serving platter and place the vegetables around it. Pour the roast gravy from the slow cooker into a gravy boat.\n",
        "picture_link": "9TJ11kZvndDQdTCoLJJaLT5HEGFjwri"
    },
    {
        "title": "Best Butternut Squash Soup Ever",
        "ingredients": [
            "1 1/2 tablespoons butter ADVERTISEMENT",
            "1/2 onion, sliced ADVERTISEMENT",
            "2 cloves garlic ADVERTISEMENT",
            "2 sprigs fresh thyme ADVERTISEMENT",
            "1/2 butternut squash - peeled, seeded, and cut into 1-inch cubes ADVERTISEMENT",
            "4 cups chicken stock ADVERTISEMENT",
            "1/2 cube chicken bouillon ADVERTISEMENT",
            "1 pinch ground cumin ADVERTISEMENT",
            "1 pinch ground allspice ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a large pot over medium heat; cook the onion, garlic, and thyme in the hot butter until the onion has softened, about 5 minutes. Add the squash and chicken stock; bring to a simmer and cook until the squash is tender, 10 to 15 minutes. Crumble the bouillon into the soup; season with cumin, allspice, salt, and pepper; remove from heat.\nPour the soup into a blender, filling the pitcher no more than halfway. Hold the lid of the blender in place with a kitchen towel and carefully start the blender using a few quick pulses to get the soup moving before leaving it on to puree. Puree in batches until smooth and pour into a serving bowl. Alternately, you can use a stick blender and puree the soup in the pot.\n",
        "picture_link": "UYvYwiyJUqETvNj40UkI4Ns10dhAMe2"
    },
    {
        "title": "Spinach Enchiladas Verde",
        "ingredients": [
            "1 cup light sour cream ADVERTISEMENT",
            "1 (7 ounce) can green salsa ADVERTISEMENT",
            "1 bunch fresh spinach, rinsed and thinly sliced ADVERTISEMENT",
            "2 cups shredded Monterey Jack cheese ADVERTISEMENT",
            "1 (10 ounce) package corn tortillas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nIn a small bowl, stir together half of the sour cream and the green salsa. Spread enough to coat the bottom into a 9x13 inch baking dish. On each tortilla, spread a small amount of the salsa and sour cream in the center. Lay a small handful of spinach over that, and sprinkle with Monterey Jack cheese. Roll up, secure with a toothpick and place into the baking dish. When all of the tortillas are in the pan, pour the remaining salsa over the top and sprinkle with the remaining cheese.\nBake for 20 to 25 minutes in the preheated oven, until the enchiladas are browned and heated through.\n",
        "picture_link": "Ix.YyDoadGf6/XPYdVW6WawKOR43lUy"
    },
    {
        "title": "Southern Candied Sweet Potatoes",
        "ingredients": [
            "6 large sweet potatoes ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Peel the sweet potatoes and cut them into slices.\nMelt the butter in a heavy skillet and add the sliced sweet potatoes.\nMix the sugar, cinnamon, nutmeg and salt. Cover the sweet potatoes with sugar mixture and stir. Cover skillet, reduce heat to low and cook for about 1 hour or until potatoes are \"candied\". They should be tender but a little hard around the edges. Also the sauce will turn dark. You will need to stir occasionally during the cooking. Stir in the vanilla just before serving. Serve hot.\n",
        "picture_link": "6Ud4OQ0dDY1oNa0ofh3hhP2EZ3jHRwG"
    },
    {
        "title": "Pumpkin Bread",
        "ingredients": [
            "3 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1 teaspoon ground allspice ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "3 cups white sugar ADVERTISEMENT",
            "1 cup canola oil ADVERTISEMENT",
            "4 eggs, beaten ADVERTISEMENT",
            "2 cups solid pack pumpkin puree ADVERTISEMENT",
            "2/3 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease two loaf pans.\nIn a medium mixing bowl, combine flour, baking soda, salt, baking powder, nutmeg, allspice, cinnamon and cloves.\nIn a large bowl with an electric mixer, blend sugar, oil and eggs. Stir in pumpkin. Slowly blend the flour mixture into pumpkin mixture. While blending the mixture add water incrementally. Pour the batter into two prepared loaf pans.\nBake in a preheated 350 degrees F (175 degrees C) oven for 90 minutes. Let cool for 10 minutes before removing from the pans.\n",
        "picture_link": "GOStQqR.t8G/dwQ8lah1knGgL9Xb8WK"
    },
    {
        "title": "Southwestern Pasta Salad",
        "ingredients": [
            "1/2 (16 ounce) package rotini pasta ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1/4 cup fresh lime juice ADVERTISEMENT",
            "2 tablespoons chili powder, or to taste ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "1 1/2 cups whole kernel corn ADVERTISEMENT",
            "1 (15 ounce) can black beans, drained and rinsed ADVERTISEMENT",
            "1/2 cup diced green bell pepper ADVERTISEMENT",
            "1/2 cup diced red bell pepper ADVERTISEMENT",
            "1/2 cup fresh cilantro leaves ADVERTISEMENT",
            "1 cup chopped roma (plum) tomatoes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nIn a large bowl combine oil, lime juice, chili powder, cumin, salt and garlic. Stir in pasta and set aside to cool to room temperature, stirring occasionally.\nStir in corn, beans, green pepper, red pepper and 1/2 of the cilantro leaves. Spoon onto a platter and garnish with tomatoes and remaining cilantro. Serve chilled or at room temperature.\n",
        "picture_link": "qYAq5kM8Dxrsx8D8pPhc6VCvgy1Q8qO"
    },
    {
        "title": "Mamaw's Chicken and Rice Casserole",
        "ingredients": [
            "3 chicken breasts, cut into cubes ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "2 cups instant white rice ADVERTISEMENT",
            "1 (10.75 ounce) can cream of chicken soup ADVERTISEMENT",
            "1 (10.75 ounce) can cream of celery soup ADVERTISEMENT",
            "1 (10.75 ounce) can cream of mushroom soup ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 cup butter, sliced into pats ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease sides and bottom of a casserole dish.\nStir chicken, water, rice, cream of chicken soup, cream of celery soup, and cream of mushroom soup together in the prepared casserole dish; season with salt and pepper. Arrange butter evenly over the top of the chicken mixture.\nBake in preheated oven until the rice is tender and the chicken is cooked through, 1 hour to 75 minutes. Cool 15 minutes before serving.\n",
        "picture_link": "..yZHznQ1B8s35txYMSXpz3QPeZfzTG"
    },
    {
        "title": "Fish in Foil",
        "ingredients": [
            "2 rainbow trout fillets ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 teaspoons garlic salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 fresh jalapeno pepper, sliced ADVERTISEMENT",
            "1 lemon, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Rinse fish, and pat dry.\nRub fillets with olive oil, and season with garlic salt and black pepper. Place each fillet on a large sheet of aluminum foil. Top with jalapeno slices, and squeeze the juice from the ends of the lemons over the fish. Arrange lemon slices on top of fillets. Carefully seal all edges of the foil to form enclosed packets. Place packets on baking sheet.\nBake in preheated oven for 15 to 20 minutes, depending on the size of fish. Fish is done when it flakes easily with a fork.\n",
        "picture_link": "srNqK4sOqu4VrrTKdRvSJIr6kZnbEFi"
    },
    {
        "title": "Pumpkin Wheat Honey Muffins",
        "ingredients": [
            "1/2 cup raisins ADVERTISEMENT",
            "1 1/2 cups whole wheat flour ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1 teaspoon pumpkin pie spice ADVERTISEMENT",
            "3/4 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3/4 cup canned pumpkin puree ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Grease a 12 cup muffin pan, or line with paper liners. Place the raisins in a cup, and add enough hot water to cover. Let stand for a few minutes to plump.\nIn a large bowl, stir together the whole wheat flour, brown sugar, pumpkin pie spice, baking powder, baking soda and salt. Make a well in the center, and put in eggs, pumpkin, oil and honey. Mix just until the dry ingredients are absorbed. Drain excess water from raisins, and stir in along with the walnuts. Spoon into muffin cups so they are about 2/3 full.\nBake for 18 minutes in the preheated oven, or until the tops spring back when lightly touched. Cool in the pan before removing from cups.\n",
        "picture_link": "Gc8z//ySP/UvmH.yHW16Gga7gfMtR1W"
    },
    {
        "title": "Pasta e Olio",
        "ingredients": [
            "1 pound spaghetti ADVERTISEMENT",
            "2 teaspoons chopped garlic ADVERTISEMENT",
            "1/4 cup chopped parsley ADVERTISEMENT",
            "1/4 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1/4 cup melted butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot with boiling salted water cook spaghetti pasta until al dente. Drain.\nMeanwhile, in a large skillet over low heat saute garlic, parsley, and red pepper flakes with olive oil . Cook until garlic turns golden in color, about 10 to 15 minutes.\nToss pasta with garlic mixture and butter or margarine. Serve warm.\n",
        "picture_link": "bvtq7I/SiDed85wvCZCD/bZbMCQFzwm"
    },
    {
        "title": "Pumpkin Whoopie Pies",
        "ingredients": [
            "2 cups packed brown sugar ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "1 1/2 cups solid pack pumpkin puree ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 tablespoons ground cinnamon ADVERTISEMENT",
            "1/2 tablespoon ground ginger ADVERTISEMENT",
            "1/2 tablespoon ground cloves ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "3/4 cup shortening ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease baking sheets.\nCombine the oil and brown sugar. Mix in the pumpkin and eggs, beating well. Add the flour, salt, baking powder, baking soda, 1 teaspoon vanilla, cinnamon, ginger and cloves. Mix well.\nDrop dough by heaping teaspoons onto the prepared baking sheets. Bake at 350 degrees F (175 degrees C) for 10 to 12 minutes. Let cookies cool then make sandwiches from two cookies filled with Whoopie Pie Filling.\nTo Make Whoopie Pie Filling: Beat egg white and mix with the milk, 1 teaspoon vanilla and 1 cup of the confectioners' sugar. Mix well then beat in the shortening and the remaining cup of confectioners' sugar. Beat until light and fluffy.\n",
        "picture_link": ".QeFD1xOsgU3ezBftkMzXolO6573B8e"
    },
    {
        "title": "Sweet and Sour Meatballs II",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 cup dry bread crumbs ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/2 cup cider vinegar ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine beef, egg, onion, bread crumbs, salt and pepper. Roll into meatballs about 1 to 1 1/2 inches in size.\nIn a large skillet over medium heat, saute the meatballs until browned on all sides.\nIn a separate medium bowl, mix together the water, vinegar, ketchup, cornstarch, sugar and soy sauce. Pour over the meatballs, and allow sauce to thicken. Continue to heat until the sauce just starts to bubble.\n",
        "picture_link": ".Bb.L1PSpeNLSHDCR7wvfZKzFzspaBa"
    },
    {
        "title": "Chicken, Garlic, and Sundried Tomato Pasta",
        "ingredients": [
            "1 (16 ounce) package farfalle pasta ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 tablespoon dried parsley ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "3 cooked skinless, boneless chicken breast halves, cut into bite-size pieces ADVERTISEMENT",
            "1/3 cup sun-dried tomatoes, rehydrated in water ADVERTISEMENT",
            "2 tablespoons grated Romano cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot with boiling salted water cook farfalle pasta until al dente. Drain.\nMeanwhile, melt butter in a large saucepan. Add garlic cloves and cook until garlic browns. Add the cream of chicken soup and milk, stirring until smooth. Stir in the dried parsley, salt, and ground fresh pepper. Let simmer for 2 to 3 minutes. Add bite size chicken pieces and hydrated sun dried tomatoes. Simmer for 6 to 8 minutes. Mix in grated Romano cheese.\nToss cooked and drained pasta with chicken sauce. Serve warm.\n",
        "picture_link": "HAPHIuYFoSasmhuqpdObeSKhv1VS22m"
    },
    {
        "title": "Daddy's Fried Corn and Onions",
        "ingredients": [
            "4 ears fresh corn ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 small sweet onion, diced ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut corn kernels from cob. Melt butter in a medium skillet over medium heat. Saute corn kernels just until tender, then mix in onion. Continue to saute until onion is just beginning to turn crispy. Season with salt and pepper. Enjoy warm or cold.\n",
        "picture_link": "Yiu91HXWgq/Qm4feqVC8sRkHlieDYFm"
    },
    {
        "title": "The Best Fresh Tomato Salsa",
        "ingredients": [
            "3 cups chopped tomatoes ADVERTISEMENT",
            "1/2 cup chopped green bell pepper ADVERTISEMENT",
            "1 cup onion, diced ADVERTISEMENT",
            "1/4 cup minced fresh cilantro ADVERTISEMENT",
            "2 tablespoons fresh lime juice ADVERTISEMENT",
            "4 teaspoons chopped fresh jalapeno pepper (including seeds) ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon kosher salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir the tomatoes, green bell pepper, onion, cilantro, lime juice, jalapeno pepper, cumin, salt, and pepper in a bowl. Serve.\n",
        "picture_link": "wXtEAq33w3kwD4p.nNSBIADdiDn5LkW"
    },
    {
        "title": "Margarita Cake",
        "ingredients": [
            "1 (18.25 ounce) package orange cake mix ADVERTISEMENT",
            "1 (3.4 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "2/3 cup water ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "1/4 cup tequila ADVERTISEMENT",
            "2 tablespoons triple sec liqueur ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "1 tablespoon tequila ADVERTISEMENT",
            "2 tablespoons triple sec liqueur ADVERTISEMENT",
            "2 tablespoons lime juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 10 inch Bundt pan.\nIn a large bowl combine cake mix, pudding mix, eggs, oil, water, lemon juice 1/4 cup tequila and 2 tablespoons triple sec. Beat for 2 minutes.\nPour batter into prepared pan. Bake in the preheated oven for 45 to 50 minutes, or until a toothpick inserted into the center of the cake comes out clean. Cool in pan for 10 minutes; remove to rack and pour glaze over cake while still warm.\nTo make the glaze: In a small bowl, combine confectioners' sugar with 1 tablespoon tequila, 2 tablespoons triple sec and 2 tablespoons lime juice. Mix until smooth.\n",
        "picture_link": "JMyXqCq4.dJ/gt2y9PjmiEeIlEibYmO"
    },
    {
        "title": "Restaurant-Quality Baked Potato Soup",
        "ingredients": [
            "2 potatoes ADVERTISEMENT",
            "3 tablespoons margarine ADVERTISEMENT",
            "2 cups chopped white onion ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "4 cups chicken stock ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1/4 cup cornstarch ADVERTISEMENT",
            "1 1/2 cups instant mashed potato flakes ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1/8 teaspoon dried thyme ADVERTISEMENT",
            "1 cup half-and-half ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "8 ounces bacon - cooked and crumbled ADVERTISEMENT",
            "2 green onions, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Bake potatoes for 1 hour, or until done. Set aside to cool.\nMelt butter in a 3 quart saucepan over medium heat. Saute onions until tender and golden brown. Stir in flour, and cook 5 minutes to make a roux. Pour in chicken stock and water. Add cornstarch and mashed potato flakes. Season with salt, pepper, basil and thyme. Bring to a boil, reduce heat, and simmer for 5 minutes.\nRemove the skin from the cooled potatoes, and discard. Dice the potatoes into 1/2 inch cubes, and stir into soup, along with the half-and-half. Simmer for 15 to 20 minutes, or until thick. Spoon into bowls, and garnish with shredded cheese, bacon and chopped green onion.\n",
        "picture_link": "1UulSYq5qMTmvhba5epYJnWY9qXfQhu"
    },
    {
        "title": "Chicken and Bow Tie Pasta",
        "ingredients": [
            "4 boneless, skinless chicken breast halves ADVERTISEMENT",
            "1 (12 ounce) package farfalle (bow tie) pasta ADVERTISEMENT",
            "1 (14 ounce) can chicken broth ADVERTISEMENT",
            "1 head broccoli, cut into florets ADVERTISEMENT",
            "1 medium red bell pepper, thinly sliced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 (8 ounce) containers chive and onion cream cheese ADVERTISEMENT",
            "1/4 cup freshly grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken in a saucepan, and add water to cover. Boil 20 minutes. Allow to cool, then pull meat into shreds.\nBring a large pot of lightly salted water to a boil. Add pasta, and cook for 8 to 10 minutes, or until al dente; drain.\nIn a large skillet over medium-high heat, combine chicken broth, red pepper, garlic, broccoli, salt and pepper. Cover, and simmer for 8 to 10 minutes, until broccoli is crisp-tender. Stir in cream cheese until smooth. Mix in chicken and pasta until evenly coated. Garnish with Parmesan cheese.\n",
        "picture_link": "xusOQ9x0LoG2KVBCgFlUz3YXNQMIea2"
    },
    {
        "title": "Sweet and Sour Meatloaf",
        "ingredients": [
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "1 cup dry bread crumbs ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon dried minced onion ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "2 tablespoons cider vinegar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 teaspoons prepared mustard ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, combine the ground beef, bread crumbs, salt, ground black pepper, eggs, onion flakes and 1/2 of the can of tomato sauce. Mix together well and place into a 5x9 inch loaf pan.\nPush the meatloaf down into the pan forming a well for the sauce around all the edges.\nBake at 350 degrees F (175 degrees C) for 40 minutes.\nMeanwhile, in a small saucepan over medium heat, combine the remaining tomato sauce, brown sugar, vinegar, white sugar and mustard. Bring to a boil and remove from heat.\nAfter meatloaf has cooked for 40 minutes, remove from oven and pour sauce over the top of the meatloaf.\nReturn to oven and bake at 350 degrees F (175 degrees C) for 20 more minutes. Let sit 5 minutes before removing from pan.\n",
        "picture_link": "VzZpBtHvqgUtA.jjpQ/76Q28h7Xi/jq"
    },
    {
        "title": "Dad's Pan-Fried Green Beans",
        "ingredients": [
            "1 pound fresh green beans, trimmed ADVERTISEMENT",
            "3 tablespoons light soy sauce ADVERTISEMENT",
            "1 tablespoon balsamic vinegar ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "2 tablespoons sesame oil ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the green beans in a large saucepan or pot with one inch of water. You may place them in a steamer insert if you have one. Bring to a boil, cover and cook for 5 minutes, they should still be firm and bright green.\nIn a small bowl, stir together the soy sauce, balsamic vinegar and sugar; set aside.\nHeat the sesame oil in a large skillet over medium heat. Add garlic and cook until starting to brown. Add the green beans and stir to coat with the oil. Stir in the soy sauce mixture and simmer for a couple of minutes uncovered to reduce the sauce. Transfer the beans to a serving dish and pour the sauce over them.\n",
        "picture_link": "gHBOpb5hB0iFLwDzx8TAFyqLPGnRXf6"
    },
    {
        "title": "Ultimate Potato Soup",
        "ingredients": [
            "6 cups diced potatoes ADVERTISEMENT",
            "3 stalks celery, diced ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "3 (14.5 ounce) cans chicken broth, divided ADVERTISEMENT",
            "4 cups half-and-half cream ADVERTISEMENT",
            "6 tablespoons butter, melted ADVERTISEMENT",
            "6 tablespoons all-purpose flour ADVERTISEMENT",
            "4 cubes chicken bouillon ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot, bring potatoes, celery and onion to a boil in 2 cups of broth. Cook until potatoes are tender, 15 minutes. Drain and reserve liquid.\nCombine reserved broth and half-and-half in pot. In a bowl, combine melted butter and flour. Stir into half-and-half mixture over medium heat. Stir until thickened. Stir in reserved vegetables, remaining broth, bouillon and pepper. Heat through and serve.\n",
        "picture_link": "fzZXNzaKgDTphz49pOZPaxmQX3fQP4G"
    },
    {
        "title": "Very Best Blueberry Cobbler!",
        "ingredients": [
            "2 1/2 cups fresh or frozen blueberries ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "1 cup white sugar, or to taste ADVERTISEMENT",
            "1/2 teaspoon all-purpose flour ADVERTISEMENT",
            "1 tablespoon butter, melted ADVERTISEMENT",
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "4 teaspoons baking powder ADVERTISEMENT",
            "6 tablespoons white sugar ADVERTISEMENT",
            "5 tablespoons butter ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "2 teaspoons sugar ADVERTISEMENT",
            "1 pinch ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Lightly grease an 8 inch square baking dish. Place the blueberries into the baking dish, and mix with vanilla and lemon juice. Sprinkle with 1 cup of sugar and 1/2 teaspoon of flour, then stir in the tablespoon of melted butter. Set aside.\nIn a medium bowl, stir together 1 3/4 cups of flour, baking powder, and 6 tablespoons sugar. Rub in the 5 tablespoons butter using your fingers, or cut in with a pastry blender until it is in small pieces. Make a well in the center, and quickly stir in the milk. Mix just until moistened. You should have a very thick batter, or very wet dough. You may need to add a splash more milk. Cover, and let batter rest for 10 minutes.\nPreheat the oven to 375 degrees F (190 degrees C). Spoon the batter over the blueberries, leaving only a few small holes for the berries to peek through. Mix together the cinnamon and 2 teaspoons sugar; sprinkle over the top.\nBake for 20 to 25 minutes in the preheated oven, or until the top is golden brown. A knife inserted into the topping should come out clean - of course there will be blueberry syrup on the knife. Let cool until just warm before serving. This can store in the refrigerator for 2 days.\n",
        "picture_link": "MdE0u12dCLK9I8wt6KElE5UhcyXynli"
    },
    {
        "title": "Toasted Pumpkin Seeds with Sugar and Spice",
        "ingredients": [
            "1 cup raw pumpkin seeds, rinsed and dried ADVERTISEMENT",
            "6 tablespoons white sugar, divided ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon pumpkin pie spice ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 250 degrees F (120 degrees C). Spread pumpkin seeds in a single layer on a baking sheet. Toast for 45 minutes, stirring occasionally, until dry and toasted. Larger seeds may take longer.\nIn a large bowl, stir together 2 tablespoons of white sugar, salt, and pumpkin pie spice. Set aside. Heat the oil in a large skillet over medium-high heat. Add the pumpkin seeds and sprinkle the remaining sugar over them. Stir with a wooden spoon until the sugar melts, about 45 seconds. Pour seeds into the bowl with the spiced sugar and stir until coated. Allow to cool before serving. Store in an airtight container at room temperature.\n",
        "picture_link": "N0NI/EpaDhnDt.qKv6r66qAAm39ixZC"
    },
    {
        "title": "Gingerbread Biscotti",
        "ingredients": [
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/4 cup molasses ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 cup whole wheat flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1 1/2 tablespoons ground ginger ADVERTISEMENT",
            "3/4 tablespoon ground cinnamon ADVERTISEMENT",
            "1/2 tablespoon ground cloves ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Grease a cookie sheet.\nIn a large bowl, mix together oil, sugar, eggs, and molasses. In another bowl, combine flours, baking powder, ginger, cinnamon, cloves, and nutmeg; mix into egg mixture to form a stiff dough.\nDivide dough in half, and shape each half into a roll the length of the cookie. Place rolls on cookie sheet, and pat down to flatten the dough to 1/2 inch thickness.\nBake in preheated oven for 25 minutes. Remove from oven, and set aside to cool.\nWhen cool enough to touch, cut into 1/2 inch thick diagonal slices. Place sliced biscotti on cookie sheet, and bake an additional 5 to 7 minutes on each side, or until toasted and crispy.\n",
        "picture_link": "w5Vf82aAkbQh941DvkoktiltyBog1Xi"
    },
    {
        "title": "Steakhouse Wheat Bread for the Bread Machine",
        "ingredients": [
            "3/4 cup warm water ADVERTISEMENT",
            "1 tablespoon butter, softened ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon instant coffee granules ADVERTISEMENT",
            "1 tablespoon unsweetened cocoa powder ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 cup bread flour ADVERTISEMENT",
            "1 cup whole wheat flour ADVERTISEMENT",
            "1 1/4 teaspoons bread machine yeast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the warm water, butter, honey, salt, coffee, cocoa, sugar, bread flour, whole wheat flour, and bread machine yeast in the pan of a bread machine in the order listed. Put on regular or basic cycle with light crust.\n",
        "picture_link": "xWgxFgRXbQwJucA/MamxCyrYpU.gQ2y"
    },
    {
        "title": "Rhubarb Cake I",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "2 cups rhubarb, chopped ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, cream together butter or margarine and sugar. Beat in egg and vanilla.\nIn another bowl, sift together 2 cups flour, soda, and salt. Add sifted ingredients alternately with buttermilk to creamed mixture.\nToss rhubarb with 1 tablespoon flour, and stir into batter. Spoon batter into buttered 9 x 13 inch pan, and smooth the surface.\nBlend together 1/4 cup butter or margarine, cinnamon, and brown sugar; sprinkle evenly over batter.\nBake at 350 degrees F (175 degrees C) for 45 minutes.\n",
        "picture_link": "GYUw49ebNCK7Ma2eLIB6tCp0A9VbT82"
    },
    {
        "title": "Lentils And Spinach",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "2 white onions, halved and sliced into 1/2 rings ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup lentils ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 (10 ounce) package frozen spinach ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a heavy pan over medium heat. Saute onion for 10 minutes or so, until it begins to turn golden. Add minced garlic and saute for another minute or so.\nAdd lentils and water to the saucepan. Bring mixture to a boil. Cover, lower heat, and simmer about 35 minutes, until lentils are soft ( this may take less time, depending on your water and the lentils).\nMeanwhile cook the spinach in microwave according to package directions. Add spinach, salt and cumin to the saucepan. Cover and simmer until all is heated, about ten minutes. Grind in plenty of pepper and press in extra garlic to taste.\n",
        "picture_link": "iGkiicCqUqOpGm38mQztQHaPQma7GPy"
    },
    {
        "title": "Baby BLT",
        "ingredients": [
            "1 pound bacon, cooked and crumbled ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/4 cup green onions, chopped ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "24 cherry tomatoes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large, deep skillet. Cook over medium high heat for 6 to 8 minutes, or until evenly brown. Once cooled, crumble and set aside.\nIn a bowl, stir together the mayonnaise, bacon, green onions, and parsley until well blended. Set aside.\nCut a small slice from the top of each tomato. Using a melon baller or small spoon, scoop out the inside of each tomato and discard. Fill each tomato with the bacon mixture, and refrigerate for 1 hour. Serve chilled.\n",
        "picture_link": "4cvcF1NHIuuFDtw119cGteiCmH.JbmW"
    },
    {
        "title": "Butter Rich Spritz Butter Cookies",
        "ingredients": [
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "1 1/4 cups confectioners' sugar ADVERTISEMENT",
            "2 egg yolks ADVERTISEMENT",
            "1/2 teaspoon almond extract ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 400 degrees F (200 degrees C). Sift together the flour and salt; set aside.\nIn a medium bowl, cream together the butter and sugar. Stir in the egg yolks, almond extract and vanilla extract. Gradually blend in the sifted ingredients. Fill a cookie press with dough and shoot cookies about 1 1/2 inches apart onto an ungreased cookie sheet. If you like, decorate with sugar or sprinkles at this time.\nBake for 6 to 8 minutes in the preheated oven.\n",
        "picture_link": "HUR7GwKdCrFvpoXz8XQuR.mCrNzU2vK"
    },
    {
        "title": "Easy Ham and Cheese Appetizer Sandwiches",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "3 tablespoons poppy seeds ADVERTISEMENT",
            "1 onion, grated ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "2 tablespoons prepared Dijon-style mustard ADVERTISEMENT",
            "2 (12 ounce) packages white party rolls ADVERTISEMENT",
            "1/2 pound chopped cooked ham ADVERTISEMENT",
            "5 ounces shredded Swiss cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl, mix together butter, poppy seeds, onion, Worcestershire sauce and prepared Dijon-style mustard.\nSlice rolls in half horizontally and set aside tops. Spread bottoms with the butter mixture. Top with ham and Swiss cheese. Replace tops.\nArrange rolls in a single layer in a medium baking dish. Bake in the preheated oven 10 to 12 minutes, until rolls are lightly browned and cheese is melted.\n",
        "picture_link": "hbJ.2ejjzxv9DwVvkEM4fqa7ofe2AI2"
    },
    {
        "title": "Perfect Ten Baked Cod",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 sleeve buttery round crackers (such as Ritz®), crushed ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 pound thick-cut cod loin ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "1/4 cup dry white wine ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "1 tablespoon chopped green onion ADVERTISEMENT",
            "1 lemon, cut into wedges ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nPlace 2 tablespoons butter in a microwave-safe bowl; melt in microwave on high, about 30 seconds. Stir buttery round crackers into melted butter.\nPlace remaining 2 tablespoons butter in a 7x11-inch baking dish. Melt in the preheated oven, 1 to 3 minutes. Remove dish from oven.\nCoat both sides of cod in melted butter in the baking dish.\nBake cod in the preheated oven for 10 minutes. Remove from oven; top with lemon juice, wine, and cracker mixture. Place back in oven and bake until fish is opaque and flakes easily with a fork, about 10 more minutes.\nGarnish baked cod with parsley and green onion. Serve with lemon wedges.\n",
        "picture_link": "ShlWk2vZ9PjvEZajAMynNXI1ffwkdpG"
    },
    {
        "title": "Sour Cream Pound Cake",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 pinch baking soda ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease and flour a 8x4 inch loaf pan.\nIn a large bowl, cream butter and sugar until light and fluffy. Add sour cream and eggs.\nAdd flour and pinch of soda, mix well. Pour into a 8x4 inch loaf pan.\nBake at 375 degrees F (190 degrees C) for 1 hour, or until a toothpick inserted into center of cake comes out clean.\n",
        "picture_link": "zQZQMqfoSjvSuIJB4PCvhfZ3EA8oi.q"
    },
    {
        "title": "Apple Cinnamon White Cake",
        "ingredients": [
            "1/3 cup brown sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 3/4 teaspoons baking powder ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 apple, peeled and chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x5-inch loaf pan.\nMix brown sugar and cinnamon together in a bowl.\nBeat white sugar and butter together in a bowl using an electric mixer until smooth and creamy. Beat in eggs, 1 at a time, until incorporated; add vanilla extract.\nCombine flour and baking powder together in a bowl; stir into creamed butter mixture. Mix milk into batter until smooth. Pour half the batter into the prepared loaf pan; add half the apples and half the brown sugar mixture. Lightly pat apple mixture into batter. Pour the remaining batter over apple layer; top with remaining apples and brown sugar mixture. Lightly pat apples into batter; swirl brown sugar mixture through apples using a finger or spoon.\nBake in the preheated oven until a toothpick inserted in the center of the loaf comes out clean, 30 to 40 minutes.\n",
        "picture_link": "2bk3Tm22lFXh2WmSRIbCeTj7m/2Qove"
    },
    {
        "title": "Quick and Easy Clam Chowder",
        "ingredients": [
            "1 (10.75 ounce) can condensed cream of celery soup ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of potato soup ADVERTISEMENT",
            "1 (10.75 ounce) can New England clam chowder ADVERTISEMENT",
            "2 (6.5 ounce) cans minced clams ADVERTISEMENT",
            "1 quart half-and-half cream ADVERTISEMENT",
            "1 pint heavy whipping cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix cream of celery soup, cream of potato soup, clam chowder, 1 can undrained clams, 1 can drained clams, half-and-half cream, and whipping cream into a slow cooker.\nCover, and cook on low for 6 to 8 hours.\n",
        "picture_link": "va16CGeSV/pwY4Ip9CxJN4WDjkepaUi"
    },
    {
        "title": "Grilled Salmon II",
        "ingredients": [
            "4 (4 ounce) fillets salmon ADVERTISEMENT",
            "1/4 cup peanut oil ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "2 tablespoons thinly sliced green onion ADVERTISEMENT",
            "1 1/2 teaspoons brown sugar ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "3/4 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1/2 teaspoon sesame oil ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together peanut oil, soy sauce, balsamic vinegar, green onions, garlic, brown sugar, ginger, red chile flakes, sesame oil, and salt. Place fish in a glass dish, and pour marinade over all. Cover with plastic wrap, and refrigerate for 4 to 6 hours.\nPreheat barbecue or gas grill.\nOil the grill rack, and adjust height to 5 inches from coals. Remove salmon from marinade, and place on grill. Grill for 10 minutes per inch of thickness, measured at thickest part, or until fish just flakes when tested with a fork. Turn halfway through cooking.\n",
        "picture_link": "Gg4/w7bdyZr9QZnuacKwpzZ8SvNMBVC"
    },
    {
        "title": "Puttanesca I",
        "ingredients": [
            "8 ounces pasta ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "2 cups chopped tomatoes, pushed through a sieve ADVERTISEMENT",
            "4 anchovy filets, rinsed and chopped ADVERTISEMENT",
            "2 tablespoons tomato paste ADVERTISEMENT",
            "3 tablespoons capers ADVERTISEMENT",
            "20 Greek olives, pitted and coarsely chopped ADVERTISEMENT",
            "1/2 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook pasta in boiling water for 8 to 10 minutes or until al dente; drain.\nHeat oil in a skillet over low heat; cook garlic in oil until golden. Add sieved tomatoes, and cook 5 minutes. Stir in anchovies, tomato paste, capers, olives, and red pepper flakes. Cook 10 minutes, stirring occasionally.\nToss pasta with sauce, and serve.\n",
        "picture_link": "EVsYS9qMXFHbHAfQsgIbykn3nobrbpa"
    },
    {
        "title": "Banana Bread - Quick Bread for Machines",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 bananas, peeled and halved lengthwise ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ingredients in the pan of the bread machine.\nSelect the Dough setting, and press Start. Mix the bread for 3 to 5 minutes until the bananas are mashed and all ingredients are thoroughly combined. If necessary, use a rubber spatula to push the dough from the sides of the bread pan. When 3 to 5 minutes have passed on the clock display, press Stop. Do not continue mixing. Smooth out the top of the loaf with the rubber spatula.\nSelect the Bake setting, and press Start. The Bake cycle time may vary with machines, but should be about 50 minutes. To test the bread for doneness, insert a toothpick into the center top. Remove the toothpick. If the bread is done, the toothpick will come out clean. If there is batter on the toothpick, reset the machine on Bake and continue to bake an additional 10 to 15 minutes. Test again with the toothpick to ensure the bread is completely baked. Remove the pan from the machine, but allow the bread to remain in the pan for 10 minutes. Remove the bread to cool completely on a wire rack.\n",
        "picture_link": "s7sorRqkysLymmbSJUJhvFIULlbHUx2"
    },
    {
        "title": "Easy Slow Cooker Chicken",
        "ingredients": [
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of celery soup ADVERTISEMENT",
            "1 cup white rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut chicken breasts into large chunks.\nPlace the chicken breasts, cream of chicken soup, cream of mushroom soup, cream of celery soup and the rice in a slow cooker. Cook on high for 3 hours or low for 4 hours.\n",
        "picture_link": "BDUrowOry.2jumaUD6a1kdTPx5P.ovq"
    },
    {
        "title": "Bacon Water Chestnut Rolls",
        "ingredients": [
            "1 (8 ounce) can water chestnuts, halved ADVERTISEMENT",
            "1/2 pound sliced bacon, cut in half ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "1/2 cup packed light brown sugar ADVERTISEMENT",
            "1/4 cup tomato-based chili sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nWrap each water chestnut with a piece of bacon. Place the rolls seam-side down in a baking dish.\nBake in the preheated oven for 30 minutes, or until bacon is crisp and cooked through. Drain off the grease. In a small bowl, stir together the mayonnaise, brown sugar and chili sauce; pour over the bacon-chestnut rolls. Return to the oven and bake for another 30 minutes.\n",
        "picture_link": "GRG0YVkVFcpdXzJf9Sd/Ajd7LLjCcPm"
    },
    {
        "title": "Kale, Quinoa, and Avocado Salad with Lemon Dijon Vinaigrette",
        "ingredients": [
            "Salad ADVERTISEMENT",
            "2/3 cup quinoa ADVERTISEMENT",
            "1 1/3 cups water ADVERTISEMENT",
            "1 bunch kale, torn into bite-sized pieces ADVERTISEMENT",
            "1/2 avocado - peeled, pitted, and diced ADVERTISEMENT",
            "1/2 cup chopped cucumber ADVERTISEMENT",
            "1/3 cup chopped red bell pepper ADVERTISEMENT",
            "2 tablespoons chopped red onion ADVERTISEMENT",
            "1 tablespoon crumbled feta cheese ADVERTISEMENT",
            "Dressing ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1 1/2 tablespoons Dijon mustard ADVERTISEMENT",
            "3/4 teaspoon sea salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring the quinoa and 1 1/3 cup water to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until the quinoa is tender, and the water has been absorbed, about 15 to 20 minutes. Set aside to cool.\nPlace kale in a steamer basket over 1 inch of boiling water in a saucepan. Cover saucepan with a lid and steam kale until hot, about 45 seconds; transfer to a large plate. Top kale with quinoa, avocado, cucumber, bell pepper, red onion, and feta cheese.\nWhisk olive oil, lemon juice, Dijon mustard, sea salt, and black pepper together in a bowl until the oil emulsifies into the dressing; pour over the salad.\n",
        "picture_link": "mA3ppo89D2UrkGiA4iRX2S/WpDROzXC"
    },
    {
        "title": "Seminary Muffins",
        "ingredients": [
            "1 egg ADVERTISEMENT",
            "1 1/3 cups mashed ripe banana ADVERTISEMENT",
            "3/4 cup packed brown sugar ADVERTISEMENT",
            "1/3 cup applesauce ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 1/4 teaspoons salt ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 cup quick cooking oats ADVERTISEMENT",
            "1/2 cup semisweet chocolate chips ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease one 12 cup muffin pan.\nIn a large bowl, combine egg, banana, brown sugar, applesauce and vanilla. In a separate bowl, sift together flour, baking soda, baking powder, salt and cinnamon.\nGently stir flour mixture and oatmeal into banana mixture. Fold in chocolate chips and walnuts. Pour batter into prepared muffin cups.\nBake in preheated oven or 15 to 20 minutes, or until light brown. Remove muffins from pan and place on a wire rack to let cool before serving.\n",
        "picture_link": "n2nFC/TyTHVKtO7AOm0y1.ZoA.znQ2C"
    },
    {
        "title": "Miso Soup",
        "ingredients": [
            "2 teaspoons dashi granules ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "3 tablespoons miso paste ADVERTISEMENT",
            "1 (8 ounce) package silken tofu, diced ADVERTISEMENT",
            "2 green onions, sliced diagonally into 1/2 inch pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan over medium-high heat, combine dashi granules and water; bring to a boil. Reduce heat to medium, and whisk in the miso paste. Stir in tofu. Separate the layers of the green onions, and add them to the soup. Simmer gently for 2 to 3 minutes before serving.\n",
        "picture_link": "H5nZaILq1zRGIxII89dYXpLF7yUPi6G"
    },
    {
        "title": "Vanilla Ice Cream V",
        "ingredients": [
            "2 quarts half-and-half cream ADVERTISEMENT",
            "1/2 pint heavy cream ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "4 teaspoons vanilla extract ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine half-and-half, cream, sugar, vanilla and salt in freezer container of ice cream maker. Freeze according to manufacturer's instructions.\n",
        "picture_link": "qBJGfwLqiPkIaeL9hS6IbMgZCI9eAqK"
    },
    {
        "title": "Italian Chicken Skillet",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves, cubed ADVERTISEMENT",
            "2 cloves garlic, chopped, or to taste ADVERTISEMENT",
            "1/2 cup red cooking wine ADVERTISEMENT",
            "1 (28 ounce) can Italian-style diced tomatoes ADVERTISEMENT",
            "8 ounces small seashell pasta ADVERTISEMENT",
            "5 ounces fresh spinach, chopped ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large skillet with a lid over medium heat, and cook and stir the chicken and garlic until the chicken is no longer pink in the center, 5 to 8 minutes. Pour the wine and diced tomatoes with their juice into the skillet, and bring to a boil over high heat while scraping any browned bits of food off of the bottom of the pan with a wooden spoon.\nStir in the shell pasta, and return to a boil. Cook uncovered, stirring occasionally, until the shells have cooked through, but are still firm to the bite, about 10 minutes. Spread the spinach over the top of the pasta, cover, and simmer until the spinach leaves are cooked, about 5 minutes. Sprinkle the mozzarella cheese evenly over the skillet, and simmer until the cheese has melted and the pasta is bubbling, about 5 minutes.\n",
        "picture_link": "XNQcaISG2lcgb9ng93WIaV7fLPGtB2m"
    },
    {
        "title": "Roasted Potatoes with Greens",
        "ingredients": [
            "6 small red potatoes, quartered ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon fresh rosemary, chopped ADVERTISEMENT",
            "sea salt and ground black pepper to taste ADVERTISEMENT",
            "1 cup fresh spinach leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 400 degrees F (200 degrees C).\nPlace the potatoes in a single layer in a ceramic casserole dish. Melt the butter in a skillet over medium heat. Add garlic, and cook until golden. Stir in the rosemary, and cook just until fragrant. Pour over the potatoes in the dish. Season with sea salt and pepper.\nRoast uncovered for about 30 minutes in the preheated oven, until the potatoes are fork tender. Remove from the oven, and toss with the spinach leaves. Return to the oven for 1 to 2 minutes, until the spinach has wilted.\n",
        "picture_link": "HMtMgwkJ6G9UnXyCgisuLWGjor4r5vW"
    },
    {
        "title": "Chicken Delicious",
        "ingredients": [
            "10 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 teaspoon fresh lemon juice ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/8 teaspoon celery salt ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of celery soup ADVERTISEMENT",
            "1/3 cup dry sherry ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse the chicken breasts and pat dry. Season with the lemon juice, salt, pepper, celery salt and paprika to taste. Place in a slow cooker.\nIn a medium size bowl mix the mushroom and celery soups with the sherry/wine. Pour mixture over the chicken breasts and sprinkle with grated Parmesan cheese.\nCook on LOW setting for 8 to 10 hours, OR on HIGH setting for 4 to 5 hours.\n",
        "picture_link": "yL0POUE4N13oUrszpSWHfJVzikLO9m6"
    },
    {
        "title": "Aunt Blanche's Blueberry Muffins",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups fresh blueberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour muffin pan or use paper liners. Sift flour, baking powder and salt together and set aside.\nCream butter and sugar until light and fluffy. Add eggs and beat well. Add milk and flour mixture. Beat until combined. Stir in blueberries.\nFill muffin cups 2/3 full. Bake at 350 degrees F (175 degrees C) for 25 to 30 minutes.\n",
        "picture_link": "TjThYyBcEnave6DGDb8UyzlRkrnIrim"
    },
    {
        "title": "Cajun Chicken and Sausage Gumbo",
        "ingredients": [
            "1 cup vegetable oil ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 large green bell pepper, chopped ADVERTISEMENT",
            "2 celery stalks, chopped ADVERTISEMENT",
            "1 pound andouille or smoked sausage, sliced 1/4 inch thick ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "Creole seasoning to taste ADVERTISEMENT",
            "6 cups chicken broth ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1 rotisserie chicken, boned and shredded ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a Dutch oven over medium heat. When hot, whisk in flour. Continue whisking until the roux has cooked to the color of chocolate milk, 8 to 10 minutes. Be careful not to burn the roux. If you see black specks in the mixture, start over.\nStir onion, bell pepper, celery, and sausage into the roux; cook 5 minutes. Stir in the garlic and cook another 5 minutes. Season with salt, pepper, and Creole seasoning; blend thoroughly. Pour in the chicken broth and add the bay leaf. Bring to a boil over high heat, then reduce heat to medium-low, and simmer, uncovered, for 1 hour, stirring occasionally. Stir in the chicken, and simmer 1 hour more. Skim off any foam that floats to the top during the last hour.\n",
        "picture_link": "mjZSIVo/ARjxaAa3nPFIxZIcwACMxQi"
    },
    {
        "title": "Garlic Shrimp Scampi",
        "ingredients": [
            "1 (8 ounce) package angel hair pasta ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2 cloves garlic, sliced ADVERTISEMENT",
            "1 1/2 pounds shrimp, peeled and deveined ADVERTISEMENT",
            "1/3 cup white wine ADVERTISEMENT",
            "3/4 cup dry bread crumbs ADVERTISEMENT",
            "3 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of salted water to a boil. Add angel hair pasta and return pot to boil. Cook until al dente. Drain well.\nIn a large saucepan, melt butter, saute garlic until tender, remove garlic and discard. Add shrimp and cook until colored pink. Stir in white wine. The bread crumbs are used as thickening, so stir in a little at a time until desired thickness is reached.\nServe shrimp over angel hair pasta, sprinkled with Parmesan cheese.\n",
        "picture_link": "dB3u8TBwfsWUKki0pxhr1sdn606gsWC"
    },
    {
        "title": "Barbeque Beef Casserole",
        "ingredients": [
            "2 pounds ground beef ADVERTISEMENT",
            "1 large onion, diced ADVERTISEMENT",
            "1 green bell pepper, seeded and diced ADVERTISEMENT",
            "1 (10 ounce) can whole kernel corn, drained ADVERTISEMENT",
            "1/2 cup barbeque sauce ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes, drained ADVERTISEMENT",
            "3 (8.5 ounce) packages corn bread mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 400 degrees F (200 degrees C).\nCrumble the ground beef into a large skillet over medium-high heat. Cook until evenly browned. Add the onion, bell pepper, corn and tomatoes. Cook and stir until vegetables are tender. Drain excess grease, and stir in the barbeque sauce. Spread the beef mixture in an even layer in a 9x13 inch baking dish.\nPrepare the cornbread batter mixes according to package directions. Spread the batter over the top of the beef mixture.\nBake for 20 to 25 minutes in the preheated oven, until the top is golden brown, and a knife inserted into the center of the cornbread layer comes out clean.\n",
        "picture_link": "GpifGNwXlAyZXCB/Y/Wcn6j2uE/T6QK"
    },
    {
        "title": "Baked French Fries II",
        "ingredients": [
            "3 russet potatoes, sliced into 1/4 inch strips ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease a medium baking sheet.\nArrange potato strips in a single layer on the prepared baking sheet, skin sides down. Spray lightly with cooking spray, and sprinkle with basil, Parmesan cheese, salt and pepper.\nBake 25 minutes in the preheated oven, or until golden brown.\n",
        "picture_link": "vCSAquMi40nxhHsvwKnRYjUfMclsUc2"
    },
    {
        "title": "Sunshine Toast",
        "ingredients": [
            "2 tablespoons butter, divided ADVERTISEMENT",
            "1 slice bread ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt 1 tablespoon butter in a small skillet over medium heat.\nUsing a glass or cookie cutter, create a hole in the middle of the bread, removing the center so it is perfectly circular. Butter the bread lightly on both sides and lightly fry it on one side, and then turn it over. Crack the egg into the hole in the middle of the bread and fry quickly. Be careful that the bread does not burn. Serve warm.\n",
        "picture_link": "eZd.FK8.5kF5B4tx47OjH6TqNPOlO9."
    },
    {
        "title": "White Sauce",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small saucepan over medium heat, melt butter. Add flour and stir until the butter and flour are well combined. Pour in milk, stirring constantly as it thickens. Add more milk depending on desired consistency.\n",
        "picture_link": "vznJ7NASgVItl8RyBFdctiM6JLnLhHS"
    },
    {
        "title": "Egg in a Boat",
        "ingredients": [
            "1/2 tablespoon butter ADVERTISEMENT",
            "1 slice white bread ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Butter both sides of bread. Cut a circular hole in the center of the slice of bread, about 2 1/2 inches in diameter.\nHeat a frying pan or griddle on medium-high heat. When the frying pan is hot, place the bread into the pan and let it brown for one minute. Flip the toast over and let the other side brown for one minute.\nBreak the egg into the hole in the bread. Cook for 2 minutes, or until the egg is cooked to the consistency you prefer.\n",
        "picture_link": "O18a05Loy/MfdOsncX3mWwVFQ2HwgyS"
    },
    {
        "title": "Gingerbread Boys",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 1/2 tablespoons orange zest ADVERTISEMENT",
            "2 tablespoons dark corn syrup ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream the butter and the sugar together. Add the egg and mix well. Mix in the orange peel and dark corn syrup. Add the flour, baking soda, cinnamon, ginger, ground cloves and salt, mixing until well combined. Chill dough for at least 2 hours, I like to chill overnight.\nPreheat the oven to 375 degrees F (190 degrees C). Grease cookie sheets. On a lightly floured surface, roll dough out to 1/4 inch thick. Cut into desired shapes using cookie cutters. Place cookies 1 inch apart on the prepared cookie sheets.\nBake for 10 to 12 minutes in the preheated oven, until cookies are firm and lightly toasted on the edges.\n",
        "picture_link": "05tx9Su4AvFU7r6ss0dnH/Nl8n7/cFi"
    },
    {
        "title": "Pork Medallions with Balsamic Vinegar and Capers",
        "ingredients": [
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon garlic salt, or to taste ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper, or to taste ADVERTISEMENT",
            "2 pounds pork tenderloin, cut into 1 1/2 inch pieces ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/3 cup balsamic vinegar ADVERTISEMENT",
            "1/2 cup chicken broth ADVERTISEMENT",
            "2 teaspoons minced lemon zest, or to taste ADVERTISEMENT",
            "1 tablespoon capers, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the flour, garlic salt, and pepper into a plastic bag. Shake to mix, the add the pork tenderloin pieces, and shake again to coat. Shake off the excess flour.\nHeat the oil in a large skillet over medium-high heat. Cook the pork medallions in the hot oil until golden-brown on both sides, 2 to 3 minutes per side. Pour in the balsamic vinegar and chicken broth. Bring to a boil, then reduce heat to medium, and simmer until the pork is no longer pink in the center, 3 to 4 minutes. Remove the pork to a serving platter, then stir the lemon zest and capers into the simmering sauce. Continue simmering until the sauce has thickened to your desired consistency.\n",
        "picture_link": "d.f7oHDX/Hi8XQk91U8LCRlgRnwPCGm"
    },
    {
        "title": "Moist Banana Muffins",
        "ingredients": [
            "2 cups flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "3 ripe bananas, mashed ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1/2 cup chocolate chips (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease 12 muffin cups or line with paper muffin liners.\nStir the flour, baking soda, baking powder, and sugar together in a bowl. Add the bananas, mayonnaise, and chocolate chips; stir until well combined. Pour into prepared muffin cups to about 3/4 full.\nBake in the preheated oven until golden and the tops spring back when lightly pressed, about 20 minutes.\n",
        "picture_link": "m.KGPwW36Jhe8.YjSTKn0pkgssy6AAu"
    },
    {
        "title": "All-Around Good Smoothie",
        "ingredients": [
            "1/2 cup nonfat milk ADVERTISEMENT",
            "1/2 cup fat-free plain yogurt ADVERTISEMENT",
            "1/2 frozen banana, peeled and chopped ADVERTISEMENT",
            "2 tablespoons powdered protein supplement ADVERTISEMENT",
            "1 1/2 tablespoons flax seed ADVERTISEMENT",
            "1 teaspoon honey ADVERTISEMENT",
            "1/2 cup frozen strawberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender, blend the milk, yogurt, banana, protein supplement, flax seed, honey, and strawberries until smooth.\n",
        "picture_link": "o3ljEgj2m4Xl50Y0.cy52cmFPCBGPyi"
    },
    {
        "title": "Chicken Alfredo",
        "ingredients": [
            "6 ounces dry fettuccine pasta ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "6 tablespoons butter ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 skinless, boneless chicken breast halves - cooked and cubed ADVERTISEMENT",
            "2 cups chopped fresh broccoli ADVERTISEMENT",
            "2 small zucchini, julienned ADVERTISEMENT",
            "1/2 cup chopped red bell pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta, and cook for 8 to 10 minutes, or until al dente; drain.\nWhile pasta is cooking, melt cream cheese and butter in a skillet over low heat. Stir until smooth. Stir in milk, and season with garlic powder, salt, and pepper. Simmer for 3 minutes, or until thickened, stirring constantly.\nMix in chicken, broccoli, zucchini, and red pepper. Cook 3 minutes over medium heat, then reduce heat, and simmer 5 minutes, or until vegetables are tender. Serve over fettuccine.\n",
        "picture_link": "DEpdyeAQLa0o./EMzhk5GcflNRFXAsu"
    },
    {
        "title": "Pat's Mushroom Saute",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 tablespoon olive oil ADVERTISEMENT",
            "1/2 tablespoon balsamic vinegar ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/8 teaspoon dried oregano ADVERTISEMENT",
            "1 pound button mushrooms, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter with oil in a large skillet over medium heat. Stir in balsamic vinegar, garlic, oregano, and mushrooms. Saute for 20 to 30 minutes, or until tender.\n",
        "picture_link": "wusHFZ6/7vdzUNHRj6xzq20CAFr2lfS"
    },
    {
        "title": "Bread Machine Challah I",
        "ingredients": [
            "3/4 cup milk ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3 tablespoons margarine ADVERTISEMENT",
            "3 cups bread flour ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 1/2 teaspoons active dry yeast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Add ingredients to the pan of the bread machine in the order suggested by the manufacturer.\nSelect Basic Bread and Light Crust settings. Start.\n",
        "picture_link": "TWyxDXGpMkvA70FSH3QhCWOlOlmBlhu"
    },
    {
        "title": "Cheesy Zucchini Casserole I",
        "ingredients": [
            "4 slices bread, cubed ADVERTISEMENT",
            "1/4 cup melted butter ADVERTISEMENT",
            "2 cups cubed zucchini ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 teaspoon garlic salt ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace bread cubes in a medium bowl and pour melted butter over the bread. Add the zucchini, onion, garlic salt and egg; mix well. Transfer the mixture into a 9x13 inch baking dish and top with the cheese.\nBake, covered, in preheated oven for 30 minutes. Then uncover the dish and bake for another 30 minutes.\n",
        "picture_link": "0b1bOGhMVdlX6HkUW6rwNVRtqnQ4LtS"
    },
    {
        "title": "Sirloin Tips and Mushrooms",
        "ingredients": [
            "3 tablespoons olive oil ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 1/2 pounds beef sirloin ADVERTISEMENT",
            "1 (16 ounce) can mushrooms, with liquid ADVERTISEMENT",
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "freshly ground pepper, to taste ADVERTISEMENT",
            "3/4 cup red wine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut beef into cubes. In a large skillet over medium/high heat, heat the olive oil and brown beef cubes with the garlic.\nAdd mushrooms with liquid, tomato sauce, salt, pepper and red wine. Cook for 30 minutes or until beef cubes are tender. Add a little more wine while cooking if desired.\n",
        "picture_link": "OAXXjAws.PoMQ2DTNeYUnOdDHa78IHq"
    },
    {
        "title": "Banana Muffins I",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 cup mashed ripe banana ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/4 cup sour cream ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease muffin cups or line with paper muffin liners.\nMix together flour, baking powder, baking soda and salt. In a separate bowl, beat together banana, sugar, egg and vanilla. Stir in the sour cream. Stir banana mixture into flour until just combined. Scoop batter into prepared muffin cups.\nBake in preheated oven for 15 to 20 minutes, or until a toothpick inserted into center of a muffin comes out clean. Let cool before serving. For best flavor, place in an airtight container or bag overnight.\n",
        "picture_link": ".vOyYLoi2hdMBIpPg0wQ1j3OWLNQYnS"
    },
    {
        "title": "Grain and Nut Whole Wheat Pancakes",
        "ingredients": [
            "1 1/2 cups old-fashioned oatmeal ADVERTISEMENT",
            "1 1/2 cups whole wheat flour ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups buttermilk ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/3 cup sugar ADVERTISEMENT",
            "3 tablespoons chopped walnuts (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grind the oats in a blender or food processor until fine. In a large bowl, combine ground oats, whole wheat flour, baking soda, baking powder, and salt.\nIn another bowl, combine buttermilk, milk, oil, egg, and sugar with an electric mixer until smooth. Mix wet ingredients into dry with a few swift strokes. Stir in nuts, if desired.\nLightly oil a skillet or griddle, and preheat it to medium heat. Ladle 1/3 cup of the batter onto the hot skillet; cook the pancakes for 2 to 4 minutes per side, or until brown.\n",
        "picture_link": "vsT3R2Q3O07BUjKtZ1Jo6jzHWXaICh6"
    },
    {
        "title": "Warm Crab Parmesan Dip",
        "ingredients": [
            "1 (4.5 ounce) can crabmeat, drained ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1 1/2 cups grated Parmesan cheese ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "4 cloves garlic, peeled and crushed (or to taste) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a small baking dish, mix the crabmeat, cream cheese, mayonnaise, Parmesan cheese, sour cream and garlic.\nBake uncovered in the preheated oven until bubbly and lightly browned, about 45 minutes.\n",
        "picture_link": "x.uUU49lY/VlVgyvWLewCtKTisOqXsa"
    },
    {
        "title": "Apple Enchiladas",
        "ingredients": [
            "1 (21 ounce) can apple pie filling ADVERTISEMENT",
            "6 (8 inch) flour tortillas ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 2 quart baking dish.\nSpoon about one heaping quarter cup of pie filling evenly down the center of each tortilla. Sprinkle with cinnamon; roll up, tucking in edges; and place seam side down in prepared dish.\nIn a medium saucepan over medium heat, combine butter, white sugar, brown sugar and water. Bring to a boil, stirring constantly; reduce heat and simmer 3 minutes. Pour sauce over enchiladas and let stand 30 minutes.\nBake in preheated oven 20 minutes, or until golden.\n",
        "picture_link": "DwnZrw.H.eetBRwy3igOcz6PnRw/fki"
    },
    {
        "title": "Sweet Potato Casserole VI",
        "ingredients": [
            "4 cups mashed sweet potatoes ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/3 cup butter, melted ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1/3 cup butter, melted ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a mixing bowl, combine the sweet potatoes, sugar, eggs, milk, salt, 1/3 cup butter and vanilla. Mix together and pour into a greased 13x9 inch baking dish.\nTo prepare the topping, combine in a separate bowl the brown sugar, flour, 1/3 cup melted butter and pecans. Mix together and crumble over sweet potato mixture. Bake uncovered at 350 degrees F (175 degrees C) for 35 to 45 minutes.\n",
        "picture_link": "Uo0.xw/FHhq8gxwpv5nTEnSM0CDgqWC"
    },
    {
        "title": "Spiced Quinoa",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "3/4 cup quinoa ADVERTISEMENT",
            "1 1/2 teaspoons curry powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "1/2 teaspoon cumin ADVERTISEMENT",
            "1/4 teaspoon cinnamon ADVERTISEMENT",
            "1 1/2 cups chicken stock ADVERTISEMENT",
            "1 (14 ounce) can garbanzo beans, drained and rinsed ADVERTISEMENT",
            "1/2 cup toasted pine nuts ADVERTISEMENT",
            "1/2 cup raisins, soaked in hot water and drained (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together the olive oil, onion, and garlic in a saucepan over medium heat until the onion has softened and turned translucent, about 5 minutes. Stir in the quinoa, curry powder, salt, pepper, cumin, cinnamon, and chicken stock. Bring to a boil, then reduce heat to medium-low, cover, and simmer 20 minutes until the quinoa is tender.\nOnce the quinoa has finished cooking, stir in the drained garbanzo beans, toasted pine nuts, and raisins. Serve warm or cold.\n",
        "picture_link": "CUOwFn9uKzN.HhrwKh0a6xzxxzSk4TO"
    },
    {
        "title": "Spicy Honey Mustard Pork Roast",
        "ingredients": [
            "3 pounds pork roast ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "2 tablespoons Dijon mustard ADVERTISEMENT",
            "2 tablespoons black pepper ADVERTISEMENT",
            "1/2 teaspoon dried thyme, crushed ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C). Score 1/2 inch slits in your roast and place in baking dish.\nCombine honey, mustard, pepper, thyme, and salt in small bowl; mix until well blended. Brush mixture over roast, working well into slits.\nBake roast in preheated oven for one hour. Remove roast from oven and flip in pan. Brush remaining honey sauce over roast. Return to oven and continue baking for 45 minutes to an hour or until internal temperature reaches 145 degrees F (63 degrees C). Let stand for 15 minutes before slicing.\n",
        "picture_link": "xSHQxPF0AUgqXRjRTAEDVRybVbuZne."
    },
    {
        "title": "German Pancakes II",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "6 eggs, lightly beaten ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Melt butter in a medium baking dish.\nIn a medium bowl, mix flour, milk, eggs and salt. Pour the mixture into the prepared baking dish.\nBake on center rack in the preheated oven for 30 to 40 minutes, until golden brown.\n",
        "picture_link": "7Hr1Y41EjEVY9oZVSfM3iN6LQb9a1Z."
    },
    {
        "title": "Sweet Russian Cabbage Soup",
        "ingredients": [
            "1 1/2 pounds ground lean beef ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "4 cubes beef bouillon ADVERTISEMENT",
            "2 medium carrots, shredded ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 tablespoons white vinegar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "2 quarts water, divided ADVERTISEMENT",
            "3 cloves garlic, finely chopped ADVERTISEMENT",
            "1 head cabbage, cored and cut into wedges ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Crumble the ground beef into a large pot. Add the diced tomatoes, tomato sauce, beef bouillon cubes, carrots, onion, vinegar, sugar, salt and pepper. Pour in 1 quart of water, and bring to a boil. Stir to break up the beef while heating. Once the soup comes to a boil, cover and simmer for 30 minutes over low heat.\nPour in another quart of water, and return to a slow boil. Add garlic and cabbage. Simmer for 25 minutes, until cabbage is tender. Ladle into soup bowls to serve.\n",
        "picture_link": "M57fy.WACWWFyGfAIL5pxJBmHWZEsuS"
    }
]