[
    {
        "title": "Fiery Red Salsa",
        "ingredients": [
            "2 large garlic cloves ADVERTISEMENT",
            "1 (14.5 ounce) can whole tomatoes, drained ADVERTISEMENT",
            "1 medium white onion, quartered ADVERTISEMENT",
            "1/2 cup fresh cilantro leaves ADVERTISEMENT",
            "1 jalapeno, stemmed and quartered (or more to taste) ADVERTISEMENT",
            "1/2 teaspoon natural cane sugar, or to taste ADVERTISEMENT",
            "Kosher salt, to taste ADVERTISEMENT",
            "1 tablespoon lime juice ADVERTISEMENT",
            "1 (14.5 ounce) can whole tomatoes, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place first eight ingredients in Oster(R) Versa(R) Performance Blender in order listed. Add remaining can of tomatoes.\nSelect programmed DIP/SALSA setting.\n",
        "picture_link": "y1vVNN0Su4khGV7tSM0KwB6qjJn0ilG"
    },
    {
        "title": "Ginger Lemon Cheesecake Bars",
        "ingredients": [
            "Crust: ADVERTISEMENT",
            "1 (16 ounce) package gingersnap cookies, crushed ADVERTISEMENT",
            "1/3 cup brown sugar ADVERTISEMENT",
            "1/4 cup butter, melted, or as needed ADVERTISEMENT",
            "1 tablespoon ground ginger ADVERTISEMENT",
            "Cheesecake: ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "2 teaspoons lemon extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix cookies, brown sugar, butter, and ground ginger together in a bowl; press into the bottom of a 9x13-inch baking dish.\nBake in the preheated oven until lightly browned, 6 to 8 minutes. Remove crust from oven and cool to room temperature.\nProcess cream cheese, eggs, white sugar, lemon juice, and lemon extract in a food processor until smooth and creamy; spread over crust.\nBake in the preheated oven until cheesecake is set, 25 to 30 minutes.\nCool cheesecake to room temperature and refrigerate until chilled, about 1 hour.\n",
        "picture_link": "45YPjIaZ2iyb7tVjzvbNBfBhirr.jv6"
    },
    {
        "title": "Crunch's Lentil Salad",
        "ingredients": [
            "2 1/2 cups water ADVERTISEMENT",
            "1 cup lentils ADVERTISEMENT",
            "1/2 cup bulgur ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 teaspoon olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3 cloves garlic, minced, or more to taste ADVERTISEMENT",
            "3 roma (plum) tomatoes, seeded and diced, or more to taste ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "1/4 cup balsamic vinegar, or to taste ADVERTISEMENT",
            "2 tablespoons olive oil, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water and lentils to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until lentils are almost tender, about 15 minutes; add bulgur and salt. Cover saucepan and remove from heat; set aside until bulgur is tender and water is absorbed, about 20 minutes.\nHeat 1 teaspoon olive oil in a skillet over medium heat; cook and stir onion and garlic until until tender and fragrant, 5 to 10 minutes. Add tomatoes and red bell pepper; cook and stir until red bell pepper is tender, 5 to 10 minutes.\nCombine bulgur-lentil mixture and vegetable mixture in a bowl; add balsamic vinegar and 2 tablespoons olive oil and toss to coat.\n",
        "picture_link": "GgZICYciTqPG6LfBGo1dELLEvoCXGlW"
    },
    {
        "title": "Agave Almond Butter",
        "ingredients": [
            "1 1/2 cups unsalted natural whole almonds ADVERTISEMENT",
            "1/4 cup agave nectar ADVERTISEMENT",
            "1/8 teaspoon kosher salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place almonds, agave nectar and salt in Oster(R) Versa(R) Performance Blender; PULSE on HIGH 2 to 3 times.\nBlend on HIGH for 1-1/2 to 2 minutes or until creamy, using tamper to press ingredients into blade; transfer to a covered container.\nStore airtight in refrigerator.\n",
        "picture_link": "TlzSH.kEVVJQFwx9izDLU5rciUHFpqG"
    },
    {
        "title": "Sweet and Savory Fried Plantains",
        "ingredients": [
            "1 large yellow plantain, peeled ADVERTISEMENT",
            "1/8 teaspoon garlic powder ADVERTISEMENT",
            "1 tablespoon canola oil ADVERTISEMENT",
            "1/2 teaspoon reduced-fat margarine (such as Smart Balance®) ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon agave nectar ADVERTISEMENT",
            "1/3 teaspoon light brown sugar ADVERTISEMENT",
            "1 pinch ground cinnamon, or more to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut plantain into three sections. Quarter each section so you have twelve pieces. Season plantain pieces with garlic powder.\nHeat oil and margarine together in a small skillet over medium heat. Cook plantains in hot oil until lightly browned, 2 to 3 minutes per side; season with black pepper and continue to cook until slightly darker in color, 2 to 3 minutes more. Remove skillet from heat and drizzle agave syrup over the plantain pieces. Sprinkle brown sugar and cinnamon over the plantains.\n",
        "picture_link": "IfZhscmFan.a8mG7WFfr9yrvcFFou9y"
    },
    {
        "title": "Picnic Baked Bean Casserole",
        "ingredients": [
            "2 (15 ounce) cans pork and beans ADVERTISEMENT",
            "1 (16 ounce) can kidney beans, rinsed and drained ADVERTISEMENT",
            "1 (15 ounce) can lima beans, rinsed and drained ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "1/2 teaspoon dry mustard ADVERTISEMENT",
            "4 strips cooked bacon, crumbled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 2 1/2-quart baking dish.\nCombine pork and beans, kidney beans, lima beans, onion, brown sugar, ketchup, and dry mustard together in a bowl; transfer to the prepared baking dish. Sprinkle bacon over bean mixture. Cover dish with aluminum foil.\nBake in the preheated oven for 30 minutes. Remove aluminum foil and continue baking until bubbling, about 30 minutes more.\n",
        "picture_link": "21mzRr/lknBoOBqPZCimVEOsnnvkKgW"
    },
    {
        "title": "Cayenne Sugar Nuts",
        "ingredients": [
            "2/3 cup white sugar ADVERTISEMENT",
            "1/3 cup brown sugar ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "1 egg white, room temperature ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "1 pound whole pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Line a baking sheet with parchment paper.\nMix white sugar, brown sugar, salt, cinnamon, and cayenne pepper together in a bowl.\nBeat egg white and water together in a separate large bowl until frothy but not yet stiff; add pecans and stir to coat. Season nuts with the sugar mixture and spread onto the prepared baking sheet in a single layer.\nRoast in oven, turning occasionally, until the nuts are browned and no longer moist, about 30 minutes.\nSet baking sheet on a wire rack to cool nuts, breaking apart any nuts stuck together.\n",
        "picture_link": "B3wuJhbqZ/mZ5aJ25ekvL1KKMYBtvn2"
    },
    {
        "title": "Cranberry Orange Sauced Sweet Potatoes",
        "ingredients": [
            "6 medium sweet potatoes or yams ADVERTISEMENT",
            "1/4 cup Crisco® All-Vegetable Shortening or Crisco® Pure Vegetable Oil ADVERTISEMENT",
            "1/4 cup packed light brown sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 cup fresh orange juice ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 1/4 cups fresh cranberries, rinsed ADVERTISEMENT",
            "1/2 teaspoon cornstarch mixed with ADVERTISEMENT",
            "2 tablespoons cold water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 400 degrees F.\nWash sweet potatoes; pat dry. Prick with a fork; place in a shallow baking dish. Bake 40 to 50 minutes or until soft. During the last 10 minutes of baking, prepare sauce.\nMelt shortening in medium saucepan (or place oil in saucepan). Add brown sugar, salt, orange juice and water, stirring over low heat until sugar dissolves. Add cranberries; bring to a boil. Reduce heat; simmer, covered, 5 minutes or until cranberries start to pop.\nStir cornstarch mixture into cranberries; cook, stirring constantly, until sauce comes to a boil. Reduce heat and cook 1 to 2 minutes or until mixture is slightly thickened.\nMake a lengthwise cut in the center of each potato; press open from bottom. Place sweet potatoes on serving platter. Top each with cranberry sauce.\n",
        "picture_link": "JH9ICBswl9fD.gPhXPp7qNEioaVc32S"
    },
    {
        "title": "Bacon and Chipotle Potato Salad",
        "ingredients": [
            "1 1/2 pounds potatoes, peeled and cut into 1-inch cubes ADVERTISEMENT",
            "Salt to taste ADVERTISEMENT",
            "3/4 cup sour cream ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "2 tablespoons TABASCO® brand Chipotle Pepper Sauce ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "1/2 teaspoon finely chopped garlic ADVERTISEMENT",
            "3 slices bacon, cooked and crumbled ADVERTISEMENT",
            "2 hard-cooked eggs, coarsely chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes in a large saucepan and cover with water; add 2 teaspoons salt and bring to a boil.\nReduce heat to medium; cover and cook 12 to 15 minutes or until potatoes are tender. Drain and cool.\nMeanwhile, in a small bowl, combine sour cream, mayonnaise, TABASCO(R) Chipotle Sauce, mustard, and garlic; mix well.\nPlace potatoes in a large bowl with bacon and eggs. Add dressing and toss to coat. Season with additional salt, if needed. Cover and refrigerate.\n",
        "picture_link": "sy06Pnfr5CNE/pde9ZRJoJitAYzQWUS"
    },
    {
        "title": "Southern Pecan Pralines",
        "ingredients": [
            "Crisco® Original No-Stick Cooking Spray ADVERTISEMENT",
            "1 1/2 cups firmly packed brown sugar ADVERTISEMENT",
            "1 cup granulated sugar ADVERTISEMENT",
            "2/3 cup PET® Evaporated Milk ADVERTISEMENT",
            "1 tablespoon light corn syrup ADVERTISEMENT",
            "3 tablespoons Crisco® Butter Flavor All-Vegetable Shortening ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups coarsely chopped pecans ADVERTISEMENT",
            "1/4 teaspoon cream of tartar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Coat a baking sheet lightly with no-stick cooking spray.\nCombine brown sugar, granulated sugar, evaporated milk and corn syrup in 3-quart saucepan. Heat to boiling over medium heat, stirring constantly. Cover and boil 1 minute. Uncover. Cook over medium heat, without stirring, to 235 degrees F on candy thermometer. Remove from heat.\nAdd shortening, vanilla, pecans and cream of tartar. Stir with wooden spoon until mixture thickens slightly. Do not overstir. Let the mixture stand 3 minutes. Drop by rounded tablespoonfuls onto prepared baking sheet. Cool until firm.\n",
        "picture_link": "BqbwtpBKJ1eGMRv37dwIyvu3tdT5ifm"
    },
    {
        "title": "Pumpkin Seed Flatbread with Sweet Onions and Feta ",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 large onion, sliced ADVERTISEMENT",
            "1 teaspoon chopped fresh rosemary ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 tablespoon cornmeal ADVERTISEMENT",
            "1 prepared pizza dough ADVERTISEMENT",
            "1/4 teaspoon freshly ground black pepper ADVERTISEMENT",
            "4 ounces crumbled feta cheese ADVERTISEMENT",
            "1/2 cup raw pumpkin seeds, or to taste ADVERTISEMENT",
            "1/3 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nHeat olive oil in a skillet over medium-high heat; saute onion in hot oil until slightly softened, 3 to 4 minutes. Add rosemary and a pinch of salt; saute until onions are golden and soft, about 5 minutes more.\nSpread cornmeal over the bottom of a baking sheet. Stretch pizza dough in a thin layer onto baking sheet over cornmeal. Spread onions onto dough and sprinkle black pepper over the top. Sprinkle feta cheese, pumpkin seeds, and Parmesan cheese over the top of the onions.\nBake on the bottom rack of the preheated oven for 5 minutes. Rotate the baking sheet 180 degrees and bake 5 minutes more. Transfer baking sheet to the middle rack of the oven and bake until bread is golden, crispy, and cheese is melted, about 5 minutes. Transfer flatbread to a wire rack to cool.\n",
        "picture_link": "gP7yGT.WC5d5Xse2DCOFbTLwO2R.vW6"
    },
    {
        "title": "Creamy and Cheesy Ranch Dressing",
        "ingredients": [
            "1 cup low-fat cottage cheese ADVERTISEMENT",
            "2/3 cup skim buttermilk ADVERTISEMENT",
            "1/4 cup minced fresh chives ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "2 cloves garlic, pressed ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "salt to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine cottage cheese, buttermilk, chives, Parmesan cheese, and garlic in the bowl of a food processor fitted with the steel blade; process until smooth. Season the dressing with pepper and salt.\n",
        "picture_link": "CCLuty09jexOugxlS/0lNEUhL.HrKXi"
    },
    {
        "title": "Make-Ahead All-Dressed Baked Potatoes",
        "ingredients": [
            "4 (4 ounce) baking potatoes ADVERTISEMENT",
            "1/4 cup PHILADELPHIA Dill Cream Cheese Product ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1/4 cup KRAFT Double Cheddar Shredded Cheese ADVERTISEMENT",
            "2 tablespoons OSCAR MAYER Real Bacon Bits ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prick potatoes in several places. Microwave on HIGH 6 to 8 minutes or until tender, turning over and rearranging after 3 minutes. Cool 5 minutes.\nCut thin slice off top of each potato. Discard tops; scoop out centres into medium bowl, leaving 1/8-inch-thick shells. Mash potato flesh. Add cream cheese product, milk, cheese and bacon; mix well. Spoon into potato shells; wrap individually in foil. Refrigerate up to 24 hours.\nHeat barbecue to medium heat. Unwrap potatoes; place on barbecue grate. Grill 15 minutes or until heated through.\n",
        "picture_link": "53grd9ASzMJgvgf5GXYGufDcuL7qQFe"
    },
    {
        "title": "Mashed Potato Rolls",
        "ingredients": [
            "1/3 cup Idahoan® Original Mashed Potatoes, dry ADVERTISEMENT",
            "1/4 cup warm water (110 degrees to 115 degrees F) ADVERTISEMENT",
            "2 tablespoons sugar ADVERTISEMENT",
            "1 (.25 ounce) envelope active dry yeast* ADVERTISEMENT",
            "2 3/4 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3/4 cup warm milk, scalded and cooled to luke warm ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "Melted butter for brushing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place warm water and sugar in a small bowl. Sprinkle yeast on top and let sit for 10 minutes.\nSift together flour and salt; mix in potato flakes.\nIn a mixer bowl, combine yeast mixture, warm milk, butter and egg. Slowly beat in potato-flour mixture, one half cup at a time, until a soft dough is formed. If dough is sticky, add more flour, 2 tablespoons at a time until dough pulls away from sides of bowl and is easy to handle.\nPlace in a greased bowl and brush with melted butter. Cover and let rise in a warm place until double in bulk.\nPreheat oven to 425 degrees F.\nTurn out on a lightly floured board and roll 1/2 thick. Cut into 2 inch rounds with a floured biscuit cutter or cut into squares and roll up crescent style.\nPlace on greased baking sheets and let rise in a warm place for 45 minutes.\nBake for 25 minutes. Serve warm.\n",
        "picture_link": "dF3WWvhOF8r.0Xoeb5vNb3T5xoz/ggG"
    },
    {
        "title": "Fiesta Au Gratin",
        "ingredients": [
            "1 (4 ounce) package Idahoan® Au Gratin Homestyle Casserole ADVERTISEMENT",
            "3/4 cup chunky-style salsa ADVERTISEMENT",
            "1 (8 ounce) can corn ADVERTISEMENT",
            "1/2 cup shredded Mexican cheese ADVERTISEMENT",
            "1 (5 ounce) can diced chicken, drained ADVERTISEMENT",
            "Tortilla chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare Idahoan Au Gratin Homestyle Casserole according to stovetop or oven directions.\nAdd salsa, corn, cheese and chicken in the last 5 minutes of cook time.\nFinish cooking until all ingredients are heated through and sauce is thickened.\nTop with crushed tortilla chips.\n",
        "picture_link": "hWzGXtvOe.iUIuO649KKbydMArQ9XDa"
    },
    {
        "title": "Dark Chocolate Fudge with Mint Filled DelightFulls™",
        "ingredients": [
            "3/4 cup NESTLE® TOLL HOUSE® Delightfulls Mint Filled Morsels, divided ADVERTISEMENT",
            "1 2/3 cups NESTLE® TOLL HOUSE® Dark Chocolate Morsels ADVERTISEMENT",
            "1 (14 ounce) can NESTLE® CARNATION® Sweetened Condensed Milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line 8-inch-square baking pan with foil. Coarsely chop 1/4 cup DelightFulls morsels; set aside.\nCombine dark chocolate morsels and sweetened condensed milk in medium, heavy-duty saucepan. Warm over lowest possible heat, stirring until smooth. Remove from heat; stir in vanilla extract. Gently stir in remaining 1/2 cup DelightFulls morsels just until morsels are covered.\nSpread mixture evenly into prepared baking pan. Sprinkle with coarsely chopped DelightFulls morsels. Press gently into fudge. Refrigerate for 2 hours or until firm. Lift from pan; remove foil. Cut into pieces. Store refrigerated in airtight container.\n",
        "picture_link": "75Af4iq05Y6HqebBOGqE83tN3sgqYie"
    },
    {
        "title": "Decadent Omelette",
        "ingredients": [
            "2 tablespoons truffle oil or olive oil ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 truffle* ADVERTISEMENT",
            "Grated Parmesan cheese (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat truffle (or olive) oil in a non-stick 8-inch pan.\nBeat the eggs in a bowl until fluffy; pour into pan and let cook until the sides set.\nPush the sides slightly toward the center and let the uncooked egg fill the edges. Repeat until the omelette is set.\nAdd the cheese to one side of the omelette. Fold the omelette in half over the cheese and slide it onto a plate.\nShave truffles on top.\n",
        "picture_link": "9Vqjkjj6apDridAqw7GjhnyvkP6ndCe"
    },
    {
        "title": "Deep-Fried Peanuts ",
        "ingredients": [
            "oil, or as needed ADVERTISEMENT",
            "1 cup shelled raw peanuts ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C).\nCook peanuts in preheated oil until fragrant and hot, about 2 minutes. Transfer to paper-towel lined plates to drain. Season peanuts with salt.\n",
        "picture_link": "OjBv.ul3i1yZWZh1ZjSP25iV0bbX3QK"
    },
    {
        "title": "Best Vodka Sauce",
        "ingredients": [
            "2 tablespoons minced garlic ADVERTISEMENT",
            "1/2 cup vodka (such as Ciroc®) ADVERTISEMENT",
            "1 pint heavy whipping cream ADVERTISEMENT",
            "1 (28 ounce) jar tomato sauce ADVERTISEMENT",
            "1 (16 ounce) can crushed tomatoes ADVERTISEMENT",
            "1/2 cup freshly grated Parmesan cheese ADVERTISEMENT",
            "1 tablespoon chopped fresh basil ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large saucepan over high heat until the surface is very hot; add minced garlic and sear until brown, 1 to 2 minutes. Pour vodka into the saucepan, taking care to avoid any flames that ignite from the alcohol meeting the hot surface of the pan. Quickly pour cream into pan to douse the flames and stir; add tomato sauce, crushed tomatoes, Parmesan cheese, basil, and parsley.\nBring the mixture to a boil, remove from heat, and rest sauce long enough to let herbs flavor the sauce, 5 to 10 minutes.\n",
        "picture_link": "OsEZblYAY58BkqaLJgNu6YpJObqPuni"
    },
    {
        "title": "Vegetable Cobbler",
        "ingredients": [
            "1 1/2 cups peeled and chopped zucchini ADVERTISEMENT",
            "1 1/2 cups peeled and chopped carrots ADVERTISEMENT",
            "1 1/2 cups peeled and chopped butternut squash ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "4 teaspoons salt ADVERTISEMENT",
            "4 teaspoons ground black pepper ADVERTISEMENT",
            "2 prepared 8-inch pie pastries, divided ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease an 8-inch pie plate.\nMix zucchini, carrots, and butternut squash together in a large bowl. Sprinkle cornstarch, salt, and pepper over the vegetable mixture and toss to coat.\nLine pie plate with one of the pie pastries, trimming edges to fit the plate. Pour vegetable mixture over the pie pastry. Drizzle most of the melted butter over the vegetables. Place remaining pastry atop the vegetables. Press edges of the two pastries together to seal. Brush top of the \"cobbler\" with remaining butter. Cut several slits in the top pastry.\nBake in preheated oven until top is golden brown, about 30 minutes. Rest pie for 10 minutes before cutting to serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Waffle Sandwich",
        "ingredients": [
            "2 links pork sausage links ADVERTISEMENT",
            "1 slice Cheddar cheese ADVERTISEMENT",
            "2 frozen waffles, toasted ADVERTISEMENT",
            "1/4 Red Delicious apple, sliced very thin ADVERTISEMENT",
            "1/2 teaspoon cinnamon-sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a small skillet over medium heat. Cook the sausages in the hot skillet, turning occasionally, until no longer pink in the center, about 5 minutes. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C).\nPut Cheddar cheese atop 1 toasted waffle. Arrange apple slices over the cheese. Sprinkle cinnamon-sugar over the apple slices. Put sausage links atop the apples and finish sandwich with remaining waffle. Cut sandwich into halves.\n",
        "picture_link": "eJeWN/hqln0.hjUXLdKEA993cY.WMFa"
    },
    {
        "title": "Apple, Sausage & Cornbread Stuffing Cups",
        "ingredients": [
            "Crisco® Original No-Stick Cooking Spray ADVERTISEMENT",
            "3 cups cornbread stuffing mix ADVERTISEMENT",
            "1 cup chopped Granny Smith apple ADVERTISEMENT",
            "1/4 cup Crisco® Pure Canola Oil ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "1/2 cup chopped celery ADVERTISEMENT",
            "1 pound bulk pork sausage with sage ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1 egg, lightly beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 350 degrees F. Coat 12 muffin cups with no-stick cooking spray. Combine stuffing mix and apple in large bowl.\nHeat oil in large skillet over medium heat. Add onions and celery, cook 2 to 3 minutes or until tender. Add sausage. Cook 5 to 6 minutes until browned. Remove from heat. Combine sausage mixture, broth and egg with cornbread mixture. Press evenly into prepared muffin cups.\nBake 30 to 34 minutes or until lightly browned. Cool 5 minutes.\n",
        "picture_link": "pwJEX.htAihc78Vs5YV1UgkwrXdyMrm"
    },
    {
        "title": "Salt and Pepper Popcorn",
        "ingredients": [
            "3 tablespoons canola oil ADVERTISEMENT",
            "1 1/2 tablespoons rice flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "3/4 teaspoon ground black pepper ADVERTISEMENT",
            "8 cups popped popcorn ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir oil, rice flour, salt, onion powder, garlic powder, and black pepper together with a whisk in a small bowl until smooth; drizzle over popcorn in a large bowl and toss to coat.\n",
        "picture_link": "ICpV0Y1cqWOx0OtoyWimj3jZZI9lCKq"
    },
    {
        "title": "Nori Chips",
        "ingredients": [
            "1 sheet nori (dried seaweed), cut into thin strips ADVERTISEMENT",
            "1 teaspoon olive oil, or as needed ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C). Lightly oil a baking sheet.\nArrange nori smooth-side down on the prepared baking sheet. Lightly brush olive oil over nori; season with salt.\nBake in the preheated oven until nori is dry and crispy, 3 to 4 minutes.\n",
        "picture_link": "rMs2BqGHpiw6Gq.XSmYoDVA83SksG.S"
    },
    {
        "title": "Holiday Spritz Cookies",
        "ingredients": [
            "2 1/3 cups Pillsbury BEST® All Purpose Flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "1/2 stick Crisco® Baking Sticks Butter Flavor All-Vegetable Shortening ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 cup powdered sugar ADVERTISEMENT",
            "1 large egg ADVERTISEMENT",
            "1/2 teaspoon almond extract ADVERTISEMENT",
            "8 drops green food color ADVERTISEMENT",
            "1 (12 ounce) container Pillsbury® Funfetti® Garland Green Vanilla Flavored Frosting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 375 degrees F. Stir flour, salt and baking powder in medium bowl until well blended. Beat shortening, butter and powdered sugar in large bowl with electric mixer on medium speed until light and fluffy. Beat in egg, almond extract and food color. Beat in flour mixture gradually until blended.\nFit cookie press with Christmas tree or wreath plate according to manufacturer's instructions. Fill cookie press according to instructions. Press dough onto ungreased baking sheets. Bake 6 to 7 minutes or until set, but not brown. Cool 1 minute on baking sheet. Remove to wire rack to cool completely.\nPlace frosting in large heavy-duty resealable plastic bag. Microwave on HIGH 20 to 30 seconds to soften. Knead. Cut very small bottom corner off bag. Drizzle over cookies in a decorative pattern. Place candy bits from frosting in medium bowl. Hold cookie over bowl and sprinkle with candy bits. Let stand 15 minutes or until frosting is set.\n",
        "picture_link": "FNFE21Wf9uC8Vu2HBCwZPOG5uWrxes."
    },
    {
        "title": "Au Gratin-Pumpkin Layered Casserole",
        "ingredients": [
            "2 (3.95 ounce) packages Idahoan® Au Gratin Homestyle Casserole ADVERTISEMENT",
            "2 cups firmly packed fresh spinach or kale - washed, stemmed, and chopped ADVERTISEMENT",
            "1 (16 ounce) container ricotta cheese ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "Pumpkin Parmesan sauce, prepared (recipe follows) ADVERTISEMENT",
            "1 cup Parmesan cheese, shredded ADVERTISEMENT",
            "Pumpkin-Parmesan Pasta Sauce: ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 small shallot, chopped ADVERTISEMENT",
            "1/2 cup onion, chopped ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1 (15 ounce) can pumpkin puree ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1 cup half-and-half ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "1/4 teaspoon ground sage ADVERTISEMENT",
            "1/2 teaspoon freshly ground nutmeg ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1/2 teaspoon pepper ADVERTISEMENT",
            "1 cup Parmesan cheese, grated ADVERTISEMENT",
            "2 tablespoons fresh sage, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F.\nPrepare Au Gratin Homestyle Casserole following \"stove top\" directions on the package.\nIn a 9 x 13 casserole dish, layer half of the potatoes on the bottom of the dish. Sprinkle 1 cup of the spinach or kale over potatoes. Blend the ricotta and eggs together and use half of this mixture to layer on top of the spinach. Layer next with 1 1/2 cup of the pumpkin sauce.\nRepeat layers one more time, garnishing with Parmesan cheese.\nBake for 25-30 minutes. Let rest 5-10 minutes before cutting.\nPumpkin-Parmesan Pasta Sauce: In a large saucepan over medium high heat, add olive oil. Add shallots and onion and saute until translucent. Add garlic and saute one minute more. Add pumpkin, broth, cream, vinegar and spices to the onion, shallots, garlic mixture. Stir to blend and simmer on low for 5 minutes. Gradually stir in 1/3 of the cheese to the sauce until blended. Repeat with another 1/3 of the cheese. When cheese is melted add remaining cheese. Stir in chopped fresh sage.\n",
        "picture_link": "M06lnUkHYVtQKDuBCFtV0zXBhrXwE0e"
    },
    {
        "title": "S'Moretini",
        "ingredients": [
            "1 tablespoon graham cracker crumbs, or as needed ADVERTISEMENT",
            "2 fluid ounces chocolate liqueur (such as Godiva®) ADVERTISEMENT",
            "2 fluid ounces half-and-half ADVERTISEMENT",
            "1 1/2 fluid ounces marshmallow-flavored vodka (such as Smirnoff®) ADVERTISEMENT",
            "1 1/2 ounces Irish cream liqueur (such as Baileys®) ADVERTISEMENT",
            "4 miniature marshmallows, lightly toasted, or more to taste ADVERTISEMENT",
            "1 small cocktail skewer ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour graham cracker crumbs onto a small, shallow plate. Moisten the rim of a chilled martini glass and dip the moistened glasses into the graham cracker crumbs.\nFill a shaker with ice; pour chocolate liqueur, half-and-half, vodka, and Irish cream over ice. Shake until cocktail is combined and strain into prepared martini glass. Thread marshmallows onto a skewer and garnish cocktail with marshmallows.\n",
        "picture_link": "uR/pjq.KDnMW4IzsSvyD1.iFrAcS1PS"
    },
    {
        "title": "Scallops with Mango Salsa on Fresh Spinach",
        "ingredients": [
            "1/4 mango - peeled, pitted, and chopped ADVERTISEMENT",
            "1/4 red bell pepper, minced ADVERTISEMENT",
            "1 small shallot, minced ADVERTISEMENT",
            "1/2 teaspoon minced fresh jalapeno chile ADVERTISEMENT",
            "1 dash fresh lime juice ADVERTISEMENT",
            "1 pinch salt and ground black pepper to taste ADVERTISEMENT",
            "1 teaspoon olive oil ADVERTISEMENT",
            "2 teaspoons butter ADVERTISEMENT",
            "1 pound large sea scallops ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "2 (6 ounce) bags baby spinach leaves ADVERTISEMENT",
            "1/2 cube vegetable bouillon ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the mango, red bell pepper, shallot, jalapeno chile, and lime juice together in a small bowl; season with salt and pepper and set aside.\nHeat the olive oil and butter together in a skillet over high heat. Once the butter melts, add the scallops and cook until opaque and browned on the sides, 2 to 3 minutes per side.\nCombine the water, vegetable bouillon, and garlic in a large skillet over medium-high heat; bring the mixture to a boil. Add the spinach to the mixture by the handful; cooking until each batch is wilted completely. Remove from heat, squeeze excess moisture from the spinach, and place equal portions into the center of 2 plates. Place half the scallops atop each pile of spinach. Spoon the mango salsa over the scallops.\n",
        "picture_link": "BmSWP8m9EWFksfjAhTCWGLU3BDUexea"
    },
    {
        "title": "Fried Quinces, in the Manner of the Countess",
        "ingredients": [
            "1 tablespoon clarified butter ADVERTISEMENT",
            "1 1/3 pounds quinces - peeled, cored, and cut into wedges ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1/2 cup dark beer ADVERTISEMENT",
            "1 dash vanilla extract ADVERTISEMENT",
            "2 teaspoons finely grated fresh lemon zest ADVERTISEMENT",
            "3 tablespoons coconut oil, or as needed ADVERTISEMENT",
            "3 tablespoons demerara sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the clarified butter in a skillet over low heat, and place the quince wedges into the pan. Cover, then gently cook the quince wedges until softened, about 15 minutes. Remove from heat and set aside.\nMix the flour, white sugar, and salt in a bowl. In a separate bowl, mix the beer with the vanilla extract and lemon zest; gradually mix the flour mixture into the beer mixture until it becomes a smooth batter.\nMelt the coconut oil in a skillet over medium heat. When the oil is hot, dip the quince wedges into the batter and place them in the hot oil; fry in batches until golden brown. Remove fried quinces to a warm platter while you finish frying. Sprinkle the fried quinces with demerara sugar to serve.\n",
        "picture_link": "vO.rmRFSLRNFczrMFdhf3iF4jamlOZy"
    },
    {
        "title": "Grandma's Float",
        "ingredients": [
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "2 egg yolks ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk the flour and 2 tablespoons of white sugar together in a small bowl until combined; set aside. Whisk together the egg yolks, milk, and 1 teaspoon vanilla extract in a small saucepan until smooth. Place the saucepan over medium-high heat, and stir constantly. Once the mixture is warm, whisk in the flour mixture, and continue cooking until the sauce has thickened, about 5 minutes. Whisk constantly as the sauce cooks to keep it from scorching. Once thick, keep warm over low heat.\nBeat egg whites until foamy in a large glass or metal mixing bowl. Gradually add the remaining 2 tablespoons sugar, continuing to beat until stiff peaks form. Lift your beater or whisk straight up: the egg whites should form a sharp peak that holds its shape. Finally, beat in the remaining 1 teaspoon vanilla extract.\nPour the hot sauce over the egg whites, and gently fold together using a rubber scraper until well incorporated. Do not mix vigorously, or the egg whites will deflate. Serve warm.\n",
        "picture_link": "b/i.Y9fXOKcDzyUHXBuz0jmzTlJI04G"
    },
    {
        "title": "Gobble Gobble Chili with Chipotle Baja Sauce",
        "ingredients": [
            "1 pound ground turkey ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3 stalks celery, chopped ADVERTISEMENT",
            "2 (15 ounce) cans spicy chili beans ADVERTISEMENT",
            "2 (14.5 ounce) cans diced chili-style tomatoes ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "1 (12 fluid ounce) can or bottle beer ADVERTISEMENT",
            "1 chipotle chile in adobo sauce, chopped ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 cup plain Greek yogurt ADVERTISEMENT",
            "1/3 cup mayonnaise ADVERTISEMENT",
            "2 tablespoons lime juice ADVERTISEMENT",
            "2 cloves garlic ADVERTISEMENT",
            "1 chipotle chile in adobo sauce, chopped ADVERTISEMENT",
            "1 (8 ounce) package shredded reduced-fat Cheddar cheese (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium-high heat and stir in the ground turkey. Cook and stir until the turkey is crumbly, evenly browned, and no longer pink. Drain and discard any excess grease. Add bell pepper, onion, and celery. Continue to cook and stir until vegetables are tender, 5 to 10 minutes.\nStir chili beans, tomatoes, tomato sauce, beer, 1 chopped chipotle chile, cumin, and black pepper into turkey mixture; simmer for 2 hours.\nPlace Greek yogurt, mayonnaise, lime juice, garlic, and remaining 1 chopped chipotle chile in a food processor or blender; pulse until mixture is smooth. Refrigerate sauce until ready to use.\nScoop chili into bowls; sprinkle with Cheddar cheese and drizzle with yogurt sauce.\n",
        "picture_link": "D3Qkek01ykPRez8fxVFriTZNcV.YKWi"
    },
    {
        "title": "Easy Mock Turkey Pot Pie",
        "ingredients": [
            "2 cups chopped cooked turkey ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of broccoli soup ADVERTISEMENT",
            "10 3/4 ounces milk ADVERTISEMENT",
            "1 (15 ounce) can sliced carrots, drained ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 (16 ounce) can refrigerated jumbo biscuits ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large, deep skillet over medium heat, mix together the cooked turkey meat, cream of chicken soup, cream of broccoli soup, milk, and carrots; season with black pepper. Bring the mixture to a simmer.\nPreheat oven to 350 degrees F (175 degrees C).\nPlace biscuits 1 to 2 inches apart on an ungreased baking sheet. Bake in the preheated oven until biscuits are golden brown, 13 to 17 minutes.\nTo serve, split the biscuits horizontally, and place onto serving plates; ladle the turkey and sauce over the biscuits.\n",
        "picture_link": "6ZlA4ntJWuW8cXkawH7QeRKuxLyBzAG"
    },
    {
        "title": "Honeydew-Grape Tomato Salad",
        "ingredients": [
            "3 honeydew melons - peeled, seeded and cubed ADVERTISEMENT",
            "3 pints grape tomatoes ADVERTISEMENT",
            "4 green bell peppers, seeded and cut into strips ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "1/2 cup lemon juice ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 tablespoon dried basil ADVERTISEMENT",
            "3/4 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the honeydew melon, grape tomatoes, and green bell peppers in a large bowl. Whisk together the vegetable oil, lemon juice, sugar, basil, and pepper in another bowl, and pour over the honeydew mixture. Cover and refrigerate for at least 4 hours, up to 48 hours, before serving, stirring occasionally.\n",
        "picture_link": "Z6DCSdY8Imr6/EqjupveMHp3JFCvE1W"
    },
    {
        "title": "Tomato and Bocconcini Salad",
        "ingredients": [
            "1/2 cup olive oil ADVERTISEMENT",
            "1/2 cup balsamic vinegar ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "4 cups baby spinach, rinsed and dried ADVERTISEMENT",
            "2 cups arugula, rinsed and dried ADVERTISEMENT",
            "2 cups grape tomatoes ADVERTISEMENT",
            "1 cup fresh bocconcini cheese, cut into bite-sized pieces ADVERTISEMENT",
            "1 cup minced red onion ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the olive oil, vinegar, garlic, salt, and black pepper in a jar with a lid; set aside. Gently combine the spinach, arugula, tomatoes, bocconcini cheese, and onion in a pretty serving bowl. Shake the salad dressing vigorously to combine, and drizzle over the salad to serve.\n",
        "picture_link": "gD1YIGFaPrNVk31bqpMkCMrw1pTk98O"
    },
    {
        "title": "Breaded Pheasant Nuggets",
        "ingredients": [
            "2 1/2 cups Italian-style panko bread crumbs ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1 tablespoon dried parsley ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon dry mustard powder ADVERTISEMENT",
            "3/4 cup butter ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "6 skinless, boneless pheasant breast halves, cut into chunks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Combine the panko, Parmesan cheese, parsley, salt, black pepper, and mustard powder in a bowl until evenly combined.\nMelt the butter with the garlic in a skillet over low heat. Once melted, cook and stir the garlic for 5 minutes to flavor the butter. Pour into a mixing bowl once melted. Dip the pheasant pieces into the melted butter, then press into the panko crumbs. Place onto an ungreased baking sheet in a single layer. Sprinkle the remaining panko crumbs over the pheasant nuggets.\nBake in the preheated oven until the pheasant pieces are no longer pink in the center, about 45 minutes.\n",
        "picture_link": "6LiXn8ok.6rMJB.J5Bvd0QhlM9mkqfm"
    },
    {
        "title": "Tacos de Alambre",
        "ingredients": [
            "8 slices bacon ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "4 jalapeno peppers, seeded and chopped ADVERTISEMENT",
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "32 corn tortillas ADVERTISEMENT",
            "4 roma (plum) tomatoes, diced ADVERTISEMENT",
            "1 (8 ounce) package shredded Monterey Jack cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate, reserving grease in the skillet. Crumble the bacon strips once cool.\nMeanwhile, heat 1 tablespoon of olive oil in a large skillet over medium heat. Stir in the onion, garlic, and jalapeno peppers; cook and stir until the onion has softened and turned translucent, about 5 minutes. Increase the heat to medium-high, and stir in the ground beef; season with salt and pepper. Cook and stir until the ground beef is crumbly and no longer pink, 10 to 12 minutes. Drain off any excess liquid.\nScrape the beef mixture into the skillet of bacon grease. Crumble the bacon into the beef, and stir until thoroughly combined. Keep warm over low heat.\nHeat 1 tablespoon of olive oil in a clean skillet over medium-high heat until hot. Place a tortilla into the pan, and place a generous spoonful of the meat filling onto the lower half of the tortilla. Cook until bubbles begin to form in the tortilla, then fold over the meat. Continue cooking until the taco is crisp and lightly browned on each side, 1 to 2 minutes total. Repeat with the remaining tortillas and meat mixture. Top the tacos with diced tomatoes and shredded Monterey Jack cheese to serve.\n",
        "picture_link": "Yj32Qn6WYh7iW70VCf0GLOXRt237OnO"
    },
    {
        "title": "Witchetty Grubs",
        "ingredients": [
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 cup cream-style corn ADVERTISEMENT",
            "2 teaspoons olive oil ADVERTISEMENT",
            "1 cup self-rising flour, or as needed ADVERTISEMENT",
            "3 cocktail wieners ADVERTISEMENT",
            "1 teaspoon blanched slivered almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease a baking sheet.\nMix together the Cheddar cheese, corn, olive oil, and self-rising flour to make a firm dough. Roll the dough out into a log shape, and cut into 16 equal pieces. Roll each piece into a ball. Cut the cocktail wieners into 6 slices each (there will be 2 extra slices). Pick out 8 almond slivers.\nTo make the grubs, place 4 dough balls onto the baking sheet, and press them tightly together so they make a lumpy grub with 4 segments. Place a slice of cocktail wiener on top of each segment for markings. Stick 2 little almond slivers into an end ball to make eyes. Repeat for the other grubs.\nBake in the preheated oven until the grubs are golden brown, about 15 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sausage, Mushroom and Cranberry Tart",
        "ingredients": [
            "1/2 (14.1 ounce) package refrigerated pie crust ADVERTISEMENT",
            "1 (9.6 ounce) package Jimmy Dean® Original Hearty Turkey Sausage Crumbles ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1 1/2 cups sliced fresh button mushrooms ADVERTISEMENT",
            "1 1/2 cups sliced fresh baby portobello mushrooms ADVERTISEMENT",
            "2 eggs, lightly beaten ADVERTISEMENT",
            "1 1/2 cups shredded Gruyere or Swiss cheese ADVERTISEMENT",
            "3/4 cup dried cranberries, divided ADVERTISEMENT",
            "1/2 cup whipping cream ADVERTISEMENT",
            "3 tablespoons minced fresh parsley ADVERTISEMENT",
            "2 green onions, thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F. Press pie crust onto bottom and up side of 9-inch fluted tart pan with removable bottom; trim edge, reserving trimmings. Prick bottom of crust with fork. Bake 10-12 minutes or until golden brown. Cool. Reduce heat to 375 degrees F.\nCook sausage in large skillet over medium heat 4-5 minutes or until hot stirring frequently. Remove from skillet; set aside.\nMelt butter in same skillet. Add mushrooms; cook 3 minutes or until tender, stirring occasionally. Place in large bowl. Add eggs, cheese, 1/2 cup cranberries, cream, parsley and sausage; mix well. Pour into tart shell.\nRoll out reserved pie crust trimmings on lightly floured surface. Use cookie cutters to cut into decorative shapes; arrange over filling.\nBake 25-30 minutes or until knife inserted in center comes out clean. Top with onions and remaining cranberries. Cut into 8 wedges to serve.\n",
        "picture_link": "ZNImLirukigLHfoRy3hyyLm9PtLODdy"
    },
    {
        "title": "Melon Liqueur",
        "ingredients": [
            "1/4 honeydew melon - peeled, seeded, and cubed ADVERTISEMENT",
            "1 cup vodka ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "4 drops green food coloring ADVERTISEMENT",
            "3 drops yellow food coloring ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the honeydew in a bowl and mash until some of the juice is released; pour into a blender or food processor. Puree until smooth, 10 to 15 seconds. Measure 1 cup of the melon puree, and pour into a jar with a tight-fitting lid. Add vodka, sugar, and green and yellow food coloring. Cover and shake until the sugar is dissolved. Store at room temperature for 1 week.\nStrain the melon mixture into a bowl through a paper towel-lined sieve to remove any solid bits. (You may need to do this multiple times.) Pour the vodka into a bottle, and seal until ready to use.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Orange Surprise Pops",
        "ingredients": [
            "2 bananas, peeled ADVERTISEMENT",
            "1 8-piece ice pop mold ADVERTISEMENT",
            "1 (12 ounce) package frozen unsweetened raspberries ADVERTISEMENT",
            "5 cups orange juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut the bananas in half crosswise then lengthwise. Insert 1 ice pop stick into the end of each banana. Roll the bananas in the frozen berries, and place the sticks into the mold. Fill each mold with the orange juice and freeze until solid, about 2 to 3 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Watermelon Refresher",
        "ingredients": [
            "10 cups diced seeded watermelon ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/3 cup agave nectar ADVERTISEMENT",
            "1 1/2 cups tequila (such as Patron®) ADVERTISEMENT",
            "1 cup frozen blueberries ADVERTISEMENT",
            "1 sprig mint leaves, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend the watermelon in a blender until smooth; pour into a large pitcher.\nStir the water and agave nectar together in a small bowl; add to the watermelon. Stir the tequila into the watermelon mixture. Add the blueberries and garnish with the mint to serve.\n",
        "picture_link": "330m6e4RePMpT2DP0TFP8cpt2g06j7y"
    },
    {
        "title": "Sausage and Egg Tostadas",
        "ingredients": [
            "1 (9.6 ounce) package Jimmy Dean® Original Hearty Pork Sausage Crumbles ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "6 tostada shells, warmed in oven ADVERTISEMENT",
            "6 cooked eggs, such as poached, fried or over-easy ADVERTISEMENT",
            "1 1/2 cups shredded Mexican blend cheese ADVERTISEMENT",
            "3/4 cup salsa ADVERTISEMENT",
            "3 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook sausage and onion in large skillet over medium-high heat 8-10 minutes or until sausage is thoroughly cooked, stirring frequently; drain.\nPlace tostada shells on serving plates. Top with sausage mixture, eggs, cheese, salsa and cilantro.\n",
        "picture_link": "nsocSs8m8nBqiyKV5qi56Wn79n.HE/e"
    },
    {
        "title": "Roasted Red Pepper and Sausage Stuffing",
        "ingredients": [
            "2 red bell peppers ADVERTISEMENT",
            "1 pound bulk chorizo sausage ADVERTISEMENT",
            "1 (16 ounce) loaf French bread, cubed ADVERTISEMENT",
            "1 white onion, chopped ADVERTISEMENT",
            "6 stalks celery, chopped ADVERTISEMENT",
            "1 cup dried cranberries ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "1 tablespoon chopped fresh thyme ADVERTISEMENT",
            "1 tablespoon chopped fresh rosemary ADVERTISEMENT",
            "2 tablespoons poultry seasoning ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 cup chicken broth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven's broiler and set the oven rack at about 6 inches from the heat source.\nLine a baking sheet with aluminum foil. Cut the peppers in half from top to bottom; remove the stem, seeds, and ribs, then place the peppers cut-side-down onto the prepared baking sheet.\nCook under the preheated broiler until the skin of the peppers has blackened and blistered, about 15 minutes. Place the blackened peppers into a bowl, and tightly seal with plastic wrap. Allow the peppers to steam as they cool, about 20 minutes. Once cool, remove the skins and discard.\nReduce the oven temperature to 375 degrees F (190 degrees C). Grease a 9x13-inch baking dish.\nMeanwhile, heat a large skillet over medium-high heat and stir in the sausage. Cook and stir until the sausage is crumbly, evenly browned, and no longer pink. Drain and discard any excess grease, then pour into a large mixing bowl, and allow to cool.\nChop the roasted peppers, and place them in the bowl with the sausage along with the bread cubes, onion, celery, cranberries, garlic, parsley, thyme, rosemary, poultry seasoning, salt, and black pepper. Pour the chicken broth overtop, and stir until evenly blended. Pack the stuffing into the prepared baking dish.\nBake in the preheated oven until the stuffing is golden brown and crispy on top, about 30 minutes.\n",
        "picture_link": "REzDbz3YdbddtMe9zFkVu29FhjkGDU6"
    },
    {
        "title": "Maria Athans' Spinach Pie",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "4 (10 ounce) packages frozen chopped spinach, thawed and well drained ADVERTISEMENT",
            "18 green onions, chopped ADVERTISEMENT",
            "4 eggs, slightly beaten ADVERTISEMENT",
            "1 (16 ounce) package small curd cottage cheese ADVERTISEMENT",
            "1/2 pound feta cheese, crumbled ADVERTISEMENT",
            "1 tablespoon dried dill weed ADVERTISEMENT",
            "3/4 cup butter ADVERTISEMENT",
            "1 (16 ounce) package phyllo dough, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray bottom and sides of a 9x13-inch square baking dish with cooking spray.\nMelt 1/4 cup of butter in a large skillet, and cook the spinach and green onions, stirring occasionally, until the white parts of the onions are translucent, about 8 minutes. Remove from heat, and allow to cool for about 10 minutes; mix in the eggs, cottage cheese, feta cheese, and dill until thoroughly combined.\nMelt remaining 3/4 cup of butter in a saucepan. Place 1 sheet of phyllo dough into the prepared baking dish, and brush with melted butter. Repeat laying down and buttering sheets until half the sheets have been used. Spread the filling over the sheets in an even layer. Place remaining phyllo sheets on the filling, buttering each sheet as before. Brush the top sheet with butter.\nBake in the preheated oven until golden brown, 45 to 50 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Zucchini with Mushroom Ravioli in Truffle Butter Sauce",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "3 zucchinis, sliced ADVERTISEMENT",
            "1 (9 ounce) package mushroom ravioli ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 teaspoon white truffle oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a pot of salted water to a boil. While water is heating, melt 1 tablespoon of butter in a large skillet over medium heat, and cook the garlic until fragrant but not brown, about 1 minute. Stir in the zucchini slices, and cook until tender and slightly browned, about 10 minutes. Season to taste with salt and pepper.\nAbout 5 minutes after starting to cook the zucchini, stir the mushroom ravioli into the boiling water. Let them cook until they begin to float, about 5 minutes; scoop out the ravioli with a slotted spoon, and add them to the zucchini. Melt 1 more tablespoon of butter with the ravioli and zucchini, and drizzle the dish with truffle oil. Gently toss the ravioli and zucchini to thoroughly coat with butter and truffle oil, and serve.\n",
        "picture_link": "EnXeY.dLsgr4IQc8oCo/V9an5zEfuYO"
    },
    {
        "title": "Melon-Blackberry Smoothie",
        "ingredients": [
            "1 banana, chopped ADVERTISEMENT",
            "1/2 honeydew melon, cubed ADVERTISEMENT",
            "1/2 cup frozen blackberries ADVERTISEMENT",
            "3 tablespoons wheat germ ADVERTISEMENT",
            "3/4 cup almond milk ADVERTISEMENT",
            "6 ice cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the banana, honeydew melon, blackberries, wheat germ, and almond milk into a blender. Cover, and puree until smooth.\nDivide ice cubes into two tall glasses, and pour the smoothie over the ice.\n",
        "picture_link": "8MC/rqgsop9muI1ga4fU2AiAalz0pIa"
    },
    {
        "title": "Classic Aviation Cocktail",
        "ingredients": [
            "ice cubes ADVERTISEMENT",
            "2 fluid ounces gin ADVERTISEMENT",
            "1/2 fluid ounce maraschino liqueur ADVERTISEMENT",
            "1/2 fluid ounce fresh lemon juice ADVERTISEMENT",
            "1 maraschino cherry ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Chill a cocktail martini glass in the freezer. Add ice to a shaker. Pour in gin, cherry liqueur, and lemon juice. Shake well for 1 minute (not kidding), then strain into the chilled glass. Garnish with a maraschino cherry.\n",
        "picture_link": "wFFyKvILLdDM7oyfWam3ssFDIwIvBlm"
    },
    {
        "title": "Spicy Buffalo-Style Meatballs",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1/2 cup gluten-free quick-cooking oats ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1 large egg ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "2 tablespoons hot sauce, or more to taste ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nMix ground beef, oats, onion, egg, water, garlic powder, salt, and black pepper together in a large bowl; shape into 1-inch balls and arrange into a large baking dish.\nBake in preheated oven until very firm, hot, and grey in the center, about 20 minutes. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C). Drain fat from the dish.\nStir hot sauce, butter, and honey together in a bowl until smooth; pour over the meatballs. Turn meatballs to coat.\n",
        "picture_link": "hz3miGbTL4Tp64JQQD7sdWyH5GyRZUS"
    },
    {
        "title": "Silky Strawberry Smoothie",
        "ingredients": [
            "1 cup fresh strawberries ADVERTISEMENT",
            "1 banana, sliced ADVERTISEMENT",
            "1 cup ice ADVERTISEMENT",
            "1/2 cup silken tofu ADVERTISEMENT",
            "1 teaspoon agave nectar (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend strawberries, banana, ice, tofu, and agave nectar together in a blender until smooth.\n",
        "picture_link": "Ps1BjE.7.5SwtEXJ8q9IbRMWg3S9Pqy"
    },
    {
        "title": "Pizza Broetchen",
        "ingredients": [
            "2 1/3 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "1 (3 ounce) can French-fried onions ADVERTISEMENT",
            "1 (3 ounce) jar real bacon bits ADVERTISEMENT",
            "1 cup quark cheese ADVERTISEMENT",
            "5 tablespoons milk ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C). Grease a jelly roll pan or large baking sheet with edges.\nWhisk flour and baking powder together in a bowl. Stir mozzarella cheese, onions, and bacon bits into flour mixture.\nCombine quark cheese, milk, and 3 tablespoons plus 1 teaspoon oil in a separate bowl; mix into flour mixture until thoroughly combined using your hands. Roll mixture into 15 even balls. Arrange balls on the prepared baking sheet.\nBake in the preheated oven until lightly browned, about 20 minutes.\n",
        "picture_link": "/EYS5MK5nQek2rD3iGVvNtrxGOC8Qga"
    },
    {
        "title": "Electric Lightning",
        "ingredients": [
            "ice cubes ADVERTISEMENT",
            "1/2 fluid ounce vodka ADVERTISEMENT",
            "1/2 fluid ounce coconut-flavored rum ADVERTISEMENT",
            "1/2 fluid ounce blue Curacao liqueur ADVERTISEMENT",
            "1 fluid ounce lemon-lime soda ADVERTISEMENT",
            "1 wedge lemon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a cocktail shaker with ice; pour vodka, rum, and blue Curacao over the ice and stir. Pour lemon-lime soda into the shaker; stir gently. Strain beverage into a cocktail glass and garnish with lemon wedge.\n",
        "picture_link": "9swrmeKf5QUcwIiacdhxeVW0WsS9zbu"
    },
    {
        "title": "Seitan Fajitas",
        "ingredients": [
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 red bell pepper, cut into strips ADVERTISEMENT",
            "1 green bell pepper, cut into strips ADVERTISEMENT",
            "1 yellow bell pepper, cut into strips ADVERTISEMENT",
            "1/2 red onion, chopped ADVERTISEMENT",
            "1 pound seitan, cut into strips ADVERTISEMENT",
            "2 tablespoons reduced-sodium soy sauce ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "10 whole grain tortillas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large skillet over medium heat; cook and stir red bell pepper, green bell pepper, yellow bell pepper, and onion until tender, 3 to 5 minutes. Add seitan, soy sauce, garlic, chili powder, paprika, and cumin; cook and stir until seitan is heated through, 7 to 10 minutes.\nSpoon seitan filling onto each tortilla and fold tortilla around filling.\n",
        "picture_link": "Sovv4I4XCWPNB9.3EXl99RIJADKXJtG"
    },
    {
        "title": "Chicken Marsala with Eggplant and Pasta Casserole",
        "ingredients": [
            "1 1/2 cups elbow macaroni ADVERTISEMENT",
            "3 eggplants, peeled and cut lengthwise into 1/4-inch thick slices ADVERTISEMENT",
            "6 tablespoons olive oil, divided ADVERTISEMENT",
            "2 teaspoons garlic powder ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1 (8 ounce) package sliced fresh mushrooms ADVERTISEMENT",
            "6 chicken thighs ADVERTISEMENT",
            "1 pinch garlic powder, or more to taste ADVERTISEMENT",
            "1/2 cup Marsala wine ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1/4 cup tomato paste ADVERTISEMENT",
            "2 teaspoons fresh oregano leaves ADVERTISEMENT",
            "2 leaves fresh sweet basil, chopped ADVERTISEMENT",
            "1 sprig fresh rosemary, leaves stripped ADVERTISEMENT",
            "1/4 cup grated Parmesan-Romano cheese, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grease a 9x13-inch baking dish.\nBring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until cooked through but firm to the bite, about 8 minutes. Drain and transfer pasta to the prepared baking dish.\nPlace eggplant slices in a large pot of lightly salted water. Let eggplant soak to help remove some of the bitterness, about 30 minutes. Drain and pat eggplant strips with a paper towel to dry; transfer to a baking sheet. Brush eggplant with about 2 tablespoons olive oil; season with 2 teaspoons garlic powder, salt, and pepper.\nHeat a large skillet over medium-high heat; saute eggplant until slightly browned, 5 to 10 minutes. Spread cooked eggplant over pasta.\nPour 2 tablespoons olive oil into the same skillet; saute onion and mushrooms until tender, 5 to 10 minutes. Spread onion mixture over eggplant layer.\nSeason chicken thighs with garlic powder, salt, and pepper to taste.\nPour remaining 2 tablespoons olive oil into the same skillet; cook chicken until browned, about 5 minutes per side. Arrange chicken on the onion layer.\nPreheat oven to 400 degrees F (200 degrees C).\nPour wine into the skillet, and bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Add water, tomato paste, oregano, basil, and rosemary leaves; cook and stir until sauce is smooth and thickened, about 5 minutes. Add chicken to the sauce, cover skillet, decrease heat to low, and simmer while oven preheats, 5 to 10 minutes.\nArrange chicken atop the onion layer and pour sauce over chicken and vegetables. Cover dish with aluminum foil.\nBake in the preheated oven until chicken is no longer pink and the juices run clear, 20 to 30 minutes. An instant-read thermometer inserted in the thickest part of chicken should read 165 degrees F (74 degrees C). Sprinkle Parmesan-Romano cheese over chicken.\n",
        "picture_link": "CP9k.5.qE4p8gi9jGYYxpLSVRR/nlT2"
    },
    {
        "title": "Lemon-Garlic Salad Dressing",
        "ingredients": [
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "1 small garlic clove, minced ADVERTISEMENT",
            "1/2 teaspoon lemon zest (optional) ADVERTISEMENT",
            "1/4 teaspoon dry mustard ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk olive oil, lemon juice, garlic, lemon zest, mustard, salt, and pepper together in a bowl.\n",
        "picture_link": "gGVp7t.zyitEjGSGd9POOzfq3eU.ytK"
    },
    {
        "title": "Spicy-Sweet Pork Tenderloin",
        "ingredients": [
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1 teaspoon minced fresh ginger root ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1 teaspoon olive oil ADVERTISEMENT",
            "1 pound pork tenderloin, cut into 3/4-inch slices ADVERTISEMENT",
            "1/3 cup salsa ADVERTISEMENT",
            "1 tablespoon seedless raspberry preserves ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix soy sauce, ginger, and garlic in a small bowl.\nHeat oil in a large nonstick skillet over medium-high heat. Arrange pork slices in a single layer in the skillet. Spoon soy sauce mixture over the pork. Cook pork until completely browned and just slightly pink in the center, about 3 minutes per side. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C). Remove pork to a plate, retaining juices in the skillet.\nStir salsa and raspberry preserves into the drippings in the skillet; cook and stir until slightly thickened, about 30 seconds. Spoon sauce over pork slices and top with cilantro.\n",
        "picture_link": "5t/yFC3qhsH.EnHc3vl10ISSLzgaY0e"
    },
    {
        "title": "Mom's Baked Salmon",
        "ingredients": [
            "2 tablespoons margarine, melted ADVERTISEMENT",
            "2 teaspoons all-purpose flour ADVERTISEMENT",
            "1 (16 ounce) can canned salmon, skin and bones removed ADVERTISEMENT",
            "6 saltine crackers, crumbled ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nPour melted margarine into a small glass baking dish. Stir flour into the melted margarine until all the flour is moistened. Flake salmon into the dish; add crackers. Pour milk over the mixture and stir.\nBake in preheated oven until cooked through, about 30 minutes.\n",
        "picture_link": "Ex4eUpBHFK62EzdEjg3m1NwbaSOW/hC"
    },
    {
        "title": "Turkey Goulash with Penne",
        "ingredients": [
            "2 teaspoons extra-virgin olive oil, or to taste ADVERTISEMENT",
            "1 sweet onion, cut into thin slivers ADVERTISEMENT",
            "1 pound lean ground turkey ADVERTISEMENT",
            "8 ounces sliced mushrooms ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 (26 ounce) jar spicy roasted red pepper tomato sauce ADVERTISEMENT",
            "1 (14 ounce) can diced tomatoes ADVERTISEMENT",
            "1 teaspoon bottled minced garlic ADVERTISEMENT",
            "8 ounces multi-grain penne pasta ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large skillet over medium heat. Cook and stir sweet onion in hot oil until translucent, about 5 minutes. Add turkey to the skillet in small chunks; cook and stir until the turkey is no longer pink, 5 to 7 minutes. Stir mushrooms into the turkey mixture; cook and stir until softened, 3 to 5 minutes. Season the mixture with salt and pepper.\nPour tomato sauce and diced tomatoes over the turkey mixture; add garlic and stir. Bring the mixture to a simmer and cook until the tomato sauce thickens, about 20 minutes.\nBring a large pot of lightly salted water to a boil; add penne and cook, stirring occasionally, until tender yet firm to the bite, about 11 minutes. Drain pasta and stir into the turkey mixture; toss to coat.\n",
        "picture_link": "Lov033LdeA2AjSKbVkNorddJ6HCjemq"
    },
    {
        "title": "Vegan Tuna Salad",
        "ingredients": [
            "1/2 cup olive oil ADVERTISEMENT",
            "1/4 cup soy milk ADVERTISEMENT",
            "1 teaspoon sea salt ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 teaspoon Dijon mustard ADVERTISEMENT",
            "1 teaspoon rice vinegar ADVERTISEMENT",
            "1 cup drained canned chickpeas (garbanzo beans) ADVERTISEMENT",
            "1/2 cup chopped dill pickles ADVERTISEMENT",
            "1 stalk celery ADVERTISEMENT",
            "1/4 cup dried chopped onion ADVERTISEMENT",
            "1 teaspoon dried dill weed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend olive oil and soy milk together in a blender until thickened. Add salt, sugar, and mustard; turn on blender and drizzle vinegar through the opening in the lid until mixture is smooth. Add chickpeas, pickles, celery, onion, and dill; blend until mixture is evenly chopped.\n",
        "picture_link": "UqOcqQ/rfZ0vsdKzjUSicS9RKwsvxJm"
    },
    {
        "title": "Coconutty Balls",
        "ingredients": [
            "1/2 cup almond flour ADVERTISEMENT",
            "1/4 cup cashew butter ADVERTISEMENT",
            "1/4 cup mashed banana ADVERTISEMENT",
            "5 tablespoons shredded unsweetened coconut, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix almond flour, cashew butter, banana, and 3 tablespoons coconut together in a bowl; roll into bite-size balls.\nSpread remaining 2 tablespoons coconut in a shallow bowl. Roll balls in coconut to coat.\n",
        "picture_link": "zlxeJwqp0vnwIkTCnExdnGRRgN3ki56"
    },
    {
        "title": "Carrot Cake with Pineapple Cream Cheese Frosting",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "Cake: ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "3/4 cup buttermilk ADVERTISEMENT",
            "3/4 cup unsweetened applesauce ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 1/2 cups grated carrots ADVERTISEMENT",
            "1 1/2 cups chopped pecans ADVERTISEMENT",
            "1 (8 ounce) can crushed pineapple in juice, drained and juice reserved ADVERTISEMENT",
            "Frosting: ADVERTISEMENT",
            "1 (8 ounce) package Neufchatel cheese, softened ADVERTISEMENT",
            "1 tablespoon reserved pineapple juice ADVERTISEMENT",
            "1 (16 ounce) package confectioners' sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray a 9x13-inch baking dish with cooking spray.\nSift flour, baking soda, cinnamon, and 1/2 teaspoon salt together in a bowl. Lightly beat eggs in a bowl; add white sugar, buttermilk, applesauce, oil, and 2 teaspoons vanilla extract and mix well. Stir buttermilk mixture, carrots, pecans, and drained pineapple into flour mixture just until mixed; pour into prepared dish.\nBake in the preheated oven until a toothpick inserted in the center of the cake comes out clean, 45 to 50 minutes. Cool cake in baking dish on a wire rack, about 1 hour. Cover dish tightly with plastic wrap; refrigerate 8 hours to overnight.\nBeat Neufchatel cheese and 1 tablespoon reserved pineapple juice together in a bowl with an electric mixer until smooth; add confectioners' sugar, 1 teaspoon vanilla extract, and 1 pinch salt and beat until frosting is smooth. Spread frosting on cake.\n",
        "picture_link": "Tz4YlM2KDECfOe18Bg5b4fEddHAytQm"
    },
    {
        "title": "Chicken Carbonara with Creamy Parmesan Sauce",
        "ingredients": [
            "1 (8 ounce) package spaghetti ADVERTISEMENT",
            "1/2 pound bacon, chopped ADVERTISEMENT",
            "2 cooked skinless, boneless chicken breast halves, diced ADVERTISEMENT",
            "6 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon red pepper flakes ADVERTISEMENT",
            "1 1/2 cups chicken broth ADVERTISEMENT",
            "1/4 cup white grape juice ADVERTISEMENT",
            "3 egg yolks, whisked ADVERTISEMENT",
            "1 cup freshly grated Parmesan cheese ADVERTISEMENT",
            "1/4 cup freshly grated Asiago cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally until cooked through but firm to the bite, about 12 minutes; drain.\nPlace bacon in a large skillet and cook over medium-high heat until evenly browned, about 10 minutes. Add chicken and stir until coated. Stir garlic and red pepper flakes into chicken-bacon mixture; cook and stir until garlic is fragrant, about 2 minutes.\nPour chicken broth and grape juice over chicken mixture; reduce heat to low and cook until warmed, about 5 minutes. Add about 3 spoonfuls broth mixture to egg yolks; whisk until egg yolks are warmed. Pour egg yolk mixture into broth mixture; cook and stir over low heat until smooth.\nStir Parmesan cheese and Asiago cheese into egg-broth mixture; cook and stir until cheeses are melted and sauce is thickened, about 5 minutes. Add spaghetti to sauce and mix well.\n",
        "picture_link": "GdMgz4pF8lwiFlPy2/5Ntof8kj.Nzba"
    },
    {
        "title": "Roasted Broccoli in Tangy Tomato-Herb Vinaigrette",
        "ingredients": [
            "1/2 cup pine nuts ADVERTISEMENT",
            "7 tablespoons olive oil ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 teaspoons dill weed, divided ADVERTISEMENT",
            "1 1/4 teaspoons sea salt, divided ADVERTISEMENT",
            "3/4 teaspoon lime juice, divided ADVERTISEMENT",
            "4 cups broccoli florets ADVERTISEMENT",
            "1 cup cherry tomatoes, cut in half ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "6 leaves basil, shredded ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nSpread pine nuts onto a baking sheet.\nRoast in the preheated oven until pine nuts are toasted and fragrant, 5 to 10 minutes.\nHeat olive oil in a skillet over medium heat; cook and stir garlic until lightly golden brown, about 5 minutes. Combine 3 tablespoons olive oil mixture, 1 1/2 teaspoons dill, 1 teaspoon sea salt, and 1/2 teaspoon lime juice in a large bowl; add broccoli and toss to coat. Spread broccoli onto a baking sheet.\nRoast in the preheated oven until broccoli is slightly tender, 15 to 20 minutes.\nHeat remaining olive oil mixture in skillet over medium heat; cook and stir tomatoes, remaining 1/2 teaspoon dill, remaining 1/4 teaspoon salt, 1/2 teaspoon lime juice, and honey until tomatoes softened, about 3 minutes. Mix vinegar and basil into tomato mixture until dressing is evenly combined; remove skillet from heat.\nToss broccoli with tomato dressing and pine nuts.\n",
        "picture_link": "HrQcL/.hYwmjpOEvph00NkANGLdprKm"
    },
    {
        "title": "Carrot Cake Smoothie",
        "ingredients": [
            "1 large carrot, peeled and diced ADVERTISEMENT",
            "1/4 cup frozen mango chunks ADVERTISEMENT",
            "1 large fresh peach, chopped ADVERTISEMENT",
            "1/4 cup soy milk ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground allspice ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pulse carrot and mango together in a blender until roughly chopped. Add peach, soy milk, cinnamon, allspice, and ginger; blend until smooth.\n",
        "picture_link": "QLDfukyh.H4rLf1.DBkZk7yrE7PTcLO"
    },
    {
        "title": "Easy Passover Lasagna",
        "ingredients": [
            "28 ounces ricotta cheese ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "8 matzah sheets, or more as needed ADVERTISEMENT",
            "3 (32 ounce) jars marinara sauce (such as Classico® Tomato and Basil) ADVERTISEMENT",
            "2 (16 ounce) packages shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBeat ricotta cheese and eggs together in a bowl.\nBriefly pass each matzah sheet under warm running water; layer moistened sheets on a plate.\nSpread a thin layer of marinara sauce in the bottom of a deep 11x15-inch baking dish; top with a layer of moistened matzah sheets, breaking pieces as needed to completely cover marinara. Spread a layer of ricotta mixture over matzah mixture. Sprinkle mozzarella cheese over ricotta mixture layer. Repeat layering with remaining ingredients, ending with a layer of matzah, marinara, and mozzarella cheese, respectively.\nBake in the preheated oven until cheese is bubbling and browned, about 45 minutes.\n",
        "picture_link": "YNhW/1MO1lUJgQ2LtAXRq9uXikk6F72"
    },
    {
        "title": "Asian-Inspired Ginger Dressing",
        "ingredients": [
            "3/4 cup plain yogurt ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "1/4 cup rice wine vinegar ADVERTISEMENT",
            "1/4 cup ketchup ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "1/4 cup minced onion, or more to taste ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons ginger paste ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put yogurt, lemon juice, rice wine vinegar, ketchup, soy sauce, onion, garlic, ginger paste, sugar, and black pepper in a blender; blend on High until smooth.\nPour dressing into a sealable container, seal, and refrigerate at least 30 minute before serving.\n",
        "picture_link": "T97OMJE31ynxP6B.deL/YcEyf1HXBEC"
    },
    {
        "title": "Shyam's Goat Biryani",
        "ingredients": [
            "1 1/2 pounds goat meat ADVERTISEMENT",
            "1 1/4 cups plain Greek yogurt, stirred ADVERTISEMENT",
            "6 pitted prunes, or more to taste ADVERTISEMENT",
            "3 1/2 tablespoons diced fresh ginger ADVERTISEMENT",
            "1 1/4 tablespoons garlic paste ADVERTISEMENT",
            "1 1/2 teaspoons salt, or to taste ADVERTISEMENT",
            "1 1/2 teaspoons ground cumin ADVERTISEMENT",
            "1 1/2 teaspoons ground black pepper ADVERTISEMENT",
            "1 teaspoon turmeric powder ADVERTISEMENT",
            "1/2 teaspoon ground red chile pepper ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1 1/4 pounds basmati rice ADVERTISEMENT",
            "1 1/2 cups unsalted butter ADVERTISEMENT",
            "6 onions, thinly sliced ADVERTISEMENT",
            "4 ripe tomatoes, cut into 1/4-inch cubes ADVERTISEMENT",
            "4 potatoes, peeled and quartered ADVERTISEMENT",
            "1 1/2 cups cold water, or more as needed ADVERTISEMENT",
            "12 cups water ADVERTISEMENT",
            "3 tablespoons salt ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "4 bay leaves, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix goat meat, yogurt, prunes, ginger, garlic paste, 1 1/2 teaspoons salt, cumin, black pepper, turmeric, red chile pepper, cinnamon, and cloves together in a bowl. Cover bowl with plastic wrap and marinate in the refrigerator, 8 to 14 hours.\nRinse the rice under lukewarm water 2 times. Place rice in a pot and cover with enough cold water to reach 1 1/4 to 1 1/2 inches above rice; soak for 1 hour.\nMelt unsalted butter in a large skillet over low heat; cook and stir onions until translucent and golden, about 10 minutes. Add tomatoes; cook and stir until oil separates and rises to the surface, 5 to 10 minutes.\nMix marinated goat meat mixture and potatoes into onion mixture; cook and stir until meat is browned and cooked through, 20 to 30 minutes. Pour 1 1/2 cups cold water (or enough to cover) over goat meat mixture and cook until meat is tender, 30 to 40 minutes. Increase heat to medium and cook, stirring frequently, until oil separates from the mixture, about 5 minutes. Decrease heat to low and keep warm.\nPreheat oven to 275 degrees F (135 degrees C).\nBring 12 cups water, 3 tablespoons salt, and 1 tablespoon butter to a boil in a large pot for 3 to 4 minutes. Drain rice and add to boiling water; cook for 10 minutes. Remove from heat and carefully drain water.\nSpoon 1/2 the rice into the bottom of a large baking dish; top with 1/2 the goat meat mixture. Arrange 1/2 the bay leaves over goat meat mixture. Repeat layering with remaining rice, goat meat mixture, and bay leaves. Cover dish with aluminum foil.\nBake in the preheated oven until rice is fully cooked, 30 to 40 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Banana Hemp Seed Smoothie",
        "ingredients": [
            "2 bananas ADVERTISEMENT",
            "1 cup frozen peach slices ADVERTISEMENT",
            "2 tablespoons almond butter ADVERTISEMENT",
            "1 tablespoon hemp seeds ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Layer bananas, peach slices, almond butter, and hemp seeds in a blender; pour in water. Cover and blend until smooth.\n",
        "picture_link": "ZnZM/Ys2i0XrYBE35OZyIbZQG4PXpKu"
    },
    {
        "title": "Chef John's Fresh Spring Rolls",
        "ingredients": [
            "4 (8 1/2-inch) rice paper wrappers ADVERTISEMENT",
            "1 cooked chicken breast half, cut into thin strips ADVERTISEMENT",
            "1 red bell pepper, cut into thin strips ADVERTISEMENT",
            "1 English cucumber, cut into thin strips ADVERTISEMENT",
            "1 carrot, cut into thin strips ADVERTISEMENT",
            "4 sprigs chopped fresh basil ADVERTISEMENT",
            "4 sprigs chopped fresh mint ADVERTISEMENT",
            "4 sprigs chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "The strips of chicken and vegetables should be no longer than about 6 inches to leave an inch margin open on the sides of the wrappers for tucking.\nSoak a rice paper wrapper in cold water just until it becomes flexible, 1 minute or less. Place on slightly damp towel. Place some baby greens near the bottom of the round. Top with strips of chicken and pepper, leaving about an inch margin on the sides. Roll tightly just until the bottom edge meets the center of the paper and sticks there. Then continue to add more chicken strips and vegetable strips. Finish with torn pieces of herbs. Complete the roll, pressing the ingredients to keep roll tight and tucking in the sides.\nTransfer completed rolls to a plate lined with damp paper towels. Cover each roll with damp papers towels as you work to prevent them from drying out; don't let the rolls touch each other or they will stick together.\n",
        "picture_link": "ZnGMfr0BG4jp.A8IpprVBcfPSs1wJg."
    },
    {
        "title": "Skinny Girl Individual Omelets",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "16 ounces egg substitute ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped spinach - thawed, drained, and squeezed dry ADVERTISEMENT",
            "1 cup diced bell peppers ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray 12 muffin cups with cooking spray.\nMix egg substitute, spinach, bell peppers, Cheddar cheese, salt, and black pepper together in a bowl; spoon into the prepared muffin cups.\nBake in the preheated oven until tops begin to turn golden brown, about 25 minutes.\n",
        "picture_link": "WeCogEgQ16Rg5/uriGozUcV2m3W1YbC"
    },
    {
        "title": "Caramel Apple Blossoms",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 apple, peeled and cut into very small pieces ADVERTISEMENT",
            "1 teaspoon cinnamon sugar, or to taste ADVERTISEMENT",
            "1 (8 ounce) package refrigerated crescent roll dough ADVERTISEMENT",
            "4 teaspoons caramel ice cream topping ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with aluminum foil and spray with cooking spray.\nCombine apple and cinnamon sugar in a bowl; mix until evenly coated.\nDivide crescent roll dough into 8 triangles. Spoon about 1 teaspoon apple mixture onto each triangle and top with 1/2 teaspoon caramel sauce. Roll crescent dough around the filling, bringing the ends together and squeezing to completely contain the filling. Sprinkle a little more cinnamon sugar on top of each crescent roll. Place rolls on the prepared baking sheet.\nBake in the preheated oven until crescent rolls are lightly browned, 11 to 13 minutes.\n",
        "picture_link": "Vyg9wNipUnyjMi4y.ZSvCnfSwwb9WZC"
    },
    {
        "title": "Slow Cooker Beef Neck Bones and Gravy",
        "ingredients": [
            "1 1/2 pounds beef neck bones, or more to taste ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon ground allspice ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup all-purpose flour, divided ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "2 cups beef broth ADVERTISEMENT",
            "1 onion, sliced into long pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat slow cooker to High.\nClean neck bones and remove any excess fat. Season bones with cumin, allspice, black pepper, red pepper flakes, and salt; dust with 1/4 cup flour.\nHeat olive oil in a large skillet over medium heat; cook and stir garlic until fragrant, 1 to 2 minutes. Increase heat to medium-high and add seasoned neck bones; cook until bones begin to brown, about 1 minute per side.\nTransfer neck bones and drippings to the preheated slow cooker; add beef broth and onion.\nCook on High for 1 hour. Reduce heat to Low and cook 4 to 6 hours.\nTransfer neck bones to a dish. Sprinkle remaining flour into the slow cooker and stir well. Return neck bones to slow cooker. Let stand until gravy thickens, 15 to 20 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Bacon and Fresh Pasta in a Jar",
        "ingredients": [
            "3 ounces fresh pasta ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 cup chopped fresh pea vines ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 slice cooked bacon, broken into pieces ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1/2 teaspoon chile oil, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a pot of water to a boil; add fresh pasta and cook until tender, 3 to 4 minutes. Drain.\nHeat olive oil in a skillet over medium heat; cook and stir pea vines and garlic until vines are wilted, 3 to 4 minutes. Add pasta, bacon, butter, and chile oil to pea vines mixture; toss using tongs until butter is melted. Transfer pasta mixture to a 1-pint mason jar.\n",
        "picture_link": "IK1E6iiwFWemqcmNJOuKk35jLlrd63m"
    },
    {
        "title": "Spicy Asian-Style Wing Sauce",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 teaspoon sesame seeds ADVERTISEMENT",
            "1/2 cup light soy sauce ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "3 tablespoons honey ADVERTISEMENT",
            "2 tablespoons red wine vinegar ADVERTISEMENT",
            "1 tablespoon ginger paste ADVERTISEMENT",
            "2 teaspoons ground mustard ADVERTISEMENT",
            "1 teaspoon red pepper flakes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil and sesame seeds in a small saucepan over low heat; cook and stir until seeds are slightly toasted, 3 to 5 minutes. Add soy sauce, brown sugar, honey, and vinegar; whisk until brown sugar is dissolved, 1 to 2 minutes.\nMix ginger paste, ground mustard, and red pepper flakes into soy sauce mixture; whisk until sauce is smooth, 2 to 3 minutes. Bring sauce to a boil; reduce heat and simmer until thickened, about 5 minutes more.\n",
        "picture_link": "jD5RV9s9wVj85FcZYZSy2pi4qAOy.nu"
    },
    {
        "title": "Healthy Truffles",
        "ingredients": [
            "1/2 cup smooth peanut butter ADVERTISEMENT",
            "1/4 cup cocoa powder ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1/4 cup coconut oil ADVERTISEMENT",
            "1 teaspoon butter (optional) ADVERTISEMENT",
            "1 teaspoon vanilla bean paste ADVERTISEMENT",
            "1/4 cup unsweetened coconut flakes, or more as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine peanut butter, cocoa powder, honey, coconut oil, butter, and vanilla bean paste in a saucepan over low heat; cook, stirring constantly, until melted and smooth, 3 to 5 minutes. Remove saucepan from heat and transfer peanut butter mixture to a bowl.\nRefrigerate mixture, stirring every 5 minutes, until truffle mixture is firm yet sticky and soft enough to shape, about 15 minutes.\nPour coconut flakes into a bowl. Drop truffle mixture, about 1 teaspoon per truffle, into coconut and roll to coat. Refrigerate until firm, about 15 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Coq au Vin (Chicken with Wine)",
        "ingredients": [
            "2 ounces dried wild mushrooms (such as porcini or shiitake) ADVERTISEMENT",
            "1 cup hot water ADVERTISEMENT",
            "6 slices bacon ADVERTISEMENT",
            "8 bone-in chicken thighs ADVERTISEMENT",
            "1/4 cup quick-mixing flour (such as Wondra®), or as needed ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 bunch carrots, cut into matchstick-size pieces ADVERTISEMENT",
            "2 cups fresh mushrooms ADVERTISEMENT",
            "1/2 pound shallots, chopped ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "1 (750 milliliter) bottle Burgundy red wine, divided ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "2 teaspoons herbes de Provence, tied into a cheesecloth bag ADVERTISEMENT",
            "5 sprigs fresh thyme ADVERTISEMENT",
            "3 bay leaves ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley, or as desired ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put dried mushrooms in a bowl and pour in hot water; set aside until mushrooms are rehydrated.\nPlace bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels, reserving bacon grease in the skillet.\nCoat chicken thighs with flour and season with salt and pepper. Working in batches, cook chicken in the bacon grease over medium heat until browned, 2 to 3 minutes per side. Remove chicken thighs as they brown and place on a paper towel-lined plate.\nDrain dried mushrooms through cheesecloth, reserving liquid. Add drained mushrooms, carrots, fresh mushrooms, shallots, and garlic to skillet over medium-high heat; saute for 2 minutes. Pour 1 cup wine into the skillet and bring to a boil while scraping the browned bits of food off of the bottom of the skillet with a wooden spoon until liquid is reduced, about 10 minutes.\nReturn chicken to the skillet and mix in remaining wine, chicken broth, herbes de Provence, thyme, and bay leaves. Liquid should partially cover chicken; if more liquid is needed, add reserved water from mushrooms. Cover skillet and simmer over low heat until chicken is no longer pink in the center, at least 1 hour. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).\nRemove cover from skillet and simmer until sauce is thickened, about 15 minutes more. Add more quick-mixing flour to sauce to thicken, if desired.\nCrumble bacon over chicken and vegetables and garnish with parsley.\n",
        "picture_link": "F31MeaRLyRh.0IFegtKSlDpA/fubDme"
    },
    {
        "title": "Zucchini Noodles and Summer Vegetables with Sweet Pepper Chicken Sausage",
        "ingredients": [
            "2 zucchini, cut into noodle-shape strands ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil, divided ADVERTISEMENT",
            "1/2 cup chopped green bell pepper ADVERTISEMENT",
            "1/3 cup chopped white onion ADVERTISEMENT",
            "1 tablespoon seasoned salt (such as Spike® seasoning) ADVERTISEMENT",
            "1 pinch sea salt and freshly ground black pepper to taste ADVERTISEMENT",
            "2 sweet pepper chicken sausages, sliced ADVERTISEMENT",
            "1 cup lightly torn fresh spinach ADVERTISEMENT",
            "2 tablespoons chopped fresh basil ADVERTISEMENT",
            "1 teaspoon garlic paste ADVERTISEMENT",
            "1 large tomato, diced ADVERTISEMENT",
            "1/4 cup shredded Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a pot of lightly salted water to a boil. Cook zucchini noodles (zoodles) in the boiling water until tender yet firm to the bite, about 3 minutes; drain.\nHeat 1 tablespoon olive oil in a skillet over medium heat; cook and stir green bell pepper, onion, seasoned salt, and sea salt for 3 minutes. Add chicken sausage and cook until sausage is lightly browned, 4 to 5 minutes. Add spinach, basil, garlic paste, and seasoned salt to taste; cook until spinach is wilted, 2 to 3 minutes.\nPlace zoodles on a serving plate and toss with remaining 1 tablespoon olive oil and sea salt. Add sausage mixture and tomatoes and top with Parmesan cheese; season with salt and pepper.\n",
        "picture_link": "AQzy6EjmhvHvnWRyyLJTQBO0HqKXEiC"
    },
    {
        "title": "Green Tea Pear Smoothie",
        "ingredients": [
            "1 cup almond milk ADVERTISEMENT",
            "1 scoop vanilla protein powder ADVERTISEMENT",
            "1 cup fresh spinach ADVERTISEMENT",
            "1 pear, cored ADVERTISEMENT",
            "2 tablespoons chopped cashews ADVERTISEMENT",
            "1/2 teaspoon green tea powder (matcha) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix almond milk and protein powder together in a cup; pour into a blender. Add spinach, pear, cashews, and green tea powder; blend until smooth.\n",
        "picture_link": "tGXYBV.g5dNSM7KEDhXHmhiOpJj1Dh2"
    },
    {
        "title": "Tantalizing Chicken Lettuce Wraps",
        "ingredients": [
            "3 tablespoons canola oil ADVERTISEMENT",
            "1 small onion, diced ADVERTISEMENT",
            "1 cup sliced fresh mushrooms ADVERTISEMENT",
            "3 cloves garlic, or to taste, minced ADVERTISEMENT",
            "2 teaspoons minced fresh ginger ADVERTISEMENT",
            "1 pound ground chicken ADVERTISEMENT",
            "5 tablespoons soy sauce ADVERTISEMENT",
            "1 tablespoon rice vinegar ADVERTISEMENT",
            "1 (8 ounce) can baby corn, drained and chopped ADVERTISEMENT",
            "1 (4 ounce) can sliced water chestnuts, drained and finely chopped ADVERTISEMENT",
            "1 cup chopped sugar snap peas ADVERTISEMENT",
            "1 teaspoon sesame oil ADVERTISEMENT",
            "2 heads Boston lettuce, leaves separated ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat canola oil in a large wok or skillet over medium heat; cook and stir onion, mushrooms, garlic, and ginger for 2 minutes. Add ground chicken; cook and stir, breaking chicken into smaller pieces, until chicken is no longer pink, about 5 minutes.\nPour soy sauce and vinegar over chicken mixture and stir. Add corn and water chestnuts to chicken mixture; cover and cook for 4 minutes. Add snap peas; cover and cook for 2 minutes. Stir sesame oil into chicken mixture.\nScoop about 1/4 cup chicken mixture into each lettuce leaf. Fold leaf around the filling.\n",
        "picture_link": ".N0MlXaM9MsEIHNIcUnoqkyCpOZ6JPG"
    },
    {
        "title": "Parmesan Garlic Bread from Reynolds Wrap®",
        "ingredients": [
            "3 baguettes ADVERTISEMENT",
            "8 ounces unsalted butter ADVERTISEMENT",
            "2 large cloves garlic, peeled and crushed ADVERTISEMENT",
            "1 cup packed finely grated Parmesan cheese ADVERTISEMENT",
            "1 small bunch Italian flat leaf parsley, larger stems removed ADVERTISEMENT",
            "1 tablespoon sea salt ADVERTISEMENT",
            "Reynolds Wrap® Aluminum Foil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Position a rack in the center of the oven and preheat to 450 degrees F.\nCombine the butter, garlic cloves, Parmesan and parsley in a food processor and blend until the mixture is very finely textured and a bright green color (the brighter green, the better).\nWith a knife, cut slices into the tops of the baguettes roughly 1-1 1/2 inches between each slice. Do not go all the way down or the bread will fall apart or slice in half. Use a small spoon or spatula to swipe a generous dollop of the parsley-garlic mixture in each slice.\nTear off 2 sheets of Reynolds Wrap(R) Aluminum Foil per baguette, ensuring the foil is longer than the length of the baguette (12x18 inches); place the baguette on the sheets of foil. Bring up foil sides. Double fold top and ends to seal packet, leaving room for heat circulation inside. Close up the ends nice and tight.\nBake for 10-15 minutes. Open packets carefully by cutting along top fold with a sharp knife, allowing steam to escape; then open top of foil packet. The bottom and top should be crisp; if not, open up the foil and bake for a few more minutes. Sprinkle a bit more salt on the top and serve while still hot, crispy and steamy.\n",
        "picture_link": "IBnbdzY7rS3rE4kVVdAlmeEWO0.Rsaq"
    },
    {
        "title": "Healthy German Chocolate Cake Oatmeal",
        "ingredients": [
            "Oatmeal: ADVERTISEMENT",
            "1/2 cup rolled oats ADVERTISEMENT",
            "1 tablespoon unsweetened cocoa powder ADVERTISEMENT",
            "1 tablespoon ground flax seed ADVERTISEMENT",
            "1 1/2 teaspoons maple syrup ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "Glaze: ADVERTISEMENT",
            "1 1/2 teaspoons honey ADVERTISEMENT",
            "1 teaspoon coconut oil ADVERTISEMENT",
            "2 tablespoons crushed pecans ADVERTISEMENT",
            "1 tablespoon unsweetened flaked coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine oats, cocoa powder, flax seed, maple syrup, vanilla extract, and salt in a saucepan over medium heat; cook and stir until thick, 10 to 15 minutes. Transfer oatmeal to a bowl.\nCombine honey and coconut oil in a microwave-safe bowl; heat in microwave until melted, about 20 seconds. Pour honey mixture over oatmeal and top with pecans and coconut.\n",
        "picture_link": "uJD0cCopIF6mGNanxal8DfL4hKvt7.G"
    },
    {
        "title": "Hash-Browned Spaghetti Squash",
        "ingredients": [
            "1/2 spaghetti squash, halved and seeded ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "2 teaspoons canola oil ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "1/2 red bell pepper, chopped ADVERTISEMENT",
            "1/2 clove garlic, minced ADVERTISEMENT",
            "1 teaspoon Italian seasoning, crushed ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "2 teaspoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place spaghetti squash in a microwave-safe baking dish, cut-side down, pour in water, and cover dish with plastic wrap. Poke a few holes in the plastic wrap for ventilation. Cook on microwave until tender, 6 to 9 minutes. Remove plastic wrap and allow to cool until easily handled.\nHeat canola oil in a skillet over medium heat; cook and stir onion, red bell pepper, garlic, and Italian seasoning in the hot oil until onion is tender, 5 to 10 minutes. Set skillet aside, keeping vegetables warm.\nRun a fork along the flesh of the squash, pulling it into strands. Fluff strands to separate as much as possible and transfer to a bowl. Mix flour and Parmesan cheese into the strands. Add onion mixture and mix well.\nMelt butter in a skillet over medium heat. Spoon about 1/4 cup squash mixture into the hot butter and press to form a 1-inch-thick patty. Cook until golden brown, about 5 minutes per side. Repeat with remaining squash mixture.\n",
        "picture_link": "Ttd8PUa.PvWTfgtitDoajNkHxj2gP9C"
    },
    {
        "title": "Beef and Cabbage (Lazy Golumpki)",
        "ingredients": [
            "1 head green cabbage, cut into bite-size pieces ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon dried parsley ADVERTISEMENT",
            "1/4 teaspoon onion powder ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 cup white rice ADVERTISEMENT",
            "1 (10.75 ounce) can condensed tomato soup (such as Campbell's®) ADVERTISEMENT",
            "1 (32 ounce) container crushed tomatoes (such as Hunt's®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Boil cabbage in a stockpot until tender, 10 to 15 minutes. Drain well.\nHeat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Mix salt, parsley, onion powder, and black pepper into ground beef.\nBring water and rice to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until rice is tender and liquid has been absorbed, 20 to 25 minutes. Stir tomato soup and crushed tomatoes together in a bowl.\nPreheat oven to 350 degrees F (175 degrees C).\nCombine cabbage, seasoned ground beef, rice, and tomato mixture together in a bowl; transfer to a 9x13-inch baking dish.\nBake in the preheated oven until bubbling, about 45 minutes.\n",
        "picture_link": "pVAa0aixXDkoLtAE4GElGXgrjKI/dB."
    },
    {
        "title": "Caramel Pull Aparts",
        "ingredients": [
            "1 cup brown sugar ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 tablespoon milk ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "3 (10 ounce) cans refrigerated buttermilk biscuit dough (such as Pillsbury®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a fluted tube pan (such as Bundt(R)).\nCombine brown sugar, butter, milk, and cinnamon together in a saucepan over medium-low heat; cook and stir until caramel sauce is smooth, about 5 minutes.\nSprinkle pecans in the bottom of the prepared pan; top with 1/2 of the caramel sauce. Layer biscuits over caramel sauce. Pour the remaining caramel sauce over biscuits.\nBake in the preheated oven until cooked through, 20 to 30 minutes. Turn pan over onto a plate to serve.\n",
        "picture_link": "O/MuEDznHcPEkfkB.IKNtxsAARTt9Iq"
    },
    {
        "title": "Steamed Fresh Green Beans with Garlic Dill Hollandaise Sauce",
        "ingredients": [
            "5 slices turkey bacon ADVERTISEMENT",
            "1/4 cup Swanson® Unsalted Chicken Stock ADVERTISEMENT",
            "1/4 cup heavy whipping cream ADVERTISEMENT",
            "1 1/2 teaspoons fresh lemon juice ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon dried dill weed ADVERTISEMENT",
            "6 egg yolks ADVERTISEMENT",
            "1/4 teaspoon fresh ground black pepper ADVERTISEMENT",
            "2 cups Swanson® Chicken Broth ADVERTISEMENT",
            "2 pounds fresh whole green beans, trimmed ADVERTISEMENT",
            "1/2 teaspoon fresh ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place turkey bacon in a skillet over medium to medium-high heat. Cook to desired crispness, turning occasionally, about 6 minutes. Remove from heat; let cool slightly. Chop bacon into small pieces.\nMix Swanson(R) Chicken Stock, cream, lemon juice, minced garlic, and dill in a microwaveable bowl. Microwave on HIGH for 1 minute, 30 seconds.\nPlace water in the bottom of a double boiler; water should not touch the bottom of the top pan. Bring water to a boil. Lightly beat egg yolks in the top of the double boiler. Cook, stirring until thickened and egg yolks are about double in volume, 3 to 5 minutes. Reduce heat to low.\nGradually whisk in stock/cream mixture, whisking until completely combined. Mix thoroughly for another minute. Season with 1/4 teaspoon black pepper. Remove from heat and cover to keep sauce warm.\nSet a steamer basket insert into a large saucepan. Pour in Swanson(R) Chicken Broth to just below the bottom of the steamer; bring to a boil. Add green beans, season with 1/2 teaspoon black pepper and steam until crisp-tender, about 5 minutes. Discard leftover chicken broth or reserve for another use.\nTransfer beans to a serving dish; sprinkle with bacon crumbles. Top with hollandaise sauce and serve.\n",
        "picture_link": "7LxafxTZcuQHX0.Ik/nyAGYNCrdB0P6"
    },
    {
        "title": "Spicy Broccoli with Parmesan Cheese",
        "ingredients": [
            "2 tablespoons slivered almonds ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "4 cups broccoli florets ADVERTISEMENT",
            "1/8 teaspoon crushed red pepper ADVERTISEMENT",
            "1/4 cup dry white wine ADVERTISEMENT",
            "3/4 cup Swanson® Chicken Broth ADVERTISEMENT",
            "3 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "1 tablespoon lemon zest ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toast the almonds in a 4-quart saucepot over medium-high heat until lightly browned. Remove the almonds from the pot and set aside.\nIn the same saucepot, heat the oil over medium-high heat. Add the garlic, broccoli and crushed red pepper and cook for 2 minutes, stirring occasionally.\nAdd the wine and broth to the saucepot and cook for 3 minutes, stirring to scrape up any brown bits from the pot. Reduce the heat to low and cook for 3 minutes or until the broccoli is tender-crisp.\nStir in the Parmesan cheese and cook for 2 minutes or until the broccoli is tender. Stir in the lemon zest and sprinkle with the toasted almonds.\n",
        "picture_link": "xIycZBZt3CzWDY2j3UVb7vTIUasRRIG"
    },
    {
        "title": "Lemon Meringue Cheesecake",
        "ingredients": [
            "2 cups shortbread cookie crumbs ADVERTISEMENT",
            "1/4 cup melted butter ADVERTISEMENT",
            "3 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/4 cup fresh lemon juice ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 lemon, zested ADVERTISEMENT",
            "4 egg whites ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/4 teaspoon cream of tartar (optional) ADVERTISEMENT",
            "1 1/2 cups lemon curd ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nMix cookie crumbs and melted butter together in a bowl until evenly combined; press into the bottom of a 9-inch springform pan.\nBeat cream cheese, sour cream, and 1 cup sugar together in a bowl using an electric mixer until smooth and creamy. Add eggs, 1 at a time, and beat well after each addition. Mix lemon juice, vanilla extract, and egg whites into cream cheese mixture, scraping bottom and sides of bowl. Spread mixture over cookie crust in springform pan.\nBake in the preheated oven until almost set in the center, about 1 hour. Cool to room temperature and refrigerate until completely cooled, at least 3 to 4 hours.\nPreheat oven to 375 degrees F (190 degrees C).\nBeat egg whites in a bowl using an electric mixer until soft peaks form; add 1/4 cup sugar and cream of tartar and beat until stiff peaks form, but not until dry.\nSpread lemon curd over top of cheesecake. Mound whipped egg whites over the curd, sealing around all the edges.\nBake in the preheated oven until meringue is golden brown, about 10 minutes. Chill uncovered in refrigerator.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "PayDay® Bars",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 (16 ounce) jar dry-roasted peanuts, divided ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 (12 ounce) package peanut butter chips ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "3 cups miniature marshmallows ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spray the bottom of a 9x13-inch baking dish with cooking spray.\nSpread 1/2 of the peanuts into the prepared baking dish.\nCook and stir sweetened condensed milk, peanut butter chips, and butter in a saucepan over medium heat until melted, about 5 minutes. Add marshmallows and stir until smooth. Pour mixture over peanuts and top with remaining peanuts.\nRefrigerate until chilled, 1 to 2 hours. Cut into bars.\n",
        "picture_link": "xAxG80dXCJ6yZ84x3NS.APOeUd.TJuG"
    },
    {
        "title": "Apple Cinnamon Funnel Cakes",
        "ingredients": [
            "1 cup vegetable oil, or as needed ADVERTISEMENT",
            "1/4 cup confectioners' sugar ADVERTISEMENT",
            "3/4 teaspoon ground cinnamon, divided ADVERTISEMENT",
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "3/4 cup apple cider ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour about 3/4 inch oil in a 12-inch skillet and heat 325 degrees F (165 degrees C).\nCombine confectioners' sugar and 1/4 teaspoon cinnamon in a bowl. Mix flour, apple cider, egg, baking powder, vanilla extract, 1/2 teaspoon cinnamon, and salt together in a separate large bowl until batter is smooth. Pour batter into a funnel with a narrow spout or squeeze bottle, covering the opening with a clean finger.\nDispense batter into the hot oil in a spiral pattern, making about a 6-inch cake; cook until lightly browned, about 5 minutes per side. Transfer cake to a paper towel-lined plate and sprinkle confectioners' sugar mixture over cake.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Kiyoko's Miso Sauce",
        "ingredients": [
            "5 tablespoons mirin (Japanese sweet wine) ADVERTISEMENT",
            "3 tablespoons red miso paste ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "1 1/4 tablespoons cooking sake ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine mirin, miso paste, egg yolk, and sake in a saucepan and mix well; bring to a boil, stirring constantly. Reduce heat to low and simmer, stirring constantly, until sauce is the consistency of jam, 10 to 15 minutes.\n",
        "picture_link": ".7G/zbCJQx/hxuO1ofKd8KqNehrHF.O"
    },
    {
        "title": "Lean and Green",
        "ingredients": [
            "1 cup fresh spinach ADVERTISEMENT",
            "1 banana ADVERTISEMENT",
            "1/2 green apple ADVERTISEMENT",
            "4 hulled strawberries ADVERTISEMENT",
            "4 (1 inch) pieces frozen mango ADVERTISEMENT",
            "1/3 cup whole milk ADVERTISEMENT",
            "1 scoop vanilla protein powder (optional) ADVERTISEMENT",
            "1 teaspoon honey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend spinach, banana, apple, strawberries, mango, milk, protein powder, and honey together in a blender until smooth.\n",
        "picture_link": "Y0HpJbkjI4XUDcOmMmcGprWhbK6Hhja"
    },
    {
        "title": "Belizean Bread Pudding",
        "ingredients": [
            "2 eggs ADVERTISEMENT",
            "1 (12 fluid ounce) can evaporated milk ADVERTISEMENT",
            "12 fluid ounces coconut milk ADVERTISEMENT",
            "6 fluid ounces sweetened condensed milk ADVERTISEMENT",
            "4 fluid ounces dark rum ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup melted butter ADVERTISEMENT",
            "1/4 cup raisins ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 loaf bread, torn in pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 250 degrees F (120 degrees C). Grease a 9x13-inch baking dish.\nBeat eggs in a large bowl until frothy. Add evaporated milk, coconut milk, sweetened condensed milk, rum, sugar, butter, raisins, vanilla extract, nutmeg, and cinnamon and mix well; fold in bread. Pour mixture into the prepared baking dish.\nBake in the preheated oven until browned and edges are beginning to look dry, about 1 hour.\n",
        "picture_link": "KIrJN7f8uw/9.IIkF.LO5jOhu5MGWdS"
    },
    {
        "title": "Cantonese Chicken Chow Mein",
        "ingredients": [
            "Marinade: ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1 teaspoon rice wine vinegar ADVERTISEMENT",
            "1 teaspoon soy sauce ADVERTISEMENT",
            "1 teaspoon cornstarch ADVERTISEMENT",
            "1 teaspoon sesame oil ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 skinless, boneless chicken breast half, thinly sliced ADVERTISEMENT",
            "Seasonings: ADVERTISEMENT",
            "1/2 cup chicken broth ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "2 teaspoons oyster sauce ADVERTISEMENT",
            "1 teaspoon rice wine vinegar ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/4 cup canola oil, divided ADVERTISEMENT",
            "1 pound chow mein noodles ADVERTISEMENT",
            "1 stalk celery, thinly sliced on the diagonal ADVERTISEMENT",
            "1 carrot, cut into matchstick-size pieces ADVERTISEMENT",
            "1/4 cup bean sprouts ADVERTISEMENT",
            "1/4 cup thinly sliced onion ADVERTISEMENT",
            "1 green onion, thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk water, 1 teaspoon rice wine vinegar, 1 teaspoon soy sauce, cornstarch, sesame oil, and black pepper together in a bowl until marinade is smooth. Add chicken and marinate, about 15 minutes.\nStir chicken broth, 1 tablespoon soy sauce, oyster sauce, 1 teaspoon rice wine vinegar, and sugar together in a bowl until seasoning mixture is well combined.\nHeat 3 tablespoons canola oil in a large skillet over medium heat; cook and stir noodles until golden brown and crisp, about 1 minute. Transfer noodles to a platter.\nPour the remaining 1 tablespoon into skillet with the oil; cook and stir chicken over high heat until no longer pink in the center, about 5 minutes. Add seasoning mixture, celery, carrot, bean sprouts, onion, and green onion; cook and stir until sauce thickens, about 30 seconds. Pour chicken mixture over noodles.\n",
        "picture_link": "fNhfOCFE5ZkuGRvuhISIx6LpYFE4BDq"
    },
    {
        "title": "Original Ranch Mashed Potatoes",
        "ingredients": [
            "2 pounds peeled Idaho potatoes, chopped ADVERTISEMENT",
            "3 tablespoons butter, softened ADVERTISEMENT",
            "1/3 cup half-and-half ADVERTISEMENT",
            "1 tablespoon chipotle peppers in adobo sauce ADVERTISEMENT",
            "2 tablespoons Hidden Valley® Original Ranch® Salad Dressing & Seasoning Mix ADVERTISEMENT",
            "Salt to taste ADVERTISEMENT",
            "Pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes in large pan with water over high heat and boil until tender but still firm, about 15-20 minutes. Heat butter, half-and-half and peppers in saucepan over low heat until combined. Drain potatoes and place in mixer with butter sauce. Add dressing mix and process until smooth. Season with salt and pepper.\n",
        "picture_link": "p8gkm8UwtKVFl6YBTChXyDhCo.XTjW2"
    },
    {
        "title": "Poached Halibut with Chunky Pineapple Salsa",
        "ingredients": [
            "1 (15 ounce) can pineapple chunks in juice ADVERTISEMENT",
            "1 seedless cucumber, peeled and diced ADVERTISEMENT",
            "1 medium red bell pepper, chopped ADVERTISEMENT",
            "2 tablespoons chopped red onion ADVERTISEMENT",
            "1 teaspoon white wine vinegar ADVERTISEMENT",
            "1 teaspoon hot pepper sauce (optional) ADVERTISEMENT",
            "1 3/4 cups Swanson® Chicken Broth or Swanson® Chicken Stock ADVERTISEMENT",
            "1/4 cup white wine ADVERTISEMENT",
            "4 (6 ounce) halibut fillets ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Drain the pineapple and reserve 2/3 cup juice.\nStir the pineapple chunks, cucumber, red pepper, red onion, vinegar and hot pepper sauce, if desired, in a medium bowl.\nHeat the broth, wine and reserved pineapple juice in a 12-inch skillet over medium-high heat to a boil. Add the fish to the skillet. Reduce the heat to low. Cover and cook for 10 minutes or until the fish flakes easily when tested with a fork. Serve the fish with the pineapple salsa.\n",
        "picture_link": "tZjvvWmzcojsA2GylC2HUb3eMcbRJLC"
    },
    {
        "title": "Cranberry Pecan Multi-Grain Stuffing",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1/4 cup chopped fresh celery ADVERTISEMENT",
            "1/4 teaspoon poultry seasoning ADVERTISEMENT",
            "1/2 cup dried cranberries ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1 bag Minute® Multi-Grain Medley, uncooked ADVERTISEMENT",
            "1/2 cup chopped pecans, toasted ADVERTISEMENT",
            "Salt and ground black pepper (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a medium saucepan over medium heat. Add onion and celery and cook 2 minutes. Add poultry seasoning, cranberries and broth.\nBring to a boil and stir in Multi-Grain Medley. Cover, reduce heat and simmer 5 minutes.\nRemove from heat and let stand 5 minutes. Stir in pecans and season with salt and pepper, if desired.\n",
        "picture_link": "ySkvOJPDJPrlaFkPTzBlTrKZ3Vjja5S"
    },
    {
        "title": "Gluten-Free Biscotti",
        "ingredients": [
            "3 eggs ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "3/4 cup vegetable oil ADVERTISEMENT",
            "2 teaspoons anise seed ADVERTISEMENT",
            "1 1/2 cups gluten-free all-purpose flour mix (such as Bob's Red Mill®) ADVERTISEMENT",
            "1 1/2 cups rice-based flour mix with xanthan gum ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon xanthan gum ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup chopped almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Line a baking sheet with parchment paper or lightly grease.\nBeat eggs together in a bowl until thick and lemon-colored. Gradually add sugar to eggs while continually beating. Pour oil into egg-sugar mixture and beat until smooth. Mix gluten-free all-purpose flour mix, rice-based flour mix, baking soda, and xanthan gum together in a separate bowl; gradually stir into egg-sugar mixture until dough is well-mixed and sticky. Fold almonds into the dough.\nTurn dough onto the prepared baking sheet and form into 2 loaves, 1/2-inch thick and 2 1/2 inches wide.\nBake in the preheated oven for 20 minutes. Cool loaves on the baking sheet for 2 minutes; slice into 1/2-inch slices. Lay slices, cut-side down, on baking sheet.\nBake in the oven until golden brown, 10 to 15 minutes. Transfer biscotti to a wire rack to cool completely.\n",
        "picture_link": "kGDa26irgTFKUyK6Q1G2L9V4bWWoUK2"
    },
    {
        "title": "Sausage & Apple Stuffing",
        "ingredients": [
            "1 3/4 cups Swanson® Chicken Broth or Swanson® Certified Organic Chicken Broth or Swanson® Natural Goodness® Chicken Broth ADVERTISEMENT",
            "1 stalk celery, coarsely chopped ADVERTISEMENT",
            "1 small onion, coarsely chopped ADVERTISEMENT",
            "1/2 Red Delicious apple, chopped ADVERTISEMENT",
            "1/2 Granny Smith apple, chopped ADVERTISEMENT",
            "1/2 pound bulk pork sausage, cooked and crumbled ADVERTISEMENT",
            "2 cups Pepperidge Farm® Herb Seasoned Stuffing ADVERTISEMENT",
            "2 cups Pepperidge Farm® Corn Bread Stuffing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the broth, celery, onion and apples in a 3-quart saucepan over medium-high heat to a boil. Reduce the heat to low. Cover and cook for 5 minutes or until the vegetables and apples are tender.\nAdd the sausage and stuffing and stir lightly to coat.\n",
        "picture_link": "tlSeiqP6Dz6KbwUpXEAkrqMfhvuam7u"
    },
    {
        "title": "Zucchini Cornbread Dressing",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "2 cups grated zucchini ADVERTISEMENT",
            "1 medium onion, minced ADVERTISEMENT",
            "5 cups cornbread crumbs ADVERTISEMENT",
            "2 cups sourdough bread crumbs ADVERTISEMENT",
            "1 cup Swanson® Chicken Broth ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon dried sage ADVERTISEMENT",
            "1/2 teaspoon poultry seasoning ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lightly oil a 9x13-inch baking dish.\nHeat 1 tablespoon oil in skillet over medium heat. Add zucchini and onion; saute until zucchini is softened slightly, about 3 minutes. Remove from heat.\nIn large bowl, combine cornbread and sourdough crumbs, Swanson(R) Chicken Broth, sour cream, and butter. Stir in zucchini mixture, eggs, sage, poultry seasoning, salt, and pepper. Mix until evenly moistened. Spread into prepared baking dish.\nBake in preheated oven until lightly browned, 30 to 40 minutes.\n",
        "picture_link": "nOgSXFbu4VqCiZoLhW3/ANE0rNnTCMu"
    },
    {
        "title": "Thai Ginger Chicken with Yellow Jasmine Rice",
        "ingredients": [
            "1 cup uncooked jasmine rice ADVERTISEMENT",
            "1/4 teaspoon ground turmeric ADVERTISEMENT",
            "3 tablespoons canola oil, divided ADVERTISEMENT",
            "1 1/4 pounds skinless, boneless chicken breast halves, cut into thin strips ADVERTISEMENT",
            "1 small eggplant, cut lengthwise in quarters, then crosswise into 1/2-inch-thick slices ADVERTISEMENT",
            "1 large red bell pepper, cut into 2-inch-long strips ADVERTISEMENT",
            "1 large onion, cut in half and into 1/2-inch-thick slices ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "3/4 cup Swanson® Thai Ginger Flavor Infused Broth ADVERTISEMENT",
            "3/4 cup unsweetened coconut milk ADVERTISEMENT",
            "2 jalapeno peppers, seeded and chopped ADVERTISEMENT",
            "1 cup fresh cilantro leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare the rice according to the package directions, adding the turmeric to the cooking water.\nHeat 1 tablespoon oil in a 12-inch skillet over medium-high heat. Add the chicken and cook until browned, stirring often. Remove the chicken from the skillet.\nHeat the remaining oil in the skillet. Add the eggplant, red pepper and onion and cook for 5 minutes or until the vegetables are tender-crisp, stirring occasionally. Add the garlic and cook and stir for 1 minute. Add the broth and heat to a boil. Reduce the heat to medium. Cook for 8 minutes, stirring occasionally.\nPlace the coconut milk, jalapeno peppers and cilantro into a blender. Cover and blend until the mixture is smooth.\nStir the coconut milk mixture in the skillet. Return the chicken to the skillet. Cook until the chicken is cooked through. Serve the chicken mixture with the rice.\n",
        "picture_link": "6sG3EZGFfnDJ5c782XwalN0pXngTvEq"
    },
    {
        "title": "Salmon with Creamy Dill Sauce from Swanson®",
        "ingredients": [
            "4 (5 ounce) salmon fillets, skin removed ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/4 cup minced shallot ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/4 cup dry white wine ADVERTISEMENT",
            "1 cup Swanson® Seafood Stock ADVERTISEMENT",
            "1/4 cup heavy cream ADVERTISEMENT",
            "1 tablespoon chopped fresh dill weed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season the fish with the salt and black pepper.\nHeat 1 tablespoon oil in a 10-inch skillet over medium-high heat. Add the fish and cook for 3 minutes. Turn the fish over and cook for 1 minute. Remove the fish from the skillet. Wipe the skillet clean with a paper towel.\nHeat the remaining oil in the skillet over medium-high heat. Add the shallots and garlic and cook and stir for 3 minutes or until tender.\nStir in the wine and cook for 3 minutes or until the wine is almost evaporated. Stir in the stock and heavy cream and heat to a boil. Reduce heat to medium. Cook for 15 minutes or until the mixture is reduced to about 3/4 cup, stirring often. Stir in the dill.\nReturn the fish to the skillet. Cover and cook for 5 minutes or until the fish flakes easily when tested with a fork.\n",
        "picture_link": ".DpBIBOHp9M8SLx.K/TWHEx6.NkpE4S"
    }
]