[
    {
        "title": "Asparagus Wrapped in Crisp Prosciutto",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "16 spears fresh asparagus, trimmed ADVERTISEMENT",
            "16 slices prosciutto ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 450 degrees F (220 degrees C). Line a baking sheet with aluminum foil, and coat with olive oil.\nWrap one slice of prosciutto around each asparagus spear, starting at the bottom, and spiraling up to the tip. Place the wrapped spears on the prepared baking sheet.\nBake for 5 minutes in the preheated oven. Remove, and shake the pan back and forth to roll the spears over. Return to the oven for another 5 minutes, or until asparagus is tender, and prosciutto is crisp. Serve immediately.\n",
        "picture_link": "Hx312muHfSFM5ioI2E8wopaZVx/Bo6K"
    },
    {
        "title": "Carrie's Artichoke and Sun-Dried Tomato Pasta",
        "ingredients": [
            "1 (8 ounce) package fresh fettuccine ADVERTISEMENT",
            "4 tablespoons butter ADVERTISEMENT",
            "1/2 medium onion, chopped ADVERTISEMENT",
            "1 (8 ounce) package sliced mushrooms ADVERTISEMENT",
            "3 cloves garlic, crushed ADVERTISEMENT",
            "2/3 (8 ounce) jar sun-dried tomatoes, packed in oil ADVERTISEMENT",
            "1 (2 ounce) can sliced black olives, drained ADVERTISEMENT",
            "10 ounces marinated artichoke hearts ADVERTISEMENT",
            "1 cup dry white wine ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1 ripe tomato, chopped ADVERTISEMENT",
            "1 cup Parmesan cheese ADVERTISEMENT",
            "1 teaspoon black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with lightly salted water and bring it to a rolling boil.\nWhile the water is heating, melt the butter over medium heat in a large saucepan. Add the onions, mushrooms, and garlic; cook and stir until tender, about 5 minutes.\nStir in the sun-dried tomatoes, olives, artichoke hearts, wine, and lemon juice. Bring to a boil; reduce the heat and simmer until liquid is reduced by a third, about 4 minutes.\nCook the fresh pasta in boiling water until done, about 2 minutes. Drain.\nToss pasta with sauce. Top with fresh tomatoes and cheese, add pepper to taste, and serve.\n",
        "picture_link": "GVHwyvtinscuRxgujKKgQz9sBJaE9sa"
    },
    {
        "title": "Slow Cooker Pork Cacciatore",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "4 boneless pork chops ADVERTISEMENT",
            "1 (28 ounce) jar pasta sauce ADVERTISEMENT",
            "1 (28 ounce) can diced tomatoes ADVERTISEMENT",
            "1 green bell pepper, seeded and sliced into strips ADVERTISEMENT",
            "1 (8 ounce) package fresh mushrooms, sliced ADVERTISEMENT",
            "2 large cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon Italian seasoning ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1/2 cup dry white wine ADVERTISEMENT",
            "4 slices mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet, brown chops over medium-high heat. Transfer to slow cooker.\nIn the same pan, cook onion in oil over medium heat until browned. Stir in mushrooms and bell pepper, and cook until these vegetables are soft. Mix in pasta sauce, diced tomatoes, and white wine. Season with Italian seasoning, basil, and garlic. Pour over pork chops in slow cooker.\nCook on Low for 7 to 8 hours. To serve, place a slice of cheese over each chop, and cover with sauce.\n",
        "picture_link": "TMxdO6u4b051WnPAF4AYnT4Tmo/G3UO"
    },
    {
        "title": "Dump Cake V",
        "ingredients": [
            "1 (21 ounce) can cherry pie filling ADVERTISEMENT",
            "1 (20 ounce) can crushed pineapple, drained ADVERTISEMENT",
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1 cup margarine, melted ADVERTISEMENT",
            "1 cup flaked coconut ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking dish.\nIn the prepared dish, layer the cherry pie filling and the drained pineapple. Sprinkle the dry cake mix over the top, covering evenly. Pour the melted margarine over the cake mix, and sprinkle the top with the coconut and chopped walnuts.\nBake 50 to 60 minutes in the preheated oven, until browned and bubbly.\n",
        "picture_link": "zwI/0IhWxd8wV2tzq5kZRtFp0EZ0erS"
    },
    {
        "title": "Hawaiian Bread I",
        "ingredients": [
            "1/2 cup mashed banana ADVERTISEMENT",
            "1/2 cup crushed pineapple, with juice ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1/4 cup margarine, softened ADVERTISEMENT",
            "1 teaspoon coconut extract ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1/2 cup instant potato flakes ADVERTISEMENT",
            "3 cups bread flour ADVERTISEMENT",
            "1 1/2 teaspoons active dry yeast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ingredients in the pan of the bread machine in the order recommended by the manufacturer. Select Light setting; press Start.\n",
        "picture_link": "JV/4UlCOPzyyqUvWnrnACRiAKyfM9oy"
    },
    {
        "title": "Make-Ahead Slow Cooker Beef Stew",
        "ingredients": [
            "1/3 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon Spanish smoked paprika ADVERTISEMENT",
            "1/2 teaspoon seasoned salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "2 pounds beef chuck, cut into 1-inch cubes ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 (8 ounce) package mushrooms, chopped ADVERTISEMENT",
            "3 potatoes, diced ADVERTISEMENT",
            "5 carrots, sliced ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/4 cup Marsala wine ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "3 (10.5 ounce) cans organic beef broth ADVERTISEMENT",
            "1 (14.5 ounce) can crushed tomatoes ADVERTISEMENT",
            "1 (1 ounce) package dry onion soup mix ADVERTISEMENT",
            "1 teaspoon Spanish smoked paprika, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons cornstarch (optional) ADVERTISEMENT",
            "2 tablespoons water (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the flour, 1 teaspoon smoked paprika, seasoned salt, and 1/2 teaspoon black pepper in a large, resealable plastic bag. Add the beef, and seal the bag. Shake the bag thoroughly to coat the beef with seasoned flour.\nHeat the olive oil in a large skillet over medium-high heat. Shake the excess seasoning off the beef, then stir the beef into the hot skillet with the onion and mushrooms. Cook and stir until the beef is evenly browned and no longer pink. Drain and discard any excess grease.\nPlace the beef mixture into a slow cooker. Place the potatoes, carrots, celery, garlic, Marsala wine, and Worcestershire sauce into the cooker with the beef mixture. Pour the beef broth and tomatoes into the cooker, and stir in the onion soup mix and 1 more teaspoon of smoked paprika. Cook on High for 4 to 6 hours, or on Low for 10 to 12 hours. Season to taste with salt and black pepper.\nFor a thicker stew, combine cornstarch and water in a small bowl. Gradually stir the mixture into the stew until thickened.\n",
        "picture_link": "ahYMCSohYLP8I6rSMLDpZvvawO0huWK"
    },
    {
        "title": "Catfish Cakes",
        "ingredients": [
            "1 pound catfish fillets ADVERTISEMENT",
            "1 medium onion, chopped ADVERTISEMENT",
            "1 teaspoon prepared yellow mustard ADVERTISEMENT",
            "1 tablespoon creamy salad dressing (e.g. Miracle Whip) ADVERTISEMENT",
            "1/2 teaspoon Old Bay Seasoning TM, or to taste ADVERTISEMENT",
            "2 1/2 cups coarsely crushed buttery round crackers ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup vegetable oil (for frying) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place catfish in a saucepan with enough water to cover. Bring to a boil, and cook until fish flakes easily with a fork. Drain off water, and mash up the fish. Stir in the onion, mustard, salad dressing, Old Bay(TM), cracker crumbs and egg. Mix until evenly blended.\nHeat oil in a large heavy skillet over medium-high heat. Form the fish mixture into patties, and fry in the hot oil. Drain on paper towels, and serve hot.\n",
        "picture_link": "PMrcuJsYfyynbj4xo445c/hyT8LjoU2"
    },
    {
        "title": "Curried Quinoa",
        "ingredients": [
            "2 tablespoons olive oil, or as needed ADVERTISEMENT",
            "1 small onion, diced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 cup quinoa ADVERTISEMENT",
            "2 cups chicken broth ADVERTISEMENT",
            "1 tablespoon curry powder, or to taste ADVERTISEMENT",
            "1 tablespoon ancho chile powder ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large skillet over medium heat. Add onion and garlic and cook and stir for 2 minutes; add quinoa and cook and stir until lightly toasted, about 5 minutes.\nPour broth into the pan and bring to a boil. Reduce heat and add curry and chile powders; cover and simmer until tender, about 25 minutes. Season to taste with salt and pepper.\n",
        "picture_link": "kZPPXaaM4PITsAHC2Azyh6/W9SQRqS6"
    },
    {
        "title": "Easy Homemade Vanilla Ice Cream",
        "ingredients": [
            "4 cups half-and-half or light cream ADVERTISEMENT",
            "1 (14 ounce) can EAGLE BRAND® Sweetened Condensed Milk ADVERTISEMENT",
            "2 tablespoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In large bowl, combine ingredients; mix well. Pour into ice cream freezer container. Freeze according to manufacturer's instructions. Freeze leftovers.\n",
        "picture_link": "u4cDR.eumzLlht6Z.8QuZ7X4O0nLJqi"
    },
    {
        "title": "French Spring Soup",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "1 pound leeks, chopped ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 quarts water ADVERTISEMENT",
            "3 large potatoes, chopped ADVERTISEMENT",
            "2 large carrots, chopped ADVERTISEMENT",
            "1 bunch fresh asparagus, trimmed and cut into 1 inch pieces ADVERTISEMENT",
            "1/3 cup uncooked long-grain white rice ADVERTISEMENT",
            "4 teaspoons salt ADVERTISEMENT",
            "1/2 pound fresh spinach ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a large pot over medium heat. Stir in the leeks and onion, and cook until tender.\nPour water into the pot. Mix in potatoes, carrots, asparagus, and rice. Season with salt. Bring to a boil, reduce heat, and simmer 30 minutes, until vegetables and rice are tender.\nStir spinach and heavy cream into the soup mixture, and continue cooking about 5 minutes before serving.\n",
        "picture_link": "Qa0l7x9dgJ8naCdotsVjA0T5ij4xMi6"
    },
    {
        "title": "Cool Whip Cookies",
        "ingredients": [
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 (18.25 ounce) package lemon cake mix ADVERTISEMENT",
            "1/3 cup confectioners' sugar for decoration ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease baking sheets.\nBeat together the whipped topping and eggs together. Add the lemon cake mix and continue to mix. Dough will be thick.\nDrop by teaspoonfuls into a bowl of confectioners' sugar and roll to coat. Place cookies on the prepared baking sheets. Bake at 350 degrees F (175 degrees C) for 8 minutes.\n",
        "picture_link": "TlV2.HOcQPrT6DWlS5xSF.63xrx/.qC"
    },
    {
        "title": "Butter Crescents",
        "ingredients": [
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 (.25 ounce) package active dry yeast ADVERTISEMENT",
            "1/2 cup warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "3 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Warm the milk in a small saucepan until bubbles form at the edges; remove from heat. Mix in the butter, sugar, and salt. Let cool until lukewarm. In a small bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes.\nIn a large bowl, combine milk and yeast mixtures. Stir in 1 egg. Beat in flour 1 cup at a time until dough pulls together. Turn out onto a lightly floured surface, and knead until smooth and elastic, about 8 minutes. Lightly oil a large bowl, place the dough in the bowl, and turn to coat. Cover with a damp cloth, and let rise in a warm place until doubled in volume, about 1 hour.\nDeflate the dough, and turn it out onto a lightly floured surface. Divide the dough into two equal pieces, and form into rounds. Cover, and let rest 10 minutes.\nUsing a floured rolling pin, roll each dough half into a 12 inch circle. Cut each circle into 6 wedges. Roll each wedge up towards the point. Bend ends inward to form crescents, and place point side down on lightly greased baking sheets. Cover, and let rise until doubled, about 30 minutes. Meanwhile, preheat oven to 400 degrees F (200 degrees C).\nBrush rolls with beaten egg, and bake for 12 to 15 minutes in the preheated oven, or until golden brown.\n",
        "picture_link": "pYH6ZkNEUTW1v9iRhwkcNIvxMVZue02"
    },
    {
        "title": "Ciabatta",
        "ingredients": [
            "For Sponge (Biga): ADVERTISEMENT",
            "1/8 teaspoon active dry yeast ADVERTISEMENT",
            "2 tablespoons warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "1/3 cup warm water ADVERTISEMENT",
            "1 cup bread flour ADVERTISEMENT",
            "For Bread: ADVERTISEMENT",
            "1/2 teaspoon active dry yeast ADVERTISEMENT",
            "2 tablespoons warm milk (110 degrees F/45 degrees C) ADVERTISEMENT",
            "2/3 cup warm water ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 cups bread flour ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To Make Sponge: In a small bowl stir together 1/8 teaspoon of the yeast and the warm water and let stand 5 minutes, or until creamy. In a bowl stir together yeast mixture, 1/3 cup of the water, and 1cup of the bread flour. Stir 4 minutes, then over bowl with plastic wrap. Let sponge stand at cool room temperature for at least 12 hours and up to 1 day.\nTo Make Bread: In a small bowl stir together yeast and milk and let stand 5 minutes, or until creamy. In bowl of a standing electric mixer fitted with dough hook blend together milk mixture, sponge, water, oil, and flour at low speed until flour is just moistened; add salt and mix until smooth and elastic, about 8 minutes. Scrape dough into an oiled bowl and cover with plastic wrap.\nLet dough rise at room temperature until doubled in bulk, about 1 1/2 hours. (Dough will be sticky and full of air bubbles.) Turn dough out onto a well-floured work surface and cut in half. Transfer each half to a parchment sheet and form into an irregular oval about 9 inches long. Dimple loaves with floured fingers and dust tops with flour. Cover loaves with a dampened kitchen towel. Let loaves rise at room temperature until almost doubled in bulk, 1 1/2 to 2 hours.\nAt least 45 minutes before baking ciabatta, put a baking stone on oven rack in lowest position in oven and preheat oven to 425 F (220 degrees C).\nTransfer 1 loaf on its parchment to a rimless baking sheet with a long side of loaf parallel to far edge of baking sheet. Line up far edge of baking sheet with far edge of stone or tiles, and tilt baking sheet to slide loaf with parchment onto back half of stone or tiles. Transfer remaining loaf to front half of stone in a similar manner. Bake ciabatta loaves 20 minutes, or until pale golden. Cool loaves on a wire rack.\n",
        "picture_link": "7ufS8kqLUTyXgVN94aJoMi.lhTpyMT."
    },
    {
        "title": "Maple Cookies",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup real maple syrup ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "1/3 cup granulated sugar for decoration ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nIn a large bowl, cream the butter and brown sugar. Add the egg, syrup and vanilla. Mix until well blended. Sift together the flour, salt and baking soda. Stir into mixture until well blended. Shape into 1 inch balls and roll in sugar. Place on cookie sheets about 2 inches apart and flatten slightly.\nBake 8 to 10 minutes in the preheated oven. Let cool on wire rack.\n",
        "picture_link": "mEcLd8GGiheqGe/jgZ9lcWOHlpuw7i."
    },
    {
        "title": "California Coleslaw",
        "ingredients": [
            "1 small head cabbage, shredded ADVERTISEMENT",
            "1 small white onion, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "1 small carrot, shredded ADVERTISEMENT",
            "1/2 cup cider vinegar ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large salad bowl, place the cabbage, onion, green bell pepper, red bell pepper and carrot. Combine the vinegar, sugar, salt, pepper and vegetable oil in the bowl with the vegetables. Toss the mixture until the vegetables are fully coated with the marinade.\n",
        "picture_link": "DfobkLbkazzlv8s5Mys.6TTj8qroV02"
    },
    {
        "title": "Maryland Crab Cakes III",
        "ingredients": [
            "1 1/8 cups crushed saltine crackers ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1 teaspoon prepared brown mustard ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "1 stalk celery, chopped ADVERTISEMENT",
            "1 teaspoon Old Bay Seasoning TM ADVERTISEMENT",
            "1 pound crabmeat ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven on broiler setting. Lightly grease a baking sheet.\nIn a medium bowl, mix together crushed saltine crackers, mayonnaise, brown mustard, onion, celery, and Old Bay seasoning. Gently stir in the crabmeat. Shape into 6 patties. Place on prepared baking sheet.\nBroil crab cakes 8 to 10 minutes on each side, or until golden brown.\n",
        "picture_link": "gBeqTlyyBarW0Lu1TExNT8neWZ9uMb6"
    },
    {
        "title": "Bierock Casserole",
        "ingredients": [
            "1/2 cup chopped onion ADVERTISEMENT",
            "1 1/2 pounds lean ground beef ADVERTISEMENT",
            "1 (16 ounce) can sauerkraut, drained and pressed dry ADVERTISEMENT",
            "2 (8 ounce) cans refrigerated crescent rolls ADVERTISEMENT",
            "1 (8 ounce) package shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBrown onion and ground beef in a large skillet over medium high heat; drain extra fat out of skillet, then stir in drained sauerkraut. Heat through and set aside.\nPress 1 package of crescent roll dough into the bottom of a lightly greased 9x13 inch baking dish. Spread beef mixture on top, then lay 2nd package of crescent roll dough over the top of the beef mixture. Press dough seams together and sprinkle all with cheese.\nBake in preheated oven for 25 to 30 minutes, or until golden brown.\n",
        "picture_link": "8Dkm0tuzbLej.Yyr5gCd9ytGCjClDMe"
    },
    {
        "title": "Cajun Crab Soup",
        "ingredients": [
            "1/2 cup unsalted butter ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "2 cups clam juice ADVERTISEMENT",
            "2 cups chicken broth ADVERTISEMENT",
            "1 (10 ounce) package frozen white corn ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground white pepper ADVERTISEMENT",
            "1/4 teaspoon dried thyme ADVERTISEMENT",
            "1/4 teaspoon ground cayenne pepper ADVERTISEMENT",
            "2 cups heavy cream ADVERTISEMENT",
            "1 pound lump crabmeat, drained ADVERTISEMENT",
            "4 green onions, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large saucepan over medium heat. Saute onion and garlic until onion is tender. Whisk in flour, and cook 2 minutes. Stir in clam juice and chicken broth, and bring to a boil. Mix in corn, and season with salt, white pepper, thyme, and cayenne. Reduce heat, and simmer 15 minutes.\nStir in cream, crab meat, and green onions. Heat through, but do not boil once the cream has been added.\n",
        "picture_link": "Db/3mQvFnI2n/XcCbWhLmvUdotIyfXi"
    },
    {
        "title": "Easy Fried Eggplant",
        "ingredients": [
            "2 tablespoons canola oil ADVERTISEMENT",
            "1 large eggplant, peeled and sliced ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "2 cups dry bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large skillet over medium-high heat. Dip eggplant slices in egg, then in crumbs, and place in hot oil. Fry 2 to 3 minutes on each side, or until golden brown. Drain on paper towels.\n",
        "picture_link": "VzNac2KtexvYBp7nVE507ez.llKe2pC"
    },
    {
        "title": "Chewy Peanut Butter Cookies",
        "ingredients": [
            "1 cup packed brown sugar ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup peanut butter ADVERTISEMENT",
            "1 cup shortening ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "2 tablespoons hot water ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix sugars, peanut butter, and shortening. Add baking soda to the hot water. Add to mixture. Stir well.\nStir in the eggs. Add the flour. Roll dough into balls.\nPlace balls on ungreased cookie sheet. Press with fork dipped in water to make criss-cross design. Bake at 350 - 375 degrees F (175 - 190 degrees C) for about 8-10 minutes.\n",
        "picture_link": "AjHCWtzYriFWSRcc4hsTdvoH8O0sRri"
    },
    {
        "title": "Chocolate Zucchini Muffins",
        "ingredients": [
            "3 eggs ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "1/3 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "2 cups grated zucchini ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1/4 teaspoon ground cardamom ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease or line two 12 cup muffin tins with paper liners.\nIn a large bowl beat the eggs. Beat in the sugar and oil. Add the cocoa, vanilla, zucchini and stir well.\nStir in the flour, baking soda, baking powder, salt, cinnamon, nutmeg, cloves and cardamom. Mix until just moist.\nPour batter into prepared muffin tins filling 2/3 of the way full. Bake at 350 degrees F (175 degrees C) for 20 to 25 minutes. Remove from pan and let cool on a wire rack. Store loosely covered.\n",
        "picture_link": "rYcfaLrbctqgpRHtFb.sKoUu9mDZkKO"
    },
    {
        "title": "Fresh Pumpkin Pie",
        "ingredients": [
            "1 medium sugar pumpkin ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 recipe pastry for a 9 inch single crust pie ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "4 eggs, lightly beaten ADVERTISEMENT",
            "1 cup honey, warmed slightly ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup heavy whipping cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut pumpkin in half, and remove seeds. Lightly oil the cut surface. Place cut side down on a jelly roll pan lined with foil and lightly oiled. Bake at 325 degrees F (165 degrees C) until the flesh is tender when poked with a fork. Cool until just warm. Scrape the pumpkin flesh from the peel. Either mash, or puree in small batches in a blender.\nIn large bowl, blend together 2 cups pumpkin puree, spices, and salt. Beat in eggs, honey, milk, and cream. Pour filling into pie shell.\nBake at 400 degrees F ( 205 degrees C) for 50 to 55 minutes, or until a knife inserted 1 inch from edge of pie comes out clean. Cool on a wire rack.\n",
        "picture_link": "I.cP.6v6Om.XWlrWS6r/8bt96rQ.zEG"
    },
    {
        "title": "Rolled Dumplings",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/3 cup shortening ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "2 (14.5 ounce) cans chicken broth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine flour, baking powder and salt. Cut in shortening and add milk to make a stiff dough.\nRoll out to about 1/8 inch thickness and cut into 1 inch squares, 1 to 1 1/2 inch strips or diamonds. Sprinkle lightly with flour and drop into boiling chicken stock. Cover tightly and boil gently for 8 to 10 minutes.\n",
        "picture_link": "t.u5mzcFltmtCgFOluH0BXdiMw.3hBS"
    },
    {
        "title": "Vegetable Lo Mein",
        "ingredients": [
            "8 ounces uncooked spaghetti ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "2 cups fresh sliced mushrooms ADVERTISEMENT",
            "1 cup shredded carrots ADVERTISEMENT",
            "1/2 cup sliced red bell peppers ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 cups fresh bean sprouts ADVERTISEMENT",
            "1/2 cup chopped green onions ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1/4 cup hoisin sauce ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1 teaspoon grated fresh ginger ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1/4 teaspoon curry powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nHeat oil in a large wok or saute pan. Stir fry mushrooms, carrots, peppers, onion and garlic until tender. Stir in bean sprouts and green onions; cook one minute. Mix cornstarch and chicken broth in a small bowl and add to stir fry. Stir in hoisin sauce, honey, soy sauce, ginger, cayenne pepper and curry powder. Cook and stir until thickened and bubbly.\nAdd cooked spaghetti, and toss. Serve immediately.\n",
        "picture_link": ".VScSKn8hY29n/EYi2iBjKaczUkGxiW"
    },
    {
        "title": "Baked Brie in Puff Pastry",
        "ingredients": [
            "1/2 (17.5 ounce) package frozen puff pastry, thawed ADVERTISEMENT",
            "1 (8 ounce) wheel Brie cheese ADVERTISEMENT",
            "1/4 cup sliced almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degree C). Lightly grease a 9 inch pie pan.\nSlice the wheel of Brie in half, horizontally, so that the halves are two, flatter wheels of Brie. Lay the puff pastry in the pie pan. Place half of the Brie (rind-side down) onto the pastry dough. Sprinkle almonds evenly over the top. Place the other half of the Brie (rind-side up) over the almonds. Bundle the pastry dough around the Brie.\nBake for 15 to 20 minutes. Let cool for 5 minutes before serving.\n",
        "picture_link": ".6V2eAjGeTMHcMs.Zzy8dO5Lerrh8Zq"
    },
    {
        "title": "Tomato-Curry Lentil Stew",
        "ingredients": [
            "1/2 cup dry lentils ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "5 ounces stewed tomatoes ADVERTISEMENT",
            "1/8 cup chopped onion ADVERTISEMENT",
            "2 stalks celery, chopped, with leaves ADVERTISEMENT",
            "1/4 teaspoon curry powder ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine lentils and water, bring to a boil.\nLower heat to simmer, add tomatoes, onion, and celery. Cover and let simmer 45 minutes. Check every 15 minutes to stir, and add water if necessary. Add spices last 15 minutes to taste. Taste and re-spice if necessary before serving.\n",
        "picture_link": "qK9PQ6aQM/aqcmjVfwr0wSfZ3tNSmNe"
    },
    {
        "title": "Mac and Cheese II",
        "ingredients": [
            "8 ounces elbow macaroni ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "8 ounces cubed processed cheese food ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot with boiling salted water cook elbow macaroni until al dente. Drain.\nIn a medium saucepan, over medium heat melt butter or margarine. Whisk flour and stir vigorously. Add milk and cook until thick and bubbly, about 5 to 7 minutes. Add cheeses and stir until completely melted.\nIn a large bowl mix together the drained pasta and cheese sauce mixture. Toss to coat evenly.\nPour into a greased 2 quart casserole dish. Bake in a preheated 350 degree F (175 degrees C) oven for 30 minutes. Let stand 10 minutes before serving.\n",
        "picture_link": "40CsHMpAfBMA6jF2BTpk5gyuFm.gBFK"
    },
    {
        "title": "Jeanie's Falafel",
        "ingredients": [
            "1 (19 ounce) can garbanzo beans, rinsed and drained ADVERTISEMENT",
            "1 small onion, finely chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 1/2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "1 teaspoon dried parsley ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "1/8 teaspoon ground turmeric ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1 cup fine dry bread crumbs ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon cracked black peppercorns ADVERTISEMENT",
            "1 quart vegetable oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mash the garbanzo beans in a large bowl. Stir in the onion, garlic, cilantro, parsley, cumin, turmeric, baking powder, bread crumbs, salt and pepper. Do not be afraid to use your hands. Shape the mixture into 1 1/2 inch balls; you should get 18 to 24. If the mixture does not hold together, add a little water.\nHeat the oil in a deep fryer to 375 degrees F (190 degrees C). Carefully drop the balls into the hot oil, and fry until brown. If you do not have a deep fryer, heat the oil in a heavy deep skillet over medium-high heat. You may need to adjust the heat slightly after the first couple of falafels, and be sure to turn frequently so they brown evenly.\n",
        "picture_link": "Xg5b9uGCeznkVGpaGBHZVF6dqeZ4cb2"
    },
    {
        "title": "Awesome Bow Tie Pasta",
        "ingredients": [
            "1 (16 ounce) package bow tie pasta ADVERTISEMENT",
            "2 green onions, chopped ADVERTISEMENT",
            "1 (6 ounce) package feta cheese, crumbled ADVERTISEMENT",
            "1/2 cup balsamic vinegar ADVERTISEMENT",
            "1/4 cup extra virgin olive oil ADVERTISEMENT",
            "2 cups chopped fresh tomato ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain and place in ice water until cool.\nToss pasta with onion, feta, balsamic, olive oil and tomato. Serve immediately or chill 1 to 2 hours in refrigerator.\n",
        "picture_link": "ff98XAkYmv5qqqy20.Q/MNdLE05RI8e"
    },
    {
        "title": "Banana Oatmeal Crumb Cake",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "2/3 cup packed brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup mashed bananas ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "1 1/3 cups rolled oats ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "3/4 cup rolled oats ADVERTISEMENT",
            "1/3 cup packed brown sugar ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "2 tablespoons chopped walnuts ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together flour, 1 1/3 cups oats, salt, and baking soda.\nIn a large bowl, cream 1/2 cup butter or margarine with 2/3 cup brown sugar. Beat in the eggs, then the bananas and vanilla. Beat the flour mixture into the banana mixture. Turn the batter into a greased and floured 8 inch square pan.\nMix 3/4 cup oats, 1/3 cup brown sugar, melted butter or margarine, walnuts, and cinnamon together until crumbly. Sprinkle evenly over the top of the batter.\nBake in preheated oven at 350 degrees F (175 degrees C) for 40 to 45 minutes, or until it tests done. Transfer to a rack to cool.\n",
        "picture_link": "sgM3Mnb/z32NOXIaRtf7LJYbTpbaXW."
    },
    {
        "title": "Vegetarian Four Cheese Lasagna",
        "ingredients": [
            "2 cups peeled and diced pumpkin ADVERTISEMENT",
            "1 eggplant, sliced into 1/2 inch rounds ADVERTISEMENT",
            "5 tomatoes ADVERTISEMENT",
            "1 pint ricotta cheese ADVERTISEMENT",
            "9 ounces crumbled feta cheese ADVERTISEMENT",
            "2/3 cup pesto ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "fresh pasta sheets ADVERTISEMENT",
            "1 1/3 cups shredded mozzarella cheese ADVERTISEMENT",
            "1 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace pumpkin on a baking sheet and roast in oven until browned and tender, about 30 minutes. Meanwhile, grill eggplant on a charcoal grill or fry in a skillet, turning once, until charred and tender, 10 to 15 minutes. Halve tomatoes and place on baking sheet in oven for last 15 minutes of pumpkin time; cook until tender and wrinkly.\nIn a medium bowl, stir together ricotta, feta, pesto, eggs, salt and pepper until well mixed. Fold roasted pumpkin into ricotta mixture.\nSpoon half of the tomato sauce into a 9x13 baking dish. Lay two pasta sheets over the sauce. Arrange a single layer of eggplant slices over pasta and top with half the ricotta mixture. Cover with two more pasta sheets. Arrange the roasted tomatoes evenly over the sheets and spoon the remaining half the ricotta mixture over the tomatoes. Sprinkle with half the mozzarella. Top with remaining two sheets of pasta. Pour remaining tomato sauce over all and sprinkle with remaining mozzarella and Parmesan.\nBake in preheated oven 30 to 40 minutes, until golden and bubbly.\n",
        "picture_link": "1FCxKfNZqKDtA75sHu0sBXjE2AeT/oy"
    },
    {
        "title": "Garlic Top Sirloin Pot Roast",
        "ingredients": [
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 (3 pound) top sirloin roast ADVERTISEMENT",
            "6 cloves garlic, slivered ADVERTISEMENT",
            "6 Yukon Gold potatoes, peeled and quartered ADVERTISEMENT",
            "4 carrots, cut into 2 inch pieces ADVERTISEMENT",
            "2 large sweet onions, peeled and chopped ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/2 cup beef broth ADVERTISEMENT",
            "3 cubes beef bouillon ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "2 large green bell peppers, cut into 2 inch pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rub salt, pepper and paprika into the meat. With a small knife, make slits in the roast. Press the garlic slivers into the roast.\nPlace the potatoes, carrots, and onions in a large slow cooker. Place meat on top of the vegetables. Pour in water and beef broth, and add bouillon cubes and bay leaf.\nPlace lid on slow cooker, and cook for 6 hours on High, or 8 hours on Low. During the last half hour of cooking, add the green peppers.\n",
        "picture_link": "plg2vNkEYFddUBrkzyaHxPQyCG3wQdO"
    },
    {
        "title": "Cauliflower Fried 'Rice'",
        "ingredients": [
            "2 cups frozen peas ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/4 cup sesame oil, divided ADVERTISEMENT",
            "4 cups cubed pork loin ADVERTISEMENT",
            "6 green onions, sliced ADVERTISEMENT",
            "1 large carrot, cubed ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "20 ounces shredded cauliflower ADVERTISEMENT",
            "6 tablespoons soy sauce ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir peas and water together in a saucepan; bring to a boil, reduce heat to medium-low, and cook and stir until peas are tender and heated through, about 5 minutes. Drain and discard water.\nHeat 2 tablespoons sesame oil in a wok over medium-high heat. Cook and stir pork in hot oil until lightly browned on all sides and cooked through, 7 to 10 minutes. Transfer meat to a plate.\nHeat remaining 2 tablespoons sesame oil the wok. Saute green onions, carrot, and garlic in hot oil until just softened, about 5 minutes. Add cauliflower; cook and stir until cauliflower had a tender but firm to the bite, 4 to 5 minutes.\nStir pork, peas, and and soy sauce into cauliflower mixture and stir-fry until mixture is hot and slightly browned, 3 to 5 minutes.\nMove pork-cauliflower mixture to one side of the wok; pour beaten eggs onto empty side. Scramble eggs until cooked through, 3 to 5 minutes; stir cooked eggs into the pork-cauliflower mixture, breaking up any large chunks.\n",
        "picture_link": "5Ha4ZHGgZF1KWNBIekajcr7s14YMasS"
    },
    {
        "title": "Gingerbread Men Cookies",
        "ingredients": [
            "3 cups flour ADVERTISEMENT",
            "2 teaspoons McCormick® Ginger, Ground ADVERTISEMENT",
            "1 teaspoon McCormick® Cinnamon, Ground ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon McCormick® Nutmeg, Ground ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3/4 cup butter, softened ADVERTISEMENT",
            "3/4 cup firmly packed brown sugar ADVERTISEMENT",
            "1/2 cup molasses ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon McCormick® Pure Vanilla Extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix flour, ginger, cinnamon, baking soda, nutmeg and salt in large bowl. Set aside. Beat butter and brown sugar in large bowl with electric mixer on medium speed until light and fluffy. Add molasses, egg and vanilla;mix well. Gradually beat in flour mixture on low speed until well mixed. Press dough into a thick flat disk. Wrap in plastic wrap. Refrigerate 4 hours or overnight.\nPreheat oven to 350 degrees F. Roll out dough to 1/4-inch thickness on lightly floured work surface. Cut into gingerbread men shapes with 5-inch cookie cutter. Place 1 inch apart on ungreased baking sheets.\nBake 8 to 10 minutes or until edges of cookies are set and just begin to brown. Cool on baking sheets 1 to 2 minutes. Remove to wire racks; cool completely. Decorate cooled cookies as desired. Store cookies in airtight container up to5 days.\n",
        "picture_link": "BF/pZVI7cjoR89FArdbDMa8l9zwHYd2"
    },
    {
        "title": "Chocolate Velvet Ice Cream",
        "ingredients": [
            "2/3 cup white sugar ADVERTISEMENT",
            "1/3 cup unsweetened cocoa powder ADVERTISEMENT",
            "3 egg yolks, beaten ADVERTISEMENT",
            "2 2/3 cups heavy cream ADVERTISEMENT",
            "1/3 cup semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In large bowl, stir together sugar and cocoa. Add egg yolks and blend with electric mixer. Add cream a little at a time, beating well after each addition. Chill mixture in refrigerator.\nWhile cream mixture is chilling, grate chocolate chips in blender or food processor or using a rotary grater, until fine. Stir into cream mixture. Freeze in canister of ice cream maker according to manufacturer's instructions.\n",
        "picture_link": "NFQ0wWX5ObsfOYZ.CShPS4FbR8o5j4S"
    },
    {
        "title": "Chef John's Caramel Apple Pie",
        "ingredients": [
            "6 tablespoons unsalted butter ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1/4 teaspoon cinnamon ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "5 apples - peeled, cored and sliced ADVERTISEMENT",
            "1 pastry for double-crust pie (see footnote for recipe link) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nCombine butter, white sugar, brown sugar, water, cinnamon, and salt in a saucepan over medium heat. Bring to a boil, remove from heat and set aside.\nRoll out half the pastry to fit a 9-inch pie plate. Place bottom crust in pie plate; pour in apple slices.\nRoll out top crust into a 10-inch circle. Cut into 8 (1-inch) wide strips with a sharp paring knife or pastry wheel. Weave the pastry strips, one at a time, into a lattice pattern. Fold the ends of the lattice strips under the edge of the bottom crust and crimp to seal.\nPour butter-sugar mixture over top of pie, coating the lattice, and allowing any remaining sauce to drizzle through the crust.\nBake in the preheated oven for 15 minutes. Reduce heat to 350 degrees F (175 degrees C), and bake until the crust is golden brown, the caramel on the top crust is set, and the apple filling is bubbling, 35 to 40 more minutes. Allow to cool completely before slicing.\n",
        "picture_link": "jxzJZRBylLEPSF.CkbG1UePbITMHQea"
    },
    {
        "title": "Sweet Potato Rolls",
        "ingredients": [
            "1 (.25 ounce) package active dry yeast ADVERTISEMENT",
            "4 tablespoons white sugar ADVERTISEMENT",
            "1/2 cup canned sweet potato puree ADVERTISEMENT",
            "1/2 cup warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "3 tablespoons margarine, softened ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3 1/2 cups all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dissolve yeast, warm water, and 1 tablespoon sugar in a mixing bowl. Let stand 5 minutes.\nAdd remaining sugar, sweet potato, butter or margarine, salt, and slightly beaten eggs. Stir to mix well. Stir in 3 cups of flour. Turn out on a lightly floured surface. Knead 2 to 3 minutes, adding just enough of remaining flour to prevent sticking. Do not knead too heavily; when smooth, shape into a ball. Place in an oiled bowl, and turn to coat the surface. Cover, and let raise about 1 hour or longer.\nPunch down, and allow dough to rest for 2 minutes. Divide into 16 to 20 balls, and place on a greased cookie sheet or in a 9x13 inch pan. Allow to rise until doubled.\nBake at 375 degrees F (190 degrees C) for 12 to 20 minutes. Serve warm.\n",
        "picture_link": "8wWCZIfekeI6xk5xwQ4SVL8JetkOs1G"
    },
    {
        "title": "Sweet and Sour Meatballs I",
        "ingredients": [
            "2 pounds ground beef ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 (12 fluid ounce) can or bottle chili sauce ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "1 cup grape jelly ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine beef, egg, onion and salt. Mix together, then shape into little balls.\nIn a slow cooker combine chili sauce, lemon juice and grape jelly. Stir in meatballs and cook on high for 4 to 5 hours.\n",
        "picture_link": "NJdzSjwlIxhEJvvU9buMhRKBf.06Fla"
    },
    {
        "title": "Banana Smoothie I",
        "ingredients": [
            "1 banana ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 pinch ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender, combine banana, milk, vanilla, egg and sugar. Blend until smooth. Pour into a tall glass and top with a pinch of cinnamon.\n",
        "picture_link": "M3MEtItapOjCwe7Gnl.2pDhc.O3X1ra"
    },
    {
        "title": "Chef John's Baked Eggs",
        "ingredients": [
            "1/3 cup marinara sauce ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "1 1/2 teaspoons chopped fresh flat-leaf parsley ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 tablespoon finely shredded Parmigiano-Reggiano cheese ADVERTISEMENT",
            "2 teaspoons olive oil ADVERTISEMENT",
            "2 tablespoons heavy whipping cream ADVERTISEMENT",
            "2 slices toast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nSpoon marinara sauce into the bottom of a small baking dish, about 1/4 inch high. Sprinkle with red pepper flakes, salt, black pepper, and parsley. Make a narrow well in the center of the sauce for the eggs.\nCrack each egg into a ramekin, then pour into the baking dish over the marinara sauce.\nSprinkle with Parmigiano-Reggiano cheese, olive oil, and cream. Season with salt and black pepper to taste.\nBake in the preheated oven until yolks are just set, 10 to 12 minutes. Serve with toast.\n",
        "picture_link": "TV5/eB4088DwowSmMSNMI5p9XSop/D2"
    },
    {
        "title": "French Breakfast Puffs",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon nutmeg ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/3 cup shortening ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "6 tablespoons margarine, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease 12 muffin cups or line cups with paper muffin liners.\nIn a large bowl, whisk together flour, baking powder, salt, and nutmeg. In a separate bowl, cream together 1/2 cup sugar and shortening. Beat in egg. Stir flour mixture into shortening mixture alternately with milk. Beat well. Spoon batter into prepared muffin cups.\nBake in preheated oven for 20 to 25 minutes. While muffins are baking, combine 1/2 cup sugar and 1 teaspoon cinnamon.\nRemove muffins from oven and muffin pan. Immediately, dip the tops of the muffins into the melted margarine, then into the sugar/cinnamon mixture. Repeat with each muffin, until all muffin tops are covered. Serve warm.\n",
        "picture_link": "hlTEWG9Mfcyzwv75.De.V2Kirxhl4.S"
    },
    {
        "title": "Fabulous Fudge Chocolate Cake",
        "ingredients": [
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2 1/2 cups packed brown sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "3 (1 ounce) squares unsweetened chocolate, melted ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 cup boiling water ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 3/4 cups confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSift together the flour, baking soda and salt. Set aside.\nIn a large bowl, beat 1/2 cup butter or margarine and 2 1/2 cups brown sugar until well mixed. Add eggs one at a time. Beat in the vanilla and melted chocolate squares. Add 1/2 the sour cream and then 1/2 the dry ingredients to the butter mixture until well blended.\nAdd the remaining sour cream and dry ingredients to the batter. Stir in boiling water.\nBake in a greased 9 X 13 inch pan for 35 minutes.\nLet cool 10 minutes before icing.\nTo Make Caramel Icing: First melt 1/2 cup butter in a saucepan. Stir in 1 cup brown sugar and boil about 2 minutes. Stir in 1/4 cup milk and bring to a boil. Place pan in cold water and stir in the confectioners' sugar. Continue stirring until smooth. Spread over still warm cake.\n",
        "picture_link": "nNWVF6XRvKIW4VXNr4Qrd3JFczlLQ5m"
    },
    {
        "title": "Paleo Omelet Muffins",
        "ingredients": [
            "8 eggs ADVERTISEMENT",
            "8 ounces cooked ham, crumbled ADVERTISEMENT",
            "1 cup diced red bell pepper ADVERTISEMENT",
            "1 cup diced onion ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease 8 muffin cups or line with paper liners.\nBeat eggs together in a large bowl. Mix ham, bell pepper, onion, salt, black pepper, and water into the beaten eggs. Pour egg mixture evenly into prepared muffin cups.\nBake in the preheated oven until muffins are set in the middle, 18 to 20 minutes.\n",
        "picture_link": "rB8fDb7Ey/cyHynDHucnnffSdG8ctWq"
    },
    {
        "title": "Chocolate Pudding Cake II",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3/4 cup packed brown sugar ADVERTISEMENT",
            "1/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 1/2 cups boiling water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F ( 175 degrees C).\nIn ungreased 9 inch square pan, stir together flour, white sugar, cocoa, the baking powder, and salt. Mix in milk, oil, and vanilla with a fork until smooth.\nSpread batter evenly in pan (batter will be thick). Sprinkle with brown sugar and 1/4 cup cocoa. Pour boiling water over batter.\nBake at 350 degrees F (175 degrees C) for 40 minutes. Let stand 15 minutes, then spoon into dessert dishes or cut into squares. Invert each square onto dessert plate and spoon sauce over each serving. Top with ice cream or whipped topping, if desired.\n",
        "picture_link": "xfCEd7yTRpWdlVXUfW8krTK7ORcTyD."
    },
    {
        "title": "Krista's Sticky Honey Garlic Wings",
        "ingredients": [
            "24 chicken wings, split and tips discarded ADVERTISEMENT",
            "3/4 cup packed brown sugar ADVERTISEMENT",
            "5 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon minced fresh ginger root ADVERTISEMENT",
            "2 1/2 cups water ADVERTISEMENT",
            "5 tablespoons honey ADVERTISEMENT",
            "1/4 cup reduced-sodium soy sauce ADVERTISEMENT",
            "3 tablespoons cornstarch ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 375 degrees F (190 degrees C).\nArrange the chicken wings on a baking sheet; bake until crisp, 35 to 45 minutes. Transfer the wings to a baking dish.\nMix together the brown sugar, garlic, ginger, 2 1/2 cups water, honey, and soy sauce in a saucepan over medium-high heat; bring to a boil. Whisk together the cornstarch and 3/4 cup water in a small bowl; stir into the sauce mixture until thickened; pour over the chicken wings to coat.\nReturn wings to oven and bake until the sauce is bubbling and the chicken is no longer pink at the bone and the juices run clear, 15 to 20 minutes.\n",
        "picture_link": "yoLwj9dxvUwqFn.ofiHICHDrfb5ZOpK"
    },
    {
        "title": "Cherry Crisp",
        "ingredients": [
            "1 (21 ounce) can cherry pie filling ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup rolled oats ADVERTISEMENT",
            "2/3 cup brown sugar ADVERTISEMENT",
            "3/4 teaspoon ground cinnamon ADVERTISEMENT",
            "3/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 cup chopped pecans ADVERTISEMENT",
            "1/3 cup melted margarine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C.) Lightly grease a 2 quart baking dish. Pour pie filling into the dish, and spread evenly.\nIn a medium bowl, mix together flour, oats, sugar, cinnamon, and nutmeg. Mix in melted margarine. Spread over pie filling, and sprinkle with chopped pecans.\nBake in the preheated oven for 30 minutes, or until topping is golden brown. Allow to cool 15 minutes before serving.\n",
        "picture_link": "AQ9TLsEoS9gbeZSjc3K89ZGHlasjDxS"
    },
    {
        "title": "Baked Chicken",
        "ingredients": [
            "1 cup sour cream ADVERTISEMENT",
            "2 tablespoons Dijon mustard ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 cup crushed cornflakes cereal ADVERTISEMENT",
            "1 (1 ounce) package dry onion soup mix ADVERTISEMENT",
            "3 tablespoons butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 400 degrees F (200 degrees C). Butter a baking dish.\nWhisk the sour cream, Dijon mustard, garlic, and pepper together in a large bowl. Add the chicken and turn to assure the breasts are well coated. Refrigerate 20 to 30 minutes.\nCombine the cornflakes and onion soup mix in a bowl. Gently press the chicken breasts into the cornflakes mixture to coat and shake off any excess. Lie the coated breasts in the buttered baking dish. Drizzle the melted butter over the chicken.\nBake in the preheated oven until the chicken is golden brown, 20 to 25 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "ZBkhTR7xdynHg9YncATSCsyEIopwXZS"
    },
    {
        "title": "Cajun Chicken Lasagna",
        "ingredients": [
            "1 (16 ounce) package lasagna noodles ADVERTISEMENT",
            "1 pound andouille sausage, quartered lengthwise and sliced ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast halves - cut into chunks ADVERTISEMENT",
            "2 teaspoons Cajun seasoning ADVERTISEMENT",
            "1 teaspoon dried sage ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1/2 cup chopped celery ADVERTISEMENT",
            "1/4 cup chopped red bell pepper ADVERTISEMENT",
            "1 tablespoon finely chopped garlic ADVERTISEMENT",
            "2 (10 ounce) containers Alfredo Sauce, divided ADVERTISEMENT",
            "1 1/2 cups shredded mozzarella cheese ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Bring a large pot of lightly salted water to a boil. Add pasta, and cook for 8 to 10 minutes, or until al dente; drain.\nIn a large skillet over medium-high heat, combine sausage, chicken, Cajun seasoning and sage. Cook until chicken is no longer pink and juices run clear, about 8 minutes. Remove meat from skillet with a slotted spoon, and set aside. Saute onion, celery, bell pepper and garlic until tender. Remove from heat, and stir in cooked meat and one container Alfredo sauce.\nLightly grease a 9x13 inch baking dish. Cover bottom with 4 lasagna noodles. Spread with 1/2 of the meat mixture. Repeat layers, and cover with a layer of noodles. Spread remaining Alfredo sauce over top. Top with mozzarella cheese and sprinkle with Parmesan cheese.\nBake in preheated oven for 1 hour. Let stand 15 minutes before serving.\n",
        "picture_link": "UMiJVpbA7mE9egQmQdeUYx1m.nXdvyG"
    },
    {
        "title": "Zucchini Boats on the Grill",
        "ingredients": [
            "2 medium zucchini ADVERTISEMENT",
            "1 slice white bread, torn into small pieces ADVERTISEMENT",
            "1/4 cup bacon bits ADVERTISEMENT",
            "1 tablespoon minced black olives ADVERTISEMENT",
            "1 jalapeno pepper, minced ADVERTISEMENT",
            "3 tablespoons diced green chile peppers ADVERTISEMENT",
            "1/4 cup minced onion ADVERTISEMENT",
            "1/4 cup chopped tomato ADVERTISEMENT",
            "6 tablespoons shredded sharp Cheddar cheese ADVERTISEMENT",
            "1 pinch dried basil ADVERTISEMENT",
            "seasoned salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare the grill for indirect heat.\nPlace the zucchini in a pot with enough water to cover. Bring to a boil, and cook 5 minutes. Drain, cool, and cut in half lengthwise. Scoop out the pulp to about 1/4 inch from the skin. Chop pulp.\nIn a bowl, mix the zucchini pulp, bread pieces, bacon bits, olives, jalapeno, green chile peppers, onion, tomato, and Cheddar cheese. Season with basil, seasoned salt, and pepper.\nStuff the zucchini halves with the pulp mixture. Seal each stuffed half in aluminum foil.\nPlace foil packets on the prepared grill over indirect heat. Cook 15 to 20 minutes, until tender.\n",
        "picture_link": "XWGKsIWJRvSzFj0KinAf0TsWq/YWoL."
    },
    {
        "title": "Tomato Bisque II",
        "ingredients": [
            "2 pounds tomatoes ADVERTISEMENT",
            "2 cubes beef bouillon, crumbled ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1/4 teaspoon dried basil ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/3 cup all-purpose flour ADVERTISEMENT",
            "1 quart milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Run the tomatoes through a food mill to remove the seeds and skins, and place in a large pot over medium heat. Stir in the bouillon, sugar, salt, bay leaf, basil and pepper. Bring to a boil, then reduce heat, and simmer 30 minutes. (If you're going to can this mixture, process it now.)\nIn a small saucepan over medium heat, melt butter. Whisk in flour all at once to form a roux, cook 1 minute. Whisk in milk, a little at a time, cooking and stirring constantly until thickened. Stir into tomato mixture and heat through.\n",
        "picture_link": "TDLnvVRGasnHyjeHAiB1i5FqCspntM."
    },
    {
        "title": "Eggplant Sandwiches",
        "ingredients": [
            "1 small eggplant, halved and sliced ADVERTISEMENT",
            "1 tablespoon olive oil, or as needed ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 (6 inch) French sandwich rolls ADVERTISEMENT",
            "1 small tomato, sliced ADVERTISEMENT",
            "1/2 cup crumbled feta cheese ADVERTISEMENT",
            "1/4 cup chopped fresh basil leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat your oven's broiler. Brush eggplant slices with olive oil, and place them on a baking sheet or broiling pan. Place the pan about 6 inches from the heat source. Cook under the broiler for 10 minutes, or until tender and toasted.\nSplit the French rolls lengthwise, and toast. In a cup or small bowl, stir together the mayonnaise and garlic. Spread this mixture on the toasted bread. Fill the rolls with eggplant slices, tomato, feta cheese and basil leaves.\n",
        "picture_link": "neHmvPnOQ.q3tjS1nr19NZfm4J3xyNi"
    },
    {
        "title": "Easy Cheap and Yummy Casserole",
        "ingredients": [
            "1 (28 ounce) can baked beans ADVERTISEMENT",
            "2 (16 ounce) packages hot dogs, sliced ADVERTISEMENT",
            "1 (7.5 ounce) package corn bread mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 400 degrees F (200 degrees C).\nPour the can of beans into a 9x13 inch baking dish so they cover the bottom. Arrange hot dog slices so they cover the beans as completely as possible. If too much juice seeps through to the cornbread, it will take longer to cook. Prepare cornbread mix according to package directions. Spread the batter evenly over the hot dog layer.\nBake for 35 to 40 minutes, or until cornbread is cooked through. A toothpick inserted into the center should come out clean.\n",
        "picture_link": "SOylvggFTT5/qLSeUPLjhLsN3cshwde"
    },
    {
        "title": "Doc's Best Beef Jerky",
        "ingredients": [
            "2 pounds beef round steak, cut into thin strips ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "2 tablespoons liquid smoke ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon meat tenderizer ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place beef strips in the bottom of a large bowl. Pour soy sauce, Worcestershire sauce, liquid smoke, brown sugar, salt, pepper, meat tenderizer, garlic powder, onion powder, and paprika over beef. Mix to assure all the meat is evenly coated. Cover and marinate in the refrigerator for 8 hours or overnight.\nRemove meat from bowl and place between two pieces of plastic wrap; pound to 1/8-inch thickness.\nArrange the meat strips on the tray of a dehydrator and dry at your dehydrator's highest setting until done to your liking, at least 4 hours. Store in an airtight container or resealable bags.\n",
        "picture_link": "C6PKYbTDWu.e.ZSFcErPyEV3.gmjXCu"
    },
    {
        "title": "Sausage Soup",
        "ingredients": [
            "1 pound Italian sausage ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "1 (28 ounce) can whole peeled tomatoes with juice ADVERTISEMENT",
            "6 cups chicken broth ADVERTISEMENT",
            "2 teaspoons dried basil ADVERTISEMENT",
            "2 cups bow tie pasta ADVERTISEMENT",
            "1/2 teaspoon garlic salt ADVERTISEMENT",
            "1 cup chopped celery ADVERTISEMENT",
            "1 cup chopped carrots ADVERTISEMENT",
            "1 1/2 cups shredded cabbage ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a soup pot, cook sausage over medium heat until no pink remains.\nAdd onions, celery, and carrots. Cook uncovered for 5 minutes, or until onions are soft.\nAdd tomatoes, chicken broth, cabbage, and basil. Bring to a boil. Stir in macaroni, and cover. Simmer for 10 minutes, or until pasta is tender. Season with garlic salt. Serve.\n",
        "picture_link": "Lj7NA3wfxy0snhszP71MzdW2CiDoyqi"
    },
    {
        "title": "Hoagie Dip",
        "ingredients": [
            "1/2 pound cooked ham, thinly sliced ADVERTISEMENT",
            "1/2 pound Genoa salami, thinly sliced ADVERTISEMENT",
            "1 pound processed American cheese, sliced ADVERTISEMENT",
            "2 cups mayonnaise ADVERTISEMENT",
            "2 teaspoons dried oregano ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1/2 head iceberg lettuce, shredded ADVERTISEMENT",
            "2 tomatoes, diced ADVERTISEMENT",
            "12 hoagie rolls, torn into pieces for dipping ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Tear the ham, salami and American cheese into small pieces. Place in a large bowl.\nIn a medium bowl, blend the mayonnaise and oregano. Mix the mayonnaise mixture into the ham mixture 1/2 cup at a time, until meats and cheese are well coated. Mix in the onion.\nBefore serving, mix in the lettuce and tomatoes. Serve with the hoagie roll pieces for dipping.\n",
        "picture_link": "pmZ2WgCeB3BAqLIlVvQLjza6bZTUZk."
    },
    {
        "title": "Veggie Burgers",
        "ingredients": [
            "2 teaspoons olive oil ADVERTISEMENT",
            "1 small onion, grated ADVERTISEMENT",
            "2 cloves crushed garlic ADVERTISEMENT",
            "2 carrots, shredded ADVERTISEMENT",
            "1 small summer squash, shredded ADVERTISEMENT",
            "1 small zucchini, shredded ADVERTISEMENT",
            "1 1/2 cups rolled oats ADVERTISEMENT",
            "1/4 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a skillet over low heat, and cook the onion and garlic for about 5 minutes, until tender. Mix in the carrots, squash, and zucchini. Continue to cook and stir for 2 minutes. Remove pan from heat, and mix in oats, cheese, and egg. Stir in soy sauce, transfer the mixture to a bowl, and refrigerate 1 hour.\nPreheat the grill for high heat.\nPlace the flour on a large plate. Form the vegetable mixture into eight 3 inch round patties. Drop each patty into the flour, lightly coating both sides.\nOil the grill grate, and grill patties 5 minutes on each side, or until heated through and nicely browned.\n",
        "picture_link": "WomXSoG77ipve3ZGi90LC45dsyci77i"
    },
    {
        "title": "Sourdough Bread I",
        "ingredients": [
            "1 cup sourdough starter ADVERTISEMENT",
            "1 1/2 cups warm water ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup corn oil ADVERTISEMENT",
            "6 cups bread flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix sugar, corn oil, salt, water, and 1 cup of sourdough starter together in a large bowl. Sift the flour and add to the mixture. Grease or oil the dough. Place the dough in an oiled bowl, cover, and let rise overnight.\nThe next day, knead the dough for 10 minutes. Divide in half, and place into two greased 4 x 8 inch bread pans. Allow the dough to double in size.\nBake at 350 degrees F (175 degrees C) for 40 to 45 minutes, or until bread is golden brown and taps hollow. Turn out to cool on wire racks.\n",
        "picture_link": "IHpVbSw0bDbgKi15ueTZcSx1dhGuKk2"
    },
    {
        "title": "Fruit Cobbler",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "4 cups fresh peaches, pitted and sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter or margarine in a 9 x 13 inch pan. Set aside to cool.\nStir together flour, sugar, salt, and baking powder. Mix in milk and vanilla. Pour batter over melted butter. DO NOT MIX OR STIR. Spoon fruit with juice over the batter. DO NOT MIX OR STIR.\nBake at 350 degrees F (175 degrees C) for 55 minutes.\n",
        "picture_link": "WFFYN1CBMWc0T6nlkHcCTTQ1DxYOsBu"
    },
    {
        "title": "Classy Green Bean Casserole",
        "ingredients": [
            "3 (14.5 ounce) cans French cut green beans, drained ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1/2 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 cup coarsely crushed buttery round crackers ADVERTISEMENT",
            "1 tablespoon butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nIn a medium bowl, mix together the green beans, sour cream, condensed soup, salt and pepper. Spoon into a 2 quart casserole dish. Stir melted butter into the crushed crackers, then sprinkle over the top of the casserole.\nBake for 30 minutes in the preheated oven, until lightly browned and bubbly.\n",
        "picture_link": "7QCreVkONf/d4zb599080DGnahZIOzq"
    },
    {
        "title": "Best Peanut Sauce",
        "ingredients": [
            "1/2 cup crunchy peanut butter ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "2 drops hot pepper sauce ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, stir together peanut butter, soy sauce, sugar, hot pepper sauce and garlic until well mixed. Gradually stir in water until texture is smooth and creamy.\n",
        "picture_link": "ojs0ZkuxcQFAqbJS7Sm8z82ounw2mGe"
    },
    {
        "title": "Rosemary-Scented Pork Loin Stuffed With Roasted Garlic, Dried Apricots and Cranberries and Port Wine Pan Sauce",
        "ingredients": [
            "3 tablespoons olive oil ADVERTISEMENT",
            "16 whole peeled garlic cloves ADVERTISEMENT",
            "2 tablespoons minced garlic cloves ADVERTISEMENT",
            "1 (8 pound) whole boneless pork loin, patted dry, at room temperature ADVERTISEMENT",
            "Salt and freshly ground pepper ADVERTISEMENT",
            "3 tablespoons minced fresh rosemary (snip with scissors), divided ADVERTISEMENT",
            "16 dried apricots (or similar amount of your favorite dried fruit) ADVERTISEMENT",
            "1/3 cup dried cranberries ADVERTISEMENT",
            "Heavy kitchen string or twine ADVERTISEMENT",
            "1/4 cup apple jelly ADVERTISEMENT",
            "1/4 cup port ADVERTISEMENT",
            "1/2 cup chicken broth ADVERTISEMENT",
            "2 tablespoons apple jelly ADVERTISEMENT",
            "2 teaspoons cornstarch ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Adjust oven rack to upper-middle position and heat oven to 250 degrees. Heat oil in a small skillet over medium-low heat. Add whole garlic cloves and cook, stirring occasionally, until soft and golden, about 5 minutes. Remove with a slotted spoon; reserve oil.\nTurn pork loin fat-side down. Slit lengthwise, almost but not quite all the way through, to form a long pocket, leaving a 1/2-inch border of unslit meat at each end. Brush cavity with some of the reserved garlic cooking oil, and sprinkle generously with salt and pepper and 1 Tb. of the rosemary. Line cavity with sauteed garlic and apricots; sprinkle in cranberries. Tie loin together with kitchen twine or heavy-duty string at 1 1/2-inch intervals.\nBrush with remaining oil, and sprinkle generously with salt and pepper. Set roast, fat-side up, diagonally or curved (so it fits) on a large, lipped cookie sheet or jellyroll pan. Warm 1/4 cup apple jelly along with the minced garlic and remaining rosemary. Brush mixture onto meat.\nRoast until a meat thermometer stuck into the center registers 125 to 130 degrees. (Start checking at about 1 1/2 hours.) Remove from oven; raise oven temperature to 400 degrees. Brush loin with pan drippings, return to oven, and continue to roast until the loin is golden brown and a meat thermometer stuck into the center registers 145 degrees F (63 degrees C), about 20 minutes longer. For even more attractive coloring, broil until spotty brown, 3 to 5 minutes.\nLet roast rest 15 to 20 minutes; transfer to a carving board. Stir juices around pan to loosen brown bits. Pour through a strainer into a small pan, and stir in port, chicken broth and remaining 2 Tbs. of jelly; bring to a simmer. Mix cornstarch with a couple of tablespoons of cold water; whisk into sauce. Simmer until lightly thickened. Slice pork and serve with a little sauce.\n",
        "picture_link": "EEOGU3db3nCy70xhGCeoAhjnLo7yK76"
    },
    {
        "title": "Angel Food Cake I",
        "ingredients": [
            "1 1/4 cups cake flour ADVERTISEMENT",
            "1 3/4 cups white sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups egg whites ADVERTISEMENT",
            "1 teaspoon cream of tartar ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon almond extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat egg whites until they form stiff peaks, and then add cream of tartar, vanilla extract, and almond extract.\nSift together flour, sugar, and salt. Repeat five times.\nGently combine the egg whites with the dry ingredients, and then pour into an ungreased 10 inch tube pan.\nPlace cake pan in a cold oven. Turn the oven on; set it to 325 degrees F (165 degrees C). Cook for about one hour, or until cake is golden brown.\nInvert cake, and allow it to cool in the pan. When thoroughly cooled, remove from pan.\n",
        "picture_link": "JS543V1K3S.tvdQmqeosViOPCG8OchK"
    },
    {
        "title": "Better Than Sex Cake I",
        "ingredients": [
            "1 (18.25 ounce) package German chocolate cake mix ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "2 cups hot fudge topping ADVERTISEMENT",
            "1 (12 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "4 (1.4 ounce) bars chocolate covered English toffee ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bake German chocolate cake mix according to package directions.\nWhile cake is still very warm poke holes in top of cake with the end of a wooden spoon, poor sweetened condensed milk over top. Let cake cool. Pour hot fudge topping over top of cake and let set. Spread on whipped topping and garnish with crushed Heath (TM) Bars (toffee crumbles).\n",
        "picture_link": "80GkC/TsclynRXHMwuhXYdXiMVqeBrK"
    },
    {
        "title": "Winter Vegetable Hash",
        "ingredients": [
            "3 tablespoons olive oil ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 pound Yukon Gold potatoes, diced ADVERTISEMENT",
            "1/2 pound fresh shiitake mushrooms, diced ADVERTISEMENT",
            "1 red bell pepper, diced ADVERTISEMENT",
            "1 small acorn squash, diced ADVERTISEMENT",
            "1 shallot, finely chopped ADVERTISEMENT",
            "2 teaspoons garlic powder ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "1 cup chopped kale ADVERTISEMENT",
            "4 sprigs fresh sage ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place oil and butter in a large skillet over medium heat. Melt butter and mix in potatoes, mushrooms, pepper, squash, and shallot. Season with garlic powder, salt, and pepper. Cook 25 minutes, stirring occasionally, until potatoes are tender.\nMix kale and sage into skillet. Continue cooking 5 minutes, until kale is wilted. Serve and enjoy!\n",
        "picture_link": "DSpyQoz9x7pXdPVQNiAXM8y2bXHVK7u"
    },
    {
        "title": "Beer Cheese Soup II",
        "ingredients": [
            "1 tablespoon margarine ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1/2 teaspoon minced garlic ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1 (12 fluid ounce) can or bottle light beer ADVERTISEMENT",
            "1 (14.5 ounce) can chicken broth ADVERTISEMENT",
            "3 tablespoons cornstarch ADVERTISEMENT",
            "2 cups half-and-half ADVERTISEMENT",
            "2 cups shredded sharp Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter or margarine in a 4 1/2 quart soup pot over medium heat. Add the onion, garlic and Worcestershire sauce and stir well. Add the beer and raise the heat to high and boil for 3 minutes to evaporate the alcohol. Add the chicken broth and bring the soup back to a boil. Lower the heat to medium-low and simmer.\nCombine the cornstarch with 3 tablespoons water and stir until smooth. Set aside.\nAdd the half-and-half and shredded cheese to the soup. Stir constantly until the cheese melts. Then stir in the cornstarch mixture. Stir constantly until the soup is thick, about 2 minutes. Serve garnished with bacon bits.\n",
        "picture_link": "2AlQcggCPIKpWxr5Zbjn.5RnYgEt8Ly"
    },
    {
        "title": "Deviled Eggs",
        "ingredients": [
            "8 eggs ADVERTISEMENT",
            "1/2 teaspoon prepared mustard ADVERTISEMENT",
            "1 tablespoon creamy salad dressing (such as Miracle Whip®), or as needed ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 pinch paprika ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place eggs in saucepan and cover with water. Bring to boil. Cover, remove from heat, and let eggs sit in hot water for 10 to 12 minutes. Remove from hot water and cool in ice water.\nPeel and cut in half lengthwise. Remove yolks and combine with mustard, salad dressing and salt and pepper. Mix together until smooth.\nRefill each egg half with the yolk mixture and sprinkle with paprika.\n",
        "picture_link": "G3Br83LtphDYuMp3w3VoKX2MJubHbtW"
    },
    {
        "title": "Baked Rice Pudding",
        "ingredients": [
            "1 cup uncooked white rice ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/3 cup raisins ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place uncooked rice in a 3 quart saucepan, and add water. Bring to a boil. Reduce heat, and simmer for 25 to 30 minutes.\nPreheat oven to 325 degrees F (165 degrees C).\nIn a large bowl, combine beaten eggs, milk, sugar, vanilla extract, and salt. Mix well. Stir in rice and raisins. Pour into a 10x6x2 inch baking dish.\nBake uncovered for 30 minutes; stir pudding and sprinkle with nutmeg. Bake additional 30 minutes or until a knife inserted halfway between the edge and the center comes out clean.\n",
        "picture_link": "c0RCxDBtkrB2ttcna9UjirICdrWmrGi"
    },
    {
        "title": "Banana Nut Bread III",
        "ingredients": [
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup mashed bananas ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour two 8x4 inch loaf pans. Set aside.\nSift together flour, baking powder, baking soda, salt, and sugar. Stir in nuts, eggs, bananas, oil, and vanilla extract.\nPour into prepared pans. Bake for 45 to 60 minutes. Cool on wire rack for 10 minutes before removing from pans.\n",
        "picture_link": "YWi7npqlnr5kYT5t7GhX7OTMA7.IiWa"
    },
    {
        "title": "Teriyaki Marinated Chicken",
        "ingredients": [
            "1 (6 ounce) can pineapple juice ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "3 tablespoons brown sugar ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, mix the pineapple juice, vegetable oil, soy sauce, brown sugar, garlic powder, and pepper. Place chicken in the bowl, and coat with the mixture. Cover, and marinate in the refrigerator at least 2 hours.\nPreheat the oven broiler.\nPlace chicken on a baking sheet. Broil 5 minutes on each side in the preheated oven, or until no longer pink and juices run clear. Discard remaining marinade.\n",
        "picture_link": "i8GBuGVi.0zBtZwKa8I3A644Bm9gmni"
    },
    {
        "title": "German Chocolate Cake Frosting",
        "ingredients": [
            "1 cup evaporated milk ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "3 egg yolks ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "1 1/3 cups flaked coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan combine evaporated milk, brown sugar, egg yolks, butter and vanilla. Cook over low heat, stirring constantly, until thick. Remove from heat and stir in pecans and coconut. Let cool to room temperature before spreading on cake.\n",
        "picture_link": "QYaoYQOmUXTS3esQ6oM9bxk8r2xKhdG"
    },
    {
        "title": "Fruit Pizza",
        "ingredients": [
            "1 (18 ounce) package refrigerated sugar cookie dough ADVERTISEMENT",
            "1 (7 ounce) jar marshmallow creme ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nOn an ungreased medium baking sheet, smooth the refrigerated sugar cookie dough into a single layer approximately 1/4 inch thick. Bake in the preheated oven 10 minutes, or until edges are lightly browned and center is no longer doughy.\nIn a medium bowl, blend the marshmallow creme and cream cheese. Spread the mixture over the baked crust. Chill in the refrigerator until serving.\n",
        "picture_link": "TvjUNt8LP3ufoP7CIKADp6uQKO2sxWu"
    },
    {
        "title": "Best Formula Three-Cheese Fondue",
        "ingredients": [
            "1 cup white wine ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "7 ounces Gruyere cheese, cubed ADVERTISEMENT",
            "7 ounces sharp Cheddar cheese, cubed ADVERTISEMENT",
            "7 ounces Emmentaler cheese, cubed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring the wine to a boil in a small saucepan.\nMeanwhile, melt the butter in a medium saucepan over medium low heat. Whisk in the flour, and cook for about 5 minutes, stirring constantly to avoid sticking and burning.\nOnce the flour is cooked, stir the wine into the flour mixture slowly. Use a whisk to smooth the mixture. Slowly add cubes of Gruyere, Cheddar, and Emmentaler cheese; stir until cheese is melted. Transfer cheese mixture to fondue pot. Keep warm over low flame.\n",
        "picture_link": "GDWa/kpBCHhHr1S.aasVjWbS1WPDC8S"
    },
    {
        "title": "Grilled Chicken Burgers",
        "ingredients": [
            "1 onion, chopped ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "1 cup fresh sliced mushrooms ADVERTISEMENT",
            "1 tomato, seeded and chopped ADVERTISEMENT",
            "2 carrots, chopped ADVERTISEMENT",
            "2 pounds ground chicken ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup fresh bread crumbs ADVERTISEMENT",
            "1 tablespoon Old Bay ™ Seasoning ADVERTISEMENT",
            "kosher salt to taste ADVERTISEMENT",
            "black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium heat and lightly oil grate.\nLightly spray a saute pan with cooking or oil spray over medium heat. Saute the onion with the garlic first, then the bell pepper, then the mushrooms, tomatoes and carrots, all to desired tenderness. Set aside and allow all vegetables to cool completely.\nIn a large bowl, combine the chicken and vegetables. Add the egg, bread crumbs and seasonings to taste. Mix all together well and form into 8 patties.\nGrill over medium heat for 5 to 6 minutes per side, or to desired doneness.\n",
        "picture_link": "Z8zedM6yoC5yzhqOFuEUAh5p/wn1r36"
    },
    {
        "title": "Chocolate Cream Pudding",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "2 (1 ounce) squares unsweetened chocolate, chopped ADVERTISEMENT",
            "2 egg yolks ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan over medium heat, combine sugar, cornstarch and salt. Stir in milk and chocolate. Cook, stirring constantly, until chocolate melts and mixture thickens. Remove from heat and stir in egg yolks. Return to heat and cook 2 minutes more. Remove from heat and stir in butter and vanilla. Chill before serving.\n",
        "picture_link": "Z6Egc.2FO.GStEz.ZiusIQEt4vTKAau"
    },
    {
        "title": "Absolutely Perfect Palak Paneer",
        "ingredients": [
            "6 tablespoons olive oil ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "1 tablespoon grated fresh ginger root ADVERTISEMENT",
            "2 dried red chile peppers ADVERTISEMENT",
            "1/2 cup finely chopped onion ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "1 teaspoon ground coriander ADVERTISEMENT",
            "1 teaspoon ground turmeric ADVERTISEMENT",
            "3/4 cup sour cream ADVERTISEMENT",
            "3 pounds fresh spinach, torn ADVERTISEMENT",
            "1 large tomato, quartered ADVERTISEMENT",
            "4 sprigs fresh cilantro leaves ADVERTISEMENT",
            "8 ounces ricotta cheese ADVERTISEMENT",
            "coarse sea salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan heat 3 tablespoons of olive oil and saute garlic, 1/2 tablespoon of ginger, red chilies (optional ingredient) and onion until brown. Mix in the cumin, coriander, turmeric and sour cream (add more or less to achieve desired creaminess). Add the spinach, handfuls at a time until it is cooked down, about 15 minutes total. Remove from heat and allow to cool slightly.\nPour spinach mixture into a blender or food processor and add the tomato, the remaining 1/2 tablespoon of ginger, and cilantro (add more or less according to taste). Blend for 15 to 30 seconds, or until the spinach is finely chopped. Pour back into the saucepan and keep warm over low heat.\nIn a medium frying pan heat 3 tablespoons of olive oil over medium heat, and fry cheese until browned; drain and add to spinach. Cook for 10 minutes on low heat. Season with salt to taste.\n",
        "picture_link": "xdZAnrMKr3H9YDy9VvXmy6K2hkS5QA6"
    },
    {
        "title": "Fasoliyyeh Bi Z-Zayt (Syrian Green Beans with Olive Oil)",
        "ingredients": [
            "1 (16 ounce) package frozen cut green beans ADVERTISEMENT",
            "1/4 cup extra virgin olive oil ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the green beans into a large pot, and drizzle with olive oil. Season with salt to taste, and put the lid on the pot. Cook over medium-high heat, stirring occasionally, until beans are cooked to your desired doneness. Syrians like it cooked until the green beans are turning brownish in color. The idea is not to saute them, but to let them steam in the moisture released by the ice crystals.\nAdd cilantro and garlic to the beans, and continue to cook just until the cilantro has started to wilt. Eat as a main course by scooping up with warm pita bread or serve as a side dish.\n",
        "picture_link": "gZutGfpFPv/OvkmE4cQWaIc2948yENm"
    },
    {
        "title": "Cheesy Potato Soup II",
        "ingredients": [
            "6 tablespoons unsalted butter ADVERTISEMENT",
            "1 1/2 cups chopped onions ADVERTISEMENT",
            "1 1/2 cups chopped celery ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "8 potatoes, peeled and cubed ADVERTISEMENT",
            "15 slices American cheese - broken into pieces ADVERTISEMENT",
            "4 tablespoons all-purpose flour ADVERTISEMENT",
            "2 1/3 cups milk ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a large pot over medium heat. Saute the onions and celery in the butter for 5 to 10 minutes, or until tender.\nStir in the water and potatoes, bring to a boil and then simmer until the potatoes are tender. Add the cheese and stir until melted.\nIn a separate small bowl, combine the flour and the milk and stir well until the flour is mostly dissolved. Pour this into the soup slowly, stirring constantly, until soup has thickened, about 5 minutes. Garnish with the parsley.\n",
        "picture_link": "PJrBRUGAtlQuXy1399jLgM4CwuBBb7W"
    },
    {
        "title": "Indian Dahl with Spinach",
        "ingredients": [
            "1 1/2 cups red lentils ADVERTISEMENT",
            "3 1/2 cups water ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "1/2 teaspoon chili powder ADVERTISEMENT",
            "1 pound spinach, rinsed and chopped ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon mustard seed ADVERTISEMENT",
            "1 teaspoon garam masala ADVERTISEMENT",
            "1/2 cup coconut milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse lentils and soak for 20 minutes.\nIn a large saucepan, bring water to a boil and stir in salt, lentils, turmeric and chili powder. Cover and return to a boil, then reduce heat to low and simmer for 15 minutes. Stir in the spinach and cook 5 minutes, or until lentils are soft. Add more water if necessary.\nIn a small saucepan over medium heat, melt butter and saute onions with cumin and mustard seeds, stirring often. Cook until onions are transparent, and then combine with lentils. Stir in garam masala and coconut milk and cook until heated through.\n",
        "picture_link": "kgQVcBmX16Z.JL1jBJQ9QYmpUtPLh2G"
    },
    {
        "title": "Carrot Cake XI",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 1/3 cups vegetable oil ADVERTISEMENT",
            "4 cups grated carrots ADVERTISEMENT",
            "3/4 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan. Sift together the flour, baking powder, baking soda, salt and cinnamon. Set aside.\nIn a large bowl, mix together the sugar and eggs until thick and pale. Stir in the oil, then gradually mix in the sifted dry ingredients. Fold in the carrots and nuts. Spread evenly into the prepared pan.\nBake for 40 to 45 minutes in the preheated oven, or until a toothpick inserted into the cake comes out clean. When cool, frost with your favorite Cream Cheese Frosting.\n",
        "picture_link": "P2jD92v/wEBSARYZieah9HINRb0p9NW"
    },
    {
        "title": "Tiramisu Toffee Dessert",
        "ingredients": [
            "1 (10.75 ounce) package frozen prepared pound cake, thawed and cut into 9 slices ADVERTISEMENT",
            "3/4 cup strong brewed coffee ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup chocolate syrup ADVERTISEMENT",
            "2 cups heavy whipping cream ADVERTISEMENT",
            "2 (1.4 ounce) bars chocolate covered English toffee, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Arrange cake slices on bottom of a rectangular 11x7 inch baking dish, cutting cake slices if necessary to fit the bottom of the dish. Drizzle coffee over cake.\nBeat cream cheese, sugar, and chocolate syrup, in a large bowl with an electric mixer on medium speed until smooth. Add heavy cream; beat on medium speed until light and fluffy. Spread over cake. Sprinkle with chocolate-covered toffee candy.\nCover and refrigerate for at least 1 hour, but no longer than 24 hours, to set dessert and blend flavors.\n",
        "picture_link": ".esVtG3/bk/Pzi3DH//VASKehdTY2LW"
    },
    {
        "title": "Game Day Bites",
        "ingredients": [
            "1 pound ground beef chuck ADVERTISEMENT",
            "1 (8 ounce) package shredded Cheddar cheese ADVERTISEMENT",
            "1 tablespoon mayonnaise ADVERTISEMENT",
            "1 (1 ounce) package dry onion soup mix ADVERTISEMENT",
            "24 (2 inch square) dinner rolls, split ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl, thoroughly mix ground beef chuck, Cheddar cheese, mayonnaise and dry onion soup mix.\nSpread even amounts of the ground beef onto the bottom half of each roll. Place top halves on, forming little sandwiches. If you purchased the rolls in aluminum foil pans, you may return them to the same pan for baking. Otherwise, place them on a baking sheet or baking pan. Cover the pan tightly with aluminum foil.\nBake for 30 to 35 minutes in the preheated oven, or until meat is cooked through.\n",
        "picture_link": "CnfxyKBVl7gv0MmjI.3vJWJaOb0kU0O"
    },
    {
        "title": "Polish Cabbage Noodles",
        "ingredients": [
            "1 medium head shredded cabbage ADVERTISEMENT",
            "2 red onions, cut into strips ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 (16 ounce) package wide egg noodles ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook pasta in a large pot of boiling salted water.\nMeanwhile, heat butter or margarine in a skillet over medium heat. Saute cabbage and onions until tender.\nDrain pasta, and return to the pot. Add cabbage and onion mixture to the noodles, and toss. Season with salt and pepper to taste.\n",
        "picture_link": "V5iyUuJb4WJbr82Anq.gBheHkUhjA7q"
    },
    {
        "title": "Easy Italian Chicken II",
        "ingredients": [
            "6 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 (16 ounce) bottle Italian-style salad dressing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To Marinate: Pour salad dressing into a large, resealable plastic bag. Add chicken breasts, seal bag and shake to coat. Place in refrigerator for at least 1 hour or overnight (the longer you marinate, the more taste the chicken will absorb).\nPreheat oven to 350 degrees F (175 degrees C).\nRemove chicken from bag, discarding remaining marinade. Place chicken in a lightly greased 9x13 inch baking dish and bake at 350 degrees F (175 degrees C) for 1 hour, or until chicken is cooked through and juices run clear. Note: Turn chicken occasionally while baking.\n",
        "picture_link": "rNrikvrNHJT2u.1h6wXVL9YAQNdVTtC"
    },
    {
        "title": "Tomato and Garlic Pasta",
        "ingredients": [
            "1 (8 ounce) package angel hair pasta ADVERTISEMENT",
            "2 pounds tomatoes ADVERTISEMENT",
            "4 cloves crushed garlic ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon chopped fresh basil ADVERTISEMENT",
            "1 tablespoon tomato paste ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place tomatoes in a kettle, and cover with cold water. Bring just to the boil. Pour off water, and cover again with cold water. Peel. Cut into small pieces.\nCook the pasta in a large pot of boiling salted water until al dente.\nIn a large skillet or saute pan, saute the garlic in enough olive oil to cover the bottom of the pan. The garlic should just become opaque, not brown. Stir in the tomato paste. Immediately stir in the tomatoes, and salt and pepper. Reduce heat, and simmer until the pasta is ready; add the basil.\nDrain the pasta, but do not rinse in cold water. Toss with a couple of tablespoons of olive oil, and then mix into the sauce. Reduce the heat as low as possible. Keep warm, uncovered, for about 10 minutes when it is ready to serve. Garnish generously with fresh Parmesan cheese.\nVARIATIONS: Saute fresh quartered mushrooms with the garlic, or add shoestring zucchini along with the tomato.\n",
        "picture_link": "IMurnrUsEWcCm5hVUYLzSDV3m/MOR5u"
    },
    {
        "title": "Pan Seared Red Snapper",
        "ingredients": [
            "2 (4 ounce) fillets red snapper ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "2 tablespoons rice wine vinegar ADVERTISEMENT",
            "1 teaspoon Dijon mustard ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1/4 cup chopped green onions ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse snapper under cold water, and pat dry. In a shallow bowl, mix together olive oil, lemon juice, rice vinegar, mustard, honey, green onions, and ginger.\nHeat a non-stick skillet over medium heat. Dip snapper fillets in marinade to coat both sides, and place in skillet. Cook for 2 to 3 minutes on each side. Pour remaining marinade into skillet. Reduce heat, and simmer for 2 to 3 minutes, or until fish flakes easily with a fork.\n",
        "picture_link": "NXGIWtDwB6SBYZakcCakXulUfsN3o5O"
    },
    {
        "title": "Dinah's Baked Scallops",
        "ingredients": [
            "20 buttery round crackers, crushed ADVERTISEMENT",
            "black pepper to taste ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 pound sea scallops, rinsed and drained ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1/4 cup dry white wine ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease an 8x8 inch baking dish.\nCombine crushed crackers, black pepper and garlic powder in a small bowl. Press scallops into mixture so that they are evenly coated, and place them in the greased baking dish.\nIn a separate bowl, mix together melted butter, wine and lemon juice; drizzle mixture over scallops.\nBake in preheated oven until scallops are lightly browned, about 15 minutes. Garnish with chopped parsley.\n",
        "picture_link": "2TlvzGqYuJJlgB4hjzUxDm4o3JKeGsW"
    },
    {
        "title": "Classic Lasagna",
        "ingredients": [
            "9 lasagna noodles ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 pound bulk Italian sausage ADVERTISEMENT",
            "1 (16 ounce) can sliced mushrooms, drained ADVERTISEMENT",
            "1 teaspoon garlic salt ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "1/4 teaspoon dried basil ADVERTISEMENT",
            "4 (15 ounce) cans tomato sauce ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 (15 ounce) container ricotta cheese ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "1/3 cup grated Parmesan cheese ADVERTISEMENT",
            "1 pound shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of lightly salted water to a boil. Add the lasagna noodles and olive oil; cook until al dente, 8 to 10 minutes; drain.\nCook the ground beef and sausage in a large pot over medium heat; drain. Stir in the mushrooms, garlic salt, oregano, thyme, basil, and tomato sauce. Season with salt and pepper; simmer 30 minutes.\nMeanwhile, mix together the ricotta cheese, eggs, and Parmesan cheese in a bowl.\nLadle enough of the meat sauce into a 9x13 inch baking dish to cover the bottom in a thin layer. Form a layer atop the sauce with 3 of the lasagna noodles. Spread about 1/4 of the ricotta cheese mixture over the noodles. Sprinkle about 1/3 of the mozzarella cheese over the ricotta cheese mixture and then ladle about 1/3 of the meat sauce over the mozzarella cheese. Repeat layering twice more, topping with the remaining 1/4 pound of mozzarella cheese.\nBake in preheated oven 90 minutes. Allow to sit 10 to 15 minutes before serving.\n",
        "picture_link": "hfYZzaLaUaySJcXq4E5GlmvWcv50YIi"
    },
    {
        "title": "Jean's Homemade Chicken Noodle Soup",
        "ingredients": [
            "2 (14 ounce) cans chicken broth ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "3 carrots, chopped ADVERTISEMENT",
            "3 stalks celery, chopped ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "3 slices fresh ginger root ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1/2 cup chopped cooked chicken breast meat ADVERTISEMENT",
            "1/2 cup egg noodles ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot over medium heat combine the broth, water, carrots, celery and ground black pepper and allow to cook. In a medium skillet over medium high heat, combine the ginger, oil and chicken. Saute for about 5 minutes and remove the sliced ginger.\nAdd the chicken to the broth mixture, bring to a boil and then add the egg noodles. Continue to cook over medium heat for about 15 minutes until noodles and vegetables are tender.\n",
        "picture_link": "A/2B6z1g3ROwEN49aTwRBrh2010s2HC"
    },
    {
        "title": "Quick Pickled Jalapeno Rings",
        "ingredients": [
            "3/4 cup water ADVERTISEMENT",
            "3/4 cup distilled white vinegar ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "1 tablespoon kosher salt ADVERTISEMENT",
            "1 clove garlic, crushed ADVERTISEMENT",
            "1/2 teaspoon oregano ADVERTISEMENT",
            "10 large jalapeno peppers, sliced into rings ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water, vinegar, sugar, kosher salt, garlic, and oregano in a saucepan over high heat. Bring mixture to a boil, stir in jalapeno peppers and remove from heat. Let mixture cool for 10 minutes.\nPack peppers into jars using tongs, cover with vinegar mixture, cover, and refrigerate until needed.\n",
        "picture_link": "cp7R7ipNePi.MeEznq9cjAxhpl5Ul3S"
    },
    {
        "title": "Corned Beef Hash",
        "ingredients": [
            "6 large potatoes, peeled and diced ADVERTISEMENT",
            "1 (12 ounce) can corned beef, cut into chunks ADVERTISEMENT",
            "1 medium onion, chopped ADVERTISEMENT",
            "1 cup beef broth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large deep skillet, over medium heat, combine the potatoes, corned beef, onion, and beef broth. Cover and simmer until potatoes are of mashing consistency, and the liquid is almost gone. Mix well, and serve.\n",
        "picture_link": ".xHIw1j10g8AIOEA3aEciQksSdNOv.G"
    },
    {
        "title": "Creamed Spinach II",
        "ingredients": [
            "2 (10 ounce) packages frozen chopped spinach ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "garlic salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare spinach according to package directions; drain well.\nIn a large saucepan over medium-high heat, combine spinach, mushroom soup and butter. Bring to a low boil. Season with garlic salt to taste.\n",
        "picture_link": "TCTm.3Hhh0NJQ5hcVbHDw3pFBuv7eC6"
    },
    {
        "title": "Bottom Round Roast with Onion Gravy",
        "ingredients": [
            "6 onions, sliced ADVERTISEMENT",
            "1 (4 pound) bottom round roast ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1 tablespoon white vinegar ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place sliced onions in the bottom of a Dutch oven or stock pot. Season the roast with salt and pepper, and place on top of the onions. Add the vinegar and bay leaf to the pan, and heat over high heat to get it simmering. Reduce heat to low, cover, and simmer for 3 to 4 hours. Try not to take the lid off while cooking.\nWhen the roast is done, remove it from the pan to a serving platter. Mix the flour into the water, and pour into the drippings from the roast. Simmer over medium heat, stirring frequently until thickened. Carve roast, and serve with the pan gravy.\n",
        "picture_link": "VtR4wRSeF2ZU.AckHf0jCoCnRPw5WMO"
    },
    {
        "title": "Broccoli Casserole III",
        "ingredients": [
            "2 (10 ounce) packages frozen chopped broccoli ADVERTISEMENT",
            "8 ounces processed cheese food, shredded ADVERTISEMENT",
            "1/4 pound butter ADVERTISEMENT",
            "32 buttery round crackers, crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace broccoli in casserole dish and cover with cheese.\nIn a large skillet over medium heat, melt the butter; add the cracker crumbs and stir until evenly coated. Sprinkle over cheese.\nBake for 30 minutes.\n",
        "picture_link": "ZFR040Ac3kYAjVfEIW/OtpDTtNz2JeO"
    },
    {
        "title": "Tender Breaded Turkey Cutlets",
        "ingredients": [
            "1 cup Italian seasoned dry bread crumbs ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "4 turkey breast cutlets, 1/4 inch thick ADVERTISEMENT",
            "1/2 cup fat free sour cream ADVERTISEMENT",
            "1 tablespoon extra virgin olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the bread crumbs and cheese in a shallow dish. Spread both sides of turkey with sour cream and press into the bread crumb mixture to coat.\nHeat the oil in a skillet over medium heat. Place turkey in the skillet and cook 5 to 7 minutes on each side, until lightly browned and cooked through.\n",
        "picture_link": "EIKGLVRnh3sQ7MSx3.KveGFZIXE6K1W"
    },
    {
        "title": "Extra-Yummy Fluffy Pancakes",
        "ingredients": [
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 tablespoons white sugar ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1 1/3 cups milk ADVERTISEMENT",
            "1 egg, lightly beaten ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "3/4 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon vegetable oil, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together flour, sugar, baking powder, cinnamon, and salt in a bowl. Whisk in the milk, egg, 3 tablespoons vegetable oil, and vanilla extract until only a few lumps remain. Let the batter stand for 5 full minutes for extra fluffiness.\nHeat a skillet or griddle over medium heat, and brush with 1 teaspoon vegetable oil. When the oil shimmers, slowly pour about 1/4 cup of batter into the hot pan. Cook until bottom is browned, about 2 minutes, then flip and cook until the center of the pancake is set and the other side is browned, about 2 more minutes. Keep warm until serving.\n",
        "picture_link": "b.ZHeyB9VzBcOhK3oowwhbnwGL7ihcO"
    },
    {
        "title": "Quick Hoppin' John Soup",
        "ingredients": [
            "1 pound sage pork sausage ADVERTISEMENT",
            "1 (6 ounce) package uncooked long grain and wild rice mix, with seasoning packet ADVERTISEMENT",
            "2 (15 ounce) cans black-eyed peas, drained ADVERTISEMENT",
            "2 (14.5 ounce) cans diced tomatoes, with liquid ADVERTISEMENT",
            "2 (14 ounce) cans chicken broth ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Crumble sausage into a skillet over medium heat and cook until evenly brown.\nIn a large pot, mix the cooked sausage, rice mix with seasoning packet, black-eyed peas, tomatoes, broth and water. Bring to a boil. Reduce heat to low, cover and simmer 20 minutes, or until rice is tender. Season to taste with salt.\n",
        "picture_link": "KEOoyG3UJHIg3SbqmbuH5Zmi1OlDdZO"
    },
    {
        "title": "Artichoke Stuffed Mushrooms",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "24 mushrooms, stems removed and chopped ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 (12 ounce) jar marinated artichoke hearts, drained and chopped ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "2 tablespoons sour cream ADVERTISEMENT",
            "1 cup shredded Italian cheese blend ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "1/2 teaspoon garlic salt, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Prepare a baking sheet with cooking spray.\nHeat the olive oil in a skillet over medium heat; cook the onions and mushroom stems in the hot oil until the onion is translucent, about 5 minutes; season with salt and pepper. Transfer the mixture to a large bowl; add the artichoke hearts, cream cheese, sour cream, Italian cheese blend, and Parmesan cheese. Season with salt, pepper, and garlic salt. Stir the mixture until ingredients are evenly distributed. Stuff the mushroom caps with the mixture. Arrange the stuffed mushrooms on the prepared baking sheet.\nBake in the preheated oven until the filling begins to bubble, about 20 minutes.\n",
        "picture_link": "7176leG71ox5atXOsNPxUip3aOCoRoW"
    },
    {
        "title": "A Firefighter's Meatloaf",
        "ingredients": [
            "2 slices whole wheat bread ADVERTISEMENT",
            "2 pounds ground beef ADVERTISEMENT",
            "1 green onion, chopped ADVERTISEMENT",
            "2 tablespoons chopped onion ADVERTISEMENT",
            "1 cup medium salsa ADVERTISEMENT",
            "2 tablespoons whole grain Dijon mustard ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 tablespoon barbeque sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C).\nSoak the bread in warm water in a small bowl. Place the beef in a large bowl. Drain bread and add to beef along with green onion, onion, salsa, Dijon mustard, Worcestershire sauce, garlic, salt and pepper. Mix by hand until well blended. Form into a loaf and place in a greased loaf pan.\nBake for 1 hour in the preheated oven. Drain off excess fat and top with barbeque (Diana) sauce. Return to the oven and bake for an additional 15 minutes.\n",
        "picture_link": "kPYwi9WuHkGBFMi03BjXhaNd5KAMe6K"
    },
    {
        "title": "Best Ever Split Pea",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 cups chopped onion ADVERTISEMENT",
            "2 cups chopped carrot ADVERTISEMENT",
            "2 cups finely chopped celery ADVERTISEMENT",
            "1/2 tablespoon minced garlic ADVERTISEMENT",
            "1 cup yellow split peas ADVERTISEMENT",
            "1 cup green split peas ADVERTISEMENT",
            "8 cups fat-free chicken broth ADVERTISEMENT",
            "1 1/2 teaspoons salt-free seasoning blend ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot or Dutch oven over medium heat, heat olive oil. Cook onion, carrot, celery and garlic until onion is translucent. Stir in yellow and green split peas, broth, seasoning and salt. Cover, bring to a boil, then reduce heat and simmer 2 1/2 hours, stirring frequently. Puree with a blender or food processor. Return to pot, heat through, and serve.\n",
        "picture_link": "IuYcwp5IaHnchb10vPWbrit76j2Fqz6"
    },
    {
        "title": "White Chocolate Orange Cookies",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 tablespoon orange zest ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "3/4 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 cups white chocolate chips ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCream the butter and sugars together until light and fluffy. Beat in the egg and orange zest. Stir the flour, baking soda, and salt together; mix into the creamed mixture. Stir in the white chocolate chips and chopped walnuts. Drop tablespoonfuls of dough onto ungreased baking sheets.\nBake for 10 to 12 minutes in the preheated oven. Allow to cool on the baking sheet for 2 minutes before transferring to a wire rack to cool completely.\n",
        "picture_link": "4YJ00a0Ny01shplZO.mbA2Yw/JLeSrW"
    }
]