[
    {
        "title": "Rhubarb Curry Chicken",
        "ingredients": [
            "4 cups chopped rhubarb ADVERTISEMENT",
            "1 large orange, peeled and chopped ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 teaspoons grated orange zest ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 tablespoon curry powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place rhubarb and orange in a blender; blend until pureed and transfer to a saucepan. Add sugar and orange zest.\nBring to a boil, then reduce heat to medium-low and simmer until marmalade is thickened, stirring occasionally, about 45 minutes. Allow marmalade to cool; ladle into jars. Cover jars with lids and refrigerate until ready to use.\nPreheat oven to 350 degrees F (175 degrees C). Arrange chicken breast halves in a baking dish.\nMix 1 cup marmalade, water, curry powder, and salt in a bowl; spoon mixture over chicken breasts.\nBake in preheated oven until chicken breasts are no longer pink in the center and the juices run clear, basting occasionally, about 45 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Serve rhubarb sauce over chicken breasts.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Alcoholic Sweet Peach Tea",
        "ingredients": [
            "ice cubes ADVERTISEMENT",
            "1 cup iced tea ADVERTISEMENT",
            "1 fluid ounce vodka ADVERTISEMENT",
            "1 fluid ounce peach schnapps ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a tall glass with ice. Pour iced tea, vodka, and peach schnapps over the ice.\n",
        "picture_link": "rly4JnLOijIphPGguegpJsc8CIVb8Hq"
    },
    {
        "title": "Cornish Hen with Tart Cherry Sauce",
        "ingredients": [
            "1 teaspoon sea salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon dried rosemary ADVERTISEMENT",
            "1/8 teaspoon paprika ADVERTISEMENT",
            "5 tablespoons unsalted butter, melted ADVERTISEMENT",
            "2 Cornish game hens ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "1 (15 ounce) can tart cherries, drained ADVERTISEMENT",
            "1 1/2 cups red wine ADVERTISEMENT",
            "1/4 cup pulp-free orange juice ADVERTISEMENT",
            "1 tablespoon packed brown sugar ADVERTISEMENT",
            "2 tablespoons unsalted butter ADVERTISEMENT",
            "1 tablespoon all-purpose flour, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine sea salt, black pepper, thyme, garlic powder, rosemary, and paprika in a bowl. Place hens on a baking sheet and evenly brush with 5 tablespoons butter. Rub hens with spice mixture.\nBake hens in preheated oven until no longer pink at the bone and the juices run clear, about 1 1/2 hours, basting every 1/2 hour with white wine. An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 180 degrees F (82 degrees C).\nMix cherries, red wine, orange juice, and brown sugar in a saucepan; bring to a boil for 2 to 3 minutes. Reduce heat to medium-low, stir in 2 tablespoons butter, and cook until sugar is dissolved and butter is melted, about 10 minutes. Sprinkle flour into the sauce; whisk until thickened, 2 to 3 minutes. Drizzle cherry sauce over cooked hens.\n",
        "picture_link": "7QuB.Wuj1CUaga.KmbqOXXD.jSt7dqq"
    },
    {
        "title": "Kentucky Wonder Beans",
        "ingredients": [
            "4 cups trimmed heirloom green beans (such as Kentucky Wonder Beans) ADVERTISEMENT",
            "1 slice bacon ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 teaspoon olive oil, or as needed ADVERTISEMENT",
            "1/2 teaspoon sea salt ADVERTISEMENT",
            "1 pinch coarsely ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour about 1 inch of water into a saucepan; add green beans, bacon, garlic, olive oil, sea salt, and pepper. Bring the water to a boil, reduce heat to medium, and place a cover on the saucepan. Cook beans until tender, 7 to 10 minutes.\n",
        "picture_link": "ujtWamy1.s6AlsIDVDEUf2CXDSkP7la"
    },
    {
        "title": "Cakey Cheesecake",
        "ingredients": [
            "1 1/2 cups graham cracker crumbs ADVERTISEMENT",
            "1/4 cup confectioners' sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/3 cup butter, melted ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/4 cup heavy cream ADVERTISEMENT",
            "2 (16 ounce) packages cottage cheese ADVERTISEMENT",
            "4 egg yolks ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "1 teaspoon grated lemon zest ADVERTISEMENT",
            "4 egg whites ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). In a medium bowl, combine graham cracker crumbs, confectioners' sugar and cinnamon. Reserve 1/2 cup of this mixture and set aside. Stir in butter to remaining crumb mixture. Mix well and press into the bottom and 1 inch up the side of a 9 inch springform pan. Chill in refrigerator.\nIn a large bowl, stir together sugar and heavy cream until sugar is dissolved. Beat in cottage cheese, egg yolks, flour, vanilla, lemon juice and lemon zest.\nIn a large glass or metal mixing bowl, beat egg whites and salt until stiff peaks form. Fold 1/3 of the whites into the batter, then quickly fold in remaining whites until no streaks remain. Pour batter into crust. Sprinkle top with reserved crumb mixture.\nBake in preheated oven for 1 hour, or until filling is just set. Turn the oven off, and let cake cool in oven, with the door closed, for 1 hour. Chill in refrigerator.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Tofu and Red Pepper Spread",
        "ingredients": [
            "1 (10 ounce) package silken tofu, drained ADVERTISEMENT",
            "1 small red bell pepper ADVERTISEMENT",
            "1/3 cup cashews ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "1 tablespoon prepared Dijon-style mustard ADVERTISEMENT",
            "1 teaspoon soy sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Using a blender or food processor, thoroughly mix silken tofu, red bell pepper, cashews, onion, prepared Dijon-style mustard and soy sauce. Blend until smooth and creamy. Chill in the refrigerator 1 hour, or until thickened. Use more cashews to make the mixture thicker, if desired.\n",
        "picture_link": "4sW32UPjZRs0PQop0fu/lTZMHbTAv0i"
    },
    {
        "title": "Breakfast Sausage Cake",
        "ingredients": [
            "1 cup raisins ADVERTISEMENT",
            "3 cups boiling water ADVERTISEMENT",
            "1 pound ground pork sausage ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 1/2 cups brown sugar ADVERTISEMENT",
            "2 eggs, lightly beaten ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon pumpkin pie spice ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 cup cold coffee ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Place raisins in a bowl and cover with boiling water; set aside for 5 to 10 minutes. Drain well and dry raisins in cloth, set aside.\nPlace sausage in a large, deep skillet. Cook over medium-high heat until lightly brown. Drain, crumble into small pieces and set aside.\nIn a large bowl, combine sausage, white sugar and brown sugar; stir until mixture is well blended. Add eggs and beat well.\nIn a separate bowl, sift together flour, ginger, baking powder and pumpkin pie spice. Stir baking soda into coffee. Add flour mixture and coffee alternately to meat mixture, beating well after each addition. Fold raisins and walnuts into cake batter. Turn batter into well-greased and floured Bundt cake pan.\nBake in preheated oven for 75 to 90 minutes until done. Cool 15 minutes in pan before turning out onto serving platter.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Old Fashioned German Cheesecake",
        "ingredients": [
            "2 cups graham cracker crumbs ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "3/4 cup butter, melted ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "7 cups small curd cottage cheese ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 tablespoon grated lemon zest ADVERTISEMENT",
            "3 tablespoons lemon juice ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3 cups whipped heavy cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix graham cracker crumbs, cinnamon and butter until smooth. Measure 1 cup crumb mixture and set aside. Press remaining mixture on bottom and sides of a 12 inch springform pan. Chill for 1 hour in refrigerator or 1/2 hour in freezer. Preheat oven to 350 degrees F (175 degrees C).\nMix together cottage cheese and flour. Push through a sieve into a large bowl and set aside. In a medium bowl, beat eggs until frothy. Add sugar, gradually to eggs, beat until light and fluffy. Add salt, lemon juice, lemon peel and vanilla until smooth. Fold in whipped cream. Fold into cheese mixture until no streaks remain. Fill shell with cheese mixture. Sprinkle remaining crumbs evenly over top of cheese cake.\nBake in preheated oven for 60 minutes. Turn off oven and let cheese cake sit in oven for 1/2 hour or longer, until it is cooled. Chill in refrigerator.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Apple-Rhubarb Dessert",
        "ingredients": [
            "1/2 cup unsalted butter, melted ADVERTISEMENT",
            "6 ounces brioche, torn into 1/2 inch pieces ADVERTISEMENT",
            "3 cups diced rhubarb ADVERTISEMENT",
            "1 Granny Smith apple -- peeled, cored and sliced into thin wedges ADVERTISEMENT",
            "5/8 cup dark brown sugar ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "1/2 lemon, zested and juiced ADVERTISEMENT",
            "1 tablespoon butter, diced ADVERTISEMENT",
            "3/8 cup warm water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Butter a shallow, 1-quart baking dish.\nIn a medium bowl, combine melted butter and brioche. Line the bottom of the baking dish with one-third of the mixture.\nIn another bowl, combine rhubarb, apple, brown sugar, cinnamon, nutmeg, lemon juice and zest. Let rest until juices begin to run, 5 minutes. Then spread half of the mixture over the brioche in the dish. Top with half the remaining brioche. Spread the remaining rhubarb over that and top with the last of the brioche. Dot with 1 tablespoon butter. Spoon the warm water evenly over the top.\nCover and bake in preheated oven 25 to 35 minutes, until rhubarb is tender. Increase oven temperature to 400 degrees F (200 degrees C), uncover dish, and bake until top is crusty, rhubarb is soft, and bubbles form at the edges of the dish, 10 to 15 minutes. Serve warm.\n",
        "picture_link": "OQO3CAo/tCiY6vi7K52wJFarXzroUXK"
    },
    {
        "title": "Red Velvet Cake VI",
        "ingredients": [
            "3/4 cup canola oil ADVERTISEMENT",
            "3/4 cup applesauce ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 1/2 cups self-rising flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 cup lowfat buttermilk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon white vinegar ADVERTISEMENT",
            "1 fluid ounce red food coloring ADVERTISEMENT",
            "1 (8 ounce) package fat free cream cheese ADVERTISEMENT",
            "1 (12 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "1/2 cup toasted, chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour 3 - 8 inch pans. Sift together the flour and baking soda; set aside.\nIn a large bowl, cream together the oil, applesauce and sugar. Beat in the eggs one at a time. Beat in the flour mixture alternately with the buttermilk, mixing just until incorporated. Stir in the vanilla, vinegar and red food coloring. Divide batter evenly into prepared pans.\nBake in the preheated oven for 35 to 40 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool, then frost with Low-Fat Cream Cheese Frosting and sprinkle with toasted chopped pecans.\nTo make Low-Fat Cream Cheese Frosting: In a medium bowl, beat cream cheese until smooth. Beat in whipped topping and confectioners' sugar.\n",
        "picture_link": "8tMhWG34RuUgsFGmEsffLD6A8jJGbN2"
    },
    {
        "title": "Beef Ball",
        "ingredients": [
            "3 (8 ounce) jars dried chipped beef ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1 tablespoon prepared horseradish ADVERTISEMENT",
            "1/4 cup chopped green bell pepper ADVERTISEMENT",
            "1/4 cup chopped red bell pepper ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan over medium heat, cook and stir the dried chipped beef in butter until evenly browned.\nIn a medium bowl, whip the cream cheese, horseradish, green bell pepper, red bell pepper and pepper until well blended. Mix in 2/3 of the beef. Roll into a ball.\nRoll the ball in the remaining beef and the Cheddar cheese. Wrap in plastic and chill in the refrigerator at least 1 hour before serving.\n",
        "picture_link": "s7km2qcW.HArUleFui5krWCxk2rQv.y"
    },
    {
        "title": "Mom's Chicken Pie",
        "ingredients": [
            "1 pound fresh spinach ADVERTISEMENT",
            "4 cups cooked chicken, chopped ADVERTISEMENT",
            "1 cup sliced mushrooms ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 (17.25 ounce) package frozen puff pastry, thawed ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C.) Place spinach in a steamer over 1 inch of boiling water, and cover. Cook until tender, about 2 to 6 minutes. Drain and cool..\nPlace spinach in the bottom of a 2 quart casserole dish. Cover with chopped chicken. Sprinkle on the sliced mushrooms and season with salt and pepper. Spread sour cream evenly over top. Cover with puff pastry.\nPrick the puff pastry in several places to allow steam to escape. Brush top with beaten egg. Bake in the preheated oven for 20 minutes, or until golden brown.\n",
        "picture_link": "wLzGwjlWfwxMlHKMsYvXf9k0z/4rx0."
    },
    {
        "title": "Carmel's Stuffing",
        "ingredients": [
            "1 large carrot, grated ADVERTISEMENT",
            "1 large onion, finely chopped ADVERTISEMENT",
            "2 cups dry bread crumbs ADVERTISEMENT",
            "3 teaspoons chopped fresh parsley ADVERTISEMENT",
            "3 teaspoons fresh thyme ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl combine carrot, onion, bread crumbs, parsley and thyme; mix well.\nIn a large saucepan melt butter over medium heat. Reduce heat and stir in carrot mixture. Cook, stirring occasionally, until onion and carrot are tender and mixture is heated through, about 15 minutes.\n",
        "picture_link": "rqZXBK0lhCFw/QcARZlJdaxPrGQS0hK"
    },
    {
        "title": "Chocolate Muck Muck Cake",
        "ingredients": [
            "7 (1 ounce) squares finely chopped bittersweet chocolate ADVERTISEMENT",
            "14 tablespoons unsalted butter ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "4 egg yolks ADVERTISEMENT",
            "1 1/2 cups confectioners' sugar ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Lightly spray 6 - 3 inch muffin cups with nonstick cooking spray.\nPlace chopped chocolate and butter in a metal bowl. Set bowl above a saucepan of lightly simmering water and melt until completely smooth and even. Remove from heat and stir in eggs and yolks with a whisk. Lastly, stir in powdered sugar and flour.\nBake in preheated oven for exactly 7 minutes. The cake may appear under-baked. Remove from oven and serve immediately.\n",
        "picture_link": "380YvRJDul1a.m.gCVcQFpQdzWxkAvG"
    },
    {
        "title": "Kiwi Fruit Salsa",
        "ingredients": [
            "1 cup balsamic vinegar ADVERTISEMENT",
            "1 Spanish onion, finely chopped ADVERTISEMENT",
            "1 banana, peeled and chopped ADVERTISEMENT",
            "2 oranges - peeled, seeded and chopped ADVERTISEMENT",
            "4 kiwis, peeled and chopped ADVERTISEMENT",
            "1 serrano pepper, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1/2 balsamic vinegar in a medium saucepan over medium high heat. Slowly cook and stir onion until soft. Stir in banana. Use remaining balsamic vinegar as needed to keep the mixture moist. Stir in oranges, kiwis and serrano pepper. Cook and stir until all ingredients are soft.\n",
        "picture_link": "RKgr.1bTw1sgyvkOwGnbun1hRfyUIr."
    },
    {
        "title": "Zesty Pantry Potato Stew",
        "ingredients": [
            "2 cups chopped carrots ADVERTISEMENT",
            "1/2 cup texturized vegetable protein (TVP) ADVERTISEMENT",
            "1/4 cup uncooked long-grain rice ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "2 (15 ounce) cans sliced potatoes, drained ADVERTISEMENT",
            "1 cup salsa ADVERTISEMENT",
            "1/8 cup dry sherry ADVERTISEMENT",
            "1/8 cup Italian-style salad dressing ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 teaspoon cornstarch ADVERTISEMENT",
            "1/4 cup dry bread crumbs ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 250 degrees F (120 degrees C).\nIn a large bowl toss together carrots, TVP, rice and onion. Transfer to a deep, round casserole dish. Press mixture down evenly. Layer potatoes on top of carrot mixture.\nIn a medium bowl combine salsa, sherry, salad dressing, water and cornstarch. Slowly pour over potatoes.\nBake, covered, in preheated oven for 1 hour. Remove cover and sprinkle with bread crumbs and Parmesan cheese.\nHeat oven to 400 degrees F (200 degrees C) and bake, uncovered, for 1 1/2 hours. Cool slightly before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Soda Pop Ice Cream",
        "ingredients": [
            "1 1/2 cups snow ADVERTISEMENT",
            "3/4 (12 fluid ounce) can cola-flavored carbonated beverage ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, stir together snow and cola. Serve immediately.\n",
        "picture_link": "8i/qvxbWFxPeQOfniAaX/RT3vuhOUHS"
    },
    {
        "title": "Slow Cooker Spaghetti Bolognaise Sauce",
        "ingredients": [
            "2 cups dried soybeans ADVERTISEMENT",
            "4 large tomatoes, cut into wedges ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 pound okra, chopped ADVERTISEMENT",
            "1 cup pitted green olives ADVERTISEMENT",
            "1 cup pitted black olives ADVERTISEMENT",
            "2 (6 ounce) cans tomato paste ADVERTISEMENT",
            "3 (14.5 ounce) cans peeled and diced tomatoes ADVERTISEMENT",
            "3/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1 cup red wine ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 (11 ounce) can whole kernel corn, drained ADVERTISEMENT",
            "2 tablespoons dried oregano ADVERTISEMENT",
            "2 tablespoons dried basil ADVERTISEMENT",
            "4 tablespoons Italian seasoning ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1/2 teaspoon pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cover soybeans with water and soak for several hours, or overnight.\nIn a slow cooker combine soybeans, tomatoes, onion, okra, green olives, black olives, tomato paste, chopped tomatoes, Parmesan cheese, wine, olive oil, corn, oregano, basil, Italian seasoning, salt and pepper. Mix well.\nCook on low for 12 to 24 hours, stirring occasionally.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cranberry Grape Salad",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "2 tablespoons frozen whipped topping, thawed ADVERTISEMENT",
            "1 cup finely chopped walnuts ADVERTISEMENT",
            "1 cup cranberries ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "2 1/2 cups heavy cream, whipped ADVERTISEMENT",
            "1 cup diced mandarin oranges ADVERTISEMENT",
            "1 (8 ounce) can pineapple tidbits, drained ADVERTISEMENT",
            "1 cup halved seedless red grapes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, mix together cream cheese, thawed frozen whipped topping and walnuts.\nThoroughly blend cranberries in a food processor.\nMix cranberries into cream cheese mixture. Gently fold in sugar and heavy cream. Stir in mandarin oranges, pineapple chunks and grapes. Chill in the refrigerator approximately 1 hour before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Tofu Caesar Dressing",
        "ingredients": [
            "1 (10 ounce) package silken tofu, drained ADVERTISEMENT",
            "2 teaspoons grated lemon zest ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "4 cloves garlic, chopped ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "2 teaspoons vegetarian Worcestershire sauce ADVERTISEMENT",
            "3 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender or food processor combine tofu, lemon zest and juice, garlic, water, Worcestershire sauce, Parmesan cheese, salt and pepper. Puree until smooth. If the consistency is too thick, add more water.\n",
        "picture_link": "oUBgI/9h3K7Eb8qX/jeFFbcWJ4nvg1."
    },
    {
        "title": "New Orleans Crumb Cake",
        "ingredients": [
            "1 cup graham cracker crumbs ADVERTISEMENT",
            "3 tablespoons shortening, melted ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "1 (18.25 ounce) package devil's food cake mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan. In a small bowl, combine graham crumbs with melted shortening. Stir together until mixture resembles coarse crumbs. Mix in chocolate pieces and walnuts; set aside.\nPrepare cake mix according to package directions. Spread batter into prepared pan. Sprinkle crumb mixture over batter evenly.\nBake in the preheated oven for 40 to 50 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool in pan.\n",
        "picture_link": "gEkr9zJCDegTTinQ5487ByugJht0UQq"
    },
    {
        "title": "Batter Buns",
        "ingredients": [
            "2 (.25 ounce) packages active dry yeast ADVERTISEMENT",
            "1 1/2 cups warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "1/2 cup shortening, melted and cooled slightly ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "4 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes.\nStir in shortening, sugar, salt and 2 cups flour; beat well. Stir in the remaining flour, 1/2 cup at a time, beating well after each addition. Scrape sides of bowl, cover and let rise until doubled in size, about 1 hour.\nGrease 12 muffin cups. Spoon in batter until cups are half full. Let rise in warm place until batter reaches top of the cup, about 20 to 30 minutes.\nPreheat oven to 425 degrees F (220 degrees C).\nBake in preheated oven for 10 to 15 minutes. Remove from pans and brush tops with melted butter.\n",
        "picture_link": "1Ec1Yd0Ccxtu.J3ne0RlyeJGVD2gl2u"
    },
    {
        "title": "Deviled Chicken II",
        "ingredients": [
            "1/8 cup oil for frying ADVERTISEMENT",
            "8 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 1/3 cups crushed saltine cracker crumbs ADVERTISEMENT",
            "1/3 cup vinegar ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon dry mustard ADVERTISEMENT",
            "1 1/2 teaspoons ground cumin ADVERTISEMENT",
            "1 1/2 teaspoons Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon ketchup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large skillet over medium high heat. Brown chicken in oil, then remove from skillet and dip in cracker crumbs to coat; set aside.\nTo skillet add vinegar, garlic powder, dry mustard, cumin, Worcestershire sauce and ketchup. Stir together and cook until heated through and bubbly, about 7 to 10 minutes. Return chicken to skillet and cook, basting with sauce, for about 10 minutes or until cooked through (no longer pink inside).\n",
        "picture_link": "hmkpFc0ZeloqzMHmAHRBnHboOan0xtm"
    },
    {
        "title": "Bacon-Wrapped Tater Tots®",
        "ingredients": [
            "12 slices center-cut bacon, cut in half crosswise ADVERTISEMENT",
            "24 frozen bite-sized potato nuggets (such as Tater Tots®), partially defrosted ADVERTISEMENT",
            "4 slices sharp Cheddar cheese, each cut into 6 small pieces ADVERTISEMENT",
            "24 dashes hot pepper sauce (such as Frank's RedHot®), or to taste ADVERTISEMENT",
            "24 toothpicks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 450 degrees F (230 degrees C). Line a baking sheet with parchment paper.\nLay each slice of bacon onto a work surface and place a potato nugget in the center of each bacon slice. Cut a slit down the center of each potato nugget and place a Cheddar cheese piece into the slit. Top each nugget with a dash of hot sauce. Wrap bacon around each filled potato nugget and secure the bacon to the nugget with a toothpick. Transfer the wrapped nuggets to the prepared baking sheet.\nBake in the preheated oven until nuggets are cooked through and bacon is crispy, 15 to 20 minutes.\n",
        "picture_link": "ccePAYqBiPzKWUU.Qxpby3AknYl2E4G"
    },
    {
        "title": "Chewy No Molasses Gingersnaps",
        "ingredients": [
            "6 tablespoons butter, very soft ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup applesauce ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons ground ginger ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBeat butter and 1/2 cup white sugar together in a large bowl using an electric mixer until creamy; beat in applesauce, brown sugar, and egg until smooth.\nMix flour, ginger, baking soda, cinnamon, nutmeg, and salt together in a separate bowl. Stir flour mixture, 1/2 cup at a time, into butter mixture until dough is sandy but shapeable. Roll dough into balls. Pour 3 tablespoons white sugar into a bowl and roll dough balls in the sugar until coated. Flatten dough balls onto a baking sheet.\nBake in the preheated oven until edges are crisp and lightly browned, 8 to 10 minutes. Transfer cookies immediately to a cooling rack and cool for 3 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Party Shrimp Dip",
        "ingredients": [
            "1/4 cup milk ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1/2 teaspoon garlic salt ADVERTISEMENT",
            "1 (4.5 ounce) can tiny shrimp, rinsed and drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend milk gradually into cream cheese with wire whisk in a bowl; whisk in lemon juice, Worcestershire sauce, and garlic salt. Stir shrimp through cheese mixture until evenly mixed.\nCover bowl with plastic wrap; refrigerate at least 1 hour.\n",
        "picture_link": "kbb8q/tngLcB1fIoBgJgFwixpL64IK."
    },
    {
        "title": "Spiced Spider Cupcakes",
        "ingredients": [
            "Spice Cake: ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "2/3 cup canola oil ADVERTISEMENT",
            "2 tablespoons distilled white vinegar ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "Cream Cheese Frosting: ADVERTISEMENT",
            "2 (3 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground cinnamon ADVERTISEMENT",
            "5 cups sifted confectioners' sugar, or more as needed ADVERTISEMENT",
            "Decorations: ADVERTISEMENT",
            "1 (.68 oz. tube) black decorating gel ADVERTISEMENT",
            "24 large spiced gumdrops ADVERTISEMENT",
            "black shoestring licorice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line cupcake pans with paper liners.\nCombine flour, white sugar, baking soda, 1 teaspoon salt, 1 teaspoon cinnamon, cloves, and nutmeg in bowl; whisk to mix. In separate bowl, mix water, canola oil, vinegar, and 2 teaspoons vanilla extract. Pour liquids into dry mixture and stir until smooth. The batter will be very thin.\nTransfer batter into a measuring cup or pitcher; pour batter into prepared cupcake pans.\nBake in preheated oven until tops spring back when gently pressed with a fingertip and a toothpick inserted in the center comes out clean, about 25 minutes. Allow cupcakes to cool completely on a wire rack.\nBeat cream cheese, butter, 2 teaspoons vanilla extract, 1/4 teaspoon salt, and 1/8 teaspoon cinnamon with an electric mixer until smooth. Gradually mix in confectioners' sugar until frosting is creamy and spreadable. Frost the cooled cupcakes.\nTo decorate cupcakes, use black decorating gel to draw a small circle in the center of each cupcake. Draw a larger circle around the first, and continue making larger circles until the last circle is about 1/4 inch from the edge. There should be about 5 rings on each cupcake. Use a toothpick to draw about 8 lines radiating from the center of the cupcake to the edge, like spokes on a wheel, to make webs.\nCut the licorice strings into pieces about 1 1/4 inch long for legs. Poke four licorice legs into both sides of each gumdrop. Use decorating gel to make eyes and a smiley mouth on each gumdrop. Place a gumdrop spider onto each cupcake in the center of the webs.\n",
        "picture_link": "lz8S4FnDHfRcfZwVZeyqD/vOGiuMmhC"
    },
    {
        "title": "Midg's Mouth Watering Beef Jerky",
        "ingredients": [
            "5 pounds boneless beef sirloin ADVERTISEMENT",
            "2 cups soy sauce ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "3 dashes Worcestershire sauce ADVERTISEMENT",
            "3 tablespoons white sugar (optional) ADVERTISEMENT",
            "3 tablespoons salt ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "2 teaspoons liquid smoke flavoring ADVERTISEMENT",
            "mesquite or hickory wood chips, as needed for smoker ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut beef into 1/4-inch thick slices. Combine soy sauce, water, Worcestershire sauce, sugar, salt, onion powder, garlic powder, and liquid smoke. Pour marinade into heavy-duty resealable bag. Add beef and mix well; seal bag and refrigerate 12 hours.\nRemove beef from marinade, pat dry with paper towels, and allow to stand for 30 minutes. Discard used marinade. Meanwhile, soak wood chips.\nPreheat smoker for 10 minutes.\nArrange beef on drying racks. Smoke for 5 to 7 hours, depending on how you like it, replenishing wood chips as necessary.\n",
        "picture_link": "zEg5AphZLhjGiMBEAUM1dV9N9niOjq."
    },
    {
        "title": "Tomalito - Sweet Corn Pudding or Cake ",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/3 cup masa harina ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "2 cups frozen corn, thawed, divided ADVERTISEMENT",
            "1/4 cup cornmeal ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "2 tablespoons heavy whipping cream ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nBeat butter in a medium bowl with an electric mixer until creamy. Beat masa harina and water into creamed butter until smooth.\nPlace 1 cup corn in a blender; blend until smooth. Stir blended corn, remaining 1 cup corn, and cornmeal into masa harina mixture.\nMix sugar, cream, baking powder, and salt together in a separate bowl. Pour sugar mixture into corn mixture; stir to combine. Spoon corn batter into an ungreased 8-inch square baking dish. Smooth the top of the batter with a spatula. Cover dish with aluminum foil.\nFill a 9x13-inch casserole dish 1/3 full of hot water. Place the covered 8-inch square dish into the water.\nBake in the preheated oven until a toothpick inserted in the center of the cake comes out clean, 50 to 60 minutes. Remove 8x8-inch dish from water bath and let cool for 10 minutes.\n",
        "picture_link": "yrGO2bW22eQzvaGu1R23jsawTi2WQBa"
    },
    {
        "title": "Philly Cheese Steak Soup",
        "ingredients": [
            "3/4 cup butter ADVERTISEMENT",
            "1 (8 ounce) package sliced fresh mushrooms ADVERTISEMENT",
            "1 white onion, diced ADVERTISEMENT",
            "1 green bell pepper, diced ADVERTISEMENT",
            "2/3 cup all-purpose flour ADVERTISEMENT",
            "6 cups milk ADVERTISEMENT",
            "1 (10.5 ounce) can beef consomme ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 (8 ounce) package provolone cheese, diced ADVERTISEMENT",
            "3/4 pound sliced roast beef, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large, heavy-bottomed pot or Dutch oven over medium heat; cook and stir mushrooms, onion, and bell pepper in the hot pot until tender, about 5 minutes. Add flour and continue to cook and stir until flour is golden, about 5 minutes more.\nGradually whisk milk into vegetable mixture and bring to a simmer. Cook until thickened, stirring often, about 5 minutes. Reduce heat to medium-low. Add beef consomme; season soup with salt and pepper. Slowly stir provolone cheese into soup until cheese is melted, 3 to 5 minutes. Remove from heat and stir in roast beef.\n",
        "picture_link": "1ZnHUBRSAZnYuu6iKZsWavfPwj5/xvO"
    },
    {
        "title": "Garlic Lover's Chicken",
        "ingredients": [
            "4 cups water ADVERTISEMENT",
            "1/4 cup kosher salt ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "6 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 cup grated Parmesan cheese ADVERTISEMENT",
            "1/2 cup dry Italian-seasoned bread crumbs ADVERTISEMENT",
            "1 tablespoon dried parsley flakes ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 cup extra-virgin olive oil ADVERTISEMENT",
            "14 cloves garlic, finely chopped ADVERTISEMENT",
            "1/2 cup margarine, melted ADVERTISEMENT",
            "3 tablespoons lemon juice ADVERTISEMENT",
            "1/2 cup shredded Italian cheese blend, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir water, kosher salt, and sugar together until the salt and sugar dissolve completely into a brine.\nPut chicken breasts in a large resealable plastic bag; pour brine into the bag with the chicken. Squeeze air from the bag and seal. Refrigerate for 1 hour.\nPreheat oven to 350 degrees F (175 degrees C). Grease a 13x9x2-inch baking dish.\nMix Parmesan cheese, bread crumbs, parsley, salt, and black pepper together in a bowl; spread about 1/3 of the mixture into the bottom of the prepared baking dish.\nRemove chicken from the brine, shake off excess liquid, and pat dry. Discard remaining brine.\nCoat chicken with olive oil. Arrange chicken atop the Parmesan cheese layer in the baking dish. Sprinkle remaining Parmesan cheese mixture over the chicken.\nMix garlic, margarine, and lemon juice together in a small bowl; drizzle over chicken.\nCook chicken breasts until no longer pink in the center and the juices run clear, 25-30 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nSwitch oven to broil. Sprinkle cheese over the chicken breasts.\nHeat oven's broiler. Cook chicken under the broiler until the cheese is melted and golden brown, about 5 minutes more.\n",
        "picture_link": "JIh5TbFArxLCBEiwCFPAOCzcf4Akmjy"
    },
    {
        "title": "Peanut Butter Divinity Roll",
        "ingredients": [
            "2 1/2 cups white sugar ADVERTISEMENT",
            "2/3 cup light corn syrup ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "1 tablespoon confectioners' sugar, or as needed ADVERTISEMENT",
            "1/2 cup peanut butter, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix sugar, corn syrup, and water together in a deep pan; bring to a boil. Heat to 250 degrees F (120 degrees C), or until a small amount of syrup dropped into cold water forms a rigid ball (hard ball stage), about 15 minutes.\nBeat egg whites in a glass or metal bowl until stiff peaks form. Lift your beater or whisk straight up: the egg whites will form sharp peaks.\nSlowly pour sugar mixture over egg whites while beating with an electric mixer. Beat until candy clings to a spoon and loses some of its shine. Spread candy mixture onto a sheet of waxed paper; sprinkle with confectioners' sugar. Generously spread peanut butter over candy mixture. Roll candy into one large roll; cut into 2 rolls. Slice each roll into desired pieces.\n",
        "picture_link": "h35APK7XlPPeqFb75tlguZ8m9mshauO"
    },
    {
        "title": "New England Razor Clam Chowder",
        "ingredients": [
            "1 pound thick-cut bacon strips, diced ADVERTISEMENT",
            "2 pounds potatoes, diced ADVERTISEMENT",
            "1 onion, minced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 (12 fluid ounce) can evaporated milk ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "1 pound frozen razor clams, thawed with liquid reserved ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1 pinch salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook and stir bacon in a large pot over medium-high heat until browned, about 10 minutes. Remove bacon with a slotted spoon to a plate lined with paper towel, reserving drippings in the pot.\nCook and stir potatoes, onion, and garlic in the hot bacon drippings until onions are translucent, 7 to 10 minutes. Stir flour into the potato mixture; cook together for about 1 minute. Add evaporated milk, heavy cream, liquid from clams, and bay leaf to the potato mixture; stir.\nBring the mixture to a simmer, reduce heat to medium, and cook until the potatoes are soft, about 15 minutes. Add clams to the soup; cook until the clams are hot, about 5 minutes. Sprinkle bacon atop the soup. Season with salt and pepper to serve.\n",
        "picture_link": "txzTX6ihNlyGLji6Undi.NBT49c/uSG"
    },
    {
        "title": "Chicken Pesto Sandwich",
        "ingredients": [
            "4 skinless, boneless chicken breast halves, cut into chunks ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1 teaspoon red pepper flakes ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "1 yellow bell pepper, sliced ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "1 cup diced zucchini ADVERTISEMENT",
            "1 teaspoon balsamic vinegar ADVERTISEMENT",
            "1 cup sliced mushrooms ADVERTISEMENT",
            "1 tablespoon chopped fresh basil ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "1 cup prepared pesto sauce ADVERTISEMENT",
            "1/2 cup halved cherry tomatoes ADVERTISEMENT",
            "4 Italian-style hoagie buns, split lengthwise and toasted ADVERTISEMENT",
            "1 cup crumbled feta cheese, divided ADVERTISEMENT",
            "2 tablespoons chopped fresh basil, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine chicken, olive oil, garlic, red pepper flakes, salt, and black pepper in a large bowl; toss to coat.\nHeat a large pot or Dutch oven over medium-high heat. Add chicken mixture and cook, stirring frequently, until chicken begins to brown, about 5 minutes. Add yellow bell pepper, onion, zucchini, and balsamic vinegar and cook until onion begins to soften, about 5 minutes.\nStir mushrooms and 1 tablespoon basil into chicken mixture and cook until mushrooms have softened, about 5 minutes. Add mozzarella cheese and pesto sauce; toss to coat. Stir in cherry tomatoes and cook until warmed through, 2 to 3 minutes.\nSpoon chicken mixture into toasted buns and top each sandwich with 1/4 cup feta cheese and 1 1/2 teaspoons basil.\n",
        "picture_link": "wcQQjIv/CJduV5RnRFbP2wLVIMJSbsK"
    },
    {
        "title": "Christmas Eve Manicotti",
        "ingredients": [
            "Crepes: ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 1/4 cups milk ADVERTISEMENT",
            "1/4 cup melted butter ADVERTISEMENT",
            "1 tablespoon vegetable oil, or more as needed ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped spinach - thawed, drained, and squeezed dry ADVERTISEMENT",
            "1 (15 ounce) container ricotta cheese ADVERTISEMENT",
            "1 (3 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "3 tablespoons chopped green onion ADVERTISEMENT",
            "1 tablespoon onion powder ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 eggs, lightly beaten ADVERTISEMENT",
            "2 cups prepared marinara sauce, or as needed ADVERTISEMENT",
            "1 cup shredded mozzarella cheese, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk 4 eggs and 1/4 teaspoon salt together in a bowl; gradually whisk flour into eggs, alternating with milk, to make a smooth batter. Whisk melted butter into batter; refrigerate at least 1 hour.\nPour vegetable oil into a small bowl. Heat a small skillet over medium heat; brush skillet with vegetable oil using a pastry brush. Ladle in enough batter to lightly cover the bottom of the skillet, about 1/4 cup; swirl skillet to cover bottom completely. Cook crepe until it turns lightly golden brown on the bottom; flip and cook until other side has small brown spots. Repeat with remaining batter, brushing the skillet with oil as needed to prevent crepes from sticking; set cooked crepes aside between layers of waxed paper.\nPreheat oven to 350 degrees F (175 degrees C).\nLightly mix spinach, ricotta cheese, cream cheese, Parmesan cheese, parsley, green onion, onion powder, oregano, 1/2 teaspoon salt, and 2 eggs in a bowl until filling is thoroughly combined.\nSpread 1 cup marinara sauce into the bottom of a 9x13-inch baking dish. Place a crepe onto a work surface and spoon about 3 tablespoons filling, or more as needed, in a line down the center of each crepe. Roll crepe over filling and set into sauce in pan; repeat with remaining crepes and filling, laying filled crepes into pan. Spread remaining marinara sauce over filled crepes. Sprinkle with mozzarella cheese.\nBake in the preheated oven until bubbling and mozzarella cheese is melted and slightly browned, 20 to 30 minutes.\n",
        "picture_link": "xo0yUhO6UjY3KvhpI5lvYDm2gjQria."
    },
    {
        "title": "The Original Kielbasa and Sauerkraut",
        "ingredients": [
            "8 ounces pork fatback, diced ADVERTISEMENT",
            "2 (16 ounce) packages sauerkraut, drained ADVERTISEMENT",
            "2 heads cabbage, cored and sliced into long, thin shreds ADVERTISEMENT",
            "5 links kielbasa sausage, cubed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook fatback in a large pot over low heat until the drippings render out, about 45 minutes, stirring often. Stir sauerkraut and cabbage into the pork drippings, bring to a simmer, and cook until cabbage is very tender, about 3 hours. Stir occasionally. Mix kielbasa into the cabbage and kraut; cook 45 minutes to 1 hour to blend flavors.\n",
        "picture_link": "/Mz/BceHLpCbsSOpqKL4rg4S4AGWYvC"
    },
    {
        "title": "Classic Belgian Waffles",
        "ingredients": [
            "1 cup whole wheat flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 tablespoon maple syrup ADVERTISEMENT",
            "1/4 cup applesauce ADVERTISEMENT",
            "3/4 cup So Delicious® Dairy Free Unsweetened Coconutmilk Beverage ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium sized bowl mix together the flour, salt, and baking powder.\nIn a separate, larger bowl mix together the maple syrup, apple sauce, non-dairy milk, and vanilla.\nOnce the wet ingredients are well incorporated, add the dry ingredients and mix well until combined.\nCook according to your waffle iron's directions. We cooked ours on medium heat for about 5 minutes.\n",
        "picture_link": "UipUU7FrLjtZAB6azNgxcVSCJ9IHGYK"
    },
    {
        "title": "Cranberry and Turkey Salad",
        "ingredients": [
            "3 cups chopped cooked turkey ADVERTISEMENT",
            "1/2 cup dried cranberries ADVERTISEMENT",
            "1/2 cup sliced almonds ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "2 tablespoons mayonnaise ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix turkey, cranberries, almonds, celery, and mayonnaise in a bowl until well blended.\n",
        "picture_link": "869yla9x9nds1i4GgCfRDhVRMTqzd.S"
    },
    {
        "title": "Warm Reuben Spread",
        "ingredients": [
            "4 ounces PHILADELPHIA Cream Cheese, softened ADVERTISEMENT",
            "1/2 cup KRAFT Thousand Island Dressing ADVERTISEMENT",
            "1/4 pound sliced deli corned beef, chopped ADVERTISEMENT",
            "3/4 cup well-drained CLAUSSEN Sauerkraut ADVERTISEMENT",
            "1 (8 ounce) package KRAFT Big Slice Swiss Cheese Slices, chopped ADVERTISEMENT",
            "TRISCUIT Deli-Style Rye Crackers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 350 degrees F.\nMix cream cheese and dressing in medium bowl; stir in all remaining ingredients except crackers.\nSpread onto bottom of 9-inch pie plate or shallow dish.\nBake 20 min. or until heated through. Serve warm with crackers.\n",
        "picture_link": "8ZJ5GXQOBkVh9k3Qv5e4XlPK8Rd/.4S"
    },
    {
        "title": "Calgary Dinner",
        "ingredients": [
            "1 (12 ounce) loaf French bread ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "1/2 cup chopped celery ADVERTISEMENT",
            "1 (8 ounce) container reduced-fat sour cream ADVERTISEMENT",
            "1 (1.25 ounce) envelope dry onion soup mix ADVERTISEMENT",
            "1 tomato, sliced (optional) ADVERTISEMENT",
            "2 cups shredded mozzarella and Cheddar cheese blend ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Set oven rack about 6 inches from the heat source and preheat the oven's broiler.\nSplit French bread lengthwise and tear out the soft bread from interior of loaf to hollow out; reserve bread pieces for another use.\nHeat a skillet over medium-high heat. Cook and stir beef and celery in the hot skillet until beef is browned and crumbly, 5 to 7 minutes; drain and discard grease.\nStir sour cream and soup mix into beef mixture; cook until heated through, about 3 minutes. Fill prepared bread with mixture; lay tomato slices over meat, sprinkle evenly with cheese blend, and place filled bread on a baking sheet.\nBroil until cheese is melted and bubbly, about 3 minutes.\n",
        "picture_link": "gPFB02nWgad0iveOO3LKYUDRRPxycna"
    },
    {
        "title": "Deli-Style Fresh Broccoli Salad",
        "ingredients": [
            "Salad: ADVERTISEMENT",
            "12 slices bacon, diced ADVERTISEMENT",
            "1 head broccoli, cut into florets ADVERTISEMENT",
            "1/2 cup sliced green onion ADVERTISEMENT",
            "1 cup sweetened dried cranberries (such as Craisins®) ADVERTISEMENT",
            "Dressing: ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "2 tablespoons cider vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook and stir bacon in a large skillet over medium-high heat until crisp, about 10 minutes. Drain bacon on a plate lined with paper towel.\nToss broccoli, cranberries, and green onion together in a large bowl. Whisk mayonnaise, honey, and vinegar together in a small bowl. Add bacon to broccoli mixture and toss. Drizzle dressing over the salad; toss to coat.\nRefrigerate until cold, about 30 minutes.\n",
        "picture_link": "ODPsOA.pPHW.fn14CVj62tTZOmkVa8S"
    },
    {
        "title": "Asian Sesame Seared or Grilled Tuna (Gluten Free)",
        "ingredients": [
            "1/4 cup tamari (gluten-free soy sauce) ADVERTISEMENT",
            "1/4 cup sesame oil ADVERTISEMENT",
            "2 tablespoons mirin (Japanese sweet wine) ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "2 tablespoons rice wine vinegar ADVERTISEMENT",
            "2 tablespoons grated fresh ginger ADVERTISEMENT",
            "2 green onions, thinly sliced, divided ADVERTISEMENT",
            "2 cloves garlic, minced, or more to taste ADVERTISEMENT",
            "4 (6 ounce) tuna steaks ADVERTISEMENT",
            "2 tablespoons sesame seeds, or to taste ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk tamari, sesame oil, mirin, honey, vinegar, ginger, green onions, and garlic together in a bowl until marinade is evenly mixed. Place tuna steaks in the marinade and refrigerate for at least 1 hour.\nSpread sesame seeds onto a plate. Remove tuna from marinade and discard marinade. Press tuna into sesame seeds until evenly coated.\nHeat olive oil in a cast iron skillet over high heat until very hot; cook tuna in the hot oil until cooked to desired doneness, 30 seconds to 5 minutes per side.\n",
        "picture_link": "h8sPey/K6IBO7RgBBifsnYmpc8w5mTm"
    },
    {
        "title": "Roast Chicken by Kevin Sbraga",
        "ingredients": [
            "1 (4 pound) whole chicken ADVERTISEMENT",
            "1 cup butter at room temperature ADVERTISEMENT",
            "1 whole head garlic, minced ADVERTISEMENT",
            "3 lemons, zested ADVERTISEMENT",
            "1 orange, zested ADVERTISEMENT",
            "2 tablespoons chopped chives ADVERTISEMENT",
            "1 tablespoon toasted sesame oil ADVERTISEMENT",
            "1 tablespoon chopped fresh thyme ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 1/2 teaspoons ground black pepper ADVERTISEMENT",
            "1 teaspoon ground coriander ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse chicken and allow to air-dry for 30 minutes.\nPreheat oven to 300 degrees F (150 degrees C).\nBeat butter, garlic, lemon zest, orange zest, chives, sesame oil, thyme, salt, black pepper, and coriander in a bowl until thoroughly combined. Loosen skin of chicken over breast and thighs with your fingers; generously coat entire chicken with butter mixture, including inside cavity. Insert butter mixture beneath loosened skin.\nPlace chicken on a rack set into a roasting pan with breast side down. Cover chicken with aluminum foil, sealing foil to roasting pan.\nRoast in the preheated oven for 1 hour. Uncover pan, turn chicken over so breast side faces up, and roast until an instant-read meat thermometer inserted into the thickest part of a thigh reads 165 degrees F (75 degrees C), about 20 more minutes.\nRaise oven temperature to 400 degrees F (205 degrees C). Continue to roast chicken until skin is golden brown, about 10 more minutes. Let chicken rest 10 minutes before carving.\n",
        "picture_link": "p.XiiCI3yInAUrhLyr3bn9gUvehEvV2"
    },
    {
        "title": "Fish Stew",
        "ingredients": [
            "1 (15 ounce) can mackerel, undrained ADVERTISEMENT",
            "1 (10.75 ounce) can tomato soup (not condensed) (optional) ADVERTISEMENT",
            "4 potatoes, sliced ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "red pepper flakes (to taste) ADVERTISEMENT",
            "1 egg (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place undrained mackerel, tomato soup (if using), potatoes, onion, and red pepper flakes in a medium stock pot. Add just enough water to cover.\nBring to a boil over medium-high heat, reduce to a simmer, and cook 30 minutes, or until potatoes are tender.\nBreak the egg over the stew, if desired, and serve.\n",
        "picture_link": "N7yRJIA2rQ5O6gKpcWz98cLamtk8ksi"
    },
    {
        "title": "Oysters 'n' Bacon",
        "ingredients": [
            "8 ounces sliced bacon, cut in half ADVERTISEMENT",
            "4 teaspoons white sugar ADVERTISEMENT",
            "1/4 cup dark soy sauce ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "1 (8 ounce) can oysters, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large skillet over medium-high heat. Cook until shrunken, but not crisp. Remove to paper towels to drain.\nPreheat the oven to 300 degrees F (150 degrees C).\nIn a shallow baking dish, whisk together the sugar, soy sauce and garlic with a fork. Wrap each oyster with a piece of bacon, and secure with toothpicks. Place wrapped oysters into the dish with the sauce.\nBake for 10 minutes in the preheated oven, until the sauce has thickened and bacon is nicely crisped at the edges.\n",
        "picture_link": "B2Avx1yvCPikuuiZcEY8FRDaE24Kxfi"
    },
    {
        "title": "Lobster Tenderloin",
        "ingredients": [
            "1 (3 pound) whole beef tenderloin ADVERTISEMENT",
            "2 lobster tails ADVERTISEMENT",
            "1 tablespoon butter, melted ADVERTISEMENT",
            "6 slices bacon ADVERTISEMENT",
            "1 cup sliced green onions ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1 cup dry white wine ADVERTISEMENT",
            "1/8 teaspoon garlic salt ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nPlace bacon in a skillet over medium-high heat. Cook for just a few minutes, until just partly cooked. Set aside.\nMeanwhile, bring a pot of lightly salted water to a rolling boil. Add lobster tails, and boil for 5 to 6 minutes, until colored. Drain, and cool slightly. Remove shells by snipping up the center with scissors, and peeling away to the side.\nSlice a large pocket into the side of the tenderloin. (A butcher can do this for you also) Stuff the lobster tails into the pocket. Combine 1 tablespoon of butter and lemon juice; pour over the lobster tails. Close the pocket, and tie the roast closed with cotton string at 1 inch intervals. Place the roast in a shallow roasting pan.\nBake for about 35 minutes in the preheated oven for rare, or continue to roast to your desired degree of doneness. The internal temperature of the roast should be at least 145 degrees F (70 degrees C) for rare. Lay bacon over the top of the roast, and continue baking until crisp.\nMelt remaining 1 cup of butter in a saucepan over medium heat. Add green onion, wine and garlic salt. Cook until onion is tender. Slice the roast, and arrange on a platter. Spoon sauce over the meat.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Red Pepper Soup with Feta Cheese",
        "ingredients": [
            "1 (12 ounce) jar roasted red bell peppers ADVERTISEMENT",
            "1 (13.75 ounce) can low-sodium chicken broth ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "3/4 teaspoon dried oregano ADVERTISEMENT",
            "1/8 teaspoon dried basil ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "1/2 cup crumbled feta cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a food processor or blender, process undrained peppers with chicken broth, garlic, oregano, and basil until smooth.\nTransfer liquid to a saucepan, and heat over medium-low heat. Simmer for 5 minutes. Slowly whisk in cream, and heat through.\nServe in soup bowls over crumbled feta cheese. Sprinkle additional feta cheese and oregano on top for garnish.\n",
        "picture_link": "oh51XqiLqUkJZKzGpM5URF1GFxh9gjG"
    },
    {
        "title": "Biga",
        "ingredients": [
            "3/4 teaspoon active dry yeast ADVERTISEMENT",
            "1/2 cup warm water ADVERTISEMENT",
            "3 1/2 cups unbleached bread flour ADVERTISEMENT",
            "1 1/4 cups cold water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the warm water in a small bowl, and sprinkle the yeast over the top. Let stand until yeast has dissolved and is foamy, about 15 minutes.\nMeasure flour into a large bowl. Make a well in the center, and pour in the yeast mixture and cold water. Use a sturdy spoon to mix it together until sticky and difficult to stir, but nevertheless thoroughly combined. Cover and allow to ferment for 24 hours in the refrigerator before using.\nStore in the refrigerator for up to 2 weeks. To use, rinse a measuring cup in cool water, scoop out the amount of starter needed, and bring to room temperature.\n",
        "picture_link": "T34i0E2wM0LlZ9knKeQvHgRUCfpyj4y"
    },
    {
        "title": "Blonde Bobbie",
        "ingredients": [
            "1/2 cup Ice cubes ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger Irish cream liqueur ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger butterscotch schnapps ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger coffee flavored liqueur ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ice in a short glass. Pour the Irish cream, butterscotch schnapps, and coffee liquor over the ice. Stir and serve.\n",
        "picture_link": "4pNQErVcsETGSmwkleuensbeM6hKHHO"
    },
    {
        "title": "Pickled Asparagus II",
        "ingredients": [
            "1 bunch fresh asparagus spears ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 cup white wine vinegar ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "4 cloves garlic, crushed ADVERTISEMENT",
            "1 jalapeno pepper, seeded and julienned ADVERTISEMENT",
            "4 sprigs fresh thyme ADVERTISEMENT",
            "2 tablespoons Old Bay Seasoning TM ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "6 whole black peppercorns ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Trim the bottoms off of the asparagus, and pack loosely into a 1 quart jar.\nCombine the water, white wine vinegar, brown sugar, garlic, jalapeno, thyme sprigs, bay leaves, salt and whole peppercorns in a saucepan. Bring to a boil, and boil hard for 1 minute.\nPour the hot liquid over the asparagus in the jar, filling to cover the tips of the asparagus. Cover, and cool to room temperature. Store in the refrigerator for 24 hours to blend flavors before serving.\n",
        "picture_link": "MIX7hz8gDjt9ckMPPEv8J5AHqiMjlme"
    },
    {
        "title": "Dirty Irishman",
        "ingredients": [
            "1 (1.5 fluid ounce) jigger Irish cream liqueur ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger Irish whiskey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a short glass with ice, and pour in the Irish cream liqueur, and Irish whiskey. Stir and serve.\n",
        "picture_link": "n9s570LHSzql3BdCol0nN6xhR9oun0q"
    },
    {
        "title": "The Seafood Thing",
        "ingredients": [
            "1 1/2 cups uncooked long-grain white rice ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1/2 pound fresh mushrooms, sliced ADVERTISEMENT",
            "1/4 pound scallops ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1 1/2 cups whole milk ADVERTISEMENT",
            "1 tablespoon tomato paste ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/2 cup shredded Gruyere cheese ADVERTISEMENT",
            "1/4 pound shelled cooked cocktail shrimp ADVERTISEMENT",
            "1/4 pound imitation crabmeat ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a pot, bring the rice and water to a boil. Cover, reduce heat to low, and simmer 25 minutes.\nHeat the oil in a skillet over medium heat. Stir in the mushrooms, and saute until tender. Mix in the scallops, and cook just until opaque. Remove from heat, and set aside.\nMelt the butter in a saucepan over medium heat, and slowly whisk in the flour to form a golden brown paste. Gradually whisk in the milk, and stir continuously until the mixture has thickened.\nMix the tomato paste, lemon juice, salt, and pepper into the saucepan. Slowly stir in the Gruyere cheese until melted. Mix in the mushrooms, scallops, shrimp, and crab, and continue cooking until heated through. Serve over the cooked rice.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pumpkin Martini",
        "ingredients": [
            "3 (1.5 fluid ounce) jiggers pumpkin flavored liqueur ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger spiced rum ADVERTISEMENT",
            "1 tablespoon half-and-half cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a cocktail mixer full of ice, combine pumpkin liqueur, spiced rum and half-and-half. Shake vigorously and strain into a chilled martini glass.\n",
        "picture_link": "L4kY5ey3DUP6o4Y9HeG800ZNmnJbAq6"
    },
    {
        "title": "Tofu-Veggie Stir Fry and Gravy",
        "ingredients": [
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "1 (14 ounce) can vegetable broth ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 teaspoon onion salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1/2 teaspoon dried parsley ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1/2 cup thinly sliced carrot ADVERTISEMENT",
            "1 cup chopped red pepper ADVERTISEMENT",
            "1 cup broccoli florets ADVERTISEMENT",
            "1/2 cup snow peas, trimmed and cut diagonally into 1-inch pieces ADVERTISEMENT",
            "1 (12 ounce) package extra firm tofu, diced ADVERTISEMENT",
            "8 ounces fresh mushrooms, sliced ADVERTISEMENT",
            "1 (8 ounce) can baby corn, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the cornstarch with water until smooth, and combine with vegetable broth, garlic, onion salt, black pepper, thyme, basil, and parsley in a saucepan over medium-low heat. Bring the gravy mixture to a simmer, and cook and stir until gravy is hot and thickened, about 5 minutes.\nHeat vegetable oil in a large skillet or wok, and stir-fry the carrot, red pepper, broccoli, and snow peas over medium-high heat for 2 to 3 minutes, until just tender. Stir in the tofu, mushrooms, and baby corn, and stir and cook about 1 more minute, until mixture is heated through.\nPour the gravy over the vegetables and tofu, stir to combine, and serve hot.\n",
        "picture_link": "Kj24dvKN8f/a6RfykMziAHfp.1dZtq6"
    },
    {
        "title": "Candied Apples",
        "ingredients": [
            "30 small red apples ADVERTISEMENT",
            "5 cups white sugar ADVERTISEMENT",
            "1/2 cup golden syrup ADVERTISEMENT",
            "1 1/2 cups mineral water ADVERTISEMENT",
            "2 teaspoons black currant syrup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place lollipop sticks or wooden craft sticks into each apple at the stem end. Set aside.\nIn a heavy saucepan, mix together the sugar, golden syrup and water. Bring to a boil, then reduce the heat to medium and continue to cook until the mixture reaches 300 to 310 degrees F (149 to 154 degrees C), or until a small amount of syrup dropped into cold water forms hard, brittle threads. This will take a good 45 minutes!\nRemove the sugar mixture from the heat and stir in the black currant syrup. Quickly dip all of the apples, holding them by the stick. You can let them cool by inserting the other end of the stick into a thick sheet of foam board. If that is not available, set the coated apples onto waxed paper or aluminum foil. Make sure they don't touch each other.\n",
        "picture_link": "sJlcc48PeJO6dARvYeA1nmhcm5qjQma"
    },
    {
        "title": "Devil's Food Cake II",
        "ingredients": [
            "3 (1 ounce) squares unsweetened chocolate, chopped ADVERTISEMENT",
            "2 1/2 cups sifted cake flour ADVERTISEMENT",
            "1 3/4 cups white sugar ADVERTISEMENT",
            "1 3/4 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2/3 cup shortening ADVERTISEMENT",
            "1 1/3 cups milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour 2 (9 inch) pans. In the top of a double boiler, heat chocolate, stirring occasionally, until chocolate is melted and smooth. Remove from heat and allow to cool to lukewarm. Sift together the flour, sugar, baking soda and salt. Set aside.\nIn a large bowl, beat shortening until smooth. Add flour mixture, 1 cup of the milk and vanilla. Mix on low speed until flour is dampened, then beat on medium speed for 2 minutes. Add eggs, remaining 1/3 cup milk and melted chocolate. Beat on medium speed for 1 minute. Pour batter into prepared pans.\nBake in the preheated oven for 30 to 35 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool.\n",
        "picture_link": "pnbQBEkaHeapHsS7R8z2glKqg0kArr2"
    },
    {
        "title": "Sweet and Sour Chicken Salad",
        "ingredients": [
            "1/3 cup sour cream ADVERTISEMENT",
            "3 tablespoons mayonnaise ADVERTISEMENT",
            "1 tablespoon white vinegar ADVERTISEMENT",
            "1 tablespoon apricot jam ADVERTISEMENT",
            "1/4 cup sliced green onion ADVERTISEMENT",
            "3 fresh apricots, pitted and diced ADVERTISEMENT",
            "1 cup chopped celery ADVERTISEMENT",
            "1 pound diced cold, cooked chicken ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, whisk together sour cream, mayonnaise, vinegar and jam. Add green onion, apricots, celery and chicken and toss until evenly coated. Chill and serve over lettuce leaves.\n",
        "picture_link": "2a7sIm874Uhw3GJUSNAv7jtxmSggJnK"
    },
    {
        "title": "Cucumber and Watercress Sandwich Appetizers",
        "ingredients": [
            "8 cups cucumber, peeled and finely chopped ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 cup chopped fresh chives ADVERTISEMENT",
            "2/3 cup butter, softened ADVERTISEMENT",
            "20 slices whole wheat bread, crusts removed ADVERTISEMENT",
            "1/3 cup mayonnaise ADVERTISEMENT",
            "2 cups trimmed and coarsely chopped watercress ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cucumber in a medium bowl. Mix in salt. Cover and set aside for approximately 30 minutes.\nMix ground black pepper, chives and butter into the bowl with the cucumber.\nSpread whole wheat bread slices with mayonnaise. Top 10 slices with equal portions of the cucumber mixture, then with equal portions watercress. Cover with remaining 10 slices of bread. Cut into triangles and serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Coconut Flax Bars",
        "ingredients": [
            "1/2 cup shredded coconut ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "3 tablespoons brown sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "3 tablespoons dark corn syrup ADVERTISEMENT",
            "3 tablespoons apple juice concentrate, thawed ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup whole wheat flour ADVERTISEMENT",
            "2 tablespoons vital wheat gluten ADVERTISEMENT",
            "2 cups rolled oats ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 cup shredded coconut ADVERTISEMENT",
            "1/2 cup flax seed ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1/2 cup roasted soy nuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray a 9 inch square baking pan with cooking spray. In a food processor, grind 1/2 cup shredded coconut into a fine powder.\nIn a large bowl, cream together butter and sugar. Mix in egg, corn syrup, apple juice concentrate, and vanilla. Mix in coconut powder, whole wheat flour, gluten, oats, baking soda, and cinnamon. Stir in remaining 1/2 cup shredded coconut, flax seed, raisins, and soy nuts. Press evenly into the prepared pan.\nBake for 20 minutes. Cool slightly, then cut into bars.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sour Cream Streusel Coffee Cake",
        "ingredients": [
            "3 tablespoons dry bread crumbs ADVERTISEMENT",
            "3 1/4 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3/4 cup butter ADVERTISEMENT",
            "2 1/2 cups white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 (8 ounce) container sour cream ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1/4 cup chopped pecans ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Coat a 10 inch tube pan with non-stick cooking spray and dust with bread crumbs. Sift together the flour, baking soda and salt. Set aside. In a small bowl, mix streusel ingredients - brown sugar, cinnamon and chopped pecans; set aside.\nIn a large bowl, cream together the butter and white sugar until light and fluffy. Beat in the eggs one at a time, then stir in the vanilla. Beat in the flour mixture alternately with the sour cream, mixing just until incorporated. Spoon half of the batter into prepared pan. Sprinkle half of the streusel mixture over the batter. Repeat with remaining batter and streusel mixture.\nBake in the preheated oven for 60 to 70 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pan for 10 minutes, then turn out onto a wire rack and cool completely.\nIn a small bowl, combine confectioners' sugar with milk, a tablespoon at a time, until desired consistency is achieved. Drizzle over the cake.\n",
        "picture_link": "Ab715U2tcnv4.s/YSZ4KzDetjhUj94q"
    },
    {
        "title": "Indian Style Chicken with Apples",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves - cut into strips ADVERTISEMENT",
            "1 large sweet onion, diced ADVERTISEMENT",
            "2 Granny Smith apples - peeled, cored and sliced ADVERTISEMENT",
            "1 red bell pepper, seeded and sliced into strips ADVERTISEMENT",
            "1 tablespoon red curry paste ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 cup chicken broth ADVERTISEMENT",
            "1 cup plain yogurt ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large skillet over medium-high heat. Fry the chicken until golden brown, 5 to 10 minutes. Remove from the skillet and set aside.\nAdd the onion and apple to the skillet and reduce the heat to medium. Cook and stir until the onions are translucent, about 8 minutes. Add the bell pepper; continue to cook and stir for another 5 minutes. Season with curry paste and cinnamon; cook for a few more minutes to intensify the flavors.\nStir in the chicken broth and yogurt. Return chicken to the skillet and simmer for a few minutes to heat through. Remove from the heat, season to taste with salt and pepper, and let stand for 5 minutes before serving.\n",
        "picture_link": "pwqkyBLCnModBQ0WfwCIF3xViNNxTSm"
    },
    {
        "title": "Corned Beef Waffles",
        "ingredients": [
            "2 eggs ADVERTISEMENT",
            "1 1/4 cups milk ADVERTISEMENT",
            "2 teaspoons cooking oil ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 (12 ounce) can corned beef, broken into pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat waffle iron.\nIn a medium bowl, mix together the eggs, milk and oil. Combine the flour, salt and baking powder; stir into the milk mixture until it makes a smooth batter. Stir in corned beef.\nSpoon batter onto your waffle iron, close the lid, and cook until the waffle iron stops steaming and waffles are golden. Serve hot with butter.\n",
        "picture_link": "2CaQuwJMOVMkTNybtCAxJXQyGXN2tDa"
    },
    {
        "title": "Best Brownies Ever",
        "ingredients": [
            "1 1/4 cups margarine, softened ADVERTISEMENT",
            "4 cups white sugar ADVERTISEMENT",
            "8 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "1 1/4 cups cocoa powder ADVERTISEMENT",
            "2 cups chopped walnuts ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease a 15x10 inch baking pan.\nCombine the margarine and the sugar in a large mixing bowl; use an electric mixer to beat until light. Beat in the eggs and vanilla; mix well. Whisk together the flour, cocoa powder, walnuts, and salt in a large bowl. Stir the flour mixture into the egg mixture, mixing just until dry ingredients are incorporated. Spoon batter into prepared pan.\nBake brownies in the preheated oven until the edges begin to pull away from the sides of the pan, 40 to 45 minutes.\n",
        "picture_link": "/MOnLaPNOYTGh4us1OBkNJvyo0z/vOy"
    },
    {
        "title": "Crunch Drops",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup shortening ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups quick cooking oats ADVERTISEMENT",
            "2 cups crisp rice cereal ADVERTISEMENT",
            "1 cup shredded coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix, flour, salt and soda together. Cream shortening until fluffy; add both kinds of sugar gradually, beat until smooth and creamy. Add eggs, one at a time, beating well after each one.\nStir in vanilla and flour mixture; add cereal, oats, and coconut.\nForm into small balls and place on greased cookie sheets and bake at 350 degrees F (175 degrees C) for 12 to 15 minutes.\n",
        "picture_link": "ZdK50vvQbF2XgfFaTUk6Wfj2Dt8SV.a"
    },
    {
        "title": "Cherry Flips",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "2 egg yolks ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons almond extract ADVERTISEMENT",
            "36 maraschino cherries ADVERTISEMENT",
            "1/2 cup flaked coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend together the butter, egg yolks, vanilla, salt, confectioners' sugar and flour.\nTake small amount of dough in hand , flatted out and wrap around drained cherry. ( I use a combination of red and green cherries and tint the icing to match the color of the cherry. )\nBake on ungreased cookie sheet at 350 degrees F (175 degrees C) until golden brown (about 10 minutes).\nCool and dip in tinted butter icing. Roll in coconut flakes. ENJOY!\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Java Chocolaty Cookies",
        "ingredients": [
            "1 cup shortening ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "3/4 cup packed light brown sugar ADVERTISEMENT",
            "3 tablespoons coffee-flavored liqueur ADVERTISEMENT",
            "2 egg ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3/4 teaspoon baking soda ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "3 tablespoons chocolate syrup (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In large bowl, combine the shortening and the sugars. Add the coffee liqueur and the eggs. Blend well.\nNow, in a separate bowl, combine the flour, the baking soda, and the salt. Add this mixture to the coffee mixture. Mix well, then add the chocolate chips. Add the chocolate syrup if desired.\nDrop dough in teaspoon size balls onto cookie sheets. Bake at 375 degrees F (190 degrees C) for about 8 minutes. Remove cookies from the oven, and allow to cool.\n",
        "picture_link": "fYBkWKGoptzOzmXF4BkdoAGwsdz8Mdq"
    },
    {
        "title": "Holiday Fruit Drops",
        "ingredients": [
            "1 cup shortening ADVERTISEMENT",
            "2 cups packed brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup buttermilk ADVERTISEMENT",
            "3 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups chopped pecans ADVERTISEMENT",
            "2 cups candied cherries, halved ADVERTISEMENT",
            "2 cups dates, pitted and chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream the shortening with the brown sugar. Beat in the eggs. Stir in the buttermilk.\nBlend in the flour, baking soda and salt. Once well combined stir in the chopped pecans, candied cherries and chopped dates. Cover and chill dough for at least 1 hour.\nPreheat oven to 400 degrees F (205 degrees C).\nDrop spoonfuls of chilled dough onto lightly greased baking sheets. Bake at 400 degrees F (205 degrees C) for 8 to 10 minutes.\n",
        "picture_link": "mGbYBldQ60Ww5KWcCMGTjaKEYByfPIq"
    },
    {
        "title": "Chinese Almond Cakes",
        "ingredients": [
            "2 1/2 cups sifted all-purpose flour ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "3/4 cup butter, softened ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "3 tablespoons water ADVERTISEMENT",
            "1 teaspoon almond extract ADVERTISEMENT",
            "36 blanched almonds ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sift flour, sugar, salt and baking powder together in a large bowl. Using pastry blender or knives, cut in butter until mixture resembles coarse cornmeal.\nBeat the egg together with 2 tablespoons of the water and the almond extract. Add this to the flour mixture and mix with a fork until dough leaves the sides of the bowl.\nOn a lightly floured surface, knead the dough until it is smooth. Wrap it in foil or cling-wrap and refrigerate for one hour.\nMeanwhile, preheat oven to 350 degrees F (175 degrees C).\nForm dough into 1 inch balls and place them 3 inch apart on ungreased cookie sheets. Flatten each cookie to about 1/4 inch thick and press an almond into the center of each. Beat egg yolk with 1 tablespoon water and brush on cookies.\nBake 20-25 minutes or until golden brown. Remove to wire rack to cool.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Victory Chocolate Cake",
        "ingredients": [
            "2 cups sifted all-purpose flour ADVERTISEMENT",
            "2 1/4 teaspoons baking soda ADVERTISEMENT",
            "3/4 cup shortening ADVERTISEMENT",
            "1 1/2 cups dark corn syrup ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "1/2 cup unsweetened cocoa powder ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 cup cold, brewed coffee ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease one 9x13 inch pan.\nSift together the flour, cocoa, baking soda, and salt; set aside.\nSeparate eggs. Beat egg whites in a clean bowl until stiff peaks form.\nCream shortening and sugar in mixing bowl until light and fluffy using electric mixer at medium speed. Blend in the corn syrup and egg yolks. Beat in vanilla. Add dry ingredients alternately with coffee to creamed mixture. Gently fold in egg whites. Pour batter into greased 13x9 inch pan.\nBake in preheated 350 degree F (175 degree C) oven for 45 minutes or until cake is done. Cool in pan on rack and frost as desired.\n",
        "picture_link": "SYG52wjD0P5dT2fVji1xQeOGF.gtE6C"
    },
    {
        "title": "Gingerbread Folk",
        "ingredients": [
            "1 egg ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "7/8 cup packed brown sugar ADVERTISEMENT",
            "2 teaspoons ground ginger ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1/4 cup dried currants ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1 1/2 cups confectioners' sugar ADVERTISEMENT",
            "3 drops red food coloring ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Set the oven for 375 degrees F (190 degrees C). Melt a little of the butter and grease baking sheets using a pastry brush.\nPut the butter, brown sugar, and honey in a saucepan and stir them over low heat until they have melted.\nSift the flour, ginger, and baking soda into a mixing bowl. Add the melted mixture from the saucepan and egg.\nMix everything together and knead it into a ball. Chill the dough in a plastic bag for 30 minutes.\nSprinkle some flour on a flat, clean surface and on a rolling pin. Then roll the dough out until it is about 1/4 inch thick. Use cookie cutters or a knife to cut out shapes and people. Lift the cookies onto baking sheet, then gather all the leftover dough and cut out more shapes. Press currants into the dough to make eyes and buttons and bake for 10 to 15 minutes until they are golden brown.\nTo Make Icing: Sift the confectioners' sugar into a bowl. Add a little water at a time to make a thick, smooth paste. Spoon a bit of the icing into a small bowl and add a few drops of food coloring. Do the same with the rest, using a different color. Fill pastry bags with the icing and squeeze it onto the cookies to make clothes!\n",
        "picture_link": "baPUC2VjluAaVCly4S5BPwpe1au6kAS"
    },
    {
        "title": "Ice Box Cake II",
        "ingredients": [
            "1 (16 ounce) package large marshmallows ADVERTISEMENT",
            "2 (15 ounce) cans crushed pineapple ADVERTISEMENT",
            "4 bananas ADVERTISEMENT",
            "1/4 cup chopped walnuts ADVERTISEMENT",
            "1 cup heavy whipping cream, whipped ADVERTISEMENT",
            "2 cups graham cracker crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line one 9x13 inch baking pan with the graham cracker or vanilla wafer crumbs. Reserve a few crumbs as a garnish for the top.\nDrain the pineapple, saving the juice. Melt the marshmallows in the pineapple juice over low heat. Once melted set aside to cool.\nCut up the bananas into chunks. Mix the bananas, chopped nuts, and crushed pineapple into the cooled marshmallow mixture.\nFold the fruit mixture into the whipped cream. Spoon batter into the graham cracker or vanilla wafer lined pan. Sprinkle the reserved crumbs on top. Chill well before serving. Makes about 12 to 18 servings.\n",
        "picture_link": "zLsZs1a99vMrdlKEJiuY9zSPPRZLSAC"
    },
    {
        "title": "Crescents",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "3 tablespoons ice water ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3/4 cup butter ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "If using butter it must be cold. Mix butter with flour until it resembles fine crumbs. Add white sugar, nuts, and salt. Mix well, adding ice water till you make stiff dough.\nAdd vanilla extract and knead lightly. Roll out on floured board 1/4 inch thick.\nCut into crescent shapes using a whiskey glass coated with flour.\nBake at 350 degrees F (180 degrees C) until bottoms are lightly browned. While hot, roll in confectioner's sugar, (I usually use a brown bag or baggie bag to roll the cookies in with the powdered sugar).\n",
        "picture_link": "234aI.mfVSzp3.WSSCjjYeTZsoMPhRW"
    },
    {
        "title": "Make Ahead Peanut Butter Cookies",
        "ingredients": [
            "2 cups Make Ahead Cookie Mix ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1/3 cup shortening ADVERTISEMENT",
            "1/2 cup peanut butter ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nCombine 2 cups of Make Ahead Cookie Mix with brown sugar, shortening, peanut butter, vanilla, and egg.\nShape dough into balls. Place dough on ungreased cookie sheets. Flatten with a fork. Bake 7-11 minutes.\n",
        "picture_link": "pCkIz0bqjOgnXWl/Yw5JlXhYDcKHen2"
    },
    {
        "title": "Melt in your Mouth Cookies II",
        "ingredients": [
            "7/8 cup butter ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "2 tablespoons molasses ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together butter with 1/2 cup white sugar.\nIn a separate bowl, mix 1 cup white sugar with 2 tablespoons of molasses. Add to the butter/sugar mixture. Add one egg and and vanilla. Then slowly add salt and baking soda. Stir in flour and chocolate chips.\nBake at 375 degrees F (190 degrees C) for 9 minutes and enjoy!\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Dream Squares",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup candied cherries, quartered ADVERTISEMENT",
            "1/2 cup flaked coconut ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCream together the butter or margarine with 1/2 cup of the brown sugar. Stir in the vanilla and the flour. Press this mixture into the bottom of one ungreased 8x8 inch square baking pan.\nBake at 350 degrees F (175 degrees C) for 10 minutes.\nTo Make Topping: Beat the eggs and add 1 cup of the brown sugar. Stir in the 1 tablespoon all purpose flour, the baking powder, pinch salt, chopped walnuts, glace; cherries, coconut and chocolate chips. Spread mixture over the baked pastry.\nReturn to the oven and bake at 350 degrees F (175 degrees C) for an additional 30 to 35 minutes or until golden brown. Let cool then cut into squares.\n",
        "picture_link": "cuQlHNKqLaDez8xuczF0BgDtVFYc4SK"
    },
    {
        "title": "Laura Shirk's Shortbread",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 1/3 cups all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C).\nCream butter and sugar together. Add flour and salt, stir until blended. Roll out 1/2 inch thick on floured board and cut into shapes with small (2 inch) cutters.\nBake for 50 minutes. Sprinkle with sugar.\n",
        "picture_link": "G0ooggkhrpwxAKIbZiX3ZJKV.dbi/nG"
    },
    {
        "title": "Gingerbread Cutouts",
        "ingredients": [
            "1/2 cup shortening ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup molasses ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 tablespoon distilled white vinegar ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a mixing bowl beat shortening with an electric mixer on medium to high speed for 30 seconds. Add about half of the flour, the sugar, molasses, egg, vinegar, baking powder, ginger, baking soda, cinnamon, and cloves. Beat until thoroughly combined. Beat in remaining flour. Cover and chill for at least 3 hours or until dough is easy to handle.\nPreheat oven to 375 degrees F (190 degrees C). Lightly grease a baking sheet.\nDivide the chilled dough in portions to be rolled out. On a lightly floured surface roll the pieces of dough to 1/8 inch thickness. Cut with a knife, spatula, or pizza cutter to desired sizes for walls, roof, etc. Place on greased cookie sheet.\nBake at 375 degrees F (190 degrees C) for 5-6 minutes or until edges are lightly browned. Cool on the cookie sheet for 1 minute then remove with spatula to wire rack to finish cooling. Decorate with confectioners' sugar icing colored as desired with food coloring. Decorate and or assemble as desired.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Nut Filling for Kolacky Cookies",
        "ingredients": [
            "1/2 pound ground walnuts ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "1/2 cup super fine sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat the egg whites and add the ground walnuts and white sugar. Mix well. Place about 1 teaspoon of filling on each square.\n",
        "picture_link": "k2cIYSSODPj0HjYF2zNlc0lqGqoGw5q"
    },
    {
        "title": "Biscotti Dessert Cookies",
        "ingredients": [
            "1 1/2 cups whole wheat flour ADVERTISEMENT",
            "1 cup ground toasted hazelnuts ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "6 tablespoons honey ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine flour, hazelnuts, and baking powder.\nIn a large bowl, beat butter and honey until smooth. Beat in eggs one at a time, beating well after each addition. Gradually blend in the dry ingredients.\nDivide dough in half. On prepared baking sheet, form each half into a log about 12 inches long and 2 inches wide, spacing about 2 inches apart.\nBake for 14 to 16 minutes until golden brown. Transfer logs to a cutting board and cut on diagonal into 1/2 inch thick slices. Lay slices on ungreased baking sheet and bake for 10 to 12 minutes longer -- until dry. Transfer to wire racks to cool. Store in a tightly sealed container and let them age for a few days before serving.\n",
        "picture_link": "l7JRAQc/66qQIVdEtFKyR7.q7iWjZ56"
    },
    {
        "title": "Boiled Fruitcake",
        "ingredients": [
            "12 ounces candied mixed fruit ADVERTISEMENT",
            "5 ounces glace cherries, roughly chopped ADVERTISEMENT",
            "2 ounces candied mixed citrus peel ADVERTISEMENT",
            "2 ounces chopped walnuts ADVERTISEMENT",
            "3/4 cup butter ADVERTISEMENT",
            "1 teaspoon ground allspice ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "12 ounces sifted self-rising flour ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (160 degrees C). Line one 8 inch deep sided cake tin with parchment paper.\nPlace the fruit cherries, peel, walnuts, sugar, butter or margarine, mixed spice, baking soda and milk in a medium sized saucepan. Bring to a boil and simmer for 5 minutes. Let mixture cool to body temperature.\nStir in the flour and the eggs. Pour batter into the prepared pan. Wrap outside of pan with brown paper or newspaper.\nBake at 325 degrees F (160 degrees C) for 40 minutes then reduce temperature to 300 degrees F (150 degrees C) and continue to baking cake for 1-1/2 hours. Remove cake from oven and allow it to cool in tin for 5 minutes then turn it out onto a cooling rack, remove greaseproof paper and leave until cool. Cake can be stored for up to 6 months wrapped in foil and in an air tight tin.\n",
        "picture_link": "IXiWQZCiFQQb3zx1QMOyYV/JoWDWqmu"
    },
    {
        "title": "Mocha Cake III",
        "ingredients": [
            "1 (18.25 ounce) package chocolate cake mix ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "16 ounces sour cream ADVERTISEMENT",
            "1/2 cup coffee flavored liqueur ADVERTISEMENT",
            "8 ounces semi-sweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grease one 10 inch bundt cake pan. Preheat oven to 350 degrees F (175 degrees C).\nMix together cake mix, eggs, oil, sour cream, coffee liqueur, and chocolate chips, in the order listed, and pour into the greased bundt cake pan.\nBake at 350 degrees F (175 degrees C) for one hour or until the surface springs back when touched lightly.\n",
        "picture_link": "LrWzGvvJKR8TqTyVzyK3GmmcgpGnlS6"
    },
    {
        "title": "Apricot Confection",
        "ingredients": [
            "3 eggs ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "3/4 cup chopped walnuts ADVERTISEMENT",
            "2 cups flaked coconut ADVERTISEMENT",
            "7 1/2 ounces vanilla wafers, crushed ADVERTISEMENT",
            "8 ounces dried apricots ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Snip apricots into small strips. Sprinkle with water and let stand in a sealed container overnight.\nCombine eggs, sugar, and apricots. In a lightly buttered skillet cook the apricot mixture over low heat for 10 minutes. Stir in the nuts, vanilla wafer crumbs and 1/2 of the coconut.\nShape mixture into small balls. Roll balls in the remaining coconut. Store in a tightly covered box. These taste best after aging for a few days.\n",
        "picture_link": "gBURMrNPxquyRwwajKjPdAN6mbutWGi"
    },
    {
        "title": "Sour Cream Pockets",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "3/4 cup butter ADVERTISEMENT",
            "1 (21 ounce) can apple pie filling ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together the flour, sour cream and butter or margarine in a large mixing bowl.\nFlour a pastry board and your hands. Make dough into small balls or roll them into 2 inch squares. Add a small amount of pastry filling, any flavor you like. Fold dough diagonally and press together. If you make balls, press a small rim around the outside so the filling does not seep out.\nBake at 350 degrees F (175 degrees C) for 10 minutes and sprinkle on confectioners' sugar. A wonderful gift any time of the year.\n",
        "picture_link": "epjl1F03Z93AE0.PDtpW99DFeoKRhqq"
    },
    {
        "title": "Dark Dreams",
        "ingredients": [
            "15 blanched almonds, halved ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1 cup sifted all-purpose flour ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a frying pan and let brown to a dark color. Do not burn. Remove from heat and pour into mixing bowl. Discard any residue and let cool to room temperature.\nCream cooled butter with sugar, and stir in vanilla. Resift flour with baking soda and mix into the butter mixture until well blended. Knead dough lightly, cover and refrigerate for one hour.\nPreheat oven to 300 degrees F (150 degrees C). Grease cookie sheets. Roll dough into a log 1 inch in diameter. Cut 1/2-inch thick slices. Shape slices into balls and place on cookie sheets. Press half an almond into top of each ball and\nBake 25 to 30 minutes in the preheated oven, until the edges are golden. Remove from cookie sheets to cool on wire racks.\n",
        "picture_link": "3cEDDy6xBlH1wwyGgXt0/vjtBJrIeKK"
    },
    {
        "title": "Northland Cookies",
        "ingredients": [
            "1 cup packed brown sugar ADVERTISEMENT",
            "6 tablespoons butter ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup chopped almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix brown sugar, butter or margarine, and water. Add flour, baking soda, cinnamon, and salt. Stir in nuts and mix well.\nShape in roll 2 1/2 inches in diameter, cover and chill until firm.\nPreheat oven to 400 degrees F (200 degrees C).\nCut dough into 1/8-1/4 inch slices. Bake on greased cookie sheet 8-10 minutes.\n",
        "picture_link": "ucgaaBTuBp/PWN00uOzLbMoVo0m75DC"
    },
    {
        "title": "Chocolate Marshmallow Puffs",
        "ingredients": [
            "3 cups sifted all-purpose flour ADVERTISEMENT",
            "2/3 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1 cup shortening ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "60 miniature marshmallows ADVERTISEMENT",
            "1/3 cup granulated sugar for decoration ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put marshmallows in the freezer for a couple of hours.\nIn a large mixing bowl, sift together the flour, salt, cocoa, and baking soda. In a separate bowl, cream together the shortening and both sugars. Blend in unbeaten eggs and vanilla. Beat well.\nStir in flour mixture and blend thoroughly.\nStick bowl in fridge; until dough is hardened.\nShape 1 teaspoon sized piece of dough around each marshmallow, seal well. Roll in sugar.\nBake at 400 degrees F (205 degrees C) on greased sheet for 5 to 7 minutes, or until cookies crack. Cool for about 2 minutes before removing from cookie sheet.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Baked Ziti with Turkey Meatballs",
        "ingredients": [
            "1 pound ground turkey ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "3/4 cup fresh bread crumbs ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "3 tablespoons chopped, toasted pine nuts ADVERTISEMENT",
            "1/2 cup chopped fresh parsley ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "4 tablespoons olive oil ADVERTISEMENT",
            "16 ounces dry ziti pasta ADVERTISEMENT",
            "1 1/2 cups mozzarella cheese, shredded ADVERTISEMENT",
            "1 cup grated Romano cheese ADVERTISEMENT",
            "6 cups tomato sauce ADVERTISEMENT",
            "1 pint part-skim ricotta cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a bowl, stir together turkey, garlic, bread crumbs, onion, pine nuts, parsley, egg, salt and pepper. Form into meatballs about 1 inch in diameter.\nIn a large heavy skillet, heat 2 tablespoons oil over moderately high heat until hot but not smoking. Cook half of meatballs, shaking skillet, until browned and cooked through, about 4 minutes. Transfer meatballs to paper towels to drain. Brown remaining meatballs in remaining 2 tablespoons oil in same manner.\nPreheat oven to 375 degrees F (190 degrees C). Oil a 3 to 4 quart gratin dish.\nBring a large pot of salted water to a boil. Add the pasta, and cook until just al dente, about 8 minutes. Drain.\nIn a small bowl, toss together mozzarella and romano cheese.\nSpoon about 1 1/2 cups tomato sauce and half the meatballs into prepared dish, and spoon half the pasta on top. Spread half remaining sauce and half cheese mixture over pasta. Top with remaining meatballs, and drop dollops of ricotta over meatballs. Spread remaining pasta over ricotta, and top with remaining sauce and cheese mixture. Bake in middle of oven for 30 to 35 minutes, or until golden. Let stand 10 minutes before serving.\n",
        "picture_link": "E53i2EFRQ8Kn2qH6JDxz6VhnRHIZ/Cy"
    },
    {
        "title": "My Grandma's Mint Patties",
        "ingredients": [
            "1/2 cup light corn syrup ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 teaspoon mint extract ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 pound confectioners' sugar ADVERTISEMENT",
            "1 drop red food coloring (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat white corn syrup, butter or margarine, mint extract, and 1/2 teaspoon salt. Mix in 1 pound of powdered sugar and knead intil smooth.\nColor with food coloring as desired. Pat or roll to about 1/4 inch thick. Use small cookie cutters to cut shapes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Stir and Drop Sugar Cookies II",
        "ingredients": [
            "3 egg whites ADVERTISEMENT",
            "2/3 cup vegetable oil ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 teaspoon lemon zest ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (205 degrees C).\nBeat egg whites with fork. Stir in vegetable oil, vanilla, and lemon rind. Blend in sugar until mixture thickens.\nMeasure flour by dipping method or by sifting. Stir together flour, baking powder, and salt; blend into egg mixture. Drop dough by teaspoonfuls about 2 inches apart on ungreased baking sheet. Flatten with oiled bottom of glass dipped in sugar.\nBake 8 to 10 minutes or until a delicate brown. Remove from baking sheet immediately.\n",
        "picture_link": "fykvwYMOumkHoDM/Vji6OH84hjWlB.m"
    },
    {
        "title": "Monster Cookies IV",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "1 tablespoon real maple syrup ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup whole wheat flour ADVERTISEMENT",
            "1/3 cup graham cracker crumbs ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3 cups rolled oats ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "4 ounces finely grated chocolate bar ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup chopped cashews ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place margarine in a large bowl. With an electric mixer, cream for 30 seconds. Stop and scrape bowl. Add sugars and cream for 2 minutes. Stop and scrape bowl. Add eggs, vanilla, and maple syrup. Mix for 2 minutes. Scrape bowl.\nAdd all-purpose flour, whole wheat flour, graham cracker crumbs, baking soda, baking powder, and salt. Mix on low for 1 minute. Add oatmeal and mix on low for 1 to 1 1/2 minutes, until thoroughly blended. Add chocolate and nuts. Mix on low for 30 seconds, just until blended.\nDrop by rounded teaspoonfuls onto greased baking sheets. Bake at 350 degrees F (175 degrees C) for 8 to 10 minutes. Cool completely on wire racks.\n",
        "picture_link": "H0HpRdmxbB9iIj4deUxcSp4vRkAJ5N2"
    },
    {
        "title": "Cookie Mix in a Jar X",
        "ingredients": [
            "1 1/4 cups white sugar ADVERTISEMENT",
            "1/2 cup chopped macadamia nuts ADVERTISEMENT",
            "3 (1.55 ounce) bars white chocolate, chopped ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together flour, baking soda and baking powder. Set aside.\nLayer ingredients in order given in a quart sized wide mouth canning jar. Press each layer down firmly in place. { I use the bottom of a small clean juice glass and press each layer firmly in place, especially the chocolate.} Add the flour mixture last.\nAttach these directions to jar: White Chocolate Macadamia Nut Cookies 1. Empty cookie mix into large mixing bowl. Use you hands to thoroughly blend mix. 2. Add: 1/2 cup butter or margarine, softened at room temp. DO NOT USE DIET MARGARINE. Add in 1 egg slightly beaten and 1 teaspoon of vanilla. 3. Mix until completely blended. You will need to finish mixing with your hands. It will take a while to mix into a smooth dough. 4. Shape into walnut sized balls and place 2 inches apart on sprayed cookie sheets. 5. Bake at 375 degrees F (190 degrees C) for 12 to 14 minutes until tops are very lightly browned. Cool 5 minutes on baking sheet. Remove to racks to finish cooling. Makes 2 1/2 dozen cookies.\n",
        "picture_link": "6VD9S13OBHpkbhVMOsu9midZs6GFwz6"
    },
    {
        "title": "No Bake Fruitcake",
        "ingredients": [
            "1 pound halved candied cherries ADVERTISEMENT",
            "4 cups chopped pecans ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 (14 ounce) can coconut milk ADVERTISEMENT",
            "1 cup flaked coconut ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 (12 ounce) package vanilla wafers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl mix the candied cherries, chopped pecans, sweetened condensed milk, coconut milk, flaked coconut, raisins, vanilla, and crushed vanilla wafers. Batter will be very stiff. Place into pan and store in the refrigerator.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sugar Free Peanut Butter Balls",
        "ingredients": [
            "1 cup margarine ADVERTISEMENT",
            "2 tablespoons granulated artificial sweetener ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "1/2 cup chopped peanuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBeat margarine and sugar till fluffy. Add vanilla, water, and flour, mixing well. Refrigerate 1 hour.\nForm into 1 inch balls, dip into beaten egg white and roll into peanuts. Place on ungreased cookie sheets. Bake 10 to 12 minutes. Store in an airtight container.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Mock Macaroons",
        "ingredients": [
            "2 cups rolled oats ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon almond extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine oatmeal, brown sugar and oil in a bowl. Stir to mix well. Cover and let stand at least 5 hours, or overnight.\nPre-heat oven to 350 degrees F (175 degrees C). Grease cookie sheets - use non-stick if possible.\nAdd the egg, salt and almond extract to oatmeal and stir well until blended.\nDrop by rounded teaspoonfuls about 1-1/2 inches apart on greased cookie sheets. Bake 7 or 8 minutes or until edges are browned and center is golden. Remove from cookie sheet and cool on racks.\n",
        "picture_link": "BgQCTOQnzV6IyTLA06Qnl5eGJXNGNlq"
    },
    {
        "title": "Coffee Shortbread Cookies",
        "ingredients": [
            "1/2 cup finely ground almonds ADVERTISEMENT",
            "1 1/4 cups sifted all-purpose flour ADVERTISEMENT",
            "3/4 cup confectioners' sugar ADVERTISEMENT",
            "2 tablespoons instant coffee powder ADVERTISEMENT",
            "3/4 cup butter, softened ADVERTISEMENT",
            "1/3 cup granulated sugar for decoration ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In large bowl combine almonds, flour, confectioners' sugar and coffee. Cut in the butter and mix together until well blended. Shape dough into a ball, wrap in foil or plastic and refrigerate for at least half an hour.\nOn lightly floured surface roll chilled dough to about 1/4 inch thickness. Cut with 2 inch cookie cutter. Place cookies 1 inch apart on ungreased cookie sheet and sprinkle tops with granulated sugar.\nBake 10-12 minutes in a preheated 350 degrees F (175 degrees C) oven or until edges are just firm. Remove from sheet. Cool cookies on wire rack.\n",
        "picture_link": "1LRgq8J0VJS3UlC54JWiVonrhduo0.y"
    },
    {
        "title": "Buckeye Cookies II",
        "ingredients": [
            "2 cups butter, softened ADVERTISEMENT",
            "4 cups peanut butter ADVERTISEMENT",
            "2 pounds confectioners' sugar ADVERTISEMENT",
            "1/2 cup graham cracker crumbs ADVERTISEMENT",
            "1 1/2 cups semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together margarine, peanut butter, confectioners' sugar and graham cracker crumbs by hand. Form into 2 inch balls and place on wax paper.\nRefrigerate for 8 hours or overnight.\nMelt chocolate chips in top of double boiler. Put a toothpick in the peanut butter balls and dip in chocolate until 3/4 covered. Place on waxed paper to cool.\n",
        "picture_link": "S7MEGJwd49ObeWY0X3FXjzNC5JlGf3W"
    },
    {
        "title": "Corn Pudding III",
        "ingredients": [
            "2 (14.75 ounce) cans cream-style corn ADVERTISEMENT",
            "4 tablespoons butter ADVERTISEMENT",
            "1/3 cup all-purpose flour ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground white pepper ADVERTISEMENT",
            "3 eggs, separated ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 red bell pepper, diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, mix corn and butter. Add flour, sugar, pepper, salt, and diced red pepper. Mix thoroughly.\nIn a small bowl, lightly beat egg yolks.\nHeat milk to steaming. Remove milk from heat and stir in yolks. Add to corn mix.\nIn a medium bowl, beat egg whites until stiff. Stir 1/4 of the whites into corn. Fold in the whites. Pour into deep 2-quart greased baking dish.\nBake at 350 degrees F (175 degrees C). Stir crust that forms down into pudding after 20 minutes and after 40 minutes. Total bake time: 60 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Toffee Nut Cookies",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "2 cups sifted all-purpose flour ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "1 cup chopped walnuts (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream together butter or margarine and brown sugar, packed Add 1 egg yolk, sifted flour, and vanilla. Batter will be stiff.\nSpread on a greased 13 x 9 inch cookie sheet. Bake at 375 degrees F (190 degrees C) for 12-15 minutes until golden brown.\nWhile still warm, add 1 cup semi-sweet chocolate chips to top of cookie until melted. Spread with knife until top is covered. Add chopped nuts, if desired. Let cool, then cut into squares.\n",
        "picture_link": "5nu07h7jQijYxUTM1g9v/OFRmxCyf3S"
    },
    {
        "title": "Marble Bars",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "1 cup light corn syrup ADVERTISEMENT",
            "1 cup peanut butter ADVERTISEMENT",
            "6 cups chocolate flavored crispy rice cereal ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a 3 quart saucepan, heat white sugar and corn syrup until bubbles form. Remove from heat, and stir in peanut butter.\nAdd chocolate flavored crispy rice cereal; stir to coat well. Gently stir in chocolate chips to give marble effect.\nPress into 9x13 inch pan and cool until firm. Cut into bars.\n",
        "picture_link": "uPYg6XhBijHyErOuCvfICyEorc7CfrK"
    },
    {
        "title": "O' Henry Slice",
        "ingredients": [
            "15 graham crackers ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 cup graham cracker crumbs ADVERTISEMENT",
            "1/2 cup flaked coconut ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup chopped cherries (optional) ADVERTISEMENT",
            "2 1/2 cups confectioners' sugar ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "3 tablespoons milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line a 9 x 9 inch pan with graham crackers.\nBoil together 1/2 cup butter or margarine, 1 cup brown sugar and scant 1/2 cup milk for two minutes.\nRemove from stove and stir in: graham cracker crumbs, coconut, chopped walnuts, and cherries. Pour on graham crackers in pan. Place a layer of graham crackers on top of filling. Spread with Butter Icing.\nTo Make Butter Icing: Combine icing sugar, 3 tablespoons butter or margarine and approximately 3 tablespoons of milk, or amount needed to give a spreading consistency.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    }
]