[
    {
        "title": "Jimmbo's Garlic Knots",
        "ingredients": [
            "1 (10 ounce) can refrigerated pizza crust dough ADVERTISEMENT",
            "1/3 cup olive oil ADVERTISEMENT",
            "6 tablespoons finely chopped fresh garlic ADVERTISEMENT",
            "5 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "3 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1 teaspoon crushed red pepper ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nRoll out pizza dough to form a 10x16 inch sheet of dough. Cut the sheet into 3/4 inch parallel strips. Then cut these strips in half making about 24 pieces. Tie each strip into a knot and place these knotted strips of dough close together in a greased pan.\nBake in preheated oven until golden brown. Remove the knots from the oven, place them in a big bowl. While the knots are still hot, drizzle them with olive oil. Sprinkle with garlic, cheese, parsley, red pepper and salt. Toss well and serve.\n",
        "picture_link": "CuU9SzCJeeB5em2.//b0CSeK8GHr556"
    },
    {
        "title": "King Ranch Chicken Casserole ",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 white onion, diced ADVERTISEMENT",
            "1 red bell pepper, diced ADVERTISEMENT",
            "1 green bell pepper, diced ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1 (10 ounce) can diced tomatoes with green chile peppers (such as RO*TEL®) ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "2 tablespoons sour cream ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "1 teaspoon ancho chile powder ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/4 teaspoon chipotle chile powder ADVERTISEMENT",
            "1 cooked chicken, torn into shreds or cut into chunks ADVERTISEMENT",
            "8 ounces shredded Cheddar cheese ADVERTISEMENT",
            "10 corn tortillas, cut into quarters ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nHeat oil in a large skillet over high heat. Saute onion, red bell pepper, and green bell pepper in hot oil until warmed through, about 2 minutes.\nCombine onion-pepper mixture, cream of mushroom soup, cream of chicken soup, diced tomatoes, chicken broth, sour cream, cumin, ancho chile powder, oregano, and chipotle chile powder together in a large bowl and stir until sauce is well-combined.\nSpread a few tablespoons of the sauce in the bottom of a 9x13-inch baking dish. Spread 1/2 the chicken over the sauce. Spread about half the sauce over the chicken and top with 1/3 the cheese. Spread a layer of tortillas over the cheese. Spread remaining 1/2 the chicken over the tortillas, and top with almost all of the remaining sauce, reserving 1/2 cup sauce. Top with 1/3 the cheese, remaining tortillas, the reserved 1/2 cup sauce, and remaining 1/3 cheese.\nBake casserole in the preheated oven until bubbling, about 40 minutes. Increase the oven temperature to broil. Broil the casserole until top is golden, 2 to 3 minutes more.\n",
        "picture_link": "0LWoLoXd7opp5zYlyHvvXidOYVLqGAC"
    },
    {
        "title": "Slow Cooker Chicken and Noodles",
        "ingredients": [
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "6 cups water ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 stalks celery, chopped (optional) ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 (12 ounce) package frozen egg noodles ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken, water, onion and salt and pepper to taste into a slow cooker. Add celery if desired. Set temperature to low and cook for 6 to 8 hours.\nWhen chicken is tender, remove from the slow cooker and tear or chop into bite-sized pieces. Set aside in a small casserole dish to keep warm. Turn the slow cooker up to high heat and stir in the frozen egg noodles. Cook until noodles are tender then return the chicken pieces to the broth. Adjust seasonings to taste.\n",
        "picture_link": "1kyS4poLRd8p3rYRg1AtBQpqP8YLv5S"
    },
    {
        "title": "Beefy Cheesy Pasta",
        "ingredients": [
            "1/2 pound lean ground beef ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "5 cups rotelle pasta ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "5 slices processed American cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet over medium heat, cook beef, onion, soy sauce and garlic until beef is brown and juices run clear.\nWhile beef is cooking, bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nReturn cooked pasta to its pot over low heat; stir in milk and butter. Stir in beef mixture until well combined. Stir in cheese slices, one at a time, until melted. Serve at once.\n",
        "picture_link": "OgVvO1cp.VSIeiDVqSQ2tHtdStZiUU2"
    },
    {
        "title": "Creamed Eggs on Toast",
        "ingredients": [
            "12 hard-cooked eggs, peeled ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "3 cups milk ADVERTISEMENT",
            "1 tablespoon chicken bouillon granules ADVERTISEMENT",
            "6 slices white bread, lightly toasted ADVERTISEMENT",
            "salt and white pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Separate the egg whites from the egg yolks. Place the egg yolks into a bowl and mash with a fork. Chop the egg whites into small pieces and set aside.\nMelt the butter in a saucepan set over medium heat. Stir in flour until smooth. Gradually mix in the milk and chicken bouillon so that no lumps form and stir constantly until the mixture comes to a boil. Add the egg yolks and mix until dissolved. Stir in egg whites. Serve over toast and season with salt and white pepper.\n",
        "picture_link": "7cWmEsDibBLLPgWgZvc2WK6lKlOda2W"
    },
    {
        "title": "Party Punch VI",
        "ingredients": [
            "1/2 gallon strawberry sherbet ADVERTISEMENT",
            "2 (64 fluid ounce) bottles fruit punch ADVERTISEMENT",
            "1 (2 liter) bottle lemon-lime flavored carbonated beverage, chilled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place sherbet in punch bowl. Pour in fruit punch and lemon-lime soda.\n",
        "picture_link": "/IJpJgUgRkpDqObBoyWsD985Klg8cvO"
    },
    {
        "title": "Tater Tots® Casserole",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 (32 ounce) package frozen bite-size potato nuggets (such as Tater Tots®), divided ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "2 teaspoons Worcestershire sauce ADVERTISEMENT",
            "2 teaspoons Montreal-style steak seasoning (optional) ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup grated Cheddar cheese ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1 cup grated Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Prepare a 13x9-inch casserole dish with cooking spray.\nSpread 20 potato nuggets in the casserole dish.\nBake in preheated oven until warmed through, about 10 minutes.\nHeat a large skillet over medium-high heat. Cook and stir beef and onion in the hot skillet until beef is completely browned, 5 to 7 minutes; drain and discard grease. Season beef mixture with 2 teaspoons Worcestershire sauce, steak seasoning, garlic powder, and black pepper.\nStir cream of mushroom soup, milk, 1/2 cup Cheddar cheese, and 1 teaspoon Worcestershire sauce together in a bowl.\nSmash the warmed potato nuggets in the casserole dish to cover the bottom completely. Spread ground beef mixture over the mashed potato nuggets. Pour soup mixture evenly over the beef layer. Top with remaining potato nuggets and sprinkle 1 cup Cheddar cheese evenly over the nuggets.\nBake in preheated oven until casserole is bubbly and potatoes golden brown, 30 to 40 minutes.\n",
        "picture_link": "mh9WlTQpLMj2KzDK5dRFuELcseqQw2O"
    },
    {
        "title": "Fried Egg Sandwich",
        "ingredients": [
            "2 teaspoons butter ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "4 slices processed American cheese ADVERTISEMENT",
            "8 slices toasted white bread ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 tablespoons mayonnaise ADVERTISEMENT",
            "2 tablespoons ketchup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet, melt butter over medium high heat. Crack eggs in pan and cook to desired firmness. Just before eggs are cooked, place a slice of cheese over each egg.\nAfter cheese has melted, place each egg on a toasted slice of bread. Season eggs with salt and pepper. Spread mayonnaise and ketchup on remaining slices of bread and cover eggs with bread to make 4 sandwiches. Serve warm.\n",
        "picture_link": "Hv7zYW3uZOfFRiOi6P/HzhjKCQSiyfe"
    },
    {
        "title": "Best Hot Crab Dip",
        "ingredients": [
            "2 cups crabmeat ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1 cup shredded Monterey Jack cheese ADVERTISEMENT",
            "1 cup white Cheddar cheese ADVERTISEMENT",
            "1/2 cup capers, drained ADVERTISEMENT",
            "2 (8 ounce) cans artichoke hearts, drained and chopped ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "1/2 teaspoon ground black pepper, or to taste ADVERTISEMENT",
            "1/2 teaspoon dried dill, or to taste ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1/2 teaspoon Old Bay Seasoning TM, or to taste ADVERTISEMENT",
            "1 (8 ounce) round loaf sourdough bread ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease an 8x8 inch square baking pan.\nIn a large bowl, combine crabmeat, sour cream, cream cheese, buttermilk, mayonnaise, Monterey Jack cheese, Cheddar cheese, capers, artichoke hearts, garlic, black pepper and dill. Stir until well mixed. Spoon dip into prepared baking pan. Sprinkle with Parmesan cheese and Old Bay Seasoning TM.\nBake in preheated oven until top is crusty, about 15 to 20 minutes.\nCut the top off the loaf of bread. Hollow out the loaf and cube the top and the removed pieces so that they may be used for dipping. Spoon hot dip into hollow bread loaf. Serve immediately with bread pieces for dipping.\n",
        "picture_link": "18GC.TN4rfaMgdKqCMSqPwxGE1SQlIe"
    },
    {
        "title": "Enchilada Casserole II",
        "ingredients": [
            "1 1/2 pounds lean ground beef ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "2 teaspoons chili powder ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "4 (10 inch) flour tortillas ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a deep dish pie plate; set aside.\nIn a large skillet over medium heat, brown the ground beef and onion until beef is no longer pink; drain fat. Return to the heat and push the meat and onion to the sides of the pan. Add the garlic to the center of the pan and cook briefly. Stir the beef and onion together with the garlic.\nStir in the tomato sauce, tomato paste, cumin, chili powder and salt to taste. Mix well and allow to thicken slightly.\nSpoon a thin layer of the beef mixture onto the bottom of the pie plate. Begin layering the tortilla, beef mixture, then cheese, ending with a final layer of cheese on the top.\nBake in the preheated oven for 30 minutes, or until cheese is melted and lightly browned.\n",
        "picture_link": "VCvGEVZhfYSVGtWffZM4US31Zcy9ucu"
    },
    {
        "title": "Rhubarb Cheesecake",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "3 cups chopped rhubarb ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). In a medium bowl, combine 1 cup flour, 1/4 cup sugar and 1/2 cup butter. Mix until crumbly and pat into the bottom of a 9 inch springform pan.\nIn a medium bowl, toss together the chopped rhubarb, 1/2 cup sugar and 1 tablespoon flour. Pour onto crust. Bake in preheated oven for 15 minutes. Remove from oven and set aside. Reduce oven temperature to 350 degrees F (175 degrees C).\nIn a large bowl, beat the cream cheese and 1/2 cup sugar until creamy. Beat in the eggs one at a time. Pour over hot rhubarb in the pan.\nBake in the preheated oven for 30 minutes, or until filling is set. Cover with sour cream topping while still hot.\nTo make the sour cream topping: In a small bowl, combine 1 cup sour cream, 2 tablespoons sugar and 1 teaspoon vanilla. Mix well and spread on top of cake.\n",
        "picture_link": "i9al3Ll7XntnuzdIJ6zF0usF8ThfIpa"
    },
    {
        "title": "Ruby Drive Sloppy Joes",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 1/2 cups ketchup ADVERTISEMENT",
            "1 cup chunky salsa ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "2 tablespoons white vinegar ADVERTISEMENT",
            "2 tablespoons Dijon mustard ADVERTISEMENT",
            "1 teaspoon hot sauce ADVERTISEMENT",
            "6 potato rolls ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium-high heat and stir in the ground beef. Cook and stir until the beef is crumbly, evenly browned, and no longer pink. Drain and discard any excess grease.\nStir in ketchup, salsa, brown sugar, Worcestershire sauce, white vinegar, Dijon mustard, and hot sauce. Bring to a simmer and cook, stirring occasionally, over low heat 20 to 30 minutes. Serve on potato rolls.\n",
        "picture_link": "9/TU15UPbdk5ikCmozsN1jm48NwlEme"
    },
    {
        "title": "Shrimp Burritos",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "3/4 cup long-grain white rice ADVERTISEMENT",
            "3/4 teaspoon cumin ADVERTISEMENT",
            "3/4 teaspoon garlic salt ADVERTISEMENT",
            "1 1/2 cups chicken broth ADVERTISEMENT",
            "1/2 cup canned diced tomatoes ADVERTISEMENT",
            "1 (16 ounce) can refried beans ADVERTISEMENT",
            "3/4 teaspoon garlic salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "12 ounces frozen cooked shrimp without tails, thawed ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "1/2 cup plain yogurt ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "2 teaspoons pureed chipotle peppers in adobo sauce ADVERTISEMENT",
            "6 (10 inch) flour tortillas, warmed ADVERTISEMENT",
            "3 cups shredded Cheddar cheese ADVERTISEMENT",
            "1/3 cup salsa ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the vegetable oil in a saucepan over medium heat. Add the onion, and cook until tender, stirring frequently. Stir in rice, and season with cumin and 3/4 teaspoon of garlic salt. Cook and stir until the rice is lightly toasted, about 5 minutes. Pour in the chicken broth and the diced tomatoes. Bring to a boil, then cover and cook over low heat for 15 to 20 minutes, until all of the liquid has been absorbed.\nIn a small saucepan, stir together the refried beans, 3/4 teaspoon of garlic salt, and black pepper. Cook over low heat, stirring occasionally until heated through.\nPlace shrimp in a bowl, and stir in garlic until shrimp is coated. Heat a skillet over medium-high heat, and coat with cooking spray. Saute shrimp until heated through and lightly browned.\nIn a small bowl, stir together the yogurt, mayonnaise, and chipotle peppers until smooth. Refrigerate until ready to use.\nPlace about 1/4 cup of cheese onto each warm tortilla. Then place about 1/2 cup of shrimp on the cheese. Top with 1/4 cup of beans, and 1/4 cup of rice. Spread on about a tablespoon of the chipotle sauce, and salsa to taste. Roll up, and serve.\n",
        "picture_link": "meXdB84vSSs/TG/nrHJh4hxowjkkEe."
    },
    {
        "title": "Pork Chops with Delicious Gravy",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "4 boneless pork chops ADVERTISEMENT",
            "seasoned pepper to taste ADVERTISEMENT",
            "seasoned salt to taste ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "3 tablespoons sour cream ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a large skillet over medium heat. Season the pork chops with seasoned salt and seasoned pepper, then dredge in 3 tablespoons of flour. Shake off any excess flour, and place the chops in the skillet. Cook for a few minutes on each side, until browned.\nIn a small bowl, stir together the sour cream, milk, 1 tablespoon of flour, lemon juice, and honey. Season with a tiny bit of seasoning salt if desired. Pour the sauce over the chops, and simmer for 10 to 15 minutes, until pork is cooked through.\n",
        "picture_link": "h/1wh0yQG4ZOxiNiSeiZlZG/1AO9e/6"
    },
    {
        "title": "Jalapeno Popper Wontons",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 (4 ounce) can diced jalapeno peppers ADVERTISEMENT",
            "20 (3.5 inch square) wonton wrappers ADVERTISEMENT",
            "1/2 cup sweet chili sauce ADVERTISEMENT",
            "oil for deep frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, stir together the cream cheese and jalapeno peppers. Arrange wonton wrappers a few at a time on a clean dry surface. Set a cup or small bowl of water nearby. Place about a teaspoon of the cream cheese mixture onto the center of each wrapper. Moisten your fingertip in the bowl of water and trace the edges of the wonton wrappers. Fold into triangles or follow directions on the package for desired shapes. This part can be done ahead of time and refrigerated or frozen.\nHeat the oil in a deep fryer to 375 degrees F (190 degrees C). When hot, fry the wontons a few at a time until golden brown, about 2 minutes. Drain on paper towels. Repeat with all of the wontons, then serve with the sweet chili sauce for dipping.\n",
        "picture_link": "mvct3vwjo8/osEQFsTh6.cAANyNnR4y"
    },
    {
        "title": "Stuffed Kielbasa",
        "ingredients": [
            "1 (16 ounce) package kielbasa ADVERTISEMENT",
            "1 (7.6 ounce) package roasted garlic flavored instant mashed potatoes ADVERTISEMENT",
            "1 1/2 cups sauerkraut ADVERTISEMENT",
            "1/2 cup shredded mozzarella cheese (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Bring a large pot of water to a boil. Add kielbasa and boil for 8 to 10 minutes to reduce the amount of fat; drain. Prepare mashed potatoes according to package instructions.\nCut kielbasa into 4 equal portions, then split each lengthwise so that they lay flat but are still attached. Layer each sausage with sauerkraut and mashed potatoes. Top with grated cheese.\nBake in preheated oven for 10 to 12 minutes, or until heated through and cheese is melted.\n",
        "picture_link": "LLZDhCRX0hBGMWxSjmCIvgAcoJ2S4s2"
    },
    {
        "title": "Day-After-Thanksgiving Turkey Carcass Soup",
        "ingredients": [
            "1 picked over turkey carcass ADVERTISEMENT",
            "1 1/2 cups leftover stuffing ADVERTISEMENT",
            "2 celery stalks, chopped ADVERTISEMENT",
            "2 carrots, peeled and sliced ADVERTISEMENT",
            "1 onion, peeled and diced ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "1 tablespoon poultry seasoning ADVERTISEMENT",
            "1 teaspoon ground sage ADVERTISEMENT",
            "2 1/2 quarts chicken broth ADVERTISEMENT",
            "garlic salt to taste ADVERTISEMENT",
            "ground black pepper, to taste ADVERTISEMENT",
            "2 cups (uncooked) regular long-grain white rice ADVERTISEMENT",
            "1 (16 ounce) package frozen green peas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the turkey carcass in a large, deep pot, and add the stuffing, celery, carrots, onion, bay leaves, poultry seasoning, sage, and chicken broth. Pour in additional water if needed to cover. Bring to a boil over medium-high heat; reduce heat to medium, and simmer for about 1 hour, skimming off any foam. Remove the carcass and any bones. Pick any meat off and return to the pot, discarding bones and skin.\nSeason to taste with garlic salt and pepper. Stir in the rice and return to a boil over medium-high heat. Lower heat to medium, and simmer 15 minutes. Stir in the peas, and continue to simmer until rice is tender, about 10 minutes more. Adjust seasonings to taste.\n",
        "picture_link": "EscaaoSTewkDXx7neDLyNqUppyn/eTi"
    },
    {
        "title": "Chicken or Turkey Tetrazzini",
        "ingredients": [
            "12 ounces spaghetti ADVERTISEMENT",
            "1 1/2 teaspoons vegetable oil ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/2 tablespoons butter ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed cream of mushroom soup ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1 teaspoon seasoning salt ADVERTISEMENT",
            "3 cups shredded American cheese ADVERTISEMENT",
            "4 cups cooked and cubed chicken ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "2 tablespoons diced red bell pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCook spaghetti according to package directions, add oil and salt to cooking water. Drain.\nIn large saucepan or Dutch oven over medium heat, melt butter. Add onion and garlic. Cook, stirring occasionally, 2 minutes. Add soup, broth, seasoned salt and 1 1/2 cups of the cheese. Cook and stir until cheese melts and mixture is smooth. Add spaghetti and chicken or turkey. Mix well. Transfer to 2-quart baking dish. Cover with foil.\nBake at 350 degrees F (175 degrees C) for 30 minutes or until hot and bubbly.\nRemove foil. Sprinkle with remaining 1 1/2 cups. cheese. Continue baking 2 minutes or until cheese melts. Sprinkle with parsley and bell pepper.\n",
        "picture_link": "wvEBNyLQrTv1lMzGdSAly3d72N3Oz2y"
    },
    {
        "title": "Cranberry, Sausage and Apple Stuffing",
        "ingredients": [
            "1 pound sweet Italian sausage, casings removed ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "6 cups coarsely chopped leeks ADVERTISEMENT",
            "3 tart apples - peeled, cored and chopped ADVERTISEMENT",
            "2 cups chopped celery ADVERTISEMENT",
            "4 teaspoons poultry seasoning ADVERTISEMENT",
            "2 teaspoons dried rosemary, crushed ADVERTISEMENT",
            "1 cup dried cranberries ADVERTISEMENT",
            "12 cups white bread cubes, baked until slightly dry ADVERTISEMENT",
            "1 1/3 cups chicken stock ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook and stir sausage in a large skillet over medium heat, crumbling coarsely, for about 10 minutes. Remove sausage to a large bowl with a slotted spoon. Empty pan of grease.\nInto the same pan melt the butter. Add the leeks or onions, apples, celery and poultry seasoning; cook until softened, about 10 minutes. Add the rosemary, dried cranberries and cooked sausage. Mix all with the dried bread cubes. Season to taste with salt and pepper. Moisten with the chicken stock.\nStuff turkey with about 5 cups for a 14 pound turkey. Add additional chicken stock to moisten stuffing if needed. Remaining stuffing can be baked in a covered buttered casserole at 350 degrees F (175 degrees C) for about 45 minutes. Uncover and bake for another 15 minutes to brown top.\n",
        "picture_link": "tVT8GLS7W9aMggCkzZAqqnYtsrcnogC"
    },
    {
        "title": "Simple 'N' Delicious Chocolate Cake",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "1 1/8 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup cold, strong, brewed coffee ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour an 8-inch pan (see Editor's Note). Sift together flour, cocoa, baking soda and salt. Set aside.\nIn a medium bowl, cream butter and sugar until light and fluffy. Add egg and vanilla and beat well. Add flour mixture, alternating with coffee. Beat until just incorporated.\nBake at 350 degrees F (175 degrees C) for 35 to 45 minutes, or until a toothpick inserted into the cake comes out clean. Allow to cool before frosting.\n",
        "picture_link": "LH3pkRrmNuxOx5oOHWsK3gussPqCCo."
    },
    {
        "title": "Blue Bacon Stuffed Mushrooms",
        "ingredients": [
            "3 strips bacon ADVERTISEMENT",
            "6 large mushrooms ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1/2 onion, diced ADVERTISEMENT",
            "1 clove garlic, sliced ADVERTISEMENT",
            "3 ounces cream cheese ADVERTISEMENT",
            "3 ounces blue cheese ADVERTISEMENT",
            "1/3 cup bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook bacon strips in a large skillet over medium heat until crispy; drain on paper towels. While the bacon is cooking, remove stems from mushrooms. Set caps aside, and chop stems.\nAdd butter to skillet with bacon grease. When melted, stir in mushroom stems, onion, and garlic. Cook, stirring frequently until the onions caramelize, 15 to 20 minutes.\nPreheat oven to 350 degrees F (175 degrees C). Spray a small baking dish with cooking spray.\nOnce the onion mixture has reached a deep, rich brown color, place into a blender along with bacon, cream cheese, blue cheese, and bread crumbs. Blend on low until ingredients are roughly chopped and evenly combined. Stuff cheese mixture into mushroom caps and place into prepared baking dish.\nBake in preheated oven until bubbly and lightly browned, 10 to 15 minutes.\n",
        "picture_link": "Yaz.lK8ZuGJEXT3zLuDoGRT5I53Jdrq"
    },
    {
        "title": "Crescent Pizza Pockets",
        "ingredients": [
            "1 (8 ounce) can Pillsbury® refrigerated crescent dinner rolls ADVERTISEMENT",
            "1/4 cup pizza sauce ADVERTISEMENT",
            "3/4 cup shredded mozzarella cheese ADVERTISEMENT",
            "1/2 cup sliced pepperoni ADVERTISEMENT",
            "1 teaspoon grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 375 degrees F. Unroll dough on cookie sheet and separate into 4 rectangles; press each into 6x4-inch rectangle, firmly pressing perforations to seal.\nSpread 1 tablespoon pizza sauce on half of each rectangle to within 1 inch of edge. Sprinkle each with 3 tablespoons cheese; top with 6 slices pepperoni. Fold dough diagonally over filling; firmly press edges with fork to seal. Sprinkle each triangle with 1/4 teaspoon grated cheese. With fork, prick top of each to allow steam to escape.\nBake 13 to 15 minutes or until deep golden brown. Serve warm.\n",
        "picture_link": "GbnmehevaMMIHP3MKzZSE5Yha95Si8O"
    },
    {
        "title": "Creamy Chicken",
        "ingredients": [
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nClean chicken breasts and season with salt, pepper and garlic powder (or whichever seasonings you prefer) on both sides of chicken pieces.\nBake for 25 minutes, then add cream of chicken soup and bake for 10 more minutes (or until done). Serve over rice or egg noodles.\n",
        "picture_link": "iZrxLkXPVN6GSE9EKc.zRwOrbSsrNVW"
    },
    {
        "title": "Chinese Spicy Hot And Sour Soup",
        "ingredients": [
            "5 dried wood ear mushrooms ADVERTISEMENT",
            "4 dried shiitake mushrooms ADVERTISEMENT",
            "8 dried tiger lily buds ADVERTISEMENT",
            "4 cups chicken stock ADVERTISEMENT",
            "1/3 cup diced bamboo shoots ADVERTISEMENT",
            "1/3 cup lean ground pork ADVERTISEMENT",
            "1 teaspoon soy sauce ADVERTISEMENT",
            "1/2 teaspoon white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground white pepper ADVERTISEMENT",
            "2 tablespoons red wine vinegar ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "3 tablespoons water ADVERTISEMENT",
            "1/2 (16 ounce) package firm tofu, cubed ADVERTISEMENT",
            "1 egg, lightly beaten ADVERTISEMENT",
            "1 teaspoon sesame oil ADVERTISEMENT",
            "2 tablespoons thinly sliced green onion ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Soak the dried mushrooms and tiger lily buds in warm water for 20 minutes. After trimming off any tough stems, slice the mushrooms. With the fingers, shred the tiger lily stems.\nPlace the mushrooms, tiger lily buds, stock, bamboo shoots, and shredded pork into a saucepan. Bring to a boil, and simmer for 10 minutes.\nStir in soy sauce, sugar, salt, white pepper, and vinegar. Combine cornstarch with 3 tablespoons water. Add a little of the hot soup to the cornstarch, and then return all to the pan. Heat to boiling, stirring. Add the bean curd, and cook 1 to 2 minutes.\nJust before serving, turn off the heat. Stir the egg in gradually. Mix in sesame oil. Sprinkle each serving with scallions.\n",
        "picture_link": "wpmfkZFJTTqPLDp3lsioMTkwCaUI1b."
    },
    {
        "title": "Almond Shortbread I",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 teaspoons almond extract ADVERTISEMENT",
            "2 1/2 cups sifted all-purpose flour ADVERTISEMENT",
            "1/3 cup granulated sugar for decoration ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, beat butter with 1/2 cup sugar and almond extract until light and fluffy. With wooden spoon, stir in flour until smooth and well combined. Divide dough into 2 parts. Refrigerate, covered for 2 hours.\nPreheat oven 300 degrees F (150 degrees C).\nOn lightly sugared surface, roll out dough, one part at a time, about 1/2 inch thick. Using a 1 1/2 inch round cookie cutter, cut out cookies. Place 1 inch apart, on ungreased cookie sheet. With end of wooden spoon, or cookie press, make an indentation in center of each cookie.\nBake 25 to 30 minutes, or until light golden brown around the edges. While still warm, roll in sugar. Cool completely on a wire rack.\n",
        "picture_link": "otaSja7Vg2UpIiLEdPT0YGJZ1xzKy.S"
    },
    {
        "title": "Key Lime Cake II",
        "ingredients": [
            "1 (18.25 ounce) package lemon cake mix ADVERTISEMENT",
            "1 (3 ounce) package instant lemon pudding mix ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "5 tablespoons key lime juice ADVERTISEMENT",
            "1 1/2 cups confectioners' sugar ADVERTISEMENT",
            "3 tablespoons key lime juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease one 9x13 inch cake pan or one 10 inch bundt pan.\nIn a large bowl stir together; lemon cake mix, lemon instant pudding, water, oil, eggs, and 5 tablespoons key lime juice, mixing well. Pour batter into prepared pan.\nBake at 350 degrees F (175 degrees C) for 45 minutes. Pour key lime glaze over cake while still warm.\nTo Make Glaze: Mix together the confectioner's sugar and 3 tablespoons of the key lime juice (or more if necessary), spoon glaze over warm cake.\n",
        "picture_link": "69VDbVCzLI1Z0xczNUOldBzCFOxnl2m"
    },
    {
        "title": "Authentic, No Shortcuts, Louisiana Red Beans and Rice",
        "ingredients": [
            "1 pound dried red beans, soaked overnight ADVERTISEMENT",
            "10 cups water ADVERTISEMENT",
            "1 pound andouille sausage, sliced into rounds ADVERTISEMENT",
            "1 large sweet onion, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 jalapeno pepper, seeded and chopped (optional) ADVERTISEMENT",
            "8 cloves garlic, chopped ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon Creole seasoning, or to taste ADVERTISEMENT",
            "6 fresh basil leaves, chopped ADVERTISEMENT",
            "1 ham hock ADVERTISEMENT",
            "4 cups cooked rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the beans and water into a slow cooker. Heat a skillet over medium-high heat. Brown the sausage in the skillet; remove from the skillet with a slotted spoon and transfer to the slow cooker. Reserve drippings. Add onion, green pepper, jalapeno pepper and garlic to the drippings; cook and stir until tender, about 5 minutes. Transfer everything from the skillet to the slow cooker.\nSeason the mixture with pepper and Creole seasoning. Add the fresh basil leaves and ham hock. Cover and cook on low for about 8 hours, or until beans are tender. If the bean mixture seems too watery, take the lid off the slow cooker and set heat to High to cook until they reach a creamy texture.\n",
        "picture_link": "eDSg8T1qnif1.qUH0dNjMc7oN7tan4u"
    },
    {
        "title": "Farm Macaroons",
        "ingredients": [
            "4 egg whites ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 teaspoon almond extract ADVERTISEMENT",
            "1/8 teaspoon cream of tartar ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 1/2 cups flaked coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C). Grease and flour cookie sheet.\nIn a medium bowl, beat egg whites, vanilla extract, almond extract, and cream of tartar until soft peaks form. Gradually beat in sugar, and whip until stiff. Toss together flour, salt, and coconut in a separate bowl; fold into egg whites. Drop by heaping tablespoonfuls onto the prepared cookie sheet.\nBake 18 to 20 minutes in the preheated oven, or until slightly golden. Allow cookies to cool on the baking sheet for easy removal.\n",
        "picture_link": "T9YiclKsWfut1Pqw.aKRlwP2oqKr4uG"
    },
    {
        "title": "Oven Pancakes",
        "ingredients": [
            "3 tablespoons white sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/3 cup butter ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 tablespoon confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). In a small bowl, mix together white sugar and cinnamon; set aside.\nPlace butter in a 9 inch cake pan and heat in the oven until melted. In a blender or food processor, whip eggs and milk. Pour in flour and beat until well combined. Pour batter into hot pan. Sprinkle on sugar and cinnamon.\nBake in preheated oven for 20 to 25 minutes, or until puffed and golden. Dust with confectioners' sugar; serve warm.\n",
        "picture_link": "0IP4aurOCqWl8QR1yAaKHd0Oy3VfRkS"
    },
    {
        "title": "Sauceless Garden Lasagna",
        "ingredients": [
            "1 medium zucchini, halved lengthwise and sliced ADVERTISEMENT",
            "1/3 cup chopped red onion ADVERTISEMENT",
            "1 cup shredded mozzarella cheese, divided ADVERTISEMENT",
            "1/2 cup crumbled feta cheese ADVERTISEMENT",
            "2 portobello mushrooms, sliced ADVERTISEMENT",
            "4 cups fresh baby spinach ADVERTISEMENT",
            "1/4 cup chopped fresh basil ADVERTISEMENT",
            "1 tablespoon chopped fresh oregano ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1/4 cup balsamic vinegar ADVERTISEMENT",
            "1 teaspoon sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1 (8 ounce) package no-boil lasagna noodles ADVERTISEMENT",
            "9 roma (plum) tomatoes, thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Lightly coat a 9x9 inch baking dish with cooking spray.\nIn a large bowl, toss together the zucchini, mushrooms, spinach, garlic, red onion, 1/2 cup mozzarella cheese, and feta cheese. Drizzle with olive oil and balsamic vinegar, and stir in basil, oregano, sugar, salt and pepper. Stir the mixture until evenly blended.\nPlace a layer of lasagna noodles into the bottom of the prepared pan. Make a layer of tomato slices over the noodles. Spread a generous amount of the spinach mixture over the tomatoes. Don't worry, it shrinks a lot while cooking. Lay slices of tomatoes over the spinach mixture, then another layer of noodles. Start with another layer of tomatoes on top of the noodles, and repeat layering until the dish is heaped with lasagna, ending with the vegetable mixture. Sprinkle remaining cheese on the top.\nBake for 35 to 45 minutes in the preheated oven, until noodles, and vegetables are tender. Let stand for a few minutes to set, then slice and serve.\n",
        "picture_link": "FDWaf8bdcLrYyrWPbiKnObLDHLHVUYq"
    },
    {
        "title": "Calamari",
        "ingredients": [
            "3 cups vegetable oil ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "12 squid, cleaned and sliced into rings ADVERTISEMENT",
            "1 lemon - cut into wedges, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oil in a heavy, deep frying pan or pot. Oil should be heated to 365 degrees F (180 degrees C).\nIn a medium size mixing bowl mix together flour, salt, oregano and black pepper. Dredge squid through flour and spice mixture.\nPlace squid in oil for 2 to 3 minutes or until light brown. Beware of overcooking, squid will be tough if overcooked. Dry squid on paper towels. Serve with wedges of lemon.\n",
        "picture_link": "cTHgnBpkWZ2y8XMl0UNz5DvdVIqXmjy"
    },
    {
        "title": "Country Sausage Gravy",
        "ingredients": [
            "1 pound pork sausage ADVERTISEMENT",
            "1 onion, finely chopped ADVERTISEMENT",
            "1 green bell pepper, finely chopped ADVERTISEMENT",
            "1 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "2 tablespoons garlic, minced ADVERTISEMENT",
            "4 tablespoons unsalted butter ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "4 tablespoons all-purpose flour ADVERTISEMENT",
            "1 teaspoon minced fresh sage ADVERTISEMENT",
            "1 teaspoon minced fresh thyme ADVERTISEMENT",
            "2 cups milk, divided ADVERTISEMENT",
            "2 cubes chicken bouillon ADVERTISEMENT",
            "1/4 cup minced fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a skillet on medium heat cook pork, onion, green pepper, red pepper flakes, and garlic until pork is crumbly. Drain off excess fat, but leave a small amount.\nCombine butter, salt, and pepper with the meat mixture and stir until butter melts. Slowly sift flour over the top. Mix gently and allow mixture to cook for 5 minutes. It will burn, so do not let it sit unguarded. Don't forget to scrape the bottom of the pan. Add the sage and thyme.\nSlowly stir in milk, about a half a cup at a time, and incorporate it well. When the mixture thickens, add more milk. Do not let it boil vigorously, or it will burn. Add chicken bullion and let cook for five minutes. Again, if it thickens too much, add more milk. Adjust taste with more salt and pepper if needed.\nJust before serving, add the parsley, and about a 1/4 cup more milk; the gravy will thicken quickly as it cools.\n",
        "picture_link": "0UfNXfoxBKoL70quAi/.c5JsYgxlb0W"
    },
    {
        "title": "Dill, Feta and Garlic Cream Cheese Spread",
        "ingredients": [
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1 (8 ounce) package feta cheese, crumbled ADVERTISEMENT",
            "3 cloves garlic, peeled and minced ADVERTISEMENT",
            "2 tablespoons chopped fresh dill ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, thoroughly blend cream cheese, feta cheese, garlic, and dill with an electric mixer. Cover, and refrigerate at least 4 hours.\n",
        "picture_link": "ky60Vc.O5wkOYti/ZpqoPFDRBjIDU42"
    },
    {
        "title": "Chicken Spaghetti III",
        "ingredients": [
            "1 (16 ounce) package spaghetti ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "3/4 pound processed cheese ADVERTISEMENT",
            "1 (10 ounce) can diced tomatoes with green chile peppers ADVERTISEMENT",
            "1 cup chopped green onion ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves - boiled, cut into bite size pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nHeat soup in a large saucepan over low heat. Add cheese and melt, stirring. When cheese is almost melted, stir in tomatoes with green chile peppers and green onion. Simmer over low heat for 2 to 3 minutes, stirring.\nAdd spaghetti and mix well, then stir in chicken. Heat through and serve.\n",
        "picture_link": "yMFGFMOwTcLsabjmxqv0xG.NkYUUEuG"
    },
    {
        "title": "Fudgy Chocolate Chip Muffins",
        "ingredients": [
            "1/2 cup applesauce ADVERTISEMENT",
            "1/4 cup margarine, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup light brown sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon (optional) ADVERTISEMENT",
            "1 cup semi-sweet chocolate chips ADVERTISEMENT",
            "2 tablespoons confectioners' sugar (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line muffin cups (2-1/2 inches in diameter) with paper bake cups.\nIn large mixer bowl, beat butter, sugar, brown sugar, egg, and vanilla until well blended. Add applesauce, blend well.\nIn a separate bowl, stir together flour, cocoa, baking soda, and cinnamon, if desired. Add to butter mixture, blending well. Stir in chocolate chips. Fill muffin cups 3/4 full with batter.\nBake at 350 degrees F (175 degrees C) for 22 to 26 minutes or until wooden pick inserted in center comes out almost clean. Cool slightly in pan on wire rack. Sprinkle muffin tops with confectioners' sugar, if desired. Serve warm.\n",
        "picture_link": "A9C4XTTIinCHQ7a2HzI9.abkmkB4aDG"
    },
    {
        "title": "Beefy Spanish Rice ",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 cup uncooked converted white rice ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1/2 cup chopped green bell pepper ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 cup canned corn ADVERTISEMENT",
            "1 (6 ounce) can tomato sauce ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "garlic powder to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan over medium heat, heat the oil. Add the rice, onion and bell pepper and saute for 5 minutes, or until onions are tender. Add the ground beef and saute until browned. Drain excess oil and fat.\nAdd the corn, tomato sauce, ketchup and water. Reduce heat to low, cover and simmer for 20 minutes or until rice is cooked, stirring occasionally. Season with salt, pepper and garlic powder to taste.\n",
        "picture_link": "NegxUP9T1t4NYJAhLLabYUG0zCbjbGa"
    },
    {
        "title": "Allison's Pasta Salad",
        "ingredients": [
            "1 3/4 cups farfalle pasta ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "2 tablespoons cider vinegar ADVERTISEMENT",
            "1 1/2 tablespoons prepared Dijon-style mustard ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon dried dill weed ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 cups seedless green grapes, halved ADVERTISEMENT",
            "2 cups diced ham ADVERTISEMENT",
            "1/2 cup chopped green onions ADVERTISEMENT",
            "1 1/2 cups diced sharp Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook pasta in a large pot of boiling water until al dente. Drain, and rinse in cold water.\nIn a small bowl, mix together mayonnaise, sour cream, cider vinegar, mustard, sugar, black pepper, dill weed, and salt.\nIn a large bowl, combine pasta, grapes, ham, green onions, and cheese. Toss with dressing. Cover, and chill overnight or for at least 6 hours.\n",
        "picture_link": "1DxRrfFjHPxt0FK7D.jeRpiJ/pxZeya"
    },
    {
        "title": "Fresh Tomato Marinara Sauce",
        "ingredients": [
            "3 tablespoons olive oil ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "8 large tomatoes, peeled and cut into big chunks ADVERTISEMENT",
            "6 cloves garlic, minced ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1/2 cup red wine ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "2 teaspoons dried basil ADVERTISEMENT",
            "1 teaspoon oregano ADVERTISEMENT",
            "1 teaspoon dried marjoram ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon fennel seed ADVERTISEMENT",
            "1/4 teaspoon crushed red pepper ADVERTISEMENT",
            "2 teaspoons balsamic vinegar, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a stockpot over medium heat. Cook and stir onion in hot oil until softened, about 5 minutes; add tomatoes, garlic, and bay leaf. Bring the liquid from the tomatoes to a boil, reduce to medium-low, and simmer mixture until tomatoes are softened, about 30 minutes.\nStir red wine, honey, basil, oregano, marjoram, salt, black pepper, fennel seed, and crushed red pepper into the tomato mixture; bring again to a simmer and cook until herbs have flavored the sauce, about 30 minutes more.\nStir balsamic vinegar into the sauce.\n",
        "picture_link": "iDXm2SU0guSud9t6BvP4ZKVQX3T5fDq"
    },
    {
        "title": "Easy Ham and Noodles",
        "ingredients": [
            "2 cups cooked egg noodles ADVERTISEMENT",
            "1 cup cubed, cooked ham ADVERTISEMENT",
            "1/2 cup cubed Cheddar cheese ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1/2 (10.75 ounce) can milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nPlace the noodles, ham, cheese, soup and milk in a 9x9 inch casserole dish and mix well.\nBake at 375 degrees F (190 degrees C) for 25 to 30 minutes.\n",
        "picture_link": "UwKfi2WH4GtUkwsuAyusGUZpJiVqw5S"
    },
    {
        "title": "Cheesy Quinoa Pilaf with Spinach",
        "ingredients": [
            "1/4 cup quinoa ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "2 tablespoons raw sunflower seeds ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup fresh spinach leaves ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "1/3 cup grated goat gouda cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a pot of lightly salted water to a boil over high heat. Add the quinoa, and cook until the quinoa is tender, 15 to 20 minutes. Drain in a mesh strainer, and rinse until cold; set aside.\nHeat the olive oil in a skillet over medium heat, stir in the sunflower seeds, and cook until lightly toasted, about 2 minutes. Stir in the garlic, and cook until the garlic softens and the aroma mellows, about 2 minutes. Stir in the cooled quinoa and spinach; cook and stir until the quinoa is hot, and the spinach has wilted. Stir in the lemon juice, and all but a pinch of the cheese. Stir until the cheese has melted. Serve sprinkled with the remaining cheese.\n",
        "picture_link": "v87IpCk.tDF.dlrBn0Z2Nu1nmkRCacC"
    },
    {
        "title": "Green Chile Spinach Quiche",
        "ingredients": [
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "12 eggs ADVERTISEMENT",
            "1 (8 ounce) package shredded Colby-Monterey Jack cheese ADVERTISEMENT",
            "2 cups small curd cottage cheese ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped spinach, thawed and drained ADVERTISEMENT",
            "2 (4 ounce) cans chopped green chilies ADVERTISEMENT",
            "1/2 cup melted butter ADVERTISEMENT",
            "2 (9 inch) unbaked pie crusts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 400 degrees F (200 degrees C). Whisk the flour, baking powder, and salt together in a small bowl; set aside.\nBeat the eggs in a mixing bowl until smooth. Whisk in the flour mixture until no lumps remain. Stir in the Colby-Monterey Jack cheese, cottage cheese, spinach, green chiles, and melted butter until evenly blended. Divide the mixture between the pie crusts.\nBake the quiches in the preheated oven for 15 minutes at 400 degrees F (200 degrees C), then reduce the temperature to 350 degrees F (175 degrees C). Continue baking until the quiches are lightly browned and a knife inserted into the center comes out clean, 35 to 40 minutes.\n",
        "picture_link": "2pxxx6Y5fncAzJND.gK9OG.oR2TxYxu"
    },
    {
        "title": "No Fail Pie Crust I",
        "ingredients": [
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 cup shortening ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup cold water ADVERTISEMENT",
            "1 tablespoon distilled white vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine flour and salt. Cut in shortening until it resembles coarse crumbs.\nMix egg, water and vinegar together. Pour into flour all at once and blend with a fork until dough forms a ball.\nWrap with plastic and chill in refrigerator.\n",
        "picture_link": "Co11IW/jVNVT4Q7HAaOyI.St4uueIEm"
    },
    {
        "title": "Albino Pasta",
        "ingredients": [
            "1 (16 ounce) package dry penne pasta ADVERTISEMENT",
            "4 tablespoons olive oil ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1/3 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add penne pasta and cook for 8 to 10 minutes or until al dente; drain.\nIn small saucepan, saute garlic a small amount of oil. Combine garlic, olive oil, and pasta in a bowl. Mix in parmesan cheese.\n",
        "picture_link": "EkL02/99Re5e1eFHvolRM8Wtumwfv4u"
    },
    {
        "title": "Kalamata Olive Tapenade",
        "ingredients": [
            "3 cloves garlic, peeled ADVERTISEMENT",
            "1 cup pitted kalamata olives ADVERTISEMENT",
            "2 tablespoons capers ADVERTISEMENT",
            "3 tablespoons chopped fresh parsley ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the garlic cloves into a blender or food processor; pulse to mince. Add the olives, capers, parsley, lemon juice, and olive oil Blend until everything is finely chopped. Season to taste with salt and pepper.\n",
        "picture_link": "j/fstBiZBY.quHQUOiixqUKh2zsHcm2"
    },
    {
        "title": "Fragrant Chicken Curry",
        "ingredients": [
            "2 tablespoons curry powder ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 large onion, halved and thinly sliced ADVERTISEMENT",
            "3 garlic cloves, minced ADVERTISEMENT",
            "1 rotisserie chicken, skinned and boned, meat pulled into large chunks ADVERTISEMENT",
            "1 (13.5 ounce) can light coconut milk ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "1 (14.5 ounce) can chicken broth ADVERTISEMENT",
            "To serve: ADVERTISEMENT",
            "Cooked basmati rice ADVERTISEMENT",
            "chopped fresh cilantro ADVERTISEMENT",
            "mango chutney ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix spices in small bowl. Heat oil in a Dutch oven or small soup kettle over medium-high heat; add onion and saute until golden, 8 to 10 minutes.\nAdd garlic; saute until fragrant, about 30 seconds. Add spices; toast until fragrant, 30 seconds to 1 minute. Add chicken; stir until completely coated with spices. Add coconut milk, tomatoes and broth. Bring to a simmer; cook uncovered until flavors blend and stew is thick, about 20 minutes.\nRemove from heat, sprinkle with cilantro and serve over rice. Pass chutney separately.\n",
        "picture_link": "Bbpss8RMr7Y78ypJtGTLyRdzWgkZbBC"
    },
    {
        "title": "Stuffed Eggplant with Shrimp and Basil",
        "ingredients": [
            "1 eggplant, halved lengthwise ADVERTISEMENT",
            "1/2 cup olive oil, divided ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "8 medium shrimp - peeled, deveined and chopped ADVERTISEMENT",
            "1/8 cup chopped fresh basil ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "1 cup Italian seasoned bread crumbs ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Scoop out the flesh of the eggplant, chop, and reserve. Coat shells with olive oil, and season with salt and pepper; set aside.\nHeat 1/4 cup olive oil in a large, deep skillet over medium high heat. Saute shrimp, basil and garlic until shrimp turns pink, about 1 minute. Stir in the reserved chopped eggplant. Season with salt and pepper. Pour in wine, and cook 5 minutes.\nTransfer to a large bowl, and mix in the bread crumbs and 1/4 cup Parmesan cheese. If mixture is dry, stir in more olive oil. Stuff mixture into eggplant shells, and sprinkle top with remaining Parmesan cheese.\nBake in preheated oven for 30 to 40 minutes, or until eggplant is tender.\n",
        "picture_link": "VxbOu/SghZHeOj/5bAcCTb8tkY3MYyK"
    },
    {
        "title": "Chicken Kabobs Mexicana",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 skinless, boneless chicken breast halves - cut into 1 inch cubes ADVERTISEMENT",
            "1 small zucchini, cut into 1/2-inch slices ADVERTISEMENT",
            "1 onion, cut into wedges and separated ADVERTISEMENT",
            "1 red bell pepper, cut into 1 inch pieces ADVERTISEMENT",
            "10 cherry tomatoes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a shallow dish, mix together olive oil, cumin, chopped cilantro, and lime juice. Season with salt and pepper. Add chicken, and mix well. Cover, and refrigerate for at least one hour.\nPreheat grill for high heat.\nThread chicken, zucchini, onion, red bell pepper, and tomatoes onto skewers.\nBrush grill with oil, and arrange skewers on hot grate. Cook for approximately 10 minutes, or until chicken is cooked through, turning to cook evenly.\n",
        "picture_link": "2VccBZC29W/uCcHZnOXLSWlXMuKaJ06"
    },
    {
        "title": "Extra Easy Fudge",
        "ingredients": [
            "2 cups milk chocolate chips ADVERTISEMENT",
            "2 1/2 cups prepared chocolate frosting ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line one 8x8 inch square pan with foil. Lightly butter the foil.\nIn a small saucepan melt the chocolate chips over low heat, stirring constantly. Remove the melted chocolate from the heat and stir in the frosting and the nuts stirring until smooth. Pour into the prepared pan and refrigerate until firm. Once firm cut in small squares.\n",
        "picture_link": "XVF4ErTpiA7sI5kviqvgkZWanO8678m"
    },
    {
        "title": "Best Damn Chili",
        "ingredients": [
            "4 tablespoons olive oil ADVERTISEMENT",
            "1 yellow onion, chopped ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "1 Anaheim chile pepper, chopped ADVERTISEMENT",
            "2 red jalapeno pepper, chopped ADVERTISEMENT",
            "4 garlic cloves, minced ADVERTISEMENT",
            "2 1/2 pounds lean ground beef ADVERTISEMENT",
            "1/4 cup Worcestershire sauce ADVERTISEMENT",
            "1 pinch garlic powder, or to taste ADVERTISEMENT",
            "2 beef bouillon cubes ADVERTISEMENT",
            "1 (12 fluid ounce) can or bottle light beer (such as Coors®) ADVERTISEMENT",
            "1 (28 ounce) can crushed San Marzano tomatoes ADVERTISEMENT",
            "1 (14.5 ounce) can fire-roasted diced tomatoes ADVERTISEMENT",
            "1 (12 ounce) can tomato paste ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "2 tablespoons chili powder ADVERTISEMENT",
            "2 tablespoons ground cumin ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1 tablespoon chipotle pepper sauce ADVERTISEMENT",
            "2 1/2 teaspoons dried basil ADVERTISEMENT",
            "1 1/2 teaspoons smoked paprika ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "2 (16 ounce) cans dark red kidney beans (such as Bush's®) ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "3 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large pot over medium heat; cook and stir onion, bell pepper, Anaheim pepper, jalapeno peppers, and garlic in the hot oil until softened.\nMeanwhile, heat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; add Worcestershire sauce and garlic powder. Crumble bouillon cubes over beef and add beer. Continue to cook , scraping any browned bits from the bottom of the skillet, until liquid is hot, about 3 minutes. Stir beef mixture into pepper mixture.\nStir crushed tomatoes, diced tomatoes, tomato paste, and wine to the beef mixture. Season with chili powder, 2 tablespoons cumin, brown sugar, pepper sauce, basil, paprika, salt, oregano, and black pepper. Bring to a boil and reduce heat to medium-low. Cover and simmer until meat and vegetables are very tender and flavors have developed in the chili, about 90 minutes, stirring occasionally.\nMix kidney beans into beef and vegetables. Continue to simmer until beans are hot, about 30 minutes more.\nBlend sour cream, cilantro, and remaining 1/2 teaspoon cumin in a food processor until smooth. Serve sour cream mixture with chili.\n",
        "picture_link": "xts517pJaOdTDfU6ZTdQ4SK869Iu2FK"
    },
    {
        "title": "Maryland Crab Cakes I",
        "ingredients": [
            "1 pound crabmeat ADVERTISEMENT",
            "2 slices white bread, crusts trimmed ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 tablespoon mayonnaise ADVERTISEMENT",
            "1 teaspoon Dijon-style prepared mustard ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon Old Bay Seasoning TM ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pick the crab meat to remove any remaining pieces of shell.\nPick bread into small pieces and place in medium-size bowl with crabmeat. Add egg, mayonnaise, mustard, Worcestershire sauce, and Old Bay seasoning (tm). Mix ingredients by hand to avoid overworking the crabmeat, you want to keep the lumps of meat as much as possible. Form into patties; this should make 6 good-size cakes.\nHeat 2 tablespoons of butter in a skillet, then fry cakes for about 4 minutes each side or until brown crust forms on both sides of the crab cake.\n",
        "picture_link": "Lo1ccBVGjH6npugaynZmkoQ07zcwFHG"
    },
    {
        "title": "Marble Cake I",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "2 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9 inch round pan.\nPlace flour, baking powder, salt, sugar, butter or margarine, eggs, vanilla, and milk into mixing bowl. Beat slowly to moisten, then beat with an electric mixer at medium speed for about 2 minutes until smooth. Reserve 3/4 cup batter; pour the remainder into pan.\nStir cocoa into the 3/4 cup reserved batter. Drop by spoonfuls over top of white batter. Using a knife, swirl the cocoa batter into the white batter to incorporate it in a marble effect.\nBake in preheated oven for 30 to 35 minutes, until an inserted wooden pick comes out clean.\n",
        "picture_link": "7cnv7Xqz0QgRVpeMGm/6clnXgM9K8dm"
    },
    {
        "title": "Grilled Pineapple",
        "ingredients": [
            "1 fresh pineapple - peeled, cored and cut into 1 inch rings ADVERTISEMENT",
            "1/4 teaspoon honey ADVERTISEMENT",
            "3 tablespoons melted butter ADVERTISEMENT",
            "1 dash hot pepper sauce ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place pineapple in a large resealable plastic bag. Add honey, butter, hot pepper sauce, and salt. Seal bag, and shake to coat evenly. Marinate for at least 30 minutes, or preferably overnight.\nPreheat an outdoor grill for high heat, and lightly oil grate.\nGrill pineapple for 2 to 3 minutes per side, or until heated through and grill marks appear.\n",
        "picture_link": "ume0L.KOAxFtGP2/xIQ/87fQELofjda"
    },
    {
        "title": "The Original Treats™",
        "ingredients": [
            "3 tablespoons margarine or butter ADVERTISEMENT",
            "1 (10 ounce) package regular marshmallows ADVERTISEMENT",
            "6 cups Kellogg's® Rice Krispies® cereal ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In large saucepan melt margarine over low heat. Add marshmallows and stir until completely melted. Remove from heat.\nAdd KELLOGG'S RICE KRISPIES cereal. Stir until well coated.\nUsing buttered spatula or wax paper, press mixture evenly into 13 x 9 x 2-inch pan coated with cooking spray. Cool. Cut into 2-inch squares. Best if served the same day.\n",
        "picture_link": "Il4TyXUfoqwO/5ihEZcjPa3l08JC4gG"
    },
    {
        "title": "Chicken Avocado Pizza",
        "ingredients": [
            "2 avocados - peeled, pitted and diced ADVERTISEMENT",
            "1 tablespoon chopped fresh cilantro ADVERTISEMENT",
            "1 tablespoon fresh lime juice, or to taste ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 clove garlic, peeled ADVERTISEMENT",
            "4 (7 inch) pre-baked pizza crusts ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 cup chopped cooked chicken breast meat ADVERTISEMENT",
            "1 cup cherry tomatoes, quartered ADVERTISEMENT",
            "1 cup shredded Monterey Jack cheese ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat your oven's broiler. If you have a pizza stone, place it in the oven while it preheats.\nIn a food processor, combine the avocados and cilantro. Puree while adding lime juice and salt to taste. Cover, and set aside.\nSlice the garlic clove in half, and rub the cut side onto the tops of the pizza crusts for flavor. Brush both sides of the crusts with olive oil. Spread the avocado mixture thickly over the top of each crust, then arrange chicken and tomatoes on top. Sprinkle with cheese, and season lightly with cayenne pepper. Place pizzas on a baking sheet if you do not have a pizza stone.\nBroil for about 5 minutes in the preheated oven, or until the cheese has just melted and the crust is lightly toasted.\n",
        "picture_link": "flVRq7dYjL6RKF3TzEyl8SWUQL9nlQ."
    },
    {
        "title": "Grilled Salmon with Habanero-Lime Butter",
        "ingredients": [
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "3 tablespoons lime juice ADVERTISEMENT",
            "1 tablespoon tequila ADVERTISEMENT",
            "1 tablespoon grated lime zest ADVERTISEMENT",
            "1 tablespoon minced habanero pepper ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "4 (5 ounce) salmon steaks ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "1/4 teaspoon garlic salt ADVERTISEMENT",
            "1 tablespoon lime juice ADVERTISEMENT",
            "2 teaspoons minced habanero pepper ADVERTISEMENT",
            "2 teaspoons grated lime zest ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a bowl, stir together vegetable oil, orange juice, 3 tablespoons lime juice, tequila, 1 tablespoon lime zest, 1 tablespoon habanero pepper, and garlic. Reserve a small amount to use as a basting sauce, and pour the remainder into a shallow baking dish. Place the salmon in the shallow dish, and turn to coat. Cover, and refrigerate for 2 to 4 hours, turning frequently.\nIn a small bowl, mix together softened butter, garlic salt, 1 tablespoon lime juice, 2 teaspoons habanero pepper, and 2 teaspoons lime zest. Cover, and refrigerate.\nPreheat grill for medium heat.\nLightly oil grill grate, and place salmon on the grill. Cook salmon for 5 to 8 minutes per side, or until the fish can be easily flaked with a fork. Transfer to a serving dish, top with habanero butter, and serve.\n",
        "picture_link": "V2vARJdGApp1fLx4DRownmkVf5y3Rvq"
    },
    {
        "title": "Eggplant and Zucchini Casserole",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "4 tablespoons butter ADVERTISEMENT",
            "8 ounces dry bread stuffing mix ADVERTISEMENT",
            "1 large eggplant, diced ADVERTISEMENT",
            "2 large zucchini, diced ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 tomato, chopped ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "2 cups shredded Colby cheese ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a microwavable bowl, mix water and margarine (cut into pieces). Stir in stuffing mix and cover with a microwavable lid. Cook on HIGH for 8 to 10 minutes. Fluff with fork.\nPlace eggplant, zucchini, tomato, onion into a large skillet. Season with thyme, salt, and pepper. Cook and stir over medium low heat for 15 to 20 minutes. Remove from heat.\nPreheat oven to 350 degrees F ( 175 degrees C). Grease a 2 quart casserole dish.\nLayer vegetables, cheese, and stuffing in the dish until all ingredients have been used, ending with cheese.\nBake for 30 to 40 minutes.\n",
        "picture_link": "/.rbDc4NRC.K.ShgtzEyBET864/w6Hi"
    },
    {
        "title": "Orange Cranberry Drops",
        "ingredients": [
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "3 tablespoons orange juice ADVERTISEMENT",
            "1/2 teaspoon orange extract ADVERTISEMENT",
            "1 teaspoon grated orange zest ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 cup dried cranberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F(190 degrees C). Lightly grease cookie sheets, or line with parchment paper.\nIn a medium bowl, cream together the white sugar, brown sugar, and butter. Stir in the egg, orange juice, orange extract, and orange zest. Sift together the flour, baking powder, baking soda, and salt; mix into the orange mixture. Stir in the dried cranberries. Drop cookie dough by heaping teaspoonfuls, 2 inches apart, on the prepared cookie sheets.\nBake for 10 to 12 minutes, or until edges are starting to brown. Cool on baking sheets for 5 minutes, then remove to a wire rack to cool completely.\n",
        "picture_link": "3TL4SaJGM1JwS5TQ55Pq0qSy6ocnyKa"
    },
    {
        "title": "Pasta Hot! Hot! Hot!",
        "ingredients": [
            "1 (16 ounce) package spaghetti ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "1/2 teaspoon crushed red pepper ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nIn a small saucepan over low heat place olive oil, garlic and peppers and simmer. Pour olive oil mixture over cooked pasta and serve with Parmesan cheese.\n",
        "picture_link": "0pkK9Fy.Hh6ePlg2N5tQAtZjb03xlvi"
    },
    {
        "title": "Cauliflower Pizza Crust",
        "ingredients": [
            "1/2 head cauliflower, coarsely chopped ADVERTISEMENT",
            "1/2 cup shredded Italian cheese blend ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon chopped garlic ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cauliflower pieces through the feeding tube of the food processor using the grating blade; pulse until all the cauliflower is shredded.\nPlace a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add cauliflower, cover, and steam until tender, about 15 minutes. Transfer cauliflower to a large bowl and refrigerate, stirring occasionally, until cooled, about 15 minutes.\nPreheat an oven to 450 degrees F (230 degrees C). Line a baking sheet with parchment paper or a silicon mat.\nStir Italian cheese blend, parsley, egg, garlic, salt, and pepper into cauliflower until evenly incorporated. Pour mixture onto the prepared baking sheet; press and shape into a pizza crust.\nBake in the preheated oven until lightly browned, about 15 minutes.\n",
        "picture_link": "zGm9h/KwQlH.2hX7oeN/tXCBAaa135W"
    },
    {
        "title": "Homemade Chicken Soup",
        "ingredients": [
            "1 (3 pound) whole chicken ADVERTISEMENT",
            "4 carrots, halved ADVERTISEMENT",
            "4 stalks celery, halved ADVERTISEMENT",
            "1 large onion, halved ADVERTISEMENT",
            "water to cover ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 teaspoon chicken bouillon granules (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put the chicken, carrots, celery and onion in a large soup pot and cover with cold water. Heat and simmer, uncovered, until the chicken meat falls off of the bones (skim off foam every so often).\nTake everything out of the pot. Strain the broth. Pick the meat off of the bones and chop the carrots, celery and onion. Season the broth with salt, pepper and chicken bouillon to taste, if desired. Return the chicken, carrots, celery and onion to the pot, stir together, and serve.\n",
        "picture_link": "kz6GLmQGLwCAkm504t0ICbHfmfJE8pq"
    },
    {
        "title": "Peanut Butter Balls IV",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "1 1/2 cups peanut butter ADVERTISEMENT",
            "4 cups confectioners' sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon maple flavored extract ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the butter, peanut butter, confectioners' sugar, vanilla and maple flavoring. Cream well and knead well.\nMelt the chocolate chips over low heat. Roll the dough into 1 inch balls. Dip into melted chocolate chips.\nRefrigerate overnight (or at least for about 15 minutes) on a cookie sheet lined with wax paper.\n",
        "picture_link": "/EQp77tbc6TMRb844T6HmRZACnkqqfe"
    },
    {
        "title": "Chewy Chocolate Cookies II",
        "ingredients": [
            "1 1/4 cups margarine, softened ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "3/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, cream together margarine and sugar until smooth. Beat in eggs one at a time, then stir in the vanilla. Combine flour, cocoa, baking soda, and salt; stir into the creamed mixture until just blended. Mix in walnuts. Drop by spoonfuls onto ungreased cookie sheets.\nBake for 8 to 10 minutes in the preheated oven. Cool for a couple of minutes on the cookie sheet before transferring to wire racks to cool completely.\n",
        "picture_link": "fKlO5sjawWqc4sgDL1wl/Whdhvzdchu"
    },
    {
        "title": "Lentil Loaf",
        "ingredients": [
            "1 1/8 cups green lentils ADVERTISEMENT",
            "2 1/4 cups water ADVERTISEMENT",
            "6 slices white bread, torn into small pieces ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup vegetable broth ADVERTISEMENT",
            "2 tablespoons tomato paste ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon dried parsley ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 packet dry vegetable soup mix ADVERTISEMENT",
            "1/3 cup dried bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine lentils and water in a small saucepan. Bring to a boil. Reduce heat, and simmer until tender, about 40 minutes.\nPreheat oven to 400 degrees F (205 degrees C). Grease a 9x5 inch loaf pan.\nIn a large bowl, mix together 2 cups cooked lentils, bread, eggs, broth, tomato paste, basil, garlic powder, black pepper, parsley, olive oil, and dry soup mix. Spread into prepared pan.\nBake for 40 minutes. Sprinkle top with dry bread crumbs, and continue baking another 10 minutes. Let sit for 10 minutes before serving.\n",
        "picture_link": "iemdEmFwMbZrjuC/vCxG1KOmfKml0F2"
    },
    {
        "title": "Buffalo Chicken Rolls",
        "ingredients": [
            "4 skinless, boneless chicken breast halves - pounded to 1/4 inch thickness ADVERTISEMENT",
            "4 tablespoons butter, melted ADVERTISEMENT",
            "1/2 cup hot sauce ADVERTISEMENT",
            "1/2 cup shredded provolone cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, stir together the melted butter and hot sauce. Place chicken breasts in a glass bowl, and pour the sauce over. Turn to coat, cover and refrigerate for 15 to 20 minutes.\nPreheat the oven to 400 degrees F (200 degrees C). Remove chicken breasts from the hot sauce, and place 1 tablespoon of cheese in the center of each one. Roll up, and secure with a toothpick. Repeat with remaining breasts, and place them seam side down in a glass baking dish.\nCover the dish, and bake for 30 minutes, or until chicken is fork tender. Increase the temperature of the oven to 450 degrees, and place the chicken 8 inches from the heat. Uncover, and bake for 5 minutes, until browned. Garnish with remaining shredded cheese, remove toothpicks, and serve with ranch or blue cheese dressing.\n",
        "picture_link": "AbTnHuKame9AmS9jWFQkbV1JIwFTYIi"
    },
    {
        "title": "Peanut Butter Brownies I",
        "ingredients": [
            "1/2 cup peanut butter ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "4 tablespoons butter, softened ADVERTISEMENT",
            "2/3 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup salted peanuts, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (150 degrees C). Grease an 8-inch square baking pan.\nIn a large mixing bowl, cream together the peanut butter and butter. Add the brown sugar, vanilla and eggs and beat until light and fluffy. Combine the flour, baking powder, and salt in a separate bowl. Add to the butter mixture and mix until well blended. Stir in the peanuts.\nSpread batter evenly into pan and bake for 25 to 30 minutes or until toothpick comes out clean. Let cool on wire rack and cut into 2-inch squares.\n",
        "picture_link": "m97FECAmzti.gH3yEttubHmhiCRWXtu"
    },
    {
        "title": "Baked Pancakes",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 lemon, juiced (optional) ADVERTISEMENT",
            "1 tablespoon confectioners' sugar, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nPut butter in a 9-inch pie pan. Place pan in the preheating oven until butter is melted, 5 to 10 minutes.\nWhisk flour, milk, eggs, white sugar, and salt together in a bowl; pour mixture into the hot butter.\nBake in the preheated oven until pancake is brown on the edges and a toothpick inserted in the center comes out clean, 20 to 24 minutes. Squeeze lemon over pancake and sprinkle with confectioners' sugar.\n",
        "picture_link": "HX7ZjVy7DkABjwt/z7Ko.LZbzdHQtPC"
    },
    {
        "title": "Peanut Butter Chews",
        "ingredients": [
            "1 cup corn syrup ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup creamy peanut butter ADVERTISEMENT",
            "4 1/2 cups cornflakes cereal ADVERTISEMENT",
            "1 cup semi-sweet chocolate chips (optional) ADVERTISEMENT",
            "1 cup butterscotch chips (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan over medium heat, combine corn syrup and white sugar. Bring to a boil, boil for one minute, and remove from heat. Stir in peanut butter until well blended. Mix in cereal until evenly coated. Drop by spoonfuls onto waxed paper.\nIn a glass bowl in the microwave, or using a double boiler, melt chocolate chips and butterscotch chips, stirring frequently until smooth. Drizzle on the top of the cookies.\n",
        "picture_link": "tgFtk7zSvQ/bOVshdBxLel2wK37v9qO"
    },
    {
        "title": "Authentic Cincinnati Chili",
        "ingredients": [
            "2 pounds lean ground beef ADVERTISEMENT",
            "1 quart water, or amount to cover ADVERTISEMENT",
            "2 onions, finely chopped ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "2 tablespoons vinegar ADVERTISEMENT",
            "2 teaspoons Worcestershire sauce ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1/2 (1 ounce) square unsweetened chocolate ADVERTISEMENT",
            "1/4 cup chili powder ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground cayenne pepper ADVERTISEMENT",
            "5 whole cloves ADVERTISEMENT",
            "5 whole allspice berries ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the ground beef in a large pan, cover with about 1 quart of cold water, and bring to a boil, stirring and breaking up the beef with a fork to a fine texture. Slowly boil until the meat is thoroughly cooked, about 30 minutes, then remove from heat and refrigerate in the pan overnight.\nThe next day, skim the solid fat from the top of the pan, and discard the fat. Place the beef mixture over medium heat, and stir in the onions, tomato sauce, vinegar, Worcestershire sauce, garlic, chocolate, chili powder, salt, cumin, cinnamon, cayenne pepper, cloves, allspice berries, and bay leaf. Bring to a boil, reduce heat to a simmer, and cook, stirring occasionally, for 3 hours. Add water if necessary to prevent the chili from burning.\n",
        "picture_link": "s9XqpzI8s5yQtYzqByDFAhReEnNoSx."
    },
    {
        "title": "Creamy White Wine Sauce",
        "ingredients": [
            "1 cup heavy whipping cream ADVERTISEMENT",
            "3/4 cup white wine ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon dried parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan over medium high heat, combine the cream, wine, flour, salt and parsley. Stir all together bring to a boil.\nReduce heat to low and simmer until thickened.\n",
        "picture_link": "RgnWNqLv82IR/.hQ3HdMw5ZKZh.EbGa"
    },
    {
        "title": "Five Flavor Pound Cake I",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "3 cups white sugar ADVERTISEMENT",
            "5 eggs, beaten ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 teaspoon coconut extract ADVERTISEMENT",
            "1 teaspoon lemon extract ADVERTISEMENT",
            "1 teaspoon rum flavored extract ADVERTISEMENT",
            "1 teaspoon butter flavored extract ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1/2 teaspoon coconut extract ADVERTISEMENT",
            "1/2 teaspoon rum flavored extract ADVERTISEMENT",
            "1/2 teaspoon butter flavored extract ADVERTISEMENT",
            "1/2 teaspoon lemon extract ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease a 10 inch tube pan. In a small bowl, combine flour and baking powder. Set aside. In a measuring cup, combine the milk and 1 teaspoon each coconut, lemon, rum, butter and vanilla extracts; set aside.\nIn a large mixing bowl, cream butter, shortening and 3 cups sugar until light and fluffy. Add eggs, and beat until smooth. Beat in flour mixture alternately with milk mixture, beginning and ending with flour mixture. Spoon mixture into prepared pan.\nBake for 1 1/2 to 1 3/4 hours, or until cake tests done. Cool in pan on wire rack for 10 minutes.\nTurn cake out of pan onto wire rack. Place waxed paper under rack to catch glaze drippings. Slowly spoon Five Flavor Glaze onto top of hot cake. Cool completely.\nTo make the Five Flavor Glaze: In a saucepan, combine 1/2 cup sugar, water and 1/2 teaspoon each coconut, lemon, rum, butter and vanilla extracts. Bring to a boil, stirring until sugar is dissolved.\n",
        "picture_link": "Nva3157XdNideOy1Bg8sMKPeNOS3MtW"
    },
    {
        "title": "Famous No Coffee Pumpkin Latte",
        "ingredients": [
            "1 cup pumpkin puree ADVERTISEMENT",
            "1 quart milk ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine pumpkin, milk, sugar, cinnamon, and vanilla in a large saucepan over medium heat. Use a whisk to blend well. Heat to a simmer; do not boil.\n",
        "picture_link": ".3ByyGNt0DGt3wQ1B5eKiOM4xgdkXZi"
    },
    {
        "title": "Mom's Peach Crisp",
        "ingredients": [
            "4 cups sliced fresh peaches ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/2 cup cold butter ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 cup rolled oats ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nArrange peaches evenly in an 8x8-inch baking dish.\nMix flour, brown sugar, butter, cinnamon, and salt in a bowl using a pastry cutter until evenly crumbled. Fold oats into flour mixture; sprinkle and press topping into peaches.\nBake in the preheated oven until topping is lightly browned, about 30 minutes.\n",
        "picture_link": "E0bV03tbEYL5eU7A0Ly8pvhTM8KOOYO"
    },
    {
        "title": "Rolled Flank Steak",
        "ingredients": [
            "1 (2 pound) beef flank steak ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "2 teaspoons steak seasoning ADVERTISEMENT",
            "8 ounces thinly sliced provolone cheese ADVERTISEMENT",
            "4 slices thick cut bacon ADVERTISEMENT",
            "1/2 cup fresh spinach leaves ADVERTISEMENT",
            "1/2 cup sliced crimini mushrooms ADVERTISEMENT",
            "1/2 red bell pepper, seeded and cut into strips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the flank steak on a cutting board with the short end closest to you. Starting from one of the long sides, cut through the meat horizontally to within 1/2 inch of the opposite edge. (You can also ask your butcher to butterfly the flank steak for you instead of cutting it yourself.)\nMix the soy sauce, olive oil, and steak seasoning together in a gallon-sized resealable plastic bag. Marinate flank steak in the refrigerator 4 hours to overnight.\nPreheat oven to 350 degrees F (175 degrees C). Grease a glass baking dish.\nLay out the flank steak flat in front of you with the grain of the meat running from left to right. Layer the provolone across the steak, leaving a 1-inch border. Arrange the bacon, spinach, red pepper, and mushrooms across the cheese covered steak in stripes running in the same direction as the grain of the meat. Roll the flank steak up and away from you, so that when the roll is cut into the pinwheel shape, each of the filling ingredients can be seen. Roll firmly, but be careful not to squeeze the fillings out the ends. Once rolled, tie every 2 inches with kitchen twine.\nPlace in prepared baking dish, and bake in preheated oven for one hour, or until the internal temperature reaches 145 degrees F (65 degrees C). Remove from the oven and let rest for 5 to 10 minutes before cutting into 1 inch slices. Be sure to remove the twine before serving!\n",
        "picture_link": "g..VDe3M7mDznpklwxduWhmz6iPHaB2"
    },
    {
        "title": "Tuscan Cream Cheese Spread",
        "ingredients": [
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "2 teaspoons chopped garlic ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 (14 ounce) can artichoke hearts, drained and chopped ADVERTISEMENT",
            "1/3 cup chopped black olives ADVERTISEMENT",
            "8 green onions, chopped ADVERTISEMENT",
            "3 ounces sun-dried tomatoes, softened and chopped ADVERTISEMENT",
            "1/4 cup chopped parsley ADVERTISEMENT",
            "1 tablespoon chopped fresh chives ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, mix cream cheese, garlic and salt; stir and blend in artichoke hearts and olives.\nAdd green onions, tomatoes, parsley and chives; gently mix together.\nRefrigerate for several hours or overnight to blend flavors; serve.\n",
        "picture_link": "SaLtJILVzAthCI3sTxLz08vAeLZisdy"
    },
    {
        "title": "Green Chile Frittata",
        "ingredients": [
            "10 eggs, beaten ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 (7 ounce) can diced green chile peppers, drained ADVERTISEMENT",
            "1 (16 ounce) container low-fat cottage cheese ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/4 cup melted butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease a 9x13 inch baking dish.\nIn a large bowl, mix the eggs, flour, baking powder, and salt. Stir in the green chile peppers, cottage cheese, Cheddar cheese, and melted butter. Pour into the prepared baking dish.\nBake 15 minutes in the preheated oven. Reduce heat to 325 degrees F (165 degrees C), and continue baking for 35 to 40 minutes. Cool slightly, and cut into small squares.\n",
        "picture_link": "YC3dtDveIpX.ckLwziRKkDagJUkezSm"
    },
    {
        "title": "Chicken Tagine",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "8 skinless, boneless chicken thighs, cut into 1-inch pieces ADVERTISEMENT",
            "1 eggplant, cut into 1 inch cubes ADVERTISEMENT",
            "2 large onions, thinly sliced ADVERTISEMENT",
            "4 large carrots, thinly sliced ADVERTISEMENT",
            "1/2 cup dried cranberries ADVERTISEMENT",
            "1/2 cup chopped dried apricots ADVERTISEMENT",
            "2 cups chicken broth ADVERTISEMENT",
            "2 tablespoons tomato paste ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 teaspoons garlic salt ADVERTISEMENT",
            "1 1/2 teaspoons ground cumin ADVERTISEMENT",
            "1 1/2 teaspoons ground ginger ADVERTISEMENT",
            "1 teaspoon cinnamon ADVERTISEMENT",
            "3/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 cup couscous ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a skillet over medium-high heat. Place the chicken pieces and eggplant in the heated oil; stir and cook until the chicken is browned on all sides but not cooked through. Remove the skillet from the heat.\nPlace the browned chicken and eggplant on the bottom of a slow cooker. Layer the onion, carrots, dried cranberries, and apricots over the chicken.\nWhisk together the chicken broth, tomato paste, lemon juice, flour, garlic salt, cumin, ginger, cinnamon, and ground black pepper in a bowl. Pour the broth mixture into the slow cooker with the chicken and vegetables.\nCook on High setting for 5 hours, or on Low setting for 8 hours.\nBring water to boil in a saucepan. Stir in couscous, and remove from heat. Cover, and let stand about 5 minutes, until liquid has been absorbed. Fluff with a fork.\n",
        "picture_link": "hR3d1ejo02RUhSdCvSK8QU.ynsy/qXO"
    },
    {
        "title": "Stuffed Jack-O-Lantern Bell Peppers",
        "ingredients": [
            "6 bell peppers, any color ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "4 slices whole wheat bread, cubed ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1 small tomato, diced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup chili sauce ADVERTISEMENT",
            "1/4 cup prepared yellow mustard ADVERTISEMENT",
            "3 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease an 8x8 inch baking dish.\nLightly mix together the ground beef, egg, bread cubes, onion, tomato, garlic, chili sauce, mustard, Worcestershire sauce, salt, and pepper in a bowl.\nWash the peppers, and cut jack-o'-lantern faces into the peppers with a sharp paring knife, making triangle eyes and noses, and pointy-teeth smiles. Slice off the tops of the peppers, and scoop out the seeds and cores. Stuff the peppers lightly with the beef stuffing, and place them into the prepared baking dish so they lean against each other.\nBake in the preheated oven until the peppers are tender and the stuffing is cooked through and juicy, about 1 hour.\n",
        "picture_link": "rHHSr9.pi/cg0kteiuRVJL8zihMi3k6"
    },
    {
        "title": "Creamy Cheesy Scrambled Eggs with Basil",
        "ingredients": [
            "4 eggs ADVERTISEMENT",
            "3 tablespoons sour cream ADVERTISEMENT",
            "1/2 cup shredded mozzarella cheese ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 teaspoons butter ADVERTISEMENT",
            "1 tablespoon minced fresh basil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk eggs and sour cream in a bowl until creamy and smooth. Mix in cheese. Season with salt and pepper.\nMelt butter in a skillet over medium heat. Pour in egg mixture; cook, stirring constantly, until eggs reach the desired consistency. Mix in basil during final minutes of cooking.\n",
        "picture_link": "fTK08VrsYVz2BzCGtUYxEdeH5KauBtS"
    },
    {
        "title": "Grandma's Gingerbread Pancakes",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground dried ginger ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 cup molasses ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk the flour, baking powder, baking soda, salt, ginger, and cinnamon in a bowl; set aside. Beat the egg in a separate mixing bowl with the vanilla and molasses until smooth. Whisk in the water until completely incorporated. Stir the flour mixture into the molasses mixture until just combined -- a few lumps are okay.\nHeat a lightly oiled griddle over medium-high heat. Drop batter by large spoonfuls onto the griddle, and cook until bubbles form and the edges are dry. Flip, and cook until browned on the other side. Repeat with remaining batter.\n",
        "picture_link": "AosSWAlVpQHKwk6LLPkvpMlkW7M8YvK"
    },
    {
        "title": "Bulgogi (Korean Barbecued Beef)",
        "ingredients": [
            "3 tablespoons soy sauce ADVERTISEMENT",
            "1 tablespoon sesame oil ADVERTISEMENT",
            "1 tablespoon sesame seeds ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon monosodium glutamate (MSG) (optional) ADVERTISEMENT",
            "1 pound beef top sirloin, thinly sliced ADVERTISEMENT",
            "1 carrot, julienned ADVERTISEMENT",
            "1 green onion, chopped ADVERTISEMENT",
            "1/2 yellow onion, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large resealable plastic bag, combine soy sauce, sesame oil, sesame seeds, garlic, sugar, salt, black pepper, and MSG. Place beef, carrots, and onions in the bag; seal, and shake to coat the vegetables and beef with the sauce. Refrigerate for at least 2 1/2 hours. I prefer to marinate mine overnight.\nPreheat an outdoor grill for high heat. Remove meat and vegetables from marinade, and place on a large sheet of aluminum foil; seal. Discard marinade.\nPlace on grill, and cook for 15 to 20 minutes, or to desired doneness.\n",
        "picture_link": "Z9jvOJR2TgLdnfpJLNiPqXaBRbnfgvG"
    },
    {
        "title": "S'mores",
        "ingredients": [
            "1 cup butter, melted ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "3 cups graham cracker crumbs ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "3 cups miniature marshmallows ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Butter a 9x13 inch baking dish.\nIn a medium bowl, combine butter, sugar and graham cracker crumbs until well coated. Press half of crumb mixture into the bottom of the prepared pan. Top with the chocolate chips, then the marshmallows. Sprinkle the remaining graham cracker mixture over the marshmallows and press down with a spatula.\nBake in preheated oven 10 minutes, until marshmallows are melted. Cool completely before cutting into squares.\n",
        "picture_link": "4F/wC2wrRcCK/3ocgEMsttfI13P6Ree"
    },
    {
        "title": "Crab Salad III",
        "ingredients": [
            "1 1/2 cups seashell pasta ADVERTISEMENT",
            "1 (12 ounce) package imitation crabmeat ADVERTISEMENT",
            "1 small green bell pepper, diced ADVERTISEMENT",
            "1 sweet onion, diced ADVERTISEMENT",
            "1/2 cup diced black olives ADVERTISEMENT",
            "5 radishes, diced ADVERTISEMENT",
            "1 tomato, seeded and diced ADVERTISEMENT",
            "1/2 cup diagonally sliced celery ADVERTISEMENT",
            "3/4 cup mayonnaise ADVERTISEMENT",
            "1 tablespoon white vinegar ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1/2 packet artificial sweetener ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon dried dill weed ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; rinse with cold water and drain.\nIn a large bowl, whisk together the mayonnaise, vinegar, lemon juice, artificial sweetener, garlic powder, dill, basil and oregano, adjusting seasonings to suit your taste.\nAdd the pasta to the dressing and toss to coat. Add the crab, green pepper, onion, olives, radishes, tomato and celery and gently fold into the salad mixture. Cover and refrigerate until serving.\n",
        "picture_link": "JW0qpjEyi7Wevgs8l.jgQ6Ql464/BJ2"
    },
    {
        "title": "Smoky Four Cheese Macaroni Bake",
        "ingredients": [
            "1 (12 ounce) package macaroni ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/2 cup minced onion ADVERTISEMENT",
            "1 1/2 tablespoons minced garlic ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup half-and-half cream ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "1/2 teaspoon dry mustard powder ADVERTISEMENT",
            "1/2 teaspoon liquid smoke flavoring (optional) ADVERTISEMENT",
            "1 cup grated Parmesan cheese ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, cubed ADVERTISEMENT",
            "1 cup shredded Swiss cheese ADVERTISEMENT",
            "2 cups shredded Monterey Jack cheese ADVERTISEMENT",
            "1/3 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/2 cup bread crumbs ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease a 9x13 inch baking dish.\nBring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nMeanwhile, melt the butter in a large saucepan over medium heat. Stir in the onion, and cook for 3 minutes until it begins to soften. Add the garlic, and continue cooking until the onion has softened and turned translucent, about 2 minutes more. Slowly stir in the flour, and cook, stirring constantly for 5 minutes.\nStir in the half-and-half and milk, and bring to a simmer. Reduce heat to medium-low and stir in mustard powder and liquid smoke; simmer for 10 minutes, stirring occasionally. Add 1 cup of Parmesan cheese, along with the cream cheese, Swiss, Monterey Jack, and Cheddar cheeses; stir until melted. Season to taste with salt and pepper, then stir in the drained macaroni noodles. Pour into the prepared baking dish. Sprinkle the remaining 1/2 cup of Parmesan cheese and breadcrumbs over the macaroni\nBake in preheated oven until bubbly and brown, about 30 minutes. Remove from the oven and allow to stand 5 to 10 minutes before serving.\n",
        "picture_link": "WBaXJEn/NWyESdOm3fgP8Y30YbVC2E2"
    },
    {
        "title": "Caribbean Zucchini Bread",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 cup whole wheat flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon nutmeg ADVERTISEMENT",
            "2 ripe bananas, mashed ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1/2 cup unsweetened applesauce ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 1/2 cups grated zucchini ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup shredded coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 325 degrees F (165 degrees C). Grease and flour 2 9x5-inch loaf pans.\nWhisk the all-purpose flour, whole wheat flour, salt, baking soda, baking powder, cinnamon, and nutmeg together in a bowl. Beat the bananas, eggs, vegetable oil, applesauce, brown sugar, white sugar, and vanilla together in a separate large bowl. Stir the flour mixture into the wet mixture. Fold the zucchini, walnuts, and coconut into the batter until evenly combined. Pour into the prepared pans.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 40 to 50 minutes. Cool in the pans for 25 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "Pe0lzmbqwhCxSJMrc0a27j45Eux8bqG"
    },
    {
        "title": "Sweet Potato Oranges",
        "ingredients": [
            "6 oranges ADVERTISEMENT",
            "3 cups cooked, mashed sweet potatoes ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/4 cup orange juice ADVERTISEMENT",
            "2 eggs, lightly beaten ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup butter, softened, divided ADVERTISEMENT",
            "1 tablespoon grated orange peel ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1/2 teaspoon all-purpose flour ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPrepare oranges by cutting tops off, 1/4 to 1/2 inch down. Spoon out the flesh, leaving a shell.\nIn a large bowl combine sweet potatoes, sugar, orange juice, eggs, vanilla extract, 1/2 cup butter and grated orange peel. Spoon mixture into orange shells. Place in a deep casserole dish.\nIn a small saucepan over medium heat, combine remaining 1/2 cup butter, brown sugar, flour and pecans. Cook until sugar dissolves in melted butter. Spoon over oranges. Fill casserole dish with water to reach 1/2 inch in depth.\nBake in preheated oven for 30 minutes.\n",
        "picture_link": "qktK38oNth3UNdcIVzPY.tH6o0LozpS"
    },
    {
        "title": "Polish Style Lasagna",
        "ingredients": [
            "9 uncooked lasagna noodles ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2 2/3 cups dry potato flakes ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCook lasagna noodles according to package directions. Drain, pat dry and interleave in a damp towel to keep moist OR spray each noodle with cooking spray OR lightly apply some oil.\nIn a separate large skillet over medium heat, combine the onions with the butter and saute for 5 minutes.\nPrepare the instant mashed potatoes according to package directions, but omit the milk. Stir in the cream cheese until well blended.\nPlace 3 noodles in the bottom of a lightly greased 9x13-inch baking dish. Spread 1/2 the potato mixture over the noodles in the dish. Top this with 3 more noodles, followed by the other 1/2 of the potato mixture. Finish by topping with the remaining 3 noodles, then top those with sauteed onions.\nBake at 350 degrees F (175 degrees C) for 20 minutes, or until bubbly. Allow to cool for 5 minutes before cutting.\n",
        "picture_link": "CBXn8XD78R2K9BzX4Zh/TALREF8Z4QS"
    },
    {
        "title": "Fast and Delicious Black Bean Soup",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 medium onion, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 large carrot, peeled and thinly sliced ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "2 (15 ounce) cans black beans ADVERTISEMENT",
            "1 (14 ounce) can chicken broth ADVERTISEMENT",
            "2 cups cubed cooked ham ADVERTISEMENT",
            "1/4 teaspoon cumin ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a large pot over medium heat. Stir in the onion, bell pepper, carrot, and garlic, and cook 5 minutes, until tender. Mix in 1 can black beans and chicken broth.\nIn a blender, puree remaining can of beans until smooth. Mix into the pot. Bring soup to a boil. Reduce heat to low. Mix in ham, cumin, salt, and pepper. Simmer 20 minutes. Garnish with Cheddar cheese and sour cream to serve.\n",
        "picture_link": "NFwYYeKo7QRC9.Vttk0eL8yXA8a./0u"
    },
    {
        "title": "Blue Cheese and Pear Tartlets",
        "ingredients": [
            "4 ounces blue cheese, crumbled ADVERTISEMENT",
            "1 ripe pear - peeled, cored, and chopped ADVERTISEMENT",
            "2 tablespoons light cream ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 (2.1 ounce) package mini phyllo tart shells ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pre-bake phyllo shells according to package directions. Set aside to cool.\nMix together blue cheese, pear, and cream. Season to taste with pepper. Spoon mixture into cooled shells.\nBake at 350 degrees F (175 degrees C) for 15 minutes. Serve warm.\n",
        "picture_link": "HQ6bF6Kb6/ylh6F2X9J3BYr2QeHd0SC"
    },
    {
        "title": "Cauliflower and Broccoli Bake",
        "ingredients": [
            "6 ounces fresh cauliflower ADVERTISEMENT",
            "6 ounces fresh broccoli ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 1/2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 1/2 cups milk ADVERTISEMENT",
            "1 (8 ounce) package shredded sharp Cheddar cheese ADVERTISEMENT",
            "1 teaspoon English mustard ADVERTISEMENT",
            "cayenne pepper to taste ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nIn a medium saucepan with enough water to cover, boil cauliflower and broccoli until tender, about 10 minutes. Drain, and transfer to a medium baking dish.\nIn a separate medium saucepan over low heat, melt butter, and stir in flour. Gradually whisk in milk, and increase heat to medium. As the mixture thickens, whisk in English mustard, cayenne pepper, salt and pepper. Continue whisking until a thick sauce has formed, being careful not to allow the mixture to boil. Sprinkle in 2/3 of the cheese, and stir until melted.\nPour sauce over broccoli and cauliflower. Bake in the preheated oven 30 minutes, until bubbly and lightly brown. Sprinkle with remaining cheese during the final 10 minutes of cooking.\n",
        "picture_link": "6mr4GrsAX7.az5fDZiFDNEFV7H8uCm6"
    },
    {
        "title": "Belle and Chron's Spinach and Mushroom Quiche",
        "ingredients": [
            "6 slices bacon ADVERTISEMENT",
            "4 eggs, beaten ADVERTISEMENT",
            "1 1/2 cups light cream ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon pepper ADVERTISEMENT",
            "2 cups chopped fresh spinach ADVERTISEMENT",
            "2 cups chopped fresh mushrooms ADVERTISEMENT",
            "1/2 cup chopped onions ADVERTISEMENT",
            "1 cup shredded Swiss cheese ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 (9 inch) deep dish pie crust ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nPlace bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble and set aside.\nIn a large bowl, whip together eggs, cream, nutmeg, salt, and pepper. Stir in bacon, spinach, mushrooms, onions, 3/4 cup Swiss cheese, and 3/4 cup Cheddar cheese. Transfer to the pie crust. Top with remaining cheese.\nBake uncovered in the preheated oven 35 minutes, or until bubbly and lightly browned.\n",
        "picture_link": "MfulD1Q7B8xk5ePJD5lz35xCv9en3LO"
    },
    {
        "title": "Cuban Black Beans II",
        "ingredients": [
            "1 pound black beans, washed ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 medium green bell pepper, chopped ADVERTISEMENT",
            "6 cloves garlic, peeled and minced ADVERTISEMENT",
            "5 cups water ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "1 (4 ounce) jar diced pimentos, drained ADVERTISEMENT",
            "1 tablespoon vinegar ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 teaspoon black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place beans in a large saucepan with enough water to cover, and soak 8 hours, or overnight; drain.\nHeat oil in a medium saucepan over medium heat, and saute onion, green bell pepper, and garlic until tender.\nInto the onion mixture, stir the drained beans, water, tomato paste, pimentos, and vinegar. Season with salt, sugar, and pepper. Bring to a boil. Cover, reduce heat, and simmer 1 1/2 hours, stirring occasionally, until beans are tender.\n",
        "picture_link": "74/rEV7xZpJ57Zch/TBWUHFm5l29aiW"
    },
    {
        "title": "Bread Machine Pumpernickel Bread",
        "ingredients": [
            "1 1/8 cups warm water ADVERTISEMENT",
            "1 1/2 tablespoons vegetable oil ADVERTISEMENT",
            "1/3 cup molasses ADVERTISEMENT",
            "3 tablespoons cocoa ADVERTISEMENT",
            "1 tablespoon caraway seed (optional) ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 1/2 cups bread flour ADVERTISEMENT",
            "1 cup rye flour ADVERTISEMENT",
            "1 cup whole wheat flour ADVERTISEMENT",
            "1 1/2 tablespoons vital wheat gluten (optional) ADVERTISEMENT",
            "2 1/2 teaspoons bread machine yeast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ingredients in the pan of the bread machine in the order recommended by the manufacturer. Select Basic cycle; press Start.\n",
        "picture_link": "JKHw2U5RajoF.K0W0XdsO2taPxjCsT6"
    },
    {
        "title": "Macadamia-Crusted Sea Bass with Mango Cream Sauce",
        "ingredients": [
            "1/2 mango - peeled, seeded and diced ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1/2 cup chopped macadamia nuts ADVERTISEMENT",
            "1/4 cup seasoned bread crumbs ADVERTISEMENT",
            "1 teaspoon olive oil ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "1 pinch red pepper flakes ADVERTISEMENT",
            "1 pound fresh sea bass ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 cloves minced garlic ADVERTISEMENT",
            "1 tablespoon extra virgin olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a food processor, combine macadamia nuts, bread crumbs, 1 teaspoon olive oil, black pepper, and red pepper flakes. Process until smooth. Preheat oven to 350 degrees F (175 degrees C).\nIn a small saucepan over medium heat, combine mango, cream, and lemon juice. Bring to a boil, reduce heat, and simmer until thickened.\nSeason fish with salt and black pepper. Heat 1 tablespoon olive oil and crushed garlic in a large skillet over medium heat. Sear the sea bass on both sides, and remove from heat.\nTransfer fish to preheated oven, and roast until cooked through. Cover the sea bass with macadamia crust, and return to the oven until crust browns. Top with the mango cream sauce.\n",
        "picture_link": "R4QxoKXc4hROCwlZpbnMkrgOTeAavJ."
    },
    {
        "title": "Mimi's Slumgullion",
        "ingredients": [
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 onion, roughly chopped ADVERTISEMENT",
            "4 potatoes, peeled and cubed ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 green bell peppers, cut into 1 1/2 inch long strips ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 (16 ounce) package beef kielbasa, diced into bite size pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large skillet over medium low heat, and stir in the onion. Cook onion until tender and golden brown, about 5 to 10 minutes.\nPlace potatoes, salt and green bell peppers into the skillet with the onion. Cover and fry for 3 to 5 minutes. Stir in ground black pepper. Place the kielbasa pieces on top of mixture, cover and let cook for 15 to 20 minutes, stirring occasionally.\nStir kielbasa into the mixture and cook an additional 10 to 15 minutes, or until potatoes are tender. Allow to sit covered for an additional 15 minutes before serving.\n",
        "picture_link": "hNr0TO2WOYocFtXYVSYZpOJhsGoXr1i"
    },
    {
        "title": "Shish Tawook Marinated Chicken",
        "ingredients": [
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "2 tablespoons plain low-fat yogurt ADVERTISEMENT",
            "2 tablespoons ketchup ADVERTISEMENT",
            "2 tablespoons prepared mustard ADVERTISEMENT",
            "1 1/2 teaspoons garlic powder ADVERTISEMENT",
            "2 teaspoons paprika ADVERTISEMENT",
            "1 1/2 teaspoons ground allspice ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon curry powder (optional) ADVERTISEMENT",
            "3 pounds skinless, boneless chicken breast halves - cut into bite-size pieces ADVERTISEMENT",
            "Dipping Sauce: ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1 cup plain low-fat yogurt ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, stir together oil, yogurt, ketchup, and mustard. Season with garlic powder, paprika, allspice, black pepper, cinnamon, and curry powder. Stir in chicken pieces, coating all sides with marinade. Cover bowl, and refrigerate overnight.\nTo make dipping sauce, mix together mayonnaise, yogurt, garlic, and salt. Cover, and refrigerate.\nPreheat oven to 400 degrees F (200 degrees C).\nTransfer chicken pieces to a shallow baking dish. Bake in a preheated oven 30 minutes.\n",
        "picture_link": "Lrd2rQp5oH0OlXaHgOt4NyPUNzJ8LJ2"
    },
    {
        "title": "Honey Mustard Chicken with Pretzel Crust",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 tablespoon red wine vinegar ADVERTISEMENT",
            "1 tablespoon prepared yellow mustard ADVERTISEMENT",
            "1 tablespoon spicy mustard ADVERTISEMENT",
            "1 tablespoon coarse-grained mustard ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "4 cups salted pretzels ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "2 tablespoons prepared yellow mustard ADVERTISEMENT",
            "3 tablespoons honey ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 400 degrees F (200 degrees C). Line a baking sheet with foil and spray with cooking spray.\nIn a bowl, mix together the red wine vinegar, 1 tablespoon yellow mustard, the spicy mustard, coarse-grained mustard, 1 tablespoon of honey, and the vegetable oil.\nPlace the chicken breasts between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound the chicken with the smooth side of a meat mallet to a thickness of about 1/4 inch. Coat the chicken well with the mustard mixture.\nPlace the pretzels into a resealable plastic zipper bag and roll the bag under a rolling pin to finely grind the pretzels. Place the coated chicken breasts, one at a time, into the bag, seal, and shake the bag to thoroughly coat each chicken breast with pretzel meal. Place the chicken breasts on the prepared baking sheet and spray each breast with cooking spray.\nBake the chicken in the preheated oven until the coating is golden brown and the meat is no longer pink in the center, about 25 minutes. Flip the chicken after about 12 minutes of cooking to brown both sides.\nMix together the mayonnaise, 2 tablespoons of yellow mustard, 3 tablespoons of honey, and salt in a bowl. Drizzle the honey-mustard sauce over the chicken to serve.\n",
        "picture_link": "rXTK5S7mnC4Tmiv8BXCqRGzs1dH8IcG"
    },
    {
        "title": "Mountain Apple Cobbler",
        "ingredients": [
            "2 (8 ounce) cans refrigerated crescent rolls ADVERTISEMENT",
            "2 large Granny Smith apples - peeled, cored, and cut into 8 wedges each ADVERTISEMENT",
            "1 cup butter, melted ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1 (12 fluid ounce) can or bottle caffeinated citrus-flavored soda (such as Mountain Dew®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking dish.\nUnroll the crescent roll dough, and separate the sheets into individual triangles. Roll each apple wedge into a triangle of dough, and place them into the baking dish, seam sides down.\nMix the melted butter, sugar, and cinnamon in a bowl, and spoon evenly over the dough-wrapped apple slices. Pour the soda over the rolls.\nBake in the preheated oven until the top is browned, the apples are cooked through, and the cobbler is bubbling, 45 to 50 minutes.\n",
        "picture_link": "CNTkcVDD/PpcLYvLRrr0n7mXBb8XrZC"
    },
    {
        "title": "Hot Artichoke Dip",
        "ingredients": [
            "2/3 cup Parmesan cheese ADVERTISEMENT",
            "2/3 cup mayonnaise ADVERTISEMENT",
            "1/3 cup heavy whipping cream ADVERTISEMENT",
            "1 (14 ounce) can artichoke hearts, drained and chopped ADVERTISEMENT",
            "2 tablespoons thinly sliced green onion ADVERTISEMENT",
            "1 tablespoon chopped pimento peppers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Lightly grease a medium baking dish.\nBlend together the cheese, mayonnaise and whipping cream. Stir in the artichokes, green onions and pimentos. Mix well, and transfer to the prepared baking dish.\nBake 25 minutes in the preheated oven, until lightly browned.\n",
        "picture_link": "ItQo/6GlW6CFQttoeoekBhSu5rijYX."
    },
    {
        "title": "Mushroom Meatloaf",
        "ingredients": [
            "2 pounds lean ground beef ADVERTISEMENT",
            "1/2 pound fresh mushrooms, all minced except for 6 ADVERTISEMENT",
            "3/4 cup fresh bread crumbs ADVERTISEMENT",
            "1/2 cup minced onion ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large mixing bowl, combine ground meat, minced mushrooms, bread crumbs, onion, ketchup, eggs, and salt and pepper. Mix well. Spread 1/2 of the mixture into the bottom of a loaf pan. Arrange 6 whole mushrooms stem down into meat. Top with rest of meat, patting to combine both halves.\nBake for 1 hour and 45 minutes, or until done. Internal temperature should measure 160 degrees F (70 degrees C) when done.\n",
        "picture_link": "lcnhyFjC/epXFTxjiZyX.KJsHGIDJFe"
    },
    {
        "title": "Orange Fluff I",
        "ingredients": [
            "2 (11 ounce) cans mandarin oranges, drained ADVERTISEMENT",
            "1 (15 ounce) can crushed pineapple ADVERTISEMENT",
            "1 pound cottage cheese ADVERTISEMENT",
            "2 (3 ounce) packages orange flavored Jell-O® mix ADVERTISEMENT",
            "1 (16 ounce) package frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the well drained oranges and pineapple in a large bowl and mix together with the cottage cheese. Add the dry orange flavored gelatin powder and stir until well blended. Fold in the thawed frozen whipped topping and refrigerate for at least one hour.\n",
        "picture_link": "55ylfz8o.Kgox1xUVAqrBtx8t/y.Yse"
    }
]