[
    {
        "title": "Giblet Gravy II",
        "ingredients": [
            "3 tablespoons turkey drippings ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "2 1/2 cups turkey stock ADVERTISEMENT",
            "1/4 cup cooked turkey giblets, chopped ADVERTISEMENT",
            "1/2 tablespoon chopped fresh sage ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat pan drippings in a large skillet over medium heat; gradually add flour and stir until golden brown.\nSlowly whisk in turkey stock until blended and smooth. Stir in giblets, and season with sage, pepper, and salt. Bring to a boil, reduce heat, and simmer for 8 to 10 minutes, or until thickened.\n",
        "picture_link": "kd1PYOxjWCCxlnoAh9mD28QTTbELb2a"
    },
    {
        "title": "No Bake Bumpy Peanut Butter Nuggets",
        "ingredients": [
            "1/2 cup natural peanut butter ADVERTISEMENT",
            "1/4 cup nonfat dry milk powder ADVERTISEMENT",
            "1/4 cup unsweetened flaked coconut ADVERTISEMENT",
            "1/3 cup rolled oats ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 cup wheat germ ADVERTISEMENT",
            "1/4 cup unsweetened apple juice concentrate, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine peanut butter, milk powder, and coconut in a large mixing bowl. Stir in oats, ground cinnamon, wheat germ, and apple juice concentrate until thoroughly combined.\nShape the mixture into 1 inch balls. Chill thoroughly before serving; store remaining nuggets in the refrigerator.\n",
        "picture_link": "xlPbvC5x.M2r8j6MfER0.LZNXgmVLJ."
    },
    {
        "title": "Cream of Asparagus Soup II",
        "ingredients": [
            "1 pound fresh asparagus ADVERTISEMENT",
            "3 1/2 cups chicken broth ADVERTISEMENT",
            "1/4 cup margarine ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup half-and-half ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Trim the coarse ends of the asparagus and cut asparagus into one inch pieces. In a medium skillet over medium high heat, saute the asparagus in 1 cup of the broth for about 7 minutes, or until tender.\nIn a large saucepan over medium high heat, melt the butter or margarine and remove from heat. Add the flour and stir well until smooth. Gradually add the remaining 2 1/2 cups broth. Return the saucepan to the heat and continue to cook, stirring occasionally, until slightly thickened.\nAdd the half-and-half, salt, pepper and cooked asparagus with liquid. Stir well and heat thoroughly. Serve hot and enjoy!\n",
        "picture_link": "IuChTSEo8LVVu1oTRCT6sBWIaoiU6au"
    },
    {
        "title": "Irish Ginger Snaps",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3/4 cup shortening ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground cloves ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCream sugar, egg, salt and shortening together. Add flour, baking soda and spices. Mix well. Roll teaspoonfuls of dough into balls and roll the balls in sugar.\nBake at 350 degrees F (175 degrees C) for 5 to 6 minutes.\n",
        "picture_link": "NHWFHwY5FQDqziUBcTacPj/sAuEHaXi"
    },
    {
        "title": "Chef John's Chicken Kiev",
        "ingredients": [
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "2 tablespoons chopped fresh flat-leaf parsley ADVERTISEMENT",
            "6 tablespoons unsalted butter ADVERTISEMENT",
            "4 (8 ounce) skinless, boneless chicken breast halves, pounded to 1/4-inch thickness ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "2 cups panko bread crumbs ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "2 cups vegetable oil for frying, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grind garlic and a pinch of salt together in a mortar and pestle until garlic is completely smashed. Add parsley and mix until completely incorporated. Pound butter into garlic mixture with pestle until parsley and garlic are fully incorporated into the butter. Wrap the butter mixture in plastic wrap and refrigerate until cold, at least 15 minutes.\nSeason chicken breasts with salt and pepper. Place 1/4 the butter mixture in the center of wider end of each chicken breast. Fold the narrower end of each chicken breast up over the butter to form a tight pocket around the butter. Gather the sides of each chicken breast to the center to form a round ball. The top of the chicken will be smooth and the bottom will be gathered. Tightly wrap each chicken breast ball in plastic wrap, put wrapped breasts on a plate, and chill in the freezer until the gathered bottoms hold together and are slightly firm, about 30 minutes.\nWhisk flour and 2 teaspoons salt together in a shallow bowl. Whisk eggs together in another shallow bowl. Pour panko bread crumbs into another bowl.\nRemove chicken breast balls from plastic wrap. Gently press each chicken breast ball into flour mixture to coat and shake off any excess flour. Dip into beaten eggs, then press into bread crumbs. Place breaded chicken onto a plate, cover with plastic wrap, and return to the freezer to chill until firm, about 15 minutes.\nHeat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C). Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil.\nWorking in batches, cook chicken, gathered-side down, in hot oil and until lightly golden on both sides, about 1 minute per side. Transfer to prepared baking sheet. Sprinkle salt and cayenne pepper over the top.\nBake in the preheated oven until you can hear the butter start to sizzle on the baking sheet, 15 to 17 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Let rest for 5 minutes before serving.\n",
        "picture_link": "6HixD7No4P0eeTSo.qpL/jikTgQV0ei"
    },
    {
        "title": "Monkey Peanut Butter Bars",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1/3 cup peanut butter ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 cup rolled oats ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "1/4 cup peanut butter ADVERTISEMENT",
            "3 1/2 tablespoons milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream butter and white sugar and brown sugar. Blend in 1/3 cup peanut butter, egg, vanilla, and baking soda. Add flour and oatmeal. Mix well!\nSpread in greased 13x9 inch baking pan. Bake at 350 degrees F (175 degrees C) for 20 minutes. Remove and sprinkle with chocolate chips.\nReturn to oven and bake for eight minutes. Spread to smooth out chocolate chips. Cool! Mix icing and spread over bars. Refrigerate to set. Cut and eat.\nTo Make Icing: Mix together 1 cup confectioners' sugar, 1/4 cup peanut butter and 3 1/2 tablespoons milk until it makes a spreadable consistency.\n",
        "picture_link": "v6laii/YsSHrtPcsHKjWlUnJZFijqtq"
    },
    {
        "title": "Salsa Biscuit Chicken",
        "ingredients": [
            "3 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 cup salsa ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "1 (12 ounce) can refrigerated biscuit dough ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Bring a saucepan of lightly salted water to a boil. Add chicken breasts, and boil until easily shredded, about 20 minutes.\nSaute onion in a medium saucepan until soft. Remove from heat and stir in salsa, then stir in cheese until melted. Add chicken and mix all together.\nRoll out biscuits individually, adding a little of the chicken mixture to each one; then roll up, secure with toothpicks and place on a lightly greased cookie sheet.\nBake at 350 degrees F (175 degrees C) for about 10 minutes, or until biscuits are golden and hot.\n",
        "picture_link": "Qi28uX6EN/lhzWI3Wq7nOQImNCaR4Ty"
    },
    {
        "title": "Chicken Noodle Soup II",
        "ingredients": [
            "2 eggs ADVERTISEMENT",
            "4 tablespoons milk ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "8 cups chicken broth ADVERTISEMENT",
            "2 cups diced celery ADVERTISEMENT",
            "1 cup diced onion ADVERTISEMENT",
            "3 cups baby carrots, chopped ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "1 pound chopped, cooked chicken meat ADVERTISEMENT",
            "1 (16 ounce) package frozen corn kernels ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "seasoned salt to taste ADVERTISEMENT",
            "1 cube chicken bouillon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix eggs and milk together until well beaten and then add salt and flour. Dough should be stiff. On a floured surface roll dough out really thin, 1/8 of an inch. Let dry 30 minutes and then cut into thin slices. Place on wax paper and let air dry.\nIn a large stock pot add chicken broth, celery, onion, baby carrots, and garlic. Fill stock pot, 2 inches from the top with water. Simmer until vegetables are tender, about 2 hours.\nAdd chicken and corn. Season with salt, pepper, seasoning salt and chicken bouillon granules. Simmer for 30 minutes, checking to see if water level has decreased. Add water if needed.\nBring to a boil, add noodles, stirring often. Noodles should be done in 20 minutes. Serve hot.\n",
        "picture_link": "MEkClDMTy87Oxyy4CWLfix7W7WMlBRu"
    },
    {
        "title": "Cinnamon Pie",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "1 1/2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "1 (10 inch) unbaked pie crust ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (205 degrees C).\nIn a large bowl, combine the sugar, flour, cinnamon and salt. Add the beaten egg, butter, and vanilla. Mix well and add the milk.\nPour mixture into an unbaked 10 inch pie crust (glass pie plate is best).\nBake at 400 degrees for 15 minutes, then reduce heat to 350 degrees F (175 degrees C) and bake for an additional 45 minutes. Let cool and serve. Refrigerate any leftovers.\n",
        "picture_link": "smI9WUGUhRM.kl9hmsQmmCv35VcOSd."
    },
    {
        "title": "Pumpkin Pie Bars",
        "ingredients": [
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1/2 cup melted butter ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "3 cups pumpkin pie filling ADVERTISEMENT",
            "2/3 cup milk ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (190 degrees C). Grease the bottom of a 9x13 inch pan.\nPour one cup of yellow cake mix into a medium size mixing bowl; set aside.\nCombine remaining cake mix, 1/2 cup melted butter and 1 egg; mix well. Press into the baking pan.\nCombine pumpkin pie filling, 2 eggs and milk in a medium size mixing bowl; mix until smooth. Pour evenly over the crust in the 9x13 inch pan.\nPour the sugar and cinnamon into the mixing bowl containing the 1 cup of yellow cake mix. Cut in the butter until the mixture looks crumbly. Sprinkle this mixture over the pumpkin filling.\nBake for 45 to 50 minutes or until a knife inserted into the bars come out clean. Let cool before cutting.\n",
        "picture_link": "NjSJnIOCYyiIPsXTCqX/Iyaf7am2cRS"
    },
    {
        "title": "Slow Cooker Red Curry Beef Pot Roast",
        "ingredients": [
            "1 (2 1/2 pound) boneless beef chuck roast ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 teaspoons vegetable oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 teaspoon red curry paste, or to taste ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "1 teaspoon ground coriander ADVERTISEMENT",
            "2 cups chicken broth ADVERTISEMENT",
            "1 (14 ounce) can coconut milk ADVERTISEMENT",
            "1 (10 ounce) can diced tomatoes and green chiles ADVERTISEMENT",
            "3 tablespoons Asian fish sauce, or to taste ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon tomato paste ADVERTISEMENT",
            "1 (3 inch) piece fresh ginger root, peeled and sliced ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "1 1/2 pounds small potatoes, halved ADVERTISEMENT",
            "4 small heads baby bok choy, sliced in 2-inch sections, green leaves intact ADVERTISEMENT",
            "1 1/2 teaspoons cornstarch ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "For garnish: ADVERTISEMENT",
            "1/4 cup chopped roasted peanuts, or to taste ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Generously season beef chuck roast with salt and pepper.\nHeat a large skillet over high heat; add vegetable oil. When oil is hot, brown roast on all sides, about 2 minutes per side. Remove pan from heat.\nSpread chopped onions in slow cooker; place browned roast on top of onions.\nSpoon red chili paste into the hot skillet. Add cumin and coriander. Rub mixture into hot oil with the back of a spoon to blend. Place skillet over medium heat.\nPour in chicken stock. Return heat to high. Stir in coconut milk. Add diced tomatoes with green chiles, fish sauce, brown sugar, minced garlic, tomato paste, and sliced ginger; stir in lime juice. Bring to a boil.\nPour mixture over pot roast; add bay leaves. Stir to distribute ingredients in the slow cooker.\nCover slow cooker and set to Low. Cook until fork tender, 7 to 8 hours.\nRemove meat from the broth. If desired, skim some fat from the surface of the broth.\nPlace potatoes and bok choy into the broth; stir. Cover and turn heat to high. Cook until potatoes are tender, about 12 minutes.\nBlend cornstarch and water in a small dish until dissolved. Stir into broth mixture.\nCut meat into large chunks and add to the slow cooker; stir. Cover slow cooker and cook on high until meat is heated through and broth is slightly thickened, about 12 minutes.\nLadle into serving bowls and garnish with chopped peanuts and cilantro.\n",
        "picture_link": "hJDUOOKrT.ve7FLY0Bi14DvllsqnX7K"
    },
    {
        "title": "Chef John's Tomato Sauce ",
        "ingredients": [
            "1/4 cup olive oil ADVERTISEMENT",
            "1 onion, finely diced ADVERTISEMENT",
            "1 rib celery, finely diced ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "2 (28 ounce) cans whole peeled San Marzano tomatoes ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon anchovy paste ADVERTISEMENT",
            "1 teaspoon white wine vinegar ADVERTISEMENT",
            "1/2 teaspoon dried Italian herbs ADVERTISEMENT",
            "1 pinch red pepper flakes ADVERTISEMENT",
            "1 tablespoon tomato paste ADVERTISEMENT",
            "2 tablespoons chopped Italian flat-leaf parsley ADVERTISEMENT",
            "water, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place olive oil, onion, celery, and a pinch of salt into a large heavy saucepan or Dutch oven over medium-low heat. Cook until onions are very soft, about 15 minutes, stirring occasionally. Mix garlic into onion mixture and cook just until fragrant, about 1 more minute.\nPour tomatoes and their juice into a large mixing bowl and use your hands to crush the tomatoes until they look pureed.\nMix sugar, 1 teaspoon salt, anchovy paste, white wine vinegar, Italian herbs, and red pepper flakes into vegetable mixture. Raise heat to medium and cook just until liquid has evaporated. Stir in tomato paste and bring to a simmer. Pour in San Marzano tomatoes and parsley. Bring sauce to a simmer, turn heat to low, and simmer for 1 1/2 hours, adding a little water as the sauce cooks down. Stir occasionally.\n",
        "picture_link": "otCaR4un2Mh.olH3cfIHSetSBHUK2RO"
    },
    {
        "title": "Baked Apple-Pecan Maple Pancakes",
        "ingredients": [
            "1 cup pancake/waffle mix ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "1 cup apple - peeled, cored and sliced ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/3 cup pecans, chopped ADVERTISEMENT",
            "3 tablespoons maple syrup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Mix together pancake mix, milk and egg until blended. Set aside.\nPour melted butter in 9-inch pie plate. Place apple slices in bottom of pie plate. Sprinkle cinnamon and pecans over apples and drizzle syrup over top. Pour batter over apples.\nBake at 350 degrees F (175 degrees C) for 30 minutes or until top springs back when touched. Loosen edges and invert onto serving platter. Cut into wedges before serving.\n",
        "picture_link": "cYfqwPJSqv1iZDJbIKZwiKAEtfImjoS"
    },
    {
        "title": "Turkey Sloppy Joes",
        "ingredients": [
            "2 1/2 pounds ground turkey ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1/2 cup chopped green bell pepper ADVERTISEMENT",
            "1/2 cup chopped tomato ADVERTISEMENT",
            "1 cup no-salt-added ketchup ADVERTISEMENT",
            "7 tablespoons barbeque sauce ADVERTISEMENT",
            "2 tablespoons prepared yellow mustard ADVERTISEMENT",
            "1 tablespoon vinegar ADVERTISEMENT",
            "1/2 teaspoon celery seed ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes, or to taste ADVERTISEMENT",
            "8 hamburger bun, split and toasted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a nonstick skillet over medium heat; cook and stir turkey, onion, bell pepper, and tomato until turkey is crumbly and no longer pink, about 5 minutes. Stir in ketchup, barbeque sauce, mustard, vinegar, celery seed, black pepper, and red pepper flakes. Reduce heat to low and simmer for 10 minutes, stirring occasionally. Serve turkey mixture on toasted hamburger buns.\n",
        "picture_link": "r5LMpAarjXQHPkk7NhbrggevJsBJb.m"
    },
    {
        "title": "Pumpkin Cheesecake Pie",
        "ingredients": [
            "1 cup graham cracker crumbs ADVERTISEMENT",
            "1/2 cup ground pecans ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1/8 teaspoon ground ginger ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "3/4 cup packed brown sugar ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "1 (15 ounce) can solid pack pumpkin puree ADVERTISEMENT",
            "1/2 cup heavy whipping cream ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nTo Make Crust: In a medium bowl combine graham cracker crumbs, ground pecans, white sugar, and 1/8 teaspoon ground ginger. Mix well, then pour in melted butter. Stir until butter is evenly distributed. Press mixture into a 9-inch pie plate. Set aside.\nTo Make Filling: In a large mixing bowl combine cream cheese and brown sugar. Beat until smooth, then add eggs, pumpkin, and cream. Mix well. Stir in cinnamon, ginger, nutmeg, cloves, and salt. Pour mixture into pie shell.\nBake in preheated oven for 35 to 40 minutes, until set in center. Chill before serving. Garnish with whipped cream and pecan halves if desired.\n",
        "picture_link": "XJv6UNN1Ne2wwInPSAkV7JPzR7FbKwu"
    },
    {
        "title": "Oven-Roasted Turkey Breast",
        "ingredients": [
            "1/4 cup butter, softened ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 teaspoon Italian seasoning ADVERTISEMENT",
            "1/2 teaspoon salt-free garlic and herb seasoning blend (such as Mrs. Dash®) ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 (3 pound) turkey breast with skin ADVERTISEMENT",
            "1 teaspoon minced shallot ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 splash dry white wine ADVERTISEMENT",
            "1 cup chicken stock ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "2 tablespoons half-and-half (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix 1/4 cup butter, garlic, paprika, Italian seasoning, garlic and herb seasoning, salt, and black pepper in a bowl. Place turkey breast with skin side up into a roasting pan. Loosen skin with your fingers; brush half the butter mixture over the turkey breast and underneath the skin. Reserve remaining butter mixture. Tent turkey breast loosely with aluminum foil.\nRoast in the preheated oven for 1 hour; baste turkey breast with remaining butter mixture. Return to oven and roast until the juices run clear and an instant-read meat thermometer inserted into the thickest part of the breast, not touching bone, reads 165 degrees F (65 degrees C), about 30 more minutes. Let turkey breast rest 10 to 15 minutes before serving.\nWhile turkey is resting, transfer pan drippings to a skillet. Skim off excess grease, leaving about 1 tablespoon in skillet. Place skillet over low heat; cook and stir shallot in turkey grease until opaque, about 5 minutes. Melt 1 tablespoon butter in skillet with shallot and whisk in white wine, scraping any browned bits of food from skillet. Whisk in chicken stock and flour until smooth. Bring to a simmer, whisking constantly, until thickened. For a creamier, lighter gravy, whisk in half-and-half.\n",
        "picture_link": "3NAuMTzTN.qpmK.ixbZH17kgcOjT1da"
    },
    {
        "title": "Mozzarella Parmesan Chicken",
        "ingredients": [
            "8 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 (10.75 ounce) can low-fat cream of celery soup ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/8 teaspoon dried oregano ADVERTISEMENT",
            "6 ounces low fat mozzarella cheese, sliced ADVERTISEMENT",
            "3 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace chicken breasts in a 9x13 inch baking dish, in a single layer. Cover with the celery soup and bake uncovered in the preheated oven for 40 minutes. Turn chicken pieces over and bake for another 30 minutes, until browned. Remove from oven.\nCombine the mushroom soup, water, onion, garlic and oregano and mix all together. Pour mixture over chicken. Top with mozzarella cheese slices, pushing the cheese down into the sauce. Sprinkle grated Parmesan cheese on top and bake in the preheated oven for 20 minutes more until bubbly and golden brown.\n",
        "picture_link": "ZQDwtEY.wMXiHC1mxlv8jAP230JJiAK"
    },
    {
        "title": "Real French Crepes",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a mixing bowl, combine flour, egg, and milk.\nHeat a large skillet or crepe pan over a medium-high heat. Spray the pan with non-stick cooking spray. Pour about 1/3 cup of batter into the pan, lift the pan and turn it by rotating your wrist, spreading a PAPER THIN amount in the pan. Flip the crepe when it starts to bubble. When it is finished cooking, remove it and repeat this process with the remaining batter.\n",
        "picture_link": "vTQr7DkKxowKcstaLd1W/t1HrdfTP4S"
    },
    {
        "title": "Easy Breaded Shrimp",
        "ingredients": [
            "1 quart vegetable oil for frying ADVERTISEMENT",
            "4 cups shrimp, peeled and deveined ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "2 cups dry bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large skillet. Dip the shrimp in the egg, then coat the shrimp with bread crumbs. Fry the shrimp in the hot oil.\n",
        "picture_link": "pp.w6X8VEbuWHO5PRJqRJHTS9HKScHO"
    },
    {
        "title": "Split Pea and Ham Soup II",
        "ingredients": [
            "1 pound leftover ham bone with meat attached ADVERTISEMENT",
            "1 cup chopped onions ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 teaspoons freshly ground black pepper ADVERTISEMENT",
            "1 pound dried split peas ADVERTISEMENT",
            "1 cup chopped carrots ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the ham bone in a large pot over high heat. Add water to cover, bring to a boil, reduce heat to low and let simmer overnight. Allow to cool and clean the stock, discarding the bone, excess fat, and any cartilage. Return any good ham meat to the pot and bring back to a boil.\nAdd the onion, garlic and ground black pepper and allow to simmer for 1 hour. Then pour in the split peas and the carrots and allow to simmer for at least 1 more hour to allow the peas to break down. Stir together well and season to taste.\n",
        "picture_link": "5W5s8jo7v8sZbhaGkIOJiAwAKnxxZYy"
    },
    {
        "title": "Home Made Mayonnaise",
        "ingredients": [
            "1 egg ADVERTISEMENT",
            "1/2 teaspoon minced garlic ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 teaspoon prepared yellow mustard ADVERTISEMENT",
            "3/4 cup vegetable or olive oil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the egg, garlic, lemon juice and mustard in the container of a blender or food processor. Blend until smooth, then blend on low speed while pouring oil into the blender in a fine stream as the mixture emulsifies and thickens.\n",
        "picture_link": "mlmxkSR0J/VQ3lRWJKDVeqWeKvJhJPC"
    },
    {
        "title": "Six Threes Ice Cream",
        "ingredients": [
            "3 cups sugar ADVERTISEMENT",
            "3 cups cream ADVERTISEMENT",
            "3 cups milk ADVERTISEMENT",
            "3 bananas, mashed ADVERTISEMENT",
            "3 oranges, juiced ADVERTISEMENT",
            "3 lemons, juiced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, whisk together sugar and cream until sugar is dissolved. Mix in the milk, mashed bananas, and fruit juices.\nPour mixture into ice cream maker. Freeze according to manufacturer's directions, about 45 minutes.\n",
        "picture_link": "pdliuxkxPcWDC91nk2tVRZSPoUS29Ly"
    },
    {
        "title": "Pumpkin Bread Puddin'",
        "ingredients": [
            "1 egg ADVERTISEMENT",
            "3 egg yolks ADVERTISEMENT",
            "1 1/2 cups whole milk ADVERTISEMENT",
            "2/3 cup sugar ADVERTISEMENT",
            "3/4 cup canned pumpkin puree ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "3 1/2 cups white bread cubes ADVERTISEMENT",
            "3/8 cup miniature chocolate chips ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease 6 large custard cups.\nWhisk together the egg and egg yolks in a large bowl. Add the milk, sugar, pumpkin puree, vanilla extract, salt, cinnamon, nutmeg, and cloves; whisk into a smooth batter. Add the bread cubes and toss gently to dampen. Set aside for 15 minutes.\nPour the batter evenly into the prepared cups. Sprinkle chocolate chips and brown sugar over each portion. Arrange the custard cups in a shallow baking pan. Pour hot water into the baking pan to halfway up the sides of the custard cups.\nBake in preheated oven until pudding is golden brown and puffy, about 40 minutes; transfer to cooling rack for 10 minutes.\n",
        "picture_link": "1JFcPPEi.Y7HayTxqKCUwR65wMgWmcW"
    },
    {
        "title": "Stuffed Eggplant Parmesan",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 medium eggplants, cut in half lengthwise and hollowed out to 1/4 inch flesh rim ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1/2 cup bread crumbs ADVERTISEMENT",
            "1 teaspoon chopped fresh Italian parsley ADVERTISEMENT",
            "2 cups tomato sauce ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nHeat olive oil in a large skillet over medium high heat. Roughly chop eggplant centers, and add to pan with onion, garlic, oregano, and pepper. Cook and stir until lightly browned. Spoon mixture back into eggplant, and sprinkle each with Parmesan cheese, bread crumbs, and parsley. Place in a shallow baking dish, and cover with tomato sauce and mozzarella cheese.\nBake in the preheated oven for 30 minutes, or until eggplant is fork-tender and cheese is bubbly. Serve immediately.\n",
        "picture_link": "bI.kRKEnUqmCBaE1YXEGtJz98Lr5euO"
    },
    {
        "title": "Pumpkin Pancakes with Nutmeg Whipped Cream",
        "ingredients": [
            "Pancakes ADVERTISEMENT",
            "2 1/3 cups pancake mix (such as Bisquick®) ADVERTISEMENT",
            "2 1/2 tablespoons white sugar ADVERTISEMENT",
            "1/3 teaspoon ground cinnamon ADVERTISEMENT",
            "1/3 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon ground ginger ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 1/4 cups milk ADVERTISEMENT",
            "1/3 cup canned pumpkin ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "Nutmeg whipped cream ADVERTISEMENT",
            "1 cup whipping cream ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "3/4 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the pancake mix, white sugar, cinnamon, the 1/3 teaspoon nutmeg, and ginger; set aside. Beat together the eggs, milk, pumpkin, and vegetable oil. Combine the two mixtures, stirring just until all ingredients are moistened.\nHeat a lightly oiled griddle or frying pan over medium-high heat. Pour or scoop the batter onto the griddle, using approximately 1/4 cup for each pancake. Bubbles will start to form in the pancakes. Cook until the edges of the pancakes start to look dry, and a bubble popped near the edge holds its shape. Flip the pancakes over, and continue cooking until the other side is golden brown. Repeat with remaining batter, adding more oil to the griddle if necessary. Stack the pancakes on a plate and keep warm until serving. For larger batches, keep pancakes warm in a single layer on a cooling rack positioned over a baking sheet in a 300 degrees F oven (150 degrees C).\nPlace whipping cream in a small, deep, chilled bowl. Add the 2 tablespoons sugar, vanilla, and nutmeg; beat using a mixer with chilled beaters on medium-high speed until soft peaks form.\n",
        "picture_link": "uNTjwM1UBEtG/j3wsh7QCRcTmws6Yp6"
    },
    {
        "title": "BBQ Feta and Hot Banana Pepper Turkey Burgers",
        "ingredients": [
            "1 pound ground turkey ADVERTISEMENT",
            "1/4 cup seeded, chopped banana peppers ADVERTISEMENT",
            "1/2 cup crumbled feta cheese ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for high heat.\nIn a bowl, mix the turkey, peppers, and feta cheese. Season with salt and pepper. Form the mixture into 4 patties.\nCook patties about 8 minutes per side on the prepared grill, to an internal temperature of 180 degrees F (85 degrees C).\n",
        "picture_link": "awEAgtITh0COeuP8DyexWip7HSM83K2"
    },
    {
        "title": "Oxtails with Gravy",
        "ingredients": [
            "2 pounds beef oxtail ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 teaspoon pepper ADVERTISEMENT",
            "1 tablespoon Greek seasoning ADVERTISEMENT",
            "1 teaspoon seasoning salt ADVERTISEMENT",
            "2 tablespoons bacon drippings or shortening ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 cups broth from cooked oxtails ADVERTISEMENT",
            "2 dashes browning sauce ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "garlic powder to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place oxtails, garlic, onions, 1 tablespoon salt, 1 teaspoon pepper, Greek seasoning, and seasoning salt in a large stock pot. Fill with enough water to cover oxtails, and place over high heat. Bring to a boil. Cover, and reduce heat to medium. Cook for 2 1/2 to 3 hours. Remove from heat, and reserve 2 cups broth.\nWarm bacon drippings in a skillet over medium heat. Stir in flour, and cook for 3 minutes, stirring constantly. Stir in broth and browning sauce. Season to taste with salt, pepper, and garlic powder. Cook, stirring constantly, until gravy thickens. Remove from heat.\nPlace oxtails in skillet, and stir to coat with gravy. Return to stove, and cook over medium-low heat for 5 minutes, stirring occasionally.\n",
        "picture_link": "Dw5GgFWSB4CmbtsGVIkq7qBrwxDLgzq"
    },
    {
        "title": "Pasta with Roasted Butternut Squash and Sage",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 2/3 cups cubed butternut squash ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "8 ounces uncooked penne pasta ADVERTISEMENT",
            "1/2 pound turkey sausage ADVERTISEMENT",
            "1/4 cup heavy cream ADVERTISEMENT",
            "2 teaspoons dried sage ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "3 1/2 tablespoons balsamic vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Coat a roasting pan with the olive oil. Place the squash and onion in the pan, and season with salt and pepper. Roast 30 minutes, or until squash is tender.\nBring a large pot of lightly salted water to a boil. Place penne pasta in the pot, cook for 8 to 10 minutes, until al dente, and drain.\nIn a large skillet over medium heat, cook the turkey sausage until evenly brown. Transfer the cooked squash and onion and the cooked pasta to the skillet. Gradually pour in the cream. Season with sage. Continue cooking until heated through. Mix in garlic. Transfer to a large bowl, and toss with balsamic vinegar to serve.\n",
        "picture_link": "neFOQ5pxgX1LoKm4BlhePgzKQvkzSoW"
    },
    {
        "title": "Super Summer Salsa",
        "ingredients": [
            "2 (10 ounce) cans sweet white corn ADVERTISEMENT",
            "1 (14.5 ounce) can black beans ADVERTISEMENT",
            "1/2 red onion, chopped ADVERTISEMENT",
            "1 red pepper, chopped ADVERTISEMENT",
            "1/2 cup sugar ADVERTISEMENT",
            "1/2 cup rice wine vinegar ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, stir together corn, beans, onion, red pepper, and sugar. Stir in rice wine vinegar, and season with salt.\n",
        "picture_link": "jUCSu3AtE2/tl.aXF..w4.FCCgAWEsq"
    },
    {
        "title": "Grandma's Butter Noodles",
        "ingredients": [
            "2 eggs ADVERTISEMENT",
            "3 tablespoons butter, melted and cooled ADVERTISEMENT",
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, whisk the eggs and melted butter together with a fork. Stir in the flour, baking powder and salt until dough becomes stiff. Knead on a lightly floured surface or in the bowl for a few minutes to blend completely. Divide the dough into thirds. On a lightly floured surface, roll each piece into a sheet about 1/16 of an inch thick. Place each sheet onto a dry cloth and set aside for 30 to 45 minutes to partially dry.\nWhen the noodle sheets are somewhat dry, roll up one at a time into a loose spiral and cut into strips as wide as you want using a sharp knife. Spread out the noodles to dry for about 1 hour before cooking or storing in freezer containers. To use frozen noodles, thaw in the container before using.\nTo cook the noodles, drop into rapidly boiling water or broth, and cook until tender, 7 to 10 minutes.\n",
        "picture_link": "jUWq/slpYxgDA6VgI7asMy4W1rgCUv."
    },
    {
        "title": "Shabbat Challah",
        "ingredients": [
            "3 tablespoons active dry yeast ADVERTISEMENT",
            "4 cups warm water ADVERTISEMENT",
            "2 tablespoons salt ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "12 cups all-purpose flour ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "3 tablespoons water ADVERTISEMENT",
            "1/2 teaspoon vanilla sugar, or vanilla extract ADVERTISEMENT",
            "1/4 cup sesame seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, sprinkle the yeast over the water. Let stand for about 5 minutes to dissolve the yeast. Stir in the salt, sugar, oil and 4 eggs until well blended. Gradually mix in the flour. When the dough becomes too stiff to stir, turn it out onto a floured surface and knead for 8 to 10 minutes. Place dough underneath the bowl to rise until double. Or, you can place the dough in the bowl, and cover with a towel.\nPunch down the dough, and divide into 6 or 8 even pieces depending on what shape you want. Remember to take a small piece off and make a blessing (Jewish law). Roll the pieces into ropes. Braid into two loaves, or one really big 6 piece braid - but only if your oven is large enough. Or, you can make the spiral shape challahs out of each rope. Tuck the ends under, and place on a baking sheet to rise until your finger leaves a small dent when you gently poke the bread.\nPreheat the oven to 400 degrees F (200 degrees C). Whisk together the remaining egg, water and vanilla sugar. Brush over the tops of the loaves. Sprinkle sesame seeds over the top.\nBake for 35 to 40 minutes in the preheated oven, until the bread is deep golden brown. Wrap the small piece of dough that was blessed in aluminum foil, and burn in the oven as an offering while the other loaves are baking.\n",
        "picture_link": "A3SUtElDK9irGCUi5gckSme3WcUTmwC"
    },
    {
        "title": "Indian-Style Rice with Cashews, Raisins and Turmeric",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 1/2 cups basmati rice ADVERTISEMENT",
            "1 (14 ounce) can coconut milk ADVERTISEMENT",
            "1 1/4 (14 ounce) cans chicken stock ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon ground coriander ADVERTISEMENT",
            "1 pinch crushed red pepper flakes ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground turmeric ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "3/4 cup cashew halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large pot over medium-high heat. Stir in rice, and cook for 2 minutes. Pour in the coconut milk, chicken stock, cumin, coriander, red pepper flakes, salt, turmeric, bay leaf, raisins, and cashew halves. Bring to a boil, then cover, and reduce heat to low. Cook until rice is tender, about 20 minutes.\n",
        "picture_link": "bc/wF0Zm6skoMH47qNKsL4BfXRFKnrG"
    },
    {
        "title": "Beef and Mushroom Stroganoff, Aussie Style",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "8 fresh mushrooms, sliced ADVERTISEMENT",
            "2 teaspoons curry powder ADVERTISEMENT",
            "1 pound beef top sirloin, thinly sliced ADVERTISEMENT",
            "2 cubes beef bouillon ADVERTISEMENT",
            "1 1/2 cups boiling water ADVERTISEMENT",
            "1 (6 ounce) can mushroom stems and pieces, drained ADVERTISEMENT",
            "1/4 cup dried shiitake mushrooms ADVERTISEMENT",
            "1 1/4 cups heavy cream ADVERTISEMENT",
            "1 (8 ounce) package uncooked egg noodles ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a large skillet over medium heat. Add the onion and garlic, and fresh mushrooms; cook until the onions are translucent. Stir in curry powder until well blended. Place the meat strips in the skillet, and fry until evenly browned.\nDissolve the bouillon cubes in the boiling water, then stir into the skillet. Add the mushroom stems and pieces and dried shiitake mushrooms. Let the mixture simmer over medium heat until most of the liquid has evaporated, about 20 minutes.\nMeanwhile, bring a large pot of lightly salted water to a boil. Add the noodles and cook until tender, about 7 minutes. Drain.\nReduce the heat under the skillet to low, and pour in the cream, stirring until the sauce is an even color. Simmer for about 5 minutes, but do not boil. Serve over noodles.\n",
        "picture_link": "VwNJIjm4gBJWYXldyfq9sHUJQU8UGHS"
    },
    {
        "title": "Meatloaf that Doesn't Crumble",
        "ingredients": [
            "1 green bell pepper, seeded and cubed ADVERTISEMENT",
            "1 medium onion, roughly chopped ADVERTISEMENT",
            "3 small stalks celery ADVERTISEMENT",
            "1 1/4 pounds ground beef ADVERTISEMENT",
            "1 pound mild pork sausage ADVERTISEMENT",
            "1 1/2 cups cracker crumbs ADVERTISEMENT",
            "1 (1 ounce) envelope dry onion soup mix ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon dried sage ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nIn a food processor or blender, combine the bell pepper, onion and celery. Process until finely chopped, but not liquid. Transfer to a large bowl. Add the ground beef, ground pork, cracker crumbs, onion soup mix, salt, pepper, sage and milk. Mix well using your hands, or if you have a stand mixer, mix using the paddle attachment. Transfer to a 9x5 inch loaf pan and form into a loaf, mounding in the center. Cover with a generous layer of ketchup.\nBake for 1 1/2 hours in the preheated oven. Serve hot. Refrigerate leftovers, slice and serve cold in sandwiches.\n",
        "picture_link": "QAcdKOxkfSva0.uwnRgCMV/1/5TXiku"
    },
    {
        "title": "Spiced Parsnip Soup",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1 medium onion, chopped ADVERTISEMENT",
            "1 pound parsnips, peeled and cubed ADVERTISEMENT",
            "1 clove garlic, finely chopped ADVERTISEMENT",
            "2 teaspoons curry powder ADVERTISEMENT",
            "1 cube chicken bouillon ADVERTISEMENT",
            "3 1/4 cups boiling water ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 pinch red pepper flakes or paprika for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a large saucepan over medium heat. Fry the onion in butter until soft, about 5 minutes. Add the parsnips, garlic and curry powder, and fry for a couple of minutes to release the flavors. Mix the bouillon cube into the boiling water, and pour into the saucepan. Stir to remove any bits of vegetable from the bottom of the pot. Simmer for 15 minutes or until parsnips are soft and easy to break with a wooden spoon.\nRemove from the heat, and blend with a hand mixer or immersion blender. Stir in the cream, and heat through. Do not boil. Season with salt and pepper to taste, and garnish with red pepper flakes or paprika.\n",
        "picture_link": "43xS0eGoZpkzCIdcsE8Bi77yY55Ux6K"
    },
    {
        "title": "Paleo Chili",
        "ingredients": [
            "1 dried chipotle pepper, stem removed ADVERTISEMENT",
            "1 cup boiling water ADVERTISEMENT",
            "1 1/2 teaspoons coconut oil ADVERTISEMENT",
            "1 cup chopped yellow onion ADVERTISEMENT",
            "1 cup chopped green bell pepper ADVERTISEMENT",
            "1 cup chopped red bell pepper ADVERTISEMENT",
            "4 garlic cloves, minced ADVERTISEMENT",
            "1 pound ground bison ADVERTISEMENT",
            "1/2 pound spicy ground pork sausage ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon unsweetened cocoa powder ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1 (28 ounce) can crushed tomatoes ADVERTISEMENT",
            "1 1/2 teaspoons kosher salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Soak chipotle pepper in boiling water until softened, about 10 minutes. Remove pepper from water and mince.\nMelt coconut oil in a large pot over medium heat. Cook and stir onion, green bell pepper, and red bell pepper until tender, 5 to 10 minutes. Stir garlic and minced chipotle into onion mixture and cook until fragrant, about 1 minute.\nStir bison and sausage into onion mixture. Cook and stir until meat is browned and crumbly, 10 to 12 minutes.\nStir chili powder, cumin, oregano, cocoa powder, and Worcestershire sauce into the bison mixture; add crushed tomatoes, salt, and pepper and stir. Bring to a boil, reduce heat to low, and simmer until flavors are blended, 10 minutes.\n",
        "picture_link": "xQQv31H4ELQWYyi/KlRY2OYxckH4uGi"
    },
    {
        "title": "Easy Chicken and Broccoli Alfredo",
        "ingredients": [
            "8 ounces fettuccine or spaghetti, uncooked ADVERTISEMENT",
            "2 cups fresh broccoli florets ADVERTISEMENT",
            "1/4 cup KRAFT Zesty Italian Dressing ADVERTISEMENT",
            "1 pound boneless skinless chicken breasts, cut into bite-sized pieces ADVERTISEMENT",
            "1 2/3 cups milk ADVERTISEMENT",
            "4 ounces PHILADELPHIA Cream Cheese, cubed ADVERTISEMENT",
            "1/4 cup KRAFT Grated Parmesan Cheese ADVERTISEMENT",
            "1/2 teaspoon dried basil leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook pasta as directed on package, adding broccoli to the boiling water for the last 2 min. of the pasta cooking time. Drain pasta mixture.\nMeanwhile, heat dressing in large nonstick skillet on medium-high heat. Add chicken; cook 5 min. or until chicken is cooked through, stirring occasionally. Stir in milk, cream cheese, Parmesan cheese and basil. Bring to boil, stirring constantly. Cook 1 to 2 min. or until sauce is well blended and heated through.\nAdd chicken mixture to pasta mixture; mix lightly.\n",
        "picture_link": "A1GgwHTobYv/G3E4QPjuiSwnu0N1J.y"
    },
    {
        "title": "Jackie's Fresh Peach Cobbler",
        "ingredients": [
            "1/2 cup butter, melted ADVERTISEMENT",
            "2 large peaches, peeled and sliced ADVERTISEMENT",
            "1 1/2 cups white sugar, divided ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Pour butter into an 8-inch square baking dish.\nCombine peaches and 3/4 cup sugar together in a bowl. Whisk flour, remaining sugar, baking powder, salt, and nutmeg together in a bowl; stir in milk just until batter is combined. Pour batter over butter and top with peaches.\nBake in the preheated oven until cobbler is golden brown, 45 to 50 minutes.\n",
        "picture_link": "CzjGecpmOiLxhYrI/BHjpEbDwtmZy/y"
    },
    {
        "title": "Overnight Asparagus Mushroom Strata",
        "ingredients": [
            "2 teaspoons butter, or as needed ADVERTISEMENT",
            "1 3/4 cups sliced crimini mushrooms ADVERTISEMENT",
            "5 English muffins, split and toasted ADVERTISEMENT",
            "1 cup shredded Colby-Monterey Jack cheese ADVERTISEMENT",
            "1 pound fresh asparagus, trimmed and cut into 1-inch pieces ADVERTISEMENT",
            "1/2 cup chopped red bell pepper ADVERTISEMENT",
            "1/2 onion, finely chopped ADVERTISEMENT",
            "8 eggs ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon dry mustard powder ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 cup shredded Colby-Monterey Jack cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a skillet over medium heat, and cook and stir the mushrooms until their liquid has mostly evaporated and the mushrooms are beginning to brown, about 10 minutes. Set the mushrooms aside.\nGrease a 9x13 inch baking dish, and arrange 8 muffin halves, cut sides up, in the bottom of the dish. Stuff pieces of remaining muffins into the spaces between the halves. Spread 1 cup of Colby-Monterey Jack cheese over the muffins in a layer, and distribute the asparagus pieces, mushrooms, red pepper, and onion over the cheese.\nWhisk together eggs, milk, salt, dry mustard, and black pepper in a bowl, and pour the egg mixture over the muffins and vegetables. Cover the dish, and refrigerate overnight.\nThe next day, preheat oven to 375 degrees F (190 degrees C).\nRemove the casserole from the refrigerator and let stand for 30 minutes. Spread 1 cup of Colby-Monterey Jack cheese in a layer over the casserole.\nBake in the preheated oven until a knife inserted near the edge comes out clean, 40 to 45 minutes. Let stand 5 to 10 minutes before cutting into squares.\n",
        "picture_link": "pOi2B7P/olRMwLWJMdq5xfH/imDSU0e"
    },
    {
        "title": "Chocolate Mousse II",
        "ingredients": [
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "5 tablespoons boiling water ADVERTISEMENT",
            "4 eggs, separated ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grind chocolate chips in a blender, using short pulses. Add boiling water and blend to melt the chocolate. Add egg yolks, one at a time, blending well after each.\nIn a medium bowl, beat egg whites with electric mixer until stiff peaks form. Fold egg whites into chocolate mixture gently. Pour the mousse into wine glasses or other serving glasses and chill in refrigerator until set.\n",
        "picture_link": "oMYhE5pHjsujEQq0AURPdXs5dLe4H/a"
    },
    {
        "title": "Authentic and Easy Shrimp Curry",
        "ingredients": [
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "10 fresh curry leaves (optional) ADVERTISEMENT",
            "1 tablespoon ginger garlic paste ADVERTISEMENT",
            "1 teaspoon ground coriander ADVERTISEMENT",
            "2/3 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "1 tomato, finely chopped ADVERTISEMENT",
            "1 teaspoon ground red chile pepper ADVERTISEMENT",
            "2 pounds medium shrimp - peeled and deveined ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 teaspoon garam masala ADVERTISEMENT",
            "chopped fresh cilantro to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a wok or large saucepan over nearly high heat. Add the onions; cook and stir until browned. Mix in the curry leaves, then season with the ginger garlic paste, coriander and salt. Cook and stir for 1 minute.\nSeason with salt and turmeric, then mix in the tomato, chile powder, shrimp and water. Reduce the heat to medium-high and cook for 7 to 8 minutes, until shrimp are opaque. Taste and adjust salt and chile powder if necessary. Season with garam masala, stir and remove from the heat. Garnish with fresh cilantro and serve with flat bread or rice.\n",
        "picture_link": ".Ohu0IU7NHglr5PSFylBFq/TU98lG6a"
    },
    {
        "title": "Ground Beef 'Wellington' with Fennel",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1/2 cup diced onion ADVERTISEMENT",
            "1/4 cup fennel, chopped ADVERTISEMENT",
            "1 tablespoon garlic, minced ADVERTISEMENT",
            "1/2 teaspoon fennel seed ADVERTISEMENT",
            "1/4 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1 eggs ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "2 tablespoons dry bread crumbs ADVERTISEMENT",
            "1 tablespoon dried parsley ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 (8 ounce) package refrigerated crescent rolls ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a baking sheet.\nHeat the vegetable oil in a skillet over medium heat. Stir in the onion, fennel, and garlic. Cook and stir until the fennel is tender, and the onion has softened and turned translucent, about 5 minutes. Stir in the fennel seed and red pepper flakes, and cook for 1 minute more. Meanwhile, beat the egg in a bowl, then mix in the ground beef, bread crumbs, parsley, and salt. Add the cooked vegetable mixture, and stir until combined.\nSeparate the crescent roll dough into two squares. Divide the meat mixture among the crescent roll squares, then seal the dough around the meat. Place seam-side-down onto the prepared baking sheet.\nBake in the preheated oven until the pastry has turned golden-brown, and the center of the pastries registers 160 degrees F (71 degrees C) on a kitchen thermometer, about 30 minutes. Slice and serve.\n",
        "picture_link": "RmoGIkvaACcJcRzFTtf6CGLQssYtls6"
    },
    {
        "title": "Southern Macaroni and Cheese Pie",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "2 cups uncooked elbow macaroni ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2 (12 ounce) cans evaporated milk ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "4 cups shredded Cheddar cheese ADVERTISEMENT",
            "1 pinch paprika, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 425 degrees F (220 degrees C).\nSpray a 9x13-inch casserole dish with cooking spray.\nFill a large pot with lightly salted water and bring to a boil. Stir in the macaroni and return to a boil. Cook pasta uncovered, stirring occasionally, until it has cooked through but is still slightly firm, about 8 minutes; drain.\nSlowly melt butter in a large pot over low heat. Stir in evaporated milk and black pepper; cook until heated through.\nWhisk eggs in a bowl until smooth; whisk about 1/2 cup of the evaporated milk mixture into the eggs, 1 tablespoon at a time, until thoroughly incorporated. Whisk the egg mixture back into the saucepan with evaporated milk mixture. Continue to heat gently, whisking constantly, until the evaporated milk mixture almost comes to a simmer and the sauce thickens.\nGently mix salt and cooked macaroni into the sauce and stir to combine.\nSpoon 1/4 of the macaroni mixture in a layer into the bottom of the prepared casserole dish and top with 1 cup shredded Cheddar cheese. Repeat layers three more times; top last cheese layer with paprika to taste.\nBake in the preheated oven until casserole is bubbling, about 20 minutes.\n",
        "picture_link": "hgwFZKUQublCrS5dIoMOIR1VP8Ma8ai"
    },
    {
        "title": "Pasta/Pizza Sauce",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "1/4 teaspoon dried oregano ADVERTISEMENT",
            "1/4 teaspoon dried basil ADVERTISEMENT",
            "2/3 cup water ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "2 tablespoons red wine ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In large skillet, saute garlic in oil until golden. Add tomato paste, sugar, oregano, basil, water, cheese and wine. Season with salt and pepper and simmer 10 minutes over medium-low heat.\n",
        "picture_link": "u6ACiH6MkHN7gDo/Py/F3qJbZfZmalq"
    },
    {
        "title": "Barbeque Style Braised Short Ribs",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "5 pounds lean beef short ribs, cut into 3-inch pieces ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon fresh ground black pepper ADVERTISEMENT",
            "1 large onion, cut into thick slices and separated into rings ADVERTISEMENT",
            "5 carrots, peeled and cut into chunks ADVERTISEMENT",
            "4 cloves garlic, coarsely chopped ADVERTISEMENT",
            "1 (16 ounce) can tomato sauce ADVERTISEMENT",
            "1 cup barbeque sauce ADVERTISEMENT",
            "1 cup beef broth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nHeat oil over medium heat in a large, heavy, oven-safe pot or Dutch oven, and brown the ribs on all sides, about 5 minutes, working in batches if necessary. Sprinkle ribs with salt and black pepper as they brown. Transfer cooked ribs to paper towels to blot up extra oil.\nStir the onion rings and carrots into the same pot, and cook and stir until the onions turn translucent and start to brown, about 8 minutes. Stir in the garlic, and cook until fragrant, about 1 more minute. Mix in tomato sauce, barbeque sauce, and beef broth; bring the sauce to a boil, and simmer for 1 minute to blend flavors. Stir in the browned ribs.\nCover the pot, and bake in the preheated oven until the rib meat is very tender, about 2 1/2 hours. Turn the ribs occasionally while cooking. Season to taste with salt and black pepper before serving hot.\n",
        "picture_link": "1Fjzxm81vdd5WcueAjTHa5M/n/kTnmm"
    },
    {
        "title": "Easy Cheese and Ham Scalloped Potatoes",
        "ingredients": [
            "5 Yukon Gold potatoes, peeled and thinly sliced ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "1 1/2 cups cubed fully cooked ham ADVERTISEMENT",
            "1 quart heavy cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace the potatoes, onion, garlic, Cheddar cheese, and ham in a 9x13 inch baking dish. Gently stir until well combined. Pour the cream over the potato mixture.\nBake in the preheated oven until the potatoes are tender, about 1 hour.\n",
        "picture_link": "kUczrUkMv7DMBzOUUm4qiqqk9Rx4Hyu"
    },
    {
        "title": "Cabbage Rolls",
        "ingredients": [
            "2 cups uncooked long-grain rice ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "2 large heads savoy cabbage ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "3/4 cup uncooked long-grain rice ADVERTISEMENT",
            "1 pound extra-lean ground beef ADVERTISEMENT",
            "1/2 pound pork sausage ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "2 teaspoons dried dill weed ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon white sugar ADVERTISEMENT",
            "1 (26 ounce) can condensed tomato soup ADVERTISEMENT",
            "1 (28 ounce) can whole peeled tomatoes, with liquid ADVERTISEMENT",
            "8 bay leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Wash rice thoroughly. In a medium saucepan, combine 2 cups rice and 4 cups water. Bring to boil; reduce heat, cover and simmer for 20 minutes or until all of the water is absorbed.\nIn the meantime, remove the core from the cabbages using a thin, long knife. Place 1 cabbage in a microwave proof container with a lid with core side down. Pour 1/2 cup water into the container with the cabbage, cover and microwave on HIGH (full power) for 10 minutes. Carefully turn cabbage over and cook covered for an additional 10 minutes. When cabbage is cooked, let sit until it is cool enough to handle. Separate leaves carefully, removing any tough ribs. Cook the second cabbage in the same manner.\nDivide chopped onions in half. Saute one half of the onions in 3 tablespoons butter; cook just until translucent (do not brown). In a large mixing bowl, mix together both the cooked and uncooked rice, cooked and uncooked onions, ground beef, pork sausage, garlic, dill weed, salt, black pepper and sugar and mix well to blend.\nSpoon about 2 tablespoons of mixture onto each cabbage leaf. Bring one end of cabbage leaf over mixture, roll and tuck ends in to prevent any filling from falling out.\nPreheat oven to 350 degrees F (175 degrees C). Prepare two 9x13 inch casserole dishes by placing some left over cabbage leaves in bottom of each. Arrange cabbage rolls in a single layer tight against each other.\nIn a food processor or blender, process condensed tomato soup and tomatoes. Pour tomato mixture over the cabbage rolls until just covered. Place 4 bay leaves on top of sauce in each dish. Cover each dish tightly with aluminum foil.\nBake in a preheated 350 degrees F (175 degrees C) oven for 2 hours. Once cooked, remove the dishes from the oven and let cool for 15 minutes before removing aluminum foil. Serve hot.\n",
        "picture_link": "NrlRVQ9Y5phg7xzwAPmIQpcckY36lCC"
    },
    {
        "title": "Giant Chocolate Chip Cookies",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/3 cup brown sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "1/2 cup coarsely chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl, cream together the butter, white sugar and brown sugar until smooth. Beat in the egg, then stir in the vanilla. Combine the flour and baking soda, stir into the creamed mixture. Fold in the chocolate chips and walnuts. Drop by rounded ice cream scoops onto a cookie sheet, and press down slightly to flatten. Cookies should be about 2 inches apart.\nBake for 11 to 14 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n",
        "picture_link": "0ekIkQTE5bcQ1ol7qS3Uhm/SnxUdSxe"
    },
    {
        "title": "Cinnamon-Peach Cottage Cheese Pancakes",
        "ingredients": [
            "4 eggs ADVERTISEMENT",
            "1 cup cottage cheese ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "1 peach, shredded ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "3/4 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix eggs, cottage cheese, milk, vanilla, butter, and peach in a large bowl. Combine flour, sugar, salt, baking soda, and cinnamon in a small bowl. Stir flour mixture into the cottage cheese mixture until just combined.\nHeat a lightly oiled griddle over medium-high heat. Drop batter by large spoonfuls onto the griddle, and cook until bubbles form and the edges are dry. Flip, and cook until browned on the other side. Repeat with remaining batter.\n",
        "picture_link": "Xp.sBGfBeo1g29UqxSsWZ9CNJxXayOG"
    },
    {
        "title": "Anne's Fabulous Grilled Salmon",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "1/2 teaspoon grated fresh ginger root ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "1/3 cup chopped fresh basil leaves ADVERTISEMENT",
            "1 tablespoon finely chopped shallots ADVERTISEMENT",
            "1 (3 pound) salmon fillet, with skin ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Make a pan out of aluminum foil by doubling up layers of foil large enough to hold your fillet. Place the foil onto a cookie sheet. Lay the fillet onto the foil with the skin side down. In a small bowl, stir together the oil, soy sauce, Worcestershire sauce, lemon juice, ginger, honey, basil and shallots. Pour over the salmon and let it marinate while you preheat the grill, about 20 minutes.\nPreheat a grill for medium-low heat. Slide the foil with the salmon off of the cookie sheet and onto the grill. Cover with the lid and grill the fillet for 10 minutes per inch of thickness, about 20 minutes. Salmon should be able to flake with a fork, but not be too dry. When you serve the salmon, the skin will stick to the foil and your grill will remain clean. Simply slice and use a spatula to scoop the fillet off of the skin to serve.\n",
        "picture_link": "M0DjgNcmVfnKqMkC.z1tz6cYBvTYUcW"
    },
    {
        "title": "Teena's Overnight Southern Buttermilk Biscuits",
        "ingredients": [
            "4 cups self-rising flour ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "2/3 cup shortening ADVERTISEMENT",
            "2 cups buttermilk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sift together the flour and sugar in a large bowl. Cut in the shortening until the mixture has a fine crumb or cornmeal texture. Stir in the buttermilk with a fork until a soft dough forms.\nTurn the dough out onto a floured surface, pulling off any pieces sticking inside the bowl. Gather dough into a ball and knead about 20 times, until smooth and elastic. Wrap in plastic wrap and refrigerate overnight.\nPreheat oven to 425 degrees F (220 degrees C).\nWorking on a floured surface, roll or pat the dough out to 1 inch thickness. Cut into rounds with a 2 inch biscuit cutter, or the floured rim of a glass, by pressing straight down and up. Twisting the cutter will prevent the biscuits from rising as high. Place biscuits about 1 inch apart on an ungreased baking sheet, and allow to rest a few minutes.\nBake in preheated oven until lightly brown, 12 to 15 minutes. Cool on a wire rack. Serve warm.\n",
        "picture_link": "0rIOhZmRkxD2QDaVugnfheUcB9V0Q2y"
    },
    {
        "title": "Cheddar-Thyme Flaky Biscuits",
        "ingredients": [
            "2 cups flour ADVERTISEMENT",
            "4 teaspoons baking powder ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon cream of tartar ADVERTISEMENT",
            "1/2 cup butter or margarine ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 tablespoon chopped fresh thyme ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 425 degrees F (220 degrees C).\nIn a medium bowl, stir together the flour, baking powder, sugar, salt and cream of tartar. Cut in butter using a pastry cutter or a fork until it is the size of peas. Make a well in the center of the mixture and measure the milk, cheese and thyme into the bowl. Gently mix until a soft dough forms.\nRoll or pat out on a floured surface to 3/4 inch thick. Cut into circles and place on a baking sheet.\nBake for 10 minutes in the preheated oven, or until the bottoms of the biscuits are golden brown.\n",
        "picture_link": "qDadbdF5uI/gOBXPe98TlFzqFwYzhO6"
    },
    {
        "title": "Easy Grilled Lemon Chicken",
        "ingredients": [
            "1/2 cup fresh lemon juice ADVERTISEMENT",
            "1/2 cup soy sauce ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "4 (6 ounce) skinless, boneless chicken breast halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse chicken breasts and pat dry with paper towels. Stir together the lemon juice, soy sauce, ginger, and black pepper in a bowl; pour into a large, resealable plastic bag. Add the chicken breasts, seal the bag, and massage to evenly coat chicken with lemon juice mixture. Place in refrigerator to marinate at least 20 minutes, or up to 24 hours.\nPreheat an outdoor grill for medium-high heat. Lightly oil grill grate, and place about 4 inches from heat source.\nDrain and discard marinade from the bag, and place chicken on preheated grill. Cook until chicken is no longer pink and juices run clear, 6 to 8 minutes on each side.\n",
        "picture_link": "yNcacZiA.qQvO81xS7pEv6PiBYlrI9O"
    },
    {
        "title": "Cherry Enchiladas",
        "ingredients": [
            "1/2 cup water ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "5 (10 inch) flour tortillas ADVERTISEMENT",
            "1 (21 ounce) can cherry pie filling ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1 tablespoon crushed sliced almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grease a 9x13 inch baking dish. Combine the water, butter and 1/2 cup of sugar in a small saucepan and bring to a boil. Place a few spoonfuls of cherry pie filling just slightly off center of each tortilla. Roll up and place seam side down in the baking dish. Pour the hot liquid over the 'enchiladas' making sure to coat the tops completely. The mixture will be watery. Cover and refrigerate overnight.\nPreheat the oven to 375 degrees F (190 degrees C). Combine 2 tablespoons sugar, cinnamon and almonds in a small bowl or cup; sprinkle over the top of the enchiladas.\nBake for 35 to 40 minutes in the preheated oven, or until outside edges of the tortillas are golden brown. Let cool slightly before serving.\n",
        "picture_link": "J1bwE24K4qSzhKvNZD7tTmHlR3a7hGW"
    },
    {
        "title": "No Bake Sugar Free Cheese Cake",
        "ingredients": [
            "1 3/4 cups graham cracker crumbs ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1 (.6 ounce) package sugar free lemon flavored Jell-O® ADVERTISEMENT",
            "1 cup boiling water ADVERTISEMENT",
            "1 (8 ounce) package reduced fat cream cheese ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 cup frozen light whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). In a medium bowl, combine graham cracker crumbs, butter and cinnamon. Mix well and press into the bottom of a 9 inch square pan. Bake in preheated oven for 8 to 10 minutes. Remove from oven and allow to cool.\nDissolve lemon gelatin in boiling water. Let cool until thickened, but not set. In a large bowl, beat cream cheese and vanilla until smooth. Blend in lemon gelatin. Fold in whipped topping.\nPour filling into crust. Sprinkle top with graham cracker crumbs. Refrigerate over night.\n",
        "picture_link": "JVxY3J2Gd1Cods90JCUBLxqAd3Sh9Sy"
    },
    {
        "title": "Party Kielbasa",
        "ingredients": [
            "2 pounds kielbasa sausage ADVERTISEMENT",
            "2 cups ketchup ADVERTISEMENT",
            "2 cups grape jelly ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Slice kielbasa into strips or circles.\nPour ketchup and jelly into a slow cooker. Turn the heat to a medium temperature, stir occasionally while the jelly and ketchup melt together. When the mixture forms into a thin glaze, add the kielbasa and cook until the kielbasa is hot.\n",
        "picture_link": "3pY2QSMnnKuoWH2dz1oSnziXzLm9y6K"
    },
    {
        "title": "Vanilla Ice Cream",
        "ingredients": [
            "2 cups heavy whipping cream ADVERTISEMENT",
            "2 cups half-and-half cream ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine the heavy cream and the half and half. Gradually whisk in the sugar until blended.\nWhisk in the vanilla. Refrigerate, covered, until very cold, at least 3 hours or as long as 3 days.\nWhisk the mixture to blend and pour into the canister of an ice cream maker. Freeze according to the manufacturer's directions. Eat at once or transfer to a covered container and freeze up to 8 hours.\n",
        "picture_link": "6wIXle/stWi.0F63zjZg8FrkDq6vTqW"
    },
    {
        "title": "Chocolate Coconut Bars",
        "ingredients": [
            "1 1/2 cups graham cracker crumbs ADVERTISEMENT",
            "1 2/3 cups sweetened condensed milk ADVERTISEMENT",
            "1/2 cup semisweet chocolate chips ADVERTISEMENT",
            "1 1/2 cups flaked coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9 inch square baking pan.\nIn a large bowl, mix together the graham cracker crumbs, sweetened condensed milk, chocolate chips and coconut until well blended. Press dough evenly into the prepared baking pan.\nBake for 30 minutes. Let cool before cutting into bars.\n",
        "picture_link": "bvZo0xBtehuPm01yOtbvPwtqDs5aLG6"
    },
    {
        "title": "Heather's Best Ever Baked Chicken",
        "ingredients": [
            "6 bone-in chicken breast halves, with skin ADVERTISEMENT",
            "1/2 cup ranch-style salad dressing ADVERTISEMENT",
            "1 cup bread crumbs ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1 teaspoon cracked black pepper ADVERTISEMENT",
            "1 teaspoon sage ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Marinate the chicken in the ranch dressing overnight (or for at least 4 hours).\nPreheat the oven to 450 degrees F (230 degrees C).\nCombine the bread crumbs, Parmesan cheese, black pepper, sage and salt and mix well. Coat the marinated breasts in the breading mixture and place in a 9x13 inch baking dish. Bake in the preheated oven for 20 minutes, then REDUCE HEAT to 350 degrees F (175 degrees C) and bake for 30 minutes or until done and juices run clear.\n",
        "picture_link": "Cl6gu4fMbG1VvlzgWSZEccbeae3HRCm"
    },
    {
        "title": "Southwestern Haystacks",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 (16 ounce) can diced tomatoes ADVERTISEMENT",
            "1 (15 ounce) can whole kernel corn ADVERTISEMENT",
            "1 (15 ounce) can kidney beans, drained ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 (16 ounce) package macaroni ADVERTISEMENT",
            "1 (8 ounce) container sour cream ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet over medium-high heat, brown hamburger. Drain fat, add tomatoes, corn, and beans and heat through. Season with garlic powder, salt and pepper.\nCook elbow macaroni in a large pot of boiling water until tender. Remove from heat and drain.\nTop macaroni with meat mixture, grated cheddar, and a dollop of sour cream.\n",
        "picture_link": "XKP1.82egiSE1EhQnKaojrHt5WYXOPG"
    },
    {
        "title": "Granny's Brownies",
        "ingredients": [
            "3/4 cup butter ADVERTISEMENT",
            "2 cups packed brown sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "4 (1 ounce) squares unsweetened chocolate, melted ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 250 degrees F (120 degrees C). Grease an 8x8 inch baking pan.\nIn a large bowl, cream together the butter, brown sugar, and eggs until light and fluffy. Stir in the unsweetened chocolate and vanilla until well blended. Mix in the flour, and then the walnuts. Spread batter evenly into the prepared pan.\nBake for 1 hour in the preheated oven, or until a toothpick inserted into the center comes out clean. Cool in the pan on a wire rack before cutting into bars.\n",
        "picture_link": "xjiRFnR233bI.W.21PfvF6B6GQNvkqy"
    },
    {
        "title": "Yummy Meatloaf",
        "ingredients": [
            "2 pounds ground beef ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "1 (10 ounce) package saltine crackers, crushed ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 tablespoon steak sauce ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, combine the beef, onion, crushed crackers, salt, ground black pepper, steak sauce, eggs and water and mix well. Transfer to an ungreased 9x13 inch baking dish. Form into a loaf about 6x10 inches.\nBake at 350 degrees F (175 degrees C) for 1 hour, or until center is completely cooked.\n",
        "picture_link": "7StUKolYp6sRgubXDJX85lwIVFW/SR."
    },
    {
        "title": "Bodacious Brownies",
        "ingredients": [
            "1/2 cup butter or margarine ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/3 cup unsweetened cocoa powder ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "3/4 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup chopped walnuts (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease an 8x8 inch baking pan.\nMelt butter in medium sauce pan. Remove from heat, and stir in sugar and cocoa. Beat in the eggs one at a time, then stir in the vanilla. Combine the flour, baking powder, and salt; stir into the chocolate mixture until just blended. Fold in walnuts, if desired. Spread the batter evenly into the prepared pan.\nBake for 25 minutes in the preheated oven, or until a wooden pick inserted into the center comes out clean. Cool in pan on a wire rack.\n",
        "picture_link": "Z.g0uroYI6IUPUGqu6NfjzmRTEXQbkO"
    },
    {
        "title": "Jewish Apple Cake II",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "2 1/2 cups white sugar ADVERTISEMENT",
            "3 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3 apples - peeled, cored and sliced ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "2 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "5 tablespoons white sugar ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour one 10 inch tube pan.\nSprinkle sliced apples with 5 tablespoons white sugar and the ground cinnamon. Toss to coat and set aside.\nMix the flour, eggs, 2 1/2 cups sugar, baking powder, salt, vegetable oil, orange juice and vanilla until well blended. Batter will be fairly stiff.\nPour 1/2 of the batter into the prepared pan. Place the apple mixture over the batter then pour the remaining batter over the top.\nBake at 350 degrees F (175 degrees C) for 60 to 80 minutes. Let cake cool in pan.\n",
        "picture_link": "7R4WIQWvbcFghTtFViO/q5tLuyNOoPe"
    },
    {
        "title": "Dressing for Potato Salad",
        "ingredients": [
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "2 teaspoons prepared mustard ADVERTISEMENT",
            "1 tablespoon ketchup ADVERTISEMENT",
            "1 1/2 teaspoons Worcestershire sauce ADVERTISEMENT",
            "1/2 cup diced onion (optional) ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together the mayonnaise, sour cream, mustard, ketchup, Worcestershire sauce, onion and salt and pepper. Refrigerate until ready to toss with potatoes.\n",
        "picture_link": "N8y535aGtBGuwR/N0x3EhSFypF67D92"
    },
    {
        "title": "Yummy Garlic Croutons",
        "ingredients": [
            "1 (1 pound) loaf day old French bread ADVERTISEMENT",
            "2 tablespoons garlic powder ADVERTISEMENT",
            "2 tablespoons dried basil ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nCut bread into small cubes and place onto a shallow baking pan or cookie sheet.\nDrizzle oil over the bread to lightly cover and sprinkle with garlic powder and basil.\nBake at 400 degrees F (200 degrees C) for 5 to 10 minutes or until lightly brown and toasted.\n",
        "picture_link": "OY8TYVKXrsg2LxQKWK6Oe40aNj0IU4a"
    },
    {
        "title": "Olive Cheese Melts",
        "ingredients": [
            "1 cup black olives, chopped ADVERTISEMENT",
            "1/3 cup green onions, chopped ADVERTISEMENT",
            "1 1/2 cups shredded Cheddar cheese ADVERTISEMENT",
            "1/2 teaspoon curry powder ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "8 English muffins, split in half ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nIn a medium-size mixing bowl, combine olives, green onions, Cheddar cheese, curry powder, mayonnaise, and salt. Mix well.\nSpread mixture on English muffins. Cut the English muffins into fourths. Note: If you want to freeze these, now is the time! Arrange the muffin pieces on a cookie sheet.\nBake at 400 degrees F (200 degrees C) for 10 minutes.\n",
        "picture_link": "aAY/uMjoepwcI.onpn0SVPBoC8NsVGO"
    },
    {
        "title": "Pumpkin Cookies III",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup shortening ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 cup canned pumpkin ADVERTISEMENT",
            "1/2 cup raisins (optional) ADVERTISEMENT",
            "1/2 cup chopped walnuts (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nIn a large bowl, cream together sugar, egg, shortening, and vanilla. Sift together flour, baking soda, baking powder, salt, and cinnamon; stir into the creamed mixture. Stir in the pumpkin, raisins, and walnuts. Drop dough by teaspoonfuls onto the prepared cookie sheets.\nBake 10-15 minutes in the preheated oven.\n",
        "picture_link": "l0txuXcYtFXm8o2ZO2hlJ0dAroHt5M."
    },
    {
        "title": "Wild Rice And Chicken Soup",
        "ingredients": [
            "3 (10.5 ounce) cans chicken broth ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1/2 cup wild rice ADVERTISEMENT",
            "1/2 cup chopped green onions ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon poultry seasoning ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "2 cups heavy cream ADVERTISEMENT",
            "2 cups cubed, cooked chicken meat ADVERTISEMENT",
            "1 (4 ounce) jar sliced pimento peppers, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the broth, water, and rice in a large soup pot, and bring to a boil. Reduce heat, and cover. Simmer for 35 to 40 minutes, until rice is tender.\nSaute onions in butter or margarine in a medium saucepan, over low heat. Stir in flour, salt, poultry seasoning, and pepper. Cook, stirring constantly, until mixture is bubbly and thick. Stir in cream. Cook for 6 minutes, or until mixture thickens slightly, stirring constantly. Stir into broth.\nAdd cubed chicken and pimientos. Heat through.\n",
        "picture_link": "87LIfu5eqfHSFauSB3SRL5PsyBOvGjq"
    },
    {
        "title": "Steak and Rice",
        "ingredients": [
            "1 1/2 pounds round steak ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 green bell pepper ADVERTISEMENT",
            "1 (29 ounce) can diced tomatoes ADVERTISEMENT",
            "4 tablespoons cornstarch ADVERTISEMENT",
            "1 cube beef bouillon cube ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 cup white rice ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Trim any fat from round steak and slice meat into thin 2 to 3 inch long strips. Remove the seeds and core from the green bell pepper, and slice into thin 3 inch long strips.\nIn a large frying pan over medium to high heat add oil and cook meat until medium rare, add peppers and continue cooking until meat is browned.\nReduce heat to simmer and add tomatoes, soy sauce, garlic powder, black pepper and ginger. Cover and simmer 10 minutes.\nDissolve bullion cube and corn starch in 2 cups water and stir well before adding to simmering beef. Cover and simmer 10 minutes, stirring occasionally, until sauce resembles the consistency of gravy. Remove from heat and serve over a bed of rice.\nTo cook rice: In a saucepan, bring 2 cups of water to a boil. Stir in 1 cup of rice. Cover and reduce heat to a simmer. Simmer for 20 minutes.\n",
        "picture_link": "laDRPBB/mW705CEkla4QDyO7Gi80T3O"
    },
    {
        "title": "Grilled Marinated Salmon",
        "ingredients": [
            "1/4 cup soy sauce ADVERTISEMENT",
            "1/4 cup rice wine vinegar ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 teaspoon mustard powder ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "2 pounds salmon fillets ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, combine the soy sauce, vinegar, sugar, oil, mustard powder, ginger and ground black pepper.\nPlace the salmon in a shallow, nonporous dish and pour the marinade over the salmon. Cover and marinate in the refrigerator for at least 1 hour, turning occasionally.\nPreheat an outdoor grill for medium high heat and lightly oil grate.\nGrill the fish for about 3 to 4 minutes per side, or to desired doneness.\n",
        "picture_link": "CJNFIFInZhxvcgw7rQeVNFoDDFkYU7i"
    },
    {
        "title": "Chicken and Summer Squash",
        "ingredients": [
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "3/4 pound yellow squash, sliced ADVERTISEMENT",
            "3/4 pound zucchinis, sliced ADVERTISEMENT",
            "1 medium tomato - peeled, seeded and chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large nonstick skillet, melt butter in the oil over medium high heat. Season chicken with half of the salt and half of the pepper, and add it to skillet. Cook until lightly browned, about 2 minutes per side. Transfer to large plate or platter, and cover to keep warm.\nPour off fat from skillet, and add squash, zucchini, and tomato. Season with remaining salt and pepper. Cook and stir over medium-high heat until squash is slightly softened, about 3 minutes. Reduce heat, and return chicken to skillet. Cover partially. Cook until squash is soft, and chicken is white throughout but still juicy, about 5 minutes longer.\nTransfer chicken to platter, and cover with foil to keep warm. Raise heat to high. Cook vegetable mixture, stirring often, until almost all of the liquid has evaporated, about 2 minutes. Arrange vegetables around chicken, and serve.\n",
        "picture_link": "gFgeuvptWt86.DW5vKvhDmXBsJvDyJ6"
    },
    {
        "title": "Chocolate Covered Caramels",
        "ingredients": [
            "CARAMELS ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "2 1/4 cups brown sugar ADVERTISEMENT",
            "1 cup light corn syrup ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "CHOCOLATE ADVERTISEMENT",
            "1 pound milk chocolate ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grease an 8 x 8 inch square pan.\nIn a heavy 4 quart saucepan melt butter over medium heat; add brown sugar, corn syrup and milk. Stirring constantly, heat to 242 to 248 degrees F (116 to 120 degrees C), or until a small amount of syrup dropped into cold water forms a firm but pliable ball. Remove from heat and stir in vanilla extract. Pour into prepared pan.\nWhen caramel has cooled and set, cut into 1 inch squares. Chill in refrigerator until firm.\nMelt chocolate with 1 tablespoon butter in the top of a double boiler or in a bowl in the microwave. Stir until smooth.\nDip caramel squares in chocolate and place on wax paper to cool.\n",
        "picture_link": "DdWcA5mUiPd5AUH6KhGi8XGCQxmBUka"
    },
    {
        "title": "Lit'l Smokies® Mummy Dogs",
        "ingredients": [
            "32 Hillshire Farm Lit'l Smokies® ADVERTISEMENT",
            "1 (8 ounce) can refrigerated crescent dough rolls ADVERTISEMENT",
            "Mustard or ketchup, if desired ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F.\nUnroll dough, separate at perforations, creating 4 rectangles. Press perforations to seal.\nWith a knife or pizza cutter cut each rectangle lengthwise into 8 strips making a total of 32 strips. Wrap one strip of dough around each Lit'l Smokies(R) stretching dough slightly to look like bandages, leaving tip exposed to create face. Place on ungreased cookie sheet.\nBake 12 to 14 minutes or until golden brown. Draw features on tip of Lit'l Smokies(R) to create face. Serve with mustard or ketchup, if desired.\n",
        "picture_link": "a1LvcOAILNmvCeVXWT9jZBlPPN.Pq4y"
    },
    {
        "title": "Mississippi Six",
        "ingredients": [
            "1 (1 pound) loaf round bread ADVERTISEMENT",
            "1 (8 ounce) package shredded Cheddar cheese ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 1/2 cups sour cream ADVERTISEMENT",
            "1 (4 ounce) jar dried beef, chopped ADVERTISEMENT",
            "1/3 cup chopped green chile peppers ADVERTISEMENT",
            "1/2 cup chopped green onions ADVERTISEMENT",
            "1/2 teaspoon Worcestershire sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCut top off round bread loaf. Scoop out bread from the interior of the loaf, leaving a hollowed shell. Reserve top and removed bread.\nIn a medium bowl, mix together Cheddar cheese, cream cheese, sour cream, dried beef, green chile peppers, green onions and Worcestershire sauce. Transfer the mixture to the hollowed bread. Replace top of bread.\nWrap bread with foil and bake in the preheated oven 90 minutes. Serve with pieces of the scooped out bread and crackers.\n",
        "picture_link": "Ce7SF85OlRA8dzRMgv/d6d/xxaAS3N."
    },
    {
        "title": "Indian Relish",
        "ingredients": [
            "2 red bell peppers, chopped ADVERTISEMENT",
            "1 sweet onion, peeled and chopped ADVERTISEMENT",
            "1 cup white wine vinegar ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 tablespoon crushed red pepper flakes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan over medium heat, mix together red bell peppers, onion, white wine vinegar, sugar and crushed red pepper flakes. Bring to a boil, then reduce heat to simmer. Stirring occasionally, cook 30 minutes, or until thickened. Refrigerate 4 hours or overnight before serving.\n",
        "picture_link": "rQzchloWLtLoWRfg40mee/AZEYPnqCG"
    },
    {
        "title": "Campbell's® Swiss Vegetable Casserole",
        "ingredients": [
            "1 (10.75 ounce) can Campbell's® Condensed Cream of Mushroom Soup (Regular, 98% Fat Free or 25% Less Sodium) ADVERTISEMENT",
            "1/3 cup sour cream ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 (16 ounce) bag frozen vegetable combination (broccoli, cauliflower, carrots), thawed ADVERTISEMENT",
            "1 (2.8 ounce) can French-fried onions ADVERTISEMENT",
            "1/2 cup shredded Swiss cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir soup, sour cream, black pepper, vegetables, 2/3 cup onions and 1/4 cup cheese in 2-quart casserole. Cover casserole.\nBake at 350 degrees F 40 minutes or until vegetables are tender. Stir vegetable mixture.\nTop with remaining onions and cheese. Bake 5 minutes or until cheese is melted.\n",
        "picture_link": "AnERGy981BaXtdWwDX9ykFGJoDDTs3W"
    },
    {
        "title": "Cinnamon Pumpkin Waffles",
        "ingredients": [
            "1 cup whole wheat flour ADVERTISEMENT",
            "1/4 cup wheat germ ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon pumpkin pie spice ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "1/2 cup pumpkin puree ADVERTISEMENT",
            "2 tablespoons melted butter ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/2 cup unsweetened applesauce ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat a waffle iron according to manufacturer's instructions. Combine flour, wheat germ, sugar, cinnamon, pumpkin pie spice, nutmeg, salt, and baking powder in a bowl. Set aside.\nBeat together milk, pumpkin puree, butter, oil, applesauce, whole egg, and egg white. Stir flour mixture into the pumpkin mixture along with the pecans.\nLadle the batter onto the preheated waffle iron. Cook the waffles until golden and crisp, 5 to 7 minutes.\n",
        "picture_link": "2/6CA8/ZnFaHRseMVUp3TwrpfyIdF.6"
    },
    {
        "title": "Super Easy Egg Casserole",
        "ingredients": [
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "6 eggs, whisked ADVERTISEMENT",
            "6 slices bacon, diced ADVERTISEMENT",
            "2 slices bread, cubed ADVERTISEMENT",
            "1/3 red bell pepper, diced ADVERTISEMENT",
            "2 green onions, chopped ADVERTISEMENT",
            "3 tablespoons milk ADVERTISEMENT",
            "1/2 teaspoon minced garlic, or to taste (optional) ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nStir Cheddar cheese, eggs, bacon, bread, red bell pepper, green onion, milk, garlic, salt, and black pepper together in a bowl until well-combined; pour into prepared baking dish.\nBake in the preheated oven until eggs are set, 20 to 25 minutes.\n",
        "picture_link": "ENWtxCuvzilp52i35UyBt5pnKGqc016"
    },
    {
        "title": "Southern Cornbread Dressing",
        "ingredients": [
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 (16 ounce) package dry corn bread mix ADVERTISEMENT",
            "1 (1 pound) loaf day-old white bread, torn into small pieces ADVERTISEMENT",
            "4 tablespoons margarine ADVERTISEMENT",
            "1/2 cup chopped onions ADVERTISEMENT",
            "1/2 cup chopped celery ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1/8 teaspoon garlic powder ADVERTISEMENT",
            "2 teaspoons poultry seasoning ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the chicken breast halves in a large saucepan with enough water to cover. Bring to a boil. Cook 1 hour, or until the meat is tender and easily shredded. Shred chicken and set aside. Reserve 4 to 6 cups of the remaining broth.\nPrepare an 8x8 inch pan of cornbread according to package directions. Crumble the corn bread into a large bowl. Mix in the white bread.\nPreheat oven to 350 degrees F (175 degrees C).\nIn a medium saucepan over medium heat, melt the margarine and stir in the onions and celery. Slowly cook, stirring occasionally, until tender.\nStir the onions and celery into the bread mixture. Mix in the chicken, 4 cups reserved broth, cream of chicken soup, garlic powder, poultry seasoning, pepper and eggs. Blend with a potato masher until the mixture is the consistency of gelatin. Use more of the reserved broth as necessary to attain desired consistency. Transfer to a 9x13 inch baking dish.\nBake in the preheated oven 30 minutes, or until golden brown.\n",
        "picture_link": "C2EX2FJjlbTEoBgGKOzYH951P3xsgSG"
    },
    {
        "title": "Easy Taco Casserole",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 cup salsa ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "2 tablespoons chili powder ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "2 cups crushed tortilla chips, divided ADVERTISEMENT",
            "4 ounces shredded Cheddar cheese, divided ADVERTISEMENT",
            "4 ounces shredded Monterey Jack cheese, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCook and stir ground beef in a large skillet over medium-high heat until crumbly, evenly browned, and no longer pink, 5 to 7 minutes. Drain and discard any excess grease. Stir salsa, onion, mayonnaise, chili powder, and cumin into the beef. Remove from heat.\nSpread about half the ground beef mixture into the bottom of a 2-quart casserole dish. Spread about half the tortilla chips in a layer atop the beef mixture. Layer about half of each of the Cheddar and Monterey Jack cheeses over the tortilla chip layer. Repeat layers with remaining ingredients, ending with Monterey Jack cheese. Cover dish with aluminum foil.\nBake in preheated oven until the cheese is melted in the middle, about 30 minutes.\n",
        "picture_link": "JmXGmDReXlOFsQuFrH6BAeQIcXQNHLa"
    },
    {
        "title": "Mari's Banana Cupcakes",
        "ingredients": [
            "3 bananas, mashed ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs, lightly beaten ADVERTISEMENT",
            "3/4 cup vegetable oil ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "3 tablespoons buttermilk ADVERTISEMENT",
            "1 cup chopped pecans (optional) ADVERTISEMENT",
            "1 cup confectioners' sugar, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C). Grease 14 muffin cups.\nLightly beat bananas and white sugar together in a bowl until smooth; add eggs, one at a time, until incorporated. Beat in vegetable oil until well blended, 1 to 2 minutes. Stir in flour, baking soda, and buttermilk; mix well. Fold in pecans. Pour batter into the prepared muffin cups.\nBake in the preheated oven until a toothpick inserted in the center of a cupcake comes out clean, 20 to 30 minutes. Sprinkle cupcakes with confectioners' sugar.\n",
        "picture_link": "xv7mbrO6D2E8SwxBZqvns4gu0rOyRmG"
    },
    {
        "title": "Italian-Style Swiss Chard",
        "ingredients": [
            "1 bunch Swiss chard ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "4 cloves garlic, coarsely chopped ADVERTISEMENT",
            "1/8 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Wash the Swiss chard and cut into 1 inch strips. Separate the thick and tough stalk sections from the upper leafy strips.\nBring the water and 1 tablespoon of salt to a boil in a large saucepan.\nCook the stalk sections in the salted boiling water for 2 minutes. Stir in the leafy strips and cook until the leaves are wilted and the stalks are fork tender, about 6 minutes. Drain and set aside.\nHeat the olive oil, garlic, and red pepper flakes in a large skillet over medium heat until aromatic, about 3 minutes. Add the drained Swiss chard, cook and stir for 2 minutes; season with salt to taste.\n",
        "picture_link": "p0WI7cJ169pPl5cBgKt2hD5LfSHlHfK"
    },
    {
        "title": "Easy Tiramisu",
        "ingredients": [
            "3 egg yolks ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 1/8 cups mascarpone cheese ADVERTISEMENT",
            "24 ladyfingers ADVERTISEMENT",
            "1 1/2 cups brewed coffee ADVERTISEMENT",
            "1 tablespoon unsweetened cocoa powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, beat yolks with sugar and vanilla until smooth and light yellow. Fold mascarpone into yolk mixture. Set aside.\nDip ladyfingers briefly in coffee and arrange 12 of them in the bottom of an 8x8 inch dish. Spread half the mascarpone mixture over the ladyfingers. Repeat with remaining cookies and mascarpone. Cover and chill 1 hour. Sprinkle with cocoa just before serving.\n",
        "picture_link": "kwKVVJic4Mc96X3xPRZzmuUYbWqVixW"
    },
    {
        "title": "Cornbread Stuffing Southern Style",
        "ingredients": [
            "2 (8.5 ounce) packages dry corn muffin mix ADVERTISEMENT",
            "1 (8 ounce) can cream-style corn ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/2 cup plain yogurt ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 onion, finely chopped ADVERTISEMENT",
            "2 celery, finely chopped ADVERTISEMENT",
            "1 green bell pepper, finely chopped ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "2 teaspoons dried thyme ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "2 teaspoons dried oregano ADVERTISEMENT",
            "2 teaspoons salt, or to taste ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "3 cups chicken broth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease a 9x13 inch baking dish.\nIn a medium bowl combine muffin mix, corn, eggs, yogurt and milk; stir just until moistened. Pour into prepared pan.\nBake in preheated oven for 20 minutes, or until golden brown.\nMeanwhile, in a large saucepan over medium heat, melt butter and saute onion, celery, green pepper and garlic. When onions are tender stir in thyme, basil, oregano, salt, pepper, cayenne and broth. Bring to a boil and then remove from heat.\nCrumble the cornbread and stir into broth mixture; mix well. Add more broth or more bread, as necessary, to achieve desired consistency.\n",
        "picture_link": "maINb5QuJsSDjjtjGAxiIMqsl4xsIdq"
    },
    {
        "title": "Bacon, Egg, and Cheese Strata",
        "ingredients": [
            "12 thick slices white bread, cut into 1 inch cubes ADVERTISEMENT",
            "1/4 cup crumbled cooked bacon ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "1 1/2 cups chopped fresh mushrooms (optional) ADVERTISEMENT",
            "12 eggs ADVERTISEMENT",
            "2 1/2 cups half-and-half ADVERTISEMENT",
            "1 teaspoon Dijon mustard ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss cubed bread with bacon, cheese, and mushrooms, and pour into a 9x13 inch baking dish. Whisk together eggs, half-and-half, and mustard until smooth, then pour evenly over cubed bread. Cover dish with plastic wrap, and refrigerate overnight.\nPreheat oven to 350 degrees F (175 degrees C).\nRemove plastic wrap from the baking dish, and bake strata in preheated oven until the top is golden brown, and the eggs are set, about 1 hour. Let stand for 10 minutes before serving.\n",
        "picture_link": "W3fyKbaXiRjK7aliM9Xsf8HdgKer.Gy"
    },
    {
        "title": "Southern Style Thanksgiving Green Beans",
        "ingredients": [
            "2 quarts water ADVERTISEMENT",
            "4 pounds fresh green beans, trimmed and snapped into 1 1/2 inch pieces ADVERTISEMENT",
            "1 ham hock ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, finely chopped ADVERTISEMENT",
            "1/4 cup distilled white vinegar ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1/2 tablespoon black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the water in a large pot, and mix in the green beans, ham hock, onion, garlic, and vinegar. Season with salt and pepper. Bring to a boil, and cook 10 minutes.\nReduce heat to low, and simmer 4 hours. Remove the ham hock, and slice the meat into small pieces. Return meat to the beans, and serve.\n",
        "picture_link": "xrb1I/jvO2wUTRzsxGP0cW4uvfwxOai"
    },
    {
        "title": "Texas Slaw",
        "ingredients": [
            "1 (16 ounce) package coleslaw mix ADVERTISEMENT",
            "1 (7 ounce) can Mexican-style corn, drained ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "2 fresh jalapeno peppers, seeded and chopped ADVERTISEMENT",
            "1/2 cup chopped fresh cilantro ADVERTISEMENT",
            "1 cup Ranch-style salad dressing ADVERTISEMENT",
            "1/4 teaspoon ground cumin ADVERTISEMENT",
            "1/4 teaspoon ground coriander ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, toss together the coleslaw mix, corn, Cheddar cheese, jalapeno and cilantro. In a separate bowl, stir together the Ranch-style dressing, cumin, coriander, garlic powder and lime juice. Pour over the coleslaw mixture, and toss to coat. Serve right away, or refrigerate until serving.\n",
        "picture_link": "M1w2r9jWhTULtCMAlA/bd/2StENuOaG"
    },
    {
        "title": "Cheesy Pork Chops with Spicy Apples",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "1 pinch red pepper flakes ADVERTISEMENT",
            "1 apple, cored and sliced ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "4 pork chops ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "4 slices extra sharp Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare a grill for high heat.\nWhile the grill heats, melt the butter in a skillet over medium heat. Add the onion, and cook until soft. Season with red pepper flakes then add the sliced apple. Stir in the sugar and balsamic vinegar, and simmer for 5 minutes, or until apples are soft and golden.\nSeason the pork chops with salt and pepper. Grill for 3 to 5 minutes per side, depending on thickness. Spoon the onions and apples on top of the chops, and top with a slice of Cheddar cheese. Cover the grill, and cook for about 3 minutes until cheese is melted and bubbling.\n",
        "picture_link": "0O.3VWk3wJMf0YAS7Uf2EXZFFlglKoS"
    },
    {
        "title": "Grilled Salmon With Orange Glaze",
        "ingredients": [
            "1/2 cup orange marmalade ADVERTISEMENT",
            "2 teaspoons sesame oil ADVERTISEMENT",
            "2 teaspoons reduced-sodium soy sauce ADVERTISEMENT",
            "1/2 teaspoon grated fresh ginger root ADVERTISEMENT",
            "1 garlic clove, crushed ADVERTISEMENT",
            "3 tablespoons white rice vinegar (or other white vinegar) ADVERTISEMENT",
            "1 pound boneless, skinless salmon fillet, cut in four pieces ADVERTISEMENT",
            "6 scallions, thinly sliced with green (optional) ADVERTISEMENT",
            "1/4 cup toasted sesame seeds (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine marmalade, oil, soy sauce, ginger, garlic and vinegar. Heat grill. Brush glaze on each side of salmon; grill about 5 minutes on each side. Top with scallions and sesame\n",
        "picture_link": "XHbeb5bjbYfMF/rMck7ydtDzmjoT36W"
    },
    {
        "title": "Tomato Cucumber Salad II",
        "ingredients": [
            "4 medium fresh tomatoes, cut into 1 inch chunks ADVERTISEMENT",
            "1 large cucumber, sliced ADVERTISEMENT",
            "1/2 red onion, diced ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 teaspoons fresh ground black pepper ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, toss together the tomatoes, cucumber, onion, mayonnaise, and garlic. Season with pepper and salt.\n",
        "picture_link": "vuz91b5w0fina4iZlJUpNnhLXXxcTae"
    },
    {
        "title": "Rice-so-Nice",
        "ingredients": [
            "1 cup long grain white rice ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 (10.5 ounce) can beef broth ADVERTISEMENT",
            "1 (10.5 ounce) can condensed French onion soup ADVERTISEMENT",
            "1 (4 ounce) can sliced mushrooms ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C).\nPut the rice in a medium oven-proof bowl. Pour in the beef broth and French onion soup. Empty the can of mushrooms into the bowl, and place the stick of butter in without stirring. Cover the bowl with foil, a lid or oven-proof plate.\nBake for 1 hour in the preheated oven. Remove the bowl from the oven and stir. Let stand for a few minutes before serving.\n",
        "picture_link": "SADwB8.4aoGEElVY2cErP7qzJyreydG"
    },
    {
        "title": "Dan's Favorite Chicken Sandwich",
        "ingredients": [
            "2 skinless, boneless chicken breast halves ADVERTISEMENT",
            "2 tablespoons barbeque sauce ADVERTISEMENT",
            "4 slices bacon ADVERTISEMENT",
            "2 hoagie rolls, split lengthwise ADVERTISEMENT",
            "2 tablespoons Ranch dressing ADVERTISEMENT",
            "4 slices Swiss cheese ADVERTISEMENT",
            "1 small avocado - peeled, pitted and diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Coat a baking dish with cooking spray. Brush both sides of each chicken breast with barbeque sauce and place in the baking dish. Top each breast with 2 slices bacon.\nBake chicken 25 minutes in the preheated oven, until juices run clear. Drain bacon strips on paper towels, and slice breasts in half lengthwise.\nHeat the oven broiler. Spread both halves of each hoagie roll with Ranch dressing. Place 2 breast halves on one half of each roll. Place 2 strips of bacon on each remaining roll half. Top each half with 1 slice Swiss cheese.\nArrange sandwich halves on the baking sheet, and broil 2 to 5 minutes, until the cheese is melted and bubbly. Layer chicken halves of sandwiches with avocado slices, and top with bacon halves to serve.\n",
        "picture_link": "7ULPI5pKzN/XpCeTtSP8AlzHgYoDTkG"
    },
    {
        "title": "Absolutely Delicious Green Bean Casserole from Scratch",
        "ingredients": [
            "2 (12 ounce) packages frozen French cut green beans ADVERTISEMENT",
            "8 ounces crimini mushrooms, quartered ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1 small onion, halved and thinly sliced ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon lemon zest ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 (2.8 ounce) can canned French fried onions ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nPlace green beans into a saucepan and fill with about 1/2 inch of water. Bring to a boil and steam until beans are tender but still bright green, about 5 minutes. Drain and toss with the mushrooms. Set aside.\nMelt the butter in a large skillet over medium heat. Add the onion and parsley; cook and stir until onion is tender. Whisk in flour until blended, then mix in the lemon zest, salt, and pepper. Gradually whisk in milk, stirring constantly, so that no lumps form and then stir in sour cream. Warm over medium heat until the sauce begins to bubble. Dump in the green beans and mushrooms, stirring to coat.\nRemove from the heat and toss briefly with some of the Cheddar cheese and French fried onions, saving some of each to sprinkle over the top. Spoon into a 1 1/2 quart casserole dish and top with the reserved onions and cheese.\nBake in the preheated oven until the cheese melts, about 15 minutes.\n",
        "picture_link": "TO.pyBdlrrRI6BPnRg6IZqHBH6ah6XC"
    },
    {
        "title": "Garlic Baked Potato",
        "ingredients": [
            "4 medium baking potatoes, scrubbed ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 teaspoons garlic salt, or to taste ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C).\nPour olive oil into a plastic bag. Measure the garlic salt and pepper onto a plate, and stir around a little. Coat each potato with olive oil by placing in the bag, and moving it around. Remove from the bag, and dip into the seasoning. Rub seasoning into the potato to coat. Place the potatoes directly on the oven rack.\nBake for 1 hour in the preheated oven, or until the potatoes feel soft when you squeeze them.\n",
        "picture_link": "fE.wDR7..8nbccbQLiVGxDht6utMYiS"
    },
    {
        "title": "Easy Olive Martini Chicken",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "1/4 cup sliced pimento-stuffed green olives ADVERTISEMENT",
            "1/4 cup gin ADVERTISEMENT",
            "1 tablespoon dry vermouth ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large skillet over medium-high heat. Season chicken breasts with salt and pepper. Place chicken in the skillet and cook until browned, about 5 minutes per side.\nReduce heat to medium; add butter and garlic. Cook and stir mixture until garlic is fragrant, about 3 minutes. Mix olives, gin, vermouth, and lemon juice into chicken mixture; simmer until chicken is no longer pink in the center and sauce is thickened, about 5 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "Q3yQf2tMe7w3QizPK354QpFNVmbmv3q"
    },
    {
        "title": "Grilled Peaches and Cream",
        "ingredients": [
            "4 peaches, halved and pitted ADVERTISEMENT",
            "2 tablespoons clover honey ADVERTISEMENT",
            "1 cup soft cream cheese with honey and nuts ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat a grill for medium-high heat.\nBrush peaches with a light coating of oil. Place pit side down onto the grill. Grill for 5 minutes, or until the surfaces have nice grill marks. Turn the peaches over, and drizzle with a bit of honey. Place a dollop of the cream cheese spread in the place where the pit was. Grill for 2 to 3 more minutes, or until the filling is warm. Serve immediately.\n",
        "picture_link": ".Xum.vj7HV/Lak9auJxCPjgapRrTBGi"
    },
    {
        "title": "Mediterranean Tilapia",
        "ingredients": [
            "3 tablespoons sun-dried tomatoes packed in oil, drained and chopped ADVERTISEMENT",
            "1 tablespoon capers, drained ADVERTISEMENT",
            "2 tilapia fillets ADVERTISEMENT",
            "1 tablespoon oil from the jar of sun-dried tomatoes ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "2 tablespoons kalamata olives, pitted and chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C). In a small bowl, stir together the sun-dried tomatoes, olives and capers. Set aside.\nPlace the tilapia fillets side by side in a baking dish. Drizzle with oil and lemon juice.\nBake for 10 to 15 minutes in the preheated oven, until the fish flakes with a fork. Check after 10 minutes, so as not to overcook, or the fish may be dry. When fish is done, top with the tomato mixture, and serve.\n",
        "picture_link": "HoeHnUd4Rj.Ai.y.GeFAydhS8wz1rfO"
    },
    {
        "title": "Shepherd's Pie Daddy's Way",
        "ingredients": [
            "5 medium potatoes, peeled and chopped ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "6 slices American cheese ADVERTISEMENT",
            "1 (10.75 ounce) can condensed golden mushroom soup ADVERTISEMENT",
            "3 teaspoons butter (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C).\nPlace the potatoes into a large saucepan with enough water to cover. Bring to a boil, and cook for 8 to 10 minutes, or until tender. Drain, and mash.\nWhile the potatoes are cooking, crumble the ground beef into a large skillet over medium-high heat. Cook and stir until evenly browned. Drain off the grease, then stir in the golden mushroom soup. Transfer to an 8 inch square baking dish, and place the slices of cheese over the meat. Spread the mashed potatoes evenly over the top. Dot with butter.\nBake for 20 to 25 minutes in the preheated oven, or until the top is golden brown.\n",
        "picture_link": "NcxEZxEn9r.KwNLluCxpw7eazKUYVzm"
    },
    {
        "title": "Super Easy Seared Ahi Tuna",
        "ingredients": [
            "1 pound sashimi grade yellowfin tuna ADVERTISEMENT",
            "kosher salt to taste ADVERTISEMENT",
            "fresh ground black pepper to taste ADVERTISEMENT",
            "1/2 cup Italian seasoned bread crumbs ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "With a sharp knife, cut the tuna into 4 large pieces for appetizer portion, 2 large pieces for dinner portion. Use your judgment on what shape you want to cut your tuna because not all tuna is the same size or shape. However, the shape should somewhat resemble a miniature brick.\nSeason the tuna pieces with salt and pepper. Coat lightly on all sides with bread crumbs. Heat olive oil in a large heavy skillet over high heat. The pan should be as hot as you can get it. Place the tuna in the pan, and sear on each side for about 45 seconds for small portions, or 1 minute for large. Remove from pan. The tuna will be very rare.\nSlice each 'brick' into 1/4 inch thick slices, and fan out on a serving plate. Enjoy plain, or with the condiments of your choice.\n",
        "picture_link": "BQmjV5iAylJH2VxPAz7SxPvEpCIcd8y"
    }
]