[
    {
        "title": "Crispy Pretzel Apple Dessert",
        "ingredients": [
            "For Pretzel Crisps: ADVERTISEMENT",
            "4 Sister Schubert's® Soft Pretzel Rolls, thawed ADVERTISEMENT",
            "1/4 cup sugar ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "5 tablespoons butter, melted ADVERTISEMENT",
            "For Dessert Topping: ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 golden delicious apples, diced ADVERTISEMENT",
            "Pinch cinnamon ADVERTISEMENT",
            "6 scoops vanilla ice cream ADVERTISEMENT",
            "3/4 cup Marzetti® Old Fashioned Caramel Dip or Sweet & Salty Caramel Dip ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F. Cut each roll into 4 or 5 thin slices and place on a baking sheet lined with aluminum foil. In a small bowl, combine sugar and cinnamon. Brush top of each slice with butter and sprinkle with cinnamon sugar. Bake pretzel slices 5 to 7 minutes or until the edges are lightly golden. Remove from oven.\nIn a skillet, melt 2 TBS butter; add apple pieces and cinnamon and saute apples 3 to 5 minutes or until tender.\nPlace Marzetti Caramel Dip in a microwave dish and microwave in 10-second intervals until warm.\nTo assemble dessert, layer pretzel crisps with warm apples, ice cream and warm caramel dip and serve.\n",
        "picture_link": "7tM6aS9b6fq1tfdjkGCzm9BHe6r8cLa"
    },
    {
        "title": "Pepper Nuts 'Anise Cookies' ",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup sorghum ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon anise seed ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat butter, sugar, and sorghum together in a bowl until creamy. Mix all-purpose flour, anise, baking soda, cinnamon, and salt together in a separate bowl; stir into butter-sugar mixture until just incorporated. Roll dough into 1-inch thick logs. Arrange logs on a baking sheet and refrigerate 8 hours or overnight.\nPreheat oven to 350 degrees F (175 degrees C).\nSlice dough into small cookies; arrange on baking sheets.\nBake cookies in the preheated oven until lightly browned, 8 to 9 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Coconut Cream Dream Dessert",
        "ingredients": [
            "1 (18 ounce) package vanilla sandwich cookies (such as Golden Oreos®), crushed ADVERTISEMENT",
            "1/3 cup butter, melted ADVERTISEMENT",
            "2 (3.4 ounce) packages instant coconut cream pudding mix ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "1 quart vanilla ice cream, softened ADVERTISEMENT",
            "1 (16 ounce) container frozen whipped topping (such as Cool Whip®), thawed ADVERTISEMENT",
            "1 cup toasted flaked coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Set aside 1 cup of cookie crumbs and mix remaining crumbs with melted butter in a 9x13-inch baking dish; press buttered crumbs into the dish to form a crust. Freeze until set, about 10 minutes.\nWhisk coconut cream pudding mix with milk in a large bowl until the pudding thickens, about 2 minutes. Stir ice cream into pudding mix and pour mixture into the cookie crust. Top with a layer of frozen whipped topping; sprinkle with reserved cookie crumbs and coconut. Refrigerate until set, about 1 1/2 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Nellie's Favorite Eggnog",
        "ingredients": [
            "12 eggs, separated ADVERTISEMENT",
            "1 (16 ounce) package confectioners' sugar ADVERTISEMENT",
            "1 cup dark rum ADVERTISEMENT",
            "1 cup peach brandy ADVERTISEMENT",
            "2 cups peach-flavored bourbon liqueur (such as Southern Comfort ®) ADVERTISEMENT",
            "2 quarts heavy whipping cream ADVERTISEMENT",
            "1 pinch ground nutmeg, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat egg yolks in a bowl until thickened and light in color. Gradually beat in confectioners' sugar until smooth. Drizzle dark rum and brandy into egg yolk mixture, stirring constantly, until fully incorporated. Cover and let mixture stand for 1 hour to reduce the 'eggy' flavor.\nWhisk bourbon and cream into the egg yolk mixture, stirring constantly, until fully incorporated. Cover and refrigerate for flavors to blend, 3 to 5 hours.\nBeat egg whites in a bowl until foamy. Continue to beat until stiff peaks form. Lift your beater or whisk straight up: the egg whites will form sharp peaks. Fold egg whites into egg yolk mixture. Pour eggnog into a punch bowl and sprinkle with nutmeg.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Framboise Fizz",
        "ingredients": [
            "1 1/2 fluid ounces tequila ADVERTISEMENT",
            "3/4 fluid ounce white creme de cacao ADVERTISEMENT",
            "3/4 fluid ounce lemon juice ADVERTISEMENT",
            "1 cup ice cubes ADVERTISEMENT",
            "2 fluid ounces framboise ADVERTISEMENT",
            "3 fresh raspberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine tequila, creme de cacao, and lemon juice in a cocktail shaker. Add ice, cover and shake until chilled. Strain into a chilled cocktail glass. Pour framboise on top.\nGarnish with 3 raspberries on a toothpick.\n",
        "picture_link": "GxSesrIa//OnA9Om1b31vFR8h1bb7di"
    },
    {
        "title": "Slow Cooker Apple Butter for Food Gifts",
        "ingredients": [
            "10 apples, peeled, cored, and chopped ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 teaspoons ground cinnamon, or more to taste ADVERTISEMENT",
            "1/2 teaspoon ground cloves (optional) ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "8 half pint canning jars with lids and rings ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook apples in slow cooker on Low until apples are very soft, about 18 hours.\nPuree apples in a blender or food processor; return pureed apples to the slow cooker. Stir sugar, cinnamon, cloves, and nutmeg through the pureed apples.\nContinue cooking on Low until thick, about 4 hours.\nSterilize the jars and lids in boiling water for at least 5 minutes. Pack the apple butter into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings.\nPlace a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for 10 minutes.\nRemove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area.\n",
        "picture_link": "zgn79AIuA9rRRflqzv/h6fgTRh1hC6q"
    },
    {
        "title": "Peanut Brittle Cookies",
        "ingredients": [
            "1/2 cup golden vegetable shortening ADVERTISEMENT",
            "1/2 cup packed light brown sugar ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 (10 ounce) package peanut butter chips, divided ADVERTISEMENT",
            "1 cup toffee baking bits (such as SKOR®) ADVERTISEMENT",
            "3/4 cup unsalted peanuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line baking sheets with parchment paper.\nBeat shortening with brown sugar, white sugar, and vanilla in a bowl until creamy. Add egg; beat until smooth. Add flour, baking soda, and salt; mix until incorporated. Fold in 1 cup peanut butter chips, toffee bits, and peanuts. Drop batter by the rounded tablespoonful about 2 inches apart onto the prepared baking sheets.\nBake cookies in the preheated oven until deep golden brown and just set in the middle, 10 to 12 minutes. Cool on sheet for 3 minutes before transferring to wire racks to cool completely.\nHeat remaining peanut butter chips in a microwave-safe bowl in the microwave until melted, about 45 seconds. Drizzle over cooled cookies.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Dad's Holiday Punch",
        "ingredients": [
            "1 (750 milliliter) bottle cold duck ADVERTISEMENT",
            "1 (16 ounce) package frozen strawberries, thawed ADVERTISEMENT",
            "2 cups Sauternes wine ADVERTISEMENT",
            "2 cups pineapple juice ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine cold duck, strawberries, Sauternes wine, pineapple juice, sugar, and lemon juice in a punch bowl, stirring gently to dissolve sugar.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Christmas Ham",
        "ingredients": [
            "1 (5 pound) bone-in ham ADVERTISEMENT",
            "1/2 cup Dijon mustard ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1/4 cup whole cloves ADVERTISEMENT",
            "1 quart peach nectar ADVERTISEMENT",
            "1 (20 ounce) can pineapple rings, juice drained and reserved ADVERTISEMENT",
            "1 (4 ounce) jar maraschino cherries, juice drained and reserved ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ham into a large pot, cover with water, and bring to a boil. Reduce heat to medium-low and simmer ham for 1 to 2 hours. Cut away and discard any rind and visible fat.\nPreheat oven to 325 degrees F (165 degrees C).\nScore the ham in a diamond pattern and place into a roasting pan. Stir Dijon mustard and brown sugar in a bowl until thoroughly combined; brush mustard mixture onto the ham. Press a whole clove into the center of each scored diamond shape. Pour peach nectar into the roasting pan. Combine pineapple and maraschino liquid in a small bowl.\nBake ham in the preheated oven for 3 hours, basting frequently with the pineapple juice mixture and peach nectar.\nArrange pineapple rings over the ham and secure with toothpicks. Secure a maraschino cherry in the center of each pineapple ring with a toothpick.\nBake ham until browned, tender, and fragrant, 1 to 2 more hours, basting ham and fruit frequently with pineapple juice mixture and pan juices.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Topsoil Garden Jell-O®",
        "ingredients": [
            "1 (3 ounce) package lime-flavored gelatin mix (such as Jell-O®) ADVERTISEMENT",
            "1 (3 ounce) package blueberry-flavored gelatin (such as Jell-O®) ADVERTISEMENT",
            "1 (3 ounce) package cherry-flavored gelatin (such as JELL-O®) ADVERTISEMENT",
            "3 cups boiling water ADVERTISEMENT",
            "3 cups cold water ADVERTISEMENT",
            "12 gummi worms ADVERTISEMENT",
            "fresh flowers for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dissolve lime, blueberry, and cherry gelatin mixes with boiling water in a bowl. Stir cold water into gelatin and refrigerate until firm, about 4 hours.\nUnmold gelatin by dipping bowl in hot water until gelatin loosens; invert bowl over a platter to release. Decorate top of gelatin with gummi worms and flowers.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sugar Free Frozen Daiquiri",
        "ingredients": [
            "2 (1 gram) packets granular sucralose sweetener (such as Splenda®) ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "2 fluid ounces white rum (such as Cruzan®) ADVERTISEMENT",
            "12 ice cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix sweetener with lime juice and white rum in a small bowl until sweetener has dissolved. Place ice cubes into a blender and pour rum mixture over ice; blend until slushy, about 2 minutes. Pour into a glass.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Caramelized Onions Tartlets",
        "ingredients": [
            "1 teaspoon olive oil ADVERTISEMENT",
            "2 cups minced sweet onions ADVERTISEMENT",
            "2/3 cup Dannon Oikos Plain Greek Nonfat Yogurt ADVERTISEMENT",
            "2 tablespoons Parmesan cheese, or to taste ADVERTISEMENT",
            "1 tablespoon chopped chives or parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saute pan heat oil. Add onions and cook on medium heat, stirring often, until onions are golden brown (15 minutes). Let onion cool.\nIn a bowl combine, yogurt, parmesan cheese and herbs mix well. Add cooled onions.\nSpoon 1 healthy teaspoon per phyllo cup and bake tartlets 10 minutes or until golden brown.\n",
        "picture_link": "RIrUb.ovTL9jQWBmYYe2DEPGwosGHFu"
    },
    {
        "title": "Punch Bowl Cookies",
        "ingredients": [
            "1/2 pound butter ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 egg yolks ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "14 candied cherries, halved, or more as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease a baking sheet.\nBeat butter and sugar together in a large bowl until creamy and smooth; scoop by teaspoonful onto the prepared baking sheet. Make an indentation in the center of each portion and insert a cherry half.\nBake in the preheated oven until cookies are light brown, about 12 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Spooky Halloween Chili",
        "ingredients": [
            "1/2 pound ground beef ADVERTISEMENT",
            "2 (16 ounce) cans chili beans ADVERTISEMENT",
            "1 (14.5 ounce) can stewed tomatoes ADVERTISEMENT",
            "1/2 (10 ounce) package frozen corn ADVERTISEMENT",
            "3 tablespoons apple cider (optional) ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix ground beef, chili beans, stewed tomatoes, corn, apple cider, and chili powder in a large pot over high heat; bring to a simmer, reduce heat to medium-low, and cook until the beef is cooked and tender, about 6 hours.\n",
        "picture_link": "zfwKOu8NSv6J/Or62n58N7M28fhthMG"
    },
    {
        "title": "Peppery Scalloped Corn",
        "ingredients": [
            "1 (15.25 ounce) can whole kernel corn, drained ADVERTISEMENT",
            "1 (15 ounce) can cream-style corn ADVERTISEMENT",
            "1 (8.5 ounce) package corn muffin mix ADVERTISEMENT",
            "1 (8 ounce) carton sour cream ADVERTISEMENT",
            "1 fresh jalapeno pepper, chopped (optional) ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "2 teaspoons ground black pepper ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 3-quart casserole dish.\nMix corn, cream-style corn, corn muffin mix, sour cream, jalapeno pepper, butter, ground black pepper, and salt together in a bowl; pour into prepared casserole dish.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 40 to 45 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Really Simple Bellinis",
        "ingredients": [
            "1 (15 ounce) can sliced peaches, chilled ADVERTISEMENT",
            "1 (750 milliliter) bottle champagne, chilled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend chilled peaches and their juice in a blender until smooth. Pour into a chilled glass until 1/2 full. Top with champagne; gently stir.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Spiced Pumpkin Puree Shooters",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 cup minced onion ADVERTISEMENT",
            "1 (14.5 ounce) can pumpkin puree ADVERTISEMENT",
            "1 cup chicken stock ADVERTISEMENT",
            "Salt and hot pepper to taste ADVERTISEMENT",
            "1 1/2 cups Dannon Oikos Plain Greek Nonfat Yogurt, divided ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground smoked paprika ADVERTISEMENT",
            "1/2 teaspoon toasted cumin ADVERTISEMENT",
            "Toasted sunflower or pumpkin seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a 3 quart soup pot heat oil. Add onions and saute 4-5 minutes. Add pumpkin puree and chicken broth and bring to a boil. Reduce heat and simmer soup 10-12 minutes. Season soup with salt and pepper.\nRemove soup from heat (can be made in advance up to this point).\nIn a bowl combine yogurt, and spices, mix well. Whisk in 1 cup of the spiced yogurt into the soup.\nSet 16 3-oz shot glasses (or votive candle holders) on a clean work surface.\nDivide soup among the glasses and top each with a teaspoon of remaining yogurt.\nSprinkle with toasted seeds if desired and serve.\n",
        "picture_link": "NgUfQwDMTXKU2A3QsLqVEfkd1Wx9bwq"
    },
    {
        "title": "Creamy Chipotle Dressing, Non-Dairy",
        "ingredients": [
            "1/2 cup soft tofu ADVERTISEMENT",
            "2 tablespoons soy milk ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1 teaspoon honey ADVERTISEMENT",
            "1/4 teaspoon garlic powder (optional) ADVERTISEMENT",
            "1/4 teaspoon salt, or to taste ADVERTISEMENT",
            "1 pinch ground cumin ADVERTISEMENT",
            "1 pinch ground black pepper (optional) ADVERTISEMENT",
            "1 canned chipotle peppers in adobo sauce, or more to taste ADVERTISEMENT",
            "1 teaspoon adobo sauce from chipotle peppers, or more to taste ADVERTISEMENT",
            "2 teaspoons chopped fresh dill (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend tofu, soy milk, olive oil, lemon juice, honey, garlic powder, salt, cumin, and black pepper in a blender until smooth. Scrape the sides of the blender with a spatula as needed. Add chipotle peppers and adobo sauce a little bit at a time and blend into the sauce, tasting after each addition until you meet the level of spiciness you desire.\nTransfer sauce to a bowl. Stir dill into the sauce to serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Tortiglioni Melanzana",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 onion, finely chopped ADVERTISEMENT",
            "1 carrot, finely chopped ADVERTISEMENT",
            "1 (14.5 ounce) can whole peeled tomatoes ADVERTISEMENT",
            "1/2 teaspoon white sugar ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 cup vegetable oil for frying ADVERTISEMENT",
            "1 eggplant, thinly sliced ADVERTISEMENT",
            "10 ounces tortiglioni (tube-shaped) pasta ADVERTISEMENT",
            "2 tablespoons pitted Kalamata olives, sliced ADVERTISEMENT",
            "2 tablespoons grated Grana Padano cheese ADVERTISEMENT",
            "2 tablespoons mayonnaise ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a skillet over medium heat; cook and stir onion and carrot until onion is translucent, about 5 minutes. Pour tomatoes into skillet and sprinkle sugar, salt, and black pepper into mixture. Bring to a simmer, turn heat to low, and simmer while you complete remaining steps. Stir occasionally.\nHeat vegetable oil in a separate skillet over high heat and fry eggplant slices in the hot oil until lightly browned, about 2 minutes per side. Drain eggplant slices on paper towels.\nFill a large pot with lightly salted water and bring to a boil. Stir in tortiglioni pasta and return to a boil. Cook pasta uncovered, stirring occasionally, until cooked through, but still firm to the bite, about 11 minutes; drain.\nMash tomato sauce with a fork until chunky and transfer to a large bowl. Stir in eggplant slices, Kalamata olives, Grana Padano cheese, mayonnaise, and pasta; stir lightly to incorporate.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Delicious Creamy Spinach",
        "ingredients": [
            "3 pounds fresh baby spinach ADVERTISEMENT",
            "1 1/4 cups whole milk ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "2 small shallots, finely diced ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/8 teaspoon ground nutmeg ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 cup grated Romano cheese ADVERTISEMENT",
            "1/4 cup dry bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Set oven rack about 6 inches from the heat source and preheat the oven's broiler.\nBring about 1 inch of lightly salted water to a boil in a skillet; cook spinach in 2 batches until wilted, 1 to 2 minutes. Drain and rinse spinach under cold water until cool; squeeze small handfuls to remove moisture and coarsely chop.\nHeat milk and heavy cream in a saucepan over medium heat, stirring occasionally, until warm.\nMeanwhile, melt butter in a large saucepan over medium-low heat; cook and stir shallots until softened, about 5 minutes. Stir in flour and cook for about 3 minutes; add warm milk and cream mixture, whisking constantly. Simmer and whisk until thickened, 3 to 4 more minutes. Stir in spinach and nutmeg; season with salt and black pepper.\nTransfer spinach mixture to a baking dish. Sprinkle with Romano cheese and bread crumbs.\nBroil in preheated oven until just browned, about 5 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sweet Tomato Relish",
        "ingredients": [
            "15 ripe tomatoes - peeled, seeded, and chopped ADVERTISEMENT",
            "4 Granny Smith apples - peeled, cored, and chopped ADVERTISEMENT",
            "5 sweet onions, chopped ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "5 fluid ounces white vinegar ADVERTISEMENT",
            "1 tablespoon pickling spice, bundled in cheesecloth ADVERTISEMENT",
            "6 1-pint canning jars with lids and rings ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine tomatoes, apples, onions, sugar, vinegar, and pickling spice bundle in a large pot; bring to a boil and cook together about 10 minutes, stirring occasionally.\nSterilize the jars and lids in boiling water for at least 5 minutes. Pack the tomato mixture into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids and screw on rings.\nPlace a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for 40 minutes.\nRemove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Shavuot Cheesecake",
        "ingredients": [
            "Crust: ADVERTISEMENT",
            "10 graham crackers ADVERTISEMENT",
            "1/2 cup walnut pieces ADVERTISEMENT",
            "1/4 cup confectioners' sugar ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "2 tablespoons unsalted butter, melted ADVERTISEMENT",
            "Cheesecake: ADVERTISEMENT",
            "2 pounds cream cheese at room temperature ADVERTISEMENT",
            "4 eggs at room temperature ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "3/4 cup sour cream ADVERTISEMENT",
            "1/2 cup half-and-half ADVERTISEMENT",
            "1/4 cup sweetened condensed milk ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 quart boiling water, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Place parchment paper over bottom of a 9-inch springform pan and seal pan around the base (the parchment paper should be sticking out the edges). Grease sides of pan, but not parchment paper.\nPulse graham crackers, confectioners' sugar, walnuts, cinnamon, nutmeg, and salt in a food processor until mixture is crumbly, about 30 seconds. Pour melted butter over the crumbs and continue to process for 10 seconds. Push crumbs down the sides of the processor with a spatula and continue processing for about 10 more seconds until crumbs are evenly darkened. Press mixture firmly in an even layer across bottom of pan.\nClean and dry food processor. Cut cream cheese into chunks and place in food processor. Add eggs, sugar, sour cream, half-and-half, sweetened condensed milk, flour, and vanilla extract. Using short 1-second pulses, blend until smooth. This should take about 15 seconds; scrape down the sides if necessary, but do not overmix.\nBring water to a boil. While water is heating, carefully pour cheesecake filling into prepared springform pan. Smooth surface with a spatula. Pop large bubbles with the tip of a paring knife.\nPlace a large roasting pan in bottom of oven; pour in boiling water. Set cheesecake on middle oven rack, above pan of water.\nBake in preheated oven for 1 hour. Remove roasting pan, close oven, turn off heat, and let cheesecake rest inside oven for 1 to 2 hours.\nRemove cheesecake from oven; allow it to cool to room temperature. Store cheesecake in refrigerator and chill overnight before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Mr. Maggie's Egg Stuff!",
        "ingredients": [
            "6 unpeeled hard-cooked eggs, mashed ADVERTISEMENT",
            "1 (4.5 ounce) jar baby food, fruit and vegetable mix ADVERTISEMENT",
            "1 large carrot, grated ADVERTISEMENT",
            "1 apple, grated ADVERTISEMENT",
            "1/4 cup rolled oats ADVERTISEMENT",
            "1/4 cup fruit pellets for cockatiels (from pet store) ADVERTISEMENT",
            "2 tablespoons bird seed mix ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon (optional) ADVERTISEMENT",
            "1/4 cup apple juice, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix eggs with their shells, baby food, carrot, apple, oats, fruit pellets, bird seed mix, and cinnamon in a large bowl until combined. Add apple juice as needed to make a thick paste.\nShape egg mixture into 24 individual balls and place on a baking sheet. Freeze for 1 hour, transfer to zip-top plastic bags, and return to the freezer.\nDefrost balls in the refrigerator for 2 to 3 hours before feeding.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Peach Monkey Bread",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 1/4 cups whole-wheat flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "2 1/2 teaspoons white sugar ADVERTISEMENT",
            "1/2 teaspoon cream of tartar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "2/3 cup milk ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1 1/2 cups chopped walnuts ADVERTISEMENT",
            "1 fresh peach, cut into cubes ADVERTISEMENT",
            "2/3 cup maple syrup ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 450 degrees F (230 degrees C). Grease a 9-inch round pan.\nMix all-purpose flour, whole-wheat flour, baking powder, sugar, cream of tartar, and salt together in a large bowl. Blend 1/3 cup vegetable oil and butter into the flour mixture until it looks like bread crumbs. Stir milk into the mixture to form a dough. Roll the dough into balls smaller than 1 inch in diameter and arrange into the prepared pan. Drizzle 1/3 cup vegetable oil over the dough.\nSprinkle chopped walnuts over the dough; top with peach cubes. Stir maple syrup and cinnamon together in a small bowl; drizzle evenly over the peaches and walnuts.\nBake in the preheated oven until the edges of the dough is golden brown, 10 to 12 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Lamb Shank",
        "ingredients": [
            "1 (4 pound) lamb shank ADVERTISEMENT",
            "Marinade: ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 teaspoon dried rosemary ADVERTISEMENT",
            "1/4 teaspoon ground thyme ADVERTISEMENT",
            "1/4 teaspoon dried basil ADVERTISEMENT",
            "1/4 teaspoon dried parsley ADVERTISEMENT",
            "1/2 teaspoon dried mint ADVERTISEMENT",
            "2 tablespoons ground black pepper ADVERTISEMENT",
            "salt to taste (optional) ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste (optional) ADVERTISEMENT",
            "Basting Sauce: ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "3 tablespoons honey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut slits into lamb shank in a criss-cross pattern about 1 inch apart and 1/2 inch deep; place into a shallow dish.\nWhisk olive oil, rosemary, thyme, basil, parsley, mint, black pepper, salt, and cayenne pepper together in a bowl; brush evenly over the lamb shank. Refrigerate lamb at least 1 hour.\nPreheat grill for medium heat and lightly oil the grate.\nStir lemon juice and honey together in a small bowl until smooth.\nCook lamb shank on preheated grill, basting every 15 minutes with the lemon juice mixture, until browned on the outside and red in the center, about 30 minutes per side. An instant-read thermometer inserted into the center should read 125 degrees F (52 degrees C).\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Modern Jewish Low Fat Kugel",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 (16 ounce) package yolk-free egg noodles ADVERTISEMENT",
            "1 (16 ounce) container low-fat sour cream ADVERTISEMENT",
            "1 (16 ounce) container low-fat cottage cheese ADVERTISEMENT",
            "1 (8 ounce) can crushed pineapple in juice, undrained ADVERTISEMENT",
            "3 eggs, lightly beaten ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "1/2 cup dried cranberries ADVERTISEMENT",
            "5 tablespoons butter, melted ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/4 cup applesauce ADVERTISEMENT",
            "1/2 orange, zested ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Spray a 9x13-inch baking dish with cooking spray.\nBring a large pot of lightly salted water to a boil. Cook egg noodles in the boiling water, stirring occasionally until cooked through but firm to the bite, about 5 minutes. Drain.\nGently stir egg noodles, sour cream, cottage cheese, pineapple with juice, eggs, orange juice, cranberries, melted butter, sugar, applesauce, orange zest, vanilla extract, and cinnamon together in a large bowl until thoroughly combined. Spoon the noodle mixture into prepared baking dish.\nBake in the preheated oven until kugel is set and browned on top, 60 to 75 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Halloween Jell-O® Spiders",
        "ingredients": [
            "2 (3 ounce) packages grape-flavored gelatin mix (such as Jello-O®) ADVERTISEMENT",
            "1 3/4 cups boiling water ADVERTISEMENT",
            "1 3/4 cups cold water ADVERTISEMENT",
            "2-inch straws ADVERTISEMENT",
            "toothpicks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk the gelatin mix with the boiling water in a bowl until dissolved. Pour cold water into the gelatin mixture; stir. Transfer the mixture to a small bowl.\nStick 8 2-inch straws around the mold to serve as the \"legs,\" 4 on each side.\nRefrigerate until gelatin is set, about 4 hours. Poke 2 toothpicks into the gelatin to serve as the \"eyes.\"\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pickly Pork Chops with Potatoes and Cabbage",
        "ingredients": [
            "4 pork chops ADVERTISEMENT",
            "2 teaspoons white vinegar, or as needed ADVERTISEMENT",
            "1/4 teaspoon dried dill weed, or to taste ADVERTISEMENT",
            "1/4 teaspoon pickling spice, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 teaspoon white vinegar, or as needed ADVERTISEMENT",
            "1 (14 ounce) can beef broth ADVERTISEMENT",
            "4 large red potatoes, chopped ADVERTISEMENT",
            "1/4 cup white vinegar ADVERTISEMENT",
            "1/4 teaspoon dried dill weed, or to taste ADVERTISEMENT",
            "1/4 teaspoon pickling spice, or to taste ADVERTISEMENT",
            "1 small head cabbage, chopped ADVERTISEMENT",
            "2 tablespoons white vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Set oven rack about 6 inches from the heat source and preheat the oven's broiler.\nBrush pork chops with 2 teaspoons white vinegar and sprinkle with 1/4 teaspoon dill, 1/4 teaspoon pickling spice, salt, and black pepper. Place pork chops in a broiling pan.\nBroil in the preheated oven until juices run clear and chops are browned, 4 to 8 minutes per side. Drizzle chops with 1 more teaspoon vinegar and flip chops halfway through cooking. An instant-read meat thermometer inserted into the thickest part of a chop should read at least 145 degrees F (65 degrees C).\nPlace beef broth, potatoes, and 1/4 cup white vinegar in a saucepan, bring to a boil, cover, and boil for 4 minutes. Stir in 1/4 teaspoon dill, 1/4 teaspoon pickling spice, and shredded cabbage; cover and boil for 4 more minutes. Drain liquid and stir 2 tablespoons vinegar into cabbage mixture. Season with salt and black pepper and serve with broiled pork chops.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Apple Berry Brown Sugar Ham",
        "ingredients": [
            "1 (15 pound) fully cooked bone-in ham ADVERTISEMENT",
            "1 (2 liter) bottle cherry cola, divided ADVERTISEMENT",
            "1 teaspoon ground allspice ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "Glaze: ADVERTISEMENT",
            "3/4 cup strawberry jam ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "2 tablespoons apple brandy ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nTrim excess fat from ham, leaving 1/4-inch layer of fat. Score fat in a diamond pattern using a sharp knife. Place ham on a rack in a large roasting pan and pour cola in pan, reserving about 1/4 cup for the glaze. Season ham with allspice and salt.\nBake in preheated oven, basting every 15 minutes with pan juices, for 1 hour.\nCombine strawberry jam, brown sugar, and apple brandy in a saucepan over low heat; cook and stir until sugar is dissolved, about 5 minutes. Remove pan from heat and stir reserved cherry cola into the glaze; brush onto ham to coat.\nReturn ham to oven to continue cooking, brushing with the glaze 2 to 3 times more as it cooks, until an instant-read thermometer inserted into the center reads 140 degrees F (60 degrees C), 30 to 45 minutes more. Tent ham loosely with aluminum foil and set aside for 30 minutes before carving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Apple Pie with Truvia® Natural Sweetener",
        "ingredients": [
            "1 pastry for a double crust 9-inch pie ADVERTISEMENT",
            "8 cups Granny Smith apples, peeled, cored, and sliced ADVERTISEMENT",
            "1 tablespoon lemon zest ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3 tablespoons cornstarch ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1/3 cup Truvia® natural sweetener spoonable, plus ADVERTISEMENT",
            "1 1/2 tablespoons Truvia® natural sweetener spoonable** ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F.\nRoll out half of the pastry on a floured surface to 1 inch larger than inverted 9-inch pie pan. Ease pastry into pan.\nBlend Truvia(R) natural sweetener, cornstarch, salt, cinnamon and nutmeg in small bowl. Sprinkle on apples and toss until coated. Add lemon zest and mix thoroughly. Arrange apple mix into crust. Cut butter into slices, place on top of apples.\nRoll remaining pastry into circle large enough to cover inverted 9-inch pie pan. Place over apples, seal edges, trim and flute. Cut slits in top to allow steam to escape.\nBake for 40 to 50 minutes or until crust is golden and apples are tender. Cool on wire rack.\n",
        "picture_link": "eqh.K1a7KrSEmra8kWKnxaEdK3mAUwq"
    },
    {
        "title": "Mediterranean Pasta and Lentil Salad",
        "ingredients": [
            "1 (12 ounce) package tri-color rotini pasta ADVERTISEMENT",
            "1 yellow bell pepper, chopped ADVERTISEMENT",
            "1/2 cup Greek-style vinaigrette (such as Renee's® Gourmet) ADVERTISEMENT",
            "1/2 cup canned lentils ADVERTISEMENT",
            "1/2 cup crumbled feta cheese ADVERTISEMENT",
            "1/2 cup chopped red onion ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook rotini at a boil until tender yet firm to the bite, about 8 minutes; drain. Rinse rotini with cold water to cool completely.\nToss cooled rotini, bell pepper, Greek vinaigrette, lentils, feta cheese, and red onion together in a bowl.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Marinated Kebabs with Maille® Dijon Originale Mustard",
        "ingredients": [
            "2 pounds premium meat ADVERTISEMENT",
            "2 bell peppers (color of your choice) ADVERTISEMENT",
            "1 onion ADVERTISEMENT",
            "1/4 teaspoon dried thyme ADVERTISEMENT",
            "Salt and pepper ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 jar Maille® Dijon Originale Mustard ADVERTISEMENT",
            "Skewers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut the meat, bell peppers and onion into squares.\nIn a large bowl, whisk the jar of Maille(R) Dijon Originale mustard, olive oil, thyme, salt and pepper. Add the meat to the mixture and coat evenly. Refrigerate for 30 minutes. Alternate the meat with the bell pepper and onion squares on skewers. Grill, turning frequently and brushing with the remaining mixture.\n",
        "picture_link": "NW6zHwmw7Xg174iMCBBty6jR5AUwgXe"
    },
    {
        "title": "Low Carbarito Mojito Mixer",
        "ingredients": [
            "7 1/2 cups water ADVERTISEMENT",
            "3/4 cup key lime juice ADVERTISEMENT",
            "3/4 cup granular no-calorie sucralose sweetener (such as Splenda®) ADVERTISEMENT",
            "1/2 teaspoon mint extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix water, key lime juice, sweetener, and mint extract in a large pitcher; stir to dissolve sweetener.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "White Peach Cosmo",
        "ingredients": [
            "1 white peach, pitted ADVERTISEMENT",
            "1 dash lemon juice, or more to taste ADVERTISEMENT",
            "1 pinch white sugar, or more to taste ADVERTISEMENT",
            "1 fluid ounce lime juice ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger peach-flavored vodka ADVERTISEMENT",
            "1/2 (1.5 fluid ounce) jigger triple sec (orange-flavored liqueur) ADVERTISEMENT",
            "3/4 fluid ounce white cranberry juice ADVERTISEMENT",
            "1/2 fluid ounce simple syrup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend peach, lemon juice, and sugar in a blender until smooth; measure 1 ounce of puree. Reserve remaining puree for another use.\nFill a pint glass with ice; add peach puree, lime juice, vodka, triple sec, cranberry juice, and simple syrup. Cover and shake. Strain drink into a martini glass.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Roast Beef Wraps with Maille® Old Style Mustard",
        "ingredients": [
            "4 tortilla wraps ADVERTISEMENT",
            "Roast beef: ADVERTISEMENT",
            "4 slices roast beef cooked rare ADVERTISEMENT",
            "2 teaspoons soy sauce ADVERTISEMENT",
            "2 teaspoons sesame oil ADVERTISEMENT",
            "Freshly ground black pepper ADVERTISEMENT",
            "1 avocado, sliced in 1/2-inch wide strips ADVERTISEMENT",
            "4 Maille® cornichons sliced in half lengthwise ADVERTISEMENT",
            "Maille® Old Style mustard cream: ADVERTISEMENT",
            "1/2 cup whipping cream ADVERTISEMENT",
            "2 tablespoons Maille® Old Style Mustard ADVERTISEMENT",
            "Salt and freshly ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Roast beef: Mix the soy sauce and the sesame oil together and cover each slice of roast beef with a brush. Season roast beef with ground pepper.\nMaille(R) Old Style mustard cream: Whip the whipping cream to make it rise. Then mix in Maille(R) Old Style mustard and season with salt and pepper.\nGenerously cover the inside of tortilla wraps with Maille(R) Old Style mustard cream. Lay in the center of each tortilla one slice of roast beef. Add the avocado and Maille(R) cornichons on top of the meat. Roll it up tightly together. Cut the wrap in the middle at an angle. Serve cold.\n",
        "picture_link": "3iXuCosOG0x0aMhjV1787wXwuhjqxSO"
    },
    {
        "title": "Creamy Sweet Potato Pie",
        "ingredients": [
            "1 (29 ounce) can cut sweet potatoes, drained ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1/2 cup flour ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1 teaspoon cornstarch ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 (9 inch) unbaked pastry pie shells ADVERTISEMENT",
            "1 1/2 cups miniature marshmallows, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Set rack to center of the oven and place a cookie sheet on baking rack.\nWhip sweet potatoes in a mixing bowl with an electric hand mixer until soft. Add sweetened condensed milk, eggs, butter, and vanilla extract; continue blending until incorporated. Blend flour, white sugar, brown sugar, cornstarch, cinnamon, nutmeg, baking powder, and salt into the sweet potato mixture.\nDivide sweet potato mixture between the pie shells. Cover pies with aluminum foil.\nBake in preheated oven for 10 minutes.\nReduce heat to 300 degrees F (150 degrees C). Continue baking pies uncovered until a toothpick inserted into the center comes out clean, about 40 more minutes.\nRemove aluminum foil and pile marshmallows into the center of each pie. Return to oven and continue baking until marshmallows are golden brown, about 10 minutes. Allow pies to cool before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cranberry Sorbet Frozen Cosmopolitan",
        "ingredients": [
            "1 (.25 ounce) envelope unflavored gelatin ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "4 cups cranberries ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1/2 cup lemon juice ADVERTISEMENT",
            "6 fluid ounces vodka ADVERTISEMENT",
            "3 fluid ounces triple sec ADVERTISEMENT",
            "1 ounce lime juice ADVERTISEMENT",
            "8 ice cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir gelatin into 3 cups water in a bowl until dissolved.\nPlace cranberries into a large pot and cover with water; bring to a boil. Reduce heat to medium-low and simmer until skins pop open, 10 to 15 minutes. Drain cranberries through a sieve.\nCombine cranberries, gelatin-water mixture, and sugar in a pot; bring to a simmer. Cook and stir cranberry mixture until sugar is dissolved, 5 to 10 minutes. Set aside to cool; stir in lemon juice.\nPour cranberry mixture into a container and cover; freeze 8 hours or overnight.\nBlend 2 cups cranberry sorbet, vodka, triple sec, lime juice, and ice cubes in a blender until smooth. Pour cosmopolitan mixture into 4 martini glasses.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Ham Sandwich with Crunchy Maille® Cornichons",
        "ingredients": [
            "3 Maille® Cornichons ADVERTISEMENT",
            "4 sesame or poppy seed rolls ADVERTISEMENT",
            "1 tomato ADVERTISEMENT",
            "4 slices cooked ham ADVERTISEMENT",
            "1 tablespoon finely chopped shallots ADVERTISEMENT",
            "1 bunch parsley ADVERTISEMENT",
            "Few leaves of lettuce ADVERTISEMENT",
            "Butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Slice the rolls in half and spread butter on both sides.\nGarnish one half with a few leaves of lettuce and a slice of tomato.\nTop the tomato with the slices of ham.\nCut the Maille(R) cornichons in 4, and dice them, then place them on top of the slices of ham.\nSprinkle shallots and parsley to taste.\nTop with other half of roll and serve.\n",
        "picture_link": "B06SjnoCwnku2SNMc.NNAB9wYwLp7PC"
    },
    {
        "title": "Corn on the Cob Latino",
        "ingredients": [
            "1/2 cup fresh orange juice ADVERTISEMENT",
            "4 limes, juiced ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "1 aji pepper, seeded ADVERTISEMENT",
            "1 teaspoon sea salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "6 tablespoons margarine ADVERTISEMENT",
            "4 banana leaves, or as needed ADVERTISEMENT",
            "8 ears corn on the cob, husks and silk removed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBlend orange juice, lime juice, lemon juice, aji pepper, sea salt, black pepper, garlic, and cinnamon in a blender until pepper and garlic are very finely chopped, about 30 seconds. Add margarine and blend until smooth, 30 seconds to 1 minute.\nLine a large baking sheet with aluminum foil; lay banana leaves onto foil. Place ears of corn on banana leaves and spread margarine mixture evenly over corn. Wrap foil and banana leaves over the seasoned ears of corn, using more foil if necessary to tightly seal corn in a bundle.\nBake in the preheated oven until corn is tender and flavors have blended, 1 1/2 hours. Unwrap and serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Meatloaf with Truvia® Natural Sweetener",
        "ingredients": [
            "For the Loaf: ADVERTISEMENT",
            "1/2 pound ground sirloin ADVERTISEMENT",
            "1/2 pound ground chuck ADVERTISEMENT",
            "2 garlic cloves, smashed and chopped ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1/2 cup chopped celery ADVERTISEMENT",
            "1 teaspoon chili pepper ADVERTISEMENT",
            "1/2 cup chopped bell pepper ADVERTISEMENT",
            "2 eggs, lightly beaten ADVERTISEMENT",
            "2 tablespoons Truvia® natural sweetener spoonable* ADVERTISEMENT",
            "1 lemon zested ADVERTISEMENT",
            "8 ounces canned diced tomatoes with juice ADVERTISEMENT",
            "1/2 cup bran flakes, ground ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon cracked black pepper ADVERTISEMENT",
            "For the Sauce: ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "1/2 cup canned pureed tomatoes ADVERTISEMENT",
            "1 teaspoon cumin ADVERTISEMENT",
            "1/2 cup Truvia® natural sweetener spoonable** ADVERTISEMENT",
            "1 dash Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon prepared mustard ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F.\nMix all loaf ingredients well and place in a baking dish. Shape into a loaf.\nMix ingredients for sauce and spread on top of loaf. Bake for 1 hour.\n",
        "picture_link": "xvF6Rv6N8x43pyte/qia7kWVRY.ED2S"
    },
    {
        "title": "Quinoa Zucchini Protein Muffins",
        "ingredients": [
            "2 1/2 cups whole wheat pastry flour ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground cloves ADVERTISEMENT",
            "1/8 teaspoon ground allspice ADVERTISEMENT",
            "1/8 teaspoon ground ginger ADVERTISEMENT",
            "1/8 teaspoon ground nutmeg ADVERTISEMENT",
            "1 1/2 cups nonfat Greek yogurt ADVERTISEMENT",
            "1 1/2 cups shredded zucchini, squeezed dry ADVERTISEMENT",
            "1 cup cooked quinoa ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Line 2 muffin tins with paper liners.\nCombine whole wheat pastry flour, brown sugar, cinnamon, baking powder, baking soda, salt, cloves, allspice, ginger, and nutmeg in a bowl.\nMix Greek yogurt, zucchini, quinoa, eggs, and vanilla extract together in a bowl. Add flour mixture; mix until batter is well blended.\nSpoon batter into the prepared muffin tins.\nBake in the preheated oven until tops are lightly browned and a toothpick inserted into the center comes out clean, about 30 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Leeky Butternut Squash with Sage Sausage",
        "ingredients": [
            "1 butternut squash - peeled, seeded, and cubed ADVERTISEMENT",
            "1/2 leek, trimmed and cut into 1/2-inch slices ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 (16 ounce) package pork sage sausage (such as Jimmy Dean®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nPlace butternut squash and leek in a shallow roasting pan. Drizzle olive oil on top; season with salt and pepper.\nRoast in the preheated oven until butternut squash is tender and lightly browned, 25 to 30 minutes. Broil on high until evenly browned, 2 to 3 minutes.\nCook and stir sausage in a large skillet over medium heat until browned, 5 to 8 minutes. Stir into butternut squash and leek mixture.\n",
        "picture_link": "tnmEhV68RkYaDK/ulDQ5z.Si2VPYzlK"
    },
    {
        "title": "Creamy Vegan Potato Soup",
        "ingredients": [
            "1/2 cup vegan margarine ADVERTISEMENT",
            "2 yellow onions, chopped ADVERTISEMENT",
            "3 stalks celery, chopped ADVERTISEMENT",
            "3 carrots, sliced into thin rounds ADVERTISEMENT",
            "8 cups water ADVERTISEMENT",
            "8 cubes vegetable bouillon ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 1/2 teaspoons ground black pepper ADVERTISEMENT",
            "5 pounds red potatoes, peeled and cubed ADVERTISEMENT",
            "4 1/2 cups unsweetened soy milk, divided ADVERTISEMENT",
            "1 cup vegan instant potatoes ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt margarine in a large stockpot over medium heat; cook and stir onions, celery, and carrots until tender, about 10 minutes. Add water, vegetable bouillon, salt, and pepper; stir well. Add potatoes and bring soup to a boil; reduce heat and simmer until potatoes are tender, about 15 minutes.\nMix 4 cups soy milk and instant potatoes into soup until dissolved.\nStir remaining 1/2 cup soy milk and cornstarch together in a bowl until smooth; add to the soup, stirring well. Cook soup until heated through, stirring regularly, 5 to 10 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Butternut Squash Chicken Street Tacos",
        "ingredients": [
            "1 pound skinless chicken thighs ADVERTISEMENT",
            "1 pound butternut squash, cubed ADVERTISEMENT",
            "1 yellow onion, sliced ADVERTISEMENT",
            "1/2 cup chicken stock ADVERTISEMENT",
            "2 tablespoons ground paprika ADVERTISEMENT",
            "4 cloves garlic, crushed ADVERTISEMENT",
            "2 1/2 teaspoons kosher salt ADVERTISEMENT",
            "3 sprigs fresh marjoram, chopped, or more to taste ADVERTISEMENT",
            "2 teaspoons onion powder ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon cracked black pepper ADVERTISEMENT",
            "1 (15 ounce) can diced tomatoes in juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C).\nCombine chicken thighs, butternut squash, onion, chicken stock, paprika, garlic, salt, marjoram, onion powder, garlic powder, oregano, and pepper in an enameled cast iron Dutch oven. Pour tomatoes on top.\nBake, covered, in the preheated oven until chicken is tender, about 1 hour 30 minutes. Uncover and continue baking until most of the butternut squash has melted into the sauce, about 30 minutes more. Shred chicken with 2 forks.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pasta, Bacon, and Green Bean Skillet",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1 (6 ounce) package Canadian bacon, cut into strips ADVERTISEMENT",
            "1 (15 ounce) can Italian-style diced tomatoes ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "1 cup frozen green beans ADVERTISEMENT",
            "1/2 (16 ounce) package cavatappi pasta ADVERTISEMENT",
            "1 cup mozzarella cheese ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large skillet over medium heat. Add onion; cook and stir until softened, 3 to 4 minutes. Add bacon; cook for 1 minute. Stir in diced tomatoes, tomato sauce, water, and green beans; bring to a simmer. Add cavatappi; cook, stirring frequently, until tender, 8 to 9 minutes.\nSprinkle mozzarella cheese over the cavatappi mixture. Cover and cook until cheese is melted, 2 to 3 minutes. Season with salt and pepper.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Taco Pie from Borden® Cheese",
        "ingredients": [
            "1 (8 ounce) tube refrigerated crescent rolls ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 (1 ounce) package taco seasoning mix ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "2 cups crushed taco chips, divided ADVERTISEMENT",
            "2 cups sour cream ADVERTISEMENT",
            "1 cup Borden® Sharp Cheddar Shredded Cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F. Spray the inside of a 9 x 9 baking dish with non-stick cooking spray. Unroll the crescents and line the inside of the prepared baking dish pinching all the edges together and overlap if needed to form a solid layer of rolls; set aside.\nCook ground beef in a large non-stick skillet over medium-high heat until browned; drain fat. Add taco mix and water. Cook until most of moisture has evaporated.\nSprinkle 1 cup of taco chips on top of rolls; top with meat mixture, followed by sour cream and shredded cheese. Bake 20 minutes at 350 degrees F or until crescents have browned and sauce has begun to bubble at the edges. Top with remaining taco chips, and bake 5 minutes more.\n",
        "picture_link": "d0LH2w6gVpf56qd6ukBzjcCnKQqpyYC"
    },
    {
        "title": "Vegetarian Millet Lettuce Wraps",
        "ingredients": [
            "1 teaspoon butter ADVERTISEMENT",
            "1/4 cup millet ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/4 small onion, chopped (optional) ADVERTISEMENT",
            "1/2 lime, juiced ADVERTISEMENT",
            "1 small clove garlic, minced ADVERTISEMENT",
            "1 teaspoon chopped fresh cilantro ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3 leaves butter lettuce ADVERTISEMENT",
            "1 carrot, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a small saucepan over medium heat; add millet and cook until toasted and fragrant, 4 to 5 minutes. Add water, cover, and simmer until most of the water is absorbed, about 10 minutes.\nStir onion, lime juice, garlic, cilantro, and salt into millet; cook and stir until heated through and liquid is completely absorbed, about 5 minutes more. Cool millet mixture for 3 minutes.\nDivide chopped carrot among butter lettuce leaves. Spoon millet mixture over carrots.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Spinach-Stuffed Butternut Squash Patties",
        "ingredients": [
            "1 butternut squash - peeled, halved, seeded, and grated ADVERTISEMENT",
            "1 potato, peeled and grated ADVERTISEMENT",
            "1/2 onion, peeled and grated ADVERTISEMENT",
            "1 teaspoon salt, or to taste ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "3 tablespoons olive oil, divided ADVERTISEMENT",
            "4 cups chopped fresh spinach ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine butternut squash, potato, onion, and salt in a large bowl; let sit until moisture is drawn out, about 10 minutes. Transfer to a colander and squeeze out excess moisture.\nPlace squash mixture in a bowl and mix in flour, egg, black pepper, and baking powder until well blended.\nHeat 1 tablespoon olive oil in a skillet over medium heat; cook and stir spinach until wilted, about 2 minutes. Season spinach with salt and pepper; transfer to a bowl.\nScoop about 1 1/2 tablespoons squash mixture and form into a small ball using your hands; flatten into a patty. Add 1 teaspoon spinach to the flattened patty and form patty around the spinach into a ball. Flatten the ball with the palms of your hands. Repeat using the remaining squash mixture and spinach creating 12 to 14 more spinach-stuffed patties.\nHeat 1 tablespoon olive oil in a large skillet over medium heat; cook patties until lightly browned, 4 to 5 minutes per side. Transfer cooked patties to a plate and repeat with remaining oil and patties.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Tomato and Spinach Quinoa Skillet",
        "ingredients": [
            "4 cups chicken broth ADVERTISEMENT",
            "1 (12 ounce) box quinoa ADVERTISEMENT",
            "3 Roma tomatoes, chopped ADVERTISEMENT",
            "3 cups fresh spinach ADVERTISEMENT",
            "1/4 cup pesto ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring chicken broth and quinoa to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until most of the broth is absorbed, 10 to 15 minutes.\nStir tomatoes, spinach, and pesto into the quinoa. Simmer until remaining chicken broth is absorbed and quinoa is tender, about 5 minutes. Sprinkle Parmesan cheese over quinoa mixture.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Poutinertots",
        "ingredients": [
            "1 (32 ounce) package frozen bite-size potato nuggets (such as Tater Tots®) ADVERTISEMENT",
            "1 cup cold water ADVERTISEMENT",
            "1 (.75 ounce) packet dry brown gravy mix ADVERTISEMENT",
            "6 ounces cheese curds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Grease a baking sheet and spread potato nuggets onto sheet.\nBake in the preheated oven, stirring halfway through cooking, until golden brown and crispy, 25 to 35 minutes.\nWhisk cold water and gravy mix together in a saucepan; place over medium heat and cook, stirring frequently, until gravy comes to a boil. Reduce heat and simmer for 1 minute. Remove gravy from heat.\nPlace potato nuggets on a serving platter, sprinkle cheese curds over potato nuggets, and pour gravy over the top.\n",
        "picture_link": "g6z7VpHSItXDkL4gJ4oIXfJHTZ91lqm"
    },
    {
        "title": "True Amaretti ",
        "ingredients": [
            "5 very cold egg whites ADVERTISEMENT",
            "2 1/2 cups white sugar ADVERTISEMENT",
            "5 teaspoons almond extract ADVERTISEMENT",
            "4 1/2 cups almond meal ADVERTISEMENT",
            "1/4 cup confectioners' sugar, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat egg whites with an electric mixer fitted with the whisk attachment until foamy. Gradually add sugar and almond extract, continuing to beat until very stiff peaks form. Switch to the paddle attachment and mix in almond meal until dough comes together.\nCover cookie dough with plastic wrap and refrigerate, 3 hours to overnight.\nPreheat oven to 325 degrees F (165 degrees C). Line baking sheets with parchment paper.\nPour confectioners' sugar into a shallow bowl. Roll cookie dough into small balls and coat with confectioners' sugar. Arrange on the baking sheets.\nBake cookies in the preheated oven until lightly browned and firm, 10 to 15 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Vegetarian Barley Risotto ",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 1/2 cups barley ADVERTISEMENT",
            "4 cups vegetable stock ADVERTISEMENT",
            "1 bay leaf, or more to taste ADVERTISEMENT",
            "1 head broccoli, cut into florets ADVERTISEMENT",
            "1 zucchini, shredded ADVERTISEMENT",
            "1 yellow squash, shredded ADVERTISEMENT",
            "2 carrots, shredded ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large pot over medium heat. Add onion and garlic; cook and stir until softened, about 5 minutes. Add barley; cook and stir it is light brown and smells nutty, about 10 minutes.\nStir 2 cups vegetable stock and bay leaf into the pot; bring to a boil. Simmer until most of the stock is absorbed, about 10 minutes. Add 1 cup stock and broccoli. Reduce heat and simmer, covered, until most of the stock is absorbed, about 10 minutes.\nStir remaining 1 cup stock, zucchini, yellow squash, carrots, water, salt, and pepper into the pot. Simmer until stock is mostly absorbed and broccoli is soft, about 5 minutes. Discard bay leaf.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Crunchy Walnut-Coated Chicken Strips",
        "ingredients": [
            "non-stick cooking spray ADVERTISEMENT",
            "1 1/2 cups cornflakes cereal ADVERTISEMENT",
            "1 cup walnut pieces ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 1/4 pounds chicken tenders ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C). Line a baking sheet with aluminum foil and spray with cooking spray.\nCombine corn flakes and walnut pieces in a gallon-size resealable bag; press air out and seal. Crush corn flakes and walnuts using a rolling pin until cereal is finely crushed and walnuts are the size of rice. Add garlic powder, salt, and pepper; shake bag to mix.\nDip chicken tenders in the egg to coat, allowing excess egg to drip back into bowl. Transfer chicken to corn flake mixture, 1 at a time, and gently shake until chicken is coated. Arrange coated chicken on the prepared baking sheet.\nBake in the preheated oven until chicken is cooked through and coating is lightly browned, about 10 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Paleo Peach Crisp with Coconut and Slivered Almonds",
        "ingredients": [
            "1 (16 ounce) package frozen peach slices ADVERTISEMENT",
            "2 tablespoons coconut sugar, divided ADVERTISEMENT",
            "1 1/2 cups almond flour ADVERTISEMENT",
            "1/2 cup coconut flakes ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon sea salt ADVERTISEMENT",
            "3 tablespoons unsalted butter, cubed ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 cup slivered almonds ADVERTISEMENT",
            "1 tablespoon coconut oil, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Place peach slices in a baking dish.\nThaw peaches in the preheating oven, about 5 minutes. Break apart and spread evenly in the baking dish. Sprinkle 1 tablespoon sugar on top.\nCombine remaining 1 tablespoon coconut sugar, almond flour, coconut flakes, baking powder, and salt in a food processor; pulse about 5 times until mixed. Add butter and vanilla extract; pulse a few more times until crumbly. Pour over peaches.\nScatter slivered almonds over flour mixture. Drizzle coconut oil on top.\nBake in the preheated oven until golden brown, 22 to 25 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Spinach-Stuffed Acorn Squash ",
        "ingredients": [
            "2 acorn squash, halved and seeded ADVERTISEMENT",
            "3 tablespoons butter, melted ADVERTISEMENT",
            "2 teaspoons garlic powder ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 small red bell pepper, chopped ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped spinach, thawed and squeezed dry ADVERTISEMENT",
            "3/4 cup Italian-seasoned bread crumbs ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1/4 cup crumbled feta cheese ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil.\nBrush insides of the acorn squash with melted butter. Dust with garlic powder. Place acorn squash halves cut-side up on the baking sheet.\nRoast in the preheated oven until tender, 50 to 60 minutes.\nHeat oil in a large skillet over medium-high heat. Cook red bell pepper until tender, about 4 minutes. Stir in onion and cook until softened, 3 to 4 minutes. Reduce heat to medium and add garlic; cook until fragrant, about 2 minutes. Stir in spinach until it turns dark green, about 3 minutes.\nStir bread crumbs into the skillet; cook until lightly toasted, 2 to 3 minutes. Remove from heat; add Parmesan cheese. Mix in feta cheese thoroughly. Season mixture with salt and pepper.\nFill acorn squash halves with the red bell pepper mixture, mounding it slightly on top.\nBake in the preheated oven until evenly browned, 20 to 25 minutes. Cool for 5 minutes before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Toffee Caramel Apples",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1/2 cup half-and-half ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/4 cup corn syrup ADVERTISEMENT",
            "1/2 teaspoon cream of tartar ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "8 caramel apple sticks ADVERTISEMENT",
            "8 apples ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir white sugar, brown sugar, half-and-half, butter, corn syrup, cream of tartar, and salt together in a large, greased saucepan over medium-low heat until caramel mixture boils. Reduce heat to low; cook without stirring until caramel reaches 240 degrees F (115 degrees C) on a candy thermometer, or until a small amount dropped into cold water forms a soft ball, about 25 minutes.\nRemove from heat and let cool slightly. Line a baking sheet with greased parchment or greased wax paper.\nInsert a caramel apple stick into the middle of each apple. Dip each apple into caramel mixture and turn until fully coated. Place apples on prepared baking sheet until caramel cools completely.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Eggplant Wheat Berry Casserole",
        "ingredients": [
            "2 tablespoons olive oil, or as needed ADVERTISEMENT",
            "2 pounds eggplant, quartered and sliced, or more to taste ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 tablespoon chopped garlic ADVERTISEMENT",
            "2 cups chicken broth ADVERTISEMENT",
            "1/2 cup wheat berries ADVERTISEMENT",
            "1/2 cup barley ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon nutmeg ADVERTISEMENT",
            "1/2 teaspoon salt, or more to taste ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon allspice ADVERTISEMENT",
            "1 (14 ounce) can diced tomatoes ADVERTISEMENT",
            "1 (14 ounce) can black beans, rinsed and drained ADVERTISEMENT",
            "3/4 cup shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill for medium heat and lightly oil the grate.\nBrush eggplant slices with about 1 tablespoon olive oil.\nGrill eggplant on the preheated grill until tender and lightly browned, about 5 minutes per side.\nHeat remaining 1 tablespoon olive oil in a pot over medium heat; cook and stir onion and garlic in the hot oil until onion is softened, 5 to 10 minutes. Add chicken broth, wheat berries, barley, cinnamon, nutmeg, salt, pepper, and allspice to onion mixture; bring to a boil. Reduce heat, cover pot, and simmer until wheat berries are tender and some liquid is still remaining, about 40 minutes.\nPreheat oven to 350 degrees F (175 degrees C).\nStir tomatoes and black beans into wheat berries mixture; remove pot from heat. Stir eggplant into wheat berries mixture; pour into a 9x9-inch casserole dish. Sprinkle mozzarella cheese over mixture.\nBake in the preheated oven until cheese is melted, about 15 minutes.\n",
        "picture_link": "ClE.kmtFRnLaZKPaPsSTnOKAH12Mj7S"
    },
    {
        "title": "Blueberry Cream Cheese Cake",
        "ingredients": [
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "3 large eggs ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 teaspoon cornstarch ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "2 cups fresh blueberries ADVERTISEMENT",
            "Icing: ADVERTISEMENT",
            "1 (16 ounce) package confectioners' sugar ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nBeat cake mix with 1 cup water, eggs, and vegetable oil until smooth; pour into the prepared baking dish.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 23 to 28 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack. Slice cake in half horizontally to make 2 layers.\nCombine white sugar and cornstarch in a saucepan; gradually stir in 1/3 cup water. Add blueberries and bring to a simmer over medium heat. Simmer until thickened, stirring occasionally, about 1 minute. Allow blueberry mixture to cool.\nBeat confectioners' sugar and cream cheese in a large bowl until smooth. Stir in vanilla extract and fold in whipped topping.\nPlace one layer of cake on a large platter; spread blueberry mixture over cake. Arrange remaining cake layer over blueberry filling. Spread cream cheese icing over entire cake.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Bahgali Polo",
        "ingredients": [
            "2 1/2 pounds basmati white rice ADVERTISEMENT",
            "1 (10 ounce) package frozen lima beans ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 pounds lamb, cut into 1-inch pieces ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 cup butter, divided ADVERTISEMENT",
            "2 onion, halved and thinly sliced ADVERTISEMENT",
            "5 tablespoons dried dill weed, or more to taste ADVERTISEMENT",
            "1 tablespoon hot water ADVERTISEMENT",
            "1 pint plain yogurt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Thoroughly rinse rice and transfer to a large bowl. Pour enough water over the rice to cover by a few inches and soak for 1 hour; drain.\nBring a saucepan of water to a boil. Cook lima beans in boiling water until tender, 7 to 10 minutes; drain.\nBring a pot of water to a boil. Add salt and rice to the boiling water and cook until rice is partially softened, about 11 minutes; drain.\nSeason lamb with cinnamon, salt, and pepper.\nMelt 2 tablespoons butter in a large skillet over medium-high heat. Cook and stir lamb in melted butter until completely browned, about 5 minutes. Use a slotted spoon to transfer lamb to a bowl. Cook and stir onion in skillet until translucent, about 7 minutes. Return lamb to skillet; add dill and cooked lima beans. Remove skillet from heat.\nMelt 3 tablespoons butter in a large saucepan over medium-high heat; add 1 tablespoon hot water. Spoon about 1/3 the partially cooked rice into the saucepan. Layer about half the lamb mixture over the rice layer. Repeat layering 1/2 the remaining rice, the remaining lamb mixture, and finishing with the remaining rice. Cut the remaining 3 tablespoons butter into cubes and arrange atop the top rice layer.\nPlace a cover on the saucepan, reduce heat to medium-low, and cook until the rice is completely tender, about 30 minutes. Remove saucepan from heat and let the mixture cool for 10 minutes before serving with yogurt.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Browned Butter Frosting",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "7 cups confectioners' sugar, or more as needed ADVERTISEMENT",
            "1/2 cup milk, or more as needed ADVERTISEMENT",
            "1 tablespoon vanilla ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a saucepan over medium-low heat and cook, stirring constantly, until butter turns golden brown, 5 to 10 minutes.\nBeat confectioners' sugar, browned butter, milk, and vanilla together in a bowl until a frosting consistency is reached, 3 to 5 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Nikki's Cinnamon Walnut Bread",
        "ingredients": [
            "Bread: ADVERTISEMENT",
            "3 cups bread flour (such as King Arthur®) ADVERTISEMENT",
            "3/4 cup milk, room temperature ADVERTISEMENT",
            "1/4 cup unsalted butter, room temperature and cut into chunks ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 egg, room temperature ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1 1/2 teaspoons active dry yeast ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "2 cups chopped walnuts ADVERTISEMENT",
            "1/3 cup packed light brown sugar ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "4 teaspoons milk ADVERTISEMENT",
            "1 tablespoon butter, softened ADVERTISEMENT",
            "Topping: ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bread flour, 3/4 cup milk, 1/4 cup unsalted butter, 1/4 cup white sugar, 1 egg, 1 tablespoon cinnamon, yeast, and salt into the pan of your bread machine in the order recommended by the manufacturer. Select the Dough cycle and press Start. When the cycle is complete, remove the dough, punch down, cover, and let rest for 10 minutes.\nPreheat an oven to 275 degrees F (135 degrees C). Spread the walnuts onto a baking sheet, and toast until the nuts start to turn golden brown and become fragrant, about 45 minutes. Watch the nuts carefully as they bake, they burn quickly. Once toasted, set the nuts aside to cool to room temperature.\nStir walnuts, brown sugar, 3 tablespoons white sugar, and 1 tablespoon cinnamon together in a bowl. Add 4 teaspoons milk and 1 tablespoon butter; mix well.\nTurn dough out onto a lightly floured surface and roll into a 15x12-inch rectangle. Cut into three 15x4-inch strips. Spread 1/3 the walnut mixture down the center of each strip. Moisten and roll the long edges of each strip together over the filling, and pinch to seal each rope.\nLine up the 3 ropes 1 inch apart on an ungreased baking sheet. To ensure an even braid, start braiding in the middle. Bring the left rope under the center rope, pass the right rope under the new center rope, and repeat braiding to the end. Starting in the middle again, pass the outside ropes over the center rope, repeating to the end. Press rope ends together and tuck in on each side. Cover loaf with a damp cloth and let rise until doubled in volume, about 45 minutes.\nPreheat oven to 350 degrees F (175 degrees C).\nBeat water and egg together in a small bowl. Stir 2 tablespoons white sugar and 2 teaspoons cinnamon together in a separate bowl. Brush loaf with egg mixture and sprinkle with cinnamon sugar.\nBake in preheated oven until the top is golden brown and the bottom of loaf sounds hollow when tapped, 20 to 25 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Salmonberry Cake",
        "ingredients": [
            "4 cups salmonberries, divided ADVERTISEMENT",
            "3/4 cup water, or as needed ADVERTISEMENT",
            "1 (16.5 ounce) package white cake mix ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease 2 (9-inch) round cake pans.\nPress 2 cups of salmonberries through a metal mesh strainer into a bowl using the back of a large spoon; discard contents of strainer. Pour salmonberry pulp and juice (it will be about 1 1/4 cups) from bowl into a 2-cup measuring cup; pour in enough water to bring the pulp and juice to 2 cups. Stir well.\nPlace cake mix, eggs, vegetable oil, and 1 cup salmonberry mixture in a bowl; blend with an electric mixer on low speed until moistened, about 30 seconds. Beat cake mixture at medium speed for 2 minutes. Fold remaining 1 1/2 cups whole salmonberries into cake mixture; pour evenly into prepared pans.\nBake in the preheated oven until a toothpick inserted near the center comes out clean, about 30 minutes.\nWhile cake is baking, cook remaining 1 cup salmonberry mixture, remaining 1/2 cup whole salmonberries, and sugar in a saucepan over medium high heat, stirring constantly, until mixture begins to simmer; remove from heat.\nTo assemble: While cake is still warm, gently poke holes all over the top of the cake layers with a fork. Pour half the cooled salmonberry mixture over each cake layer; allow to cool completely. Allow to cool completely.\n",
        "picture_link": "1nR2lOa3Tt.iGrCPByjwHqV2N5t7916"
    },
    {
        "title": "Puffed Wheat Squares",
        "ingredients": [
            "10 cups puffed wheat cereal ADVERTISEMENT",
            "1 cup corn syrup ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "6 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grease a 9x13-inch pan. Place puffed wheat in a large heat-proof bowl; set aside.\nBring corn syrup, white sugar, butter, cocoa powder, and brown sugar to a boil in a heavy saucepan. Remove cocoa mixture from heat; stir in vanilla extract. Pour cocoa mixture over puffed wheat cereal; stir until well combined.\nPress puffed wheat mixture into prepared pan. Allow to cool completely before cutting into bars.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Peanut Sauce",
        "ingredients": [
            "1/2 cup peanut butter ADVERTISEMENT",
            "1/4 cup coconut milk ADVERTISEMENT",
            "4 teaspoons minced fresh cilantro ADVERTISEMENT",
            "2 teaspoons soy sauce ADVERTISEMENT",
            "1 teaspoon honey ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend peanut butter, coconut milk, cilantro, soy sauce, honey, garlic, and cayenne pepper in a blender until smooth.\n",
        "picture_link": "vraxa2SB8A972C1FIvpxdv2YTiUkFlC"
    },
    {
        "title": "Halloween Cat Eyes JIGGLERS",
        "ingredients": [
            "1 1/4 cups boiling tonic water (do not add cold water) ADVERTISEMENT",
            "2 (3 ounce) packages JELL-O Brand Lemon Flavor Gelatin ADVERTISEMENT",
            "4 red grapes, cut into sixths ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spray 24 mini muffin pan cups with cooking spray; set aside. Add boiling tonic water carefully to gelatin mixes in large bowl (gelatin will foam); stir 3 min. until completely dissolved. Skim off any residual foam.\nSpoon 1 tsp. of gelatin into each mini muffin cup. Place grape piece in the center. Chill 5 min. Spoon remaining gelatin over grapes. Refrigerate 3 hours or until firm.\n",
        "picture_link": "SjNJkGIxbi0ZnUkYeIayavR8or4/Vja"
    },
    {
        "title": "Creamy Basil Jack O' Pumpkin",
        "ingredients": [
            "1/2 teaspoon vegetable oil ADVERTISEMENT",
            "1/2 white onion, chopped ADVERTISEMENT",
            "1 tablespoon crushed garlic ADVERTISEMENT",
            "1/2 teaspoon cracked black pepper ADVERTISEMENT",
            "4 cups peeled, cubed pumpkin ADVERTISEMENT",
            "1/2 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "2 tablespoons herb mayonnaise ADVERTISEMENT",
            "1/2 teaspoon basil puree ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a skillet over medium heat; cook and stir onion, garlic, and pepper in hot oil until onion is golden, 10 to 15 minutes. Stir pumpkin into onion mixture and cook until pumpkin is tender, 15 to 20 minutes.\nStir cream cheese, mayonnaise, and basil puree together in a microwave-safe bowl; microwave until warmed and smooth, about 1 minute. Pour cheese mixture over pumpkin mixture and toss to coat; cook until warmed, about 5 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Tomato and Almond Gazpacho",
        "ingredients": [
            "3 cups diced vine-ripened tomatoes ADVERTISEMENT",
            "3 cups chopped cucumber, seeds removed but not peeled ADVERTISEMENT",
            "1 cup diced red onion ADVERTISEMENT",
            "1 clove garlic, sliced ADVERTISEMENT",
            "3 cups tomato juice ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "3 tablespoons sherry vinegar ADVERTISEMENT",
            "2/3 cup Dannon Oikos Plain Greek Nonfat Yogurt ADVERTISEMENT",
            "1 cup sliced almonds, toasted ADVERTISEMENT",
            "Country bread or French baguette ADVERTISEMENT",
            "Olive oil for toasting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the tomatoes in the bowl of a food processor and pulse until chopped finely but not pureed smooth.\nPour out in to a large mixing bowl then repeat with the cucumbers, onion and garlic. Once everything is in the mixing bowl, add the tomato juice and salt along with the vinegar.\nWhisk in the Dannon Oikos Plain Greek Nonfat Yogurt then refrigerate the soup for at least an hour so the flavors can blend. In the meantime, preheat your oven to 350 degrees.\nSlice some country bread or baguette about an inch thick and lay it out on a sheet tray. Drizzle it with olive oil then season the bread with salt and freshly ground black pepper and place it in the oven. Bake for 10-12 minutes, until golden brown and toasted but still chewy in the center.\nLadle some soup in to a bowl, sprinkle with toasted almonds and eat with some of the toasted bread.\n",
        "picture_link": "p0Xh6tEgOIPkmjTkTzZFDYZhMZ/yv0C"
    },
    {
        "title": "Memere's Holiday Pork Stuffing",
        "ingredients": [
            "2 pounds ground pork ADVERTISEMENT",
            "1 onion, finely chopped ADVERTISEMENT",
            "1 (32 ounce) carton chicken broth, or as needed ADVERTISEMENT",
            "1 (16 ounce) package seasoned dry stuffing mix (such as Bell's Traditional Stuffing®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBring pork, onion, and chicken broth to a simmer in a large pot; cook, stirring occasionally to break up large pieces of pork, until pork is no longer pink at the center, about 30 minutes.\nRemove pot from heat; stir in stuffing mix until evenly moistened. Pour mixture into a baking dish with a lid.\nBake in the preheated oven until stuffing is heated through and flavors are blended, about 45 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pear Ginger Soy Salad",
        "ingredients": [
            "1 red onion, chopped ADVERTISEMENT",
            "1 orange bell pepper, chopped ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "1/4 cup olive oil, divided ADVERTISEMENT",
            "1 teaspoon minced garlic, or to taste ADVERTISEMENT",
            "1 teaspoon minced fresh ginger, or to taste ADVERTISEMENT",
            "2 pears, cut into bite-size chunks ADVERTISEMENT",
            "1/4 cup ponzu sauce (citrus soy-based sauce), divided ADVERTISEMENT",
            "1 (12 ounce) bag mixed salad greens, or to taste ADVERTISEMENT",
            "1 cucumber, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 450 degrees F (230 degrees C). Grease a baking sheet.\nSpread onion and bell pepper in the prepared baking sheet and spray with cooking spray.\nBake in the preheated oven until golden, about 15 minutes.\nHeat 1 tablespoon olive oil in a skillet over medium heat; cook and stir garlic and ginger in the hot oil until garlic begins to brown slightly, 2 to 3 minutes. Add pears to garlic mixture and cook until pears are evenly coated in oil, about 1 minute. Reduce heat to medium-low and pour 1 tablespoon ponzu over pears; cook until pears begin to brown, 5 to 10 minutes. Add more garlic and ginger if desired.\nMix remaining 3 tablespoons olive oil and 3 tablespoons ponzu in a small saucepan; bring to a boil. Add garlic and ginger if desired. Remove saucepan from heat and cool.\nCombine greens, cucumber, onion, bell pepper, and pears in a bowl; drizzle with ponzu-olive oil mixture. Toss salad to evenly coat.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Artichoke and Blue Cheese Bisque",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "1/4 teaspoon dried thyme ADVERTISEMENT",
            "2 tablespoons vermouth ADVERTISEMENT",
            "1 (14 ounce) can artichoke hearts, drained and liquid reserved ADVERTISEMENT",
            "1 cup chicken broth, or as needed ADVERTISEMENT",
            "1/4 cup blue cheese salad dressing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a saucepan over medium heat; cook and stir onion and thyme in the melted butter until onion is slightly softened, about 5 minutes. Add vermouth; cook and and stir until liquid is evaporated, 2 to 3 minutes.\nPour liquid from artichoke hearts into a measuring cup; add enough chicken broth to equal 1 1/2 cup.\nTransfer onion mixture to a blender and top with drained artichoke hearts; blend, adding chicken broth mixture as needed, until mixture is smooth. Pour artichoke mixture back into the pan and mix in remaining chicken broth mixture and blue cheese dressing. Bring to a simmer and cook, stirring often, until bisque is heated through, about 5 minutes. Serve warm or cold.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Andy's Prosciutto Scallops",
        "ingredients": [
            "1/4 cup extra-virgin olive oil ADVERTISEMENT",
            "1/4 cup chopped sun-dried tomatoes ADVERTISEMENT",
            "2 tablespoons chopped fresh basil leaves ADVERTISEMENT",
            "2 tablespoons chopped black olives ADVERTISEMENT",
            "12 sea scallops ADVERTISEMENT",
            "2 teaspoons seafood seasoning (such as Old Bay®) ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon freshly ground black pepper ADVERTISEMENT",
            "12 slices prosciutto ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a large baking dish with butter.\nPlace olive oil, sun-dried tomatoes, basil, and olives in a food processor; pulse until finally chopped.\nSeason scallops with seafood seasoning, salt, and pepper. Fold each slice of prosciutto in half lengthwise. Rub tomato mixture over scallops and wrap each with a slice of prosciutto. Arrange wrapped scallops on the prepared baking dish, seam sides down.\nBake in the preheated oven until prosciutto is crispy and scallops are opaque, about 15 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cheesy Slow Cooker Potato Soup",
        "ingredients": [
            "7 slices bacon ADVERTISEMENT",
            "2 (10.75 ounce) cans cream of celery soup ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cheese soup ADVERTISEMENT",
            "sea salt and ground black pepper to taste ADVERTISEMENT",
            "1 pinch dried oregano, or to taste (optional) ADVERTISEMENT",
            "1 pinch garlic salt, or to taste (optional) ADVERTISEMENT",
            "1 pinch garlic powder, or to taste (optional) ADVERTISEMENT",
            "1 pinch ground paprika, or to taste (optional) ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "7 potatoes, peeled and cubed ADVERTISEMENT",
            "1 cup frozen vegetables, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels; chop.\nPour celery soup and cheese soup into a slow cooker set to Low. Season with sea salt, pepper, oregano, garlic salt, garlic powder, and paprika. Stir in chicken broth, water, and butter.\nPlace potatoes in a large microwave-safe bowl. Cook on high until slightly softened, 7 to 8 minutes.\nStir potatoes into the slow cooker. Add bacon and frozen vegetables.\nCook on Low, stirring every hour, until potatoes are soft, 4 to 5 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Bee Sting Cake ",
        "ingredients": [
            "Cake: ADVERTISEMENT",
            "2/3 cup milk ADVERTISEMENT",
            "6 tablespoons butter ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1 (.25 ounce) package active dry yeast ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "Topping: ADVERTISEMENT",
            "1 1/4 cups sliced almonds ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "9 tablespoons butter ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "1 (3.5 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 2/3 cup milk in a small saucepan over medium heat until it begins to bubble, 3 to 4 minutes. Remove from heat and stir in 6 tablespoons butter. Cool to lukewarm, about 5 minutes.\nCombine flour, 1/3 cup sugar, and yeast in a large bowl. Pour in milk and butter mixture; add egg. Beat with an electric mixer on low speed until dough is smooth. Cover and let rise until doubled in size, about 1 hour.\nPunch dough down gently to deflate. Roll out to a 10-inch round on a floured work surface. Place in a 10-inch springform pan. Cover and let rise until doubled, about 30 minutes.\nPreheat oven to 375 degrees F (190 degrees C).\nCombine almonds, 1 cup sugar, and 9 tablespoons butter in a saucepan over medium heat; cook and stir until butter is melted and sugar is dissolved, about 5 minutes. Remove from heat; add 2 tablespoons milk and cool until lukewarm, about 5 minutes. Spread over the dough in the pan.\nBake in the preheated oven until golden brown, about 30 minutes. Run a knife around the edge of the pan to loosen cake; transfer to a wire rack to cool completely, 30 to 45 minutes.\nCombine 1 1/2 cup milk and vanilla pudding mix in a bowl; beat with a whisk until very smooth, about 2 minutes. Chill pudding until set, about 30 minutes.\nSlice cake in half lengthwise. Spread pudding over bottom cake layer and cover with top cake layer.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Amaretti Italian Cookies",
        "ingredients": [
            "5 cups finely chopped roasted almonds ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 1/2 teaspoons unsweetened cocoa powder ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 (1 ounce) bottle almond extract, or to taste ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "45 whole almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line 2 baking sheets with parchment paper.\nMix chopped almonds, 2 cups white sugar, and cocoa powder together in a bowl; add eggs and almond extract and stir until batter is well mixed. Form teaspoonfuls of batter into small balls.\nPlace 1/4 cup sugar in a bowl and roll balls in the sugar. Press a finger into the center of each ball, making an indentation. Place 1 almond in each indentation. Arrange cookies 2 inches apart on the baking sheets.\nBake in the preheated oven until edges begin to crisp, about 15 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Stupendous Chipotle Black Bean Soup",
        "ingredients": [
            "2 cups hot water ADVERTISEMENT",
            "2 teaspoons chicken stock concentrate (such as Knorr® Homestyle) ADVERTISEMENT",
            "3 (15 ounce) cans black beans, drained, divided ADVERTISEMENT",
            "1 canned chipotle pepper in adobo sauce (such as Goya®) ADVERTISEMENT",
            "4 teaspoons adobo sauce from chipotle peppers (such as Goya®) ADVERTISEMENT",
            "8 ounces bacon, cut into 1-inch pieces ADVERTISEMENT",
            "1 yellow onion, diced ADVERTISEMENT",
            "1/2 green bell pepper, seeded and diced ADVERTISEMENT",
            "1/2 red bell pepper, seeded and diced ADVERTISEMENT",
            "4 cloves garlic, minced, or more to taste ADVERTISEMENT",
            "1 1/2 teaspoons ground cumin ADVERTISEMENT",
            "1 dash ground black pepper ADVERTISEMENT",
            "1 (15 ounce) can diced tomatoes ADVERTISEMENT",
            "1/2 bunch fresh cilantro, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix hot water and chicken stock concentrate in a bowl until dissolved; pour into a blender. Add 1 can black beans, chipotle pepper, and adobo sauce; puree until smooth.\nPlace bacon in a large pot and cook over medium heat, turning occasionally, until crispy, 5 to 8 minutes. Transfer bacon to a plate lined with paper towels using a slotted spoon, reserving grease in the pot.\nStir onion, green bell pepper, and red bell pepper into the bacon grease in the pot; cook until soft, about 10 minutes. Add garlic, cumin, and black pepper; cook until fragrant, 30 to 45 seconds.\nStir black bean puree into the pot. Add remaining 2 cans black beans, bacon, diced tomatoes, and cilantro; bring to a boil. Simmer soup, stirring occasionally, until flavors combine, 20 to 30 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "DannyZ's Turkey Pumpkin Chili",
        "ingredients": [
            "1 1/2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "1 1/2 cups chopped yellow onion ADVERTISEMENT",
            "1/2 cup chopped green bell pepper ADVERTISEMENT",
            "1/2 cup chopped yellow bell pepper ADVERTISEMENT",
            "1 jalapeno pepper, diced small ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 pound ground turkey ADVERTISEMENT",
            "2 (15 ounce) cans black beans ADVERTISEMENT",
            "2 cups pumpkin puree ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "2 1/2 tablespoons chili powder ADVERTISEMENT",
            "1 1/2 teaspoons ground chipotle chile pepper ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "kosher salt to taste ADVERTISEMENT",
            "1/2 cup fat-free sour cream ADVERTISEMENT",
            "1/2 cup shredded low-fat Cheddar cheese ADVERTISEMENT",
            "3 tablespoons chopped cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large pot over medium heat; cook and stir onion until slightly softened, 3 to 4 minutes. Add green bell pepper, yellow bell pepper, jalapeno, and garlic; cook until tender, 5 to 8 minutes.\nStir turkey into the pot and cook until evenly browned, about 5 minutes. Remove from heat and carefully drain off excess grease. Pour 1 can black beans, pumpkin, and tomatoes over the turkey mixture. Drain the second can of beans and add to the pot.\nMix chili powder, ground chipotle pepper, black pepper, and salt into the pot. Simmer chili, stirring every 5 to 8 minutes, until flavors combine, about 30 minutes. Top each serving with sour cream, Cheddar cheese, and cilantro.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "White Chocolate Pudding Shots",
        "ingredients": [
            "2 cups heavy whipping cream ADVERTISEMENT",
            "2 (3.3 ounce) packages instant white chocolate pudding mix ADVERTISEMENT",
            "6 fluid ounces Irish cream liqueur (such as Baileys®) ADVERTISEMENT",
            "2 fluid ounces coffee-flavored liqueur (such as Kahlua®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat cream in a glass or metal bowl using an electric mixer until stiff peaks form. Lift your beater or whisk straight up: whipped cream will form sharp peaks. Add pudding mix and beat until fully incorporated and firm. Stir in Irish cream liqueur and coffee-flavored liqueur. Spoon pudding mixture into 24 2-ounce cups. Arrange on a baking sheet and freeze until set, at least 30 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Curried Mango Chutney Dip",
        "ingredients": [
            "1/2 teaspoon sunflower oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "1/2 teaspoon mild curry powder ADVERTISEMENT",
            "1 cup plain yogurt ADVERTISEMENT",
            "2 tablespoons mango chutney ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a skillet over medium heat. Cook and stir onion and garlic in hot oil until tender, about 5 minutes. Stir curry powder into the onion mixture; cook 1 minute more. Remove from heat to cool.\nBlend onion mixture, yogurt, chutney, and parsley in a food processor and blend until smooth.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Melon Salad",
        "ingredients": [
            "1 watermelon, peeled and cubed ADVERTISEMENT",
            "1 honeydew melon - peeled, seeded, and cubed ADVERTISEMENT",
            "1 cantaloupe - peeled, seeded, and cubed ADVERTISEMENT",
            "1 pineapple, peeled and cubed ADVERTISEMENT",
            "1 (16 ounce) package sliced fresh strawberries ADVERTISEMENT",
            "1 (12 ounce) bottle poppy seed salad dressing ADVERTISEMENT",
            "1 (8 ounce) container vanilla yogurt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine watermelon, honeydew, cantaloupe, pineapple, and strawberries in a large bowl. Whisk poppy seed dressing and yogurt together in a bowl; drizzle dressing mixture over fruit before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Blackberry Shortbread Bars",
        "ingredients": [
            "2 cups unsalted butter, softened ADVERTISEMENT",
            "4 egg yolks ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon ground cardamom ADVERTISEMENT",
            "1/3 teaspoon salt ADVERTISEMENT",
            "1 cup blackberry jam ADVERTISEMENT",
            "1/4 cup confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat butter in a bowl with an electric mixer until light and fluffy. Add egg yolks to butter one at a time, blending well after each addition.\nMix flour, white sugar, baking powder, cardamom, and salt together in a bowl. Stir flour mixture into butter mixture until just combined. Divide dough in half and wrap each tightly in plastic wrap. Freeze for at least 3 hours.\nPreheat oven to 350 degrees F (175 degrees C).\nGrate 1 ball of frozen dough evenly into the bottom of a baking pan. Spread blackberry jam over grated dough, leaving 1/2-inch space around the edges. Grate the second ball of frozen dough over the jam.\nBake in the preheated oven until golden brown, 30 to 40 minutes. After shortbread cools, sprinkle with confectioner's sugar and cut into bars.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Caramel Apple Jell-O® Shots",
        "ingredients": [
            "10 small Granny Smith apples ADVERTISEMENT",
            "1 teaspoon fresh lemon juice, or as needed ADVERTISEMENT",
            "1 (1 ounce) envelope instant caramel-flavored hot chocolate mix (such as Land O Lakes® Cocoa Classics®) ADVERTISEMENT",
            "1/2 cup boiling water ADVERTISEMENT",
            "1/2 cup coconut milk ADVERTISEMENT",
            "1 (.25 ounce) package gelatin (such as Knox ®) ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "2 drops yellow food coloring ADVERTISEMENT",
            "1/2 cup butterscotch schnapps ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Halve apples cutting them from the stem down. Use a melon baller to hollow the apples, leaving enough flesh for the shells to hold their form. Squeeze lemon juice over the apples to reduce browning; arrange onto a baking sheet.\nStir hot chocolate into boiling water in a saucepan off heat until smooth. Stir coconut milk into the cocoa mixture. Sprinkle gelatin over the cocoa mixture and leave undisturbed 1 to 2 minutes.\nPlace saucepan over medium-low heat. Stir gelatin into the cocoa mixture. Add sugar; stir to dissolve sugar into the mixture. Drop yellow food coloring into the mixture. Remove saucepan from heat and cool mixture slightly.\nPour cocoa mixture into the apple shells. Refrigerate 8 hours to overnight.\nCut each apple half into 4 wedges; serve immediately.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "East Indian Peach Salad",
        "ingredients": [
            "1/2 cup low-fat vanilla yogurt ADVERTISEMENT",
            "1 (16 ounce) can sliced peaches in juice, drained and juice reserved ADVERTISEMENT",
            "1/2 teaspoon curry powder, or to taste ADVERTISEMENT",
            "2 cups 1/2-inch pieces cooked ham ADVERTISEMENT",
            "1 cup halved seedless grapes ADVERTISEMENT",
            "8 lettuce leaves ADVERTISEMENT",
            "2 tablespoons sliced almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix yogurt, 1 tablespoon reserved peach juice, and curry powder together in a bowl.\nCombine peaches, ham, and grapes in a separate bowl; add yogurt mixture and toss gently.\nLine a serving platter with lettuce leaves. Scoop peach mixture into each leaf; sprinkle with almonds.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sesame Pepper Stir Fry",
        "ingredients": [
            "1 small head cabbage, thinly sliced ADVERTISEMENT",
            "2 red bell peppers, thinly sliced ADVERTISEMENT",
            "1 onion, sliced (optional) ADVERTISEMENT",
            "8 cloves garlic, finely diced ADVERTISEMENT",
            "4 teaspoons grated fresh ginger ADVERTISEMENT",
            "1/2 cup sesame oil, divided ADVERTISEMENT",
            "1 pound beef tenderloin, thinly sliced ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "4 teaspoons cornstarch ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix cabbage and red bell peppers together in a bowl. Mix onion, garlic, and ginger together in a separate bowl.\nHeat a wok or large skillet over medium-high heat; add 1/4 cup sesame oil. Cook and stir beef and onion mixture in the hot oil until beef is browned on both sides, 3 to 4 minutes. Add cabbage mixture to beef mixture; cook, stirring quickly, until cabbage wilts, onion begins to brown, and beef is fully cooked, about 5 minutes.\nStir remaining 1/4 cup sesame oil, soy sauce, sugar, and black pepper into beef and cabbage mixture; toss to coat. Mix water and cornstarch together in a bowl until cornstarch is dissolved; pour into beef and cabbage mixture. Cook and stir until sauce reduces and thickens, about 5 minutes.\n",
        "picture_link": "sUsiQy70yHTPP1uyoE821/y3kMEkn1K"
    },
    {
        "title": "Darin's Vegetable Spaghetti Sauce",
        "ingredients": [
            "3/4 cup butter ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "2 1/2 cups diced carrots ADVERTISEMENT",
            "2 1/2 cups diced celery ADVERTISEMENT",
            "2 1/2 cups diced onions ADVERTISEMENT",
            "2 (28 ounce) cans crushed tomatoes ADVERTISEMENT",
            "1 1/2 tablespoons dried parsley, or to taste ADVERTISEMENT",
            "1 tablespoon white sugar, or to taste ADVERTISEMENT",
            "6 tablespoons Parmesan cheese ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "1 tablespoon hot water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large pot over medium-low heat; add garlic and pepper. Cook and stir mixture until garlic is fragrant, about 3 minutes. Stir carrots, celery, and onions into the butter, increase heat to medium, and continue to cook and stir until the vegetables are tender, 5 to 7 minutes.\nStir crushed tomatoes, parsley, and sugar into the vegetable mixture. Reduce heat to low and cook mixture at a simmer, stirring occasionally, for 20 minutes. Add Parmesan cheese and simmer to melt the cheese, about 5 minutes more.\nWhisk cornstarch into hot water in a small bowl; add to sauce. Stir the cornstarch slurry into the sauce and cook until the sauce thickens, 1 to 2 minutes more.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Asian Sweet and Sour Meatballs",
        "ingredients": [
            "1 1/2 pounds ground round ADVERTISEMENT",
            "1 (8 ounce) can water chestnuts, finely chopped ADVERTISEMENT",
            "1 bunch green onions, finely chopped ADVERTISEMENT",
            "1 1/2 cups soft bread crumbs ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "3 tablespoons soy sauce ADVERTISEMENT",
            "1 (10 ounce) jar Crosse & Blackwell® Premium Ham Glaze ADVERTISEMENT",
            "1 cup chili sauce ADVERTISEMENT",
            "1 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1 teaspoon minced fresh ginger root ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 400 degrees F. Combine meat, water chestnuts, onions, bread crumbs, garlic and soy sauce in medium bowl. Mix thoroughly. Roll into 1 1/2-inch meatballs and place in baking pan.\nBake 30 minutes. While meatballs are baking, combine ham glaze, chili sauce, red pepper flakes and ginger. Heat until hot and bubbly. Remove meatballs from oven, toss with sauce and serve hot.\n",
        "picture_link": "4s9tTfaFWSvoDVwkgKf01w2tcOhGRta"
    },
    {
        "title": "Poppin' Jalapeno Blackberry Pie",
        "ingredients": [
            "4 cups blackberries ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "2 jalapeno peppers, sliced ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 1/2 cups brown sugar, divided ADVERTISEMENT",
            "3 tablespoons cornstarch ADVERTISEMENT",
            "2 1/2 cups all-purpose flour, or as needed ADVERTISEMENT",
            "1 cup butter, cubed ADVERTISEMENT",
            "1/4 cup ice water, or as needed ADVERTISEMENT",
            "1 cup quick-cooking oats ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Place a baking sheet on the bottom rack of the oven.\nCombine blackberries, honey, jalapeno peppers, and lemon juice in a large bowl. Mix 1/2 cup brown sugar and cornstarch together in a bowl; stir into blackberry mixture until brown sugar mixture is dissolved.\nMix flour and 1/2 cup brown sugar together in a separate large bowl; cut butter into flour mixture using a pastry blender or food processor until mixture forms pea-sized balls. Add ice water and mix with your hands until dough is well combined, adding flour if the mixture is too sticky and small amounts of water if the mixture is too dry.\nDivide dough in half and roll each half into a 9-inch circle on a well-floured surface. Press 1 circle into a 9-inch pie dish.\nRemove jalapeno peppers from blackberry mixture and discard. Slowly pour blackberry mixture into pie crust, leaving about 1/4-inch space between top of filling and top edge of pie crust.\nMix oats and 1/2 cup brown sugar together in a bowl; sprinkle over blackberry filling. Cover pie with second pie crust. Cut off excess edges from top crust and fold bottom crust edges over top crust edges, pinching to form a seal. Cut 2 slits in the top of crust for ventilation.\nPlace pie on the middle rack of the oven, centered over the baking sheet on the bottom rack to catch drips. Bake pie until crust starts turning golden, about 25 minutes. Reduce temperature to 350 degrees F (175 degrees C) and bake until entire crust is golden brown, about 40 more minutes.\n",
        "picture_link": ".1j9zNE1RO4QD7Bx8XIegvfYks/ri.O"
    },
    {
        "title": "Linguine Pasta Salad",
        "ingredients": [
            "16 ounces linguine pasta ADVERTISEMENT",
            "1/2 pound sliced fresh mushrooms ADVERTISEMENT",
            "12 cherry tomatoes, halved ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1/2 green pepper, diced ADVERTISEMENT",
            "1 (4 ounce) jar roasted red peppers, drained and chopped ADVERTISEMENT",
            "1 cucumber, diced ADVERTISEMENT",
            "Dressing: ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/3 cup distilled white vinegar ADVERTISEMENT",
            "1/4 cup ketchup ADVERTISEMENT",
            "1 tablespoon onion powder ADVERTISEMENT",
            "1 1/2 teaspoons celery seed ADVERTISEMENT",
            "1 1/2 teaspoons Worcestershire sauce ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon ground mustard ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "2/3 cup vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook linguine at a boil until tender yet firm to the bite, about 11 minutes; rinse with cold water and drain.\nStir linguine, mushrooms, cherry tomatoes, green pepper, red peppers, onion, and cucumber together in a large bowl.\nBlend sugar, vinegar, ketchup, onion powder, celery seed, Worcestershire sauce, salt, ground mustard, paprika, and garlic powder in a blender. Pour the vegetable oil in a steady stream into the blender while the mixture is blending. Mix a few seconds longer until the salad dressing is thick and creamy.\nPour dressing over pasta mixture and toss to coat. Cover with plastic wrap and refrigerate for at least 1 hour.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Elegant Deviled Eggs",
        "ingredients": [
            "12 hard-boiled eggs, peeled ADVERTISEMENT",
            "3/4 cup mayonnaise ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "Fresh cilantro leaves, chopped (optional) ADVERTISEMENT",
            "6 tablespoons Dickinson's® Sweet 'n' Hot Pepper & Onion Relish ADVERTISEMENT",
            "6 tablespoons Dickinson's® Cranberry Relish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Slice eggs in half and remove yolks. Mash yolks with fork in medium bowl. Add mayonnaise, salt and pepper. Blend well.\nFill egg whites with yolk mixture. Top half the eggs with Pepper and Onion Relish and half with Cranberry Relish. Chill before serving. Garnish with cilantro, if desired.\n",
        "picture_link": "kOD.rRuCZ3/Rri6SXKS1ecpegitxNHy"
    },
    {
        "title": "Falck Fudge Frosting",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "1/2 cup cocoa powder (such as Hershey's®) ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup milk, divided ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir sugar, cocoa powder, butter, and 7 tablespoons milk together in a saucepan; bring to a boil. Cook, stirring constantly, at a boil for 2 minutes. Remove immediately and put saucepan in a sink with 1 inch cold water in it to cool the frosting. Add remaining milk and vanilla extract to the frosting; stir until thick.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Honeydew Cucumber Summer Salad",
        "ingredients": [
            "1 honeydew melon - peeled, seeded, and cut into bite-sized pieces ADVERTISEMENT",
            "1 large cucumber, peeled and cut into bite-sized pieces ADVERTISEMENT",
            "1/2 cup diced red onion ADVERTISEMENT",
            "1/2 cup sliced almonds ADVERTISEMENT",
            "1 (4 ounce) container crumbled feta cheese ADVERTISEMENT",
            "1/3 cup heavy whipping cream ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 tablespoons poppy seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix honeydew melon, cucumber, red onion, almonds, and feta cheese together in a bowl.\nBeat cream, olive oil, and poppy seeds in a bowl using an electric mixer until thickened. Stir dressing into salad; refrigerate until flavors blend, 2 hours to overnight.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Glazed Apples and Sweet Potatoes with Pecan Streusel Topping",
        "ingredients": [
            "Crisco® Original No-Stick Cooking Spray ADVERTISEMENT",
            "4 medium sweet potatoes, cooked* then cut into 3/8-inch slices ADVERTISEMENT",
            "4 medium Gala apples, cored, peeled, and cut into 8 wedges ADVERTISEMENT",
            "1 cup golden raisins ADVERTISEMENT",
            "1 (10 ounce) jar Crosse & Blackwell® Premium Ham Glaze ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "Pecan Streusel Topping: ADVERTISEMENT",
            "2/3 cup packed brown sugar ADVERTISEMENT",
            "1/3 cup Pillsbury BEST® All Purpose Flour ADVERTISEMENT",
            "1/3 cup chopped pecans ADVERTISEMENT",
            "1/3 cup quick rolled oats ADVERTISEMENT",
            "3/4 teaspoon cinnamon ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 cup cold butter, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 350 degrees F. Coat 13 x 9-inch baking dish with no-stick cooking spray.\nCombine sliced cooked sweet potatoes, apples, raisins, ham glaze and salt in a large bowl. Spread evenly into prepared dish.\nFor Streusel: Mix brown sugar, flour, pecans, rolled oats, cinnamon and salt in a medium bowl. Cut in butter with pastry blender until mixture is crumbly. Spread evenly over sweet potato mixture. Bake uncovered 50 to 60 minutes or until potatoes are fork-tender and topping is golden brown.\n",
        "picture_link": "FWB4j4AOwaPUsQHtZoWtNskXhzXspeS"
    },
    {
        "title": "Cheese and Tomato Macaroni",
        "ingredients": [
            "1 (8 ounce) package elbow macaroni ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1 teaspoon garlic paste, or to taste ADVERTISEMENT",
            "1 (14.5 ounce) can plum tomatoes, chopped, juice reserved ADVERTISEMENT",
            "4 ounces shredded Cheddar cheese, divided ADVERTISEMENT",
            "water, or as needed (optional) ADVERTISEMENT",
            "1 tomato, sliced (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Set oven rack about 6 inches from the heat source and preheat the oven's broiler.\nBring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until cooked through but firm to the bite, 8 minutes. Drain and transfer pasta to a large baking dish.\nHeat vegetable oil and flour in a large skillet over medium heat; cook and stir until mixture is frothy and smooth, about 5 minutes. Add reserved tomato juice and garlic paste. Cook and stir until mixture is thickened and stir in chopped tomatoes and about 3/4 the Cheddar cheese. Simmer until cheese is melted, about 5 minutes more. Stir water into tomato sauce if mixture becomes too thick.\nPour tomato sauce over macaroni and top with remaining Cheddar cheese and sliced tomato.\nBroil in the preheated oven until cheese is melted and browned, about 5 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Zesty White Chicken Chili",
        "ingredients": [
            "1 (8.75 ounce) jar Dickinson's® Sweet 'n' Hot Pepper & Onion Relish ADVERTISEMENT",
            "2 boneless skinless chicken breasts, cooked and cut into 1/2-inch pieces ADVERTISEMENT",
            "1 (48 ounce) jar white beans, undrained ADVERTISEMENT",
            "16 ounces chicken broth ADVERTISEMENT",
            "2 cups shredded mozzarella cheese ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix all ingredients except cheese and sour cream in slow cooker. Cook on LOW 5 to 7 hours. Add cheese about 20 minutes before serving. Serve with dollop of sour cream.\n",
        "picture_link": "o/sYAoUjCyHe5JAgm3tXfcJ5/6ifUk2"
    },
    {
        "title": "Mediterranean Tabbouleh Salad",
        "ingredients": [
            "1 bag Minute® Multi-Grain Medley, uncooked ADVERTISEMENT",
            "1 cup vegetable broth ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 tablespoon fresh lemon juice ADVERTISEMENT",
            "1 tablespoon shallots, minced ADVERTISEMENT",
            "1/4 teaspoon Dijon-style mustard ADVERTISEMENT",
            "1/2 cup chopped fresh parsley ADVERTISEMENT",
            "1/2 cup cucumber, peeled, seeded, and chopped ADVERTISEMENT",
            "1/2 cup cherry tomatoes, halved ADVERTISEMENT",
            "2 green onions, sliced ADVERTISEMENT",
            "1 tablespoon fresh mint leaves, chopped ADVERTISEMENT",
            "Salt and ground black pepper, to taste ADVERTISEMENT",
            "1/4 cup crumbled feta cheese (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare Multi-Grain Medley according to package directions, substituting broth for water. Cool.\nIn a large bowl whisk together olive oil, lemon juice, shallots and mustard. Fold in Multi-Grain Medley and remaining ingredients. Season with salt and pepper to taste. If desired, top with feta cheese.\n",
        "picture_link": "pIqK3lSyinYRr3nKgJRz1AMtL36JMOu"
    },
    {
        "title": "Pecan Pie Bread Pudding",
        "ingredients": [
            "1 (6 ounce) mini loaf French bread, cubed ADVERTISEMENT",
            "Crisco® Original No-Stick Cooking Spray ADVERTISEMENT",
            "6 large eggs ADVERTISEMENT",
            "1 (14 ounce) can Eagle Brand® Sweetened Condensed Milk ADVERTISEMENT",
            "3/4 cup dark corn syrup ADVERTISEMENT",
            "1/2 cup firmly packed brown sugar ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups coarsely chopped pecans, divided ADVERTISEMENT",
            "Vanilla ice cream (optional) ADVERTISEMENT",
            "Hungry Jack® Original Syrup (optional) ADVERTISEMENT",
            "Smucker's® Sundae Syrup™ Caramel Flavored Syrup (optional) ADVERTISEMENT",
            "Whipped topping (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 350 degrees F. Spread bread cubes in single layer on 15x10-inch baking pan. Bake, stirring occasionally, 10 minutes or until cubes are toasted. Coat 13 x 9-inch baking dish with no-stick cooking spray.\nBeat eggs in large bowl with electric mixer on medium speed until fluffy. Blend in sweetened condensed milk, dark corn syrup, brown sugar, butter and vanilla. Stir in toasted bread cubes and 1 cup pecans until evenly moistened. Pour into prepared baking dish. Sprinkle with remaining pecans. Allow to stand 30 minutes.\nBake 40 to 45 minutes or until golden brown around the edges. Cool 5 minutes. Serve warm or cooled with ice cream, syrup, caramel syrup or whipped topping, as desired.\n",
        "picture_link": "5oOJ4iLeNtVnUrlVJjsvdUKunQbknDK"
    },
    {
        "title": "Roasted Artichoke",
        "ingredients": [
            "2 (9 ounce) packages frozen artichoke hearts, thawed ADVERTISEMENT",
            "1 tablespoon olive oil, or more to taste ADVERTISEMENT",
            "2 teaspoons salt, divided ADVERTISEMENT",
            "1 shallot, minced ADVERTISEMENT",
            "3 tablespoons lime juice ADVERTISEMENT",
            "1 tablespoon white wine vinegar ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 cup finely chopped fresh basil ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "3 tablespoons capers, rinsed and drained ADVERTISEMENT",
            "3 tablespoons chopped roasted red bell pepper ADVERTISEMENT",
            "1/4 cup chopped sweet yellow onion ADVERTISEMENT",
            "3 tablespoons balsamic glaze (reduced balsamic vinegar), or more to taste ADVERTISEMENT",
            "1/4 cup shaved Parmesan cheese, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nToss artichoke hearts with 1 tablespoon olive oil in a bowl to coat; spread onto a baking sheet. Sprinkle 1 teaspoon salt over the artichoke hearts.\nRoast in preheated oven until they get a little brown around the edges, 15 to 20 minutes.\nWhile the artichokes roast, vigorously whisk shallot, lime juice, vinegar, mustard, 1 teaspoon salt, and black pepper together in a bowl. Add basil; stir. Slowly stream 1/2 cup olive oil into the mixture while whisking.\nTransfer artichoke hearts to a serving dish. Pour about 1/3 of the dressing over the artichokes and toss gently to coat. Add capers, bell pepper, and onion. Pour more dressing over the mixture until everything is coated, but not swimming in liquid. Top with balsamic glaze and shaved Parmesan cheese.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cherry Gelatin Salad",
        "ingredients": [
            "1 (21 ounce) can cherry pie filling ADVERTISEMENT",
            "1 (8 ounce) can crushed pineapple, undrained ADVERTISEMENT",
            "2 (3 ounce) packages cherry-flavored gelatin mix ADVERTISEMENT",
            "2 cups boiling water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir cherry pie filling, pineapple, and gelatin mix into boiling water until gelatin is dissolved. Pour mixture into a glass baking dish. Refrigerate until set, at least 2 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Artichokes and Hummus Dip",
        "ingredients": [
            "3 large cloves garlic, smashed, divided ADVERTISEMENT",
            "1/2 lemon ADVERTISEMENT",
            "4 artichokes, trimmed and stemmed ADVERTISEMENT",
            "1/4 cup extra-virgin olive oil ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "1 teaspoon white sugar, or more to taste ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "sea salt to taste ADVERTISEMENT",
            "1 green bell pepper, diced ADVERTISEMENT",
            "1 tomato, diced ADVERTISEMENT",
            "1 (15 ounce) can chickpeas (garbanzo beans), drained and rinsed ADVERTISEMENT",
            "1/4 cup plain European-style yogurt, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour enough water into a pot with a steamer insert to reach about 2 inches deep. Add 1 smashed garlic clove and half a lemon to the water. Put steamer insert into the pot and bring water to a boil. Arrange artichokes in the steamer insert and place a lid on the pot. Steam artichokes until a knife easily pierces the bottom of the largest artichoke, 30 to 45 minutes.\nBlend olive oil, cumin, sugar, lemon juice, and a pinch of sea salt in a blender until smooth. Add green bell pepper and tomato; blend until smooth, about 1 minute. Pour chickpeas and yogurt into the blender; blend thoroughly. Thicken dip with more yogurt, if desired. Season with sea salt; serve with the steamed artichokes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Zesty Pepper and Onion Dip",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 (8.75 ounce) jar Dickinson's® Sweet 'n' Hot Pepper & Onion Relish ADVERTISEMENT",
            "Assorted crackers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat cream cheese in a medium bowl until smooth. Gradually mix in relish. Spoon into decorative bowl. Chill at least 1 hour. Serve with crackers.\nFor an easier option, unwrap block of cream cheese and place on decorative plate. Pour relish over top. Serve with small serving knife and crackers.\n",
        "picture_link": "hJYMuvq3X8/Occf/zEVKk.OzmmgCtZK"
    },
    {
        "title": "Ahi Tuna Fish Soup",
        "ingredients": [
            "4 cups water ADVERTISEMENT",
            "1/2 pound Chinese long beans, cut into halves ADVERTISEMENT",
            "1 chayote squash, cut into small wedges ADVERTISEMENT",
            "1 (1 inch) piece ginger, peeled and sliced thick ADVERTISEMENT",
            "1 green onions, chopped ADVERTISEMENT",
            "2 frozen thick ahi tuna steaks, thawed ADVERTISEMENT",
            "2 heads bok choy, chopped ADVERTISEMENT",
            "1 tomato, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put water in a pot; add long beans, chayote, ginger, and green onion. Bring the water to a boil, place a lid on the pot, and reduce heat to medium. Continue cooking until the vegetables are tender, about 8 minutes.\nGently drop tuna steaks into the water; add bok choy and tomato. Return cover to pot, reduce heat to low, and cook until the tuna is cooked through, about 20 minutes. Remove pot from heat; cool 5 minutes before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    }
]