[
    {
        "title": "Maritime Donair Sauce",
        "ingredients": [
            "2/3 cup sweetened condensed milk ADVERTISEMENT",
            "1/4 cup white vinegar ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together milk, vinegar, and garlic powder in a bowl. Refrigerate for at least 1 hour before using.\n",
        "picture_link": "G0/5yhs7grZAOUXFWKKwiCM2b0191YS"
    },
    {
        "title": "Bacon Pea Salad",
        "ingredients": [
            "4 slices bacon ADVERTISEMENT",
            "3/4 cup mayonnaise ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 (20 ounce) package fresh green peas ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "1/2 cup cubed Cheddar cheese ADVERTISEMENT",
            "1/3 cup chopped onion ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels and crumble. Reserve 1 tablespoon bacon grease.\nWhisk mayonnaise, reserved bacon grease, honey, sugar, salt, and black pepper together in a bowl until dressing is smooth.\nMix bacon, peas, celery, Cheddar cheese, and onion together in a bowl. Drizzle dressing over salad and toss to coat. Refrigerate until chilled, about 30 minutes.\n",
        "picture_link": "vSqz5xpLGsDw7Izwn64q2UpWyWhk8Bu"
    },
    {
        "title": "Cheese-Stuffed Pork Tenderloin",
        "ingredients": [
            "2 green onions, chopped ADVERTISEMENT",
            "2 slices cooked bacon, crumbled ADVERTISEMENT",
            "3 tablespoons shredded Cheddar cheese ADVERTISEMENT",
            "2 tablespoons cream cheese, softened ADVERTISEMENT",
            "2 tablespoons frozen chopped spinach ADVERTISEMENT",
            "2 tablespoons finely chopped white mushrooms ADVERTISEMENT",
            "1/4 teaspoon chopped garlic ADVERTISEMENT",
            "1 pinch dried parsley ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 pork tenderloin, butterflied and pounded flat ADVERTISEMENT",
            "1 cup dry bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a baking sheet.\nMix green onions, bacon, Cheddar cheese, cream cheese, spinach, mushrooms, garlic, parsley, salt, and pepper in a bowl. Spread onto one side of pounded tenderloin. Roll tenderloin around the filling in a jelly-roll fashion. Coat rolled tenderloin with bread crumbs; place on the prepared baking sheet.\nBake in the preheated oven until pork is no longer pink in the center, about 1 1/2 hours. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C).\n",
        "picture_link": "E9SYlR8bjtj/m49Pdp8cpJw0zrgNAUW"
    },
    {
        "title": "Rabbit with Mustard",
        "ingredients": [
            "1 (2 pound) rabbit, cleaned and cut into pieces ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "3 tablespoons prepared mustard ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "1 cup white wine ADVERTISEMENT",
            "4 small onions ADVERTISEMENT",
            "2 slices bacon, cut into 1/2 inch pieces ADVERTISEMENT",
            "1 orange ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nSeason the rabbit with salt and pepper, and spread the mustard onto it. Place into a Dutch oven, and pour the oil and white wine around it. Then put in the small onions and sprinkle with the bacon pieces.\nBake covered, for 30 minutes in the preheated oven. Remove lid and turn rabbit pieces over. Squeeze some juice from the orange over. Return to the oven, uncovered, for 30 minutes, or until rabbit is tender. Serve with sliced orange and mashed potato. Bon Appetite!!!\n",
        "picture_link": "lo5tTPJydu7HCg.rp3TCaF8JA9KgbQS"
    },
    {
        "title": "Baked Mango-Ginger Swordfish",
        "ingredients": [
            "2 pounds swordfish steaks ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1/2 cup dry sherry ADVERTISEMENT",
            "1 tablespoon minced fresh ginger root ADVERTISEMENT",
            "1 cup mango chutney ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place swordfish steaks in a large, shallow bowl. In a small bowl, mix lemon juice, dry sherry, ginger and mango chutney. Pour the mixture over swordfish steaks, turning steaks to coat. Cover, and marinate in the refrigerator 1 hour.\nPreheat oven to 350 degrees F (175 degrees C).\nPlace swordfish steaks in a medium baking dish. Cover with marinade. Bake in the preheated oven 20 to 30 minutes, basting occasionally with marinade, until fish is easily flaked with a fork.\n",
        "picture_link": "epG52tDSTwk79M.JffG5ruC0jjkMGAa"
    },
    {
        "title": "Three Egg Omelet",
        "ingredients": [
            "12 eggs, lightly beaten ADVERTISEMENT",
            "3 slices cooked ham, chopped ADVERTISEMENT",
            "3 slices cooked turkey meat, chopped ADVERTISEMENT",
            "3 green onions, sliced ADVERTISEMENT",
            "1 tomato, diced ADVERTISEMENT",
            "1 sprig fresh parsley, chopped ADVERTISEMENT",
            "1/2 medium green bell pepper, diced ADVERTISEMENT",
            "1 (8 ounce) package shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spray or lightly grease a large skillet and heat over medium heat.\nCrack 3 eggs into a glass measuring cup and beat with a fork or whisk until scrambled. Pour eggs into heated skillet, swirling the pan to coat the bottom. Cover and let cook until eggs are firm, about 2 minutes.\nTop with 1/4 each of the chopped ham, turkey, green onions, tomato, parsley, green bell pepper, and Cheddar cheese. Fold egg in half over fillings, and serve warm. Repeat with remaining ingredients for 4 omelets.\n",
        "picture_link": "QbCFm4sfiS0vU.ZBJtf8kjFuiTbLFgW"
    },
    {
        "title": "Chocolate Cheesecake Milkshake",
        "ingredients": [
            "1/2 (8 ounce) package cream cheese ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "6 scoops chocolate ice cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the cream cheese and 1 cup milk in a blender, and blend until smooth. Place the remaining milk and ice cream in the blender, and continue to blend until smooth. Serve cold.\n",
        "picture_link": "rryQ1POiAbSOt7FMiU/38UB.YRebR0u"
    },
    {
        "title": "Suburban Cowboy Delight",
        "ingredients": [
            "1/2 pound bacon, cut into 1 inch pieces ADVERTISEMENT",
            "1/2 pound ground beef ADVERTISEMENT",
            "1/2 cup diced green bell pepper ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1 (1.25 ounce) package chili seasoning mix ADVERTISEMENT",
            "1 (14.5 ounce) can canned peeled and diced tomatoes ADVERTISEMENT",
            "1 (15 ounce) can baked beans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet over medium heat, fry bacon pieces until browned. Crumble the ground beef into the skillet with the bacon, and stir in the green pepper and onion. Continue to cook until the beef is no longer pink. Drain off any excess grease. Stir in the chili seasoning mix until the meat is coated.\nAdd the tomatoes and beans to the skillet, mix well, and simmer for 15 to 20 minutes. (I always put my biscuits in just then, and they finish together.)\n",
        "picture_link": "SZ.MQR8LwHeQs3B9Laat8xj3EOWA8MO"
    },
    {
        "title": "Sausage Dressing",
        "ingredients": [
            "1/2 (12 ounce) package fresh cranberries ADVERTISEMENT",
            "1 pound sausage ADVERTISEMENT",
            "6 cups bread cubes ADVERTISEMENT",
            "1 cup seasoned dry bread crumbs ADVERTISEMENT",
            "1 medium onion, chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 teaspoon chopped fresh parsley ADVERTISEMENT",
            "1/2 teaspoon chopped fresh oregano ADVERTISEMENT",
            "1/2 teaspoon chopped fresh sage ADVERTISEMENT",
            "1 pinch fresh thyme ADVERTISEMENT",
            "1/3 teaspoon celery seed ADVERTISEMENT",
            "1/4 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/3 teaspoon ground black pepper ADVERTISEMENT",
            "2 cups reduced sodium chicken broth ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup chopped orange with skin on ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cranberries in a medium saucepan with enough water to cover, and bring to a boil. Cook just until skins pop. Drain, and cool.\nPlace sausage in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, and cool.\nPreheat oven to 350 degrees F (175 degrees C).\nIn a medium baking dish, mix cranberries, sausage, bread cubes, dry bread crumbs, onion, and garlic. Season with parsley, oregano, sage, thyme, celery seed, ground ginger, salt, and pepper. Stir in chicken broth to desired consistency. Mix in walnuts and orange.\nBake 25 minutes in the preheated oven, until surface is crisp and lightly browned.\n",
        "picture_link": "5lf0YkJj8nHUZuuwi4ScsWS9cdGvtee"
    },
    {
        "title": "Grilled Italian Zucchini",
        "ingredients": [
            "2 zucchini, cut lengthwise into 1/4 inch slices ADVERTISEMENT",
            "1 (8 ounce) bottle Italian-style salad dressing ADVERTISEMENT",
            "3 ounces shredded Cheddar cheese ADVERTISEMENT",
            "3 ounces shredded Pepper Jack cheese ADVERTISEMENT",
            "1/8 teaspoon Italian-style seasoning ADVERTISEMENT",
            "1 tablespoon freshly grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place zucchini in a medium bowl with Italian-style salad dressing. Cover, and marinate in the refrigerator approximately 6 hours.\nPreheat an outdoor grill for high heat, and lightly oil grate.\nGrill zucchini slices about 2 minutes per side, until browned and tender.\nArrange grilled zucchini slices on a medium serving platter. Sprinkle with Cheddar cheese, Pepper Jack cheese and Italian-style seasoning. Microwave on high 90 seconds, or until cheeses are melted. Sprinkle with Parmesan cheese, and serve hot.\n",
        "picture_link": "ZJNedj4bci8bP1TpaxDt8tmw4WA3mua"
    },
    {
        "title": "Cuban Green Soup",
        "ingredients": [
            "2 ounces salt pork, diced ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "5 (15 ounce) cans navy beans, with juice ADVERTISEMENT",
            "2 (10 ounce) packages frozen turnip greens with turnip pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place a stock pot or Dutch oven over medium heat. Fry the salt pork for a few minutes to release some liquid. Add onion, and saute until translucent. Stir in the navy beans and turnip greens. Bring to a boil, reduce heat to medium-low, and simmer for about 30 minutes. Serve with home made pepper vinegar and a side of cornbread for restaurant-style dining.\n",
        "picture_link": "MyVC05SjCFy18um9r4qi67rER6jYWzC"
    },
    {
        "title": "Three Cheese Breakfast Bake",
        "ingredients": [
            "1/2 (1 pound) loaf French bread, cut into 1 inch cubes ADVERTISEMENT",
            "3 tablespoons butter, melted ADVERTISEMENT",
            "1/4 pound Swiss cheese, shredded ADVERTISEMENT",
            "1/4 pound Monterey Jack cheese, shredded ADVERTISEMENT",
            "2 cups diced cooked ham ADVERTISEMENT",
            "8 eggs, beaten ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "1 teaspoon Dijon mustard ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "3/4 cup sour cream ADVERTISEMENT",
            "1/3 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Arrange bread in the bottom of a lightly greased medium baking dish, and drizzle with butter. Top with Swiss cheese, Monterey Jack cheese, and ham.\nIn a medium bowl, blend eggs, milk, and mustard. Season with salt and pepper. Pour into the baking dish. Cover, and refrigerate 8 hours, or overnight.\nPreheat oven to 325 degrees F (165 degrees C). Blend sour cream and Parmesan cheese in a small bowl, and set aside.\nBake the layered mixture 1 hour in the preheated oven.\nSpread sour cream mixture over the surface of the baked dish, and continue cooking about 10 minutes, until surface is lightly browned. Allow to sit about 15 minutes before serving.\n",
        "picture_link": "pKQkqgxm2LRnCNacmDFQcYZafFFbp2e"
    },
    {
        "title": "Mango Cheese Tart with Blueberries",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "1/2 tablespoon butter ADVERTISEMENT",
            "2 egg yolks ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 mangos, peeled, seeded and chopped ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "2 cups blueberries ADVERTISEMENT",
            "1/3 cup confectioners' sugar for dusting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSift flour and 1/2 cup confectioners' sugar into a large bowl. Cut in butter until mixture resembles coarse crumbs. Mix in egg yolks with enough water to form a ball. Knead gently on a lightly floured surface until smooth. Roll out to line an 8 inch flan ring, or tart shell. Bake in preheated oven for about 20 minutes, or until pastry is golden. Allow to cool.\nIn a large bowl, combine cheese, 1/2 cup sugar, mangoes and lemon juice. Beat until mixture is fairly smooth, but still has chunks of mangoes. Spread into baked pastry shell and top with blueberries. Dust lightly with confectioners' sugar before serving.\n",
        "picture_link": "Vb3DOlqGG4n7nyiotxOkE/py/cuh5kW"
    },
    {
        "title": "Andouille Sausage",
        "ingredients": [
            "1 1/2 yards of large sausage casing, about 2 to 3 inches wide ADVERTISEMENT",
            "4 pounds lean pork meat ADVERTISEMENT",
            "2 pounds pork fat ADVERTISEMENT",
            "1/4 cup minced garlic ADVERTISEMENT",
            "2 tablespoons salt ADVERTISEMENT",
            "1 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1 teaspoon cayenne pepper ADVERTISEMENT",
            "1/4 teaspoon dried thyme ADVERTISEMENT",
            "1 tablespoon ground paprika ADVERTISEMENT",
            "1/4 teaspoon crushed bay leaf ADVERTISEMENT",
            "1/4 teaspoon dried sage ADVERTISEMENT",
            "5 teaspoons hickory-flavored liquid smoke ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Soak the casing in cold water for about an hour to soften it and loosen the salt in which it is packed. Place the wide end of the sausage stuffer up against the sink faucet and run cold water through the inside of the casing to remove excess salt.\nCut the meat and fat into 1/2-inch wide chunks. Pass them once through the coarse blade of a meat grinder. In a large bowl, mix together the ground pork and fat with the garlic, salt, pepper, cayenne, thyme, paprika, bay leaf, sage, and hickory smoke. A wooden spoon works well.\nCut the casing into 26 inch lengths and tie a small knot in one end of each. Fit the open end over the tip of the sausage stuffer and slide it on until the tip of the stuffer touches the knot. The casing will look like accordion folds. This keeps excess air from getting into the casings. Fit the stuffer onto the meat grinder or according the directions that come with the stuffer, or hold the wide end of the stuffer against or over the opening by hand.\nFill the hopper with the sausage mixture. Turn the machine on if it is electric and feed the stuffing gradually into the hopper; for a manual machine, push the stuffing through with a wooden pestle. The sausage casing will fill and inflate gradually. Stop filling about 1 1/4 inches from the funnel end and slip the casing off the funnel, smoothing out any bumps carefully with your fingers and being careful not to push the stuffing out of the casing. Tie off the open end of the sausage tightly with a piece of string or make a knot in the casing itself.\nTo cook, slice the sausage into half-inch rounds and grill in a hot skillet with no water for about 12 minutes on each side, or until brown and crisp at the edges.\n",
        "picture_link": "3/319kfO8yT/paNGQifGTzrTTLasOAi"
    },
    {
        "title": "Easter Cheese - Hrudka",
        "ingredients": [
            "12 eggs ADVERTISEMENT",
            "1 quart whole milk ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground cinnamon, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Crack eggs into a large saucepan and beat with a whisk. Whisk in milk, sugar, salt and cinnamon. Cook over medium-low to low heat, stirring constantly until the mixture fully forms curds and the whey separates. This will take 20 to 30 minutes. Using higher heat or failing to stir will result in a big pan of sweet scrambled eggs.\nDrain the mixture into a colander lined with several layers of cheese cloth. Use the cloth to shape into a ball and twist the top to remove excess moisture. Secure with a twist tie. Hang for several hours or overnight. I do it on the spigot of the kitchen sink (which would probably wig out the germ police, but I haven't gotten botulism in 34 years). Of course, you could let it drain initially there and then finish it overnight in the fridge suspended over a deep bowl.\n",
        "picture_link": "pg7gTrKVhYqUz5vatB7LmJTo0dyLb1u"
    },
    {
        "title": "Portuguese Muffins - Bolo Levedo",
        "ingredients": [
            "1 (.25 ounce) envelope active dry yeast ADVERTISEMENT",
            "1/4 cup warm water ADVERTISEMENT",
            "6 cups all-purpose flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/4 cup melted butter, cooled ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/4 cups milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, dissolve yeast in warm water with a pinch of the sugar. Set aside to ferment, about 10 minutes.\nTransfer the yeast mixture to a large bowl, and stir in the sugar, eggs, salt, flour, and milk until the dough comes together. Stir in the melted butter, then turn the dough out onto a floured surface, and knead for about 10 minutes, or until smooth and elastic. Cover dough with a cloth and set aside to rise until doubled in bulk, about 45 minutes.\nDivide dough into about 15 to 20 pieces, and shape them into flat round cakes about 1/2 inch thick. Place a cloth on the table and dust it with flour. Arrange the cakes on the cloth, allowing space for rising. Allow them to set for 1 1/2 hours.\nPlace the cakes in a heavy ungreased skillet, and cook over low heat. Fry the cakes on each side until golden.\n",
        "picture_link": "kqWttghbIyOZDG.pwSFbP0q0FJp202e"
    },
    {
        "title": "Orange Slush",
        "ingredients": [
            "1 (6 ounce) can frozen orange juice concentrate ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "1/2 cup sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "10 cubes ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender, combine orange juice concentrate, milk, sugar, vanilla and ice cubes. Blend until smooth. Pour into glasses and serve.\n",
        "picture_link": "mXUtwtTuR6bmZA2CVduETQIMWSsGgRq"
    },
    {
        "title": "Quick Chiles Rellenos Bake",
        "ingredients": [
            "3 (4 ounce) cans mild whole green chiles, drained (optional) ADVERTISEMENT",
            "2 cups shredded Pepper Jack cheese ADVERTISEMENT",
            "9 (8 inch) flour tortillas ADVERTISEMENT",
            "1 (19 ounce) can enchilada sauce ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSplit each chile lengthwise into halves and remove the seeds. Arrange 2 chile halves and about 3 1/2 tablespoons of the cheese near the outer edge of each tortilla. Roll tortilla to enclose the filling. Repeat process with remaining tortillas, chiles and cheese. Arrange the filled tortillas seam side down in a greased 9x13 inch baking pan. In a small bowl, whisk together the enchilada sauce and sour cream. Spoon over the filled tortillas.\nBake in preheated oven for 30 minutes, or until bubbly and heated through. Garnish with cilantro.\n",
        "picture_link": "pjCl6TY1KvF86wvrvCeR71dILGz7NAe"
    },
    {
        "title": "Pakistani Style Vegetables",
        "ingredients": [
            "1/2 teaspoon olive oil ADVERTISEMENT",
            "1 1/2 onions, chopped ADVERTISEMENT",
            "3 tablespoons minced garlic ADVERTISEMENT",
            "2 whole black peppercorns ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1 1/2 teaspoons garam masala ADVERTISEMENT",
            "1 1/2 teaspoons ground turmeric ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1/2 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 cup water, divided ADVERTISEMENT",
            "1/2 medium head cabbage, chopped ADVERTISEMENT",
            "2 potatoes, peeled and chopped ADVERTISEMENT",
            "2 tomatoes, sliced ADVERTISEMENT",
            "1 1/2 cups frozen green peas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a medium saucepan over medium heat, and stir in onions, garlic, and peppercorns. Saute until onions are tender. Mix in ginger, garam masala, turmeric, paprika, red pepper flakes, and salt. Stirring constantly, cook until onions are thoroughly coated with the seasonings.\nStir 1/4 cup water into the saucepan. Mix in cabbage, potatoes, tomatoes, and remaining water. Increase heat to medium-high. Continue to cook, stirring often, until all vegetables are tender, about 20 minutes. Stir in the peas during the last 5 minutes of cooking.\n",
        "picture_link": "OmdV69bUMYERwHyoC1SVRPod.vcquOS"
    },
    {
        "title": "Pupu Balls",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1/2 cup seasoned bread crumbs ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/2 cup soy sauce ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger whiskey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, mix ground beef, onion and seasoned bread crumbs. Form the mixture into bite-sized balls.\nIn a large skillet over medium high heat, cook the balls until evenly brown throughout.\nIn a large bowl, mix water, soy sauce, garlic and whiskey. Place the balls into the mixture. Cover and chill in the refrigerator at least 1 hour.\nTransfer the balls and sauce mixture to a slow cooker set to low heat. Cook at least 30 minutes before serving.\n",
        "picture_link": "DNFKHg77lLCcLtv7i6CG6wm4ButXXs2"
    },
    {
        "title": "Crab and Mushroom Enchiladas",
        "ingredients": [
            "1 pound imitation crabmeat, chopped ADVERTISEMENT",
            "1 (10 ounce) can red enchilada sauce ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1/2 pound fresh mushrooms, sliced ADVERTISEMENT",
            "1 (8 ounce) package shredded Mexican-style cheese blend ADVERTISEMENT",
            "8 (10 inch) flour tortillas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease a medium baking dish.\nIn a large bowl, mix the imitation crabmeat, red enchilada sauce, cream of mushroom soup, mushrooms, and 1/2 the cheese. Roll an equal amount of the mixture in each tortilla. Arrange the filled tortillas in the prepared baking dish, and cover with the enchilada sauce. Top with the remaining cheese.\nBake 20 minutes in the preheated oven, until the cheese is bubbly. Allow to sit about 5 minutes before serving.\n",
        "picture_link": "gSltZ/HA9SxXvN4Pn7dThVkg3OCjrWa"
    },
    {
        "title": "Reshmi Kebab (Silken Kebabs)",
        "ingredients": [
            "6 almonds ADVERTISEMENT",
            "6 jalapeno peppers, seeded and chopped ADVERTISEMENT",
            "8 cloves garlic ADVERTISEMENT",
            "1 inch piece fresh ginger root, peeled ADVERTISEMENT",
            "1 cup chopped fresh cilantro ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "2 pounds skinless, boneless chicken breast halves - cut into 1 1/2 inch pieces ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place almonds in a small bowl and cover with water. Allow to soak for 15 to 20 minutes; drain. Place almonds, peppers, garlic, ginger, and cilantro into the bowl of a food processor; blend until smooth. Season with salt, and blend in lemon juice. Blend in cream.\nTransfer mixture to a large, non metallic bowl. Place chicken in bowl, and turn to coat. Cover, and marinate in refrigerator for 24 hours.\nPreheat grill for high heat, and lightly oil grate. Remove meat from marinade, and thread onto skewers.\nBrush meat with butter, and arrange skewers on hot grate. Slowly cook the chicken until cooked through.\n",
        "picture_link": "zxoDOi4s93ZEIxST1T4TavHArPREMB6"
    },
    {
        "title": "Orange Chicken Delight",
        "ingredients": [
            "2 pounds skinless, boneless chicken breast meat ADVERTISEMENT",
            "2 pounds skinless, boneless chicken thighs ADVERTISEMENT",
            "2 tablespoons adobo seasoning ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "3 cups water, divided ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "1 cup chopped green bell pepper ADVERTISEMENT",
            "1 cup chopped celery ADVERTISEMENT",
            "2 cups orange marmalade ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season chicken breasts and thighs with adobo seasoning and pepper.\nPlace the seasoned chicken and 1 cup water in a large saucepan over medium heat. Turning frequently, cook until water has been reduced. Mix in remaining water, onion, green bell pepper, and celery. Cover, reduce heat to low, and continue cooking about 20 minutes, until vegetables are tender and chicken is no longer pink and juices run clear.\nStir orange marmalade into the saucepan, coating each piece of chicken. Cover, and continue cooking about 10 minutes.\n",
        "picture_link": "H8ETPvmv7G6HQNA2cvRuYhl.92Fcivy"
    },
    {
        "title": "Mediterranean Couscous",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 (10 ounce) box couscous ADVERTISEMENT",
            "1 (13.75 ounce) can artichoke hearts, drained, finely chopped ADVERTISEMENT",
            "1 large tomato, cut into small dice ADVERTISEMENT",
            "1/3 cup chopped fresh parsley ADVERTISEMENT",
            "1/3 cup crumbled feta cheese ADVERTISEMENT",
            "1 tablespoon fresh lemon juice ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring the water, olive oil, and salt to a boil in a saucepan. Pour in the couscous, cover, and immediately remove from heat. Let sit covered 5 minutes. Fluff with a fork. Stir in the, artichoke hearts, tomato, parsley, feta cheese, and lemon juice. Season with black pepper.\n",
        "picture_link": "agj.mOL20iVKQ7lJsTMsGuJLWBWcXTy"
    },
    {
        "title": "Easy Mochi",
        "ingredients": [
            "1 cup sweetened red bean paste ADVERTISEMENT",
            "1 cup sweet rice flour (mochiko) ADVERTISEMENT",
            "1 teaspoon green tea powder (matcha) ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/2 cup cornstarch, for rolling out the dough ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Wrap red bean paste in aluminum foil and place in the freezer for at least 3 hours. Mix sweet rice flour and green tea powder thoroughly in a microwave-safe glass or ceramic bowl. Stir in water, then sugar. Mix until smooth. Cover bowl with plastic wrap.\nCook the rice flour mixture in the microwave for 3 minutes and 30 seconds. Meanwhile, remove red bean paste from the freezer and divide paste into 8 equal balls. Set aside. Stir rice flour mixture and heat for another 15 to 30 seconds.\nDust work surface with cornstarch. While the mochi is still hot from the microwave, begin rolling balls the size of about 2 tablespoons. Flatten the mochi ball and place 1 frozen red bean paste ball in the center. Pinch the mochi over the red bean paste until the paste is completely covered. Sprinkle with additional cornstarch and place mochi seam side down in a paper muffin liner to prevent sticking. Repeat until all the mochi and red bean paste is used.\n",
        "picture_link": "Y28QAVaDHrTRpTwZjf9hA9Sw5ABcpzG"
    },
    {
        "title": "Scallops with Roasted Garlic Cream Sauce",
        "ingredients": [
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 head garlic, cut in half ADVERTISEMENT",
            "1 cup chicken stock ADVERTISEMENT",
            "1/2 cup cream ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 pound sea scallops ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 400 degrees F (200 degrees C).\nSpoon 3 tablespoons olive oil over the cut sides of the garlic head; wrap tightly in aluminum foil.\nRoast in the preheated oven until the garlic is soft, about 30 minutes; set aside until cool enough to handle.\nSqueeze the roasted garlic cloves into a saucepan; pour the chicken stock into the saucepan and use a fork to mash the garlic into the stock. Cook the stock over high heat until the liquid is reduced in volume by half, about 10 minutes. Stir the cream into the stock and remove from heat; set aside.\nMelt the butter with 1 tablespoon olive oil in a large skillet over medium-high heat. Season the scallops with salt and pepper; sear in the hot butter and oil mixture until opaque, about 3 minutes per side. Remove from heat immediately.\nStir the lemon juice into the cream sauce; spoon immediately onto 2 plates. Arrange the scallops on the plates. Garnish with the parsley to serve.\n",
        "picture_link": "zvrFi1FYYJz/bk1.xTHyWc0iP.S7.Ni"
    },
    {
        "title": "Quick Couscous with Raisins and Carrots",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "2 carrots, diced ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1/2 cup chicken broth ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "1 1/2 cups uncooked couscous ADVERTISEMENT",
            "1/4 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the butter in a large saucepan over medium heat, and cook and stir the carrots and onion until the carrots begin to soften and the onion is translucent, about 5 minutes. Pour in the chicken broth and water, and bring the mixture to a boil. Stir in the couscous, mixing well to avoid lumps, cover, and remove from the heat. Let the couscous stand covered until the water is absorbed, about 5 minutes.\nStir in the raisins, and serve hot.\n",
        "picture_link": "/HjqFgEXvwnMKofl.1qfyeHzjgGqvjG"
    },
    {
        "title": "BBQ Sauerkraut Casserole",
        "ingredients": [
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1 (27 ounce) can sauerkraut, drained ADVERTISEMENT",
            "2 cups tomato juice ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C).\nHeat a large skillet over medium-high heat, and stir in the ground beef and onion. Cook until the beef is crumbly, evenly browned, and no longer pink. Drain, and discard any excess grease.\nPour the beef mixture into a 3-quart casserole dish. Layer the sauerkraut over the ground beef, pour the tomato juice over the sauerkraut, then sprinkle with brown sugar. Bake in the preheated oven until the sauce is bubbly, about 60 minutes.\n",
        "picture_link": "cG/ECSQW9qWMQi4jQV.KG4Gc9TR6.o2"
    },
    {
        "title": "Eggplants With Pesto",
        "ingredients": [
            "1/2 cup olive oil, for frying ADVERTISEMENT",
            "2 large eggplants, halved lengthwise ADVERTISEMENT",
            "1 pinch salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 cup fresh basil leaves ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons pine nuts ADVERTISEMENT",
            "2 tablespoons freshly grated Parmesan cheese ADVERTISEMENT",
            "3 tablespoons extra-virgin olive oil, for pesto ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven's broiler and set the oven rack about 6 inches from the heat source.\nHeat 1/2 cup olive oil in a skillet over medium heat. While heating the oil, cut slits in a crisscross pattern in the 'meat' of the eggplant halves, being careful not to pierce the skin. This will allow the heat and oil to penetrate better. Lightly season the eggplant with salt and pepper; gently lay the eggplant halves into the hot oil, skin sides facing up, and fry until golden brown, about 10 minutes. Flip the eggplant halves and cook another 2 to 3 minutes. Remove and allow to drain on a plate lined with paper towels.\nMake the pesto by blending the basil, garlic, pine nuts, Parmesan cheese, and about half of the extra-virgin olive oil in a blender on Low until smooth; slowly stream the remaining extra-virgin olive oil into the mixture as it blends.\nArrange the eggplant halves in a broiler pan with the skin sides down. Slather the pesto over the surface of the eggplant.\nCook the eggplants under the broiler until the pesto begins to bubble, 7 to 10 minutes.\n",
        "picture_link": "cWGa1C7lALz9rsLDHql42/fgwr/5fyi"
    },
    {
        "title": "Grilled Gingered Salmon",
        "ingredients": [
            "1 cup soy sauce ADVERTISEMENT",
            "1 cup muscovado (dark brown) sugar ADVERTISEMENT",
            "1 (5 inch) piece of fresh ginger root, peeled and minced ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "2 cloves garlic, smashed ADVERTISEMENT",
            "1 (3 pound) whole salmon fillet with skin ADVERTISEMENT",
            "1 untreated cedar plank ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the soy sauce, muscovado sugar, minced ginger, olive oil, and garlic in a bowl, and pour into a resealable plastic zipper bag. Add the salmon fillet, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator overnight or up to 2 days.\nAbout 1/2 hour before grilling, soak cedar plank in water.\nPreheat an outdoor grill for medium heat, and lightly oil the grate.\nRemove the salmon from the marinade, and shake off excess. Discard the remaining marinade. Place the salmon, skin side down, onto the cedar plank.\nGrill with the grill cover closed until the salmon is opaque but still juicy, about 20 minutes. Carefully remove the salmon from the plank in one piece, leaving the skin on the plank.\n",
        "picture_link": "6aMiHYvaOmBJzHA6QWCH3WaD3gtcm.m"
    },
    {
        "title": "Gorton (French-Canadian Pork Spread)",
        "ingredients": [
            "2 pounds finely ground pork fat ADVERTISEMENT",
            "2 pounds finely ground pork ADVERTISEMENT",
            "2 onions, finely chopped ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "1 teaspoon ground cloves ADVERTISEMENT",
            "3/4 teaspoon ground nutmeg ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir the pork fat, ground pork, onions, water, cloves, and nutmeg together in a large pot. Season to taste with salt and pepper. Bring to a boil over medium-high heat, then reduce heat to medium-low, and simmer until the pork is tender, at least 1 1/2 hours. Use a potato masher to mash the pork mixture every 15 minutes as it cooks.\nThe longer you simmer the gorton, the better the flavor will be. Add water as needed to keep the mixture from boiling dry. When you're ready to stop cooking, let the liquid reduce as much as possible without letting it burn. Refrigerate the gorton overnight. Remove and discard the fat layer, or stir it into the meat for a creamier spread.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Brown Rice Pudding",
        "ingredients": [
            "1 1/2 cups heavy cream ADVERTISEMENT",
            "1 1/4 cups water ADVERTISEMENT",
            "1/2 cup short-grain brown rice ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup raisins (optional) ADVERTISEMENT",
            "3 egg yolks ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1 tablespoon butter, softened ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring the heavy cream, water, brown rice, and salt to a boil in a pot; reduce heat to low, cover, and simmer until the liquid is completely absorbed, about 80 minutes. Fold the raisins into the mixture and continue cooking until the raisins plump, about 10 minutes more.\nWhisk the egg yolks, sugar, and cinnamon together in a bowl; slowly pour into the pot with the rice while stirring. Cook and stir until the mixture thickens, about 6 minutes. Remove from heat and stir in the butter and vanilla extract.\n",
        "picture_link": "eGuwk5zuWphqkKoiAu06aACzNOtA5de"
    },
    {
        "title": "Cinnamon and Sugar French Waffle Toast",
        "ingredients": [
            "4 eggs, beaten ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon cinnamon ADVERTISEMENT",
            "9 slices white bread ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat a waffle iron according to the manufacturer's instructions, and spray with cooking spray.\nIn a shallow bowl, whisk together the eggs, milk, vanilla extract, sugar, and cinnamon. Dip each piece of white bread into the egg mixture. Cook in the preheated waffle iron until golden brown, 1 to 2 minutes.\n",
        "picture_link": "UNLDXDoRsni44Ar2jxICtXrLKJkEKCi"
    },
    {
        "title": "Crispy Baked Cereal Chicken",
        "ingredients": [
            "4 cups crispy rice cereal squares (such as Rice Chex®) ADVERTISEMENT",
            "1 1/2 teaspoons garlic salt ADVERTISEMENT",
            "1 1/2 teaspoons seasoned salt ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 375 degrees F (190 degrees C); grease a 9x12 inch baking dish.\nPlace the cereal in a large plastic zipper bag and crush the cereal into crumbs. Add the garlic salt and seasoned salt; shake the mixture together in the bag to combine. Pour the cereal crumb mixture out into a shallow bowl.\nIn another shallow bowl, beat the egg with the milk. Dip each chicken breast half into the milk mixture, then into the crumb mixture, coating the chicken well with crumbs. Place the coated chicken breasts into the prepared baking dish.\nBake in the preheated oven until the cereal coating is golden brown, the chicken is no longer pink in the center, and the juices run clear, about 40 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "TViJHS5rlclAsJB24isoe/w9vJm0sui"
    },
    {
        "title": "Kas' Chili",
        "ingredients": [
            "2 pounds ground beef ADVERTISEMENT",
            "2 green bell peppers, chopped ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "2 (15.25 ounce) cans kidney beans, rinsed and drained ADVERTISEMENT",
            "1 (15 ounce) can black beans ADVERTISEMENT",
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "2 (14.5 ounce) cans diced tomatoes ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "2 1/2 tablespoons chili powder ADVERTISEMENT",
            "1 1/2 teaspoons paprika ADVERTISEMENT",
            "1 tablespoon dried oregano ADVERTISEMENT",
            "1 teaspoon dried rosemary ADVERTISEMENT",
            "1 teaspoon ground coriander ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "2 tablespoons ground cumin ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place a large skillet over medium-high heat. Cook the ground beef in the hot skillet until completely browned, 7 to 10 minutes; drain.\nCombine the drained beef in a slow cooker with the bell peppers, onions, kidney beans, black beans, tomato sauce, and diced tomatoes. Cook on High for 30 minutes. Stir the garlic, chili powder, paprika, oregano, rosemary, coriander, garlic powder, salt, cumin, cilantro, and bay leaves into the beef mixture. Reduce heat to Low and cook another 6 1/2 hours.\n",
        "picture_link": "HNdn4TwILC7gmygVGfWjNLXEljc8m3y"
    },
    {
        "title": "Pomacello Martini",
        "ingredients": [
            "3 fluid ounces pomegranate juice ADVERTISEMENT",
            "1 fluid ounce limoncello liqueur ADVERTISEMENT",
            "1 1/2 fluid ounces vodka ADVERTISEMENT",
            "1 slice fresh lemon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the pomegranate juice, limoncello, and vodka into a cocktail shaker over ice. Cover and shake. Strain into a chilled martini glass, and garnish with a slice of lemon.\n",
        "picture_link": "z7sZWEcimF72zLtv4.7mmkfXVjVDW2i"
    },
    {
        "title": "Cajun Shrimp Soup",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1/2 bunch green onions, chopped ADVERTISEMENT",
            "3 stalks celery, chopped ADVERTISEMENT",
            "1 small orange bell pepper, chopped ADVERTISEMENT",
            "1 (10.75 ounce) can reduced sodium cream of mushroom soup ADVERTISEMENT",
            "1 (10.75 ounce) can reduced sodium cream of celery soup ADVERTISEMENT",
            "10 3/4 fluid ounces water ADVERTISEMENT",
            "1 (14.75 ounce) can creamed corn ADVERTISEMENT",
            "1 (10 ounce) package frozen corn ADVERTISEMENT",
            "2 pounds peeled and deveined medium shrimp ADVERTISEMENT",
            "1 pint half-and-half cream ADVERTISEMENT",
            "1/2 cup chopped fresh parsley ADVERTISEMENT",
            "1/2 teaspoon liquid shrimp and crab boil seasoning ADVERTISEMENT",
            "1/4 teaspoon Creole seasoning, or to taste ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a large pot over medium heat. Mix in onion, green onions, celery, and bell pepper. Cook and stir until tender.\nPour cream of mushroom soup, cream of celery soup, 1 soup can of water, creamed corn, and frozen corn into pot. Cook 20 minutes, stirring occasionally, until heated through.\nMix in shrimp, and cook until opaque. Stir in half and half and parsley. Reduce heat to low; continue to cook and stir 15 minutes. Mix in liquid shrimp and crab boil seasoning and Creole seasoning; season to taste with salt and pepper.\n",
        "picture_link": "T9EE.XrRiUGxNJRkdu6JPgz6txzHQrK"
    },
    {
        "title": "Peppered Pecans",
        "ingredients": [
            "1 teaspoon finely ground black pepper ADVERTISEMENT",
            "1 teaspoon ground white pepper ADVERTISEMENT",
            "1 teaspoon ground cayenne pepper ADVERTISEMENT",
            "1/2 teaspoon ground paprika ADVERTISEMENT",
            "1/2 teaspoon ground dried thyme ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon hot pepper sauce (such as Tabasco®) ADVERTISEMENT",
            "1/8 teaspoon liquid smoke flavoring (optional) ADVERTISEMENT",
            "1 pound pecan halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 375 degrees F (190 degrees C). Spray a large heavy roasting pan with cooking spray.\nMix black pepper, white pepper, cayenne pepper, paprika, and dried thyme in a small bowl. Set aside.\nWhisk egg whites in a large bowl until foamy. Add Worcestershire, hot sauce, and liquid smoke flavoring and whisk to mix. Drop in pecans and stir to coat well. Pour coated pecans into a colander to drain off extra egg white mixture; return to bowl and add the pepper mixture. Stir well to coat each pecan with spices.\nSpread pecans in prepared roasting pan. Roast in preheated oven for 5 minutes and stir pecans; roast an additional 5 minutes and stir again. Turn off heat and roast pecans an additional 5 to 10 minutes until pecans are lightly browned and fragrant. Let cool and serve at room temperature.\n",
        "picture_link": "KLICMPWM00Gd8blbDWhha6V6QppTCI."
    },
    {
        "title": "Port Huron-Style Coney Sauce",
        "ingredients": [
            "1 pound ground chuck ADVERTISEMENT",
            "1 1/2 teaspoons chili powder ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "2 teaspoons paprika ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon onion powder ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon ground cumin ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1/4 teaspoon ground allspice ADVERTISEMENT",
            "2 teaspoons prepared yellow mustard ADVERTISEMENT",
            "1 teaspoon beef base ADVERTISEMENT",
            "1 cup water, or more as needed ADVERTISEMENT",
            "3 teaspoons buttery crackers (such as Keebler Club® Crackers) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the ground chuck, chili powder, cinnamon, paprika, pepper, onion powder, garlic powder, cumin, cayenne pepper, allspice, mustard, beef base, and 1 cup water in a large saucepan over medium-high heat; use a potato masher to break up the beef and mix the rest of the ingredients through the beef; bring to a simmer; reduce heat to medium-low and continue to simmer 2 to 3 hours, adding water occasionally to keep the mixture moist. Once the mixture is softened, stir in the crushed crackers to thicken.\n",
        "picture_link": "7B..CGSMYLv9rxb81Y4hEJQaCQDw/lW"
    },
    {
        "title": "Chanukah Cookies",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 egg yolks ADVERTISEMENT",
            "1 teaspoon orange juice ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Lightly grease a baking sheet. Whisk together the flour, baking powder, and salt.\nBeat the butter and sugar with an electric mixer in a large bowl until smooth. Beat in one egg yolk until completely incorporated. Beat in the other egg yolk along with the orange juice and vanilla. Mix in the flour mixture until just incorporated. On a lightly floured surface, roll the dough out to 1/4-inch thickness. Cut into desired holiday shapes with cookie cutters. Place cookies on prepared baking sheet.\nBake in the preheated oven until the edges are golden, 10 to 12 minutes. Allow the cookies to cool on the baking sheet for 1 minute before removing to a wire rack to cool completely.\n",
        "picture_link": "O38bc3XAEFv5fbI63XIFOv0uTZUMjza"
    },
    {
        "title": "Mango Quesadillas",
        "ingredients": [
            "1 (15 ounce) can black beans, drained ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "1 pinch dried oregano ADVERTISEMENT",
            "1 pinch dried basil ADVERTISEMENT",
            "1 mango - peeled, seeded and diced ADVERTISEMENT",
            "1 (6 ounce) package seasoned chicken-style vegetarian strips (such as Lightlife Smart Strips®) ADVERTISEMENT",
            "6 (10 inch) flour tortillas ADVERTISEMENT",
            "1 (8 ounce) package shredded Cheddar cheese ADVERTISEMENT",
            "1 cup arugula leaves ADVERTISEMENT",
            "1 (4 ounce) jar jalapeno pepper rings (optional) ADVERTISEMENT",
            "1 (8 ounce) jar salsa ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the beans in a saucepan over medium heat, and cook 5 minutes. Partially mash with a potato masher or large spoon. Reduce heat to low, and keep warm until ready to serve.\nHeat the oil in a skillet over medium heat. Stir in the onion and red bell pepper. Season with chili powder, cayenne pepper, oregano, and basil. Cook and stir until vegetables are tender. Mix in mango and vegetarian chicken strips, and continue cooking about 2 minutes, until vegetarian chicken is heated through.\nIn a separate skillet over medium heat, place the tortillas one at a time until soft and warm, about 2 minutes per side. Spread warm tortillas with equal amounts of the the black beans, mango mixture, Cheddar cheese, arugula, and jalapenos. Fold tortillas over the filling and top with salsa to serve.\n",
        "picture_link": "J21O.XxJ3od5GCtOjPl8oEJH2QL1aU."
    },
    {
        "title": "Sex-In-A-Pan",
        "ingredients": [
            "1/2 cup margarine ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese, at room temperature ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "2 cups frozen whipped topping (such as Cool Whip®), thawed ADVERTISEMENT",
            "3 cups milk ADVERTISEMENT",
            "1 (5.9 ounce) package instant chocolate pudding mix ADVERTISEMENT",
            "1 (5 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "1 cup cold heavy whipping cream ADVERTISEMENT",
            "12 chocolate wafer cookies, crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nPlace margarine, flour, and white sugar into a bowl, and cut with a pastry cutter until the mixture resembles fine crumbs. Press the mixture into a 10x10-inch square baking dish, and bake in the preheated oven until the crust is lightly browned, about 25 minutes. Let the crust cool.\nPlace the cream cheese and confectioners' sugar into a mixing bowl, and beat with an electric mixer until smooth and creamy. Gently stir in the whipped topping until well combined, and spread the mixture over the crust in an even layer.\nPlace milk in a mixing bowl, and beat the chocolate and vanilla pudding mixes into the milk with an electric mixer until the mixture is smooth and thickened, about 2 minutes. Spread the pudding layer over the cream cheese layer.\nPour the cream into a mixing bowl, and whip to soft peaks with an electric mixer. Lightly spread the whipped cream over the pudding layer, and sprinkle top with chocolate wafer crumbs. Refrigerate the dessert for at least 1 hour before serving.\n",
        "picture_link": "F/Ra64m6030co.aFTpKLM5jjSGUum4m"
    },
    {
        "title": "Dad's Escarole and Bean Soup",
        "ingredients": [
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "6 cups water ADVERTISEMENT",
            "6 cubes chicken bouillon ADVERTISEMENT",
            "3 (15 ounce) cans cannellini beans, drained and rinsed ADVERTISEMENT",
            "1 (16 ounce) can diced tomatoes ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 pound torn escarole ADVERTISEMENT",
            "6 cloves garlic, minced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large pot over medium heat. Stir in the onion and cook until the onion has softened and turned translucent, about 5 minutes. Add the water, chicken bouillon, cannellini beans, and diced tomatoes. Season to taste with salt and pepper. Bring to a boil over high heat; reduce heat to medium-low and simmer 30 minutes.\nStir in the torn escarole, and continue simmering until the escarole is tender, about 30 minutes. Add the garlic and cook 5 to 10 minutes more before serving.\n",
        "picture_link": "b265GW4nclPwzpBhjWbtlgBgb82xmRW"
    },
    {
        "title": "Easy Money Breakfast Burritos",
        "ingredients": [
            "1 pound bulk pork sausage ADVERTISEMENT",
            "1/2 small onion, chopped ADVERTISEMENT",
            "2 teaspoons butter ADVERTISEMENT",
            "12 eggs, beaten ADVERTISEMENT",
            "1 (4 ounce) can diced green chilies, drained ADVERTISEMENT",
            "3/4 cup process cheese food (such as Velveeta®), divided ADVERTISEMENT",
            "3/4 cup salsa ADVERTISEMENT",
            "1 (10 ounce) package burrito-size flour tortillas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the pork sausage and onion into a skillet over medium heat, and cook until the sausage is browned, about 10 minutes. Break the meat apart into crumbles as it cooks. Drain the excess grease.\nIn a separate skillet over medium heat, melt the butter until the foam subsides, and cook and stir the beaten eggs with the chilies until softly scrambled but not wet, about 3 minutes. Transfer the scrambled eggs into a large bowl, and stir in the cooked sausage mixture.\nPlace a tortilla onto a microwave-safe plate, and cook in the microwave on High setting for 10 to 20 seconds. The tortilla should be warm and pliable. Spoon about 1/2 cup of the sausage and egg mixture in a line down the the tortilla, slightly off center. Top with about 1 tablespoon of shredded cheese, and 1 tablespoon of salsa. Fold 2 opposite ends of the tortilla over the filling. Press the 2 ends down so they stay folded. Carefully roll the shorter unfolded edge over the burrito, pushing the filling to the back of the roll as you go, to snugly enclose the filling. Keep the 2 ends folded as you roll. Wrap in foil if desired. Repeat with the rest of the tortillas.\n",
        "picture_link": "9PzLxlZoWNUhfd5xaKSBJqDI7aNY35i"
    },
    {
        "title": "Split Pea Smoked Turkey Soup",
        "ingredients": [
            "1 pound dried split peas ADVERTISEMENT",
            "5 cups water, or more if needed ADVERTISEMENT",
            "3 pounds smoked turkey legs ADVERTISEMENT",
            "3 cups chicken broth ADVERTISEMENT",
            "1 1/2 cups chopped carrot ADVERTISEMENT",
            "1 cup chopped celery ADVERTISEMENT",
            "2 potatoes, peeled and chopped ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the split peas, water, smoked turkey legs, chicken broth, carrot, celery, potatoes, onion, garlic powder, oregano, and bay leaves in a slow cooker. Cover, set the cooker to High, and cook until the peas are tender and the soup is thickened, 4 to 5 hours. Discard bay leaves to serve.\n",
        "picture_link": "3TYKLeyQS1MLoURTtW4Ej7ZDtwK9KQq"
    },
    {
        "title": "The Perfect Sunday Brunch Spinach Salad",
        "ingredients": [
            "2 (10 ounce) bags baby spinach ADVERTISEMENT",
            "2 bananas, sliced ADVERTISEMENT",
            "12 fresh strawberries, sliced ADVERTISEMENT",
            "1 (10 ounce) can mandarin oranges, drained ADVERTISEMENT",
            "1/2 cup dried cranberries ADVERTISEMENT",
            "1/2 cup pine nuts ADVERTISEMENT",
            "1 cup poppy seed salad dressing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place spinach in a large bowl. Arrange bananas, strawberries, mandarin oranges, cranberries, and pine nuts on top. Toss with poppy seed dressing before serving.\n",
        "picture_link": "jCVohx//OeMwKZmpVB7JN/qF9bAHAAe"
    },
    {
        "title": "Cocojito (Frozen Mojito)",
        "ingredients": [
            "4 cups ice cubes ADVERTISEMENT",
            "2 1/2 limes, rind removed ADVERTISEMENT",
            "7 fluid ounces sweetened cream of coconut (such as Coco Lopez®) ADVERTISEMENT",
            "2 1/2 (1.5 fluid ounce) jiggers white rum (such as Bacardi®) ADVERTISEMENT",
            "5 sprigs fresh mint leaves ADVERTISEMENT",
            "2 mint sprigs, for garnish (optional) ADVERTISEMENT",
            "2 lime wedges, for garnish (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend the ice, limes, cream of coconut, rum, and mint leaves together in a blender until smooth. Pour into two glasses and garnish each with a mint sprig and lime wedge as desired.\n",
        "picture_link": "7HLKATlo5y0n1.JDs5bXj/CaabjqoYu"
    },
    {
        "title": "Pork Chop Grill",
        "ingredients": [
            "3 cups water ADVERTISEMENT",
            "2 1/2 tablespoons white sugar ADVERTISEMENT",
            "1 1/2 tablespoons kosher salt ADVERTISEMENT",
            "1 sprig fresh rosemary ADVERTISEMENT",
            "2 sprigs fresh thyme ADVERTISEMENT",
            "4 (1-inch thick) pork chops ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk the water, sugar, and salt together in a bowl; pour into a gallon-sized resealable plastic bag. Add the rosemary, thyme, and pork chops to the bag. Coat the pork with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator at least 4 hours.\nPreheat an outdoor grill for medium-high heat, and lightly oil the grate.\nRemove the pork chops from the bag, and discard the marinade.\nCook on the preheated grill until no longer pink in the center, about 10 minutes per side. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C).\n",
        "picture_link": "/A9D0UHnHIubUQLIbjt7W5d9cAB3kye"
    },
    {
        "title": "Slow Cooker Turkey and White Bean Chili",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "2 pounds boneless turkey breast ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 (15 ounce) can cannellini (white) beans, drained ADVERTISEMENT",
            "1 (29 ounce) can white hominy, drained ADVERTISEMENT",
            "3 (14 ounce) cans low-sodium chicken broth ADVERTISEMENT",
            "3 (15 ounce) cans cannellini (white) beans, drained ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "1 1/2 tablespoons ground cumin ADVERTISEMENT",
            "1 teaspoon Cajun seasoning ADVERTISEMENT",
            "3 serrano chile peppers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the vegetable oil in a large skillet over medium heat, and pan-fry the turkey breast until the meat is no longer pink, about 10 minutes per side. Transfer the turkey breast into a bowl to cool; shred it with 2 forks. Set the turkey meat aside. In the same skillet, cook the onions and garlic over medium heat until the onion is translucent, about 5 minutes; scrape the onions and garlic, along with any drippings, into the bowl with the turkey.\nPlace 1 can of cannellini beans, the hominy, and the chicken broth into a slow cooker. With an immersion blender, blend the mixture until smooth. Transfer the shredded turkey, onions, garlic, 3 more cans of cannellini beans, the cilantro, cumin, and Cajun seasoning into the slow cooker, and stir to combine. Wearing gloves, cut off the serrano chile stems, split the chiles, and scrape the seeds and membranes from 2 of the chiles with a spoon. Mince all 3 chiles. For milder flavor, seed and remove membranes from all the chiles. Mix the serrano chiles into the soup.\nCover the cooker, and cook on Low setting for 4 to 6 hours or High setting for 2 to 3 hours.\n",
        "picture_link": "H3iyMyeDtvcrDi/2YMctDXMJUIPQLAG"
    },
    {
        "title": "Sister Schubert's® Chicken Pot Pie with Bread Topping",
        "ingredients": [
            "For the filling: ADVERTISEMENT",
            "5 tablespoons butter, divided ADVERTISEMENT",
            "8 ounces sliced mushrooms ADVERTISEMENT",
            "1 cup chopped onions ADVERTISEMENT",
            "1/2 cup flour ADVERTISEMENT",
            "2 cups chicken broth ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "2 tablespoons chopped parsley ADVERTISEMENT",
            "4 cups chopped roasted chicken ADVERTISEMENT",
            "2 cups carrots, cut on an angle, blanched ADVERTISEMENT",
            "1 (10 ounce) package frozen peas, defrosted ADVERTISEMENT",
            "1 cup green beans, cut into 1-inch pieces and blanched (optional) ADVERTISEMENT",
            "For the topping: ADVERTISEMENT",
            "12 Sister Schubert's Parker House Style Rolls, sliced into 3 sections ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F. Lightly mist a baking dish with non-stick vegetable oil spray.\nMelt 1 tablespoon butter in a large skillet over medium high heat; add mushrooms and saute until they are golden brown. Transfer to a plate.\nIn same skillet, melt remaining 4 tablespoons butter; add onions and cook until they are soft and golden brown. Add flour and stir for 1 minute; pour in chicken broth and heavy cream and whisk until sauce is smooth. Mix in mustard, salt, pepper, thyme and parsley. Pour sauce into large mixing bowl.\nFold in chicken, carrots, peas, beans and mushrooms into sauce. Pour all into prepared baking dish.\nArrange sliced rolls on top of filling and brush with melted butter.\nBake 20 to 25 minutes or until filling is bubbling. If topping starts to brown too much, cover loosely with aluminum foil.\n",
        "picture_link": "AnkcfznPfmRtBVi6aR3kj6cNkPkUuP."
    },
    {
        "title": "Kanafa",
        "ingredients": [
            "1 (16 ounce) box shredded phyllo dough (kataifi) ADVERTISEMENT",
            "1 (15 ounce) container ricotta cheese ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "12 ounces unsalted butter ADVERTISEMENT",
            "For the syrup: ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1/8 teaspoon rose water (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 400 degrees F (200 degrees C).\nUse a food processor to finely chop the frozen, shredded phyllo dough. The strands should be about the size of a grain of rice. Pour the dough into a large mixing bowl. In a separate bowl, mix together the ricotta, mozzarella, and 1/3 cup sugar.\nPlace the butter in a large liquid measuring cup or bowl with a spout. Heat the butter in a microwave until completely melted, and let it sit for several minutes until a thick white foam has formed on top. Clarify the butter by using a spoon to skim off the foam.\nCarefully pour the butter into the bowl of phyllo dough. Avoid pouring in the white milk solids at the bottom of the clarified butter. Use your hands to mix the butter and dough together. Make sure that the butter is absorbed by taking handfuls of the dough and rubbing it between your palms.\nEvenly spread the buttered phyllo dough into a 9x13-inch pan and firmly press it into the bottom and edges. Spread the cheese mixture onto the dough, avoiding the edges of the pan.\nBake in the preheated oven until the cheese is slightly golden and the edges of dough are brown and bubbly, 30 to 35 minutes.\nWhile the kanafa is baking, prepare the syrup. Combine the water and 1/2 cup sugar in a small saucepan. Bring the mixture to a boil over medium-high heat. Reduce the heat to medium and stir in the lemon juice. Simmer, stirring constantly, until the sugar is dissolved and the mixture is thickened, 5 to 7 minutes. (Do not let the mixture turn golden and caramelize.) Remove from heat and add the rose water; set aside.\nRemove the kanafa from the oven. Place a large platter or baking sheet over the baking dish. Using oven mitts, carefully invert the baking dish onto the platter so the phyllo is on top. Pour the syrup over the kanafa. Cut into pieces and serve while hot.\n",
        "picture_link": "7hqkH/DFA1eH/WQrCkpAxdIOj5IgewS"
    },
    {
        "title": "Grilled Peaches with Gingersnaps",
        "ingredients": [
            "1 firm peach, halved and pitted ADVERTISEMENT",
            "1 teaspoon canola oil ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "4 scoops vanilla fat-free frozen yogurt ADVERTISEMENT",
            "2 gingersnap cookies, crumbled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for high heat, and lightly oil the grate. Brush peach halves with canola oil.\nPlace peach halves on the preheated grill. Grill until tender and peach is warmed through, about 10 minutes. Place the hot peach on a plate skin-side down. Sprinkle with brown sugar, allowing the sugar to melt. Alternatively, use a small torch to caramelize the sugar. Serve each peach half with 2 scoops of vanilla frozen yogurt and gingersnap cookie crumbles sprinkled on top.\n",
        "picture_link": "JZnrygpsJSUq4AdOCgGx0feVxc71jWa"
    },
    {
        "title": "Chiarello's Chicken and Pastina Soup",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 cup Muir Glen® organic crushed tomatoes with basil ADVERTISEMENT",
            "2 pounds boneless skinless chicken breasts ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1/2 cup diced carrot ADVERTISEMENT",
            "1/2 cup diced celery ADVERTISEMENT",
            "2 (32 ounce) cartons Progresso® chicken broth ADVERTISEMENT",
            "1/2 teaspoon gray salt or sea salt ADVERTISEMENT",
            "1/4 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1 dried bay leaf ADVERTISEMENT",
            "1 cup uncooked acini de pepe or small round pasta ADVERTISEMENT",
            "2 cups chopped, lightly packed mustard greens, spinach, Swiss chard or other greens ADVERTISEMENT",
            "1/3 cup shredded Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken in 12-inch skillet. Add 1 carton of the broth. Heat to boiling. Reduce heat; cover and simmer 20 minutes or until juice of chicken is clear when center of thickest part is cut (170 degrees F).\nMeanwhile, in 5-quart stockpot, heat oil over medium heat. Add onion, carrot and celery; cook 8 to 10 minutes, stirring occasionally, until vegetables are tender.\nDrain chicken, reserving broth; set chicken aside. Strain broth; add to vegetables. Stir remaining carton of broth, the tomatoes, salt, pepper and bay leaf into stockpot. Heat to boiling. Stir in pasta. Reduce heat; cover and simmer 15 minutes.\nShred or cut chicken into bite-size pieces; add to soup. Stir in greens just until wilted. Remove bay leaf. Serve with a sprinkle of additional freshly ground pepper and the cheese.\n",
        "picture_link": "ZL3UWHEySpGEKDGYgAQ28PUdOVxW346"
    },
    {
        "title": "Rum Glazed Grilled Shrimp",
        "ingredients": [
            "1/4 cup honey ADVERTISEMENT",
            "1/2 teaspoon lime juice ADVERTISEMENT",
            "3 tablespoons spiced rum ADVERTISEMENT",
            "1/2 teaspoon grated orange zest ADVERTISEMENT",
            "1 tablespoon orange juice ADVERTISEMENT",
            "1 teaspoon grated fresh ginger ADVERTISEMENT",
            "1 tablespoon chopped fresh cilantro leaves ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 1/2 teaspoons cornstarch ADVERTISEMENT",
            "20 jumbo shrimp, peeled and deveined ADVERTISEMENT",
            "4 (10 inch) skewers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium heat, and lightly oil the grate.\nMix together the honey, lime juice, spiced rum, orange zest, orange juice, ginger, cilantro, salt, black pepper, and cornstarch in a large bowl until the glaze is smooth and the cornstarch is thoroughly blended with the rest of the ingredients. Pour half the glaze into a smaller bowl for basting. Rinse and pat the shrimp dry, and gently stir into the large bowl to thoroughly coat the shrimp with the glaze.\nRemove from the glaze, and discard the used glaze. Thread 5 shrimp onto each skewer, and sprinkle with salt and black pepper.\nGrill the shrimp until bright pink and opaque and the glaze has cooked onto the shrimp, about 4 minutes per side. Baste with additional unused glaze before turning the shrimp over.\n",
        "picture_link": "s7v44VK.EIXNFzdwxBUjn34uwto2sG6"
    },
    {
        "title": "Pomodoro Pasta Sauce",
        "ingredients": [
            "1 (28 ounce) can diced tomatoes ADVERTISEMENT",
            "2 stalks celery, with leaves, chopped ADVERTISEMENT",
            "2 carrots, peeled and chopped ADVERTISEMENT",
            "1 small sweet onion, chopped ADVERTISEMENT",
            "3 cloves garlic ADVERTISEMENT",
            "1/2 (6 ounce) can tomato paste ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "2 cups red wine ADVERTISEMENT",
            "1 teaspoon dried sage ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1 teaspoon dried parsley ADVERTISEMENT",
            "1 tablespoon dried oregano ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir the diced tomatoes, celery, carrots, sweet onion, garlic, tomato paste, water, red wine, sage, basil, parsley, oregano, salt, and pepper together in a large pot and bring to a boil. Reduce heat to low and cook the sauce at a simmer until the carrots are tender, about 1 hour.\nPour the sauce into a blender, filling the pitcher no more than halfway. Hold the lid of the blender in place with a towel and carefully start the blender using a few quick pulses to get the sauce moving before leaving it on to puree. Puree in batches until smooth and pour into a clean container. Alternately, you can use a stick blender and puree the sauce in the pot.\n",
        "picture_link": "5LzYNqT5Djd3X2/7paWaeNtiEpiCBQ6"
    },
    {
        "title": "Blueberry Lemon Walnut Bread",
        "ingredients": [
            "1 cup walnuts, chopped ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 cup granulated sugar ADVERTISEMENT",
            "2 tablespoons lemon zest ADVERTISEMENT",
            "3/4 cup buttermilk ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon pure vanilla extract ADVERTISEMENT",
            "2 tablespoons unsalted butter, melted ADVERTISEMENT",
            "2 tablespoons canola oil ADVERTISEMENT",
            "1 cup fresh or frozen blueberries ADVERTISEMENT",
            "Glaze: ADVERTISEMENT",
            "3 tablespoons granulated sugar ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F.\nIn a dry skillet, toast walnuts over medium-high heat for 1 to 2 minutes.\nIn a large bowl, combine all-purpose flour, baking powder, baking soda and salt. Whisk to combine.\nIn a medium bowl, combine sugar, lemon zest, buttermilk, eggs, vanilla, melted butter and oil. Whisk just to combine.\nMake a well in center of dry ingredients. Add liquid ingredients and mix gently just to combine; do not over-mix. Gently fold in walnuts and blueberries.\nPour batter into a greased and floured 8 x 4-inch loaf pan. Bake in preheated oven for 55 to 60 minutes or until tester inserted in center comes out clean. Cool on rack for 20 minutes; remove from pan, cool to room temperature.\nTo make the glaze, combine sugar and lemon juice in a small saucepan. Bring to boil over high heat, then reduce heat and continue stirring until sugar dissolves.\nBrush glaze over bread while still warm.\n",
        "picture_link": "ZgvFRzlBZpFL0hgTzhER/smDX8HCC8u"
    },
    {
        "title": "Gluten-Free Strawberry Shortcake",
        "ingredients": [
            "2/3 cup brown rice flour ADVERTISEMENT",
            "2/3 cup cornstarch ADVERTISEMENT",
            "2/3 cup tapioca flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon xanthan gum ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "6 tablespoons vegetable shortening ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "3/4 cup skim milk ADVERTISEMENT",
            "4 cups sliced fresh strawberries ADVERTISEMENT",
            "2 cups reduced-fat whipped topping ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 425 degrees F (220 degrees C). Whisk the rice flour, cornstarch, tapioca flour, baking powder, baking soda, xanthan gum, and salt together in a bowl; set aside. Grease a baking sheet, or cover with a sheet of parchment paper.\nBeat the shortening and sugar with an electric mixer in a large bowl until light and fluffy. Pour in the flour mixture alternately with the milk, mixing until just incorporated. Drop onto the prepared baking sheet into 8 equal portions.\nBake in the preheated oven until golden brown on the bottoms, 10 to 12 minutes. Remove, and cool on a wire rack to room temperature.\nOnce cool, slice each shortcake in half, and place each bottom half onto a dessert plate. Evenly divide the sliced strawberries onto each shortcake, and dollop with the whipped topping. Place the shortcake tops on to serve.\n",
        "picture_link": "LMKHKdn4UAUDfr3ICHTj1pIreDAY7iy"
    },
    {
        "title": "Karen's First Place Chili",
        "ingredients": [
            "1 pound pork sausage ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 (10 ounce) can diced tomatoes with green chile peppers (such as RO*TEL®) ADVERTISEMENT",
            "1 (16 ounce) can chili beans ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "9 tablespoons chili powder ADVERTISEMENT",
            "3 tablespoons masa harina (instant corn masa mix) ADVERTISEMENT",
            "2 tablespoons ground cumin ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 teaspoon ground paprika ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the pork sausage, beef, and onion into a large skillet over medium heat, and cook, stirring frequently, until the meat is browned, about 15 minutes. Break the meat up into crumbles as it cooks. Drain off excess fat, then place the meat into a soup pot. Mix in the diced tomatoes with green peppers, chili beans, tomato sauce, chili powder, masa harina, cumin, salt, paprika, oregano, garlic powder, and cayenne pepper. Bring the chili to a simmer, reduce heat, and simmer for 1 hour.\n",
        "picture_link": "mrEe/H2PFqheTr44YyV9Yfs1CruaSU."
    },
    {
        "title": "Gisela's Butternut Squash Soup",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1 onion, finely chopped ADVERTISEMENT",
            "1 (14.5 ounce) can chicken broth ADVERTISEMENT",
            "1 (2 pound) butternut squash - peeled, seeded, and cut into 1-inch cubes ADVERTISEMENT",
            "1 orange, juiced ADVERTISEMENT",
            "1 orange, juiced and zested ADVERTISEMENT",
            "3 tablespoons sour cream ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large saucepan or soup pot over medium heat, and cook and stir the onion until translucent, about 5 minutes. Pour in the chicken broth, and stir in the butternut squash cubes, orange juice, and orange zest. Bring to a boil, reduce heat, and simmer until the squash cubes are tender, 15 to 20 minutes.\nPour the soup into a blender, filling the pitcher no more than halfway full. Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender, using a few quick pulses to get the soup moving before leaving it on to puree. Puree in batches until smooth and pour back into the pot. Alternately, you can use a stick blender and puree the soup right in the cooking pot. Whisk in sour cream until smooth, and season to taste with salt and pepper. Heat over medium-low heat until almost simmering, and serve hot.\n",
        "picture_link": "rzAA8LG2o1jc8HIY920PGyGc.kuSiSC"
    },
    {
        "title": "Orzo Pasta Salad",
        "ingredients": [
            "1 cup uncooked orzo pasta ADVERTISEMENT",
            "1/4 cup chopped sun-dried tomatoes ADVERTISEMENT",
            "1/2 cup boiling water ADVERTISEMENT",
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "1 lemon, juiced and zested ADVERTISEMENT",
            "1/2 cup kalamata olives ADVERTISEMENT",
            "1/4 cup finely chopped fresh parsley ADVERTISEMENT",
            "1/4 cup crumbled feta cheese ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the orzo, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 11 minutes. Drain well in a colander set in the sink.\nPlace the sun-dried tomatoes into the boiling water in a bowl, and let stand for 10 minutes to plump up. Drain off excess water.\nToss the cooked orzo, sun-dried tomatoes, olive oil, lemon juice, lemon zest, olives, parsley, and feta cheese together in a bowl. Season to taste with salt and pepper.\n",
        "picture_link": "jr3FQ3B9JyXJc/fPXhVoXt55RHfqEeK"
    },
    {
        "title": "Summer Grilled Pork Chops",
        "ingredients": [
            "1 1/2 cups lemon juice ADVERTISEMENT",
            "1 1/2 cups honey ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/4 teaspoon dried basil ADVERTISEMENT",
            "4 center-cut pork chops, 1/2-inch thick ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the lemon juice, honey, Worcestershire sauce, garlic, and basil together in a bowl. Pour about half the marinade into a resealable plastic zipper bag, and place the pork chops in the bag. Squeeze out the air, seal the bag, and refrigerate for at least 2 hours (overnight is best). Refrigerate remaining marinade for basting.\nPreheat an outdoor grill for medium-high heat, and lightly oil the grate.\nRemove the chops from the bag, and discard the used marinade. Sprinkle chops with salt and black pepper. Grill the chops until browned and the meat is no longer pink inside, 20 to 25 minutes. Baste frequently with the reserved marinade, being sure to let the mixture cook onto the chops. An instant-read meat thermometer inserted into the center of a chop should read at least 145 degrees F (63 degrees C).\n",
        "picture_link": "h.eUP4LVp8l8dHgGH7Z/xSI6qWer78m"
    },
    {
        "title": "Shredded Turkey Barbecue",
        "ingredients": [
            "2 bone-in turkey thighs without skin ADVERTISEMENT",
            "2 (16 ounce) cans baked beans ADVERTISEMENT",
            "1 1/2 cups finely chopped onion ADVERTISEMENT",
            "1 cup barbecue sauce ADVERTISEMENT",
            "1 tablespoon prepared yellow mustard ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "8 potato rolls ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the turkey thighs, baked beans, onion, barbecue sauce, yellow mustard, cumin, and salt into a slow cooker. Set the cooker to Low, and cook 10 to 12 hours. Remove the turkey thighs, and shred meat using 2 forks. Discard bones. Return the shredded turkey meat to the slow cooker. To serve, place about 1/2 cup of shredded turkey and sauce onto each potato roll.\n",
        "picture_link": "Q9H.0Yk9IuSZx7YfK9MintRteiIdEFu"
    },
    {
        "title": "Squash Relish ",
        "ingredients": [
            "8 cups diced yellow squash ADVERTISEMENT",
            "2 cups diced onion (optional) ADVERTISEMENT",
            "2 red bell peppers, diced ADVERTISEMENT",
            "2 green bell peppers, diced ADVERTISEMENT",
            "3 tablespoons salt ADVERTISEMENT",
            "3 cups white sugar ADVERTISEMENT",
            "2 cups vinegar ADVERTISEMENT",
            "2 teaspoons celery seeds ADVERTISEMENT",
            "2 teaspoons whole mustard seeds ADVERTISEMENT",
            "6 (1 pint) canning jars with lids and rings ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the squash, onion, and red and green bell peppers into a large bowl, and sprinkle with salt. Toss to combine, and allow the vegetables to drain for 1 hour. Discard juice.\nPlace the sugar, vinegar, celery seeds, and mustard seeds into a large pot, and bring to a boil over medium heat, stirring to dissolve sugar. Stir in the squash mixture, and return to a boil. Cook the mixture until the vegetables are tender, about 15 minutes.\nSterilize the jars and lids in boiling water for at least 5 minutes. Pack the squash relish into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings.\nPlace a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil over high heat, then carefully lower the jars into the pot using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for 10 minutes, or the time recommended for your area.\nRemove the jars from the pot, and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in the refrigerator.\n",
        "picture_link": "gASzf2FjcWpLOTygOTZ0NJ9hcjuFpXG"
    },
    {
        "title": "BBQ Pulled Pork Pizza",
        "ingredients": [
            "1 (14 ounce) package pre-baked pizza crust ADVERTISEMENT",
            "2 tablespoons barbeque sauce, or more as desired ADVERTISEMENT",
            "1 teaspoon chipotle chili powder ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 cup prepared pulled pork ADVERTISEMENT",
            "1/8 cup sliced onion ADVERTISEMENT",
            "1/8 cup sliced red bell pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nPlace the pizza crust onto a baking sheet.\nIn a bowl, mix the barbeque sauce with chipotle chili powder; season with salt and black pepper.\nSpread the sauce over the pizza crust.\nArrange pulled pork, sliced onion, and red bell pepper slices evenly over the pizza.\nBake in the preheated oven until the toppings are hot and the pizza crust is crisp on the bottom, 12 to 15 minutes.\n",
        "picture_link": "60V1Bovv6a1HPDtwGoAoKsOmfy8kjbm"
    },
    {
        "title": "Slow Cooker Cream of Broccoli Soup",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "2 (10 ounce) packages frozen chopped broccoli, thawed ADVERTISEMENT",
            "2 (10.75 ounce) cans cream of celery soup ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 cup shredded American cheese ADVERTISEMENT",
            "2 (10.75 ounce) cans milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat vegetable oil in a large pot over medium heat; cook the onion in the hot oil until soft, 5 to 7 minutes.\nDrain as much liquid from the onion as possible. Transfer the drained onion to a slow cooker.\nPlace the broccoli, cream of celery soup, cream of mushroom soup, American cheese, and milk into the slow cooker.\nCook on Low until the broccoli is tender and the flavors meld, 3 to 4 hours.\n",
        "picture_link": "RZLi9yUK0H4o5txZddUOZ4NTNYC8PdO"
    },
    {
        "title": "Old Fashioned Vanilla Ice Pops (a.k.a. Pop Pops)",
        "ingredients": [
            "1 (20 ounce) bottle vanilla cream soda ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour cream soda into a bowl and whisk until no longer bubbly; set aside.\nHeat water and sugar in a saucepan over medium high heat, stirring until the sugar is dissolved, about 5 minutes.\nStir sugar mixture and vanilla extract into the cream soda.\nPour mixture into small plastic cups or ice pop molds, then insert wooden ice pop sticks. Freeze until firm.\n",
        "picture_link": "Bfha.fkw4kfRni1mS3aMH4Gy9ZlhaKy"
    },
    {
        "title": "Maui Girl's Mango Pie",
        "ingredients": [
            "pastry for a double-crust 9-inch pie ADVERTISEMENT",
            "4 cups peeled and sliced mango ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "3 tablespoons cornstarch ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 tablespoon butter, cut into small chunks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line a 9-inch pie pan with half of the pie pastry. Set aside.\nCombine mango, sugar, cornstarch, lemon juice, and cinnamon in a bowl; stir until the sugar has dissolved. Transfer mango mixture into the prepared pie pan. Dot the mixture with the butter, then cover with the top crust. Pinch the edges of the top and bottom crusts together to seal. Cut several vents on the top crust.\nBake in the preheated oven until the crust is golden brown and the juices are bubbling, about 45 minutes.\n",
        "picture_link": "mEPv0mcQIrhR4aJQMuEYy5ua61lwm0G"
    },
    {
        "title": "Cuban-Style Picadillo",
        "ingredients": [
            "2 potatoes ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 onion, minced ADVERTISEMENT",
            "1 green bell pepper, minced ADVERTISEMENT",
            "2 teaspoons crushed garlic ADVERTISEMENT",
            "1 1/2 pounds lean ground beef ADVERTISEMENT",
            "2 cups dry red wine ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "2/3 cup pimiento-stuffed green olives, drained and chopped ADVERTISEMENT",
            "1/2 cup capers, drained ADVERTISEMENT",
            "1/4 cup golden raisins ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 pinch dried oregano ADVERTISEMENT",
            "1/4 teaspoon black pepper ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 teaspoon olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the potatoes into a large pot with enough water to cover; season with salt. Bring the water to a boil; reduce heat to medium-low, place a cover on the pot, and cook the potatoes at a simmer until tender, about 20 minutes. Drain and set aside to cool.\nHeat 2 tablespoons olive oil in a large Dutch oven over medium heat; cook and stir the onion, green bell pepper, and garlic in the hot oil until the vegetables soften, about 5 minutes.\nCrumble the ground beef into the onion mixture, breaking the meat into smaller pieces as you mix; cook and stir until the beef is completely browned, 7 to 10 minutes. Drain as much fat from the mixture as possible.\nStir the red wine, tomato sauce, olives, capers, golden raisins, cumin, oregano, black pepper, and 1/4 teaspoon salt into the ground beef mixture. Bring to a boil, reduce heat to medium-low, and cook at a simmer until the wine had reduced significantly, 25 to 30 minutes.\nPeel the cooled potatoes and cut into chunks.\nHeat 1 teaspoon olive oil in a skillet over medium heat. Cook the potatoes in the hot oil until browned, about 5 minutes.\nGently fold the cooked potatoes into the simmering ground beef mixture; cook together 5 minutes.\n",
        "picture_link": "Jiro4HZhs/ixPCYVKlbqbboYuTE2OaK"
    },
    {
        "title": "Garlic Chicken, Vegetable and Rice Skillet",
        "ingredients": [
            "Vegetable cooking spray ADVERTISEMENT",
            "1 1/4 pounds skinless, boneless chicken breast halves ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 3/4 cups Swanson® Chicken Broth or Swanson® Chicken Stock ADVERTISEMENT",
            "3/4 cup uncooked white rice ADVERTISEMENT",
            "1 (16 ounce) package frozen vegetable combination (broccoli, cauliflower, carrots) ADVERTISEMENT",
            "1/3 cup grated Parmesan cheese ADVERTISEMENT",
            "Paprika ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spray a 12-inch skillet with the cooking spray and heat over medium-high heat for 1 minute. Add the chicken and garlic and cook for 10 minutes or until the chicken is well browned on both sides. Remove the chicken from the skillet.\nStir the broth, rice and vegetables in the skillet and heat to a boil. Reduce the heat to low. Cover and cook for 15 minutes. Stir in the cheese.\nReturn the chicken to the skillet. Sprinkle the chicken with the paprika. Cover and cook for 10 minutes or until the chicken is cooked through and the rice is tender.\n",
        "picture_link": "3m52bV.PuL4tcqO9gQCoBQZMf/huh0S"
    },
    {
        "title": "Healthier Homemade Mac and Cheese",
        "ingredients": [
            "1 (16 ounce) package whole wheat macaroni (such as Smart Taste®) ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 1/2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 cups shredded low-fat Cheddar cheese ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "3 cups low-fat (1%) milk ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 cup whole wheat bread crumbs ADVERTISEMENT",
            "1 pinch paprika ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Bring a large pot of lightly salted water to a boil. Cook elbow macaroni in boiling water, stirring occasionally until cooked through but firm to the bite, 8 minutes. Drain.\nMelt 2 tablespoons butter in a saucepan over medium heat. Stir in flour to make a roux. Slowly add milk to roux, stirring constantly. Stir in Cheddar and Parmesan cheeses and cook over low heat until cheese is melted and sauce is thick, about 3 minutes. Place macaroni in large baking dish and pour sauce over macaroni. Stir well.\nMelt 2 tablespoons butter in a skillet over medium heat. Add breadcrumbs and stir until butter is absorbed, 2 to 3 minutes. Spread over macaroni to cover. Sprinkle with paprika.\nBake in preheated oven until cheese sauce is hot and breadcrumbs are browned, about 30 minutes.\n",
        "picture_link": "Z16F1Ssbah6p8tRCfxUc12TVnKa/Sum"
    },
    {
        "title": "Gluten-Free Cinnamon Rolls",
        "ingredients": [
            "1/4 cup organic shortening, plus ADVERTISEMENT",
            "1 1/2 teaspoons organic shortening ADVERTISEMENT",
            "3 cups self-rising gluten-free flour* ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/2 cup Melt® Organic Buttery Spread, softened ADVERTISEMENT",
            "1/2 cup sugar ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1 tablespoon cinnamon ADVERTISEMENT",
            "Glaze: (Mix these ingredients together 5 minutes before rolls are done in oven) ADVERTISEMENT",
            "1 1/4 cups powdered sugar ADVERTISEMENT",
            "3 tablespoons milk ADVERTISEMENT",
            "1/3 teaspoon vanilla ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees.\nMix shortening in the flour with stand up mixer with paddle shape attachment (you can also use a standard mixer). Mix until fully combined together. Add 1 cup of milk and mix until all ingredients are moist. Turn dough out onto floured surface and knead lightly or use dough hook attachment and knead lightly.\nRoll dough out until about 1/3-inch thick and then spread the softened butter on the dough; leave a 1/3 inch border around sides. Combine both of the sugars and cinnamon and mix well. Sprinkle over the butter mixture and massage it into the butter well. Start rolling the dough tightly and press the edges and ends together. Cut into 1-inch slices and place cut side down on a greased cookie sheet. Bake for 20 minutes. Drizzle glaze over hot cinnamon rolls and enjoy!\n",
        "picture_link": "2DORPemCiB67sLp/HMLq8zGKg5Lu/5u"
    },
    {
        "title": "Cream Cheese Colcannon",
        "ingredients": [
            "1 pound potatoes ADVERTISEMENT",
            "4 cups shredded cabbage ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1/2 cup skim milk ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 (3 ounce) package cream cheese ADVERTISEMENT",
            "1 pinch salt and ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes in a large pot and cover with salted water. Bring to a boil, then reduce heat to medium-low and simmer until tender, 15 to 20 minutes. Drain and reserve the cooking liquid. Allow potatoes to cool until they can be handled.\nBoil cabbage and onion with the reserved potato water in a pot until softened, about 5 minutes. Drain.\nPreheat oven to 350 degrees F (175 degrees C).\nGrease a 2-quart casserole dish.\nPeel and cut potatoes into chunks; place in a large bowl.\nMash skim milk and butter into potatoes until mixture is smooth.\nStir drained cabbage and onion into potato mixture.\nFold cream cheese, salt, and black pepper into potato mixture, stirring until the cream cheese melts.\nPour potato mixture into prepared casserole dish.\nBake in preheated oven until browned, 30 to 35 minutes.\n",
        "picture_link": "Bmpkejkfv8W.YtbZMketIH4Hcxx93G2"
    },
    {
        "title": "Barbecued Chicken Quesadillas",
        "ingredients": [
            "4 (5 ounce) skinless, boneless chicken breast halves ADVERTISEMENT",
            "1/2 cup barbeque sauce ADVERTISEMENT",
            "1/3 cup chopped fresh parsley ADVERTISEMENT",
            "1/4 teaspoon garlic, finely minced ADVERTISEMENT",
            "8 (9 inch) flour tortillas ADVERTISEMENT",
            "2 small plum tomatoes, seeded and chopped ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBring a medium saucepan lightly salted water to a boil; add chicken breasts and reduce heat to medium-low. Cover and gently simmer until chicken is no longer pink in the center, 15 minutes. Drain.\nLet chicken cool until it can be easily handled. Shred chicken with your hands; return to empty sauce pan. Stir barbeque sauce, parsley, and garlic into chicken.\nLay 4 tortillas on a baking sheet. Evening spread chicken mixture among the 4 tortillas, leaving a 1-inch border around the outer edge. Top each tortilla with 1/4 tomatoes and 1/4 Cheddar cheese. Place another tortilla atop each filled tortilla.\nBake quesadillas in the preheated oven until cheese is melted, 5 to 7 minutes. Cut into wedges to serve.\n",
        "picture_link": "ziIdDuIvECfgjAUC1A.R/2ist0QmwGm"
    },
    {
        "title": "Too Much Strawberry Cake",
        "ingredients": [
            "1 (18.25 ounce) package strawberry cake mix ADVERTISEMENT",
            "1 (5.1 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/2 cup warm water ADVERTISEMENT",
            "1 (16 ounce) container prepared strawberry frosting, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a fluted tube pan such as a Bundt(R) pan.\nCombine the cake mix and pudding mix in a bowl. Thoroughly whisk together the sour cream, vegetable oil, eggs, water, and 1/4 cup frosting in a separate bowl, then stir into the cake and pudding mixture. Pour the batter into the prepared tube pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 50 to 55 minutes. Cool in the pan for 10 minutes before removing to cool completely on a wire rack. Frost the cooled cake with the remaining strawberry frosting.\n",
        "picture_link": "xEngX9ClB3AAMsSfzaodfQw0pa1IjiC"
    },
    {
        "title": "Grandma Jane's Kicked Up Tomato and Cucumber Salad  ",
        "ingredients": [
            "1/2 pound thick-sliced peppered bacon ADVERTISEMENT",
            "1 tablespoon bacon drippings ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "3 large tomatoes, diced ADVERTISEMENT",
            "2 large cucumbers, diced ADVERTISEMENT",
            "kosher salt to taste ADVERTISEMENT",
            "freshly cracked five-peppercorn seasoning to taste ADVERTISEMENT",
            "1/4 teaspoon ground cumin (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate. When cool, crumble the bacon into a large salad bowl. Reserve 1 tablespoon of bacon drippings, and let cool.\nMix the bacon drippings and mayonnaise into the crumbled bacon until thoroughly combined; stir in tomatoes and cucumbers. Season to taste with kosher salt, five-peppercorn blend, and cumin. Allow to chill for at least 1 hour before serving (overnight is better).\n",
        "picture_link": "865svj8delB1mkc6zghFnJecVyKNLrC"
    },
    {
        "title": "White Tres Leches Cake",
        "ingredients": [
            "cooking spray with flour ADVERTISEMENT",
            "1 (18.25 ounce) package white cake mix ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "5 large eggs ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2/3 cup canola oil ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "2 (5 ounce) cans evaporated milk ADVERTISEMENT",
            "1 (10 ounce) can sweetened condensed milk ADVERTISEMENT",
            "6 tablespoons heavy whipping cream ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/8 teaspoon coconut extract ADVERTISEMENT",
            "2 cups heavy whipping cream ADVERTISEMENT",
            "1 (3.5 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nSpray 2 9-inch round cake pans with cooking spray.\nMix white cake mix, flour, eggs, sugar, canola oil, 1 teaspoon vanilla extract, baking powder, and milk in a large bowl until thoroughly combined. Pour batter into prepared cake pans.\nBake in preheated oven until the cakes are lightly browned and a toothpick inserted into the center of the cakes comes out clean, 40 to 50 minutes. Let cakes cool about 10 minutes in pans before removing to finish cooling on racks.\nWhisk evaporated milk, sweetened condensed milk, 6 tablespoons cream, 1/2 teaspoon vanilla extract, and coconut extract in a bowl until smooth. Refrigerate the tres leches mixture.\nBeat 2 cups cream with instant vanilla pudding mix in a separate mixing bowl with an electric mixer until soft peaks form, 3 to 5 minutes. Refrigerate mousse filling.\nWith a long serrated knife, lightly cut off a thin layer of each cake top to level the cake. Place cakes, leveled sides up, on pieces of waxed paper. Poke holes all over the cakes with a skewer. Slowly pour the tres leches mixture over the cakes, about 1/2 cup at a time, waiting until the mixture has soaked in before continuing to pour on more milk mixture. Wrap cake layers in plastic wrap; refrigerate until chilled, at least 4 hours.\nUnwrap a cake layer and place onto a serving platter with leveled side up. Top the cake with mousse filling; gently place second cake layer over the filling with leveled side down. Refrigerate leftovers.\n",
        "picture_link": "SSB5VoJwfsPuq75wECa3hpyAyZBqLHq"
    },
    {
        "title": "North German Gruenkohl (Kale) and Sausage",
        "ingredients": [
            "1 pound kale, stemmed and chopped ADVERTISEMENT",
            "3 slices bacon, chopped ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "2 cups water, or as needed to cover ADVERTISEMENT",
            "2 teaspoons beef bouillon granules ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1 tablespoon prepared mustard ADVERTISEMENT",
            "1/2 pound thickly sliced cooked ham, or to taste ADVERTISEMENT",
            "4 links kielbasa sausage ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a pot of water to a boil, and stir in the kale; boil for 1 minute, and remove from the water with a slotted spoon. Set the blanched kale aside.\nPlace bacon into a large skillet over medium heat, and cook until browned, stirring frequently, about 8 minutes. Stir in the onion, and cook until translucent, about 5 minutes. Stir in the blanched kale, and cook until kale is bright green and starting to turn tender, about 4 minutes. Pour in enough water to cover, and bring the mixture to a boil. Reduce heat to a simmer, and stir in the beef bouillon granules and nutmeg. Simmer the kale until tender, about 30 minutes.\nStir the mustard into the kale, and lay the ham slices and sausage links on top. Simmer the kale, ham, and sausages until the sausages are cooked through, about 35 more minutes. Season to taste with salt and black pepper before serving.\n",
        "picture_link": "PuDUJDFfy7TauJm87fJGS2snRsYbYfu"
    },
    {
        "title": "Stout Slow Cooker Corned Beef and Veggies",
        "ingredients": [
            "1 1/2 (12 fluid ounce) cans or bottles Irish stout beer (such as Guinness®), divided ADVERTISEMENT",
            "1 (4 pound) corned beef brisket ADVERTISEMENT",
            "1 1/2 cups brown sugar ADVERTISEMENT",
            "3 sweet potatoes, cut into chunks ADVERTISEMENT",
            "1 head cabbage, cored and coarsely chopped ADVERTISEMENT",
            "2 large sweet onions, chopped ADVERTISEMENT",
            "6 large carrots, chopped ADVERTISEMENT",
            "3 red potatoes, cut into chunks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour 1 bottle Irish stout beer into a slow cooker.\nRinse corned beef brisket and pat dry. Rub with brown sugar, including the bottom, and gently place brisket into the slow cooker with the stout beer.\nArrange sweet potatoes, cabbage, onion, carrots, and red potatoes on and around the brisket in the slow cooker.\nPour remaining 1/2 bottle Irish stout beer on and around brisket and vegetables to moisten the brown sugar. Cover the cooker and cook on Low until corned beef is tender, 6 to 8 hours. Allow brisket to stand 5 minutes before slicing.\n",
        "picture_link": "vR58.GurIrIl3zFdCnOYhR0i/Vzzr2m"
    },
    {
        "title": "Lamb Braised in Pomegranate",
        "ingredients": [
            "3 pounds lamb shoulder blade chops ADVERTISEMENT",
            "salt and freshly ground pepper to taste ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "4 cloves garlic, sliced ADVERTISEMENT",
            "2 cups pomegranate juice ADVERTISEMENT",
            "1/3 cup aged balsamic vinegar ADVERTISEMENT",
            "1/4 teaspoon dried rosemary ADVERTISEMENT",
            "8 fresh mint leaves ADVERTISEMENT",
            "1/4 teaspoon red pepper flakes ADVERTISEMENT",
            "1 tablespoon honey, or more to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons pomegranate seeds ADVERTISEMENT",
            "1 tablespoon sliced fresh mint leaves ADVERTISEMENT",
            "1 tablespoon pumpkin seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C). Generously season lamb chops with salt and black pepper.\nHeat vegetable oil in a Dutch oven over high heat. Place lamb chops in Dutch oven and cook until browned on all sides, about 8 minutes. Transfer lamb to a plate and reduce heat to medium.\nStir onion and a pinch of salt into the Dutch oven; cook until onions are slightly golden, about 3 minutes. Stir in garlic and cook for 30 seconds.\nPour pomegranate juice into the Dutch oven and scrape any browned bits off of the bottom of the pot. Pour in balsamic vinegar, increase heat to high, and bring to a boil.\nStir rosemary, mint leaves, and red pepper flakes into pomegranate juice mixture. Continue to boil until liquid is reduced by half, about 10 minutes. Return lamb and any accumulated juices to Dutch oven, spoon pomegranate mixture over lamb, and cover.\nCook in the preheated oven until meat is fork tender, about 2 hours. Transfer lamb to a plate and set Dutch oven on the stovetop over high heat. Bring pomegranate mixture to a boil; cook, skimming any fat that accumulates, until liquid is reduced by 1/3, about 5 minutes.\nStir in honey and season with salt and black pepper to taste. Return lamb to the Dutch oven; stir to combine. Garnish with pomegranate seeds, sliced mint leaves, and pumpkin seeds.\n",
        "picture_link": "n6OWS7GsdEmEzyVrRz6GQCh065ArkvO"
    },
    {
        "title": "Yummy Guacamole",
        "ingredients": [
            "8 ripe Hass avocados - pitted, peeled, and diced ADVERTISEMENT",
            "3 roma (plum) tomatoes, chopped ADVERTISEMENT",
            "1/2 cup chopped fresh cilantro ADVERTISEMENT",
            "4 green onions, chopped ADVERTISEMENT",
            "4 jalapeno peppers, seeded and minced ADVERTISEMENT",
            "4 cloves garlic, finely minced ADVERTISEMENT",
            "3 limes, juiced ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mash avocados with a fork in a large bowl. Mix tomatoes, cilantro, green onions, jalapeno peppers, garlic, and lime juice into mashed avocados; season with salt and black pepper.\nPlace avocado seeds in guacamole. Cover bowl tightly with plastic wrap; refrigerate for 30 minutes.\n",
        "picture_link": "oa0pK9tybXPRijz0ObdrQN3hwZd/42y"
    },
    {
        "title": "Easy Crustless Zucchini Quiche",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "2 tablespoons dry bread crumbs ADVERTISEMENT",
            "4 large eggs, well-beaten ADVERTISEMENT",
            "3 cups shredded zucchini ADVERTISEMENT",
            "1 cup biscuit baking mix (such as Bisquick®) ADVERTISEMENT",
            "1 small onion, minced ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1 tablespoon grated Parmesan cheese ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray a 9-inch pie plate with cooking spray and coat with bread crumbs.\nMix eggs, zucchini, biscuit mix, onion, Cheddar cheese, vegetable oil, parsley, Parmesan cheese, garlic, oregano, salt, and black pepper in a large bowl until well blended. Pour mixture into prepared baking dish.\nBake in preheated oven until golden brown and eggs are set, 45 minutes to 1 hour. Allow quiche to cool for 10 minutes before serving.\n",
        "picture_link": "XGV7qhOyYOrQVYeheRo6fm6WnQUVsXu"
    },
    {
        "title": "Banana, Chocolate, and Almond Breakfast Oatmeal",
        "ingredients": [
            "1 cup milk ADVERTISEMENT",
            "1/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "2 1/2 tablespoons turbinado sugar ADVERTISEMENT",
            "1/2 teaspoon almond extract ADVERTISEMENT",
            "1 large banana, slightly mashed ADVERTISEMENT",
            "1/2 cup quick cooking oats ADVERTISEMENT",
            "1/4 cup blanched slivered almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk the milk, cocoa powder, turbinado sugar, and almond extract together in a saucepan over medium-low heat until the sugar has dissolved; bring the mixture to a simmer.\nStir the mashed banana and oatmeal into the milk mixture; cook at a simmer until the oatmeal is thickened and the banana has broken up slightly, about 5 minutes. Fold the slivered almonds into the oatmeal to serve.\n",
        "picture_link": "dRHt1yHZGvx41vBBcCDVlBErx6Nox7C"
    },
    {
        "title": "Finger Lickin' Rock and Roll Artichokes",
        "ingredients": [
            "1 (8 ounce) can artichoke hearts, drained ADVERTISEMENT",
            "3/4 cup mayonnaise ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1/2 cup shredded Monterey Jack cheese ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon seasoning salt ADVERTISEMENT",
            "1 teaspoon soy sauce ADVERTISEMENT",
            "1 teaspoon hot pepper sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, mix together artichoke hearts, mayonnaise, Parmesan cheese, Monterey Jack cheese, garlic powder, seasoning salt, soy sauce and hot pepper sauce. Chill in the refrigerator until serving.\n",
        "picture_link": "/jd7xATbN1pYO2HoGJKAxerZ4/SagvS"
    },
    {
        "title": "Garlic Jelly",
        "ingredients": [
            "1/4 cup garlic cloves, peeled ADVERTISEMENT",
            "2 cups distilled white vinegar ADVERTISEMENT",
            "5 cups white sugar ADVERTISEMENT",
            "3 ounces liquid pectin ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a food processor or blender, blend the garlic and 1/2 cup of vinegar until smooth. In a 6 to 8 quart saucepan, combine the garlic mixture, remaining 1 1/2 cups vinegar and sugar. Over high heat bring the mixture to a boil, stirring constantly. Quickly add the pectin. Return the mixture to a boil and boil hard for 1 minute, stirring constantly. Remove from the heat.\nImmediately fill five, sterilized half pint jars with the jelly, leaving 1/4-inch head space. Wipe the jar tops and threads clean. Place hot sealing lids on the jars and apply the screw on rings loosely. Process in boiling water in a deep canning pot for 5 minutes. Remove the jars and cool completely. Tighten the jar screw rings to complete the sealing process.\n",
        "picture_link": "p2X16EOSpVm.1qwGw5uic0zEDIXLNYa"
    },
    {
        "title": "Scrumptious Chocolate Cake",
        "ingredients": [
            "1/2 cup margarine ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "4 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1/2 cup buttermilk ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1/2 cup margarine ADVERTISEMENT",
            "4 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "5 tablespoons milk ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "4 cups confectioners' sugar ADVERTISEMENT",
            "1 cup crunchy peanut butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease and flour a 9x13 inch pan.\nIn a saucepan, combine 1/2 cup margarine, oil, 4 tablespoons cocoa and water. Bring to a boil over medium high heat, stirring often. Set aside.\nIn a large bowl, sift together the flour and sugar. Make a well in the center, and pour in the cocoa mixture. Stir until smooth. Mix in the buttermilk, 2 teaspoons vanilla, cinnamon, baking soda and eggs.\nPour batter into prepared pan. Bake in the preheated oven for 20 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool slightly before frosting.\nFor the Frosting: In a large saucepan, combine 1/2 cup margarine, 4 tablespoons cocoa and 5 tablespoons milk. Bring to a boil, stirring often. Remove from heat. Stir in confectioners' sugar, peanut butter and 1 1/2 teaspoons vanilla. Beat until the icing is blended. Pour over warm cake.\n",
        "picture_link": "IVqKaDyIxCoUztIXWqmsCA4DmY3KQa2"
    },
    {
        "title": "Cantonese Lean Pork Congee",
        "ingredients": [
            "1 cup long grain white rice ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "5 cups water ADVERTISEMENT",
            "1/2 pound boneless pork loin roast ADVERTISEMENT",
            "1 1/2 teaspoons oyster sauce ADVERTISEMENT",
            "1 salted (hard-cooked) duck egg, chopped ADVERTISEMENT",
            "1 hundred-year egg, minced ADVERTISEMENT",
            "1 (1 inch) piece fresh ginger root, thinly sliced ADVERTISEMENT",
            "1/2 cup chopped green onion ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "soy sauce to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse and drain the rice, and place in a large pot. Stir in the salt and oil, and let stand for 5 minutes.\nAdd the pork to the rice, and stir in the water. Bring to a boil, then simmer over medium heat for 15 minutes, or until the pork is cooked through. Remove the pork from the pot with a slotted spoon, and set aside. Continue to simmer the rice for 20 minutes. Chop the pork into small cubes, and mix with the salted egg and hundred-year egg.\nAfter the 20 minutes are up, stir the pork and egg mixture back into the congee along with the oyster sauce. Serve in bowls, and garnish with ginger and green onion. Have soy sauce and pepper on the side for seasoning.\n",
        "picture_link": "I2pO15zp6Lw1WsLiRt3OxhJ4R//AqNa"
    },
    {
        "title": "Tiramisu IV",
        "ingredients": [
            "1/2 cup brewed coffee, room temperature ADVERTISEMENT",
            "1/4 cup amaretto liqueur ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "3/4 cup heavy cream ADVERTISEMENT",
            "2 tablespoons vanilla extract ADVERTISEMENT",
            "20 ladyfingers ADVERTISEMENT",
            "1 tablespoon unsweetened cocoa powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, combine coffee and amaretto. Divide cream cheese in half and stir coffee mixture into one half of cheese. Set aside.\nIn a medium bowl, whip cream with vanilla until stiff peaks form. Fold whipped cream into remaining cream cheese.\nLine a 7x11 inch dish with parchment paper. Place 10 ladyfingers in the bottom of the dish. Spoon one-half of the coffee mixture over the cookies. Top with one-half of the whipped cream mixture. Repeat layers. Sprinkle with cocoa. Refrigerate one hour before serving.\n",
        "picture_link": "zDO28i9FVMJRrByKoN/euFTrVXvkDzy"
    },
    {
        "title": "Homemade Wine Coolers",
        "ingredients": [
            "1 (750 milliliter) bottle wine ADVERTISEMENT",
            "1 (12 fluid ounce) can or bottle ginger ale ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour wine into an ice cube tray and freeze until solid.\nWhen cubes are frozen, plop 1 or 2 into a glass of ginger ale. Allow to sit for about 5 minutes so the cubes melt a little; stir.\n",
        "picture_link": ".mEnzlv5RY84EM134F/04kAje19PAjq"
    },
    {
        "title": "Savory Sausage Toad-in-the-Hole",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon dried savory ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "2 pounds pork sausage links ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a bowl, stir together flour, savory and salt. Whisk milk with eggs; gradually whisk into flour mixture until smooth. Let stand for 30 minutes.\nMeanwhile, prick sausages with a fork; place in greased 13x9-inch baking dish. Bake in preheated oven, turning sausages once, for 25 to 30 minutes or until golden. Drain off all but 2 tablespoons fat.\nRemove from oven; increase temperature to 425 degrees F (220 degrees C). Whisk batter; pour over sausages. Bake for 25 to 30 minutes or until puffed and golden. Serve immediately.\n",
        "picture_link": "PU4qN2K.h3XU2IQ/njgEhgnus/FM1L."
    },
    {
        "title": "Turkey Dressing Bread",
        "ingredients": [
            "1 cup milk, room temperature ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 tablespoon butter, softened ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1/3 cup yellow cornmeal ADVERTISEMENT",
            "3 cups bread flour ADVERTISEMENT",
            "4 1/2 teaspoons dried minced onion flakes ADVERTISEMENT",
            "1 1/2 teaspoons celery seed ADVERTISEMENT",
            "3/4 teaspoon poultry seasoning ADVERTISEMENT",
            "1/2 teaspoon rubbed sage ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "2 1/4 teaspoons active dry yeast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ingredients in the pan of the bread machine in the order recommended by the manufacturer. Select basic bread setting; press Start. Check dough after 5 minutes of mixing. Add 1 to 2 tablespoons of water or flour if needed.\n",
        "picture_link": "UE/6/ZmG5Hh/pYzjTc.hR0Dla7XxJhi"
    },
    {
        "title": "Balsamic Bleu Cheese Salad",
        "ingredients": [
            "2 cups mixed baby greens ADVERTISEMENT",
            "1 cup leaf lettuce - rinsed, dried and torn into bite-size pieces ADVERTISEMENT",
            "8 ounces blue cheese, crumbled ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "1 tablespoon balsamic vinegar ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, toss together the mixed greens, leaf lettuce, cheese and walnuts. Set aside.\nIn a small bowl, whisk together the balsamic vinegar, olive oil and lemon juice. Pour over the salad mixture and toss well.\n",
        "picture_link": "qrLdJF1MIVJ6vvwZF6F/LE0LSUNPmOm"
    },
    {
        "title": "Stromboli Bites",
        "ingredients": [
            "1/2 pound Italian sausage ADVERTISEMENT",
            "1 (1 pound) loaf frozen bread dough ADVERTISEMENT",
            "1 tablespoon yellow mustard ADVERTISEMENT",
            "1 tablespoon prepared Dijon-style mustard ADVERTISEMENT",
            "5 slices cooked ham ADVERTISEMENT",
            "6 slices pepperoni sausage ADVERTISEMENT",
            "6 slices salami ADVERTISEMENT",
            "4 slices provolone cheese ADVERTISEMENT",
            "4 slices processed American cheese ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1/3 cup cornmeal ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Allow frozen bread dough to thaw approximately 8 hours, or overnight, in the refrigerator. Place dough in a large, lightly greased bowl. Place bowl in a warm location, and allow dough to rise until doubled (2 to 3 hours). Punch down dough.\nPlace Italian sausage in a large, deep skillet. Cook over medium high heat until evenly brown. Drain and set aside.\nPreheat oven to 325 degrees F (165 degrees C). Lightly grease a large baking sheet.\nRoll dough into an approximately 10x14 inch rectangle on the baking sheet. Spread with yellow mustard and prepared Dijon-style mustard. Line center with cooked Italian sausage, ham, pepperoni sausage, salami, provolone cheese and American cheese. Sprinkle with oregano and basil.\nFold edges of dough over the fillings and pinch together. Tuck and pinch ends. Sprinkle with cornmeal, and flip so the seam side is down.\nBake in the preheated oven 45 minutes, or until a deep golden brown. Cool 10 minutes before cutting into bite-sized slices.\n",
        "picture_link": "97juOuFh6tLqzeeBY5oQBG/S1thYR7y"
    },
    {
        "title": "Spam and Cheese Casserole",
        "ingredients": [
            "1 (12 ounce) container fully cooked luncheon meat (e.g. Spam), chopped ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "20 soda crackers, crushed ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 cup shredded Cheddar cheese, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a 9x13 inch baking dish combine the meat, eggs, cracker crumbs, milk and 3/4 cup of the cheese. Mix well. Sprinkle remaining 1/4 cup cheese on top.\nBake uncovered in the preheated oven for 1 hour. Let cool and serve.\n",
        "picture_link": ".fG3GC.ONKopzsgpRaWK4qU7ZTLGpkm"
    },
    {
        "title": "Josephine's Puerto Rican Chicken and Rice",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "5 chicken drumsticks ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1/2 cup pitted green olives ADVERTISEMENT",
            "2 tablespoons capers ADVERTISEMENT",
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "3 tablespoons shortening ADVERTISEMENT",
            "2 tablespoons achiote seed ADVERTISEMENT",
            "4 cups boiling water ADVERTISEMENT",
            "4 cups uncooked jasmine rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan saute chicken, onions, olives and capers over medium heat. Pour in a little juice from the olives to add more olive flavor. As the onion begins to turn clear and the chicken begins to brown, add tomato sauce. Saute mixture until everything is lightly cooked. Reduce heat to low.\nIn a small saucepan melt shortening over medium heat; add achiote seeds. When the shortening turns red remove it from the heat and strain out the seeds. Mix oil into chicken/tomato mixture. Add the boiling water to the mixture, increase the heat to medium high and bring to a boil, stirring well.\nAdd the rice to the boiling mixture and continue to boil for about 3 minutes. Reduce heat to low and continue cooking for about 30 minutes, or until rice is tender and has absorbed the liquid, stirring occasionally. Remove from heat and let stand for 10 minutes.\nTransfer mixture to a large bowl and serve immediately.\n",
        "picture_link": "cniJGn8GR6cTU/oPfcveV0kaetbtoBa"
    },
    {
        "title": "Frosted Cereal Bars",
        "ingredients": [
            "1 cup light corn syrup ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup margarine, softened ADVERTISEMENT",
            "1 cup creamy peanut butter ADVERTISEMENT",
            "1 (16 ounce) package miniature marshmallows ADVERTISEMENT",
            "11 cups crispy rice cereal ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "2 cups butterscotch chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Over medium high heat in a large heavy kettle, combine the syrup and sugar, bring to a boil and continue to boil for one minute. Reduce heat to low and stir in the margarine and peanut butter until melted. Add marshmallows and stir until well blended.\nPour the cereal into a large bowl, and stir in the marshmallow mixture so that the cereal is evenly coated. Grease an 11x17 inch jellyroll pan and press the cereal into the pan. Flatten with the back of a buttered spoon.\nTo make the frosting, melt the chocolate chips and butterscotch chips over a double boiler or in the microwave, stirring frequently until smooth. Spread evenly over the bars in the pan. Let stand until the bars are cool, and topping is set. Cut into squares and serve.\n",
        "picture_link": "tZiyfIxfqtXlZdpEZPJF6QXU8aV2CWK"
    },
    {
        "title": "Spaghetti Salad IV",
        "ingredients": [
            "1 (16 ounce) package spaghetti ADVERTISEMENT",
            "1 large tomato, chopped ADVERTISEMENT",
            "1 large green bell pepper, chopped ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 tablespoons salad seasoning mix ADVERTISEMENT",
            "2 tablespoons sesame seeds ADVERTISEMENT",
            "1 (16 ounce) bottle Italian-style salad dressing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain and run water over to cool.\nCombine in a large bowl, tomato, bell pepper, onion, salad seasoning, sesame seeds and Italian dressing. Chill and serve.\n",
        "picture_link": "7iHG/tmPGkScyg0iuS2x/QM4MJt5kOm"
    },
    {
        "title": "Broccoli Tofu Pitas",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 cup fresh broccoli florets ADVERTISEMENT",
            "1 cup diced firm tofu ADVERTISEMENT",
            "2 tablespoons thousand island dressing ADVERTISEMENT",
            "1 pita bread ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a skillet over medium high heat, heat the tablespoon of oil. Fry broccoli in hot oil for 5 minutes, then stir in the tofu. Cook until broccoli is slightly tender, about 3 to 4 more minutes. Remove from heat and toss with the salad dressing.\nCut pita bread in half and stuff each pocket with half of the mixture. Other types of dressing may be used in place of thousand island if desired.\n",
        "picture_link": "we2GPz5KPYaCTxR7zL/nvkr8YoNqDp."
    },
    {
        "title": "Tuna Dip II",
        "ingredients": [
            "1 (5 ounce) can tuna, drained ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "3 tablespoons salsa ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, blend the tuna, cream cheese and salsa. Serve immediately.\n",
        "picture_link": "uty./osEfpA7DvASRKfgpHLeHzlSbNO"
    },
    {
        "title": "Fuzzy Navel Cake II",
        "ingredients": [
            "1 (15 ounce) can sliced peaches, with juice ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup peach schnapps ADVERTISEMENT",
            "1/4 cup orange juice ADVERTISEMENT",
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1 (3 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "2/3 cup vegetable oil ADVERTISEMENT",
            "1 1/2 cups confectioners' sugar ADVERTISEMENT",
            "1/4 cup melted margarine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 10 inch Bundt pan. In a blender, puree peaches with juice, schnapps, white sugar and orange juice until smooth.\nIn a medium bowl, mix together the cake mix, pudding mix, eggs, oil and 1 1/2 cups of the peach mixture.\nPour batter into prepared pan. Bake in the preheated oven for 50 minutes, or until a toothpick inserted into the center of the cake comes out clean. Frost cake while still hot.\nTo make the frosting: Mix together the confectioners' sugar, margarine and remaining 1/4 cup of the peach mixture. Pour over hot cake.\n",
        "picture_link": "zdysShksrhldid1dmUIAjVFy8qFBZ9G"
    },
    {
        "title": "Stringy Macaroni",
        "ingredients": [
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "1 (16 ounce) can canned tomatoes ADVERTISEMENT",
            "1 small onion, minced ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 1/4 teaspoons dried oregano ADVERTISEMENT",
            "1 (8 ounce) package medium seashell pasta ADVERTISEMENT",
            "1 (16 ounce) package cottage cheese ADVERTISEMENT",
            "1/2 pound mozzarella cheese, shredded ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nCombine the tomato sauce, canned tomatoes, minced onion, salt, pepper and oregano in a saucepan. Cover and simmer for 20 minutes.\nBring a large pot of lightly salted water to a boil. Add pasta shells and cook for 8 to 10 minutes or until al dente. Drain and rinse with cool water.\nPut a layer of cooked shells in a greased 3 quart casserole dish. After the shells, you put in the cottage cheese and spread it out to cover all the shells. Layer on the sauce, then another layer of shells, then the mozzarella cheese and more sauce. Add the last layer of shells, the parmesan, and finish with a layer of sauce.\nBake in preheated oven for 45 minutes.\n",
        "picture_link": "aPn7vz0O6NCkMbytiMnPpZA4KjIE28y"
    }
]