[
    {
        "title": "Roasted Garlic Bread",
        "ingredients": [
            "3 heads garlic ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 (1 pound) loaf Italian bread ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley (optional) ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Slice the tops off of garlic heads so the tip of each clove is exposed. Place garlic on a baking sheet and drizzle with olive oil. Bake until garlic is soft, about 30 minutes.\nSet the oven to broil. Slice the loaf of bread in half horizontally, and place cut-side up on a baking sheet.\nSqueeze the cloves of garlic from their skins into a medium bowl. Stir in the butter, parsley, and Parmesan cheese until well blended. Spread onto the cut sides of the bread.\nBroil bread until toasted, about 5 minutes.\n",
        "picture_link": "6GRRSJCiwwgY5lp4HJP3M4jLe0ikecm"
    },
    {
        "title": "Decorator Frosting",
        "ingredients": [
            "2/3 cup butter, softened ADVERTISEMENT",
            "4 cups confectioners' sugar ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1 teaspoon vanilla extract (optional) ADVERTISEMENT",
            "4 drops red food coloring ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, cream together the butter, confectioners' sugar, and milk until light and fluffy, about 3 to 4 minutes. Beat in the vanilla and food coloring. Spread on or between cookies.\n",
        "picture_link": "AagEfDnlKmzSKMlF0BiJ8wf/tB/pDze"
    },
    {
        "title": "Belgian Waffles",
        "ingredients": [
            "1 (.25 ounce) package active dry yeast ADVERTISEMENT",
            "1/4 cup warm milk (110 degrees F/45 degrees C) ADVERTISEMENT",
            "3 egg yolks ADVERTISEMENT",
            "2 3/4 cups warm milk (110 degrees F/45 degrees C) ADVERTISEMENT",
            "3/4 cup butter, melted and cooled to lukewarm ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, dissolve yeast in 1/4 cup warm milk. Let stand until creamy, about 10 minutes.\nIn a large bowl, whisk together the egg yolks, 1/4 cup of the warm milk and the melted butter. Stir in the yeast mixture, sugar, salt and vanilla. Stir in the remaining 2 1/2 cups milk alternately with the flour, ending with the flour. Beat the egg whites until they form soft peaks; fold into the batter. Cover the bowl tightly with plastic wrap. Let rise in a warm place until doubled in volume, about 1 hour.\nPreheat the waffle iron. Brush with oil and spoon about 1/2 cup (or as recommended by manufacturer) onto center of iron. Close the lid and bake until it stops steaming and the waffle is golden brown. Serve immediately or keep warm in 200 degree oven.\n",
        "picture_link": "yxbBNZPi4YmL4cNrHcKNONTRB57rkUy"
    },
    {
        "title": "Salmon Cakes II",
        "ingredients": [
            "1 (14.75 ounce) can salmon, drained and flaked ADVERTISEMENT",
            "1 small onion, minced ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup fresh bread crumbs ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1/8 teaspoon hot pepper sauce ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 cup shredded Cheddar cheese ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "2 tablespoons all-purpose flour for coating ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine salmon, onion, egg, bread crumbs, Worcestershire sauce, hot pepper sauce, black pepper, cheese and parsley; mix well. Shape into four patties. Dust lightly with flour. Chill for 20 minutes.\nIn a large skillet heat butter and olive oil over medium high heat. Cook the patties until browned on both sides, about 10 minutes. Drain briefly on paper towels before serving.\n",
        "picture_link": "Pn5wnIva3K0ANPSRFNqJuZirnZNFsNy"
    },
    {
        "title": "Southern Pimento Cheese",
        "ingredients": [
            "2 cups shredded extra-sharp Cheddar cheese ADVERTISEMENT",
            "8 ounces cream cheese, softened ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon ground cayenne pepper (optional) ADVERTISEMENT",
            "1/4 teaspoon onion powder ADVERTISEMENT",
            "1 jalapeno pepper, seeded and minced (optional) ADVERTISEMENT",
            "1 (4 ounce) jar diced pimento, drained ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the Cheddar cheese, cream cheese, mayonnaise, garlic powder, cayenne pepper, onion powder, minced jalapeno, and pimento into the large bowl of a mixer. Beat at medium speed, with paddle if possible, until thoroughly combined. Season to taste with salt and black pepper.\n",
        "picture_link": "84T5wYrGYkLrbnx7W.ff7niq.Km/.cy"
    },
    {
        "title": "Cream Cheese Jalapeno Hamburgers",
        "ingredients": [
            "2 cups seeded and chopped jalapeno pepper ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "2 pounds ground beef ADVERTISEMENT",
            "8 hamburger buns, split ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat a grill for medium heat. When hot, lightly oil the grate. In a medium bowl, stir together the jalapenos and cream cheese.\nDivide the ground beef into 16 portions and pat out each one to 1/4 inch thickness. Spoon some of the cream cheese mixture onto the center of 8 of the patties. Top with the remaining patties, pressing the edges together to seal.\nGrill for about 10 minutes per side, or until well done, taking care not to press down on the burgers as they cook. This will make the cheese ooze out. Serve on buns with your favorite toppings.\n",
        "picture_link": "usl8bLvGKRtyIvL9f0PdPu7ya7GgO5u"
    },
    {
        "title": "Korean BBQ Chicken Marinade",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "1 cup soy sauce ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1 tablespoon lemon juice (optional) ADVERTISEMENT",
            "4 teaspoons hot chile paste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan over high heat, whisk together the sugar, soy sauce, water, onion powder, and ground ginger. Bring to a boil. Reduce heat to low, and simmer 5 minutes.\nRemove the mixture from heat, cool, and whisk in lemon juice and hot chile paste. Place chicken in the mixture. Cover, and marinate in the refrigerator at least 4 hours before preparing chicken as desired.\n",
        "picture_link": "/hh8hsxJ1NoswsUL5Fsb7dXIoWz/09u"
    },
    {
        "title": "Copycat Panera® Broccoli Cheddar Soup",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "1/4 cup melted butter ADVERTISEMENT",
            "1/4 cup flour ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "2 cups chicken stock ADVERTISEMENT",
            "1 1/2 cups coarsely chopped broccoli florets ADVERTISEMENT",
            "1 cup matchstick-cut carrots ADVERTISEMENT",
            "1 stalk celery, thinly sliced ADVERTISEMENT",
            "2 1/2 cups shredded sharp Cheddar cheese ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt 1 tablespoon butter in a skillet over medium-high heat. Saute onion in hot butter until translucent, about 5 minutes. Set aside.\nWhisk 1/4 cup melted butter and flour together in a large saucepan over medium-low heat; cook until flour loses it's granular texture, adding 1 to 2 tablespoons of milk if necessary to keep the flour from burning, 3 to 4 minutes.\nGradually pour milk into flour mixture while whisking constantly. Stir chicken stock into milk mixture. Bring to a simmer; cook until flour taste is gone and mixture is thickened, about 20 minutes. Add broccoli, carrots, sauteed onion, and celery; simmer until vegetables are tender, about 20 minutes.\nStir Cheddar cheese into vegetable mixture until cheese melts. Season with salt and pepper to taste.\n",
        "picture_link": "aX.okdW328KOs4FO9EdES.vbHvc0pZ6"
    },
    {
        "title": "Harvest Salad",
        "ingredients": [
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1 bunch spinach, rinsed and torn into bite-size pieces ADVERTISEMENT",
            "1/2 cup dried cranberries ADVERTISEMENT",
            "1/2 cup crumbled blue cheese ADVERTISEMENT",
            "2 tomatoes, chopped ADVERTISEMENT",
            "1 avocado - peeled, pitted and diced ADVERTISEMENT",
            "1/2 red onion, thinly sliced ADVERTISEMENT",
            "2 tablespoons red raspberry jam (with seeds) ADVERTISEMENT",
            "2 tablespoons red wine vinegar ADVERTISEMENT",
            "1/3 cup walnut oil ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Arrange walnuts in a single layer on a baking sheet. Toast in oven for 5 minutes, or until nuts begin to brown.\nIn a large bowl, toss together the spinach, walnuts, cranberries, blue cheese, tomatoes, avocado, and red onion.\nIn a small bowl, whisk together jam, vinegar, walnut oil, pepper, and salt. Pour over the salad just before serving, and toss to coat.\n",
        "picture_link": "54gFzpvFJ9D4XzNDj/sbAv60GpiBcem"
    },
    {
        "title": "Spicy Slow Cooker Black Bean Soup",
        "ingredients": [
            "1 pound dry black beans, soaked overnight ADVERTISEMENT",
            "4 teaspoons diced jalapeno peppers ADVERTISEMENT",
            "6 cups chicken broth ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon cayenne pepper ADVERTISEMENT",
            "3/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon hot pepper sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Drain black beans, and rinse.\nCombine beans, jalapenos, and chicken broth in a slow cooker. Season with garlic powder, chili powder, cumin, cayenne, pepper, and hot pepper sauce.\nCook on High for 4 hours. Reduce heat to Low, and continue cooking for 2 hours, or until you are ready to eat.\n",
        "picture_link": "qYOmTv1k0YnvsSC9UEXhIfRxnY3yL/e"
    },
    {
        "title": "Grill Master Chicken Wings",
        "ingredients": [
            "Wings: ADVERTISEMENT",
            "1/2 cup soy sauce ADVERTISEMENT",
            "1/2 cup Italian-style salad dressing ADVERTISEMENT",
            "3 pounds chicken wings, cut apart at joints, wing tips discarded ADVERTISEMENT",
            "Sauce: ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 teaspoon soy sauce ADVERTISEMENT",
            "1/4 cup hot pepper sauce (such as Frank's RedHot®), or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine 1/2 cup soy sauce, Italian dressing, and chicken wings in a large, zip-top bag. Close bag and refrigerate 4 hours to overnight.\nPreheat an outdoor grill for medium heat. In a small saucepan, melt the butter. Stir in the 1 teaspoon soy sauce and the hot pepper sauce. Turn off heat and reserve.\nRemove the chicken wings from the marinade and pat dry. Cook the wings on the preheated grill, turning occasionally, until the chicken is well browned and no longer pink, 25 to 30 minutes.\nPlace grilled wings in a large bowl. Pour butter sauce over wings; toss to mix well.\n",
        "picture_link": "394CA.qpHJ/mgr1f0bNIhNZxjjp.W2C"
    },
    {
        "title": "New Red Potato Salad",
        "ingredients": [
            "3 pounds unpeeled red potatoes ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 1/2 cups mayonnaise ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "2 tablespoons distilled white vinegar ADVERTISEMENT",
            "1/2 cup sliced green onions ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 cup sliced celery ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of salted water to a boil. Add red potatoes, and cook until tender but still firm, about 15 minutes. Drain, cool and chop into 1 inch cubes. Place in a medium bowl.\nPlace eggs in a medium saucepan, and cover with cold water. Bring water to a boil, and immediately remove from heat. Cover, and let eggs stand in hot water for 10 to 12 minutes. Remove from hot water, cool, peel and dice.\nIn a small bowl, whisk together mayonnaise, milk, distilled white vinegar, green onions, salt and pepper. Pour the mixture over the potatoes, and mix together with the eggs and celery. Cover, and chill in the refrigerator approximately 2 hours before serving.\n",
        "picture_link": "mXTSz4Q0Pemy4jjRHEiFyqXQq9kYksS"
    },
    {
        "title": "Chococonut Chip Cookies ",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup light brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "2 cups flaked coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C).\nIn a large bowl, cream together the butter, brown sugar and white sugar until light and fluffy. Beat in the eggs one at a time, then stir in the vanilla. Combine the flour, baking soda and salt; stir into the creamed mixture. Fold in chocolate chips and coconut. Drop by rounded spoonfuls onto cookie sheets.\nBake for 8 to 10 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n",
        "picture_link": "3baArMcBqtdhWPJsc8kh0OrxZpy3DAG"
    },
    {
        "title": "Pumpkin Roll Cake",
        "ingredients": [
            "3 eggs ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2/3 cup canned pumpkin ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "6 ounces cream cheese, softened ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn a mixing bowl, beat eggs on high for 5 minutes. Gradually beat in white sugar until thick and lemon-colored. Add pumpkin and lemon juice.\nIn another bowl combine flour, cinnamon, baking powder, salt, and nutmeg; fold into the pumpkin mixture.\nGrease a 15x10x1 inch baking pan; line with waxed paper. Grease and flour the paper. Spread batter into pan; sprinkle with walnuts.\nBake at 375 degrees F (190 degrees C) for 15 minutes or until cake springs back when lightly touched.\nImmediately turn out onto a linen towel dusted with confectioners' sugar. Peel off paper and roll cake up in the towel, starting with the short end. Cool.\nMeanwhile, in a mixing bowl, beat cream cheese, 1 cup confectioners' sugar, butter, and vanilla until fluffy.\nCarefully unroll the cake. Spread filling over cake to within 1 inch of edges. Roll up again. Cover and chill until serving. Dust with additional confectioners' sugar, if desired.\n",
        "picture_link": "xlUH5LA2Z0huoh5RQVvQodSLMw4DPpC"
    },
    {
        "title": "Toscana Soup",
        "ingredients": [
            "12 links spicy pork sausage, sliced ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "3/4 cup diced onion ADVERTISEMENT",
            "1 1/4 teaspoons minced garlic ADVERTISEMENT",
            "2 tablespoons chicken soup base ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "2 potatoes, halved and sliced ADVERTISEMENT",
            "2 cups sliced kale ADVERTISEMENT",
            "1/3 cup heavy cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C).\nPlace sausage links on a baking sheet and bake 25 minutes, or until cooked through. Slice into 1/2 inch slices.\nHeat oil in a large saucepan over medium heat. Saute onions until translucent; add garlic and cook 1 minute.\nStir in broth, water and potatoes; simmer 15 minutes.\nReduce heat to low and add sausage, kale and cream; simmer until heated through and serve.\n",
        "picture_link": "Oy3Hen6gLvTB49HlVVYEamePQhNoAZu"
    },
    {
        "title": "Salmon with Brown Sugar and Bourbon Glaze",
        "ingredients": [
            "4 tablespoons butter ADVERTISEMENT",
            "1/2 cup dark brown sugar ADVERTISEMENT",
            "4 (6 ounce) salmon steaks ADVERTISEMENT",
            "1/3 cup bourbon whiskey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large heavy skillet over medium heat. Stir in brown sugar. Place salmon fillets on top of brown sugar mixture. Cook for 5 minutes on medium heat. Turn salmon, and pour bourbon around the fillets. Continue cooking for 5 minutes, or until fish flakes easily with a fork. Spoon glaze over the salmon, and serve.\n",
        "picture_link": "n3WmJeWymnMaze3tCN8Z1nOunYk5PJa"
    },
    {
        "title": "Smothered Chicken Breasts",
        "ingredients": [
            "4 (6 ounce) skinless, boneless chicken breast halves ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon lemon pepper seasoning ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "8 strips bacon ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "1/4 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup shredded Colby-Monterey Jack cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sprinkle chicken with salt and lemon-pepper.\nHeat oil in a large skillet over medium heat; cook the chicken breasts in hot oil until no longer pink in the center and the juices run clear, 13 to 15 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Remove and keep warm.\nPlace bacon in large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels; reserve 2 tablespoons drippings. Cook and stir onion and brown sugar in reserved drippings until onion is golden, about 5 minutes.\nPlace two bacon strips on each chicken breast half; top with caramelized onions and sprinkle with Colby-Monterey Jack cheese.\n",
        "picture_link": "ngxKTm2uH714nyIDT1fHxvDA5s5Ab.6"
    },
    {
        "title": "Chicken Scarpariello",
        "ingredients": [
            "1 1/4 pounds skinless, boneless chicken breast halves ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 teaspoons butter ADVERTISEMENT",
            "2 tablespoons shallots, minced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "1 cube chicken bouillon ADVERTISEMENT",
            "1/2 teaspoon dried rosemary, crushed ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut chicken breasts into 1 x 3 inch strips, and dredge in flour.\nIn 10 inch skillet, heat oil and butter. Add chicken. Cook, turning occasionally, until lightly browned on all sides (3 to 4 minutes). Using tongs, remove chicken from skillet. Set aside and keep warm.\nTo same skillet, add shallots and garlic. Saute until softened (1 minute). Add water, wine, broth mix, and seasonings. Mix well. Cook, stirring frequently, until liquid is reduced by 1/2 (3 to 4 minutes). Return chicken to skillet, and cook until sauce is thick and chicken is heated through (2 to 3 minutes).\n",
        "picture_link": "85y6UXbbtlZYLLgt5XwJrqTq/LYOV5G"
    },
    {
        "title": "Best Ever Popcorn Balls",
        "ingredients": [
            "3/4 cup light corn syrup ADVERTISEMENT",
            "1/4 cup margarine ADVERTISEMENT",
            "2 teaspoons cold water ADVERTISEMENT",
            "2 5/8 cups confectioners' sugar ADVERTISEMENT",
            "1 cup marshmallows ADVERTISEMENT",
            "5 quarts plain popped popcorn ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan over medium heat, combine the corn syrup, margarine, cold water, confectioners' sugar and marshmallows. Heat and stir until the mixture comes to a boil. Carefully combine the hot mixture with the popcorn, coating each kernel.\nGrease hands with vegetable shortening and quickly shape the coated popcorn into balls before it cools. Wrap with cellophane or plastic wrap and store at room temperature.\n",
        "picture_link": "poSvRvC504/P3N6WuNt4NrjQ2/m.Mtm"
    },
    {
        "title": "French Breakfast Muffins",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1 egg, lightly beaten ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/3 cup butter, melted ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/3 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease muffin cups or line with paper muffin liners.\nIn a medium mixing bowl, stir together flour, 1/2 cup sugar, baking powder, nutmeg and salt. Make a well in the center of the mixture. Stir together egg, milk and 1/3 cup melted butter. Add egg mixture to flour mixture; stir until just moistened (batter may be lumpy). Spoon batter into prepared muffin cups.\nBake in preheated oven for 20 to 25 minutes. Meanwhile, combine 1/4 cup sugar, cinnamon When muffins are finished baking, dip tops of muffins in the melted butter, and then in the cinnamon sugar mixture. Serve warm.\n",
        "picture_link": "cTdOovyOsVWpB/QtKK77r2jolnVTmOu"
    },
    {
        "title": "Best Ever Meat Loaf",
        "ingredients": [
            "2 eggs ADVERTISEMENT",
            "2/3 cup milk ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "3 slices bread, crumbled ADVERTISEMENT",
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/2 cup shredded carrot ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1/4 cup ketchup ADVERTISEMENT",
            "1 tablespoon prepared yellow mustard ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nWhisk eggs, milk, salt, and ground black pepper in a large bowl. Add crumbled bread and stir until dissolved. Mix ground beef, onion, Cheddar cheese, and carrot into bread mixture; transfer mixture to a 9x5-inch loaf pan. Combine brown sugar, ketchup, and mustard in a small bowl; spread over meat mixture.\nBake in the preheated oven until no longer pink in the center, 1 to 1 1/4 hours. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C).\n",
        "picture_link": "NGBgHhCMfHDUxLCRDdZwuCWSOdJfY2O"
    },
    {
        "title": "Black Pepper Beef and Cabbage Stir Fry",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "4 cloves garlic, chopped ADVERTISEMENT",
            "1/2 pound ground beef ADVERTISEMENT",
            "1/2 small head cabbage, shredded ADVERTISEMENT",
            "1 red bell pepper, cut into strips ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "1 teaspoon cornstarch ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a wok or large skillet over medium-high heat, and add oil. Saute garlic for about 5 seconds, then add ground beef. Stir-fry until beef is evenly brown. Stir in cabbage and pepper, and cook until vegetables are tender, and beef is fully cooked. Stir in soy sauce. Mix together cornstarch and water, and stir in. Season with pepper. Cook, stirring, until sauce has thickened.\n",
        "picture_link": "8X0PsKCsykdxOyoYy2uq4KhtqZccAtC"
    },
    {
        "title": "Golden Yam Brownies",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 cups peeled and finely shredded yam ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "2 tablespoons butter or margarine ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking dish.\nIn a large bowl, cream together the butter, brown sugar, and white sugar until smooth. Beat in the eggs one at a time, then stir in the vanilla. Combine the flour, baking powder, and salt; stir into the batter just until blended. Fold in the shredded yam. Spread the batter evenly in the greased baking dish.\nBake for 30 minutes in the preheated oven, until a toothpick inserted into the center, comes out clean. Mix together the confectioners' sugar, butter and milk until smooth. Spread over the brownies while they are still warm. They will absorb some of the glaze. Serve hot or warm.\n",
        "picture_link": "vx4B/gD6TXcWl4PqeZiuY7ZH.jnsq5u"
    },
    {
        "title": "Make Ahead French Toast",
        "ingredients": [
            "5 eggs, lightly beaten ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "1 cup half-and-half cream ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 (1 pound) loaf French bread, cut diagonally in 1 inch slices ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 cup light brown sugar ADVERTISEMENT",
            "2 tablespoons maple syrup ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, whisk together eggs, milk, cream and vanilla. Dip bread slices into egg mixture and place in a lightly greased 9x13 inch baking pan. Refrigerate overnight.\nThe next morning: Preheat oven to 350 degrees F (175 degrees C).\nIn a small bowl, combine butter, sugar, maple syrup and pecans. Spoon mixture over bread.\nBake in preheated oven until golden, about 40 minutes. Let stand 5 minutes before serving.\n",
        "picture_link": "N8ir6K.j2ODmSNRn4u4jCSihe93dnM."
    },
    {
        "title": "Tasty Buns",
        "ingredients": [
            "5 cups all-purpose flour ADVERTISEMENT",
            "2 (.25 ounce) packages dry yeast ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together 2 cups flour and the yeast. In a separate bowl, heat milk, water, oil, sugar and salt to lukewarm in microwave. Add all at once to the flour mixture, and beat until smooth, about 3 minutes.\nMix in enough flour to make a soft dough, 2 to 3 cups. Mix well. Dust a flat surface with flour, turn dough out onto floured surface, and let rest under bowl for about 10 minutes.\nShape dough into 12 slightly flat balls, and place on greased baking sheet to rise until doubled in size.\nBake in a preheated 400 degrees F (200 degrees C) oven for 12 to 15 minutes.\n",
        "picture_link": "fKxqj5N4MDvZwxSedUUSlGEafYOho/W"
    },
    {
        "title": "Porcupines",
        "ingredients": [
            "1 pound lean ground beef ADVERTISEMENT",
            "1/2 cup uncooked white rice ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon celery salt ADVERTISEMENT",
            "1/8 teaspoon garlic powder ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine the ground beef, rice, 1/2 cup of water and onion. Blend in salt, celery salt, garlic powder and pepper. Mix well. Shape into 1 1/2 inch balls.\nPreheat oven to 350 degrees F (175 degrees C). In a large skillet over medium heat, brown the meatballs; drain fat.\nIn an 11x7 inch baking dish, combine the tomato sauce and 1 cup of water. Place the browned meatballs into the tomato sauce, turning to coat well.\nCover and bake in a preheated oven for 45 minutes. Uncover, and cook for an additional 15 minutes.\n",
        "picture_link": "TW34LPv4x2lV8cLK6.Sx3zQwi9EPOgq"
    },
    {
        "title": "Snickerdoodles II",
        "ingredients": [
            "1 cup shortening ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 3/4 cups sifted all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "2 teaspoons cream of tartar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nIn a large bowl, mix together the shortening and 1 1/2 cups of white sugar until smooth. Stir in the eggs one at a time, blending well after each. Combine the flour, baking soda, cream of tartar and salt; stir into the batter until blended.\nRoll the dough into balls the size of small walnuts. Roll in a mixture of 2 tablespoons sugar and 2 teaspoons cinnamon. Place 2 inches apart on an ungreased cookie sheet.\nBake in the preheated oven for 8 to 10 minutes or until lightly browned, but still soft.\n",
        "picture_link": "MTWg/x2HTomaWN3Q.T0hQl59QYLoTNq"
    },
    {
        "title": "Joy's Prizewinning Trifle",
        "ingredients": [
            "1 (12 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "1 (8 ounce) container sour cream ADVERTISEMENT",
            "1 (9 inch) angel food cake ADVERTISEMENT",
            "1 (3.4 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "3 kiwis, peeled and sliced ADVERTISEMENT",
            "1 pint fresh strawberries, sliced ADVERTISEMENT",
            "3 bananas, peeled and sliced ADVERTISEMENT",
            "1 (15 ounce) can crushed pineapple, drained ADVERTISEMENT",
            "1 sprig fresh mint ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, fold sour cream and unprepared pudding mix into the whipped topping.\nCut the cake into thirds, horizontally.\nLine a large trifle or other glass serving bowl with kiwi and strawberry slices, reserving two whole strawberries and two kiwi slices. Place one layer of cake in bottom of bowl, top with 1/3 of bananas and pineapple, and 1/3 of whipped topping mixture. Repeat layering until all ingredients are used.\nMake fan garnishes of whole strawberries by slicing from just below the stem. Garnish assembled trifle with fanned strawberries, reserved kiwi slices, and a sprig of mint. Refrigerate until serving.\n",
        "picture_link": "yj2l8IzzrC7hS6RugZ1Yi7NkQvtUbqS"
    },
    {
        "title": "German Chocolate Cake Frosting II",
        "ingredients": [
            "1 cup evaporated milk ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "3 egg yolk, beaten with 1 teaspoon water ADVERTISEMENT",
            "1/2 cup margarine ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "1 cup flaked coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan combine evaporated milk, sugar, egg yolks, margarine and vanilla. Cook over low heat, stirring constantly, until thick. Remove from heat and stir in pecans and coconut. Spread on cake while still warm.\n",
        "picture_link": "OpYLceSw6quksx.iVG2lxZnRTFc1zpO"
    },
    {
        "title": "Country Breakfast Casserole",
        "ingredients": [
            "1 (16 ounce) package breakfast sausage ADVERTISEMENT",
            "1 chopped green onion ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "6 eggs, lightly beaten ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 (2.64 ounce) package country gravy mix ADVERTISEMENT",
            "6 slices bread, cut into 1 inch cubes ADVERTISEMENT",
            "2 tablespoons melted butter (optional) ADVERTISEMENT",
            "paprika to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease an 11x8 inch baking dish.\nBrown sausage in a large skillet; drain fat.\nCombine sausage with green onion and spread evenly across the bottom of the baking dish. Top with shredded cheese. Whisk together eggs, water, milk, and gravy mix; add mixture to baking dish. Arrange bread squares evenly on top. If desired, drizzle melted butter over bread, and sprinkle with paprika.\nBake 40 minutes in the preheated oven, or until a knife inserted into the center comes out clean. Set aside 10 minutes before serving.\n",
        "picture_link": "q7/wRxPVOLkCcnlSO0BJXWUN5259wXq"
    },
    {
        "title": "Middle Eastern Rice with Black Beans and Chickpeas",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 cup uncooked basmati rice ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "2 teaspoons ground coriander ADVERTISEMENT",
            "1 teaspoon ground turmeric ADVERTISEMENT",
            "1 teaspoon ground cayenne pepper ADVERTISEMENT",
            "1 quart chicken stock ADVERTISEMENT",
            "1 1/2 pounds ground turkey ADVERTISEMENT",
            "2 (15 ounce) cans garbanzo beans (chickpeas), drained and rinsed ADVERTISEMENT",
            "2 (15 ounce) cans black beans, drained and rinsed ADVERTISEMENT",
            "1 bunch chopped fresh cilantro (optional) ADVERTISEMENT",
            "1 bunch chopped fresh parsley (optional) ADVERTISEMENT",
            "1/4 cup pine nuts (optional) ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large saucepan over medium heat. Stir in garlic, and cook 1 minute. Stir in rice, cumin, coriander, turmeric, and cayenne pepper. Cook and stir 5 minutes, then pour in chicken stock. Bring to a boil. Reduce heat to low, cover, and simmer 20 minutes.\nPlace the turkey in a skillet over medium heat, and cook until evenly brown.\nGently mix cooked turkey, garbanzo beans, black beans, cilantro, parsley, and pine nuts into the cooked rice. Season with salt and pepper.\n",
        "picture_link": "4kTw8qOtegKhlcRZiCKhf97P1qxFFeO"
    },
    {
        "title": "Salmon Fillets with Creamy Dill",
        "ingredients": [
            "1 1/2 cups mayonnaise ADVERTISEMENT",
            "1/2 cup prepared mustard ADVERTISEMENT",
            "1 teaspoon chopped fresh thyme ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon chopped fresh basil leaves ADVERTISEMENT",
            "1 1/2 pounds salmon fillets ADVERTISEMENT",
            "2 teaspoons dried dill, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn a bowl, stir together mayonnaise and mustard. Stir in thyme, oregano, and basil. Place salmon fillets on a baking sheet, and spread with the mayonnaise mixture. Sprinkle with dill weed.\nBake in preheated oven for 30 to 40 minutes, until the salmon is easily flaked with a fork.\n",
        "picture_link": "wppJGCAF.NzpjhrbxR11tIvrIPUn.qq"
    },
    {
        "title": "Light Wheat Rolls",
        "ingredients": [
            "2 (.25 ounce) packages active dry yeast ADVERTISEMENT",
            "1 3/4 cups warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 cup butter, melted and cooled ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "2 1/4 cups whole wheat flour ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes.\nMix sugar, salt, 1/4 cup melted butter, egg, and whole wheat flour into yeast mixture. Stir in all-purpose flour, 1/2 cup at a time, until dough pulls away from the sides of the bowl. Turn dough out onto a well floured surface, and knead until smooth and elastic, about 8 minutes. Lightly oil a large bowl, place dough in bowl, and turn to coat. Cover with a damp cloth, and let rise in a warm place until doubled in volume, about 1 hour.\nPunch down dough, cover, and let rise in warm place until doubled again, about 30 minutes.\nGrease 2 dozen muffin cups. Punch down dough, and divide into two equal portions. Roll each into a 6x14 inch rectangle, and cut rectangle into twelve 7x1 inch strips. Roll strips up into spirals, and place into muffin cups. Brush tops with melted butter. Let rise uncovered in a warm place 40 minutes, or until doubled in bulk.\nPreheat oven to 400 degrees F (200 degrees C). Bake for 12 to 15 minutes, or until golden brown. Remove from oven, and brush again with melted butter.\n",
        "picture_link": "V.ZPVaNfiFlkO5S9JfZGfgiI904JE86"
    },
    {
        "title": "Turkey Pot Pie",
        "ingredients": [
            "1 recipe pastry for a (10 inch) double crust pie ADVERTISEMENT",
            "4 tablespoons butter ADVERTISEMENT",
            "1 small onion, minced ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "2 carrots, diced ADVERTISEMENT",
            "3 tablespoons dried parsley ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 cubes chicken bouillon ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "3 potatoes, peeled and cubed ADVERTISEMENT",
            "1 1/2 cups cooked turkey, cubed ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Roll out bottom pie crust and place in the 10 inch pie pan and set aside.\nPlace 2 tablespoons of the butter in a large skillet. Add the onion, celery, carrots, parsley, oregano, salt and pepper. Cook and stir until the vegetables are soft. Stir in the bouillon and water. Bring mixture to a boil. Stir in the potatoes, and cook until tender but still firm.\nIn a medium saucepan, melt the remaining 2 tablespoons butter. Stir in the turkey and flour. Add the milk, and heat through. Stir the turkey mixture into the vegetable mixture, and cook until thickened. Pour mixture into the unbaked pie shell. Roll out the top crust, and place on top of filling. Flute edges, and make 4 slits in the top crust to let out steam.\nBake in the preheated oven for 15 minutes. Reduce oven temperature to 350 degrees F (175 degrees C) and continue baking for 20 minutes, or until crust is golden brown.\n",
        "picture_link": "FdNtctrVti9AaFIgZ9XdW.ylUCwGpT6"
    },
    {
        "title": "Barbeque Chicken",
        "ingredients": [
            "4 tablespoons water ADVERTISEMENT",
            "3 tablespoons ketchup ADVERTISEMENT",
            "3 tablespoons brown sugar ADVERTISEMENT",
            "2 tablespoons vinegar ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon dry mustard ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "12 chicken thighs, skin removed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 500 degrees F (260 degrees C). In a small saucepan over medium heat, stir together the water, ketchup, brown sugar, vinegar, lemon juice, and Worcestershire sauce. Season with salt, mustard powder, and chili powder. Simmer the sauce for 15 minutes.\nPlace the chicken thighs into an oblong baking dish, and pour the sauce over them. Cover tightly.\nBake for 15 minutes in the preheated oven, then reduce the temperature to 300 degrees F (150 degrees C), and bake for one hour. Remove cover, stir and bake uncovered for 15 minutes.\n",
        "picture_link": "6mlcACu9PsNROn/l6YtdE23sGW8yogO"
    },
    {
        "title": "Waikiki Meatballs",
        "ingredients": [
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "2/3 cup crushed saltine cracker crumbs ADVERTISEMENT",
            "1/3 cup minced onion ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 1/2 teaspoons ground ginger ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1 (15 ounce) can pineapple chunks - drained, with juice reserved ADVERTISEMENT",
            "1/3 cup white vinegar ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1/3 cup chopped green bell pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine ground beef, cracker crumbs, onion, egg, milk, ginger and salt. Shape mixture by rounded tablespoonfuls into meatballs.\nHeat olive oil in a large skillet over medium heat. Place meatballs in skillet and cook until evenly brown, and meat is no longer pink. Drain excess fat.\nIn a small bowl, combine the cornstarch, brown sugar, reserved pineapple juice, vinegar and soy sauce. Mix until smooth, then pour into the skillet with meatballs. Cook, stirring constantly, until mixture thickens and boils, about 5 minutes. Stir in the green pepper and pineapple chunks. Heat through.\n",
        "picture_link": "C5lSF8WZ9yWGjbCFXQlDYcWpkYOy6h6"
    },
    {
        "title": "Berdean's Cube Steak",
        "ingredients": [
            "4 (4 ounce) cube steaks ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1 teaspoon beef bouillon granules ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season the cube steaks on both sides with salt and pepper. Pour the flour onto a shallow plate and press the steaks into the flour; shake off the excess flour. Heat the oil in a large skillet with lid over medium-high heat. Place the steaks into the hot oil, and cook until golden brown on both sides, about 3 minutes per side.\nPour water into the skillet to almost cover the steaks. Stir the beef bouillon and salt to taste into the water. Bring to a boil; reduce heat to medium-low, cover, and simmer until very tender, about 2 hours.\n",
        "picture_link": "4L/SDSZEEzjotZVJKpjmPzTnyqcdpKi"
    },
    {
        "title": "Salmon Patties I",
        "ingredients": [
            "1 (14.75 ounce) can canned salmon ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "1/2 cup seasoned dry bread crumbs ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Drain and reserve liquid from salmon. Mix egg, onion, bread crumbs and salmon together.\nMake into patties. If mixture is too dry to form into patties, add reserved liquid from salmon.\nIn a frying pan, heat olive oil. Place patties in pan. Brown on each side, turning gently. Drain on paper towels and serve.\n",
        "picture_link": "htHvXzs.gaw9Gv9CiFC1SiG07Z9ZjtO"
    },
    {
        "title": "Butterscotch Oatmeal",
        "ingredients": [
            "1 egg, beaten ADVERTISEMENT",
            "1 3/4 cups milk ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1 cup rolled oats ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan over medium heat, whisk together the egg, milk and brown sugar. Mix in the oats. When the oatmeal begins to boil, cook and stir until thick. Remove from the heat, and stir in butter until melted. Serve immediately.\n",
        "picture_link": "ZDNuUHNy9AhWpDd2L.Flp1IfDPsHasK"
    },
    {
        "title": "Split Pea and Ham Soup I",
        "ingredients": [
            "1 cup chopped onion ADVERTISEMENT",
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "1 pound dried split peas ADVERTISEMENT",
            "1 pound ham bone ADVERTISEMENT",
            "1 pinch salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium pot, saute onions in oil. Add the split peas, ham bone, and enough water to cover ingredients; season with salt and pepper.\nCover, and cook until there are no peas left, just a green liquid, 2 hours. While it is cooking, check to see if water has evaporated. You may need to add more water as the soup continues to cook.\nOnce the soup is a green liquid remove from heat, and let stand so it will thicken. Once thickened you may need to heat through to serve.\n",
        "picture_link": "lAwKYlNm1p/fYLFsyf4ZWgqNW0qAhUK"
    },
    {
        "title": "Pumpkin Dip",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "1 (15 ounce) can solid pack pumpkin ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1 tablespoon pumpkin pie spice ADVERTISEMENT",
            "1 teaspoon frozen orange juice concentrate ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, blend cream cheese and confectioners' sugar until smooth. Gradually mix in the pumpkin. Stir in the cinnamon, pumpkin pie spice, and orange juice until smooth and well blended. Chill until serving.\n",
        "picture_link": "AomHYtVJ/XeGSu5u756v0eIUUo2nmFu"
    },
    {
        "title": "Marrakesh Vegetable Curry",
        "ingredients": [
            "1 sweet potato, peeled and cubed ADVERTISEMENT",
            "1 medium eggplant, cubed ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "2 carrots, chopped ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "6 tablespoons olive oil ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon ground turmeric ADVERTISEMENT",
            "1 tablespoon curry powder ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "3/4 tablespoon sea salt ADVERTISEMENT",
            "3/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1 (15 ounce) can garbanzo beans, drained ADVERTISEMENT",
            "1/4 cup blanched almonds ADVERTISEMENT",
            "1 zucchini, sliced ADVERTISEMENT",
            "2 tablespoons raisins ADVERTISEMENT",
            "1 cup orange juice ADVERTISEMENT",
            "10 ounces spinach ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large Dutch oven place sweet potato, eggplant, peppers, carrots, onion, and three tablespoons oil. Saute over medium heat for 5 minutes.\nIn a medium saucepan place 3 tablespoons olive oil, garlic, turmeric, curry powder, cinnamon, salt and pepper and saute over medium heat for 3 minutes.\nPour garlic and spice mixture into the Dutch oven with vegetables in it. Add the garbanzo beans, almonds, zucchini, raisins, and orange juice. Simmer 20 minutes, covered.\nAdd spinach to pot and cook for 5 more minutes. Serve!\n",
        "picture_link": "si5qV3jJWH570F/NDgxNBrIWqhrQU1u"
    },
    {
        "title": "Sweet and Spicy Stir Fry with Chicken and Broccoli",
        "ingredients": [
            "3 cups broccoli florets ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 skinless, boneless chicken breast halves - cut into 1 inch strips ADVERTISEMENT",
            "1/4 cup sliced green onions ADVERTISEMENT",
            "4 cloves garlic, thinly sliced ADVERTISEMENT",
            "1 tablespoon hoisin sauce ADVERTISEMENT",
            "1 tablespoon chile paste ADVERTISEMENT",
            "1 tablespoon low sodium soy sauce ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/4 teaspoon crushed red pepper ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "1/8 cup chicken stock ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place broccoli in a steamer over 1 inch of boiling water, and cover. Cook until tender but still firm, about 5 minutes.\nHeat the oil in a skillet over medium heat, and saute the chicken, green onions, and garlic until the chicken is no longer pink and juices run clear.\nStir the hoisin sauce, chile paste, and soy sauce into the skillet; season with ginger, red pepper, salt, and black pepper. Stir in the chicken stock and simmer about 2 minutes. Mix in the steamed broccoli until coated with the sauce mixture.\n",
        "picture_link": "FoBUA2wAKl.pp3kS.wGPH.csAU4VcDW"
    },
    {
        "title": "Popovers",
        "ingredients": [
            "2 eggs ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C). Grease and flour six 6-ounce custard cups.\nIn a medium bowl beat eggs slightly, Beat in flour, milk and salt until just smooth; being careful not to overbeat. Fill custard cups 1/2 full.\nBake at 450 degrees F (230 degrees C) for 20 minutes. Decrease oven temperature to 350 degrees F (175 degrees C) and bake for 20 minutes more. Immediately remove from cups and serve piping hot.\n",
        "picture_link": "2mxC2WLzFexx7SojSD6FNyiVnwiVQ5a"
    },
    {
        "title": "Thai Green Curry Chicken",
        "ingredients": [
            "1 pound skinless, boneless chicken breast halves - cut into 1 inch cubes ADVERTISEMENT",
            "1 tablespoon dark soy sauce ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "2 tablespoons cooking oil ADVERTISEMENT",
            "2 tablespoons green curry paste ADVERTISEMENT",
            "2 green onions with tops, chopped ADVERTISEMENT",
            "3 cloves garlic, peeled and chopped ADVERTISEMENT",
            "1 teaspoon fresh ginger, peeled and finely chopped ADVERTISEMENT",
            "2 cups coconut milk ADVERTISEMENT",
            "1 tablespoon fish sauce ADVERTISEMENT",
            "1 tablespoon dark soy sauce ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1/2 cup cilantro leaves, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss chicken first in 1 tablespoon dark soy sauce, then in the flour, coating pieces evenly. Heat the oil in a large skillet over medium high heat. Place chicken in the skillet, cook and stir chicken until browned, about 5 minutes. Remove chicken.\nReduce heat to medium and stir in curry paste. Cook for 1 minute until fragrant, then stir in green onions, garlic, and ginger; cook an additional 2 minutes. Return chicken to the skillet, stirring to coat with the curry mixture. Stir the coconut milk, fish sauce, 1 tablespoon soy sauce, and sugar into the chicken-curry mixture. Allow to simmer over medium heat for 20 minutes until the chicken is tender. Serve garnished with cilantro leaves.\n",
        "picture_link": "TgPckg.4D7t4AjnMtaunqbMmFEf2.QC"
    },
    {
        "title": "Bacon Chicken and Dumplings",
        "ingredients": [
            "3 slices bacon ADVERTISEMENT",
            "3 large potatoes, peeled and diced ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves - diced ADVERTISEMENT",
            "3 cups chicken broth ADVERTISEMENT",
            "1 teaspoon poultry seasoning ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 (15.25 ounce) can whole kernel corn, drained and rinsed ADVERTISEMENT",
            "3 cups half-and-half ADVERTISEMENT",
            "1 1/2 cups biscuit mix ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble and set aside; reserve bacon drippings in skillet.\nAdd potatoes, onion and chicken to bacon drippings and cook for 15 minutes, stirring occasionally. Pour in chicken broth; season with poultry seasoning, salt and pepper. Stir in corn, and simmer all together for 15 minutes.\nPour in half-and-half and bring to a boil; add crumbled bacon. In a medium bowl, combine biscuit mix with milk and mix well (dough should be thick). Drop tablespoon sizes of dough into boiling mixture; reduce heat and simmer for 10 minutes uncovered, then another 10 minutes covered. (Note: Do not stir while simmering, or dumplings will break apart). Serve hot.\n",
        "picture_link": "H9W.7q2n7Cuy8N.DdkOiDAtOHqOhxPu"
    },
    {
        "title": "Lasagna Alfredo Roll Ups",
        "ingredients": [
            "8 lasagna noodles ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped spinach ADVERTISEMENT",
            "2 tablespoons thinly sliced green onion ADVERTISEMENT",
            "1 pint part-skim ricotta cheese ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "21 ounces Alfredo-style pasta sauce ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add lasagna and cook for 8 to 10 minutes or until al dente. Rinse in cold water and drain well.\nMeanwhile, in a large sauce pan over medium heat add oil and cook broccoli or spinach and green onions until tender, stirring frequently. Remove pan from heat and stir in ricotta cheese, Parmesan cheese, salt and egg.\nPreheat oven to 375 degrees F (190 degrees C).\nPlace noodles in a single layer on a sheet of waxed paper. Evenly spread some of the cheese mixture on each noodle. Roll up each noodle from the short end, jelly-roll style.\nIn a 8x12 inch baking dish, spoon about 3/4 of the Alfredo sauce on the bottom and spread evenly. Arrange the rolled noodles, seam side down, in the dish. Top with mozzarella cheese and remaining sauce. Cover loosely with foil and bake in preheated oven for 30 minutes or until hot and bubbly and the cheese is melted. Serve.\n",
        "picture_link": "wJKsr3tjZGhowKQmb../sNjKE0db1uO"
    },
    {
        "title": "Blue Cheese Crusted Filet Mignon with Port Wine Sauce",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "1/2 cup minced white onion ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon chopped fresh thyme ADVERTISEMENT",
            "3/4 cup low-sodium beef broth ADVERTISEMENT",
            "1/2 cup port wine ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "4 filet mignon steaks (1 1/2 inch thick) ADVERTISEMENT",
            "3/4 cup crumbled blue cheese ADVERTISEMENT",
            "1/4 cup panko bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a skillet over medium heat. Add the onion, garlic and thyme. Cook, stirring constantly, until onion is tender. Stir in the beef broth, scraping any onion bits from the bottom of the pan, then stir in the port wine. Bring to a boil, and cook until the mixture has reduced to about 1/2 cup. Set aside. This may also be made ahead of time, and reheated.\nPreheat the oven to 350 degrees F (175 degrees C). Heat oil in a cast-iron or other oven-safe skillet over high heat. Sear steaks quickly on both sides until brown, then place the whole pan into the oven.\nRoast steaks in the oven for about 15 minutes for medium rare - with an internal temperature of 145 degrees F (63 degrees C). You may adjust this time to allow the steaks to finish just below your desired degree of doneness if medium is not what you prefer. Remove from the oven, and place on a baking sheet. Stir together the panko crumbs and blue cheese. Top each steak with a layer of this mixture.\nPreheat the oven's broiler. Place steaks under the preheated broiler until the cheese topping is browned and bubbly. 3 to 4 minutes. Remove from the oven, and let stand for at least 15 minutes before serving. Serve with warm port wine sauce.\n",
        "picture_link": "ZjHIjyRXWqDc0WQ1H4RwH6H72GCe1Ga"
    },
    {
        "title": "Fajita Seasoning",
        "ingredients": [
            "1 tablespoon cornstarch ADVERTISEMENT",
            "2 teaspoons chili powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir cornstarch, chili powder, salt, paprika, sugar, onion powder, garlic powder, cayenne pepper, and cumin together in a small bowl.\n",
        "picture_link": "m2LeasQviFbG1f49QPQx9u3kFBA4YWW"
    },
    {
        "title": "The Best Meatballs You'll Ever Have",
        "ingredients": [
            "1 pound lean ground beef ADVERTISEMENT",
            "3/4 cup crushed seasoned croutons ADVERTISEMENT",
            "1/4 cup chopped sweet onion ADVERTISEMENT",
            "1 egg, lightly beaten ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "3 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon prepared yellow mustard ADVERTISEMENT",
            "1 teaspoon red pepper flakes ADVERTISEMENT",
            "1 teaspoon Cajun seasoning ADVERTISEMENT",
            "1 teaspoon extra virgin olive oil ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix the ground beef, croutons, sweet onion, egg, garlic, Worcestershire sauce, mustard, red pepper flakes, and Cajun seasoning. Form the mixture by hand into meatballs.\nHeat the olive oil and melt the butter in a skillet over medium heat. Place the meatballs in the skillet, and cook, turning constantly, 20 minutes, or to desired doneness.\n",
        "picture_link": "g0HWREgiaAbIvpv37rpIqPtIqV7XC6C"
    },
    {
        "title": "Oatmeal and Wheat Flour Blueberry Pancakes",
        "ingredients": [
            "1/2 cup whole wheat flour ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "2 tablespoons baking powder ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups quick cooking oats ADVERTISEMENT",
            "2 cups soy milk ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1/2 cup frozen blueberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat a lightly oiled griddle over medium heat.\nIn a large bowl, mix whole wheat flour, all-purpose flour, brown sugar, baking powder, and salt.\nIn a small bowl, mix oats and soy milk. Whisk in eggs and olive oil. Pour into the flour mixture all at once. Continue mixing until smooth. Gently fold in blueberries.\nPour batter about 1/4 cup at a time onto the prepared griddle. Cook 1 to 2 minutes, until bubbly. Flip, and continue cooking until lightly browned.\n",
        "picture_link": "O7MhHisfluCIxCeDr11Q.sL64Ap8bVu"
    },
    {
        "title": "Ciabatta Bread",
        "ingredients": [
            "1 1/2 cups water ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "3 1/4 cups bread flour ADVERTISEMENT",
            "1 1/2 teaspoons bread machine yeast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ingredients into the pan of the bread machine in the order suggested by the manufacturer. Select the Dough cycle, and Start. (See Editor's Note for stand mixer instructions.)\nDough will be quite sticky and wet once cycle is completed; resist the temptation to add more flour. Place dough on a generously floured board, cover with a large bowl or greased plastic wrap, and let rest for 15 minutes.\nLightly flour baking sheets or line them with parchment paper. Using a serrated knife, divide dough into 2 pieces, and form each into a 3x14-inch oval. Place loaves on prepared sheets and dust lightly with flour. Cover, and let rise in a draft-free place for approximately 45 minutes.\nPreheat oven to 425 degrees F (220 degrees C).\nSpritz loaves with water. Place loaves in the oven, positioned on the middle rack. Bake until golden brown, 25 to 30 minutes.\n",
        "picture_link": "fkVWF3Ah7xOQic0pdOkAuTxzUcDlSNy"
    },
    {
        "title": "Chicken and Broccoli Alfredo",
        "ingredients": [
            "1/2 (16 ounce) package linguine ADVERTISEMENT",
            "1 cup fresh or frozen broccoli flowerets ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast, cut into cubes ADVERTISEMENT",
            "1 (10.75 ounce) can Campbell's® Condensed Cream of Mushroom Soup (Regular, 98% Fat Free or 25% Less Sodium) ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook linguine according to package directions. Add broccoli for last 4 minutes of cooking time. Drain.\nHeat butter in skillet. Cook chicken until browned, stirring often.\nAdd soup, milk, cheese, black pepper and linguine mixture and heat through. Serve with additional Parmesan cheese.\n",
        "picture_link": "GL2b/7KsaZdAXW.meWq5WeF315SGvMu"
    },
    {
        "title": "Chili Seasoning Mix II",
        "ingredients": [
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "4 teaspoons chili powder ADVERTISEMENT",
            "1 tablespoon crushed red pepper ADVERTISEMENT",
            "1 tablespoon dried minced onion ADVERTISEMENT",
            "1 tablespoon dried, minced garlic ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "2 teaspoons dried parsley ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a bowl, stir together flour, chili powder, red pepper, onion, garlic, sugar, cumin, parsley, salt, basil and pepper. Store in an airtight container.\n",
        "picture_link": "vI7OAW3ItKInd1XksmdNizBDHwCGH2S"
    },
    {
        "title": "Lemon Cake with Lemon Filling and Lemon Butter Frosting",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 tablespoon grated lemon zest ADVERTISEMENT",
            "1/2 cup fresh lemon juice ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "6 tablespoons butter ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "4 egg yolks, beaten ADVERTISEMENT",
            "4 cups confectioners' sugar ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "1 teaspoon grated lemon zest ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour two 8 inch round pans. Mix together the flour, baking powder and salt. Set aside.\nIn a large bowl, cream together the butter and sugar until light and fluffy, about 5 minutes. Beat in the eggs one at a time, then stir in the vanilla. Beat in the flour mixture alternately with the milk, mixing just until incorporated.\nPour batter into prepared pans. Bake in the preheated oven for 30 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool in pans on wire racks for 10 minutes. Then invert onto wire racks to cool completely.\nTo make filling: In medium saucepan, mix together 1 tablespoon lemon zest, 1/2 cup lemon juice and 1 tablespoon cornstarch until smooth. Mix in 6 tablespoons butter and 3/4 cup sugar, and bring mixture to boil over medium heat. Boil for one minute, stirring constantly. In small bowl, with a wire whisk, beat egg yolks until smooth. Whisk in a small amount of the hot lemon mixture. Pour the egg mixture into the sauce pan, beating the hot lemon mixture rapidly. Reduce heat to low; cook, stirring constantly, 5 minutes, or until thick (not to boil).\nPour mixture into medium bowl. Press plastic wrap onto surface to keep skin from forming as it cools. Cool to room temperature. Refrigerate 3 hours.\nTo make frosting: In large bowl, beat confectioners' sugar, 1/2 cup butter, 2 tablespoons lemon juice and 1 teaspoon lemon zest until smooth. Beat in milk, and increase speed and continue to beat until light and fluffy.\nTo assemble: With long serrated knife, split each cake layer in half horizontally, making 4 layers. Place 1 layer, cut side up, on a serving plate. Spread with half of the lemon filling. Top with another layer, and spread with 1/2 cup frosting. Add third layer, and spread with remaining half of the lemon filling. Press on final cake layer, and frost top and sides of cake with remaining frosting. Refrigerate cake until serving time.\n",
        "picture_link": "iEtmP9oDNYgYveR9E/vTtK6KbEHYv9u"
    },
    {
        "title": "Easy Marinated Pork Tenderloin",
        "ingredients": [
            "1/4 cup olive oil ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "3 tablespoons dijon honey mustard ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 pounds pork tenderloin ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the olive oil, soy sauce, garlic, mustard, salt, and pepper in a bowl. Place the pork loin in a large resealable plastic bag and pour in the marinade. Marinate in the refrigerator at least 1 hour before cooking.\nPreheat an oven to 350 degrees F (175 degrees C).\nTransfer the pork loin to a baking dish; pour marinade over the pork.\nCook in the preheated oven until the pork is no longer pink in the center, 45 to 60 minutes. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C).\n",
        "picture_link": "57u8OEjn5tqv2mNqYMe2lN2inlrV2je"
    },
    {
        "title": "Special Deviled Eggs",
        "ingredients": [
            "6 eggs ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "2 tablespoons finely chopped onion ADVERTISEMENT",
            "3 tablespoons sweet pickle relish ADVERTISEMENT",
            "1 tablespoon prepared horseradish ADVERTISEMENT",
            "1 tablespoon prepared mustard ADVERTISEMENT",
            "paprika, for garnish ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place eggs in a medium saucepan and cover with cold water. Bring water to a boil and immediately remove from heat. Cover and let eggs stand in hot water for 10 to 12 minutes. Remove from hot water, cool, peel and cut lengthwise.\nRemove yolks from eggs. In a medium bowl, mash the yolks and mix together with mayonnaise, onion, sweet pickle relish, horseradish and mustard.\nWith a fork or pastry bag, fill the egg halves with the yolk mixture. Garnish with paprika, salt and pepper. Chill until serving.\n",
        "picture_link": "c4shbAZ2Qd5BToOmbCJ19c4dJQdWRS."
    },
    {
        "title": "Cilantro-Lime Dressing",
        "ingredients": [
            "1 jalapeno pepper, seeded and coarsely chopped ADVERTISEMENT",
            "1 clove garlic ADVERTISEMENT",
            "3/4 teaspoon minced fresh ginger root ADVERTISEMENT",
            "1/4 cup lime juice ADVERTISEMENT",
            "1/3 cup honey ADVERTISEMENT",
            "2 teaspoons balsamic vinegar ADVERTISEMENT",
            "1/2 teaspoon salt, or to taste ADVERTISEMENT",
            "1/4 cup packed cilantro leaves ADVERTISEMENT",
            "1/2 cup extra-virgin olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the jalapeno pepper, garlic clove, and ginger into a food processor or blender; pulse until the jalapeno and garlic are finely chopped. Pour in the lime juice, honey, balsamic vinegar, and salt, add the cilantro leaves; pulse a few times to blend. Turn the food processor or blender on, and slowly drizzle in the olive oil until incorporated into the dressing. Season to taste with salt before serving.\n",
        "picture_link": "TPGCK49Vek4eU9e1FqffiD89xCPS9V2"
    },
    {
        "title": "Healthy Turkey Loaf",
        "ingredients": [
            "1/2 pound ground turkey ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup salsa ADVERTISEMENT",
            "1/8 cup chopped red bell pepper ADVERTISEMENT",
            "1/8 cup chopped yellow bell pepper ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "1/4 cup dry bread crumbs ADVERTISEMENT",
            "lemon pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl combine the turkey, egg, salsa, red bell pepper, yellow bell pepper, onion, bread crumbs and lemon pepper. Mix well with hands until blended. Roll into a small loaf and place on a foil-lined baking sheet.\nBake in the preheated oven for 25 minutes.\n",
        "picture_link": "82IZXmrhsvs/PtyQ19yDXRrcPWAg2Sy"
    },
    {
        "title": "Apple Orchard Punch",
        "ingredients": [
            "1 (32 fluid ounce) bottle apple juice, chilled ADVERTISEMENT",
            "1 (12 fluid ounce) can frozen cranberry juice concentrate ADVERTISEMENT",
            "1 cup orange juice ADVERTISEMENT",
            "1 1/2 liters ginger ale ADVERTISEMENT",
            "1 apple ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large punch bowl, combine apple juice, cranberry juice concentrate and orange juice. Stir until dissolved, then slowly pour in the ginger ale.\nThinly slice the apple vertically, forming whole apple slices. Float apple slices on top of punch.\n",
        "picture_link": "7Z8mSHL2KcYoi0o2GdP7DdHXgrRCKEq"
    },
    {
        "title": "Microwave Peanut Brittle",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup light corn syrup ADVERTISEMENT",
            "1 cup salted peanuts ADVERTISEMENT",
            "1 teaspoon butter ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Butter a cookie sheet. Combine sugar and corn syrup in a 2 quart glass bowl and microwave on high 4 minutes. Stir in peanuts and microwave on high 3 1/2 minutes more, then stir in butter and vanilla and microwave for 1 1/2 minutes.\nStir in baking soda until light and foamy. Pour onto cookie sheet and spread thin. Cool completely and break into pieces and serve.\n",
        "picture_link": "o2zpsvjfPhvC0ujurXqwd6S9IxfZHzi"
    },
    {
        "title": "Slow Cooker Beef Vegetable Soup",
        "ingredients": [
            "1 pound cubed beef stew meat ADVERTISEMENT",
            "1 (15.25 ounce) can whole kernel corn, undrained ADVERTISEMENT",
            "1 (15 ounce) can green beans ADVERTISEMENT",
            "1 (15 ounce) can carrots with juice ADVERTISEMENT",
            "1 (15 ounce) can sliced potatoes with juice ADVERTISEMENT",
            "1 (28 ounce) can crushed tomatoes ADVERTISEMENT",
            "1 (1.25 ounce) package beef with onion soup mix ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place meat, corn, green beans, carrots, potatoes, tomatoes, soup mix, and salt and pepper to taste into the slow cooker; stir to combine.\nCook on LOW for at least 6 hours. Add water if necessary.\n",
        "picture_link": "rG8lEpUJ.wto3LTUxvF8fOu2jigpLNq"
    },
    {
        "title": "Candied Kielbasa",
        "ingredients": [
            "1 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "1/4 cup prepared horseradish ADVERTISEMENT",
            "2 pounds kielbasa sausage, sliced thin ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a slow cooker combine the sugar, ketchup and horseradish. Add the sausage, and mix well. Cook on High until it starts to boil. Reduce heat to Low, and cook until sauce thickens, about 45 minutes to 1 hour.\n",
        "picture_link": "LY11YWnwCJ6XCa3zGy8nuQy5DZygxYq"
    },
    {
        "title": "Hash Brown and Egg Casserole",
        "ingredients": [
            "1 (2 pound) package frozen hash brown potatoes, thawed ADVERTISEMENT",
            "1 pound pork sausage ADVERTISEMENT",
            "1 small onion, diced ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "1/8 teaspoon garlic powder ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "12 ounces shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 2 quart baking dish. Place the hash brown potatoes in the bottom of the baking dish.\nHeat a skillet over medium heat and cook and stir the sausage and onion until the sausage is crumbly, evenly browned, and no longer pink; drain. Meanwhile, whisk together the eggs, milk, onion powder, garlic powder, salt, and pepper, and pour over the potatoes. Layer with half the Cheddar cheese, the sausage mixture, and the remaining Cheddar cheese. Cover with aluminum foil.\nBake in the preheated oven for 1 hour. Remove cover; return casserole to the oven and bake until a knife inserted into the center comes out clean, about 10 minutes. Let stand for 5 minutes before serving.\n",
        "picture_link": "mcVgr818PdTA4Ns2UUWr4THCJGUKuTS"
    },
    {
        "title": "Chicken Enchilada Soup III",
        "ingredients": [
            "1 pound skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1/2 cup diced onion ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 quart chicken broth ADVERTISEMENT",
            "1 cup masa harina ADVERTISEMENT",
            "3 cups water, divided ADVERTISEMENT",
            "1 cup enchilada sauce ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot over medium heat, cook chicken breasts in oil until well browned on all sides. Remove and set aside.\nCook onion and garlic in remaining oil until onions are translucent. Pour in chicken broth.\nIn a bowl, whisk together masa harina and 2 cups water until well blended. Pour into pot with remaining 1 cup water, enchilada sauce, Cheddar, salt, chili powder and cumin. Bring to a boil.\nShred cooked chicken and add it to the pot. Reduce heat and simmer 30 to 40 minutes, until thickened.\n",
        "picture_link": "8Al2Ft5YG7J.PAqMGbt50.Popaeeus2"
    },
    {
        "title": "Barlow's Blackened Catfish",
        "ingredients": [
            "2 teaspoons cayenne pepper ADVERTISEMENT",
            "2 teaspoons lemon pepper ADVERTISEMENT",
            "2 teaspoons garlic powder ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "2 teaspoons pepper ADVERTISEMENT",
            "1 pound catfish fillets ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 cup Italian-style salad dressing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a medium baking dish.\nIn a shallow, medium bowl, mix cayenne pepper, lemon pepper, garlic powder, salt and pepper.\nBrush both sides of catfish fillets with butter. Rub fillets with the cayenne pepper mixture on both sides.\nHeat a large heavy skillet over medium-high heat until really hot. Add fillets, and fry approximately 2 minutes on each side, until slightly blackened.\nArrange blackened fillets in a single layer in the prepared baking dish, and coat with Italian-style salad dressing. Bake 30 to 35 minutes in the preheated oven, until fish is easily flaked with a fork.\n",
        "picture_link": "/J92otpfbKNuNxYMzG8TFXD1/InFNWa"
    },
    {
        "title": "Simple Country Ribs",
        "ingredients": [
            "2 1/2 pounds pork spareribs ADVERTISEMENT",
            "2 (18 ounce) bottles barbeque sauce ADVERTISEMENT",
            "1 onion, quartered ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place spareribs in a large stock pot with barbeque sauce, onion, salt, and pepper. Pour in enough water to cover. Bring to a low boil, and cook approximately 40 minutes.\nPreheat grill for high heat.\nLightly oil grate. Remove spareribs from the stock pot, and place on the prepared grill. Use the barbeque sauce in the saucepan to baste ribs while cooking. Grill ribs, basting and turning frequently, for 20 minutes, or until nicely browned.\n",
        "picture_link": "UB4KEvlHGuA5nDmWh6ZXl1GxlkdHD2O"
    },
    {
        "title": "Bread Pudding I",
        "ingredients": [
            "10 slices white bread, cut into cubes ADVERTISEMENT",
            "1/4 cup margarine, melted ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3 cups hot milk ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 375 degrees F(190 degrees C)\nIn a large bowl, combine bread cubes, melted margarine, raisins, and cinnamon; mix well, and transfer to a 2 quart baking dish.\nUse the same bowl to beat the eggs. Stir in sugar, vanilla, and salt until sugar is dissolved. Slowly whisk in the hot milk. Pour egg mixture over bread cubes, sprinkle with nutmeg, and set aside to soak for 5 minutes.\nBake in preheated oven for 25 to 30 minutes, or until a knife inserted into the center comes out clean.\n",
        "picture_link": "zzOh4WjsjotV97/5OV.G/HItZywdqXK"
    },
    {
        "title": "Famous Chicken Francaise",
        "ingredients": [
            "1 egg, beaten ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 pinch garlic powder ADVERTISEMENT",
            "1 pinch paprika ADVERTISEMENT",
            "6 skinless, boneless chicken breast halves ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 (14.5 ounce) can chicken broth ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "6 slices lemon, for garnish ADVERTISEMENT",
            "2 sprigs fresh parsley, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a shallow dish or bowl, mix together the egg and juice of 1/2 lemon. In another shallow dish or bowl mix together the flour, garlic powder and paprika. Dip chicken breasts in egg mixture, then flour mixture.\nHeat butter or margarine in a large skillet over medium heat. Add chicken breasts and cook until golden on each side.\nIn a medium bowl, mix together broth and juice of 1 lemon, and pour mixture over chicken in skillet. Reduce heat to medium low and let simmer for about 8 minutes. Place on serving platter, and garnish with fresh lemon slices and parsley sprigs.\n",
        "picture_link": "vvveldU5OfgD3iX7UUxHQDJVRrWNAiO"
    },
    {
        "title": "Creamy Herbed Pork Chops",
        "ingredients": [
            "4 thick-cut pork chops ADVERTISEMENT",
            "1 teaspoon Montreal steak seasoning, or to taste ADVERTISEMENT",
            "1/2 cup butter, divided ADVERTISEMENT",
            "2 1/2 tablespoons all-purpose flour, or as needed ADVERTISEMENT",
            "1 tablespoon dried basil ADVERTISEMENT",
            "1 teaspoon instant beef bouillon granules ADVERTISEMENT",
            "1 teaspoon freshly ground black pepper ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season pork chops on all sides with Montreal steak seasoning.\nMelt 2 tablespoons butter in a large skillet over medium heat. Cook chops in melted butter until browned and slightly pink in the center, about 7 to 10 minutes per side. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C). Add remaining butter to the pan as needed so that about 3 tablespoons pan drippings remain in the pan when the chops are finished cooking. Transfer pork chops to a plate and return skillet to medium-high heat.\nMix flour, basil, and beef bouillon together in a bowl. Stir black pepper into skillet with the pan drippings and cook for 1 minute. Add flour mixture and cook, stirring constantly, until browned, about 2 minutes. Pour milk into flour mixture; cook and stir constantly until mixture is thick and bubbly, 4 to 6 minutes. Pour sauce over pork chops and serve.\n",
        "picture_link": "OwsJwcfDZEJBB3sE/xZ0/Y3n9IZGGOu"
    },
    {
        "title": "Yummy Honey Mustard Dipping Sauce",
        "ingredients": [
            "1/2 cup mayonnaise ADVERTISEMENT",
            "2 tablespoons prepared yellow mustard ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "1/2 tablespoon lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the mayonnaise, yellow mustard, Dijon mustard, honey, and lemon juice together in a bowl. Cover and chill in refrigerator overnight.\n",
        "picture_link": "UE7W5Fem8DSszfifJOQGk9.h8t.VnCm"
    },
    {
        "title": "Grilled Fish Steaks",
        "ingredients": [
            "1 clove garlic, minced ADVERTISEMENT",
            "6 tablespoons olive oil ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 tablespoon fresh lemon juice ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "2 (6 ounce) fillets halibut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a stainless steel or glass bowl, combine garlic, olive oil, basil, salt, pepper, lemon juice, and parsley.\nPlace the halibut filets in a shallow glass dish or a resealable plastic bag, and pour the marinade over the fish. Cover or seal and place in the refrigerator for 1 hour, turning occasionally.\nPreheat an outdoor grill for high heat and lightly oil grate. Set grate 4 inches from the heat.\nRemove halibut filets from marinade and drain off the excess. Grill filets 5 minutes per side or until fish is done when easily flaked with a fork.\n",
        "picture_link": "1W9uOzAYNvyP2GE3mnRb6AqfIfK3U6K"
    },
    {
        "title": "Cheese and Broccoli Chicken Soup",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "11 cups water ADVERTISEMENT",
            "3 cubes chicken bouillon ADVERTISEMENT",
            "2 pounds skinless, boneless chicken breast halves - cut into bite-size pieces ADVERTISEMENT",
            "2 heads fresh broccoli, cut into florets ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 cup light cream ADVERTISEMENT",
            "3 cups shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a 5-quart pot, melt butter over medium heat. Mix in flour, stirring constantly until a thick paste forms. Remove from pot, and set aside.\nIn same pot, combine water, bouillon cubes, chicken, broccoli, salt and pepper. Bring to boil over high heat. Reduce heat to medium low, and simmer for 45 minutes.\nStir in the flour mixture a little bit at a time until soup thickens. Simmer 5 minutes. Reduce heat, and stir in cream. Mix in cheese 1 cup at a time, and stir until melted.\n",
        "picture_link": "ByYAxfuVpl5unGws/ciD2gP0sDuLfRG"
    },
    {
        "title": "Award Winning Chili",
        "ingredients": [
            "1 (14.5 ounce) can stewed tomatoes, chopped ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "1 carrot, sliced ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "1/4 cup white wine ADVERTISEMENT",
            "1 pinch crushed red pepper flakes ADVERTISEMENT",
            "1/4 cup chopped green bell pepper ADVERTISEMENT",
            "1/4 cup chopped red bell pepper ADVERTISEMENT",
            "1/3 cup bottled steak sauce ADVERTISEMENT",
            "5 slices bacon ADVERTISEMENT",
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "1 (1.25 ounce) package chili seasoning mix ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 (15 ounce) can kidney beans, drained ADVERTISEMENT",
            "1 tablespoon chopped fresh cilantro ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot over medium-low heat, combine tomatoes, tomato paste, carrot, onion, celery, wine, pepper flakes, bell peppers and steak sauce.\nWhile tomato mixture is simmering, in a large skillet over medium heat, cook bacon until crisp. Remove to paper towels. Cook beef in bacon drippings until brown; drain. Stir chili seasoning into ground beef.\nStir seasoned beef, cumin and bacon into tomato mixture. Continue to simmer until vegetables are tender and flavors are well blended.\nStir in beans, cilantro and parsley. Heat through and serve.\n",
        "picture_link": "GRZ0My.IZb5hEnxVTo7WvlX0B21M9ra"
    },
    {
        "title": "Mom's Best Pork Chops",
        "ingredients": [
            "2 eggs ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "3 (4 ounce) packets saltine crackers, crushed ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "6 thin cut pork chops ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C).\nIn a shallow bowl or pie plate, whisk eggs with garlic powder and onion powder. Place cracker crumbs on a separate plate. Heat the oil in a large skillet over medium-high heat. Dip pork chops into the egg, then press in the cracker crumbs to coat. Fry in the hot oil for 2 to 3 minutes per side, just until golden brown. Remove to a baking sheet.\nBake for 45 minutes in the preheated oven, turning once. Serve immediately.\n",
        "picture_link": "AmpyzDog4fhspbUplo/aMZ3jkhb7Jj."
    },
    {
        "title": "Divine Hard-Boiled Eggs",
        "ingredients": [
            "12 eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place eggs in a pot; pour enough water over the eggs to cover. Cover and turn stove to high; bring to a boil; turn off heat and place pot on a cool burner. Let the pot sit with the cover on for 15 minutes. Meanwhile, fill a large bowl halfway with cold water; transfer the eggs from the pot to the cold water. Replace the water with cold water as needed to keep cold until the eggs are completely cooled. Chill in refrigerator at least 2 hours before peeling.\n",
        "picture_link": "EzJyZW7DmBgpL6LrD5neee6ci8B8WSq"
    },
    {
        "title": "Cinnamon Swirl Bundt Coffee Cake",
        "ingredients": [
            "Coffee Cake: ADVERTISEMENT",
            "3/4 cup butter, room temperature ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (205 degrees C). Grease a 10-inch bundt pan.\nBeat butter and sugar with an electric mixer in a large bowl until light and fluffy. The mixture should be noticeably lighter in color. Add eggs one at a time, allowing each egg to blend into the butter mixture before adding the next. Mix in vanilla.\nCombine flour, baking soda, and baking powder. Pour flour mixture into batter alternately with the sour cream, mixing until just incorporated. Fold in walnuts, mixing just enough to evenly combine. Pour half the batter into the prepared pan.\nMix the remaining 1/4 cup of white sugar with the cinnamon.\nSprinkle cinnamon sugar over the batter in the pan. Drop remaining cake batter in heaping spoonfuls over filling, covering it as best you can.\nBake in preheated oven for 8 minutes. Lower heat to 350 degrees F (175 degrees C) and bake for an additional 40 minutes, or until a tester comes out clean.\n",
        "picture_link": "UIMzm2Z8pMG.VpHOT3KMJkWTpUqV4VS"
    },
    {
        "title": "Ground Beef Shepherd's Pie",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 cup green beans ADVERTISEMENT",
            "1 cup tomatoes, diced ADVERTISEMENT",
            "2 potatoes, cooked and mashed ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/4 cup shredded Cheddar cheese (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degree F (175 degree C). Coat a 2 quart casserole dish with cooking spray.\nHeat oil in a large skillet over medium heat. Cook onion in oil for 5 minutes, stirring frequently. Stir in the ground beef and basil, and cook and stir for 5 more minutes. Mix in the garlic, green beans, and tomatoes, and simmer for 5 minutes. Transfer beef mixture to prepared dish.\nIn a mixing bowl, mix together the mashed potatoes, egg, and water. Spread evenly over meat mixture.\nBake in a preheated oven for 15 to 20 minutes, or until potatoes start to brown on top. Sprinkle with cheese, and continue cooking for 5 minutes.\n",
        "picture_link": "AIPUCW9vGhIe2Q/nXCgHfafEke5lTky"
    },
    {
        "title": "Bacon Wrapped Pork Medallions",
        "ingredients": [
            "8 slices bacon ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 teaspoon seasoned salt ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "2 pounds pork tenderloin ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 400 degrees F (200 degrees C).\nPlace the bacon in a large, oven-safe skillet, and cook over medium-high heat, turning occasionally, until lightly browned and still flexible, 6 to 7 minutes. Drain the bacon slices on a paper towel-lined plate. Remove any excess bacon grease from the skillet. Combine garlic powder, seasoning salt, basil, and oregano in a small bowl. Set aside.\nWrap the pork tenderloin with the bacon strips securing with 1 or 2 toothpicks per strip of bacon. Slice the tenderloin between each bacon strip to create the medallions. Dip both sides of the medallions in seasoning mix. Melt butter and oil together in the same skillet over medium-high heat. Cook each medallion for 4 minutes on each side.\nPlace skillet into the preheated oven and bake until the pork is no longer pink in the center, 17 to 20 minutes. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C).\n",
        "picture_link": "5JB35I2ZJ/K.4hM5KCVd04eb/YdWE9."
    },
    {
        "title": "Pasta Lasagna",
        "ingredients": [
            "1/2 pound penne pasta ADVERTISEMENT",
            "1/2 pound lean ground beef ADVERTISEMENT",
            "1 (26 ounce) jar pasta sauce ADVERTISEMENT",
            "1 (15 ounce) container ricotta cheese ADVERTISEMENT",
            "8 ounces shredded mozzarella cheese, divided ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 2 1/2 quart baking dish.\nBring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nIn a large skillet over medium heat, cook beef until brown; drain. Stir in pasta sauce; remove from heat.\nIn a bowl, combine ricotta, 1 cup mozzarella, Parmesan and beaten egg. Stir until well combined.\nIn the prepared dish layer half the pasta, half the sauce and half the cheese mixture. Repeat. Top with remaining mozzarella.\nBake in preheated oven 34 to 40 minutes, until hot and bubbly.\n",
        "picture_link": "FO2ORUunqr9m34itQsWV.nKLwu3z1wa"
    },
    {
        "title": "Seared Ahi Tuna Steaks",
        "ingredients": [
            "2 (5 ounce) ahi tuna steaks ADVERTISEMENT",
            "1 teaspoon kosher salt ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1/2 tablespoon butter ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 teaspoon whole peppercorns ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season the tuna steaks with salt and cayenne pepper.\nMelt the butter with the olive oil in a skillet over medium-high heat. Cook the peppercorns in the mixture until they soften and pop, about 5 minutes. Gently place the seasoned tuna in the skillet and cook to desired doneness, 1 1/2 minutes per side for rare.\n",
        "picture_link": "dhr9FXGeg0ABhQYjMu3L3RAentHXT82"
    },
    {
        "title": "Chocolate Brittle Surprise",
        "ingredients": [
            "35 unsalted soda crackers ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "1 cup chopped pecans (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (180 degrees C). Cover cookie sheet with foil. Spray foil with cooking oil spray.\nPlace crackers on foil in 5 x 7 inch rows.\nMicrowave butter on high for 2 minutes. Add brown sugar and stir. Microwave on high for 2 more minutes, stirring every 30 seconds.\nPour over crackers. Bake 17 - 20 minutes (should bubble but not burn).\nSprinkle chocolate chips over hot crackers. Spread after 2 minutes (chips have softened). Sprinkle nuts on top.\nRefrigerate 1 hour. Break into pieces. Can be frozen.\n",
        "picture_link": ".aM1PIg0CLRsXuZlevoeg/lCvLl3/xy"
    },
    {
        "title": "Spaghetti Pie III",
        "ingredients": [
            "1 pound spaghetti ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "garlic powder to taste ADVERTISEMENT",
            "1/2 cup chopped green bell pepper ADVERTISEMENT",
            "1 (26 ounce) jar pasta sauce ADVERTISEMENT",
            "3/4 cup sour cream ADVERTISEMENT",
            "1/2 cup chopped green onions ADVERTISEMENT",
            "1/2 (8 ounce) package cream cheese ADVERTISEMENT",
            "1 1/2 cups shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nPreheat oven to 350 degrees F (175 degrees C).\nIn a skillet over medium heat, brown the ground beef. Drain and crumble. Put crumbled beef in skillet. Stir in salt, pepper, garlic powder, bell pepper and pasta sauce. Bring to a boil; reduce heat and simmer for 20 minutes.\nIn a small bowl combine sour cream, green onions and cream cheese and set aside. Coat a 9x13 inch baking dish with cooking spray and add the cooked spaghetti. Spread the cream cheese mixture over it, add the meat mixture and sprinkle with Cheddar Cheese.\nCover and bake for 25 minutes. Uncover and bake for 5 more minutes until the cheese is bubbly.\n",
        "picture_link": "GHQmp5OMVmwLe5UU4.0sNHi7SpLySmi"
    },
    {
        "title": "Creamy Chicken on Linguine",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "6 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 (16 ounce) package linguini pasta ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 cube chicken bouillon, crumbled ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 1/4 cups heavy cream ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "4 green onions, sliced diagonally into 1/2 inch pieces ADVERTISEMENT",
            "1 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saute pan, heat oil, butter and garlic over medium heat. Add chicken and cook until juices run clear. Remove chicken from pan let cool and slice diagonally into long strips. Reserve oil in pan.\nMeanwhile, cook pasta according to directions on package. Drain.\nReheat oil in pan, add onion and saute, stirring often, until onion is soft but still white. Add bullion cube and water; bring to a boil and simmer uncovered for approximately 10 minutes. Stir in cream, milk, green onions and Parmesan cheese.\nPlace pasta in a bowl, layer chicken slices in a decorative pattern over pasta, pour sauce over top of chicken and around pasta. Garnish with parsley or any herbs you desire. Serve immediately.\n",
        "picture_link": "VMcVbIbo68iJ86R2KIcLGIlafmt/Wr6"
    },
    {
        "title": "Easy Iced Coffee",
        "ingredients": [
            "2 teaspoons instant coffee granules ADVERTISEMENT",
            "1 teaspoon sugar ADVERTISEMENT",
            "3 tablespoons warm water ADVERTISEMENT",
            "6 fluid ounces cold milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In sealable jar, combine instant coffee, sugar and warm water. Cover the jar and shake until it is foamy. Pour into a glass full of ice. Fill the glass with milk. Adjust to taste if necessary.\n",
        "picture_link": "VPQ.FTNb3BFDZFE0bmxxj.tRtaAD.Xm"
    },
    {
        "title": "Baba Ghanoush",
        "ingredients": [
            "1 eggplant ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "1/4 cup tahini ADVERTISEMENT",
            "2 tablespoons sesame seeds ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 1/2 tablespoons olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease a baking sheet.\nPlace eggplant on baking sheet, and make holes in the skin with a fork. Roast it for 30 to 40 minutes, turning occasionally, or until soft. Remove from oven, and place into a large bowl of cold water. Remove from water, and peel skin off.\nPlace eggplant, lemon juice, tahini, sesame seeds, and garlic in an electric blender, and puree. Season with salt and pepper to taste. Transfer eggplant mixture to a medium size mixing bowl, and slowly mix in olive oil. Refrigerate for 3 hours before serving.\n",
        "picture_link": "EU9yIdrJEc7vV3s3ycUdKk15XKjic8G"
    },
    {
        "title": "Pork Marsala",
        "ingredients": [
            "1/3 cup all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon garlic salt ADVERTISEMENT",
            "3/4 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1 pound boneless pork loin chops, pounded thin ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "2 cups sliced fresh mushrooms ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1 cup Marsala wine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix flour, salt ,garlic salt, garlic powder, and oregano together in a medium bowl. Add pork chops, and toss until well coated.\nHeat butter and olive oil in a large skillet over medium heat. Place pork in skillet in a single layer, and cook, turning occasionally, until brown on both sides. Add mushrooms and minced garlic; cook and stir briefly.\nStir in wine, scraping the skillet to loosen any brown bits. Cover and simmer over medium heat until pork is tender and sauce is thickened, about 15 minutes. If sauce is too thick, adjust by stirring in a small amount of wine.\n",
        "picture_link": "MSWjLPuqFInB0DteeiswQPDT5o0/lCy"
    },
    {
        "title": "Pumpkin Black Bean Soup",
        "ingredients": [
            "3 (15 ounce) cans black beans, rinsed and drained ADVERTISEMENT",
            "1 (16 ounce) can diced tomatoes ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 1/4 cups chopped onion ADVERTISEMENT",
            "4 cloves garlic, chopped ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "4 cups beef broth ADVERTISEMENT",
            "1 (15 ounce) can pumpkin puree ADVERTISEMENT",
            "1/2 pound cubed cooked ham ADVERTISEMENT",
            "3 tablespoons sherry vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour 2 cans of the black beans into a food processor or blender, along with the can of tomatoes. Puree until smooth. Set aside.\nMelt butter in a soup pot over medium heat. Add the onion and garlic, and season with salt and pepper. Cook and stir until the onion is softened. Stir in the bean puree, remaining can of beans, beef broth, pumpkin puree, and sherry vinegar. Mix until well blended, then simmer for about 25 minutes, or until thick enough to coat the back of a metal spoon. Stir in the ham, and heat through before serving.\n",
        "picture_link": "8OIr9Z6ph.Y32FILTaBsO/6MdQplj6u"
    },
    {
        "title": "Goulash Supreme",
        "ingredients": [
            "1 pound lean ground beef ADVERTISEMENT",
            "1 1/2 cups macaroni ADVERTISEMENT",
            "1 quart stewed tomatoes ADVERTISEMENT",
            "2 teaspoons paprika ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "6 ounces tomato paste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In large saucepan brown ground chuck, drain.\nAdd tomatoes, onions, garlic, paprika, chili powder, macaroni and tomato paste, if desired. Add water, a tablespoon at a time, if mixture seems too dry. Simmer until macaroni is tender.\n",
        "picture_link": "vqD4hHil.IihT74ebwIjPWJKt44sTBW"
    },
    {
        "title": "Blackened Tilapia with Secret Hobo Spices",
        "ingredients": [
            "3 tablespoons paprika ADVERTISEMENT",
            "1 tablespoon onion powder ADVERTISEMENT",
            "1 pinch garlic powder ADVERTISEMENT",
            "1 teaspoon ground white pepper ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon cayenne pepper, or to taste ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "1/2 teaspoon celery seed ADVERTISEMENT",
            "1 tablespoon kosher salt, or to taste ADVERTISEMENT",
            "1 pound tilapia fillets ADVERTISEMENT",
            "1 lemon, cut into wedges ADVERTISEMENT",
            "4 slices white bread ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl or jar with a lid, make the spice blend. Mix together the paprika, onion powder, garlic powder, white pepper, black pepper, cayenne pepper, oregano, thyme, celery seed and kosher salt. Coat the fish fillets with the spice mixture, and allow to sit at room temperature for no longer than 30 minutes.\nHeat a heavy skillet over high heat. Add oil, and heat until it is almost smoking. Place the fillets in the pan, and cook for about 3 minutes per side, or until fish is opaque and can be flaked with a fork. Remove from the pan, and place onto slices of white bread. Pour pan juices over them and squeeze lemon juice all over. Do not underestimate the white bread. It gets quite tasty soaking up all the juices.\n",
        "picture_link": "Vi8b0ZcKHFj1xBWlI3XMywrcfZMb47K"
    },
    {
        "title": "Awesome Grilled Cheese Sandwiches",
        "ingredients": [
            "18 slices bread ADVERTISEMENT",
            "4 tablespoons butter ADVERTISEMENT",
            "9 slices Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nButter one side of 9 slices of bread, and place butter-side down on a baking sheet. Arrange cheese on each slice of bread. Spread butter on 9 remaining slices of bread, and place them buttered-side up on top of the cheese.\nBake in preheated oven for 6 to 8 minutes. Flip the sandwiches, and bake an additional 6 to 8 minutes, or until golden brown.\n",
        "picture_link": "06n9woodVkvZg9cxR8CacmUZfOflieO"
    },
    {
        "title": "White Peach Sangria",
        "ingredients": [
            "1 (750 milliliter) bottle dry white wine ADVERTISEMENT",
            "3/4 cup peach flavored vodka ADVERTISEMENT",
            "6 tablespoons frozen lemonade concentrate, thawed ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 pound white peaches, pitted and sliced ADVERTISEMENT",
            "3/4 cup seedless red grapes, halved ADVERTISEMENT",
            "3/4 cup seedless green grapes, halved ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pitcher, combine dry white wine, peach vodka, lemonade concentrate and sugar. Stir until sugar is dissolved. Add sliced peaches, red and green grapes.\nRefrigerate sangria until well chilled, at least 2 hours, or overnight to blend flavors. Serve over ice, and use a slotted spoon to include sliced peaches and grapes with each serving.\n",
        "picture_link": "Dbx7874hXSG52Xrn3d9fwUSit3NTcZ."
    },
    {
        "title": "Beer Lime Grilled Chicken",
        "ingredients": [
            "1 lime, juiced ADVERTISEMENT",
            "1 (12 fluid ounce) can light colored beer ADVERTISEMENT",
            "1 teaspoon honey ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "Salt and pepper ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a bowl, mix the lime juice, beer, honey, garlic, cilantro, and salt and pepper until the honey dissolves. Pour the mixture over the chicken, cover and marinate for 30 minutes.\nPreheat an outdoor grill for medium heat and lightly oil grate.\nRemove chicken from marinade and shake off excess; discard remaining marinade. Grill chicken until tender and juices run clear, about 7 minutes per side.\n",
        "picture_link": "SUfrOFJimWHHzCBIeGTdKN4g3zkWdwG"
    },
    {
        "title": "Easy Salsa Meatloaf",
        "ingredients": [
            "1 pound ground beef sirloin ADVERTISEMENT",
            "1/2 cup salsa ADVERTISEMENT",
            "1/2 cup Italian seasoned bread crumbs ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 egg, lightly beaten ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "dried parsley to taste ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, mix the ground sirloin, salsa, bread crumbs, cheese, egg, and garlic. Season with parsley, salt, and pepper. Transfer to a 5x9 inch loaf pan.\nBake 45 minutes in the preheated oven, or to a minimum internal temperature of 160 degrees F (72 degrees C).\n",
        "picture_link": "YhmHLm5Vh3.yAIz8JwJ5wKnUUy4w2XS"
    },
    {
        "title": "Slow Cooker Reuben Dip",
        "ingredients": [
            "1 (16 ounce) jar sauerkraut, drained ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "2 cups shredded Swiss cheese ADVERTISEMENT",
            "2 cups shredded cooked corned beef ADVERTISEMENT",
            "1/4 cup thousand island dressing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a slow cooker, combine the sauerkraut, cream cheese, Swiss cheese, corned beef and thousand island dressing. Cover, and cook on high for 45 minutes if you're in a hurry, low for longer if you're not, or just until hot and cheese is melted. Stir occasionally while cooking. Serve with cocktail rye or crackers.\n",
        "picture_link": "Ge7OijJyNvV6JV5BtglC3QuglTWm2gG"
    },
    {
        "title": "American Shepherd's Pie",
        "ingredients": [
            "1 pound lean ground beef ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1/2 cup chopped celery ADVERTISEMENT",
            "1 (10.5 ounce) can condensed vegetable soup ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "3 cups mashed cooked potatoes ADVERTISEMENT",
            "1 cup shredded Colby longhorn cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C) and lightly grease a 2 quart baking dish.\nIn a large skillet over medium-high heat, stir and cook ground beef, onion and celery until juices run clear. Drain. Pour mixture into baking dish with vegetable soup and thyme; stir well. Spread mashed potatoes on top.\nBake 20 minutes. Sprinkle shredded cheese on top and bake 5 minutes more, or until cheese has melted.\n",
        "picture_link": "4J5qMtR/TTGvdfN00ZuFQaRBKqlv5Bi"
    },
    {
        "title": "Quiche Lorraine I",
        "ingredients": [
            "1 recipe pastry for a 9 inch single crust pie ADVERTISEMENT",
            "12 slices bacon ADVERTISEMENT",
            "1 cup shredded Swiss cheese ADVERTISEMENT",
            "1/3 cup minced onion ADVERTISEMENT",
            "4 eggs, beaten ADVERTISEMENT",
            "2 cups light cream ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon white sugar ADVERTISEMENT",
            "1/8 teaspoon cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nPlace bacon in a large skillet, and fry over medium-high heat until crisp. Drain on paper towels, then chop coarsely. Sprinkle bacon, cheese and onion into pastry shell.\nIn a medium bowl, whisk together eggs, cream, salt, sugar and cayenne pepper. Pour mixture into pastry shell.\nBake 15 minutes in the preheated oven. Reduce heat to 300 degrees F (150 degrees C), and bake an additional 30 minutes, or until a knife inserted 1 inch from edge comes out clean. Allow quiche to sit 10 minutes before cutting into wedges.\n",
        "picture_link": "bdjxwDnMmaxoIzc/mIZSFJ0iUQUmyaa"
    },
    {
        "title": "Crunchy Oven Fried Tilapia",
        "ingredients": [
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "pepper ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "1 pound tilapia fillets ADVERTISEMENT",
            "1/4 cup dried bread crumbs ADVERTISEMENT",
            "1/4 cup cornmeal ADVERTISEMENT",
            "1/2 teaspoon dried basil, crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees Celsius).\nSift or stir flour, salt, and pepper together in a shallow dish, and set aside. In a bowl, beat egg whites until white and frothy. In another bowl, combine bread crumbs with cornmeal and basil.\nTo bread the fillets, dip first into flour, shaking off any excess, then into egg whites, then into bread crumb mixture.\nSpray a shallow baking dish with non-stick cooking spray. Lay fillets flat in the dish, tucking under any thinner ends or edges for more even cooking. Bake in the preheated oven for 10 to 15 minutes, or until fish flakes easily with a folk.\n",
        "picture_link": "oOTpXkRew3F225h6K.Wr66I6Kq5oBsC"
    },
    {
        "title": "Kitty Litter Cake",
        "ingredients": [
            "1 (18.25 ounce) package German chocolate cake mix ADVERTISEMENT",
            "1 (18.25 ounce) package white cake mix ADVERTISEMENT",
            "2 (3.5 ounce) packages instant vanilla pudding mix ADVERTISEMENT",
            "1 (12 ounce) package vanilla sandwich cookies ADVERTISEMENT",
            "3 drops green food coloring ADVERTISEMENT",
            "1 (12 ounce) package tootsie rolls ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare cake mixes and bake according to package directions (any size pan).\nPrepare pudding according to package directions and chill until ready to assemble.\nCrumble sandwich cookies in small batches in a food processor, scraping often. Set aside all but 1/4 cup. To the 1/4 cup add a few drops of green food coloring and mix.\nWhen cakes are cooled to room temperature, crumble them into a large bowl. Toss with 1/2 of the remaining cookie crumbs, and the chilled pudding. You probably won't need all of the pudding, you want the cake to be just moist, not soggy.\nLine kitty litter box with the kitty litter liner. Put cake mixture into box.\nPut half of the unwrapped tootsie rolls in a microwave safe dish and heat until softened. Shape the ends so that they are no longer blunt, and curve the tootsie rolls slightly. Bury tootsie rolls randomly in the cake and sprinkle with half of the remaining cookie crumbs. Sprinkle a small amount of the green colored cookie crumbs lightly over the top.\nHeat 3 or 4 of the tootsie rolls in the microwave until almost melted. Scrape them on top of the cake and sprinkle lightly with some of the green cookie crumbs. Heat the remaining tootsie rolls until pliable and shape as before. Spread all but one randomly over top of cake mixture. Sprinkle with any remaining cookie crumbs. Hang the remaining tootsie roll over side of litter box and sprinkle with a few green cookie crumbs. Serve with the pooper scooper for a gross Halloween dessert.\n",
        "picture_link": "bq0KvhI.0QOIe1m88No0An3jW9/qV2e"
    },
    {
        "title": "Busy Day Chicken Rice Casserole",
        "ingredients": [
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of celery soup ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 cup uncooked white rice ADVERTISEMENT",
            "1 (4.5 ounce) can mushrooms, drained ADVERTISEMENT",
            "1 pinch garlic powder ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 (1 ounce) package dry onion soup mix ADVERTISEMENT",
            "8 skinless, boneless chicken breast halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nIn a large bowl combine the mushroom soup, celery soup, water, rice, mushrooms, garlic powder and black pepper. Mix all together. Pour mixture into a 9x13 inch baking dish and spread on bottom.\nLay chicken pieces over soup mixture and sprinkle dry onion soup mix over all. Cover tightly with aluminum foil and bake in the preheated oven for 1 to 1 1/2 hours or until chicken is cooked through and no longer pink inside.\n",
        "picture_link": "a25XGgO63pii5cUhXFu/JNgZhyAk.7."
    }
]