[
    {
        "title": "Brown Bread Ice Cream",
        "ingredients": [
            "1 1/2 cups wheat and barley nugget cereal (e.g. Grape-Nuts™) ADVERTISEMENT",
            "3 cups milk ADVERTISEMENT",
            "5 eggs, beaten ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 pint half-and-half cream ADVERTISEMENT",
            "1 tablespoon maple flavored extract ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cereal in a bowl and pour in enough milk to cover (1/2 to 1 cup); set aside. In a large bowl, combine eggs, brown sugar, white sugar, condensed milk, half-and-half, maple flavor and vanilla. Stir until smooth. Place in freezer canister of ice cream maker. Stir in enough milk to reach fill line.\nFreeze according to manufacturers' directions. When ice cream begins to solidify, add cereal mixture before freezing completely.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Bacon Dumplings",
        "ingredients": [
            "2 slices bacon ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 1/2 tablespoons baking powder ADVERTISEMENT",
            "1 teaspoon dried parsley ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 quart vegetable broth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, reserving drippings, crumble and set aside.\nIn a large bowl sift together flour, salt and baking powder. Gently stir in parsley and pepper. In a 1 cup measuring cup, beat eggs and add enough milk to reach the 1/2 cup level. Stir the egg mixture and the bacon drippings into the flour; stir with a fork until well blended. Add more milk if dough is too dry. Stir in the crumbled bacon; mix well.\nIn a 2 quart saucepan heat broth over medium heat. Drop dough by spoonfuls into simmering broth. Cover and cook about 12 minutes, or until done.\n",
        "picture_link": "nCNcL9sBpM9CXup6lnwZmglgdc6XOEe"
    },
    {
        "title": "Broth Marinated BBQ Steak",
        "ingredients": [
            "1 (10.5 ounce) can beef broth ADVERTISEMENT",
            "1 (18 ounce) bottle barbeque sauce ADVERTISEMENT",
            "2 (8 ounce) steaks beef tenderloin ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together beef broth and barbeque sauce in a medium bowl.\nPlace beef tenderloin steaks in a medium bowl and cover with the beef broth and barbeque sauce mixture. Cover bowl and place in the refrigerator. Allow steaks to marinate a minimum of 2 hours (overnight is preferable).\nPreheat an outdoor grill for high heat and lightly oil grate.\nGrill steaks on the prepared grill for 7 to 8 minutes per side, or to desired doneness.\n",
        "picture_link": "pkZtrVJVTxi5rwEYKJy8/l3xVI/GjPW"
    },
    {
        "title": "Cranberry Chutney III",
        "ingredients": [
            "3 cups fresh cranberries ADVERTISEMENT",
            "1 cup chopped apples ADVERTISEMENT",
            "1 orange peel, chopped ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/3 cup orange liqueur ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan, mix the cranberries, apples, orange peel, sugar and water. Bring to a boil. Boil 5 minutes, or until the berries are soft. Remove from heat and stir in the liqueur. Transfer to sterile jars and refrigerate until serving.\n",
        "picture_link": "vC.6mOFvdJVF5acnkB6mNYZzRkOw.UO"
    },
    {
        "title": "Oriental Style Halibut",
        "ingredients": [
            "3/4 pound halibut ADVERTISEMENT",
            "2 strips celery, thinly sliced ADVERTISEMENT",
            "1 carrot, thinly sliced ADVERTISEMENT",
            "2/3 cup fresh orange juice ADVERTISEMENT",
            "1/4 teaspoon ground ginger ADVERTISEMENT",
            "1 (15 ounce) can pineapple tidbits, drained ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "2 tablespoons reduced-sodium soy sauce ADVERTISEMENT",
            "1 tablespoon vinegar ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Using a very sharp knife, cut the halibut into 1 inch cubes; set aside. In a medium saucepan, combine the celery, carrots, orange juice and ginger. Bring to a boil, then stir in the halibut.\nCover and cook over medium heat for 4 to 6 minutes or until the fish flakes easily when tested with a fork and is opaque all the way through. Using a slotted spoon, carefully transfer the halibut to a plate and set aside.\nMeanwhile, strain the can of pineapple tidbits; reserving 2 tablespoons of the juice. In a small bowl, combine the 2 tablespoons of pineapple juice, cornstarch, soy sauce, vinegar and honey. Stir into the vegetable mixture in the saucepan.\nCook and stir until the mixture thickens and begins to gently boil. Cook and stir for 2 minutes more.\nReturn the halibut to the pan and add the fruit. Cover and cook about 1 minute or until heated through.\n",
        "picture_link": "L6Ws6UN5c6Tj3a/l1zxO0im57aADqme"
    },
    {
        "title": "Easy Amaranth Pancakes",
        "ingredients": [
            "1 cup amaranth flour ADVERTISEMENT",
            "1/2 cup arrowroot powder ADVERTISEMENT",
            "1/2 cup ground almonds ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 1/4 cups water ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine amaranth flour, arrowroot, almonds, baking soda and cinnamon. In a separate bowl, combine water, lemon juice, oil and honey; mix well. Stir liquids into flour mixture; mix well.\nHeat a lightly oiled griddle or frying pan over medium high heat. Drop the batter by spoonfuls onto the griddle, using approximately 2 tablespoons for each pancake. Brown on both sides and serve hot.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Mango Walnut Salad",
        "ingredients": [
            "3 small mangoes, peeled and cubed ADVERTISEMENT",
            "6 red lettuce leaves, rinsed, dried, and torn ADVERTISEMENT",
            "1/2 cup walnut pieces ADVERTISEMENT",
            "1/2 cup dried cranberries ADVERTISEMENT",
            "1/2 red bell pepper, seeded and thinly sliced ADVERTISEMENT",
            "1/2 green bell pepper, seeded and thinly sliced ADVERTISEMENT",
            "1 carrot, peeled and sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, gently toss together the mangoes, lettuce, walnuts, cranberries, red and green peppers, and carrot. Serve immediately.\n",
        "picture_link": "PO4KUJ2pBtXy6emdBq6AU6cRFWuAN9a"
    },
    {
        "title": "Oat Bran Health Bread",
        "ingredients": [
            "1 1/2 cups water ADVERTISEMENT",
            "2 1/2 teaspoons active dry yeast ADVERTISEMENT",
            "2 tablespoons canola oil ADVERTISEMENT",
            "3 tablespoons honey ADVERTISEMENT",
            "1 1/2 cups oat bran ADVERTISEMENT",
            "1 1/2 cups whole wheat flour ADVERTISEMENT",
            "1 1/3 cups bread flour ADVERTISEMENT",
            "1/2 cup flax seed meal ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Add water, yeast, canola oil and honey to the pan of the bread machine; stir to dissolve yeast. Let stand until creamy, about 10 minutes.\nIn a large bowl, stir together oat bran, whole wheat flour, bread flour, flax seed meal and salt. Pour this mixture into the pan of the bread machine. Select Whole Wheat cycle; press Start.\nAfter the dough has risen, remove it from the bread machine and turn it out onto a lightly floured surface. Form into a loaf shape and place in a lightly greased 9x5 inch loaf pan. Let rise until doubled, about 45 minutes. Meanwhile, preheat oven to 350 degrees F (175 degrees C).\nBake at 375 degrees F (190 degrees C) for about 30 minutes or until the top is golden brown and the bottom of the loaf sounds hollow when tapped.\n",
        "picture_link": "4s.K6yNlx78ME9wbvyas1FQ3JqzMv2O"
    },
    {
        "title": "Strawberry Banana Pie",
        "ingredients": [
            "1 unbaked pie crust ADVERTISEMENT",
            "1/2 cup cold butter, cut into small pieces ADVERTISEMENT",
            "1/4 cup packed brown sugar ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1 tablespoon ground nutmeg ADVERTISEMENT",
            "2 tablespoons chopped walnuts (optional) ADVERTISEMENT",
            "1/4 cup apple juice ADVERTISEMENT",
            "3 ripe bananas, sliced ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1 cup chopped fresh strawberries ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Press the prepared pie crust into a 9 inch pie pan and set aside.\nCombine the butter, brown sugar, flour, cinnamon, nutmeg, and nuts in the bowl of a food processor. Pulse the mixture until it has the texture of oatmeal. Refrigerate this crumble topping until ready to use.\nPour the apple juice into a medium sauce pan over medium-low heat; add the sliced bananas and honey and stir until the honey melts. Mix in the chopped strawberries and white sugar. Simmer uncovered for 20 minutes. Pour the warm fruit mixture into the prepared pie crust; evenly distribute the cold crumble topping across the top of the pie.\nBake in the preheated oven until golden brown and set, about 20 minutes. Cool the pie on a wire rack for 30 minutes before serving.\n",
        "picture_link": "29f1uu9t.N.oQzygBT93Z9lam/Lct5O"
    },
    {
        "title": "Crab Newburg",
        "ingredients": [
            "1/3 cup butter ADVERTISEMENT",
            "1 pound fresh crabmeat ADVERTISEMENT",
            "1 pint sour cream, room temperature ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "2 tablespoons tomato paste ADVERTISEMENT",
            "2 tablespoons dry sherry ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a skillet over medium heat. Add crab, stir and cook for 2 minutes. Mix in sour cream, tomato paste, dry sherry, parmesan and black pepper. Cook, stirring constantly, until heated through. Do not boil.\n",
        "picture_link": "jAgT7HXCaSV3DCB3xWNBg9WW0zTsovW"
    },
    {
        "title": "Pappardelle Puttanesca",
        "ingredients": [
            "1/4 cup extra-virgin olive oil, or as needed ADVERTISEMENT",
            "2 cups sliced mushrooms ADVERTISEMENT",
            "2 tablespoons minced garlic, or to taste ADVERTISEMENT",
            "1 cup dry white wine ADVERTISEMENT",
            "1 (5 ounce) jar anchovy-stuffed green olives, drained and halved ADVERTISEMENT",
            "1/4 cup capers, drained ADVERTISEMENT",
            "2 tablespoons caper juice ADVERTISEMENT",
            "2 (14 ounce) cans crushed tomatoes ADVERTISEMENT",
            "1 pinch red pepper flakes, or to taste ADVERTISEMENT",
            "1 pound dried pappardelle pasta ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large skillet over medium-high heat. Stir in mushrooms and garlic. Cook until the mushrooms have begun to brown, about 4 minutes. Increase heat to high, and pour in wine. Bring to a boil, then stir in olives, capers, caper juice, crushed tomatoes, and pepper flakes. Return to a simmer, then reduce heat to medium-low, and cook for 20 minutes.\nMeanwhile, bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain and toss with sauce to serve.\n",
        "picture_link": "rTWiIMNgh60933wDgkM25aZcAhfI7ny"
    },
    {
        "title": "Peach Omelet",
        "ingredients": [
            "1 cup peeled, sliced peaches ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "4 slices bacon ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "1 teaspoon chopped fresh chives ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "1 pinch paprika ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix peaches with lemon juice; set aside. Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble and set aside. Reserve 1 tablespoons bacon grease in skillet.\nIn a large bowl, mix together crumbled bacon, water, eggs, chives, salt, sugar and black pepper.\nReheat bacon grease over medium high heat. When grease is hot, pour egg batter into pan. Arrange peach slices on top of egg batter. Cover and cook over medium heat for 1 minute. Uncover and cook until set. Sprinkle with paprika. Let cool slightly before serving.\n",
        "picture_link": "2Ds8fM1WpiNLwyUBDiamQXu5ydRMd/O"
    },
    {
        "title": "Quick Clam Sauce",
        "ingredients": [
            "5 tablespoons olive oil ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "4 tablespoons chopped fresh parsley ADVERTISEMENT",
            "2 (6.5 ounce) cans minced clams, with juice ADVERTISEMENT",
            "2 (16 ounce) cans crushed tomatoes ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan, lightly brown garlic in olive oil. Stir in parsley, clams with juice, crushed tomatoes, salt and pepper to taste.\nSimmer for 45 minutes. Serve over cooked pasta.\n",
        "picture_link": "tFn.6.BKbZKXHEhlDUa3HmKcKFTn3GO"
    },
    {
        "title": "Easter Leftovers Frittata",
        "ingredients": [
            "6 ounces angel hair pasta ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 large sweet onion, peeled and chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 cup frozen corn kernels, thawed ADVERTISEMENT",
            "1 cup cooked ham, diced ADVERTISEMENT",
            "8 eggs, beaten ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nHeat olive oil in a skillet or frying pan. Add onion and saute until clear. Stir in green pepper; cook until soft. Add the cooked pasta and chopped ham; toss well to combine. Pour in the eggs and season with salt and pepper.\nCook until firm on one side; flip and cook until firm on the other side. You may split the frittata with a spatula to make the flipping easier.\n",
        "picture_link": "cMRcGiEaWcLrWtWIiphR/O7hupToPVe"
    },
    {
        "title": "Cathi's Florentine Zucchini",
        "ingredients": [
            "1 pound seashell pasta ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "4 zucchini, cut into 1/2-inch slices ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2/3 cup white wine ADVERTISEMENT",
            "1/2 pound ricotta cheese ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nMeanwhile, heat oil in a medium skillet over medium heat. Saute onion and garlic until onions begin to soften. Stir in zucchini and season with salt and pepper.\nIncrease the heat to medium-high and add the wine. Allow it to reduce by half, stirring frequently. Reduce heat to medium-low and stir in ricotta and cinnamon. Heat through and season with salt and pepper. Add drained pasta to skillet and toss. Serve immediately.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Whiz Sausage Balls",
        "ingredients": [
            "1 pound fresh, ground pork sausage ADVERTISEMENT",
            "3 ounces processed cheese sauce ADVERTISEMENT",
            "2 cups biscuit baking mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nIn a bowl, mix pork sausage, cheese sauce and biscuit mix together. It's easiest to do with the hands.\nForm mixture into round, walnut size pieces and place on a cookie sheet. Bake for 15 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Savory Southwestern Crepes",
        "ingredients": [
            "1 pound ground pork sausage ADVERTISEMENT",
            "1 small onion, diced ADVERTISEMENT",
            "1 red bell peppers, seeded and diced ADVERTISEMENT",
            "2 cups fresh mushrooms, sliced ADVERTISEMENT",
            "1/4 cup cilantro, finely chopped ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "6 egg whites ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "6 egg yolks ADVERTISEMENT",
            "3/4 cup butter ADVERTISEMENT",
            "2 lemons, juiced ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 pinch paprika, for garnish ADVERTISEMENT",
            "1 (16 ounce) jar salsa ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet, cook sausage over medium heat. When sausage is half cooked through, drain off most of the fat. Add onion, red pepper, mushrooms and cilantro; cook until vegetables are tender and sausage is browned. Remove sausage and vegetables from pan, leaving a slight coating of oil.\nWhisk together 5 eggs, egg whites, 1/4 cup milk and cheese. Return skillet to medium-high heat and pour in egg mixture. Cook, stirring occasionally, until eggs are set. Remove from heat but keep warm.\nIn a double boiler, over medium heat, combine egg yolks, butter and lemon juice. Whisk continuously (watch the heat or it will curdle). Remove from burner when butter has completely melted.\nIn a mixing bowl, whisk together flour, egg and milk. Pour mixture through a fine sieve to eliminate lumps. Heat a non-stick crepe pan on medium-high heat. Spray with cooking spray and pour about 1/3 cup of batter in the pan. Rotate the pan to spread a paper thin amount of batter around the pan. Flip when it starts to bubble and cook until golden on both sides. Repeat until all batter is used.\nTo assemble: Place one crepe on a plate, spoon eggs and sausage mixture down the middle of the crepe from top to bottom (like a taco) and fold over in a half circle. Top with Hollandaise sauce and sprinkle with a little paprika. Serve with a scoop of salsa on the side.\n",
        "picture_link": "Jx.miwfPF9JvQMQ.MmwUpt.Vy1ZPBIy"
    },
    {
        "title": "Chocolate Picnic Cake",
        "ingredients": [
            "1 (5 ounce) package non-instant chocolate pudding mix ADVERTISEMENT",
            "1 (18.25 ounce) package chocolate cake mix ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "1 1/2 cups chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan.\nIn a large saucepan, prepare the pudding according to the instructions on the box. Remove from heat. Mix cake mix into the hot pudding and stir until blended.\nPour batter into prepared pan, and sprinkle with the chocolate chips and walnuts. Bake in the preheated oven for 25 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool before serving.\n",
        "picture_link": "CO.q2Wjrwi//52QTkLJOjcvqJQ6cnUi"
    },
    {
        "title": "The Best Vegetable Salad",
        "ingredients": [
            "1 cucumber, peeled and chopped ADVERTISEMENT",
            "2 fresh tomatoes, chopped ADVERTISEMENT",
            "2 green onion, minced ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "5 radishes, chopped ADVERTISEMENT",
            "1 small jicama, peeled and julienned ADVERTISEMENT",
            "5 romaine lettuce leaves, torn into bite size pieces ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 1/2 tablespoons lemon juice ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 tablespoon pomegranate juice ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon chopped fresh dill ADVERTISEMENT",
            "1 teaspoon chopped fresh basil ADVERTISEMENT",
            "1 1/2 teaspoons water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss together the cucumber, tomato, onion, pepper, radish, jicama, and lettuce in a large salad bowl. Whisk together the garlic, lemon juice, olive oil, pomegranate juice, salt, pepper, dill, basil, and water in a small bowl. Drizzle dressing over the salad just before serving.\n",
        "picture_link": "gnWkkCbJ1/kFKuDWYy4TfXK.4bvh8zK"
    },
    {
        "title": "Meringue Teasers",
        "ingredients": [
            "2 egg whites ADVERTISEMENT",
            "2/3 cup super fine sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (180 degrees C). Cover cookie sheets with foil.\nBeat egg whites in small bowl until foamy. Gradually beat in sugar until meringue forms stiff peaks. Add food coloring, if using. Add vanilla and salt. Stir in chocolate chips and nuts.\nDrop meringue by teaspoonfuls onto prepared cookie sheets. Place in preheated oven. Turn oven off. Do not open door for at least 6 hours or overnight.\n",
        "picture_link": "hxGiBKV0dHtJ/9queoXf9in3B12YEgS"
    },
    {
        "title": "Scotch Shortbread I",
        "ingredients": [
            "1 cup unsalted butter ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "1/3 cup white rice flour ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sift dry ingredients over unsalted, softened butter. Cut in butter until completely incorporated.\nKnead dough on floured surface until soft, about 2 minutes. Roll dough into 2 cylinders and cover with plastic wrap. Chill one hour.\nPreheat oven to 350 degrees F (180 degrees C).\nKnead dough to soften a bit then roll 1/4 inch thick and cut with a cookie cutter. Bake for 5 minutes on ungreased cookie sheet.\n",
        "picture_link": "Mj0DXrLJUZTnq21yggHZ9ktlm4/9a6K"
    },
    {
        "title": "Hermits II",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground allspice ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/2 cup molasses ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1/3 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn a medium sized bowl, combine the flour, baking soda, cinnamon, and allspice. In a large bowl, with an electric mixer on medium, cream the sugar and butter until light yellow and fluffy. Add the molasses, egg whites, and egg; beat well.\nUsing a wooden spoon, stir in flour mixture until flour disappears. Fold in raisins and nuts.\nDrop by tablespoons, 2 inches apart, onto lightly greased cookie sheets. Bake 8-9 minutes. Lightly sift confectioners' sugar over if you like.\n",
        "picture_link": "XO8YpBlq.SPbxldbCinaSCC8oiJA/QW"
    },
    {
        "title": "Health Balls I",
        "ingredients": [
            "3/4 cup natural peanut butter ADVERTISEMENT",
            "3/4 cup honey ADVERTISEMENT",
            "1/2 cup granola ADVERTISEMENT",
            "1/2 cup crisp rice cereal ADVERTISEMENT",
            "1/2 cup semisweet chocolate chips ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1/2 cup graham cracker crumbs ADVERTISEMENT",
            "1/2 cup shredded coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat honey and peanut butter together over low heat until creamy. Remove from heat and cool.\nMix the rest of the ingredients into the honey/peanut butter mixture, except coconut. Shape into balls. Roll in coconut and refrigerate or eat right away.\n",
        "picture_link": "0RSZlGw/itXcIXXTVzjpo.4SNpmiwP6"
    },
    {
        "title": "Bittersweet Chocolate Mousse Brownies",
        "ingredients": [
            "6 tablespoons unsalted butter ADVERTISEMENT",
            "1 (1 ounce) square unsweetened chocolate ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "1/3 cup all-purpose flour ADVERTISEMENT",
            "1/8 teaspoon baking soda ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "4 (1 ounce) squares bittersweet chocolate, chopped ADVERTISEMENT",
            "3 tablespoons strong brewed coffee ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "3/4 cup heavy whipping cream ADVERTISEMENT",
            "1/3 cup heavy whipping cream ADVERTISEMENT",
            "1 tablespoon confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line an 8 inch pan with aluminum foil. Make sure to extend the foil beyond the two opposite ends of the pan. This will help in lifting brownies out of pan. Lightly butter bottom and sides of foil-lined pan.\nCut butter into pieces and melt in a saucepan over low heat. Remove pan from heat, add 1 ounce of unsweetened chocolate. Let stand 1 minute, then stir until smooth. Let cool for 10 minutes.\nWhisk in 1/2 cup white sugar, 1 egg (make sure egg is at room temperature), and then vanilla. Using a wooden spoon, stir in flour, baking soda and salt just until smooth. Spread dough evenly into pan.\nBake 10-12 minutes until toothpick inserted in center comes out with a moist crumb. Do not overbake. Cool completely on wire rack.\nTo Make Mousse: Melt 4 ounces of bittersweet chocolate with the coffee in top of a double boiler over hot water. Stir often until smooth. Whisk in 3 egg yolks, one at a time. Remove from heat.\nIn a chilled medium bowl, beat 3/4 cup heavy cream just until soft peaks form. In another medium bowl, beat 3 egg whites just until soft peaks begin to form. Stir 1/4 of these beaten egg whites into the chocolate/coffee mixture, then carefully fold in the rest\nGently fold in the whipped cream. Spread chocolate mousse evenly over the top of the cooled brownie in the pan.\nTo Make Topping: In a chilled medium sized bowl, beat 1/3 cup heavy cream and 1 tablespoon confectioners' sugar until soft peaks form. Remove brownie from baking pan by grasping the overhanging foil. Cut into squares and transfer to serving dish. Place some whipped cream on top of each brownie and top with a chocolate espresso bean. Store in refrigerator.\n",
        "picture_link": "Dq0OYWSyIDz6Ev8tejKtam.8qzzKeVO"
    },
    {
        "title": "Baby Ruth Cookies",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 1/3 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "2 mini chocolate-coated peanut and nougat candy, eg: Baby Ruth TM ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream together butter and sugar. Add eggs and vanilla. mix well. Mix dry ingredients together. Add to egg mixture. Mix well. Add chopped up Babe Ruth Candy bars.\nDrop by heaping teaspoonful on cookie sheet. Bake at 375 degrees F (190 degrees C) for 12-15 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Basic Italian Biscotti",
        "ingredients": [
            "5 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 cups sifted confectioners' sugar ADVERTISEMENT",
            "2 tablespoons baking powder ADVERTISEMENT",
            "1 cup shortening ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sift flour and measure. Resift with sugar and baking powder onto a flat surface. Cut shortening into dry ingredients until mixture resembles coarse cornmeal.\nMake a well in flour and break eggs into it. Add vanilla, and knead dough well for about 5 minutes until it is smooth, adding a little more flour if dough seems to soft and sticky.\nPinch off bits of dough about the size of an apricot, and form into desired shapes. Cookies may be baked as rings, strips, or in letters, such as S.\nPlace 1 inch apart on greased cookie sheet and bake in hot 450 degree F (230 degrees C) oven for 10 minutes, until golden brown. Watch carefully, because they burn easily.\n",
        "picture_link": "smy9t/NN48MA3rKaayG/oQW4ajXOHcC"
    },
    {
        "title": "Sugar Free Nut Macaroons",
        "ingredients": [
            "2 cups quick cooking oats ADVERTISEMENT",
            "2 tablespoons granulated artificial sweetener ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine oats, sugar, salt, vanilla and oil. Stir well.\nAdd beaten egg and chopped nuts and mix well.\nMeasure one teaspoonful and pack on the spoon. Pat out to make a round cookie or egg shape. Place on ungreased cookie sheet. Bake 15 minutes. Let cool.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Grandma Weld's Cookies",
        "ingredients": [
            "1 cup unsalted butter, softened ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons almond extract ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1 cup mini semi-sweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream the butter and the sugar together until light beat in the flour, almond extract and salt. Stir in the chocolate chips. Wrap the dough in plastic wrap and chill for at least one hour.\nPreheat the oven to 300 degrees F (150 degrees C). Shape the dough into 1 1/2 inch long crescents. Bake on ungreased cookie sheets for 15 to 20 minutes, until cooked through but not browned at all about 10 minutes. Cool cookies on racks and store in an airtight container.\n",
        "picture_link": "UrWJasgfb7bkquJpowlL18DzOSk5MBa"
    },
    {
        "title": "Mom's Garbage Cookies",
        "ingredients": [
            "1 cup packed brown sugar ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup shortening ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 cups rolled oats ADVERTISEMENT",
            "1 cup cornflakes cereal ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 cup chopped dates ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream together sugars and shortening. Add in flour, salt and baking soda. Add eggs and mix well. Stir in rest of ingredients and work dough with your hands until mixed.\nDivide dough in 1/2. Place each half on waxed paper. Form two long rolls. Refrigerate 1-2 hours.\nPreheat oven to 375 degrees F (190 degrees C).\nSlice dough 1/4 inch thick. Place on cookie sheet and bake 10 minutes.\n",
        "picture_link": "pPMg.TvnQoZMUjnOP5jfOTUeBjJd7Eu"
    },
    {
        "title": "Make Ahead Jam Thumbs",
        "ingredients": [
            "2 cups Make Ahead Cookie Mix ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1 cup any flavor fruit jam ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nCombine Make Ahead Cookie Mix with white sugar, butter, vanilla, and egg.\nShape dough into balls. Dip into an egg white. Roll dough in chopped nuts. Press deep hole into center of each ball. Fill hole with 1/4 teaspoon jam. Bake 11-16 minutes.\n",
        "picture_link": "QQPjOobC805mVyE8qYwLRGHBdINCtYK"
    },
    {
        "title": "Cinnamon Pinwheels",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut butter or margarine into flour with pastry blender. Stir in sour cream. Cover and refrigerate at least 8 hours.\nMix together 3 tablespoons sugar and the cinnamon. Divide dough into halves.\nRoll 1 half into rectangle, 20 x 7 inches, on a sugared, well-floured cloth-covered board. Sprinkle with half of the sugar-cinnamon mixture. Roll up tightly, beginning on the 7 inch side.\nRoll other half of dough into a 20 x7 inch rectangle. Sprinkle with remaining sugar-cinnamon mixture. Place loose end of roll on the 7 inch side of the rectangle; pinch edges to seal. Continue to roll up tightly; pinching edges of dough into roll to seal.\nWrap and refrigerate at least 1 hour but no longer than 48 hours.\nPreheat oven to 350 degrees F (175 degrees C).\nCut roll into 1/4 inch slices. (For easier cutting, wrap a length of thread around roll at 1/4 inch increments and pull tightly until slice is cut.) Place about 2 inches apart on ungreased cookie sheet. Mix 3 tablespoons sugar and the water; brush over cookies. Bake until golden brown, 20-25 minutes.\n",
        "picture_link": "Ftb.hGmnBYXmTr0e/lVVQWB8FDdM3f6"
    },
    {
        "title": "Selma's Best Oatmeal Cookies",
        "ingredients": [
            "1 cup shortening ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 1/2 cups quick cooking oats ADVERTISEMENT",
            "3/4 cup finely chopped walnuts ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream together shortening, white sugar, brown sugar. Then add 1 beaten egg.\nSift together flour, baking soda, and ground cinnamon and add to first mixture. Then add quick rolled oats, finely crushed walnuts or pecans and vanilla.\nCover and chill for an hour.\nPreheat oven to 350 degrees F (175 degrees C).\nPlace walnut sized pieces of dough on a greased cookie sheet. Butter the bottom of a small glass, dip in sugar and flatten out the little pieces. You need not rebutter each time. Bake for 10 minutes.\n",
        "picture_link": "fRBKI8Df./XR4/Aq6nK0pzXt8hPdYm2"
    },
    {
        "title": "Old-Fashioned Lemon Bars",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3/4 cup shortening ADVERTISEMENT",
            "1 1/2 cups packed brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3 tablespoons fresh lemon juice ADVERTISEMENT",
            "3 tablespoons lemon zest ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9 inch square baking pan.\nCombine flour, baking soda, spices and salt and set aside. In a large bowl, cream together shortening and brown sugar. Beat in the eggs one at a time.\nAdd in the lemon juice and zest. Gradually blend in the dry ingredients. Stir in raisins. Spread batter evenly in the prepared baking pan.\nBake 25-30 minutes until lightly colored on top. Cool in pan on wire rack. May be drizzled with a simple confectioners' sugar icing. Cut into large or small bars.\n",
        "picture_link": "8Jtur0HVss3FsOA9xKyoRyBs2QR4v3a"
    },
    {
        "title": "Artichoke, Mushroom and Parma Ham Tart",
        "ingredients": [
            "1 3/4 cups sifted all-purpose flour ADVERTISEMENT",
            "2 ounces grated Parmesan cheese ADVERTISEMENT",
            "2/3 cup butter, diced ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "8 ounces fresh mushrooms, sliced ADVERTISEMENT",
            "3 ounces Parma ham ADVERTISEMENT",
            "1/2 (14 ounce) can artichoke hearts, drained ADVERTISEMENT",
            "7/8 cup creme fraiche ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 teaspoon chopped flat leaf parsley ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place flour, parmesan cheese, butter, and a pinch of salt in food processor. Process briefly. Add the egg and 1 tablespoon oil through feeder tube, adding extra oil if necessary; you should be able to bring the dough together in your hands. Wrap in plastic, and chill for 1 hour.\nRoll out to fit a 9 inch quiche pan with a loose bottom. Prick all over. Chill for at least 2 hours, preferably overnight.\nLine pastry with foil, and cover bottom with uncooked beans. Bake at 375 degrees F (190 degrees C) for 15 minutes. Remove foil and beans, and cook for 5 more minutes. Remove and cool.\nSaute; mushrooms in 1 tablespoon olive oil for 10 minutes. Drain and cool.\nLay ham over the pastry base, and top with mushrooms and artichokes. Beat together creme fraiche, eggs, parsley, and milk. Season well with black pepper and salt; pour mixture over the ham and vegetables. Bake for 40 minutes, until golden. Serve warm or cold.\n",
        "picture_link": "pbmT6yPlcTk/l3Wz3z21p4rnsj3fiVS"
    },
    {
        "title": "Christmas Lizzies",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking soda ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 1/2 teaspoons ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "3 cups raisins ADVERTISEMENT",
            "1/2 cup bourbon ADVERTISEMENT",
            "4 cups pecan halves ADVERTISEMENT",
            "3 cups candied cherries ADVERTISEMENT",
            "1/3 pound diced candied lemon peel ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Soak fruits in bourbon at least 1 hour to plump.\nPreheat oven to 325 degrees F (170 degrees C). Grease cookie sheets.\nCream margarine or butter, gradually adding sugar and eggs. Add dry ingredients, then fruit and nuts. Mix well.\nDrop from teaspoon onto greased cookie sheets. Bake for 15 minutes. Store in an airtight container.\n",
        "picture_link": "tQ2Ra2r8HPWo/0MjzjWz1WIYjp2SnQ2"
    },
    {
        "title": "Afghans",
        "ingredients": [
            "1/3 cup dates, pitted and chopped ADVERTISEMENT",
            "1/2 cup boiling water ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "3/4 cup shortening ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups cornflakes cereal ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In small cup, cover chopped dates with boiling water and let soak for 10 - 15 minutes. (If necessary, add additional boiling water to cover.) Drain liquid and discard.\nCombine flour, cocoa and baking powder and set aside.\nIn a large bowl, cream shortening and sugar until light and fluffy. Stir in dates and beat in vanilla extract. Gradually blend in the dry ingredients. Fold in corn flakes.\nBreak off pieces of dough (walnut sized). Roll into balls and place 1-1/2 inches apart on ungreased cookie sheet.\nBake at 350 degrees F (175 degrees C) for 12 - 15 minutes or until firm. Cool on wire racks.\n",
        "picture_link": "RJB8YsoDsasHT4O9grb9j/QcqV0JEsu"
    },
    {
        "title": "Sweet Potato Cookies",
        "ingredients": [
            "1/4 cup milk ADVERTISEMENT",
            "2 cups sifted all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "1 cup peeled, shredded sweet potato ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine sugar and butter or margarine. Blend in egg, honey, and sweet potato.\nSift together flour, baking soda, baking powder, salt, and cinnamon. Blend in butter mixture and milk.\nDrop from a teaspoon 2 inches apart onto greased cookie sheets. Bake for 15 to 20 minutes until brown.\n",
        "picture_link": "W3HFMNRKNLdFyBGJSJXyTQk8pRucg8q"
    },
    {
        "title": "Pepparkakor I",
        "ingredients": [
            "2/3 cup packed brown sugar ADVERTISEMENT",
            "2/3 cup molasses ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "3/4 tablespoon baking soda ADVERTISEMENT",
            "2/3 cup butter ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "3 1/2 cups sifted all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place butter in a large, heatproof bowl. In a medium saucepan, heat brown sugar, molasses and spices just to boiling point. Add baking soda and stir in. Pour this mixture over the butter and stir until it melts.\nBeat egg and mix in; add flour, a cup at a time, and blend thoroughly. Turn out onto a lightly floured board and knead 1-2 minutes. Wrap in waxed paper and chill until firm (about an hour).\nPreheat oven to 325 degrees F (170 degrees C).\nRoll out to approximately 1/8 inch thickness on a lightly floured board and cut into desired shapes. Place on greased baking sheets and bake for 8 - 10 minutes.\nRemove from sheets and cool on racks; may be decorated with piped icing or whatever else you like!\n",
        "picture_link": "cN93phpTv.yRz.d7L/HnRDJXKNh7fRq"
    },
    {
        "title": "Boston Cooler",
        "ingredients": [
            "1 (12 fluid ounce) can or bottle ginger ale ADVERTISEMENT",
            "3 scoops vanilla ice cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the ginger ale and ice cream in a blender; blend until smooth.\n",
        "picture_link": "av2EgW3tsG/cCV1MD2d0ibZa4Iokiv6"
    },
    {
        "title": "Red Pepper Pesto Pasta",
        "ingredients": [
            "1 pound penne pasta ADVERTISEMENT",
            "2 bunches fresh basil leaves ADVERTISEMENT",
            "1 cup roasted red pepper ADVERTISEMENT",
            "3/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1 cup olive oil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot with lightly-salted water to a boil. Stir the penne into the water and return to a boil. Cook until the pasta is mostly tender but still firm to the bite, about 11 minutes; drain. Transfer the drained pasta to a large bowl.\nPlace the basil, red pepper, and Parmesan cheese in the bowl of a food processor; stream the olive oil into the mixture as it blends until smooth. Season with salt and pepper. Drizzle the sauce over the cooked pasta and toss to coat.\n",
        "picture_link": "edmoahS14lM2GqTkDm64k37QWrLkB0a"
    },
    {
        "title": "Rich Chocolate Cupcake",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "7 ounces dark chocolate ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon instant coffee granules ADVERTISEMENT",
            "1 cup self-rising flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Line a muffin pan with paper or foil liners.\nMelt the butter and chocolate in the top of a double boiler over barely simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching. Remove from heat and let cool.\nBlend the eggs and sugar with a mixer in a large bowl. Stir the cooled melted chocolate into the egg mixture. Add the vanilla extract and instant coffee. Sift in self-rising flour and stir until well combined. Fill muffin cups 2/3 full. Bake in the preheated oven until the tops spring back when lightly pressed, about 15 to 18 minutes.\n",
        "picture_link": "fUIyHHzLD6r03.BOZXTXv9Mp7qdhjOG"
    },
    {
        "title": "Whole Wheat Cereal Bars",
        "ingredients": [
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "1/2 cup peanut butter ADVERTISEMENT",
            "3 cups coarsely chopped shredded whole wheat cereal biscuits ADVERTISEMENT",
            "3/4 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine brown sugar, honey, and peanut butter in a microwave-safe glass or ceramic bowl. Melt the peanut butter mixture microwave in 30 second intervals, stirring after each melting, for 1 to 2 minutes (depending on your microwave). Stir in cereal and raisins.\nPress cereal mixture into an 8 inch square pan sprayed with non-stick spray. Cool and cut into bars.\n",
        "picture_link": "vbNOLbyNk4dhJGfjXYfl7eRw413xVZG"
    },
    {
        "title": "Minty Lime Freeze",
        "ingredients": [
            "2 (8 ounce) packages PHILADELPHIA Neufchatel Cheese, softened ADVERTISEMENT",
            "1/2 cup sugar, divided ADVERTISEMENT",
            "1 (3 ounce) package JELL-O Brand Lime Flavor Gelatin ADVERTISEMENT",
            "1 tablespoon lime zest ADVERTISEMENT",
            "1/4 cup fresh lime juice ADVERTISEMENT",
            "1 (8 ounce) tub COOL WHIP LITE Whipped Topping, thawed ADVERTISEMENT",
            "1 tablespoon chopped fresh mint ADVERTISEMENT",
            "1 1/2 cups finely crushed pretzels ADVERTISEMENT",
            "6 tablespoons butter or margarine, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line 9-inch round pan with plastic wrap, with ends extending over side of pan. Beat Neufchatel cheese and 1/4 cup sugar with mixer until blended. Add dry gelatin mix, zest and juice; mix well.\nWhisk in COOL WHIP and mint; pour into prepared pan. Mix pretzel crumbs, remaining sugar and butter; sprinkle over pudding mixture. Cover dessert with ends of plastic wrap; use to gently press crumb mixture into filling.\nFreeze 3 hours or until firm. Invert dessert onto serving plate; remove pan and plastic wrap. Let dessert stand at room temperature 15 min. to soften slightly before cutting to serve.\n",
        "picture_link": "u4pLFp/cUz2wzn4cuvAUp6urXY.b7eW"
    },
    {
        "title": "Christmas Eve Oyster Stew",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1 small onion, minced ADVERTISEMENT",
            "2 (8 ounce) cans oysters, liquid reserved ADVERTISEMENT",
            "4 cups milk ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1 dash garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a large pot over medium-high heat; cook the onion in the melted butter until tender, about 5 minutes. Pour the oysters with their juices into the pot and bring to a boil; cook 3 minutes. Add the milk, Worcestershire sauce, and garlic powder; stir. Allow the soup to cook until heated completely through, 5 to 10 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Easy Mango Lassi",
        "ingredients": [
            "2 cups plain whole milk yogurt ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "3 mangoes - peeled, seeded, and chopped ADVERTISEMENT",
            "4 teaspoons white sugar, or to taste ADVERTISEMENT",
            "1/8 teaspoon ground cardamom ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the yogurt, milk, mangoes, white sugar, and cardamom into the jar of a blender and blend until smooth, about 2 minutes. Chill in the refrigerator for 1 hour or until cold, and serve sprinkled with a little ground cardamom.\n",
        "picture_link": "Xn0Pd34PGz3nXi54u4z4kbXIgV1Svx6"
    },
    {
        "title": "Maple Syrup Taffy",
        "ingredients": [
            "2 cups real maple syrup ADVERTISEMENT",
            "1 gallon clean fresh snow ADVERTISEMENT",
            "15 wooden pop sticks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pack a large bowl or baking dish full of clean, fresh snow. Smooth the top of the snow flat, and place it in the freezer to stay cold while you cook the taffy.\nPour the maple syrup into a large saucepan, bring it to a boil, and cook over medium-low heat, stirring with a wooden spoon, until a candy thermometer reads between 235 and 245 F (112 to 118 C), or a small amount of syrup dropped into cold water forms a firm ball.\nPour about 2 tablespoons of syrup per piece over the snow in thin lines about 5 inches long. Let the syrup strips cool and become firm for 3 to 5 seconds. Pull the candy strips out of the snow, and then wind into a lollipop around the end of a wooden pop stick. Eat while still a little warm.\n",
        "picture_link": "c0reMhn0Q3eIzv3lw3zvkYKdrfPGhIm"
    },
    {
        "title": "Peanut Butter",
        "ingredients": [
            "2 cups roasted peanuts ADVERTISEMENT",
            "2 teaspoons peanut oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the peanuts and the peanut oil in a food processor; blend until smooth. Store unused portions in refrigerator.\n",
        "picture_link": "lmWDu0IexuS81HyLfH0fveV0Snnp5j2"
    },
    {
        "title": "Parmesan Crescent Rolls",
        "ingredients": [
            "3/4 cup butter, room temperature ADVERTISEMENT",
            "1 (16 ounce) package small curd cottage cheese ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 cup grated Parmesan cheese, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend butter, cottage cheese, and salt in a large bowl. Gently mix in flour. Dough will be sticky. Divide dough into 4 equal balls. Cover and refrigerate until chilled, at least 1 hour.\nPreheat an oven to 400 degrees F (200 degrees C). Grease a baking sheet.\nFlour a surface lightly and roll 1 ball of dough into a circle using a rolling pin. Sprinkle the circle with 1/4 cup of Parmesan cheese. Using a knife or pizza cutter, cut the circle into 8 equal pieces. Take 1 slice of dough and roll into a crescent shape, starting with the wide end and finishing with tucking the triangle tip under the roll. Place on the baking sheet. Repeat with the rest of the slices and dough balls.\nBake in the preheated oven until golden brown, 20 to 25 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "VVUe6ipUsMomh.4qvvCYKtRzmROLqve"
    },
    {
        "title": "Sweet and Spicy Pecans",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "5 cups hot water ADVERTISEMENT",
            "10 cups pecan halves ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "5 tablespoons chili powder ADVERTISEMENT",
            "1 tablespoon cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir 1 cup sugar into the hot water in a large bowl until the sugar is completely dissolved. Soak the pecans in the water for 1 hour; drain.\nPreheat an oven to 400 degrees F (200 degrees C). Line two 9x13 inch baking dishes with parchment paper.\nSift the 2/3 cup sugar, chili powder, and cayenne pepper together in a separate large bowl; add the pecans and toss to coat evenly. Spread the coated pecans in a single layer into the prepared dishes.\nBake in the preheated oven until the coating on the pecans are bubbly, stirring once, 10 to 15 minutes. Remove the pecans from the pans immediately and spread onto a counter or other flat surface covered with parchment paper to cool.\n",
        "picture_link": "MMUAA2Vs1Nbb7r.O/KEnpicNj4OzpZ."
    },
    {
        "title": "Strawberry Brown Sugar Sour Cream Pie",
        "ingredients": [
            "1 egg, lightly beaten ADVERTISEMENT",
            "3/4 cup brown sugar ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "3/4 cup sour cream ADVERTISEMENT",
            "1/4 cup whole wheat flour ADVERTISEMENT",
            "3 cups sliced strawberries ADVERTISEMENT",
            "1 unbaked 9 inch pie crust ADVERTISEMENT",
            "1/3 cup brown sugar ADVERTISEMENT",
            "1/3 cup whole wheat flour ADVERTISEMENT",
            "3 tablespoons melted butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 450 degrees F (230 degrees C).\nCombine the egg, 3/4 cup brown sugar, white sugar, sour cream, and 1/4 cup wheat flour in a bowl. Place the strawberry slices in the pie crust, and spoon the sour cream mixture over the berries.\nIn another bowl, stir together 1/3 cup brown sugar and 1/3 cup flour. Pour in the melted butter, and stir until mixture resembles course meal. Sprinkle this mixture over sour cream mixture and berries in the pie shell.\nPlace pie on lowest rack in preheated oven. Bake for 15 minutes, then reduce oven temperature to 350 degrees F (175 degrees C). Bake for 45 minutes longer. Remove from the oven, and let it cool completely (yes, overnight works best).\n",
        "picture_link": "XNmZNbO9zu6uej6pnGQEzoefFOrB1Ai"
    },
    {
        "title": "Whole Wheat and Quinoa Pancakes",
        "ingredients": [
            "1 cup frozen mixed berries (such as Europe's Best® 4-Field Berry Mix) ADVERTISEMENT",
            "2 tablespoons maple syrup ADVERTISEMENT",
            "1 cup whole wheat flour ADVERTISEMENT",
            "1/2 cup quinoa flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "2 tablespoons SPLENDA® Granular (optional) ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 cup vanilla yogurt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place frozen berries and maple syrup in a microwavable bowl, and cook on High for 2 minutes. Drain.\nIn a large bowl, stir together the whole wheat flour, quinoa flour, baking powder, and cinnamon. Stir in Splenda(R) if desired. Pour in milk and egg. Stir just until smooth.\nHeat a large skillet or griddle over medium heat. Coat with cooking spray. Drop batter by large spoonfuls onto the griddle, and cook until bubbles form and the edges are dry. Flip, and cook until browned on the other side. Repeat with remaining batter. Top pancakes with berries and vanilla yogurt to serve.\n",
        "picture_link": "EvJPwr.nzSRiVXbmHcjtilDKdank5jW"
    },
    {
        "title": "Poor Man's Crab Cakes",
        "ingredients": [
            "3 cold baked potatoes ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup chopped bell pepper ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1/2 cup diced celery ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 pound imitation crabmeat, flaked and chopped ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/4 cup chopped fresh dill ADVERTISEMENT",
            "salt to taste (optional) ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Split and mash the potatoes in a mixing bowl; set aside. The potato skins may be left on if desired.\nMelt the butter in a saucepan over medium-high heat; cook and stir the bell pepper, onion, and celery in the melted butter until they begin to soften, 5 to 7 minutes. Remove from heat and stir the milk into the mixture; pour the mixture over the mashed potatoes and stir to combine. The consistency should not be too runny. Allow the mixture to cool completely.\nPreheat an oven to 350 degrees F (175 degrees C).\nAdd the crabmeat, Cheddar cheese, and dill to the potato mixture; season with salt. Lightly mix. Pour the beaten eggs into the mixture and stir to combine. If the mixture is too thin, bread crumbs or flour can be added to make more firm. Form the mixture into 24 small patties.\nHeat the olive oil in a large skillet over medium heat; cook the patties in small batches in the skillet until completely browned and crisp, 3 to 5 minutes per side. Do not flip until bottom is fully browned and crisp; this ensures the patties will not break. Transfer to a baking dish in the oven to keep hot until all are cooked. Serve hot.\n",
        "picture_link": "VH.Wplvt6g7Q8XIQLppTEGkO0WkDZSi"
    },
    {
        "title": "Green Garlic and Ham Scrambled Eggs with Cheese",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 garlic scapes, sliced ADVERTISEMENT",
            "1/2 cup cubed cooked ham ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 cup shredded white Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a skillet over medium heat. Cook the onion, garlic scapes, and ham in the melted butter until the onion is tender, about 5 minutes.\nBeat the eggs, milk, salt, and pepper together in a small bowl; pour into the skillet and cook, stirring continually, until the eggs have nearly set, but are still slightly moist. Add about half the Cheddar cheese; cook and stir until the eggs are completely cooked, about 5 minutes. Top with the remaining Cheddar cheese to serve.\n",
        "picture_link": "loVyCK9dzICFYNEOhgkUHoDz95KFyNK"
    },
    {
        "title": "Funky Beans",
        "ingredients": [
            "1 pound dry pinto beans ADVERTISEMENT",
            "1 pound bulk pork sausage ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 (10 ounce) can diced tomatoes and green chiles, undrained ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "chili powder to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pick over and rinse the dried beans, and place them in a large saucepan of water with a lid. Bring to a boil over high heat, cover, turn off the heat, and let the beans sit for 1 hour. Drain and rinse the beans in a colander, return to the saucepan, cover with water, and simmer for 2 hours, until the beans are tender.\nMeanwhile, place the sausage, beef, onion, and green pepper in a skillet over medium heat, and cook and stir for about 10 minutes, until the3 sausage and beef are evenly brown.\nStir the meat mixture into the beans, and mix in the tomatoes with chiles, ketchup, and chili powder. Bring the mixture to a boil, reduce the heat, and simmer for about 20 minutes to thicken.\n",
        "picture_link": "Zh3kS/q08eNy2UErYjCk8oSK6Sf9Bnm"
    },
    {
        "title": "Shrimp Cognac and Baked Cheese Grits",
        "ingredients": [
            "6 cups water ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "2 cups yellow grits ADVERTISEMENT",
            "1 3/4 teaspoons salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 cup unsalted butter ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "1 (8 ounce) package shredded Cheddar cheese ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 cup whole milk ADVERTISEMENT",
            "1/4 cup clarified butter ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "1 leek, halved and cut into 1/4-inch pieces ADVERTISEMENT",
            "2 ounces fresh morel mushrooms, chopped ADVERTISEMENT",
            "3 ounces fresh oyster mushrooms, chopped ADVERTISEMENT",
            "3 ounces fresh chanterelle mushrooms, chopped ADVERTISEMENT",
            "2 tomatoes, peeled, seeded, and chopped ADVERTISEMENT",
            "1 tablespoon Creole seasoning ADVERTISEMENT",
            "1/2 cup cognac ADVERTISEMENT",
            "1/2 cup shrimp stock ADVERTISEMENT",
            "1/3 cup veal stock ADVERTISEMENT",
            "1 pound peeled and deveined gulf shrimp ADVERTISEMENT",
            "2 tablespoons chopped fresh thyme ADVERTISEMENT",
            "3 tablespoons unsalted butter ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nBring the water and 3/4 teaspoon of salt to a boil in a large pot. Whisk in the grits and return to a boil. Reduce heat to low, and cook, stirring frequently until the grits are tender and very thick, about 30 minutes. Remove from the heat, and stir in 1 3/4 teaspoons of salt and 1/2 teaspoon of pepper, 1/2 cup butter, 2 tablespoons garlic, and the Cheddar cheese until the cheese has melted. Beat the eggs in a bowl with the milk until smooth, then stir into the grits until evenly combined. Pour into the prepared baking dish.\nBake in the preheated oven until the grits are hot in the center, and the top is golden brown, about 1 hour.\nMeanwhile, melt the clarified butter in a skillet over medium heat. Stir in 2 tablespoons of garlic, and cook until golden, about 2 minutes. Add the leeks, and cook 1 minute more. Stir in the morel mushrooms, oyster mushrooms, chanterelle mushrooms, tomatoes, and Creole seasoning; cook and stir until the mushrooms begin to release their liquid, about 3 minutes. Pour in the cognac and simmer 2 minutes before pouring in the shrimp stock and veal stock. Return to a simmer, and cook until the liquid has reduced by half. Stir in the shrimp, thyme, and 3 tablespoons of butter. Cook and stir over low heat until the shrimp is no longer translucent, about 4 minutes; season to taste with salt and pepper.\nServe the shrimp and mushroom sauce alongside the baked grits.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Mother's Day Pound Cake",
        "ingredients": [
            "1 teaspoon butter ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1 1/3 cups white sugar ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 lemon, zested ADVERTISEMENT",
            "4 2/3 cups sifted all purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9 1/2-inch square baking pan with 1 teaspoon butter and set aside.\nMelt 1 cup butter in a saucepan over low heat; stir in the sugar until thoroughly combined. Stir in the vanilla. Whisk in the eggs, one by one, whisking well between each egg. Stir in the salt and lemon zest. Transfer to a large mixing bowl.\nIn a separate bowl, sift the flour and baking powder together. Gently stir the flour mixture into the egg mixture. Stir in the milk, folding the batter lightly with a spatula until thoroughly combined. Pour the batter into the prepared baking pan.\nBake in the preheated oven until a toothpick inserted near the center of the cake comes out clean, 50 to 60 minutes. Let cool in pan on a wire rack for 10 minutes; invert the cake onto a second wire rack and let cool completely.\n",
        "picture_link": "EyYb406DH5Upr1sh5cI3xgPBRxxn.VW"
    },
    {
        "title": "Greek Orange Roast Lamb",
        "ingredients": [
            "1 large orange, juiced ADVERTISEMENT",
            "3 tablespoons dark French mustard ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "4 teaspoons dried oregano ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "10 potatoes, peeled and cut into 2-inch pieces ADVERTISEMENT",
            "1 (3 pound) half leg of lamb, bone-in ADVERTISEMENT",
            "5 cloves garlic ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn large bowl, whisk together the orange juice, mustard, olive oil, oregano, salt, and pepper. Stir the potatoes into the bowl to coat with orange juice mixture. Remove potatoes with a slotted spoon, and place them into a large roasting pan.\nCut slits into the lamb meat, and stuff the garlic cloves into the slits. Rub remaining orange juice mixture from bowl all over the lamb, and place the lamb on top of the potatoes in the roasting pan. If there's any remaining orange juice mixture, pour it over the lamb.\nRoast in the preheated oven until the potatoes are tender and the lamb is cooked to medium, about 1 hour. A meat thermometer inserted into the thickest part of the meat should read 140 degrees F (60 degrees C). Check every 20 to 30 minutes while roasting, and add a bit of hot water if you find the potatoes are drying out. If the lamb finishes cooking before the potatoes, remove the lamb to a cutting board or serving platter and cover with foil while the potatoes continue to bake in the oven.\n",
        "picture_link": "7/CJ0Ubh6mWJngl933eYm3EZ8xHcqA."
    },
    {
        "title": "Akki Rotti",
        "ingredients": [
            "1/2 cup green mung beans (green gram) ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "2 cups white rice flour ADVERTISEMENT",
            "1 teaspoon cumin seeds ADVERTISEMENT",
            "2 1/2 teaspoons finely chopped green chile peppers ADVERTISEMENT",
            "1/4 teaspoon asafoetida powder ADVERTISEMENT",
            "2 tablespoons finely chopped fresh cilantro ADVERTISEMENT",
            "1/2 cup unsweetened shredded coconut ADVERTISEMENT",
            "1/4 cup shredded carrot ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1/2 cup vegetable oil, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cover the mung beans with the water and refrigerate overnight. The next day, drain the beans and reserve the soaking water.\nIn a mixing bowl, combine the mung beans, rice flour, cumin seeds, green chile, asafoetida, cilantro, coconut, shredded carrot, and salt. Gradually add the water, mixing well with your hands to form a workable dough. Use only as much water as needed (about 1/2 cup).\nShape the dough into balls about the size of a tennis ball. Set aside. Flatten one portion of dough into a thin round.\nHeat 2 tablespoons of vegetable oil in a griddle or skillet over medium heat. Place the rotti in the oil, and fry until golden brown, about 30 to 40 seconds. Flip the rotti over and fry until golden. Repeat with the remaining dough, adding 2 tablespoons of oil to the griddle for each rotti. Serve hot.\n",
        "picture_link": "pw58hVE3JA3yeQmFOxsIVhKLGX49LNS"
    },
    {
        "title": "Italian Capezzoli di Venere (Chocolate Truffles of Venus)",
        "ingredients": [
            "12 ounces high quality dark chocolate, chopped ADVERTISEMENT",
            "16 ounces canned whole chestnuts, drained ADVERTISEMENT",
            "6 tablespoons butter, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 cup brandy ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "12 ounces high quality white chocolate, chopped - divided ADVERTISEMENT",
            "1 dash powdered red food coloring ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the dark chocolate into the top part of a double boiler over simmering water, and let the chocolate melt. Turn off the heat and let the chocolate cool.\nPlace the chestnuts into the work bowl of a food processor, and process until the chestnuts are smoothly pureed, about 1 minute.\nBeat together the butter and sugar with an electric mixer until the mixture is light and fluffy, about 3 minutes. Stir in the chestnuts, brandy, and vanilla extract until the mixture is smooth. Stir in the chocolate, and pinch off about 1 tablespoon of filling per truffle. Roll the mixture into balls about 1 inch in diameter. If the mixture is too soft to hold its shape, chill for several minutes in refrigerator.\nReserve about 1 ounce of white chocolate for tempering, and about 1 ounce for coloring. Melt the remaining 10 ounces of white chocolate over simmering water in a double boiler until the chocolate is melted and warm but not hot (about 105 degrees F (40 degrees C)). Remove the pan containing the melted chocolate from the double boiler, and add about 1 ounce of chopped, unmelted white chocolate. Stir the chocolate until the unmelted pieces of chocolate melt, and the temperature drops to 80 to 82 degrees F (27 to 28 degrees C)).\nCarefully dip each center in the melted white chocolate, and gently place the truffle onto a piece of parchment paper or waxed paper to cool and harden, about 15 minutes.\nMelt the remaining 1 ounce of chopped white chocolate over simmering water in a double boiler until the chocolate is melted and warm but not hot. Stir in a very small amount of powdered red food coloring until you get a desired shade of pink. Dip a little colored chocolate out with a spoon, dot each truffle with a pink dot, and allow the pink chocolate dots to set, about 15 minutes. Place the truffles into paper candy cups to serve.\n",
        "picture_link": "k7dVqt/VmaSUKkgWFHJ/jWQg8HhKJVO"
    },
    {
        "title": "All-Natural Chicken Pot Pie",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon kosher salt ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 cup vegetable shortening (such as Crisco®), frozen and cut into 1/2-inch cubes ADVERTISEMENT",
            "1/2 cup butter, frozen and cut into 1/2-inch cubes ADVERTISEMENT",
            "6 tablespoons ice-cold water, or more as needed ADVERTISEMENT",
            "3 skinless, boneless chicken breast halves ADVERTISEMENT",
            "2 carrots, diced ADVERTISEMENT",
            "1 cup chopped celery ADVERTISEMENT",
            "3 potatoes, peeled and cut into 1/4-inch cubes ADVERTISEMENT",
            "2 cups frozen petite peas ADVERTISEMENT",
            "1/2 large onion, diced, divided ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 teaspoons chicken soup base ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon chopped fresh sage ADVERTISEMENT",
            "1/2 teaspoon chopped fresh thyme ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 365 degrees F (185 degrees C). Lightly oil a 9-inch square casserole dish.\nSift the 3 cups flour, cinnamon, and nutmeg together into a large mixing bowl. Cut the vegetable shortening and cold butter into the flour mixture with a knife or pastry blender until the mixture resembles coarse crumbs with some chunks the size of peas. Add the ice water a tablespoon at a time, tossing with a fork, until the flour mixture is moistened. Work the dough as little as possible; this is the key to a super light and flaky crust. After half the water has been incorporated, watch closely, as mixture will come together suddenly. Once it begins to stick together, gather into a ball, divide into halves, and roll each ball out to 1/4-inch thickness, adding flour as necessary to prevent sticking. Press one of the dough portions into the prepared casserole dish, covering bottom and sides completely.\nHeat a skillet over medium heat. Sear the chicken breasts in the hot skillet until evenly browned on both sides; cut into small cubes and set aside in a large mixing bowl. Reduce the heat under the skillet to medium-low. Cook the carrots, celery, potatoes, peas, and about half the diced onion in the drippings from the chicken until the carrots soften; add to the bowl with the chicken.\nIncrease the heat to medium. Add the water to the skillet and bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon; pour into a cup and set aside.\nMelt the butter in the skillet. Cook and stir the remaining onion and the garlic in the melted butter until the onions begin to brown, 5 to 8 minutes. Sprinkle the 2 tablespoons flour over the onion mixture and stir to evenly coat. Pour the reserved liquid over the onion mixture. Stir the chicken base, salt, pepper, sage, and thyme into the mixture. Cook and stir until the mixture has reduced into a thick gravy; pour over the chicken mixture in the mixing bowl. Allow the mixture to cool completely.\nPour the mixture over the crust in the casserole dish. Top with the remaining portion of dough and pinch the edges together to seal the edges. Cut a few slits into the top to vent.\nBake in the preheated oven until the crust is golden brown and the gravy bubbles through the slits, about 1 hour. Allow to cool slightly before serving, 10 to 15 minutes.\n",
        "picture_link": "Ij66KOaqySd65IGYc88mgLAp7LiZY7G"
    },
    {
        "title": "Turkey and Grape Wraps",
        "ingredients": [
            "4 cups chopped cooked turkey ADVERTISEMENT",
            "2 cups red seedless grapes, halved ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "4 (8 inch) flour tortillas ADVERTISEMENT",
            "4 large fresh spinach leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Lightly mix the turkey, grapes, Parmesan cheese, and mayonnaise in a bowl until well combined. Season to taste with salt and black pepper. Place the 4 tortillas out onto a work surface, and place 1 spinach leaf in the middle of each. Spoon 1/4 of the turkey filling into each spinach leaf, in a line. Fold up the bottom of each tortilla to hold the filling, then wrap tightly. Leave the tops open.\n",
        "picture_link": "qAEq/XbO720Y4ZIkyyqIw6GncFrDjVW"
    },
    {
        "title": "Finadene Sauce",
        "ingredients": [
            "10 Thai chile peppers, seeded and minced ADVERTISEMENT",
            "1/2 cup soy sauce ADVERTISEMENT",
            "1/2 cup white vinegar ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the Thai chiles, soy sauce, vinegar, water, garlic, and onion together in a glass jar with a tight-fitting lid. Store in the refrigerator.\n",
        "picture_link": "Jd5LhNn3KFeUjrsLtyYMB6oQuMBjc3y"
    },
    {
        "title": "Potato Crust Quiche",
        "ingredients": [
            "3 potatoes, peeled and cut into chunks ADVERTISEMENT",
            "1/4 cup butter, cut into pieces ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 (5 ounce) can evaporated milk ADVERTISEMENT",
            "1 (16 ounce) package frozen mixed vegetables, thawed ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 tablespoon dry bread crumbs ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the potatoes into a pot and cover with water. Bring to a boil, then reduce heat to medium-low, cover, and simmer until tender, about 20 minutes. Drain and allow to steam dry for a minute or two. Place the butter into the pot, and mash the potatoes and butter with a masher until smooth.\nPreheat oven to 375 degrees F (190 degrees C). Grease a 9-inch pie plate or quiche dish. Beat the eggs with evaporated milk in a bowl until well combined.\nSpoon the mashed potatoes into the prepared pie plate, smoothing the potatoes around the bottom and up the the sides of the dish with a spoon to make an even crust about 1/2-inch thick. Place the vegetables into the bottom of the crust, and sprinkle with Cheddar cheese. Pour the egg mixture over the quiche, and sprinkle with bread crumbs, salt and pepper.\nBake in the preheated oven until a knife inserted into the center of the quiche comes out clean, 40 to 50 minutes. Let the quiche stand for about 10 minutes before slicing into wedges for serving.\n",
        "picture_link": "2cH4XcUSRDn/cmpi2SVdaQD70ByzP8u"
    },
    {
        "title": "Honey and Citrus Dressing",
        "ingredients": [
            "1/4 cup sour cream ADVERTISEMENT",
            "2 tablespoons frozen (thawed) orange juice concentrate ADVERTISEMENT",
            "2 teaspoons green onion, chopped ADVERTISEMENT",
            "2 teaspoons sesame oil ADVERTISEMENT",
            "1 teaspoon honey ADVERTISEMENT",
            "1 dash salt ADVERTISEMENT",
            "1 dash ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the sour cream, orange juice concentrate, green onion, sesame oil, honey, salt, and pepper in a blender; blend until smooth, about 2 minutes.\n",
        "picture_link": "am2uhJwepGHseyCj.ejLfQqUmHwjtTq"
    },
    {
        "title": "Rumaki",
        "ingredients": [
            "1/4 cup soy sauce ADVERTISEMENT",
            "1/4 cup vinegar ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 pound chicken livers, rinsed and trimmed ADVERTISEMENT",
            "10 water chestnuts ADVERTISEMENT",
            "3 ounces pineapple chunks, drained ADVERTISEMENT",
            "5 slices bacon, cut in half crosswise ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk the soy sauce, vinegar, and sugar together in a bowl until the sugar is completely dissolved; pour into a large skillet and place over medium heat. Cook the chicken livers in the sauce until no longer pink in the center and the juices run clear, about 15 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Slice the livers into bite-sized pieces.\nPreheat an oven to 425 degrees F (220 degrees C).\nPlace one piece of liver, a water chestnut, and a pineapple chunk on a piece of bacon and secure the bacon wrap with a toothpick by inserting through all the ingredients. Place on a baking tray, and repeat until all the ingredients have been wrapped.\nBake in the preheated oven on the second rack until the bacon is crispy, about 5 minutes. Serve hot.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Skeeter's Ceviche",
        "ingredients": [
            "1 pound peeled and deveined medium shrimp (30-40 per pound) ADVERTISEMENT",
            "1 pound bay scallops ADVERTISEMENT",
            "1 bunch cilantro leaves, chopped ADVERTISEMENT",
            "3 roma (plum) tomatoes, diced ADVERTISEMENT",
            "2 stalks celery, diced ADVERTISEMENT",
            "5 green onions, sliced ADVERTISEMENT",
            "6 limes, juiced ADVERTISEMENT",
            "2 small serrano peppers, seeded and minced ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon white pepper ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the shrimp, scallops, cilantro, tomatoes, celery, green onions, lime juice, and serrano peppers in a bowl. Season with salt, white pepper, and black pepper; stir and pour into a glass or plastic container. Cover, and refrigerate 3 hours to overnight. Serve the seafood with the lime juice marinade.\n",
        "picture_link": "7cSks0bJjAvd8OjqTxzFcuhtyZFm4Ie"
    },
    {
        "title": "Thanksgiving No-Turkey Turkey",
        "ingredients": [
            "2 (1 pound) loaves multigrain bread ADVERTISEMENT",
            "2 tablespoons margarine ADVERTISEMENT",
            "2 carrots, minced ADVERTISEMENT",
            "2 large stalks celery, minced ADVERTISEMENT",
            "1 onion, minced ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "1 teaspoon crumbled dried sage ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "5 1/2 teaspoons egg replacer (dry) ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/2 cup vegetable broth ADVERTISEMENT",
            "2 (16 ounce) packages chicken-style seitan, cut horizontally into 1 inch thick strips ADVERTISEMENT",
            "1 cup garbanzo bean gravy ADVERTISEMENT",
            "1 (17.5 ounce) package frozen puff pastry, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Tear bread into 1-inch cubes and place into a large bowl. Let bread dry in the bowl, uncovered, at least 8 hours.\nMelt margarine in a large skillet over medium-high heat. Stir in carrots, celery, and onion. Cook and stir until the onion has softened and turned golden brown, about 10 minutes. Scrape onion mixture into the bowl with the dried bread; season with parsley, sage, and pepper. Whisk egg replacer, water, and vegetable broth in a small bowl until smooth. Pour over bread cubes and gently fold until evenly mixed. Let stand 30 minutes to allow bread to absorb the liquid.\nPreheat an oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil and coat with nonstick cooking spray.\nBrush seitan with gravy on both sides; arrange overlapping slices on foil in a row, mounding in the center. Press stuffing mixture around seitan to cover. Wet hands lightly and press into a neat oval. Roll pastry sheets out to 1/16-inch thickness; arrange, overlapping slightly, to make a large rectangle. Seal edges with dabs of cold water. Drape pastry over mound; trim excess away from bottom. Use scraps to cut out decorative shapes (leaves, apples, etc). Attached with dabs of cold water.\nBake until the pastry in deep golden brown, 1 to 1 1/4 hours. Cover the pastry with aluminum foil if it begins to brown too much.\n",
        "picture_link": "8WGTkVgGgkxxHY/NCANlbQAiT8Q1k/i"
    },
    {
        "title": "Greek Cowboy Hash and Eggs",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 large sweet potato, peeled and cut into 1/4-inch cubes ADVERTISEMENT",
            "1 red onion, chopped ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon chipotle chile powder ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon ground coriander ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/4 cup fresh cilantro, chopped ADVERTISEMENT",
            "1/2 cup crumbled feta cheese ADVERTISEMENT",
            "1/2 avocado, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 2 tablespoons olive oil in a skillet over medium heat. Cook the potatoes in the heated oil until they begin to soften, about 5 minutes. Add the onion and garlic; continue cooking until the onions sweat and begin to caramelize. Season with chipotle chile powder, cumin, coriander, salt, and pepper; stir. Transfer to a bowl and cover with a plate to retain the heat.\nPour 2 tablespoons olive oil into the skillet and return to medium heat. Crack the eggs into the heated oil and cook until they begin to turn opaque; flip and continue cooking until no clear white remains. (Don't overcook the eggs -- the best part of this meal is the smoothness that the yolk adds to the mix). Place the cooked eggs atop the potato mixture. Top with cilantro, feta cheese, and avocado to serve.\n",
        "picture_link": "ve3xADmCivzKQ.PPrkuLu7UpecWkemS"
    },
    {
        "title": "Beef Nilaga",
        "ingredients": [
            "4 1/2 pounds beef short ribs ADVERTISEMENT",
            "1 quart water ADVERTISEMENT",
            "1 tablespoon black peppercorns, crushed ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "2 beef bouillon cubes ADVERTISEMENT",
            "2 carrots, cut in chunks ADVERTISEMENT",
            "2 stalks celery, quartered ADVERTISEMENT",
            "1 chayote squash, peeled and quartered ADVERTISEMENT",
            "2 potatoes, quartered ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1/4 head cabbage, cut into wedges ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the beef ribs in a large pot with enough water to cover. Bring to a boil over high heat, and boil for 5 minutes. Drain; discard the cooking water (the ribs will not be fully cooked).\nReturn the beef to the pot. Pour in the 1 quart water, peppercorns, onions, and beef bouillon. Bring to a boil, cover, reduce the heat, and simmer for 1 hour.\nSkim any fat floating on the surface. Stir in the carrots, celery, chayote, and potatoes; cover, and simmer until potatoes are tender, about 20 minutes. Season with salt. Add cabbage and cook an additional 5 minutes.\n",
        "picture_link": "MKVHu.AiLGhwbAm1hr6HiekhylEi3iC"
    },
    {
        "title": "Pumpkin Joes",
        "ingredients": [
            "5 pounds ground beef ADVERTISEMENT",
            "1/2 large onion, diced ADVERTISEMENT",
            "1 tablespoon pumpkin pie spice ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "1/2 teaspoon ground dried rosemary ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 3/4 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon hot pepper sauce, or to taste ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed tomato soup ADVERTISEMENT",
            "1 1/2 (10.75 ounce) cans condensed cream of celery soup ADVERTISEMENT",
            "1 (29 ounce) can pure pumpkin ADVERTISEMENT",
            "40 hamburger buns ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Brown the ground beef with the onion in a large skillet over medium heat, breaking up the meat as it cooks, until the beef is crumbly and starting to brown, about 10 minutes.\nDrain the fat from the beef, and stir in the pumpkin pie spice, thyme, rosemary, salt, Worcestershire sauce, hot pepper sauce, tomato soup, celery soup, and pumpkin. Mix in the pumpkin, and stir until all ingredients are well combined.\nBring the mixture to a boil, reduce the heat, and simmer until the flavors have blended and the mixture is thickened, 45 minutes to 1 hour.\n",
        "picture_link": "JarEnRCNqwvOioPHxiCH2yVp15C0cHq"
    },
    {
        "title": "Bhuna Gosht",
        "ingredients": [
            "1/4 cup cooking oil ADVERTISEMENT",
            "3 pods green cardamom ADVERTISEMENT",
            "1 pod black cardamom ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "1 cinnamon stick ADVERTISEMENT",
            "6 large onions, sliced thin ADVERTISEMENT",
            "6 cloves garlic ADVERTISEMENT",
            "1 (1/2 inch) piece fresh ginger root, peeled and julienned ADVERTISEMENT",
            "2 teaspoons Kashmiri red chili powder ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "salt, to taste ADVERTISEMENT",
            "2 tomatoes, pureed ADVERTISEMENT",
            "2 pounds lamb chops, rinsed and patted dry ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "3 green chile peppers, halved lengthwise ADVERTISEMENT",
            "1/4 cup cilantro leaves, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a large skillet over medium heat. Fry the green cardamom pods, black cardamom pods, bay leaves, and cinnamon stick in the hot oil until aromatic. Stir the onions, garlic, and ginger into the mixture. Reduce heat to low and continue cooking until the onions are golden brown; season with the red chili powder, turmeric, cumin, and salt. Add the tomatoes and continue cooking until the oil separates from the gravy, about 5 minutes more.\nPlace the lamb chops into the mixture in the skillet and increase heat to medium-low. Cook and stir until the lamb is cooked about halfway through and the sauce has created a glaze on the outside of the meat, about 20 minutes. Sprinkle the water over the mixture. Cover and cook until the lamb is tender, 15 to 20 minutes more. Remove the cover and add the green chile peppers and cilantro leaves. Increase the heat to high and cook another 3 to 5 minutes. Serve hot.\n",
        "picture_link": "cHnIh2JEcpsRvVPnBedJrkNsIXC/lK6"
    },
    {
        "title": "Bacon Dijon Cheddar Dip",
        "ingredients": [
            "4 slices bacon ADVERTISEMENT",
            "8 ounces cream cheese, softened ADVERTISEMENT",
            "1 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "2 tablespoons finely chopped onion ADVERTISEMENT",
            "1 teaspoon chopped fresh parsley (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate, let cool, and crumble the bacon.\nPlace the cream cheese, Cheddar cheese, and Dijon mustard into a bowl, and mix on medium speed with an electric mixer until the ingredients are thoroughly blended. Stir in the onion and crumbled bacon, and spoon into a serving bowl. Refrigerate for 2 hours to blend the flavors, and sprinkle with parsley to serve.\n",
        "picture_link": "yEcgIjIeFbo0e2kF.1ht/NIZNQIULpu"
    },
    {
        "title": "Pork Chops O'Brien with Creamy Gravy",
        "ingredients": [
            "6 pork chops ADVERTISEMENT",
            "1/2 teaspoon seasoned salt, or to taste ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of celery soup ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1/2 teaspoon rubbed sage, or to taste ADVERTISEMENT",
            "2 (15 ounce) cans green beans, drained ADVERTISEMENT",
            "2 cups frozen O'Brien potatoes mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season the pork chops with seasoned salt on both sides. Heat a large, nonstick skillet over medium-high heat, and grease with cooking spray. Cook the pork chops until golden brown on both sides, 6 to 8 minutes. Remove from the skillet and set aside.\nStir the cream of celery soup, cream of mushroom soup, sour cream, and sage together in the skillet until combined. Stir in the green beans and O'Brien potatoes, then place the pork chops on top of the vegetables. Bring to a simmer, then reduce heat to medium-low, cover, and cook until the pork chops are no longer pink in the center, 15 to 20 minutes.\n",
        "picture_link": "tRXu2MhQdlWDt88CJ06nhFCs0E1kyL6"
    },
    {
        "title": "Becca's Tangy Baked Brie",
        "ingredients": [
            "1 teaspoon butter ADVERTISEMENT",
            "1 (8 ounce) round Brie cheese ADVERTISEMENT",
            "1 1/2 tablespoons sliced almonds ADVERTISEMENT",
            "1 tablespoon balsamic vinegar ADVERTISEMENT",
            "1 tablespoon molasses ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C).\nSpread the butter over the top of the brie and top with the almonds. Place the brie in a baking pan and bake until the top puffs up, about 25 minutes. You may need to place a square of foil over the top after 15 minutes to prevent the almonds from burning.\nCombine the balsamic vinegar and molasses. Drizzle the mixture on a serving plate and carefully place the baked brie on top of the balsamic mixture.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Blue Hawaiian",
        "ingredients": [
            "2 fluid ounces pineapple juice ADVERTISEMENT",
            "1 fluid ounce blue curacao ADVERTISEMENT",
            "1 1/2 fluid ounces coconut-flavored rum ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the pineapple juice, curacao, and rum into a cocktail shaker over ice. Cover, and shake until the outside of the shaker has frosted. Strain into a chilled martini glass to serve.\n",
        "picture_link": "2tb/w/ql9usHTsJU9O5s60PehZv4vAG"
    },
    {
        "title": "Ethiopian Spiced Cottage Cheese",
        "ingredients": [
            "1 (16 ounce) package cottage cheese ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 teaspoon ground cardamom ADVERTISEMENT",
            "1/8 teaspoon ground cloves ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/4 cup finely chopped onion ADVERTISEMENT",
            "1 tablespoon minced fresh ginger root ADVERTISEMENT",
            "1 green chile pepper, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 pounds spinach leaves, cut into 2-inch pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix cottage cheese, 1 clove of garlic, cardamom, and cloves thoroughly in a bowl. Cover and refrigerate until ready to serve.\nHeat the butter in a skillet over medium heat. Stir in the onion, ginger, green chile pepper, and 2 cloves of garlic; cook and stir until the onion has softened and turned translucent, about 5 minutes. Stir in the spinach and cook until just wilted. Drain any excess liquid, and serve the spinach mixture over the seasoned cottage cheese.\n",
        "picture_link": "zcZMeh4T6wAq2gDQoePNNGBwC8xEYaS"
    },
    {
        "title": "Cabbage Cut-Up",
        "ingredients": [
            "2 cups shredded cabbage ADVERTISEMENT",
            "1 small tomato, diced ADVERTISEMENT",
            "1/2 cup fresh orange juice ADVERTISEMENT",
            "1/4 cup fresh lime juice ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss the cabbage and tomato together in a bowl. Pour the orange juice and lime juice over the mixture. Season with salt and pepper; stir.\n",
        "picture_link": "ZMbJYXQrPPl3nk1G1ytd5CztFWse8za"
    },
    {
        "title": "Instant Chocolate Hard Shell",
        "ingredients": [
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "2/3 cup coconut oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine chocolate chips and coconut oil in a microwave-safe bowl; heat in microwave in 30-second intervals, mixing well each time, until mixture is smooth, 1 to 2 minutes. It takes about 1 minute of stirring until they fully mix together. Store at room temperature in an air-tight container.\n",
        "picture_link": "fX3YGTkG.e94dM8NpDoqhvs8RXtCaMO"
    },
    {
        "title": "Presto Pesto Hamburger Mac",
        "ingredients": [
            "1 (16 ounce) package elbow macaroni ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1/2 cup pesto ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until tender yet firm to the bite, 8 minutes. Drain.\nHeat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Stir pesto and sour cream into ground beef until warmed; add macaroni and mix well.\n",
        "picture_link": "pd5Pk9j9JpCx694P4LUDd219tYnTgru"
    },
    {
        "title": "Greek Turkey Burgers",
        "ingredients": [
            "2 pounds ground turkey ADVERTISEMENT",
            "1 1/2 cups fresh bread crumbs ADVERTISEMENT",
            "1 1/2 cups chopped baby spinach ADVERTISEMENT",
            "1/2 cup light Greek dressing ADVERTISEMENT",
            "5 ounces feta cheese, cubed ADVERTISEMENT",
            "1/4 large onion, finely chopped ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium-high heat and lightly oil the grate.\nCombine turkey, bread crumbs, spinach, Greek dressing, feta cheese, onion, egg, salt, and black pepper together in a bowl; form into patties.\nCook turkey burgers on preheated grill until no longer pink in the center and the juices run clear, 5 to 10 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "WqK.RbWTPtpDzq5FthmY8FGFOJbVila"
    },
    {
        "title": "Sauteed Patty Pan Squash",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1/2 sweet yellow onion (such as Vidalia®), thinly sliced ADVERTISEMENT",
            "4 patty pan squash, sliced to 1/2-inch-thick pieces ADVERTISEMENT",
            "3 cloves garlic, crushed, or more to taste ADVERTISEMENT",
            "1 dash lemon pepper ADVERTISEMENT",
            "1 1/2 cups packed fresh spinach (optional) ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "1 tablespoon chopped fresh basil ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "1 1/2 teaspoons grated Parmesan cheese ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil and butter in a skillet over medium-high heat until foaming, 1 to 2 minutes. Saute onion in the olive oil-butter until tender and translucent, about 3 minutes. Add squash and garlic; season with lemon pepper. Saute mixture until squash is easily pierced with a fork, 5 to 6 minutes.\nMix spinach, parsley, and basil into squash mixture; saute until spinach wilts, about 1 minute. Squeeze lemon juice over mixture and sprinkle in Parmesan cheese; stir well. Season mixture with salt and black pepper.\n",
        "picture_link": "1IeMAzCCbzdJu1Dvu03ExcDqe6Z0ltC"
    },
    {
        "title": "Zucchini Patty Pancakes",
        "ingredients": [
            "2 tablespoons olive oil, or as desired ADVERTISEMENT",
            "2 cups shredded zucchini ADVERTISEMENT",
            "2 cups finely crushed buttery round crackers (such as Ritz®) ADVERTISEMENT",
            "1 1/2 cups finely chopped yellow onion ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "1/2 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large skillet over medium-high heat.\nCombine zucchini, crackers, onion, eggs, Cheddar cheese, salt, and pepper in a bowl using a spoon or your hands until mixture is evenly combined. Form mixture into small patties.\nFry patties in the hot oil until lightly browned and heated through, 2 to 3 minutes per side.\n",
        "picture_link": "uzNXu9AH.Amp6YOfG4X50wlxRT9yRdq"
    },
    {
        "title": "Pumpkin Pie Smoothie for 2",
        "ingredients": [
            "8 ice cubes, or as desired ADVERTISEMENT",
            "1 banana ADVERTISEMENT",
            "1/4 cup yogurt ADVERTISEMENT",
            "1/4 cup pumpkin puree ADVERTISEMENT",
            "1/8 teaspoon ground cinnamon ADVERTISEMENT",
            "1 pinch ground ginger ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend ice cubes, banana, yogurt, pumpkin, cinnamon, and ginger together in a blender until smooth.\n",
        "picture_link": "Z76u1cPYT.or/MKc6piILpnaevdAsT."
    },
    {
        "title": "Pasta Carbonara II",
        "ingredients": [
            "4 tablespoons butter ADVERTISEMENT",
            "4 tablespoons olive oil ADVERTISEMENT",
            "1 pound chopped ham ADVERTISEMENT",
            "1 pound spaghetti, cooked and drained ADVERTISEMENT",
            "1/2 pound bacon, cooked and crumbled ADVERTISEMENT",
            "1/2 cup chopped fresh parsley ADVERTISEMENT",
            "4 eggs, beaten ADVERTISEMENT",
            "1 (4 ounce) jar diced pimento peppers, drained ADVERTISEMENT",
            "2/3 cup grated Parmesan cheese ADVERTISEMENT",
            "2 cloves garlic ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 (6 ounce) can black olives, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter or margarine in a large skillet.\nAdd the oil and ham and saute lightly.\nAdd the cooked spaghetti, bacon, cheese, garlic, parsley, salt and pepper. Stir well.\nTurn off the heat and pour beaten eggs over all. Toss to coat evenly, then add the olives and pimentos and toss again. Serve at once.\n",
        "picture_link": "PI4e2E1ueDSj9KpBtovPwfaGe09rk72"
    },
    {
        "title": "Kletskopjes",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1 cup sifted all-purpose flour ADVERTISEMENT",
            "1 1/2 cups packed brown sugar ADVERTISEMENT",
            "1/2 cup chopped almonds ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nMix together butter, flour, brown sugar, almonds and salt. Form the dough into marble-size balls. Place each ball on an ungreased cookie sheet 1-1/2 inches apart.\nBake cookies for 15 minutes.\n",
        "picture_link": "EarVzW99AJrKOPG66sqfzNQI8/MGopK"
    },
    {
        "title": "Hungarian Coconut Balls",
        "ingredients": [
            "1 1/4 cups mashed potatoes ADVERTISEMENT",
            "1 1/4 cups confectioners' sugar ADVERTISEMENT",
            "2 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "2 tablespoons rum flavored extract ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1 1/4 cups flaked coconut ADVERTISEMENT",
            "1 teaspoon lemon zest ADVERTISEMENT",
            "1/4 cup flaked coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put raisins together with rum extract and lemon juice to soak up the flavor.\nIn a medium bowl, stir together the mashed potatoes, confectioners sugar, and cocoa. Stir in 1 1/4 cup coconut, the raisin mixture and lemon zest.\nRoll dough into walnut sized balls. Roll the balls in remaining coconut. Refrigerate for two days. ENJOY!\n",
        "picture_link": "Bpw98MpYu00aKW/aeAHzNjASt4KALV2"
    },
    {
        "title": "Cornflake Crust",
        "ingredients": [
            "1 1/2 cups cornflakes cereal crumbs ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1/3 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix cornflakes, sugar, and butter or margarine together thoroughly. Press into an 8 or 9 inch pie plate. Chill.\n",
        "picture_link": "6s0mNLbPz5X4Tajp39dsyAbyDXE4dBO"
    },
    {
        "title": "Blueberry Grunt",
        "ingredients": [
            "2 (15 ounce) cans blueberries ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "2 teaspoons lemon zest ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour blueberries and their juice into a 10 inch iron skillet or kettle. Stir in sugar. Cook until juice begins to boil, and lower heat.\nIn medium mixing bowl, mix flour, baking powder, lemon rind, spices, and salt. Stir in milk until dry particles are just moistened. Drop dough by spoonfuls (8 dumplings) on top of simmering berry mixture, and cover skillet. Cook over medium-low heat until dough is puffed and cooked through. Serve dumplings with berry sauce and cold cream.\n",
        "picture_link": "HFj8kdyXARqXMpaUzE72V0bKgyrS1M6"
    },
    {
        "title": "Laura's Tahini Cookies",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup tahini ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "2 teaspoons honey ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a cookie sheet.\nIn a medium bowl, cream the butter and sugar. Stir in the egg, then add the tahini and honey, mixing until well blended. Sift together the flour, cinnamon, and cloves, and stir them into the creamed mixture.\nDrop dough 1 tablespoon at a time onto the prepared cookie sheet. Bake for 12 to 15 minutes in the preheated oven. Remove and cool on wire racks.\n",
        "picture_link": "DRzmb6PRkcm728retSGmwgcm.9Ys7mS"
    },
    {
        "title": "Coconut Macaroon Pie",
        "ingredients": [
            "1/2 cup chopped pecans ADVERTISEMENT",
            "1 recipe pastry for a 9 inch single crust pie ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 1/2 cups flaked coconut ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nPlace pecans in bottom of pie shell.\nCombine melted butter, coconut, salt, water, flour, sugar, and slightly beaten eggs. Pour filling over pecans in crust.\nBake for 45 minutes, or until golden brown. Cool before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Foglie Chef Doogie's D'Autunno with Chicken and Portobella Mushrooms",
        "ingredients": [
            "1 (16 ounce) package foglie d'autumn (autumn leaves) pasta ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "1/2 cup chopped green bell pepper ADVERTISEMENT",
            "1 whole boneless, skinless chicken breast, cubed ADVERTISEMENT",
            "2 portobello mushrooms, cut into 1/2 inch pieces ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1/2 teaspoon rubbed sage ADVERTISEMENT",
            "1/2 teaspoon kosher salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 cup Chardonnay wine ADVERTISEMENT",
            "1/2 cup Burgundy wine ADVERTISEMENT",
            "1 (32 ounce) jar spaghetti sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot bring 6 quarts of unsalted water to boil. Cook pasta until al dente. Drain well. Place pasta back in the pot, add one Tablespoon of olive oil and mix to prevent the leaves from sticking together. Cover and keep warm while the sauce finishes simmering.\nWarm oven-safe dinner plates in a 150 degree F(65 degree C) oven.\nMeanwhile, in a 12 inch saute pan, heat 2 tablespoons of extra virgin olive oil over medium high heat. Add the minced garlic and saute until the aromatic oils are released - about 1 minute. Add the chopped onion and bell pepper and saute 3 minutes. Add the cubed chicken breast, dried thyme, dried basil, rubbed sage, salt, and black pepper. Cook until the chicken is no longer pink. Add the Chardonnay and Burgundy wines, and pasta sauce and heat until bubbling. Add the Portobella mushroom pieces and cook until the mixture has reduced and is thick and hot.\nTo serve, place two large serving spoonfuls of Autumn Leaves on each warmed plate and top with a large ladle of the chicken and Portobella sauce.\n",
        "picture_link": "cI1uyPeoTsN.UprLoOcoLLABHZ4d34."
    },
    {
        "title": "Watermelon Cookies II",
        "ingredients": [
            "6 tablespoons butter ADVERTISEMENT",
            "1/3 cup shortening ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 tablespoon orange juice ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "6 drops red food coloring ADVERTISEMENT",
            "1/3 cup semi-sweet chocolate chips ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "1/4 cup green decorator sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, cream together the shortening, butter, and sugar with an electric mixer until fluffy. Add egg, vanilla, orange juice, and red food coloring. Mix until well blended. Sift together the flour, baking powder, and salt. Stir into butter mixture until blended. Chill dough in refrigerator for three hours.\nPreheat oven to 375 degrees F (190 degrees C).\nOn a floured surface, roll out the dough to 1/4 inch thickness. Cut with a three inch round cookie cutter. Cut cookies in half and place on an ungreased cookie sheet. Press a few chocolate chips into each cookie. Bake in preheated oven for 8 to 10 minutes. Do not brown. Remove from baking sheet and cool on a wire rack.\nIn a small shallow bowl, stir together the egg white and water. Brush the round edge of each cookie with the liquid and roll it in the green sugar. Let cookies dry on wire cooling racks.\n",
        "picture_link": "al9ADMIY6TY3F31g/vOmOzBhhbbPT62"
    },
    {
        "title": "Rigatoni",
        "ingredients": [
            "1 (8 ounce) package rigatoni pasta ADVERTISEMENT",
            "2 (15 ounce) cans cannellini beans ADVERTISEMENT",
            "4 tomatoes, chopped ADVERTISEMENT",
            "8 ounces fresh mushrooms, sliced ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "2 green onions, chopped ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "3/4 cup tomato juice ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook rigatoni in boiling water until al dente. Drain, and set aside.\nDrain and rinse cannellini beans; set aside.\nIn a large skillet, heat oil over medium heat. Saute mushrooms, garlic, and scallions with pepper and basil.\nAdd tomatoes, pasta, beans, and tomato juice to skillet. Bring skillet mixture to a boil. Reduce heat, and simmer for 15 minutes or until mixture is hot. Serve immediately. Top with grated parmesan cheese.\n",
        "picture_link": "RLNiPSQSo.gqXiCaVY0zUE4pmLqh/n6"
    },
    {
        "title": "Swedish Dream Cookies",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1 cup shortening ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 teaspoon bakers' ammonia ADVERTISEMENT",
            "1 tablespoon boiling water ADVERTISEMENT",
            "1 1/2 teaspoons almond extract ADVERTISEMENT",
            "3 cups sifted all-purpose flour ADVERTISEMENT",
            "1 cup flaked coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F ( 175 degrees C).\nIn a large bowl, cream together shortening and butter. Gradually add sugar and almond extract. Mix on high speed for 10 minutes.\nIn a small bowl, dissolve the baker's ammonia with the boiling water, adding the water a little at a time. Add this to the butter mixture.\nStir in the flour and coconut . Mix well.\nDrop cookies from a teaspoon onto a well greased cookie sheet. Bake cookies in preheated oven for 9 to 11 minutes. Cookies should be set but not brown. Let cookies cool on the cookie sheet for a few minutes before removing.\n",
        "picture_link": "CglFr3tarnJAnqkdHX1UTleVgcgGRJK"
    },
    {
        "title": "Chewy Strawberry Oatmeal Cookie Crumble",
        "ingredients": [
            "3 egg ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 tablespoons melted butter ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "8 packets strawberries and cream instant oatmeal ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C )\nIn a medium bowl, whip the eggs with an electric mixer. Gradually add two cups of sugar and salt. Mix until light and thick.\nStir in melted butter and vanilla. Then fold in packets of instant oatmeal. Finally add remaining 1/2 cup of sugar.\nSpread cookie batter to about 1/2 inch thickness on a well greased cookie sheet. Bake in preheated oven for 10 minutes or until top is browned and edges are crispy.\nWhile the cookie is still warm, break apart the large cookie into pieces.\n",
        "picture_link": "drYrSwholEVhiBjiMm6cfNp5DtHoLF2"
    },
    {
        "title": "Jo's Brownie Mix in a Jar",
        "ingredients": [
            "2 teaspoons salt ADVERTISEMENT",
            "1 1/8 cups all-purpose flour ADVERTISEMENT",
            "1/3 cup unsweetened cocoa powder ADVERTISEMENT",
            "2/3 cup packed brown sugar ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "1/2 cup semisweet chocolate chips ADVERTISEMENT",
            "1/2 cup vanilla baking chips ADVERTISEMENT",
            "1/2 cup walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the salt with the flour, then layer ingredients in a 1 quart \"wide mouth\" canning jar. Press each layer firmly in place before adding the next. NOTE: Be sure to wipe out the inside of the jar with a dry paper towel after adding the cocoa powder.\nInstructions to attach to jar: Jo's Brownie Mix in a Jar 1. Empty jar of brownie mix into a large mixing bowl. Use your hands to thoroughly blend mix. 2. Add 2/3 cup vegetable oil, 1 teaspoon vanilla extract, 3 slightly beaten eggs. 3. Mix until completely blended. 4. Spread batter into a sprayed 9x9 inch baking pan. 5. Bake at 350 degrees F (175 degrees C) for 30 minutes. Cool completely in pan. Cut into 2 inch squares. Makes 1 1/2 dozen Brownies\n",
        "picture_link": "TT4e8QCnwG7Nvcew9IqpKyvSYtOvKZa"
    },
    {
        "title": "Bacon-Egg Spaghetti",
        "ingredients": [
            "8 slices bacon ADVERTISEMENT",
            "1/2 pound fresh mushrooms, sliced ADVERTISEMENT",
            "1 pound spaghetti ADVERTISEMENT",
            "1 pound American cheese, cubed ADVERTISEMENT",
            "4 eggs, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet over medium heat, fry bacon until crisp and drain on paper towels; crumble and set aside.\nBring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain and add to cooked mushrooms.\nMeanwhile, saute mushrooms in about 1 tablespoon of bacon drippings and remove from heat.\nAdd the cheese cubes and beaten eggs; toss until the cheese is melted and the eggs have coated the noodles. Sprinkle in the crumbled bacon and stir; serve.\n",
        "picture_link": "EwsSxW1JzpBHsq50GXamCpu1Aph/p8u"
    },
    {
        "title": "Jimmy the Saint's Sausage and Pepper Sauce",
        "ingredients": [
            "4 tablespoons olive oil ADVERTISEMENT",
            "8 cloves crushed garlic ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1/2 (12 ounce) jar roasted red bell peppers ADVERTISEMENT",
            "1/2 cup chopped fresh basil ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1/8 teaspoon freshly ground white pepper ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "1 pinch dried sage ADVERTISEMENT",
            "1 pinch onion powder ADVERTISEMENT",
            "2 teaspoons dried parsley ADVERTISEMENT",
            "2 teaspoons dried oregano ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 tablespoon monosodium glutamate (MSG) ADVERTISEMENT",
            "1 fluid ounce sweet vermouth (optional) ADVERTISEMENT",
            "2 anchovy filets (optional) ADVERTISEMENT",
            "1 (28 ounce) can Italian-style whole peeled tomatoes ADVERTISEMENT",
            "2 (6 ounce) cans tomato paste ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1/8 teaspoon fennel seed ADVERTISEMENT",
            "1 tablespoon dried chives ADVERTISEMENT",
            "1 cube chicken bouillon ADVERTISEMENT",
            "3/4 pound sweet Italian sausage ADVERTISEMENT",
            "3/4 pound spicy Italian sausage ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan saute garlic, onion, and roasted peppers in 2 tablespoons olive oil until onions turn golden brown. Stir in fresh basil and blend well. Add ground black pepper, ground white pepper, ground red pepper, ground sage, onion powder, ground sage, onion powder, dried parsley, dried oregano, and salt. Stir until well blended. If desired, add MSG. Stir in chopped Italian tomatoes and both cans of tomato paste. Cover and simmer over medium-low heat until paste has liquefied.\nOnce sauce has liquefied, add bay leaf, fennel seed, dried chives, bouillon cube, and ,if desired, anchovy fillets and Vermouth. Cover and let simmer for 30 minutes. Stir occasionally.\nIn a separate skillet prepare sausage by lightly browning in 2 tablespoons olive oil. Using medium heat, cover and let cook for 15 minutes. At the completion of cooking time, remove sausage from pan, and cut into 1 inch pieces. Add to sauce pot.\nCover sauce and simmer for an additional 15 minutes. Stir occasionally and serve warm.\n",
        "picture_link": "YM3qZcQvXQiBIc4RZz8MHDvj5uhc2aS"
    },
    {
        "title": "Christie B's Fabulous Cherry Cookies",
        "ingredients": [
            "2 3/4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup pitted ground cherries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven 375 degrees F (190 degrees C).\nIn a small bowl combine flour, baking soda and baking powder and set aside.\nIn a large bowl, cream the butter and sugar together until light. Beat in the eggs and the vanilla. Gradually mix in the flour then add the cherry mixture. Cover and refrigerate for 10 to 15 minutes.\nRoll small round balls of dough and place on ungreased cookie sheet. Bake at 375 degrees F (190 degrees C) for 8 to 10 minutes or until golden brown. Remove and let cool.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sugar Free Spice Cookie",
        "ingredients": [
            "1 1/4 cups water ADVERTISEMENT",
            "1/3 cup shortening ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "2 teaspoons liquid artificial sweetener ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a cookie sheet.\nIn a small saucepan, bring the 11/4 cup of water, raisins, shortening, cinnamon, and nutmeg to a boil. Remove from heat, beat in eggs, one at a time. Dissolve salt, soda, and liquid sweetener into the remaining 2 tablespoons of water; add alternately to the egg mixture, with the flour and baking powder.\nDrop cookies by teaspoonfuls onto the prepared cookie sheet. Bake for 8 to 10 minutes in the preheated oven. Cool on wire racks.\n",
        "picture_link": "JQwFmS/LQZUNRAp5TewOEg.QS/HxdM6"
    }
]