[
    {
        "title": "Italian Spinach Soup with Meatballs",
        "ingredients": [
            "3 quarts chicken broth ADVERTISEMENT",
            "1 large onion, quartered ADVERTISEMENT",
            "2 carrots, cut into chunks ADVERTISEMENT",
            "2 ribs celery, cut into chunks ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "40 frozen Italian-style meatballs ADVERTISEMENT",
            "1 (16 ounce) can Italian-style crushed tomatoes, undrained ADVERTISEMENT",
            "1 (16 ounce) package frozen chopped spinach, thawed and drained ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "4 cloves garlic, crushed ADVERTISEMENT",
            "2 teaspoons dried basil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine chicken broth, onion, carrots, celery, and salt in a large pot. Bring to a boil; reduce heat and simmer, uncovered, until flavors combine, about 30 minutes. Discard onion, carrot, and celery from the broth.\nBring broth to a boil. Add meatballs. Reduce heat and simmer until meatballs are heated through, about 10 minutes. Stir in tomatoes, spinach, olive oil, lemon juice, Parmesan cheese, garlic, and dried basil. Simmer until flavors combine, 15 to 20 minutes.\n",
        "picture_link": "eDlilPyFI..F00L4jrNJnKP7or0v5sq"
    },
    {
        "title": "Vegan Morning Smoothie",
        "ingredients": [
            "1 banana ADVERTISEMENT",
            "1/3 cup frozen chopped spinach ADVERTISEMENT",
            "1/2 cup frozen mixed fruit ADVERTISEMENT",
            "1 tablespoon flax seed meal ADVERTISEMENT",
            "1/2 scoop vegan protein powder ADVERTISEMENT",
            "1 tablespoon chia seeds ADVERTISEMENT",
            "1/2 teaspoon matcha green tea powder ADVERTISEMENT",
            "water to cover ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Layer banana, spinach, mixed fruit, flax meal, protein powder, chia seeds, and matcha powder in a blender in the order listed; add enough water to cover. Cover blender and blend until smooth.\n",
        "picture_link": "attbcOeBHj3YSbqdurAViNZQ1arxLFm"
    },
    {
        "title": "Skillet Quinoa Salad",
        "ingredients": [
            "1 teaspoon extra-virgin olive oil ADVERTISEMENT",
            "1 cup quinoa, rinsed and drained ADVERTISEMENT",
            "2 cups low-sodium chicken broth ADVERTISEMENT",
            "1 head broccoli, cut into small florets ADVERTISEMENT",
            "1/2 bunch kale, chopped ADVERTISEMENT",
            "1/2 red bell pepper, chopped ADVERTISEMENT",
            "1/4 cup fresh cilantro, chopped ADVERTISEMENT",
            "1/4 cup sliced black olives ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 tablespoon extra-virgin olive oil, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1 teaspoon olive oil in a large skillet over medium heat. Add quinoa; cook and stir until quinoa is lightly toasted, about 2 minutes. Remove from heat. Pour in chicken broth slowly. Bring to a boil. Reduce heat to low, cover, and simmer until most of the chicken broth is absorbed, about 12 minutes.\nLayer broccoli, kale, and red bell pepper over quinoa in the skillet. Cover and cook until quinoa is tender, about 8 minutes more. Fluff quinoa with a fork. Sprinkle cilantro and olives on top. Season with salt and black pepper and drizzle with 1 tablespoon olive oil.\n",
        "picture_link": "LQ6UMb2cYVJJzeypJ/hKqgebwXINb3u"
    },
    {
        "title": "Lemon Broccolini and Sausage Pasta",
        "ingredients": [
            "1 (16 ounce) package rotini pasta ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/4 yellow onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes ADVERTISEMENT",
            "1/2 cup white wine, divided ADVERTISEMENT",
            "1 pound sweet Italian chicken sausage ADVERTISEMENT",
            "1 bunch broccolini, roughly chopped ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese, plus extra for serving ADVERTISEMENT",
            "1 lemon, zested and juiced ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil; cook the rotini until tender yet firm to the bite, about 8 minutes; drain.\nHeat olive oil in a skillet over medium-high heat. Add onion, garlic, and red pepper flakes; cook and stir until onion begins to brown, about 4 minutes. Pour 1/4 cup wine into the skillet; scrape up any browned bits of food with wooden spoon.\nStir sausage into onion mixture; pour remaining wine in gradually as mixture becomes dry. Cook until sausage is thoroughly browned; 7 to 10 minutes. Add broccolini; cook and stir until just tender, 2 to 3 minutes more. Add pasta; toss to combine. Stir in Parmesan, lemon zest, lemon juice, salt, and pepper. Top with additional Parmesan to serve.\n",
        "picture_link": "eat428hDAQAj2MUAisheHOCGda0.XFO"
    },
    {
        "title": "Quick and Easy Ramen Soup",
        "ingredients": [
            "1 pound boneless chicken breasts ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "2 (3 ounce) packages ramen noodles (without flavor packet) ADVERTISEMENT",
            "1 1/2 cups frozen peas and carrots ADVERTISEMENT",
            "2 egg yolks ADVERTISEMENT",
            "1/4 cup chopped scallions, or to taste ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1 cup kimchi ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a pot of water to a boil; cook chicken until no longer pink in the center, 15 to 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Drain water and shred chicken using a knife and fork.\nBring 4 cups water to a boil; add noodles and cook until tender, about 5 minutes. Add chicken, peas and carrots, and egg yolks; cook over high heat, stirring constantly, until soup is heated through, about 5 minutes. Add scallions and soy sauce; cook for 2 minutes more.\nTransfer soup to bowls and serve with kimchi on the side.\n",
        "picture_link": "eSqzAh48grGjCzcfC33Z2J0mGjd00ha"
    },
    {
        "title": "Chicken Wellington",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "8 small boneless, skinless chicken breasts ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 large onion, finely chopped ADVERTISEMENT",
            "1/2 pound baby bella mushrooms, sliced, or more to taste ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "2 sheets frozen puff pastry, thawed ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "2 tablespoons Dijon mustard ADVERTISEMENT",
            "egg, slightly beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil and butter in a large skillet over medium heat. Season chicken breasts with salt and black pepper. Cook chicken in the hot oil until golden and almost cooked through, about 4 minutes per side. Transfer to a plate.\nPlace onion, mushrooms, and garlic in the same skillet; cook and stir until mushrooms lose their moisture and onions are tender, about 5 minutes. Stir in parsley.\nPreheat oven to 375 degrees F (190 degrees C). Line a baking sheet with parchment paper.\nRoll out each puff pastry sheet into a 14-inch square on a floured work surface. Cut each sheet into 4 equal squares. Place a chicken breast in the center of each square.\nCombine cream cheese and Dijon mustard in a small bowl. Spread some of the cream cheese mixture over each chicken breast. Top each with 2 tablespoons of the mushroom mixture. Brush the edges of each square with water and wrap around the chicken. Place seam-side down on a baking sheet. Brush the tops with the beaten egg.\nBake in the preheated oven until puffed and golden brown, about 20 minutes. Remove from oven and slice in half before serving.\n",
        "picture_link": "OQE3yS9qZeihaTGtNS0h3ndS3XAKoD2"
    },
    {
        "title": "Baked Banana Fritters",
        "ingredients": [
            "1/3 cup dry bread crumbs ADVERTISEMENT",
            "2 tablespoons dry shredded coconut ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "2 bananas, cut into bite-size pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper.\nCombine bread crumbs, coconut, sugar, and cinnamon together in a bowl. Beat egg white in a small bowl until frothy. Dip each banana piece in egg white and press into bread crumb mixture. Place the breaded bananas on prepared baking sheet; do not stack.\nBake in preheated oven until golden brown, about 10 minutes.\n",
        "picture_link": "Kfw7XU1peGXkV6TY32SuYbVjoxz7mXy"
    },
    {
        "title": "Quick and Easy Mock Hollandaise Sauce",
        "ingredients": [
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1 teaspoon prepared yellow mustard, or to taste ADVERTISEMENT",
            "1/4 teaspoon ground paprika ADVERTISEMENT",
            "1 dash hot pepper sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk mayonnaise, sour cream, lemon juice, mustard, paprika, and hot pepper sauce together in a small saucepan over medium heat until warmed through, 2 to 3 minutes.\n",
        "picture_link": "MvkW2v45SAlXwRYpZL2ZnpvFlToKcQu"
    },
    {
        "title": "Flavored Water",
        "ingredients": [
            "1/2 small cucumber, sliced thin ADVERTISEMENT",
            "1/2 nectarine, pitted and chopped ADVERTISEMENT",
            "1/2 lemon, sliced ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "1/2 lime, sliced ADVERTISEMENT",
            "1/2 lime, juiced ADVERTISEMENT",
            "4 slices ginger root, peeled, or more to taste ADVERTISEMENT",
            "10 melissa leaves (lemon balm), or more to taste ADVERTISEMENT",
            "2 quarts water ADVERTISEMENT",
            "1 drop liquid stevia, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cucumber, nectarine, lemon slices, lemon juice, lime slices, lime juice, ginger, and melissa leaves in a large pitcher; mash gently with a wooden spoon. Pour in water, stir, and refrigerate until flavors blend, 2 hours to overnight. Strain; serve over ice.\n",
        "picture_link": "WdEBw3dwO2kUG28AQQK1sN0mObhIPXS"
    },
    {
        "title": "Creamy Beef Tips with Mushrooms",
        "ingredients": [
            "1 (14 ounce) can coconut milk ADVERTISEMENT",
            "1 cup beef broth ADVERTISEMENT",
            "8 ounces portobello mushrooms, cleaned and sliced ADVERTISEMENT",
            "1 green bell pepper, cut into strips ADVERTISEMENT",
            "1 yellow onion, cut into strips ADVERTISEMENT",
            "1 teaspoon sea salt ADVERTISEMENT",
            "1 1/2 pounds beef sirloin tips, cubed ADVERTISEMENT",
            "1 (16 ounce) package linguine pasta ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nCombine coconut milk, beef broth, portobello mushrooms, green bell pepper, onion, and sea salt in a 9x13-inch casserole dish; mix well. Add beef tips; stir until well-coated.\nBake in the preheated oven until beef is tender and sauce has thickened, about 1 hour.\nBring a large pot of lightly salted water to a boil. Cook linguine at a boil until tender yet firm to the bite, about 11 minutes; drain. Serve beef tips and sauce over pasta.\n",
        "picture_link": "UBXdMqob5CosDkxwW4SqDQLW16JbkD."
    },
    {
        "title": "Wrapped Asparagus",
        "ingredients": [
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "16 medium fresh asparagus spears, each trimmed to 5 inches ADVERTISEMENT",
            "8 thin slices Margherita® Deli Prosciutto ADVERTISEMENT",
            "1/3 cup soft goat cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F. Combine lemon juice, olive oil and garlic in large bowl. Add asparagus; toss to coat. Place asparagus in baking pan.\nBake 8 minutes, or until crisp-tender. Let cool to room temperature (about 15 minutes).\nCut each prosciutto slice in half lengthwise. Spread each piece with about 1 teaspoon goat cheese. Wrap each slice in a spiral around each asparagus spear. Serve immediately, or cover and refrigerate until ready to serve.\n",
        "picture_link": "LaTClvDC0as/Ol9/ScNYZs4lNmpWtRm"
    },
    {
        "title": "Cider Donut Bread Pudding",
        "ingredients": [
            "6 stale cider doughnuts, broken into bite-size pieces ADVERTISEMENT",
            "1 large apple - peeled, cored, and chopped ADVERTISEMENT",
            "1 1/2 cups half-and-half ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "2 eggs, lightly beaten ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3/4 teaspoon ground cinnamon ADVERTISEMENT",
            "2 tablespoons maple syrup, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Butter an 8x8-inch baking dish.\nMix doughnuts and apple together in the prepared baking dish.\nWhisk half-and-half, sugar, eggs, vanilla, and cinnamon together in a bowl. Pour half-and-half mixture over donuts and apples in the baking dish. Let sit until liquid is absorbed, stirring occasionally, about 15 minutes.\nBake in the preheated oven until golden, about 30 minutes. Cool and drizzle with maple syrup.\n",
        "picture_link": "itYmaUtdt239kW1vTMCkXLSH.XNwx/S"
    },
    {
        "title": "The Fridge Scavenger's Tomato and Cauliflower Pasta",
        "ingredients": [
            "1 stalk celery, sliced ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 onion, quartered ADVERTISEMENT",
            "1 clove garlic, chopped ADVERTISEMENT",
            "1 head cauliflower, cut into small florets ADVERTISEMENT",
            "1 (28 ounce) can whole peeled tomatoes, drained and mashed ADVERTISEMENT",
            "1 teaspoon dried sage ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons chicken broth, or as needed (optional) ADVERTISEMENT",
            "1 (8 ounce) package linguine pasta ADVERTISEMENT",
            "1 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put a celery slice in a deep skillet with a cover; add olive oil. Heat olive oil over medium-high heat until celery slice is sizzling, 3 to 5 minutes. Add remaining celery, onion, and garlic to olive oil; turn heat to medium. Cook and stir onion mixture until slightly tender, about 5 minutes.\nMix cauliflower, tomatoes, sage, salt, and pepper into onion mixture; cook and stir over medium-high heat until bubbling, about 5 minutes. Cover skillet with lid, reduce heat to low, and cook until a knife slides easily into cauliflower, about 15 minutes. Add chicken broth if tomato and cauliflower sauce begins to burn.\nBring a large pot of lightly salted water to a boil. Cook linguine at a boil until tender yet firm to the bite, about 11 minutes; drain and transfer to a serving bowl.\nPour tomato and cauliflower sauce over pasta; add Parmesan cheese. Toss to coat.\n",
        "picture_link": "lUQ3mCWbEq1FRvTWKxD/BxJSk5814Gq"
    },
    {
        "title": "Salmon with Maple Soy Marinade",
        "ingredients": [
            "1/2 cup soy sauce ADVERTISEMENT",
            "1/2 cup maple syrup ADVERTISEMENT",
            "1 1/2 tablespoons rye whiskey ADVERTISEMENT",
            "2 teaspoons wasabi paste ADVERTISEMENT",
            "4 (8 ounce) salmon fillets ADVERTISEMENT",
            "4 untreated cedar planks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place soy sauce, maple syrup, rye whiskey, and wasabi paste into a blender. Cover blender and puree until smooth. Pour half of the mixture into a resealable plastic bag for marinade and reserve remaining mixture in the refrigerator for dipping sauce. Place salmon in the bag, coat with marinade, squeeze out excess air, and seal the bag. Marinate salmon in the refrigerator for 4 hours.\nSubmerge cedar planks in water and soak for at least 2 hours.\nPreheat an outdoor grill for medium-high heat. Remove salmon fillets from marinade, and place each one on a soaked cedar plank. Discard bag and marinade.\nPlace planked salmon into the grill, close cover, and roast until fish flakes easily with a fork, about 10 minutes. Serve with reserved dipping sauce.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Vegetable Stovetop Frittata",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "2/3 cup 1-inch pieces broccoli florets ADVERTISEMENT",
            "1/2 red bell pepper, chopped ADVERTISEMENT",
            "1/2 sweet onion, chopped ADVERTISEMENT",
            "6 marinated olives, chopped ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "2 tablespoons whole milk ADVERTISEMENT",
            "1 pinch salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 cup crumbled sheep's milk feta cheese (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a 10-inch skillet over medium heat. Cook and stir broccoli, bell pepper, and sweet onion in hot oil until hot, about 3 minutes. Place a cover on the skillet and continue cooking until the vegetables begin to soften, about 5 minutes more. Stir olives into the vegetable mixture.\nBeat eggs, egg whites, milk, salt, and pepper together with a whisk in a small bowl; pour over the vegetable mixture in the skillet. Sprinkle feta cheese over the egg mixture.\nReplace cover on the skillet, reduce heat to medium-low, and cook until the egg is lightly browned on the bottom, 3 to 5 minutes. Carefully flip the frittata and cook until the bottom is again lightly browned, 1 to 2 minutes more.\n",
        "picture_link": "Od.jAAbsMv9v2OnEWh2mZZ3yp9MZThS"
    },
    {
        "title": "Pumpkin Blondies",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 1/2 cups brown sugar ADVERTISEMENT",
            "3/4 cup butter, melted ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/2 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "3/4 cup pumpkin puree ADVERTISEMENT",
            "2 teaspoons pumpkin pie spice ADVERTISEMENT",
            "1/2 cup cinnamon chips, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a 9x13-inch baking pan with aluminum foil with about 1 inch hanging over the edges for 'handles'. Spray foil with cooking spray.\nBeat brown sugar and butter together in a bowl with an electric mixer until smooth; beat in 2 eggs until combined. Beat 1 more egg and vanilla extract into brown sugar mixture until combined. Stir flour and baking powder together in a separate bowl; stir into brown sugar mixture until batter is smooth.\nBeat cream cheese in a separate bowl with an electric mixer until smooth; beat in remaining 1 egg until just combined. Beat pumpkin puree into cream cheese mixture; stir in pumpkin pie spice.\nSpread 2/3 the batter into the prepared baking pan. Drop spoonfuls of pumpkin mixture over batter; top with spoonfuls of remaining 1/3 batter and swirl together with a butter knife. Sprinkle cinnamon chips over batter-pumpkin mixture.\nBake in the preheated oven until blondies are lightly browned on the edges, about 30 minutes. Cool completely before cutting into bars.\n",
        "picture_link": "E32LI3HORIP/2OPBkEgH83TdjglD/Fm"
    },
    {
        "title": "Pumpkin Pie Chatsworth Style",
        "ingredients": [
            "3/4 cup brown sugar ADVERTISEMENT",
            "3/4 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1 dash ground allspice ADVERTISEMENT",
            "1 dash ground cloves ADVERTISEMENT",
            "1 3/4 cups mashed cooked pumpkin ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 1/2 cups warm 2% evaporated milk ADVERTISEMENT",
            "1 (9 inch) prepared pie crust ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix brown sugar, ground ginger, salt, cinnamon, nutmeg, allspice, and cloves together in a large bowl; add pumpkin and eggs. Beat the pumpkin mixture until smooth. Stir evaporated milk into the pumpkin mixture; pour into the pie crust.\nBake in preheated oven until the pie is set in the middle, 35 to 40 minutes. Cool to room temperature before serving.\n",
        "picture_link": "sUgwhXME.x7mL85skacSw2Su0IC2lDa"
    },
    {
        "title": "Tiramisu Chex Party Mix",
        "ingredients": [
            "8 cups Rice Chex® cereal ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2 tablespoons instant espresso coffee powder, granules or crystals ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "1 cup powdered sugar ADVERTISEMENT",
            "1/2 cup unsweetened baking cocoa ADVERTISEMENT",
            "4 cups gluten-free pound cake pieces ADVERTISEMENT",
            "1 cup mascarpone cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In large bowl, place cereal. In small microwavable bowl, microwave butter uncovered on High about 30 seconds or until melted. Stir in espresso; add chocolate chips. Microwave on High 30 seconds; stir. Continue microwaving and stirring until mixture is smooth. Pour chocolate mixture over cereal; toss until well coated.\nIn large resealable food-storage plastic bag, mix powdered sugar and cocoa. Add cereal mixture and pound cake pieces; shake until evenly coated. Serve in individual bowls or glasses. Top with dollops of mascarpone cheese.\n",
        "picture_link": "ZmAcjnyQLA6aJtsReSxAkYMnygTZY/S"
    },
    {
        "title": "Lamb Stew with Butternut Squash",
        "ingredients": [
            "2 tablespoons vegetable oil, divided ADVERTISEMENT",
            "1 1/2 pounds boneless lamb shoulder, cut into 1-inch cubes ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3/4 cup chopped carrots ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "1 (28 ounce) can chopped tomatoes ADVERTISEMENT",
            "2 cups beef stock ADVERTISEMENT",
            "2 sprigs thyme ADVERTISEMENT",
            "1 sprig fresh rosemary ADVERTISEMENT",
            "2 cups 1/2-inch cubes butternut squash ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nSeason lamb with salt.\nHeat 1 tablespoon oil in a Dutch oven over medium-high heat. Cook and stir 1/2 the lamb cubes in hot oil until browned on all sides, about 5 minutes. Transfer browned meat with a slotted spoon to a plate, reserving drippings in the pot. Add remaining 1 tablespoon oil to the Dutch oven. Cook and stir second 1/2 the lamb cubes until browned on all sides, about 5 minutes. Transfer lamb to plate. Reduce heat to medium-low.\nCook and stir onion, carrots, and garlic in Dutch oven until slightly softened, 3 to 5 minutes. Stir lamb cubes and any accumulated juices, tomatoes, beef stock, thyme, and rosemary into onion mixture and bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Cover Dutch oven with an oven-proof lid.\nCook stew in the covered Dutch oven in the preheated oven until the lamb is tender, 2 to 3 hours. Stir butternut squash cubes into stew, recover the Dutch oven, and return to the preheated oven until squash is tender, 20 to 25 minutes.\n",
        "picture_link": "ySfNxz4gTN6FpA4EpqaMtTYZ79zg16G"
    },
    {
        "title": "Evelyn's Spicy Italian Sausage and Zucchini",
        "ingredients": [
            "5 (3.5 ounce) links hot Italian sausage links ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "2 (14.5 ounce) cans crushed tomatoes ADVERTISEMENT",
            "2 zucchinis, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a skillet over medium heat. Cook sausages in hot skillet, turning regularly, until no longer pink in the center, about 10 minutes. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C). Transfer to a cutting board and slice.\nHeat olive oil in a separate skillet over medium heat. Cook and stir onion, bell pepper, and garlic in hot oil until tender, about 5 minutes; season with red pepper flakes, salt, and pepper and cook 1 minute more. Add sliced sausage, crushed tomatoes, and sliced zucchini; bring to a boil, reduce heat to low, and continue cooking until the zucchini is tender, about 10 minutes.\n",
        "picture_link": "/1pr41w8o3gLE3uQCi9phHGDDehpHgi"
    },
    {
        "title": "Cauliflower Chickpeas and Farro",
        "ingredients": [
            "1/4 cup sliced almonds ADVERTISEMENT",
            "1 tablespoon oil ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 tablespoon garam masala ADVERTISEMENT",
            "1 1/2 cups Swanson® Chicken Broth ADVERTISEMENT",
            "1/2 cup farro, rinsed ADVERTISEMENT",
            "4 cups cauliflower florets ADVERTISEMENT",
            "1 (15 ounce) can chickpeas (garbanzo beans), rinsed and drained ADVERTISEMENT",
            "1 teaspoon grated orange zest ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toast the almonds in a 10-inch non-stick skillet over medium-high heat until lightly browned. Remove the almonds from the skillet and set aside.\nHeat the oil in the same skillet over medium-high heat. Add the onion, garlic and garam masala and cook for 2 minutes or until the onion is tender-crisp, stirring occasionally.\nStir the broth and farro in the skillet and heat to a boil. Reduce the heat to medium and cook, covered, for 10 minutes. Stir the cauliflower and chickpeas in the skillet. Cover and cook for 5-10 minutes or until the farro is just tender and the cauliflower is tender-crisp.\nStir in the orange zest and season to taste. Sprinkle with the toasted almonds and the parsley.\n",
        "picture_link": "/OdjMIPuM1lbWJrLPd2ENDErGdT.NYC"
    },
    {
        "title": "Cinnamon-Brown Sugar Pop-Tart® Cake",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "6 cinnamon-brown sugar toaster pastries (such as Pop-Tarts®) ADVERTISEMENT",
            "5 tablespoons unsalted butter, melted ADVERTISEMENT",
            "3/4 cup brown sugar, divided ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "4 teaspoons ground cinnamon, divided ADVERTISEMENT",
            "1 teaspoon milk ADVERTISEMENT",
            "1/2 cup unsalted butter, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 egg, separated ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "1 1/2 teaspoons white vinegar ADVERTISEMENT",
            "1 cup cream cheese frosting, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Spray an 8-inch square pan.\nCrumble 4 toaster pastries into a bowl and mix in melted butter; press into the prepared pan creating a crust.\nCombine 1/4 cup brown sugar, 1 tablespoon flour, 1 teaspoon cinnamon, and 1 teaspoon milk in a bowl; spread over crust.\nBeat 1/2 cup brown sugar, softened butter, and white sugar together in a bowl; add egg yolk and vanilla extract and mix well. Combine 1 cup flour, baking powder, and salt in a separate bowl. Whisk 3/4 cup milk and vinegar together in a separate bowl.\nMix flour mixture, alternating with milk-vinegar mixture, into butter mixture until batter is well mixed. Fold egg whites into batter. Crumble 1 toaster pastry over batter and fold. Pour batter over the crust.\nBake in the preheated oven until a toothpick inserted in the center comes out clean, 45 to 50 minutes. Cool cake completely, at least 1 hour.\nSpread frosting onto cake and crumble 1 toaster pastry over frosting.\n",
        "picture_link": "dzjy7koPge1kUOPVTv7EVQcB33m2ROq"
    },
    {
        "title": "Juicy Gourmet Burger Sliders",
        "ingredients": [
            "1 1/2 cups chopped cremini mushrooms ADVERTISEMENT",
            "1/4 cup minced shallots ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "3/4 tablespoon chopped fresh thyme ADVERTISEMENT",
            "1/2 teaspoon sea salt, or to taste ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 1/2 tablespoons olive oil ADVERTISEMENT",
            "1/4 cup full-bodied dry red wine, or as needed ADVERTISEMENT",
            "1 pound lean ground chuck ADVERTISEMENT",
            "1 3/4 tablespoons white truffle oil ADVERTISEMENT",
            "1 baguette, cut into 1-inch slices ADVERTISEMENT",
            "12 thin slices Parmesan cheese ADVERTISEMENT",
            "1 1/2 cups arugula ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium-high heat and lightly oil the grate.\nStir mushrooms, shallots, garlic, thyme, salt, and pepper together in a bowl. Heat olive oil in a skillet over medium heat;cook and stir mushroom mixture until golden, about 8 minutes. Pour red wine into skillet; simmer until liquid evaporates, stirring slowly, about 2 minutes. Spread mushroom mixture onto a plate to cool to room temperature, about 5 minutes.\nCrumble ground chuck into a bowl; pour truffle oil over beef and massage oil gently into beef until evenly distributed. Fold mushroom mixture into beef mixture until combined; form 6 patties approximately the size of baguette slices.\nGrill patties until no longer pink in the center, about 3 minutes per side. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C).\nToast baguette slices until crisp and golden. Place each patty on a baguette slice, top with 2 shaved slices of Parmesan cheese, about 1/4 cup arugula, and a second baguette slice. Secure each slider with a toothpick.\n",
        "picture_link": "FtVMduUnkMUc1eOCDhl/0y.0ob5DmtO"
    },
    {
        "title": "Roasted Asparagus with Lemon and Goat Cheese",
        "ingredients": [
            "2 pounds fresh asparagus, trimmed ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 cup Swanson® Vegetable Broth ADVERTISEMENT",
            "3 ounces soft goat cheese, crumbled ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 teaspoon grated lemon zest ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Set the oven to 425 degrees F. Spray a roasting pan with vegetable cooking spray.\nStir the asparagus and oil in the pan. Season the asparagus as desired. Add the broth.\nRoast the asparagus for 20 minutes or until tender, stirring once during cooking. Top with the cheese, lemon juice and lemon zest.\n",
        "picture_link": "emUZQ1Rm7XgbU/DVj6BKIpw.ThX8Ewe"
    },
    {
        "title": "Cuban Sandwich from Smithfield®",
        "ingredients": [
            "1 pound Smithfield® Original Pork Loin Filet ADVERTISEMENT",
            "1 pound Smithfield/Farmland® Ham ADVERTISEMENT",
            "5 tablespoons yellow mustard, divided ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "4 hoagie rolls, split lengthwise ADVERTISEMENT",
            "5 tablespoons butter, softened ADVERTISEMENT",
            "2 dill pickles, each cut lengthwise into 4 slices ADVERTISEMENT",
            "8 slices Swiss cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 450 degrees F. Spread 1 tablespoon mustard over the entire loin; season with salt and pepper.\nPlace pork on rack in shallow roasting pan. Roast in 450 degrees F oven for about 20 minutes until internal temperature reaches 150 degrees F. Let stand 10 minutes before thinly slicing.\nSlice hoagie rolls in half horizontally and spread 1 tablespoon butter on the inside of both halves. Layer sandwich with the filling ingredients in the following order: sliced roast, sliced ham, remaining 4 tablespoons mustard, pickles and Swiss cheese.\nHeat large skillet and coat pan with 1 tablespoon butter. Cook sandwiches in skillet until bread is golden brown and cheese is melted. (Can also use a sandwich press to grill.) Slice sandwiches in half diagonally and enjoy.\n",
        "picture_link": "eu8k6/S4MLmp8Da.HQ8wq/tuGe.JdpW"
    },
    {
        "title": "Amazingly Easy Banana Cake",
        "ingredients": [
            "3 over-ripe bananas, mashed ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "1 (15.25 ounce) package cake mix with candy bits (such as Pillsbury® Funfetti®), or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13-inch baking dish.\nBeat bananas, cream cheese, and oil together in a bowl using an electric mixer on medium speed until smooth and creamy, about 2 minutes. Add cake mix and continue beating for 3 minutes more; spread into the prepared baking dish.\nBake in the preheated oven until a toothpick inserted in the center comes out clean, 30 to 35 minutes.\n",
        "picture_link": "uGq6YGOkOX2Hq6XfbJ5yXc5ftLUZmda"
    },
    {
        "title": "Self-Rising Cornmeal",
        "ingredients": [
            "15 tablespoons cornmeal ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix cornmeal, baking powder, and salt together in a bowl.\n",
        "picture_link": "kLEvavmga4MJeG5HaBVAayrtVhFZBii"
    },
    {
        "title": "BBQ Pizza - Hawaiian Style",
        "ingredients": [
            "1 pizza crust ADVERTISEMENT",
            "1 cup barbeque sauce, warmed ADVERTISEMENT",
            "1 1/2 cups cubed fully cooked ham ADVERTISEMENT",
            "1 cup diced pineapple ADVERTISEMENT",
            "1/2 cup crumbled cooked bacon ADVERTISEMENT",
            "4 green onions, chopped ADVERTISEMENT",
            "1 cup shredded Cheddar cheese (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nPlace pizza crust on a pizza pan or baking sheet. Spread barbeque sauce over crust and top with ham, pineapple, bacon, and green onions. Sprinkle Cheddar cheese over toppings.\nBake in the preheated oven until cheese is melted and bubbling, 12 to 20 minutes.\n",
        "picture_link": "UcvTm34v9jEH3i6Z5I3XKbCSQTQKEiO"
    },
    {
        "title": "Salsa Chicken Soup",
        "ingredients": [
            "3 1/2 cups Swanson® Chicken Broth or Swanson® Certified Organic Chicken Broth or Swanson® Natural Goodness® Chicken Broth ADVERTISEMENT",
            "1/2 cup uncooked long grain white rice ADVERTISEMENT",
            "1 (16 ounce) can Campbell's® Pork & Beans ADVERTISEMENT",
            "1/2 cup Pace® Chunky Salsa ADVERTISEMENT",
            "1 cup cubed cooked chicken ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the broth in a 2-quart saucepan over medium-high heat to a boil. Stir the rice in the saucepan. Reduce the heat to low. Cover and cook for 20 minutes or until rice is done.\nStir the beans, salsa and chicken in the saucepan and heat through.\n",
        "picture_link": "QDksJCHbSgPF4MJLrSw5UURVmvsWR.G"
    },
    {
        "title": "Steamed Clams from Swanson®",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 bulb fennel, trimmed and sliced ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/4 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1 cup Swanson® Seafood Stock ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "24 littleneck clams ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "1 loaf Italian or French bread ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a 6-quart saucepot over medium heat. Add the fennel, garlic and red pepper and cook and stir for 2 minutes. Add the stock and wine and heat to a boil.\nIncrease the heat to medium-high. Add the clams to the saucepot. Cover and cook for 5 minutes or until the clams open. Discard any clams that do not open. Sprinkle with the parsley. Serve with the bread for dipping.\n",
        "picture_link": "mDOWSjaU3DA7TUFc/u6l4Bd.JMYeCOi"
    },
    {
        "title": "Italian-Style Chicken Noodle Soup",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 large carrot, peeled and sliced ADVERTISEMENT",
            "1/2 fennel bulb, cut in half and thinly sliced ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes, undrained ADVERTISEMENT",
            "1 (32 ounce) carton Swanson® Chicken Broth ADVERTISEMENT",
            "1 cup shredded cooked chicken ADVERTISEMENT",
            "2 ounces ditalini (small tube-shaped) pasta, cooked and drained ADVERTISEMENT",
            "1 teaspoon basil pesto ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a 4-quart saucepan over medium-high heat. Add the carrot and fennel and cook for 5 minutes or until tender, stirring occasionally. Stir in the garlic and tomatoes.\nStir in the broth and heat to a boil. Stir in the chicken and ditalini. Reduce the heat to medium-low. Cook for 5 minutes. Stir in the pesto and parsley. Season as desired. Sprinkle with the cheese.\n",
        "picture_link": "KXM4ioOh96S7bscJotJgT/m7TYU1xhK"
    },
    {
        "title": "Homemade Creamy Chip Dip",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/3 cup ketchup ADVERTISEMENT",
            "1/4 cup heavy whipping cream ADVERTISEMENT",
            "3 green onions, finely chopped ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat cream cheese with an electric mixer until smooth, about 3 minutes; beat in ketchup, cream, green onions, and salt until well combined, about 2 minutes.\n",
        "picture_link": "jChUT6.E40Y5a6b9DzJgSRQc9ZtlJle"
    },
    {
        "title": "Holiday Brussels Sprouts",
        "ingredients": [
            "1 1/2 pounds Brussels sprouts, trimmed and cut in half ADVERTISEMENT",
            "3 cups diced, peeled, seeded butternut squash ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1 large shallot, peeled and thinly sliced ADVERTISEMENT",
            "1/4 cup dry white wine ADVERTISEMENT",
            "1 cup Swanson® Chicken Broth or Swanson® Certified Organic Chicken Broth or Swanson® Natural Goodness® Chicken Broth ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1/3 cup sweetened dried cranberries ADVERTISEMENT",
            "1/3 cup toasted pine nuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Set the oven to 425 degrees F. Stir the Brussels sprouts, squash and oil in a large bowl. Spread the vegetable mixture on a rimmed baking sheet.\nRoast for 25 minutes or until the vegetables are lightly browned.\nHeat the butter in a 12-inch skillet over medium-high heat. Add the shallot and cook for 3 minutes or until lightly browned, stirring often. Add the wine, broth and flour and cook for 5 minutes or until the mixture is reduced by half.\nPlace the vegetable mixture into a large bowl. Add the broth mixture and cranberries and toss to coat. Sprinkle with the pine nuts.\n",
        "picture_link": "xCz8XUrVau7.iXZnDe7y2VkNL5j2lty"
    },
    {
        "title": "Chocolate Coconut Overnight Oats",
        "ingredients": [
            "1 cup chocolate-flavored almond milk ADVERTISEMENT",
            "3/4 cup old-fashioned rolled oats (such a Quaker®) ADVERTISEMENT",
            "1 tablespoon chia seeds ADVERTISEMENT",
            "1 tablespoon packed shredded sweetened coconut ADVERTISEMENT",
            "1 tablespoon maple syrup ADVERTISEMENT",
            "1 tablespoon unsweetened cocoa powder ADVERTISEMENT",
            "1 splash vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix almond milk, oats, chia seeds, coconut, maple syrup, cocoa powder, and vanilla extract in a 12-ounce mason jar. Cover and refrigerate, 8 hours to overnight. Stir and serve cold.\n",
        "picture_link": "phihwd89gJytOM/5zwmTOyLQigE3cmi"
    },
    {
        "title": "V's Fried Mashed Potatoes",
        "ingredients": [
            "6 red potatoes, halved ADVERTISEMENT",
            "1 pinch garlic powder, or to taste ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "2 tablespoons olive oil, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes into a large pot and cover with salted water. Season water with garlic powder and bring to a boil. Reduce heat to medium-low and simmer until tender, 15 to 20 minutes. Drain and transfer potatoes to a large skillet over medium-high heat.\nMash potatoes in the hot skillet and add butter and garlic powder. Form mashed potatoes into a large patty and coat the edges with olive oil, allowing oil to pour under the patty. Cook until bottom is golden brown, 5 to 10 minutes. Break patty using a wooden spoon and fold crisp bottom through the potatoes. Repeat cooking the bottom and folding into the mashed potatoes.\n",
        "picture_link": "AbJnPn9nFJ.SioungS5ueH8RQ0MWSX6"
    },
    {
        "title": "Blueberry and Spice Smoothie",
        "ingredients": [
            "1/4 cup ice cubes, or as desired ADVERTISEMENT",
            "1 cup low-fat vanilla yogurt ADVERTISEMENT",
            "1 cup low-fat milk ADVERTISEMENT",
            "1/2 cup frozen blueberries, or to taste ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 tablespoon white sugar, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend ice in a blender until crumbly; add yogurt, milk, blueberries, and cinnamon. Blend until smooth. Taste smoothie and add desired amount of sugar; blend.\n",
        "picture_link": "TmFHIAy5VsO4BvIljz6cKRZZ8ChLpbO"
    },
    {
        "title": "Banana, Orange, and Ginger Smoothie",
        "ingredients": [
            "1 orange, peeled ADVERTISEMENT",
            "1/2 banana ADVERTISEMENT",
            "3 ice cubes ADVERTISEMENT",
            "2 teaspoons honey ADVERTISEMENT",
            "1/2 teaspoon grated fresh ginger root, or to taste ADVERTISEMENT",
            "1/2 cup plain yogurt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Layer orange, banana, ice cubes, honey, and ginger in the blender; top with yogurt. Blend until smooth.\n",
        "picture_link": "JAl74lISkeuUqFTZC8hiBjrKplrp0ru"
    },
    {
        "title": "Spicy Steak Marinade",
        "ingredients": [
            "1/2 cup water ADVERTISEMENT",
            "1/4 cup Worcestershire sauce ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "2 tablespoons prepared yellow mustard ADVERTISEMENT",
            "1 tablespoon minced onion ADVERTISEMENT",
            "1/2 teaspoon minced garlic ADVERTISEMENT",
            "1/4 teaspoon red pepper flakes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water, Worcestershire sauce, soy sauce, mustard, onion, garlic, and red pepper flakes in a bowl.\n",
        "picture_link": "32iFgezB63bJvL/oyddUGUnmeEA59BC"
    },
    {
        "title": "Butter Toffee Popcorn",
        "ingredients": [
            "1/2 cup unpopped popcorn ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup light corn syrup ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pop popcorn in an air popper according to manufacturer's instructions.\nCombine sugar, corn syrup, butter, and water in a heavy saucepan over medium heat; cook until toffee syrup temperature reaches 280 degrees F (138 degrees C) using a candy thermometer, about 10 minutes. Remove from heat and stir in vanilla extract.\nMix toffee syrup with popcorn in a large bowl until evenly combined.\n",
        "picture_link": "a28xTHk.GYaeukVsUGW0TCvJ3WcHHby"
    },
    {
        "title": "Edna's Banana Cranberry Muffins",
        "ingredients": [
            "3 ripe bananas, mashed ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups whole wheat flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 cup frozen cranberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease 12 muffin cups or line with paper liners.\nMash bananas and sugar together in a bowl; add egg and vanilla extract and mix well. Stir whole wheat flour, baking powder, baking soda, and salt together in a separate bowl; stir into banana mixture just until batter is mixed. Stir oil into batter and fold in cranberries. Spoon batter into the prepared muffin cups.\nBake in the preheated oven until a toothpick inserted in the center comes out clean, 22 to 26 minutes.\n",
        "picture_link": "ZDYaWmlY/6ZFFjbXAnJh/mXUbKnivQu"
    },
    {
        "title": "Maple-Pear Tarte Tatin",
        "ingredients": [
            "1/2 (17.3 ounce) package frozen puff pastry, thawed ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/3 cup brown sugar ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "1/4 cup maple syrup ADVERTISEMENT",
            "4 firm pears - peeled, cored, and halved, or more as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nRoll puff pastry out on a lightly floured surface to 1/4-inch thickness; place in the refrigerator.\nMelt butter in a 9-inch cast iron skillet over medium heat; stir in brown sugar, cinnamon, and nutmeg and cook and stir until sugar dissolves, about 5 minutes. Stir maple syrup into brown sugar mixture; cook, stirring, until mixture begins to bubble. Remove skillet from heat.\nPlace one pear half, cut side up, into the center of skillet. Cut remaining pear halves in half again; arrange pear quarters around the center pear, cut sides up.\nPlace skillet over medium-low heat; cook pears, basting with syrup mixture, until they begin to soften, about 5 minutes. Remove skillet from heat.\nRemove puff pastry from refrigerator; place pastry over pears, tucking edges of pastry around pears inside skillet.\nBake in the preheated oven until pastry is puffed and golden, about 20 minutes; allow to cool for 5 minutes. Place a serving plate over skillet; invert to remove tart (skillet will still be hot). Serve warm.\n",
        "picture_link": "4yTvuJxbnfspQR2xj06OoHUO3Gfe1Ri"
    },
    {
        "title": "Cheese Ravioli with Pumpkin Sauce",
        "ingredients": [
            "2 cups chicken broth ADVERTISEMENT",
            "1 (15 ounce) can pumpkin puree ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/8 teaspoon ground cloves ADVERTISEMENT",
            "1/8 teaspoon nutmeg ADVERTISEMENT",
            "1 (30 ounce) package cheese ravioli ADVERTISEMENT",
            "1/3 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a pot of water to a boil.\nCombine chicken broth, pumpkin puree, milk, brown sugar, white sugar, butter, ginger, cinnamon, cloves, and nutmeg in saucepan; bring to a boil. Reduce heat to medium and simmer, stirring occasionally, until butter melts and sauce is heated through, about 10 minutes.\nCook ravioli in the boiling water until they float to the top and the filling is hot, 6 to 8 minutes. Drain and transfer to a serving bowl. Top pasta with pumpkin sauce and Parmesan cheese.\n",
        "picture_link": "nzqEoNWidz.KQwnTNRKDvEBxNuakqPy"
    },
    {
        "title": "Yummy Yogurt Breaky",
        "ingredients": [
            "1 apple - peeled, cored, and sliced ADVERTISEMENT",
            "1 tablespoon maple syrup ADVERTISEMENT",
            "1/2 cup yogurt ADVERTISEMENT",
            "1/4 cup blueberries ADVERTISEMENT",
            "1 tablespoon sliced almonds ADVERTISEMENT",
            "1 pinch ground cinnamon, or to taste ADVERTISEMENT",
            "1 pinch ground nutmeg, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss apple slices with maple syrup in a bowl.\nPlace yogurt in a bowl. Top yogurt with apple mixture, blueberries, and almonds; sprinkle with cinnamon and nutmeg.\n",
        "picture_link": "6kyLt5l/cBkeRRdiag8RgweVGbOhQbq"
    },
    {
        "title": "Green Smoothie with Maca Powder",
        "ingredients": [
            "2 cups chopped frozen pineapple ADVERTISEMENT",
            "1 cup fresh spinach ADVERTISEMENT",
            "1 frozen chopped banana ADVERTISEMENT",
            "1/2 avocado ADVERTISEMENT",
            "2 tablespoons almond butter ADVERTISEMENT",
            "1 teaspoon maca powder ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Layer pineapple, banana, spinach, avocado, almond butter, and maca powder in a blender; pour in water. Blend until smooth.\n",
        "picture_link": "R5tuiYWQzeFokXx1UHFysRYTcl52IUC"
    },
    {
        "title": "Chocolate Truffle Torte",
        "ingredients": [
            "2 1/2 cups semi-sweet chocolate chips ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "6 large eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine chocolate chips and butter in a large microwave-safe bowl on the Defrost setting for 1 minute. Stir and continue heating in microwave until completely melted, 1 to 2 minutes more.\nFill a 12-inch baking pan with 1 inch of water and place water bath in the oven. Preheat oven to 425 degrees F (220 degrees C). Grease a 9-inch springform pan and line with buttered parchment paper. Wrap the outside of springform pan with aluminum foil.\nSet a large bowl over a pot of simmering water over medium-low heat; cook and stir eggs in the large bowl just until warm to the touch. Remove from heat and beat using an electric mixer until triple the volume and soft peaks form, about 5 minutes.\nFold 1/2 of the eggs into chocolate mixture using a rubber spatula until almost incorporated. Fold in the remaining eggs just until blended. Pour mixture into the prepared springform pan. Place springform pan in the water bath in the oven.\nBake in the preheated oven for 5 minutes. Cover pan loosely with aluminum foil and bake 10 minutes more. Cool on a wire rack for 45 minutes. Cover with plastic wrap and refrigerate, 3 hours to overnight.\n",
        "picture_link": "hncoN8ZkXb/2MI2YY6/dBRTgeslU1xK"
    },
    {
        "title": "Spinach Power Pesto Macaroni and Cheese",
        "ingredients": [
            "1 1/2 cups elbow macaroni ADVERTISEMENT",
            "8 ounces baby spinach leaves, or to taste ADVERTISEMENT",
            "3 tablespoons butter, divided ADVERTISEMENT",
            "1 small onion, minced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/4 cup prepared basil pesto, divided ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 3/4 cups shredded Cheddar cheese, divided ADVERTISEMENT",
            "3/4 cup shredded Parmesan cheese, divided ADVERTISEMENT",
            "3/4 cup shredded Asiago cheese, divided ADVERTISEMENT",
            "4 slices multigrain bread with crusts, cubed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a casserole dish.\nBring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until tender yet firm to the bite, about 8 minutes. Add baby spinach to the pot in the last minute of cooking; drain.\nMelt 2 tablespoons butter in a saucepan over medium heat; cook and stir onion until translucent, about 3 minutes. Stir garlic into onion mixture and cook until fragrant, about 1 minute. Whisk 2 tablespoons pesto, flour, black pepper, and salt into onion mixture until smooth; whisk milk in gradually. Cook and stir milk mixture until slightly thickened, about 2 minutes; stir in 1 1/2 cups Cheddar cheese, 1/2 cup Parmesan cheese, and 1/2 cup Asiago cheese; remove saucepan from heat and stir until cheeses are melted, about 1 minute.\nStir cheese mixture into macaroni mixture; pour into prepared casserole dish. Cover dish with aluminum foil.\nBake in the preheated oven for 25 minutes. Remove casserole from oven; increase oven temperature to 450 degrees F (230 degrees C).\nMelt remaining 1 tablespoon butter in a small saucepan; stir in remaining 2 tablespoons pesto, 1/4 cup Cheddar cheese, 1/4 cup Parmesan cheese, 1/4 cup Asiago cheese, and bread cubes. Remove casserole dish from oven, uncover, and top with bread mixture.\nBake casserole with topping in the preheated oven, uncovered, until bubbly and golden, about 10 minutes.\n",
        "picture_link": "802HlQ5U6GJzWDMJJ0.FLIxnqE5fCqO"
    },
    {
        "title": "Blueberry Orange Scones with White Chocolate Chunks",
        "ingredients": [
            "2 1/2 cups all-purpose flour, divided ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/4 cup shortening ADVERTISEMENT",
            "1/2 white chocolate, chopped ADVERTISEMENT",
            "1/3 cup blueberries ADVERTISEMENT",
            "1/2 teaspoon grated orange zest ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace 2 cups flour, baking powder, and sugar in the bowl of a food processor or blender; pulse a few times to combine. Add shortening; pulse until mixture has the consistency of fine crumbs.\nPlace flour mixture in a bowl; stir in white chocolate, blueberries, and orange zest. Stir milk into flour mixture gradually to form a smooth batter. Turn mixture out onto a floured board; sprinkle with remaining 1/2 cup flour. Knead a few times to incorporate flour and form a smooth dough.\nRoll dough out 1/2-inch thick; cut scones with a biscuit cutter to desired size. Place scones on a baking sheet.\nBake in the preheated oven until golden, about 15 minutes.\n",
        "picture_link": "55NYPfcNEPghfDmQIL8w23tWKNfwcGa"
    },
    {
        "title": "Tres Leches Cupcakes",
        "ingredients": [
            "Cake: ADVERTISEMENT",
            "2 eggs, separated ADVERTISEMENT",
            "1/2 cup white sugar, divided ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 dash vanilla extract ADVERTISEMENT",
            "1/2 cup cake flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1/4 teaspoon cream of tartar ADVERTISEMENT",
            "Tres Leches: ADVERTISEMENT",
            "1 (6 ounce) can evaporated milk ADVERTISEMENT",
            "1/2 cup heavy whipping cream ADVERTISEMENT",
            "1/2 cup sweetened condensed milk ADVERTISEMENT",
            "1 dash vanilla extract, or to taste ADVERTISEMENT",
            "Frosting: ADVERTISEMENT",
            "2 ounces cream cheese, softened ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 cup cold heavy whipping cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Line 12 muffin cups with paper liners.\nBeat eggs and 1/3 cup white sugar together in a bowl using an electric mixer until pale and fluffy; mix in milk and 1 dash vanilla extract. Whisk cake flour, baking powder, and salt together in a separate bowl; stir into egg mixture.\nBeat egg whites and cream of tartar together in a separate bowl using an electric mixer until soft peaks form. Gradually add remaining sugar to egg whites mixture and beat until mixture is glossy and firm. Fold egg whites mixture into flour mixture until batter is just mixed. Spoon batter into the prepared muffin cups.\nBake in the preheated oven until a toothpick inserted in the center comes out clean, 12 to 15 minutes. Cool slightly.\nMix evaporated milk, 1/2 cup cream, sweetened condensed milk, and 1 dash vanilla extract together in a bowl. Prick holes into the cupcakes and spoon 4 to 5 spoonfuls milk mixture over each cupcake.\nBeat cream cheese, 2 tablespoons white sugar, and 1/2 teaspoon vanilla extract together in a bowl until smooth. Add 1/4 cup cold cream and beat until stiff peaks form. Spread frosting onto each cupcake.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sweet Potato Hash Browns",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/2 cup diced sweet onion ADVERTISEMENT",
            "3 sweet potatoes, peeled and grated ADVERTISEMENT",
            "1/4 pound cooked and diced lean bacon ADVERTISEMENT",
            "1 1/2 tablespoons minced fresh chives ADVERTISEMENT",
            "1 1/2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "3/4 teaspoon chopped fresh thyme ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large skillet over medium heat; cook and stir onion until lightly browned, 10 to 12 minutes. Add grated sweet potatoes; cook and stir until tender, about 15 minutes.\nIncrease heat to high and cook sweet potato mixture without stirring for 2 minutes. Reduce heat to medium and stir in bacon, chives, parsley, thyme, salt, and pepper.\n",
        "picture_link": "qwySQm/z8WOPtxEunsE7IBI9y8Azdnm"
    },
    {
        "title": "Hidden Valley Bacon & Cheddar Dip",
        "ingredients": [
            "1 (16 ounce) container sour cream ADVERTISEMENT",
            "1 (1 ounce) packet Hidden Valley® Original Ranch® Dips Mix ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "6 thick-cut bacon, cooked and crumbled ADVERTISEMENT",
            "Freshly cut vegetables, corn or potato chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a bowl, add the sour cream and dips mix and stir until well blended. Fold in the cheese and bacon. Chill covered for 1 hour before serving.\nServe with vegetables or chips.\n",
        "picture_link": "GKbxLtlcNYcYJkCoIQueDkF71pdnuSi"
    },
    {
        "title": "Lobster Risotto",
        "ingredients": [
            "1/4 cup olive oil, divided ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "6 cups chicken broth ADVERTISEMENT",
            "1 shallot, chopped ADVERTISEMENT",
            "1 clove garlic, chopped ADVERTISEMENT",
            "1 1/2 cups Arborio rice ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1 cup light cream ADVERTISEMENT",
            "1 tablespoon paprika ADVERTISEMENT",
            "1 teaspoon cayenne pepper ADVERTISEMENT",
            "1/4 cup sherry ADVERTISEMENT",
            "2 cups cooked lobster meat ADVERTISEMENT",
            "1/2 cup shredded Parmesan cheese ADVERTISEMENT",
            "1 pinch salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 2 tablespoons oil in a large skillet over medium heat; cook and stir onions until light brown and tender, about 20 minutes.\nBring chicken broth to a boil in a pot; reduce heat to low and keep at a simmer.\nHeat remaining 2 tablespoons oil in a large, flat-bottom pan over medium-high heat. Cook and stir shallot and garlic in the hot oil until fragrant, about 2 minutes. Add Arborio rice to shallot mixture; cook and stir until rice begins to brown, about 3 minutes. Add wine and cook for 1 minute.\nStir 1 cup chicken broth into rice mixture; cook, stirring constantly, until broth is absorbed. Repeat adding broth, 1 cup at a time, until all the broth is used, stirring constantly until broth is absorbed each time, about 30 minutes.\nMix honey into onions and cook 5 minutes more.\nStir butter into rice mixture until melted. Add cream and stir until rice mixture thickens, about 3 minutes. Add paprika and cayenne pepper; stir well. Add sherry and mix well. Stir lobster meat into rice mixture and cook until heated through, about 3 minutes. Mix Parmesan cheese into rice mixture until melted. Add onion mixture and mix well; season with salt and pepper.\n",
        "picture_link": "8Hdn1DTSsUMQf2tC97BILJoOSLE98eK"
    },
    {
        "title": "Bacon Wrapped Turkey Breast Stuffed with Spinach and Feta",
        "ingredients": [
            "1 large turkey breast ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 cup fresh spinach, or to taste ADVERTISEMENT",
            "1/4 cup crumbled feta cheese ADVERTISEMENT",
            "12 slices reduced-sodium bacon, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSlice turkey breast down the middle and lay it flat. Sprinkle oregano, cumin, salt, and pepper on the inside of turkey. Arrange spinach leaves in 1 layer on 1 of the pieces of turkey and top with a layer of feta cheese. Repeat layering with spinach and feta cheese. Fold the other turkey breast half over the feta layer so the filling is sealed. Wrap the entire turkey breast with bacon. Place wrapped turkey in a baking dish and season with salt and pepper.\nCook turkey breast until no longer pink in the center and the juices run clear, about 30 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nTurn on oven's broiler and broil wrapped turkey until bacon is crisp on each side, about 2 minutes per side. Let turkey rest for 10 minutes before slicing.\n",
        "picture_link": "QgSHGpeQha9Dk4cqYxVE3CiWiBgy0ra"
    },
    {
        "title": "Pancetta Brussels Sprouts with Caramelized Pecans",
        "ingredients": [
            "2 pounds Brussels sprouts, cut in half lengthwise ADVERTISEMENT",
            "4 ounces pancetta, coarsely chopped ADVERTISEMENT",
            "3 tablespoons extra virgin olive oil ADVERTISEMENT",
            "1 1/2 teaspoons kosher salt, divided ADVERTISEMENT",
            "2 tablespoons dark brown sugar, divided ADVERTISEMENT",
            "1 tablespoon unsalted butter ADVERTISEMENT",
            "1 cup whole pecans ADVERTISEMENT",
            "Reynolds Wrap® Aluminum Foil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 400 degrees F. Toss the Brussels sprouts with pancetta, olive oil, 1 teaspoon salt and 1 tablespoon of the brown sugar. Place in a casserole pan and cover the pan with a sheet of Reynolds Wrap(R) Aluminum Foil.\nRoast for 30 minutes, then remove the foil and continue roasting until the Brussels sprouts are lightly browned around the edges, about 10 to 15 minutes more. Remove from oven and set aside.\nMelt the butter and remaining tablespoon brown sugar in a medium-sized frying pan over medium heat, stirring every few minutes. Once the sugar has melted, add the pecans and stir to coat. Let them sit for a few minutes until they smell toasty, then stir. Continue to stir every few minutes until most of the pecans are lightly browned and very aromatic.\nRemove the pan from the heat and empty the mixture onto a large baking sheet lined with Reynolds(R) Parchment Paper. Smooth the pecans so they are in one layer, then sprinkle with 1/2 teaspoon salt. Place the pan in the freezer for 10 minutes to allow the nuts to harden, then remove the pan and separate the pecans by hand.\nToss the roasted Brussels sprouts with caramelized pecans before serving.\n",
        "picture_link": ".ok9UKUr2MutWXTml4rgQc3dxmLvZWq"
    },
    {
        "title": "Chilled Corn Cauliflower Soup",
        "ingredients": [
            "4 tablespoons canola oil ADVERTISEMENT",
            "2 cups chopped cauliflower florets ADVERTISEMENT",
            "3/4 cup chopped onion ADVERTISEMENT",
            "3/4 teaspoon salt, divided ADVERTISEMENT",
            "4 cups frozen corn ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "3 cups Swanson® Chicken Broth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large saucepan over medium heat; add cauliflower, onions, and 1/4 teaspoon salt. Reduce heat to medium-low; cover. Cook until onions are softened, stirring occasionally, about 8 minutes. Add corn and garlic; cover. Cook 4 minutes; add Swanson(R) Chicken Broth and remaining 1/2 teaspoon salt. Increase heat to medium-high; bring to a boil. Remove from heat.\nPlace half of corn mixture in a blender. Cover and hold lid down; pulse a few times before leaving on to blend. Blend until smooth. Repeat procedure with remaining corn mixture. Chill at least 4 hours.\nServe chilled soup with your choice of garnishes.\n",
        "picture_link": "hUHIGU5CdBg4NnwUsXry9dPqeust0SS"
    },
    {
        "title": "Eggplant and Tomato Caponata",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 Japanese eggplant, cut into 1/2-inch cubes ADVERTISEMENT",
            "1 yellow onion, chopped ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 (14.5 ounce) can fire-roasted tomatoes (such as Hunt's®) ADVERTISEMENT",
            "1/3 cup red wine ADVERTISEMENT",
            "1 1/2 tablespoons capers ADVERTISEMENT",
            "2 teaspoons dried oregano ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground allspice ADVERTISEMENT",
            "1 teaspoon unsweetened cocoa powder ADVERTISEMENT",
            "1/2 teaspoon white sugar ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a skillet over medium-high heat; saute eggplant, onion, and garlic until lightly browned, 5 to 7 minutes. Add tomatoes, red wine, and capers and simmer until heated through, about 5 minutes.\nMix oregano, cinnamon, allspice, cocoa powder, sugar, and bay leaf into eggplant mixture; simmer until thickened, 30 minutes. Add a few tablespoons water if mixture becomes too thick. Remove bay leaf.\n",
        "picture_link": "u9mSB9MNwQRluy7vyVsMelLwk3ewiga"
    },
    {
        "title": "Superfood Chocolate Pudding Smoothie",
        "ingredients": [
            "1 small banana, chopped ADVERTISEMENT",
            "1/2 avocado ADVERTISEMENT",
            "1/2 cup soy milk ADVERTISEMENT",
            "2 tablespoons mixed frozen berries ADVERTISEMENT",
            "2 teaspoons unsweetened cocoa powder ADVERTISEMENT",
            "2 teaspoons agave nectar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend banana, avocado, soy milk, berries, cocoa powder, agave nectar, and vanilla extract together in a blender until smooth.\n",
        "picture_link": "RB1AjWL2PCS96eNWdYvuI9L1ueRTwce"
    },
    {
        "title": "Everyday Orzo with Sausage and Fresh Herbs",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "1/2 pound hot Italian sausage links, casings removed and cut into 1/2-inch pieces ADVERTISEMENT",
            "1 1/2 cups uncooked orzo pasta ADVERTISEMENT",
            "1 tablespoon chopped fresh chives ADVERTISEMENT",
            "1 teaspoon chopped fresh oregano ADVERTISEMENT",
            "3 cups Swanson® Chicken Broth ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1/4 cup shredded mozzarella cheese ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in large skillet over medium-high heat. Add sausage and cook until browned, about 2 minutes. Add orzo and stir until it begins to turn golden, about 2 minutes. Add chives and oregano; stir. Pour in Swanson Chicken Broth.\nBring to a low boil; reduce heat, cover, and let simmer over low heat until pasta is al dente, about 20 minutes.\nRemove from heat; stir in Parmesan and mozzarella cheeses. Top with parsley.\n",
        "picture_link": "ISR2U9dEEtGQzMxgQVYjuEkbQG4jSy."
    },
    {
        "title": "Strawberry Banana Protein Shake",
        "ingredients": [
            "1 cup skim milk ADVERTISEMENT",
            "1 scoop vanilla-flavored whey protein powder ADVERTISEMENT",
            "2 cups ice ADVERTISEMENT",
            "1 cup strawberries ADVERTISEMENT",
            "1 large banana ADVERTISEMENT",
            "1 tablespoon natural peanut butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Layer milk, protein powder, ice, strawberries, banana, and peanut butter in a blender in this order; blend until creamy and smooth.\n",
        "picture_link": "51KLRyalO0Wbwl3RmBmKq2Xuqx59hte"
    },
    {
        "title": "Jim's 'Painkiller' Hot Sauce",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1/3 cup chopped onion ADVERTISEMENT",
            "1/4 cup chopped carrot ADVERTISEMENT",
            "2 habanero peppers, chopped ADVERTISEMENT",
            "2 jalapeno peppers, chopped ADVERTISEMENT",
            "2 roma (plum) tomatoes, chopped ADVERTISEMENT",
            "1/2 cup fresh oregano leaves ADVERTISEMENT",
            "1/4 cup fresh parsley leaves ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "1/3 cup distilled white vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a saucepan over medium heat. Stir in the garlic, onion, and carrots. Cook and stir until the onion has softened and turned translucent and the carrot has softened, about 5 minutes. Scrape into a blender, and add the habanero peppers, jalapeno peppers, tomatoes, oregano, parsley, salt, pepper, and vinegar. Blend until smooth and pour back into the saucepan.\nBring the sauce to a simmer over medium heat and cook 3 to 5 minutes. Set aside until cool; pour into a bottle and refrigerate.\n",
        "picture_link": "zWaMgxA.kS6P3D84bBHtXc38z7tCUAS"
    },
    {
        "title": "Manx Broth",
        "ingredients": [
            "3 quarts water ADVERTISEMENT",
            "1 pound beef shank ADVERTISEMENT",
            "1/2 cup pearled barley ADVERTISEMENT",
            "1 carrot, coarsely chopped ADVERTISEMENT",
            "1/2 turnip, peeled and chopped ADVERTISEMENT",
            "1 leek, sliced ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "1 tablespoon dried thyme ADVERTISEMENT",
            "1/2 cup chopped fresh parsley ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring the water to a boil in a large pot. Add the beef shank, barley, carrot, turnip, leek and celery. Season with thyme, salt and pepper. Bring to a boil, then simmer gently over medium heat for 2 hours. Remove the shank from the pot and cut the meat into small pieces. Return the meat to the pot, and discard the bone. Return to a boil and then stir in the parsley. Serve very hot.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Mum's Mutton Curry",
        "ingredients": [
            "1 clove garlic, peeled ADVERTISEMENT",
            "1 (2 inch) piece fresh ginger root, peeled ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 (3 inch) cinnamon stick ADVERTISEMENT",
            "1/2 teaspoon cumin seeds ADVERTISEMENT",
            "1 star anise pod ADVERTISEMENT",
            "8 kaffir lime leaves ADVERTISEMENT",
            "2 pounds mutton, cubed ADVERTISEMENT",
            "10 shallots, sliced ADVERTISEMENT",
            "2 large tomatoes, chopped ADVERTISEMENT",
            "5 tablespoons curry powder ADVERTISEMENT",
            "1/2 cup coconut milk ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "4 large potatoes, peeled and cubed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the garlic and ginger in a food processor. Blend into a paste and set aside.\nHeat the oil in a large skillet over medium heat. Add the cinnamon stick, cumin seeds, anise pod, and lime leaves. Add the shallots; cook and stir until starting to brown, about 5 minutes. Stir in the ginger garlic paste. Cook and stir for a few more minutes, and then stir in the mutton and tomatoes. Cover and simmer over low heat for 30 minutes.\nStir in the curry powder, coconut milk and water and add the potato. Season with salt to taste. Cover and simmer until potato and mutton are tender, about 30 more minutes.\n",
        "picture_link": "LVrW4OfGblUD7GhquP4gISFvrkD5E4m"
    },
    {
        "title": "Mesquite Cookies",
        "ingredients": [
            "1/2 cup mesquite flour ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "3/4 cup butter, softened ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease cookie sheets. Whisk together the mesquite flour, all-purpose flour, and cinnamon; set aside.\nBeat the butter and sugar with an electric mixer in a bowl until smooth. Add the eggs one at a time, allowing each egg to blend into the butter mixture before adding the next. Mix in the flour mixture until just incorporated. Drop by teaspoonfuls onto the prepared cookie sheets.\nBake in the preheated oven until golden, 8 to 10 minutes. Remove from cookie sheets to cool on wire racks.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Seafood and Asparagus with Linguine",
        "ingredients": [
            "1/2 pound uncooked linguine ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 cups sliced fresh mushrooms ADVERTISEMENT",
            "1 cup dry white wine ADVERTISEMENT",
            "1/2 pound medium shrimp, peeled and deveined ADVERTISEMENT",
            "1 pound steamer clams in shell, scrubbed ADVERTISEMENT",
            "1 pound asparagus, trimmed and cut into 2-inch pieces ADVERTISEMENT",
            "1/2 pound bay scallops ADVERTISEMENT",
            "1/3 cup freshly grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with lightly salted water and bring to a boil. Stir in the linguine, and return to a boil. Cook the pasta uncovered, stirring occasionally, until cooked through, but still firm to the bite, about 11 minutes. Drain well in a colander; cover and keep warm.\nHeat the olive oil over medium heat in a large pot with a cover that will hold a steamer basket. Add the mushrooms; stir and cook for 3 minutes. Pour in the wine and bring to a boil; add the shrimp.\nPut the clams and asparagus into the steamer basket and place the basket into the pot over the shrimp and mushrooms. Cover and steam for 2 minutes. Lift the steamer basket and add the scallops to the shrimp and mushrooms. Cover and continue to steam until clam shells open and seafood is cooked, about 4 minutes.\nTip the clams and asparagus into the pot and combine with the shrimp and scallops. To serve, ladle seafood over the cooked linguine and sprinkle with grated Parmesan cheese.\n",
        "picture_link": "iwNCLQyul0MT4Qqq2AO0kDxXa7y9wom"
    },
    {
        "title": "Fireman's Sour",
        "ingredients": [
            "4 fluid ounces rum ADVERTISEMENT",
            "3 fluid ounces lime juice ADVERTISEMENT",
            "1 fluid ounce grenadine syrup ADVERTISEMENT",
            "1 fluid ounce simple syrup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the rum, lime juice, grenadine, and simple syrup into a cocktail shaker over ice. Cover, and shake until the outside of the shaker has frosted. Strain into clean test tubes or shot glasses to serve.\n",
        "picture_link": "2LlqSOPY9h09bSPUrB8RjtuLXcJ7liu"
    },
    {
        "title": "Butterless Dessert Cake",
        "ingredients": [
            "2 eggs, separated ADVERTISEMENT",
            "1/2 cup white sugar plus ADVERTISEMENT",
            "2 1/2 tablespoons white sugar ADVERTISEMENT",
            "2 small apples, peeled, cored, and roughly grated ADVERTISEMENT",
            "1/2 cup all-purpose flour plus ADVERTISEMENT",
            "2 1/2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "2 cups assorted fresh berries ADVERTISEMENT",
            "1 cup whipping cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease and flour a 9 inch log mold (baking dish that looks like a half pipe) or small loaf pan.\nUse an electric mixer to beat the egg yolks and the sugar until light. In a separate bowl, whip the egg whites until a beater lifted from the whites leaves a peak that folds over on itself. Fold the beaten egg whites, grated apples, flour, and baking powder into the egg yolk and sugar mixture. Gently stir batter to blend well. Spread the dough into the greased baking pan.\nBake in preheated oven for 30 minutes. Cool cake in pan before removing. Using an electric mixer, whip the cream in a chilled bowl until stiff peaks form. Serve cake with fresh berries and whipped cream.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Porcini-Braised Boar with Artichoke and Fennel",
        "ingredients": [
            "3 cups dry cannellini beans ADVERTISEMENT",
            "1 quart chicken or pork stock ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "4 pounds wild boar (cinghiale) roast, cut into serving-size pieces ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "8 ounces fresh porcini, chanterelles or stemmed shiitake mushrooms, thickly sliced ADVERTISEMENT",
            "1/4 cup chopped garlic ADVERTISEMENT",
            "1/4 cup minced fresh rosemary ADVERTISEMENT",
            "sea salt and ground black pepper to taste ADVERTISEMENT",
            "8 large artichoke hearts, cut into eighths ADVERTISEMENT",
            "2 large fennel bulbs, cored and thinly sliced ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "1/2 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "1/4 cup freshly squeezed lemon juice ADVERTISEMENT",
            "extra-virgin olive oil for drizzling ADVERTISEMENT",
            "1/2 cup grated pecorino Toscano (or pecorino Romano) cheese ADVERTISEMENT",
            "1/2 cup chopped Italian flat leaf parsley ADVERTISEMENT",
            "1 lemon, zested ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Soak beans in ample cold water overnight.\nDrain cannellini beans and pour into a large Dutch oven along with chicken stock and water. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer for 1 hour, skimming any foam that forms. Remove boar from the refrigerator and allow to rest at room temperature during this time.\nHeat 1/4-cup olive oil in a large skillet over high heat until it begins to smoke. Add boar pieces, and sear until browned on all sides. Remove seared boar, and place into the pot, on top of the gently simmering beans. Heat the skillet until smoking once again, then stir in porcini mushrooms and cook for 2 minutes to soften. Add 1/4 cup garlic and continue cooking until the garlic has turned golden brown. Sprinkle with chopped rosemary and cook for 30 seconds more before adding the mushrooms to the boar and beans.\nCover, and continue simmering the boar and beans until both are tender, adding additional water if needed, about 1 1/2 hours. Once ready, season lightly to taste with sea salt and freshly ground pepper.\nWhen the beans are nearly ready, place the artichoke hearts into a large skillet with some water. Cover, and steam over high heat until just tender, about 2 minutes; then add the sliced fennel, and steam for 1 minute more. Drain in a colander, and return skillet to the stove.\nReduce heat to medium-high and pour in 1/4 cup of olive oil and 2 tablespoons of minced garlic. Cook, stirring frequently, until the garlic turns golden, then sprinkle with red pepper flakes and add the drained vegetables. Stir and cook until the vegetables are tender and golden, about 2 minutes. Pour in white wine, cook until nearly evaporated, then season with lemon juice, salt and pepper.\nTo serve, mound vegetables into the center of a large platter and place the pieces of boar on top. Spoon the beans around the vegetables, drizzle liberally with extra-virgin olive oil, and sprinkle with pecorino Toscano cheese, parsley, and strands of lemon zest.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Beeless Honey",
        "ingredients": [
            "2 1/2 cups water ADVERTISEMENT",
            "10 cups white sugar ADVERTISEMENT",
            "1 teaspoon alum ADVERTISEMENT",
            "18 red clover blossoms ADVERTISEMENT",
            "36 white clover blossoms ADVERTISEMENT",
            "18 rose petals ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour water, sugar, and alum into a large saucepan or Dutch oven. Place over high heat and bring to a boil. Reduce heat to medium and boil for 10 minutes. Skim any scum that forms on the top.\nRemove syrup from the heat and stir in flowers. Allow to steep for 10 minutes, then stir, and strain into storage jars.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Meyer Lemonade with Mint",
        "ingredients": [
            "7 Meyer lemons, juiced ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "1/4 cup chopped fresh mint ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Strain the lemon juice into a pitcher, and add the water, powdered sugar, and mint. Stir until the sugar has dissolved. Refrigerate at least 2 hours before serving.\n",
        "picture_link": "02iLlFZ2vasp.nC4F62po5akGQ62POW"
    },
    {
        "title": "Cream of Almond Soup",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1 clove garlic, peeled and crushed ADVERTISEMENT",
            "1 large stalk celery, thinly sliced ADVERTISEMENT",
            "3 cups chicken or vegetable broth ADVERTISEMENT",
            "2/3 cup ground almonds ADVERTISEMENT",
            "1/8 teaspoon ground mace ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "2 tablespoons toasted slivered almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a saucepan over medium heat. Add garlic and celery; cook and stir until softened, 4 to 5 minutes. Pour in chicken broth, increase heat to medium-high, and bring to a simmer. Stir in almond butter until dissolved and season with mace. Reduce heat to medium-low, cover, and simmer until the celery is tender, 30 to 40 minutes.\nOnce the celery is tender, turn off heat, and allow the soup to stand covered for 1 hour.\nCarefully puree the warm soup until smooth using a blender or immersion blender; pour through a sieve into a clean saucepan. Stir in cream and place over medium-low heat. Heat until hot, being careful not to bring to a boil or else the cream will curdle. Season with salt to taste; serve garnished with toasted slivered almonds.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Spinach, Ricotta and Pumpkin Lasagna",
        "ingredients": [
            "1 pound peeled and seeded pumpkin, cut into pieces ADVERTISEMENT",
            "1 tablespoon butter, softened ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "sea salt and ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 onion, thinly sliced ADVERTISEMENT",
            "1 fennel bulb, thinly sliced ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 (10 ounce) bag baby spinach ADVERTISEMENT",
            "1 (16 ounce) container low-fat ricotta cheese ADVERTISEMENT",
            "1 1/2 teaspoons ground nutmeg ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 pound lean ground beef ADVERTISEMENT",
            "2 tablespoons tomato paste ADVERTISEMENT",
            "1 (14.25 ounce) can tomato puree ADVERTISEMENT",
            "12 dry lasagna noodles ADVERTISEMENT",
            "1/3 cup freshly grated Parmesan ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a saucepan with 1/2 inch of water, then add pumpkin pieces. Bring to a boil over high heat, then reduce heat to medium-low, cover, and steam until the pumpkin is very tender, 10 to 15 minutes. Drain pumpkin, then mash with 1 tablespoon butter, cinnamon; salt and pepper to taste, then set aside.\nMelt 2 tablespoons butter in a saucepan over medium heat. Whisk in flour and cook, stirring constantly, until the paste just begins to turn golden, about 2 minutes. Whisk in milk gradually so that no lumps form. Bring to a gentle boil. Add the bay leaves, and reduce heat to low or warm. Allow to gently cook for 10 to 15 minutes, stirring frequently, then remove from heat.\nHeat 1 tablespoon olive oil in a large skillet over medium heat. Stir in onion, fennel, and garlic; cook until the onion has softened and turned translucent, about 5 minutes. Add spinach and cook until wilted. Scrape mixture into a large bowl, and mix well with ricotta cheese and nutmeg.\nUsing the same skillet, heat another 1 tablespoon olive oil over high heat. Brown ground beef in oil, mixing thoroughly to break into small pieces. Once browned, reduce heat to medium-low and pour off excess grease. Stir in tomato paste and tomato puree. Gently simmer until thickened, about 10 minutes.\nPreheat oven to 400 degrees F (200 degrees C). Grease a 9x13 inch lasagna dish.\nLine the bottom of the lasagna dish with 4 noodles, do not overlap. Spread the ricotta mixture evenly over noodles, then sprinkle with 1/3 of the Parmesan cheese. Place another 4 noodles on top of the ricotta, then spread with evenly with the mashed pumpkin. Place the remaining 4 noodles on top of the pumpkin and top with the tomato sauce; sprinkle with another 1/3 of the Parmesan cheese. Stir the white sauce until smooth, then discard the bay leaves; pour the sauce over top of the lasagna. Sprinkle with remaining Parmesan cheese.\nPlace lasagna dish onto a foil-lined baking sheet (to catch any spills). Bake in preheated oven until the noodles have softened, and the white sauce has turned bubbly and golden brown, about 30 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Rice Salad with Prosciutto and Artichokes",
        "ingredients": [
            "2 tablespoons white wine vinegar ADVERTISEMENT",
            "3 tablespoons lemon juice ADVERTISEMENT",
            "2 teaspoons Dijon mustard ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "4 cups cold, cooked white rice ADVERTISEMENT",
            "1 (12 ounce) jar marinated artichoke hearts, drained and halved ADVERTISEMENT",
            "3 ounces diced prosciutto ADVERTISEMENT",
            "3 tablespoons minced fresh parsley ADVERTISEMENT",
            "3 tablespoons chopped fresh basil ADVERTISEMENT",
            "4 green onions, minced ADVERTISEMENT",
            "1/4 cup freshly grated Parmesan cheese ADVERTISEMENT",
            "pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together vinegar, lemon juice, Dijon mustard, and olive oil in a small bowl until blended; set aside. In a large bowl, toss rice together with artichokes, prosciutto, parsley, basil, green onions, and Parmesan cheese. Pour in dressing and stir to mix. Season to taste with pepper. Serve either chilled or at room temperature.\n",
        "picture_link": "OYAOoAvBhCMlaaBx5lJ896wOC/YpU9C"
    },
    {
        "title": "Baby Back Ribs with Spicy Papaya Sauce",
        "ingredients": [
            "1 clove garlic, minced ADVERTISEMENT",
            "1 cup papaya - peeled, seeded and cubed ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "1/4 cup tomato paste ADVERTISEMENT",
            "4 pounds pork spareribs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the garlic, papaya, water, wine, honey, and tomato paste into a food processor. Pulse until until the mixture is finely chopped, about 15 seconds. Place the ribs into a 9x13 inch glass baking dish, and pour the marinade overtop. Mix the ribs around in the marinade to ensure they are evenly coated. Cover with plastic wrap, and refrigerate 6 hours to overnight (overnight is best).\nPreheat an oven to 400 degrees F (200 degrees C).\nRemove the ribs from the marinade, and shake off excess. Scrape the marinade into a small saucepan and bring to a boil over high heat. Reduce heat to medium-low, and simmer for 10 minutes; set aside.\nBake the ribs in the preheated oven until the meat pulls away easily from the bone, about 1 1/2 hours. Baste every 15 minutes with the reserved marinade.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Malibu™-Bailey's Colada",
        "ingredients": [
            "1/2 cup Irish cream liqueur (such as Baileys®) ADVERTISEMENT",
            "1/2 cup coconut-flavored rum (such as Malibu®) ADVERTISEMENT",
            "1/2 cup pineapple juice ADVERTISEMENT",
            "1/2 cup cream of coconut ADVERTISEMENT",
            "6 ice cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the Irish cream liqueur, rum, pineapple juice, and cream of coconut together in a large pitcher. Pour 1/2 cup into a blender container. Add the ice cubes and blend to desired consistency. Pour the ice mixture into two glasses, dividing equally, and fill with the remaining rum mixture.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Knudson's Knasty Habit",
        "ingredients": [
            "2 cups ice cubes ADVERTISEMENT",
            "2 fluid ounces gin, such as Tanqueray® ADVERTISEMENT",
            "1/2 fluid ounce fresh lemon juice ADVERTISEMENT",
            "1/2 fluid ounce fresh lime juice ADVERTISEMENT",
            "1/2 fluid ounce simple syrup, or to taste ADVERTISEMENT",
            "1 dash bitters ADVERTISEMENT",
            "2 fluid ounces Knudsen's (sic) lemon-lime spritzer ADVERTISEMENT",
            "1 lime slice for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a cocktail shaker with ice. Pour in gin, lemon juice, lime juice, simple syrup, and dash of bitters. Cover and shake rapidly. Strain into a highball glass full of ice. Pour in lemon and lime spritzer and stir. Garnish with the lime slice. Unleash the monkey.\n",
        "picture_link": "DY0ouoemu7KoUOsuClqlstGHgR/BOna"
    },
    {
        "title": "Angel Hair de la Mer",
        "ingredients": [
            "1 (8 ounce) package angel hair pasta ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "2 (4 ounce) links sweet Italian sausage links, cut into 1/2 inch slices ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 small sweet onion, diced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 orange bell pepper, diced ADVERTISEMENT",
            "1 (16 ounce) package frozen stir-fry vegetables, thawed ADVERTISEMENT",
            "1 tablespoon sea salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "15 middleneck clams, scrubbed ADVERTISEMENT",
            "1/2 pound mussels, scrubbed and debearded ADVERTISEMENT",
            "1/2 pound peeled and deveined medium shrimp ADVERTISEMENT",
            "1/2 pound bay scallops ADVERTISEMENT",
            "1 tablespoon dried parsley ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil over high heat. Add the angel hair pasta, and cook until al dente, 3 to 4 minutes; drain and keep warm.\nHeat the olive oil in a large skillet over medium-high heat. Add the sausage slices, and cook until lightly browned on both sides, about 2 minutes per side. Reduce the heat to medium, and stir in 2 tablespoons of butter along with the onion, garlic, bell pepper, stir-fry vegetables, salt, and pepper. Cook and stir until the sausage is no longer pink in the center, and the vegetables have softened, 10-12 minutes.\nMeanwhile, place the clams, mussels, and shrimp in a steamer over 1 inch of boiling water, and cover. Remove the shrimp once they turn pink, after about 3 minutes. Remove the clams and mussels as soon as they open, after 3 to 5 minutes all together. Discard any clams and mussels that do not open. Set the seafood aside and keep warm.\nPlace the scallops into the skillet with the vegetable mixture, and gently cook until the scallops are no longer opaque in the center, about 3 minutes. Gently stir in the steamed seafood, parsley, and remaining 2 tablespoons of butter. Serve the seafood and vegetable mixture over a bed of angel hair pasta.\n",
        "picture_link": "k3Zhm8M9L2gp/9310islPxhZcB4QVgq"
    },
    {
        "title": "Kamikaze Shots for a Crowd",
        "ingredients": [
            "6 fluid ounces vodka ADVERTISEMENT",
            "3 fluid ounces lime juice ADVERTISEMENT",
            "3 fluid ounces triple sec ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the vodka, lime juice, and triple sec into a cocktail shaker over ice. Cover, and shake until the outside of the shaker has frosted. Strain into a chilled shot glasses to serve.\n",
        "picture_link": "hN93X2I6R1OBrZdwH38FomhUU6vjEqS"
    },
    {
        "title": "Lamb, Carrot, and White Bean Curry Stew",
        "ingredients": [
            "1 pound ground lamb ADVERTISEMENT",
            "1 onion, grated ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "3 tablespoons minced fresh dill ADVERTISEMENT",
            "1/4 cup minced fresh cilantro ADVERTISEMENT",
            "2 teaspoons coarse salt ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 (8 ounce) package baby carrots ADVERTISEMENT",
            "2 (15.5 ounce) cans cannellini beans ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 tablespoon sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together the ground lamb, onion, egg, dill, cilantro, salt, cumin, turmeric, cinnamon, and pepper in a bowl until evenly incorporated.\nHeat the olive oil in a skillet over medium-high heat. Crumble the lamb mixture into the skillet and cook until no longer pink, 5 to 10 minutes. Add the carrots to the mixture; reduce heat to medium. Pour in the contents of the 2 cans of beans and the water; stir. Simmer mixture 25 minutes. Stir the sour cream through the mixture; cook until the liquid thickens, 5 to 10 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Matcha Madness",
        "ingredients": [
            "1 cup low-fat soy milk ADVERTISEMENT",
            "1/2 cup low-fat vanilla Greek-style yogurt ADVERTISEMENT",
            "3/4 teaspoon green tea powder (matcha) ADVERTISEMENT",
            "3 cubes ice, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend soy milk, yogurt, green tea powder, and ice in a blender on high until ice is entirely crushed, about 1 minute.\n",
        "picture_link": "saqjUicN1PMDUD2HJhjDy.hCUydywjO"
    },
    {
        "title": "Elfie's Ranch Beer Butt Chicken",
        "ingredients": [
            "1/2 (12 ounce) can beer ADVERTISEMENT",
            "1 (4 pound) whole chicken ADVERTISEMENT",
            "2 cups ranch salad dressing ADVERTISEMENT",
            "1/4 cup minced onion ADVERTISEMENT",
            "2 tablespoons garlic salt ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill for low heat and lightly oil the grate.\nPlace beer can on a disposable aluminum baking sheet and set chicken upright onto the can, inserting can into cavity. Mix ranch salad dressing, onion, garlic salt, salt, and ground black pepper in a bowl. Paint the outside of chicken with ranch dressing mixture.\nPlace chicken on the baking sheet on the preheated grill. As the chicken roasts, paint the skin several times with the ranch dressing mixture. Cook until an instant-read thermometer inserted into the thickest part of a thigh, not touching bone, reads 180 degrees F (80 degrees C), about 3 hours.\n",
        "picture_link": "4nje1FRCkxQ76eoYFzWj9eWf.v.UF.O"
    },
    {
        "title": "Cucumber Ketchup",
        "ingredients": [
            "3 very large cucumbers - peeled, seeded, and chopped ADVERTISEMENT",
            "2 large onions, chopped ADVERTISEMENT",
            "1/2 cup salt ADVERTISEMENT",
            "1 cup apple cider vinegar ADVERTISEMENT",
            "1/4 cup mustard seed ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix cucumbers and onions in a large bowl; stir in salt until thoroughly combined. Transfer mixture to a colander, cover colander with plastic wrap, and let drain overnight.\nPlace drained vegetables into a large bowl and pour in apple cider vinegar; stir to combine. Working in batches if necessary, place vegetables with vinegar into a blender and puree. Pour puree into a bowl and season with mustard seed and black pepper. Spoon the ketchup into small jars with lids; cover and store in refrigerator for 3 days before serving. Ketchup keeps well in the refrigerator.\n",
        "picture_link": "Ob9x9FZ23vHP1IPscguHR2l9CeNUblm"
    },
    {
        "title": "Deborah's Slow Cooker Spicy Black Eyed Peas",
        "ingredients": [
            "4 (14 ounce) cans black-eyed peas, rinsed and drained ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "1 cup diced cooked ham ADVERTISEMENT",
            "1 1/2 cups chopped green bell pepper ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes with green chile peppers, drained ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon seasoned salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine black-eyed peas, butter, onion, ham, bell pepper, diced tomatoes with green chile peppers, garlic, and seasoned salt in a slow cooker.\nCook on Low for 4 hours.\n",
        "picture_link": "oOH4Zh7CTiG90PjM9PCVnWJFwWO6Yc."
    },
    {
        "title": "Down Home Collard Greens",
        "ingredients": [
            "1 bunch collard greens, chopped ADVERTISEMENT",
            "1 (16 ounce) package hickory-smoked bacon, diced ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "2 cubes chicken bouillon, crumbled ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1 pinch ground thyme, or to taste ADVERTISEMENT",
            "1 pinch dried savory, or to taste ADVERTISEMENT",
            "4 teaspoons milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put collard greens in a pot full of lightly salted water; bring to a boil, reduce heat to medium-low, and cook until tender, about 1 hour. Drain.\nCook bacon in a large skillet over medium-high heat until crisp, about 10 minutes. Drain the bacon on paper towels.\nMelt butter in a large pot over medium heat. Cook and stir onion in melted butter until tender, 7 to 10 minutes. Stir bacon, chicken bouillon, water, garlic, oregano, thyme, and savory into the onion; bring to a boil. Stir collard greens into the mixture and simmer 5 minutes. Pour milk over the mixture, stir, and cook another 5 minutes.\n",
        "picture_link": "Xp26VyjEViQ1UabbUopdNlxIGL4jjoO"
    },
    {
        "title": "Drunken Grapefruit Salad",
        "ingredients": [
            "8 cups refrigerated grapefruit, drained and juice reserved ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "3 fluid ounces gin ADVERTISEMENT",
            "8 leaves fresh mint, minced ADVERTISEMENT",
            "8 whole mint leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix grapefruit, 1/2 cup reserved juice, and sugar in a bowl until sugar dissolves. Transfer grapefruit mixture to 8 serving cups; top each with about 1 teaspoon gin. Sprinkle minced mint over each cup. Garnish each cup with 1 mint leaf.\n",
        "picture_link": "lEasRGd8aUj1kqZu86kBmBIXilHZK9y"
    },
    {
        "title": "Blueberry Muffins on Steroids",
        "ingredients": [
            "1 cup oat flour ADVERTISEMENT",
            "1 cup whole wheat flour ADVERTISEMENT",
            "1 cup oat bran ADVERTISEMENT",
            "1 cup multi-grain hot cereal with flaxseed (such as Hodgson Mill Multi Grain with Flaxseed Hot Cereal®) ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground allspice ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 cup vanilla fat-free yogurt ADVERTISEMENT",
            "1 cup skim milk ADVERTISEMENT",
            "2 egg whites, lightly beaten ADVERTISEMENT",
            "2 tablespoons canola oil ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 cup fresh blueberries ADVERTISEMENT",
            "1 cup pecan halves (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line a muffin tin with paper liners.\nMix oat flour, whole wheat flour, oat bran, hot cereal, cinnamon, allspice, and baking powder together in a bowl. Combine yogurt, milk, egg whites, canola oil, honey, and vanilla extract together in a separate bowl. Add yogurt mixture to flour mixture; stir to combine. Fold blueberries and pecans into batter. Spoon batter into prepared muffin cups.\nBake muffins in the preheated oven until a toothpick inserted into the center of a muffin comes out clean, about 20 minutes.\n",
        "picture_link": "X9OI0ex43Rqg4e7xbyb.N7cpf5PizRy"
    },
    {
        "title": "Roasted Tomato Salad",
        "ingredients": [
            "3 tomatoes, cut into wedges ADVERTISEMENT",
            "1 onion, thinly sliced ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "3 tablespoons very thinly sliced fresh basil leaves ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon dried marjoram ADVERTISEMENT",
            "kosher salt and ground black pepper to taste ADVERTISEMENT",
            "3 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "1 tablespoon balsamic vinegar ADVERTISEMENT",
            "1 head Boston lettuce, leaves separated ADVERTISEMENT",
            "4 romaine lettuce leaves, thinly sliced ADVERTISEMENT",
            "3 ounces freshly shaved Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix tomatoes, onion, garlic, basil leaves, oregano, and marjoram in an 8x8-inch baking dish; sprinkle with kosher salt and black pepper. Drizzle with olive oil and balsamic vinegar and toss ingredients to combine.\nRoast in the preheated oven until the tomatoes and onion are soft and the juices turn brown and sticky, 20 to 30 minutes. Set aside to cool while you complete the remaining steps.\nPlace a Boston lettuce leaf onto 6 serving plates and sprinkle shredded romaine lettuce over each leaf. Divide the warm roasted tomato mixture among each salad; top salads with shaved Parmesan cheese. If any caramelized tomato juices remain in the pan, spoon over the salads.\n",
        "picture_link": "IG0Id.RIzjgQnsHU5IOzC6KG44RZAZ6"
    },
    {
        "title": "Pecan Honey Glazed Fried Chicken",
        "ingredients": [
            "1 quart peanut oil for frying, or as needed ADVERTISEMENT",
            "1 whole whole chicken, cut into 8 pieces ADVERTISEMENT",
            "1 teaspoon seasoned salt, or to taste ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "2 cups self-rising flour ADVERTISEMENT",
            "1 pinch salt and ground black pepper to taste ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat peanut oil in deep skillet or deep-fryer to 375 degrees F (190 degrees C). Oil should be deep enough to cover chicken pieces halfway.\nSeason chicken pieces on all sides with seasoned salt.\nPut beaten eggs in a large bowl. Mix flour, salt, and black pepper in a large paper bag.\nDip seasoned chicken into beaten egg; place each piece into bag containing seasoned flour and shake to coat.\nCook chicken in hot oil until no longer pink at the bone and the juices run clear, about 10 minutes per side. An instant-read thermometer inserted into the thickest part of the thigh near the bone should read 165 degrees F (75 degrees C). Transfer chicken to a plate lined with paper towels to drain.\nMelt butter in saucepan over medium heat. Whisk honey into melted butter; cook, whisking occasionally, until bubbles start to form, about 5 minutes. Reduce heat to low; simmer another 10 minutes. Fold pecans into butter mixture; cook until the pecans are hot, 2 to 3 minutes. Drizzle over hot chicken pieces to serve.\n",
        "picture_link": "bycKSqHBZlNv.ZBa2SaJRis5V9dOte2"
    },
    {
        "title": "Paleo-Style Fire Roasted Salsa",
        "ingredients": [
            "1 dried chipotle chili pepper ADVERTISEMENT",
            "6 roma tomatoes, halved lengthwise ADVERTISEMENT",
            "1 clove garlic ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "1 small white onion, quartered ADVERTISEMENT",
            "1 jalapeno pepper, seeded and coarsely chopped ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a small bowl with water and submerge chipotle chile pepper in the water until softened and rehydrated, 10 to 15 minutes. Remove chipotle pepper and set aside.\nSet oven rack about 6 inches from the heat source and preheat the oven's broiler. Line a baking sheet with aluminum foil.\nPlace tomatoes on the prepared baking sheet, and broil until the skins are charred, 13 to 15 minutes. Flip and char the other side for an additional 5 minutes.\nCombine charred tomatoes, garlic, cilantro, white onion, jalapeno pepper, chipotle pepper, and lime juice in a food processor; puree until evenly blended.\n",
        "picture_link": "n4ZwMZuI0rS7cqdSOiell5dSHu/x5h6"
    },
    {
        "title": "Keema Matar",
        "ingredients": [
            "1 pound ground lamb ADVERTISEMENT",
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1 clove garlic, pressed ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "3 tablespoons mild curry paste ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "1 cup fresh or frozen peas, thawed ADVERTISEMENT",
            "3 sprigs cilantro, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a skillet over medium-high heat. Stir in the ground lamb, and cook until browned and crumbly, about 5 minutes. Drain off excess grease, and set meat aside. Heat vegetable oil in the same skillet, and stir in onion; cook and stir until the onion begins to brown, about 3 minutes. Stir in garlic, and continue cooking 1 minute more.\nStir the cooked lamb back into the skillet along with the tomato paste, curry paste, and water. Bring to a boil, then reduce heat to medium-low, cover, and simmer 15 minutes. Stir in peas, cover, and simmer 5 minutes more. Pour into a serving dish and garnish with cilantro.\n",
        "picture_link": "3r5wMEr9TR5lfC8zjQChSBeqHJP3vZy"
    },
    {
        "title": "Mediterranean Seafood Medley",
        "ingredients": [
            "20 baby squid (tubes and tentacles), cleaned ADVERTISEMENT",
            "3 cups milk ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "8 cloves garlic, minced ADVERTISEMENT",
            "2 small onions, chopped ADVERTISEMENT",
            "2 large carrots, chopped ADVERTISEMENT",
            "2 tomatoes, chopped ADVERTISEMENT",
            "1 small fennel bulb, diced ADVERTISEMENT",
            "1/2 cup tomato paste ADVERTISEMENT",
            "1 cup dry white wine ADVERTISEMENT",
            "3 cups chicken stock ADVERTISEMENT",
            "1/2 bunch fresh parsley ADVERTISEMENT",
            "1/2 bunch fresh tarragon ADVERTISEMENT",
            "1/2 bunch fresh thyme ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "1 teaspoon black peppercorns ADVERTISEMENT",
            "1 tablespoon loosely packed saffron threads ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "6 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup oil-packed sun-dried tomatoes, drained and cut into strips ADVERTISEMENT",
            "6 baby fennel bulbs, halved ADVERTISEMENT",
            "1/2 bunch fresh thyme, chopped ADVERTISEMENT",
            "10 fresh oysters in shells, well scrubbed ADVERTISEMENT",
            "20 littleneck clams ADVERTISEMENT",
            "20 fresh mussels ADVERTISEMENT",
            "6 (6 ounce) fillets fresh sea bass ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "6 sprigs parsley, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Soak squid in milk for 1 to 5 hours; the longer the better. When the squid has finished soaking, strain, and discard the milk.\nHeat 2 tablespoons olive oil in a large pot over medium heat. Stir in the garlic, onions, carrots, tomatoes, and diced fennel. Cook and stir until the vegetables soften, about 10 minutes. Stir in tomato paste, and cook an additional 10 minutes. Pour in wine, and increase heat to high. Once the mixture comes to a boil, add the chicken stock, parsley, tarragon, thyme, bay leaves, peppercorns, and saffron. Return to a boil, then reduce heat to medium, and simmer until the liquid has reduced to 1 1/2 cups, about 15 minutes. Strain out the liquid, and discard the solids.\nHeat 2 tablespoons olive oil in a large pot over medium heat. Stir in garlic, and cook until fragrant, about 45 seconds. Add sun-dried tomatoes and fennel; cook for 2 minutes. Pour in the strained saffron broth and chopped thyme; increase heat to medium-high and bring to a boil. Place oysters on top of the fennel, cover, and cook for 1 minute. Set the clams and mussels into the pot, cover, and cook until the shellfish begin to open, about 4 minutes. Stir in the drained squid, recover, and cook for 1 minute, just until the squid firms.\nWhile the shellfish are cooking, season the sea bass fillets with salt and pepper. Heat the remaining 2 tablespoons olive oil in a large skillet over medium-high heat. Place fish into skillet, skin-side down. Cover, and cook until the skin is crispy and the flesh of the fish has firmed and is no longer translucent.\nPour the fennel-seafood mixture onto a serving platter and place the sea bass fillets on top. Garnish with parsley sprigs and serve.\n",
        "picture_link": "Ij/xrJa9S/GiMLS.eNZpNVI5N3EFJsu"
    },
    {
        "title": "Pimento Cheese Spread With Feta",
        "ingredients": [
            "1 pound shredded Cheddar cheese ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/3 cup crumbled feta cheese ADVERTISEMENT",
            "1 (2 ounce) jar chopped pimentos, drained ADVERTISEMENT",
            "1 1/2 teaspoons garlic powder ADVERTISEMENT",
            "1 1/2 teaspoons onion powder ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together the Cheddar cheese, mayonnaise, feta cheese, pimentos, garlic powder, onion powder, salt, and pepper in a bowl; cover. Refrigerate at least 1 hour.\n",
        "picture_link": "aw2Tt4HNaLSKq0gpdBbUzITEn8ic3b6"
    },
    {
        "title": "Microwave Tofu Banana Bread",
        "ingredients": [
            "1/2 (12 ounce) package silken tofu ADVERTISEMENT",
            "2 ripe bananas ADVERTISEMENT",
            "2 tablespoons miniature chocolate chips ADVERTISEMENT",
            "1 cup pancake mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the tofu, bananas, and 1 tablespoon of chocolate chips in the bowl of a food processor; blend on low to combine ingredients.\nMix together the pancake mix and the remaining 1 tablespoon of chocolate chips in a bowl. Stir in the banana mixture and blend until smooth. Spoon the batter into the bottom of a microwave-safe baking dish, spreading to 1 1/2 inch thickness.\nCover and cook in the microwave at full power for 3 minutes. Remove and invert onto a microwave-safe plate. If the cake is too moist, cook in the microwave 1 to 3 minutes more.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Quick and Spicy Salsa",
        "ingredients": [
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "1/3 cup chile paste ADVERTISEMENT",
            "2 teaspoons ketchup ADVERTISEMENT",
            "3 tablespoons hot sauce ADVERTISEMENT",
            "2 teaspoons strawberry jam, or to taste ADVERTISEMENT",
            "1 pinch white sugar, or to taste ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 pinch dried oregano ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together the tomato paste, chili paste, ketchup, hot sauce, jam, sugar, salt, and oregano in a bowl. Chill until ready to serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Quick Rum Frosting",
        "ingredients": [
            "1/4 cup butter, melted ADVERTISEMENT",
            "3 1/2 cups confectioners' sugar, sifted ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "5 tablespoons heavy whipping cream ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 1/2 teaspoons rum extract ADVERTISEMENT",
            "1 pinch ground allspice ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "1 pinch ground cloves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk butter in a large bowl until fluffy. Gradually add 1 cup of the sifted confectioners' sugar, beating well. Slowly beat in the salt and cream. Gradually beat in the remaining 2 1/2 cups of confectioners' sugar. Continue to beat until the frosting begins to thicken; whisk in the vanilla and rum extracts, allspice, nutmeg, and cloves. Allow to sit for 15 minutes before using.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Simple Spice Cake With a Hint of Grapefruit",
        "ingredients": [
            "1/2 cup white sugar ADVERTISEMENT",
            "1/3 cup butter, room temperature ADVERTISEMENT",
            "2 eggs, room temperature ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1 1/4 teaspoons baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "2 teaspoons grapefruit juice ADVERTISEMENT",
            "2/3 cup confectioners' sugar ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 tablespoon grapefruit juice ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCream together the butter and sugar in a large bowl until light and fluffy, about 5 minutes. Add eggs one at a time, beating well after each addition then stir in the milk and grapefruit juice. Mix in the flour, cinnamon, nutmeg, baking powder, and salt. Pour resulting batter into a 9x5 inch loaf pan.\nBake in preheated oven until a toothpick or small knife inserted in the crown comes out clean, about 45 minutes.\nWhile the cake is baking, prepare the icing. Place the sugar in a bowl and gradually stir in the water. Add the grapefruit juice and salt; pour over warm cake. It should form a glaze as it cools.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pineapple Steak Stir Fry",
        "ingredients": [
            "1 (8 ounce) can pineapple chunks - drained with juice reserved ADVERTISEMENT",
            "2 teaspoons rice wine vinegar ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "1 teaspoon olive oil ADVERTISEMENT",
            "1 teaspoon vanilla-flavored vodka ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon brown sugar ADVERTISEMENT",
            "1/2 teaspoon white sugar ADVERTISEMENT",
            "1 (1 1/2-pound) beef sirloin steak, cut into 1/4-inch strips ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "1/2 cup long grain white rice ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together 1/3 cup reserved pineapple juice, rice wine vinegar, soy sauce, olive oil, vanilla vodka, ginger, brown sugar, and white sugar in a mixing bowl until blended. Adjust the sugar to taste.\nPlace the steak strips in a large, resealable plastic bag. Pour in the pineapple juice mixture and seal the bag. Turn the bag gently to evenly coat steak with the marinade. Refrigerate 3 to 4 hours.\nBring water to a boil in a saucepan over medium-high heat. Add the rice and stir. Reduce heat, cover and simmer 20 minutes.\nHeat 2 tablespoons olive oil in a skillet over medium heat. Remove steak strips from marinade and place in the skillet. Cook and stir the steak strips until browned and no longer pink, about 2 minutes per side. Remove from the heat, cover and keep warm.\nPlace the pineapple chunks in a separate skillet. Cook over medium heat until slightly soft and heated through, about 4 minutes. To serve, divide the rice between two bowls, top with steak strips and pineapple chunks, and toss briefly.\n",
        "picture_link": "vgSgyRhemaoEQXjwHzxvx1qcM/9cabC"
    },
    {
        "title": "Rocky Mountain Citrus Martini",
        "ingredients": [
            "3/4 cup orange vodka ADVERTISEMENT",
            "3/4 cup white grapefruit juice ADVERTISEMENT",
            "3/4 cup white cranberry juice ADVERTISEMENT",
            "3 orange slices for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a cocktail shaker 1/4 full with ice cubes. Pour in vodka, grapefruit juice, and cranberry juice. Cover and shake until the outside of the shaker has frosted. Strain into three chilled martini glasses and garnish with a slice of orange.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Espresso Chip Ice Cream",
        "ingredients": [
            "3 egg yolks ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "2 1/2 cups whipping cream ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1/2 cup brewed espresso, at room temperature ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 cup chocolate covered espresso beans, chopped ADVERTISEMENT",
            "3/4 cup caramel topping ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir the egg yolks, milk, and cream together in a large pan over medium heat. Continue stirring, and cook the mixture until small bubbles form around the edges of the surface, but do not boil. Remove from the heat, and stir in the vanilla extract, espresso, and salt. Cover, and refrigerate at least 6 hours.\nPour the cream mixture into an ice cream maker, and freeze for 20 minutes according to manufacturer's instructions. Stir in the espresso beans. Gently fold in the caramel sauce, and continue freezing until hard.\n",
        "picture_link": "Ul6QuaiETiCs6mgRl1bKoxJosxSiKVe"
    },
    {
        "title": "Grown-Up Orange Juice",
        "ingredients": [
            "1 cup orange juice ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger rum ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "6 ice cubes ADVERTISEMENT",
            "2 orange slices for garnish ADVERTISEMENT",
            "2 maraschino cherries for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the orange juice and rum into a blender. Mix in the egg and pulse until smooth. Add the ice cubes and blend. Divide the mixture between two tall glasses and garnish each drink with orange slices and maraschino cherries.\n",
        "picture_link": "aHvnve6LWOY/TeO1kEZXgTOXiuAbLOG"
    },
    {
        "title": "Dutch Boterkoek",
        "ingredients": [
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder (optional) ADVERTISEMENT",
            "1 1/4 cups butter ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 tablespoon lemon zest ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 tablespoon milk (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 400 degrees F (200 degrees C). Lightly grease an 8-inch tart tin, or a 9-inch pie pan. Whisk together the flour and baking powder; set aside.\nBeat the butter, sugar, lemon zest, and vanilla extract with an electric mixer in a large bowl until smooth. Mix in the flour mixture until the dough forms ball. Press the dough into the prepared tin, and brush with the milk.\nBake in the preheated oven until golden brown and still somewhat soft at the center, about 35 minutes. Cool in the pan for 10 minutes, then remove, and cut into 16 wedges. Cool completely on a wire rack.\n",
        "picture_link": "WsHH3PaSp4qLAhKZrGYuKP93C7YvLHm"
    },
    {
        "title": "Garden Gazpacho Salad",
        "ingredients": [
            "1 (16 ounce) package fusilli (spiral) pasta ADVERTISEMENT",
            "2 cups chopped cooked chicken ADVERTISEMENT",
            "1 small cucumber, chopped ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "1 large tomato, chopped ADVERTISEMENT",
            "1 clove garlic, chopped ADVERTISEMENT",
            "3/4 cup spicy tomato-vegetable juice cocktail (e.g., V-8) ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nMix the pasta with the chicken, cucumber, bell pepper, tomato, and garlic. Pour the tomato-vegetable juice cocktail and lemon juice over the salad; gently toss to coat. Season with black pepper and salt; serve warm or chilled.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    }
]