[
    {
        "title": "The Best Chocolate Glaze",
        "ingredients": [
            "6 tablespoons cocoa powder ADVERTISEMENT",
            "5 tablespoons butter ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "3/4 teaspoon vanilla extract ADVERTISEMENT",
            "2 tablespoons hot water, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt cocoa and butter together in a small saucepan over low heat, about 5 minutes. Remove from heat; stir in confectioners' sugar and vanilla extract. Stir in hot water, 1 teaspoon at a time, until glaze is thick and smooth.\n",
        "picture_link": "LSXrkuCfm4K7yHt36HJHFjbGwEaTpjq"
    },
    {
        "title": "My Favorite Thousand Island Dressing",
        "ingredients": [
            "1 cup mayonnaise ADVERTISEMENT",
            "1/3 cup ketchup ADVERTISEMENT",
            "1/3 cup sweet pickle relish ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "1 (1 gram) packet granular sucralose sweetener (such as Splenda®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir mayonnaise, ketchup, pickle relish, lemon juice, and sweetener together in a bowl.\n",
        "picture_link": "8kULZ57ZvVrTu4I4Lx64pDUukdaWwOG"
    },
    {
        "title": "Creamy Blueberry Coconut Ricotta Bowl",
        "ingredients": [
            "1/4 cup whole milk ricotta cheese ADVERTISEMENT",
            "1 tablespoon coconut milk ADVERTISEMENT",
            "1 tablespoon honey, or to taste ADVERTISEMENT",
            "1 tablespoon slivered almonds ADVERTISEMENT",
            "1 tablespoon sweetened flaked coconut ADVERTISEMENT",
            "1/2 cup blueberries, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine ricotta cheese and coconut milk in a bowl. Drizzle on honey and sprinkle with almonds and coconut. Top with blueberries.\n",
        "picture_link": "8Wk4nVrRM1aU5KyTW5005STXH3J/F.u"
    },
    {
        "title": "Dutch Oven Caraway Rye Bread",
        "ingredients": [
            "2 cups light rye flour (such as Bob's Red Mill®) ADVERTISEMENT",
            "2 cups bread flour ADVERTISEMENT",
            "1/4 cup buttermilk ADVERTISEMENT",
            "2 tablespoons caraway seeds ADVERTISEMENT",
            "1 1/2 tablespoons vital wheat gluten (optional) ADVERTISEMENT",
            "2 teaspoons flaked kosher salt, crushed ADVERTISEMENT",
            "1 3/4 cups warm water ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "3/8 teaspoon active dry yeast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix rye flour, bread flour, buttermilk, caraway seeds, vital wheat gluten, and kosher salt together in a very large bowl.\nCombine water, sugar, and yeast in a bowl until yeast softens and begins to form a creamy foam, about 5 minutes. Stir yeast mixture into flour mixture until well mixed and caraway seeds are evenly distributed. Cover bowl with plastic wrap and let sit for 18 hours.\nTransfer dough to a heavily floured work surface. It will be somewhat elongated, so take the right and left sides and fold them into the middle. Turn dough over and gently use a spatula to tuck corners under; cover with plastic wrap for 15 minutes. Remove plastic wrap, dust dough with flour, and make shallow cuts in the top for full bloom.\nPlace a Dutch oven in the oven and preheat oven to 500 degrees F (260 degrees C).\nCarefully place dough in the Dutch oven, cover immediately, reduce oven temperature to 460 degrees F (238 degrees C), and bake until bread is cooked through, 30 to 35 minutes. Carefully transfer bread from the Dutch oven to the oven rack and bake for 5 minutes more.\n",
        "picture_link": "JQaL/iwXYDkzrd6CwNrYyB20zHc4tfW"
    },
    {
        "title": "Gluten-Free Nuts and Seeds Clusters",
        "ingredients": [
            "1 cup rolled oats ADVERTISEMENT",
            "3/4 cup oat flour ADVERTISEMENT",
            "1/4 cup sesame seeds ADVERTISEMENT",
            "1/4 cup cornstarch ADVERTISEMENT",
            "1/4 cup quinoa ADVERTISEMENT",
            "1/4 cup flaked coconut ADVERTISEMENT",
            "1/4 cup flax seed meal ADVERTISEMENT",
            "1/4 cup chia seeds ADVERTISEMENT",
            "1/4 cup walnuts, finely chopped ADVERTISEMENT",
            "1/4 cup raisins, finely chopped ADVERTISEMENT",
            "1/4 cup sunflower seeds, finely chopped ADVERTISEMENT",
            "1/4 cup white chocolate chips, finely chopped ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup honey ADVERTISEMENT",
            "2/3 cup applesauce ADVERTISEMENT",
            "1/2 cup coconut oil, melted ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a miniature muffin tin.\nCombine oats, oat flour, sesame seeds, cornstarch, quinoa, coconut, flax meal, chia seeds, walnuts, raisins, sunflower seeds, white chocolate chips, cinnamon, and salt in a large bowl.\nWhisk honey, applesauce, coconut oil, egg, and vanilla extract together in a separate bowl; stir into oats mixture. Scoop mixture into the prepared muffin tin, pressing gently to fit into each muffin cup.\nBake in the preheated oven until cooked through and lightly browned, 15 to 20 minutes.\n",
        "picture_link": "SMraiZoHQv9hIBtiQnQNB/AtnrPC42."
    },
    {
        "title": "Key Sir Alicha (Ethiopian Beets and Potatoes)",
        "ingredients": [
            "1/4 cup canola oil ADVERTISEMENT",
            "1 yellow onion, diced ADVERTISEMENT",
            "1/2 teaspoon salt, divided, or as needed ADVERTISEMENT",
            "1 1/2 teaspoons minced fresh garlic ADVERTISEMENT",
            "1 1/2 teaspoons minced fresh ginger (optional) ADVERTISEMENT",
            "2 large beets, diced ADVERTISEMENT",
            "1 cup water, or more as needed ADVERTISEMENT",
            "4 large potatoes, diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large pot over medium heat; add onion and a pinch of salt. Cook and stir onion until softened and translucent, 5 to 10 minutes. Add garlic and ginger; cook and stir until fragrant, about 1 minute. Add beets and stir to combine. Pour water over beet mixture and sprinkle 1/2 teaspoon salt; bring to a boil.\nCover pot and reduce heat to medium-low; simmer, stirring occasionally, until beets are easily pierced with a fork, 20 to 25 minutes. Add potatoes and cook until potatoes are soft but not falling apart, about 15 minutes.\n",
        "picture_link": "XikhsLhNVt8lM93fcWscjLdyYNXQKxm"
    },
    {
        "title": "Rosemary-Ginger Cocktail",
        "ingredients": [
            "Syrup: ADVERTISEMENT",
            "1 cup sugar ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/3 cup packed fresh rosemary leaves ADVERTISEMENT",
            "1/3 cup coarsely chopped fresh ginger ADVERTISEMENT",
            "1/4 teaspoon black pepper ADVERTISEMENT",
            "Cocktails: ADVERTISEMENT",
            "1 cup gin ADVERTISEMENT",
            "1 cup rosemary-ginger simple syrup ADVERTISEMENT",
            "1 cup sparkling water ADVERTISEMENT",
            "1/2 cup fresh lime juice ADVERTISEMENT",
            "10 ice cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring all syrup ingredients to a boil in a small saucepan over medium heat. Boil, stirring until sugar has dissolve, about 1 minute. Remove from heat. Let stand, covered, 1 hour at room temperature.\nStrain through a fine-mesh sieve, pushing down on solids to extract as much liquid as possible. Refrigerate until ready to use.\nCombine gin, 1 cup of the rosemary-ginger simple syrup, sparkling water, and lime juice in a cocktail shaker. Add ice cubes and shake until well-chilled. Strain 3/4 cup each into 8 glasses and serve.\n",
        "picture_link": "XTyEotaKO610x9MghZvIBRIzCdnZAOO"
    },
    {
        "title": "Tartiflette (French Potato, Bacon, and Cheese Casserole)",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "3 pounds whole russet potatoes ADVERTISEMENT",
            "12 ounces thick cut bacon, cut into 1/2-inch pieces ADVERTISEMENT",
            "2 large onions, thinly sliced ADVERTISEMENT",
            "1 teaspoon salt, or to taste ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper, or to taste ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "1/2 cup dry white wine ADVERTISEMENT",
            "3/4 cup creme fraiche ADVERTISEMENT",
            "1 (16 ounce) round Reblochon cheese or other ripe, washed rind cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Boil unpeeled potatoes with salt in water over high heat; reduce heat and simmer until potatoes are easily pierced with a knife but are not too soft, 15 to 25 minutes depending on size. Remove potatoes from water to cool.\nPreheat oven to 375 degrees F (190 degrees C).\nCook bacon in a skillet over medium to medium-high heat until cooked but not quite crisp and most of the fat is rendered out, 5 to 7 minutes. Push bacon to one side of the pan and blot up some of the fat with a wadded paper towel. Add onion slices. Season with kosher salt and freshly ground black pepper and cayenne. Cook and stir over medium heat until onions are soft, sweet, and golden, about 6 minutes. Add white wine; cook for 2 minutes and deglaze pan. Remove from heat.\nCut wheel of cheese into 2 semi-circles. Place each half cut side down and split in half to form 2 more semi-circles, each with a rind side and creamy cheese side.\nWhen potatoes are cool enough to handle, peel off the skin. Slice into fairly thick slices, about 1/3 inch thick.\nPlace a little over half the potato slices onto bottom of a 2-quart shallow baking dish. A little overlapping is fine. Sprinkle with a bit of salt. Pour in bacon/onion/wine mixture and spread over potatoes in an even layer. Arrange the remaining potato slices over the top, overlapping as needed. Spread creme fraiche over the potatoes. Place down cheese pieces, rind side up. Transfer pan to a baking sheet. Bake in center rack of preheated oven until browned and potatoes are tender, 45 to 50 minutes.\n",
        "picture_link": "bsplTarcQNrKfCEKgclyWQiqQdxL0ZS"
    },
    {
        "title": "Larb Gai Nikki-Style",
        "ingredients": [
            "Dressing: ADVERTISEMENT",
            "2 lemons, juiced ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "2 tablespoons fish sauce, or more to taste ADVERTISEMENT",
            "1 tablespoon rice vinegar ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 teaspoon cayenne pepper ADVERTISEMENT",
            "1 teaspoon lemon zest ADVERTISEMENT",
            "1 pound ground turkey ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 cup water to cover ADVERTISEMENT",
            "1/2 red onion, thinly sliced ADVERTISEMENT",
            "1 carrot, shredded ADVERTISEMENT",
            "1/2 cup coarsely chopped chestnuts ADVERTISEMENT",
            "3 Thai chile peppers, sliced ADVERTISEMENT",
            "3 green onions, sliced ADVERTISEMENT",
            "1/4 cup chopped fresh mint ADVERTISEMENT",
            "1/3 cup chopped fresh Thai basil ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "3 tablespoons toasted rice powder ADVERTISEMENT",
            "2 tablespoons Thai chile flakes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk lemon juice, lime juice, fish sauce, rice vinegar, sugar, cayenne, and lemon zest together in a bowl until dressing is smooth.\nSpread ground turkey in a thin layer in a arge skillet; add garlic. Pour enough water into the skillet to cover the turkey; bring to a boil. Cook and stir turkey mixture, breaking the meat apart with a fork, until turkey is browned and crumbly, 7 to 10 minutes. Drain liquid and transfer turkey to a large glass bowl.\nMix red onion, carrot, chestnuts, Thai chile peppers, green onions, mint, basil, and cilantro into turkey until well combined. Refrigerate mixture until chilled, about 30 minutes.\nSprinkle rice powder and Thai chile flakes over turkey mixture and mix well.\n",
        "picture_link": "dCGRJwg7WU.mIsPNrwbpDNL7AgyrfNO"
    },
    {
        "title": "Torrone (Italian Nut and Nougat Confection)",
        "ingredients": [
            "2 (8x10-inch) sheets wafer paper ADVERTISEMENT",
            "1 1/3 cups honey ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "2 large egg whites, at room temperature ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "1 tablespoon lemon zest ADVERTISEMENT",
            "3 cups roasted almonds ADVERTISEMENT",
            "1 cup roasted pistachios ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line an 8x11-inch baking dish with plastic wrap, allowing ends to hang over the sides. Place 1 sheet of 8x10 wafer paper in the bottom of the pan. Keep the roasted almonds and pistachios in a warm place until ready to add at the end. This makes it easier to mix them in.\nPour honey into a heavy-bottomed pot. Add sugar. Mix and stir over low heat with a spatula, stirring constantly until mixture turns from grainy to silky and smooth, about 30 minutes. Remove pot from heat.\nPlace the egg whites in a mixing bowl; add a pinch of salt. Whisk until whites form soft peaks, 3 to 4 minutes. Place pot back on low heat. Gradually whisk about a quarter of the whipped egg whites into the honey/sugar mixture; whisk in the remaining egg whites in 3 more batches.\nContinue cooking over low heat, stirring constantly with a spatula until mixture turns a brighter white and a ribbon of the mixture does not immediately incorporate back into the rest of the mixture and stays intact on the surface for a while. This will take about 40 minutes. You can add a few drops of the mixture into a small bowl of ice cold water to test the consistency; ideally it should feel like soft clay.\nWhisk in vanilla and lemon zest. Add warm almonds and pistachios and stir to incorporate evenly.\nTransfer mixture to prepared baking dish. Even out as best you can with a clean oiled spatula. Top with 2nd sheet of wafer paper, shiny side up. Cover with plastic wrap and press down evenly, tamping mixture down gently but firmly. Remove top layer of plastic.\nAllow torrone to sit at room temperature until cool, firm, and ready to cut, 1 or 2 hours. Lift torrone from baking dish with the edges of the bottom layer of plastic wrap. Invert and remove plastic from the bottom. If the plastic wrap is difficult to remove from the edges of the torrone, you can trim off the edges.\nCut torrone into 1-inch squares using a sharp serrated knife.\n",
        "picture_link": "3D8IsoQSTbUtQByYLXnrnBkl88TsUt6"
    },
    {
        "title": "Nacho Cheese Sauce with Jalapeno",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "1/4 cup minced onion ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "3 pickled jalapeno pepper slices, minced ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/4 (1 pound) loaf processed cheese food (such as Velveeta®) ADVERTISEMENT",
            "1/4 teaspoon pickled jalapeno pepper juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a saucepan over medium-low heat. Add onion, garlic, and jalapeno; cook and stir until onion turns translucent, about 5 minutes.\nStir flour into onion mixture until vegetables are evenly coated. Pour in milk; cook and stir until mixture thickens slightly, 3 to 4 minutes. Add processed cheese food, stirring constantly, until melted and smooth, about 15 minutes more. Stir in pickled jalapeno juice.\n",
        "picture_link": "/fJ6.XPJY6LFF1DAJ0EeDGgEMGY9Ofm"
    },
    {
        "title": "Naan-like Easy Flatbread",
        "ingredients": [
            "2 cups all-purpose flour, or more as needed ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon cumin seeds ADVERTISEMENT",
            "1/2 teaspoon white sugar ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "2 tablespoons oil, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine flour, baking soda, baking powder, cumin seeds, and sugar together in a large bowl.\nCombine milk and 1 tablespoon oil in a small saucepan; heat over medium heat until warm, 3 to 5 minutes. Stir into flour mixture until small clumps form. Knead dough, adding more flour by the tablespoon if needed, until it is soft and smooth. Let dough rest, about 3 minutes.\nDivide dough into 4 equal pieces. Pressed into flat circles on a floured work surface.\nBrush a large skillet with remaining 1 tablespoon oil; heat over medium-high heat. Cook circles of dough one at a time until golden brown, about 3 minutes per side.\n",
        "picture_link": "suIWADSWvSHGHODmX6/oeFdwwcjb.9u"
    },
    {
        "title": "Cinnamon Sugar Snap Peas",
        "ingredients": [
            "1 (8 ounce) package sugar snap peas ADVERTISEMENT",
            "1 teaspoon olive oil, or to taste ADVERTISEMENT",
            "sea salt and freshly ground black pepper to taste ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon, or to taste ADVERTISEMENT",
            "1/2 teaspoon white sugar, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Set oven rack about 6 inches from the heat source and preheat the oven's broiler.\nToss sugar snap peas with olive oil in a bowl and in a single layer on a baking sheet. Drizzle more olive oil on top; season with salt and pepper. Combine cinnamon and sugar together in a small bowl; sprinkle onto sugar snap peas.\nCook in the preheated oven until sugar snap peas are lightly browned and sugar has caramelized, 4 to 5 minutes.\n",
        "picture_link": "oG6tjMpWJf3tPkYkiZ5Fo0lAZvD5PH."
    },
    {
        "title": "Cauliflower Curry",
        "ingredients": [
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 head cauliflower, broken into small florets ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "1 cup chopped tomato ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "1 jalapeno pepper, chopped ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon ground coriander ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat vegetable oil in a large skillet over medium heat. Add cauliflower; cook and stir until lightly browned, 8 to 10 minutes. Transfer cauliflower to a bowl.\nPuree onions, tomato, parsley, jalapeno, cumin, coriander, and turmeric together in a food processor. Transfer onion mixture to skillet over medium heat; cook and stir until slightly thickened, 8 to 10 minutes.\nReturn cauliflower to skillet; add chicken broth, garlic, and salt. Reduce heat to medium-low; cook and stir until cauliflower is easily pierced with a fork, 15 to 20 minutes.\n",
        "picture_link": "puQdnDLnn2EnsgDWHxn0gUt2yhOFOpS"
    },
    {
        "title": "Hot Baked Reuben Dip",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 pound deli sliced corned beef or pastrami, cut into 1-inch pieces ADVERTISEMENT",
            "1 cup sauerkraut, drained well, squeezed very dry ADVERTISEMENT",
            "1/4 cup sweet pickle relish ADVERTISEMENT",
            "2 tablespoons mayonnaise ADVERTISEMENT",
            "2 tablespoons sour cream ADVERTISEMENT",
            "1 tablespoon ketchup ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "4 ounces shredded Gruyere cheese ADVERTISEMENT",
            "4 ounces shredded Emmenthaler cheese ADVERTISEMENT",
            "Crackers and bread for serving ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nPlace cream cheese in a large bowl; add chopped meat and sauerkraut, sweet pickle relish, mayonnaise, sour cream, ketchup, mustard, Worcestershire sauce, black pepper, cayenne pepper, and shredded cheese. Mix thoroughly with a wooden spoon until well blended, 2 to 3 minutes.\nTransfer mixture to an ovenproof baking dish. Distribute evenly and smooth out the top. To increase the surface exposure, add texture, and encourage browning, roughen up the surface a bit with the tines of a fork.\nBake in preheated oven until bubbling and browned, 25 to 30 minutes. Let cool slightly before serving, about 15 minutes.\n",
        "picture_link": "IsJphqDJKVt82LlSfZ1kd0EzWMW.woK"
    },
    {
        "title": "Tammy's Turmeric Rice",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "1 cup uncooked jasmine rice ADVERTISEMENT",
            "1/4 cup frozen peas ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 onion, thinly sliced ADVERTISEMENT",
            "1/4 cup shredded carrot ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1/4 cup sunflower seeds ADVERTISEMENT",
            "1 tablespoon ground turmeric ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water, rice, and peas in a saucepan; bring to a boil. Reduce heat to low, cover, and steam until tender, about 20 minutes.\nMelt butter in a large skillet over medium heat. Add onion, carrot, and garlic; cook and stir until softened, about 5 minutes. Stir in sunflower seeds, turmeric, and cayenne pepper.\nStir cooked rice into onion mixture and cook until flavors combine, about 5 minutes.\n",
        "picture_link": "TWJ/zmaK.nYMAtcyhzO/gaGrsnx2GWi"
    },
    {
        "title": "Sunshine Lemon Bars",
        "ingredients": [
            "1 package Duncan Hines® Moist Deluxe® Lemon Cake Mix ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 large egg ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1/2 cup lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F. Stir together cake mix, butter and egg. Spread mixture evenly into bottom of a 13x9-inch baking pan.\nBlend together sweetened condensed milk and lemon juice. Pour mixture over top of cake mix mixture.\nBake for 23 to 27 minutes. Cool completely. Cut into 1 1/2x3 1/4-inch bars.\n",
        "picture_link": "dC2ZHJQ..l.U18Wct0aGcm8yQ8a.xlu"
    },
    {
        "title": "Tomato, Cheese and Basil Pretzel Crisps® Bites",
        "ingredients": [
            "1 (7.2 ounce) package Original Snack Factory® Pretzel Crisps® ADVERTISEMENT",
            "1 pint cherry tomatoes, sliced ADVERTISEMENT",
            "1 (4 ounce) package fresh basil, thinly sliced ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Arrange Pretzel Crisps(R) on a baking sheet. Top with basil, Parmesan cheese, and tomato slices.\nSet oven rack about 6 inches from the heat source and preheat the oven's broiler.\nPlace baking pan in preheated oven. Broil until cheese has melted, 2 or 3 minutes. Let cool and serve.\n",
        "picture_link": "xSNKyPzGM6xs25LZaEBn4JT.63pIhJe"
    },
    {
        "title": "Oven Roasted Grape Tomatoes",
        "ingredients": [
            "1 pound grape tomatoes, halved ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "5 fresh basil leaves, chopped ADVERTISEMENT",
            "1 teaspoon chopped fresh thyme ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace tomatoes onto a large square of aluminum foil. Drizzle olive oil over tomatoes and top with garlic, basil, thyme, and salt. Wrap the foil around tomato mixture sealing tightly to keep juices inside.\nBake in the preheated oven until tomatoes are tender, about 30 minutes. Cool slightly.\n",
        "picture_link": "5f3lLbpWhd4qajyPIOLkb5pPDQHB/pi"
    },
    {
        "title": "Chia Ginger Smoothie",
        "ingredients": [
            "1/4 cucumber, roughly chopped ADVERTISEMENT",
            "1 frozen banana, chopped ADVERTISEMENT",
            "1 teaspoon grated fresh ginger ADVERTISEMENT",
            "1 teaspoon chia seeds ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "water as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Layer cucumber, banana, ginger, and chia seeds in a blender; add orange juice. Blend mixture until smooth, adding water for a thinner smoothie.\n",
        "picture_link": "24EgEsU4m3S9lh1xYS.nKPek0b779UK"
    },
    {
        "title": "Paleo Apple Pie Smoothie",
        "ingredients": [
            "1 apple, roughly chopped ADVERTISEMENT",
            "1/4 cup frozen pineapple chunks ADVERTISEMENT",
            "1 tablespoon cashew butter ADVERTISEMENT",
            "1 tablespoon unsweetened flaked coconut ADVERTISEMENT",
            "1 teaspoon flax seed meal ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon, or as desired ADVERTISEMENT",
            "1 cup almond milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Layer apple, pineapple, cashew butter, coconut, flax meal, vanilla extract, and cinnamon into a blender; add almond milk. Blend mixture until smooth.\n",
        "picture_link": "KlAI/9gar5euthJcSfarEnrKRape916"
    },
    {
        "title": "Southwestern Egg Rolls with Avocado Cilantro Sauce",
        "ingredients": [
            "Cilantro Dipping Sauce: ADVERTISEMENT",
            "3/4 cup loosely packed fresh cilantro leaves ADVERTISEMENT",
            "1/3 cup sour cream ADVERTISEMENT",
            "1 jalapeno pepper, seeded and deveined (optional) ADVERTISEMENT",
            "2 tablespoons mayonnaise ADVERTISEMENT",
            "1 clove garlic ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "Kosher salt and freshly ground pepper, to taste ADVERTISEMENT",
            "Egg Rolls: ADVERTISEMENT",
            "2 avocados, halved, peeled, pitted ADVERTISEMENT",
            "1 (15 ounce) can black beans, drained and rinsed ADVERTISEMENT",
            "1 cup corn kernels (frozen, canned or roasted) ADVERTISEMENT",
            "1 roma tomato, diced ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1/3 teaspoon ground cumin ADVERTISEMENT",
            "Kosher salt and freshly ground black pepper, to taste ADVERTISEMENT",
            "8 egg roll wrappers ADVERTISEMENT",
            "Reynolds Wrap® Heavy Duty Foil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F. Line a large baking pan with Reynolds Wrap(R) Heavy Duty Foil. Grease or spray foil to prevent sticking.\nCombine cilantro, sour cream, jalapeno, mayonnaise, garlic and lime juice in the bowl of a food processor; season with salt and pepper to taste. Set aside.\nMash avocados using a potato masher. Add black beans, corn, tomato, lime juice, chili powder, cumin and salt and pepper and gently toss to combine.\nPlace avocado mixture in the center of each wrapper. Bring the bottom edge of the wrapper tightly over the filling, folding in the sides. Continue rolling until the top of the wrapper is reached. Using your finger, rub the edges of the wrapper with water, pressing to seal. Repeat with remaining wrappers and avocado mixture.\nPlace egg rolls on the prepared baking dish. Lightly coat with nonstick spray.\nPlace into oven and bake until golden brown and crisp, about 18 to 20 minutes.\nServe immediately with cilantro dipping sauce.\n",
        "picture_link": "Zq7v5zqxgTEyKxVh.bWq2pTZX7MWtVu"
    },
    {
        "title": "Buffalo Chicken Fingers from Pretzel Crisps®",
        "ingredients": [
            "2 cups Buffalo Wing Snack Factory® Pretzel Crisps® ADVERTISEMENT",
            "1 pound chicken tenders ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 1/2 cups buffalo wing sauce, divided ADVERTISEMENT",
            "1/4 cup peanut oil ADVERTISEMENT",
            "2 tablespoons mayonnaise ADVERTISEMENT",
            "1 tablespoon sour cream ADVERTISEMENT",
            "1/4 cup blue cheese crumbles, or to taste ADVERTISEMENT",
            "1 dash Worcestershire sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Using a rolling pin, crush Pretzel Crisps(R) until fine, but with some texture. Transfer to a clean plate. In a bowl, beat together the egg and one cup of the buffalo wing sauce, and set aside. Dip each chicken tender first in the egg mixture and roll to coat in the crushed pretzels.\nIn a large skillet, heat oil over medium high heat until shimmering. Add chicken tenders and cook, turning often, until golden brown on all sides (about six minutes total). Transfer to paper towels to drain. In a small bowl, combine mayonnaise, sour cream, blue cheese, and Worcestershire sauce. Serve blue cheese sauce with chicken and remaining 1/2 cup or reserved wing sauce.\n",
        "picture_link": "bfFtb3xew6Ce7AugVxQ8W7XhoRMXiqu"
    },
    {
        "title": "Veggie Spring Rolls with Thai Mango Dipping Sauce",
        "ingredients": [
            "Thai Mango Dipping Sauce: ADVERTISEMENT",
            "1 ripe mango, diced ADVERTISEMENT",
            "1 (1 inch) piece fresh ginger, grated ADVERTISEMENT",
            "2 tablespoons sweet Thai chili sauce ADVERTISEMENT",
            "2 tablespoons rice vinegar ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "1/2 cup fresh Thai basil and/or cilantro, chopped ADVERTISEMENT",
            "Veggie Spring Rolls: ADVERTISEMENT",
            "1 large avocado - peeled, pitted, and thinly sliced ADVERTISEMENT",
            "2 cups fresh vegetables such as cucumbers, lettuce, microgreens, carrots and bell peppers, thinly sliced, diced or cut into matchsticks ADVERTISEMENT",
            "Salt and pepper to taste ADVERTISEMENT",
            "1/2 cup cilantro leaves ADVERTISEMENT",
            "1/2 cup fresh mint leaves ADVERTISEMENT",
            "8 rice paper wrappers ADVERTISEMENT",
            "Chopped peanuts, for topping (optional) ADVERTISEMENT",
            "Reynolds Wrap® Aluminum Foil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender, combine all the dipping sauce ingredients except the basil and cilantro. Blend until smooth, add the basil and cilantro and pulse until chopped. Pour into a bowl, cover and place in the fridge until serving.\nSqueeze a little lime juice over the sliced avocado. Create an assembly line of vegetables and herbs, so that they are all ready to go.\nFill a shallow dish with warm water. Add a rice paper sheet, one at a time for 5 to 10 seconds. Remove and place on a flat surface. Toward one end of the rice wrapper, begin layering with 1 to 2 slices of avocado, small handfuls of fresh cilantro and mint, and a handful of veggies. Sprinkle the veggies with salt and pepper. Fold both ends to the center and roll the sheet as tightly as you can without ripping. Place each prepared spring roll on a serving platter and cover with Reynolds Wrap(R) Aluminum Foil to keep the spring rolls from drying out.\nContinue with remaining ingredients, adding them to the platter as you work. Keep the spring rolls covered with foil at all times.\nServe the spring rolls with the mango dipping sauce and chopped peanuts (if desired).\n",
        "picture_link": "Qaip1GMY76X64CLiPSeOEDiW2XrlwjO"
    },
    {
        "title": "Enchilada Spaghetti Squash Casserole",
        "ingredients": [
            "2 spaghetti squash, halved and seeded ADVERTISEMENT",
            "vegetable oil cooking spray ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 pound ground turkey ADVERTISEMENT",
            "1 (16 ounce) can enchilada sauce, divided ADVERTISEMENT",
            "6 ounces crumbled queso fresco (optional) ADVERTISEMENT",
            "1 (1 pound) package shredded Mexican cheese blend ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with aluminum foil.\nSpray insides of spaghetti squash with cooking spray. Season with salt and black pepper. Place squash, cut-side down, on the baking sheet.\nBake in the preheated oven until easily pierced with a knife, about 1 hour. Flip and let cool until easily handled, about 10 minutes.\nScrape insides of squash into spaghetti strands using a fork. Spread evenly into a 9x13-inch baking dish.\nPlace turkey in a large skillet over medium heat; cook and stir until browned, 5 to 8 minutes. Stir half of the enchilada sauce into the skillet.\nSpread turkey mixture evenly over squash in the baking dish. Scatter queso fresco then Mexican cheese over turkey layer. Top with remaining enchilada sauce.\nBake in the preheated oven until cheese is melted, about 15 minutes.\n",
        "picture_link": "47i1GHi8LyV2AcgCV7WocooJ1YKv.fe"
    },
    {
        "title": "Light Shrimp and Pesto Pasta",
        "ingredients": [
            "3 cups chopped garlic scapes ADVERTISEMENT",
            "1 cup freshly grated Romano cheese ADVERTISEMENT",
            "1 cup flat-leaf parsley ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "1 (16 ounce) box fettuccine pasta ADVERTISEMENT",
            "1 pound cooked shrimp ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 lemon, cut into wedges ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place garlic scapes, Romano cheese, parsley, and walnuts in the bowl of a food processor; pulse to combine. Scrape down sides. Turn on food processor; pour in olive oil and lemon juice while processing pesto until smooth.\nFill a large pot with lightly salted water and bring to a rolling boil. Stir in pasta, bring back to a boil, and cook over medium heat until tender yet firm to the bite, about 11 minutes. Drain and transfer to a large bowl.\nStir pesto and shrimp into the pasta. Season with salt and black pepper. Squeeze a lemon wedge over pasta and serve remaining wedges alongside.\n",
        "picture_link": "/4X56e3sFkOxhJj2mJuGLVnHaMqs./a"
    },
    {
        "title": "Classic Victoria Sponge Cake ",
        "ingredients": [
            "1 tablespoon unsalted butter, softened, divided ADVERTISEMENT",
            "Cake: ADVERTISEMENT",
            "3/4 cup unsalted butter, softened, plus additional for greasing ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "3 eggs, at room temperature ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "1/3 cup confectioners' sugar ADVERTISEMENT",
            "1/4 cup unsalted butter, softened ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/3 cup seedless raspberry jam ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease two 8-inch round cake pans and line with parchment paper.\nBeat 3/4 cup butter and white sugar together in a large bowl with an electric mixer until pale and creamy, about 2 minutes. Add eggs one a time, mixing well between each addition. Add 1 teaspoon vanilla extract; beat briefly until well-blended in the batter. Continue beating batter until bubbles appear on the surface, about 2 minutes more.\nSift flour, baking powder, and salt into the bowl. Gently fold with a spoon just until smooth. Divide the batter evenly between the prepared pans, smoothing the tops with a cake spatula.\nBake in the preheated oven until cakes are golden brown and a toothpick inserted into the center comes out clean, about 20 minutes. Cool in the pans for 5 minutes before inverting onto a wire rack to cool completely, about 30 minutes.\nBeat confectioners' sugar, 1/4 cup butter, and 1 teaspoon vanilla extract together in a bowl to make a smooth buttercream.\nPlace one cake layer, flat-side up, on a serving platter. Spread buttercream evenly onto the cake with a spatula. Spread raspberry jam in an even layer over the buttercream, right to the edges. Place second layer, flat-side down, over the filling.\n",
        "picture_link": "DPIgkrgzHf8rBcCEk1yk2tgvXqrUcte"
    },
    {
        "title": "Spicy Harissa Chicken Kebabs",
        "ingredients": [
            "4 tablespoons mild harissa paste or sauce ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "4 boneless, skinless chicken breasts, cut into 1-inch cubes ADVERTISEMENT",
            "2 yellow squash, thickly sliced ADVERTISEMENT",
            "2 green zucchini, thickly sliced ADVERTISEMENT",
            "1 red onion, thickly sliced ADVERTISEMENT",
            "2 cups thickly sliced button mushrooms ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon salt and pepper ADVERTISEMENT",
            "Reynolds Wrap® Aluminum Foil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 425 degrees F.\nWhisk together the harissa, honey and lemon juice in a bowl. Add chicken and mix until coated.\nSkewer the chicken evenly among 8 wooden skewers and set aside.\nMix together the squash, zucchini, onion, mushrooms, olive oil, cumin and salt and pepper until completely combined.\nPlace a 1 1/2 to 2 feet long sheet of Reynolds Wrap(R) Aluminum Foil on a table and place 1/4 of the vegetables in the center of the foil. Place 2 chicken skewers on top of the vegetables. Fold up the ends and then the outside of the foil to create a foil packet.\nRepeat the process 3 more times and place the foil packets on a cookie sheet.\nBake in the oven at 425 degrees F for 20 minutes and then open the foil packets and cook for a further 15 minutes or until the chicken is lightly browned and cooked throughout.\nOptional Serving: Serve the individual foil packets alongside warm pita.\n",
        "picture_link": "zhm8CV.9ESKf32w9RlkfMJANLpwOgyi"
    },
    {
        "title": "Spinach & Artichoke Dip from Pretzel Crisps®",
        "ingredients": [
            "1 cup thawed frozen chopped spinach ADVERTISEMENT",
            "1 cup thawed frozen artichoke hearts ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/4 cup sour cream ADVERTISEMENT",
            "1/3 cup grated Parmesan cheese ADVERTISEMENT",
            "1 dash garlic powder ADVERTISEMENT",
            "1 dash red pepper flakes ADVERTISEMENT",
            "1 (7.2 ounce) package Original Snack Factory® Pretzel Crisps® ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook spinach and artichoke hearts according to package directions. Drain well. Chop.\nPlace cream cheese, sour cream, Parmesan cheese, garlic powder, and red pepper flakes in a saucepan. Stir and cook over medium heat until mixture is blended and warm. Stir in chopped artichoke hearts and spinach. Serve warm with Original Pretzel Crisps(R)!\n",
        "picture_link": "X/WjXJMBy8opTl5joGv7Lp0SmcorKzq"
    },
    {
        "title": "Mexican Stuffed Shells with Ground Beef",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 (12 ounce) box jumbo pasta shells ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 (8 ounce) jar salsa ADVERTISEMENT",
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "1 cup corn ADVERTISEMENT",
            "1/2 cup sliced black olives ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Spray a baking dish with cooking spray.\nBring a large pot of lightly salted water to a boil. Cook pasta shells in the boiling water, stirring occasionally until tender yet firm to the bite, 8 to 10 minutes. Drain.\nHeat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Stir salsa, tomato sauce, corn, and olives into ground beef.\nStuff shells with ground beef mixture; arrange in a single layer in the prepared baking dish. Sprinkle Cheddar cheese over stuffed shells.\nBake in the preheated oven until cheese is melted, about 20 minutes. Serve shells with sour cream.\n",
        "picture_link": "RkwwlivI/hyDidSc/pnHHmyqXsKVBwK"
    },
    {
        "title": "Baked Chicken and Rice Chimichangas",
        "ingredients": [
            "1 1/2 cups cooked shredded chicken ADVERTISEMENT",
            "2/3 cup salsa ADVERTISEMENT",
            "1 1/2 teaspoons ground cumin ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 (5.6 ounce) package Knorr® Fiesta Sides™ - Spanish Rice ADVERTISEMENT",
            "1 1/4 cups shredded Colby-Jack cheese ADVERTISEMENT",
            "4 (10 inch) burrito-size flour tortillas ADVERTISEMENT",
            "1 tablespoon canola oil ADVERTISEMENT",
            "Optional Toppings: ADVERTISEMENT",
            "Shredded cheese, sour cream, chopped tomato, cilantro, green onions, shredded lettuce, lime wedges ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Line a baking sheet with parchment paper.\nCombine the cooked shredded chicken with salsa, cumin, and oregano in a large bowl.\nPrepare Knorr(R) Fiesta Sides(TM) - Mexican Rice according to package directions. Remove from the heat.\nStir rice and shredded cheese into the chicken mixture. Divide the mixture among flour tortillas; wrap and place seam-side down on a lined baking sheet. Brush with oil.\nBake in preheated oven until golden brown and crispy, about 20 minutes. Serve, if desired, with your favorite toppings.\n",
        "picture_link": "Q6Q3YDgh1iHx4bLbNuiGmV0jiTWf/oC"
    },
    {
        "title": "Crunchy Chocolate Chip Peanut Butter Snack Bites",
        "ingredients": [
            "1 cup large flake rolled oats ADVERTISEMENT",
            "1/2 cup KRAFT Crunchy Peanut Butter ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1/2 cup salted peanuts, chopped ADVERTISEMENT",
            "1/2 cup BAKER'S Semi-Sweet Chocolate Chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together all ingredients in a medium bowl until blended. Refrigerate for 20 to 30 min.\nRoll into 20 (1-inch) balls, using about 2 Tbsp. for each.\n",
        "picture_link": "ZtNN4lignjkDcnhQgqrUBVbAcpQqwpu"
    },
    {
        "title": "Slow Cooker Bulgogi",
        "ingredients": [
            "Marinade: ADVERTISEMENT",
            "1/2 cup soy sauce, divided ADVERTISEMENT",
            "1/4 cup white sugar, divided ADVERTISEMENT",
            "4 teaspoons sesame oil, divided ADVERTISEMENT",
            "2 cloves garlic, chopped, divided ADVERTISEMENT",
            "1 teaspoon ground black pepper, divided ADVERTISEMENT",
            "1 1/2 pounds beef, thinly sliced ADVERTISEMENT",
            "1/2 teaspoon sesame seeds ADVERTISEMENT",
            "1 green onion, cut into 1-inch pieces, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk 1/4 cup soy sauce, 2 tablespoons sugar, 2 teaspoons sesame oil, 1 clove garlic, and 1/2 teaspoon black pepper together in a large bowl; stir in beef. Cover with plastic wrap and let marinate in the refrigerator, at least 30 minutes and preferably overnight.\nCombine remaining 1/4 cup soy sauce, 2 tablespoons sugar, 2 teaspoons sesame oil, 1 clove garlic, and 1/2 teaspoon black pepper in a small bowl to make a second batch of marinade.\nToast sesame seeds in a small skillet over medium heat until lightly browned, 3 to 5 minutes.\nPlace marinated beef, second batch of marinade, toasted sesame seeds, and green onion in a slow cooker. Cook on Low until beef is tender and flavors are combined, 6 to 8 hours.\n",
        "picture_link": "hpniFgbR0o2lQLBlOzHqvfDX4CGAmM."
    },
    {
        "title": "Nell's Irish Boiled Cake",
        "ingredients": [
            "1/2 cup raisins ADVERTISEMENT",
            "1/2 cup golden raisins ADVERTISEMENT",
            "1/2 cup dried currants ADVERTISEMENT",
            "3/4 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/4 cup dry sherry ADVERTISEMENT",
            "1 cup whole wheat flour ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan, combine the raisins, golden raisins, currants, brown sugar, butter and water. Cook over medium heat, stirring occasionally, until boiling. Boil for 20 minutes, then remove from heat and set aside to cool.\nPreheat oven to 350 degrees F (175 degrees). Grease an 8x4 inch loaf pan.\nIn a medium bowl, stir together the whole wheat flour, all purpose flour, baking powder, salt and cinnamon. Add the boiled ingredients along with the cooking sherry, mix until well blended. Pour the batter into the prepared pan.\nBake for 45 minutes in the preheated oven, then reduce the oven temperature to 325 degrees F (165 degrees C) and bake 15 more minutes, or until a toothpick inserted comes out clean.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pumpkin, Spinach and Barley Rolls",
        "ingredients": [
            "1/2 cup pearl barley ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "2 1/4 cups canned pumpkin ADVERTISEMENT",
            "8 leaves spinach - rinsed, stemmed, and dried ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/4 teaspoon chili powder ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 (17.5 ounce) package frozen puff pastry, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium-size pot, bring water and barley to a boil. Reduce heat to simmer, cover and let cook 15 minutes.\nPreheat oven to 375 degrees F (190 degrees C).\nIn a large mixing bowl, combine pumpkin, barley, spinach, cumin, chili powder, and salt and pepper.\nLay out a sheet of pastry and place 1/2 of the pumpkin mixture along the center horizontally. Roll the pastry over the mixture, and seal the seams with a little water. Cut stuffed pastry into thirds. Arrange portions on a cookie sheet. Repeat with the remaining ingredients.\nBake at 375 degrees F (190 degrees C) for 20 minutes, or until golden brown.\n",
        "picture_link": "ispLIo0.owyff9VLWyIbL8FHbCz.Ifu"
    },
    {
        "title": "Coco-Cola Cake IV",
        "ingredients": [
            "2 1/2 cups white sugar ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "3 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1 cup cola-flavored carbonated beverage ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 cup buttermilk ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "6 tablespoons cola-flavored carbonated beverage ADVERTISEMENT",
            "3 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "4 cups confectioners' sugar ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan. In a medium saucepan, combine 1/2 cup shortening, 1/2 cup butter, 3 tablespoons cocoa and 1 cup cola. Bring to a rapid boil and remove from heat.\nIn a large bowl, mix together the sugar and flour. Pour in the cola mixture and blend with a mixer. In a medium bowl, dissolve the baking soda in the buttermilk and add eggs, vanilla and sour cream. Mix well and then stir into the batter. Beat for 2 to 3 minutes.\nPour batter into prepared 9x13 inch pan. Bake in the preheated oven for 30 to 40 minutes, or until a toothpick inserted into the center of the cake comes out clean.\nTo make the Frosting: In a medium saucepan, combine 1/2 butter, 6 tablespoons cola, and 3 tablespoons cocoa. Bring to a boil, stirring constantly. When smooth, remove from heat and add confectioners' sugar and nuts. Beat until smooth, then pour over cake while both frosting and cake is still hot.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Easy Party Cake",
        "ingredients": [
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1 (3 ounce) package orange flavored Jell-O® mix ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "3/4 cup vegetable oil ADVERTISEMENT",
            "2/3 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x5 inch loaf pan.\nIn a large bowl, stir together cake mix and gelatin mix. Make a well in the center and pour in eggs, oil and water. Mix well and pour into a 9x5 inch loaf pan.\nBake in the preheated oven for 60 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool.\n",
        "picture_link": "LOBCsPRod1fUI/ndu8AsDl4xl6xDQSi"
    },
    {
        "title": "Cheese Ball II",
        "ingredients": [
            "1 (2 ounce) can black olives, drained and chopped ADVERTISEMENT",
            "1 (4 ounce) jar diced pimento peppers, drained ADVERTISEMENT",
            "8 green onions, finely chopped ADVERTISEMENT",
            "1 pound butter, softened ADVERTISEMENT",
            "8 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "4 ounces blue cheese, crumbled ADVERTISEMENT",
            "1 cup chopped almonds or other nut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, combine olives, pimentos and green onions; mix well.\nCombine butter or margarine, cream cheese and blue cheese; stir in olive mixture.\nShape into balls or logs and roll in chopped nuts; serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Shredded Cereal Bread",
        "ingredients": [
            "2 1/4 cups boiling water ADVERTISEMENT",
            "3 large shredded wheat cereal biscuits ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 teaspoons shortening ADVERTISEMENT",
            "1/2 cup molasses ADVERTISEMENT",
            "1 (0.6 ounce) cake compressed fresh yeast ADVERTISEMENT",
            "1/4 cup warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "8 1/4 cups sifted all-purpose flour ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, pour the boiling water over the biscuits Stir in salt, shortening and molasses. Cool to lukewarm.\nIn a small bowl, dissolve yeast in warm water. Add this to the lukewarm biscuit mixture. Stir in the flour, 1 cup at a time, beating well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and supple, about 8 minutes. Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 2 hours.\nDeflate the dough and turn it out onto a lightly floured surface. Divide the dough into three equal pieces and form into loaves. Place the loaves into two lightly greased 9x5 inch loaf pans. Brush tops of loaves with 1 tablespoon vegetable oil. Cover the loaves with a damp cloth and let rise until doubled in volume, about 1 hour. Meanwhile, preheat oven to 400 degrees F (200 degrees C).\nBake in preheated oven for 45 minutes, until bottom of loaves sound hollow when tapped.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Spinach Stuffing",
        "ingredients": [
            "1/2 tablespoon butter, melted ADVERTISEMENT",
            "2 (14 ounce) cans spinach ADVERTISEMENT",
            "1 tablespoon poultry seasoning ADVERTISEMENT",
            "1 (12 ounce) package unseasoned dry bread stuffing mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, mix together butter, spinach, poultry seasoning, and stuffing mix. Transfer mixture to a 9x13 inch casserole dish.\nCover dish and bake in preheated oven for 1 hour.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chocolate Chiffon Pie",
        "ingredients": [
            "1 (9 inch) pie crust, baked ADVERTISEMENT",
            "1/4 cup cold water ADVERTISEMENT",
            "1 envelope (1 tablespoon) unflavored gelatin ADVERTISEMENT",
            "2 (1 ounce) squares unsweetened chocolate, grated ADVERTISEMENT",
            "1/2 cup boiling water ADVERTISEMENT",
            "4 egg yolks ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "4 egg whites ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cold water in a small bowl and sprinkle gelatin over top. Set aside 5 minutes to soften. Place grated chocolate in a large heat-proof bowl. Pour boiling water over chocolate and stir until smooth. Stir gelatin mixture into chocolate mixture; stir until gelatin is completely dissolved.\nIn a small bowl, whisk egg yolks with 1/2 cup sugar until smooth and light. Whisk egg yolks into chocolate mixture, then stir in salt and vanilla extract. Allow mixture to cool.\nIn a large glass or metal mixing bowl, beat egg whites until foamy. Gradually add remaining 1/2 cup sugar, continuing to beat until whites form stiff peaks. Fold egg whites into cooled chocolate mixture. Spread into baked pastry shell and chill at least 2 hours, or until firm.\n",
        "picture_link": "hfEYTmGpQh9ZCGZ5BpJOKtxD3wyuW/e"
    },
    {
        "title": "Microwave Mississippi Mud Cake II",
        "ingredients": [
            "1 cup margarine ADVERTISEMENT",
            "1/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups miniature marshmallows ADVERTISEMENT",
            "4 cups confectioners' sugar ADVERTISEMENT",
            "1/3 cup unsweetened cocoa powder ADVERTISEMENT",
            "2/3 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In 9x13 inch microwave-safe cake dish, melt the margarine and 1/4 cup cocoa together. Stir in the eggs. Mix in the 2 cups sugar, flour, nuts and vanilla.\nBake in microwave oven on high, for 11 minutes, rotating dish after 5 minutes. Remove from microwave and sprinkle marshmallows on top.\nTo make the frosting: In microwave-safe bowl, combine confectioners' sugar, cocoa, and milk. Cook in microwave for 2 minutes, stir and pour over cake.\n",
        "picture_link": "H9n2pbhOAKkr7CyJBZuOEBwY6pB1P6C"
    },
    {
        "title": "Tangy Cranberry Bread",
        "ingredients": [
            "1 1/4 cups cranberry juice ADVERTISEMENT",
            "3 cups bread flour ADVERTISEMENT",
            "2 tablespoons dry milk powder ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "2 tablespoons butter, softened ADVERTISEMENT",
            "3 tablespoons orange marmalade ADVERTISEMENT",
            "1/3 cup dried cranberries ADVERTISEMENT",
            "1 tablespoon active dry yeast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place all ingredients (except cranberries) in the bread machine according to manufacturer's instructions. If using the delayed time cycle, place dried cranberries away from water. Press start.\nIf your machine has a Fruit setting, add the cranberries at the signal, or about 5 minutes before the kneading cycle has finished.\n",
        "picture_link": "ArLGLARJ9sRJNY.ITNUwJ0w9EaF6Q7S"
    },
    {
        "title": "Easy Sacher Torte",
        "ingredients": [
            "1 (18.25 ounce) package chocolate cake mix ADVERTISEMENT",
            "1 (16 ounce) package dark chocolate frosting ADVERTISEMENT",
            "1/4 cup apricot preserves ADVERTISEMENT",
            "6 tablespoons rum ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bake cake in two 9 inch pans according to directions. Cool to room temperature.\nPlace one layer of cake onto a serving plate, brush liberally with rum. Spread apricot jam over the top to 1/2 inch from the edge. Place the second layer on top. Brush with remaining rum. Frost the sides first, then the top with the prepared icing. Clean the edge of the plate with a dry towel.\n",
        "picture_link": "QNtEh8jhxzQSotp7PKsVxfg4kBV5A1y"
    },
    {
        "title": "Honey Zserbo",
        "ingredients": [
            "4 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking soda ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "1/3 cup unsalted butter ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/4 cup honey, warmed ADVERTISEMENT",
            "1/4 cup sour cream ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "3/4 cup vanilla sugar ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 cup unsalted butter ADVERTISEMENT",
            "1/4 cup confectioners' sugar for dusting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line baking sheets with parchment paper.\nIn a large bowl, stir together 4 cups of flour, baking soda and 1 cup of confectioners' sugar. Cut in 1/3 cup of butter using a pastry blender or by pinching between your fingers until the mixture is crumbly. Make a well in the center, and pour in the eggs, honey and sour cream. Stir until dough comes together.\nDivide into 4 equal pieces. Roll each piece of dough out into a equally large rectangle about 1/8 inch thick. Place on the prepared cookie sheets.\nBake for 15 minutes in the preheated oven, or until firm and lightly golden. Bake in batches if you do not have enough room for all of the sheets at once. Set aside to cool.\nIn a saucepan over medium heat, stir together 2 cups of confectioners' sugar, vanilla sugar, and 1/4 cup of flour. Gradually mix in the milk until smooth. Cook and stir until thick and dense like porridge. Remove from the heat, and stir in the butter. Allow to cool.\nWhen the pastry sheets and filling are both cool, spread 1/3 of the filling onto one sheet. Top with another sheet, and another third of the filling. Repeat, once more, ending with the final sheet of pastry on top. Slice into rectangles, and dust with confectioners' sugar before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Smart Cookies",
        "ingredients": [
            "1 cup shortening ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups candy-coated chocolate pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C).\nIn a large bowl, cream together the shortening, brown sugar, and white sugar until light and fluffy. Add the eggs one at a time, beating well with each addition, then stir in the vanilla. Combine the flour, baking soda and salt; gradually stir into the creamed mixture. Finally, stir in the Smarties (TM). Drop by rounded spoonfuls onto the prepared cookie sheet.\nBake for 8 to 10 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n",
        "picture_link": "cJj.z35nrQ5U4V7tCx.oTbVQPrPLRli"
    },
    {
        "title": "Nutty Coffee Cake",
        "ingredients": [
            "2 1/2 cups buttermilk baking mix ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "2/3 cup milk ADVERTISEMENT",
            "1/3 cup chopped walnuts, toasted ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 tablespoon grated lemon zest ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease and flour a 9 inch round pan.\nIn a medium bowl, stir together the biscuit mix and 1/3 cup of sugar. Add the egg, oil, and milk, mix until smooth. Spread evenly into the prepared pan. In another bowl, stir together the chopped nuts, 1/4 cup of sugar and lemon zest. Sprinkle this mixture over the batter in the pan.\nBake in the preheated oven for 20 to 25 minutes, or until a toothpick inserted into the cake comes out clean. Serve warm.\n",
        "picture_link": ".Io9j1hqd9E6BFIz7sMHCZIySjFm.hq"
    },
    {
        "title": "Eve's Bread Pudding",
        "ingredients": [
            "3 apples - peeled, cored and diced ADVERTISEMENT",
            "3 cups bread crumbs ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1/2 cup currants ADVERTISEMENT",
            "1/8 teaspoon ground nutmeg ADVERTISEMENT",
            "1/8 teaspoon ground cinnamon ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 2 quart casserole dish.\nIn a large mixing bowl, combine the apples, bread crumbs and sugar. Add currants, nutmeg and cinnamon; mix well. Add the eggs; stir gently to combine. Pour into the prepared casserole dish.\nBake in the preheated oven for 30 to 40 minutes, or until solid and golden brown.\n",
        "picture_link": "hVW3W59plOH2AiOZyBh/w8OvF.jM7IW"
    },
    {
        "title": "Mystery Pie",
        "ingredients": [
            "3 egg whites ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "18 buttery round crackers, crushed ADVERTISEMENT",
            "2/3 cup chopped pecans ADVERTISEMENT",
            "1 cup frozen whipped topping, thawed ADVERTISEMENT",
            "1 1/2 cups fresh strawberries, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Generously grease a 9 inch pie pan.\nIn a large glass or metal bowl, beat egg whites until foamy. Mix together sugar and baking powder, then slowly add mixture to egg whites, continuing to beat until stiff peaks form. Beat in vanilla extract. Fold in crushed crackers and pecans. Spread mixture evenly into pie pan.\nPlace pie in preheated oven and reduce temperature to 325 degrees F (165 degrees C). Bake for 30 minutes. Cool thoroughly. Top with whipped topping and fresh fruit.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Fruit Cocktail Cake IV",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 (15.25 ounce) can fruit cocktail with syrup ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "3/4 cup brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan.\nIn a large bowl mix together flour, sugar, salt and baking soda. Pour in egg and fruit cocktail with syrup. Mix well and pour into prepared pan. Sprinkle with pecans and brown sugar.\nBake in the preheated oven for 50 to 60 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Venus' Chocolate Macadamia Nut Tart",
        "ingredients": [
            "1/2 cup unsalted butter, softened ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 1/8 cups cake flour ADVERTISEMENT",
            "7 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 tablespoons unsalted butter ADVERTISEMENT",
            "3 ounces semisweet chocolate, chopped ADVERTISEMENT",
            "3/4 teaspoon coffee liqueur ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "1 cup macadamia nuts, whole ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large mixing bowl, cream together 1/2 cup softened butter and 1/4 cup sugar until pale, about 3 minutes; beat in egg.\nIn a separate bowl, mix flour and cocoa powder. Using a wooden spoon, stir the dry ingredients into the creamed mixture and gather the dough into a ball. Flatten the dough into a disk and wrap in waxed paper; refrigerate for at least 2 hours.\nPreheat oven to 325 degrees F (165 degrees C).\nOn a lightly floured surface, roll out chilled dough into a 10 inch round and about 1/4 inch thickness. Transfer dough to an 8 inch tart pan, pressing dough evenly into pan; prick all over with a fork and freeze for 10 minutes.\nBake tart shell in preheated oven for 12 minutes; transfer to a rack to cool.\nTo make caramel: In a small saucepan over low heat, bring 1/2 cup heavy cream to a simmer. In a heavy medium saucepan over high heat, gradually add 1/2 cup sugar in small amounts, stirring constantly, until it melts and turns golden brown. Remove saucepan from heat and slowly stir in hot cream; stir in 2 tablespoons butter and allow mixture to cool.\nTo make chocolate cream: In a medium bowl, combine semisweet chocolate and liqueur. In a small saucepan over high heat, bring remaining 1/2 cup heavy cream to a boil and pour it over chocolate; stir mixture with a wooden spoon until chocolate is melted and very smooth.\nReserve 13 whole macadamia nuts and chop the rest. Pour cooled caramel into the cooled tart shell and spread evenly with a metal spatula; sprinkle chopped nuts over caramel. Pour chocolate cream on top and spread evenly.\nArrange 10 whole nuts around the edge of the tart to mark 10 slices; place remaining 3 nuts in the center. Refrigerate the tart for 1 hour or until firm; serve.\n",
        "picture_link": "RyM4IrMJ9fYzCl6mqQsoNq1skW4BxL6"
    },
    {
        "title": "Fruited Sherry Bread",
        "ingredients": [
            "3/4 cup dried figs ADVERTISEMENT",
            "3/4 cup raisins ADVERTISEMENT",
            "3/4 cup dried apricots ADVERTISEMENT",
            "3 tablespoons chopped crystallized ginger ADVERTISEMENT",
            "2/3 cup dry sherry ADVERTISEMENT",
            "1 teaspoon orange zest ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "2 tablespoons unsalted butter, softened ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "2 1/4 cups unbleached flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon ground allspice ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the dried fruit into a small saucepan with the crystallized ginger, sherry, and orange rind. Bring mixture to a boil, remove pan from heat, cover and let cool for 30 minutes. Place walnuts on a baking sheet and toast until golden, about 10 minutes; set aside to cool. Preheat oven to 350 degrees F (175 degrees C). Lightly grease and flour a 9x5 inch loaf pan.\nIn a large bowl, cream the butter and sugar. Beat in the egg and then the milk. Combine the flour, baking powder, allspice and salt, stir slowly into the egg mixture. Do not over mix. Fold in the walnuts and cooled fruit mixture. Pour the batter into the prepared loaf pan.\nBake in preheated oven for 60 to 70 minutes, until a toothpick inserted into center of the loaf comes out clean. Let the loaf cool in the pan 15 minutes before removing it to a wire rack to cool. When the bread has cooled completely, wrap it in plastic. It tastes better if left to sit for a day, and it's especially good with butter or cream cheese.\n",
        "picture_link": "hj2/aH.aM1gV/f2C/eMKqzoop0dTFlq"
    },
    {
        "title": "Sweet Bread Overnite",
        "ingredients": [
            "2 (.25 ounce) packages active dry yeast ADVERTISEMENT",
            "1/2 cup warm water (110 degrees F) ADVERTISEMENT",
            "7 eggs ADVERTISEMENT",
            "8 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "3/4 cup butter, melted ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes.\nIn a large bowl, beat eggs until fluffy. Stir in 4 cups of flour, salt, sugar, milk, 3/4 cup melted butter, yeast mixture and vanilla. Stir in the remaining flour, 1/2 cup at a time, beating well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and supple, about 8 minutes. Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with plastic wrap and let rise overnight in the refrigerator.\nThe next morning, deflate the dough and turn it out onto a floured surface. Divide the dough into two equal pieces and form into loaves. Place the loaves into two lightly greased 9x5 inch loaf pans. Cover the loaves with a damp cloth and let rise until doubled in volume, about 90 minutes. Preheat an oven to 300 degrees F (150 degrees C).\nBrush risen loaves with 2 tablespoons melted butter and bake in preheated oven for 1 hour, or until golden brown.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Bren's Italian Meatballs",
        "ingredients": [
            "1/2 cup fresh bread crumbs ADVERTISEMENT",
            "1/2 cup grated pecorino Romano cheese ADVERTISEMENT",
            "2 large cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 pinch red chili pepper flakes ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper.\nToss bread crumbs, Romano cheese, garlic, parsley, black pepper, red pepper, and egg together in a bowl; mix in beef gently with your hands. Form beef mixture into meatballs roughly 1 1/4 inches in diameter; place on the prepared baking sheet.\nBake in the preheated oven for 10 minutes; turn meatballs and bake until no longer pink at the center, about 5 minutes more. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C).\n",
        "picture_link": "LP9Ye.SEV.Gihkdd/Cgri6pmKQ.zgkq"
    },
    {
        "title": "Chef John's Bacon and Asparagus Dutch Baby",
        "ingredients": [
            "3 large eggs ADVERTISEMENT",
            "2/3 cup milk ADVERTISEMENT",
            "1/2 cup finely grated Parmigiano-Reggiano cheese (not packed) ADVERTISEMENT",
            "1/2 cup packed all-purpose flour ADVERTISEMENT",
            "1 teaspoon lemon zest ADVERTISEMENT",
            "3/4 teaspoon kosher salt ADVERTISEMENT",
            "Freshly ground black pepper to taste ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "6 strips bacon, cut into 1/2-inch pieces ADVERTISEMENT",
            "1 cup trimmed fresh asparagus, cut into 1/4-inch pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 475 degrees F (245 degrees C).\nPlace eggs in mixing bowl. Add milk, grated Parmigiano-Reggiano cheese, flour, lemon zest, salt, black pepper, and cayenne pepper. Whisk together until completely combined.\nHeat 2 teaspoons olive oil in cast-iron skillet over medium heat. Add bacon and cook until fat is rendered out and bacon begins to crisp up. Add asparagus and raise heat to high. Cook and stir about 1 minute.\nPour batter into pan in a circular motion.\nBake in preheated oven until browned and puffed, 12 to 13 minutes.\n",
        "picture_link": "Ai7c07weq9gCiAlmV2EhaI1fKETDOIm"
    },
    {
        "title": "Gazpacho Verde with Burrata Cheese",
        "ingredients": [
            "3 cups sliced English cucumber ADVERTISEMENT",
            "2 cloves garlic, sliced ADVERTISEMENT",
            "1 cup packed basil leaves ADVERTISEMENT",
            "2 tablespoons fresh oregano leaves ADVERTISEMENT",
            "1/2 cup water, plus more as needed ADVERTISEMENT",
            "1/4 cup seasoned rice vinegar, or more to taste ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "8 ounces burrata cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cucumber slices, garlic, basil, oregano, water, rice vinegar, olive oil, cayenne pepper, salt, and black pepper into the bowl of a blender. Pulse 2 or 3 times. Blend on highest speed about 1 or 2 minutes until mixture liquefies. Strain through a fine strainer, pressing everything through with a spoon leaving just a few tablespoons of fiber and rough bits.\nCover and refrigerate until ice cold, 1 or 2 hours.\nLadle some gazpacho verde into chilled bowls. Scoop 1/4 cup burrata onto the soup. Drizzle with a few drops of olive oil.\n",
        "picture_link": "mWvwodcMLiQlg9c3J4hbDEnMDYljGju"
    },
    {
        "title": "S'mores Pretzel Bites",
        "ingredients": [
            "7 ounces marshmallow creme ADVERTISEMENT",
            "1 (7.2 ounce) package Original Snack Factory® Pretzel Crisps® ADVERTISEMENT",
            "4 (1 ounce) squares milk chocolate ADVERTISEMENT",
            "1/4 cup graham cracker crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line a baking sheet with parchment paper. Place a heaping teaspoon of marshmallow cream off center on Snack Factory(R) Pretzel Crisp(R). Place on prepared sheet. Freeze for at least 15 minutes.\nMelt chocolate in a microwave-safe glass or ceramic bowl in 15-second intervals, stirring after each melting, 1 to 3 minutes.\nLine a work surface with waxed paper. Dip marshmallow-covered half of pretzels in melted chocolate about halfway up. Place on waxed paper and immediately sprinkle with graham cracker crumbs. Allow chocolate to harden before removing bites from waxed paper, about 5 minutes.\n",
        "picture_link": "CXBGVHwPwOn2XCi2.JBW2un9PbkRR/."
    },
    {
        "title": "Sangria Melon Chiller",
        "ingredients": [
            "1/4 cup sugar ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "1/4 cup packed torn fresh mint leaves ADVERTISEMENT",
            "8 sprigs fresh mint for garnish ADVERTISEMENT",
            "1 (750 milliliter) bottle Sauvignon Blanc, chilled ADVERTISEMENT",
            "1 cup fresh orange juice, chilled ADVERTISEMENT",
            "1/2 cup Triple Sec or other orange-flavored liqueur ADVERTISEMENT",
            "3 cups bite-size wedges of cantaloupe ADVERTISEMENT",
            "1 1/2 cups bite-size wedges of seedless watermelon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together sugar, water, and torn mint in a small saucepan. Bring to a simmer over low heat. Simmer 1 minute, then cool to room temperature, about 30 minutes. Strain syrup mixture through a fine-mesh sieve into a bowl, pushing on mint to extract as much liquid as possible. Discard mint leaves. Chill syrup until ready to use.\nStir together wine, orange juice, Triple Sec, and mint simple syrup in a pitcher or large bowl. Add cantaloupe and watermelon and chill at least 30 minutes and up to 4 hours.\nPour or ladle over ice, if desired, into 8 glasses and garnish each with a mint leaf or sprig.\n",
        "picture_link": "LmXQj/uGr3XypQRs.K9onTzYAWNzoKG"
    },
    {
        "title": "Turkey Spaghetti Zoodles",
        "ingredients": [
            "1 teaspoon extra-virgin olive oil ADVERTISEMENT",
            "1 1/4 pounds ground turkey breast ADVERTISEMENT",
            "1 cup diced green bell pepper ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "2 teaspoons Italian seasoning ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon red pepper flakes ADVERTISEMENT",
            "3 cups marinara sauce ADVERTISEMENT",
            "2 cups baby spinach leaves ADVERTISEMENT",
            "4 zucchini, cut into noodle-shape strands ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large skillet over medium heat. Add turkey breast, green pepper, garlic, Italian seasoning, ground black pepper, salt, and red pepper flakes; cook and stir until turkey is lightly browned, 4 to 5 minutes.\nStir marinara sauce and baby spinach into the turkey mixture; cook and stir until marinara sauce is warm through, about 3 minutes.\nStir zucchini noodles into the sauce with tongs; cook and stir until the zucchini is slightly tender, 2 to 3 minutes.\n",
        "picture_link": "TzuCH7SWvgozVyI9kdhP1W392BoGCOC"
    },
    {
        "title": "Dee's Roasted Carrot Soup",
        "ingredients": [
            "2 1/2 pounds carrots, peeled and chopped ADVERTISEMENT",
            "2 potatoes, peeled and chopped ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "2 garlic cloves, crushed ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 tablespoon herbes de Provence ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "6 cups vegetable broth ADVERTISEMENT",
            "1 cup light cream, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nStir carrots, potatoes, onion, and garlic together in a large roasting pan; drizzle with oil and sprinkle with herbes de Provence, salt, and pepper.\nRoast in the preheated oven until vegetables are tender and beginning to brown, stirring once, about 50 minutes. Remove roasted vegetables from oven; scrape vegetables and any brown bits into a large pot. Pour vegetable broth into vegetable mixture; bring to a boil.\nBlend soup until smooth with a stick blender; stir in cream to thin soup to desired consistency.\n",
        "picture_link": "GNlyS9cT.l844dexwjh6bE1HIWxr/0C"
    },
    {
        "title": "New York Turkey Meatball",
        "ingredients": [
            "1 (16 ounce) package JENNIE-O® Lean Italian Seasoned Ground Turkey ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "3 tablespoons chopped fresh basil leaves ADVERTISEMENT",
            "1 tablespoon finely chopped fresh oregano ADVERTISEMENT",
            "2 teaspoons grated lemon rind ADVERTISEMENT",
            "1 large egg, lightly beaten ADVERTISEMENT",
            "2 tablespoons dried bread crumbs ADVERTISEMENT",
            "1 (24 ounce) jar tomato-basil pasta sauce, heated ADVERTISEMENT",
            "1 (16 ounce) package spaghetti, cooked according to package instructions ADVERTISEMENT",
            "Grated Parmesan cheese (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 400 degrees F.\nCombine turkey, garlic, basil, oregano, lemon rind, egg and bread crumbs in a large bowl. Shape into 1 1/2-inch balls. Place on a lightly greased baking sheet.\nBake 25 minutes. Always cook turkey to well-done, 165 degrees F as measured by a meat thermometer. Let meatballs stand 10 minutes.\nToss meatballs and heated pasta sauce in a large bowl. Serve over pasta. Sprinkle with Parmesan cheese, if desired.\n",
        "picture_link": "Nu4/tYEURSmqA9xjkG0J9feW5fcuKha"
    },
    {
        "title": "Impossible Cake",
        "ingredients": [
            "1/4 cup cajeta, sweetened caramelized goat's milk syrup ADVERTISEMENT",
            "350 ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "6 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "2 1/2 tablespoons butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 tablespoons strong brewed coffee ADVERTISEMENT",
            "1 cup whole milk ADVERTISEMENT",
            "Flan: ADVERTISEMENT",
            "2 1/2 cups evaporated milk ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease the base and sides of a 9-inch fluted tube pan. Dust lightly with flour; tap to remove excess.\nFill a shallow baking pan with enough water to come 1/3 of the way up the sides of the tube pan. Place water bath in the oven to warm up while it is preheating.\nPour caramel sauce into a microwave-safe bowl. Microwave until warm and pourable, about 1 minute. Pour into the prepared tube pan, covering the base completely.\nMix flour, cocoa powder, baking soda, and baking powder together in a bowl.\nBeat 1/2 cup plus 2 1/2 tablespoons butter in a bowl with an electric mixer until smooth. Add sugar; beat until light and fluffy. Beat in 1 egg and coffee. Alternate adding flour mixture and milk, mixing well between additions. Pour cake batter evenly over caramel in the tube pan.\nCombine evaporated milk, condensed milk, 4 eggs, and vanilla extract in the bowl of a food processor; blend until smooth. Pour over cake batter through a fine sieve.\nBake in the water bath in the preheated oven until a toothpick inserted into the chocolate cake comes out clean, about 1 hour.\nLet cake cool, about 1 hour. Carefully run a thin knife around the edges to loosen the cake, cover with a serving plate, and flip onto the plate.\n",
        "picture_link": "ebN5pCpJNPy4NG9YkOA2oYrhnSmnrpe"
    },
    {
        "title": "Blackberry Sangria",
        "ingredients": [
            "1 (750 milliliter) bottle Spanish red wine ADVERTISEMENT",
            "12 fluid ounces blackberry brandy ADVERTISEMENT",
            "1/2 cup triple sec ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/2 cup blackberries, or to taste ADVERTISEMENT",
            "1/2 cup hulled strawberries, or to taste ADVERTISEMENT",
            "1/2 cup chopped fresh pineapple ADVERTISEMENT",
            "1 apple, chopped ADVERTISEMENT",
            "ice cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine wine, brandy, triple sec, orange juice, and sugar together in a pitcher or bowl; add blackberries, strawberries, pineapple, apple, and ice and mix well. Refrigerate for 8 hours to overnight.\n",
        "picture_link": "y9L6jamHSlKoIoJfYP33BP1szvLroeO"
    },
    {
        "title": "Chef John's Classic Guacamole",
        "ingredients": [
            "2 tablespoons minced fresh serrano chili ADVERTISEMENT",
            "1/2 cup chopped fresh cilantro, divided ADVERTISEMENT",
            "1/4 cup finely diced white onion ADVERTISEMENT",
            "1/2 teaspoon kosher salt for grinding vegetables, plus more to taste ADVERTISEMENT",
            "4 large Hass avocados ADVERTISEMENT",
            "1 cup diced ripe tomatoes, drained (optional) ADVERTISEMENT",
            "1 lime, juiced, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place minced peppers, 1/4 cup of the chopped cilantro, and the diced onions on a cutting board. Chop them together into very small pieces. Sprinkle with kosher salt. Using the flat side of the knife blade, smear the mixture to work it into a paste, and chop again to achieve as fine a texture as possible.\nStem, halve, and pit the avocados. Scoop out flesh and place in a bowl. Add 1/4 cup chopped cilantro, onion and serrano mixture, salt, and fresh lime juice. Mash with a potato masher to desired texture (smooth or chunky), 5 or 6 minutes. Taste and adjust seasonings. If not serving immediately, cover and refrigerate.\n",
        "picture_link": "TOYM0AVYItUdABzQ3/VtuMt21jxv9eu"
    },
    {
        "title": "Poorman's Lobster Newburg",
        "ingredients": [
            "1 (10.75 ounce) can cream of shrimp soup (such as Campbell's®) ADVERTISEMENT",
            "3 1/2 ounces softened cream cheese ADVERTISEMENT",
            "1/3 cup dry sherry ADVERTISEMENT",
            "4 (6 ounce) fillets monkfish fillets ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine shrimp soup and cream cheese in a small saucepan over medium heat; cook, stirring constantly, until the cream cheese has melted and sauce starts to bubble, 3 to 5 minutes. Stir in sherry. Cook, stirring constantly, until heated through, 1 to 2 minutes. Remove from heat and keep warm.\nPreheat oven to 400 degrees F (200 degrees C).\nSeason monkfish fillets with salt and black pepper. Place in a shallow baking dish.\nBake monkfish in the preheated oven until flesh flakes easily with a fork, 10 to 12 minutes.\nTransfer monkfish to serving plates. Serve topped with sauce and garnished with parsley.\n",
        "picture_link": "IeEIHe6EBW2Vpzb6KcfsttLmUjHaCZ."
    },
    {
        "title": "Browned Butter Apple Pie Dip",
        "ingredients": [
            "2 tablespoons LAND O LAKES® Butter ADVERTISEMENT",
            "2 apples - peeled, cored and diced ADVERTISEMENT",
            "1/4 cup white sugar, divided ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "Browned Butter: ADVERTISEMENT",
            "1/2 cup LAND O LAKES® Butter ADVERTISEMENT",
            "Dip: ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "3/4 cup powdered sugar ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "3/4 teaspoon ground cinnamon ADVERTISEMENT",
            "Chips: ADVERTISEMENT",
            "1 (15 ounce) package pie dough for a double-crust pie ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nMelt 2 tablespoons butter in skillet over medium heat. Saute apples until medium-firm, 2 to 3 minutes. Add 1/4 cup white sugar and pinch of salt. Cook until apples begin to brown, 3 to 5 minutes longer. Remove apples from the skillet and allow to cool. Wipe out skillet with a paper towel.\nPlace 1/2 cup of butter in skillet over medium heat. Constantly swirl the butter in the pan, watching carefully so butter does not burn. The butter is \"browned\" when it is a tan color and smells nutty. This can take 3 to 10 minutes. When butter is ready, promptly pour it into a bowl to prevent it from burning.\nAdd 1/2 cup white sugar to the apples and stir until sugar is well incorporated.\nIn a mixing bowl, combine browned butter, powdered sugar, cream cheese, vanilla, nutmeg and cinnamon until well combined. Add apple mixture and stir until well-blended.\nUnroll the pie crust on a silicone mat. Using a small cookie cutter, press out the pie crust \"chips.\" Lift the pie crust up, leaving the \"chips\" on the mat. Place the mat on a baking sheet. The remaining dough may be rolled out to 1/4\" thick and the process repeated to use up all the dough and make more \"chips\" using separate silicone mats (or parchment).\nBake in preheated oven, bake 6-7 minutes, watching carefully to ensure the chips to not burn. Allow the chips to cool. Place on serving plate.\nSpoon the dip into a serving bowl; serve with chips for dipping.\n",
        "picture_link": "apY7v2AV9ku9tLGSmGI9jub6/dzBXMC"
    },
    {
        "title": "Chocolate Peanut Butter Iced Coffee",
        "ingredients": [
            "1 cup brewed coffee ADVERTISEMENT",
            "1/2 cup soy milk ADVERTISEMENT",
            "2 tablespoons chocolate syrup ADVERTISEMENT",
            "1 tablespoon peanut butter ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 packet granular no-calorie sucralose sweetener (such as Splenda®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour coffee into an ice cube tray; freeze until coffee ice cubes form, 1 to 2 hours.\nCombine coffee ice cubes, soy milk, chocolate syrup, peanut butter, vanilla extract, and no-calorie sweetener in a blender. Cover and blend until frothy.\n",
        "picture_link": "T1rLwPLyyF4pBO/Lc7QvcMT58Wg2lC."
    },
    {
        "title": "Chef John's Thai-Style Sweet Chili Sauce",
        "ingredients": [
            "1/2 cup water ADVERTISEMENT",
            "1/2 cup white distilled vinegar ADVERTISEMENT",
            "2 tablespoons fish sauce ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1 tablespoon ketchup ADVERTISEMENT",
            "2 teaspoons sambal chili sauce ADVERTISEMENT",
            "1 1/2 teaspoons cornstarch ADVERTISEMENT",
            "6 cloves finely crushed garlic ADVERTISEMENT",
            "2 tablespoons finely minced Thai chili peppers (bird's eye peppers) ADVERTISEMENT",
            "1 tablespoon fresh lime juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place 1/2 cup cold fresh water and vinegar in a saucepan. Whisk in Asian fish sauce, brown sugar, ketchup, sambal chili sauce, and cornstarch. Whisk until cornstarch disappears. Place over medium-high heat and bring up to a simmer stirring occasionally. As it bubbles, it will start to thicken up. Remove pan from heat.\nWhisk garlic and chili into hot mixture. Add fresh lime juice; whisk again. Allow mixture to cool to room temperature before checking for seasonings.\nIf not using immediately, transfer to a glass jar with a lid. Refrigerate.\n",
        "picture_link": "RTGdnx6IY005idP2BG0hxPQZ6NSbAHG"
    },
    {
        "title": "Muffaletta Pretzel Crisps®",
        "ingredients": [
            "3 tablespoons chopped pimiento-stuffed olives ADVERTISEMENT",
            "3 tablespoons chopped black olives ADVERTISEMENT",
            "3 tablespoons chopped pickled banana peppers ADVERTISEMENT",
            "24 Snack Factory® Original Pretzel Crisps® ADVERTISEMENT",
            "4 slices salami, cut into 6 pieces each ADVERTISEMENT",
            "4 tablespoons cream cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix green olives, black olives and banana peppers together in a bowl.\nTop each pretzel crisp with a piece of salami and a teaspoon of cream cheese. Spoon a teaspoon of the olive/pepper mixture onto the cream cheese.\n",
        "picture_link": "ddpnfwzNhxhof3pwT9JLYOmMNYEyjBq"
    },
    {
        "title": "Banana Brownies",
        "ingredients": [
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 large ripe bananas, mashed ADVERTISEMENT",
            "2 eggs, well beaten ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup chopped pecans (optional) ADVERTISEMENT",
            "Frosting: ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "2 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1 1/2 cups confectioners' sugar ADVERTISEMENT",
            "2 tablespoons milk, or more as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9-inch square glass baking dish.\nMelt chocolate chips in a microwave-safe bowl on low power in 15-second intervals, stirring after each melting, 1 to 3 minutes. Cool slightly, about 5 minutes.\nMix flour, sugar, baking powder, and salt together in a bowl. Add melted chocolate, bananas, eggs, and vanilla extract; beat with an electric mixer on medium speed until well-blended. Stir in pecans. Spread batter in the prepared baking dish.\nBake in the preheated oven until top is dry and edges have started to pull away from the sides of the pan, 30 to 35 minutes. Let cool, about 25 minutes.\nCombine butter and cocoa powder in a saucepan over low heat; cook, stirring constantly, until smooth, about 3 minutes. Stir in confectioners' sugar and milk. Add more milk, 1 tablespoon at a time, until frosting is spreading consistency.\nSpread frosting over cooled brownies. Cut into squares.\n",
        "picture_link": "vKJH95UkxAr4odCZOI3hrSmCZsBdeqi"
    },
    {
        "title": "Sorghum, Kale and White Bean Tomato Soup",
        "ingredients": [
            "1/2 cup whole grain sorghum, uncooked ADVERTISEMENT",
            "3 cups low-sodium chicken broth ADVERTISEMENT",
            "1 tablespoon extra virgin olive oil ADVERTISEMENT",
            "2 large cloves garlic, finely chopped ADVERTISEMENT",
            "1 small-medium onion, chopped ADVERTISEMENT",
            "1/4 teaspoon kosher salt ADVERTISEMENT",
            "1/4 teaspoon black pepper ADVERTISEMENT",
            "12 ounces kale, thick stems removed, leaves chopped into 1-2-inch pieces ADVERTISEMENT",
            "1 teaspoon sriracha or other hot sauce ADVERTISEMENT",
            "2 (15 ounce) cans white cannellini beans or white kidney beans, drained and rinsed ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes in juice ADVERTISEMENT",
            "4 cups low-sodium chicken broth ADVERTISEMENT",
            "Grated Pecorino Romano or Parmesan cheese for topping ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring 3 cups of broth to a boil, add 1/2 cup of sorghum and allow to boil gently for approximately 20-25 minutes (liquid will remain, that's fine).\nMeanwhile, heat a large saucepan with lid over medium to medium/high heat. Add olive oil and saute garlic, onion, salt and pepper until the onion softens (approximately 6-8 minutes).\nAdd kale and sriracha, cook until wilted (about 4 minutes).\nTake 1/2 cup of white beans and either blend in a blender/small food processor or mash well with the back of a spoon or fork.\nAdd blended beans, remaining whole beans, canned tomatoes, sorghum/broth mixture and additional 4 cups low sodium chicken broth to kale mixture.\nBring to a boil, cover and reduce heat to simmer for approximately 20 minutes.\nTop with grated Pecorino Romano or Parmesan cheese (approximately 1 teaspoon per bowl) and serve.\n",
        "picture_link": "0VQT7naF6h4pMB4nycaPev6kDIBoCxO"
    },
    {
        "title": "Grilled Kansas City Smothered BBQ Chicken",
        "ingredients": [
            "4 skinless, boneless chicken breasts, pounded to 1/2-inch thickness ADVERTISEMENT",
            "2 cups Kansas City BBQ Sauce, divided (see below for recipe) ADVERTISEMENT",
            "1/3 cup sliced white mushrooms ADVERTISEMENT",
            "1/2 medium onion, thinly sliced ADVERTISEMENT",
            "8 slices provolone cheese ADVERTISEMENT",
            "Fresh cilantro or parsley (optional) ADVERTISEMENT",
            "Reynolds Wrap® Non-Stick Foil ADVERTISEMENT",
            "Kansas City BBQ Sauce: ADVERTISEMENT",
            "1 cup ketchup ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/4 cup yellow mustard ADVERTISEMENT",
            "1/4 cup apple cider vinegar ADVERTISEMENT",
            "1/4 cup Worcestershire sauce ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "2 tablespoons dark molasses ADVERTISEMENT",
            "2 teaspoons chili powder ADVERTISEMENT",
            "2 teaspoons garlic powder ADVERTISEMENT",
            "1 teaspoon liquid smoke ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together all sauce ingredients in a medium saucepan. Bring to a boil, reduce to a simmer and cook for 10 to 15 minutes. Remove from heat and allow to cool to room temperature, about 15 minutes.\nMeasure out 1/2 cup of sauce and set aside. Pour remaining sauce into a large sealable bag. Add chicken breasts to bag. Seal and refrigerate for 30 minutes.\nPreheat grill to medium heat and arrange four 12x12-inch pieces of Reynolds Wrap(R) Non-Stick Foil on the grill. Use tongs to transfer one chicken breast to each foil square. Discard marinade.\nBrush each chicken breast with some of the remaining 1/2 cup BBQ sauce. Top with mushrooms and onions. Fold foil around each chicken breast to enclose the chicken and veggies. Allow to cook over medium heat for 10 to 12 minutes or until chicken is tender and juices run clear or a meat thermometer inserted into the center reads 170 degrees F.\nUnwrap foil packets and place 2 slices of provolone cheese over each chicken breast so that the cheese is lying on top of the mushrooms and onions. Allow to cook uncovered 2 to 3 minutes longer or until cheese is melted. Garnish with fresh cilantro or parsley and serve.\n",
        "picture_link": "/hQJHY4j0Ul2ZHm6n.8OPpggM3XmOoG"
    },
    {
        "title": "Tomato Avocado Sandwich",
        "ingredients": [
            "1/2 avocado - peeled, pitted, and mashed ADVERTISEMENT",
            "1 teaspoon garlic salt ADVERTISEMENT",
            "1 slice ciabatta bread ADVERTISEMENT",
            "3 slices tomato ADVERTISEMENT",
            "1 pinch ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix mashed avocado and garlic salt together in a bowl; spread onto ciabatta bread. Layer tomatoes over avocado and top with black pepper.\n",
        "picture_link": "a92JYowGLP17ooZBkubBr8/sPEpSBEC"
    },
    {
        "title": "Creamy Tuscan Chicken Rollups",
        "ingredients": [
            "3/4 cup whipped cream cheese ADVERTISEMENT",
            "1/2 cup thinly-sliced sun-dried tomatoes ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "6 skinless, boneless chicken breasts - halved horizontally and pounded thin ADVERTISEMENT",
            "3/4 cup heavy whipping cream ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1/3 cup grated Parmesan cheese ADVERTISEMENT",
            "4 ounces chopped fresh basil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 (9.74 ounce) package Idahoan Signature™ Russets Mashed Potatoes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease an 8 x 8-inch baking dish.\nCombine whipped cream cheese, sun-dried tomatoes, garlic powder, and onion powder in a mixing bowl. Divide mixture among the chicken breast slices. Roll slices and place seam side down into prepared baking dish. Sprinkle with salt and pepper.\nBake in preheated oven until internal temperature reaches 165 degrees F, about 35 minutes.\nPrepare Idahoan Signature™ Russets Mashed Potatoes according to package instructions. Cover and keep warm.\nCombine heavy whipping cream, olive oil, and salt in a saucepan. Bring to a simmer over medium-high heat stirring constantly. Cook until sauce begins to thicken, about 4 minutes. Stir in chopped basil and Parmigiano-Reggiano cheese; remove from heat.\nServe chicken topped with sauce and with a side of Idahoan Signature™ Russets Mashed Potatoes.\n",
        "picture_link": "dS1xYmrAHtJYS0BNIUpGStMl.dsQqBK"
    },
    {
        "title": "Lemon Aioli",
        "ingredients": [
            "1/2 cup sour cream ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1 lemon, zested and juiced, or to taste ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon finely chopped parsley ADVERTISEMENT",
            "1 tablespoon finely chopped chives ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/4 teaspoon dry mustard ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine sour cream, mayonnaise, lemon zest, lemon juice, olive oil, parsley, chives, garlic, dry mustard, salt, and pepper in a bowl; mix until smooth.\n",
        "picture_link": "mevoVCR1Qw4V/O96FIk5fE5u//MVPqC"
    },
    {
        "title": "Homemade Chili",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced, or more to taste ADVERTISEMENT",
            "2 pounds lean ground beef ADVERTISEMENT",
            "2 (16 ounce) cans kidney beans, rinsed and drained ADVERTISEMENT",
            "1 (28 ounce) can diced tomatoes ADVERTISEMENT",
            "1 (15 ounce) can tomato puree ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 (4 ounce) can chopped green chile peppers ADVERTISEMENT",
            "2 tablespoons mild chili powder ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large skillet over medium-low heat. Add onion and garlic; cook and stir until onion is translucent, about 5 minutes. Add ground beef; cook and stir until browned, 8 to 10 minutes.\nTransfer beef mixture to a 6-quart slow cooker. Stir in kidney beans, diced tomatoes, tomato puree, water, green chile peppers, chili powder, salt, cumin, and black pepper.\nCook on Low until flavors combine, 4 to 6 hours.\n",
        "picture_link": "uDcmST0Ot/GVPJfNVuzCk8DkN8bbydS"
    },
    {
        "title": "Eric's Grilled Pork on Pork Rollatini",
        "ingredients": [
            "1/2 cup balsamic vinegar ADVERTISEMENT",
            "1 pound pork cutlets, thinly sliced ADVERTISEMENT",
            "3 fully cooked andouille sausages, diced ADVERTISEMENT",
            "1/4 cup diced onion ADVERTISEMENT",
            "1/4 cup chopped jalapeno ADVERTISEMENT",
            "2 peaches, pitted and chopped into 1/4-inch pieces ADVERTISEMENT",
            "1/2 cup diced apple ADVERTISEMENT",
            "kitchen twine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C) and place a grill pan in the oven. (Or preheat countertop induction oven on medium heat with grill pan inside.)\nBring balsamic vinegar to a boil in a saucepan; reduce heat and simmer until balsamic is reduced and thickened into a glaze, 10 to 15 minutes.\nPound pork cutlets with a mallet to about 1/2-inch thickness.\nCook and stir sausage, onion, and jalapeno in a skillet over medium heat until onion slightly translucent and sausage is cooked through, about 5 minutes. Add peaches and apple; cook and stir filling until fruit is softened, about 5 more minutes. Add about 1 tablespoon balsamic glaze to the top and stir.\nSpoon filling into the center of each pork cutlet, reserving leftover filling in the skillet. Roll up culet and tie with roasting twine. Place rolled pork onto heated grill pan and return to oven.\nBake in the preheated oven, turning pork halfway through, until pork is cooked through and browned on the outside, 20 to 25 minutes. (Or grill on medium heat in the countertop induction oven for 15 minutes (7 1/2 minutes each side.)\nPour balsamic glaze over leftover filling in the skillet; cook and stir over low heat just until warm. Spoon filling onto cooked stuffed pork.\n",
        "picture_link": "wyS9I12qxh8gN8hcbLZ0.D32AXoyD/2"
    },
    {
        "title": "Vincent's Country Bacon and Eggs",
        "ingredients": [
            "8 slices bacon ADVERTISEMENT",
            "1 tablespoon olive oil, or to taste ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 (8 ounce) package frozen spinach, thawed and squeezed dry ADVERTISEMENT",
            "sea salt and ground black pepper to taste ADVERTISEMENT",
            "2 (8 ounce) loaves Italian country bread ADVERTISEMENT",
            "8 eggs ADVERTISEMENT",
            "1/2 cup half-and-half ADVERTISEMENT",
            "1 pinch ground black pepper to taste ADVERTISEMENT",
            "1/2 cup Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). (If using a countertop induction oven, preheat to 390 degrees F (199 degrees C) or use the \"Combo 2\" setting.) Line a baking sheet with aluminum foil; arrange bacon slices on top.\nBake in the preheated oven until bacon is partially cooked through but not crispy, about 10 minutes in the conventional oven and 6 to 7 minutes in the countertop induction oven.\nReduce oven temperature to 375 degrees F (190 degrees C); reduce countertop induction oven temperature to 325 degrees F (163 degrees C).\nHeat olive oil in a large skillet over medium heat. Add garlic; cook and stir until fragrant, about 1 minute. Add spinach; season with salt and pepper. Cook and stir until spinach turns dark green, 3 to 5 minutes. Remove from heat.\nCut four 2-inch holes 3/4 of the way through each loaf, evenly spaced apart, using a small serrated knife. Remove bread cutouts with your fingers; discard or set aside for another use.\nPress 1 tablespoon of the spinach mixture into the bottom of each hole. Line each hole with 1 slice of bacon. Crack 1 egg into each hole; top with 1 tablespoon half-and-half. Season with salt and pepper. Sprinkle 1 tablespoon Parmesan cheese over half-and-half. Transfer loaves to a baking sheet.\nBake in the preheated oven until eggs are set, about 15 minutes.\n",
        "picture_link": "ku2mH9uPRTTmG7JWxO2q2usUUWENlPK"
    },
    {
        "title": "Buttery Cake Squares",
        "ingredients": [
            "Cake Base: ADVERTISEMENT",
            "4 ounces Finlandia Unsalted Butter, softened ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "3 tablespoons milk ADVERTISEMENT",
            "1/2 tablespoon vanilla extract ADVERTISEMENT",
            "1/2 cup flour ADVERTISEMENT",
            "1 box yellow cake mix ADVERTISEMENT",
            "Buttery Sweet Topping: ADVERTISEMENT",
            "8 ounces Finlandia Unsalted Butter, softened ADVERTISEMENT",
            "8 ounces cream cheese, softened ADVERTISEMENT",
            "8 ounces cake flour ADVERTISEMENT",
            "1 pound powdered sugar ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup corn syrup ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F. Grease 9x13-inch pan with Finlandia Unsalted Butter.\nBegin by making the cake base. Mix Finlandia Unsalted Butter, egg, milk, vanilla, flour and cake mix in a mixing bowl fitted with the paddle attachment until just combined. Press into the bottom of the 9 x 13 cake pan.\nIn the same bowl start making your topping. Mix Finlandia Unsalted Butter, cream cheese and vanilla until smooth. Slowly add in powdered sugar, cake flour and salt.\nOnce the mixture starts to come together, add in the eggs, corn syrup and milk. Mix on medium speed for three minutes until smooth, light and fluffy.\nSpread evenly over the cake base and place into the oven. Bake until the sides are golden brown and the middle is just set and lightly golden (approximately 35 to 45 minutes). Let cool.\nOnce the butter cake has cooled, sprinkle the top with powdered sugar and dig in!\n",
        "picture_link": "BsKMcHrPoRFzhlXoztOuR3/8lfKZSwW"
    },
    {
        "title": "Spicy Beef Burritos",
        "ingredients": [
            "6 ounces sliced jalapeno peppers ADVERTISEMENT",
            "1 tomato, diced ADVERTISEMENT",
            "1 (4 ounce) can chopped green chile peppers ADVERTISEMENT",
            "1 green bell pepper, diced ADVERTISEMENT",
            "1 red bell pepper, diced ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1 1/2 tablespoons hot sauce ADVERTISEMENT",
            "1/4 teaspoon ground cayenne pepper ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 (1 ounce) package burrito seasoning ADVERTISEMENT",
            "1 (14 ounce) can refried beans ADVERTISEMENT",
            "6 (10 inch) flour tortillas ADVERTISEMENT",
            "1 (10 ounce) bag shredded lettuce ADVERTISEMENT",
            "1 (8 ounce) container sour cream ADVERTISEMENT",
            "1 (8 ounce) package shredded sharp Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix jalapeno peppers, tomato, green chile peppers, green bell pepper, red bell pepper, onion, hot sauce, and cayenne pepper together in a large bowl.\nCook beef in a large skillet over medium-high heat, stirring to break up clumps, about 5 minutes. Drain excess grease. Add jalapeno pepper mixture and burrito seasoning; cook, covered, stirring occasionally, until flavors combine, about 10 minutes.\nPour refried beans into a saucepan over medium-low heat. Cook and stir until heated through, about 5 minutes.\nWarm each tortilla in the microwave until soft, 15 to 20 seconds. Spread a layer of refried beans on top. Divide beef mixture among tortillas. Top with lettuce, sour cream, and Cheddar cheese. Fold in opposing edges of each tortilla and roll up into a burrito.\n",
        "picture_link": "N8Pta5YlphaUouIVMiy.mAwLTPmNVwi"
    },
    {
        "title": "Autumn Waldorf Salad ",
        "ingredients": [
            "1/4 cup plain yogurt ADVERTISEMENT",
            "1 1/2 teaspoons brown sugar ADVERTISEMENT",
            "1 pear, diced ADVERTISEMENT",
            "1 apple, diced ADVERTISEMENT",
            "1 cup sliced celery (optional) ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1/4 cup dried cranberries ADVERTISEMENT",
            "2 tablespoons chopped walnuts ADVERTISEMENT",
            "1 dash ground cinnamon (optional) ADVERTISEMENT",
            "1 dash ground nutmeg (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix yogurt and brown sugar together in a bowl to make dressing.\nCombine pear, apple, celery, raisins, cranberries, and walnuts in a bowl. Add dressing and toss well to combine. Sprinkle cinnamon and nutmeg on top.\nChill salad before serving, at least 30 minutes.\n",
        "picture_link": "u40PI6984NaEiv5H0D0ReXLzXC1WN.O"
    },
    {
        "title": "Carrie's Salmon with Purple Pureed Potatoes and French Green Beans",
        "ingredients": [
            "1/3 cup reduced-sodium soy sauce ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1/4 cup white miso paste ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1 tablespoon dry white wine, or to taste ADVERTISEMENT",
            "1 pinch red pepper flakes ADVERTISEMENT",
            "2 (3 ounce) fillets salmon fillets ADVERTISEMENT",
            "1 pound purple potatoes, cut into small chunks ADVERTISEMENT",
            "1/4 cup 2% milk, or to taste ADVERTISEMENT",
            "2 tablespoons butter, softened, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 pound French green beans, trimmed ADVERTISEMENT",
            "1 clove garlic, chopped ADVERTISEMENT",
            "1 teaspoon butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix soy sauce, 1/4 cup vegetable oil, miso paste, brown sugar, white wine, and red pepper flakes together in a bowl to make marinade.\nPlace salmon fillets in a shallow dish. Add enough marinade to cover, reserving the remaining marinade. Marinate in the refrigerator, about 10 minutes.\nPreheat oven to 450 degrees F (230 degrees C). Lightly oil a cast iron skillet or grill pan and place in the oven while it preheats. (A countertop induction oven can be used in place of the oven. Preheat on the medium-high grill setting.)\nRemove salmon from marinade, reserving the marinade, and place skin-side up on the hot cast iron skillet; cook until bottom of salmon is lightly browned, 2 to 3 minutes. Flip salmon and continue cooking until fish flakes easily with a fork, 8 to 10 minutes more. (For the countertop induction oven, add salmon to grill pan, reserving marinade, and cook, skin-side down, for 1 1/2 minutes. Flip salmon and cook until fish flakes easily with a fork, 2 1/2 to 3 minutes.)\nPour reserved marinade into a saucepan and heat until boiling; remove from heat.\nPlace potatoes in a large pot and cover with salted cold water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain and return potatoes to the pot.\nHeat milk and 2 tablespoons butter together in a saucepan; bring to a simmer. Pour milk mixture over potatoes, a few tablespoons at a time, and mash using a potato masher until potatoes are desired chunkiness.\nHeat olive oil in a large skillet over medium heat. Add green beans and garlic; cook and stir until beans turn bright green and are lightly browned in places, about 5 minutes; stir in 1 teaspoon butter, salt, and pepper.\nServe mashed potatoes and green beans alongside salmon. Drizzle reserved cooked marinade over the top.\n",
        "picture_link": "rc6Yq/Hd2F7iKCZY48XAzcbYalinQsW"
    },
    {
        "title": "Big Mac® Clone",
        "ingredients": [
            "2/3 pound ground beef (85% lean) ADVERTISEMENT",
            "2 cups mayonnaise ADVERTISEMENT",
            "2 tablespoons prepared yellow mustard ADVERTISEMENT",
            "2 tablespoons sweet pickle relish ADVERTISEMENT",
            "1 1/2 teaspoons white wine vinegar, or more to taste ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon ground paprika ADVERTISEMENT",
            "4 hamburger bun bottoms ADVERTISEMENT",
            "2 hamburger bun tops ADVERTISEMENT",
            "2 tablespoons minced onion, or to taste ADVERTISEMENT",
            "1/2 cup shredded lettuce, or to taste ADVERTISEMENT",
            "2 tablespoons dill pickle slices, or to taste ADVERTISEMENT",
            "2 slices American cheese ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Shape ground beef into 4 flat patties that will fit the hamburger buns. Place them on a tray lined with waxed paper; transfer to the freezer.\nMix mayonnaise, mustard, pickle relish, white wine vinegar, onion powder, garlic powder, and paprika in a bowl to make sauce. Refrigerate for 10 minutes.\nPreheat a large skillet over medium heat. Toast buns in batches until lightly golden, 1 to 2 minutes.\nLayer some of the sauce, 1 tablespoon minced onion, 2 tablespoons lettuce, and pickles on 2 bottom buns. Layer some of the sauce and remaining 1 tablespoon minced onion, 2 tablespoons lettuce, and American cheese on the other bottom buns.\nSeason patties with salt and pepper. Cook in the hot skillet 2 at a time until browned, 3 to 4 minutes per side. Place 1 patty over each bottom bun; stack and cover with top buns.\n",
        "picture_link": "LIwkdeImaZfuElWD8CetJCQC5o.Qjye"
    },
    {
        "title": "Leslie's Super Easy Spinach-Artichoke Dip Twice-Baked Potatoes",
        "ingredients": [
            "2 large russet potatoes ADVERTISEMENT",
            "1 cup prepared spinach artichoke dip ADVERTISEMENT",
            "1/2 cup shredded Irish Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Pierce the potatoes in a couple of places with a sharp knife; place on a baking sheet.\nBake in the preheated oven until a knife easily slices through the potato, 45 to 60 minutes. Cool potatoes for 10 minutes.\nSlice potatoes horizontally; scoop out the flesh with a fork, leaving the skin intact. Mix potato flesh with spinach artichoke dip in a bowl; spoon back into the potato skins and top with Cheddar cheese.\nBake in the oven until cheese is beginning to melt, 15 to 20 minutes. Turn on oven's broiler and broil until cheese begin to bubble and brown, 2 to 5 minutes.\n",
        "picture_link": "M1RCCX2J.k7r2UI0ub7vndueBDsQ9rm"
    },
    {
        "title": "Brussels Sprouts 'n Gnocchi",
        "ingredients": [
            "1 tablespoon olive oil, or more to taste ADVERTISEMENT",
            "1 pound fresh Brussels sprouts, thinly sliced ADVERTISEMENT",
            "1/4 small onion, finely chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 pinch salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 cup water, or more as needed ADVERTISEMENT",
            "1 (16 ounce) package frozen gnocchi ADVERTISEMENT",
            "1 squeeze lemon juice (optional) ADVERTISEMENT",
            "1 pinch red pepper flakes (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large skillet over medium heat. Add Brussels sprouts and onion; cook and stir until onion starts to turn translucent, about 5 minutes. Stir in garlic, salt, and pepper.\nPour water and gnocchi into the skillet; cover and simmer until water is absorbed and gnocchi are tender, about 10 minutes. Increase heat to medium-high; cook and stir gnocchi until are browned, 2 to 3 minutes. Stir in lemon juice and red pepper flakes.\n",
        "picture_link": "mfK0FVZdWwNeSZJtJlURCaUsCHxvrM6"
    },
    {
        "title": "Decadent Mini Meatloaf",
        "ingredients": [
            "1 1/2 pounds ground chuck ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 tablespoon extra virgin olive oil ADVERTISEMENT",
            "1 onion, finely chopped ADVERTISEMENT",
            "1 cup chopped fresh figs ADVERTISEMENT",
            "1/2 cup crumbled feta cheese ADVERTISEMENT",
            "1 tablespoon chopped fresh basil ADVERTISEMENT",
            "1 (9.74 ounce) package Idahoan Signature™ Russets Mashed Potatoes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly oil a rimmed baking sheet.\nMix ground chuck, egg, salt, pepper, and garlic powder together in a bowl. Shape into 6 mini meat loaves and place on prepared baking sheet.\nHeat oil in a skillet over medium high heat. Cook and stir onion until tender, 5 to 7 minutes. Add figs and heat through.\nSpread fig mixture over mini loaves. Top with crumbled cheese and fresh basil.\nBake in preheated oven until no longer pink in the center, 30 to 40 minutes. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C).\nPrepare Idahoan Signature™ Russets Mashed Potatoes according to package instructions. Serve as a side to the meatloaf.\n",
        "picture_link": "urhx51oHUAZJssTFXpz60jLTpLe/C.C"
    },
    {
        "title": "Ann's Chocolate Chip Carrot Cake Pumpkins",
        "ingredients": [
            "Cupcakes: ADVERTISEMENT",
            "2 cups cake flour ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 1/2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 1/2 cups vegetable oil ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "2 cups grated carrots ADVERTISEMENT",
            "1 (8 ounce) can crushed pineapple, drained ADVERTISEMENT",
            "1 tablespoon cake flour ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup semisweet chocolate chips ADVERTISEMENT",
            "Frosting: ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "2 cups confectioners' sugar, or more as needed ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "3 drops orange food coloring ADVERTISEMENT",
            "1 (1.5 ounce) tube black decorating gel ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). (If using a countertop induction oven, preheat to 325 degrees F.) Grease 12 pumpkin-shaped cupcake molds (silicon molds work well).\nSift 2 cups cake flour, cinnamon, baking soda, baking powder, and salt together in a bowl. Mix in sugar, oil, and eggs until combined. Stir carrots and pineapple into the batter.\nPlace 1 tablespoon cake flour in a bowl. Toss walnuts and chocolate chips in flour until coated; fold into batter.\nPour batter into cupcake molds to about two-thirds full; gently tap molds onto work surface to remove air bubbles.\nBake in preheated oven (or countertop induction oven) until a toothpick inserted into the center of a cupcake comes out clean, 20 to 25 minutes (or 15 to 20 minutes in the countertop induction oven). Cool to room temperature, 15 to 20 minutes; remove from molds.\nCombine butter, cream cheese, and vanilla extract in a bowl; beat with an electric mixer until well blended, 4 to 6 minutes. Mix in confectioners' sugar on low speed, 1/2 cup at a time, until frosting is smooth and spreadable. Add lemon juice and orange food coloring; stir until combined. Refrigerate until set, 15 to 20 minutes.\nFrost cupcakes with the cream cheese frosting; decorate with black decorating gel.\n",
        "picture_link": "5wK.Xa4V4jrr0DEsnMJlDZZrrMhvjtG"
    },
    {
        "title": "Troy's Korean Glazed Chicken Breast with Kimchee Fried Rice",
        "ingredients": [
            "2 skin-on, boneless chicken breasts ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 cup peanut oil, divided ADVERTISEMENT",
            "1/4 cup Korean barbeque sauce ADVERTISEMENT",
            "1 slice fully cooked luncheon meat (such as SPAM®), cubed ADVERTISEMENT",
            "1 tablespoon butter, or more to taste ADVERTISEMENT",
            "1/2 cup chopped Napa cabbage kimchee ADVERTISEMENT",
            "1/4 cup chopped pickled carrot and daikon radish (optional) ADVERTISEMENT",
            "2 cups cooked white rice, cooled ADVERTISEMENT",
            "1 tablespoon soy-based liquid seasoning (such as Maggi®) ADVERTISEMENT",
            "2 teaspoons soy sauce ADVERTISEMENT",
            "1 tablespoon dried garlic flakes ADVERTISEMENT",
            "2 tablespoons gochujang (Korean hot pepper paste), or to taste ADVERTISEMENT",
            "1 tablespoon mayonnaise, or to taste ADVERTISEMENT",
            "1 teaspoon Sriracha hot sauce, or to taste ADVERTISEMENT",
            "1 green onion, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken breasts on a solid, level surface. Pound with a meat tenderizer to an even thickness; season with salt and pepper and toss with 2 tablespoons peanut oil until evenly coated.\nHeat a cast iron or heavy skillet over medium heat. Place chicken in heated skillet and cook until no longer pink in the center, about 4 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Brush barbeque sauce on top of chicken. Cover skillet and cook until chicken is glazed, about 1 minute per side. Transfer chicken to a plate and cover with aluminum foil to keep warm.\n(A countertop induction oven can be used in place of the skillet to cook the chicken. Preheat the oven with the grill pan inside on the grill setting. Grill chicken on medium until no longer pink in the center, about 4 minutes per side. Brush barbeque sauce on top of chicken and return to oven; cook until chicken is glazed, about 1 minute per side.)\nWipe skillet with a paper towel. Heat remaining 2 tablespoons peanut oil over medium heat. Add luncheon meat; cook and stir until browned and crisp, 3 to 5 minutes.\nHeat butter in a separate skillet over medium heat. Add pickled carrot and daikon, kimchee, and rice; cook and stir until heated through, 1 to 2 minutes. Season rice mixture with liquid seasoning and soy sauce; stir in garlic flakes. Cook and stir until rice is crisp in places, 3 to 5 minutes. Add gochujang and luncheon meat to fried rice and mix well.\nDivide fried rice among serving plates. Slice chicken breasts; arrange over rice.\nMix mayonnaise and Sriracha hot sauce together in a small bowl; spoon over chicken. Sprinkle green onion on top.\n",
        "picture_link": "F27vhhK/6y7I3nrAT9jG3MM7LIS/Lai"
    },
    {
        "title": "Perfect Potato Soup ",
        "ingredients": [
            "6 russet potatoes, peeled and cut into 1/2-inch cubes ADVERTISEMENT",
            "5 slices bacon, cut into 1/2-inch pieces ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "2 stalks celery, cut into 1/4-inch slices ADVERTISEMENT",
            "1/2 large onion, diced small ADVERTISEMENT",
            "20 baby carrots, cut into 1/4-inch pieces ADVERTISEMENT",
            "2 teaspoons kosher salt, divided ADVERTISEMENT",
            "1 1/2 teaspoons freshly ground black pepper, divided ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "2 cups half-and-half ADVERTISEMENT",
            "1 1/2 cups chicken broth ADVERTISEMENT",
            "1/4 teaspoon dried thyme ADVERTISEMENT",
            "1/8 teaspoon cayenne pepper ADVERTISEMENT",
            "1 dash ground nutmeg ADVERTISEMENT",
            "4 green onions, finely sliced ADVERTISEMENT",
            "1 dash paprika, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes into a large pot and cover with water; bring to a boil. Cook until fork-tender, about 10 minutes. Drain.\nPlace bacon in a large saucepan and cook over medium-high heat, turning occasionally, until crispy, about 8 minutes. Drain bacon slices on paper towels. Pour out bacon grease.\nMelt butter in the saucepan over medium heat, scraping the bottom of the pan with a flat-edged wooden spoon. Add celery, onion, carrots, 1 teaspoon salt, and 1/2 teaspoon pepper; cook and stir until tender, about 10 minutes. Sprinkle in flour; cook and stir for 2 minutes.\nPour half-and-half and chicken broth into the saucepan. Add potatoes, 1 teaspoon salt, 1/2 teaspoon pepper, thyme, cayenne pepper, and nutmeg. Bring to a boil, stirring frequently. Stir in bacon pieces. Reduce heat and simmer, stirring often, until flavors combine, about 10 minutes.\nLadle into serving bowls. Garnish with 1/2 teaspoon pepper, green onions, and paprika.\n",
        "picture_link": "had6rnokx4NlJNBGKzjy73Yhgq2ZJJS"
    },
    {
        "title": "Autumn Apple and Pear Lattice Pie",
        "ingredients": [
            "Pastry: ADVERTISEMENT",
            "2 1/2 cups flour ADVERTISEMENT",
            "1 tablespoon sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3/4 cup cold butter, cut into small pieces ADVERTISEMENT",
            "6 tablespoons cold shortening, cut into small pieces ADVERTISEMENT",
            "8 tablespoons ice water, or as needed ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "1 cup sugar ADVERTISEMENT",
            "3 tablespoons flour ADVERTISEMENT",
            "3/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground ginger ADVERTISEMENT",
            "1/4 teaspoon nutmeg ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 2/3 pounds Granny Smith apples - peeled, cored and cut into 1/4-inch-thick slices ADVERTISEMENT",
            "1 2/3 pounds firm ripe Anjou pears - peeled, cored and cut into 1/4-inch-thick slices ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "2 teaspoons water ADVERTISEMENT",
            "1 tablespoon butter, cut into bits ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine 2 1/2 cups flour, 1 tablespoon sugar, and 1/4 teaspoon salt in a large bowl. Cut in butter and shortening with a pastry blender or 2 knives until mixture resembles coarse crumbs. Stir in ice water, 1 tablespoon at a time, until mixture forms a ball. Divide dough in half and flatten each half into a 5-inch disk. Wrap in plastic wrap and chill at least 1 hour or up to 8 hours (overnight).\nCombine 1 cup sugar, 3 tablespoons flour, cinnamon, ginger, nutmeg, and 1/4 teaspoon salt in large bowl. Add apples and pears and toss to coat well.\nPreheat oven to 425 degrees F (220 degrees C). Position 2 racks in lower third of oven. Put a sheet of foil just a few inches larger than pie plate on bottom rack to catch drips.\nRoll out 1 piece of dough into a 12-inch round (about 1/8 inch thick) on a lightly floured work surface with a floured rolling pin. Line a 9-inch pie plate with pastry and trim overhang to 1/2 inch with kitchen shears or a paring knife. Roll out remaining dough in same manner and cut into 10 strips (3/4 to 1 inch wide) for a lattice.\nMound apple and pear filling into crust. Brush crust rim with some of egg wash. Dot filling with butter. Lay 5 strips of dough parallel across pie, about 1 inch apart, letting excess hang over rim. Lay remaining strips diagonally across pie in opposite direction. Press ends firmly to rim of pie, trimming excess dough. Crimp edges with your fingers or fork tines. Brush with remaining egg wash. Sprinkle with remaining tablespoon sugar.\nBake pie in lower third of oven for 15 minutes, then reduce temperature to 375 degrees F (190 degrees C) and bake until juices in center of pie are bubbling, about 45 minutes more. (Loosely cover pie with a sheet of foil if browning too quickly.) Transfer pie to a wire rack and cool 2 hours.\n",
        "picture_link": "X2gzYxPBP9ps4Y321zeA1auLMf6HJEi"
    },
    {
        "title": "Breakfast Casserole from Borden® Cheese",
        "ingredients": [
            "1 pound bulk pork sausage ADVERTISEMENT",
            "1 (32 ounce) package frozen potato rounds ADVERTISEMENT",
            "10 eggs ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "8 ounces Borden® Colby Jack Shredded Cheese ADVERTISEMENT",
            "8 slices bacon, cooked crisp and drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F. Spray a 13 x 9 baking dish with non-stick cooking spray.\nHeat a non-stick skillet over medium-high heat until hot. Add the sausage to the skillet and cook, stirring occasionally, until browned; drain and set aside.\nPlace the potato rounds in the prepared baking dish. Arrange the cooked sausage evenly over the potatoes. Beat the eggs with the milk in a medium bowl or a 1-quart glass measure. Pour egg mixture over potatoes and sausage. Sprinkle cheese over eggs. Crumble bacon over cheese. Cover with foil, and bake for 40 minutes or until eggs are set and the dish has cooked through. Uncover, and bake an additional 10 minutes.\n",
        "picture_link": "sBUwkQZWcQEr98MPjXWr1tcONIW1fMy"
    },
    {
        "title": "Berbere Spiced Chicken Breasts",
        "ingredients": [
            "1 skinless, boneless chicken breast half - lightly pounded to an even thickness ADVERTISEMENT",
            "1 teaspoon kosher salt ADVERTISEMENT",
            "1 tablespoon berbere spice blend, or to taste ADVERTISEMENT",
            "2 teaspoons butter ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "2 teaspoons tomato paste ADVERTISEMENT",
            "1/4 cup chicken broth, or as needed ADVERTISEMENT",
            "1/3 cup coconut milk ADVERTISEMENT",
            "1/2 teaspoon berbere spice blend, or to taste ADVERTISEMENT",
            "Salt to taste ADVERTISEMENT",
            "1 tablespoon chopped cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season both sides of chicken breast with salt. Sprinkle 1 tablespoon berbere spice mix to coat both sides of chicken breast (see Cook's Note for recipe link).\nMelt butter in a skillet over medium-high heat until it just starts to turn brown. Immediately transfer chicken breast to skillet; cook 2 to 3 minutes per side. Transfer chicken to a warm dish.\nStir in lime juice, tomato paste, chicken broth, and coconut milk; stir to deglaze pan. Bring to a simmer while stirring. Add 1/2 teaspoon berbere spice and a pinch of salt. Transfer chicken breast back to skillet; reduce heat to medium-low. Cook until chicken is cooked through and sauce starts to reduce, basting chicken with pan juices as it cooks, 4 or 5 more minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nSprinkle with chopped cilantro. Serve with a drizzle of the pan sauce.\n",
        "picture_link": "BhM85UPwE7ZSeaIwpTDFCuCEPpCAEHa"
    },
    {
        "title": "Banana Milk Coffee",
        "ingredients": [
            "1 cup milk ADVERTISEMENT",
            "1 very ripe banana ADVERTISEMENT",
            "1 tablespoon simple syrup (optional) ADVERTISEMENT",
            "ice cubes ADVERTISEMENT",
            "1 cup cold brew coffee ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine milk, banana, and simple syrup in a blender; blend until very smooth, about 1 minute.\nFill two 16-ounce glasses with ice cubes. Divide coffee between the glasses. Pour banana milk on top, dividing it evenly between the glasses.\n",
        "picture_link": "ZV6ORud9P4q6rtVIiUx2UUK5t6CgPJ6"
    },
    {
        "title": "Spiced Orange Olive Oil Cake",
        "ingredients": [
            "4 eggs ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2/3 cup extra-virgin olive oil ADVERTISEMENT",
            "2 tablespoons fresh orange zest ADVERTISEMENT",
            "1 teaspoon Chinese five-spice powder ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly oil and flour a loaf pan.\nBeat eggs in a bowl until lightened in color. Add sugar, olive oil, orange zest, and five-spice powder and beat until smooth. Fold flour, baking powder, and salt into egg mixture until batter is just mixed. Pour batter into the prepared loaf pan.\nBake in the preheated oven until a toothpick inserted in the center comes out clean, about 45 minutes. Cool in the pan for 10 minutes. Remove cake from the pan and cool on a wire rack.\n",
        "picture_link": "PX/cnuJfaSBuatlWV6m54lqadit0lz2"
    },
    {
        "title": "Warm Berry Compote",
        "ingredients": [
            "6 cups frozen mixed berries ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 1/2 teaspoons finely grated orange zest ADVERTISEMENT",
            "1/4 cup orange juice ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together berries, sugar, zest, and juice in a slow cooker. Cook on High until bubbling, about 1 1/2 hours.\nStir together cornstarch and water in a cup until fully dissolved. Stir into berry mixture. Cook, covered, until thickened, 5 to 10 minutes more. Serve warm or room temperature.\n",
        "picture_link": "vbzO6hegJOA7zaQZQCExLktFU4fl9z."
    },
    {
        "title": "Mocha-Coco Smoothie",
        "ingredients": [
            "3 cups brewed coffee, chilled ADVERTISEMENT",
            "1 large frozen banana ADVERTISEMENT",
            "1/2 cup unsweetened coconut or almond creamer ADVERTISEMENT",
            "2 tablespoons coconut oil ADVERTISEMENT",
            "2 tablespoons cocoa powder ADVERTISEMENT",
            "2 (1 gram) packets Stevia In The Raw® ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill an ice cube tray with coffee and freeze 4 hours or until completely frozen. Reserve remaining chilled coffee.\nIn a blender, place 1 cup coffee ice cubes along with 3/4 cup chilled coffee, banana, creamer, coconut oil, cocoa powder, and stevia. Blend until smooth.\n",
        "picture_link": "wLM/WSRXJHY5VeAl7GFhrxXrT4k8HDW"
    },
    {
        "title": "Vanilla Bean Pastry Cream",
        "ingredients": [
            "1 large whole egg ADVERTISEMENT",
            "2 large egg yolks ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 cup cornstarch ADVERTISEMENT",
            "1 teaspoon kosher salt ADVERTISEMENT",
            "2 cups whole milk ADVERTISEMENT",
            "1 vanilla bean ADVERTISEMENT",
            "4 tablespoons cold butter, cubed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place whole egg and 2 egg yolks into a mixing bowl. Add sugar, corn starch, and salt. Whisk together completely until mixture turns from yellow to a very page creamy color and is slightly thickened, 5 to 8 minutes.\nPlace milk in a saucepan. Split vanilla bean lengthwise. Scrape the cut side with a paring knife to extract the seeds (paste). Add the seeds to the milk. Heat over medium-high heat, stirring occasionally, until milk just barely starts to simmer and a few small bubbles appear on the surface. Remove from heat. Whisk hot milk into egg mixture, starting with a small splash then incorporating the rest. Pour mixture back into saucepan.\nPlace pan over medium-low heat and continue to whisk until mixture begin to thicken, 3 to 5 minutes. Remove from heat and let it cool 5 minutes. Add chunks of butter and whisk until butter melts into the warm milk mixture. Pass mixture through a fine mesh strainer to remove and chunks of cooked egg or vanilla seeds. Cover surface with plastic to keep it from discoloring; refrigerate until thoroughly chilled 2 to 3 hours.\n",
        "picture_link": "A8mSOR4VvCPrpiELHN2nxu./kFUKupe"
    },
    {
        "title": "Buffalo Chicken and Potato Casserole ",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1/4 cup ranch dressing ADVERTISEMENT",
            "2 tablespoons Buffalo wing sauce (such as Frank's® RedHot®) ADVERTISEMENT",
            "2 tablespoons garlic powder ADVERTISEMENT",
            "1 tablespoon onion powder ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "6 Idaho potatoes, cut into 1-inch cubes ADVERTISEMENT",
            "2 pounds skinless, boneless chicken breasts, cut into 1-inch cubes ADVERTISEMENT",
            "1 (12 ounce) package bacon ADVERTISEMENT",
            "3 cups shredded Colby Jack cheese ADVERTISEMENT",
            "4 green onions, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 500 degrees F (260 degrees C). Grease a 9x13-inch casserole dish with cooking spray.\nMix oil, ranch dressing, Buffalo wing sauce, garlic powder, onion powder, and salt together in a a large bowl to make sauce. Add potatoes; stir to coat thoroughly. Transfer potatoes to the casserole dish.\nPlace chicken in the sauce bowl; stir to coat with remaining sauce. Marinate in the refrigerator, about 30 minutes.\nRoast potatoes in the preheated oven while chicken marinates, stirring halfway, until tender, about 30 minutes. Stir in chicken. Continue roasting, stirring once or twice, until chicken and potatoes are tender, 15 to 30 minutes.\nPlace bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels.\nCrumble bacon into a bowl; stir in Colby Jack cheese and green onions.\nSprinkle cheese mixture over potatoes and chicken; bake until cheese is melted and bubbly, about 5 minutes.\n",
        "picture_link": "FZSH0iX6IT900zvUumeoxsLJWPgMCai"
    },
    {
        "title": "Lemony Cabbage-Avocado Slaw",
        "ingredients": [
            "6 cups finely shredded white and red cabbage ADVERTISEMENT",
            "1 ripe avocado, diced ADVERTISEMENT",
            "1 small red bell pepper, chopped ADVERTISEMENT",
            "1/4 cup shelled hemp seeds ADVERTISEMENT",
            "3 tablespoons lemon juice ADVERTISEMENT",
            "3 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "2 tablespoons finely chopped red onion ADVERTISEMENT",
            "1/4 teaspoon fine sea salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine cabbage, avocado, red bell pepper, hemp seeds, lemon juice, cilantro, onion, and sea salt in a large bowl; toss together until slaw has a creamy consistency.\n",
        "picture_link": "g9S/TGGoZkvd5/0BJdfv.c.6OX2E.6O"
    },
    {
        "title": "Greek Flank Steak and Veggie Salad",
        "ingredients": [
            "2 pounds flank steak ADVERTISEMENT",
            "6 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "1/4 cup fresh lemon juice ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "2 teaspoons ground oregano ADVERTISEMENT",
            "1 teaspoon kosher salt ADVERTISEMENT",
            "1/4 teaspoon black pepper ADVERTISEMENT",
            "1 (15 ounce) can chickpeas, drained and rinsed ADVERTISEMENT",
            "1 1/2 cups cherry tomatoes, halved ADVERTISEMENT",
            "1 English cucumber, chopped ADVERTISEMENT",
            "1 red onion, chopped ADVERTISEMENT",
            "8 cups chopped romaine lettuce ADVERTISEMENT",
            "1 cup crumbled feta cheese ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put steak in a large resealable plastic bag. Whisk olive oil, lemon juice, Worcestershire sauce, garlic, oregano, salt, and pepper in a small bowl. Reserve 1/2 cup marinade for vegetables; pour remainder over steak and turn to coat. Seal bag. Chill at least 2 hours or up to 12 hours.\nPreheat oven to 450 degrees F (230 degrees C). Place 1 rack in center position and another 4 inches from broiler. Line a baking sheet with aluminum foil and spray with cooking spray.\nToss chickpeas, tomatoes, cucumber, and onion with reserved 1/2 cup marinade on the prepared baking sheet and spread in an even layer.\nRoast on center rack until vegetables begin to pucker and brown, 15 to 20 minutes.\nRemove baking sheet from oven and turn oven to broil. Push vegetables to the middle of the pan. Remove steak from marinade, allowing excess liquid to drip off, brush off garlic, and set on top of vegetables. Discard marinade.\nBroil steak on top rack, flipping once, until it begins to char and an instant-read thermometer inserted into thickest part registers 125 degrees F for rare or 135 degrees F for medium-rare, 3 to 5 minutes per side.\nCover loosely with foil and let rest 10 minutes before slicing steak thinly across the grain. Serve warm steak and vegetables with pan juices over romaine, sprinkled with feta cheese and parsley.\n",
        "picture_link": "UwzhdyGJHyjeDzL1UVnf68v8W7p6XGq"
    }
]