[
    {
        "title": "Refreshing Summer Squash Salad",
        "ingredients": [
            "2 yellow squash, shaved into thin strips ADVERTISEMENT",
            "1 zucchini, shaved into thin strips ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 tablespoons chopped fresh mint ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 teaspoons fresh lemon juice ADVERTISEMENT",
            "1/2 teaspoon grated lemon zest ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper ADVERTISEMENT",
            "3 slices prosciutto, chopped ADVERTISEMENT",
            "1/4 cup crumbled feta cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss yellow squash and zucchini with salt in a large bowl.\nWhisk mint, olive oil, lemon juice, lemon zest, and black pepper in a small bowl; pour over squash mixture. Toss to coat.\nHeat a small nonstick skillet over medium heat; cook and stir prosciutto in the hot skillet until crisp, about 2 minutes.\nDivide squash salad over 4 plates. Evenly sprinkle prosciutto and feta cheese over salads.\n",
        "picture_link": "n8yuLGevZUtV.s2EX4C5ebJJ2MZRCj6"
    },
    {
        "title": "Best Ever Salmon Sauce",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "2 tablespoons Dijon mustard ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "2 teaspoons ketchup ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat butter, soy sauce, mustard, garlic, ketchup, and Worcestershire sauce in a saucepan over medium heat until butter is melted and sauce comes to a gentle simmer, about 10 minutes. Serve warm.\n",
        "picture_link": "svIk5gnvLaSJ3ESQiYKsXtDbGTNsmeG"
    },
    {
        "title": "Cannoli I",
        "ingredients": [
            "3 cups ricotta cheese ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1/2 cup chopped candied citron ADVERTISEMENT",
            "1/4 cup semisweet chocolate chips ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3 tablespoons shortening ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 tablespoons distilled white vinegar ADVERTISEMENT",
            "2 tablespoons cold water ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "1/4 cup finely chopped pistachio nuts ADVERTISEMENT",
            "1/3 cup confectioners' sugar for decoration ADVERTISEMENT",
            "1 cup vegetable oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To Make Filling: Combine ricotta cheese, 1 1/4 cups white sugar, and 2 teaspoons vanilla until smooth and creamy. Stir in candied citron and semi-sweet chocolate pieces. Refrigerate to chill.\nTo Make Shells: Sift together into a bowl 3 cups flour, 1/4 cup sugar, 1 teaspoon cinnamon and 1/4 teaspoon salt. Cut in the shortening with a pastry blender until pieces are the size of small peas. Stir in 2 beaten eggs. Blend in the white vinegar and the cold water one tablespoon at a time.\nTurn dough onto lightly floured surface and knead until smooth and elastic. Wrap in waxed paper and chill in refrigerator for half an hour.\nFrom cardboard, cut an oval pattern measuring 6 x 4 1/2 inches. Roll chilled dough 1/8 inch thick on floured surface. Using the cardboard pattern and a pastry cutter, cut ovals from dough. Wrap dough ovals loosely around tubes, just lapping over opposite edges. Seal edges by brushing with the slightly beaten egg white.\nSet out a deep saucepan 1/2 to 2/3 full of vegetable oil or shortening and heat to 360 degrees F (180 degrees C). Fry only as many cannoli shells as will float uncrowded one layer deep. Fry about 8 minutes or until golden. Turn occasionally while frying.\nDrain off excess fat before removing to absorbent paper. Cool slightly. Remove tubes. Cool shells completely.\nWhen ready to serve, fill with chilled ricotta filling. Sprinkle ends of cannoli with chopped pistachio nuts and dust shells with confectioners' sugar. Keep cannoli filling refrigerated.\n",
        "picture_link": "1mUxdyk0tKzoHKU4z42icwaJLDneF5a"
    },
    {
        "title": "Sweet Pretzel Stacks",
        "ingredients": [
            "2 cups crushed pretzels ADVERTISEMENT",
            "1/4 cup peanuts ADVERTISEMENT",
            "2/3 cup sweetened condensed milk ADVERTISEMENT",
            "1/2 cup semisweet chocolate chips ADVERTISEMENT",
            "1/2 cup butterscotch chips ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large mixing bowl combine pretzels and peanuts. Set aside.\nIn a medium saucepan mix together condensed milk, chocolate chips and butterscotch chips. Cook over low heat stirring constantly until chips are melted (about 5 minutes). Remove pan from heat and stir in vanilla extract.\nPour saucepan mixture over the pretzel/peanut mixture and stir until thoroughly coated. Drop by rounded teaspoons onto waxed paper or foil. Cool (or chill) until firm. Store in covered container in cool place (or in fridge).\n",
        "picture_link": "mPm7qZk16lc3sq5y5Qp5F0TH7n./pYG"
    },
    {
        "title": "Cinnamon Graham Crunchy Cookies",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup rolled oats ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "2 cups crumbled cinnamon graham crackers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, cream butter, sugar and brown sugar until fluffy. Add eggs and vanilla and beat until smooth. In another bowl, mix flour, baking soda, baking powder and salt. Add dry ingredients to creamed mixture and stir until it becomes a soft dough.\nStir in oats, chocolate chips, pecans, and 1 cup of graham cracker crumbs.\nDrop teaspoonfuls of dough into remaining graham cracker crumbs and coat well. Place on a lightly greased baking sheet and bake at 350 degrees F (175 degrees C) for 10-13 minutes or until lightly browned. Cool on wire rack and store in airtight container.\n",
        "picture_link": "SgmP.F72jw/RMH2OYomqDVC/0hU5O5m"
    },
    {
        "title": "Chicken Hekka",
        "ingredients": [
            "1 1/2 pounds skinless, boneless chicken breast meat ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "3/4 cup soy sauce ADVERTISEMENT",
            "3/4 cup mirin (Japanese sweet wine) ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 tablespoon grated fresh ginger ADVERTISEMENT",
            "3 carrots, julienned ADVERTISEMENT",
            "2 onions, thinly sliced ADVERTISEMENT",
            "1 (14 ounce) can shredded bamboo, drained ADVERTISEMENT",
            "1/2 pound fresh mushrooms, sliced ADVERTISEMENT",
            "1 cup trimmed and coarsely chopped watercress ADVERTISEMENT",
            "1 (8 ounce) package rice noodles, soaked and cut into 2 inch pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut chicken meat into bite size pieces. In a medium bowl combine the sugar, soy sauce, and mirin wine. Mix well, and set aside.\nIn a skillet or wok, heat oil over medium-high heat. Squeeze juice from grated ginger into wok, add grated ginger, and stir fry until brown. Discard ginger fibers. Increase heat to high, and stir in chicken. Season with soy sauce mixture, and cook for 2 more minutes.\nOne at a time add the carrots, onions, bamboo shoots, mushrooms, and watercress. Stir after each addition. Add rice noodles; cook, stirring, for about 3 more minutes, or until done.\n",
        "picture_link": "AjsE8a84CHgONQifq4guL15qAfmMpw6"
    },
    {
        "title": "Strawberry Shortcut Cake",
        "ingredients": [
            "1 cup miniature marshmallows ADVERTISEMENT",
            "2 (10 ounce) packages frozen sliced strawberries in syrup, thawed ADVERTISEMENT",
            "1 (3 ounce) package strawberry flavored Jell-O® ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "3 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease bottom only of a 9x13 inch baking pan. Sprinkle the marshmallows evenly over bottom of pan. Thoroughly combine completely thawed strawberries and their syrup with dry gelatin; set aside.\nIn large mixing bowl, mix flour, sugar, baking powder and salt. Make a well in the center and add shortening, milk, vanilla and eggs. Blend at low speed until moistened, then beat 3 minutes at medium speed, scraping sides of bowl occasionally. Pour batter evenly over marshmallows in pan. Spoon strawberry mixture evenly over batter.\nBake at 350 degrees F (175 degrees C) for 45 to 50 minutes until golden brown and toothpick inserted in center of cake comes out clean.\n",
        "picture_link": "WpHk9EdtLr9Lm4Hz3E3uRzPvZbJ8Lb."
    },
    {
        "title": "S'More Bars I",
        "ingredients": [
            "3/4 cup white sugar ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups milk chocolate candy bar, chopped ADVERTISEMENT",
            "3 cups miniature marshmallows ADVERTISEMENT",
            "1/2 cup chopped peanuts (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (180 degrees C). Lightly grease 13 x 9 x 2 inch pan.\nIn large mixer bowl combine sugar, butter and egg until creamy (2 or 3 minutes). Reduce mixer speed and add flour, baking powder and salt until blended.\nSpread batter into baking pan. Bake for 10 to 12 minutes, until set.\nSprinkle chopped chocolate bar over batter and top with marshmallows and peanuts. Continue baking 10 to 12 minutes until marshmallows are lightly browned. Cool and cut into bars.\n",
        "picture_link": "abohKsFEFh9E9bpvVJBob0eQqeSTah."
    },
    {
        "title": "Cornflake Clusters",
        "ingredients": [
            "1/2 cup corn syrup ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "2 cups cornflakes cereal ADVERTISEMENT",
            "1/2 cup flaked coconut ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine corn syrup, sugar and butter in medium size sauce pan. Bring to boil over medium heat stirring constantly. Continue boiling 5 minutes, while stirring. Remove from heat.\nAdd remaining ingredients, mixing thoroughly.\nDrop by level tablespoonfuls onto waxed paper or buttered baking sheets; cool until firm.\n",
        "picture_link": "gt05xo0Ba8Bp9jrI4q.TikaKu7hJRuy"
    },
    {
        "title": "Peanut Butter Tandycakes",
        "ingredients": [
            "1 cup milk ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "16 ounces milk chocolate candy ADVERTISEMENT",
            "2 cups creamy peanut butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 10x15 inch jelly roll pan.\nIn a large bowl, mix together eggs, vanilla, salt, sugar, flour, and baking powder. Blend in melted butter or margarine and milk.\nBake for 15 to 20 minutes. Spread with peanut butter while still hot. Refrigerate until cool.\nMelt chocolate bars, and spread on cooled cake.\n",
        "picture_link": "269v.NoMFwsuon33SjtMzpDkjdZGkr."
    },
    {
        "title": "Cookie Mix in a Jar VIII",
        "ingredients": [
            "3/4 cup white sugar ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "8 peanut butter cups, cut into 1/2 inch pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together the flour, baking powder and baking soda. Set aside.\nLayer ingredients in order given in a 1 quart ''wide mouth'' canning jar. Press each layer firmly in place. It will be a tight fit. Add chopped peanut butter cups last.\nAttach these directions to Jar: Reese's Peanut Butter Cup Cookies 1. Remove peanut butter cups from jar. Set aside. 2. Empty remaining cookie mix into large mixing bowl. Use your hands to thoroughly blend mix. 3. Add 1/2 cup butter or margarine, softened at room temperature. DO NOT USE DIET MARGARINE. Add in 1 egg, slightly beaten, and 1 teaspoon vanilla. 4. Mix until completely blended. You will need to finish mixing with your hands. 5. Mix in peanut butter cups. 6. Shape into walnut sized balls. Place 2 inches apart on greased cookie sheets. 7. Bake at 375 degrees F (190 degrees C) for 12 to 14 minutes until edges are lightly browned. Cool 5 minutes on baking sheet. Remove cookies to racks to finish cooling. Makes 2 1/2 dozen cookies.\n",
        "picture_link": "2hN2Kw14nq0Gd3IPfOhZLbdK32BGh.O"
    },
    {
        "title": "Egg Paint",
        "ingredients": [
            "1 egg yolk ADVERTISEMENT",
            "4 drops red food coloring ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In small cup or bowl , stir the egg yolk with a small amount of food coloring. Use a clean paintbrush to create designs on the cookies before you bake them.\n",
        "picture_link": "8W4AzXaeT25H9TJjdNhyjJOEJE1BCwC"
    },
    {
        "title": "Yellow Chess Cake",
        "ingredients": [
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "1 (16 ounce) can cherry pie filling ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, combine cake mix and butter. Mix until crumbly. Pat mixture into bottom of 9x13 inch glass baking dish.\nBake at 350 degrees F (175 degrees C) for 10 minutes.\nIn large bowl, combine cream cheese and confectioners sugar. Mix until smooth. Pour over pre-baked cake mix. Top with cherry pie filling.\nBake at 350 degrees F (175 degrees C) for 35 minutes, or when you see the cheese rise to the top. Cherries usually go under when baked.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Orange Balls I",
        "ingredients": [
            "1 1/8 cups vanilla wafers, crushed ADVERTISEMENT",
            "3/4 cup flaked coconut ADVERTISEMENT",
            "3/4 cup confectioners' sugar ADVERTISEMENT",
            "1/2 (6 ounce) can frozen orange juice concentrate, thawed ADVERTISEMENT",
            "1/3 cup confectioners' sugar for rolling ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together the vanilla wafers, coconut, 3/4 cup confectioners' sugar, and frozen orange juice.\nMold into 1 inch balls and roll in confectioners' sugar. Store, covered, in the refrigerator.\n",
        "picture_link": "rfYosD16wPhCOoF9wBZUVVQlfpHzb4q"
    },
    {
        "title": "Champagne Cake With Buttercream Icing",
        "ingredients": [
            "4 cups all-purpose flour ADVERTISEMENT",
            "3 cups white sugar ADVERTISEMENT",
            "5 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 2/3 cups milk ADVERTISEMENT",
            "1 cup shortening ADVERTISEMENT",
            "1/2 cup champagne ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "12 drops red food coloring (optional) ADVERTISEMENT",
            "8 egg whites ADVERTISEMENT",
            "9 tablespoons champagne ADVERTISEMENT",
            "3/4 cup shortening ADVERTISEMENT",
            "3/4 cup butter, softened ADVERTISEMENT",
            "1 tablespoon champagne ADVERTISEMENT",
            "4 1/2 cups confectioners' sugar ADVERTISEMENT",
            "edible carnations, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C), Grease and flour one 9 inch round and one 9x13 inch pan.\nIn a very large bowl stir together flour, sugar, baking powder, soda, and salt.\nAdd milk, 1 cup shortening, 1/2 cup champagne, vanilla, and, if desired, red food coloring. Beat on low to medium speed about 30 seconds or just till combined, scraping bowl constantly. Beat on medium speed 2 minutes.\nAdd unbeaten egg whites and beat for 2 minutes (Batter may appear slightly curdled).\nSpread 2 3/4 cups batter in 9inch round pan and remaining batter in 9x13 inch pan. Bake at 350 degrees F (175 degrees C) for 30 to 35 minutes for round cake and 40 to 45 minutes for rectangular cake or until cake tests done. Cool cakes in pans on racks for 10 minutes, then remove from pans and cool completely.\nTo make the frosting: In a bowl beat 3/4 cup shortening and butter until combined. Beat in 1 tablespoon champagne. Beat in sifted powdered sugar and a few drops red food coloring. If necessary, beat in additional champagne to make frosting spreading consistency. Makes 3-3/4 cups.\nUsing cardboard circle patterns of 4 and 6 inches, cut one 4-inch and one 6-inch cake layer from the 9x13 inch cake. If desired, drizzle 3 tablespoons of champagne over the top of each round cake layer. Place the 9-inch cake layer on a serving plate; frost sides and top. Lining up the backs of the layers, place the 6-inch cake on top of the 9-inch cake. Frost sides and top. Repeat with remaining 4-inch cake. If desired, tint any remaining frosting and decorate with tinted frosting and flowers. Serves 24.\n",
        "picture_link": "eVCxCVgLaQzi5.oeJu1sFL2wQUWovvm"
    },
    {
        "title": "Chocolate Sauerkraut Cake II",
        "ingredients": [
            "3/4 cup drained and chopped sauerkraut ADVERTISEMENT",
            "1 1/2 cups buttermilk ADVERTISEMENT",
            "2/3 cup butter ADVERTISEMENT",
            "1 3/4 cups packed light brown sugar ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2/3 cup unsweetened cocoa powder ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan. Sift cocoa, flour, baking powder, baking soda and salt together and set aside. In a separate small bowl, combine buttermilk with sauerkraut and set aside.\nIn a large bowl, cream butter, brown sugar and vanilla until light and fluffy. Add eggs and beat in. Add flour mixture alternately with sauerkraut mixture. Beat only until blended.\nPour batter into 9x13 inch pan. Bake at 350 degrees F (175 degrees C) for about 45 minutes, or until toothpick inserted into cake comes out clean. Cool cake and frost with your favorite chocolate frosting.\n",
        "picture_link": "efKUX7R3yMYQp7nxPxWNp3rqIOh6pzW"
    },
    {
        "title": "Easy Flake Chicken",
        "ingredients": [
            "salt and pepper to taste ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "3 skinless, boneless chicken breast halves - cut into cubes ADVERTISEMENT",
            "1 cup crushed corn flake cereal crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nIn a small cup combine the salt, pepper, olive oil and milk. Mix well and pour the mixture into a 9x13 inch baking dish. Add the cubed chicken and cover with cornflake crumbs. Bake in the preheated oven for 25 minutes, until the crumbs are crisp.\n",
        "picture_link": "wC08V6LkGazuZMjG0xd/sAcewl.34qK"
    },
    {
        "title": "Kentucky Bourbon Cake",
        "ingredients": [
            "2 cups bourbon ADVERTISEMENT",
            "8 ounces golden raisins ADVERTISEMENT",
            "16 ounces red candied cherries, halved ADVERTISEMENT",
            "3/4 pound butter ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "6 egg yolks ADVERTISEMENT",
            "6 egg whites ADVERTISEMENT",
            "2 cups packed brown sugar ADVERTISEMENT",
            "2 teaspoons ground nutmeg ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "5 cups all-purpose flour ADVERTISEMENT",
            "1 pound chopped pecans ADVERTISEMENT",
            "1 cup bourbon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 275 degrees F (135 degrees C). Grease a 10 inch tube pan and line bottom with parchment paper.\nSoak raisins and cherries in 2 cups of bourbon or whiskey for 48 hours. Before making cake, drain well and reserve the bourbon.\nIn a separate bowl, mix flour, nutmeg and baking powder. Set aside.\nIn a small bowl, cream butter with the white sugar. In a separate small bowl, cream yolks and brown sugar until very light.\nIn a very large bowl, combine the two sugar mixtures and blend well.\nAlternately add flour mixture and reserved bourbon in three stages, mixing well with each addition.\nAdd soaked fruit and fold in. Add nuts and fold in.\nIn a clean medium bowl, whip egg whites until stiff but not dry. Fold into batter until evenly distributed.\nPour into prepared 10 inch tube pan. Place a pan of water in the bottom of the oven and bake for 4 to 5 hours at 275 degrees F (135 degrees C). Ovens vary, so watch the baking time. Test cake with wooden pick. (May take longer than 5 hours).\nRemove from oven and allow to cool for 15 minutes before turning out. When almost cool, brush sides and inside hole heavily with bourbon. Wrap cake with bourbon soaked cheesecloth, then with plastic wrap. Refrigerate overnight and saturate again with bourbon. Cover with plastic wrap and then with foil and store for at least 2 weeks in a cool dry place.\n",
        "picture_link": "O76KU9U.mHA3z/c0obvpFU.zDusjruu"
    },
    {
        "title": "Chinese Chews II",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "4 tablespoons white sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 1/2 cups packed brown sugar ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup flaked coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix butter, flour, and white sugar. Spread in an 8 x 12 inch baking pan.\nBake in pre-heated oven at 325 degrees F (165 degrees C) for 15 minutes.\nBeat eggs. Add brown sugar, nuts and coconut. Spread over baked crust.\nBake for another 30 minutes. When completely cool, dust with confectioners' sugar.\n",
        "picture_link": "EsJHRL2NKmnFHWx.3HkI6Dcp3McCM0W"
    },
    {
        "title": "Million Monster Cookies",
        "ingredients": [
            "2 cups shortening ADVERTISEMENT",
            "2 cups butter, softened ADVERTISEMENT",
            "4 cups white sugar ADVERTISEMENT",
            "4 cups packed light brown sugar ADVERTISEMENT",
            "9 eggs ADVERTISEMENT",
            "4 teaspoons vanilla extract ADVERTISEMENT",
            "8 cups all-purpose flour ADVERTISEMENT",
            "4 teaspoons baking powder ADVERTISEMENT",
            "4 teaspoons baking soda ADVERTISEMENT",
            "8 cups rolled oats ADVERTISEMENT",
            "2 cups chopped pecans ADVERTISEMENT",
            "2 cups shredded coconut ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "2 cups candy-coated milk chocolate pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a very large mixing bowl, cream together the shortening, the butter or margarine, the sugars, the eggs, and the vanilla.\nAdd to the mixing bowl the flour, the leavenings, the oats, the nuts, the coconut, the chocolate chips, and the M & M candies.\nDrop dough by spoonfuls onto ungreased cookie sheets. To make extra large cookies, drop by ice cream scoopfuls.\nBake at 350 degrees F (175 degrees C) for 10 to 12 minutes, longer for large cookies. Remove, and cool on wire racks.\n",
        "picture_link": "d5MpfNw0cOk25Y6mo7ccPKV0czgs5QK"
    },
    {
        "title": "Easy Butter Fingers Candy",
        "ingredients": [
            "1 pound candy corn ADVERTISEMENT",
            "1 (18 ounce) jar crunchy peanut butter ADVERTISEMENT",
            "1 (6 ounce) bag semisweet chocolate chips ADVERTISEMENT",
            "1 tablespoon vegetable shortening, or more if needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line a 9x13-inch pan with parchment paper.\nPlace candy corn in a microwave-safe bowl (not plastic) and heat in several 30-second intervals, stirring after each interval, until candy corn is warm, melted, and smooth.\nStir peanut butter into melted candy corn until thoroughly combined; transfer candy to the prepared pan, pressing and smoothing the candy into the corners of the pan.\nPlace chocolate chips and vegetable shortening into the top of a double boiler set over simmering water. Heat the chocolate, stirring constantly, until just warm, melted, and smooth. Spread warm chocolate over the peanut candy. Chill in refrigerator until candy is set, at least 30 minutes, before cutting into squares.\n",
        "picture_link": "nhz3r.hyudAYYEmskbUI.2FBzTzkRvq"
    },
    {
        "title": "Peanut Butter Apple Dip",
        "ingredients": [
            "1 cup peanut butter ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix peanut butter, brown sugar, cream cheese, and milk together in a bowl until smooth; refrigerate until chilled.\n",
        "picture_link": "d3/Erz4R8pArh.iWam6mFwO.owE12kG"
    },
    {
        "title": "Asparagus and Swiss Cheese Quiche ",
        "ingredients": [
            "2 teaspoons olive oil ADVERTISEMENT",
            "1 bunch fresh asparagus, trimmed and cut into 1/2-inch pieces ADVERTISEMENT",
            "1 pastry for a 10-inch deep-dish pie crust ADVERTISEMENT",
            "6 large eggs, beaten ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "1/2 cup half-and-half cream ADVERTISEMENT",
            "1 (2.8 ounce) can French-fried onions ADVERTISEMENT",
            "6 ounces shredded Swiss cheese ADVERTISEMENT",
            "5 ounces shredded Cheddar cheese ADVERTISEMENT",
            "1 green onion, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a skillet over medium heat; cook and stir asparagus until slightly tender, 5 to 10 minutes.\nPreheat oven to 375 degrees F (190 degrees C). Press pie pastry into a 10-inch deep-dish pie pan.\nCombine asparagus, eggs, milk, half-and-half, French-fried onions, Swiss cheese, Cheddar cheese, and green onion in a bowl. Pour into prepared pie pastry.\nBake in the preheated oven until center of quiche is set and a knife inserted in the middle comes out clean, about 45 minutes. Allow to stand for 10 minutes before serving.\n",
        "picture_link": "hYv1Rt9H2dxri7OrPNWcY3JGFzvJnoy"
    },
    {
        "title": "Smoky Chipotle Mac and Cheese",
        "ingredients": [
            "1 (16 ounce) package elbow macaroni ADVERTISEMENT",
            "1 (11 ounce) can condensed Cheddar cheese soup ADVERTISEMENT",
            "1 (12 ounce) can evaporated milk ADVERTISEMENT",
            "1 pound shredded Colby cheese ADVERTISEMENT",
            "1 chipotle chile in adobo sauce, finely chopped ADVERTISEMENT",
            "1/2 cup panko bread crumbs ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 2-quart casserole dish.\nBring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until cooked through but firm to the bite, 8 minutes. Drain.\nStir soup, evaporated milk, Colby cheese, and chipotle chile into the cooked pasta until well combined. Spoon mixture into the prepared casserole dish.\nStir together panko bread crumbs and olive oil in a small bowl. Sprinkle bread crumb mixture over the top of casserole.\nBake in the preheated oven until the top is browned and the casserole is bubbling, 25 to 30 minutes.\n",
        "picture_link": "gPRuN42FMDdzGUeQLiL7ukUTxPYHNFO"
    },
    {
        "title": "Mama's Hearty Minestrone",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 (14.5 ounce) can low-sodium chicken broth ADVERTISEMENT",
            "2 (14.5 ounce) cans diced tomatoes ADVERTISEMENT",
            "2 cups tomato sauce ADVERTISEMENT",
            "1/2 cup water, more if needed ADVERTISEMENT",
            "2 cups diced carrots ADVERTISEMENT",
            "1 zucchini, sliced and quartered ADVERTISEMENT",
            "1 green bell pepper, diced ADVERTISEMENT",
            "1 tablespoon dried basil ADVERTISEMENT",
            "1 1/2 teaspoons dried oregano ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 cup finely chopped broccoli ADVERTISEMENT",
            "1/2 cup elbow macaroni ADVERTISEMENT",
            "1/4 cup shredded Parmesan cheese, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat vegetable oil in a large frying pan over medium heat; cook and stir onion and garlic until fragrant, about 2 minutes. Add ground beef; cook and stir until beef is crumbly, evenly browned, and no longer pink, about 10 minutes. Drain excess grease.\nTransfer ground beef mixture to an 8-quart stockpot; add chicken broth, diced tomatoes, tomato sauce, water, and carrots. Bring to a boil; reduce heat and simmer until carrots are partially cooked, 10 minutes. Add zucchini, bell pepper, basil, oregano, salt, and black pepper; simmer until carrots are tender, about 10 more minutes.\nStir broccoli and macaroni into soup; simmer until macaroni is cooked through but firm to the bite, about 10 minutes. Garnish with Parmesan cheese to serve.\n",
        "picture_link": "RYMVlV21hriLQYbCyN86NIHxz3ELFxm"
    },
    {
        "title": "Almond Wild Rice",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "2 1/2 cups chicken broth ADVERTISEMENT",
            "1 1/2 cups brown and wild rice mix ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1 cup slivered almonds ADVERTISEMENT",
            "2 tablespoons dried parsley ADVERTISEMENT",
            "1 cup sweetened dried cranberries (such as Craisins®) ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Spray an 8-inch square baking dish with cooking spray.\nBring chicken broth to a boil in a saucepan.\nPour rice mix into the prepared baking dish. Carefully pour boiling chicken broth over the rice. Cover the dish with aluminum foil.\nBake in preheated oven until rice is tender, about 1 hour.\nMelt butter in a skillet over medium heat. Cook and stir almonds in hot butter until they start to color, 3 to 5 minutes. Sprinkle parsley over the almonds; continue to cook and stir until the almonds are lightly browned, another 3 to 5 minutes.\nMix the baked rice, the almond mixture, cranberries, salt, and pepper in a large bowl; toss to serve.\n",
        "picture_link": "w9XLj1Q9CLX76GDAPfiqwEEJy5jBD2u"
    },
    {
        "title": "Watermelon Soup",
        "ingredients": [
            "4 cups cubed seeded watermelon ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1 tablespoon chopped fresh mint ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend watermelon, lemon juice, mint, and honey in a blender until smooth. Refrigerate 2 hours before serving.\n",
        "picture_link": "6gHCurt4VTEiriw3SzD2enGWsP.GYTO"
    },
    {
        "title": "Marinated Chicken Bruschetta",
        "ingredients": [
            "3/4 cup Wish-Bone® Italian Dressing, divided ADVERTISEMENT",
            "6 (5 ounce) skinless, boneless chicken breast halves ADVERTISEMENT",
            "2 medium beefsteak tomatoes, chopped ADVERTISEMENT",
            "1/4 cup diced red onion ADVERTISEMENT",
            "1 tablespoon finely chopped fresh basil leaves* (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour 1/4 cup Wish-Bone(R) Italian Dressing over chicken in large, shallow nonaluminum baking dish or plastic bag. Cover, or close bag, and marinate in refrigerator, turning occasionally, 30 minutes to 3 hours.\nMeanwhile, combine tomatoes, onion, basil and 1/4 cup Dressing in medium bowl. Cover and marinate in refrigerator at least 30 minutes.\nRemove chicken from marinade, discarding marinade. Grill or broil chicken, turning once and brushing frequently with remaining 1/4 cup Dressing, until chicken is thoroughly cooked, about 12 minutes. Serve tomato mixture over chicken.\n",
        "picture_link": "CQoiAZZOETG4Gw6OExsRiyF6r7WO5ja"
    },
    {
        "title": "Deviled Eggs - Mexican Devils!",
        "ingredients": [
            "12 hard-cooked eggs, peeled ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "1/4 cup prepared yellow mustard ADVERTISEMENT",
            "1/4 cup sweet pickles, chopped ADVERTISEMENT",
            "1/4 cup red onion, diced ADVERTISEMENT",
            "1/2 avocado - peeled, pitted, and mashed ADVERTISEMENT",
            "1/2 jalapeno pepper, seeded and diced ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 teaspoon ground chipotle chile pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Slice eggs in half lengthwise and scoop yolks into a bowl. Mash yolks with a fork and stir in mayonnaise, mustard, sweet pickles, red onion, avocado, jalapeno pepper, salt, and black pepper until thoroughly combined. Spoon filling into egg halves and sprinkle each deviled egg half with a pinch of ground chipotle chile.\n",
        "picture_link": "4x.JHUuQqFM5G8b44nNK2jIuqPRNuFq"
    },
    {
        "title": "Spinach Quiche with Chicken",
        "ingredients": [
            "1/4 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 (9 inch) unbaked pastry shell ADVERTISEMENT",
            "1 cup diced cooked chicken ADVERTISEMENT",
            "1 cup chopped fresh spinach ADVERTISEMENT",
            "1/2 cup chopped sweet onion (such as Vidalia®) ADVERTISEMENT",
            "3/4 cup shredded Cheddar cheese ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "3/4 cup half-and-half ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "1 pinch salt-free seasoning blend (such as Mrs. Dash), or to taste ADVERTISEMENT",
            "1 pinch herbes de Provence, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSprinkle 1/4 cup Cheddar cheese in pastry shell. Mix chicken, spinach, onion, and remaining 3/4 cup Cheddar cheese in a bowl; transfer mixture to pastry shell.\nWhisk eggs, half-and-half, mayonnaise, salt, black pepper, seasoning blend, and herbes de Provence in another bowl; pour over chicken mixture.\nBake in the preheated oven until a knife inserted into the center comes out clean, 35 to 40 minutes. Let stand for 15 minutes before slicing and serving.\n",
        "picture_link": "s.YoltKRrnX/GW9/ovIC28Sj3jZiZfO"
    },
    {
        "title": "Homemade Paleo-Style Breakfast Sausage",
        "ingredients": [
            "1 pound ground pork ADVERTISEMENT",
            "1 teaspoon kosher salt ADVERTISEMENT",
            "3/4 teaspoon ground black pepper ADVERTISEMENT",
            "2 teaspoons finely chopped fresh sage leaves ADVERTISEMENT",
            "1 teaspoon finely chopped fresh thyme ADVERTISEMENT",
            "1/4 teaspoon chopped fresh rosemary ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1/4 teaspoon red pepper flakes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together ground pork, kosher salt, black pepper, sage, thyme, rosemary, nutmeg, cayenne pepper, and red pepper flakes in a bowl. Knead with hands until thoroughly incorporated. Form into 8 patties.\nPlace patties into a skillet over medium heat; cook until browned, 8 to 10 minutes. Flip patties and continue to cook until fully cooked through, 5 to 8 more minutes.\n",
        "picture_link": "qvYpTZKfGe9N5LA4Ch05b6b.TY8prKW"
    },
    {
        "title": "Vegetarian Quiche",
        "ingredients": [
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 cup chopped zucchini ADVERTISEMENT",
            "1 (9 inch) unbaked pastry shell ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 1/2 cups chopped onion ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 cup chopped tomatoes ADVERTISEMENT",
            "1/2 cup sliced fresh mushrooms ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/4 teaspoon curry powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 pinch ground cinnamon ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1/4 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sprinkle 1 teaspoon salt over zucchini and let sit for 10 minutes to drain water.\nPreheat oven to 450 degrees F (235 degrees C). Line pastry shell with a double thickness of heavy-duty aluminum foil.\nBake pastry shell in preheated oven for 5 minutes; remove foil and bake until shell is lightly browned, about 5 minutes longer.\nReduce oven heat to 350 degrees F (175 degrees C).\nMelt butter in a large skillet over medium heat; cook and stir onion, green pepper, tomatoes, mushrooms, garlic, and zucchini until just tender, about 5 minutes. Stir in curry powder, 1/2 teaspoon salt, pepper, and cinnamon; spoon vegetable mixture into crust.\nBeat eggs in a bowl; stir in milk, Parmesan cheese, and Cheddar cheese. Carefully pour egg mixture over vegetables.\nBake in preheated oven until a knife inserted near the center comes out clean, 40 to 45 minutes. Let stand 5 minutes before cutting.\n",
        "picture_link": "ii3pHDGPnveTXLp0E9hr7eJoQJZ4dw6"
    },
    {
        "title": "Slow Cooker Chocolate Banana Steel Cut Oats",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "10 cups water ADVERTISEMENT",
            "2 cups steel-cut oats ADVERTISEMENT",
            "2 pounds ripe bananas, mashed ADVERTISEMENT",
            "1/2 cup unsweetened cocoa powder ADVERTISEMENT",
            "1/3 cup granular no-calorie sucralose sweetener (such as Splenda®) (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Lightly spray a 5-quart or larger slow cooker crock with cooking spray.\nMix water, oats, mashed bananas, cocoa powder, and sweetener in prepared slow cooker.\nCook on Low for 6 hours.\n",
        "picture_link": "UwFTYrPFRRJD83j2AlFzF.uTkEAio5S"
    },
    {
        "title": "Creamy Maple Dip For Sweet Potato Fries",
        "ingredients": [
            "1/4 cup mayonnaise ADVERTISEMENT",
            "1/4 cup maple syrup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix mayonnaise with maple syrup in a bowl until thoroughly combined.\n",
        "picture_link": "sNAeRxFcDL9vIF0kLq.JY2YS6dDY4wi"
    },
    {
        "title": "Mexican Pork and Green Chile Stew",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 1/2 pounds lean boneless pork, cut into 1-inch cubes ADVERTISEMENT",
            "1 1/2 cups diced onion ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 (14.5 ounce) can no-salt-added diced tomatoes ADVERTISEMENT",
            "1 (4 ounce) can chopped green chilies ADVERTISEMENT",
            "2 tablespoons minced fresh cilantro ADVERTISEMENT",
            "1/4 cup cold water ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1 cup shredded Mexican cheese blend ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large Dutch oven or large pot over medium heat.\nSpread flour into a wide, shallow dish; add pork and turn to coat, shaking off excess.\nCook coated pork in hot oil until completely browned, 5 to 7 minutes. Stir onion and garlic in with the pork; continue cooking and stirring until the onion softens, about 5 minutes. Pour diced tomatoes, green chilies, and 2 tablespoons cilantro over the pork mixture; stir. Place a cover on the Dutch oven and simmer the mixture until pork is tender and no longer pink in the center, about 40 minutes.\nWhisk cold water and cornstarch together in a small bowl; stir into the liquid in the Dutch oven and continue cooking until the sauce thickens, 5 to 10 minutes.\nRemove Dutch oven from heat; let dish rest 10 to 15 minutes. Ladle into bowls and top with cheese and desired amount of cilantro to serve.\n",
        "picture_link": "WgtC6vMKhCRQ6m3rlgfWLNCnSgXR7wi"
    },
    {
        "title": "What the ELLE...Baked Egg Rolls",
        "ingredients": [
            "2 cups grated carrots ADVERTISEMENT",
            "1 (14.5 ounce) can bean sprouts, drained ADVERTISEMENT",
            "1/2 cup chopped water chestnuts ADVERTISEMENT",
            "1/4 cup chopped green bell pepper ADVERTISEMENT",
            "1/4 cup chopped green onions ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "2 cups finely diced cooked chicken ADVERTISEMENT",
            "4 teaspoons cornstarch ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "1 tablespoon light soy sauce ADVERTISEMENT",
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "1 teaspoon brown sugar ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "16 egg roll wrappers ADVERTISEMENT",
            "nonstick cooking spray ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Lightly grease a baking sheet.\nCoat a large skillet with nonstick cooking spray and heat over medium heat; cook and stir carrots, bean sprouts, water chestnuts, green pepper, green onions, and garlic until vegetables are crisp, about 3 minutes. Stir in chicken until heated through, 3 to 5 minutes.\nCombine cornstarch, water, soy sauce, 1 teaspoon oil, brown sugar, and cayenne in a small bowl; stir into chicken mixture. Bring to a boil over high heat and stir, cooking until sauce is thickened, about 2 minutes; remove from heat.\nSpoon 1/4 cup chicken mixture on the bottom third of one egg roll wrapper. Fold sides toward center and roll tightly; place seam side down on prepared baking sheet. Repeat with remaining filling and wrappers. Spray top of egg rolls with nonstick cooking spray.\nBake in preheated oven until lightly browned, 10 to 15 minutes.\n",
        "picture_link": "TAQCJp/x8juyMsQwjHhM16tAhwn5Gyu"
    },
    {
        "title": "Chilly Day Chili",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "2 pounds ground chicken ADVERTISEMENT",
            "3 (15 ounce) cans pinto beans, rinsed and drained ADVERTISEMENT",
            "2 onions, halved and thinly sliced ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes with juice ADVERTISEMENT",
            "1 (14.5 ounce) can Mexican-style stewed tomatoes with chiles, undrained ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "2 tablespoons chili powder ADVERTISEMENT",
            "2 tablespoons vinegar ADVERTISEMENT",
            "2 tablespoons prepared mustard ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat vegetable oil in a soup pot over medium heat. Cook and stir ground chicken in the hot oil until no longer pink and the chicken is crumbly, about 10 minutes. Drain.\nStir in pinto beans, onions, diced tomatoes, Mexican-style stewed tomatoes, water, brown sugar, chili powder, vinegar, mustard, salt, and black pepper; bring to a boil. Reduce heat to low, cover, and simmer chili until thickened and flavors have blended, about 3 hours. Stir occasionally and add extra water if needed.\n",
        "picture_link": "liq8/hEb5oV6UR1vPE1/pM.yM3/hF5."
    },
    {
        "title": "Carrot and Orange Juice",
        "ingredients": [
            "2 pounds organic carrots, trimmed and scrubbed ADVERTISEMENT",
            "8 organic oranges, peeled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Press carrots and oranges through a juicer and into a large glass.\n",
        "picture_link": "jXQ7GagqgxtZa186u85H19WEJckumE."
    },
    {
        "title": "Pepperoni Caesar Pasta Salad",
        "ingredients": [
            "1 1/2 cups shell pasta ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "1 (3.25 ounce) package sliced pepperoni, quartered ADVERTISEMENT",
            "1 cup fresh broccoli florets ADVERTISEMENT",
            "1/2 cup prepared Caesar salad dressing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook shell pasta in boiling water, stirring occasionally, until cooked through but firm to the bite, 8 minutes. Drain.\nCombine mozzarella cheese, pepperoni, and broccoli in a large bowl; fold in pasta. Drizzle with Caesar salad dressing, tossing to combine. Refrigerate until serving.\n",
        "picture_link": "j9MxzQTnwKLG2bHbhUHFZRNlsQBuKhq"
    },
    {
        "title": "2 Minute Cheese Quesadillas",
        "ingredients": [
            "2 (10 inch) flour tortillas ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place 1 flour tortilla on a large microwave-safe plate; sprinkle with Cheddar cheese. Place the second flour tortilla atop the Cheddar layer.\nCook on high in the microwave until cheese is melted, about 1 minute.\n",
        "picture_link": "neZ8DjTksftlEkNswoIbnDSCsTms6P2"
    },
    {
        "title": "Orange Roughy in a Mushroom Sauce",
        "ingredients": [
            "2 cups sliced fresh mushrooms ADVERTISEMENT",
            "1 1/4 cups finely chopped onions ADVERTISEMENT",
            "1 1/2 tablespoons lemon pepper ADVERTISEMENT",
            "1 tablespoon Italian seasoning ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "12 ounces plain nonfat yogurt ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "3/4 pound orange roughy fillets ADVERTISEMENT",
            "2 tablespoons Italian seasoned bread crumbs ADVERTISEMENT",
            "paprika to taste ADVERTISEMENT",
            "3 sprigs fresh parsley, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a baking pan with aluminum foil, and coat with cooking spray.\nIn a medium saucepan coated with cooking spray over medium heat, cook and stir the mushrooms and onions about 4 minutes. Season with lemon pepper, Italian seasoning, pepper, and salt. Remove from heat, and allow to cool about 10 minutes. Thoroughly blend in the yogurt and Parmesan cheese.\nArrange each orange roughy fillet in the prepared baking pan over about 2 tablespoons of the mushroom mixture. Top fillets with the remaining mushroom mixture. Sprinkle with bread crumbs.\nBake 30 minutes in the preheated oven, or until the fish is easily flaked with a fork. Season with paprika and garnish with parsley to serve.\n",
        "picture_link": "sKuwjNaZ3Ev/8kZPczML6IsmyIkdX66"
    },
    {
        "title": "Cherry Almond Smoothie",
        "ingredients": [
            "1 (8 ounce) container cherry yogurt ADVERTISEMENT",
            "1 (11 ounce) can mandarin oranges, drained ADVERTISEMENT",
            "1/2 banana, peeled and sliced ADVERTISEMENT",
            "1/4 cup half-and-half cream ADVERTISEMENT",
            "1 teaspoon almond extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender, mix yogurt, oranges, banana, half-and-half and almond extract. Blend until smooth.\n",
        "picture_link": "lz9K0MzhJauQQqC/UBv0Dz614Vy82/K"
    },
    {
        "title": "Orange Salmon II",
        "ingredients": [
            "2 (6 ounce) fillets salmon, skin removed ADVERTISEMENT",
            "2 1/2 cups orange juice ADVERTISEMENT",
            "3 sprigs fresh dill weed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the salmon fillets in a large skillet over medium heat. Pour orange juice over salmon. Arrange dill sprigs around the salmon. Cook , turning occasionally, 15 minutes, or until fish is easily flaked with a fork. Remove salmon from skillet, and set aside.\nReduce skillet heat to medium-low, and continue cooking the orange juice 10 minutes, or until thickened. Pour over the salmon to serve.\n",
        "picture_link": "00FclexQIkO7VvMJOGkV6rTjOCEMxU."
    },
    {
        "title": "Easy Liver Pate",
        "ingredients": [
            "1 pound braunschweiger liver sausage ADVERTISEMENT",
            "1 tablespoon milk ADVERTISEMENT",
            "1 tablespoon finely chopped onion ADVERTISEMENT",
            "1/2 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/2 teaspoon sugar ADVERTISEMENT",
            "1/2 teaspoon minced garlic ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, mix together the sausage, milk, onion, and cream cheese. Season with sugar, garlic, chili powder and Worcestershire sauce, and mix until well blended. Wrap in plastic wrap, and refrigerate for at least 2 hours, until firm.\n",
        "picture_link": "7gGmHIcv5DrDhxXQdfQbD30T3aYBRGi"
    },
    {
        "title": "Better Help for Hamburger",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "3 medium potatoes, peeled and sliced ADVERTISEMENT",
            "1 red bell pepper, seeded and diced ADVERTISEMENT",
            "1/2 large red onion, chopped ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 fresh jalapeno pepper, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ground beef in a skillet over medium-high heat. Cook and crumble until evenly browned. Drain grease, and set aside.\nMeanwhile place potatoes in a saucepan with enough water to cover. bring to a boil, and cook for about 10 minutes, until just tender. Drain potatoes, and remove from the pan.\nHeat oil over medium heat using the pan that the potatoes were cooked in. Add the bell pepper and onion. Cook and stir for about 5 minutes, until tender. Mix in the ground beef and potatoes, cooking until heated through, about 5 minutes. Stir in cheese, and remove from heat. Serve immediately.\n",
        "picture_link": "6i2/86MVxd4LiGQ1C52HIbzVIe7ZSk6"
    },
    {
        "title": "Orange Monkey Bread",
        "ingredients": [
            "1 1/4 cups sugar ADVERTISEMENT",
            "1 tablespoon finely grated fresh orange zest ADVERTISEMENT",
            "1/3 cup orange juice ADVERTISEMENT",
            "1/4 cup melted butter ADVERTISEMENT",
            "2 (10 ounce) cans refrigerated biscuit dough, separated and halved ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 375 degrees F (190 degrees C). Grease a 10-inch Bundt pan.\nToss the sugar and orange zest together in a small bowl. Whisk the orange juice and melted butter together in a separate small bowl.\nRoll the biscuit dough pieces into balls. Dip each ball into the orange juice mixture and then roll in the sugar mixture. Arrange the coated balls evenly in the prepared pan. Pour the remaining orange juice mixture over the biscuits.\nBake in the preheated oven until golden brown, about 30 minutes. Allow to cool in the pan for a few minutes before turning out onto a serving platter. Serve warm.\n",
        "picture_link": "AJBwQlI7m20GQxsk7zLhWfU9MJjDbGi"
    },
    {
        "title": "Lithuanian Krupnikas",
        "ingredients": [
            "10 cardamom seeds ADVERTISEMENT",
            "1/2 nutmeg seed ADVERTISEMENT",
            "2 teaspoons caraway seed ADVERTISEMENT",
            "10 whole cloves ADVERTISEMENT",
            "10 whole allspice berries ADVERTISEMENT",
            "4 (3 inch) cinnamon sticks ADVERTISEMENT",
            "2 teaspoons whole peppercorns ADVERTISEMENT",
            "1 pinch crushed saffron threads (optional) ADVERTISEMENT",
            "2 (1 inch) pieces fresh ginger root ADVERTISEMENT",
            "2 (1 inch) pieces fresh turmeric (yellow ginger) ADVERTISEMENT",
            "3 large strips of orange zest ADVERTISEMENT",
            "3 large strips of lemon zest ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "2 pounds honey ADVERTISEMENT",
            "1 quart 190 proof grain alcohol ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Crack the cardamom seeds and nutmeg with a heavy skillet on a cutting board. Toss them into a saucepan with the caraway seed, cloves, allspice berries, cinnamon sticks, peppercorns, saffron, ginger, turmeric, orange zest and lemon zest. Pour in the water, and bring to a boil. Cover, and simmer until the liquid is reduced by 1/2. Strain out spices, and set the liquid aside.\nPour honey into a large pot, and bring to a boil over medium heat. Skim off any foam from the top. Stir in the strained liquid from the spices and vanilla extract. Remove from heat and place far from the stove to avoid any flare-ups from the grain alcohol. Slowly stir in the grain alcohol. Place the pot back onto the burner over low heat and cover. Heat through, being careful not to boil or even simmer. Remove from heat and let stand overnight with the lid on.\nThe following day, pour the liquid into sterile bottles, seal, and allow to settle for 2 weeks. The longer you let it sit, the clearer it will become and the better it tastes. Serve warm.\n",
        "picture_link": "9F8XeYrDV5NIT.HInPFog.IWAon4mie"
    },
    {
        "title": "Frijoles III",
        "ingredients": [
            "1 pound dried pinto beans, washed ADVERTISEMENT",
            "1 white onion, chopped ADVERTISEMENT",
            "1/2 bunch fresh cilantro, chopped ADVERTISEMENT",
            "1 fresh jalapeno pepper, chopped ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons lard ADVERTISEMENT",
            "water to cover ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place beans in a large pot with onion, cilantro, jalapeno pepper, garlic, and lard; add enough water to cover with 4 to 5 inches of water. Bring to a boil, reduce heat, and cook for 2 to 3 hours. Depending on the beans, it may take up to 5 hours. Add more water if necessary.\nWhen beans are soft, season to taste with salt.\n",
        "picture_link": "belKUwfMmjbaFOSdTJPU0wCA3Z6OTIu"
    },
    {
        "title": "Lucky Pea Soup",
        "ingredients": [
            "4 slices bacon ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "2 (15 ounce) cans black-eyed peas, undrained ADVERTISEMENT",
            "2 (14.5 ounce) cans diced tomatoes, undrained ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 1/4 teaspoons cumin ADVERTISEMENT",
            "1 1/4 teaspoons dry mustard ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1/2 teaspoon curry powder ADVERTISEMENT",
            "1/2 teaspoon pepper ADVERTISEMENT",
            "1/2 teaspoon sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the bacon in a skillet and cook over medium-high heat until crisp and evenly brown. Drain on paper towels. When cool, crumble into small pieces.\nUsing the same skillet, add the peppers and onion; stir and cook over medium-high heat until transparent and tender, about 5 minutes.\nPour the black beans, tomatoes, and water into a large pot. Stir in the peppers, onion, salt, cumin, dry mustard, chili powder, curry powder, pepper, and sugar. Bring to a boil, reduce heat to medium, cover, and simmer 20 to 25 minutes. Serve hot sprinkled with bacon, and other toppings of your choice.\n",
        "picture_link": "EvOaRqfZvV3mkQuwSTTK4hRXgWjc8Yq"
    },
    {
        "title": "Chili with Ground Pork",
        "ingredients": [
            "1 pound lean ground pork ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "4 medium onions, chopped ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 (8 ounce) can mushroom pieces ADVERTISEMENT",
            "1 (14.5 ounce) can wax beans ADVERTISEMENT",
            "1 (15 ounce) can sweet peas ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "1 (28 ounce) can tomato sauce ADVERTISEMENT",
            "chili powder to taste ADVERTISEMENT",
            "ground nutmeg to taste ADVERTISEMENT",
            "dried marjoram to taste ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large, deep skillet over medium heat, and cook the ground pork until evenly browned. Reserving the juices in the skillet, remove pork, and set aside.\nStir the onions and garlic into the skillet, and cook in the pork juices over medium heat until tender. Mix in the mushrooms, wax beans, peas, green bell pepper, and red bell pepper. Cook and stir until tender and heated through.\nReturn the pork to the skillet. Mix in the tomato sauce. Season with chili powder, nutmeg, marjoram, and salt. Reduce heat, and simmer about 45 minutes to allow the flavors to blend.\n",
        "picture_link": "eT/SqAYjt12mueQTWmQ.PymK6I5sZzu"
    },
    {
        "title": "Low-Carb Chocolate Swirl Cheesecake",
        "ingredients": [
            "1 cup low-carb chocolate cookie crumbs ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "3 tablespoons SPLENDA® Granular ADVERTISEMENT",
            "1/2 cup finely chopped macadamia nuts, pecans, or almonds ADVERTISEMENT",
            "3 eggs, separated ADVERTISEMENT",
            "3 (8 ounce) packages cream cheese, at room temperature ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 cup SPLENDA® Granular ADVERTISEMENT",
            "2 tablespoons low-carbohydrate baking flour substitute ADVERTISEMENT",
            "6 ounces low-carbohydrate, dark chocolate, melted ADVERTISEMENT",
            "3 ounces low-carbohydrate, dark chocolate, melted ADVERTISEMENT",
            "3 tablespoons finely chopped macadamia nuts, pecans, or almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine cookie crumbs, butter, 3 tablespoons Splenda, and nuts. Press evenly in the bottom of a 9 inch springform pan. Chill crust while preparing the filling. Preheat oven to 350 degrees F (175 degrees C)\nIn a large bowl, whip egg whites until stiff but not dry.\nIn another large bowl, beat cream cheese, sour cream, 1 cup Splenda, and flour substitute until smooth. Beat in egg yolks one at a time, blending well after each addition. Gently fold whipped egg whites into cream cheese mixture. Spoon batter into prepared crust. Slowly swirl 6 ounces of melted chocolate through cheese mixture to give a marbled effect.\nPlace pan on a cookie sheet in the preheated oven, and bake 60 to 70 minutes or until set. Turn off oven, and allow cake to cool in the oven with the door open. When cool, transfer to the refrigerator, and chill overnight.\nSpread 3 ounces of melted chocolate on a cookie sheet. Sprinkle with remaining chopped nuts, and then refrigerate until chilled. Scrape chocolate from pan to form slivers. Decorate cake with chocolate slivers by heaping over the top, and pressing vertically onto the sides of the cake.\n",
        "picture_link": "8akqzyBC/bRS5XGIGRc7OmHDEmhInNG"
    },
    {
        "title": "Almond Jelly",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "2 (.25 ounce) envelopes unflavored gelatin powder ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "3/4 cup sugar ADVERTISEMENT",
            "1 1/2 teaspoons almond extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour 1 cup water in a bowl; sprinkle the gelatin over the water; stir until the gelatin is partially dissolved. Set aside.\nBring 1 cup water to a boil in a large saucepan. Reduce heat to medium-low and slowly pour in the gelatin mixture. Add the milk, sugar, and almond extract; stir until the sugar and gelatin are completely dissolved; pour mixture into a large, shallow container. Refrigerate until firm, 3 to 4 hours. Cut into small squares to serve.\n",
        "picture_link": "xP1x0r.vLo9lAue8sMpn57nJmKbDxMe"
    },
    {
        "title": "Bacon Cheeseburgers",
        "ingredients": [
            "1 pound sliced bacon, diced ADVERTISEMENT",
            "5 pounds ground beef chuck ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1/4 cup steak sauce ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 pound American cheese slices ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat a grill for high heat.\nPlace bacon in a large skillet over medium heat. Fry, stirring occasionally. When the bacon is almost done, add the onion. Cook until the bacon is crisp, and the onion is tender. Remove onion and bacon from the pan with a slotted spoon, and transfer to a food processor. Pulse a couple of times to chop finely. Do not puree. Pour into a large bowl, and mix with steak sauce and ground chuck using your hands. Form into 16 patties.\nPlace patties on the grill, and cook for 5 minutes per side, or until well done. Place a slice of cheese on top of each one during the last minute.\n",
        "picture_link": "tmWiIS0YyW4UG0bkOsEZPtTpyiBJ7Yu"
    },
    {
        "title": "Debbie's Ultimate Mushroom Dish",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "2 1/2 pounds sliced fresh mushrooms ADVERTISEMENT",
            "1 (4 ounce) can sliced black olives, drained ADVERTISEMENT",
            "3 cups shredded Cheddar cheese ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "1/2 cup fine dry bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nMelt 3 tablespoons of butter in a large skillet over medium heat. Add the mushrooms, and saute until tender, about 10 minutes. Layer half of the mushrooms in the bottom of a casserole dish. Sprinkle with half of the olives, half of the cheese, and 1 tablespoon of flour. Repeat the layers then top with the bread crumbs. Drizzle 2 tablespoons of melted butter over the crumbs.\nBake for 30 minutes in the preheated oven, until bubbly and browned on the top.\n",
        "picture_link": "sAgW9l1u48eOSQYyDexCvjkS1ZROd0m"
    },
    {
        "title": "Cold Crawfish Dip",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "2 pounds crawfish tails, with fat ADVERTISEMENT",
            "4 (8 ounce) packages cream cheese, room temperature ADVERTISEMENT",
            "1 bunch green onions, chopped ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1/2 teaspoon hot pepper sauce (e.g. Tabasco™), or to taste ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large skillet over medium heat. Add half of the green onions, and cook until wilted. Add the crawfish tails, reduce heat to medium-low, and simmer for about 10 minutes. Set aside to cool.\nIn a large bowl, stir together the cream cheese and mayonnaise until well blended. I like to use an electric mixer. Season with hot pepper sauce and Worcestershire sauce until the mixture is pink in color. When the crawfish have cooled slightly, stir them and the butter into the dip along with the rest of the green onion. Mix well, cover and refrigerate overnight to properly blend the flavors.\n",
        "picture_link": "xPXH68U/7f6ycYdfYGUOfwOx1Ph4VFi"
    },
    {
        "title": "Braised Venison with Rosemary and Shiitake",
        "ingredients": [
            "2 tablespoons bacon drippings ADVERTISEMENT",
            "1 1/2 pounds venison, cut into 2 inch cubes ADVERTISEMENT",
            "2 cups fresh shiitake mushrooms, stemmed and sliced ADVERTISEMENT",
            "2 medium onions, chopped ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons cognac or brandy (optional) ADVERTISEMENT",
            "2 cups dry red wine ADVERTISEMENT",
            "1 cube beef bouillon ADVERTISEMENT",
            "1/4 teaspoon black pepper ADVERTISEMENT",
            "1/2 teaspoon dried thyme leaves ADVERTISEMENT",
            "1 1/4 teaspoons dried rosemary ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "1 (8 ounce) package baby carrots (optional) ADVERTISEMENT",
            "1 tablespoon cornstarch (optional) ADVERTISEMENT",
            "2 tablespoons water (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the bacon drippings in a large Dutch oven over medium-high heat. Sear the venison in two batches until nicely browned and remove. Stir in the shiitake, onions, and garlic; cook until softened, 1 to 2 minutes. Pour in the cognac, wine, and bouillon cube, simmer for 30 seconds to remove the alcohol flavor and dissolve the bouillon.\nStir in the venison, pepper, thyme, rosemary, and bay leaves. Bring to a boil, then reduce heat to low and simmer gently until the venison is tender, about two hours or more; adding water as needed.\nIf using baby carrots, add them during the last half hour of cooking. When the venison is tender, you may wish to thicken the sauce by dissolving the cornstarch in 2 tablespoons of water and stirring it into the sauce.\n",
        "picture_link": "Fp9pCTaTBHRlZQbuDVqfp35f7toizEi"
    },
    {
        "title": "Venison Breakfast Sausage",
        "ingredients": [
            "1 pound ground venison ADVERTISEMENT",
            "8 ounces bacon, minced ADVERTISEMENT",
            "1 teaspoon ground sage ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/4 teaspoon pepper ADVERTISEMENT",
            "3/4 teaspoon onion salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the venison, bacon, sage, ginger, pepper, and onion salt in a large bowl; mix well. Shape into 12 patties using about 1/4 cup of mixture per patty. Patties can either be pan-fried or frozen for later use.\n",
        "picture_link": "qge93I2DkIeDkvfZERKwnOiiX1wJtQe"
    },
    {
        "title": "Swedish Ground Almond Spritz Cookies",
        "ingredients": [
            "3/4 cup blanched slivered almonds ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "1 cup sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon almond extract ADVERTISEMENT",
            "1 tablespoon milk ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/8 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Spread the almonds out on a baking sheet. Bake in the preheated oven for 10 to 15 minutes, until lightly browned or until they give off an aroma. Remove from the oven, and allow to cool completely. Grind to a consistency resembling rough sand in a food processor or blender. Be sure almonds are cool, or you will make almond butter.\nIn a medium bowl, cream together the butter and sugar until light and fluffy. Beat in the egg, then stir in the almond extract and milk. Sift in the flour, baking powder and salt, and mix in along with the ground toasted almonds to form a soft dough. Refrigerate the dough for 15 to 20 minutes. This will help the cookies keep their shape after pressing.\nLightly grease cookie sheets, and fill cookie press with dough. Press out cookies at least 1 inch apart depending on the size. You can experiment with different cookie designs. I've found most true Swedes tend to use the star shape, however, you're free to use whatever shape suits your fancy.\nBake for 8 to 10 minutes in the preheated oven, until cookies are lightly browned. Cool on the cookie sheets for a minute before transferring to a wire rack to cool completely.\n",
        "picture_link": "cZL.ERKECVmh6lVt22m7S2Ls3RjTR4C"
    },
    {
        "title": "Chicken and Herbs in White Wine",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 (4 pound) chicken, cut into pieces ADVERTISEMENT",
            "garlic powder to taste ADVERTISEMENT",
            "1/2 pound fresh mushrooms, sliced ADVERTISEMENT",
            "1 large onion, diced ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon dried rosemary ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "1 teaspoon garlic salt ADVERTISEMENT",
            "1/4 teaspoon black pepper ADVERTISEMENT",
            "1 teaspoon poultry seasoning ADVERTISEMENT",
            "1 cup dry white wine ADVERTISEMENT",
            "1 (10.5 ounce) can chicken broth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large Dutch oven over medium heat. Sprinkle chicken with garlic powder, and brown on both sides. Remove chicken to paper towels.\nSpoon off chicken fat, and return pan to stove. Stir in mushrooms and onions; cook, stirring occasionally, until onions are soft. Remove to a medium bowl.\nIn a separate bowl, mix together basil, oregano, rosemary, and thyme. Season with garlic salt, pepper, and poultry seasoning. Stir in wine, and add to onion and mushrooms.\nReturn chicken to Dutch oven. Pour mushroom mixture and broth over chicken; cover, and cook over low heat until meat begins to fall off the bone, about 1 1/2 hours.\n",
        "picture_link": "WylDvff/NhtV9xRVv52NPPLrMfe5Hx2"
    },
    {
        "title": "Two by Four Stew",
        "ingredients": [
            "2 pounds ground beef ADVERTISEMENT",
            "2 (14.5 ounce) cans diced tomatoes ADVERTISEMENT",
            "2 (15 ounce) cans ranch-style beans ADVERTISEMENT",
            "2 (19 ounce) cans minestrone soup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place beef in a large saucepan over medium-high heat. Cook, stirring occasionally until evenly brown and crumbled. Drain excess grease. Reduce heat to medium, and stir in the diced tomatoes, ranch-style beans and minestrone soup. Stir occasionally until heated through.\n",
        "picture_link": "BRCnSRg6VLqqphv7qgnAhW7PAu4nLVm"
    },
    {
        "title": "Texas Yum Yum",
        "ingredients": [
            "1 (3.9 ounce) package instant chocolate pudding mix ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "1 (9 inch) prepared graham cracker crust ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "1 (8 ounce) tub frozen whipped topping, thawed ADVERTISEMENT",
            "1 (3.4 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, mix together the chocolate pudding mix and 1 1/2 cups of milk until smooth and well blended. Pour into the graham cracker crust.\nIn a clean bowl, beat cream cheese with an electric mixer until soft, then mix in confectioners' sugar. Fold in 2 cups of the whipped topping, and spread on top of the chocolate pudding layer.\nWhisk together the vanilla pudding mix and 1 1/2 cups of milk until well blended. Spread over the top of the cream cheese layer. Spread the remaining whipped topping over the top. Chill for at least 30 minutes before slicing and serving.\n",
        "picture_link": "SDKV.6iz9IvDO3YmE9YOEDFLRLhwqZ."
    },
    {
        "title": "Lee's Incredible Momos",
        "ingredients": [
            "1 pound extra-lean ground beef ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "8 ounces spinach, rinsed and chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 teaspoon grated fresh ginger root ADVERTISEMENT",
            "2 green onions, chopped ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "12 wonton wrappers ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1 tablespoon rice vinegar ADVERTISEMENT",
            "1 tablespoon chili oil ADVERTISEMENT",
            "1 (1/2 inch) piece fresh ginger root, grated ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring 3 inches of water in a large pot of water to a boil. You may also do this with a wok and steamer baskets.\nIn a large bowl, mix together the ground beef, onion, spinach, garlic, 1 teaspoon ginger, green onion, cilantro and salt. Place a spoonful of the filling onto a wonton wrapper; fold and crimp to seal. If necessary, wet the edges with water. Repeat with remaining filling and wrappers.\nSet a steamer tray in the pot, and place the momos on the steamer. Steam over rapidly boiling water for 30 minutes. Serve with the dipping sauce.\nTo make the dipping sauce, mix together the soy sauce, rice vinegar, chili oil and grated ginger in a small bowl.\n",
        "picture_link": "VX4opTvfMszlbP/KkLZc48CxePqHwUG"
    },
    {
        "title": "Tommy's Chili",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 1/2 cups all-purpose flour, divided ADVERTISEMENT",
            "1 1/3 cups beef broth ADVERTISEMENT",
            "1 quart water ADVERTISEMENT",
            "3 tablespoons chili powder ADVERTISEMENT",
            "2 tablespoons finely grated carrot ADVERTISEMENT",
            "1 tablespoon white vinegar ADVERTISEMENT",
            "2 teaspoons dried minced onion ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon granulated sugar ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the beef in a large, deep skillet over medium heat, and cook until evenly brown. Transfer beef to a strainer over a saucepan, and allow grease to drain for about 5 minutes. Mix any drippings remaining in skillet into the saucepan. There should be about 1/2 cup drippings. Return beef to skillet.\nHeat the beef drippings in the saucepan over medium heat, and gradually mix in 1/4 cup flour. Reduce heat to low, and continue cooking 10 minutes, stirring continuously, to form a golden brown roux. Pour in the beef broth, and remove from heat.\nPour the water into the skillet with the beef, and mix in remaining flour. Stir in the roux mixture, chili powder, carrot, vinegar, onion, salt, sugar, paprika, and garlic powder. Bring to a boil, reduce heat to medium-low, and continue cooking 15 minutes, until thickened. When it's done cooking, take the chili off the heat, cover it, and let it sit for 30 minutes before using it on burgers, etc. It should thicken to a tasty brown paste as it sits.\n",
        "picture_link": "td6wlgyFNJnnRBCZgtNZZn1AnM3q1Ly"
    },
    {
        "title": "French Cookies (Belgi Galettes)",
        "ingredients": [
            "2 pounds dark brown sugar ADVERTISEMENT",
            "1 pound butter ADVERTISEMENT",
            "7 eggs ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "6 1/2 cups all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, stir together the brown sugar and butter until smooth and creamy; then add eggs and vanilla, and beat well. Gradually stir in flour. Set bowl over a hot water bath, and stir to blend ingredients. Cover, and refrigerate overnight.\nPreheat the galette iron.\nShape dough into 1 inch balls, and place in the galette iron. Close the iron, and cook the cookies. This should take about 30 seconds in an electric galette iron, or 2 to 4 minutes in a handheld iron over a medium flame. Carefully remove cookies and cool on wire racks.\n",
        "picture_link": "88y9mSNIiJA6LB22PEkjn8wwtw1JDsm"
    },
    {
        "title": "Marie-Claude's Orange Cake",
        "ingredients": [
            "3/8 cup vegetable oil ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup plain yogurt ADVERTISEMENT",
            "2 oranges, zested and juiced ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C).\nIn a medium bowl, mix together the vegetable oil, sugar and eggs. Stir in yogurt and orange zest. Combine the flour and baking powder; stir into the mixture just until blended. Pour the dough into a greased 9x13 inch baking pan.\nBake for 30 minutes in the preheated oven, or until a knife inserted into the cake comes out clean. Poke holes in the cake with a knife, and pour the juice from the oranges over the cake slowly until it has all been absorbed.\n",
        "picture_link": "dtpFe7kUb5uoHoG3Lsdj0MctOMT9sDW"
    },
    {
        "title": "Authentic Green Goddess Dressing",
        "ingredients": [
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/2 cup creme fraiche ADVERTISEMENT",
            "1/4 cup chopped green onions ADVERTISEMENT",
            "2 tablespoons chopped fresh chives ADVERTISEMENT",
            "2 tablespoons chopped Italian flat leaf parsley ADVERTISEMENT",
            "1 tablespoon anchovy paste ADVERTISEMENT",
            "1 tablespoon fresh lemon juice ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon cracked black peppercorns ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the mayonnaise, creme fraiche, green onion, chives, parsley, anchovy paste, lemon juice, salt and pepper in the container of a food processor or blender. Blend until you have a thick, rich, creamy delicious dressing.\n",
        "picture_link": "Qiwl9oxlWG/6Luu5rdC16sONwAeMfrG"
    },
    {
        "title": "Red Currant Jelly",
        "ingredients": [
            "4 pounds fresh red currants ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "7 cups white sugar ADVERTISEMENT",
            "4 fluid ounces liquid fruit pectin ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the currants into a large pot, and crush with a potato masher or berry crusher if you have one. Pour in 1 cup of water, and bring to a boil. Simmer for 10 minutes. Strain the fruit through a jelly cloth or cheese cloth, and measure out 5 cups of the juice.\nPour the juice into a large saucepan, and stir in the sugar. Bring to a rapid boil over high heat, and stir in the liquid pectin immediately. Return to a full rolling boil, and allow to boil for 30 seconds.\nRemove from heat and skim off foam from the top. Ladle or pour into sterile 1/2 pint jars, filling to within 1/2 inch of the top. Wipe the rims with a clean damp cloth. Cover with new sterile lids and rings. Process covered in a bath of simmering water for 10 minutes or the time recommended by your local extension for your area.\n",
        "picture_link": "gZRtOU.1HYNh4TlJ3M9CEtMP8B6yDb6"
    },
    {
        "title": "Bailik (buy-lick)",
        "ingredients": [
            "4 skinless, boneless chicken breast halves - pounded to 1/2 inch thickness ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "2 tablespoons Hungarian paprika, divided ADVERTISEMENT",
            "2 tablespoons prepared yellow mustard ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 cups matzo meal ADVERTISEMENT",
            "1 cup oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a bowl, whisk together the eggs, 1 tablespoon of paprika, mustard, salt and pepper. In a separate dish, stir together the remaining paprika and matzo meal.\nHeat the oil in a large skillet over medium-high heat. Dip each chicken breast into the eggs, then into the matzo meal until completely coated. Make sure you can see no chicken through the breading, or it may fall off. Fry in the hot oil for about 5 minutes per side, or until the chicken is firm and the juices run clear. If it starts to brown too fast, reduce the heat slightly.\n",
        "picture_link": "DS4KzbS5nzZe3wwkiUhAmnVh7I.u6A6"
    },
    {
        "title": "Chicken Foster",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "6 tablespoons brown sugar ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast halves - cut into 1 inch cubes ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "2 small bananas, sliced ADVERTISEMENT",
            "2 (1.5 fluid ounce) jiggers amaretto liqueur ADVERTISEMENT",
            "3/4 cup coconut-flavored rum ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a large skillet over medium heat, and stir in the brown sugar. Season the chicken with salt and pepper, and toss with flour to coat. Add chicken and bananas to the skillet, and cook stirring occasionally until chicken is almost cooked through. Stir in the amaretto and rum, and heat through. Remove from the burner, and use a long match or lighter to flambe. Allow to burn until the alcohol cooks off and the flame goes out. Serve and enjoy!\n",
        "picture_link": "TYKQLr7i0MJA1fkK.22EocI5o5R6tBq"
    },
    {
        "title": "Beef and Rice Dish",
        "ingredients": [
            "1 pound lean ground beef ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 green bell pepper, seeded and chopped ADVERTISEMENT",
            "1 cup uncooked long grain white rice ADVERTISEMENT",
            "1 (14 ounce) can beef broth ADVERTISEMENT",
            "2/3 cup water ADVERTISEMENT",
            "1 cube beef bouillon ADVERTISEMENT",
            "1 (12 ounce) can diced tomatoes ADVERTISEMENT",
            "1 (11 ounce) can sweet corn, drained ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 (6 ounce) package (1 ounce each) mozzarella cheese ADVERTISEMENT",
            "1 (16 ounce) package shredded Monterey Jack cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the ground beef, onion, garlic, and green bell pepper in a saucepan over medium heat, and cook until beef is evenly brown. Drain grease.\nMix rice, broth, water, bouillon, tomatoes, and corn into the saucepan. Season with pepper. Bring to a boil. Reduce heat to low, cover, and simmer 25 minutes. Top with mozzarella and Monterey Jack cheeses to serve.\n",
        "picture_link": "PPQkz3AWLA38sm4xbqhBwECV31qNZw."
    },
    {
        "title": "Anytime Almonds",
        "ingredients": [
            "2 cups dry roasted almonds, no salt added ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 cloves garlic, finely chopped ADVERTISEMENT",
            "1 sprig fresh rosemary, chopped ADVERTISEMENT",
            "1 1/2 teaspoons kosher salt (do not use regular table salt) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a bowl, mix together almonds, olive oil, garlic, and rosemary until nuts are completely coated. Season with salt. Spread evenly on a baking sheet.\nBake in a preheated oven for 10 minutes.\n",
        "picture_link": "0INlHxMFB6/uSgz6bV8kdl5M4bJA1QC"
    },
    {
        "title": "Jibarito",
        "ingredients": [
            "2 cups vegetable oil for frying ADVERTISEMENT",
            "1 green plantain, peeled and halved lengthwise ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "4 ounces beef skirt steak, cut into thin strips ADVERTISEMENT",
            "1/4 medium yellow onion, thinly sliced ADVERTISEMENT",
            "1 pinch cumin ADVERTISEMENT",
            "1 pinch dried oregano ADVERTISEMENT",
            "1 tablespoon mayonnaise ADVERTISEMENT",
            "1 slice processed American cheese, cut in half ADVERTISEMENT",
            "2 slices tomato ADVERTISEMENT",
            "3 leaves lettuce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 2 cups vegetable oil in a large, deep skillet or deep fryer to 350 degrees F. Place plantain halves in the oil and cook 1 to 2 minutes, until they float. Remove from oil and drain on paper towels.\nPlace plantain halves between 2 cutting boards. Press to flatten. Place the flattened plantains back in the oil and cook for 2-3 minutes, until golden brown. Drain on paper towels.\nHeat 2 tablespoons of oil in a large skillet. Add the garlic, skirt steak, onion, cumin and oregano. Cook, stirring frequently, until steak is cooked through.\nTo serve, spread mayonnaise on one of the plantain slices. Top with cheese, steak and onion mixture, lettuce, and tomato. Place the other plantain half on top to form a sandwich. Cut in half and serve!\n",
        "picture_link": "cY1TYQ8HHpGM/mmUXdimjmXFZnStQcu"
    },
    {
        "title": "No Ordinary Meatloaf",
        "ingredients": [
            "1 serving cooking spray (optional) ADVERTISEMENT",
            "2 cups corn bread stuffing mix ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 pound ground pork ADVERTISEMENT",
            "1/2 cup diced onion ADVERTISEMENT",
            "1/2 cup diced green bell pepper ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "2 teaspoons seasoned salt ADVERTISEMENT",
            "1 teaspoon garlic and herb seasoning blend ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray a 9x5 inch loaf pan with nonstick cooking spray.\nIn food processor or blender, pulse stuffing mix to fine crumbs; place in large bowl. Stir in ground beef, ground pork, onion, green pepper, tomatoes, eggs, seasoned salt, seasoning blend, and pepper. Use your hands to mix very well; pat into prepared pan.\nBake in preheated oven until no longer pink in the center, 45 minutes to 1 hour. An instant-read thermometer inserted into the center should read at least 160 degrees F (72 degrees C). Cool for 5 to 10 minutes before slicing.\n",
        "picture_link": "O2YY8oeFWKvf/0QyeqwOb7ja7HzEo/S"
    },
    {
        "title": "Turkey Cream Cheese Enchiladas",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 yellow bell pepper, chopped ADVERTISEMENT",
            "1 orange bell pepper, chopped ADVERTISEMENT",
            "2 teaspoons kosher salt ADVERTISEMENT",
            "2 teaspoons ground black pepper ADVERTISEMENT",
            "1/2 teaspoon ground chipotle chile pepper ADVERTISEMENT",
            "1/2 teaspoon ground ancho chile pepper ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "1 1/2 teaspoons paprika ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1/3 cup heavy cream ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, cut into pieces ADVERTISEMENT",
            "5 cups shredded cooked turkey ADVERTISEMENT",
            "2 1/2 cups shredded Cheddar cheese ADVERTISEMENT",
            "1 teaspoon hot pepper sauce, or to taste ADVERTISEMENT",
            "22 (6 inch) corn tortillas ADVERTISEMENT",
            "1 cup vegetable oil for frying ADVERTISEMENT",
            "1 1/2 cups shredded Cheddar cheese, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 375 degrees F (190 degrees C). Grease 2 9x12 inch baking pans.\nHeat the butter and olive oil in a large skillet over medium heat. Stir in the onion and chopped green, yellow, and orange bell peppers; cook and stir until the peppers have softened and onion has turned translucent, about 10 minutes. Add the kosher salt, black pepper, chipotle pepper, ancho pepper, cumin, and paprika. Cook and stir until seasonings start to become fragrant, about 5 more minutes.\nPour in the sour cream and heavy cream, and add the cream cheese. Stir well to combine, and cook over low heat until mixture is heated through and creamy, about 5 minutes. Remove pan from heat and allow mixture to cool about 10 to 15 minutes. Divide mixture, and reserve half for topping.\nCombine shredded turkey with 2 1/2 cups of shredded Cheddar cheese in a large bowl. Add in half of the cooled cream and pepper mixture, and stir lightly to mix. Set aside.\nHeat vegetable oil in a skillet over medium heat until the oil is hot but not smoking, about 2 minutes. Slide one tortilla at a time into the oil and allow to heat through, about 20 to 30 seconds, until the tortilla is hot and pliable. Stack the warmed tortillas and cover to retain heat.\nTo assemble the enchiladas, place 1/4 cup of creamy turkey filling in a line down the center of each tortilla, roll the tortillas, and lay 11 enchiladas, seam sides down, into each prepared baking dish. Top each dish with half of the reserved cream and pepper mixture. Bake the pans in the oven for 20 to 25 minutes, until enchiladas are heated through and sauce begins to brown and bubble.\nRemove the pans from the oven, sprinkle each with about 3/4 cup of shredded Cheddar cheese, and return to the oven to finish baking, about 15 more minutes, until topping is melted, browned, and bubbling. Let stand about 10 minutes to rest before serving.\n",
        "picture_link": "SYjUMnsJbN7MWnTlWusdvenk4mINkMK"
    },
    {
        "title": "Grilled Salmon With Cucumber Salad",
        "ingredients": [
            "2 large cucumbers, peeled, halved lengthwise, seeds scraped out, then thinly sliced ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 medium red onion, thinly sliced ADVERTISEMENT",
            "6 tablespoons sour cream ADVERTISEMENT",
            "1 tablespoon red wine vinegar ADVERTISEMENT",
            "1/2 teaspoon dried dill ADVERTISEMENT",
            "Ground black pepper ADVERTISEMENT",
            "4 (5 ounce) salmon fillets ADVERTISEMENT",
            "Olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cucumbers in a colander and toss with salt; let stand until several tablespoons of liquid has drained, 30 to 45 minutes. Pat dry with paper towels and transfer to a medium bowl. Add onion, sour cream, vinegar, dill and a few grinds of pepper. Toss to coat. (Can be refrigerated several hours ahead.)\nMeanwhile, heat gas grill, with all burners on high, until fully preheated, 10 to 15 minutes. Use a wire brush to clean grill rack, then brush lightly with oil. Close lid and let return to temperature. Brush salmon with oil and season with salt and pepper; grill until just opaque, about 3 minutes per side.\nSet each warm or room-temperature salmon fillet on a plate; spoon cucumber salad over part of and alongside the fish.\n",
        "picture_link": "mJAL4gbS5j3Lw.omHr3wEuB.h0wHjH6"
    },
    {
        "title": "Yummy Yellow Taters",
        "ingredients": [
            "8 medium baking potatoes, peeled and diced ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "3 cloves garlic, sliced ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1/4 cup butter or margarine ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "12 drops yellow food coloring ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the potatoes into a large pot, and fill with enough water to cover by 1 inch. Add the onion, garlic, basil, 1 teaspoon of salt and 1/2 teaspoon of pepper, and bring to a boil. Cook until potatoes are tender, about 15 minutes.\nDrain the contents of the pot in a colander, then transfer to a large bowl. Add the sour cream, butter, milk and food coloring, and beat with an electric mixer until light. Adjust milk if needed. Do not beat too long, or the potatoes will become stiff and pasty. Taste and adjust salt and pepper before serving.\n",
        "picture_link": "gIYPvQoyuV5qbS4SN1OMNu6WVnp8DlS"
    },
    {
        "title": "Thanksgiving Won Tons",
        "ingredients": [
            "1 1/2 cups cooked turkey breast meat, shredded ADVERTISEMENT",
            "2/3 cup dried cranberries ADVERTISEMENT",
            "1/3 cup slivered almonds ADVERTISEMENT",
            "1/2 cup cranberry sauce ADVERTISEMENT",
            "1 (14 ounce) package wonton wrappers ADVERTISEMENT",
            "1 quart vegetable oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the turkey, cranberries, almonds, and cranberry sauce in a bowl. Place about 1 teaspoon of the mixture in the center of each wonton wrapper. Fold wrappers over filling, moisten edges, and press with a fork to seal.\nHeat the oil in large skillet or deep fryer.\nFry the wontons in the hot oil until golden brown. Drain on paper towels.\n",
        "picture_link": "S9h4.CuAvxgdMbWocFs3pcSi3LteUb6"
    },
    {
        "title": "White Pizza with Roasted Garlic and Green Olives",
        "ingredients": [
            "1 (12 inch) pre-baked pizza crust ADVERTISEMENT",
            "1 bulb garlic ADVERTISEMENT",
            "5 tablespoons olive oil ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 cup sliced green olives ADVERTISEMENT",
            "1 (8 ounce) package shredded Italian cheese blend ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Slice the top off of the head of garlic, and sprinkle with a little salt. Place on a square of aluminum foil, and drizzle with olive oil. Wrap the foil loosely around the garlic. Bake for 35 to 40 minutes in the preheated oven, until cloves are tender.\nDrizzle olive oil from the garlic foil pack over the pizza crust, and brush to spread evenly. Sprinkle the green olives over the crust. Top with shredded cheese. Squeeze the garlic cloves out of the paper skins, and distribute on top of the pizza.\nBake for 30 to 35 minutes in the preheated oven, or until the cheese is melted and bubbly and the edges are nicely browned. Allow to cool for a few minutes, then slice and serve.\n",
        "picture_link": "b/nATzu29i8mLJO.XJrip5BonHNWltG"
    },
    {
        "title": "Red Pepper Chimichurri",
        "ingredients": [
            "3 tablespoons kosher salt ADVERTISEMENT",
            "1 cup warm water ADVERTISEMENT",
            "2 bunches Italian flat leaf parsley ADVERTISEMENT",
            "6 cloves garlic ADVERTISEMENT",
            "1 cup extra-virgin olive oil ADVERTISEMENT",
            "1 cup roasted red peppers, coarsely chopped ADVERTISEMENT",
            "2 tablespoons sweet paprika ADVERTISEMENT",
            "2 tablespoons chopped fresh oregano ADVERTISEMENT",
            "1 tablespoon crushed red pepper ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/2 cup distilled white vinegar ADVERTISEMENT",
            "2 tablespoons red wine vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the kosher salt and warm water until the salt dissolves, set aside and allow to cool to room temperature. This is called the salmuera.\nCombine the flat leaf parsley, garlic, and olive oil in the bowl of a food processor, and pulse several times to chop up the parsley. Add the roasted red peppers, paprika, oregano, crushed red pepper, black pepper, cumin, white vinegar, and red wine vinegar. Continue to pulse the food processor until the ingredients are well combined, but still chunky.\nTransfer the sauce into a large mixing bowl, and slowly stir in the cooled salmuera. Cover and refrigerate for 2 hours to allow the salt to mellow. Sauce can be kept refrigerated in an airtight container for 2 weeks.\n",
        "picture_link": "5mjIshYmUMzu70gtmdwxtBkosSWeGJG"
    },
    {
        "title": "Springtime Asparagus and Parmesan Sandwich",
        "ingredients": [
            "1 bunch asparagus spears, trimmed and cut in half ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "12 slices French bread ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/3 cup mayonnaise ADVERTISEMENT",
            "1/3 cup shaved Parmesan cheese ADVERTISEMENT",
            "12 Bibb lettuce leaves ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the asparagus and 1/3 cup water in a microwave-safe bowl. Cook in the microwave on High 1 minute, or just until tender. Rinse under cold water, and blot dry with paper towels.\nSpread 1 side of 6 bread slices with 1/4 teaspoon butter and about 1 tablespoon mayonnaise each. Layer with asparagus, and sprinkle with Parmesan cheese. Place lettuce over the asparagus, season with pepper, and top with remaining 6 bread slices to form 6 sandwiches. Slice on a diagonal; this is a sandwich that exudes spring !\n",
        "picture_link": "1xCuXZDWy5SykHHyKf/kK1/2cYYeGAm"
    },
    {
        "title": "Garlic Roasted Broccoli",
        "ingredients": [
            "1 large head broccoli, cut into florets ADVERTISEMENT",
            "2 cloves garlic, sliced ADVERTISEMENT",
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "1 pinch onion powder, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nToss broccoli and garlic together in a large bowl. Drizzle olive oil over the broccoli; toss to coat. Spread broccoli and garlic onto a baking sheet; season with onion powder, salt, and black pepper.\nRoast in preheated oven for 10 minutes, turn, and continue roasting until beginning to char, about 10 minutes more.\n",
        "picture_link": "ANtoRn6sl8TWdbyr6DT/epnKRJRWaMa"
    },
    {
        "title": "Top-Notch Turkey Tetrazzini",
        "ingredients": [
            "1 (8 ounce) package dry spaghetti ADVERTISEMENT",
            "7 tablespoons butter, divided ADVERTISEMENT",
            "1 cup sliced mushrooms ADVERTISEMENT",
            "1/4 cup chopped onions ADVERTISEMENT",
            "1/2 teaspoon chopped garlic ADVERTISEMENT",
            "5 tablespoons all-purpose flour ADVERTISEMENT",
            "2 cups Swanson® Chicken Broth ADVERTISEMENT",
            "1 cup half-and-half ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon poultry seasoning ADVERTISEMENT",
            "1/4 teaspoon freshly ground black pepper ADVERTISEMENT",
            "3 cups diced cooked turkey ADVERTISEMENT",
            "1 cup frozen peas ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1/2 cup Italian-style panko bread crumbs ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Spray a 9x13-inch casserole dish with non-stick cooking spray.\nBring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally until tender yet firm to the bite, about 10 minutes. Drain well. Keep warm.\nMelt 4 tablespoons butter in a skillet over medium heat. Cook and stir mushrooms and onions until onions begin to turn translucent and mushrooms release some liquid, about 5 minutes. Add garlic and stir until fragrant, about 1 minutes. Add flour, stirring constantly, until thoroughly incorporated in the butter and begins to bubble, about 2 minutes.\nMix the Swanson(R) Chicken Broth and half-and-half together; pour gradually into mushroom mixture, whisking until it is smooth. Season with salt, poultry seasoning, and pepper. Bring to a boil, stirring occasionally. Reduce and continue cooking until mixture begins to thicken, about 3 minutes. Mix in turkey and peas. Remove from heat.\nMelt 3 tablespoons butter in a small saucepan over low heat. Stir in the Parmesan cheese and panko bread crumbs, mixing until crumbly. Remove from heat.\nPlace 1/2 of the spaghetti in the bottom of prepared casserole dish. Spoon 1/2 of the sauce mixture over the spaghetti. Repeat the layer with the remaining spaghetti and sauce. Sprinkle the bread crumb mixture over the top.\nBake in preheated oven until bubbly and the top is golden brown, 20 to 25 minutes. Top with chopped fresh parsley.\n",
        "picture_link": "IAH9eOQxqdgGpvcqc/2vDDMKBVT8/9S"
    },
    {
        "title": "Best-Ever Cucumber Dill Salad",
        "ingredients": [
            "1/2 cucumber, very thinly sliced ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 cup sour cream, or to taste ADVERTISEMENT",
            "1/4 cup vinegar, or more to taste ADVERTISEMENT",
            "1/4 cup plain yogurt ADVERTISEMENT",
            "2 tablespoons mayonnaise ADVERTISEMENT",
            "1/2 lime, juiced ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "1 teaspoon dill ADVERTISEMENT",
            "1/2 red onion, thinly sliced ADVERTISEMENT",
            "1/2 stalk celery, thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cucumber slices in a colander. Generously sprinkle salt over cucumber; let sit until water starts to bead on the slices, about 10 minutes. Drain water from cucumber slices.\nWhisk sour cream, vinegar, yogurt, mayonnaise, lime juice, sugar, and dill together in a large bowl until dressing is smooth. Mix cucumber, onion, and celery into dressing until evenly coated; season with salt and pepper.\n",
        "picture_link": "0.g.vCVMEu3AUM0h7iLmrNETI6jQrJ2"
    },
    {
        "title": "NO YOLKS® Asian Vegetables and Chicken in a Spicy Peanut Sauce",
        "ingredients": [
            "6 ounces NO YOLKS® Kluski Noodles ADVERTISEMENT",
            "1 1/2 tablespoons rice vinegar (see note) ADVERTISEMENT",
            "3 1/2 tablespoons peanut butter ADVERTISEMENT",
            "2 1/2 tablespoons honey ADVERTISEMENT",
            "2 1/2 teaspoons sriracha sauce (see note) ADVERTISEMENT",
            "1/4 cup reduced-sodium soy sauce ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 pound boneless, skinless chicken thighs, cut into bite-size pieces ADVERTISEMENT",
            "1 (12 ounce) package frozen Asian mixed vegetables, thawed ADVERTISEMENT",
            "1/2 tablespoon toasted sesame oil ADVERTISEMENT",
            "2 tablespoons minced cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare noodles according to package directions.\nCombine vinegar, peanut butter, honey, sriracha sauce and soy sauce in a bowl. Stir well and set aside. Heat oil in large skillet over medium heat. Add chicken and stir-fry until cooked through and no longer pink. Add vegetables and stir-fry 2 minutes, or until vegetables are heated through. Stir in cooked noodles, sesame oil and reserved peanut butter sauce. Cook over low heat for 1 to 2 minutes, stirring occasionally to blend flavors. Serve hot or warm topped with cilantro.\n",
        "picture_link": "J6eEz77PE3bCdMU3jyy.xG0Ze/8cuVm"
    },
    {
        "title": "Chef John's Hot Dog Buns",
        "ingredients": [
            "1 (.25 ounce) package active dry yeast (such as Fleischmann's RapidRise®) ADVERTISEMENT",
            "3 1/2 cups all-purpose flour, divided, or more as needed ADVERTISEMENT",
            "1 cup warm water (105 degrees F/41 degrees C) ADVERTISEMENT",
            "1 large egg ADVERTISEMENT",
            "3 tablespoons melted butter ADVERTISEMENT",
            "3 tablespoons sugar ADVERTISEMENT",
            "1 1/4 teaspoons salt ADVERTISEMENT",
            "1 teaspoon olive oil ADVERTISEMENT",
            "3 tablespoons melted butter, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line a baking sheet with a silicone mat or parchment paper.\nPlace yeast into bowl of a large stand mixer; whisk 1/2 cup flour and water into yeast until mixture is smooth. Let stand until mixture is foamy, 10 to 15 minutes.\nWhisk egg, 3 tablespoons melted butter, sugar, and salt into yeast mixture; add remaining flour and stir.\nFit a dough hook onto stand mixer and knead the dough on low speed until soft and sticky, 5 to 6 minutes. Scrape sides if needed. Poke and prod the dough with a silicone spatula; if large amounts of dough stick to the spatula, add a little more flour.\nTransfer dough onto a floured work surface; dough will be sticky and elastic but not stick to your fingers. Form the dough lightly into a smooth, round shape, gently tucking loose ends underneath.\nWipe out stand mixer bowl, drizzle olive oil into the bowl, and turn dough over in the bowl several times to coat surface thinly with oil. Cover bowl with aluminum foil. Let dough rise in a warm place until doubled in size, about 2 hours.\nTransfer dough to a floured work surface and form into a 5x10-inch rectangle about 1/2-inch thick. Cut dough into 8 equal lengths. Turn each slice cut-side up and form into a hot dog bun shape about 5 inches long. Transfer dough, cut-sides up, to the prepared baking sheet about set them about 1/4-inch apart.\nCut a slit about 1/8-inch deep down the center of each bun. Brush 2 tablespoons melted butter over the top and sides of each bun. Let rise until almost doubled in size and the buns have risen into each other, about 45 minutes.\nPreheat oven to 375 degrees F (190 degrees C).\nBake buns in the preheated oven until golden brown, about 20 minutes. Brush tops with remaining melted butter.\n",
        "picture_link": "IHhxyzUoFufHiKXlM6C5pEILN5xNeHu"
    },
    {
        "title": "Spicy Caramel Chicken",
        "ingredients": [
            "Sauce: ADVERTISEMENT",
            "2 tablespoons finely grated fresh ginger ADVERTISEMENT",
            "4 cloves finely minced garlic ADVERTISEMENT",
            "3/4 cup light brown sugar ADVERTISEMENT",
            "1/3 cup rice vinegar ADVERTISEMENT",
            "1/3 cup fish sauce ADVERTISEMENT",
            "2 teaspoons hot pepper sauce, or to taste ADVERTISEMENT",
            "1 teaspoon soy sauce ADVERTISEMENT",
            "2 pounds boneless, skinless chicken thighs, cut into 1-inch pieces ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1/2 cup sliced, seeded jalapeno peppers ADVERTISEMENT",
            "1/2 cup sliced, seeded mild red chilies or bell peppers ADVERTISEMENT",
            "1/2 cup roasted peanuts ADVERTISEMENT",
            "1/2 cup chopped green onions, plus more for garnish ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro leaves ADVERTISEMENT",
            "4 cups cooked white rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk grated ginger, garlic, brown sugar, rice vinegar, fish sauce, hot sauce, and soy sauce together in a large bowl.\nPlace chicken chunks in a bowl. Pour 1/4 cup of the prepared sauce onto chicken chunks; mix until all chicken pieces are coated. Set aside 15 minutes.\nHeat vegetable oil in a heavy skillet over high heat. As soon as oil starts to smoke, place chicken chunks in a single layer in the pan. Cook and stir until chicken pieces start to caramelize and turn deep brown, 8 to 10 minutes. Reduce heat to medium. Stir in sliced jalapeno and red peppers, peanuts, and green onions. Cook and stir one minute. Pour in remainder of sauce. Simmer until heated through, 1 or 2 minutes. Remove from heat.\nStir in cilantro. Serve over hot cooked rice and top with chopped green onions.\n",
        "picture_link": "lLaCQ2rz0Vmnhb1EzJCrzTRj19htNW."
    },
    {
        "title": "Sharon's Egg and Ham Scramble",
        "ingredients": [
            "8 eggs, beaten ADVERTISEMENT",
            "3 tablespoons milk, or more to taste ADVERTISEMENT",
            "1/4 teaspoon seasoned salt (such as Season-All®) ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 jalapeno pepper, seeded and minced ADVERTISEMENT",
            "1/2 cup chopped deli slices applewood-smoked ham ADVERTISEMENT",
            "1 cup finely shredded Cheddar cheese, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat eggs, milk, seasoned salt, salt, and black pepper together in a bowl.\nHeat olive oil in a large non-stick skillet over medium-high heat; saute jalapeno in hot oil until slightly softened, 2 to 3 minutes. Add ham to jalapeno and cook until heated through, about 1 minute.\nPour egg mixture into ham mixture. Cook and stir until eggs are set but not dry, 3 to 5 minutes. Sprinkle 1/2 of the Cheddar cheese over eggs; cook and stir until cheese is melted. Transfer eggs to a plate and sprinkle remaining cheese over the top.\n",
        "picture_link": "2VpqQ9XvsYF24/4eZ0ewuyB1j9Myrf."
    },
    {
        "title": "Chicken, Rice, and Biscuit Casserole",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "1 cup rice ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves, cut into bite-size pieces ADVERTISEMENT",
            "1 pinch salt and freshly ground black pepper to taste ADVERTISEMENT",
            "1 (26 ounce) can cream of chicken soup ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 cup shredded Mexican blend cheese ADVERTISEMENT",
            "1 (10 ounce) can refrigerated flaky-style biscuit dough, separated ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water and rice to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until the rice is tender and liquid has been absorbed, 20 to 25 minutes.\nPreheat oven to 350 degrees F (175 degrees C).\nPour just enough water into a large skillet to cover the bottom in a shallow layer; add chicken pieces in a single layer. Season chicken with salt and pepper. Turn heat to medium-high and cook chicken, adding water as needed to keep pan wet, until no longer pink in the center and the juices run clear, 7 to 10 minutes; drain liquid.\nStir cooked rice, cooked chicken, cream of chicken soup, milk, and Mexican blend cheese together in a casserole dish. Smooth the top of the mixture with the back of a spoon. Arrange biscuit dough over the bottom layer, breaking dough pieces as needed to get maximum coverage and to avoid overlap.\nBake in preheated oven until the biscuit topping is golden brown and the bottom layer is heated through completely, 20 to 35 minutes.\n",
        "picture_link": "6HbxryEqVj5HzFVH3KFW4uvXJqTpgDm"
    },
    {
        "title": "Chicken and Shrimp Linguine",
        "ingredients": [
            "1 pound linguini pasta ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "4 tablespoons butter ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves - cut into cubes ADVERTISEMENT",
            "3/4 cup white wine ADVERTISEMENT",
            "1 pound medium shrimp - peeled and deveined ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add linguini pasta and cook for 8 to 10 minutes or until al dente; drain.\nIn a small bowl, combine nutmeg, cayenne pepper, onion powder and pepper; set aside.\nIn a medium saucepan over medium heat, melt butter and add 1/2 of the spice mixture, milk and cream. Heat until sauce thickens; set aside.\nIn a large skillet over medium heat, warm olive oil and add garlic, chicken, wine and remaining spice; cook until chicken is no longer pink. Remove chicken from pan and cook shrimp.\nDeglaze pan by adding some wine and heating it for 2 to 3 minutes; add the cream sauce and reheat if needed. Pour sauce over hot linguine and add chicken mixture and shrimp.\n",
        "picture_link": "SSs0R9cQiix3CPCnc50YJbDAywd2a5u"
    },
    {
        "title": "Blueberry and Banana Steel Cut Oats",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "2 cups almond milk ADVERTISEMENT",
            "2 cups blueberries ADVERTISEMENT",
            "2 ripe bananas, mashed ADVERTISEMENT",
            "1 cup steel-cut oats ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir water, almond milk, blueberries, bananas, oats, honey, vanilla extract, cinnamon, and salt together in the crock of a slow cooker.\nCook on Low for 5 to 8 hours.\n",
        "picture_link": "mD3Fr.MGMhBI3T9cJcYAUiWJTCV5t/O"
    },
    {
        "title": "Paleo Chocolate Chip Cookies",
        "ingredients": [
            "1 cup almond butter ADVERTISEMENT",
            "1/4 cup raw honey ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 cup dairy-free and gluten-free chocolate chips (such as Enjoy Life®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line 2 baking sheets with parchment paper.\nWhisk almond butter, honey, egg, baking soda, vanilla extract, and salt together in a bowl; fold in chocolate chips. Drop batter, about 2 tablespoons per cookie, onto the prepared baking sheet about 1 1/2 inches apart.\nBake in the preheated oven until edges start to crisp, 8 to 10 minutes. Cool cookies on baking sheet for 10 minutes before removing.\n",
        "picture_link": "FZwEoPZ3GKuh1jc1whwE0EQN2CK88F2"
    },
    {
        "title": "Chef John's Spanish Garlic Soup (Sopa de Ajo)",
        "ingredients": [
            "6 cups cubed French bread ADVERTISEMENT",
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "1/4 cup extra virgin olive oil ADVERTISEMENT",
            "6 cloves garlic, very thinly sliced, or more to taste ADVERTISEMENT",
            "2 ounces ham, diced ADVERTISEMENT",
            "1 1/2 teaspoons smoked paprika, or to taste ADVERTISEMENT",
            "6 cups chicken broth, or more as needed ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 cup chopped fresh flat-leaf parsley ADVERTISEMENT",
            "4 large eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with aluminum foil.\nSpread French bread onto the prepared baking sheet and drizzle 1 tablespoon olive oil over the top; gently stir to coat bread.\nBake in the preheated oven until crispy and lightly browned, 15 to 20 minutes.\nHeat 1/4 cup olive oil in a heavy pot over medium heat. Cook and stir garlic in hot oil until just golden, 1 to 2 minutes. Add ham; cook and stir until heated through, about 1 minute. Add 1 to 2 teaspoons of paprika and cook for 1 minute more. Pour bread into pot and toss to coat with hot oil mixture.\nPour chicken broth into bread mixture; add cayenne pepper, salt, and black pepper and stir. Bring to a boil, reduce heat to medium, and stir in parsley.\nCrack each egg into a small bowl or cup. Make 4 depressions in the bread on top of the soup with a spoon. Slowly pour an egg into each depression. Cover the pot with a lid and cook until egg whites are firm and yolks are thick but not hard, 2 to 3 minutes. Ladle soup into bowls and spoon an egg on top.\n",
        "picture_link": "qj8p4.NXGqqOYnDK5FaAsRqwqO0r.ae"
    },
    {
        "title": "Gluten-Free Impossibly Easy Cheeseburger Pie",
        "ingredients": [
            "1 pound lean (at least 80%) ground beef ADVERTISEMENT",
            "1 medium onion, chopped ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon pepper ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/2 cup Bisquick™ Gluten Free mix ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 400 degrees F. Spray 9-inch glass pie plate with cooking spray. In 10-inch skillet, cook beef and onion over medium-high heat, stirring frequently, until beef is thoroughly cooked; drain. Stir in salt and pepper. Spread in pie plate; sprinkle with cheese.\nIn medium bowl, stir Bisquick mix, milk and eggs until blended. Pour into pie plate.\nBake 25 to 30 minutes or until knife inserted in center comes out clean.\n",
        "picture_link": "u62l.slMkT1tnb.6X3nmuh6nbDZHc8C"
    },
    {
        "title": "Cheddar Cheese Muffins",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 1/2 cups shredded Cheddar cheese ADVERTISEMENT",
            "1 cup plain yogurt ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease 12 large muffin cups.\nMix flour, sugar, baking powder, salt, and baking soda together in a large mixing bowl; stir Cheddar cheese into the flour mixture. Pour yogurt, eggs, and butter over the flour mixture; stir until the dry ingredients are just moistened. Spoon the batter into the prepared muffin cups.\nBake in the preheated oven until the tops just start to lightly brown, 18 to 20 minutes.\n",
        "picture_link": ".MH/DsNHKLoH4y6inVOHKpK5TSN7irS"
    },
    {
        "title": "Country Goulash",
        "ingredients": [
            "2 pounds lean ground beef ADVERTISEMENT",
            "1 large yellow onion, chopped ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "3 tablespoons paprika, or to taste ADVERTISEMENT",
            "2 teaspoons ground black pepper, or to taste ADVERTISEMENT",
            "2 teaspoons seasoned salt, or to taste ADVERTISEMENT",
            "2 (15 ounce) cans tomato sauce ADVERTISEMENT",
            "1 (8 ounce) can tomato paste ADVERTISEMENT",
            "1 cup water, or as desired ADVERTISEMENT",
            "2 cups uncooked elbow macaroni ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium-high heat. Cook and stir beef, onion, and garlic in the hot skillet until browned and crumbly, 5 to 7 minutes.\nSeason beef with paprika, black pepper, and seasoned salt. Stir tomato sauce and tomato paste into the beef mixture until smooth. Pour water over the beef; add macaroni and stir.\nBring the liquid to a boil, reduce heat to medium-low, and simmer mixture, adding water as needed to maintain your desired consistency, until the macaroni is tender yet firm to the bit, about 20 minutes. Adjust seasoning before serving.\n",
        "picture_link": "ThA/9cnfnas67cIBG.WuX0tXDnI9suS"
    },
    {
        "title": "Pepper Jelly Pork",
        "ingredients": [
            "2 teaspoons chili powder ADVERTISEMENT",
            "1 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 pork tenderloin ADVERTISEMENT",
            "1/4 cup hot pepper jelly ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nWhisk chili powder, black pepper, ground cumin, and salt together in a small bowl. Rub spice mixture onto all sides of pork tenderloin. Place tenderloin in a shallow roasting pan.\nRoast tenderloin in the preheated oven until no longer pink in the center, about 30 minutes. An instant-read thermometer inserted into the center should read 150 degrees F (65 degrees C).\nStir pepper jelly and balsamic vinegar together in a saucepan over low heat until jelly is completely melted, 1 to 2 minutes. Brush pepper jelly mixture over pork tenderloin and continue to bake tenderloin until jelly coating is hot, about 5 minutes more. Let pork rest for 5 minutes before slicing.\n",
        "picture_link": "gitbuGKxVdOk5/4LbEFYOy59ca8Zrqi"
    },
    {
        "title": "Loaded Cauliflower Casserole",
        "ingredients": [
            "6 slices turkey bacon, or more to taste ADVERTISEMENT",
            "1 large head cauliflower, cut into florets ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "2 cups shredded Colby-Monterey Jack cheese, divided ADVERTISEMENT",
            "1 (8 ounce) package baby bella mushrooms, roughly chopped ADVERTISEMENT",
            "6 tablespoons chopped fresh chives, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Grease a 9x13-inch baking dish.\nPlace turkey bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on paper towels and crumble.\nPlace a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add cauliflower, cover, and steam until tender, 15 to 20 minutes.\nCombine sour cream, mayonnaise, garlic, salt, and black pepper in a large bowl; add cauliflower, 1/2 of the bacon, 1 cup Colby-Monterey Jack cheese, mushrooms, and 3 tablespoons chives and mix well. Transfer mixture to the prepared baking dish and top with remaining bacon and cheese.\nBake in the preheated oven until bubbling and cheese is melted, about 20 minutes. Sprinkle remaining chives over casserole.\n",
        "picture_link": "dz.Kc3ZsG.N7du3W5Pm1Qwv6MjGP6Zy"
    },
    {
        "title": "Ham and Swiss Sliders",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 large red onion, sliced ADVERTISEMENT",
            "12 dinner rolls, split ADVERTISEMENT",
            "3/4 cup honey mustard dressing (such as Ken's Steak House®) ADVERTISEMENT",
            "3/4 pound honey ham, thinly sliced ADVERTISEMENT",
            "2 cups shredded Swiss cheese ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "1/2 teaspoon Worcestershire sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nHeat olive oil in a skillet over medium heat. Add sliced onion; cook and stir until softened, about 10 minutes. Remove from heat.\nSpread honey mustard dressing on the top and bottom half of each roll. Line the bottom of a 9x13-inch baking dish with the bottom halves of the rolls. Layer cooked onion, ham, and Swiss cheese over the bottom halves of the rolls. Cover with top halves of the rolls.\nCombine melted butter and Worcestershire sauce in a small bowl; brush evenly over the tops of the rolls. Cover baking dish with aluminum foil.\nBake in the preheated oven until lightly browned and the cheese has melted, 12 to 15 minutes.\n",
        "picture_link": "cBQCK/YxD3o/cYSw0Fu9a0FUkASwt7K"
    },
    {
        "title": "Pork Chops Smothered in Onion Gravy",
        "ingredients": [
            "2 teaspoons seasoned salt ADVERTISEMENT",
            "2 teaspoons garlic powder ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "4 pork chops, 3/4-inch thick, or more to taste ADVERTISEMENT",
            "1/2 cup self-rising flour ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 yellow onion, thinly sliced ADVERTISEMENT",
            "1 cup sliced fresh mushrooms, or more to taste ADVERTISEMENT",
            "1 teaspoon water, or as needed (optional) ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix seasoned salt, garlic powder, black pepper, and paprika together in a bowl; rub about 3/4 teaspoon spice mixture onto each pork chop. Thoroughly coat each pork chop with flour, saving remaining seasoning and flour for the gravy.\nHeat vegetable oil in a heavy skillet over medium-high heat; cook pork chops in the hot oil until browned, about 3 minutes per side. Transfer pork chops to a plate, retaining drippings in the pan. Cover pork chops with paper towels.\nCook and stir onion in the drippings in the heavy skillet over medium heat until browned, 5 to 10 minutes. Add mushrooms, remaining flour, remaining spice mixture, and about 1 teaspoon water if needed to moisten; cook and stir until onion is golden brown, about 5 minutes.\nStir 2 cups water into onion-mushroom mixture until gravy is smooth; bring to a boil. Place pork chops in the gravy, reduce heat, cover skillet, and simmer until pork chops are tender, about 1 hour. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C).\n",
        "picture_link": "EWer4D2FGBcTUtMdoMRXbL.zXLTIq9."
    },
    {
        "title": "Carrots and Cranberries",
        "ingredients": [
            "2 (8 ounce) packages carrots, peeled and cut into chunks ADVERTISEMENT",
            "1 cup dried cranberries, or more to taste ADVERTISEMENT",
            "1/4 cup chicken broth ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "1/4 cup dark brown sugar ADVERTISEMENT",
            "1 pinch ground cinnamon, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put carrots and cranberries into a microwave-safe dish. Mix chicken broth, butter, and brown sugar together in a bowl; drizzle over the carrot mixture and stir to coat.\nCook in microwave on High for 4 minutes.\nContinue cooking in microwave until carrots are tender, about 8 minutes more; cool at room temperature for 5 minutes and sprinkle with cinnamon.\n",
        "picture_link": "IEOx2CKFkB7pSHS3JKuTE3hYo4cEOuK"
    }
]