[
    {
        "title": "Cajun Chicken",
        "ingredients": [
            "2 cups vegetable oil ADVERTISEMENT",
            "2 tablespoons Cajun seasoning ADVERTISEMENT",
            "2 tablespoons dried Italian-style seasoning ADVERTISEMENT",
            "garlic powder to taste ADVERTISEMENT",
            "2 tablespoons lemon pepper ADVERTISEMENT",
            "10 skinless, boneless chicken breast halves - pounded to 1/2 inch thickness ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large shallow dish, mix the oil, Cajun seasoning, Italian seasoning, garlic powder, and lemon pepper. Place the chicken in the dish, and turn to coat with the mixture. Cover, and refrigerate for 1/2 hour.\nPreheat the grill for high heat.\nLightly oil the grill grate. Drain chicken, and discard marinade. Place chicken on hot grill and cook for 6 to 8 minutes on each side, or until juices run clear.\n",
        "picture_link": "P5LRlkne.v3ypceylNETUtgyQ425KDS"
    },
    {
        "title": "Grilled Delmonico Steaks",
        "ingredients": [
            "1/2 cup olive oil ADVERTISEMENT",
            "1/4 cup Worcestershire sauce ADVERTISEMENT",
            "6 tablespoons soy sauce ADVERTISEMENT",
            "1/4 cup minced garlic ADVERTISEMENT",
            "1/2 medium onion, chopped ADVERTISEMENT",
            "2 tablespoons salt ADVERTISEMENT",
            "1 tablespoon pepper ADVERTISEMENT",
            "1 tablespoon crushed dried rosemary ADVERTISEMENT",
            "3 tablespoons steak seasoning ADVERTISEMENT",
            "3 tablespoons steak sauce (e.g. A-1) ADVERTISEMENT",
            "4 (10 ounce) Delmonico (rib-eye) steaks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the olive oil, Worcestershire sauce, soy sauce, garlic, onion, salt, pepper, rosemary, steak seasoning, and steak sauce in the container of a food processor or blender. Process until well blended.\nPrick steaks on both sides with a fork, and place in a shallow container with a lid. Pour marinade over steaks, cover, and refrigerate at least 3 hours, or overnight.\nPreheat an outdoor grill for medium heat, or light charcoal, and wait until coals are completely white. Soaked wood chips may be added to the coals when ready for a smoky flavor, if you like.\nRemove steaks from marinade, and discard the marinade. Lightly oil the grilling surface, and place steaks on the grill. Cover, and grill steaks for about 10 minutes on each side, or to your desired degree of doneness.\n",
        "picture_link": "etyjWK8MR1fQv4X/R3ZUJkDW89/Xkem"
    },
    {
        "title": "Butternut and Acorn Squash Soup",
        "ingredients": [
            "1 butternut squash, halved and seeded ADVERTISEMENT",
            "1 acorn squash, halved and seeded ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1/4 cup chopped sweet onion ADVERTISEMENT",
            "1 quart chicken broth ADVERTISEMENT",
            "1/3 cup packed brown sugar ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "ground cinnamon to taste (optional) ADVERTISEMENT",
            "fresh parsley, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Place the squash halves cut side down in a baking dish. Bake 45 minutes, or until tender. Remove from heat, and cool slightly. Scoop the pulp from the skins. Discard skins.\nMelt the butter in a skillet over medium heat, and saute the onion until tender.\nIn a blender or food processor, blend the squash pulp, onion, broth, brown sugar, cream cheese, pepper, and cinnamon until smooth. This may be done in several batches.\nTransfer the soup to a pot over medium heat, and cook, stirring occasionally, until heated through. Garnish with parsley, and serve warm.\n",
        "picture_link": "MY/1rQsCaRNsNmjsgtE16J0UH8pP32W"
    },
    {
        "title": "Ham and Cheese Bowties",
        "ingredients": [
            "8 ounces farfalle (bow tie) pasta ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1/2 teaspoon prepared mustard ADVERTISEMENT",
            "2 1/2 cups shredded Colby cheese ADVERTISEMENT",
            "4 ounces cooked ham, julienned ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nIn a large saucepan over medium heat, melt butter. Saute garlic 30 seconds. Whisk in flour, salt and pepper. Cook and stir until smooth. Pour in milk, a little at a time, stirring constantly. Bring to a boil for 1 minute. Stir in mustard and Colby. Continue to cook, stirring occasionally, until cheese is melted. Remove from heat and stir in pasta and ham.\nPour into a 2 quart baking dish. Sprinkle with Parmesan.\nBake 20 to 25 minutes, until bubbly and golden.\n",
        "picture_link": "/pDgA8TZLAqRbCP4fdT4hkKPOXLsmk."
    },
    {
        "title": "Thai Cucumber Salad",
        "ingredients": [
            "3 large cucumbers, peeled, halved lengthwise, seeded, and cut into 1/4-inch slices ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup rice wine vinegar ADVERTISEMENT",
            "2 jalapeno peppers, seeded and chopped ADVERTISEMENT",
            "1/4 cup chopped cilantro ADVERTISEMENT",
            "1/2 cup chopped peanuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss the cucumbers with the salt in a colander, and leave in the sink to drain for 30 minutes. Rinse with cold water, then drain and pat dry with paper towels.\nWhisk together the sugar and vinegar in a mixing bowl until the sugar has dissolved. Add the cucumbers, jalapeno peppers, and cilantro; toss to combine. Sprinkle chopped peanuts on top before serving.\n",
        "picture_link": "7wVST7KvyPkpLvhJRTrHoj4zSGmDKZO"
    },
    {
        "title": "Pineapple Grilled Pork Chops",
        "ingredients": [
            "1 (8 ounce) can pineapple rings, juice drained and reserved ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "4 pork chops ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together the drained pineapple juice, brown sugar, soy sauce, and garlic powder together in a large plastic zipper bag, and smush the bag a few times with your hands to mix the marinade and dissolve the sugar. Place the pork chops into the marinade, squeeze out any air in the bag, seal it, and refrigerate overnight. Reserve the pineapple rings.\nPreheat an outdoor grill for medium heat, and lightly oil the grate.\nRemove the chops from the marinade, shaking off excess, and grill until browned, the meat is no longer pink inside, and the meat shows good grill marks, 5 to 8 minutes per side. Brush several times with marinade and let the marinade cook onto the surface of the meat. Discard excess marinade. While the meat is grilling, place 4 pineapple rings onto the grill, and allow to cook until hot and the slices show grill marks; serve the chops topped with the grilled pineapple rings.\n",
        "picture_link": "qeRl49iKbsQuXWm6Nt1EB50u2DL/kaC"
    },
    {
        "title": "Get a Husband Brunswick Stew",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 cup chopped onions ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "1 1/2 pounds ground pork ADVERTISEMENT",
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "1 (3 pound) whole cooked chicken, deboned and shredded ADVERTISEMENT",
            "3 (14.5 ounce) cans whole peeled tomatoes with liquid, chopped ADVERTISEMENT",
            "1 cup ketchup ADVERTISEMENT",
            "1/2 cup hickory flavored barbeque sauce ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "hot sauce to taste (optional) ADVERTISEMENT",
            "1 green bell pepper ADVERTISEMENT",
            "3 (14.75 ounce) cans cream style corn ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large skillet, and saute the onions and celery until soft. Mix in the pork and beef, and cook until evenly browned. Do not drain.\nTransfer the pork and beef mixture to a large stock pot over low heat. Stir in the shredded chicken, tomatoes and their liquid, ketchup, and barbeque sauce. Season with salt, pepper, and hot sauce. Place the whole green pepper into the mixture. Cook, stirring occasionally, 2 hours, or until thickened.\nStir the cream style corn into the stew mixture. Continue cooking 1 hour, or to desired consistency. Remove the green pepper; chop and return to the stew or discard.\n",
        "picture_link": ".ko7Cl/QK8zCkLsJ9ZNLdw8Y0qINLVG"
    },
    {
        "title": "Lasagna Alfredo",
        "ingredients": [
            "1 (16 ounce) package lasagna noodles ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped spinach ADVERTISEMENT",
            "3 cooked, boneless chicken breast halves, diced ADVERTISEMENT",
            "2 (16 ounce) jars Alfredo-style pasta sauce ADVERTISEMENT",
            "4 cups shredded mozzarella cheese ADVERTISEMENT",
            "2 pints ricotta cheese ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain. Cook spinach according to package directions; drain.\nIn a medium bowl, combine chicken and one jar of Alfredo sauce, stir together. In a separate bowl, combine ricotta and drained, cooked spinach, and stir.\nIn a 9 x 13 baking dish, place one layer of lasagna noodles, edges overlapping. Pour chicken and Alfredo sauce mixture over noodle layer and spread evenly. Sprinkle 1 cup of shredded mozzarella over chicken mixture. Top with another layer of noodles. Spread spinach mixture evenly over noodles. Pour 1/2 of remaining jar of Alfredo sauce over spinach mixture, spread evenly. Sprinkle another cup of mozzarella over sauce, lay on the final noodle layer and top with remaining 1/2 jar of Alfredo sauce, 2 cups of mozzarella, and salt and pepper to taste.\nBake 50 to 60 minutes, until top is brown and bubbly.\n",
        "picture_link": "KkPyyzx8sD6l/qFqdgV6Ib8osdRlH8q"
    },
    {
        "title": "Baked Spaghetti Squash with Beef and Veggies",
        "ingredients": [
            "1 spaghetti squash, halved and seeded ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1/2 cup diced green bell pepper ADVERTISEMENT",
            "1/2 cup diced red bell pepper ADVERTISEMENT",
            "1/4 cup diced red onion ADVERTISEMENT",
            "1 clove garlic, chopped ADVERTISEMENT",
            "1 (14.5 ounce) can Italian-style diced tomatoes, drained ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "2 1/4 cups shredded sharp Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nPlace squash on a baking sheet, and bake 40 minutes, or until tender. Remove from heat, cool, and shred pulp with a fork.\nReduce oven temperature to 350 degrees F (175 degrees C). Lightly grease a casserole dish.\nIn a skillet over medium heat, cook the ground beef until evenly brown. Drain, and mix in the green pepper, red pepper, red onion, and garlic. Continue to cook and stir until vegetables are tender.\nMix the shredded squash and tomatoes into the skillet, and season with oregano, basil, salt, and pepper. Cook and stir until heated through. Remove skillet from heat, and mix in 2 cups cheese until melted. Transfer to the prepared casserole dish.\nBake 25 minutes in the preheated oven. Sprinkle with remaining cheese, and continue baking 5 minutes, until cheese is melted.\n",
        "picture_link": "pSXYn1rRmIB86fkgEE1RLllb/Y4608O"
    },
    {
        "title": "Ratatouille Bake",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "5 cloves garlic, minced ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cups peeled and diced eggplant ADVERTISEMENT",
            "2 cups chopped zucchini ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "1 tablespoon dried basil ADVERTISEMENT",
            "1 tablespoon dried parsley ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon black pepper ADVERTISEMENT",
            "1 (8 ounce) package frozen cheese ravioli ADVERTISEMENT",
            "3/4 cup shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C); spray a 2 1/2-quart baking dish with cooking spray.\nHeat the olive oil in a large skillet over medium heat; cook and stir the garlic, onion, and eggplant with the garlic until the vegetables have begun to soften, about 8 minutes. Stir in the zucchini, bell pepper, tomatoes, basil, parsley, salt, and black pepper; bring the mixture to a boil, stirring frequently. Reduce heat to medium-low and simmer until the vegetables are tender, about 20 minutes.\nCook the frozen ravioli as directed on the package; drain. Spread the cooked ravioli in a layer into the bottom of the prepared baking dish; spoon the hot vegetables over the ravioli. Sprinkle with the cheese.\nBake in the preheated oven until the casserole is bubbling and the cheese is melted, about 20 minutes.\n",
        "picture_link": ".35DI9EIdms5fSzRywuZzmnFBxtmx3G"
    },
    {
        "title": "Wisconsin Bratwurst",
        "ingredients": [
            "2 pounds fresh bratwurst sausages ADVERTISEMENT",
            "2 onions, thinly sliced ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "6 (12 fluid ounce) cans or bottles beer ADVERTISEMENT",
            "1 1/2 teaspoons ground black pepper ADVERTISEMENT",
            "10 hoagie rolls ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prick bratwurst with fork to prevent them from exploding as they cook. Place in a large stock pot with the onions, butter, and beer. Place pot over medium heat, and simmer for 15 to 20 minutes.\nPreheat grill for medium-high heat.\nLightly oil grate. Cook bratwurst on preheated grill for 10 to 14 minutes, turning occasionally to brown evenly. Serve hot off the grill with onions on hoagie rolls.\n",
        "picture_link": "ORQVXBBBzqEvuyGTXv0xOShIQ4qquQC"
    },
    {
        "title": "Barbequed Ribs",
        "ingredients": [
            "4 pounds baby back pork ribs ADVERTISEMENT",
            "4 cloves garlic, sliced ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 tablespoon paprika ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "2 teaspoons ground black pepper ADVERTISEMENT",
            "2 teaspoons chili powder ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "1/2 cup dark brown sugar ADVERTISEMENT",
            "1/2 cup cider vinegar ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "1/4 cup chili sauce ADVERTISEMENT",
            "1/4 cup Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "2 tablespoons onion, chopped ADVERTISEMENT",
            "1/2 teaspoon dry mustard ADVERTISEMENT",
            "1 clove crushed garlic ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C). Place ribs on a rack in a shallow roasting pan. Scatter 4 cloves of sliced garlic over ribs. Cover, and bake for 2 1/2 hours. Cool slightly.\nIn a small bowl, mix together white sugar, paprika, salt, black pepper, chili powder, and ground cumin. Rub spices over cooled ribs. Cover, and refrigerate overnight.\nIn a small saucepan, mix together brown sugar, cider vinegar, ketchup, chili sauce, Worcestershire sauce, lemon juice, onion, dry mustard, and 1 clove garlic. Simmer over medium-low heat, uncovered, for 1 hour. Reserve a small amount for basting; the remainder is a dipping sauce.\nPreheat grill for medium heat.\nPlace ribs on grill. Grill, covered, for about 12 minutes, basting with the reserved sauce, until nicely browned and glazed. Serve with remaining sauce for dipping.\n",
        "picture_link": "4Po0on4Q9Tp5X.chXmbI2RyEuZ6/0lO"
    },
    {
        "title": "GA Peach Pound Cake",
        "ingredients": [
            "1 cup butter or margarine, softened ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 cups fresh peaches, pitted and chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Butter a 10 inch tube pan and coat with white sugar.\nIn a large bowl, cream together the butter and sugar until light and fluffy. Add the eggs one at a time, beating well with each addition, then stir in the vanilla. Reserve 1/4 cup of flour for later, and sift together the remaining flour, baking powder and salt. Gradually stir into the creamed mixture. Use the reserved flour to coat the chopped peaches, then fold the floured peaches into the batter. Spread evenly into the prepared pan.\nBake for 60 to 70 minutes in the preheated oven, or until a toothpick inserted into the cake comes out clean. Allow cake to cool in the pan for 10 minutes, before inverting onto a wire rack to cool completely.\n",
        "picture_link": "4aGcaQju384rI206J/i3Gy.s4GcMJge"
    },
    {
        "title": "Chicken Breast Stuffed with Spinach Blue Cheese and Bacon",
        "ingredients": [
            "8 slices bacon ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves - pounded to 1/2 inch thickness ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped spinach, thawed and squeezed dry ADVERTISEMENT",
            "1 cup crumbled blue cheese ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook bacon until crisp. I prefer to use an indoor grill. Bacon can also be cooked in a skillet over medium-high heat, or the microwave at about 1 minute per slice. Drain on paper towels, and set aside.\nPreheat the oven to 350 degrees F (175 degrees C). In a medium bowl, stir together the spinach and blue cheese. Crumble in the bacon, and stir to distribute.\nLay the chicken breast halves out on a clean surface, and distribute the spinach mixture evenly onto the centers of them. Fold the chicken over the filling, and secure with toothpicks. Stir together the flour, salt and pepper on a dinner plate. Roll the chicken in the flour to coat.\nHeat the oil in a skillet over medium-high heat. Quickly brown each piece of chicken on top and bottom. Remove to a lightly greased baking dish, and cover with a lid or aluminum foil.\nBake for 30 minutes in the preheated oven, until chicken juices run clear, and filling is hot.\n",
        "picture_link": "kcWdhMiyhElY.0gKqaOeWwfATaL1KYm"
    },
    {
        "title": "Soft and Chewy Peanut Butter Cookies",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 1/4 cups packed brown sugar ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 cup creamy peanut butter ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C).\nIn a medium bowl, combine flour, soda, and salt. Mix well with a wire whisk set aside.\nIn a large bowl, blend sugars, using an electric mixer set at medium speed. Add butter, and mix to form a grainy paste, scraping the sides of the bowl. Add eggs, peanut butter and vanilla and mix at medium speed until light and fluffy.\nAdd the flour mixture and mix at low speed until just mixed.\nDrop by rounded spoonfuls onto an ungreased cookie sheet. With a wet fork gently press cookies in a crisscrossed pattern. Bake for 18-22 minutes or until slightly brown along edges.\n",
        "picture_link": "krp2EuMqkCFJfRbVo6QeC9kY9Jhx/aW"
    },
    {
        "title": "Tomatillo Salsa Verde",
        "ingredients": [
            "1 pound tomatillos, husked ADVERTISEMENT",
            "1/2 cup finely chopped onion ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1 serrano chile peppers, minced ADVERTISEMENT",
            "2 tablespoons chopped cilantro ADVERTISEMENT",
            "1 tablespoon chopped fresh oregano ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1 1/2 teaspoons salt, or to taste ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place tomatillos, onion, garlic, and chile pepper into a saucepan. Season with cilantro, oregano, cumin, and salt; pour in water. Bring to a boil over high heat, then reduce heat to medium-low, and simmer until the tomatillos are soft, 10 to 15 minutes.\nUsing a blender, carefully puree the tomatillos and water in batches until smooth.\n",
        "picture_link": "rTzs3x77LOQsysgetxC6gzUanIbyxtG"
    },
    {
        "title": "Honey Garlic Ribs",
        "ingredients": [
            "4 pounds pork spareribs ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "1/4 cup distilled white vinegar ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon garlic salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nSlice the ribs into individual pieces. In a large bowl, combine the honey, soy sauce, vinegar, garlic and brown sugar. Stir until honey and sugar are completely dissolved, then stir in the baking soda. The mixture will begin to foam. Transfer ribs to the bowl, and turn to coat.\nCover a cookie sheet with foil, and arrange the ribs meat side up on the sheet. Pour excess sauce over all, and sprinkle with the garlic salt.\nBake for 1 hour, turning every 20 minutes.\n",
        "picture_link": "wOXgnaNMq8P.6vmIklT/kH2/QrkxsL."
    },
    {
        "title": "Easy Fruit Cobbler",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "2 cups sliced fresh peaches ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Melt butter in a 9 x 9 inch baking dish.\nBlend together flour, baking powder, sugar, and milk.\nPour batter in baking dish over the butter. Sprinkle fruit on top of the batter, do not stir. Bake for 1 hour or until golden brown.\n",
        "picture_link": "ZyKx.6vdxvPDXjqCkBPuFoh0xItBC2q"
    },
    {
        "title": "Monster Cookies VI",
        "ingredients": [
            "3 eggs ADVERTISEMENT",
            "1 1/2 cups packed brown sugar ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon corn syrup ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 1/2 cups peanut butter ADVERTISEMENT",
            "4 1/2 cups rolled oats ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "1 cup candy-coated milk chocolate pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a very large bowl, beat the eggs.\nAdd the remaining ingredients in order, mixing well.\nUse an ice cream scoop to put on ungreased cookie sheet. Bake for 12 to 15 minutes.\n",
        "picture_link": "AD15Hk3ExedT.NAX8agGCNUOyDWT.2y"
    },
    {
        "title": "King Ranch Chicken Casserole I",
        "ingredients": [
            "1 (3 pound) chicken, boiled and deboned ADVERTISEMENT",
            "1 (14.5 ounce) package tortilla chips ADVERTISEMENT",
            "1 (10 ounce) can diced tomatoes with green chile peppers ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3 cups shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C.)\nLayer the chips in a 9x13 inch casserole dish.\nCombine the tomatoes, chicken soup, mushroom soup and onion. Pour half of mixture over chips. Layer the chicken pieces, half of the cheese and the remaining soup mixture.\nBake at 300 degrees F (150 degrees C) for 20 minutes. Top with the remaining cheese and return to the oven until the cheese is melted.\n",
        "picture_link": "wBDS0vvfypeSBLoTAr3rFjqJ9NUJBBS"
    },
    {
        "title": "Beer and Brown Sugar Steak Marinade",
        "ingredients": [
            "2 (16 ounce) beef sirloin steaks ADVERTISEMENT",
            "1/4 cup dark beer ADVERTISEMENT",
            "2 tablespoons teriyaki sauce ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1/2 teaspoon seasoned salt ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill for high heat.\nUse a fork to poke holes all over the surface of the steaks, and place steaks in a large baking dish. In a bowl, mix together beer, teriyaki sauce, and brown sugar. Pour sauce over steaks, and let sit about 5 minutes. Sprinkle with 1/2 the seasoned salt, pepper, and garlic powder; set aside for 10 minutes. Turn steaks over, sprinkle with remaining seasoned salt, pepper, and garlic powder, and continue marinating for 10 more minutes.\nRemove steaks from marinade. Pour marinade into a small saucepan, bring to a boil, and cook for several minutes.\nLightly oil the grill grate. Grill steaks for 7 minutes per side, or to desired doneness. During the last few minutes of grilling, baste steaks with boiled marinade to enhance the flavor and ensure juiciness.\n",
        "picture_link": "y08RqZyheh9bsdTzWdxrDn5hZXN0.lO"
    },
    {
        "title": "Eggs Benedict",
        "ingredients": [
            "4 egg yolks ADVERTISEMENT",
            "3 1/2 tablespoons lemon juice ADVERTISEMENT",
            "1 pinch ground white pepper ADVERTISEMENT",
            "1/8 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "1 cup butter, melted ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "8 eggs ADVERTISEMENT",
            "1 teaspoon distilled white vinegar ADVERTISEMENT",
            "8 strips Canadian-style bacon ADVERTISEMENT",
            "4 English muffins, split ADVERTISEMENT",
            "2 tablespoons butter, softened ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To Make Hollandaise: Fill the bottom of a double boiler part-way with water. Make sure that water does not touch the top pan. Bring water to a gentle simmer. In the top of the double boiler, whisk together egg yolks, lemon juice, white pepper, Worcestershire sauce, and 1 tablespoon water.\nAdd the melted butter to egg yolk mixture 1 or 2 tablespoons at a time while whisking yolks constantly. If hollandaise begins to get too thick, add a teaspoon or two of hot water. Continue whisking until all butter is incorporated. Whisk in salt, then remove from heat. Place a lid on pan to keep sauce warm.\nPreheat oven on broiler setting. To Poach Eggs: Fill a large saucepan with 3 inches of water. Bring water to a gentle simmer, then add vinegar. Carefully break eggs into simmering water, and allow to cook for 2 1/2 to 3 minutes. Yolks should still be soft in center. Remove eggs from water with a slotted spoon and set on a warm plate\nWhile eggs are poaching, brown the bacon in a medium skillet over medium-high heat and toast the English muffins on a baking sheet under the broiler.\nSpread toasted muffins with softened butter, and top each one with a slice of bacon, followed by one poached egg. Place 2 muffins on each plate and drizzle with hollandaise sauce. Sprinkle with chopped chives and serve immediately.\n",
        "picture_link": "I89uNgU0E.sHHJez63eWQoJBTs9GGoG"
    },
    {
        "title": "Asiago Sun-Dried Tomato Pasta",
        "ingredients": [
            "2 cups heavy cream ADVERTISEMENT",
            "1 cube chicken bouillon ADVERTISEMENT",
            "1 tablespoon Asiago Cheese ADVERTISEMENT",
            "1 tablespoon cornstarch, mixed with equal parts water ADVERTISEMENT",
            "1 cup chopped sun-dried tomatoes ADVERTISEMENT",
            "1 (16 ounce) package bow tie pasta ADVERTISEMENT",
            "3/4 cup bacon ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 cup diced red onion ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "1 cup chopped green onion ADVERTISEMENT",
            "1 pound grilled skinless, boneless chicken breast, diced ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan over medium heat, cook 2 cups cream until just bubbling. Watch carefully, to ensure that it doesn't boil over. Stir in bouillon and Asiago cheese. Stir with a whisk until dissolved. Add cornstarch mixture, and simmer until sauce is thickened, stirring constantly. Mix in the sun-dried tomatoes. Set aside, or cover and refrigerate for later use.\nBring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain. Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble and set aside.\nMelt butter in a large saucepan over medium heat. Saute red onion until soft and translucent. Stir in garlic and cooked bacon, and cook for 2 minutes. Stir in green onions, chicken and 1 cup cream. Cook, stirring, until cream is heated through. Add Asiago cream sauce, and heat through. Toss with cooked pasta until evenly coated, and sprinkle with chopped parsley.\n",
        "picture_link": "b5KFs.741XnTcwtnCQ157XdReyAzmrO"
    },
    {
        "title": "Chunky Monkey Pancakes",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3/4 cup skim milk ADVERTISEMENT",
            "3 tablespoons butter, melted ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 large banana, diced ADVERTISEMENT",
            "1/2 cup miniature semisweet chocolate chips ADVERTISEMENT",
            "1/4 cup chopped pecans ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine flour, baking powder, baking soda, and salt in a large bowl. Set bowl aside. In a separate bowl, whisk together the skim milk, melted butter, eggs, sugar, and vanilla. Make a well in the center of the dry ingredients and stir in the wet ingredients, being careful not to over mix the batter. Gently fold in the banana, chocolate chips, and nuts.\nHeat a large skillet over medium heat, and coat with cooking spray. Pour 1/4 cupfuls of batter onto the skillet, and cook until bubbles appear on the surface. Flip with a spatula, and cook until browned on the other side.\n",
        "picture_link": "3UEUR1J6itMNps3rYaU004PFYVvh9ZW"
    },
    {
        "title": "Garlic Bread Fantastique",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "2 tablespoons mayonnaise ADVERTISEMENT",
            "1/4 teaspoon sage ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "2 teaspoons dried oregano ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "1 French baguette, halved lengthwise ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to broil.\nIn a medium bowl combine butter, mayonnaise, sage, garlic, oregano, salt and pepper. Spread mixture evenly on bread and sprinkle with Parmesan cheese.\nPlace bread under broil for 5 minutes, or until lightly toasted.\n",
        "picture_link": "YfZbln6sNu1CIG2UP2DVu3RIK1hOYqa"
    },
    {
        "title": "Simple Ranchy Breaded Fish Fillets",
        "ingredients": [
            "3/4 cup Italian seasoned bread crumbs ADVERTISEMENT",
            "1 (1 ounce) package dry Ranch-style dressing mix ADVERTISEMENT",
            "2 1/2 tablespoons vegetable oil ADVERTISEMENT",
            "1 pound tilapia fillets ADVERTISEMENT",
            "2 teaspoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the bread crumbs in a bowl. In a shallow dish, mix the dressing mix and oil to form a paste. Coat the tilapia fillets with the paste, then dredge in the bread crumbs to lightly coat.\nMelt the butter in a skillet over medium heat. Place the fillets in the skillet, and cook 5 minutes on each side, or until golden brown and easily flaked with a fork.\n",
        "picture_link": "sdU7w2vtXsYHtKQ9Sx3u2jOzTZRVnvS"
    },
    {
        "title": "Moroccan-Style Stuffed Acorn Squash",
        "ingredients": [
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1 tablespoon butter, melted ADVERTISEMENT",
            "2 large acorn squash, halved and seeded ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "2 carrots, chopped ADVERTISEMENT",
            "1 cup garbanzo beans, drained ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1 1/2 tablespoons ground cumin ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 (14 ounce) can chicken broth ADVERTISEMENT",
            "1 cup uncooked couscous ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nArrange squash halves cut side down on a baking sheet. Bake 30 minutes, or until tender. Dissolve the sugar in the melted butter. Brush squash with the butter mixture, and keep squash warm while preparing the stuffing.\nHeat the olive oil in a skillet over medium heat. Stir in the garlic, celery, and carrots, and cook 5 minutes. Mix in the garbanzo beans and raisins. Season with cumin, salt, and pepper, and continue to cook and stir until vegetables are tender.\nPour the chicken broth into the skillet, and mix in the couscous. Cover skillet, and turn off heat. Allow couscous to absorb liquid for 5 minutes. Stuff squash halves with the skillet mixture to serve.\n",
        "picture_link": "YpUWQ5ZU6Ff1SIyabofi3Rttk1DiQDG"
    },
    {
        "title": "Roasted Chickpeas",
        "ingredients": [
            "1 (12 ounce) can chickpeas (garbanzo beans), drained ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "salt (optional) ADVERTISEMENT",
            "garlic salt (optional) ADVERTISEMENT",
            "cayenne pepper (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nBlot chickpeas with a paper towel to dry them. In a bowl, toss chickpeas with olive oil, and season to taste with salt, garlic salt, and cayenne pepper, if using. Spread on a baking sheet, and bake for 30 to 40 minutes, until browned and crunchy. Watch carefully the last few minutes to avoid burning.\n",
        "picture_link": "GHOAKVzuKAvN8Z8cUEYMqZNrAs31c8W"
    },
    {
        "title": "Mom's Baked Macaroni and Cheese",
        "ingredients": [
            "1 (16 ounce) package macaroni ADVERTISEMENT",
            "1 (10.75 ounce) can condensed Cheddar cheese soup ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 pound shredded Colby cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nPlace macaroni in a 2 quart casserole dish. Stir in cheese soup and milk until well combined. Sprinkle with shredded Colby.\nBake 25 to 30 minutes, or until cheese is brown and bubbly.\n",
        "picture_link": "1F2kzBhAxLeJNnrVqwPS5hHNEg4r5cC"
    },
    {
        "title": "Parmesan Crusted Tilapia Fillets",
        "ingredients": [
            "3/4 cup grated Parmesan cheese ADVERTISEMENT",
            "2 teaspoons paprika ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "4 tilapia fillets ADVERTISEMENT",
            "olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil.\nWhisk Parmesan cheese, paprika, parsley, salt, and pepper together in a shallow dish.\nCoat tilapia fillets with olive oil and press into the Parmesan cheese mixture. Arrange coated fillets on the prepared baking sheet.\nBake in preheated oven until the fish flakes easily with a fork, 10 to 12 minutes.\n",
        "picture_link": "r.EK.b4asABmvFMLDGmuPwrVS6y/AFm"
    },
    {
        "title": "Garlic Mashed Cauliflower",
        "ingredients": [
            "1 head cauliflower, cut into florets ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 clove garlic, smashed ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1 tablespoon reduced-fat cream cheese ADVERTISEMENT",
            "1/2 teaspoon kosher salt ADVERTISEMENT",
            "1/8 teaspoon freshly ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add cauliflower, cover, and steam until tender, about 10 minutes.\nMeanwhile, heat olive oil in a small skillet over medium heat; cook and stir garlic until softened, about 2 minutes. Remove from heat.\nTransfer half the cauliflower to a food processor; cover and blend on high. Add remaining cauliflower florets, one at a time, until vegetables are creamy. Blend in garlic, Parmesan cheese, cream cheese, salt, and black pepper.\n",
        "picture_link": "9LbLgDaTHKa12122i5d0yVK5.PsxG8G"
    },
    {
        "title": "Easy Grilled Chicken Teriyaki",
        "ingredients": [
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 cup teriyaki sauce ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "2 teaspoons minced fresh garlic ADVERTISEMENT",
            "2 teaspoons sesame oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken, teriyaki sauce, lemon juice, garlic, and sesame oil in a large resealable plastic bag. Seal bag, and shake to coat. Place in refrigerator for 24 hours, turning every so often.\nPreheat grill for high heat.\nLightly oil the grill grate. Remove chicken from bag, discarding any remaining marinade. Grill for 6 to 8 minutes each side, or until juices run clear when chicken is pierced with a fork.\n",
        "picture_link": "i5nvl20TNkKJT3GWvZfpEAOGI08Tf8S"
    },
    {
        "title": "Fast Chicken Soup Base",
        "ingredients": [
            "2 quarts chicken broth ADVERTISEMENT",
            "1 quart water ADVERTISEMENT",
            "1 store-bought roast chicken ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "2 large onions, cut into medium dice ADVERTISEMENT",
            "2 large carrots, peeled and cut into rounds or half rounds, depending on size ADVERTISEMENT",
            "2 large stalks celery, sliced 1/4 inch thick ADVERTISEMENT",
            "1 teaspoon dried thyme leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring broth and water to a simmer over medium-high heat in a large soup kettle. Meanwhile, separate chicken meat from skin and bones; reserve meat. Add skin and bones to the simmering broth. Reduce heat to low, partially cover and simmer until bones release their flavor, 20 to 30 minutes.\nStrain broth through a colander into a large container; reserve broth and discard skin and bones. Return kettle to burner set on medium-high.\nAdd oil, then onions, carrots and celery. Saute until soft, about 8 to 10 minutes. Add chicken, broth and thyme. Bring to a simmer. (Can be refrigerated up to 3 days in advance. Return to a simmer before adding the extras of your choice.)\n",
        "picture_link": "Uep1Ug7fl9xTwlUd23yWTsJ8hW6MYFC"
    },
    {
        "title": "Tex-Mex Burger with Cajun Mayo",
        "ingredients": [
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1 teaspoon Cajun seasoning ADVERTISEMENT",
            "1 1/3 pounds ground beef sirloin ADVERTISEMENT",
            "1 jalapeno pepper, seeded and chopped ADVERTISEMENT",
            "1/2 cup diced white onion ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 tablespoon Cajun seasoning ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "4 slices pepperjack cheese ADVERTISEMENT",
            "4 hamburger buns, split ADVERTISEMENT",
            "4 leaves lettuce ADVERTISEMENT",
            "4 slices tomato ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill for medium-high heat. In a small bowl, mix together the mayonnaise and 1 teaspoon of Cajun seasoning. Set aside.\nIn a large bowl, mix together the ground sirloin, jalapeno pepper, onion, garlic, 1 tablespoon Cajun seasoning, and Worcestershire sauce using your hands. Divide into 4 balls, and flatten into patties.\nLightly oil the grilling surface, and place the patties on the grill. Cook for about 5 minutes per side, or until well done. During the last 2 minutes, lay a slice of cheese on top of each patty. Spread the seasoned mayonnaise onto the insides of the buns. Put burgers in the buns, and top with lettuce and tomato to serve.\n",
        "picture_link": "DZhEAd8kXhOICE3O04Hcej6ZsMjGbba"
    },
    {
        "title": "Microwave Caramel Popcorn",
        "ingredients": [
            "4 quarts popped popcorn ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1/2 cup margarine ADVERTISEMENT",
            "1/4 cup light corn syrup ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the popped popcorn into a large brown paper bag. Set aside.\nIn a 2 quart casserole dish, or other heat-proof glass dish, combine the brown sugar, margarine, corn syrup, salt and vanilla. Heat for 3 minutes in the microwave, then take out and stir until well blended. Return to the microwave, and cook for 1 1/2 minutes. Remove from microwave, and stir in the baking soda.\nPour syrup over the popcorn in the bag. Roll down the top once or twice to close the bag, and shake to coat the corn. Place bag into the microwave, and cook for 1 minute and 10 seconds. Remove, shake, flip the bag over, and return it to the microwave. Cook for another 1 minute and 10 seconds. Dump the popcorn out onto waxed paper, and let cool until coating is set. Store in an airtight container.\n",
        "picture_link": "YnXWxH4f1ROW5dBlcg4hxD.8n9KL7da"
    },
    {
        "title": "African Peanut Soup",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 medium onions, chopped ADVERTISEMENT",
            "2 large red bell peppers, chopped ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 (28 ounce) can crushed tomatoes, with liquid ADVERTISEMENT",
            "8 cups vegetable broth or stock ADVERTISEMENT",
            "1/4 teaspoon pepper ADVERTISEMENT",
            "1/4 teaspoon chili powder (optional) ADVERTISEMENT",
            "2/3 cup extra crunchy peanut butter ADVERTISEMENT",
            "1/2 cup uncooked brown rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large stock pot over medium high heat. Cook onions and bell peppers until lightly browned and tender, stirring in garlic when almost done to prevent burning. Stir in tomatoes, vegetable stock, pepper, and chili powder. Reduce heat to low and simmer, uncovered, for 30 minutes.\nStir in rice, cover, and simmer another fifteen minutes or until rice is tender. Stir in peanut butter until well blended, and serve.\n",
        "picture_link": "K8D7mmIgDlmUuWVt7Hb4l.MKxWz3QqO"
    },
    {
        "title": "Slow Cooker Swiss Steak",
        "ingredients": [
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 1/2 pounds round steak, cut into small pieces ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "3 stalks celery, chopped ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3 carrots, shredded ADVERTISEMENT",
            "2 (14.5 ounce) cans diced tomatoes with juice ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "2 tablespoons brown sugar, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a shallow bowl, mix the flour, salt, and pepper. Lightly coat the round steak pieces in the flour mixture.\nHeat the oil in a skillet over medium heat, and saute the celery, onion, and carrots about 5 minutes, until tender. Remove from heat, and set aside. Mix in the round steak pieces, and cook until lightly browned.\nPlace the vegetables and steak in a slow cooker. Mix in the tomatoes with juice, Worcestershire sauce, and brown sugar.\nCover, and cook 8 to 10 hours on Low, until the round steak is very tender.\n",
        "picture_link": "eBeAbp3JRwIIBdumJtdSfA4bGDsP0EC"
    },
    {
        "title": "Authentic Mexican Tortillas",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "3/4 cup shortening ADVERTISEMENT",
            "3/4 cup hot water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the flour, baking powder, and salt. Either by hand or with a pastry cutter, cut in the shortening till the mixture is crumbly. If the mixture looks more floury than crumbly, be sure to add just one or two more tablespoons of shortening till it is crumbly. Add about 3/4 cup hot water to the mixture, or just enough to make the ingredients look moist.\nWith your hand or a large fork, knead the mixture making sure to rub the dough against the sides of the large mixing bowl to gather any clinging dough. If the dough still sticks to the side of the bowl, add a couple more tablespoons of flour until the dough forms a soft round shape. The dough is ready to roll out now, but it is best to let it rest. Cover it with a dish towel, and let it sit for about an hour or so.\nTake the dough, and pull it apart into 10 to 12 balls. Lightly flour your rolling area, and roll each ball with a rolling pin to about 1/8 inch thickness.\nPlace each tortilla on a medium hot cast iron skillet. Cook for about 1 to 2 minutes on each side, or until the tortilla does not look doughy.\n",
        "picture_link": "0qIKHbaZn951JB5.EV2acchGqdaNrBC"
    },
    {
        "title": "Sally's Spinach Mashed Potatoes",
        "ingredients": [
            "1 (10 ounce) package frozen chopped spinach ADVERTISEMENT",
            "6 potatoes, peeled and chopped ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 tablespoon chopped onion ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon dried dill weed ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a medium casserole dish.\nCook spinach according to package directions. Place potatoes in a pot with enough water to cover, and bring to a boil. Cook 15 minutes, or until tender but firm. Drain, cool slightly, and mash.\nIn a bowl, mix the spinach, mashed potatoes, butter, sour cream, onion, salt, and dill. Transfer to the prepared casserole dish. Top with Cheddar cheese.\nBake 20 minutes in the preheated oven, until bubbly and lightly brown.\n",
        "picture_link": "yXBzN3wyzhqW8PZG5lbRIwMxC4rcY.m"
    },
    {
        "title": "Butter Beef",
        "ingredients": [
            "3 pounds cubed beef stew meat ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 (1 ounce) envelope dry onion soup mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the beef and butter into a slow cooker. Sprinkle the onion soup mix over. Cover, and cook on Low for 8 hours, or High for 4 to 5 hours. Stir once or twice.\n",
        "picture_link": "13VPy7sJmXeswmdP4x5fI2qK7OuP6Fm"
    },
    {
        "title": "Hot Tamale Pie",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "2 pounds ground beef ADVERTISEMENT",
            "2 cups diced poblano peppers ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 (16 ounce) jar salsa ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon ground dried chipotle pepper ADVERTISEMENT",
            "2 (8.5 ounce) boxes dry corn muffin mix (such as Jiffy®) ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2/3 cup milk, divided ADVERTISEMENT",
            "4 ounces shredded Cheddar cheese, divided ADVERTISEMENT",
            "4 ounces shredded Monterey Jack cheese, divided ADVERTISEMENT",
            "8 ounces frozen corn, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nSpray a 9x13-inch casserole dish with cooking spray.\nCook and stir ground beef in a Dutch oven over medium-high heat until meat starts to brown and release juices, about 5 minutes.\nReduce heat to medium and stir in poblano peppers, salt, salsa, oregano, and chipotle powder; cook and stir until seasoned beef is crumbly and no longer pink, about 10 minutes.\nMix one package of corn muffin mix in a large bowl with 1 egg and 1/3 cup of milk. Whisk to combine. In a separate large bowl, mix the second package of corn muffin mix with 1 egg, 1/3 cup of milk and half the Cheddar and Monterey Jack cheeses.\nSpread the prepared corn muffin mixture without cheese into the prepared baking dish. Sprinkle corn over the muffin mix, followed by remaining half of the cheeses, then the beef mixture.\nSpoon the corn muffin mix with cheese on top of the beef and carefully spread over the top with a fork, leaving about half an inch from the edges of the pan.\nBake in the preheated oven for 50-60 minutes, until golden brown.\n",
        "picture_link": "7L9x3q4wzW74m8YNhThM7yHQk5FRsoi"
    },
    {
        "title": "Four Cheese Margherita Pizza",
        "ingredients": [
            "1/4 cup olive oil ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1/2 teaspoon sea salt ADVERTISEMENT",
            "8 Roma tomatoes, sliced ADVERTISEMENT",
            "2 (12 inch) pre-baked pizza crusts ADVERTISEMENT",
            "8 ounces shredded Mozzarella cheese ADVERTISEMENT",
            "4 ounces shredded Fontina cheese ADVERTISEMENT",
            "10 fresh basil leaves, washed, dried ADVERTISEMENT",
            "1/2 cup freshly grated Parmesan cheese ADVERTISEMENT",
            "1/2 cup crumbled feta cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together olive oil, garlic, and salt; toss with tomatoes, and allow to stand for 15 minutes. Preheat oven to 400 degrees F (200 degrees C).\nBrush each pizza crust with some of the tomato marinade. Sprinkle the pizzas evenly with Mozzarella and Fontina cheeses. Arrange tomatoes overtop, then sprinkle with shredded basil, Parmesan, and feta cheese.\nBake in preheated oven until the cheese is bubbly and golden brown, about 10 minutes.\n",
        "picture_link": "ZCeAlw/wZQISwseTU3gWnzHgYdrzPHu"
    },
    {
        "title": "Chef John's Sausage & Shrimp Jambalaya",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "8 ounces andouille sausage, cut into 1/4-inch slices ADVERTISEMENT",
            "2 tablespoons ground paprika ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "1/2 cup diced tomatoes ADVERTISEMENT",
            "1 large green bell pepper, diced ADVERTISEMENT",
            "2 stalks celery, sliced 1/4 inch thick ADVERTISEMENT",
            "4 green onions, thinly sliced ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1 cup uncooked brown rice ADVERTISEMENT",
            "3 cups chicken stock ADVERTISEMENT",
            "1 pound large shrimp, peeled and deveined ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place butter and sausage in a large stockpot over medium heat; cook and stir for 5-6 minutes until sausage begins to brown.\nStir in paprika, cumin and cayenne; cook for 1 minute.\nStir tomatoes, onions, celery, green pepper, green onions, salt, and bay leaf into sausage mixture.\nAdd brown rice and stir to combine. Stir in chicken stock and turn heat to low. Cover and cook for until rice is just tender, about 45 minutes.\nStir in shrimp, replace lid and cook for 5 minutes. Season with salt and black pepper.\n",
        "picture_link": "pz5pedvCNN4SLDOjL4F/xvfPpnHmC9S"
    },
    {
        "title": "Sausage Jalapeno Poppers",
        "ingredients": [
            "2 (12 ounce) packages ground sausage ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "30 jalapeno chile peppers ADVERTISEMENT",
            "1 pound sliced bacon, cut in half ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nPlace ground sausage in a large, deep skillet. Cook over medium high heat until evenly brown.\nDrain sausage and place in a medium bowl. Mix with the cream cheese.\nCut jalapenos in half lengthwise. Remove the seeds. Stuff each jalapeno half with equal portions of the sausage and cream cheese mixture. Wrap with half slices of bacon. Secure bacon with toothpicks.\nArrange wrapped jalapenos in a large, shallow baking dish. Bake in the preheated oven 20 minutes, or until the bacon is evenly brown.\n",
        "picture_link": "bOVaRRtSjvSDhHvyk2IznrYf05eke5m"
    },
    {
        "title": "Kabob Marinade",
        "ingredients": [
            "1 cup vegetable oil ADVERTISEMENT",
            "3/4 cup soy sauce ADVERTISEMENT",
            "1/2 cup lemon juice ADVERTISEMENT",
            "1/4 cup Worcestershire sauce ADVERTISEMENT",
            "1/4 cup prepared mustard ADVERTISEMENT",
            "1 1/2 teaspoons coarsely cracked black pepper ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon meat tenderizer (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large resealable plastic bag, combine the oil, soy sauce, lemon juice, Worcestershire sauce, mustard, ground black pepper, garlic, and meat tenderizer. Mix well, and add your favorite meat. Seal the bag, and marinate in the refrigerator for 4 to 24 hours.\n",
        "picture_link": "dsxHt0d1c1jFZYVtePH2Po1o7VzST6K"
    },
    {
        "title": "Best Ziti Ever",
        "ingredients": [
            "1 (16 ounce) package ziti pasta ADVERTISEMENT",
            "1 pound mild Italian sausage, casings removed ADVERTISEMENT",
            "2 (24 ounce) jars marinara sauce ADVERTISEMENT",
            "1 1/2 teaspoons dried basil, divided ADVERTISEMENT",
            "12 ounces ricotta cheese ADVERTISEMENT",
            "1 1/2 teaspoons Italian seasoning, divided ADVERTISEMENT",
            "1 dash salt and pepper ADVERTISEMENT",
            "1 pound mozzarella cheese, shredded ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nPlace sausage in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble and set aside. In a large saucepan, heat marinara with 1 teaspoon basil until bubbling. In a medium bowl, mix together ricotta, 1 teaspoon Italian seasoning, salt and pepper.\nSpread bottom of a 9x13 inch baking dish with sauce. Layer 1/2 of the ziti, 1/2, the sausage, 1/2 of the ricotta, and 1/2 the mozzarella. Spoon half of the sauce over top. Repeat layers. Sprinkle top with remaining 1/2 teaspoons basil and Italian seasoning.\nBake in preheated oven for 40 to 45 minutes.\n",
        "picture_link": "2PYbWBw4fr6JSl6ZVX2hycWeqC/t3kC"
    },
    {
        "title": "Allie's Delicious Macaroni and Cheese",
        "ingredients": [
            "1 (8 ounce) package elbow macaroni ADVERTISEMENT",
            "5 tablespoons butter ADVERTISEMENT",
            "5 tablespoons all-purpose flour ADVERTISEMENT",
            "1 quart warm milk (110 degrees F/45 degrees C) ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "1/4 pound cubed ham ADVERTISEMENT",
            "5 ounces cubed Cheddar cheese ADVERTISEMENT",
            "5 ounces mozzarella cheese, cubed ADVERTISEMENT",
            "5 ounces Monterey Jack cheese, cubed ADVERTISEMENT",
            "paprika to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9 x 13 baking dish. Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nIn medium saucepan, melt butter and stir in flour to make a roux. Cook 1 to 2 minutes, stirring constantly, then whisk in warm milk a little at a time to make a white sauce. Bring to a boil, then reduce heat and simmer. Mix in salt, pepper, and cayenne, and stir frequently until sauce thickens.\nRemove pan from heat and stir in cheddar, mozzarella, jack and ham. Combine pasta with sauce and stir well. Pour into baking dish. Use paprika to make a decorative pattern on top. Bake 45 to 60 minutes, or until top is the desired crispiness. Let rest 20 minutes before serving.\n",
        "picture_link": "SWpprqMKCe0aSwbSyPoP2wf84rZ1Yd6"
    },
    {
        "title": "Sweet Green Bean Bundles",
        "ingredients": [
            "3 (14.5 ounce) cans whole green beans, drained ADVERTISEMENT",
            "1 pound bacon, cut in half ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1 teaspoon garlic salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking dish.\nWrap 7 green beans with bacon and place in prepared dish. Repeat, using all the green beans and bacon.\nCombine butter with brown sugar. Pour over green bean bundles and sprinkle with garlic salt.\nCover with foil and bake for 45 minutes.\n",
        "picture_link": "RC1lNuzLkUZLltX2oYfiQsUA103Ckdq"
    },
    {
        "title": "Southern Fried Cabbage",
        "ingredients": [
            "3 slices bacon, cut into thirds ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1 teaspoon salt, or to taste ADVERTISEMENT",
            "1 teaspoon ground black pepper, or to taste ADVERTISEMENT",
            "1 head cabbage, cored and sliced ADVERTISEMENT",
            "1 white onion, chopped ADVERTISEMENT",
            "1 pinch white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the bacon and vegetable oil into a large pot over medium heat. Season with salt and pepper. Cook for about 5 minutes, or until bacon is crisp. Add cabbage, onion, and sugar to the pot; cook and stir continuously for 5 minutes, until tender.\n",
        "picture_link": "igt1AxDkyjqprthOiFY8oZWhFUpLphG"
    },
    {
        "title": "Baked Tofu Bites",
        "ingredients": [
            "1 (16 ounce) package extra firm tofu ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "2 tablespoons maple syrup ADVERTISEMENT",
            "2 tablespoons ketchup ADVERTISEMENT",
            "1 tablespoon vinegar ADVERTISEMENT",
            "1 dash hot sauce ADVERTISEMENT",
            "1 tablespoon sesame seeds ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon liquid smoke flavoring ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lightly spray a non-stick baking sheet with oil.\nSlice tofu into 1/2-inch slices, and gently press excess water out of tofu. Cut sliced tofu into 1/2-inch cubes.\nIn a bowl, stir together the soy sauce, maple syrup, ketchup, vinegar, and hot sauce. Stir in sesame seeds, garlic powder, black pepper, and liquid smoke. Gently stir tofu cubes into sauce. Cover, and marinate at least 5 minutes.\nPlace the tofu on the baking sheet in a single layer. Bake in a preheated oven for 15 minutes. Turn tofu, and bake until the tofu turns golden brown, about 15 minutes more.\n",
        "picture_link": "X8uQRPE3uV59z4r6dLoGLXhTRb1QIlS"
    },
    {
        "title": "San Francisco Sourdough Bread",
        "ingredients": [
            "4 3/4 cups bread flour ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "2 1/2 teaspoons salt ADVERTISEMENT",
            "1 (.25 ounce) package active dry yeast ADVERTISEMENT",
            "1 cup warm milk ADVERTISEMENT",
            "2 tablespoons margarine, softened ADVERTISEMENT",
            "1 1/2 cups sourdough starter ADVERTISEMENT",
            "1 extra large egg ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine 1 cup flour, sugar, salt, and dry yeast. Add milk and softened butter or margarine. Stir in starter. Mix in up to 3 3/4 cups flour gradually, you may need more depending on your climate.\nTurn dough out onto a floured surface, and knead for 8 to 10 minutes. Place in a greased bowl, turn once to oil surface, and cover. Allow to rise for 1 hour, or until doubled in volume.\nPunch down, and let rest 15 minutes. Shape into loaves. Place on a greased baking pan. Allow to rise for 1 hour, or until doubled.\nBrush egg wash over tops of loaves, and sprinkle with chopped onion.\nBake at 375 degrees F (190 degrees C) for 30 minutes, or till done.\n",
        "picture_link": "D5Gc90wibVml6K7hIw.d/b9.vwGYG7a"
    },
    {
        "title": "Chocolate Bar Fondue",
        "ingredients": [
            "32 ounces milk chocolate, grated ADVERTISEMENT",
            "1 1/4 cups heavy cream ADVERTISEMENT",
            "1 tablespoon instant coffee powder ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/3 cup hot water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan over medium heat, melt the chocolate with the heavy cream. Mix in the instant coffee, vanilla extract, sugar, and hot water. Continue to heat, stirring frequently, until the mixture is smooth.\n",
        "picture_link": "fSigZSXJJhWfDyD22wewjoZB/aKDPhK"
    },
    {
        "title": "Mom's Best Waffles",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, stir together flour, baking powder, sugar and salt. Add milk, eggs and oil; mix well.\nSpray preheated waffle iron with non-stick cooking spray. Pour mix onto hot waffle iron. Cook until golden brown.\n",
        "picture_link": "dKDej32w3RxoIa8mm4z.ZXiM2PHy0kK"
    },
    {
        "title": "Baked Denver Omelet",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "1/2 green bell pepper, chopped ADVERTISEMENT",
            "1 cup chopped cooked ham ADVERTISEMENT",
            "8 eggs ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease a 10-inch round baking dish.\nMelt butter in a large skillet over medium heat; cook and stir onion and bell pepper until softened, about 5 minutes. Stir in ham and continue cooking until heated through, 5 minutes more.\nBeat eggs and milk in a large bowl. Stir in Cheddar cheese and ham mixture; season with salt and black pepper. Pour mixture into prepared baking dish.\nBake in preheated oven until eggs are browned and puffy, about 25 minutes. Serve warm.\n",
        "picture_link": "sar7Eqo7to70AcCKnp4MvJK6bJ6mBi2"
    },
    {
        "title": "Easy Roasted Pork",
        "ingredients": [
            "2/3 cup packed light brown sugar ADVERTISEMENT",
            "1/4 cup cinnamon applesauce ADVERTISEMENT",
            "1 1/2 teaspoons ground ginger ADVERTISEMENT",
            "2 pounds boneless pork loin roast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Lightly flour an oven bag.\nIn a small bowl, blend brown sugar, applesauce, and ginger.\nPlace pork roast in the prepared oven bag. Pour the brown sugar mixture over the roast. Seal bag, and cut several small slits in the top.\nCook the roast 1 hour in the preheated oven, or until the internal temperature has reached 145 degrees F (63 degrees C).\n",
        "picture_link": "b3WnKUJqfXQZ7uF9HuD0dZ9SZWqHxLm"
    },
    {
        "title": "Self-Filled Cupcakes I",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "1 (18.25 ounce) package chocolate cake mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C), or to the temperature recommended on the cake mix package.\nPrepare chocolate cake mix according to package directions, but do not bake. In separate bowl cream together cream cheese and sugar until smooth. Beat in the egg until well blended, then stir in chocolate chips.\nLine cupcake tins with cupcake papers. Fill 2/3 full with chocolate cake batter. Add 1 teaspoon cream cheese mixture to the center, and top with more cake batter.\nBake according to package directions for cupcakes. Cool and frost with chocolate or cream cheese frosting.\n",
        "picture_link": "tMXLtOjahBPh8ltq.2uuBliCyR/iK.S"
    },
    {
        "title": "Easy Red Beans and Rice",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "1 cup uncooked rice ADVERTISEMENT",
            "1 (16 ounce) package turkey kielbasa, cut diagonally into 1/4 inch slices ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 clove chopped garlic ADVERTISEMENT",
            "2 (15 ounce) cans canned kidney beans, drained ADVERTISEMENT",
            "1 (16 ounce) can whole peeled tomatoes, chopped ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1/2 teaspoon pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan, bring water to a boil. Add rice and stir. Reduce heat, cover and simmer for 20 minutes.\nIn a large skillet over low heat, cook sausage for 5 minutes. Stir in onion, green pepper and garlic; saute until tender. Pour in beans and tomatoes with juice. Season with oregano, salt and pepper. Simmer uncovered for 20 minutes. Serve over rice.\n",
        "picture_link": "GH6Rlq8cBosWk0vZ51iOfqGau/CwT4q"
    },
    {
        "title": "Busy Day Barbeque Brisket",
        "ingredients": [
            "1 tablespoon dried thyme leaves ADVERTISEMENT",
            "1 tablespoon paprika ADVERTISEMENT",
            "2 teaspoons freshly ground black pepper ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "3 pounds beef brisket, trimmed of fat ADVERTISEMENT",
            "1/2 teaspoon liquid smoke flavoring ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1 1/2 cups barbeque sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine thyme, paprika, pepper, salt, onion powder, garlic powder, cayenne, and cumin in a small bowl; set aside. Rub brisket all over with liquid smoke, then rub with spice mixture.\nPour Worcestershire and barbeque sauces into a slow cooker; place beef on top. Cover, and cook on LOW 8 to 10 hours, until fork tender.\n",
        "picture_link": "OZHsrZ84Nm/LQrEiRfoStNP9kLXLN1."
    },
    {
        "title": "Deviled Eggs I",
        "ingredients": [
            "6 eggs ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "2 tablespoons mayonnaise ADVERTISEMENT",
            "1/2 teaspoon mustard powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place eggs in a pot of salted water. Bring the water to a boil, and let eggs cook in boiling water until they are hard boiled, approximately 10 to 15 minutes. Drain eggs, and let cool.\nCut eggs in half, lengthwise. Remove the egg yolks and mash them together in a small mixing bowl. Mix in the paprika, mayonnaise, and dry mustard. Spoon mixture into the egg whites; cool and serve.\n",
        "picture_link": "XQI4sGw35Afp7luumG7P71mQsmr2wvy"
    },
    {
        "title": "Vegetarian Kale Soup",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 yellow onion, chopped ADVERTISEMENT",
            "2 tablespoons chopped garlic ADVERTISEMENT",
            "1 bunch kale, stems removed and leaves chopped ADVERTISEMENT",
            "8 cups water ADVERTISEMENT",
            "6 cubes vegetable bouillon (such as Knorr) ADVERTISEMENT",
            "1 (15 ounce) can diced tomatoes ADVERTISEMENT",
            "6 white potatoes, peeled and cubed ADVERTISEMENT",
            "2 (15 ounce) cans cannellini beans (drained if desired) ADVERTISEMENT",
            "1 tablespoon Italian seasoning ADVERTISEMENT",
            "2 tablespoons dried parsley ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large soup pot; cook the onion and garlic until soft. Stir in the kale and cook until wilted, about 2 minutes. Stir in the water, vegetable bouillon, tomatoes, potatoes, beans, Italian seasoning, and parsley. Simmer soup on medium heat for 25 minutes, or until potatoes are cooked through. Season with salt and pepper to taste.\n",
        "picture_link": "vyeGgr0.tFOnkxz1.y7CFf2ff4nukcO"
    },
    {
        "title": "Apple Raisin French Toast Strata",
        "ingredients": [
            "1 (1 pound) loaf cinnamon raisin bread, cubed ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, diced ADVERTISEMENT",
            "1 cup diced peeled apples ADVERTISEMENT",
            "8 eggs ADVERTISEMENT",
            "2 1/2 cups half-and-half cream ADVERTISEMENT",
            "6 tablespoons butter, melted ADVERTISEMENT",
            "1/4 cup maple syrup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Coat a 9x13 inch baking dish with cooking spray. Arrange 1/2 of the cubed raisin bread in the bottom of the dish. Sprinkle the cream cheese evenly over the bread, and top with the apples. If you like extra raisins, add them now. Top with remaining bread.\nIn a large bowl, beat the eggs with the cream, butter, and maple syrup. Pour over the bread mixture. Cover with plastic wrap, and press down so that all bread pieces are soaked. Refrigerate at least 2 hours.\nPreheat oven to 325 degrees F (165 degrees C).\nBake 45 minutes in the preheated oven. Let stand for 10 minutes before serving.\n",
        "picture_link": "b8aCHG0cZsjhIRBNVm0wEXyLmxewTN6"
    },
    {
        "title": "Dave's Low Country Boil",
        "ingredients": [
            "1 tablespoon seafood seasoning (such as Old Bay®), or to taste ADVERTISEMENT",
            "5 pounds new potatoes ADVERTISEMENT",
            "3 (16 ounce) packages cooked kielbasa sausage, cut into 1 inch pieces ADVERTISEMENT",
            "8 ears fresh corn, husks and silks removed ADVERTISEMENT",
            "5 pounds whole crab, broken into pieces ADVERTISEMENT",
            "4 pounds fresh shrimp, peeled and deveined ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large pot of water over an outdoor cooker, or medium-high heat indoors. Add Old Bay Seasoning to taste, and bring to a boil. Add potatoes, and sausage, and cook for about 10 minutes. Add the corn and crab; cook for another 5 minutes, then add the shrimp when everything else is almost done, and cook for another 3 or 4 minutes.\nDrain off the water and pour the contents out onto a picnic table covered with newspaper. Grab a paper plate and a beer and enjoy!\n",
        "picture_link": "kfQOwUX76UoogawgLkwx7kGaFpQ1pcu"
    },
    {
        "title": "Shrimp Fried Rice II",
        "ingredients": [
            "1 1/2 cups uncooked white rice ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "4 tablespoons vegetable oil ADVERTISEMENT",
            "1 cup fresh bean sprouts ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1 1/2 cups cooked medium shrimp, peeled and deveined without tail ADVERTISEMENT",
            "1/4 cup chopped green onion ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "4 tablespoons soy sauce ADVERTISEMENT",
            "1/4 teaspoon sesame oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan bring water to a boil. Add rice and stir. Reduce heat, cover and simmer for 20 minutes. Set aside and allow rice to cool.\nHeat a large skillet or wok for 2 minutes. When the skillet or wok is hot, pour in vegetable oil, bean sprouts and onions. Mix well and cook for 3 minutes.\nMix in cooled rice and shrimp and cook for another 3 minutes. Stirring constantly.\nMix in green onions, eggs, salt, pepper, soy sauce and sesame oil. Cook for another 4 minutes, stirring continuously, until eggs are cooked and everything is blended evenly.\n",
        "picture_link": "vu1/DFS6YVQ.9tis1gtStW6nTLbkBDO"
    },
    {
        "title": "Cranberry and Cilantro Quinoa Salad",
        "ingredients": [
            "1 1/2 cups water ADVERTISEMENT",
            "1 cup uncooked quinoa, rinsed ADVERTISEMENT",
            "1/4 cup red bell pepper, chopped ADVERTISEMENT",
            "1/4 cup yellow bell pepper, chopped ADVERTISEMENT",
            "1 small red onion, finely chopped ADVERTISEMENT",
            "1 1/2 teaspoons curry powder ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "1/4 cup toasted sliced almonds ADVERTISEMENT",
            "1/2 cup minced carrots ADVERTISEMENT",
            "1/2 cup dried cranberries ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the water into a saucepan, and cover with a lid. Bring to a boil over high heat, then pour in the quinoa, recover, and continue to simmer over low heat until the water has been absorbed, 15 to 20 minutes. Scrape into a mixing bowl, and chill in the refrigerator until cold.\nOnce cold, stir in the red bell pepper, yellow bell pepper, red onion, curry powder, cilantro, lime juice, sliced almonds, carrots, and cranberries. Season to taste with salt and pepper. Chill before serving.\n",
        "picture_link": "m6nL8l0f7HTq7zKTcX3bwYC4gl29yU2"
    },
    {
        "title": "Empanadas",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 (3 ounce) package cream cheese ADVERTISEMENT",
            "1 cup sifted all-purpose flour ADVERTISEMENT",
            "1 cup fruit preserves ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "DAY BEFORE: Cream butter and cream cheese together until smoothly blended. Beat in the flour. Shape dough into a smooth ball, wrap in foil or cling wrap, and refrigerate overnight or up to a week.\nAT BAKING TIME: Remove dough from refrigerator 30 minutes before using. Start heating oven to 375 degrees F (190 degrees C).\nRoll chilled dough thin. Cut with 3 or 4 inch round cookie cutter. Place small spoonful of jam in center of each round, moisten edges with water.\nFold round over and press edges together. Bake on ungreased cookie sheet 15 to 20 minutes. Immediately roll in sugar mixed with cinnamon (traditional) OR in confectioners' sugar if preferred.\n",
        "picture_link": "nBwVqjQfHsNFtzJbtgj0315jSWrHJh."
    },
    {
        "title": "Ham Tetrazzini",
        "ingredients": [
            "6 ounces spaghetti ADVERTISEMENT",
            "3 quarts water ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "2 tablespoons chopped onion ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 cup diced ham ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "2 tablespoons chopped pimento peppers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add spaghetti and cook for 8 to 10 minutes or until al dente; drain (or use leftover pasta; see Cook's Note).\nWhile pasta is cooking, melt butter in a saucepan over medium heat. Stir in onion; cook and stir until the onion has softened and turned translucent, about 5 minutes.\nStir in cream of mushroom soup, 1/2 cup water, and shredded cheese. Heat mixture until cheese melts, stirring often.\nMix in the ham, cooked and drained pasta, chopped pimento, and chopped parsley to saucepan; stir to combine. Cook until mixture is heated through, then serve.\n",
        "picture_link": "zljdS9wpKvE0c38PwOAQLordsop.cBW"
    },
    {
        "title": "Fettuccini Carbonara",
        "ingredients": [
            "5 teaspoons olive oil ADVERTISEMENT",
            "4 shallots, diced ADVERTISEMENT",
            "1 large onion, cut into thin strips ADVERTISEMENT",
            "1 pound bacon, cut into strips ADVERTISEMENT",
            "1 clove garlic, chopped ADVERTISEMENT",
            "1 (16 ounce) package fettuccini pasta ADVERTISEMENT",
            "3 egg yolks ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "3/4 cup shredded Parmesan cheese ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large heavy saucepan over medium heat. Saute shallots until softened. Stir in onion and bacon, and cook until bacon is evenly browned. Stir in garlic when bacon is about half done. Remove from heat.\nBring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente. Drain pasta, then return it to the pot.\nIn a medium bowl, whisk together egg yolks, cream, and shredded Parmesan. Pour the bacon mixture over the pasta, then stir in the cream mixture. Season with salt and pepper.\n",
        "picture_link": "Vf3CasasbCTgXEwEoDW2Ln5EOZain6W"
    },
    {
        "title": "Pico De Gallo",
        "ingredients": [
            "1 medium tomato, diced ADVERTISEMENT",
            "1 onion, finely chopped ADVERTISEMENT",
            "1/2 fresh jalapeno pepper, seeded and chopped ADVERTISEMENT",
            "2 sprigs fresh cilantro, finely chopped ADVERTISEMENT",
            "1 green onion, finely chopped ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, combine tomato, onion, jalapeno pepper (to taste,) cilantro and green onion. Season with garlic powder, salt and pepper. Stir until evenly distributed. Refrigerate for 30 minutes.\n",
        "picture_link": "t7touRdzmmsyjQx3.CZzS9GXgTXrKQW"
    },
    {
        "title": "Baked Tortilla Chips",
        "ingredients": [
            "1 (12 ounce) package corn tortillas ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "3 tablespoons lime juice ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCut each tortilla into 8 chip sized wedges and arrange the wedges in a single layer on a cookie sheet.\nIn a mister, combine the oil and lime juice. Mix well and spray each tortilla wedge until slightly moist.\nCombine the cumin, chili powder and salt in a small bowl and sprinkle on the chips.\nBake for about 7 minutes. Rotate the pan and bake for another 8 minutes or until the chips are crisp, but not too brown. Serve with salsas, garnishes or guacamole.\n",
        "picture_link": "n/e.8yf.h3ffr7tNZRUfMtI4lk0f3ae"
    },
    {
        "title": "Reuben Dip",
        "ingredients": [
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/2 cup Thousand Island dressing ADVERTISEMENT",
            "16 ounces sauerkraut, rinsed and squeezed dry ADVERTISEMENT",
            "8 ounces shredded corned beef ADVERTISEMENT",
            "16 ounces shredded Swiss cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a small bowl, combine mayonnaise and dressing.\nSpread sauerkraut into a 9x13-inch baking dish. Layer corned beef, Swiss cheese, and the mayonnaise-dressing mixture on top of the sauerkraut.\nBake for 20 to 25 minutes.\n",
        "picture_link": "gjfCzdRFUbLvHXxlLlIkZkc5dWh3icS"
    },
    {
        "title": "Slammin' Salmon",
        "ingredients": [
            "1/4 cup balsamic vinegar ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1 1/2 teaspoons ground ginger ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 teaspoon black pepper ADVERTISEMENT",
            "1 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1/4 cup chopped green onions ADVERTISEMENT",
            "1 teaspoon sesame oil ADVERTISEMENT",
            "1/2 cup peanut oil ADVERTISEMENT",
            "8 (4 ounce) skinless, boneless salmon fillets ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir balsamic vinegar, lemon juice, and soy sauce with salt, brown sugar, ground ginger, paprika, pepper, and red pepper flakes until the salt has dissolved. Stir in garlic, green onions, sesame oil, and peanut oil until well combined.\nPour marinade into a resealable plastic bag or glass bowl. Add salmon to marinade and gently toss to coat. Place into refrigerator and marinate 2 to 24 hours.\nPrepare an outdoor grill for medium-high heat.\nDrain excess marinade from salmon fillets. Grill until firm and opaque, about 4 minutes per side.\n",
        "picture_link": "HIFNx0OvyqWMP1pwhFB0CkCKY4MaIZi"
    },
    {
        "title": "Beef and Guinness® Stew",
        "ingredients": [
            "4 slices bacon, cut into small pieces ADVERTISEMENT",
            "2 1/2 pounds boneless beef chuck, cut into 2-inch pieces ADVERTISEMENT",
            "1 teaspoon salt, or more to taste ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "2 onions, coarsely chopped ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 (14.9 ounce) can dark beer (such as Guinness®) ADVERTISEMENT",
            "1/4 cup tomato paste ADVERTISEMENT",
            "4 sprigs fresh thyme ADVERTISEMENT",
            "3 carrots, cut into 1-inch pieces ADVERTISEMENT",
            "2 stalks celery, cut into 1-inch pieces ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper, or to taste ADVERTISEMENT",
            "2 1/2 cups chicken stock, or as needed to cover ADVERTISEMENT",
            "4 cups mashed potatoes (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook and stir bacon in a heavy skillet over medium-high heat until bacon is browned and crisp, 3 to 4 minutes. Turn off heat and transfer bacon into a large stew pot, reserving bacon fat in the skillet.\nSeason beef chuck cubes generously with 1 teaspoon salt and black pepper to taste. Turn heat to high under skillet and sear beef pieces in the hot fat on both sides until browned, about 5 minutes. Place beef in stew pot with bacon, leaving fat in skillet. Turn heat down to medium; cook and stir onions in the retained fat in the skillet until lightly browned, 5 to 8 minutes; season with a large pinch of salt.\nCook garlic with onions until soft, about 1 minute; pour beer into skillet and stir with a wooden spoon, scraping up and dissolving any browned bits of food into the liquid. Pour cooking liquid from skillet into the stew pot. Stir in tomato paste, thyme sprigs, carrots, celery, sugar, 1/2 teaspoon black pepper, and enough chicken broth to cover.\nBring stew to a gentle simmer, stirring to combine; reduce heat to low and cover pot. Simmer stew until beef is fork-tender, about 2 hours. Stir stew occasionally and skim fat or foam if desired.\nRemove cover and raise heat to medium-high. Bring stew to a low boil and cook until stew has slightly thickened, 15 to 20 minutes. Remove and discard thyme sprigs and adjust salt and pepper to taste.\nArrange mashed potatoes in a ring in a serving bowl; ladle stew into the center of the potatoes.\n",
        "picture_link": "HbEEVHPSfrMipj0sZeUksuVxSK4BIuq"
    },
    {
        "title": "Baked Macaroni and Cheese I",
        "ingredients": [
            "2 slices bacon ADVERTISEMENT",
            "8 ounces penne pasta ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "3 cups shredded Cheddar cheese ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble and set aside.\nIn a large pot with boiling salted water cook pasta until al dente. Drain.\nIn a medium skillet saute the chopped onion, and minced garlic. Take off heat and add chopped cooked bacon and set aside.\nTo make the sauce, in a medium saucepan melt the butter or margarine over low heat. Once melted, add the flour and stir constantly for 2 minutes. Gradually add milk and continue stirring until thickened. Stir in 2 cups of the grated Cheddar cheese and stir until melted.\nCombine cooked pasta, sauteed vegetables and sauce. Pour into a 2 quart casserole dish. Add the last cup of grated Cheddar cheese to top of mixture.\nBake uncovered in preheated oven until cheese on top is melted and brown, 15 to 20 minutes. Serve warm.\n",
        "picture_link": "qk0ntGCvpF6V9oM8ZhSncf5cLNvjuWq"
    },
    {
        "title": "Barbeque Pork Two Ways",
        "ingredients": [
            "2 1/2 pounds pork shoulder ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1 teaspoon dry mustard ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "2 cups ketchup ADVERTISEMENT",
            "1/4 cup Worcestershire sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut boneless pork shoulder crosswise into 1/4 inch slices. Partially freezing it will make slicing easier.\nIn the slow cooker, combine sliced pork, onion, garlic, brown sugar, dry mustard, salt, pepper, ketchup, and Worcestershire sauce; mix well, and cover. Cook on Low, stirring occasionally, for 6 to 8 hours or until the meat is tender.\nOR : In a Dutch oven or large saucepan, combine pork, onion, garlic, brown sugar, dry mustard, salt, pepper, ketchup, and Worcestershire sauce; mix well. Bring to a boil, reduce heat, and cover. Simmer, stirring occasionally, for 2 1/2 to 3 hours or until pork is tender.\n",
        "picture_link": "9B.Tt9OZthyEhi.oik0zvKXxvUMVMBS"
    },
    {
        "title": "Gnocchi I",
        "ingredients": [
            "2 potatoes ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of salted water to a boil. Peel potatoes and add to pot. Cook until tender but still firm, about 15 minutes. Drain, cool and mash with a fork or potato masher.\nCombine 1 cup mashed potato, flour and egg in a large bowl. Knead until dough forms a ball. Shape small portions of the dough into long \"snakes\". On a floured surface, cut snakes into half-inch pieces.\nBring a large pot of lightly salted water to a boil. Drop in gnocchi and cook for 3 to 5 minutes or until gnocchi have risen to the top; drain and serve.\n",
        "picture_link": "zTXGnlDq.4IFXQIhuAmyxsPVgmEFUNe"
    },
    {
        "title": "Farmer's Market Vegetarian Quesadillas",
        "ingredients": [
            "1/2 cup chopped red bell pepper ADVERTISEMENT",
            "1/2 cup chopped zucchini ADVERTISEMENT",
            "1/2 cup chopped yellow squash ADVERTISEMENT",
            "1/2 cup chopped red onion ADVERTISEMENT",
            "1/2 cup chopped mushrooms ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "6 (9 inch) whole wheat tortillas ADVERTISEMENT",
            "1 1/4 cups shredded reduced-fat sharp Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large nonstick pan, cook red pepper, zucchini, yellow squash, onion, and mushrooms in olive oil over medium to medium-high heat for about 7 minutes, or until just tender. Remove vegetables from pan.\nCoat the same pan with cooking spray, and place one tortilla in pan. Sprinkle 1/4 cup of cheese evenly over tortilla, and layer 3/4 cup of the vegetable mixture over the cheese. Sprinkle another 1/8 cup of cheese on the vegetables, and top with a second tortilla. Cook until golden on both sides, for approximately 2 to 3 minutes per side. Remove quesadilla from pan, and repeat with remaining ingredients. Cut each quesadilla into 8 triangles with a pizza cutter. Serve hot.\n",
        "picture_link": "RSPAuQPSBlfseK6Wfh9vrphK.GAIQ2S"
    },
    {
        "title": "Basic Pasta",
        "ingredients": [
            "1 egg, beaten ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium sized bowl, combine flour and salt. Make a well in the flour, add the slightly beaten egg, and mix. Mixture should form a stiff dough. If needed, stir in 1 to 2 tablespoons water.\nOn a lightly floured surface, knead dough for about 3 to 4 minutes. With a pasta machine or by hand roll dough out to desired thinness. Use machine or knife to cut into strips of desired width.\n",
        "picture_link": "OxpckZkv.b8AVbd1QPpnf6kGCR5BDfS"
    },
    {
        "title": "Pot Roast in Foil",
        "ingredients": [
            "3 pounds bottom round ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 packet dry onion soup mix ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C).\nPlace a piece of foil, about 30 inches long, into the bottom of a 9x13 inch roasting pan. Place the roast on the foil in the pan.\nIn a separate small bowl, combine the mushroom soup with the onion soup mix. Mix well and pour over the roast. Sprinkle with the water. Fold foil over and seal all edges.\nBake at 300 degrees F (150 degrees C) for 4 hours.\n",
        "picture_link": "eWwUOsC2Jmp7bi.unJ9IrHmt/kPyn1O"
    },
    {
        "title": "Baked Ham and Cheese Party Sandwiches",
        "ingredients": [
            "3/4 cup melted butter ADVERTISEMENT",
            "1 1/2 tablespoons Dijon mustard ADVERTISEMENT",
            "1 1/2 teaspoons Worcestershire sauce ADVERTISEMENT",
            "1 1/2 tablespoons poppy seeds ADVERTISEMENT",
            "1 tablespoon dried minced onion ADVERTISEMENT",
            "24 mini sandwich rolls ADVERTISEMENT",
            "1 pound thinly sliced cooked deli ham ADVERTISEMENT",
            "1 pound thinly sliced Swiss cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nIn a bowl, mix together butter, Dijon mustard, Worcestershire sauce, poppy seeds, and dried onion. Separate the tops from bottoms of the rolls, and place the bottom pieces into the prepared baking dish. Layer about half the ham onto the rolls. Arrange the Swiss cheese over the ham, and top with remaining ham slices in a layer. Place the tops of the rolls onto the sandwiches. Pour the mustard mixture evenly over the rolls.\nBake in the preheated oven until the rolls are lightly browned and the cheese has melted, about 20 minutes. Slice into individual rolls through the ham and cheese layers to serve.\n",
        "picture_link": "WTaniuwdbmozVZB4fYj3Wg7ET38Drsa"
    },
    {
        "title": "Chili Dog Casserole I",
        "ingredients": [
            "8 hot dog buns ADVERTISEMENT",
            "8 hot dogs ADVERTISEMENT",
            "1 (15 ounce) can chili ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "1 tablespoon prepared mustard ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nLightly grease a 9x13 inch baking dish. Tear up the hot dog buns and arrange the pieces in the bottom of the dish evenly. Slice the hot dogs into bite size pieces and layer the pieces over the buns.\nPour the chili over the hot dogs, sprinkle with the chopped onion, then spread some mustard over the chili and the onion. Top off with the cheese.\nBake at 350 degrees F (175 degrees C) for 30 minutes.\n",
        "picture_link": "lpR7lbf3Mt7PMf47x8Qu45bJGCYU1Iy"
    },
    {
        "title": "Black Bean Salad",
        "ingredients": [
            "1 (15 ounce) can black beans, rinsed and drained ADVERTISEMENT",
            "2 (15 ounce) cans whole kernel corn, drained ADVERTISEMENT",
            "8 green onions, chopped ADVERTISEMENT",
            "2 jalapeno peppers, seeded and minced ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 avocado - peeled, pitted, and diced ADVERTISEMENT",
            "1 (4 ounce) jar pimentos ADVERTISEMENT",
            "3 tomatoes, seeded and chopped ADVERTISEMENT",
            "1 cup chopped fresh cilantro ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "1/2 cup Italian salad dressing ADVERTISEMENT",
            "1/2 teaspoon garlic salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine the black beans, corn, green onions, jalapeno peppers, bell pepper, avocado, pimentos, tomatoes, cilantro, lime juice, and Italian dressing. Season with garlic salt. Toss, and chill until serving.\n",
        "picture_link": "DHnhU2nuLbNUa7ypCOZEJlvSsm1mavS"
    },
    {
        "title": "Strawberry and Feta Salad",
        "ingredients": [
            "1 cup slivered almonds ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon honey ADVERTISEMENT",
            "1 teaspoon Dijon mustard ADVERTISEMENT",
            "1/4 cup raspberry vinegar ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "1 head romaine lettuce, torn ADVERTISEMENT",
            "1 pint fresh strawberries, sliced ADVERTISEMENT",
            "1 cup crumbled feta cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a skillet over medium-high heat, cook the almonds, stirring frequently, until lightly toasted. Remove from heat, and set aside.\nIn a bowl, prepare the dressing by whisking together the garlic, honey, Dijon mustard, raspberry vinegar, balsamic vinegar, brown sugar, and vegetable oil.\nIn a large bowl, toss together the toasted almonds, romaine lettuce, strawberries, and feta cheese. Cover with the dressing mixture, and toss to serve.\n",
        "picture_link": "/hmlSGwnUzSVJIy6MYy/XgWZlt/HjmS"
    },
    {
        "title": "Baked Whole Cauliflower",
        "ingredients": [
            "1 large head cauliflower ADVERTISEMENT",
            "1/2 cup seasoned bread crumbs ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "1/4 cup margarine, melted ADVERTISEMENT",
            "1/8 teaspoon garlic powder ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1 pinch red pepper flakes ADVERTISEMENT",
            "1 pinch dried oregano ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Clean cauliflower, and trim off leaves and any brown spots. Place the whole head of cauliflower into a steamer basket, place the basket in a large pot, and add one inch of water. Cover, and bring to a boil over medium heat. Cook for about 20 minutes or until tender.\nPreheat the oven to 375 degrees F (190 degrees C). In a medium bowl, mix together the bread crumbs, Parmesan cheese, melted margarine. Season with garlic powder, salt, red pepper flakes, and oregano, and mix well. Place the head of cauliflower into a baking dish, and coat with the breadcrumb mixture.\nBake for about 10 to 15 minutes in the preheated oven, or until golden brown.\n",
        "picture_link": "B2fOkUay9C0Kn9UcZcBrB7QGrOweWtS"
    },
    {
        "title": "Balsamic Glazed Carrots",
        "ingredients": [
            "3 cups baby carrots ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 1/2 tablespoons balsamic vinegar ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a skillet over medium-high heat. Saute carrots in oil for about 10 minutes, or until tender. Stir in balsamic vinegar and brown sugar, mix to coat and serve.\n",
        "picture_link": "VJJqCGIPxLijTGPgwX.Q4n8oE0EVgGK"
    },
    {
        "title": "Moroccan Tagine",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 skinless, boneless chicken breast halves - cut into chunks ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 small butternut squash, peeled and chopped ADVERTISEMENT",
            "1 (15.5 ounce) can garbanzo beans, drained and rinsed ADVERTISEMENT",
            "1 carrot, peeled and chopped ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes with juice ADVERTISEMENT",
            "1 (14 ounce) can vegetable broth ADVERTISEMENT",
            "1 tablespoon sugar ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground coriander ADVERTISEMENT",
            "1 dash cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large skillet over medium heat, and cook the chicken, onion, and garlic about 15 minutes, until browned.\nMix the squash, garbanzo beans, carrot, tomatoes with juice, broth, sugar, and lemon juice into the skillet. Season with salt, coriander, and cayenne pepper. Bring the mixture to a boil, and continue cooking 30 minutes, until vegetables are tender.\n",
        "picture_link": "RVaqN.rkdtX0T.v1o7yQHVrS3hjUsD2"
    },
    {
        "title": "Bev's Chocolate Pie",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "5 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 (12 fluid ounce) can evaporated milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "4 egg yolks ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 recipe pastry for a 9 inch single crust pie ADVERTISEMENT",
            "4 egg whites ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a saucepan, whisk together 2 cups sugar, cocoa and flour. Blend in evaporated milk and vanilla. Beat egg yolks, and stir into pan. Add the butter or margarine. Heat, stirring constantly just until butter is melted. Pour filling into unbaked pie shell.\nBake in preheated oven for 35 to 40 minutes, or until pie is not \"wobbly\" when shaken.\nBeat egg whites until soft peaks form. Gradually add 1/4 cup sugar, beating constantly, until stiff peaks form. Spread meringue on pie.\nReturn pie to oven, and bake until meringue is golden.\n",
        "picture_link": "Lh4uqlQt7zjGxVMNPeqBSxJEoMWUNA."
    },
    {
        "title": "Apple Brownies",
        "ingredients": [
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "3 medium apples - peeled, cored and thinly sliced ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x9 inch baking dish.\nIn a large bowl, beat together the melted butter, sugar, and egg until fluffy. Fold in the apples and walnuts. In a separate bowl, sift together the flour, salt, baking powder, baking soda, and cinnamon. Stir the flour mixture into the wet mixture until just blended. Spread the batter evenly in the prepared baking dish.\nBake 35 minutes in the preheated oven, or until a toothpick inserted in the center comes out clean.\n",
        "picture_link": "tT/EPW6WHkr9xEnuX0QPUOZ5qd2Ie4G"
    },
    {
        "title": "BBQ Chicken Pizza I",
        "ingredients": [
            "3 boneless chicken breast halves, cooked and cubed ADVERTISEMENT",
            "1 cup hickory flavored barbeque sauce ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1 teaspoon molasses ADVERTISEMENT",
            "1/3 cup brown sugar ADVERTISEMENT",
            "1/2 bunch fresh cilantro, chopped ADVERTISEMENT",
            "1 (12 inch) pre-baked pizza crust ADVERTISEMENT",
            "1 cup smoked Gouda cheese, shredded ADVERTISEMENT",
            "1 cup thinly sliced red onion ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). In a saucepan over medium high heat, combine chicken, barbeque sauce, honey, molasses, brown sugar and cilantro. Bring to a boil.\nSpread chicken mixture evenly over pizza crust, and top with cheese and onions. Bake for 15 to 20 minutes, or until cheese is melted.\n",
        "picture_link": "1NnYHdfYR9iH8k.MVcKMJcgqIqMbEsu"
    },
    {
        "title": "Sausage Gravy I",
        "ingredients": [
            "1 pound ground pork sausage ADVERTISEMENT",
            "3 tablespoons bacon grease ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "3 cups milk ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Brown sausage in a large skillet over medium-high heat. Set aside, leaving the drippings in the skillet.\nMix bacon grease into the sausage drippings. Reduce heat to medium, combine with flour, and stir constantly until mixture just turns golden brown.\nGradually whisk milk into skillet. When the mixture is smooth, thickened, and begins to bubble, return the sausage to skillet. Season with salt and pepper. Reduce heat, and simmer for about 15 minutes.\n",
        "picture_link": "PR2UdxbDV8sO42jq6IJI8AOKHIy1Fe6"
    },
    {
        "title": "Easy Spicy Roasted Potatoes",
        "ingredients": [
            "5 medium red potatoes, diced with peel ADVERTISEMENT",
            "1 medium onion, chopped ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 tablespoon kosher salt ADVERTISEMENT",
            "2 teaspoons chili powder ADVERTISEMENT",
            "1/4 cup extra virgin olive oil ADVERTISEMENT",
            "1 cup shredded Cheddar cheese (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 450 degrees F (220 degrees C).\nArrange the potatoes and onions in a greased 9x13 inch baking dish so that they are evenly distributed. Season with garlic powder, salt and chili powder. Drizzle with olive oil. Stir to coat potatoes and onions with oil and spices.\nBake for 35 to 40 minutes in the preheated oven, until potatoes are fork tender and slightly crispy. Stir every 10 minutes. When done, sprinkle with cheese. Wait about 5 minutes for the cheese to melt before serving.\n",
        "picture_link": "8lhx0GDEElHTWcr4CpiXofq84qvuEP6"
    },
    {
        "title": "Banana Cream Pie III",
        "ingredients": [
            "1 (9 inch) pie crust, baked ADVERTISEMENT",
            "3 bananas ADVERTISEMENT",
            "2 1/2 cups cold milk ADVERTISEMENT",
            "2 (3.5 ounce) packages instant vanilla pudding mix ADVERTISEMENT",
            "2 cups frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Slice 2 of the bananas and arrange in bottom of baked and cooled pastry shell.\nPour cold milk into a medium bowl. Add pudding mix and whisk until thoroughly combined. Fold in 1/2 cup of the whipped topping. Pour into pastry shell.\nChill at least 3 hours before serving. Garnish with remaining whipped topping and slices of the remaining banana.\n",
        "picture_link": "2trYqJMmZiKOQ8BUmGuvhaH5e/F5KJi"
    },
    {
        "title": "Mini Cheesecakes",
        "ingredients": [
            "12 vanilla wafers ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "1 (21 ounce) can cherry pie filling, or flavor of choice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nLine muffin tins with 12 paper baking cups. Place a vanilla wafer in each one.\nIn a medium mixing bowl beat cream cheese until fluffy. Add eggs, lemon juice, and sugar. Beat until smooth and thoroughly combined.\nFill each baking cup 2/3 full with cream cheese mixture.\nBake in preheated oven for 15 to 17 minutes. Cool on a rack. Top with fruit pie filling. Pipe whipped cream or sweetened cream cheese into a rosette on top of each cheesecake just prior to serving, if desired.\n",
        "picture_link": "0ujr02SMeyr3BL3rmqZRUzcqyCGot6C"
    },
    {
        "title": "Aloo Phujia",
        "ingredients": [
            "1 onion, chopped ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 pound potatoes, peeled and cubed ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "1/4 teaspoon ground cumin ADVERTISEMENT",
            "2 tomatoes, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Lightly brown onion in oil in a medium size skillet.\nStir in salt, cayenne, turmeric and cumin. Add potatoes and cook 10 minutes stirring occasionally.\nAdd tomatoes, cover pan and cook until potatoes are soft, about 10 minutes.\n",
        "picture_link": "8.wp/fyUeTN0ejjP7ZsBoUqhToa94BW"
    },
    {
        "title": "Fish Tacos with Honey-Cumin Cilantro Slaw and Chipotle Mayo",
        "ingredients": [
            "1 pound tilapia fillets, cut into chunks ADVERTISEMENT",
            "1/2 cup fresh lime juice ADVERTISEMENT",
            "1/3 cup fresh lime juice ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "2 chipotle chilies in adobo sauce ADVERTISEMENT",
            "1 tablespoon adobo sauce from chipotle peppers ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon cayenne pepper ADVERTISEMENT",
            "1/3 cup all-purpose flour ADVERTISEMENT",
            "2 eggs, lightly beaten ADVERTISEMENT",
            "2 cups panko crumbs ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 cup vegetable oil for frying ADVERTISEMENT",
            "2 cups 3 color coleslaw blend ADVERTISEMENT",
            "1 cup minced fresh cilantro leaves ADVERTISEMENT",
            "8 (7 inch) flour tortillas, warmed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the tilapia chunks in a flat dish and pour 1/2 cup lime juice over the fish. Cover, and refrigerate at least 4 hours.\nMeanwhile, make the honey-cumin sauce by whisking together 1/3 cup lime juice, honey, vegetable oil, and ground cumin a small bowl. Set aside until needed.\nTo make the chipotle mayonnaise dressing, place the mayonnaise, chilies, adobo sauce, 1/4 teaspoon salt, and cayenne pepper together in the bowl of a food processor. Pulse until smooth. Cover, and refrigerate until needed.\nTo bread the fish, place the flour, eggs, and panko crumbs in three separate shallow dishes. Season the fish with salt and pepper to taste. Dip the fish pieces first in the four, coating evenly, and shaking off any excess. Dip next in the eggs, and last in the panko crumbs, patting the pieces to help the breadcrumbs hold. Set the fish aside on a plate.\nTo cook the breaded fish, pour 1 cup vegetable oil into a skillet to 1/4 inch deep. Heat the oil to 365 degrees F (185 degrees C) over medium heat. Cook the fish, turning until all sides are golden brown, and flesh is easily flaked with a fork. Drain on paper towels. Brush the fish with the honey-cumin sauce.\nMix the coleslaw and cilantro together in a bowl. Reserve 1/4 cup of the chipotle mayonnaise dressing, and pour the remaining dressing over the coleslaw mixture. Toss to coat evenly with the dressing.\nPlace the tortillas on a flat surface, and spread each with 1 tablespoon reserved chipotle mayonnaise dressing. Divide the fish between the tortillas. Top with the cilantro coleslaw.\n",
        "picture_link": "K969a0QY/qzbZBDzWpWtoIxpjBxrW/."
    },
    {
        "title": "Indonesian Satay",
        "ingredients": [
            "3 tablespoons soy sauce ADVERTISEMENT",
            "3 tablespoons tomato sauce ADVERTISEMENT",
            "1 tablespoon peanut oil ADVERTISEMENT",
            "2 cloves garlic, peeled and minced ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "1 pinch ground cumin ADVERTISEMENT",
            "6 skinless, boneless chicken breast halves - cubed ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1/4 cup minced onion ADVERTISEMENT",
            "1 clove garlic, peeled and minced ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/2 cup chunky peanut butter ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "skewers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a bowl, mix soy sauce, tomato sauce, peanut oil, garlic, black pepper, and cumin. Place chicken into the mixture, and stir to coat. Cover, and marinate in the refrigerator for at least 15 minutes, but not overnight. This will make the meat too dark.\nPreheat the grill for high heat.\nHeat vegetable oil in a saucepan over medium heat, and saute onion and garlic until lightly browned. Mix in water, peanut butter, soy sauce, and sugar. Cook and stir until well blended. Remove from heat, mix in lemon juice, and set aside.\nLightly oil the grill grate. Thread chicken onto skewers, and discard marinade. Grill skewers about 5 minutes per side, until chicken juices run clear. Serve with the peanut sauce.\n",
        "picture_link": "w2ZHOZQ9Gnfz5FogmtGKiqnRsVg2chS"
    },
    {
        "title": "Spinach and Tortellini Salad",
        "ingredients": [
            "1 (9 ounce) package cheese-filled tortellini ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped spinach, thawed and drained ADVERTISEMENT",
            "1/3 cup grated Parmesan cheese ADVERTISEMENT",
            "2 cups cherry tomatoes, halved ADVERTISEMENT",
            "1 (2 ounce) can sliced black olives ADVERTISEMENT",
            "1 (8 ounce) bottle Italian-style salad dressing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot of salted boiling water, cook pasta until al dente, rinse under cold water and drain.\nIn a large bowl, combine the tortellini, spinach, cheese, tomatoes and olives. Add enough salad dressing to coat. Toss and season with salt and pepper.\n",
        "picture_link": "LCz6qXxoh6fDvMwWORy0gpIlt8by64a"
    },
    {
        "title": "Quick and Easy Home Fries",
        "ingredients": [
            "3 medium russet potatoes, cubed ADVERTISEMENT",
            "3 tablespoons butter or margarine ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse potato cubes with cold water, and drain well. Melt butter or margarine in a large skillet over medium heat. Place potatoes in the skillet, and stir to coat with butter. Season with salt and pepper. Cover with a lid, and cook for 10 minutes. Remove the lid, and cook for another 10 minutes, turning frequently until brown and crisp on all sides..\n",
        "picture_link": "/GVg3Ez.eDXBu9vqvKe7elXTAaxaJW."
    },
    {
        "title": "Michelle's Soft Sugar Cookies",
        "ingredients": [
            "1 cup margarine ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons cream of tartar ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream the margarine and add the sugar gradually. Beat until light and fluffy. Add eggs one at time, mixing well after each addition.\nStir in the vanilla. Add the flour, cream of tartar, baking soda and salt gradually to the creamed mixture, stirring in by hand. Cover and chill dough overnight.\nPreheat oven to 375 degrees F (190 degrees C). Line baking sheets with parchment paper.\nRoll dough out on a floured surface to 1/8 to 1/4 inch thick and cut into your favorite shapes. Place cookies onto the prepared baking sheets.\nBake at 375 degrees F (190 degrees C) for 6 to 8 minutes or until cookie has a golden appearance.\n",
        "picture_link": "dkd6tpNcBNbqgcqVmVAYVCMeeqtxfT2"
    },
    {
        "title": "Cordon Bleu Chicken Rolls",
        "ingredients": [
            "8 skinless, boneless chicken breasts ADVERTISEMENT",
            "8 slices cooked ham ADVERTISEMENT",
            "4 slices Swiss cheese, cut into 1 inch pieces ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "1/4 cup melted butter ADVERTISEMENT",
            "1/2 cup cornflakes cereal crumbs ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nPlace each chicken breast half between sheets of plastic wrap and pound with a meat mallet to about 1/8 inch thickness. Place a finger of cheese on each ham slice and sprinkle lightly with thyme and salt and pepper to taste. Roll up seasoned ham and cheese 'jellyroll-style', then roll each chicken breast with ham and cheese inside. Tuck in ends and fasten with toothpicks.\nPlace melted butter in a small bowl and place cereal crumbs in a shallow dish or bowl. Dip each chicken roll in butter or margarine, then roll in crumbs, turning to coat thoroughly. Place coated rolls in a lightly greased 9x13 inch baking dish.\nBake at 400 degrees F (200 degrees C) for about 40 minutes or until chicken is golden brown and juices run clear. Serve with cordon bleu sauce, if desired.\nTo Make Cordon Bleu Sauce: In a small saucepan mix together the soup, sour cream and lemon juice. Heat over low heat, stirring occasionally, and serve hot over chicken rolls. Makes about 2 cups; 8 servings of 1/4 cup each.\n",
        "picture_link": "Pu3jp/LfiHBn03osdReY9jAiJkPl/rq"
    },
    {
        "title": "Chocolate Cappuccino Cheesecake",
        "ingredients": [
            "1 cup chocolate cookie crumbs ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "3 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "8 (1 ounce) squares semisweet chocolate ADVERTISEMENT",
            "2 tablespoons whipping cream ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 teaspoons instant coffee granules dissolved in 1/4 cup hot water ADVERTISEMENT",
            "1/4 cup coffee flavored liqueur ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "2 tablespoons confectioners' sugar ADVERTISEMENT",
            "2 tablespoons coffee-flavored liqueur ADVERTISEMENT",
            "1 (1 ounce) square semisweet chocolate ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Butter one 9 or 10 inch springform pan.\nCombine the chocolate wafer crumbs, softened butter, 2 tablespoons white sugar, and the cinnamon. Mix well and press mixture into the buttered springform pan, set aside.\nIn a medium sized bowl beat the softened cream cheese until smooth. Gradually add 1 cup white sugar mixing until well blended. Add eggs, one at a time. Beat at low speed until very smooth.\nMelt the 8 ounces semisweet chocolate with 2 tablespoons whipping cream in a pan or bowl set over boiling water, stir until smooth.\nAdd chocolate mixture to cream cheese mixture and blend well. Stir in sour cream, salt, coffee, 1/4 cup coffee liqueur, and vanilla; beat until smooth. Pour mixture into prepared pan.\nBake in the center of oven at 350 degrees F (175 degrees C) for 45 minutes. Center will be soft but will firm up when chilled. Do not over bake. Leave cake in oven with the heat turned off and the door ajar for 45 minutes. Remove cake from oven and chill for 12 hours. Just before serving top cake with mounds of flavored whipped cream and garnish with chocolate leaves. Yields 16 servings.\nTo Make Flavored Whipped Cream: Beat whipping cream until soft peaks form, then beat in confectioner's sugar and 2 tablespoons coffee liqueur.\nTo Make Chocolate Leaves: Melt 1 ounce semisweet chocolate in a pan or bowl set over boiling water, stir until smooth. Brush real non-toxic plant leaves (such as orange leaves) on one side with melted chocolate. Freeze until firm and then peel off leaves. Freeze chocolate leaves until needed.\n",
        "picture_link": "oz89snMCouFLRYqesZG1XddbsYxeOsa"
    }
]