[
    {
        "title": "Moist Holiday Honeycake",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "3 1/2 cups unbleached all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "4 teaspoons ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground cloves ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1 cup canola oil ADVERTISEMENT",
            "1 cup honey ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup strong brewed coffee (decaf is fine) ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "1/4 cup whiskey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place an oven shelf in an upper position in oven, and preheat oven to 350 degrees F (175 degrees C). Spray a 10-inch fluted tube pan (such as a Bundt(R) pan) with cooking spray.\nIn a bowl, whisk together the unbleached flour, baking powder, baking soda, salt, cinnamon, cloves, and nutmeg until thoroughly combined. In a separate large bowl, whisk together the canola oil, honey, white and brown sugar, eggs, vanilla extract, coffee, orange juice, and whiskey. With an electric mixer, beat the flour mixture into the honey mixture just until the batter is thoroughly incorporated. Pour the batter into the prepared pan.\nBake on upper shelf in the preheated oven until the cake is golden brown and a toothpick inserted into the cake comes out with moist crumbs, about 1 hour. Cool for 20 minutes in the pan before turning the cake out onto a serving platter.\n",
        "picture_link": "TwL2Mbj3J.Ug6f3v4RRUFETJzd6xOne"
    },
    {
        "title": "Joe's Fusion Chicken Pad Thai",
        "ingredients": [
            "1 pound boneless, skinless chicken breast halves, cut into bite-size pieces ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon ground cayenne pepper ADVERTISEMENT",
            "3 tablespoons white wine vinegar ADVERTISEMENT",
            "6 tablespoons fish sauce ADVERTISEMENT",
            "1 tablespoon creamy peanut butter ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "5 cloves garlic, minced ADVERTISEMENT",
            "4 large eggs, lightly beaten ADVERTISEMENT",
            "1 (16 ounce) package pad Thai rice noodles ADVERTISEMENT",
            "1/2 cup fresh bean sprouts ADVERTISEMENT",
            "2 cups beef broth ADVERTISEMENT",
            "1/2 cup chopped green onion ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of water to a boil.\nSeason chicken with salt and black pepper; set aside.\nWhisk sugar, cayenne pepper, white wine vinegar, fish sauce, and peanut butter together in a bowl.\nCoat the inside of a large skillet or wok with olive oil and place over high heat.\nCook and stir chicken in the hot oil just until the meat is white outside but still pink inside, about 3 minutes.\nRemove chicken and set aside in a bowl.\nLower the heat under the skillet to medium-low. Cook and stir garlic in the skillet until it becomes translucent, 1 to 2 minutes.\nCook and stir eggs into garlic until loosely cooked, 2 to 3 minutes.\nPour peanut sauce into the garlic and eggs, and stir to combine. Bring sauce to a simmer.\nStir rice noodles into the boiling water. Cook until noodles are still slightly tough, about 5 minutes.\nDrain the noodles.\nReturn chicken to the skillet with eggs and sauce. Simmer until chicken is no longer pink in the center and the juices run clear, stirring frequently, 5 to 8 more minutes.\nStir bean sprouts, rice noodles. and beef broth into the skillet. Bring to a simmer, and cook until noodles are tender and most of the broth has been absorbed, about 10 minutes.\nSprinkle with green onions to serve..\n",
        "picture_link": "tVUNSpx7HNEAybbk/uo4pWoKItaGLnG"
    },
    {
        "title": "Strawberry Banana Protein Smoothie",
        "ingredients": [
            "1 banana ADVERTISEMENT",
            "1 1/4 cups sliced fresh strawberries ADVERTISEMENT",
            "10 whole almonds ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1 cup ice cubes ADVERTISEMENT",
            "3 tablespoons chocolate flavored protein powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the banana, strawberries, almonds, and water into a blender. Blend to mix, then add the ice cubes and puree until smooth. Add the protein powder, and continue mixing until evenly incorporated, about 30 seconds.\n",
        "picture_link": "VSvu7U457Pii0MPkF5w2NGqpNS/78/2"
    },
    {
        "title": "Slow Cooker Macaroni and Cheese with Broccoli",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 (16 ounce) package uncooked elbow macaroni ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "4 cups shredded Cheddar cheese ADVERTISEMENT",
            "2 (12 fluid ounce) cans evaporated milk ADVERTISEMENT",
            "3 cups milk ADVERTISEMENT",
            "1 (14 ounce) bag frozen chopped broccoli, thawed ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spray the inside of slow cooker with cooking spray.\nStir uncooked macaroni and vegetable oil together in the slow cooker until pasta is coated.\nStir Cheddar cheese, evaporated milk, milk, broccoli, salt, and black pepper with macaroni until fully combined.\nCover the cooker and cook on Low until macaroni is tender and the sauce is bubbling, 2 1/2 to 3 hours, stirring often to reduce sticking.\n",
        "picture_link": "JaS/9ep2nOBitZ1dKqxUK4foSfBn/nO"
    },
    {
        "title": "Chele's Halibut",
        "ingredients": [
            "2 pounds halibut steak, 1 1/2-inch thickness ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1/2 cup chopped green onions ADVERTISEMENT",
            "2 tablespoons butter, softened ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground white pepper ADVERTISEMENT",
            "1 pinch dried dill weed ADVERTISEMENT",
            "1/3 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nGrease the inside of a 9x13-inch baking dish with butter.\nPlace halibut in the prepared baking dish.\nMix sour cream, green onions, butter, salt, white pepper, and dill in a bowl.\nSpread sour cream mixture over halibut.\nBake halibut in preheated oven until fish flakes easily with a fork, 20 to 25 minutes.\nRemove halibut from the oven and sprinkle with Parmesan cheese.\nPlace oven rack about 6 inches from broiler heat source and turn on oven's broiler.\nPlace under preheated broiler and broil until cheese is lightly browned, 2 to 3 minutes.\n",
        "picture_link": "4pXkFCi63HHy2/a7YgLyEwN5iHhw2Vq"
    },
    {
        "title": "Chocolate Mint Sugar Cookie Drops",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "3/4 cup vegetable oil ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "2 cups mint chocolate chips ADVERTISEMENT",
            "1/4 cup white sugar for decoration ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl, mix together 1 cup sugar and vegetable oil. Stir in the egg and vanilla until smooth. Combine the flour, baking powder and salt; gradually stir into the sugar mixture. Mix in mint chocolate chips. Roll the dough into walnut sized balls. Roll each ball in the remaining 1/4 cup of sugar to coat. Place the cookies 2 inches apart onto the cookie sheet.\nBake for 8 to 10 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n",
        "picture_link": "K6L8V6A9FuvpN4aZsSUSzgziniKeTkK"
    },
    {
        "title": "Smothered Pork",
        "ingredients": [
            "4 pork chops ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed cream of mushroom soup ADVERTISEMENT",
            "1 small onion, sliced ADVERTISEMENT",
            "garlic salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace pork chops in a cooking dish. Cover with mushroom soup and sliced onion rings. Sprinkle with garlic salt if desired. Cover with foil and bake in oven for 50 minutes or until pink is gone.\n",
        "picture_link": "Fl37nVQmEjIGAP1ZUWaV/ywgExy45iW"
    },
    {
        "title": "Sugar Glazed Salmon",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 teaspoon water ADVERTISEMENT",
            "1/2 cup red wine vinegar ADVERTISEMENT",
            "2 cloves crushed garlic ADVERTISEMENT",
            "1 teaspoon garlic salt ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper ADVERTISEMENT",
            "2 teaspoons dried basil ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 1/3 pounds salmon fillet ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a shallow baking pan, combine the olive oil, water, red wine vinegar, garlic, garlic salt, black pepper and basil. Place salmon filet in the marinade meat side down, if skin is still on. Marinate for 30 minutes.\nPreheat an outdoor grill for medium heat and lightly oil grate.\nCoat the salmon filet lightly with sugar. Place on grill and cook 12 minutes per side. Baste with marinade periodically while cooking. Salmon is done, when it flakes easily with a fork.\n",
        "picture_link": "DiRmz.5Z1yU/LcTQ6K8YWhNweTWxVnG"
    },
    {
        "title": "Yeast Doughnuts",
        "ingredients": [
            "3 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 (.25 ounce) packages active dry yeast ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 quarts oil for deep frying ADVERTISEMENT",
            "1 cup confectioners' sugar for dusting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large mixing bowl combine 1 3/4 cups flour with yeast. In a saucepan heat milk, sugar, butter and salt until butter melts. Stir milk mixture into flour along with eggs, beating with a heavy-duty electric mixer on low for 30 seconds, just to combine. Increase speed to high and beat 3 minutes. Add the remaining flour, a little at a time, stirring with a spoon to make a firm but pliable dough. Knead dough on lightly-floured work surface 4 to 5 minutes until smooth and supple. Transfer to an oiled bowl. Cover and let dough rise until it doubles in size, about 1 hour.\nTurn dough out onto floured surface, punch down and roll out to 1 /2- inch thickness. Cut out doughnuts with a floured doughnut cutter; re roll trimmings and cut them into doughnuts as well. Transfer doughnuts to baking sheets, cover and let rise 45 minutes.\nHeat oil in a deep-fryer to 360 degrees F (180 degrees C). Fry doughnuts, in batches, turning several times, until golden all over. Using a slotted spoon remove doughnuts to a rack to drain. Let doughnuts cool and dredge in confectioners' sugar.\n",
        "picture_link": "ub47nBgZI1NYkbJb5cfHmcrrNNpYp3y"
    },
    {
        "title": "Healthier Soft Oatmeal Cookies",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "3/4 cup packed brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 cup whole wheat flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 cup diced, pitted dates ADVERTISEMENT",
            "3 cups rolled oats ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat butter, white sugar, and brown sugar with an electric mixer in a large bowl until smooth. Add eggs, one at a time, allowing each egg to blend into the butter mixture before adding the next. Beat in vanilla extract. Combine all-purpose flour, whole wheat flour, baking soda, salt, and cinnamon in a separate bowl; stir into butter mixture. Fold in oats and dates. Cover and chill dough for at least one hour.\nPreheat oven to 375 degrees F (190 degrees C). Grease two baking sheets.\nRoll dough into walnut-sized balls and place 2 inches apart onto baking sheets. Flatten each cookie with a large fork.\nBake in preheated oven until cookies are golden brown, 8 to 10 minutes. Allow cookies to cool on baking sheet for 5 minutes before transferring to a wire rack to cool completely.\n",
        "picture_link": "2Lwus.4/JJ.rLGji/qZZiXDQ5E8OYZ6"
    },
    {
        "title": "Kristen's Potato Leek Soup",
        "ingredients": [
            "1/4 tablespoon salted butter ADVERTISEMENT",
            "6 leeks, trimmed and chopped ADVERTISEMENT",
            "3 cups chicken stock ADVERTISEMENT",
            "4 large potatoes, peeled and cubed ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "1 teaspoon sea salt, or to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large pot over medium heat. Cook and stir leeks in the melted butter until softened, about 15 minutes.\nStir in chicken stock and potatoes and bring to a boil. Reduce heat and simmer until potatoes are tender, about 20 minutes.\nPour about half of the soup into a blender, filling the pitcher no more than halfway full. Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender, using a few quick pulses to get the soup moving before leaving it on to puree. Pour the pureed soup back into the pot.\nStir in heavy cream and season with sea salt and black pepper.\n",
        "picture_link": "a4FuphsOrEWLe64.dxJOdIx1204UeZW"
    },
    {
        "title": "Moscow Mule Cocktail",
        "ingredients": [
            "1 1/2 fluid ounces vodka ADVERTISEMENT",
            "1/2 fluid ounce lime juice ADVERTISEMENT",
            "ice cubes ADVERTISEMENT",
            "1/2 cup ginger beer ADVERTISEMENT",
            "1 lime wedge for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour vodka and lime juice into a mug; add ice cubes and ginger beer. Stir to combine.\nDrop a lime wedge into the mug for garnish.\n",
        "picture_link": "k8wwR/PWrnWu5Ff19qbtC.B6M7L0MbW"
    },
    {
        "title": "Kashmiri Lamb",
        "ingredients": [
            "4 dried red chile peppers (such as cayenne) ADVERTISEMENT",
            "3 long, green fresh chile peppers (such as Indian Jwala) ADVERTISEMENT",
            "1 teaspoon cumin seeds ADVERTISEMENT",
            "1 teaspoon Kashmiri garam masala ADVERTISEMENT",
            "1 (1 inch) piece fresh ginger root, peeled and grated ADVERTISEMENT",
            "5 cloves garlic, crushed ADVERTISEMENT",
            "1/4 cup dried unsweetened coconut ADVERTISEMENT",
            "3 tomatoes, chopped ADVERTISEMENT",
            "6 tablespoons vegetable oil ADVERTISEMENT",
            "2 large onions, thinly sliced ADVERTISEMENT",
            "2 pounds lamb meat, cut into 1 1/2-inch cubes ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "1 cup plain yogurt ADVERTISEMENT",
            "1/2 teaspoon saffron threads ADVERTISEMENT",
            "20 whole blanched almonds ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place red chiles, green chiles, cumin seeds, garam masala, ginger, garlic, grated coconut, and tomatoes into a blender; pulse several times to chop, then blend into a smooth paste.\nHeat vegetable oil in a large skillet or Dutch oven over medium heat. Stir in onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Reduce heat to medium-low, and continue cooking and stirring until the onion is very tender and golden brown, 10 to 15 minutes more.\nStir the spice paste into the onion and cook and stir until the oil separates from the mixture, about 3 minutes.\nStir in lamb pieces and salt. Cook, stirring frequently over medium-high heat, until the lamb pieces are browned on all sides, about 8 minutes.\nMix in yogurt, saffron, and blanched almonds until well combined.\nReduce the heat to low and simmer, covered, until the meat is tender and the gravy is thick, about 1 hour.\nGarnish the curry with chopped cilantro before serving.\n",
        "picture_link": "S/hA8t5.OGPqX7mqMxvfNt8SRjo2x22"
    },
    {
        "title": "Cole Porter Slaw",
        "ingredients": [
            "3 tablespoons apple cider vinegar ADVERTISEMENT",
            "3 tablespoons buttermilk ADVERTISEMENT",
            "3/4 cup mayonnaise ADVERTISEMENT",
            "1/4 cup light brown sugar ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "1 teaspoon chopped fresh parsley ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1/4 cup diced onion ADVERTISEMENT",
            "1 (16 ounce) package packaged coleslaw mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the vinegar, buttermilk, mayonnaise, and brown sugar until the sugar is dissolved. Stir in the mustard, parsley, and salt. Add the onion and coleslaw mix and stir to coat. Chill in refrigerator at least 15 minutes before serving.\n",
        "picture_link": "u4mRb.V5wvISefwKMMm4rTmm9Ph9Qya"
    },
    {
        "title": "Mamacita's Mexican Rice",
        "ingredients": [
            "1 cup long-grain white rice ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 onion, minced ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 1/2 cups chicken broth ADVERTISEMENT",
            "1 tomato, seeded and diced ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon Spanish saffron ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 cup frozen peas and carrots, thawed ADVERTISEMENT",
            "1 sprig fresh cilantro (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook and stir rice and oil in a skillet over medium heat until lightly toasted, about 2 minutes. Add onion and cook for 2 minutes. Add garlic and cook until fragrant, about 1 minute.\nPour chicken broth into rice mixture and bring to a boil; stir tomato, cumin, saffron, salt, and black pepper into broth and bring to a boil. Cover, reduce heat to low, and simmer until rice is cooked, about 20 minutes.\nStir peas and carrots into cooked rice; garnish with cilantro.\n",
        "picture_link": "9iLxDRZxWZ1oxwp31PQ1DMZnvtiuWwm"
    },
    {
        "title": "Arroz Con Pollo",
        "ingredients": [
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 (4 to 6 pound) whole chicken, cut into pieces ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 cloves garlic ADVERTISEMENT",
            "1 (14.5 ounce) can stewed tomatoes ADVERTISEMENT",
            "1 cup rice ADVERTISEMENT",
            "2 teaspoons salt, or to taste ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "2 cups chicken stock, or as needed to cover ADVERTISEMENT",
            "1 cup green peas ADVERTISEMENT",
            "1/2 cup sliced black olives ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1/4 cup chopped pimento peppers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nHeat vegetable oil in a Dutch oven over medium heat; cook and stir chicken pieces until browned, 5 to 10 minutes. Remove chicken with a slotted spoon and place on a plate. Cook and stir onion, green bell pepper, minced garlic, and whole garlic cloves in the same Dutch oven until onion is softened, about 5 minutes.\nReturn chicken to the onion mixture. Add tomatoes, rice, salt, oregano, black pepper, and bay leaf. Pour in enough chicken stock to cover all the ingredients.\nBake chicken-rice mixture in the preheated oven until rice is tender and chicken is no longer pink in the center and the juices run clear, about 1 hour and 30 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).\nStir peas, olives, raisins, and pimento peppers into the chicken-rice mixture. Bake until warmed through, an additional 15 minutes.\n",
        "picture_link": "/7QFMNB9OEruZrtADT.czVDn6FfrhOq"
    },
    {
        "title": "Joe's Special Scramble",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 pounds ground beef ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "1 (8 ounce) package sliced fresh mushrooms ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped spinach, thawed and drained ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large skillet over medium-high heat. Add the ground beef, and cook, stirring to crumble, until no longer pink, about 8 minutes. Pour off any excess grease, then stir in the garlic, onions, and mushrooms. Reduce heat to medium, cover, and cook until the onion has softened and turned translucent, about 5 minutes. Stir in the nutmeg, oregano, spinach, salt, and pepper and cook until the spinach is heated through.\nReduce heat to medium-low, and make 6 egg-sized indentations into the beef and spinach mixture. Crack the eggs into the each indentation, then cover, and continue cooking until the eggs are done to your liking, about 5 minutes more for medium.\n",
        "picture_link": "w22WcFQUVw8YVGFXkfJvikOvKie4IhG"
    },
    {
        "title": "Ladybug's Poppy Seed Chicken Casserole ",
        "ingredients": [
            "6 ounces buttery round crackers, crumbled ADVERTISEMENT",
            "1 cup butter, melted ADVERTISEMENT",
            "2 tablespoons poppy seeds ADVERTISEMENT",
            "8 skinless, boneless chicken breast halves, cooked and cut into bite-sized pieces ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed cream of chicken soup ADVERTISEMENT",
            "8 ounces sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix together the cracker crumbs, melted butter, and poppy seeds in a bowl. Layer the bottom of a 9x13-inch glass baking dish with 2/3 of the cracker mix. Mix the chicken breast pieces with cream of chicken soup and sour cream until thoroughly combined, and spoon the mixture on top of the crumb crust. Sprinkle remaining 1/3 of the cracker mix over the top of the chicken mixture.\nBake in the preheated oven until the casserole is hot and bubbling, about 1 hour.\n",
        "picture_link": "EFaZqYsQdQnjoxMtpt.AZINBLTy170m"
    },
    {
        "title": "Pumpkin Cheesecake Squares",
        "ingredients": [
            "2/3 (18 ounce) package refrigerated sugar cookie dough ADVERTISEMENT",
            "1 (10 ounce) package cinnamon chips ADVERTISEMENT",
            "3 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "3/4 cup sugar ADVERTISEMENT",
            "1 teaspoon pumpkin pie spice ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup canned solid-pack pumpkin ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPat the cookie dough into a 9x13 inch baking dish to cover the bottom, and sprinkle evenly with the cinnamon chips. Bake in the preheated oven until the crust is lightly browned, 12 to 14 minutes.\nMeanwhile, beat together the cream cheese, sugar, pumpkin pie spice, and vanilla until smooth with an electric mixer. Beat in the pumpkin until combined, then beat in the eggs until the mixture is smooth. Pour into the baking dish, and return to the oven. Continue baking until the center of the mixture has set, 30 to 35 minutes.\nCool the baking dish on a wire rack to room temperature, then refrigerate until cold, about 4 hours. Cut into 18 squares to serve.\n",
        "picture_link": "gQ7cbnk08K0jQ9FqTpC0whyAu9NFo/m"
    },
    {
        "title": "Beer Cheese Philly Steak Casserole",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 green bell peppers, sliced ADVERTISEMENT",
            "1 large onion, sliced thin ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 pounds rib-eye steak, sliced thin ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "3/4 loaf Italian bread, cut into 1 inch cubes ADVERTISEMENT",
            "5 tablespoons butter ADVERTISEMENT",
            "1/4 cup flour ADVERTISEMENT",
            "1 (12 fluid ounce) can or bottle beer ADVERTISEMENT",
            "2 teaspoons hot pepper sauce ADVERTISEMENT",
            "1 1/2 teaspoons ground black pepper ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon dried parsley ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "1/2 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1/2 teaspoon soy sauce ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "1 cup shredded Monterey Jack cheese ADVERTISEMENT",
            "1 cup shredded American cheese ADVERTISEMENT",
            "8 ounces provolone cheese, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nHeat 1 tablespoon olive oil in a skillet over medium-low heat; add the bell pepper and onion to the skillet; season with 1/2 teaspoon salt, 1/2 teaspoon garlic powder, and 1/4 teaspoon pepper and cook until soft, about 20 minutes; set aside.\nPour 1 tablespoon olive oil into the skillet and raise the heat to medium; add the sliced steak to the hot oil until; season with 1/2 teaspoon salt, 1/2 teaspoon garlic powder, and 1/4 teaspoon pepper and cook until no longer pink, about 5 minutes. Remove from heat immediately.\nArrange the bread cubes in the bottom of a 9x13 dish. Layer the steak on the bread and then layer the pepper and onion mixture atop the steak; set aside.\nMelt the butter in a saucepan. Whisk in the flour to make a paste. Pour in the beer, whisking continually until there are no lumps. Stir in the 1 1/2 teaspoons black pepper, 1 teaspoon garlic powder, parsley, onion powder, 1/2 teaspoon salt, paprika, Worcestershire sauce, soy sauce; stir. As the mixture thickens, pour in the milk. Add the Monterey Jack cheese and American cheese; stir until the cheese is melted. Pour the mixture over the assembled ingredients in the 9x13 pan. Top with provolone cheese slices.\nBake in preheated oven until the provolone cheese melts, about 20 minutes.\n",
        "picture_link": "2IeyRP4MDdy3NdR9CCzMEvLIm.MaW1m"
    },
    {
        "title": "Kale Orange Banana Smoothie",
        "ingredients": [
            "1 orange, peeled ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 leaf kale, torn into several pieces ADVERTISEMENT",
            "2 ripe bananas, peeled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend the orange in a blender until mostly juice.\nAdd the water and kale; blend again on High speed until kale is liquefied.\nBreak the bananas into chunks and add to the blender. Start blending on a lower speed until the banana is incorporated. Increase speed to blend the mixture into a pudding-like texture.\n",
        "picture_link": "CaOl8COuyamK42aWmKxjS3YPhDIim8q"
    },
    {
        "title": "Ke's Cajun (Dirty) Rice",
        "ingredients": [
            "1 1/2 cups water ADVERTISEMENT",
            "2/3 cup uncooked brown rice ADVERTISEMENT",
            "1/2 pound ground turkey ADVERTISEMENT",
            "1/2 cup chopped green bell pepper ADVERTISEMENT",
            "1/3 cup chopped onion ADVERTISEMENT",
            "1/2 teaspoon minced garlic ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon dried celery flakes ADVERTISEMENT",
            "1 teaspoon Cajun seasoning ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "1 pinch salt, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring 1 1/2 cup of water to a boil in a saucepan, and stir in the brown rice. Reduce the heat to a simmer, cover, and simmer until the rice is tender and the liquid has been absorbed, 40 to 50 minutes. Set the rice aside.\nPlace ground turkey into a skillet over medium heat, and cook and stir the turkey until the meat gives up some of its fat, 2 to 3 minutes; stir in green bell pepper, onion, and minced garlic. Cook and stir until the turkey is crumbly and no longer pink and the vegetables are tender, 5 to 8 more minutes. Drain excess grease, if necessary. Stir in the cooked brown rice, garlic powder, celery flakes, Cajun seasoning, black pepper, and 1/3 cup water.\nBring the mixture to a simmer, and cook until the liquid is absorbed, about 10 minutes. Season to taste with salt and additional black pepper, if desired.\n",
        "picture_link": "Ral/oPm4t09SPmS8gcutx6/NzCn1p/y"
    },
    {
        "title": "Chocolate Chip Bundt Cake",
        "ingredients": [
            "1 cup all purpose flour ADVERTISEMENT",
            "1 cup sugar, plus ADVERTISEMENT",
            "2 tablespoons sugar ADVERTISEMENT",
            "1/2 cup Ghirardelli Unsweetened Cocoa Powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "6 tablespoons unsalted butter, very soft but not melted ADVERTISEMENT",
            "2 tablespoons flavorless vegetable oil (such as canola or safflower) ADVERTISEMENT",
            "2 large eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup cool water ADVERTISEMENT",
            "1/2 cup Ghirardelli Semi-Sweet Mini Chips ADVERTISEMENT",
            "For the Glaze: ADVERTISEMENT",
            "1 cup Ghirardelli Semi-Sweet Mini Chips ADVERTISEMENT",
            "2/3 cup heavy cream ADVERTISEMENT",
            "2 tiny pinches salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Position a rack in the lower third of the oven. Preheat the oven to 325 degrees. Grease a 6-cup tube pan thoroughly. If using an 8x2-inch round cake pan, line the bottom with a circle of parchment paper.\nIn a large mixing bowl, thoroughly mix the flour, sugar, cocoa powder, baking soda, and salt for 60 seconds on low speed with the electric mixer. Add the butter, eggs, oil, vanilla, and 2 tablespoons of the water. Beat on low speed just until all of the dry ingredients are moist.\nTurn the mixer to medium speed and beat for 1 minute. Scrape the bottom and sides of the bowl. Add 3 tablespoons water and beat for 20 seconds on medium speed. Scrape the bowl and add the remaining 3 tablespoons water. Beat for 20-30 seconds until the batter is smooth. Fold in the chocolate chips. Scrape the batter into the pan and spread it evenly.\nBake 35-40 minutes (do not open the oven for the first 30 minutes) or until a toothpick inserted into a cakey place in the center of the cake comes out clean (except for melted chocolate chips).\nSet the pan on a rack to cool for ten minutes. Invert the cake onto rack (turn the round cake right side up) to cool completely.\nTo make the glaze, start by placing the chocolate chips in a medium bowl. Bring the cream and salt to a simmer in a medium saucepan. Pour the cream over the chocolate. Wait 60 seconds to soften the chocolate, and then stir until the chocolate is entirely melted and the mixture is smooth. Cool to thicken slightly. Pour glaze over cooled cake and let set at room temperature.\n",
        "picture_link": "/k3K1FssFN8f6TfPTE/WeRr.7d/SgSS"
    },
    {
        "title": "Easy Fish Tacos with Mango-Pineapple Slaw",
        "ingredients": [
            "1 pound cod fillets ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 cup red wine vinegar ADVERTISEMENT",
            "1/4 cup reduced-fat mayonnaise ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "3 cups shredded cabbage ADVERTISEMENT",
            "1/2 cup chopped fresh mango ADVERTISEMENT",
            "1/2 cup chopped fresh pineapple ADVERTISEMENT",
            "1/2 cup chopped red onion ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "1 fresh jalapeno pepper, chopped ADVERTISEMENT",
            "8 (8 inch) flour tortillas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C).\nPlace cod fillets on a large sheet of aluminum foil; pour lemon juice over fish and season with salt and black pepper to taste. Fold the foil around the fish and seal to create a pouch; place pouch in a baking dish.\nBake in the preheated oven until the fish flakes easily with a fork, about 20 minutes.\nMeanwhile, whisk vinegar, mayonnaise, sugar, 1 tablespoon salt, 1 tablespoon black pepper, and garlic powder in a bowl until smooth. Combine cabbage, mango, pineapple, red onion, cilantro, and jalapeno in large bowl. Pour dressing over vegetables and fruit; toss to combine. Cover and refrigerate slaw until ready to serve.\nDivide fish evenly among flour tortillas. Spoon slaw over fish to serve.\n",
        "picture_link": "6f1HJfKYqnUsvmCFCIjsddKFh/kPS36"
    },
    {
        "title": "'Secret' Salad Dressing",
        "ingredients": [
            "1/2 cup ketchup ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "1/4 cup white vinegar ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/4 cup diced onion ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the ketchup, vegetable oil, mayonnaise, vinegar, sugar, onion, salt, and pepper in a blender; blend until smooth. Store in refrigerator.\n",
        "picture_link": "Lnto2Q/q7/ODAdL2Fp.Lme.faHtjrOe"
    },
    {
        "title": "Magnificent Macaroni Salad",
        "ingredients": [
            "3 cups elbow macaroni ADVERTISEMENT",
            "1 1/2 cups mayonnaise ADVERTISEMENT",
            "1/3 large onion, minced ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "2 tablespoons prepared yellow mustard ADVERTISEMENT",
            "2 teaspoons rice vinegar ADVERTISEMENT",
            "1 teaspoon white sugar, or more to taste ADVERTISEMENT",
            "3/4 teaspoon celery seed ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3 hard-cooked eggs, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally, until cooked through but firm to the bite, 8 minutes; drain.\nRinse macaroni in cold water until cool; drain.\nStir mayonnaise, onion, parsley, mustard, rice vinegar, sugar, celery seed, and salt together in a bowl; add macaroni and eggs and stir to coat.\nChill in refrigerate for 30 minutes before serving.\n",
        "picture_link": "fL0M6PnhDYM5m8lhpLF0fH6Bd6jVVK2"
    },
    {
        "title": "Easy Butter Chicken",
        "ingredients": [
            "4 boneless skinless chicken breast halves ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 teaspoon dried tarragon ADVERTISEMENT",
            "1 tablespoon fresh lemon juice ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 400 degrees F (200 degrees C).\nSeason the chicken with salt, pepper and tarragon; drizzle with lemon juice. Set aside.\nPlace an oven proof skillet or Dutch oven over medium heat and melt the butter. Place the chicken in the dish, turning to coat both sides. Cover the chicken with a sheet of parchment paper, and then cover with a lid.\nBake in the preheated oven for 10 to 15 minutes, or until chicken is cooked through.\n",
        "picture_link": "9LBkN66qcfvnDz.9DhpiJ1kZ/6IexGi"
    },
    {
        "title": "Spicy Roasted Pumpkin Seeds",
        "ingredients": [
            "3 cups pumpkin seeds ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 tablespoon seasoned salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 300 degrees F (150 degrees C).\nIn a medium bowl, mix together the pumpkin seeds, butter, garlic powder, salt and seasoned salt until the pumpkin seeds are evenly coated. Spread in an even layer on a cookie sheet.\nBake for 1 hour and 15 minutes, stirring every 10 to 15 minutes until toasted. Cool completely on the baking sheet, then transfer to a serving dish.\n",
        "picture_link": "gs.rlofEneervYjWj0buiiKKTJeDK16"
    },
    {
        "title": "Emily's Strawberry Balsamic Salad",
        "ingredients": [
            "1/4 cup balsamic vinegar ADVERTISEMENT",
            "1 1/2 tablespoons Dijon mustard ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1 small shallot, peeled and chopped ADVERTISEMENT",
            "2 small cloves garlic, peeled ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "1 head red lettuce leaves, rinsed, dried, and torn ADVERTISEMENT",
            "1/2 small red onion, peeled, cut into 1/2-inch-wide slivers ADVERTISEMENT",
            "1/4 cup sliced almonds, lightly toasted ADVERTISEMENT",
            "1 pint fresh strawberries, rinsed and sliced ADVERTISEMENT",
            "1/2 cup crumbled feta cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To make the dressing, place the balsamic vinegar, Dijon mustard, honey, shallot, garlic, salt, and pepper in the bowl of a mini food processor. Pulse until blended. Slowly pour in the olive oil, and pulse again until thoroughly blended. Set aside or refrigerate until needed.\nDivide lettuce between 6 serving plates, and top with red onion, almonds, strawberries, and feta cheese. Serve dressing on the side.\n",
        "picture_link": "byFclsrwhTENKJo39vlUlauCE6LBJGS"
    },
    {
        "title": "Classic Slow Cooker Corn Chowder",
        "ingredients": [
            "3 cups milk ADVERTISEMENT",
            "2 (14.75 ounce) cans cream-style corn ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed cream of mushroom soup ADVERTISEMENT",
            "2 (4 ounce) cans chopped green chiles ADVERTISEMENT",
            "2 cups frozen corn ADVERTISEMENT",
            "2 cups frozen shredded hash brown potatoes ADVERTISEMENT",
            "2 cups cubed cooked ham ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons hot sauce ADVERTISEMENT",
            "2 teaspoons dried parsley ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir milk, cream-style corn, cream of mushroom soup, chopped green chiles, frozen corn, hash brown potatoes, ham, onion, butter, hot sauce, parsley, and chili powder in a slow cooker. Season with salt and black pepper. Cover and cook on High for 4 hours or on Low and for 6 hours.\n",
        "picture_link": "IxbMRtxuMfmpa1aoWWdYxe5pjn8qB/e"
    },
    {
        "title": "Cheesy Kale Chips",
        "ingredients": [
            "2 tablespoons extra virgin olive oil ADVERTISEMENT",
            "1 bunch curly kale, torn ADVERTISEMENT",
            "1/2 cup nutritional yeast ADVERTISEMENT",
            "1/3 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 200 degrees F (95 degrees C).\nDrizzle olive oil over the kale in a large bowl and sprinkle with the nutritional yeast and salt. Stir with your hands to coat kale.\nSpread kale onto baking sheets.\nBake in preheated oven until kale begins to get slightly crisp; rotate racks and flip the chips, and continue baking until completely crisp, 45 to 60 minutes total. Make sure to keep an eye on them to make sure they don't burn; if you notice certain chips ready much sooner than others, take them out.\n",
        "picture_link": "RxL5VdBEcYOijMO57QBsRBn1Tk4LS8i"
    },
    {
        "title": "Exotic Mushroom and Walnut Pate",
        "ingredients": [
            "1 cup walnuts ADVERTISEMENT",
            "1/2 cup minced shallots ADVERTISEMENT",
            "1/2 cup unsalted butter ADVERTISEMENT",
            "1/4 pound shiitake mushrooms, chopped ADVERTISEMENT",
            "1/4 pound crimini mushrooms, chopped ADVERTISEMENT",
            "1/4 pound portobello mushrooms, chopped ADVERTISEMENT",
            "1 tablespoon roasted garlic puree ADVERTISEMENT",
            "1/4 cup chopped fresh Italian parsley ADVERTISEMENT",
            "1 tablespoon chopped fresh thyme ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon white pepper ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spread walnuts in a single layer on a cookie sheet. Toast for 10 minutes, or until fragrant and lightly browned.\nIn a large saute pan, cook shallots in butter over medium heat until translucent. Then add chopped mushrooms, garlic, parsley, thyme, salt, and pepper. Cook, stirring often, until most of the liquid has evaporated.\nProcess toasted walnuts and olive oil in a blender or food processor until mixture forms a thick paste. Spoon in the cooked mushroom mixture, and process to desired texture.\nPack mixture into well-oiled ramekins or bowl. Cover with plastic wrap, and refrigerate for a few hours or overnight.\n",
        "picture_link": "0mrIEgivzaRb7YemcM8Fv1h5nPk6DFy"
    },
    {
        "title": "Mashed Potato Tacos",
        "ingredients": [
            "2 cups dry potato flakes ADVERTISEMENT",
            "6 hard taco shells ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/2 cup French-fried onions ADVERTISEMENT",
            "taco sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare the dry potato flakes according to package directions. Warm the taco shells according to package directions.\nIn a bowl, mix the prepared mashed potatoes, butter, sour cream, Cheddar cheese, and French-fried onions.\nFill the taco shells with the mashed potato mixture, and serve with taco sauce.\n",
        "picture_link": "6zS6QXYlQVnhvYhkccLzfbOS0L4VQ/O"
    },
    {
        "title": "Curried Chicken and Potatoes",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 teaspoon cumin seed ADVERTISEMENT",
            "1/2 teaspoon garam masala ADVERTISEMENT",
            "1/4 teaspoon ground cardamom ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1/2 teaspoon black mustard seed ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 (4 ounce) chicken thighs, cut into bite size pieces ADVERTISEMENT",
            "2 medium potatoes, diced ADVERTISEMENT",
            "2 roma (plum) tomatoes, diced ADVERTISEMENT",
            "1/2 bunch Swiss chard, chopped ADVERTISEMENT",
            "1 (8 ounce) container plain yogurt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet, heat oil over medium heat. In hot oil, cook cumin seeds, garam masala, cardamom, cayenne pepper, mustard seeds, salt, and garlic. When seeds start to pop, stir in chicken and potatoes. Cook for 15 minutes, or until chicken is nearly done.\nStir in tomatoes, chard, and yogurt. Cover, and cook 15 minutes more, or until potatoes are tender and chicken is cooked through.\n",
        "picture_link": "FQM/874tISi1s2SAdlCqzc0NJjmgTOC"
    },
    {
        "title": "Braised Celery",
        "ingredients": [
            "1 bunch celery, cleaned and cut into 4 inch pieces ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon pepper ADVERTISEMENT",
            "2 tablespoons butter or margarine ADVERTISEMENT",
            "1 cube chicken bouillon ADVERTISEMENT",
            "1 cup boiling water ADVERTISEMENT",
            "1 tablespoon minced fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Arrange the celery in a single layer on the bottom of a large skillet. Season with salt and pepper. Dot with butter. Dissolve the bouillon cube in boiling water, and pour over the celery.\nCover pan, and bring to a boil over medium-high heat. Reduce heat to low, and simmer for 30 minutes. Sprinkle with parsley before serving.\n",
        "picture_link": "hCkq32g9omdZdGCZy33Sfk6C.CC1o9O"
    },
    {
        "title": "Garlic and Leek Ditalini",
        "ingredients": [
            "8 ounces ditalini pasta ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 cup chopped leek ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "1 cup freshly grated Romano cheese ADVERTISEMENT",
            "1 pinch black pepper (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nMelt butter in a large skillet over low heat. Saute leeks and garlic until tender and translucent. Stir in cream, and simmer until thickened. Toss with pasta and cheese until evenly coated and cheese is melted. Season with pepper.\n",
        "picture_link": "HomR/kEZMUIGdHtTKhr/DmSrJptj9ni"
    },
    {
        "title": "Divine Asparagus",
        "ingredients": [
            "2 tablespoons butter or olive oil ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1 bunch fresh asparagus spears, trimmed and cut into 2-inch pieces ADVERTISEMENT",
            "1/4 cup raisins ADVERTISEMENT",
            "1/4 cup red wine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large skillet over medium heat. Saute garlic in the butter until fragrant. Add the asparagus, cover, and cook for 2 minutes, then pour in the wine, and add the raisins. Cook uncovered until wine has evaporated and asparagus is tender, about 4 minutes. Serve hot.\n",
        "picture_link": "L6oCLC4R1yT9sWztozkOc09fVpZYPMq"
    },
    {
        "title": "Alphabet Soup",
        "ingredients": [
            "1 pound ground round ADVERTISEMENT",
            "3 cubes beef bouillon ADVERTISEMENT",
            "3 cups hot water ADVERTISEMENT",
            "1 (46 fluid ounce) bottle spicy vegetable juice cocktail ADVERTISEMENT",
            "1 pound frozen mixed vegetables, thawed ADVERTISEMENT",
            "8 ounces uncooked alphabet pasta ADVERTISEMENT",
            "6 cups water ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the meat in a large stock pot, and cook over medium-high heat until evenly brown. Drain the meat, except for about 2 tablespoons of the juices.\nDissolve the bouillon cubes in 3 cups of hot water, and add to the stock pot with the meat. Stir in spicy vegetable juice cocktail, mixed vegetables, alphabet pasta, and 6 cups of water. Simmer 20 minutes, or until pasta is tender. Season to taste with salt and pepper, and serve.\n",
        "picture_link": "KT76UZDizsGi1GCdvIlU2J2W4zG35I."
    },
    {
        "title": "Trini Style Chicken",
        "ingredients": [
            "2 1/2 pounds bone-in chicken pieces ADVERTISEMENT",
            "2 tablespoons garlic powder ADVERTISEMENT",
            "1 tablespoon sea salt ADVERTISEMENT",
            "1 tablespoon cayenne pepper ADVERTISEMENT",
            "1 (.18 ounce) packet sazon seasoning ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "3 bok choy stalks, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together the garlic powder, salt, cayenne pepper, and sazon seasoning in a shallow dish. Coat chicken pieces with this mixture.\nHeat a Dutch oven or heavy skillet with a lid over medium heat for at least 3 minutes. Sprinkle the sugar over the bottom of the pan, and stir gently until it becomes liquid and caramelizes. Add the chicken, cover, and cook for about 25 minutes.\nRemove cover, and cook for another 15 to 20 minutes, letting the juices cook down until they are almost gone. Add the bok choy, and cook just until wilted.\n",
        "picture_link": "7PwiH/IsMKeHyXMjKdxtvqiEHabiqgC"
    },
    {
        "title": "Spicy Squash Casserole",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "3 yellow squash, sliced ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3 jalapeno peppers, seeded and diced ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 cup crushed buttery round crackers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Melt butter in a large skillet over medium heat. Saute squash in butter until tender, about 10 minutes. Set aside.\nIn a large skillet, cook the ground beef, onion, and jalapeno, stirring until beef is evenly browned. Drain off grease. In a large bowl, mix together the squash, eggs, and mayonnaise. Stir in the ground beef mixture and Cheddar cheese. Season with salt and pepper. Pour into a 9x13 inch baking dish, and sprinkle cracker crumbs evenly over the top.\nBake for 20 minutes in the preheated oven, until heated through, and the top is nicely browned.\n",
        "picture_link": "E/PkwG6w5zG94xX6iniVvJYlZmNkAgK"
    },
    {
        "title": "Cindy's Country Style Creole Pork Roast",
        "ingredients": [
            "1 onion, cut into chunks ADVERTISEMENT",
            "1/2 green bell pepper ADVERTISEMENT",
            "2 stalks celery stalk, chopped ADVERTISEMENT",
            "3 cloves garlic ADVERTISEMENT",
            "2 tablespoons Creole seasoning, divided ADVERTISEMENT",
            "5 pounds boneless pork roast ADVERTISEMENT",
            "1/3 cup bacon grease ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Combine the onion, green pepper, celery and garlic in the container of a food processor or blender. Process until finely chopped. Stir in 1 tablespoon of the Creole seasoning.\nCut about 8 slits across the roast about 1/2 inch deep. Pack the vegetable mixture into the slits. Rub the remaining tablespoon of Creole seasoning all over the roast. Coat the roast generously with bacon grease, and place in a roasting pan.\nBake uncovered for 1 hour, until browned, then cover, and continue cooking for about 3 more hours, or until tender. After the roast is done, you can skim off some of the excess fat and thicken the drippings with a mixture of water and flour if you want your gravy thicker.\n",
        "picture_link": "R85nrZdpW3lvRyGuYLSWPuD5/TogzR."
    },
    {
        "title": "Citrus Scallops II",
        "ingredients": [
            "2 1/2 tablespoons olive oil ADVERTISEMENT",
            "1 pound bay scallops ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 cup white wine ADVERTISEMENT",
            "1 tablespoon chopped onion ADVERTISEMENT",
            "1 tablespoon chopped green bell pepper ADVERTISEMENT",
            "1 1/2 tablespoons chopped fresh dill ADVERTISEMENT",
            "4 cherry tomatoes, quartered ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1 tablespoon lemon zest ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a skillet over medium heat. Lightly coat the scallops in flour, and cook 1 to 2 minutes on each side, until lightly brown. Remove the scallops from the skillet, and drain excess oil. Stir in the white wine, scraping up the browned bits from the bottom of the skillet.\nMix the onion, green bell pepper, and dill into the skillet. Cook and stir for about 2 minutes. Mix in the tomatoes, lemon juice, and lemon zest. Continue cooking about 1 minute, then mix in the butter until melted. Cook and stir until the liquid has reduced by the desired amount. Return the scallops to the skillet, and cook just until heated through.\n",
        "picture_link": ".UtR4Etempvhv7AUv0KKoPCFbHL4vMK"
    },
    {
        "title": "Beet Salad",
        "ingredients": [
            "4 bunches fresh small beets, stems removed ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "2 tablespoons white wine vinegar ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "2 tablespoons Dijon mustard ADVERTISEMENT",
            "1 teaspoon dried thyme, crushed ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 medium heads Belgian endive ADVERTISEMENT",
            "1 pound spring lettuce mix ADVERTISEMENT",
            "1 cup crumbled feta cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C). Coat beets lightly with oil and roast for approximately 45 minutes, or until tender. Allow to cool thoroughly, then peel and dice.\nFor the dressing, place lemon, vinegar, honey, mustard, and thyme in a blender. While blender is running, gradually add 1/2 cup of oil. Season to taste with salt and pepper. Place spring lettuce mix in a salad bowl, pour desired amount of dressing over greens, and toss to coat.\nRinse endive, tear off whole leaves, and pat dry. Arrange 3 leaves on each plate. Divide dressed salad greens among them, and top with diced beets and feta cheese.\n",
        "picture_link": "Ri3/1z/uAvYRo4xT7hj86PUNa/qZVQq"
    },
    {
        "title": "Wine Baked Potato",
        "ingredients": [
            "1 medium baking potato ADVERTISEMENT",
            "1/2 medium onion, sliced ADVERTISEMENT",
            "1/4 teaspoon butter ADVERTISEMENT",
            "1/4 cup cooking sherry ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 450 degrees F (230 degrees C).\nMake several cuts crosswise across the potato, about 1/2 inch apart and not quite all the way through. Place half of an onion slice, and a piece of butter into each cut. Place the potato onto a sheet of aluminum foil, and form a bowl. Pour the cooking wine over the potato, and fold the foil around to seal, turning the ends up like a boat to keep the wine from spilling out.\nPlace the potato onto a baking sheet, and bake for 50 to 60 minutes, depending on the size of the potato. When done, cut through foil, and top with your favorite potato toppings or just salt and pepper.\n",
        "picture_link": "cxNvP8QXWmjM4ZVkMIXvZ5HD/7qHjHe"
    },
    {
        "title": "Broiled Grouper with Creamy Crab and Shrimp Sauce",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "1 1/2 cups heavy cream ADVERTISEMENT",
            "1 teaspoon Creole mustard ADVERTISEMENT",
            "2 (6 ounce) cans crabmeat, drained and flaked ADVERTISEMENT",
            "1 (4 ounce) can small shrimp, drained ADVERTISEMENT",
            "1 teaspoon Cajun seasoning ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 pounds grouper fillets ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "1 teaspoon chopped fresh parsley ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven broiler. Cover a medium baking dish with foil.\nMelt butter with cream in a saucepan over medium heat, and blend in Creole mustard. Cook and stir until thickened. Mix in crab and shrimp. Season with Cajun seasoning, salt, and pepper. Cook until heated through.\nPlace grouper in the prepared baking dish, and rub with olive oil, lemon juice, and parsley. Season with salt and pepper.\nBroil grouper about 4 minutes on each side, until easily flaked with a fork. Spoon the crab and shrimp mixture over fish to serve.\n",
        "picture_link": "Kuv6vob9fqtEz/7ZYh.lw.zoXlnq0Te"
    },
    {
        "title": "Billy's Favorite Gingerbread Spiced Coffee Syrup",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "1 cup sugar ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1 (1 inch) piece fresh ginger root, sliced ADVERTISEMENT",
            "1 cinnamon stick, broken into large pieces ADVERTISEMENT",
            "8 whole cloves ADVERTISEMENT",
            "1/2 teaspoon whole allspice berries ADVERTISEMENT",
            "1/2 teaspoon whole peppercorns ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan over medium-high heat, combine water, sugar, and honey. Stir in ginger, cinnamon stick, cloves, allspice, peppercorns, and nutmeg; bring to a boil. Reduce heat, cover, and simmer for 25 to 30 minutes. Let cool for 20 minutes, then strain through a fine mesh sieve, or double layer cheesecloth.\n",
        "picture_link": "94wQTQqgaK6H2Z1UWw2NQagH/9WwLdu"
    },
    {
        "title": "Pasta with Bacon and Peas",
        "ingredients": [
            "1 (16 ounce) package spaghetti ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/4 pound turkey bacon, cut into small pieces ADVERTISEMENT",
            "1/2 large onion, chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "2 (15 ounce) cans tomato sauce ADVERTISEMENT",
            "1 1/2 teaspoons chopped fresh parsley ADVERTISEMENT",
            "1/4 teaspoon dried basil ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon pepper ADVERTISEMENT",
            "1 (15 ounce) can peas, drained ADVERTISEMENT",
            "1/4 cup grated Romano cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nHeat oil in a large pot over medium heat. Saute bacon, onion and garlic until lightly browned. Stir in tomato sauce. Season with parsley, basil, garlic powder and pepper. Bring to a boil, reduce heat, and simmer 20 to 30 minutes, stirring occasionally. Stir in peas. Toss with pasta until evenly coated. Sprinkle top with Romano.\n",
        "picture_link": "j069BOCklF/pdjS.qLwaPVUoIJkdJrK"
    },
    {
        "title": "Ken's Scallops",
        "ingredients": [
            "1 teaspoon extra virgin olive oil ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 bunch fresh basil leaves, chopped ADVERTISEMENT",
            "20 scallops, rinsed and patted dry ADVERTISEMENT",
            "salt ADVERTISEMENT",
            "freshly ground black pepper ADVERTISEMENT",
            "1 wedge lemon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a skillet over medium-high heat. Cook garlic and basil in oil for about 30 seconds, and then add scallops. Season with salt and pepper, and squeeze lemon over the scallops. Cook for about 2 minutes, stirring frequently.\n",
        "picture_link": "A962GHI6wwYQa..jmcAZ4jBYLRPSnAS"
    },
    {
        "title": "Broccoli Chicken",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of broccoli soup ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large skillet over medium heat. Fry chicken breasts until cooked through, about 15 to 20 minutes.\nCombine the milk and cream of broccoli soup; pour over the chicken. Reduce heat to simmer and cook for a few more minutes. Stir in Cheddar cheese until well blended, and remove from heat. Serve immediately over rice or noodles.\n",
        "picture_link": "1xhwc2S5pvdPw.QuOlywKJxIGaSfeay"
    },
    {
        "title": "Waldorf Salad with Walnut Oil Vinaigrette",
        "ingredients": [
            "2 Red Delicious apples, cored and diced ADVERTISEMENT",
            "2 Granny Smith apples, cored and diced ADVERTISEMENT",
            "4 stalks celery, diced ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1 cup toasted walnuts ADVERTISEMENT",
            "2 tablespoons walnut oil ADVERTISEMENT",
            "1 tablespoon cider vinegar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss together the Red Delicious apples, Granny Smith apples, celery, raisins, and walnuts in a large bowl; set aside. In a small bowl, whisk together the walnut oil, cider vinegar, salt, and pepper. Toss the apples with the dressing to serve.\n",
        "picture_link": "zXm8.vMInfYKHaukiaDB4NRIKobSPgS"
    },
    {
        "title": "Marian's Fudge",
        "ingredients": [
            "2 (1 ounce) squares unsweetened baking chocolate ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Butter a 9x9 inch dish.\nIn a medium saucepan over medium heat, combine chocolate, butter and milk. Bring to a boil and let boil 1 minute. Stir in sugar and salt until dissolved. Heat, stirring constantly, to between 234 and 240 degrees F (112 to 116 degrees C), or until a small amount of syrup dropped into cold water forms a soft ball that flattens when removed from the water and placed on a flat surface. Remove from heat and stir in vanilla. Let cool 10 minutes.\nBeat fudge with a spoon until it loses its gloss. Pour quickly into the buttered dish. Refrigerate 30 minutes, until firm.\n",
        "picture_link": "8qAaaKQ6XQjtGM95N2esEulq1st9jF."
    },
    {
        "title": "Grandmother's Pork Chop Dinner",
        "ingredients": [
            "1/4 pound bacon ADVERTISEMENT",
            "4 pork chops ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "3 potatoes, peeled and cut into thick slices ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the bacon in a large, deep skillet with a lid, and cook over medium-high heat, turning occasionally, until cooked through but not crisp, about 6 minutes. Remove the bacon from the skillet and set aside.\nSear the pork chops until browned on each side.\nPlace the pork chops, onion, and potato slices into the skillet, and pour the water over the ingredients. Cover the skillet, bring to a boil over medium heat, reduce the heat, and simmer until the potatoes are tender, about 30 minutes. Sprinkle with salt and pepper, and serve.\n",
        "picture_link": "DB8SQxySS/bg9wZTo/bvDo57A5G1Rzy"
    },
    {
        "title": "Peanut Butter Cream Pie",
        "ingredients": [
            "1/2 (8 ounce) package cream cheese ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "1/3 cup smooth peanut butter ADVERTISEMENT",
            "1 cup frozen whipped topping, thawed ADVERTISEMENT",
            "1 (9 inch) prepared graham cracker crust ADVERTISEMENT",
            "1/4 cup finely chopped peanuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whip the cream cheese until soft and fluffy. Beat in the sugar and peanut butter.\nFold whipped topping into the peanut butter mixture. Pour filling into the pie shell. Sprinkle pie with chopped peanuts. Chill until firm.\n",
        "picture_link": "qt0sluTyNsNQF3Ullj/4cAuz2wQ7GCO"
    },
    {
        "title": "Blueberry Crumble Bars",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 cups quick cooking oats ADVERTISEMENT",
            "1 1/2 cups white sugar, divided ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "3/4 cup cold butter ADVERTISEMENT",
            "2 cups blueberries ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease a 9x13-inch baking dish.\nCombine flour, oats, 1 cup sugar, cinnamon, and baking soda in a large bowl. Cut butter into flour mixture until it resembles coarse crumbs. Reserve about 2 cups flour-butter mixture. Press remaining mixture into the prepared baking dish to form a crust.\nBring blueberries, remaining 1/2 cup sugar, cornstarch, and lemon juice to a boil in a saucepan, stirring constantly, until mixture is thickened, about 2 minutes. Spread blueberry mixture over crust and sprinkle with reserved oat mixture.\nBake in the preheated oven until topping is just browned, about 25 minutes. Cool before cutting and serving.\n",
        "picture_link": "Yg9yqnLUo.m8JN7.zH2LmvP99fRKE0a"
    },
    {
        "title": "Roasted Brussels Sprouts with Apples, Golden Raisins, and Walnuts",
        "ingredients": [
            "1 pound Brussels sprouts, halved ADVERTISEMENT",
            "1 cup chopped cauliflower ADVERTISEMENT",
            "2 apples - peeled, cored, and cut into chunks ADVERTISEMENT",
            "1 sweet onion, sliced ADVERTISEMENT",
            "1 tablespoon olive oil, or more if needed ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 cup golden raisins ADVERTISEMENT",
            "1/4 cup chopped walnuts ADVERTISEMENT",
            "1 tablespoon Chardonnay wine, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil.\nSpread Brussels sprouts, cauliflower, apples, and onion onto the prepared baking sheet; drizzle with olive oil. Season with salt and black pepper; stir until evenly coated.\nBake in the preheated oven until Brussels sprouts and cauliflower are tender, 20 to 25 minutes.\nTransfer Brussels sprouts mixture to a serving bowl. Fold in raisins and walnuts; drizzle with wine. Toss to coat.\n",
        "picture_link": "EdgQRABQ84DM1tEauFaM6epzdB/Lvuy"
    },
    {
        "title": "Lori's Beef and Spaghetti Macaroni",
        "ingredients": [
            "4 ounces macaroni ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1 (28 ounce) jar spaghetti sauce ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium pot with boiling salted water cook macaroni pasta until al dente. Drain.\nIn a large skillet cook hamburger and onion until brown. Drain grease. Add mayonnaise and spaghetti sauce; mix well. Add drained and cooked macaroni, cook on medium heat stirring occasionally until heated through. Mix thoroughly.\nTo serve, pour mixture into a large serving bowl and top with shredded Cheddar cheese. Serve warm.\n",
        "picture_link": "j.m8/0bOsgSPkfGp/yOOD9qKeTJtb/a"
    },
    {
        "title": "Strawberry Chantilly",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 cups fresh strawberries ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C).\nMix flour, sugar and butter until crumbly. Stir in chopped walnuts.\nPress two-thirds of the mixture in the bottom of a 9x13-inch baking dish; the remaining crumble will be used for the topping. Bake in preheated oven for 20 minutes. Cool crust completely.\nIn large deep bowl, stir together egg whites, sugar (see Cook's Note), strawberries, and lemon juice. Whip with electric mixer at high speed for 10 minutes.\nIn another mixing bowl, whip whipping cream until stiff and fold into strawberry mixture. Spread over cooled crust. Sprinkle with remaining crumb mixture. Freeze for 6 hours or overnight before serving.\n",
        "picture_link": "Ma3CwDHahCsDsnuzcuywdwj.l/2emE6"
    },
    {
        "title": "Johnny's Slow Cooker London Broil",
        "ingredients": [
            "2 tablespoons vegetable oil, or as needed ADVERTISEMENT",
            "1 (2.5 pound) London broil, cut into thirds ADVERTISEMENT",
            "1 teaspoon Creole seasoning, or to taste ADVERTISEMENT",
            "2 cups beef broth ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1/2 cup red wine ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "1 (16 ounce) package baby carrots ADVERTISEMENT",
            "3 potatoes, quartered, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Scatter sliced onion in the bottom of a slow cooker, then alternately layer carrots and potatoes.\nHeat oil in a large skillet over medium heat and season London broil with Creole seasoning. Sear beef in hot oil until well browned, 3 to 5 minutes per side. Transfer meat the slow cooker.\nPour beef broth, cream of mushroom soup, and red wine into the skillet used to cook the beef and bring to a simmer. Scrape any brown bits from the bottom of the skillet with a spatula. Pour broth mixture over beef.\nCook on Low for 8 to 10 hours or cook on High for 6 hours.\n",
        "picture_link": "xLoAqnO07RI2njs/11pPxwYMYVEpKU2"
    },
    {
        "title": "Missy's Lasagna",
        "ingredients": [
            "1 pound lean ground beef ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "1 (4.5 ounce) can mushrooms, drained ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "8 ounces shredded mozzarella cheese ADVERTISEMENT",
            "4 ounces cottage cheese ADVERTISEMENT",
            "1 cup part-skim ricotta cheese ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1/2 cup dried bread crumbs, seasoned ADVERTISEMENT",
            "1 (16 ounce) package instant lasagna noodles ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium size skillet cook ground beef. After beef is brown, add chopped onion and green pepper, mushrooms, and stir until vegetables are tender. Stir in the can of tomato sauce.\nIn a large bowl mix the eggs, half of the shredded mozzarella cheese, cottage cheese, ricotta cheese, milk, and bread crumbs.\nTo assemble, coat bottom of 9x13 inch casserole dish with a third of the sauce mixture. Layer uncooked noodles on top. Add another third of the sauce, and then half of the cheese mixture. Repeat layering with noodles, cheese, and sauce. Sprinkle remaining shredded mozzarella cheese on top.\nBake in a preheated 350 degrees F (175 degrees C) oven for 45 minutes. Let stand 10 to 15 minutes before serving.\n",
        "picture_link": "n9sjCKXIQHUOvpTc38WeoP1Nf5QVP5C"
    },
    {
        "title": "Chicken Cheddar and Guacamole Burgers",
        "ingredients": [
            "1 1/2 pounds ground chicken ADVERTISEMENT",
            "1/2 cup minced yellow onion ADVERTISEMENT",
            "1/3 cup minced fresh cilantro ADVERTISEMENT",
            "1/3 cup shredded Cheddar cheese ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 jalapeno pepper, seeded and minced ADVERTISEMENT",
            "1/2 lime, juiced ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1/2 teaspoon Kosher salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "4 slices Cheddar cheese ADVERTISEMENT",
            "4 hamburger buns, split and toasted ADVERTISEMENT",
            "1/4 cup guacamole, or to taste ADVERTISEMENT",
            "4 teaspoons chopped fresh cilantro, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium-high heat and lightly oil the grate.\nMix ground chicken, 1/3 cup cilantro, Cheddar cheese, garlic, jalapeno pepper, lime juice, cumin, paprika, salt, and pepper together in a bowl; shape into 4 patties.\nCook patties on grill until the bottom is browned, 3 to 4 minutes; flip the burgers and top with a slice of Cheddar cheese. Continue cooking until no longer pink in the center, 1 to 2 minutes more. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C). Transfer burgers to a plate to rest until juices are reabsorbed into the meat, about 3 minutes.\nPut burgers onto split buns and top with guacamole and cilantro.\n",
        "picture_link": "OyQiPizoLwZZmQwsp/jkgohc2tzONwK"
    },
    {
        "title": "Eggless Pasta",
        "ingredients": [
            "2 cups semolina flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup warm water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix flour and salt. Add warm water and stir to make a stiff dough. Increase water if dough seems too dry.\nPat the dough into a ball and turn out onto a lightly floured surface. Knead for 10 to 15 minutes. Cover. Let dough rest for 20 minutes.\nRoll out dough using rolling pin or pasta machine. Work with a 1/4 of the dough at one time. Keep the rest covered, to prevent from drying out. Roll by hand to 1/16 of an inch thick. By machine, stop at the third to last setting.\nCut pasta into desired shapes.\nCook fresh noodles in boiling salted water for 3 to 5 minutes. Drain.\n",
        "picture_link": "1gMjr3sJ1jfkrMV6l.XtTAvZLtqbCDy"
    },
    {
        "title": "Oven Baked Rice",
        "ingredients": [
            "1 cup jasmine rice (such as Mahatma®) ADVERTISEMENT",
            "2 1/4 cups water ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon white vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Butter a 2 1/2-quart baking dish.\nPour rice into the prepared baking dish.\nStir water, butter, salt, and vinegar together in a saucepan; bring to a rolling boil. Pour the water mixture over the rice; stir.\nBake in preheated oven until the water is absorbed and the rice tender, 20 to 25 minutes.\n",
        "picture_link": "CfEyZeL4VVnulpmIelAcw1ytuVSjb.G"
    },
    {
        "title": "Chicken Lasagna III",
        "ingredients": [
            "9 lasagna noodles ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "1 (8 ounce) container cottage cheese ADVERTISEMENT",
            "1/2 (8 ounce) container sour cream ADVERTISEMENT",
            "1/4 teaspoon poultry seasoning ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1/3 cup sliced black olives (optional) ADVERTISEMENT",
            "3/4 cup grated Parmesan cheese ADVERTISEMENT",
            "4 cups chopped, cooked chicken meat ADVERTISEMENT",
            "2 cups shredded Colby cheese ADVERTISEMENT",
            "2 1/2 cups shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook pasta in a large pot of boiling salted water until al dente. Drain.\nIn a large bowl, mix together cream of mushroom soup, cream of chicken soup, chopped onions, cottage cheese, sour cream, poultry seasoning, oregano, basil, grated Parmesan cheese, and chicken. If desired, add olives.\nIn a 9x13 inch casserole dish, layer 3 lasagna noodles, half of the chicken sauce, grated Colby cheese, 3 lasagna noodles, remaining chicken sauce, 3 lasagna noodles, and finally grated mozzarella cheese. Cover with aluminum foil.\nBake in a preheated 350 degree F (175 degrees C) oven for 40 minutes. Remove foil, and continue baking for 10 minutes. Let stand 10 minutes before serving.\n",
        "picture_link": "aySdD89hYcesBbSdorET9ED2.zjDc1C"
    },
    {
        "title": "Brown Rice Curry",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "1/2 onion, minced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 cups chicken stock ADVERTISEMENT",
            "1 cup brown rice ADVERTISEMENT",
            "1 teaspoon curry powder ADVERTISEMENT",
            "1/4 teaspoon ground turmeric ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a 2-quart saucepan over medium-low heat. Stir in onion and garlic; cook and stir until onion has softened and turned translucent, about 5 minutes.\nIn a separate saucepan, bring 2 cups chicken stock to a boil.\nStir brown rice, curry powder, turmeric, thyme, and bay leaf into onion mixture. Add chicken stock and bring to a boil. Reduce heat, cover, and simmer until all liquid is absorbed and rice is tender, about 40 minutes.\n",
        "picture_link": "kzx3pyKd9dc6TvhdR6x6Q66Uxb.NV92"
    },
    {
        "title": "Tom's Down To The Bone Pork Chops!",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 (8 ounce) package panko bread crumbs ADVERTISEMENT",
            "6 (1-inch thick) bone-in pork chops, at room temperature ADVERTISEMENT",
            "1/2 cup mayonnaise, or as needed ADVERTISEMENT",
            "1 pinch Cajun seasoning, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Spray a 9x13-inch baking dish with cooking spray and spread bread crumbs on a large plate.\nRinse pork chops and pat dry with paper towels.\nMix mayonnaise and Cajun seasoning in a bowl; brush mayonnaise mixture over pork chops. Gently press pork chops into bread crumbs to coat, shaking off excess crumbs. Arrange breaded pork chops in the prepared baking dish. Repeat with remaining chops.\nBake in the preheated oven until pork is slightly pink in the center, about 35 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C). Loosely cover pork chops with aluminum foil and let rest for 10 to 15 minutes before serving.\n",
        "picture_link": "coY8oj4/0HXui61S5CLwowKXei0GTKW"
    },
    {
        "title": "Tomato Alfredo Sauce with Artichokes",
        "ingredients": [
            "1 (14 ounce) can artichoke hearts in water ADVERTISEMENT",
            "2 tomatoes, chopped ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 cup fresh sliced mushrooms ADVERTISEMENT",
            "1/2 cup chopped fresh basil ADVERTISEMENT",
            "1/2 cup whole milk ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Chop artichoke hearts and place in large skillet with juice. Thicken with flour and milk to desired consistency.\nAdd onion, mushrooms, tomatoes, and basil. Cook for a short time, leaving vegetables firm and tasty and pretty.\nCook up a batch of your favorite spaghetti noodles (e.g., angel hair or spaghettini). Rinse. Toss artichoke sauce on top of cooked pasta.\n",
        "picture_link": "8P68wUMz.xD6.N0XFdh55JFVA3QEDfy"
    },
    {
        "title": "Marie's Shepherd's Pie",
        "ingredients": [
            "4 large potatoes, peeled and cubed ADVERTISEMENT",
            "2 tablespoons butter, divided ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 packet dry French onion soup mix ADVERTISEMENT",
            "1 cube chicken bouillon ADVERTISEMENT",
            "1 cube beef bouillon ADVERTISEMENT",
            "2 tablespoons water (optional) ADVERTISEMENT",
            "1 (11 ounce) can whole kernel corn, drained ADVERTISEMENT",
            "1 (10 ounce) can diced carrots, drained ADVERTISEMENT",
            "1 (10 ounce) can peas, drained ADVERTISEMENT",
            "2 tablespoons paprika ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nPlace potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 15 minutes. Drain and transfer potatoes to a large bowl. Mash potatoes with 1 tablespoon butter using a potato masher or fork; season with salt and pepper.\nMelt 1 tablespoon butter in a large skillet over medium heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Stir onion soup mix, chicken bouillon, and beef bouillon into ground beef; simmer until flavors blend, about 2 minutes. Add water if mixture is too dry.\nSpread ground beef mixture into the bottom of a 2-quart casserole dish; top with corn, carrots, and peas. Spoon mashed potato mixture over vegetable layer; sprinkle with paprika.\nBake in the preheated oven for 20 minutes. Sprinkle Cheddar cheese over mashed potato layer; continue baking until cheese is melted and bubbling, about 10 more minutes.\n",
        "picture_link": "O4PSyZil4dnlv63irgvK9kBpRVJ0Z4."
    },
    {
        "title": "Grilled Cauliflower",
        "ingredients": [
            "1 head cauliflower, cut into thick slices ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "2 teaspoons seasoned salt (such as LAWRY'S®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium-high heat and lightly oil the grate.\nSprinkle cauliflower slices on both sides with olive oil, brown sugar, and seasoned salt.\nCook cauliflower on the grill until char marks appear, 2 to 3 minutes per side. Transfer to a grill-safe pan with a lid, cover, and continue cooking on grill until tender, about 20 minutes.\n",
        "picture_link": "wW0erD0gfwwjq3K56buG0fIigqJNyRO"
    },
    {
        "title": "Roasted Sweet Potatoes and Vegetables With Thyme and Maple Syrup",
        "ingredients": [
            "1 pound sweet potatoes, cut into long, thin rectangles ADVERTISEMENT",
            "1 large carrot, cut into long, thin rectangles ADVERTISEMENT",
            "1 parsnip, cut into long, thin rectangles ADVERTISEMENT",
            "extra-virgin olive oil, or as needed ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "4 sprigs fresh thyme ADVERTISEMENT",
            "2 tablespoons maple syrup, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nScatter pieces of sweet potato, carrot, and parsnip onto a jelly roll pan; drizzle with olive oil and season with salt and black pepper.\nRoast in the preheated oven until vegetables are partially soft, about 30 minutes. Scatter thyme sprigs over vegetables and drizzle with maple syrup. Return to oven and bake until vegetables are soft, about 15 more minutes.\n",
        "picture_link": "6FxjfNdOwPeuignGxCAJtinq6IgeH8W"
    },
    {
        "title": "Real Hungarian Goulash (No Tomato Paste Here)",
        "ingredients": [
            "2 tablespoons lard ADVERTISEMENT",
            "2 large onions, finely sliced ADVERTISEMENT",
            "2 pounds beef chuck, cut into 1-inch cubes ADVERTISEMENT",
            "2 tablespoons Hungarian paprika ADVERTISEMENT",
            "1 cup water, or as needed ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt lard in a large pot over medium heat. Cook and stir onions in hot lard until soft and translucent, 5 to 8 minutes.\nStir beef and paprika into onions. Reduce heat to low and simmer for 1 hour, stirring occasionally. Add 1 cup water and simmer, adding more water if moisture gets too low, until meat falls apart and onion sauce is thick, about 1 hour more. Season with salt and pepper to taste.\n",
        "picture_link": "F4vij/8OdbqxLai/23lW98RQv3IZwKS"
    },
    {
        "title": "Cold Szechuan Noodles and Shredded Vegetables",
        "ingredients": [
            "16 ounces dried soba noodles ADVERTISEMENT",
            "1/4 cup tamari ADVERTISEMENT",
            "1/4 cup sesame oil ADVERTISEMENT",
            "1 tablespoon rice vinegar ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1/2 teaspoon chili oil ADVERTISEMENT",
            "1 red bell pepper, thinly sliced ADVERTISEMENT",
            "1 cup chopped green onions ADVERTISEMENT",
            "2 carrots, julienned ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large stockpot, cook pasta in boiling salted water until al dente. Rinse with cool water; drain well.\nIn a small bowl mix together 3 tablespoons tamari sauce, 3 tablespoons sesame oil, vinegar, sugar and Chili oil.\nUsing tongs, toss noodles with sauce to coat well. Marinate in a covered bowl for 2 hours, or up to 24 hours, tossing occasionally.\nBring marinated noodles to room temperature. Mix the remaining 1Tablespoon each of tamari and oil and pour over the noodles. Three hours before serving stir in sweet red peppers, two thirds of the green onions, and half of the grated carrots.\nTo serve, mound the noodles on a serving platter and sprinkle with the remaining green onions and carrots.\n",
        "picture_link": "kccdK67mBVHiEdlqJpovVoewQpW/pbq"
    },
    {
        "title": "Napoleon's Banana Muffin",
        "ingredients": [
            "6 very ripe bananas, mashed ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1/4 cup spiced rum ADVERTISEMENT",
            "1/4 cup cognac ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "2/3 cup brown sugar ADVERTISEMENT",
            "2 eggs, lightly beaten ADVERTISEMENT",
            "10 tablespoons unsalted butter, melted ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Grease two twelve-cup muffin tins.\nIn a mixing bowl, mix bananas, 1/2 cup brown sugar, honey, rum, and cognac with an electric mixer until smooth.\nIn a large bowl, whisk together 3 cups flour, baking soda, baking powder, and salt. In another bowl, cream white sugar, 2/3 cup brown sugar, eggs, and melted butter. Pour banana mixture and creamed egg mixture into the flour, and stir until just combined. Spoon mixture into muffin tins, filling cups 3/4 full.\nIn a small bowl, mix together 1 cup brown sugar, 3 tablespoons flour, and cinnamon. Cut in 3 tablespoons butter until mixture resembles coarse crumbs. Sprinkle over batter in muffin tins.\nBake muffins in preheated oven for 20 minutes, or until done.\n",
        "picture_link": "hzT1m/F3BdUM/yfg1iDVROSZhryZA4y"
    },
    {
        "title": "Marinated Venison",
        "ingredients": [
            "2 pounds venison (deer meat) ADVERTISEMENT",
            "1/2 (10 fluid ounce) bottle Worcestershire sauce ADVERTISEMENT",
            "1 (12 fluid ounce) can or bottle beer ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon onion salt ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "vegetable oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pound venison flat, and cut into 1 inch strips; place in a large bowl. Pour in Worcestershire sauce and beer. Cover, and refrigerate for 1 hour or more.\nIn a shallow bowl, combine flour, onion salt and garlic powder. Drag soaked meat through the flour mixture. Heat oil in a large heavy skillet, and fry meat until golden brown.\n",
        "picture_link": "adLuxXHh9acnK67R2yJ0Ff1lLo9MV5q"
    },
    {
        "title": "Homemade Salami",
        "ingredients": [
            "2 pounds ground beef ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon onion powder ADVERTISEMENT",
            "1/2 teaspoon mustard seed ADVERTISEMENT",
            "2 tablespoons sugar-based curing mixture (such as Morton® Tender Quick®) ADVERTISEMENT",
            "1 tablespoon coarsely ground black pepper ADVERTISEMENT",
            "1 teaspoon red pepper flakes (optional) ADVERTISEMENT",
            "1 teaspoon liquid smoke flavoring ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix together the ground beef, garlic powder, onion powder, mustard seed, curing salt, black pepper and liquid smoke. Mix in the red pepper flakes if desired. Roll the mixture into a 2 inch diameter log, and wrap tightly in aluminum foil. Refrigerate for 24 hours.\nPreheat the oven to 325 degrees F (165 degrees C). Make a few slits in the bottom of the roll to allow the fat to drain when cooking. Place roll onto a broiler pan, and fill the bottom part of the pan with about 1 inch of water to keep the salami moist.\nBake for 90 minutes in the preheated oven. Remove from pan and cool completely before unwrapping the salami. Slice and eat as lunch meat, or serve on a tray with crackers and cheese.\n",
        "picture_link": "rl8F7286JhUJLP5.stRUyr4WZrF5X5."
    },
    {
        "title": "Oliebollen (Dutch Doughnuts)",
        "ingredients": [
            "1 (0.6 ounce) cake compressed fresh yeast ADVERTISEMENT",
            "1 cup lukewarm milk ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "3/4 cup dried currants ADVERTISEMENT",
            "3/4 cup raisins ADVERTISEMENT",
            "1 Granny Smith apple - peeled, cored and finely chopped ADVERTISEMENT",
            "1 quart vegetable oil for deep-frying ADVERTISEMENT",
            "1 cup confectioners' sugar for dusting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Break up the compressed yeast, and stir into the warm milk. Let stand for a few minutes to dissolve. Sift the flour and salt into a large bowl. Stir the yeast mixture and egg into the flour and mix into a smooth batter. Stir in the currants, raisins and apple. Cover the bowl, and leave the batter in a warm place to rise until double in size. This will take about 1 hour.\nHeat the oil in a deep-fryer, or heavy deep pan to 375 degrees F (190 degrees C). Use 2 metal spoons to shape scoops of dough into balls, and drop them carefully into the hot oil.\nFry the balls until golden brown, about 8 minutes. The doughnuts should be soft and not greasy. If the oil is not hot enough, the outside will be tough and the insides greasy. Drain finished doughnuts on paper towels and dust with confectioners' sugar. Serve them piled on a dish with more confectioners' sugar dusted over them. Eat them hot if possible.\n",
        "picture_link": "UYSGRfRRtZkeA6RffQdGZ0jQK4sEvmG"
    },
    {
        "title": "Coconut Syrup",
        "ingredients": [
            "1 (14 ounce) can coconut milk ADVERTISEMENT",
            "1 cup flaked coconut ADVERTISEMENT",
            "3/4 cup brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a heavy saucepan, combine coconut cream, flaked coconut and brown sugar. Bring to a boil, reduce to a simmer, and cook for 20 minutes, stirring occasionally. Transfer to a blender, and puree until smooth. Serve immediately.\n",
        "picture_link": "MAYHRVY4M5jkllxwwYjqQjExhule3re"
    },
    {
        "title": "LJ's Easy Penne with Vodka Sauce",
        "ingredients": [
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1/4 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1/2 cup vodka ADVERTISEMENT",
            "1 (28 ounce) can crushed tomatoes ADVERTISEMENT",
            "1 cup light cream ADVERTISEMENT",
            "1/2 cup grated Romano cheese ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 pound penne pasta ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large saucepan over medium heat. Stir in the onion and cook and stir until softened, about 5 minutes. Add the garlic and crushed red pepper flakes and cook, stirring, for an additional minute.\nStir the vodka, crushed tomatoes and light cream into the onion mixture, turn heat to high, and bring sauce to a boil. Reduce heat to low, stir in the Romano cheese and simmer for 2 hours, stirring occasionally. Season finished sauce with salt and pepper.\nFill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the penne, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 10 minutes. Drain well in a colander set in the sink. Transfer pasta to a large bowl and pour vodka sauce over, tossing to coat pasta with the sauce to serve.\n",
        "picture_link": "S6vBBaMk3GWtqvEQMzRBfkBH6IqwqRm"
    },
    {
        "title": "Grandma Slattery's Michigan Sauce",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 tablespoons white vinegar ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "3 tablespoons lemon juice ADVERTISEMENT",
            "1/2 tablespoon prepared mustard ADVERTISEMENT",
            "3 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "1 cup ketchup ADVERTISEMENT",
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a saucepan over medium heat. Saute the onion in butter until soft. Stir in the vinegar, brown sugar, lemon juice, mustard, Worcestershire sauce, ketchup, tomato sauce, and tomato paste. Stir to blend.\nWhen the mixture begins to simmer, add the raw ground beef breaking it into pieces with a wooden spoon. Simmer for 20 to 30 minutes. Serve over steamed hot dogs. Of course you can add some raw onions if you want.\n",
        "picture_link": "YhR2Blbyd1i1VRT7fSo3usR7rMiZdmS"
    },
    {
        "title": "Lick Your Lips Cake",
        "ingredients": [
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 (11 ounce) can mandarin orange segments ADVERTISEMENT",
            "1 (15 ounce) can crushed pineapple with juice ADVERTISEMENT",
            "1 (12 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "1 (3.5 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix cake mix, eggs, and mandarin oranges for 2-3 minutes at medium speed.\nBake for 30 minutes in a preheated 350 degrees F (175 degrees C) oven. Set aside and let cool completely.\nCombine crushed pineapple, dessert topping, and vanilla pudding mix. Mix well. Spread on top of cooled cake. Keep refrigerated.\n",
        "picture_link": "OqoWZRvlo/r096J.iJrd4QAZJRqpgI2"
    },
    {
        "title": "Slow Cooker Beef Stew II",
        "ingredients": [
            "2 pounds stew meat, trimmed and cubed ADVERTISEMENT",
            "3 (10.75 ounce) cans condensed cream of chicken soup ADVERTISEMENT",
            "1 (16 ounce) package egg noodles ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spray the inside of a slow cooker with the vegetable cooking spray. Add the meat and the soups to the slow cooker.\nCook on low setting for 8 to 10 hours.\nPrepare noodles according to package directions.\nWhen stew is ready, pour over the noodles and serve hot.\n",
        "picture_link": "TsgJwL7lVgaY3HLuV/gFU9yWZJ9gFlq"
    },
    {
        "title": "Merwin's Chicken Marsala",
        "ingredients": [
            "1 1/2 pounds skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 cup all-purpose flour for coating ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "4 tablespoons butter ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1/2 cup dry Marsala wine ADVERTISEMENT",
            "2 1/2 cups fresh sliced mushrooms ADVERTISEMENT",
            "2 tablespoons dried oregano ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1 teaspoon meat extract ADVERTISEMENT",
            "2 teaspoons fresh lemon juice ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese for topping (optional) ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "With a mallet, pound chicken breasts thin. Cut into serving size pieces. Dip in flour. Dip in egg.\nMelt 2 tablespoons butter or margarine and 1 tablespoon oil in a wide skillet. Saute chicken until light brown. Do not crowd pan, and add more oil if necessary to keep chicken from sticking. Place chicken on a serving platter, and keep in a warm oven.\nSaute sliced mushrooms in oil and butter remaining in pan until released juices have evaporated and mushrooms begin to brown. Add chicken broth, Marsala wine, oregano, parsley, and meat extract. Stir well. Cook over high heat until liquid is reduced by half.\nRemove pan from heat. Swirl in 2 tablespoons butter or margarine and lemon juice. Season with salt and pepper. Pour sauce over chicken, and sprinkle with cheese.\n",
        "picture_link": "qXCgxymR9mGNdR2Jdn7rQbHpLRbB94C"
    },
    {
        "title": "Chicken and Rice Casserole II",
        "ingredients": [
            "1 (4 pound) bone-in chicken, cut into pieces ADVERTISEMENT",
            "1 onion, quartered ADVERTISEMENT",
            "2 stalks celery ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "1/3 cup butter ADVERTISEMENT",
            "8 tablespoons all-purpose flour ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 cup chicken stock ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "1 (4.5 ounce) can sliced mushrooms ADVERTISEMENT",
            "1 cup cooked white rice ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot, boil the chicken with the onion, celery and bay leaves until done. Let chicken cool until you can handle it. Remove chicken meat from the bones and cut into small pieces.\nPreheat oven to 375 degrees F (190 degrees C).\nIn a saucepan over medium heat, melt the butter. Stir in the flour and cook for about 1 minute. Slowly stir in the cold milk and chicken stock; bring to a boil, reduce heat to medium-low and cook, stirring constantly, until mixture begins to thicken, about 5 minutes. Remove pan from heat and stir in the cheese.\nStir the cooked chicken, rice, and mushrooms into the cheese sauce and season with salt and pepper. Pour mixture into a 1 1/2 quart casserole dish.\nBake in preheated oven until mixture is hot and bubbly and beginning to brown on top, about 30 minutes.\n",
        "picture_link": "JSBKPgXrmBkjeCHpMKfnfbgtiPyW/V2"
    },
    {
        "title": "Strawberry Bread III",
        "ingredients": [
            "1 (10 ounce) package frozen sweetened strawberries, thawed ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Drain the strawberries, reserving 1/4 cup of the juice. In a large mixing bowl stir together the oil, eggs, baking soda, baking powder, cinnamon, sugar and flour. Fold in the pecans, strawberries and 1/4 cup of their juice. Pour the mixture into your bread machine pan and place it in the machine. Select the Quick Bread cycle and press Start.\nRemove pan from bread maker and let cool completely before removing bread from pan.\n",
        "picture_link": "S4caPfq7J8NH24wXOOFawWPP2423wNy"
    },
    {
        "title": "Deer Meat",
        "ingredients": [
            "1 1/2 pounds venison (deer meat) ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "4 cups fresh mushrooms, sliced ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "1 teaspoon all-purpose flour ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 pinch mustard powder ADVERTISEMENT",
            "1/8 teaspoon dried parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat butter or margarine in a large skillet over medium heat. Add onions and saute until translucent; then add meat and saute until browned.\nWhen meat is lightly browned, add mushrooms, garlic, tomato paste, flour, sour cream, salt, mustard powder and parsley. Stir together, reduce heat to low and let simmer for 20 to 30 minutes. The longer it simmers, the more tender the meat will be. Enjoy!\n",
        "picture_link": "wvnjvvj.6rsWerNrEg2q5roKgM0prPO"
    },
    {
        "title": "Carole's Sesame Chicken Salad",
        "ingredients": [
            "2 boneless chicken breast halves, cooked and chopped ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1 tablespoon sesame oil ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1/8 teaspoon ground ginger ADVERTISEMENT",
            "1/2 small head napa cabbage ADVERTISEMENT",
            "2 green onions, chopped ADVERTISEMENT",
            "1 tablespoon sesame seeds, toasted ADVERTISEMENT",
            "1 carrot, shredded ADVERTISEMENT",
            "1/2 cup crispy fried rice noodles, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Several hours before serving make the dressing. Combine mayonnaise, sesame oil, sugar and ginger. Cover and refrigerate.\nThinly slice the cabbage and place in large bowl along with the cubed chicken. Add the green onions, toasted sesame seeds and shredded carrot. Toss then mix in the dressing. Divide salad onto serving plates and top with additional green onion and crispy rice noodles.\n",
        "picture_link": "B52X5cl5mo.nBCmJ5t6G7/NkhimiL9."
    },
    {
        "title": "Winter Solstice Soup",
        "ingredients": [
            "2 tablespoons margarine ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "2 carrots, shredded ADVERTISEMENT",
            "2 potatoes, peeled and cubed ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 tablespoon dried parsley ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot over medium heat, melt the butter or margarine and saute the onions for 5 to 10 minutes, or until tender. Add the carrots, potatoes, water, salt, parsley, thyme and bay leaf.\nReduce heat to low and simmer for 30 minutes, stirring occasionally. Remove the bay leaf.\nPuree the soup in a blender or food processor in small batches and return to the pot. Stir in the milk, mixing well, and season with salt and pepper to taste.\n",
        "picture_link": "MObITPG1dGYx5N9s83PDujZXrAGhNfG"
    },
    {
        "title": "Snack Crackers",
        "ingredients": [
            "1 (1 ounce) package ranch dressing mix ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon dried dill weed ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1 (12 ounce) package oyster crackers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together ranch dressing mix, garlic powder, dill and vegetable oil. Add crackers and mix gently until the crackers are coated with the mixture. Stir every 10 minutes for 1 hour. Store in an airtight jar.\n",
        "picture_link": "oHwgVBbhavPdSnaj4BkHkPbbpuew0Sy"
    },
    {
        "title": "Vegan Sun-Dried Tomato Pesto",
        "ingredients": [
            "2 cups fresh basil leaves ADVERTISEMENT",
            "5 sun-dried tomatoes, softened ADVERTISEMENT",
            "3 cloves garlic, crushed ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3 tablespoons toasted pine nuts ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place basil, tomatoes, garlic, salt, and nuts in an electric food processor or blender. Puree. Add olive oil slowly, and blend slowly until the mixture is to your desired texture.\n",
        "picture_link": "IUdJxGBZRIBCit02ihnuF8LPBa5v9ku"
    },
    {
        "title": "Hot and Sour Soup with Tofu",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "3 green onions, chopped ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "2 cups chicken broth ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1 tablespoon red wine vinegar ADVERTISEMENT",
            "1/4 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "3 tablespoons water ADVERTISEMENT",
            "1 tablespoon sesame oil ADVERTISEMENT",
            "6 ounces frozen snow peas ADVERTISEMENT",
            "1 (8 ounce) package firm tofu, cubed ADVERTISEMENT",
            "1 (8 ounce) can sliced water chestnuts, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large saucepan over medium heat. Add the red bell pepper and green onions and saute for 5 minutes. Then, add the 2 cups water, broth and soy sauce, reduce heat to medium low and simmer for 5 minutes.\nIn a separate medium bowl, combine the vinegar, red pepper flakes, ground black pepper, cornstarch, 3 tablespoons water and sesame oil. Add this to the soup and continue to simmer for 5 more minutes, or until soup becomes thick and bubbly.\nFinally, mix in the tofu, snow peas and water chestnuts, and continue cooking 10 minutes, or until heated through.\n",
        "picture_link": "jwR7CRigCFMmnv5N/fNmgcuShSS0t3C"
    },
    {
        "title": "Cranberry Sauce Chicken I",
        "ingredients": [
            "12 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 1/4 cups cranberry sauce ADVERTISEMENT",
            "1 packet dry onion soup mix ADVERTISEMENT",
            "1/2 cup French-style salad dressing ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nArrange chicken in an 11x17 inch baking dish. In a medium bowl, combine the cranberry sauce, soup mix, salad dressing, sugar and ground black pepper. Mix well and spoon mixture over chicken.\nCover dish and bake at 325 degrees F (165 degrees C) for 1 to 1 1/2 hours, or until chicken is cooked through and juices run clear.\n",
        "picture_link": "UZPMKZK80X9mTOiKNsHzstNfQcLVBYi"
    },
    {
        "title": "Neiman Marcus Cake I",
        "ingredients": [
            "1 (18.25 ounce) package chocolate cake mix ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "4 cups confectioners' sugar ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease one 13x9 inch baking pan.\nCombine the chocolate cake mix, 1 of the eggs, and the butter or margarine and mix until smooth. Pat mixture into the prepared pan. Sprinkle the semi sweet chocolate chips and the chopped nuts evenly over the cake.\nMix together the confectioner's sugar, cream cheese, and the remaining 2 eggs until well blended. Pour over the semi-sweet chocolate chips and the chopped nuts.\nBake at 350 degrees F (175 degrees C) for about 40 minutes. Let cake cool a little before cutting. Serve warm or cooled.\n",
        "picture_link": "CO3acxGwjfzY8oNPoiVOAi2GSCbHOYS"
    },
    {
        "title": "Curried Beef a la Tim",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 pound stew beef, cubed ADVERTISEMENT",
            "1 1/2 teaspoons curry powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "2 tablespoons tomato paste ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1 apple - peeled, cored, and chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a large skillet over medium heat. Place the meat in the hot oil and saute until well browned on all sides. Sprinkle the curry powder, salt, and ground black pepper over the meat and stir well.\nIn a small bowl, mix together tomato paste and water, then stir mixture into skillet. Stir in onion, celery, and raisins, then reduce heat to low and simmer for thirty minutes, or until beef is tender.\nStir apple into skillet and simmer for 5 more minutes, or until apple is tender and sauce has thickened.\n",
        "picture_link": "oQLycTAMQxgJdYtbS9D1r8qsabHonWK"
    },
    {
        "title": "Plain Potato Soup",
        "ingredients": [
            "4 potatoes, peeled and cubed ADVERTISEMENT",
            "water to cover ADVERTISEMENT",
            "2 (12 fluid ounce) cans evaporated milk ADVERTISEMENT",
            "4 tablespoons unsalted butter ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the potatoes in a large pot over high heat. Add water to cover, about 1 inch over the potatoes. Boil for about 10 to 15 minutes, or until potatoes are tender. Do not drain.\nReduce heat to low and pour in the evaporated milk and the butter. Mash the potatoes in the pot with a potato masher. Season with salt and white pepper to taste.\n",
        "picture_link": "OK3XhAxz1X1JePc2oHfekjMOeeBgcRO"
    },
    {
        "title": "Yummy Peanut Butter Bread",
        "ingredients": [
            "1 cup warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3 tablespoons crunchy peanut butter ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "3 cups bread flour ADVERTISEMENT",
            "1 1/2 teaspoons active dry yeast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ingredients in bread machine pan in the order suggested by the manufacturer. Select white bread setting. Start.\nTo bake bread in oven: select dough or manual cycle. Once cycle is complete, shape dough and place in a greased loaf pan. Allow to rise in a warm spot until doubled in size. Bake in a preheated 350 degrees F (175 degrees C) oven for 35 to 45 minutes or until a thermometer inserted in the center of the loaf reads 200 degrees F (95 degrees C).\n",
        "picture_link": "4YuudAQKGJgqS9PZhDA2jw3O6Mgo2yq"
    },
    {
        "title": "Banana Cake III",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 cup mashed bananas ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "4 cups confectioners' sugar ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "3/4 cup chopped walnuts (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease two 9 inch round pans.\nCombine sugar, flour, baking soda, water, mashed bananas, salt, and mayonnaise. Mix together, and pour into the cake pans.\nBake cake about 45 minutes, or until a toothpick inserted in the center comes out clean. Remove from oven, and cool on wire racks.\nIn a mixing bowl, blend cream cheese and butter or margarine together. Gradually add sugar and vanilla, and mix well. Stir in nuts. Fill and frost the cake.\n",
        "picture_link": "/z5i.LoBJfAsS9vtsuVKJEatnoCiuaC"
    },
    {
        "title": "Yeast-Free Bread",
        "ingredients": [
            "2 1/2 cups self-rising flour ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "1 (12 fluid ounce) can or bottle lemon-lime flavored carbonated beverage ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease one 9x5 inch loaf pan.\nCombine the flour, sugar and carbonated beverage. Mix well and place into the prepared pan.\nBake at 350 degrees F (175 degrees C) for 45 minutes. Note: If using a sweetened carbonated beverage cut back on the sugar a little.\n",
        "picture_link": "bZlYfFK0kjvUOP4ZG53jGC.7XFKdoGO"
    },
    {
        "title": "Chicken Sandwich Casserole",
        "ingredients": [
            "12 slices white bread, lightly toasted ADVERTISEMENT",
            "4 cups chopped cooked chicken breast ADVERTISEMENT",
            "1/2 cup chopped celery ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "4 eggs, beaten ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place 6 slices of the toasted bread in the bottom of a lightly greased 9x13 inch baking dish. Sprinkle the chicken, celery and onion on top of the bread, then cover with the other 6 slices of toasted bread.\nIn a medium bowl mix together the beaten eggs, mayonnaise, milk and salt and pepper to taste. Pour this mixture over the sandwiches, then top with soup; cover baking dish and refrigerate overnight.\nPreheat oven to 325 degrees F (165 degrees C).\nBake dish, covered, at 325 degrees F (165 degrees C) for 45 minutes; remove cover, sprinkle with cheese, and bake for another 30 minutes, uncovered. Remove from oven and let cool and set for 10 minutes before serving.\n",
        "picture_link": "NAS5tknkTJDMLRX.hTrjORDAd5v2EWm"
    },
    {
        "title": "Spicy Chile Casserole",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "1 (4 ounce) can diced green chiles ADVERTISEMENT",
            "1 (10 ounce) can diced tomatoes with green chile peppers ADVERTISEMENT",
            "1 1/2 cups cubed, cooked chicken meat ADVERTISEMENT",
            "10 (6 inch) corn tortillas, cut into strips ADVERTISEMENT",
            "1 (8 ounce) package sharp Cheddar cheese, shredded ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium sauce pan, cook onion in oil over medium heat until soft. Stir in flour. Add broth and milk; cook, stirring constantly, until thickened. Stir in chilies and tomatoes.\nCoat a 9 x 13 inch baking pan with nonstick spray. Place 1 cup sauce in bottom of pan. Layer half the chicken, half the tortilla strips, and 1 1/4 cups sauce. Repeat with remaining ingredients. Top casserole with shredded cheese.\nBake at 350 degrees F (175 degrees C) for 40 to 45 minutes.\n",
        "picture_link": "k4G0CS4XP5xrL7nAsAzQf9.HG5cnVVu"
    },
    {
        "title": "Quick and Easy Paella ",
        "ingredients": [
            "Saffron Broth: ADVERTISEMENT",
            "1 pound jumbo shrimp, peeled and deveined, shells reserved ADVERTISEMENT",
            "2 teaspoons olive oil ADVERTISEMENT",
            "1/2 teaspoon saffron threads, or more to taste ADVERTISEMENT",
            "2 1/4 cups chicken broth ADVERTISEMENT",
            "Paella: ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "8 ounces chorizo sausage, sliced into thin rounds ADVERTISEMENT",
            "1/2 yellow onion, diced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 1/3 cups Arborio rice ADVERTISEMENT",
            "1/2 cup green peas ADVERTISEMENT",
            "1 red bell pepper, cut into thin strips ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 pinch cayenne pepper, or more to taste ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook and stir reserved shrimp shells and 2 teaspoons olive oil in a saucepan over medium heat until shells are pink and fragrant, 1 to 2 minutes. Stir saffron into shells; add chicken broth, bring to a simmer, and cook until broth is a rusty brown and fragrant, about 20 minutes.\nStrain saffron broth through a fine-mesh sieve; measure out 2 cups of broth, pour into a small saucepan, and place over low heat to keep broth hot.\nPreheat oven to 425 degrees F (220 degrees C).\nHeat 1 tablespoon olive oil in a large, oven-proof skillet over medium heat. Cook chorizo slices in hot oil until browned, about 2 minutes per side. Add onion to sausage; cook and stir until soft and slightly translucent, about 3 minutes. Reduce heat to medium-low.\nStir garlic into chorizo mixture; cook and stir until fragrant, about 1 minute. Add rice to skillet and stir to coat rice completely in oil; stir in peas.\nPat rice mixture evenly into the bottom of the skillet. Arrange shrimp in a single layer over the top of the rice. Lay pepper strips around and in-between shrimp; season with salt and cayenne pepper.\nIncrease heat to high. When rice begins to sizzle in the skillet, pour reserved 2 cups hot saffron broth over the shrimp; gently shake the skillet to distribute liquid.\nBake rice mixture in the preheated oven until rice is almost tender and still a bit wet, about 20 minutes.\nPlace skillet over medium-high and cook until rice is tender, liquid is absorbed, and rice caramelizes and crusts slightly on the bottom of the skillet, 3 to 5 minutes.\n",
        "picture_link": "J7/l/Csfzhw2QXx7JU3crdBrMGdzbLS"
    },
    {
        "title": "One-Pan Chicken Dinner",
        "ingredients": [
            "3 skinless, boneless chicken breast halves, halved ADVERTISEMENT",
            "2 (15 ounce) cans green beans, drained ADVERTISEMENT",
            "6 red potatoes, cut into chunks ADVERTISEMENT",
            "1 (.6 ounce) packet zesty Italian salad dressing mix ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace chicken breasts in a single layer in the center of a 9x13-inch baking dish. Pour green beans into one side of the baking dish. Spread potatoes out on the other side of the dish.\nSprinkle dressing mix over chicken, beans, and potatoes; drizzle butter over the top. Cover baking dish with aluminum foil.\nBake in the preheated oven until chicken breasts are no longer pink in the center and the juices run clear, about 1 hour. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "AM1eA0Kury61Fko0qLY9kzCFkn8BgMe"
    }
]