[
    {
        "title": "Easy Pressure Cooker Pot Roast",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 (3 pound) boneless beef chuck roast, trimmed ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 pinch seasoned salt, or to taste ADVERTISEMENT",
            "1 pinch onion powder, or to taste ADVERTISEMENT",
            "1 (14.5 ounce) can beef broth ADVERTISEMENT",
            "1 1/2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1 large onion, cut into 4 wedges ADVERTISEMENT",
            "4 carrots, peeled and cut into bite-size pieces ADVERTISEMENT",
            "4 large potatoes, peeled and cut into bite-size pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a pressure cooker over medium-high heat. Brown roast on all sides in the hot oil; season with pepper, seasoned salt, and onion powder.\nPour in beef broth and Worcestershire sauce, add the quartered onion, and seal the lid. Bring the cooker up to full pressure. Reduce heat to low, maintaining full pressure, and cook for 30 minutes.\nUse the quick-release method to lower the pressure. Mix in carrots and potatoes, seal the lid again, and return the pressure cooker to the heat. Bring the cooker up to full pressure and cook for an additional 15 minutes. Use the quick-release method again and transfer the roast and vegetables to a serving dish.\n",
        "picture_link": "i/XOfXHnlODOM5iY7vvMph8OKiWlsTK"
    },
    {
        "title": "Pressure Cooker Italian Chicken Soup",
        "ingredients": [
            "2 teaspoons olive oil ADVERTISEMENT",
            "4 Italian turkey sausage links, casings removed ADVERTISEMENT",
            "1 medium onion, diced ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup pearl barley ADVERTISEMENT",
            "1 cup green lentils ADVERTISEMENT",
            "1 bone-in chicken breast half, skin removed ADVERTISEMENT",
            "1/2 cup chopped fresh parsley ADVERTISEMENT",
            "3 cups chicken stock ADVERTISEMENT",
            "1 (15 ounce) can chickpeas (garbanzo beans), drained ADVERTISEMENT",
            "1 (16 ounce) bag fresh spinach leaves, chopped ADVERTISEMENT",
            "1 cup mild salsa ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "heat 1 teaspoon olive oil in a pressure cooker over medium heat. Add sausage meat, and cook until browned, breaking it into crumbles. Remove sausage to a plate and drain oil. Add another 1 teaspoon of olive oil to pressure cooker; cook onion and garlic until onion is transparent. Add barley and stir 1 minute. Return sausage to pressure cooker. Add lentils, chicken, parsley, and chicken stock to cooker, adding enough stock to completely cover chicken. Close cover securely; place pressure regulator on vent pipe. Bring pressure cooker to full pressure over high heat (this may take 15 minutes). Reduce heat to medium high; cook for 9 minutes. Pressure regulator should maintain a slow steady rocking motion; adjust heat if necessary.\nRemove pressure cooker from heat; use quick-release following manufacturer's instructions or allow pressure to drop on its own. Open cooker and remove chicken; shred meat and return to soup. Add garbanzo beans, spinach and salsa; stir to blend and heat through before serving.\n",
        "picture_link": "JDl8OpfyS6ez2VJYwYuZCZ1e/9dKCPO"
    },
    {
        "title": "Homemade Chicken Cacciatore, Sicilian-Style",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 large green bell pepper, sliced thin ADVERTISEMENT",
            "1 teaspoon crushed garlic ADVERTISEMENT",
            "2 (14.5 ounce) cans diced tomatoes, drained and juice reserved ADVERTISEMENT",
            "1 cup Burgundy wine ADVERTISEMENT",
            "1 1/2 tablespoons Italian seasoning ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon garlic salt ADVERTISEMENT",
            "1 whole chicken, cut into pieces ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 (16 ounce) package spaghetti ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a large stockpot over medium heat. Cook the onion, bell pepper, and garlic in the melted butter until they begin to soften, about 3 minutes. Add the tomatoes, wine, Italian seasoning, salt, pepper, and garlic salt; cook and stir until the mixture just begins to boil. Reduce the heat to medium low; add the chicken and cook until the meat is tender enough to fall off the bone, about 1 1/2 hours. Remove the bones and skin from the chicken, returning the meat to the pot.\nHeat 3/4 cup of the reserved liquid from the tomatoes in the microwave until just warmed. Stir the flour into the tomato liquid until thick. Add to the stockpot and stir continually until the mixture begins to thicken. Remove from heat and allow to sit for about 15 minutes.\nWhile the chicken mixture rests, bring a large pot of lightly-salted water to a boil. Stir the spaghetti into the water and return to a boil. Cook until the pasta is slightly tender but still firm to the bite, about 12 minutes. Drain. Ladle the chicken mixture over the drained spaghetti to serve.\n",
        "picture_link": "tJW1vTfMdliNakxjfBQCvCBJ.Egf/Z6"
    },
    {
        "title": "Chef John's Shrimp and Grits ",
        "ingredients": [
            "4 slices bacon, cut into 1/4-inch pieces ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "2 tablespoons heavy whipping cream ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "1 dash Worcestershire sauce ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 cup white grits ADVERTISEMENT",
            "1/2 cup shredded white Cheddar cheese ADVERTISEMENT",
            "1 pound shrimp, peeled and deveined ADVERTISEMENT",
            "1/2 teaspoon Cajun seasoning ADVERTISEMENT",
            "1/2 teaspoon salt, or to taste ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "1 tablespoon minced jalapeno pepper ADVERTISEMENT",
            "2 tablespoons minced green onion ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until almost crisp, 5 to 7 minutes. Remove from heat and transfer bacon to a dish, leaving drippings in the skillet.\nWhisk 1/4 cup water, cream, lemon juice, and Worcestershire sauce together in a bowl.\nStir 4 cups water, butter, and 1 teaspoon salt together in a pot; bring to a boil. Whisk grits into pot, bring to a simmer, reduce heat to low, and cook until grits are creamy, 20 to 25 minutes. Remove from heat and stir white Cheddar cheese into grits.\nPlace shrimp in a large bowl and season with Cajun seasoning, 1/2 teaspoon salt, black pepper, and a pinch of cayenne pepper.\nHeat skillet with bacon drippings over high heat. Cook shrimp in hot bacon fat in a single layer for 1 minute. Turn shrimp and add jalapeno; cook until fragrant, about 30 seconds. Stir cream mixture, bacon, green onion, and garlic to shrimp mixture; cook and stir, adding water as necessary to thin the sauce, until shrimp are cooked through, 3 to 4 minutes. Remove from heat and stir in parsley.\nLadle grits into a bowl and top with shrimp and sauce.\n",
        "picture_link": "H8Etro.5WDyXv1fXyqQuwG/swSLkYOO"
    },
    {
        "title": "Egg and Spinach Casserole",
        "ingredients": [
            "6 eggs, beaten ADVERTISEMENT",
            "3/4 cup onion, chopped ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped spinach, thawed and drained ADVERTISEMENT",
            "1 (16 ounce) package small curd cottage cheese ADVERTISEMENT",
            "1 (16 ounce) package shredded Cheddar cheese ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Prepare a 9x13 inch baking dish with cooking spray.\nBeat the eggs in a mixing bowl with the onion and flour until the flour is no longer lumpy. Stir in the spinach, cottage cheese, Cheddar cheese, butter, salt, and pepper until evenly combined; pour into the prepared dish.\nBake in the preheated oven until the casserole is bubbly and the top is golden brown, about 45 minutes.\n",
        "picture_link": "TLlhN3CkCigAvhVOhZKRYfwhS8vatQ6"
    },
    {
        "title": "Chocolate Popcorn",
        "ingredients": [
            "2 quarts popped popcorn ADVERTISEMENT",
            "1 cup peanuts (optional) ADVERTISEMENT",
            "3/4 cup sugar ADVERTISEMENT",
            "1/4 cup corn syrup ADVERTISEMENT",
            "1/4 cup cocoa powder ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 teaspoon vanilla ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 250 degrees F (120 degrees C). Oil a 10x15 inch baking pan with sides.\nPlace popcorn and peanuts into a large, metal bowl, and set aside. Stir together the sugar, corn syrup, cocoa powder, and butter in a saucepan over medium-high heat until it comes to a boil. Boil for 2 minutes. Stir in the vanilla, then pour over the popcorn. Stir until the popcorn is well coated. Spread the popcorn into the prepared pan.\nBake in preheated oven for 30 minutes, stirring several times.\nRemove from the oven, and allow to cool to room temperature. Break into small clumps, and store in an airtight container.\n",
        "picture_link": "Tj/sor5zy8mRwomhHibyU//R0MGUcM."
    },
    {
        "title": "Avocado-Shrimp Salad",
        "ingredients": [
            "2 avocados - peeled, pitted, and cubed ADVERTISEMENT",
            "2 tomatoes, diced ADVERTISEMENT",
            "1 small sweet onion, chopped ADVERTISEMENT",
            "1 pound cooked salad shrimp ADVERTISEMENT",
            "1 pinch salt and pepper to taste ADVERTISEMENT",
            "2 tablespoons lime juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together avocadoes, tomatoes, onion, and shrimp in a large bowl. Season to taste with salt and pepper. Stir in lime juice. Serve cold.\n",
        "picture_link": "SORFhMsOSJ.kMqAkdg6zpaVyayeKxy6"
    },
    {
        "title": "Easy Bok Choy",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "2 cloves garlic, crushed and chopped ADVERTISEMENT",
            "8 heads baby bok choy, trimmed and cut into bite-size pieces ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a large skillet or wok over medium heat, and cook the garlic in the hot oil until fragrant, 1 to 2 minutes.\nMix in the bok choy, and cook and stir until the green parts of the leaves turn bright green and the stalks become slightly translucent, 5 to 8 minutes. Sprinkle with salt to serve.\n",
        "picture_link": "FiHKhKyiOVvPoB.i9.vclLNaRWW2DiW"
    },
    {
        "title": "Green Smoothie",
        "ingredients": [
            "1 banana, thickly sliced, frozen ADVERTISEMENT",
            "2 cups chopped kale ADVERTISEMENT",
            "1 tablespoon flax seed meal (optional) ADVERTISEMENT",
            "1 tablespoon coconut oil (optional) ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1/3 cup orange juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the banana, kale, flax seed meal, and coconut oil into a blender, pour in the milk and orange juice. Cover, and puree until smooth; serve.\n",
        "picture_link": "43QsnUukBvq2wJfKjqGLQxRdet5hW4S"
    },
    {
        "title": "All Protein Meatloaf",
        "ingredients": [
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 (4 ounce) can tomato sauce ADVERTISEMENT",
            "1/3 cup crushed fried pork skins ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 1/2 tablespoons chili powder ADVERTISEMENT",
            "1 tablespoon garlic salt ADVERTISEMENT",
            "1 tablespoon garlic pepper seasoning ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C).\nIn a large bowl, mix together the ground beef, Worcestershire sauce. tomato sauce, crushed pork skins, and eggs. Season with chili powder, garlic salt, and garlic pepper. Mix until well blended. Form into a loaf, and place into a greased loaf pan.\nBake, uncovered for 35 to 40 minutes in the preheated oven. Let stand for at least 5 minutes before slicing and serving.\n",
        "picture_link": "Qm6CVjxFsGdA8skXlgphVpDK0wtzbI2"
    },
    {
        "title": "Roasted Roma Tomatoes and Garlic",
        "ingredients": [
            "8 roma (plum) tomatoes, halved ADVERTISEMENT",
            "12 cloves garlic, peeled ADVERTISEMENT",
            "4 tablespoons olive oil ADVERTISEMENT",
            "1/4 cup chopped fresh basil leaves ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 400 degrees F (200 degrees C).\nPlace the tomato halves in a shallow baking dish in which they can all fit in snugly side by side. Insert the whole cloves of garlic in between the tomatoes. Brush olive oil over the top and sprinkle with basil. Season with salt and pepper.\nBake uncovered for 35 to 45 minutes, until tomatoes have softened and are sizzling in the pan with the edges slightly charred. Serve while hot.\n",
        "picture_link": "Ay2x1FuTzDcw9qnWBm18hIuYAx5NrH6"
    },
    {
        "title": "Spicy Brown Mustard Chicken",
        "ingredients": [
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1/2 cup spicy brown mustard ADVERTISEMENT",
            "1/2 cup Italian seasoned bread crumbs ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "paprika to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a baking dish.\nBrush the chicken breast halves on all sides with the mustard. Place the bread crumbs in a shallow dish. Press the chicken into the bread crumbs to evenly coat. Arrange the chicken breasts in the prepared baking dish.\nIn a bowl, mix the butter, lemon juice, and water. Drizzle about 1 tablespoon of the mixture over each chicken breast. Pour the remaining mixture around the breasts in the dish.\nCover, and bake 45 minutes in the preheated oven. Uncover, season with paprika, and continue baking 15 minutes.\n",
        "picture_link": "bSKzfF9G.fqrLQbWZAQCFjT1GN0BgCq"
    },
    {
        "title": "Twenty-Four Hour Salad",
        "ingredients": [
            "6 cups shredded iceberg lettuce ADVERTISEMENT",
            "1/2 cup chopped celery ADVERTISEMENT",
            "1/2 cup chopped green bell pepper ADVERTISEMENT",
            "1/2 cup chopped onions ADVERTISEMENT",
            "1/2 cup frozen green peas, thawed and drained ADVERTISEMENT",
            "1 1/2 cups mayonnaise ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "1 (3 ounce) can bacon bits ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large transparent bowl, layer lettuce, celery, bell peppers, onions, peas, mayonnaise, sugar and cheese. Sprinkle bacon bits evenly over the top of the salad.\nCover bowl, and refrigerate for 24 hours before serving.\n",
        "picture_link": "SyRak7gM8ztOXZgJSFRCWmHt2KxZmzu"
    },
    {
        "title": "Sweet and Spicy Pumpkin Seeds",
        "ingredients": [
            "2 cups pumpkin seeds, rinsed and dried ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "2 drops hot pepper sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C). Line a baking pan with aluminum foil.\nStir together the pumpkin seeds and butter in a bowl. Add the salt, Worcestershire sauce, brown sugar, and hot pepper sauce; stir. Spread the seeds in a single layer on the baking pan.\nBake in preheated oven until crispy, about 45 minutes.\n",
        "picture_link": "8J0Udws5KImcP/7mPOxwM8636SBiA9W"
    },
    {
        "title": "Zesty Hominy and Cheese",
        "ingredients": [
            "3 (15 ounce) cans white hominy, drained ADVERTISEMENT",
            "1 (8 ounce) container sour cream ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "1 (4 ounce) can chopped green chile peppers ADVERTISEMENT",
            "1 pinch cayenne pepper (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a 2 quart casserole dish, mix together hominy, sour cream, cheddar cheese, chilies and cayenne pepper.\nBake for 25 minutes in the preheated oven, or until heated through.\n",
        "picture_link": "8eB1sQCEr6DuoeamVNCdfA3xQA29hH2"
    },
    {
        "title": "Zucchini Casserole I",
        "ingredients": [
            "8 cups diced zucchini ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "1 cup cornflakes cereal ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly oil a 9x13 inch baking dish.\nIn a large bowl, combine zucchini, bell pepper, cornflakes, cheese, oil, basil, and eggs. Season with salt and pepper to taste. Spread evenly into prepared baking dish.\nBake in the preheated oven for 45 minutes, or until top is golden brown.\n",
        "picture_link": "ZRPeIbAWwtlE2mizKjEdRIG16.nRHXi"
    },
    {
        "title": "Super Easy Spinach and Red Pepper Salad",
        "ingredients": [
            "1 (6 ounce) package baby spinach ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1/4 cup rice vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix the baby spinach, red bell pepper, and Parmesan cheese.\nIn a small bowl, mix the olive oil and rice vinegar. Toss with the baby spinach mixture, and serve.\n",
        "picture_link": "V8LxYqTCmXhWf00fK6h8bjKUVmQrBNS"
    },
    {
        "title": "Bubba's Best BBQ Sauce",
        "ingredients": [
            "1 cup cola-flavored carbonated beverage ADVERTISEMENT",
            "1 cup canned tomato sauce ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/2 cup Worcestershire sauce ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup molasses ADVERTISEMENT",
            "1/2 cup cider vinegar ADVERTISEMENT",
            "2 1/2 teaspoons balsamic vinegar ADVERTISEMENT",
            "1 1/2 tablespoons steak sauce ADVERTISEMENT",
            "1 tablespoon yellow mustard ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1 teaspoon dried savory ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1 teaspoon garlic salt ADVERTISEMENT",
            "1 teaspoon hot pepper sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan, mix together the cola, tomato sauce, tomato paste, butter, Worcestershire sauce, brown sugar, molasses, cider and balsamic vinegars, steak sauce, and mustard. Season with chili powder, savory, onion powder, garlic salt, and hot pepper sauce, and stir to blend. Cook over low heat, stirring occasionally, until the mixture is thick enough to coat the back of a metal spoon.\n",
        "picture_link": "2v4O0CBLmjysROIGc4UZwSMndRfC6h6"
    },
    {
        "title": "Chicken, Feta Cheese, and Sun-Dried Tomato Wraps",
        "ingredients": [
            "2 (4 ounce) skinless, boneless chicken breast halves ADVERTISEMENT",
            "1/4 cup sun-dried tomato dressing ADVERTISEMENT",
            "8 sun-dried tomatoes (not oil packed) ADVERTISEMENT",
            "1 cup boiling water ADVERTISEMENT",
            "1/3 cup crumbled feta cheese ADVERTISEMENT",
            "4 cups loosely packed torn fresh spinach ADVERTISEMENT",
            "4 (10 inch) whole wheat tortillas ADVERTISEMENT",
            "1/4 cup sun-dried tomato dressing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large resealable plastic bag, combine chicken breasts and 1/4 cup dressing. Seal, and refrigerate for several hours.\nPreheat grill for high heat. Combine sun-dried tomatoes and hot water in a small bowl. Set aside for 10 minutes, drain, and cut tomatoes into thin slices.\nLightly oil grill grate. Discard marinade, and place chicken on grill. Cook for 12 to 15 minutes, turning once, or until done.\nCut chicken into strips, and place in a medium bowl with sliced tomatoes, feta, and spinach. Toss with remaining 1/4 cup dressing. Distribute mixture between the four tortillas, and wrap. Either cut in half and enjoy cold, or place briefly back on grill until the tortilla turns warm and crispy.\n",
        "picture_link": "84c.WQeVqfJNhbb5Ewd7hOt/XT1YXwi"
    },
    {
        "title": "World's Best Cream Cheese and Pineapple Dip",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "2 cups crushed pineapple, drained with juice reserved ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "2 cloves garlic, peeled and crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, mix together cream cheese, crushed pineapple, onion powder and garlic. Mix in reserved juice from pineapple as desired. Chill in the refrigerator until serving.\n",
        "picture_link": "M3bAG48mI20lAlgFtPcwOFmtYgHLCli"
    },
    {
        "title": "Easy Vegetarian Red Beans Lasagna",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 (15 ounce) can red beans, drained ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes, drained ADVERTISEMENT",
            "1/2 red bell pepper, chopped ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1 1/2 cups cold milk ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "4 no-boil lasagna noodles ADVERTISEMENT",
            "4 ounces shredded Gruyere cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nHeat the olive oil in a skillet over medium heat, and cook the onion until tender. Mix in garlic, and cook until heated through. Mix in red beans, tomatoes, and red bell pepper. Season with basil, oregano, salt, and pepper. Continue cooking 10 minutes, stirring occasionally.\nMelt the butter in a saucepan over medium heat, and gradually mix in flour until smooth. Slowly stir in the milk. Mix in Parmesan cheese, and continue to cook and stir until slightly thickened.\nSpread 1/2 the red bean mixture in a 9x9 inch casserole dish, and top with 2 lasagna noodles. Layer with remaining bean mixture and remaining noodles. Cover with the sauce, and top with Gruyere cheese.\nBake 20 minutes in the preheated oven, or until lightly browned.\n",
        "picture_link": "NrEoOX8NZTzlrPwo1bBQshYA6tgmUDW"
    },
    {
        "title": "Kiwi Strawberry Smoothie",
        "ingredients": [
            "1 banana ADVERTISEMENT",
            "6 strawberries ADVERTISEMENT",
            "1 kiwi ADVERTISEMENT",
            "1/2 cup vanilla frozen yogurt ADVERTISEMENT",
            "3/4 cup pineapple and orange juice blend ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the banana, strawberries, kiwi, vanilla frozen yogurt, and pineapple and orange juice blend in a blender. Blend until smooth.\n",
        "picture_link": "AbJ4qYkgR9ncqwM4flio70xLYwnjAyi"
    },
    {
        "title": "Jamaican Burgers",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 1/4 cups chopped onion ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 habanero pepper, chopped ADVERTISEMENT",
            "1 1/2 tablespoons grated fresh ginger root ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3/4 teaspoon ground allspice ADVERTISEMENT",
            "3/4 teaspoon ground nutmeg ADVERTISEMENT",
            "2 1/4 cups cooked black beans, rinsed and drained ADVERTISEMENT",
            "2 1/4 cups cooked long-grain white rice ADVERTISEMENT",
            "2 1/2 cups dry bread crumbs ADVERTISEMENT",
            "6 hamburger buns, split ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1 tablespoon of olive oil in a large skillet over medium heat. Add onions and garlic; cook and stir for a few minutes. Mix in the habanero pepper and continue cooking until tender. Remove from the heat and transfer to a bowl. Pour in the beans, rice and bread crumbs. Season with ginger, salt, allspice and nutmeg. Mix thoroughly using your hands. Form into 6 patties.\nHeat the remaining oil in a large skillet over medium-high heat (you can use the same one). Fry the patties until golden on each side, about 10 minutes total. Serve on buns with your favorite toppings.\n",
        "picture_link": "kS2y6IHvBKcsR6/jyzPkp9SFklkJN/e"
    },
    {
        "title": "Hariton's 'Famous' Vegetarian Casserole",
        "ingredients": [
            "8 large eggplants ADVERTISEMENT",
            "8 large potatoes ADVERTISEMENT",
            "8 green bell peppers ADVERTISEMENT",
            "8 large onions ADVERTISEMENT",
            "8 summer squash ADVERTISEMENT",
            "6 tomatoes ADVERTISEMENT",
            "1 pound fresh green beans ADVERTISEMENT",
            "1 pound whole fresh mushrooms ADVERTISEMENT",
            "2 bulbs garlic, cloves separated and peeled ADVERTISEMENT",
            "1/4 cup chopped fresh dill weed ADVERTISEMENT",
            "1/4 cup chopped fresh oregano ADVERTISEMENT",
            "1/4 cup chopped fresh basil ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "3/4 cup olive oil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare the eggplant before assembling ingredients, by cutting them into 2 inch chunks and putting them into an extra large bowl with salted water to cover. This will draw out the bitterness from the eggplant. Let this sit for about 3 hours.\nPreheat oven to 375 degrees F (190 degrees C).\nCut the potatoes, green bell peppers, onion, squash and tomatoes into 2-inch chunks. Cut the green beans and mushrooms in half and peel the garlic cloves.\nDrain and rinse the eggplant, then combine it with all the other chopped vegetables, the dill, oregano and basil and place all into a 3x13x18 inch roasting pan. Pour the tomato sauce and olive oil over all.\nBake at 375 degrees F (190 degrees C) for 2 1/2 hours, adding a little water about halfway through cooking time to keep moist.\n",
        "picture_link": "r.E59UgkQG/Oy4ktSjCXl1rPYhHhs3O"
    },
    {
        "title": "Multigrain Pancakes",
        "ingredients": [
            "1/4 cup whole wheat flour ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup rolled oats ADVERTISEMENT",
            "1/4 cup cornmeal ADVERTISEMENT",
            "2 teaspoons granular no-calorie sucralose sweetener (e.g., Splenda ®) ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "2 tablespoons plain nonfat yogurt ADVERTISEMENT",
            "2 tablespoons skim milk ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, stir together the whole wheat flour, all-purpose flour, oats, cornmeal, sweetener, salt, baking powder, baking soda and cinnamon. In a separate bowl, whisk together the eggs, yogurt, milk and water. Pour the wet ingredients into the dry, and mix just until moistened.\nHeat a skillet over medium heat, and coat with cooking spray. Pour about 1/3 cup of batter per pancake onto the skillet. Cook until bubbles begin to form in the center, then flip and cook until browned on the other side.\n",
        "picture_link": "f3V5zNHhytDLh4HhSEjRnW5QU8G8shi"
    },
    {
        "title": "Salmon in Lemon-Dill Sauce",
        "ingredients": [
            "4 (5 ounce) salmon fillets ADVERTISEMENT",
            "5 tablespoons fresh lemon juice, divided ADVERTISEMENT",
            "3/4 teaspoon dried dill weed ADVERTISEMENT",
            "3/4 teaspoon lemon pepper ADVERTISEMENT",
            "10 tablespoons butter, divided ADVERTISEMENT",
            "1 shallot, minced ADVERTISEMENT",
            "1 tablespoon white wine vinegar ADVERTISEMENT",
            "5 tablespoons white wine, divided ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 teaspoon dill weed ADVERTISEMENT",
            "1 teaspoon parsley ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "salt and white pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place salmon in a shallow dish, and rub with 3 tablespoons lemon juice. Season with dill weed and lemon pepper. Cover, and allow to stand 10 to 15 minutes.\nHeat 2 tablespoons butter in a saucepan over medium heat, and saute shallot 2 minutes, until tender. Mix in remaining lemon juice, vinegar, and 1/4 cup wine. Simmer until reduced by at least 1/2. Stir in cream and milk. Season with dill, parsley, thyme, salt, and white pepper. Cook and stir until thickened. Whisk in 1/4 cup butter. Set aside and keep warm.\nHeat remaining 1/4 cup butter in a skillet over medium heat. Place salmon in the skillet, skin side up, and cook 1 to 2 minutes, until seared. Set salmon aside. Deglaze the skillet with remaining 1 tablespoon wine, then mix in the cream sauce. Return salmon to the skillet, and cook 8 minutes in the sauce, or until easily flaked with a fork. Serve with the sauce.\n",
        "picture_link": "PO4LR6ezEL.cPo2WacWlZUov5GrqvkS"
    },
    {
        "title": "Linguini with White Clam Sauce",
        "ingredients": [
            "1 (16 ounce) package linguine pasta ADVERTISEMENT",
            "4 tablespoons olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "2 (6.5 ounce) cans minced clams, drained with juice reserved ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "2 tablespoons white wine ADVERTISEMENT",
            "1/2 teaspoon chopped fresh parsley ADVERTISEMENT",
            "1/4 teaspoon pepper ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nHeat olive oil in a large heavy skillet over medium heat. Saute onion and garlic until soft and translucent. Stir in flour, then the reserved clam juice. Gradually blend in the milk. Stir in wine and parsley. Cook, stirring, for 5 minutes, or until sauce thickens. Mix in the clams. Spoon over cooked pasta.\n",
        "picture_link": "NnjRZm/p4EX5VSPAZBdKjs7ZbOSb7va"
    },
    {
        "title": "Pork Chile Rojo (Pulled Pork with Red Chile Sauce)",
        "ingredients": [
            "1 (4 pound) boneless pork shoulder roast, trimmed ADVERTISEMENT",
            "3 tablespoons chili powder ADVERTISEMENT",
            "1 cup chopped onions ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "2 (16 ounce) jars salsa ADVERTISEMENT",
            "2 (10 ounce) cans diced tomatoes with green chilies, undrained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the pork roast into an oven roasting bag set inside a slow cooker. Sprinkle the chili powder over the roast and arrange onions on top of the roast. Loosely close the top of the bag with a nylon tie. Use scissors to cut 3 vents, 1-inch long in the top of the bag. Pour the water into the bottom of the slow cooker, around the bag, so that it is at least 1 inch deep.\nCover and cook the pork on Low for 6 to 8 hours.\nRemove the pork and onions from the bag and place in a large Dutch oven; reserve 3/4 cup of liquid from the bag. Shred the pork by pulling it apart using two forks. Stir the salsa, tomatoes, and cooking liquid in with the shredded pork.\nBring to a boil over high heat, then reduce the heat to low. Cover and simmer for 1 hour, stirring occasionally.\n",
        "picture_link": "7k5O5bWu4Ovh3mlUWnMXXyootRp2I6W"
    },
    {
        "title": "Asparagus and Smoked Salmon Salad",
        "ingredients": [
            "1 pound fresh asparagus, trimmed and cut into 1 inch pieces ADVERTISEMENT",
            "1/2 cup pecans, broken into pieces ADVERTISEMENT",
            "2 heads red leaf lettuce, rinsed and torn ADVERTISEMENT",
            "1/2 cup frozen green peas, thawed ADVERTISEMENT",
            "1/4 pound smoked salmon, cut into 1 inch chunks ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1 teaspoon Dijon mustard ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a pot of water to a boil. Place asparagus in the pot, and cook 5 minutes, just until tender. Drain, and set aside.\nPlace the pecans in a skillet over medium heat. Cook 5 minutes, stirring frequently, until lightly toasted.\nIn a large bowl, toss together the asparagus, pecans, red leaf lettuce, peas, and salmon.\nIn a separate bowl, mix the olive oil, lemon juice, Dijon mustard, salt, and pepper. Toss with the salad or serve on the side.\n",
        "picture_link": "75R4C/w3zwMYhFmQgA4oEE5BECeO8CC"
    },
    {
        "title": "Mapled Ham",
        "ingredients": [
            "1 (4 pound) boneless ham ADVERTISEMENT",
            "1 (8 ounce) can pineapple slices, canned in syrup ADVERTISEMENT",
            "10 whole cloves ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 cup maple syrup ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPrick the ham with a fork. Place the pineapple slices on the ham, securing with toothpicks. Press the cloves into the ham. Place the ham in a baking dish with the water.\nIn a saucepan over low heat, melt the butter, and mix in the syrup, brown sugar, and honey until heated through. Pour 1/2 the mixture over the ham.\nBake the ham 1 hour and 30 minutes in the preheated oven. Baste frequently with the remaining butter and syrup mixture.\nRemove the ham from heat, and drain pan drippings into a saucepan over medium heat. Cook and stir until thickened, and serve with the ham.\n",
        "picture_link": "JBSsC9CEIq2qcgxLpADU.HaTb/gh4fi"
    },
    {
        "title": "Curried Cumin Potatoes",
        "ingredients": [
            "2 pounds new potatoes, cut into 1/4 inch thick pieces ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 tablespoons cumin seed ADVERTISEMENT",
            "2 teaspoons ground turmeric ADVERTISEMENT",
            "2 teaspoons curry powder ADVERTISEMENT",
            "2 teaspoons coarse sea salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "3 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place whole potatoes into a saucepan with water to cover. Bring to a boil, and cook until just tender. Drain, and cut potatoes into quarters. Set aside to keep warm.\nHeat oil in a large saute pan over medium-high heat. Saute the cumin, turmeric, and curry powder for 1 minute. Add potatoes, and saute until toasted. Toss potatoes with sea salt, pepper and fresh cilantro, and serve hot.\n",
        "picture_link": "aMqWUv1jvJKCtEwHyb2pwhuoGvmCkD6"
    },
    {
        "title": "Zucchini and Corn Topped with Cheese",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "6 medium zucchini, sliced ADVERTISEMENT",
            "1/2 medium onion, chopped ADVERTISEMENT",
            "1 (15.25 ounce) can whole kernel corn, drained ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes, drained ADVERTISEMENT",
            "2 teaspoons garlic powder ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/2 pound shredded Monterey Jack cheese ADVERTISEMENT",
            "1/2 pound shredded sharp Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a medium saucepan over medium heat, and saute the zucchini and onion 5 to 7 minutes, until onion is tender. Mix in the corn. Stir in the diced tomatoes. Season with garlic powder, salt, and pepper. Cover, and cook 15 minutes, or until zucchini is soft.\nRemove the saucepan from heat. Mix in the Monterey Jack cheese and Cheddar cheese. Cover, and let stand until cheeses are melted, about 5 minutes.\n",
        "picture_link": "viLS3xdTaSvyCyNtNXkrgEiSd2H7/di"
    },
    {
        "title": "Supreme Apple Butter",
        "ingredients": [
            "1 (12 fluid ounce) can frozen apple juice concentrate, thawed ADVERTISEMENT",
            "1/2 cup apple cider ADVERTISEMENT",
            "4 pounds Macintosh apples - peeled, cored and chopped ADVERTISEMENT",
            "3/4 cup dark brown sugar ADVERTISEMENT",
            "1 cup apple brandy ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan, bring apple juice concentrate, apple cider, and Macintosh apples to a boil. Reduce heat to low. Stirring occasionally, simmer uncovered about 1 hour, until apples are easily mashed.\nMix dark brown sugar, apple brandy, cinnamon, ginger, and cloves into the apple mixture. Bring to a boil, reduce heat, and simmer uncovered 2 hours, stirring occasionally, until thickened. Transfer to sealed sterile containers, and cool at least 1 hour before serving.\n",
        "picture_link": "IVD8xk5RSG7yNmb2OS/Q6wbSi6ig/fO"
    },
    {
        "title": "Grandmother's Pound Cake I",
        "ingredients": [
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1 (3.5 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "3/4 cup vegetable oil ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 teaspoon butter flavored extract ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour 9x13 inch pan.\nIn a large bowl, combine cake mix, pudding mix, oil and water. Beat until moistened. Add eggs and beat well. Add flavorings. Beat 6 to 8 minutes on medium high speed. Batter will be very thick.\nPour into prepared pan and bake at 350 degrees F (175 degrees C) for 40 to 45 minutes or until tester comes out clean.\n",
        "picture_link": "a46HV1Wjf92RWiDx5kXN8mRT4rrtgGS"
    },
    {
        "title": "Raw Apple Cake",
        "ingredients": [
            "3/4 cup vegetable oil ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "3 cups chopped Granny Smith apples ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 tablespoon milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "2 1/2 cups confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F(175 degrees C). Grease and flour a 9x13 inch pan.\nChop apples finely and place into a large bowl. In a separate bowl, beat eggs and oil together and pour over apples. Let stand while mixing the dry ingredients.\nin a medium bowl, mix sugar, flour, 1 teaspoon salt, cinnamon, nutmeg and baking soda. Fold into apples, eggs and oil and mix well. Batter will be thick.\nPour into prepared 9x13 inch pan, and bake at 350 degrees F ( 175 degrees C) for 45 minutes. Once cool frost with Cream Cheese Icing.\nTo Make Cream Cheese Frosting: In a medium bowl, combine cream cheese, milk, vanilla and pinch of salt. Gradually add sugar, beating until frosting is smooth. Add additional milk, 1 tablespoon at a time, until frosting is desired consistency.\n",
        "picture_link": "637o2kMtGs033oH3Z7R4Yy0kX1aFwsy"
    },
    {
        "title": "Tina's Best BBQ Lime Chicken",
        "ingredients": [
            "1 (4 pound) chicken, cut into pieces ADVERTISEMENT",
            "2 teaspoons seasoning salt ADVERTISEMENT",
            "2 teaspoons ground black pepper ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "1 1/2 cups fresh lime juice ADVERTISEMENT",
            "1 cup olive oil ADVERTISEMENT",
            "8 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Wash chicken parts. Pat dry thoroughly. Pierce all pieces with a fork. In a small bowl, combine the seasoning salt, ground black pepper and cayenne pepper. Rub all chicken parts with the spices, then place the chicken into a large, resealable plastic bag.\nIn a separate medium bowl, combine the lime juice, olive oil, garlic and cilantro. Mix well and pour into the bag with the chicken. Seal and let marinate in the refrigerator for at least 2 hours.\nPreheat an outdoor grill for low heat and lightly oil grate.\nRemove chicken from the refrigerator and pour marinade into a small saucepan over medium high heat. Bring to a boil for about 1 to 2 minutes.\nGrill chicken for about 1 1/2 hours. Brush with the marinade every 15 minutes. Chicken is done when juices run clear.\n",
        "picture_link": "jg7jhBvyNBvYpPwzDxIF03MarY3aBCm"
    },
    {
        "title": "Cupcake Graveyard",
        "ingredients": [
            "1 (18.25 ounce) package chocolate cake mix ADVERTISEMENT",
            "2 (16 ounce) packages vanilla frosting ADVERTISEMENT",
            "3/4 cup chocolate sandwich cookie crumbs ADVERTISEMENT",
            "24 chocolate covered graham cracker cookies ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare and bake cake mix according to package directions for cupcakes.\nIn a medium bowl stir 1 package of frosting with the cookie crumbs. Frost cooled cupcakes.\nFill a pastry bag, fitted with a plain tip, with remaining white frosting. Write R.I.P. on each chocolate covered graham cracker cookie. Stand a decorated cookie on top of each cupcake so that it looks like a tombstone. Place the cupcakes on a large cookie sheet that has been covered with green paper. Place paper ghosts and bats randomly through the graveyard. Serve!\n",
        "picture_link": "0ytHiBxJu7soaRmuOrGRYex.fnf28qK"
    },
    {
        "title": "Poulet Parisienne",
        "ingredients": [
            "6 bone-in chicken breast halves, with skin ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 (4.5 ounce) can mushrooms, with liquid ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1/2 cup cooking sherry ADVERTISEMENT",
            "1 tablespoon paprika ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace chicken breasts skin-side up in an 11x17 inch baking dish. In a medium bowl combine soup, mushrooms with liquid, sour cream and sherry. Mix well and pour mixture over chicken. Sprinkle with paprika.\nBake at 350 degrees F (175 degrees C) for about 1 1/4 hours, or until chicken is cooked through and tender, and juices run clear.\n",
        "picture_link": "Z0dwpQb1vWwqElCJK9TX8XQVRB3ZuJe"
    },
    {
        "title": "Great Chicken Marinade",
        "ingredients": [
            "6 boneless, skinless chicken breast halves ADVERTISEMENT",
            "1/3 cup olive oil ADVERTISEMENT",
            "1/3 cup lemon juice ADVERTISEMENT",
            "1 (.7 ounce) package Italian-style dressing mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the chicken breasts between sheets of waxed paper and pound until thin. Remove breasts and place into a large resealable plastic bag.\nIn a medium mixing bowl, combine the oil, lemon juice, and Italian-style seasoning. Pour mixture into the plastic bag containing the chicken.\nSeal the plastic bag and shake gently to ensure that all the chicken is in contact with the marinade. Refrigerate marinated chicken pieces overnight or up to two days.\nWhen ready to cook, preheat grill and lightly oil grate. Place chicken breasts on the grill and cook for about 5 to 7 minutes per side.\n",
        "picture_link": "q/BqaokqDnAR24DsLIPVpIyINVvsb/W"
    },
    {
        "title": "Stuffed Pepperoncini",
        "ingredients": [
            "6 slices bacon, cut into small pieces ADVERTISEMENT",
            "1/3 cup minced shallots ADVERTISEMENT",
            "1 red bell pepper, minced ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 tablespoon milk ADVERTISEMENT",
            "32 ounces pepperoncini ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet, cook bacon over medium heat until bacon is browned. Move bacon to paper towels. Keep bacon drippings.\nIn drippings, cook shallots and red pepper over medium heat until vegetables are tender. Cook about 5 minutes. Remove skillet from heat and let cool for 20 minutes.\nIn a small bowl, beat cream cheese and milk with an electric mixer at medium speed until smooth. Stir bacon and shallot into the mixture.\nSpoon cream cheese mixture into a heavy weight plastic bag. Cut a small hole in one corner to squeeze the filling from. With small knife, cut a slit lengthwise into each pepper. Do not cut the whole way through the pepper. By squeezing the bag, pipe cream cheese mixture into peppers. Cover and refrigerate for at least 1 hour, up to one day.\n",
        "picture_link": "VBHxg/58jmAZmOXKS6DXgPxKBcpn8t6"
    },
    {
        "title": "Mariu's Spaghetti with Meat Sauce",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/2 cup minced onion ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 cup minced celery ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "1/2 teaspoon white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon dried mint ADVERTISEMENT",
            "6 ounces fresh chopped mushrooms ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "2 (10.5 ounce) cans beef broth ADVERTISEMENT",
            "2 teaspoons dried basil ADVERTISEMENT",
            "1 pound spaghetti ADVERTISEMENT",
            "1 teaspoon olive oil ADVERTISEMENT",
            "3 tablespoons salt ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley, for garnish ADVERTISEMENT",
            "1/4 cup grated Romano cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet, warm olive oil over low heat; saute onion, garlic and celery until onion is transparent.\nStir in butter and increase heat to medium; brown beef until no longer pink. Mix in sugar, 1 teaspoon salt, mint and mushrooms; lower heat and stir for about 3 minutes.\nIn a large bowl, combine tomato paste and broth; pour liquid and basil to pot. Simmer over very low heat for about 2 hours, stirring occasionally.\nBring a large pot of water to a vigorous boil with 3 tablespoons salt and 1 teaspoon olive oil. Slip spaghetti into water holding on to ends until strands soften a bit. Cook over high heat for 7 to 8 minutes only. When properly cooked, raw taste should be gone but still have a firm texture.\nWhen ready to serve, combine pasta with meat sauce; serve on a warmed platter or bowl topped with parsley and Romano cheese.\n",
        "picture_link": "jXCoXFhntCvlWODapzwmFlFdbR5Ic8y"
    },
    {
        "title": "Mom's Chocolate Cake",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1 cup hot, brewed coffee ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "2 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour one 9x13 inch baking pan.\nCream the sugar and shortening together until light and fluffy. Add the eggs and mix well. Stir in the cocoa, milk, flour, baking powder, boiling coffee, baking soda and vanilla extract. Mix until just combined. Pour the batter into the prepared pan.\nBake at 350 degrees F (175 degrees C) for 30 to 35 minutes or until a toothpick inserted into the cake comes out clean.\n",
        "picture_link": "hO5RyM05wwo57jFouPX8P.Wrzo.ZefC"
    },
    {
        "title": "Owen's Veggie Stir-Fry",
        "ingredients": [
            "1 teaspoon cornstarch ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "1 carrot, sliced ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "1 zucchini, sliced ADVERTISEMENT",
            "2/3 cup fresh corn kernels ADVERTISEMENT",
            "1 clove crushed garlic ADVERTISEMENT",
            "4 green onions, sliced ADVERTISEMENT",
            "1 1/3 cups bean sprouts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the cornstarch and water in a small bowl. Mix in the soy sauce and olive oil, and set aside.\nHeat the vegetable oil in a skillet or wok over medium-high heat. Saute the carrot, pepper, and zucchini in oil for about 5 minutes. Stir in the corn, garlic, green onions, and bean sprouts. Pour in the soy sauce mixture. Cook and stir for about 5 minutes, or until vegetables are tender but crisp. Serve immediately.\n",
        "picture_link": "y4j4s3lYH0fzAvdFUeNSyXW5C/1uFZq"
    },
    {
        "title": "Easy Cheesy Potatoes",
        "ingredients": [
            "6 potatoes, thinly sliced ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1/4 cup chopped green bell pepper ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/4 cup butter or margarine ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill for medium-high heat.\nCoat one side of a piece of aluminum foil large enough to hold all the potatoes and vegetables with cooking spray. Place the potatoes, onion, and green bell pepper in the center of the foil, and season with salt and pepper to taste. Then place small pats of the butter or margarine over the vegetables.\nCarefully seal all the edges of the foil around the vegetables to form a packet. (Note: Double wrapping will help to prevent burning.)\nPlace packet on the preheated grill, and grill for 20 minutes. Turn packet, and grill for 10 more minutes.\nCarefully open packet, check for tenderness with a fork. If tender, sprinkle the cheese over the vegetables and allow it to melt. Transfer to a platter, and serve with your main entree.\n",
        "picture_link": "pR.CnBY9eMnU5oTwY3MOyTP4mo/Ozhe"
    },
    {
        "title": "Bakery Shop Icing",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "6 tablespoons shortening ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1/2 cup warm milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, cream butter, shortening, sugar and vanilla together. Stir cornstarch into milk and add to butter mixture. Beat at low speed until well blended. Beat another 5 to 7 minutes until icing is creamy.\nNote: This icing will appear curdled at first, but continue beating and it will become smooth.\n",
        "picture_link": "npP4yeSgFSxeizD5wCoY02cdwjOWtwK"
    },
    {
        "title": "Jelly Bean Nests",
        "ingredients": [
            "2 cups miniature marshmallows ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "4 cups chow mein noodles ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Butter a 12 cup muffin tin.\nCombine marshmallows and butter over medium heat in a saucepan; stir until the butter and marshmallows have melted. Stir in the chow mein noodles, coat well. Butter fingers and press the mixture into the bottom and sides of the prepared muffin tin. Refrigerate until firm.\n",
        "picture_link": "dGmqDPT0H5kj8MwcLMPYvt3Q9dA9w1K"
    },
    {
        "title": "Zucchini-Coconut Cookie Bars",
        "ingredients": [
            "3/4 cup margarine, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "3/4 cup flaked coconut ADVERTISEMENT",
            "3/4 cup chopped pitted dates ADVERTISEMENT",
            "3/4 cup raisins ADVERTISEMENT",
            "2 cups grated zucchini ADVERTISEMENT",
            "1 tablespoon margarine, melted ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "1 cup finely chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking pan.\nIn a large bowl, cream together the butter, white sugar, and brown sugar. Mix in eggs and 1 teaspoon vanilla until fluffy. Sift together the flour, salt, and baking powder; stir into the creamed mixture. Stir in the coconut, dates, raisins, and zucchini. Spread batter into the prepared pan.\nBake in preheated oven for 35 to 40 minutes. To make icing, mix together melted margarine, milk, 1 teaspoon vanilla, cinnamon, and confectioners' sugar. Drizzle icing over the bars while still warm. Sprinkle chopped nuts over icing. Cut into bars when cool.\n",
        "picture_link": "ngMd950nwrlQg2W1JDuf/ti3h1TOZk2"
    },
    {
        "title": "Peanut Butter Cup Cookies II",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup peanut butter ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "2/3 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "15 miniature chocolate covered peanut butter cups, unwrapped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees.\nIn a medium bowl, cream the butter, white sugar, brown sugar, and peanut butter together. Stir in the egg and vanilla. Sift together the flour, baking soda and salt; stir into the creamed mixture.\nDrop by tablespoonfuls into the cups of a muffin tin. Cups should be about 1/4 full. Bake for 8 to 10 minutes, until lightly browned. Remove from oven and immediately press a peanut butter cup into the center of each cookie. Allow the cookies to cool completely before removing from their pan.\n",
        "picture_link": "uRTfM1svOY1OuUY1IcSVuhTTGE3RfRm"
    },
    {
        "title": "Borscht I",
        "ingredients": [
            "6 cups water ADVERTISEMENT",
            "3/4 tablespoon salt ADVERTISEMENT",
            "1/2 cup finely chopped carrots ADVERTISEMENT",
            "1/4 cup chopped green bell pepper, divided ADVERTISEMENT",
            "1/2 stalk celery, chopped ADVERTISEMENT",
            "1 medium beet ADVERTISEMENT",
            "1/2 cup canned peeled and diced tomatoes ADVERTISEMENT",
            "3 potatoes, quartered ADVERTISEMENT",
            "1/3 cup butter ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1 1/2 cups canned tomatoes ADVERTISEMENT",
            "3 cups finely shredded cabbage, divided ADVERTISEMENT",
            "1/4 cup heavy cream ADVERTISEMENT",
            "3/4 cup diced potatoes ADVERTISEMENT",
            "1 tablespoon dried dill weed ADVERTISEMENT",
            "1/4 teaspoon ground black pepper to taste ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place water, salt, carrots, 1/2 of the bell pepper, celery, beet, tomatoes, and quartered potatoes in a large stock pot over high heat. Bring to a boil.\nMelt 1/3 cup butter in a separate skillet over medium heat. Saute onions in butter until tender, approximately 5 minutes. Stir in tomatoes, reduce heat to medium low, and simmer for 15 minutes. Remove 1/2 cup of sauce from skillet, and set aside. Stir half of the cabbage into the skillet with remaining sauce, and continue simmering 5 minutes more, or until tender.\nRemove beet from boiling liquid and discard. Remove potatoes with a slotted spoon or tongs, and place in a bowl with remaining 1 tablespoon of butter and the cream. Mash together until smooth.\nReturn the 1/2 cup of reserved onion-tomato sauce to the stock pot. Stir in diced potatoes, and simmer until just tender but still firm, approximately 5 minutes. Increase heat to a low boil, and stir in remaining cabbage, tomato sauce, and mashed potatoes. Reduce heat and simmer a few minutes more. Stir in remaining bell pepper, season with black pepper, and serve.\n",
        "picture_link": "kvlxyuKdLTBbypnNSZ/4lKY32JnTOUu"
    },
    {
        "title": "Turkey Tetrazzini I",
        "ingredients": [
            "1 (8 ounce) package angel hair pasta ADVERTISEMENT",
            "2/3 cup sliced onion ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground white pepper ADVERTISEMENT",
            "1/2 teaspoon poultry seasoning ADVERTISEMENT",
            "1/4 teaspoon ground mustard ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "2 tablespoons chopped pimento peppers ADVERTISEMENT",
            "1 (4.5 ounce) can sliced mushrooms ADVERTISEMENT",
            "1 pound cooked turkey, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 400 degrees F (200 degrees C). Bring a large pot of lightly salted water to a boil. Add the pasta and cook for 4 minutes, or until almost tender. Drain.\nMelt the butter in a saucepan over medium heat. Add the onion; cook and stir until tender. Stir in the flour until blended, then gradually stir in the milk so that no lumps form. Season with salt, pepper, poultry seasoning and mustard. Cook over medium heat, stirring constantly until the mixture thickens. Remove from the heat and add 2/3 cup cheese and pimento, stirring until cheese melts. Add undrained mushrooms to cheese sauce.\nPlace a layer of pasta in the bottom of a 9x13 inch baking dish. Cover with a layer of turkey, and then a layer of cheese sauce. Repeat the layers. Sprinkle remaining 1/3 cup cheese over top.\nBake for about 25 minutes in the preheated oven, until sauce is bubbly and cheese on top is toasted.\n",
        "picture_link": "d0M1DHnEUyBlJE3qI7rM.RK5aFAgwsa"
    },
    {
        "title": "Corn and Chicken Chowder",
        "ingredients": [
            "3 slices ham, chopped ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3 stalks celery, sliced thin ADVERTISEMENT",
            "2 pounds peeled and cubed potatoes ADVERTISEMENT",
            "3 cups chicken broth ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "1 1/2 pounds chicken tenderloins ADVERTISEMENT",
            "4 cups fresh corn kernels ADVERTISEMENT",
            "3 cups skim milk ADVERTISEMENT",
            "1 1/2 teaspoons dried thyme ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "6 teaspoons all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put onion, ham, celery, chicken broth, water, and chicken tenderloins in 6 quart stock pot. With stock pot partially covered bring to a boil, lower heat and simmer for about 15 to 20 minutes or until chicken is cooked through. Remove chicken and set aside.\nAdd corn, potatoes, milk, thyme, and pepper to pot, salt is optional. Simmer, uncovered until potatoes are tender.\nCut chicken tenderloins into 1/2 inch pieces and return to stock pot.\nThicken soup with cornstarch or flour, adding in 2 tablespoon increments and stirring. Once soup has reached desired thickness let simmer 5 minutes and then serve.\n",
        "picture_link": "BYaEvqs.5MG6GyGWDOeXJK.vlxLeUDa"
    },
    {
        "title": "My Favorite Soup",
        "ingredients": [
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 cup chopped green onions ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed cream of potato soup ADVERTISEMENT",
            "1 (15.25 ounce) can whole kernel corn ADVERTISEMENT",
            "1 pound cooked shrimp ADVERTISEMENT",
            "1/2 cup milk, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a soup pot, slowly melt cream cheese and butter over low heat. Add green onions and simmer 10 to 15 minutes. Stir in potato soup and corn. Simmer 10 to 15 minutes.\nStir in milk to desired consistency. Begin with 1/2 cup of milk and add more if needed. Soup will be thick. Add shrimp and heat thoroughly.\n",
        "picture_link": "cCAmmqS4itPH88czVgmDShcyEJeau9C"
    },
    {
        "title": "Mitzie's Beef Stroganoff",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1 cup beef broth ADVERTISEMENT",
            "2 teaspoons Worcestershire sauce ADVERTISEMENT",
            "3/4 teaspoon prepared mustard ADVERTISEMENT",
            "1/4 cup light sour cream ADVERTISEMENT",
            "1/4 cup light cream cheese, softened ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium-high heat. Crumble ground beef into the hot skillet; season with salt and pepper. Cook and stir beef until completely browned, 7 to 10 minutes. Drain and discard any excess grease. Transfer beef to a bowl.\nMelt butter in the skillet over medium heat. Cook and stir onion and garlic in hot butter until softened, 3 to 5 minutes. Stir flour into onion mixture; cook and stir until flour is browned, about 1 minute. Return beef to the skillet; stir. Pour beef broth over the mixture in the skillet; bring to a boil. Stir Worcestershire sauce and mustard through the mixture.\nPlace a cover on the skillet, reduce heat to medium-low, and cook mixture at a simmer until the consistency is gravy-like, about 1 hour.\nStir sour cream and cream cheese through the beef mixture to serve.\n",
        "picture_link": "yHX3tSveFkMVAdqdlBzsiKXzJU9Nb1."
    },
    {
        "title": "Onion Baked Chicken",
        "ingredients": [
            "1 (1 ounce) package dry onion soup mix ADVERTISEMENT",
            "1 cup panko bread crumbs ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 425 degrees F (220 degrees C). Combine the soup mix and panko in a mixing bowl; set aside. Line a baking sheet with foil.\nCoat the chicken breasts all over with mayonnaise, then press into the panko mixture. Place the breasts on the baking sheet.\nCook the chicken breasts until no longer pink in the center and the juices run clear, about 25 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "o4M4D/Wx1TTrf9HEHOL/vMRV.ismm4."
    },
    {
        "title": "Aunty Pasto's Seafood Lasagna",
        "ingredients": [
            "8 lasagna noodles ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 1/2 cups cottage cheese, creamed ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "2 teaspoons dried basil ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed cream of mushroom soup ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "1/3 cup dry white wine ADVERTISEMENT",
            "1 (6 ounce) can crabmeat ADVERTISEMENT",
            "1 pound cooked salad shrimp ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1/2 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "2 cups fresh sliced mushrooms ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook noodles in a large pot of boiling salted water until done. Rinse and drain noodles. Set aside.\nMelt butter or margarine in a small saute pan over medium heat. Add onion; cook and stir until tender. Add cream cheese, cottage cheese, egg, basil, and salt and pepper.\nIn a medium bowl, combine soup, milk, and wine. Stir in crab, shrimp, and mushrooms.\nPlace 4 noodles in the bottom of a well oiled 9x13 inch pan. Spread 1/2 cheese mixture over the noodles, and spoon 1/2 soup mixture over cheese. Repeat layers.\nBake, uncovered, at 350 degrees F (175 degrees C) for 45 minutes. Top with sharp cheese, and parmesan cheese. Brown lasagna under broiler. Remove from oven, and let stand 15 minutes before serving.\n",
        "picture_link": "9mJt8GVnCsqATTbKA60mqNXjYiIU7Wq"
    },
    {
        "title": "Miss Bettie's Zesty Grilled Corn",
        "ingredients": [
            "1/3 cup butter ADVERTISEMENT",
            "2 tablespoons prepared mustard ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1/4 teaspoon lemon pepper ADVERTISEMENT",
            "2 teaspoons prepared horseradish ADVERTISEMENT",
            "6 ears fresh corn ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill for medium heat.\nIn a small saucepan, melt butter or margarine. Stir in mustard, horseradish, Worcestershire sauce, and lemon pepper seasoning.\nPlace each ear of corn on a 13x12 inch piece of HEAVY DUTY aluminum foil. Drizzle with butter mixture. Wrap loosely, leaving space for the expansion of steam, and seal.\nGrill over medium coals for 15 to 20 minutes, or until corn is tender. Small ears will take less time, and larger ears may take more. Carefully unwrap foil, and serve.\n",
        "picture_link": "H3D26BFpaBLsjpaP9cn/jFVqUQ4M7ea"
    },
    {
        "title": "Tuscan Bean, Chicken, and Italian Sausage Soup",
        "ingredients": [
            "3/4 pound Italian chicken sausage links, casings removed and sausages cut into 1/4-inch pieces ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 yellow squash, sliced ADVERTISEMENT",
            "2 cloves garlic, pressed ADVERTISEMENT",
            "1 (32 ounce) carton chicken broth ADVERTISEMENT",
            "2 (15 ounce) cans white beans, drained and rinsed ADVERTISEMENT",
            "1 (15 ounce) can Italian-style diced tomatoes ADVERTISEMENT",
            "2 cups baby spinach leaves ADVERTISEMENT",
            "1/3 cup red wine ADVERTISEMENT",
            "1 teaspoon Italian seasoning ADVERTISEMENT",
            "3 tablespoons grated Pecorino-Romano cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook sausage in a large pot over medium-high heat until cooked through and completely browned, 5 to 7 minutes. Drain and discard grease.\nCook and stir onion with the sausage until translucent, about 5 minutes. Add squash and garlic; cook and stir until the garlic is fragrant, about 1 minute more.\nPour chicken broth, white beans, and diced tomatoes into the pot; stir. Add spinach, red wine, and Italian seasoning; bring the mixture to a simmer and cook until hot, about 15 minutes. Ladle soup into bowls and garnish with Pecorino-Romano cheese to serve.\n",
        "picture_link": "llf9C4SVMJzIMQLwtr9Ylgm/v0t/YAS"
    },
    {
        "title": "Hibachi-Style Fried Rice",
        "ingredients": [
            "1/4 cup olive oil ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 cup chopped grilled chicken (optional) ADVERTISEMENT",
            "1/2 cup chopped green onion ADVERTISEMENT",
            "2 tablespoons chopped garlic ADVERTISEMENT",
            "2 cups cooked white rice ADVERTISEMENT",
            "3 tablespoons soy sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a wok or non-stick skillet over medium-high heat; add olive oil. Cook and stir eggs in the hot oil until cooked through, 2 to 3 minutes. Add chicken, green onion, and garlic to scrambled eggs; cook and stir until heated through, about 2 minutes.\nMix rice into egg mixture; cook and stir until rice is warmed, about 2 minutes. Add soy sauce; cook and stir until rice mixture is evenly coated, about 3 minutes.\n",
        "picture_link": "X0E17se2j15d8F6drquVo/jqCn.Rr5."
    },
    {
        "title": "Pumpkin Parfait",
        "ingredients": [
            "1 cup pumpkin puree ADVERTISEMENT",
            "1 (1 ounce) package instant sugar-free vanilla pudding mix ADVERTISEMENT",
            "1 teaspoon pumpkin pie spice ADVERTISEMENT",
            "1 cup evaporated skim milk ADVERTISEMENT",
            "1 cup skim milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a mixing bowl, combine the pumpkin puree, vanilla pudding mix, pumpkin pie spice, evaporated milk and skim milk. Blend together until smooth; place in parfait glasses and chill until set.\n",
        "picture_link": "Gl2SLd6s143iRQRmO4WK8ADKfmn1FMi"
    },
    {
        "title": "Zucchini and Pork Soup",
        "ingredients": [
            "4 pork chops ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "2 teaspoons vegetable oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 teaspoons chopped garlic ADVERTISEMENT",
            "1 cup chopped red bell pepper ADVERTISEMENT",
            "2 zucchinis, quartered and sliced ADVERTISEMENT",
            "1/8 cup chopped sun-dried tomatoes ADVERTISEMENT",
            "8 ounces fresh mushrooms, sliced ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "2 (14.5 ounce) cans chicken broth ADVERTISEMENT",
            "2 tablespoons oyster sauce ADVERTISEMENT",
            "2 teaspoons dried basil ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "4 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place flour in a resealable plastic bag. Add pork cubes. Seal bag and shake to coat. In a large skillet, heat 1 teaspoon oil over medium high heat. Add pork and brown in oil for about 8 to 10 minutes. Set aside.\nIn a 5 to 8 quart soup pot, heat remaining teaspoon of oil over medium heat. Add the onions, garlic and bell pepper. Saute for just a few minutes until tender, but not browned.\nAdd reserved pork, zucchini, sun-dried tomato bits, mushrooms, diced tomatoes, chicken broth, oyster sauce, basil, oregano, salt and pepper. Heat until almost boiling, then reduce heat and simmer for 10 to 15 minutes. Sprinkle with cheese and serve.\n",
        "picture_link": "EQ8arB0P9ouk3HJGtY.J5DJ2rmctz4C"
    },
    {
        "title": "Mushroom and Spinach Ravioli with Chive Butter Sauce",
        "ingredients": [
            "1 teaspoon olive oil ADVERTISEMENT",
            "1 1/2 tablespoons water, or more if needed ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 cups all-purpose flour, or more if needed ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 teaspoon olive oil ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1 (8 ounce) package fresh mushrooms, coarsely chopped ADVERTISEMENT",
            "4 ounces cream cheese, softened ADVERTISEMENT",
            "1/3 cup grated Parmesan cheese ADVERTISEMENT",
            "1/2 cup mozzarella cheese ADVERTISEMENT",
            "1/2 cup frozen chopped spinach, thawed and drained ADVERTISEMENT",
            "1 tablespoon chopped fresh chives ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "1/2 teaspoon ground cayenne pepper ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 egg white, beaten ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1 1/2 teaspoons chopped fresh chives ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together 1 teaspoon olive oil, water, and whole eggs in a bowl until evenly blended; set aside. Combine flour and salt in a separate large bowl, and make a well in the center. Pour the egg mixture into the well and stir just until combined. Turn dough out onto a lightly floured surface and knead until smooth, 5 to 10 minutes, adding more flour or water as needed. Wrap dough tightly with plastic wrap, and set aside to rest.\nHeat 1 teaspoon olive oil in a skillet over medium heat. Stir in the garlic and onion; cook and stir until the onion begins to soften, about 2 minutes. Add the mushrooms, and continue cooking and stirring until the vegetables are soft and the liquid has evaporated, about 10 minutes. Remove from heat, and allow to cool.\nBeat cream cheese in a bowl until smooth. Stir in the cooled mushroom mixture, Parmesan cheese, mozzarella cheese, spinach, 1 tablespoon chives, parsley, and cayenne pepper. Season with salt and pepper.\nRoll the pasta dough out to about 1/16 inch thick. Cut 3 to 4-inch circles using a large cookie cutter. Roll each circle out as thin as possible. Working with one circle at a time, brush the pasta lightly with the egg white. Scoop about 1 heaping tablespoon full of the mushroom filling onto the center of the pasta, then cover with a second piece of pasta, pinching the edges to seal. Cut the sealed ravioli with the cookie cutter once more to create a uniform shape. Place the finished ravioli on a floured baking sheet, and repeat the process with the remaining pasta and filling.\nFill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the ravioli and return to a boil. Cook until the pasta floats to the top, 3 to 4 minutes; drain.\nTo make sauce: Melt butter in a skillet over high heat, cooking and stirring until browned, 5 to 7 minutes. Stir in 1 1/2 teaspoons chives. Serve over hot ravioli.\n",
        "picture_link": "YXJD4JFG2x7O/6dJKyow//W3jnNInEC"
    },
    {
        "title": "Chocolate Dipped Orange Biscotti",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "1/2 cup chopped almonds ADVERTISEMENT",
            "2 tablespoons orange zest ADVERTISEMENT",
            "4 (1 ounce) squares bittersweet chocolate ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a cookie sheet.\nIn a medium bowl, stir together flour, sugar, baking powder, baking soda, and salt. Beat in the egg and egg white, then mix in almonds and orange zest. Knead dough by hand until mixture forms a smooth ball.\nRoll the dough into a log about 10 inches long; place on the prepared cookie sheet. Press down, or roll with a rolling pin, until log is 6 inches wide.\nBake for 25 minutes in preheated oven. After baking, cool on a rack. With a serrated knife, cut into 1 inch slices. Place slices, cut side down, back onto the baking sheet.\nReturn them to the oven for an additional 20 to 25 minutes; turning over half way through the baking. Melt the chocolate over a double boiler or in the microwave oven. Allow chocolate to cool but not harden before dipping one side of the biscotti into it. Place cookies on wire racks, chocolate side up, until cool and dry.\n",
        "picture_link": "6QZu085rFRX7sFAdgpGfLU9X/4qM.ky"
    },
    {
        "title": "Bloody Broken Glass Cupcakes",
        "ingredients": [
            "1 (18.25 ounce) package white cake mix ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 (16 ounce) can white frosting ADVERTISEMENT",
            "Sugar Glass: ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 cup light corn syrup ADVERTISEMENT",
            "3 1/2 cups white sugar ADVERTISEMENT",
            "1/4 teaspoon cream of tartar ADVERTISEMENT",
            "Edible Blood: ADVERTISEMENT",
            "1/2 cup light corn syrup ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1/4 cup water, or more as needed ADVERTISEMENT",
            "15 drops red food coloring ADVERTISEMENT",
            "3 drops blue food coloring ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Line 2, 12-cupcake tins with paper cupcake liners.\nBlend cake mix, 1 cup water, vegetable oil, and eggs in a large bowl. Beat with a mixer on low speed for 2 minutes. Divide cake batter between lined cupcake tins.\nBake cupcakes in preheated oven until a toothpick inserted in the center comes out clean, 18 to 22 minutes. Cool completely. Frost cupcakes with white frosting.\nMake the sugar glass. Mix 2 cups water, 1 cup corn syrup, white sugar, and cream of tartar in a large saucepan; bring to a boil. Use a candy thermometer and boil sugar syrup until temperature reaches 300 degrees (hard ball), stirring constantly. The mixture will thicken as water evaporates. When sugar reaches 300 degrees, quickly pour onto a metal baking pan. Cool until completely hardened. Break into \"shards\" using a meat mallet.\nMake the edible blood. Mix together 1/2 cup corn syrup and cornstarch in a large bowl. Slowly stir in the 1/4 cup of water, adding more if necessary, until the corn syrup mixture has thickened to the consistency of blood. Stir in the red and blue food coloring.\nStab each frosted cupcake with a few shards of broken sugar glass. Drizzle on drops of \"blood\" to complete the effect.\n",
        "picture_link": "rOVFZ9OOOcCrp2Cxvsq3ViJ1j3GqywS"
    },
    {
        "title": "Manicotti with Cheese",
        "ingredients": [
            "1 (8 ounce) package manicotti pasta ADVERTISEMENT",
            "2 cups whole milk ricotta cheese ADVERTISEMENT",
            "2 cups shredded mozzarella cheese ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "3 1/2 (32 ounce) jars spaghetti sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain and cool on waxed paper or aluminum foil to prevent the noodles from sticking together.\nPreheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl, combine ricotta cheese, mozzarella cheese, Parmesan cheese, parsley, salt and pepper; fill manicotti with cheese mixture.\nIn a 9x13 inch baking dish, spread a thin layer of spaghetti sauce on the bottom and arrange manicotti in a single layer; cover with remaining sauce. Cover dish with aluminum foil and bake in preheated oven for 40 minutes. Remove foil and bake for 15 minutes longer; serve.\n",
        "picture_link": "t83zNDCgLeG2kZ/PmedTDoGJU8A05Fe"
    },
    {
        "title": "Crispy Eggplant with Spicy Tomato Sauce",
        "ingredients": [
            "1 eggplant, peeled and cut into 1/4-inch slices ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1/2 cup wheat germ ADVERTISEMENT",
            "2 cups tomato sauce (such as Prego® Heart Smart) ADVERTISEMENT",
            "1 teaspoon cayenne pepper ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 400 degrees F (200 degrees C).\nSprinkle the eggplant slices with a little salt on each side. Place onto a baking sheet, and set aside for 10 minutes. After 10 minutes, blot with paper towels to remove the moisture that has accumulated. Meanwhile, beat the eggs and milk together in a mixing bowl; set aside. Mix the Parmesan cheese and wheat germ until evenly combined; set aside.\nDip the dried eggplant slices into the egg, allow excess egg to drip off, then press into the Parmesan cheese mixture until coated on both sides. Gently shake off any excess Parmesan cheese, and place the eggplant slices onto a baking sheet. Repeat with remaining eggplant slices.\nBake in the preheated oven until tender and golden brown, 15 to 20 minutes. While the eggplant slices are baking, cook and stir the tomato sauce and cayenne pepper in a saucepan over medium heat until hot. When the eggplant is done, pour the sauce over top, and sprinkle with mozzarella cheese to serve.\n",
        "picture_link": "5d5.MkpBaAMPf7goB2X1LFRDnGssS1S"
    },
    {
        "title": "Tortilla Soup I",
        "ingredients": [
            "9 cups chicken broth ADVERTISEMENT",
            "6 cloves roasted garlic ADVERTISEMENT",
            "1/2 cup chopped tomatoes ADVERTISEMENT",
            "1/2 yellow onion, chopped ADVERTISEMENT",
            "2 fresh jalapeno peppers, sliced into rings ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1/2 yellow onion, sliced ADVERTISEMENT",
            "2 cups shredded, cooked chicken meat ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "6 (6 inch) corn tortillas, cut into strips and toasted for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In heavy pot, bring the broth to a boil. Add garlic, tomatoes, chopped onion, jalapeno, and oregano to the stocks. Simmer uncovered for 30 minutes.\nBroil the sliced onions until soft and a little brown. Add broiled onions, chicken, lime juice to soup, and simmer till chicken is heated.\nPlace toasted tortilla strips in each bowl and pour soup over strips.\n",
        "picture_link": "vVS7XKW9KQnqIP40Y5mCy8htZCwDMmq"
    },
    {
        "title": "Tofu Quiche with Broccoli",
        "ingredients": [
            "1 (9 inch) unbaked 9 inch pie crust ADVERTISEMENT",
            "1 pound broccoli, chopped ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 onion, finely chopped ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 pound firm tofu, drained ADVERTISEMENT",
            "1/2 cup soy milk ADVERTISEMENT",
            "1/4 teaspoon Dijon mustard ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon ground red pepper ADVERTISEMENT",
            "black pepper to taste ADVERTISEMENT",
            "1 tablespoon dried parsley ADVERTISEMENT",
            "1/8 cup Parmesan flavor soy cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Bake pie crust in preheated oven for 10 to 12 minutes.\nPlace broccoli in a steamer over 1 inch of boiling water, and cover. Cook until tender but still firm, about 2 to 6 minutes. Drain.\nHeat oil in a large skillet over medium-high heat. Saute onion and garlic until golden. Stir in the cooked broccoli and heat through.\nIn a blender, combine tofu, soy milk, mustard, salt, nutmeg, ground red pepper, black pepper, parsley and Parmesan soy cheese; process until smooth. In a large bowl combine tofu mixture with broccoli mixture. Pour into pie crust.\nBake in preheated oven until quiche is set, 35 to 40 minutes. Allow to stand for at least 5 minutes before cutting.\n",
        "picture_link": "xPA18oQXXGzEQqTfC3j35V1gcv0ZNSO"
    },
    {
        "title": "Tuna Salad with Cranberries",
        "ingredients": [
            "2 (5 ounce) cans solid white tuna packed in water, drained ADVERTISEMENT",
            "2 tablespoons mayonnaise ADVERTISEMENT",
            "1/3 teaspoon dried dill weed ADVERTISEMENT",
            "3 tablespoons dried cranberries ADVERTISEMENT",
            "salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the tuna in a bowl, and mash with a fork. Mix in mayonnaise to evenly coat tuna. Mix in dill and cranberries, and season with salt. Enjoy on crackers or the bread of your choice!\n",
        "picture_link": "R11g46qtmgUGXc7.S6UHzTlBf9ke.xe"
    },
    {
        "title": "Creamy Chicken With Pasta and Broccoli",
        "ingredients": [
            "1 pound uncooked spaghetti ADVERTISEMENT",
            "1 pound broccoli florets ADVERTISEMENT",
            "1 tablespoon margarine ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast halves - cut into strips ADVERTISEMENT",
            "1/2 cup chopped onions ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "2/3 cup milk ADVERTISEMENT",
            "2/3 cup water ADVERTISEMENT",
            "1 (3 ounce) package cream cheese, cubed and softened ADVERTISEMENT",
            "3/4 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Place spaghetti in the pot, and cook 4 minutes. Mix in the broccoli florets. Continue cooking 4 to 6 minutes, until spaghetti is al dente. Drain, and transfer to a large bowl.\nMelt the margarine in a skillet over medium heat, and cook the chicken and onion 5 minutes, until chicken juices run clear and onions are tender.\nIn a bowl, whisk together the soup, milk, water, and cream cheese until smooth. Stir into the skillet with the chicken and onion, and bring to a boil. Reduce heat to low, and simmer 5 minutes, or until slightly thickened. Toss in the bowl with the spaghetti and broccoli to serve.\n",
        "picture_link": "W2VjXvJA2aHOV/dJ/UGKW0lAt5B5xZi"
    },
    {
        "title": "Blueberry Nut Oat Bran Muffins",
        "ingredients": [
            "1 1/2 cups oat bran ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/8 cups applesauce ADVERTISEMENT",
            "1/2 cup egg substitute ADVERTISEMENT",
            "2 tablespoons canola oil ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups blueberries ADVERTISEMENT",
            "1/4 cup chopped pecans ADVERTISEMENT",
            "1/2 cup low fat granola ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line a 12 cup muffin pan with paper muffin liners, and spray liners with cooking spray.\nIn a large bowl, mix the oat bran, flour, brown sugar, baking soda, baking powder, cinnamon, and salt. In a separate bowl, blend the applesauce, egg substitute, canola oil, and vanilla extract. Thoroughly mix the applesauce mixture into the flour mixture. Fold in the blueberries and pecans. Spoon the batter into the prepared muffin cups. Sprinkle batter with granola, and press granola lightly to make it stick.\nBake 18 minutes in the preheated oven, or until a toothpick inserted into a muffin comes out clean. Cool on a wire rack.\n",
        "picture_link": "/7UZeqcT12Fkiu3cLVWpA5KJKMR1KEW"
    },
    {
        "title": "Perfect Lobster Bisque",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "1/4 cup chopped fresh mushrooms ADVERTISEMENT",
            "2 tablespoons chopped onion ADVERTISEMENT",
            "2 tablespoons chopped celery ADVERTISEMENT",
            "2 tablespoons chopped carrot ADVERTISEMENT",
            "1 (14.5 ounce) can chicken broth ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon cayenne pepper ADVERTISEMENT",
            "1 1/2 cups half-and-half ADVERTISEMENT",
            "1/2 cup dry white wine ADVERTISEMENT",
            "1/2 pound cooked lump lobster meat ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a large saucepan over medium-low heat. Add the mushrooms, onion, celery, and carrot. Cook and stir until tender, about 10 minutes. Stir in the chicken broth, and season with salt and cayenne pepper. Bring to a boil, then simmer for 10 minutes.\nPour the vegetable and broth mixture into the container of a blender, and add 1/4 cup of the lobster meat. Cover, and process until smooth. Return to the saucepan, and stir in the half-and-half, white wine, and remaining lobster meat. Cook over low heat, stirring frequently until thickened, about 30 minutes.\n",
        "picture_link": "otNkcYxOjj/o5.JZUjw4t5ZvCfAPmSm"
    },
    {
        "title": "Green Chili Casserole",
        "ingredients": [
            "2 (7 ounce) cans whole green chile peppers, drained ADVERTISEMENT",
            "1 1/2 cups shredded Cheddar cheese, divided ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "4 eggs, lightly beaten ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease an 8x12 inch baking dish.\nLine the bottom of dish with green chiles. Sprinkle with 1/2 cup shredded cheese. Repeat layers twice more. In a medium bowl, whisk together milk and eggs. Season with salt and pepper. Pour egg mixture over chiles and cheese.\nBake in preheated oven for 25 to 30 minutes, or until filling is set. Let stand 5 to 10 minutes before serving.\n",
        "picture_link": "uFacrVXQY51pGtxEdaEmJf8uM9/uP5e"
    },
    {
        "title": "Sugar Free Brownies",
        "ingredients": [
            "1/2 cup margarine ADVERTISEMENT",
            "1/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup granular sucrolose sweetener (such as Splenda®) ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1/4 cup skim milk ADVERTISEMENT",
            "1/2 cup chopped walnuts (optional) ADVERTISEMENT",
            "1 (1.4 ounce) package sugar free, chocolate fudge flavored instant pudding ADVERTISEMENT",
            "1 cup skim milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour an 8x8 inch pan.\nIn a small saucepan over medium heat, melt margarine and cocoa together, stirring occasionally until smooth. Remove from heat and set aside to cool. In a large bowl, beat eggs until frothy. Stir in the sucrolose sweetener. Combine the flour and salt; stir into the egg mixture then mix in the cocoa and margarine. Finally stir in the 1/4 cup of milk and if desired, the walnuts. Pour into the prepared pan.\nBake for 25 to 30 minutes in the preheated oven, until a toothpick inserted into the center, comes out clean. To make frosting, Mix together the sugar free chocolate pudding mix and 1 cup skim milk using an electric mixer. Mix for about two minutes or until thick. Spread over cooled brownies before cutting into squares.\n",
        "picture_link": "tn5zIk0RKv8Ra.OFcfi3o39uYze69LO"
    },
    {
        "title": "Beer and Soy Sauce Chicken",
        "ingredients": [
            "1 cup soy sauce ADVERTISEMENT",
            "1 cup beer ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 clove garlic, peeled and minced ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix the soy sauce, beer, water, and garlic. Season with salt and pepper. Place chicken in the bowl. Cover, and marinate in the refrigerator 8 hours, or overnight. Turn chicken once while marinating.\nPreheat an outdoor grill for high heat, and lightly oil grate.\nPlace chicken on the prepared grill, and cook 10 to 15 minutes per side, until no longer pink and juices run clear. Discard remaining marinade.\n",
        "picture_link": "fV3YHg9t97WZZLVZegR9vjgrTEbB48G"
    },
    {
        "title": "Skewered Grilled Potatoes",
        "ingredients": [
            "2 pounds red potatoes, quartered ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/2 cup light mayonnaise ADVERTISEMENT",
            "1/4 cup dry white wine ADVERTISEMENT",
            "2 teaspoons crushed dried rosemary ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "wooden skewers, soaked in water for 30 minutes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes and water in a microwave safe bowl. Cook potatoes in microwave on high until just tender, about 15 minutes, stirring half-way through. Drain potatoes and allow to steam for a few minutes to dry.\nIn a large bowl, stir together mayonnaise, wine, rosemary, and garlic powder. Mix in drained potatoes and toss to coat. Marinate, covered, in the refrigerator for 1 hour.\nPreheat an outdoor grill for high heat and lightly oil grate.\nRemove potatoes from marinade, and skewer. Grill, covered, for 6 to 8 minutes, brushing occasionally with marinade, turning half-way through. Remove potatoes from skewers and serve hot.\n",
        "picture_link": "k6WG3vWoSewwpQOS7/8I4HAkexVEyKC"
    },
    {
        "title": "Traditional Reuben Casserole",
        "ingredients": [
            "1 1/2 cups thousand island dressing ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 tablespoon minced onion ADVERTISEMENT",
            "6 slices dark rye bread, cubed ADVERTISEMENT",
            "6 slices light rye bread, cubed ADVERTISEMENT",
            "1 pound sauerkraut, drained ADVERTISEMENT",
            "1 1/2 pounds corn beef, cut into bite-size pieces ADVERTISEMENT",
            "2 1/2 cups shredded Swiss cheese ADVERTISEMENT",
            "1/4 cup margarine, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking dish.\nIn a bowl, mix the thousand island dressing, sour cream, and onion.\nArrange the dark and light rye bread cubes in the bottom of the prepared baking dish, reserving about 1/2 cup each for topping. Layer the bread with sauerkraut and corned beef. Spread the dressing mixture over the corned beef. Sprinkle with Swiss cheese, top with remaining bread cubes, and drizzle with margarine.\nCover, and bake 15 minutes in the preheated oven. Uncover, and continue baking 10 minutes, or until bubbly and lightly browned.\n",
        "picture_link": "6O40xacc3ctqlLLpndMin/X9adjvMpm"
    },
    {
        "title": "Smothered Tilapia",
        "ingredients": [
            "1 pound tilapia fillets ADVERTISEMENT",
            "2 large tomatoes, sliced ADVERTISEMENT",
            "4 slices Swiss cheese ADVERTISEMENT",
            "2 large lemons ADVERTISEMENT",
            "steak seasoning ADVERTISEMENT",
            "dried oregano ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nPlace the fish fillets into a 9x13 inch glass baking dish. Slice the lemons in half, and squeeze the juice out over the fillets, turning them to coat thoroughly. Sprinkle steak seasoning to taste over both sides of the fillets.\nLay a slices of Swiss cheese over the fillets so they are covered. Place tomato slices over the cheese. Sprinkle dried oregano over the top.\nBake for 20 minutes in the preheated oven, or until fish flakes easily with a fork.\n",
        "picture_link": "/5ndrrADQ8x.YEljw5PvYb9Pv23sCqO"
    },
    {
        "title": "Grilled Roasted Red Pepper and Ham Sandwich",
        "ingredients": [
            "2 teaspoons mayonnaise, or condiment of your choice (optional) ADVERTISEMENT",
            "2 slices sourdough bread ADVERTISEMENT",
            "2 slices provolone cheese ADVERTISEMENT",
            "2 thin slices ham ADVERTISEMENT",
            "1/2 roasted red pepper packed in oil, drained and sliced ADVERTISEMENT",
            "2 teaspoons butter ADVERTISEMENT",
            "2 teaspoons grated Parmesan or Romano cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread mayonnaise onto one side of each slice of bread. On one slice of bread, place one slice of provolone cheese, then ham, red peppers, and the other slice of cheese. Top with the other slice of bread with the mayonnaise facing the filling. Butter the outsides of the sandwich, and sprinkle a little bit of Parmesan cheese onto the butter.\nHeat a skillet over medium heat until warm. Fry the sandwich on both sides until golden brown and cheese is melted. If you have an indoor grill, this sandwich may be grilled that way also. Cut the sandwich in half, and serve.\n",
        "picture_link": "3RFzfcz37Frr75z2R9ksa0uR2Zkym5O"
    },
    {
        "title": "Orzo with Chicken and Artichokes",
        "ingredients": [
            "3 teaspoons olive oil, divided ADVERTISEMENT",
            "3 ounces pancetta bacon, diced ADVERTISEMENT",
            "1/2 medium onion, chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/4 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1/2 cup dry white wine ADVERTISEMENT",
            "1 1/2 cups cubed, cooked chicken ADVERTISEMENT",
            "1 (10 ounce) can artichoke hearts (water-packed), quartered ADVERTISEMENT",
            "5 ounces baby spinach ADVERTISEMENT",
            "1 (16 ounce) package orzo pasta ADVERTISEMENT",
            "2 tablespoons pine nuts, toasted ADVERTISEMENT",
            "1/8 cup balsamic vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1 tablespoon olive oil in a large skillet over medium heat. Stir in pancetta, and cook until browned. Remove to paper towels.\nPour 2 tablespoons olive oil into skillet. Stir in onion, garlic, and red pepper flakes. Cook, stirring occasionally, until the onion is soft and translucent. Increase heat to medium high, pour in white wine; cook about 3 minutes.\nReduce heat to low, stir in chicken, artichoke hearts, and spinach. Cover, and cook to warm through.\nMeanwhile, bring a pot of salted water to boil. Add orzo pasta and cook until al dente, about 8 to 10 minutes. Drain, and stir into chicken mixture.\nStir pine nuts and balsamic vinegar into pasta.\n",
        "picture_link": "Ro1y0HZvSe.zkf/J38yj23FhD.OR3bm"
    },
    {
        "title": "Cheesy Breads",
        "ingredients": [
            "3 cups shredded Cheddar cheese ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1 (1 ounce) package dry Ranch-style dressing mix ADVERTISEMENT",
            "1 (2 ounce) can chopped black olives, drained ADVERTISEMENT",
            "4 green onions, sliced ADVERTISEMENT",
            "2 French baguettes, cut into 1/2 inch slices ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl, blend Cheddar cheese, mayonnaise, ranch-style dressing mix, black olives and green onions. Increase the amount of mayonnaise as desired if the mixture seems too dry.\nSpread equal amounts of the Cheddar cheese mixture on French baguette slices. Arrange slices in a single layer on a large baking sheet. Bake in the preheated oven 15 minutes, or until cheese is bubbly and lightly browned. Serve warm.\n",
        "picture_link": "XIaVT9uPHa348m62Fk6Xb1g0sa/aTNW"
    },
    {
        "title": "Pauline Werner's Beef Stew",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "2 pounds lean beef, cut into 1-1/2 inch cubes ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "2 potatoes, peeled and cut into large chunks ADVERTISEMENT",
            "4 carrots, cut into large chunks ADVERTISEMENT",
            "3 stalks celery, thickly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a large pot over medium heat. Place the meat in a bowl, sprinkle with flour, and toss to coat. Transfer meat to pot, season with salt and pepper, and brown meat on all sides.\nFill the pot with enough water to cover the meat, and mix in onion, bay leaf, and tomato sauce. Bring to a boil, reduce heat to low, cover, and simmer for an hour or until the meat is tender.\nStir in the potatoes, carrots, and celery. Continue cooking over low heat for 45 minutes, until vegetables are tender. Remove bay leaf before serving.\n",
        "picture_link": "uXaA6.hxTcV.bLRZBm9cXLRknLu.EO6"
    },
    {
        "title": "Banana Upside-Down Cake",
        "ingredients": [
            "4 tablespoons butter, melted ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "4 bananas, sliced ADVERTISEMENT",
            "1 (18.25 ounce) package banana cake mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour 2 (8 inch) pans. Combine butter and brown sugar, divide and spread evenly between the 2 pans. Sprinkle pecans evenly over both brown sugar mixtures, arrange banana slices evenly over each.\nPrepare cake mix according to package instructions. Divide batter into the 2 pans.\nBake in the preheated oven for 40 to 45 minutes, or until a toothpick inserted into the center of the cake comes out clean. Turn cakes upside down on a platter or plate, gently tap bottom and carefully remove pans, replacing caramel mixture that sticks to pan.\n",
        "picture_link": "udlRkaUU0SL/agEVJybMhrI7vbN69PW"
    },
    {
        "title": "Italian Zucchini Saute",
        "ingredients": [
            "1/2 cup olive oil ADVERTISEMENT",
            "1 small white onion, sliced into thin wedges ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes with juice ADVERTISEMENT",
            "2 zucchinis, sliced ADVERTISEMENT",
            "1/2 tablespoon Italian seasoning ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 teaspoon sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a skillet over medium heat. Stir in onion and cook until tender. Mix in tomatoes with juice and zucchini. Season with Italian seasoning and salt. Cook and stir until zucchini is tender. Mix in sugar and adjust seasonings to taste.\n",
        "picture_link": "wdKgT5WhBfqxke1xu6uukqIpRs6d/xm"
    },
    {
        "title": "Daddy's 'If They'da had This at the Alamo we would'ha WON!' Texas Chili",
        "ingredients": [
            "3 tablespoons bacon drippings ADVERTISEMENT",
            "2 large onions, chopped ADVERTISEMENT",
            "8 pounds beef stew meat, or coarse ground chili beef ADVERTISEMENT",
            "5 cloves garlic, finely chopped ADVERTISEMENT",
            "4 tablespoons ground red chile pepper ADVERTISEMENT",
            "4 tablespoons mild chili powder ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "1/4 cup sweet Hungarian paprika ADVERTISEMENT",
            "1 teaspoon dried Mexican oregano ADVERTISEMENT",
            "3 (10 ounce) cans tomato sauce ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "2 tablespoons salt ADVERTISEMENT",
            "1/4 cup dried parsley (optional) ADVERTISEMENT",
            "1 fresh jalapeno peppers ADVERTISEMENT",
            "1 cup masa harina flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the bacon drippings in a large heavy pot over medium heat. Add the onions and cook until they are translucent.\nCombine the beef with the garlic, ground chile, chili powder and cumin. Add this meat-and-spices to the onions in the pot. Break up any meat that sticks together as you cook, stirring occasionally, about 30 minutes, until meat is evenly browned (very browned, not just gray). Sprinkle in Hungarian paprika and oregano.\nPour in the tomato sauce, tomato paste, water, salt, parsley and jalapeno. Bring to a boil, then lower the heat and simmer, uncovered, for 1 hour. NOTE: True Texans DO NOT add beans to their chili, but my husband loves them, so this is the point where you can add as many cans of drained and rinsed pinto beans as you wish (I add 2 cans, but shhhhhh don't tell my Daddy!!!).\nDuring cooking you may squeeze the jalapeno as it softens against the sides of the pot to release more heat if desired.\nMix in the masa harina, and cook while stirring for 30 minutes longer, or until desired consistency is achieved. Taste and adjust seasonings.\n",
        "picture_link": "fllCWVFiAICH1e/cNy1Swnl7NX20S6m"
    },
    {
        "title": "Gelatin-Flavored Popcorn",
        "ingredients": [
            "10 cups popped popcorn ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "3/4 cup sugar ADVERTISEMENT",
            "1 (3 ounce) package fruit flavored Jell-O® mix ADVERTISEMENT",
            "1 tablespoon corn syrup ADVERTISEMENT",
            "3 tablespoons water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C). Grease a 1/4 sheet pan or two 8x12 inch baking dishes. Generously butter a heavy 2 quart saucepan.\nDistribute popcorn evenly in prepared baking pans. Place in oven to keep warm.\nIn prepared saucepan over medium heat, combine butter, sugar, gelatin, corn syrup and water. Heat to 250 to 265 degrees F (121 to 129 degrees C), or until a small amount of syrup dropped into cold water forms a rigid ball.\nPour mixture evenly over popcorn and stir until coated. Return popcorn to oven and bake 5 minutes; stir, then bake 5 minutes more.\nTurn popcorn out onto a large piece of foil. Let rest until cool enough to handle, then form into balls. Or let cool completely and break into clusters. Store in an airtight container, in a cool, dry place.\n",
        "picture_link": "I8GFrIMuU5ovgaiE5VOyW6mlT.LBJUW"
    },
    {
        "title": "Sharon's Jamaican Fruit Cake",
        "ingredients": [
            "2 cups butter ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "9 eggs ADVERTISEMENT",
            "1/4 cup white rum (optional) ADVERTISEMENT",
            "1 tablespoon lime juice ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 tablespoon almond extract ADVERTISEMENT",
            "1 grated zest of one lime ADVERTISEMENT",
            "2 pounds chopped dried mixed fruit ADVERTISEMENT",
            "2 cups red wine ADVERTISEMENT",
            "1 cup dark molasses ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "3 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon ground allspice ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour 2 - 9 inch round cake pans.\nIn a large bowl, cream together the butter and sugar until light and fluffy. Beat in eggs, then add rum, lime juice, vanilla, almond extract, and lime zest. Stir in mixed fruit, wine, and molasses. Sift together flour, baking powder, nutmeg, allspice, cinnamon, and salt. Fold into batter, being careful not to over-mix. Pour into prepared pans.\nBake in preheated oven for 80 to 90 minutes, or until a knife inserted into the center comes out clean. Let cool in pan for 10 minutes, then turn out onto a wire rack and cool completely.\n",
        "picture_link": "4tilgf1xHg5jnA.qmH5Qrec0Y5tlwde"
    },
    {
        "title": "Authentic Thai Coconut Soup",
        "ingredients": [
            "1 pound medium shrimp - peeled and deveined ADVERTISEMENT",
            "2 (13.5 ounce) cans canned coconut milk ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 (1 inch) piece galangal, thinly sliced ADVERTISEMENT",
            "4 stalks lemon grass, bruised and chopped ADVERTISEMENT",
            "10 kaffir lime leaves, torn in half ADVERTISEMENT",
            "1 pound shiitake mushrooms, sliced ADVERTISEMENT",
            "1/4 cup lime juice ADVERTISEMENT",
            "3 tablespoons fish sauce ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1 teaspoon curry powder ADVERTISEMENT",
            "1 tablespoon green onion, thinly sliced ADVERTISEMENT",
            "1 teaspoon dried red pepper flakes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a pot of water to a boil. Boil the shrimp until cooked, about one minute. Drain shrimp, and set aside.\nPour the coconut milk and 2 cups of water in a large saucepan; bring to a simmer. Add the galangal, lemon grass, and lime leaves; simmer for 10 minutes, or until the flavors are infused. Strain the coconut milk into a new pan and discard the spices. Simmer the shiitake mushrooms in the coconut milk for five minutes. Stir in the lime juice, fish sauce, and brown sugar. Season to taste with curry powder.\nTo serve, reheat shrimp in the soup, and ladle into serving bowls. Garnish with green onion and red pepper flakes.\n",
        "picture_link": "DM2ty9rmXqClsu5oQ6ei1ePes8OBJRG"
    },
    {
        "title": "Flavorful Beef Stir-Fry",
        "ingredients": [
            "2 cups brown rice ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "6 tablespoons soy sauce ADVERTISEMENT",
            "1/4 cup white wine ADVERTISEMENT",
            "1 tablespoon minced fresh ginger ADVERTISEMENT",
            "1 pound boneless beef round steak, cut into thin strips ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "3 cups broccoli florets ADVERTISEMENT",
            "2 carrots, thinly sliced ADVERTISEMENT",
            "1 (6 ounce) package frozen pea pods, thawed ADVERTISEMENT",
            "2 tablespoons chopped onion ADVERTISEMENT",
            "1 (8 ounce) can sliced water chestnuts, undrained ADVERTISEMENT",
            "1 cup Chinese cabbage ADVERTISEMENT",
            "2 large heads bok choy, chopped ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring brown rice and water to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until rice is tender, and liquid has been absorbed, 45 to 50 minutes.\nCombine cornstarch, sugar, soy sauce, and wine in a small bowl until smooth. Stir in ginger; toss beef in sauce to coat.\nHeat 1 tablespoon oil in a large skillet over medium-high heat. Cook and stir broccoli, carrots, pea pods, and onion for 1 minute. Stir in water chestnuts, Chinese cabbage, and bok choy; cover and simmer until vegetables are tender, about 4 minutes. Remove from skillet and keep warm.\nIn same skillet, heat 1 tablespoon oil over medium-high heat. Cook and stir beef until desired degree of doneness, about 2 minutes per side for medium. Return vegetables to skillet; cook and stir until heated through, about 3 minutes. Serve over rice.\n",
        "picture_link": "u35OPvkfadficZgJOx5oM95Zam/QoRG"
    },
    {
        "title": "Butternut Squash, Apple, Onion Au Gratin",
        "ingredients": [
            "Cooking spray ADVERTISEMENT",
            "1/4 cup flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 pinch cinnamon ADVERTISEMENT",
            "1 butternut squash - peeled, seeded and sliced ADVERTISEMENT",
            "4 apples - peeled, cored and sliced ADVERTISEMENT",
            "1/2 sweet onion, thinly sliced ADVERTISEMENT",
            "1 cup chicken stock ADVERTISEMENT",
            "1 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "3 slices bacon, cooked and crumbled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350. Spray 9- x 11-inch glass baking pan with cooking spray.\nPlace flour, salt, and cinnamon into a large plastic bag. Add squash, apples, and onions; shake until lightly dusted.\nIn glass dish, layer 1/2 of squash, apples, and sweet onion. Pour 1/2 cup chicken stock over the top, then sprinkle 1/2 of cheese. Layer with remaining squash, apple, and onions. Pour remaining chicken stock over the top, and cover with foil.\nBake in preheated oven for 40 minutes.\nTake out and sprinkle with bacon crumbles and remaining cheese. Return, uncovered, to oven; bake for another 5 minutes. Let sit for 5 minutes before serving.\n",
        "picture_link": "lx334sq5jmE0LYhB8AVGuMFbVArERei"
    },
    {
        "title": "Scott's Savory BBQ Sauce",
        "ingredients": [
            "1 quart apple cider vinegar ADVERTISEMENT",
            "1 (20 ounce) bottle ketchup ADVERTISEMENT",
            "1/4 cup paprika ADVERTISEMENT",
            "1 pound dark brown sugar ADVERTISEMENT",
            "1/4 cup salt ADVERTISEMENT",
            "1 tablespoon black pepper ADVERTISEMENT",
            "2 tablespoons red pepper flakes ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1/4 cup Worcestershire sauce ADVERTISEMENT",
            "1/2 cup lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large container, mix together the apple cider vinegar, ketchup, paprika, brown sugar, salt, pepper, red pepper flakes, garlic powder, Worcestershire sauce and lemon juice. Pour into an empty vinegar bottle, ketchup bottle or other container and store in the refrigerator for up to 1 month.\n",
        "picture_link": "Fj6UGAAKteVSqAJTBAnrsLwSNjXBWDa"
    },
    {
        "title": "Roasted Red Potato Salad",
        "ingredients": [
            "10 red potatoes, cut into bite-size pieces ADVERTISEMENT",
            "olive oil, or as needed ADVERTISEMENT",
            "3 hard-cooked eggs, chopped ADVERTISEMENT",
            "1/2 stalk celery, chopped ADVERTISEMENT",
            "1/4 cup chopped green onion ADVERTISEMENT",
            "3 slices cooked bacon, chopped ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nSpread potato pieces onto a baking sheet and drizzle with olive oil.\nRoast in the preheated oven until tender, about 45 minutes; remove from oven and let cool at least 15 minutes.\nPlace roasted potatoes into a large salad bowl and combine with hard-cooked eggs, celery, green onion, and bacon; stir in mayonnaise and season to taste with salt and black pepper. Cover and refrigerate for 1 hour to let flavors blend.\n",
        "picture_link": "2WSFiMaSIHVqs41VzSlL3kjIAX7cfKK"
    },
    {
        "title": "Marshmallow Buttercream Frosting",
        "ingredients": [
            "2 cups butter, softened ADVERTISEMENT",
            "2 1/2 cups confectioners' sugar ADVERTISEMENT",
            "1 teaspoon almond extract ADVERTISEMENT",
            "1 (13 ounce) jar marshmallow creme ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream butter in a mixing bowl with an electric mixer on medium until butter is soft and fluffy. Gradually beat in confectioners' sugar, about 1/2 cup at a time; beat in almond extract. Gently fold the marshmallow creme into the frosting until thoroughly incorporated.\n",
        "picture_link": "1kuZegQAJdSOoDo1.Pjq1FAKQfG.YGK"
    },
    {
        "title": "Crunchy French Toast Sticks",
        "ingredients": [
            "3 eggs ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "2 cups corn flakes, crushed ADVERTISEMENT",
            "4 slices bread, cut into thirds ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk the eggs and milk together in a bowl. Spread the crushed corn flakes onto a plate.\nDip each piece of bread into the egg mixture and then press gently into the cereal, turning to coat completely. Place the breadsticks onto a plate while breading the rest; do not stack.\nMelt the butter in a skillet over medium heat; cook the coated breadsticks in the melted butter until golden, about 4 minutes each side.\n",
        "picture_link": "MuSlQgU3IvPR24OvNiVazy/QrjhB8JC"
    },
    {
        "title": "Festive Cracker Spread",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 (8 ounce) package finely shredded sharp Cheddar cheese ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "3/4 cup chopped pimento-stuffed olives ADVERTISEMENT",
            "1/2 cup chopped celery ADVERTISEMENT",
            "1/3 cup chopped onion ADVERTISEMENT",
            "1/4 cup chopped green bell pepper ADVERTISEMENT",
            "2 teaspoons dried parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat the cream cheese, Cheddar cheese, and mayonnaise with an electric mixer in a bowl until smooth. Fold in the olives, celery, onion, bell pepper, and parsley; mixing just enough to evenly combine. Cover and chill for at least 1 hour.\n",
        "picture_link": ".Wht8.PEbpM6pAXHeIzZRE9XFQEL9W6"
    },
    {
        "title": "Margarita Cake with Key Lime Cream Cheese Frosting",
        "ingredients": [
            "1 (18.25 ounce) package white cake mix ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "1 (10 fluid ounce) can frozen margarita mix (such as Bacardi®), thawed ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 tablespoon grated lime peel ADVERTISEMENT",
            "1 tablespoon lime juice ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/2 cup unsalted butter, softened ADVERTISEMENT",
            "1 tablespoon grated lemon peel ADVERTISEMENT",
            "1 tablespoon lime juice ADVERTISEMENT",
            "5 cups confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13-inch cake pan.\nIn a large mixing bowl, beat together the cake mix, egg whites, frozen margarita mix, vegetable oil, lime zest, and 1 tablespoon lime juice. Pour the batter into the prepared pan.\nBake in the preheated oven until a toothpick inserted into the center shows moist crumbs, 30 to 35 minutes. Cake will be very moist. Cool in the pan.\nTo make frosting, beat the cream cheese and butter together until light and fluffy, and stir in the lemon peel and 1 tablespoon of lime juice. Beat in the confectioners' sugar, 1 cup at a time, scraping the sides of the bowl thoroughly with a spatula after each addition. Spread the frosting over the cooled cake.\n",
        "picture_link": "FpBptI6iSIX/zWP0lKpVc7WkWT.FHii"
    },
    {
        "title": "Danish Oatmeal Cookies",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 cup oatmeal ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "1 tablespoon confectioners' sugar, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 325 degrees F (165 degrees C). Line a baking sheet with parchment paper.\nIn a bowl, mix the flour, baking soda, and salt. In a separate large bowl, mix the butter, 1 cup confectioners' sugar, and vanilla until the mixture is smooth and creamy. Stir in the flour mixture; gently stir in the oatmeal and pecans and lightly mix until combined.\nWith a spoon, drop about 1 scant tablespoon of dough per cookie onto the prepared baking sheet. Bake in the preheated oven until lightly browned, about 20 minutes. Let cool completely before sprinkling cookies with confectioners' sugar.\n",
        "picture_link": "3phI2Dta0w/0caxBjDtWq8eZCyumqVi"
    },
    {
        "title": "Steve's Bourbon Buffalo Wing Sauce",
        "ingredients": [
            "1/4 cup bourbon whiskey ADVERTISEMENT",
            "1/4 cup packed brown sugar ADVERTISEMENT",
            "1/3 cup ketchup ADVERTISEMENT",
            "1 tablespoon white vinegar ADVERTISEMENT",
            "1 tablespoon hot sauce (such as Frank's RedHot ®) ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir the bourbon, brown sugar, ketchup, white vinegar, hot sauce, cayenne pepper, garlic powder, honey, and butter together in a saucepan over medium heat; cook, whisking occasionally, until the mixture begins to bubble. Reduce heat to low and cook at a gentle simmer, whisking occasionally, until the sauce thickens nearly to the consistency of maple syrup or molasses, about 15 minutes. Remove from heat and allow to cool.\n",
        "picture_link": "aAp69eeonzVsX1xsF712uyjAA36nVga"
    },
    {
        "title": "Eggplant Pizzas",
        "ingredients": [
            "2 eggs ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1 large eggplant, sliced into 1/2 inch rounds ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 (14 ounce) can pizza sauce ADVERTISEMENT",
            "1 1/2 cups shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C).\nBeat the eggs in a bowl. Mix the flour, salt, pepper, and oregano in a 1 gallon resealable plastic bag. Dip each eggplant slice in the egg, then drop the eggplant in the flour mixture one at a time, shaking the bag to coat the eggplant.\nHeat the vegetable oil in a large, deep skillet over medium heat. Place the eggplant slices in the skillet to cook, turning occasionally, until evenly browned. Drain the eggplant slices on a paper towel-lined plate. Arrange the eggplant in one layer on a baking sheet. Spoon enough pizza sauce to cover each eggplant slice. Top each eggplant with mozzarella cheese.\nBake in the preheated oven until the mozzarella cheese is melted, 5 to 10 minutes.\n",
        "picture_link": "XqfyVfwUTRB0p9SWhlpIIjw0XjFGi42"
    },
    {
        "title": "Spiedies",
        "ingredients": [
            "5 pounds chicken, cubed ADVERTISEMENT",
            "2 cups olive oil ADVERTISEMENT",
            "1 cup white vinegar ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "5 cloves garlic, minced ADVERTISEMENT",
            "2 teaspoons dried oregano ADVERTISEMENT",
            "1 tablespoon garlic salt ADVERTISEMENT",
            "3 tablespoons crushed dried mint ADVERTISEMENT",
            "2 tablespoons dried basil ADVERTISEMENT",
            "1 teaspoon fresh-ground black pepper ADVERTISEMENT",
            "12 wooden skewers, soaked in water for 30 minutes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the cubed chicken into a large resealable plastic bag or container, add the olive oil, vinegar, lemon juice, salt, garlic, garlic salt, oregano, garlic salt, mint, basil, and black pepper. Seal the container and shake until combined. Refrigerate for 1 to 3 days, shaking the container to turn the meat every 6 to 8 hours.\nPreheat an outdoor grill for medium-high heat and lightly oil grate. When you are ready to cook, remove meat from the marinade and place on skewers.\nPlace the skewers on the preheated grill and cook, turning every three minutes until cooked through and the internal temperature of the meat reaches 170 degrees F (75 degrees C). Be careful not to overcook or the meat will be very dry. Serve the grilled meat on Italian bread or hot dog rolls.\n",
        "picture_link": "ggsKcfuH7LAIFlluuEg3XBtr5QBQZSW"
    },
    {
        "title": "Chicken Cordon Bleu Bites",
        "ingredients": [
            "9 ounces ground chicken ADVERTISEMENT",
            "1/4 cup cooked, diced ham ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup bread crumbs ADVERTISEMENT",
            "8 ounces Swiss cheese, cut into 1/2 inch cubes ADVERTISEMENT",
            "canola oil for pan-frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine the chicken, ham, and egg in a large bowl until well blended. Gradually add bread crumbs until the mixture loses its stickiness and can be easily formed into balls.\nForm the chicken mixture around the cheese cubes, forming 2 inch balls. Place on a plate.\nHeat 1 1/2 inches of oil in a deep skillet to 350 degrees F (175 degrees C). Fry the balls until the outsides are golden brown, about 4 minutes. Drain on paper towels, and place in baking dish.\nBake in preheated oven until cooked through and cheese is soft, about 20 minutes. Cool briefly before serving.\n",
        "picture_link": "Kw2XgKZZE/HoPXgY/BnFpul13xdii82"
    }
]