[
    {
        "title": "Warm Orange and Mushroom Salad",
        "ingredients": [
            "8 ounces bacon, cut into 1 inch pieces ADVERTISEMENT",
            "3/4 cup orange juice ADVERTISEMENT",
            "1/4 cup shallots, minced ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1/4 cup balsamic vinegar ADVERTISEMENT",
            "4 large oranges, peeled and segmented ADVERTISEMENT",
            "10 ounces spinach, rinsed and chopped ADVERTISEMENT",
            "1 medium head radicchio ADVERTISEMENT",
            "6 ounces fresh shiitake mushrooms, stemmed and sliced ADVERTISEMENT",
            "6 ounces fresh oyster mushrooms, stemmed and sliced ADVERTISEMENT",
            "1/2 cup chopped toasted hazelnuts ADVERTISEMENT",
            "1 (3 ounce) package enoki mushrooms ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Remove, crumble and set aside. Reserve bacon fat.\nWhisk together 1/4 cup bacon fat, orange juice, shallots, olive oil and vinegar.\nIn a large bowl, combine the spinach and radicchio.\nHeat 2 tablespoons reserved bacon drippings in skillet over medium-high heat. Add shitake mushrooms and cook for 1 minute. Add oyster mushrooms and cook for 2 minutes. Season with salt and pepper; add to greens and toss.\nPour dressing into same skillet and boil 2 minutes. Pour dressing over greens. Add bacon, orange segments and chopped hazelnuts. Toss to combine. Season to taste with salt and pepper. Garnish salad with enoki mushrooms and serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Danny's Salad",
        "ingredients": [
            "1 (15 ounce) can pears, chopped ADVERTISEMENT",
            "2 bananas, sliced ADVERTISEMENT",
            "2 apples - peeled, cored and chopped ADVERTISEMENT",
            "1/2 cup creamy salad dressing ADVERTISEMENT",
            "1/2 cup frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the creamy salad dressing and whipped topping until smooth. Pour dressing over the pears, bananas, apples and toss. This salad may also be garnished with your favorite chopped nuts.\n",
        "picture_link": "Mf0azmxSY83wr5.z8YVFUrblnWcnjGe"
    },
    {
        "title": "Joanna's Salsa",
        "ingredients": [
            "2 (14.5 ounce) cans stewed tomatoes ADVERTISEMENT",
            "1 (10 ounce) can diced tomatoes with green chile peppers ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cups diced celery ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine crushed and diced tomatoes with chilies, onion, celery, bell pepper, and sugar in a small mixing or serving bowl. Let chill at least 2 hours before serving.\n",
        "picture_link": "x7CxGl5R1VWUQaki7NS2GonYLqQcWQ."
    },
    {
        "title": "Marilyn's Special Salad",
        "ingredients": [
            "2 lemons, juiced ADVERTISEMENT",
            "5 cloves crushed garlic ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 heads romaine lettuce, rinsed and dried ADVERTISEMENT",
            "1/4 pound bacon - cooked and crumbled ADVERTISEMENT",
            "2 cups cherry tomatoes ADVERTISEMENT",
            "1 cup shredded Swiss cheese ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "2/3 cup blanched slivered almonds ADVERTISEMENT",
            "1 cup garlic-flavored croutons ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the lemon juice, garlic and salt and pepper.\nIn a large bowl, combine the Romaine, bacon, tomatoes, Swiss cheese, Parmesan cheese, almonds and croutons. Add enough dressing to coat; toss and serve.\n",
        "picture_link": "Fbc5yJTVJZbaEiKN7PvDhq4AADeCKD6"
    },
    {
        "title": "Ground Turkey Tacos",
        "ingredients": [
            "Tacos: ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 pound lean (at least 93%) ground turkey ADVERTISEMENT",
            "1 (1 ounce) package Old El Paso® taco seasoning mix ADVERTISEMENT",
            "2/3 cup water ADVERTISEMENT",
            "1 (4.6 ounce) package Old El Paso® taco shells ADVERTISEMENT",
            "Toppings: ADVERTISEMENT",
            "2 medium avocados, pitted, peeled and sliced ADVERTISEMENT",
            "1 cup sliced pineapple (fresh or canned) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In 10-inch skillet, heat oil over medium-high heat. Cook turkey in oil until no longer pink; drain.\nStir in taco seasoning mix and water. Reduce heat; simmer uncovered 5 to 10 minutes or until thickened.\nSpoon filling into taco shells. Add toppings.\n",
        "picture_link": "e6fEAdVeoFVwoOAF61H.FFtWqoPlR.a"
    },
    {
        "title": "Creamed German Chicken",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "2 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "1 teaspoon fennel seed ADVERTISEMENT",
            "1 teaspoon celery seed ADVERTISEMENT",
            "1 tablespoon freshly ground black pepper, or to taste ADVERTISEMENT",
            "1 pint heavy whipping cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a skillet over medium heat and brown chicken breasts in the hot butter until lightly golden on both sides, about 5 minutes per side. Chicken will still be slightly pink inside. Set chicken breasts aside.\nCook and stir onion in the same skillet until translucent, about 5 minutes; stir in fennel and celery seed along with black pepper until thoroughly combined. Pour in cream, bring to a boil, and reduce heat to low. Simmer, stirring often, until sauce is slightly thickened, about 5 minutes. Place chicken breasts into the cream sauce and spoon sauce over chicken; cook until chicken breasts are no longer pink inside and the juices run clear, about 10 more minutes.\n",
        "picture_link": "nyH6PyPlWeKBXy8yWv.yyerSYXNgQqS"
    },
    {
        "title": "Grilled Turkey Breast with Fresh Sage Leaves",
        "ingredients": [
            "3 tablespoons freshly squeezed lemon juice ADVERTISEMENT",
            "3 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "28 leaves fresh sage ADVERTISEMENT",
            "4 skinless, boneless turkey breast halves ADVERTISEMENT",
            "sea salt and freshly ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "3 tablespoons unsalted butter ADVERTISEMENT",
            "2 lemons, halved ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix lemon juice, 3 tablespoons olive oil, and sage leaves in a large container and place turkey breast halves into the marinade. Allow meat to marinate for 30 minutes at room temperature, turning turkey breasts over occasionally.\nPreheat grill for medium heat and lightly oil the grate.\nRemove turkey breasts from marinade and reserve the marinade and sage leaves. Sprinkle turkey on both sides with sea salt and black pepper.\nGrill turkey breasts on the preheated grill until they show grill marks, the meat is no longer pink inside, and an instant-read meat thermometer inserted into the thickest part of the breast reads at least 160 degrees F (70 degrees C), about 30 minutes. Turn turkey pieces over after 15 minutes.\nWhile turkey is grilling, heat 2 tablespoons olive oil with unsalted butter in a large skillet over medium-high heat until hot and bubbling. Pour reserved marinade, including sage leaves, into the oil and butter and cook, stirring often, until the marinade has evaporated and the sage leaves are crisply fried, 10 to 15 minutes.\nTransfer grilled turkey breasts to a cutting board and season again with salt and black pepper if desired; thickly slice the turkey on the diagonal and arrange on a platter, topped by fried sage leaves and garnished with lemon halves.\n",
        "picture_link": "nx2fEeg.L2xiE5NmfG97oPqjlkPnMtu"
    },
    {
        "title": "Zesty Lemon Apple Juice",
        "ingredients": [
            "1/2 cup cool water ADVERTISEMENT",
            "1 cucumber, halved ADVERTISEMENT",
            "2 green apples, quartered ADVERTISEMENT",
            "1 lemon, halved ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour water into a glass and place beneath the spigot of a juicer.\nProcess first the cucumber, waiting about 20 seconds between halves. Do the same with each apple quarter. Finally juice the lemon halves.\nStir juice vigorously to blend.\n",
        "picture_link": "QXY1rdKjpAkEBky9q6/4wxhadcaXJxu"
    },
    {
        "title": "Mayonnaise Chicken",
        "ingredients": [
            "1/4 tablespoon butter ADVERTISEMENT",
            "2 cups mayonnaise ADVERTISEMENT",
            "1 (.7 ounce) package dry Italian-style salad dressing mix ADVERTISEMENT",
            "6 skinless, boneless chicken breast halves - cut into bite-size pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Set slow cooker to High and melt butter in the bottom of the crock. Mix mayonnaise with Italian salad dressing mix in a bowl and stir chicken pieces into the mixture to coat. Pour the chicken mixture into the slow cooker over the butter. Cover and cook until chicken is tender, 4 to 5 hours, stirring occasionally.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Zucchini Nut Cake",
        "ingredients": [
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon ground allspice ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup vegetable shortening ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup brown sugar, not packed ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 tablespoon water, or more if needed ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups shredded zucchini ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 10-inch fluted tube pan (such as a Bundt(R)).\nSift flour, salt, baking soda, cinnamon, nutmeg, and allspice together in a bowl. Cream butter and vegetable shortening together in a separate large bowl until thoroughly combined; beat in white sugar and 1 cup brown sugar until the mixture is smooth and creamy. Beat eggs, water, and vanilla extract into the shortening mixture, followed by the flour mixture. Gently stir in zucchini and 1/2 cup walnuts. If batter seems dry, mix in 1 more tablespoon water.\nMelt 1/4 cup butter in a saucepan over medium-low heat and stir in 1/2 cup brown sugar until it has dissolved and small bubbles appear in the mixture. Stir 1/2 cup walnuts into the brown sugar mixture.\nSpoon brown sugar-walnut mixture into the bottom of the prepared cake pan and pour cake batter over the mixture.\nBake in the preheated oven until lightly golden brown and a toothpick inserted into the center of the cake comes out clean, about 1 hour. Let cool in the pan for 10 minutes, then invert over a serving plate to reveal the brown sugar topping.\n",
        "picture_link": "nrFnqIlMbEPD.5c/cBc0wDOssl8Qpd2"
    },
    {
        "title": "Creamy Peanut Butter Refrigerator Pie",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 cup creamy peanut butter (such as Reese's®) ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping (Cool Whip®), thawed ADVERTISEMENT",
            "3/4 cup miniature semisweet chocolate chips ADVERTISEMENT",
            "1 (9 inch) prepared graham cracker crust ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix cream cheese and peanut butter together thoroughly in a bowl. Stir confectioners' sugar into cream cheese mixture. Fold whipped topping into mixture with a spoon; mix thoroughly, scraping bottom and sides of bowl to incorporate completely. Add chocolate chips, gently stir into the mixture.\nSpoon the filling into the pie crust, heaping more in the center of the pie.\nRefrigerate until firm, 1 to 2 hours.\n",
        "picture_link": "46KFxt0G3bWF/gm.oI4Zkjdr.XO1DDu"
    },
    {
        "title": "Spicy Peach Pork Tenderloin",
        "ingredients": [
            "1/3 cup honey ADVERTISEMENT",
            "1/3 cup olive oil ADVERTISEMENT",
            "1 lime, juiced, or more to taste ADVERTISEMENT",
            "1 canned chipotle pepper in adobo sauce, finely chopped (optional) ADVERTISEMENT",
            "3 tablespoons adobo sauce from chipotle peppers ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 pork tenderloin ADVERTISEMENT",
            "1 fresh peach, pitted and thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nMix honey, olive oil, lime juice, chipotle pepper, 3 tablespoons adobo sauce, and garlic together in a bowl.\nPlace tenderloin in a baking dish; top with peach slices. Pour honey sauce over tenderloin. Cover with a lid or aluminum foil.\nBake in the preheated oven until meat is no longer pink in the center, 30 to 45 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C). Let rest for 10 minutes; cut into very thin slices. Serve topped with the cooked peaches and pan juices.\n",
        "picture_link": "5503dCXHfD0WFtKaAHDi8suYIxNBRGy"
    },
    {
        "title": "Cheese Mexican Corn Spoon Bread",
        "ingredients": [
            "1/2 pound ground beef ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 (6.5 ounce) package corn bread mix ADVERTISEMENT",
            "1/2 (8.75 ounce) can sweet corn, drained ADVERTISEMENT",
            "1/2 (8.25 ounce) can cream-style corn ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "1/2 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "1/2 (4 ounce) can chopped green chiles, or more to taste ADVERTISEMENT",
            "2 tablespoons shredded sharp Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease an 8x8-inch baking dish.\nHeat a skillet over medium-high heat and stir in ground beef. Cook and stir until the beef is crumbly, evenly browned, and no longer pink. Drain and discard any excess grease.\nStir egg, corn bread mix, sweet corn, cream-style corn, sour cream, and butter in a bowl until well mixed. Fold in ground beef, 1/2 cup Cheddar cheese, and chiles; pour into prepared baking dish.\nBake in the preheated oven for 35 to 40 minutes; sprinkle remaining 2 tablespoons Cheddar cheese on top. Continue baking until a knife inserted into the center comes out clean, 5 to 10 minutes. Serve warm.\n",
        "picture_link": "nxZqR/5m8Yfc6A.mWae.JdTLtYA1edO"
    },
    {
        "title": "Easy Mexican Pizza",
        "ingredients": [
            "Pizza: ADVERTISEMENT",
            "1 (13.8 ounce) can Pillsbury® refrigerated classic pizza dough ADVERTISEMENT",
            "1 cup canned Old El Paso® refried beans ADVERTISEMENT",
            "1/2 cup Old El Paso® red enchilada sauce ADVERTISEMENT",
            "1 1/2 cups shredded Mexican blend cheese ADVERTISEMENT",
            "Garnishes, as desired: ADVERTISEMENT",
            "3 medium green onions, chopped ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 cup Old El Paso® Thick 'n Chunky Salsa ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 425 degrees F. Grease or spray 15x10x1-inch pan.\nUnroll pizza dough in pan. Using an offset spatula, spread beans over crust, leaving 1-inch border around edges. Spread with enchilada sauce; sprinkle with cheese.\nBake about 15 minutes or until cheese is bubbly and melted. Sprinkle with green onions. Serve with sour cream and salsa.\n",
        "picture_link": "PY0i.ByQnPMjx5C9rY39I7ZnD78wN1G"
    },
    {
        "title": "Tomato and Macaroni Salad",
        "ingredients": [
            "1 (16 ounce) package elbow macaroni ADVERTISEMENT",
            "6 hard-cooked eggs, chopped ADVERTISEMENT",
            "1 (15 ounce) jar light mayonnaise (such as Hellmann's Light®) ADVERTISEMENT",
            "1/2 (15 ounce) jar creamy salad dressing (such as Miracle Whip®) ADVERTISEMENT",
            "3 1/2 tablespoons spicy brown mustard ADVERTISEMENT",
            "1 tablespoon dry ground mustard ADVERTISEMENT",
            "1 tablespoon chopped fresh marjoram ADVERTISEMENT",
            "6 large ripe tomatoes, chopped ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until cooked through but firm to the bite, 8 minutes. Drain and rinse with cold water until pasta is chilled.\nMix elbow macaroni, hard-cooked eggs, light mayonnaise, creamy salad dressing, spicy brown mustard, dry mustard, and marjoram in a large salad bowl until thoroughly combined. Stir in tomatoes. Be sure to include the juice from your cutting board. Season with salt and black pepper.\n",
        "picture_link": "TRaqoV/BppF8BC93XCwDuTsWfqTdlri"
    },
    {
        "title": "Grandma's Very Easy Pie Crust",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "3 fluid ounces cold milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sift flour and salt into a bowl. Pour vegetable oil into a 1-cup measure and fill the measure with milk up to the 7-ounce mark. Whisk oil and milk together and pour immediately into the bowl with flour. Mix the crust together with a fork just until it holds together. Do not knead.\nDivide crust in half, form into balls, and roll each half out between sheets of waxed paper. Peel waxed paper from crusts to fit into pie plate.\n",
        "picture_link": "vwSHovDZ3UduPCKlj3Z/sygwPYOQNii"
    },
    {
        "title": "Baked Pancake with Caramel Banana Sauce",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "3 large eggs ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 teaspoon pure vanilla extract ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 cup sugar ADVERTISEMENT",
            "Caramel Banana Sauce: ADVERTISEMENT",
            "1 cup Marzetti's® Old Fashioned Caramel Dip ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 cup half and half ADVERTISEMENT",
            "3 large bananas, peeled and sliced into 1-inch pieces ADVERTISEMENT",
            "Optional toppings: walnuts, cranberries, chocolate chips, sour cream (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F.\nPlace 3 tablespoons butter into a 9 inch square baking dish or a 9 inch cast iron pan and melt in oven, about 3 to 5 minutes.\nWhisk together the eggs, milk and vanilla in a medium bowl.\nIn a large bowl, combine the flour, salt, cinnamon and sugar.\nWhisk egg mixture into flour mixture. Batter may appear a bit lumpy. Carefully pour batter into hot baking dish or pan and return it to oven.\nBake 12 to 15 minutes or until pancake rises high and edges are golden brown.\nFor sauce, melt butter in a medium skillet over medium heat. Add banana slices and cook for 2 minutes or until bananas are just golden. Add Marzetti Old Fashioned Caramel Dip and cream and stir until thoroughly heated.\nSpoon or slice pancake into pieces and serve on plates with caramel banana sauce. Serve with optional toppings.\n",
        "picture_link": "KsloRvciXie5fa4sEMTmatsA2TSCsMO"
    },
    {
        "title": "Balsamic Tuna Salad",
        "ingredients": [
            "1 (12 ounce) can albacore tuna in water, drained and flaked ADVERTISEMENT",
            "1 (15 ounce) can garbanzo beans, drained and rinsed ADVERTISEMENT",
            "1/2 cup halved black olives ADVERTISEMENT",
            "1/2 English (seedless) cucumber, coarsely chopped ADVERTISEMENT",
            "1 small red bell pepper, coarsely chopped ADVERTISEMENT",
            "1 bunch green onions, chopped ADVERTISEMENT",
            "1 bunch fresh parsley, chopped ADVERTISEMENT",
            "1/2 cup balsamic vinegar ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "1 clove garlic ADVERTISEMENT",
            "1 1/2 teaspoons dried oregano ADVERTISEMENT",
            "1/2 teaspoon coarsely ground black pepper ADVERTISEMENT",
            "1 (10 ounce) bag fresh baby spinach ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine flaked albacore tuna, garbanzo beans, black olives, English cucumber, red bell pepper, green onions, and parsley in a bowl.\nBlend balsamic vinegar, extra-virgin olive oil, garlic, dried oregano, and ground black pepper in a separate bowl using an immersion blender until garlic is pureed. Stir dressing into tuna and combine well. Serve over baby spinach.\n",
        "picture_link": "2gAgMDUAc8fVHTG5pIh5RXqcJivozL2"
    },
    {
        "title": "Basic Pork Brine",
        "ingredients": [
            "2 cups water, more if needed ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "2 tablespoons kosher salt ADVERTISEMENT",
            "3 cloves garlic, gently crushed ADVERTISEMENT",
            "3 slices fresh ginger, gently crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix water, brown sugar, and salt in a bowl until sugar is dissolved. Stir in garlic and ginger.\n",
        "picture_link": "dxh0Tq7b0eDykSLgfT.D08.wINyCpEW"
    },
    {
        "title": "Synowiez Peach Cobbler",
        "ingredients": [
            "1 1/2 cups butter ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "10 fresh peaches - peeled, pitted, and sliced ADVERTISEMENT",
            "1 pinch ground cinnamon, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Melt butter in a 9x13-inch baking dish in the preheating oven.\nMix flour, sugar, and milk together in a large bowl; pour into baking dish with melted butter. Spread peaches over the batter and sprinkle with cinnamon.\nBake in the preheated oven until cobbler is bubbling and lightly browned, about 45 minutes. Let cool about 15 minutes before serving.\n",
        "picture_link": "Q5l7dO8LP85CLpjCMOci2cU1kvFwhSa"
    },
    {
        "title": "Extra Caffeinated Brownies",
        "ingredients": [
            "8 cups strong black coffee ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup unsweetened cocoa powder ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring coffee to a simmer in a saucepan over medium-low heat and reduce to 2/3 cup of a thick coffee concentrate, stirring constantly to avoid burning, about 30 minutes. Set aside and let cool to room temperature.\nPreheat oven to 350 degrees F (175 degrees C). Grease an 8x8-inch baking pan.\nStir sugar and melted butter together in a bowl until smooth; beat in eggs, followed by vanilla extract. Stir the coffee concentrate and cocoa powder into the wet ingredients until no lumps remain. Whisk flour, salt, and baking powder together until thoroughly combined in a separate bowl; stir flour mixture into wet ingredients to make a smooth batter. Spread batter into the prepared baking pan.\nBake in the preheated oven until a toothpick inserted into the center of the brownies comes out with moist crumbs, 30 to 35 minutes. Let cool and cut into bars.\n",
        "picture_link": "d4otnN6r7zYzlh1jsWN971FIkgMrRdm"
    },
    {
        "title": "Peach Crisp with Oatmeal-Walnut Topping",
        "ingredients": [
            "5 cups sliced fresh peaches ADVERTISEMENT",
            "2 tablespoons instant tapioca ADVERTISEMENT",
            "1/4 teaspoon almond extract ADVERTISEMENT",
            "1/2 cup packed brown sugar, divided ADVERTISEMENT",
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup old-fashioned rolled oats ADVERTISEMENT",
            "1/3 cup chopped walnuts ADVERTISEMENT",
            "6 tablespoons unsalted butter, melted and cooled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nCombine peaches, tapioca, almond extract, and 1/4 cup brown sugar in a bowl. Set mixture aside until tapioca pearls have softened, about 15 minutes. Whisk remaining 1/4 cup of brown sugar and flour in a separate bowl.\nProcess rolled oats with walnuts in a food processor, pulsing a few times to grind to coarse crumbs; stir walnuts and oats into flour mixture. Drizzle topping mixture with melted butter and stir with a fork to create large crumbs of topping. Pour peaches and their juice into an 8x8-inch baking dish; spread crumb topping atop peaches in an even layer.\nBake in the preheated oven until topping is golden brown and the peaches are bubbling, 35 to 40 minutes. Serve slightly warm.\n",
        "picture_link": "vMK/x76V6hgSjJqAdz8KLsSnueo0qR2"
    },
    {
        "title": "Addictive Texas Trash",
        "ingredients": [
            "1 (14 ounce) package bite-size corn square cereal (such as Corn Chex®) ADVERTISEMENT",
            "1 (14 ounce) package crispy rice cereal squares (such as Rice Chex ®) ADVERTISEMENT",
            "1 (14 ounce) package bite-size wheat square cereal (such as Wheat Chex®) ADVERTISEMENT",
            "1 (8.9 ounce) box toasted oat cereal rings (such as Cheerios®) ADVERTISEMENT",
            "3 cups salted mixed nuts ADVERTISEMENT",
            "1 (15 ounce) package mini pretzel twists ADVERTISEMENT",
            "2 (6 ounce) packages goldfish crackers ADVERTISEMENT",
            "1 (12 ounce) package sesame snack sticks (optional) ADVERTISEMENT",
            "1 cup warm (liquid) bacon drippings ADVERTISEMENT",
            "1 cup unsalted butter, melted ADVERTISEMENT",
            "1/4 cup Worcestershire sauce ADVERTISEMENT",
            "2 tablespoons monosodium glutamate (MSG) ADVERTISEMENT",
            "2 tablespoons liquid smoke flavoring ADVERTISEMENT",
            "1 tablespoon cayenne pepper ADVERTISEMENT",
            "4 teaspoons seasoned salt ADVERTISEMENT",
            "4 teaspoons chili powder ADVERTISEMENT",
            "4 teaspoons garlic powder ADVERTISEMENT",
            "4 teaspoons hot pepper sauce (such as Tabasco®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 250 degrees F (120 degrees C).\nGently mix corn, rice, and wheat squares, oat rings, mixed nuts, mini pretzels, goldfish crackers, and sesame snacks in two 13x24-inch aluminum roasting pans, taking care not to break cereal.\nStir bacon drippings, unsalted butter, Worcestershire sauce, MSG, liquid smoke, cayenne pepper, seasoned salt, chili powder, garlic powder, and hot pepper sauce together in a microwave-safe bowl. Cook on high in microwave for 3 or 4 30-second intervals, stirring each time, until mixture is warm, liquid, and fully combined.\nStir seasoning sauce continuously as you pour half over the cereal mixture in each pan. Gently stir the snack mix and seasonings with a slotted spoon until thoroughly coated; do not crush cereal.\nBake in the preheated oven until sauce is completely absorbed and the snack mix is crisp, about 2 hours; stir gently every 15 minutes. Cool completely and store in airtight containers. The snack mix stores well in freezer in airtight freezer bags, if it makes it that long.\n",
        "picture_link": "26ZbopmeqkI5SjhJMCX5lKhQUa7SCVK"
    },
    {
        "title": "Coleslaw II",
        "ingredients": [
            "1 medium head cabbage, shredded ADVERTISEMENT",
            "1 red bell pepper, seeded and chopped ADVERTISEMENT",
            "1 yellow bell pepper, seeded and chopped ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3 carrots, grated ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "1 1/2 cups cider vinegar ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 teaspoons dry mustard ADVERTISEMENT",
            "3 teaspoons dried dill weed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, toss together cabbage, red pepper, yellow pepper, onion, carrots and celery. Refrigerate until serving.\nIn a small bowl, whisk together the vinegar, oil, sugar, mustard and dill. Pour over salad and toss to coat just before serving.\n",
        "picture_link": "mcYWjffCdQsBWCU7Oev10NVVCB4q0ZG"
    },
    {
        "title": "Easy Chili III",
        "ingredients": [
            "3 pounds ground beef ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 medium head garlic, peeled and chopped ADVERTISEMENT",
            "1 cup dry black beans ADVERTISEMENT",
            "1 cup dry kidney beans ADVERTISEMENT",
            "1 cup dry pinto beans ADVERTISEMENT",
            "2 (28 ounce) cans diced tomatoes, drained ADVERTISEMENT",
            "3 cups tomato paste ADVERTISEMENT",
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "2 tablespoons chili powder, or to taste ADVERTISEMENT",
            "1 teaspoon hot pepper sauce, or to taste ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot over medium heat, cook beef, onion and garlic until meat is brown. Stir in black beans, kidney beans, pinto beans, tomatoes, tomato paste and tomato sauce. Season with chili powder, salt, pepper and pepper sauce. Reduce heat, cover and simmer 2 to 3 hours, until beans are tender.\n",
        "picture_link": "rilJOxeh0vo41YHQG4k.9WY51TVC.Bq"
    },
    {
        "title": "Magic's Green and White Chicken Soup",
        "ingredients": [
            "1 (4 pound) whole chicken, cut into pieces ADVERTISEMENT",
            "2 medium heads garlic, chopped ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "2 1/4 cups sifted all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "4 egg yolks ADVERTISEMENT",
            "1 bunch fresh cilantro, chopped ADVERTISEMENT",
            "1 bunch fresh parsley, chopped ADVERTISEMENT",
            "1 bunch kale, torn into small pieces ADVERTISEMENT",
            "1 bunch fresh spinach, stems removed, torn into small pieces ADVERTISEMENT",
            "2 bunches green onions, chopped ADVERTISEMENT",
            "1 tablespoon Italian seasoning ADVERTISEMENT",
            "1 tablespoon curry powder ADVERTISEMENT",
            "3 tablespoons balsamic vinegar ADVERTISEMENT",
            "salt and cracked black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken and garlic in a large pot and with water to cover. Bring to a boil, then reduce heat and simmer, covered, until meat is very tender, 30 minutes to 1 hour. Remove chicken from pot and let rest until cool enough to handle. Remove skin and bone and tear or chop meat into bite-size pieces.\nIn a large bowl, beat together butter, flour and salt to form a mealy mixture. Beat in eggs and egg yolks to form a stiff dough. Divide dough into thirds and roll each third out onto a floured surface to 1/8 inch (3 mm) thickness. Let rolled pieces of dough rest on racks for 20 minutes.\nWhile dough is resting, stir chicken meat, cilantro, parsley, kale, spinach and green onions into broth. Season with Italian seasoning, curry powder and balsamic vinegar. Simmer over low heat, adding more water if necessary.\nSlice the noodle dough into 1/2-inch (1.2 cm) widths. Bring the soup to a light boil and drop noodles into the soup a few at a time. Cook until noodles are tender, 5 minutes. Season soup with salt and pepper and serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Homemade Mustard",
        "ingredients": [
            "1/2 cup dry mustard ADVERTISEMENT",
            "1/2 cup white vinegar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon pepper ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "3 egg yolks, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a heavy saucepan combine mustard, vinegar, salt, pepper and sugar. Simmer over low heat for 3 hours.\nBeat egg yolks into mixture and stir until thickened. Pour into hot, sterilized jars and seal. Cool at room temperature and store in the refrigerator.\n",
        "picture_link": "BcGtdRdE2bVVVEVumETVhZ7KRNwtVau"
    },
    {
        "title": "Spicy Chunks of Stewed Beef Soup",
        "ingredients": [
            "1 cup dry mixed beans ADVERTISEMENT",
            "1 1/2 pounds cubed beef stew meat ADVERTISEMENT",
            "5 cups beef broth ADVERTISEMENT",
            "1 cup red wine ADVERTISEMENT",
            "1 (28 ounce) can whole peeled tomatoes ADVERTISEMENT",
            "4 large carrots, cut into 2 inch pieces ADVERTISEMENT",
            "3 stalks celery, cut into 2 inch pieces ADVERTISEMENT",
            "3 potatoes, peeled and cubed ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "4 green onions, chopped ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon ground cayenne pepper ADVERTISEMENT",
            "1/2 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1 tablespoon dried oregano ADVERTISEMENT",
            "1 tablespoon ground dry mustard ADVERTISEMENT",
            "1 dash hot sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse and pick through beans and place in a medium saucepan with water to cover by 2 inches. Bring to a boil for 10 minutes, then remove from heat, cover and let soak 2 hours. Drain and rinse.\nIn a 5 quart slow cooker, combine beans, stew meat, broth, wine, tomatoes, carrots, celery, potatoes, garlic and onions. Season with salt, pepper, cayenne, red pepper flakes, oregano, mustard and hot sauce. Cover and cook on low 10 to 12 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "The De Leon Chocolate Chip Cookies",
        "ingredients": [
            "1 cup butter, melted ADVERTISEMENT",
            "3/4 cup brown sugar ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon coffee flavored liqueur ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nIn a large bowl, mix together the butter, brown sugar and white sugar until smooth. Beat in the eggs one at a time, then stir in the vanilla and coffee liqueur. Combine the flour, baking soda and salt; stir into the sugar mixture until well blended. Stir in chocolate chips. Drop dough by rounded tablespoonfuls 2 inches apart onto the prepared cookie sheets.\nBake for 10 to 12 minutes in the preheated oven, or until golden brown. Allow cookies to cool on baking sheet for 2 minutes before removing to a wire rack to cool completely.\n",
        "picture_link": "PIJ0zkpQVnoNqDNdCXZ2YLVvJr5bwh."
    },
    {
        "title": "Pineapple Scotchies",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "2 cups packed brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "4 cups unbleached all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 (8 ounce) cans crushed pineapple, drained ADVERTISEMENT",
            "1 cup butterscotch chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Grease cookie sheets or line with parchment paper.\nIn a large bowl, cream together the butter and brown sugar until smooth. Beat in the eggs one at a time, mixing well after each. Combine the flour, baking powder and salt; stir into the sugar mixture. Mix in pineapple and butterscotch chips. Drop cookies by rounded teaspoonfuls 2 inches apart onto the prepared cookie sheets.\nBake for 10 to 12 minutes in the preheated oven, or until golden. Allow cookies to cool on the baking sheet for 1 minute before removing to wire racks to cool completely.\n",
        "picture_link": "ZAKCmLfH8WspDuxgJslToRLCHLJ5Fwe"
    },
    {
        "title": "Colonial Chess Pie",
        "ingredients": [
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup light brown sugar ADVERTISEMENT",
            "1/8 cup sifted all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1/4 cup margarine ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 (9 inch) unbaked pie crust ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nIn a saucepan, combine white sugar, brown sugar, flour and salt. Pour in milk and add margarine. Heat, stirring constantly, until sugar dissolves and margarine is melted. Remove from heat and set aside to cool.\nIn a large bowl, whisk egg yolk, egg and vanilla until smooth. Whisk in cooled sugar mixture. Pour into pie crust.\nBake for 25 minutes in the preheated oven, then reduce the temperature to 250 degrees F (120 degrees C) and bake for an additional 25 minutes, or until top is puffed and edges are golden brown. Allow to cool before slicing.\n",
        "picture_link": "7eFIN4I1RHsGsQQeU6yOuHbjlU7pF7C"
    },
    {
        "title": "Cherry Chambord Butter",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "2 tablespoons Chambord (raspberry liqueur) ADVERTISEMENT",
            "1/3 cup confectioners' sugar ADVERTISEMENT",
            "1 grated zest of one orange ADVERTISEMENT",
            "1 cup cherry preserves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a food processor with a steel blade, blend the butter, cream cheese, Chambord and confectioners' sugar.\nStir in, by hand, the orange zest and cherry preserves. Chill and store in refrigerator for up to 3 weeks.\n",
        "picture_link": "V1Tl8f49KSrr2EUduewpNCut1VxjJ9G"
    },
    {
        "title": "Bohemia Cookies",
        "ingredients": [
            "1 cup shortening ADVERTISEMENT",
            "1 1/4 cups confectioners' sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 cup ground walnuts ADVERTISEMENT",
            "6 ounces milk chocolate, grated ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 250 degrees F (120 degrees C).\nIn a medium bowl, cream together the shortening and confectioners' sugar until smooth. Stir in the vanilla and salt. Mix in flour, walnuts and grated chocolate until well blended. Drop by teaspoonfuls onto ungreased cookie sheets.\nBake for 35 to 40 minutes in the preheated oven, or until firm. Remove from baking sheets to cool on wire racks.\n",
        "picture_link": "zNsVnVXNOu1J.btsxM1O7FWQurw1d7S"
    },
    {
        "title": "Veggie Stroganoff",
        "ingredients": [
            "3 tablespoons Spectrum Naturals® Canola Oil, divided ADVERTISEMENT",
            "1 medium onion, chopped ADVERTISEMENT",
            "1 large clove garlic, minced ADVERTISEMENT",
            "1 (8 ounce) package sliced button or cremini mushrooms ADVERTISEMENT",
            "1 (170 gram) package Yves Veggie Cuisine® Beef Veggie Tenders ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 cup Imagine® Organic Vegetable Broth ADVERTISEMENT",
            "1 teaspoon Dijon mustard ADVERTISEMENT",
            "1/2 teaspoon ground thyme ADVERTISEMENT",
            "1/2 teaspoon seasoning salt ADVERTISEMENT",
            "1/2 cup The Greek Gods™ Traditional Plain Yogurt or sour cream ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "1 (8 ounce) package Egg or egg-free noodles, cooked according to package directions ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large non-stick skillet, heat 1 tablespoon (15 mL) of the oil over medium heat. Add onion; cook for 6 minutes, stirring occasionally, until soft. Add garlic and mushrooms; cook for 2 minutes, stirring often.\nStir in the Beef Veggie Tenders; cook for 1 minute. Remove everything to a large plate.\nAdd remaining 2 tablespoons (25 mL) oil to the skillet. Stir in flour; cook for about 2 minutes, stirring, until lightly browned.\nStir in broth, Dijon, thyme and seasoning salt. Cook for 2 minutes, until thickened. Return mixture to skillet. Cover and simmer over low heat for 5 minutes.\nStir in yogurt; warm through. Sprinkle top with parsley. Serve over hot cooked noodles.\n",
        "picture_link": "PJ6q2g4/OlFg25PlA7ACaGgKLS9LgXu"
    },
    {
        "title": "Sweet Potato Shepherd's Pie",
        "ingredients": [
            "1 1/2 pounds sweet potatoes, peeled and chopped ADVERTISEMENT",
            "2 tablespoons soft, non-hydrogenated margarine ADVERTISEMENT",
            "1/4 teaspoon fresh ground pepper ADVERTISEMENT",
            "2 teaspoons Spectrum® Canola Oil ADVERTISEMENT",
            "1 (340 gram) package Yves Veggie Cuisine® Original Veggie Ground Round ADVERTISEMENT",
            "1 green pepper, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1 cup Imagine® Low Sodium Organic Vegetable Broth ADVERTISEMENT",
            "1 cup combined, Yves Veggie Cuisine® sweet peas, Yves Veggie Cuisine® whole kernel Golden Corn and carrots ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nIn pot of boiling water, cook potatoes for about 15 minutes or until tender.\nDrain well and return to pot. Add margarine and half of the fresh ground pepper and mash until smooth; set aside.\nIn a non-stick skillet, heat oil over medium heat. Cook ground round, green pepper and garlic, stirring for 5 minutes.\nStir in flour and cook, stirring, for 1 minute.\nAdd stock to skillet; bring to a boil.\nAdd peas, corn, carrots, and remaining ground pepper.\nSpread mixture into 8-inch (2 L) square baking dish. Spread mashed potato over top.\nBake in the preheated oven for about 15 minutes or until bubbly around edges.\n",
        "picture_link": "Wohx0B9rsTkmws0txgbuDWmIODLJERO"
    },
    {
        "title": "Georgina's True English Butter Tarts",
        "ingredients": [
            "24 (2 inch) unbaked tart shells ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1 cup golden syrup ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (205 degrees C). Place tart shells on a baking sheet.\nBake in the preheated oven until edge of crust is golden, about 10 minutes.\nLower oven temperature to 350 degrees F (175 degrees C). Position a rack in the upper 1/3 of the oven.\nWhisk brown sugar, golden syrup, butter, eggs, vanilla extract, and salt together in a bowl until smooth. Fill pastry shells with sugar mixture about 2/3-full.\nBake in the preheated oven until filling foams and is bubbly and golden, about 15 minutes. Remove pan and cool for a few minutes on a wire rack; serve warm or at room temperature.\n",
        "picture_link": "E8uM3lJFarWGVwz1H/WCSV3z9.3yUR2"
    },
    {
        "title": "Memphis-Style Rub",
        "ingredients": [
            "1/4 cup paprika ADVERTISEMENT",
            "3 tablespoons chili powder ADVERTISEMENT",
            "2 tablespoons turbinado sugar ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "2 teaspoons garlic powder ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "2 teaspoons dried oregano ADVERTISEMENT",
            "2 teaspoons ground thyme ADVERTISEMENT",
            "1 teaspoon celery salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon dry mustard ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk paprika, chili powder, turbinado sugar, salt, garlic powder, cumin, oregano, thyme, celery salt, black pepper, mustard, onion powder, and cayenne pepper together in a bowl.\n",
        "picture_link": "U0b.9FYYeRm0tPmAcSPLONez67lBmf2"
    },
    {
        "title": "Butternut Squash with Grapes",
        "ingredients": [
            "1/4 cup pine nuts (optional) ADVERTISEMENT",
            "1 (2 pound) butternut squash - peeled, seeded, and cut into 1-inch cubes ADVERTISEMENT",
            "1/2 pound seedless red grapes ADVERTISEMENT",
            "1/2 cup chopped sweet onion ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "1/2 teaspoon sea salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "6 fresh sage leaves, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a skillet over medium heat; cook and stir pine nuts until toasted and fragrant, about 5 minutes.\nPreheat oven to 425 degrees F (220 degrees C).\nMix squash, grapes, onion, olive oil, salt, pepper, and sage leaves together in a large baking dish to coat squash, onion, and grapes in oil and seasoning.\nRoast in the preheated oven until squash and onion are golden and slightly caramelized, about 50 minutes; sprinkle pine nuts over the dish.\n",
        "picture_link": "hxrOi7GoWsuPKDcfyQYyp8eLVGPenXW"
    },
    {
        "title": "Chicken Alfredo Zucchini Boats",
        "ingredients": [
            "3 medium zucchini, halved lengthwise ADVERTISEMENT",
            "2 (4 ounce) skinless, boneless chicken breast halves, cut into bite-size pieces ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "5 sliced fresh mushrooms ADVERTISEMENT",
            "1/4 cup bite-size broccoli florets ADVERTISEMENT",
            "1 (15 ounce) jar Classico® Creamy Alfredo Sauce ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 roma (plum) tomato, thinly sliced ADVERTISEMENT",
            "shredded mozzarella cheese ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray a rimmed baking sheet with cooking spray.\nSlice zucchini in half lengthwise and remove inner flesh with a small scoop or spoon leaving a 1/2-inch thick shell. Chop the zucchini flesh and reserve.\nLightly oil a non-stick skillet and set over medium heat. Add chicken; cook and stir until beginning to brown, about 5 minutes. Remove chicken from pan.\nMelt butter in skillet. Add onions, mushrooms, and broccoli. Cook and stir until onions are soft and broccoli is crisp tender, about 8 minutes. Add reserved zucchini flesh and chicken; continue to cook about 5 more minutes.\nStir in the Alfredo sauce and bring to a low simmer; simmer 5 minutes. Season with pepper.\nFill zucchini boats with Alfredo mixture; place on prepared baking sheet. Top with 1 tablespoon shredded mozzarella cheese, tomato slice, and Parmesan cheese.\nBake until zucchini are tender and cheese has melted, about 20 minutes. Let cool 5 minutes before serving.\n",
        "picture_link": "OHosCny8gl.3Op.Zq5T4QRA4yah.Mky"
    },
    {
        "title": "Pork Chop Suey from EatingWell",
        "ingredients": [
            "1 cup reduced sodium chicken broth ADVERTISEMENT",
            "3 tablespoons reduced-sodium soy sauce ADVERTISEMENT",
            "2 tablespoons molasses, preferably blackstrap ADVERTISEMENT",
            "1/4 teaspoon freshly ground pepper ADVERTISEMENT",
            "5 teaspoons cornstarch ADVERTISEMENT",
            "2 tablespoons canola oil, divided ADVERTISEMENT",
            "1 (16 ounce) pork tenderloin, trimmed, halved lengthwise and cut into 1/4-inch-thick pieces ADVERTISEMENT",
            "1 medium onion, slivered ADVERTISEMENT",
            "1 medium red bell pepper, thinly sliced ADVERTISEMENT",
            "3 cups mung bean sprouts (see Note) ADVERTISEMENT",
            "1 tablespoon minced fresh ginger ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine broth, soy sauce, molasses and pepper in a medium bowl. Transfer 2 tablespoons of the mixture to a small bowl; stir in cornstarch until combined. Set aside.\nHeat 1 tablespoon oil in a large nonstick skillet over medium heat. Add pork and cook, stirring frequently, until most of the pink is gone, 2 to 3 minutes. Transfer to a plate.\nIncrease heat to medium-high. Add the remaining 1 tablespoon oil, onion, bell pepper, sprouts and ginger and cook for 3 minutes. Pour in the broth mixture and bring to a boil. Cook, stirring, for 3 minutes. Reduce heat to medium; add the reserved cornstarch mixture and pork (and any accumulated juice) and cook, stirring, until slightly thickened, about 1 minute.\n",
        "picture_link": "PUw8fuO/d4AY37c8Z7mUZxXIg6/kZEG"
    },
    {
        "title": "Foil-Wrapped Cabbage",
        "ingredients": [
            "4 teaspoons butter, softened ADVERTISEMENT",
            "1 head cabbage, cored and quartered ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "4 slices bacon ADVERTISEMENT",
            "heavy aluminum foil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium-high heat and lightly oil the grate.\nSpread 1/2 teaspoon butter over the cut-side of each cabbage wedge.\nMix Parmesan cheese, salt, garlic powder, and black pepper together in a bowl; sprinkle over the buttered sides of the cabbage wedges. Wrap a slice of bacon around each wedge and wrap wedges individually in heavy aluminum foil.\nGrill cabbage until tender in the middle and the bacon is crisp, turning once, about 40 minutes.\n",
        "picture_link": "qi33Zv1z9DXaHQOLDIuv44Jm80Mhrd2"
    },
    {
        "title": "Herbed Alfredo Mashed Potatoes",
        "ingredients": [
            "1 head fresh garlic ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "3 pounds gold potatoes, peeled and cubed ADVERTISEMENT",
            "1/2 (15 ounce) jar Classico® Fresh Alfredo Sauce ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "5 tablespoons butter, melted and divided ADVERTISEMENT",
            "Salt and pepper to taste ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/2 cup chopped fresh Italian parsley ADVERTISEMENT",
            "1/4 cup chopped fresh chives ADVERTISEMENT",
            "1/4 cup panko bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Lightly oil a 2-quart baking dish.\nCut off the top of the garlic head to expose the tops of the cloves. Place garlic on a sheet of foil and drizzle with olive oil. Seal the foil around the garlic. Roast until soft, about 25 minutes. Cool. Reduce oven temperature to 375 degrees F (190 degrees C).\nPlace potatoes in large pot and cover with water. Set over high heat and bring to a boil. Simmer until the potatoes are fork tender, about 15 minutes. Drain; return to pot.\nPour the Classico(R) Fresh Alfredo sauce, milk, and 4 tablespoons of the melted butter into the pot. Using a hand mixer, mix the potatoes until they no longer have lumps.\nSqueeze the soft roasted garlic into the potatoes; add salt and pepper to taste. Mix well.\nMix the beaten eggs into the potatoes. Reserve a tablespoon of the parsley and chives for topping, and stir the rest into the potatoes. Spread the potato mixture into the prepared baking dish.\nMix the panko with the remaining tablespoon melted butter; sprinkle evenly on top of the potatoes.\nBake until the potatoes are golden brown, about 25 minutes. Garnish with the remaining parsley and chives.\n",
        "picture_link": "zy0EztBnBqYG64yDJEFVF4ayi99urRq"
    },
    {
        "title": "Coconut Chicken Curry Stew",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "2 pounds skinless, boneless chicken thighs, cut into 1-inch pieces ADVERTISEMENT",
            "6 cups chopped carrots ADVERTISEMENT",
            "4 cups chopped onion ADVERTISEMENT",
            "12 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons freshly grated ginger ADVERTISEMENT",
            "2 (14.25 ounce) cans low-sodium chicken broth ADVERTISEMENT",
            "2 cups light coconut milk ADVERTISEMENT",
            "2 tablespoons curry powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 cup chopped fresh cilantro ADVERTISEMENT",
            "2 tablespoons lime juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spray a nonstick skillet with cooking spray and place over medium-high heat. Cook and stir chicken pieces in hot skillet until lightly browned, about 3 minutes. Drain excess fat.\nSpread chicken, carrots, onion, garlic, and ginger in the bottom of a slow cooker.\nWhisk chicken broth, coconut milk, curry powder, and salt together in a bowl; pour over chicken mixture into slow cooker.\nCook on Low for 6 to 8 hours (or cook on High for 3 to 4 hours). Stir in cilantro and lime juice.\n",
        "picture_link": ".Z7tPHS95jSXFpk9xPcBTMRTxjCrzX2"
    },
    {
        "title": "Creamy  Alfredo Potatoes",
        "ingredients": [
            "4 large russet (baking) potatoes ADVERTISEMENT",
            "1 tablespoon kosher salt ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "1/2 teaspoon kosher salt ADVERTISEMENT",
            "1/4 teaspoon white pepper ADVERTISEMENT",
            "1 pinch cayenne pepper (optional) ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "2 green onions, chopped ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "1 (15 ounce) jar Classico® Fresh Four Cheese Alfredo Sauce, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Avoid over cooking to prevent skins from splitting. Drain. Refrigerate until chilled through.\nCombine paprika, salt, pepper and cayenne.\nPreheat oven to 350 degrees F (175 degrees C). Grease a 2-quart baking dish with 1 tablespoon butter.\nPeel the fully chilled potatoes. Grate the potatoes using course box grater or food processor.\nLayer half the potatoes into the buttered baking dish, season with a sprinkling of prepared seasoning blend, half the diced green onions, some parsley, and half a jar of the Alfredo sauce. Repeat layers ending with the remaining sauce and a sprinkling of the seasoning. Reserve some green onions and parsley for garnish.\nBake until hot and slightly browned, 30 to 35 minutes.\nGarnish with reserved green onions and parsley.\n",
        "picture_link": "Y1t/LUvAL.H4s3E9q8oMr4ogyYd3b5C"
    },
    {
        "title": "Simply Chocolate Granola",
        "ingredients": [
            "3 cups rolled oats ADVERTISEMENT",
            "1/4 cup wheat bran ADVERTISEMENT",
            "1/4 cup oat bran ADVERTISEMENT",
            "1/4 cup flax seed meal ADVERTISEMENT",
            "2/3 cup honey ADVERTISEMENT",
            "1/4 cup canola oil ADVERTISEMENT",
            "1/3 cup semisweet chocolate chips ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 250 degrees F (120 degrees C). Line a baking sheet with parchment paper.\nStir rolled oats, wheat bran, oat bran, and flax seed meal in a large bowl until well blended.\nCombine honey and oil in a saucepan; cook and stir over medium-low heat until mixture starts to boil, about 3 minutes. Lower heat to low and simmer for another 2 minutes.\nRemove saucepan from heat and stir in chocolate chips, vanilla extract, and salt. Pour chocolate mixture over dry oat mixture and stir until well coated; spread evenly over prepared baking sheet, gently pressing mixture down with spatula.\nBake in preheated oven for 30 minutes. Rotate baking sheet adn continue baking until slightly crisp, about 30 minutes more. Remove baking sheet from oven and cool granola until crisp, about 15 minutes. Break into chunks and store in an airtight container.\n",
        "picture_link": "FKt9WNp0C2g0gsCHHnKdBc1cE6yXBvK"
    },
    {
        "title": "Sriracha Tuna Salad",
        "ingredients": [
            "1 (5 ounce) can tuna, or more to taste, drained and flaked ADVERTISEMENT",
            "2 hard-boiled eggs, chopped ADVERTISEMENT",
            "3 mini sweet peppers, or more to taste ADVERTISEMENT",
            "2 tablespoons Sriracha hot chili sauce, or more to taste ADVERTISEMENT",
            "2 tablespoons mayonnaise ADVERTISEMENT",
            "2 tablespoons honey mustard ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix tuna, eggs, and peppers in a bowl. Stir sriracha, mayonnaise, and honey mustard into the tuna mixture.\nRefrigerate tuna salad for 5 minutes.\n",
        "picture_link": "8xuHy70hrkMSV/WDpGP6AYn9ijX82LC"
    },
    {
        "title": "Pickled Peppers",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "1/2 cup distilled white vinegar ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "kosher salt to taste ADVERTISEMENT",
            "3 red bell peppers, halved, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water, vinegar, sugar, and salt in a saucepan; bring to a boil. Add red bell peppers to the boiling water mixture, reduce heat to medium-low, and simmer until peppers are softened, 8 to 10 minutes.\nTransfer red bell peppers and liquid to jars, cover with lids, and refrigerate, 8 hours to overnight.\n",
        "picture_link": "QH9wz2nslQ1J2zLjvizem6SsK.5vq1y"
    },
    {
        "title": "Quick Strawberry Oatmeal Breakfast Smoothie",
        "ingredients": [
            "1/2 cup rolled oats ADVERTISEMENT",
            "1 teaspoon chia seeds ADVERTISEMENT",
            "14 frozen strawberries ADVERTISEMENT",
            "6 ounces nonfat vanilla Greek yogurt ADVERTISEMENT",
            "1 banana, broken into chunks ADVERTISEMENT",
            "1/2 cup almond milk ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend oats and chia seeds together in a blender to a fine consistency. Add strawberries, yogurt, banana, almond milk, and vanilla extract; blend until smooth.\n",
        "picture_link": "EfYhGVCeTwYpTPpvi6.srLih15ZR/Ji"
    },
    {
        "title": "Bethy's Cucumber Basil Lemonade",
        "ingredients": [
            "8 cups cold water, divided ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 1/2 cups lemon juice ADVERTISEMENT",
            "1/2 cucumber, thinly sliced ADVERTISEMENT",
            "10 fresh basil leaves, torn ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine 1 cup water and sugar together in a small saucepan; bring to a boil. Cook and stir until sugar is dissolved, about 5 minutes. Remove saucepan from heat and cool syrup to room temperature.\nStir syrup, remaining water, lemon juice, cucumber, and basil together in a pitcher; chill in the refrigerator for at least 2 hours.\n",
        "picture_link": "uFCAETvkoIagA.WxTZNU.lfDGX/J1Km"
    },
    {
        "title": "Chocolate Chip and Blueberry Muffins",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 cup light cream ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup chocolate chips ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/2 cup quick-cooking oats ADVERTISEMENT",
            "1/2 cup fresh blueberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease 12 muffin cups or line with paper liners.\nMix flour, baking powder, and baking soda together in a bowl. Whisk cream, sugar, chocolate chips, eggs, oats, and blueberries together in a separate bowl until well mixed. Stir flour mixture into cream mixture until batter is well mixed; pour into the prepared muffin cups.\nBake in the preheated oven until a toothpick inserted in the center of a muffin comes out clean, about 20 minutes. Cool muffins in muffin tin for 10 minutes before removing to wire rack to cool completely.\n",
        "picture_link": "NqOFK0qJVlzz/NXS4uEbBkSs40/iMdO"
    },
    {
        "title": "Peg's Meatloaf Sauce",
        "ingredients": [
            "3/4 cup ketchup ADVERTISEMENT",
            "6 tablespoons brown sugar ADVERTISEMENT",
            "1 tablespoon dry mustard ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir ketchup, brown sugar, mustard, and nutmeg together in a bowl until sugar is completely dissolved.\n",
        "picture_link": "FIact4E2/gqSqrxUq0TWm61.zQhBaxC"
    },
    {
        "title": "Smoked Pork Shank with White Beans ",
        "ingredients": [
            "1 pound dry cannellini beans ADVERTISEMENT",
            "2 tablespoons butter, or to taste ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "1 (1 1/2) pound smoked pork shank ADVERTISEMENT",
            "1 quart water ADVERTISEMENT",
            "2 cups chicken stock ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "2 sprigs fresh oregano ADVERTISEMENT",
            "2 sprigs fresh rosemary ADVERTISEMENT",
            "1 pinch red pepper flakes, or to taste ADVERTISEMENT",
            "1 tomato, diced ADVERTISEMENT",
            "1 recipe homemade gremolata (see footnote) ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cannellini beans in a large container and cover with several inches of cool water; let stand 8 hours to overnight. Drain and rinse.\nMelt butter in a heavy pot over medium heat. Cook and stir onion in hot butter until translucent, about 5 minutes. Add garlic; cook and stir until fragrant, about 1 minute.\nStir pork shank, water, chicken stock, and bay leaves into onion mixture; bring to simmer, reduce heat to low, cover the pot with a lid, and simmer until flavors blend, about 45 minutes.\nTurn shank over and stir oregano, rosemary, and red pepper flakes into chicken stock mixture; add beans and stir. Return mixture to a simmer, cover the pot with a lid, and simmer until beans are almost tender, about 1 hour. Simmer uncovered until beans are tender, about 30 minutes more. Cool to room temperature, cover the pot, and refrigerate, 8 hours to overnight.\nSpoon accumulated fat from the top of the chilled bean mixture and discard fat. Remove pork shank; cut meat into slices and discard bone.\nStir sliced pork shank, tomato, gremolata, salt, and black pepper into bean mixture over medium heat; cook and stir until heated through, 10 to 15 minutes.\n",
        "picture_link": "ykUw/e6CA2jYFI2vsKHXAqu9X3Kt9p2"
    },
    {
        "title": "Grilled Salmon Sandwich with Green Apple Slaw",
        "ingredients": [
            "1/3 cup Heinz 57 Sauce, Lightly Flavoured ADVERTISEMENT",
            "2 tablespoons melted butter ADVERTISEMENT",
            "1 teaspoon Heinz Worcestershire Sauce ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "4 skinless, boneless salmon fillets ADVERTISEMENT",
            "1 Granny Smith apple, thinly sliced ADVERTISEMENT",
            "1/2 cup very thinly sliced red onion ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "2 teaspoons extra-virgin olive oil ADVERTISEMENT",
            "2 teaspoons chopped fresh dill ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon pepper ADVERTISEMENT",
            "4 kaiser rolls ADVERTISEMENT",
            "Lettuce leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the grill to medium-high heat. Line the grate with perforated non-stick foil. Combine 57 sauce with butter, Worcestershire sauce and garlic. Brush half this mixture over salmon.\nGrill the salmon, basting with remaining sauce, for 4 to 5 minutes per side. Toss the apples, onion and dill with the lemon juice, oil, salt and pepper. Slice rolls in half and toast lightly on the grill.\nPlace a leaf of lettuce on each halved roll, top with a piece of salmon and equal amounts of slaw.\n",
        "picture_link": "uc0ebTIcecWgzuZ54HI8XPsf18IcbG6"
    },
    {
        "title": "Butternut Squash and Trout Bake with Fresh Salsa",
        "ingredients": [
            "2 tomatoes, finely chopped ADVERTISEMENT",
            "1/3 cup finely chopped red onion ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "1 jalapeno pepper, finely chopped ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 butternut squash, halved lengthwise and seeded ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 tablespoons finely chopped fresh dill, or to taste ADVERTISEMENT",
            "2 (4 ounce) fillets rainbow trout ADVERTISEMENT",
            "1 teaspoon olive oil, or as needed ADVERTISEMENT",
            "2 tablespoons finely chopped fresh dill, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 450 degrees F (230 degrees C). Line a large baking sheet with aluminum foil.\nCombine tomatoes, red onion, cilantro, jalapeno pepper, lemon juice, and 1 tablespoon olive oil in a bowl. Place squash halves on a baking sheet. Fill butternut squash cavities with tomato salsa mixture, reserving about 2 tablespoons of salsa for garnish. Brush cut surfaces of squash with 1 tablespoon olive oil. Sprinkle squash with 2 tablespoons of dill.\nBake squash in the preheated oven until almost tender, about 45 minutes.\nRemove baking sheet from oven; place trout fillets onto baking sheet, brush with 1 teaspoon olive oil, and sprinkle with remaining 2 tablespoons dill. Return to oven and bake until trout fillets are opaque and fish flakes easily with a fork, about 15 more minutes. Serve fillets on top of squash halves, served with reserved salsa.\n",
        "picture_link": "doI.5VGDJLXq1yWlU7ifGOE/6JXcjsW"
    },
    {
        "title": "Sweet and Tangy Summer Macaroni Salad",
        "ingredients": [
            "2 cups elbow macaroni ADVERTISEMENT",
            "2 ripe tomatoes, chopped ADVERTISEMENT",
            "1/2 green bell pepper, seeded and chopped ADVERTISEMENT",
            "1/4 cucumber, chopped ADVERTISEMENT",
            "1 green onion, chopped ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1/3 cup ketchup ADVERTISEMENT",
            "1/4 cup vinegar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until cooked through but firm to the bite, 8 minutes. Drain and rinse in cold water until macaroni is cooled.\nPlace macaroni into a large salad bowl and stir in tomatoes, green bell pepper, cucumber, and green onion.\nWhisk sugar, vegetable oil, ketchup, vinegar, salt, paprika, and black pepper, stirring in a bowl until sugar has dissolved. Pour dressing over macaroni and vegetables and toss to coat.\n",
        "picture_link": "eMXDw/.zd26it5rAewFFbW4jDceVEvu"
    },
    {
        "title": "Pickled Grilled Vegetables",
        "ingredients": [
            "6 pickling cucumbers, sliced in half lengthwise ADVERTISEMENT",
            "1 red bell pepper, sliced ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 cup white vinegar ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 1/2 tablespoons kosher salt ADVERTISEMENT",
            "2 cloves garlic, peeled ADVERTISEMENT",
            "12 black peppercorns ADVERTISEMENT",
            "1/4 teaspoon dried dill ADVERTISEMENT",
            "1 pinch crushed red pepper flakes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for high heat, and lightly oil the grate.\nPlace cucumbers and red peppers on grill, cook until slightly softened, about 2 minutes per side. Remove from heat.\nCombine water, vinegar, sugar, kosher salt, garlic, black peppercorns, dill, and red pepper flakes in a saucepan over medium heat. Bring to a simmer and remove from heat.\nPack cucumbers and peppers evenly between two 16-ounce mason jars. Pour hot pickling liquid into jars, leaving 1/4-inch headspace. Screw on lids and let cool to room temperature. Refrigerate for 24 hours before serving.\n",
        "picture_link": "uuva46voe8KY.uEZ7HrZrDfcDa0UVTi"
    },
    {
        "title": "Stella's Avocado, Egg, and Onion",
        "ingredients": [
            "2 hard-cooked eggs, mashed ADVERTISEMENT",
            "1 avocado, mashed ADVERTISEMENT",
            "1/4 onion, finely chopped ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir the egg, avocado, onion, and salt together in bowl until well-mixed.\n",
        "picture_link": "z5yCRWkweRvULMllAys9GFN.wkOqSlC"
    },
    {
        "title": "Chicken, Chive, and Feta Zucchini Fritters",
        "ingredients": [
            "2 zucchini, grated ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1 teaspoon seafood seasoning (such as Old Bay®) ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "3/4 cup cubed cooked chicken ADVERTISEMENT",
            "2/3 cup crumbled feta cheese ADVERTISEMENT",
            "1/2 cup chopped fresh chives ADVERTISEMENT",
            "1/3 cup vegetable oil, divided ADVERTISEMENT",
            "1/2 cup sour cream (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss zucchini with 1 teaspoon salt in a colander and drain for 10 minutes. Wrap vegetables in a clean kitchen towel and squeeze out as much moisture as possible; transfer mixture to a bowl.\nWhisk flour, eggs, milk, seafood seasoning, 1/2 teaspoon salt, and black pepper together in a bowl until smooth. Stir zucchini, chicken, feta cheese, and chives into the batter until well blended.\nHeat about 3 tablespoons vegetable oil in a skillet over medium-high heat; pan-fry heaping tablespoonfuls of batter in the hot oil in batches, flattening fritters with a spoon to about 3-inches wide, until golden brown, 2 to 3 minutes per side. Transfer fritters to a paper towel-lined plate. Repeat with remaining vegetable oil and batter. Serve with sour cream.\n",
        "picture_link": "GmBPLw35lHW9U9mOstVjefC9cXEc1J6"
    },
    {
        "title": "Big Game Deviled Eggs",
        "ingredients": [
            "2 quarts water ADVERTISEMENT",
            "1/2 cup distilled white vinegar ADVERTISEMENT",
            "10 large eggs ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "3 tablespoons Dijon mustard, smooth style ADVERTISEMENT",
            "2 teaspoons sweet pickle relish juice ADVERTISEMENT",
            "1/4 teaspoon onion powder ADVERTISEMENT",
            "1 1/2 tablespoons real bacon bits ADVERTISEMENT",
            "1 pinch paprika, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water to a boil over high heat and stir in the vinegar. Carefully lower the eggs into the boiling water.\nReturn eggs to a boil over medium heat and boil for 15 minutes.\nTransfer the eggs to a colander set in the sink, and run cold water over the eggs for about 5 minutes to chill.\nPeel the eggs under a light stream of cold water and set aside in cold water to finish chilling, about 10 minutes.\nSlice the eggs lengthwise; scoop the egg yolks into a bowl.\nMash the egg yolks with a fork, then stir in the mayonnaise, 1 tablespoon at a time, until smooth; stir in the Dijon mustard.\nMix in sweet pickle relish juice, onion powder, and bacon bits; stir with the fork until the yolk mixture is thoroughly combined.\nFill each egg white half with the yolk mixture using a spoon.\nDust the deviled eggs with paprika and transfer to a platter.\nCover the platter with plastic wrap and refrigerate until cold and the flavors have blended, at least 1 hour.\n",
        "picture_link": "crQMJ0GHYfK97AkSwozNjprg/lEq2EK"
    },
    {
        "title": "Screwdriver Cocktail",
        "ingredients": [
            "1 1/2 fluid ounces vodka ADVERTISEMENT",
            "6 fluid ounces orange juice ADVERTISEMENT",
            "1 1/2 cups ice cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine vodka and orange juice in a highball glass and stir to combine. Add ice.\n",
        "picture_link": "B4/6d6Imhwo3kKw6L7fcSeHfQwwLGEe"
    },
    {
        "title": "Fresh Mild Salsa",
        "ingredients": [
            "4 ripe tomatoes, chopped ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 serrano pepper, seeded and chopped ADVERTISEMENT",
            "1 jalapeno pepper, seeded and chopped ADVERTISEMENT",
            "3/4 white onion, finely chopped ADVERTISEMENT",
            "1/4 green bell pepper, finely chopped ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "1 tablespoon ground cumin, or to taste ADVERTISEMENT",
            "2 1/2 teaspoons lemon juice ADVERTISEMENT",
            "2 teaspoons salt, or to taste ADVERTISEMENT",
            "1 teaspoon ground black pepper, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir tomatoes, garlic, serrano pepper, jalapeno pepper, white onion, green bell pepper, cilantro, cumin, lemon juice, salt, and black pepper together in a bowl.\n",
        "picture_link": "g5dkXNeyeDT7XPtpNYjWYt3QE.AZF3m"
    },
    {
        "title": "Breta's 7 Layer Dip",
        "ingredients": [
            "1 (14 ounce) can refried beans ADVERTISEMENT",
            "1 (9 ounce) can hot bean dip (such as Fritos® Brand) ADVERTISEMENT",
            "6 avocados - peeled, pitted, and mashed ADVERTISEMENT",
            "1 cup salsa ADVERTISEMENT",
            "1 1/2 cups sour cream ADVERTISEMENT",
            "1 cup finely shredded Cheddar cheese ADVERTISEMENT",
            "1 (4 ounce) can chopped black olives, drained ADVERTISEMENT",
            "2 tomatoes, diced ADVERTISEMENT",
            "4 green onions, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix refried beans with hot bean dip in a bowl; spread the bean mixture in an even layer over a pizza pan.\nMix avocados with salsa in a bowl; spread mixture over the bean mixture. Place dollops of sour cream over avocado layer and spread into an even layer; top with shredded Cheddar cheese. Sprinkle black olives, diced tomatoes, and green onions over the dip.\nChill at least 1 hour before serving.\n",
        "picture_link": "apjzRHPMTjNh7UvGAML27YEuxE9WXyS"
    },
    {
        "title": "Corn Cob Puppies (Corn Dogs)",
        "ingredients": [
            "8 bun-length hot dogs (such as Gwaltney® Bun Sized Jumbo Franks) ADVERTISEMENT",
            "1 quart vegetable oil for frying ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 cup corn meal ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "2 large eggs ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "2 tablespoons bacon drippings ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 pinch garlic powder ADVERTISEMENT",
            "8 sturdy bamboo skewers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place hot dogs into a large pot of simmering water and keep hot.\nHeat vegetable oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C).\nWhisk flour, corn meal, buttermilk, eggs, sugar, bacon drippings, salt, baking powder, and garlic powder in a large bowl until moistened; beat batter until smooth, 2 to 3 minutes.\nRemove a hot dog from the water and blot completely dry with paper towels; skewer the hot dog lengthwise with a bamboo skewer. Using the skewer end as a handle, roll the hot dog in the batter to thoroughly coat.\nRoll the corn dog in the hot oil with the same continuous rolling motion, setting the batter; continue to roll the corn dog in the hot oil until deep golden brown, 2 to 3 minutes. Alternately, lay corn dog into hot oil after initial rolling to finish cooking the batter, about 1 minute per side. Drain corn dogs on paper towels to blot excess oil.\n",
        "picture_link": "pVvGnohtUTLGzMBkWiYAFvCEwjXEaRC"
    },
    {
        "title": "Spicy Baked Picnic Chicken",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "1 (1.25 ounce) package taco seasoning mix, divided ADVERTISEMENT",
            "1/8 teaspoon cayenne pepper ADVERTISEMENT",
            "1 cup bread crumbs ADVERTISEMENT",
            "1 cup grated Parmesan cheese ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "1/2 teaspoon salt (optional) ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Spray a broiler pan with cooking spray.\nWhisk buttermilk, 1 teaspoon taco seasoning, and cayenne pepper together in a bowl.\nMix remaining taco seasoning, bread crumbs, Parmesan cheese, flour, onion powder, salt, and black pepper together in a separate bowl.\nDip chicken in buttermilk mixture; coat with bread crumbs mixture. Place coated chicken in broiler pan.\nBake in the preheated oven until chicken is longer pink in the center and coating is crispy, 30 to 35 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "YpSFERGj4Aj8josdY6VNrInCPoDRGbu"
    },
    {
        "title": "Simple Steamed Artichokes",
        "ingredients": [
            "2 whole artichokes ADVERTISEMENT",
            "1 clove garlic ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut stem from artichokes and discard, making sure the bottom of each artichoke is flat. Cut top 1 inch (or so) of the artichoke and discard. Snip the thorny ends from each artichoke leaf with a pair of kitchen scissors.\nFill the bottom of a pot with a couple of inches of water, adding garlic, lemon juice, and bay leaf to the water. Place a steamer basket in the pot, making sure that the water does not flow over the bottom of the steamer basket.\nPlace the artichokes in the basket, resting on the flattened bottoms.\nBring water to a boil, cover the pot, and cook until the leaves can be easily pulled from the artichoke, 20 to 30 minutes.\n",
        "picture_link": "5aLAbVWeSWjMbsZKPNyho3iKoMHUB5C"
    },
    {
        "title": "Pineapple Picnic Cake",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 (20 ounce) can crushed pineapple, undrained ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup shredded coconut (optional) ADVERTISEMENT",
            "1 cup chopped walnuts (optional) ADVERTISEMENT",
            "1/2 cup butter, room temperature ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, room temperature ADVERTISEMENT",
            "1 (16 ounce) package confectioners' sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup chopped walnuts, or to taste (optional) ADVERTISEMENT",
            "1/2 cup shredded coconut, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and place a layer of waxed paper in a 9x13-inch baking pan. Butter and flour the waxed paper layer.\nMix flour, white sugar, pineapple, baking soda, eggs, 1 cup coconut, and 1 cup walnuts together in a bowl. Pour batter into prepared baking pan.\nBake in the preheated oven until cake is golden brown and a toothpick inserted in the center comes out clean, 40 to 45 minutes. Let cool for about 15 minutes in the pan; run a knife around the edge of the cake to loosen from pan. Flip onto cooling rack.\nWhip butter, cream cheese, confectioners' sugar, and vanilla extract together in a bowl until light and creamy. Frost the cooled cake. Top with about 1/2 cup chopped walnuts and 1/2 cup shredded coconut.\n",
        "picture_link": "cXLjrj1ElG4dRYLtTLEtMY3sME5JUJq"
    },
    {
        "title": "Cherry Folditup",
        "ingredients": [
            "6 ounces white whole wheat flour ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "6 tablespoons chilled unsalted butter, cut into 1/2-inch chunks ADVERTISEMENT",
            "1/4 cup ice cold water ADVERTISEMENT",
            "1 tablespoon ice cold orange vodka (optional) ADVERTISEMENT",
            "1 cup cherry pie filling ADVERTISEMENT",
            "2 teaspoons milk ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together flour, sugar, and salt in a bowl. Cut in cold butter with a pastry blender until the mixture resembles coarse crumbs. Make a well in the flour mixture and pour in water and vodka, if using. Toss with a fork until flour mixture is moistened, then use your hands to bring dough together into a ball. Flatten into a disc, wrap in plastic wrap, and refrigerate for at least 2 hours.\nPreheat oven to 375 degrees F (190 degrees C). Line a baking sheet with parchment paper or a silicone baking mat.\nRoll dough into a large disk about 13 inches wide and 1/8-inch thick. Transfer dough to the prepared baking sheet.\nPour cherry filling into the middle of the dough, leaving a 3-inch border. Fold the outside edge of the dough over the fruit, making occasional pleats.\nBrush milk over dough; generously sprinkle with sugar. Bake in the preheated oven until crust is golden and the fruit is bubbling, 35 minutes.\n",
        "picture_link": "Nvau6Pf6MWi3ZFwz7b6r1DUUe.hPMda"
    },
    {
        "title": "Shot Glass Cream Cheese Dessert",
        "ingredients": [
            "1/2 cup miniature chocolate chips ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 1/2 cups chocolate chips ADVERTISEMENT",
            "12 milk chocolate candy kisses (such as Hershey's Kisses®) (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line the bottom of 12 shot glasses with miniature chocolate chips.\nWhip cream cheese and sugar together in a bowl with an electric hand mixer on medium speed.\nLayer cream cheese into the shot glasses, alternating with layers of chocolate chips. Garnish with milk chocolate candy kisses.\n",
        "picture_link": "9ikxTgle6epNwd4rcTjKy8W3lR/ptaS"
    },
    {
        "title": "Fab-u-lous Refried Beans!",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/2 red onion, chopped ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro, or more to taste ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "2 teaspoons chili powder ADVERTISEMENT",
            "1 (15 ounce) can pinto beans, drained and rinsed ADVERTISEMENT",
            "1 cup chicken broth, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a nonstick pan; cook and stir red onion, cilantro, garlic, and chili powder until onion is softened, about 5 minutes.\nCook and stir pinto beans and about 2/3 cup chicken broth into onion mixture until heated through, about 5 minutes. Mash pinto beans with the back of a spoon. Add remaining chicken broth and simmer until desired consistency.\n",
        "picture_link": "GIzc47J/y6dtuJzYd5SMSh8rqZlHuW6"
    },
    {
        "title": "Big Game Spicy Beer Cheese Soup",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 cup finely chopped celery ADVERTISEMENT",
            "1 cup finely chopped carrot ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 (32 ounce) carton chicken stock ADVERTISEMENT",
            "3 (12 fluid ounce) cans or bottles American-style pale lager beer ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon hot pepper sauce (such as Tabasco®) ADVERTISEMENT",
            "2 teaspoons white pepper ADVERTISEMENT",
            "2 teaspoons dry mustard powder ADVERTISEMENT",
            "2 teaspoons onion powder ADVERTISEMENT",
            "2 teaspoons garlic powder ADVERTISEMENT",
            "1 teaspoon ground cayenne pepper ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed cream of chicken soup ADVERTISEMENT",
            "1 (10.75 ounce) can condensed Cheddar cheese soup ADVERTISEMENT",
            "1 (1 pound) loaf processed cheese, cubed ADVERTISEMENT",
            "1/2 pound block pepperjack cheese, shredded ADVERTISEMENT",
            "1/2 pound block sharp Cheddar cheese, shredded ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter with olive oil in a large soup pot or Dutch oven over medium heat.\nCook and stir the celery, carrots, and garlic until soft, about 8 minutes.\nPour in the chicken stock, beer, Worcestershire sauce, hot pepper sauce, white pepper, mustard powder, onion powder, garlic powder, and cayenne pepper; whisk to combine.\nBlend the mixture with a hand blender until smooth. Bring to a boil, reduce heat to low, and simmer 15 minutes.\nStir in the cream of chicken soup and the Cheddar cheese soup; bring soup back to a simmer.\nStir in the processed cheese and allow to melt. When it has melted, slowly mix in the pepperjack and sharp Cheddar cheeses, a little at a time, allowing each addition to melt into the soup before adding the next.\nSimmer the soup over low heat until the cheese has completely melted and the flavors have blended, 15 to 20 more minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Baked Artichokes",
        "ingredients": [
            "1 serving cooking spray ADVERTISEMENT",
            "1/2 cup Italian-seasoned bread crumbs ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "1/4 cup extra-virgin olive oil ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "2 teaspoons lemon zest ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 (14 ounce) cans artichoke hearts, rinsed and drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Prepare a baking dish with cooking spray.\nMix bread crumbs, Parmesan cheese, and parsley together in a bowl. Stir olive oil, lemon juice, lemon zest, and garlic together in a separate bowl.\nSpread artichoke hearts into bottom of prepared baking dish. Pour olive oil mixture over artichokes and stir to coat. Spread bread crumb mixture over the artichokes.\nBake in preheated oven until hot in the center and the bread crumb layer is golden brown, 15 to 20 minutes.\n",
        "picture_link": "wg0bKvAxUwAhhnJ63mAl4IOTYfM9ie."
    },
    {
        "title": "Fig Brulee with Burrata Cheese",
        "ingredients": [
            "6 fresh figs, halved ADVERTISEMENT",
            "1 tablespoon Demerara sugar ADVERTISEMENT",
            "4 ounces Burrata cheese ADVERTISEMENT",
            "extra virgin olive oil ADVERTISEMENT",
            "sea salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place figs on a flame-proof surface or plate and sprinkle flesh-sides with Demerara sugar. Using a kitchen torch set to a medium-high flame, melt the sugar by making short, even passes over the top of the sugar. Continue melting the sugar until it bubbles and turns dark brown, about 30 seconds.\nPlace Burrata cheese on a plate. Drizzle with olive oil, sprinkle with a pinch of sea salt and black pepper. Place bruleed figs around cheese and serve.\n",
        "picture_link": "jl1HVLlH49cmkBviIzC9cvWe/y7xY0K"
    },
    {
        "title": "Diane's Scotch-Irish Potato Salad",
        "ingredients": [
            "10 pounds red potatoes ADVERTISEMENT",
            "2 cups chopped celery ADVERTISEMENT",
            "2 cups chopped red onion ADVERTISEMENT",
            "6 hard-boiled eggs, peeled and coarsely chopped ADVERTISEMENT",
            "1 cup sliced black olives ADVERTISEMENT",
            "1 cup sliced green olives with pimentos ADVERTISEMENT",
            "1 cup dill pickle relish ADVERTISEMENT",
            "1/2 cup sweet pickle relish ADVERTISEMENT",
            "1 teaspoon smoked paprika ADVERTISEMENT",
            "1/4 cup prepared mustard, or as needed ADVERTISEMENT",
            "1/4 cup apple cider vinegar, or as needed ADVERTISEMENT",
            "1/2 cup mayonnaise, or as needed ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes in a large pot, cover with water, and bring to a boil. Reduce heat to medium-low, cover, and simmer until tender, about 20 minutes. Drain and allow to cool.\nRemove skins from potatoes and cut into chunks. Place in a large bowl.\nLightly stir celery, red onion, eggs, black olives, green olives, dill pickle relish, sweet pickle relish, and paprika with potatoes until thoroughly combined.\nMix in mustard, vinegar, and mayonnaise; stir lightly until all ingredients are coated and moist. If salad isn't moist enough, stir up to 1/2 cup more mayonnaise into salad.\nSeason with salt and ground black pepper to taste. For best flavor, make the day before and refrigerate overnight.\n",
        "picture_link": "5oEImekSwaKYueb0Am4N.BM6nIryCti"
    },
    {
        "title": "Spicy Chicken Marsala",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "6 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1/4 pound bacon, chopped ADVERTISEMENT",
            "2 shallots, minced ADVERTISEMENT",
            "8 green onions, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 (14.5 ounce) can fire-roasted diced tomatoes with juice ADVERTISEMENT",
            "1 cup Marsala wine ADVERTISEMENT",
            "4 cubes chicken bouillon ADVERTISEMENT",
            "2 teaspoons whole fresh rosemary leaves ADVERTISEMENT",
            "1/2 cup half-and-half ADVERTISEMENT",
            "2 cups grated Parmesan cheese ADVERTISEMENT",
            "1 (16 ounce) package spaghetti ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large cast-iron skillet over medium heat until very hot. Pour in the vegetable oil, tilt skillet to coat with oil, and place chicken breast halves into the hot skillet. Cook the chicken breasts until browned on each side, about 8 minutes per side.\nIncrease heat under skillet to medium-high, then stir in bacon, shallots, and green onions. Cook and stir until bacon begins to crisp, about 10 minutes.\nStir in garlic until fragrant, then add fire-roasted tomatoes, Marsala wine, chicken bouillon cubes, and rosemary. Bring to a boil, then reduce heat to low; simmer for about 1 hour.\nStir half-and-half and Parmesan cheese into the sauce over medium heat. Continue to cook until cheese melts, about 10 minutes. Remove skillet from heat, and allow the chicken and sauce to rest while cooking the pasta.\nFill a large pot with lightly salted water and bring to a rolling boil. Stir in the spaghetti and return to a boil. Cook until the pasta has cooked through but is still slightly firm to the bite, about 12 minutes. Drain well.\nTransfer cooked spaghetti to a serving platter and serve topped with chicken breasts and sauce.\n",
        "picture_link": "mgga4qW1iZmdVk2SBhT16CLIV.tHegy"
    },
    {
        "title": "Irish Soda Bread and Whiskey Butter",
        "ingredients": [
            "1 cup raisins ADVERTISEMENT",
            "1/2 cup whiskey ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 tablespoon grated orange peel (optional) ADVERTISEMENT",
            "1 tablespoon caraway seeds (optional) ADVERTISEMENT",
            "1 1/3 cups buttermilk ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "1/2 cup butter at room temperature ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place raisins in a small bowl; pour in whiskey and allow to soak overnight.\nThe next day, drain raisins and reserve the leftover whiskey.\nPreheat oven to 350 degrees F (175 degrees C).\nGrease a 2-quart casserole dish.\nWhisk together flour, sugar, baking powder, salt, and baking soda in a large bowl.\nStir drained raisins, orange peel, and caraway seeds into dry ingredients.\nBeat in buttermilk and 1/4 cup melted butter to make a thick batter.\nTransfer batter to prepared casserole dish.\nBake in the preheated oven until top is golden brown and a toothpick inserted into the center comes out clean, about 1 hour and 10 minutes.\nBeat 1/2 cup butter in a bowl until fluffy; beat in reserved whiskey, 1 teaspoon at a time, to taste. Serve with soda bread.\n",
        "picture_link": "U3uhSlTyvpwOHJFocTeBPIND7XTZs1C"
    },
    {
        "title": "Caesar Dressing",
        "ingredients": [
            "1 cup mayonnaise ADVERTISEMENT",
            "1/4 cup apple cider vinegar ADVERTISEMENT",
            "1 teaspoon oil-packed minced garlic ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place mayonnaise, vinegar, garlic, and salt in a blender; blend until smooth.\n",
        "picture_link": "3dS81M5wpMBAzmOpXKw9SA22CJgEQKK"
    },
    {
        "title": "St Patrick's Day Casserole",
        "ingredients": [
            "1 1/4 pounds red potatoes cut into 3/4-inch cubes ADVERTISEMENT",
            "4 cups chopped cabbage ADVERTISEMENT",
            "butter-flavored cooking spray ADVERTISEMENT",
            "1 1/2 pounds cooked corned beef, cut into 3/4-inch cubes ADVERTISEMENT",
            "1 1/2 cups shredded Swiss cheese ADVERTISEMENT",
            "1/3 cup coarse-grained mustard ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "2 teaspoons ground black pepper ADVERTISEMENT",
            "4 sheets phyllo dough, thawed ADVERTISEMENT",
            "butter-flavored cooking spray ADVERTISEMENT",
            "1 tablespoon melted butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place red potato cubes into a large saucepan, cover with water, and bring to a boil. Cook potatoes over medium-low heat until tender, about 15 minutes; drain well.\nPlace chopped cabbage into a saucepan and cover with water; bring to a boil. Reduce heat to medium-low and simmer the cabbage until tender and softened, about 15 minutes; drain well.\nPreheat the oven to 375 degrees F (190 degrees C).\nSpray a 9x13-inch baking dish with cooking spray.\nLightly toss potatoes, cabbage, corned beef, and Swiss cheese in a large bowl until well combined.\nStir together mustard, white wine, garlic powder, and black pepper in a bowl until smooth; mix into corned beef mixture.\nSpread the mixture into the prepared baking dish.\nLay a phyllo sheet onto a work surface and spray with cooking spray. Place the phyllo sheet onto the casserole, folding the overhang back over the dish; spray the dry side of the overhang with more cooking spray.\nRepeat three more times, spraying, folding, and respraying the phyllo sheet each time.\nBrush the top of last sheet with melted butter.\nBake in the preheated oven until phyllo sheets are crisp and browned and the casserole is hot, 45 to 55 minutes.\n",
        "picture_link": ".yf6tJinc72d3e.PgalJkHSlPFnw6bq"
    },
    {
        "title": "Tropiguac (Hawaiian-style Guacamole)",
        "ingredients": [
            "2 ripe avocados - peeled, halved and pitted ADVERTISEMENT",
            "1/4 whole fresh pineapple - peeled, cored, and diced ADVERTISEMENT",
            "1 mango - peeled, seeded and diced ADVERTISEMENT",
            "2 small tomatoes, diced ADVERTISEMENT",
            "1/4 red onion, diced ADVERTISEMENT",
            "1/3 cucumber, diced (optional) ADVERTISEMENT",
            "1 teaspoon chopped fresh cilantro, or to taste ADVERTISEMENT",
            "2 limes, juiced ADVERTISEMENT",
            "1 pinch garlic powder ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mash the avocados in a large bowl.\nMix in the pineapple, mango, tomatoes, red onion, cucumber, cilantro, lime juice, garlic powder, salt, and black pepper until well blended.\n",
        "picture_link": "qjIs2bJ6flB5yyP2kmpYHZ84ocgVsWO"
    },
    {
        "title": "Basic Creole Sauce",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 cups chopped celery ADVERTISEMENT",
            "2 cups chopped onion ADVERTISEMENT",
            "2 cups chopped green bell pepper ADVERTISEMENT",
            "2 cups chopped carrot ADVERTISEMENT",
            "6 cloves garlic, chopped ADVERTISEMENT",
            "4 (14.5 ounce) cans whole peeled tomatoes with liquid, chopped ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "2 tablespoons chicken bouillon granules ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "1 tablespoon red pepper flakes (optional) ADVERTISEMENT",
            "1 tablespoon smoked paprika (optional) ADVERTISEMENT",
            "1 pinch saffron (optional) ADVERTISEMENT",
            "1 pinch dried oregano, or to taste (optional) ADVERTISEMENT",
            "1 pinch dried basil, or to taste (optional) ADVERTISEMENT",
            "1 pinch dried thyme, or to taste (optional) ADVERTISEMENT",
            "1 orange, zested (optional) ADVERTISEMENT",
            "1 (8 ounce) bottle clam juice (optional) ADVERTISEMENT",
            "1 cup white wine (optional) ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "6 1-pint canning jars with lids and rings ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large pot over medium heat. Stir in celery, onion, green bell pepper, carrot, and garlic; cook and stir until the vegetables are tender, about 10 minutes.\nStir tomatoes with their juice, water, chicken bouillon cubes, and bay leaves into the vegetable mixture.\nStir in red pepper flakes, smoked paprika, saffron, oregano, basil, thyme, orange zest, clam juice, and white wine.\nBring the sauce to a boil, reduce heat to low, and simmer until the flavors have blended, at least 1 hour. Season to taste with salt and black pepper.\nAllow the sauce to cool completely.\nTo store, pour into pint glass canning jars, cover with lids and rings, and place into freezer. Sauce can be frozen up to 3 months before using.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Irish Whiskey Muffins",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "2 teaspoons Irish cream liqueur (such as Baileys®) ADVERTISEMENT",
            "2 teaspoons Irish whiskey ADVERTISEMENT",
            "7 fluid ounces milk, or as needed ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C).\nGrease 12 muffin cups.\nStir together flour, baking powder, salt, and sugar in a bowl.\nMix Irish cream liqueur and Irish whiskey in a 1-cup measure.\nPour milk into same measuring cup for a total of 8 fluid ounces.\nWhisk together egg, milk mixture, and butter in a bowl.\nGently stir liquid ingredients into dry ingredients until just moistened. Spoon batter into prepared muffin cups.\nBake in the preheated oven until a toothpick inserted in the center of a muffin comes out clean, about 20 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Raleys Irish Corned Beef Stew",
        "ingredients": [
            "1/3 cup all-purpose flour ADVERTISEMENT",
            "1 (3 pound) corned beef brisket (with spice packet), excess fat trimmed and meat cut into 1-inch cubes ADVERTISEMENT",
            "1/3 cup olive oil ADVERTISEMENT",
            "1 1/2 pounds red potatoes, peeled and cubed ADVERTISEMENT",
            "2 cups peeled and cubed parsnips ADVERTISEMENT",
            "2 cups peeled and cubed carrots ADVERTISEMENT",
            "1 extra large onion, cut into chunks ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "1 (12 fluid ounce) can or bottle Irish stout beer ADVERTISEMENT",
            "1 (10.5 ounce) can beef broth ADVERTISEMENT",
            "1 head cabbage, cored and coarsely chopped ADVERTISEMENT",
            "1/4 cup distilled white vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place flour into a large bowl; toss corned beef cubes in flour to coat.\nHeat olive oil in a large heavy pot or Dutch oven over medium heat and brown corned beef cubes on all sides, about 10 minutes.\nSprinkle the spice packet from the corned beef over the meat; mix in potatoes, parsnips, carrots, onion, water, stout beer, beef broth, and any unused flour; stir to combine. Bring to a boil.\nReduce heat to low and simmer until corned beef is very tender and the stew has thickened, 2 to 2 1/2 hours.\nMix cabbage into the stew and simmer until tender, about 15 minutes. Stir in vinegar.\n",
        "picture_link": "coU/wRRM3V6QzfmE.yptMiHzSxaerA."
    },
    {
        "title": "Braised Orange Chicken",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "4 bone-in chicken thighs ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes with juice ADVERTISEMENT",
            "2 cups orange juice (no pulp) ADVERTISEMENT",
            "1/4 cup brandy-based orange liqueur (such as Grand Marnier®) (optional) ADVERTISEMENT",
            "1 pinch salt and ground black pepper ADVERTISEMENT",
            "1/4 teaspoon red pepper flakes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a skillet over medium heat; cook chicken thighs in the hot oil until browned, about 5 minutes per side. Remove chicken thighs and set aside.\nCook and stir onion in the same skillet until softened, about 5 minutes.\nStir in garlic; cook and stir until fragrant, about 1 minute.\nStir in tomatoes, orange juice, orange liqueur, salt, black pepper, and red pepper flakes until thoroughly combined.\nReturn chicken thighs to the skillet, cover, and bring to a boil. Reduce heat to medium-low and simmer until chicken is tender and no longer pink inside, 25 to 30 minutes.\n",
        "picture_link": "PuD1uaG8z60m0nYsKw4kSHwKu.kaju."
    },
    {
        "title": "Fran's Angel Food Pie",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/4 cup cornstarch ADVERTISEMENT",
            "3 large egg whites ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 (9 inch) baked pie shell ADVERTISEMENT",
            "1 pint heavy cream, whipped ADVERTISEMENT",
            "1 teaspoon white sugar, or to taste ADVERTISEMENT",
            "1/2 teaspoon vanilla extract, or to taste ADVERTISEMENT",
            "1 tablespoon chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Partially fill the bottom of a double boiler with water, and bring the water to a boil. Pour 2 cups of water into the top of the double boiler with the salt. Place the top of the boiler onto the bottom. Whisk 1 cup of sugar with the cornstarch in a bowl until all lumps are gone, and whisk the mixture into the water until smooth. Cook, whisking constantly, until the mixture is thickened and translucent.\nIn a large bowl, beat the egg whites with an electric mixer until they form stiff peaks. Pour in the hot cornstarch mixture in a slow, steady stream, beating constantly, until the mixture is fluffy and forms peaks. Beat in 1 teaspoon of vanilla extract. Spread the filling into the baked pie shell in an even layer, and chill in refrigerator.\nWith an electric mixer, beat the cream with 1 teaspoon of sugar and 1/2 teaspoon of vanilla extract in a large metal bowl until the cream forms soft peaks; frost the pie with decorative swirls and peaks of the whipped cream. Sprinkle pie with chopped walnuts. Refrigerate until serving time.\n",
        "picture_link": "OjWxeetv04Su2ZBuws9PcVk855tuFPO"
    },
    {
        "title": "Bara Brith",
        "ingredients": [
            "1 cup hot brewed tea ADVERTISEMENT",
            "3/4 cup dried currants ADVERTISEMENT",
            "3/4 cup golden raisins ADVERTISEMENT",
            "3/4 cup demerara sugar ADVERTISEMENT",
            "1 1/4 cups self-rising flour ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour hot tea over currants and raisins in a bowl; soak 8 hours to overnight.\nPreheat oven to 350 degrees F (175 degrees C).\nGrease a sheet of parchment paper and use it to line a 2-pound loaf pan.\nStir demerara sugar into tea and fruit mixture until dissolved completely.\nMix flour and egg into the tea and fruit mixture until completely integrated into a batter.\nSpread batter evenly into the prepared bread pan.\nBake in preheated oven until golden-brown, about 40 minutes. Cool in the bread pan 5 minutes before transferring to a rack to cool completely.\n",
        "picture_link": "yJKX8nFhdeyVFDQqqdhs/UB7bvQNkV2"
    },
    {
        "title": "Kate's Chocolate Cake",
        "ingredients": [
            "1 (18.25 ounce) package devil's food cake mix ADVERTISEMENT",
            "1 (3.9 ounce) package instant chocolate pudding mix ADVERTISEMENT",
            "2 cups sour cream ADVERTISEMENT",
            "1 cup Melt® Organic Buttery Spread, melted ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "1 teaspoon almond extract ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat your oven to 350 degrees F (175 degrees C). Grease a 10-inch Bundt pan.\nIn a large bowl, stir together cake mix and pudding mix. Make a well in the center and pour in sour cream, melted Melt(R), eggs and almond extract. Beat on low speed until blended. Scrape bowl, and beat 4 minutes on medium speed. Blend in chocolate chips. Pour batter into prepared pan.\nBake for 50 to 55 minutes. Let cool in pan for 10 minutes, then turn out onto a wire rack and cool to room temperature.\n",
        "picture_link": "PbdCJqlTlu0Ls0j4OQYEfiPn9UVl3V6"
    },
    {
        "title": "Easy Buffalo Chicken Dip",
        "ingredients": [
            "1 (15 ounce) jar chunky-style blue cheese salad dressing (such as Marzetti®) ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "3 cooked chicken breasts, shredded ADVERTISEMENT",
            "1 (12 ounce) bottle Buffalo wings sauce (such as Frank's® Redhot®) ADVERTISEMENT",
            "1 (4 ounce) package blue cheese crumbles ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nStir blue cheese salad dressing and cream cheese together in a mixing bowl. Stir chicken, Buffalo wings sauce, and blue cheese crumbles into the salad dressing mixture; pour sauce into a baking dish.\nBake in preheated oven until bubbling, 15 to 20 minutes.\n",
        "picture_link": "GgZlyivhPR7Hjfb4YVZbwC3yjgCjwWW"
    },
    {
        "title": "Dad's Banana Nut Bread",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 very ripe bananas, mashed ADVERTISEMENT",
            "1 cup self-rising flour ADVERTISEMENT",
            "1/4 cup flax seed meal ADVERTISEMENT",
            "1/2 cup chopped walnuts (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 325 degrees F (165 degrees C). Grease a 9x5-inch loaf pan, or line a muffin pan with cupcake liners.\nIn a mixing bowl, beat the butter and sugar with an electric mixer until light and fluffy.\nBeat in the eggs one at a time, followed by the bananas.\nMix in the self-rising flour and flax seed meal until just incorporated; fold in the walnuts.\nPour batter into the prepared pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 20 minutes for muffins, or 1 hour for a loaf. Cool in the pan for 10 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "LnhKxH5TS4u4eNcVgd976LshRx78h8G"
    },
    {
        "title": "Danish Ebelskiver ",
        "ingredients": [
            "3 eggs, separated ADVERTISEMENT",
            "2 cups half-and-half cream ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 tablespoon melted butter, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat the egg yolks in a bowl; whisk the half-and-half, sugar, and salt with the egg yolks until thoroughly mixed.\nWhisk the flour, baking powder, baking soda, and cinnamon together in a separate bowl. Beat the flour mixture into the egg mixture just until smooth and most of the lumps are gone.\nWith an electric mixer, beat the egg whites in a bowl until they form stiff peaks. Gently fold the beaten egg whites into the batter.\nBrush melted butter into the round depressions of a cast-iron ebelskiver pan. Place the pan over medium-high heat. When the butter is very hot and smells slightly nutty, pour batter into each depression, filling the round shapes about half to three-quarters full. Allow the ebelskiver to cook until the bottoms are golden brown, 1 to 2 minutes. The inside batter will still be runny.\nUsing a toothpick or wooden skewer, gently push each ebelskiver at an edge to loosen from the pan. Insert the toothpick lightly into a top edge from the inside, and gently lift and rotate the pancake to turn it over. Turn them so the round bottoms are facing upward and the liquid batter in the center of a pancake runs into the bottom of the round depression. Cook until the other side of each pancake is browned, about 1 more minute.\nRemove the finished pancakes from the pan with the toothpick, transfer to a platter, and serve warm.\n",
        "picture_link": "ZwgnrOaxj2r/DoGWab5Rp2kzScvQPOG"
    },
    {
        "title": "Zesty Pickled Brussels Sprouts",
        "ingredients": [
            "2 pounds Brussels sprouts, trimmed and cut in half ADVERTISEMENT",
            "5 1-pint canning jars with lids and rings ADVERTISEMENT",
            "5 cloves garlic, divided ADVERTISEMENT",
            "1 1/4 teaspoons red pepper flakes, divided ADVERTISEMENT",
            "5 cups water ADVERTISEMENT",
            "5 cups distilled white vinegar ADVERTISEMENT",
            "7 tablespoons pickling salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Soak Brussels sprouts in a large bowl filled with lightly salted water for about 15 minutes. Drain well.\nSterilize the jars and lids in boiling water for at least 5 minutes.\nDivide the drained Brussels sprouts evenly between jars, filling the jars about 3/4-inch from the top.\nPlace 1 garlic clove and 1/4 teaspoon red pepper flakes in each jar.\nBring vinegar, water, and pickling salt to a boil in a large pot over medium-high heat until the salt is dissolved, about 5 minutes.\nPour the vinegar mixture into the jars, filling the jars to within 1/4 inch of the top.\nRun a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles.\nWipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings.\nPlace a rack in the bottom of a large stockpot, and fill stockpot halfway with water.\nBring to a boil over high heat, then carefully lower the jars into the pot using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary, until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for 10 minutes.\nRemove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool.\nOnce cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area, and wait at least 3 weeks before opening.\n",
        "picture_link": "EF9WfjDI6dbnCPKiEvSBOj3NxKoZpNK"
    },
    {
        "title": "White Chili VII",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "4 skinless, boneless chicken breasts, cut into bite-size pieces ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3 large stalks celery, chopped ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon ground oregano ADVERTISEMENT",
            "1/8 teaspoon cayenne pepper ADVERTISEMENT",
            "1/2 (4 ounce) can chopped jalapeno peppers ADVERTISEMENT",
            "1 (6 ounce) can chopped green chilies ADVERTISEMENT",
            "2 1/2 cups chicken stock ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "3 (14.5 ounce) cans great Northern beans ADVERTISEMENT",
            "12 ounces sour cream ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large skillet over medium heat. Cook the chicken in the hot oil until completely browned, 5 to 7 minutes.\nAdd the onion and celery to the skillet; cook and stir until the vegetables are slightly softened, 2 to 3 minutes.\nTransfer the chicken mixture to a slow cooker.\nMix in the garlic powder, cumin, bay leaf, salt, black pepper, oregano, cayenne pepper, jalapeno peppers, green chilies, chicken stock, water, and great Northern beans.\nCook on Low 8 to 10 hours, or on High 4 to 5 hours. Remove the bay leaf from the mixture. Stir the sour cream and heavy cream through the chili to serve.\n",
        "picture_link": "aueEHF5nGQ.LD0xHGtAqAUZKWBpf7tO"
    },
    {
        "title": "Bill's Famous Mai Tai",
        "ingredients": [
            "3/4 fluid ounce light rum ADVERTISEMENT",
            "3/4 fluid ounce amber rum ADVERTISEMENT",
            "3/4 fluid ounce orange Curacao liqueur ADVERTISEMENT",
            "3 fluid ounces pineapple juice ADVERTISEMENT",
            "2 fluid ounces sweet and sour mix ADVERTISEMENT",
            "3/4 fluid ounce dark rum ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large glass with ice; use a stir stick to mix in the light rum, amber rum, orange Curacao, pineapple juice, and sweet and sour mix.\nSlowly and gently drizzle the dark rum on top of the cocktail so it floats on top of the drink.\n",
        "picture_link": "MckNUDm50ba.4KOS1gHE958Xsg0bhBa"
    },
    {
        "title": "Gingerbread Cupcakes",
        "ingredients": [
            "1 (18.25 ounce) box vanilla cake mix ADVERTISEMENT",
            "1/2 cup buttermilk ADVERTISEMENT",
            "1/2 cup molasses ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "4 large eggs ADVERTISEMENT",
            "1 1/2 teaspoons ground ginger ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line 24 muffin cups with paper muffin liners.\nMix the cake mix, buttermilk, molasses, vegetable oil, eggs, ginger, cinnamon, and nutmeg together in large bowl until just combined. Spoon the batter into a large resealable plastic bag, press out excess air, and seal the top of the bag. Snip a corner of the bag about 1/4-inch from the bottom. Pipe the batter into the prepared muffin cups, filling them about 2/3 full.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 15 to 20 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "fkGCISMzxDgj0rfrX6sXkB4Kh3/JKym"
    },
    {
        "title": "Creamed Cucumbers",
        "ingredients": [
            "salt to taste ADVERTISEMENT",
            "3 cucumbers, peeled and thinly sliced ADVERTISEMENT",
            "1 (12 ounce) can evaporated milk ADVERTISEMENT",
            "2 tablespoons white vinegar ADVERTISEMENT",
            "ground black pepper, to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sprinkle salt over the cucumber slices in a large bowl, making sure all slices get some salt. Set aside until liquid drains from cucumber slices, 3 to 4 hours. Drain liquid. Squeeze cucumber slices with paper towel to express as much moisture from them as possible.\nMix evaporated milk and vinegar together in a glass bowl until thickened. Fold cucumber slices into the milk mixture; season with black pepper.\n",
        "picture_link": "4RzzwBH8yuUE.JYZJhj8QVDTCda9Wry"
    },
    {
        "title": "Chuckwagon Beans",
        "ingredients": [
            "1/2 pound bacon, cut into small pieces ADVERTISEMENT",
            "1 onion, cut into small pieces ADVERTISEMENT",
            "2 (15 ounce) cans kidney beans, rinsed and drained ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "1/2 teaspoon dry mustard ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 dash hot pepper sauce (such as Tabasco®) ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nHeat a large pot over medium-high heat. Cook and stir bacon and onion in pot until the onion is tender, 7 to 10 minutes; add ketchup, dry mustard, brown sugar, Worcestershire sauce, hot pepper sauce, salt, and black pepper.\nReduce heat to low and cook bean mixture at a simmer until hot, about 10 minutes; pour into a large casserole dish.\nBake in preheated oven until bubbling on top, 10 to 15 minutes.\n",
        "picture_link": "scdwa0x1R3r2a2BPKF9QUG2YqlTRTRi"
    },
    {
        "title": "Not Really Chicken Scampi",
        "ingredients": [
            "1 (16 ounce) package linguine ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 tablespoon olive oil, or as needed ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 portobello mushrooms, chopped, or to taste ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "1 teaspoon olive oil, or as needed ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves - thinly sliced and cut into cubes ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "1 (14 ounce) can diced tomatoes ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley, or to taste ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes ADVERTISEMENT",
            "1 lemon, halved ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil; cook the linguine at a boil until tender yet firm to the bite, about 11 minutes; drain.\nHeat butter and 1 tablespoon olive oil in a skillet over medium heat; cook and stir onion, mushrooms, and garlic in the hot oil-butter mixture until slightly softened, 2 to 3 minutes.\nHeat 1 teaspoon olive oil in a separate skillet; cook and stir chicken in the hot oil until no longer pink in the center, about 10 minutes. Transfer chicken to onion mixture.\nPour white wine into chicken-onion mixture; bring to a simmer. Add tomatoes, parsley, red pepper flakes, and linguine; mix well. Simmer until heated through, 3 to 5 minutes. Squeeze lemon halves over mixture; toss.\n",
        "picture_link": "AmznGlTS7pv1C6ld3.L.2Dc1CKU.req"
    },
    {
        "title": "Authentic Mexican Restaurant Style Salsa",
        "ingredients": [
            "1 (28 ounce) can crushed tomatoes ADVERTISEMENT",
            "10 slices pickled jalapeno peppers with juice, or to taste ADVERTISEMENT",
            "10 cilantro leaves ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend crushed tomatoes, jalapeno peppers with juice, cilantro leaves, salt, and garlic powder in a blender until smooth. Refrigerate 8 hours to overnight.\n",
        "picture_link": "f.51qTD8F1Dil/5E8uwyU/vH62oHlLm"
    },
    {
        "title": "Colorful Broccoli Salad",
        "ingredients": [
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon vinegar ADVERTISEMENT",
            "1/2 pound bacon, cut into 1-inch square pieces ADVERTISEMENT",
            "1 bunch broccoli, cut into florets ADVERTISEMENT",
            "1 red onion, chopped ADVERTISEMENT",
            "1 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk mayonnaise, sugar, and vinegar together in a bowl.\nPlace bacon in a large skillet; cook and stir over medium-high heat until evenly browned, about 10 minutes. Drain bacon on paper towels.\nMix broccoli, bacon, onion, and Cheddar cheese in a large bowl. Pour dressing over broccoli mixture; toss to coat.\n",
        "picture_link": "1cYWYGixB3HxUM3QFerCkJcd0ood8ra"
    },
    {
        "title": "Chayote Squash With Red Peppers and Ginger",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "2 chayotes, chopped ADVERTISEMENT",
            "1/2 teaspoon white sugar ADVERTISEMENT",
            "4 cloves garlic, chopped ADVERTISEMENT",
            "1 teaspoon red pepper flakes ADVERTISEMENT",
            "1 teaspoon chopped fresh ginger ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium heat, melt butter in the hot skillet, and stir chayotes, sugar, garlic, red pepper flakes, and ginger into butter. Cook, stirring frequently, until chayotes are tender, about 15 minutes; season with salt and black pepper.\n",
        "picture_link": "UrK4HT1jfh9yrkIafJ1wdvm5jSDIxtW"
    },
    {
        "title": "Blue Ribbon Apple Crumb Pie",
        "ingredients": [
            "Crust: ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "3 tablespoons milk ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 pinch ground cinnamon, or to taste ADVERTISEMENT",
            "6 Golden Delicious apples, peeled and sliced ADVERTISEMENT",
            "Crumb Topping: ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup packed dark brown sugar ADVERTISEMENT",
            "1/2 cup cold butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix 1 1/2 cups flour, vegetable oil, milk, 2 teaspoons sugar, and salt in a bowl until mixture pulls together; transfer and press into a 9-inch pie dish to form a crust.\nCombine 1/4 cup sugar and cinnamon in a large bowl; toss apples into cinnamon sugar to coat. Transfer apples to pie dish.\nStir 1 cup flour and brown sugar in a bowl. Cut in cold butter with a knife or pastry blender until the mixture resembles coarse crumbs. Sprinkle crumbs over apples.\nBake in preheated oven until golden and bubbly, about 45 minutes.\n",
        "picture_link": "tKG8uFSDs81ZOaft3jEyty6Ymv/pw5."
    },
    {
        "title": "Easy Apple Enchilada Dessert",
        "ingredients": [
            "2 (21 ounce) cans apple pie filling, coarsely chopped ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1 (8 ounce) package reduced-fat cream cheese ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "10 small flour tortillas ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "1/3 cup butter ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nMix apple pie filling, 1 teaspoon cinnamon, and nutmeg in a bowl.\nBeat cream cheese, confectioners' sugar, and 1/4 teaspoon cinnamon in a separate bowl until whipped and smooth. Stir apple pie filling mixture into cream cheese mixture.\nSpoon apple-cream cheese mixture into each tortilla; roll tortilla around filling. Arrange rolled tortillas, seam-side down, in a 9x13-inch baking dish.\nMix white sugar, brown sugar, water, butter, cornstarch, and vanilla extract in a saucepan; bring to a boil. Reduce heat and simmer, stirring constantly, until sugar is dissolved, about 3 minutes. Spread sauce over rolled tortillas.\nBake in the preheated oven on the top rack until enchiladas are bubbling, about 50 minutes.\n",
        "picture_link": "rwA8tPdmcWw6FNwuvdjG5L.XFQaq172"
    }
]