[
    {
        "title": "Chicken Baseballs",
        "ingredients": [
            "1 (3 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 teaspoon margarine ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "2 tablespoons chopped onion ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "2 cups cubed, cooked chicken ADVERTISEMENT",
            "1 (8 ounce) package refrigerated crescent rolls ADVERTISEMENT",
            "2 tablespoons bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nStir together the cream cheese, margarine, salt, pepper, milk, and onion together.\nFold the chicken into the cream cheese mixture.\nSeparate crescent rolls into 4 rectangles and smooth the perforations.\nSpoon 1/2 cup of the chicken mixture into the center of each rectangle.\nFold the corners over the chicken mixture and pinch along the edges to seal into a ball shape. Arrange on a baking sheet.\nSprinkle bread crumbs over the top of the newly formed 'baseballs.'\nBake in preheated oven until browned, about 20 minutes.\n",
        "picture_link": "anUspEmpEoEdmkFEFNr/lyxSBFGp09."
    },
    {
        "title": "Basil Chicken Ravioli Carbonara",
        "ingredients": [
            "1 (9 ounce) package refrigerated four-cheese-filled ravioli ADVERTISEMENT",
            "1 (14 ounce) package uncooked chicken breast pieces for stir-fry ADVERTISEMENT",
            "1 (9 ounce) pouch Progresso™ Recipe Starters™ creamy Parmesan basil cooking sauce ADVERTISEMENT",
            "1/4 cup half-and-half ADVERTISEMENT",
            "1/4 cup cooked real bacon pieces (from a jar or package) ADVERTISEMENT",
            "Garnishes, if Desired: ADVERTISEMENT",
            "Shredded Asiago or Parmesan cheese (optional) ADVERTISEMENT",
            "Chopped fresh basil leaves or parsley (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook and drain ravioli as directed on package.\nIn 10-inch skillet, heat 1 tablespoon vegetable oil over medium-high heat. Add chicken; cook 2 to 4 minutes, turning occasionally, until brown. Stir in cooking sauce, cooked ravioli and half-and-half; reduce heat. Simmer uncovered 3 to 5 minutes or until sauce is hot.\nSprinkle with bacon, cheese and basil.\n",
        "picture_link": "DIj7UwiSYbqRPttr538Igu75CU/lr2q"
    },
    {
        "title": "Chef John's Poached Eggs",
        "ingredients": [
            "1 teaspoon champagne vinegar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 eggs, as fresh as possible ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a bowl with ice water.\nFill a saucepan with cold water and place over medium heat; stir in vinegar and salt. Bring to a gentle, slow simmer and reduce heat to low.\nBreak each egg into a separate small ramekin; place a ramekin close to the surface of the water and gently pour egg into the simmering water. Let egg white set for a minute or two and use a silicone spatula to gently lift egg from the bottom of the pan to prevent sticking. Cook until white is firm and yolk is runny, about 6 minutes.\nLift poached egg from water using a slotted spoon and transfer gently to bowl of ice water to stop the cooking process. Reheat eggs for 1 1/2 to 2 minutes in very gently simmering water and remove with a slotted spoon. Tap bottom of slotted spoon containing egg on a dry paper towel to remove any excess water before serving.\n",
        "picture_link": "67qncHO.xq1sYiW9gzYTLcOw9DUsZ46"
    },
    {
        "title": "Comforting Chicken Noodle Soup",
        "ingredients": [
            "10 cups water ADVERTISEMENT",
            "1 leek, halved lengthwise ADVERTISEMENT",
            "1 carrot, halved ADVERTISEMENT",
            "1 (3 inch) piece fresh ginger, peeled ADVERTISEMENT",
            "1 teaspoon whole black peppercorns ADVERTISEMENT",
            "2 bone-in chicken breast halves, skin removed ADVERTISEMENT",
            "2 1/3 cups all-purpose flour ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1/3 cup milk, or as needed ADVERTISEMENT",
            "2 chicken bouillon cubes, crumbled ADVERTISEMENT",
            "3 tablespoons finely chopped fresh ginger ADVERTISEMENT",
            "3/4 cup peeled and sliced carrots ADVERTISEMENT",
            "1 cup sliced celery ADVERTISEMENT",
            "1/4 cup cornstarch ADVERTISEMENT",
            "1/4 cup cold water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour 10 cups of water into a large soup pot over high heat with the leek, halved carrot, 3-inch piece of ginger, and peppercorns.\nBring to a boil, turn heat to medium-low, and place chicken breasts into the broth\nCover the pot with a lid and simmer the mixture until the chicken is cooked through and tender, 20 to 30 minutes.\nWhile broth is simmering, whisk flour and salt together in a bowl; beat in the eggs, butter, and enough milk to make a stiff but workable dough.\nKnead the dough in the bowl until smooth and slightly springy, about 5 minutes; transfer to a bowl, cover with a cloth, and allow to rest for 10 minutes.\nRoll the noodle dough out on a floured surface to desired thickness (1/4- to 1/8-inch thick); cut into strips.\nRemove chicken breasts, transfer them to a plate, and allow to cool. When cool, remove the bones and shred the meat with a fork.\nStrain and retain the broth; discard spent leek, halved carrot, ginger chunk, and peppercorns.\nPlace strained broth into a large soup pot, bring to a boil, and reduce heat to medium-low. Stir in bouillon cubes, 3 tablespoons of chopped ginger, 3/4 cup sliced carrots, and celery until the bouillon has dissolved. Simmer until the carrots are tender, about 30 minutes.\nGently stir in the noodles, a few at a time. Return broth to a simmer and cook until the noodles are tender, about 10 minutes.\nWhisk cornstarch and 1/4 cup of water until smooth; stir half the mixture into the soup and simmer until thickened, about 3 minutes. If thicker soup is desired, stir in remaining cornstarch mixture. Mix in the chicken to serve.\n",
        "picture_link": "RyDgvmv83kZEkkywkxuN9IxblEKl1Wm"
    },
    {
        "title": "Raw Cucumber Soup (Gluten and Dairy-Free)",
        "ingredients": [
            "2 cups chopped cucumber ADVERTISEMENT",
            "1 cup chopped zucchini ADVERTISEMENT",
            "1 cup peeled and chopped avocado ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "2 cups lukewarm water ADVERTISEMENT",
            "1/2 large lemon, juiced ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend cucumber, zucchini, avocado, and garlic in a food processor or blender until very finely chopped, about 30 seconds.\nWhisk together water, lemon juice, olive oil, and salt in a bowl.\nTurn on the food processor and pour water mixture slowly through food processor's feed tube while processing cucumber mixture. Process until smooth, about 1 minute.\n",
        "picture_link": "Dn56dzzcPPFW2F9wC0G8H9r9mO1vZ.2"
    },
    {
        "title": "Easy Brazilian Lemonade",
        "ingredients": [
            "2 limes ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "3 tablespoons sweetened condensed milk ADVERTISEMENT",
            "1 cup ice cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Wash limes thoroughly. Cut ends off and discard, then slice into about 8 pieces.\nPlace limes, water, sugar, and sweetened condensed milk in a blender. Pulse 5 times. Strain mixture through a sieve into a large pitcher. Serve over ice.\n",
        "picture_link": "jS3qleg7w6AiCgZ6duSWS1T184rUVGi"
    },
    {
        "title": "Apple Squash Soup",
        "ingredients": [
            "1 acorn squash, halved and seeded ADVERTISEMENT",
            "1 (13.75 ounce) can low-sodium chicken broth, divided ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 large onion, sliced ADVERTISEMENT",
            "2 apples - peeled, cored, and sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut each squash half into 3 wedges. Arrange in the bottom of a large stockpot with the skin side facing up. Pour 1 cup of the chicken broth over the squash. Bring the broth to a boil, reduce heat to medium-low, place a cover on the stockpot, and cook until the squash is tender, 20 to 30 minutes. Set the squash aside to cool and reserve the liquid. Reserve remaining chicken broth for later.\nMelt the butter in a large skillet over medium heat. Cook the onion in the melted butter until softened, about 5 minutes; add the apples and continue cooking and stirring until the apples are tender, 15 to 20 minutes.\nScoop the flesh of the cooled squash into the pitcher of a blender. Pour the reserved cooking liquid over the squash. Blend the squash until smooth. Add the onion and apple mixture and the remaining chicken broth; blend again until smooth.\nPour the blended soup back into the stockpot, and place over medium heat until warmed through.\n",
        "picture_link": "iquM31HqjB2Q5xLGOJyHEh0dGesTqfu"
    },
    {
        "title": "Simple Creme Brulee Dessert",
        "ingredients": [
            "3 tablespoons white sugar ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "3 egg yolks ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "2 tablespoons white sugar, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nWhisk 3 tablespoons sugar and cream in a microwave-safe bowl until well combined; heat the mixture in microwave until warm, 1 to 2 minutes, and whisk again to dissolve sugar. Whisk in egg yolks and vanilla extract until smooth.\nPour cream mixture into 2 ramekins. Set ramekins into a roasting pan and pour in enough hot water to reach halfway up the sides of the ramekins.\nBake in the preheated oven until creme desserts are set but still slightly jiggly when shaken, about 50 minutes. Remove ramekins from hot water and chill in refrigerator until cold, at least 2 hours.\nSprinkle 1 tablespoon of sugar evenly over the top of each dessert. Use a kitchen torch to lightly toast and melt the sugar topping until brown and bubbly, about 30 seconds. Let the sugar topping cool before serving. To serve, use a spoon to crack the crisp sugar open to reveal the creamy dessert underneath.\n",
        "picture_link": "..5bSTCWey/Myd0GwTl3VZ9hLTrhkQa"
    },
    {
        "title": "Andouille Sausage and Corn Chowder",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 cup coarsely chopped onion ADVERTISEMENT",
            "1/2 cup diced celery ADVERTISEMENT",
            "3/4 cup chopped green bell pepper ADVERTISEMENT",
            "3/4 cup chopped red bell pepper ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "1 pound andouille sausage, diced ADVERTISEMENT",
            "3 cups frozen corn kernels, thawed ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "2 teaspoons dried thyme ADVERTISEMENT",
            "6 cups low-sodium chicken broth ADVERTISEMENT",
            "3 Yukon Gold potatoes, cut into 1/2-inch cubes ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 cup chopped cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large pot over medium-high heat. Cook and stir onion, celery, green bell pepper, and red bell pepper in the hot oil until softened, about 5 minutes.\nStir garlic, cayenne pepper, and diced andouille sausage into the onion mixture; continue to cook and stir until the sausage is hot, 1 to 2 minutes more.\nFold corn kernels and bay leaves into the sausage mixture; season with thyme. Allow the mixture to simmer until the corn is warmed, about 1 minute.\nPour chicken broth into the pot; bring the mixture to a boil, reduce heat to medium-low, and cook at a simmer, stirring occasionally, about 30 minutes.\nStir potatoes and heavy cream to the pot, place a cover on the pot, and continue cooking at a simmer until the potatoes are tender, about 20 minutes.\nSeason the chowder with salt and black pepper.\nRemove and discard the bay leaves.\nGarnish with cilantro to serve.\n",
        "picture_link": "dCswnRyE062TIknqp8qCMeAHosF1va6"
    },
    {
        "title": "2-Ingredient Peanut Butter Fudge",
        "ingredients": [
            "1 pound white confectioners' coating (white almond bark), broken up ADVERTISEMENT",
            "1 (18 ounce) jar peanut butter (such as Jif®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line an 8x8-inch baking dish with plastic wrap long enough to overhang the dish by several inches on each side.\nPlace broken coating into a large glass microwave-safe bowl and melt on low power in microwave oven, about 5 minutes, stirring after every 30 seconds to 1 minute. When coating is smooth and creamy, stir peanut butter into coating until fudge is thoroughly combined. Spread fudge into the prepared baking dish.\nRefrigerate fudge until set, 1 to 2 hours. Lift fudge out of the pan using the plastic wrap for handles and slice into squares with a pizza cutter.\n",
        "picture_link": "QKs.f3LMt2OM3TSAUaduK5LxlfTsyHK"
    },
    {
        "title": "Oklahoma Indian Tacos",
        "ingredients": [
            "2 pounds ground beef ADVERTISEMENT",
            "1/4 onion, chopped ADVERTISEMENT",
            "1/2 (1.25 ounce) package spicy chili seasoning mix ADVERTISEMENT",
            "1 (15 ounce) can ranch-style beans ADVERTISEMENT",
            "1 (10 ounce) can diced tomatoes with green chile peppers ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "2 cups self-rising flour ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "2 cups vegetable oil for frying, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 200 degrees F (95 degrees C).\nCook and stir ground beef in a large skillet over medium heat with onion until the meat is brown and crumbly, about 10 minutes; drain excess grease. Stir in chili seasoning mix, ranch-style beans, and diced tomatoes with green chilies. Bring the mixture to a boil, reduce heat to low, and simmer until the ground beef mixture is thick, about 10 minutes; let simmer while you finish remaining steps.\nMix self-rising flour with buttermilk in a bowl (dough will be very sticky). Scoop up about 1/4 cup of dough and gently pat into a 5-inch circle on a well-floured work surface.\nHeat vegetable oil in a heavy skillet until a deep-frying thermometer placed in the center of the oil, not touching the bottom, reads 400 degrees F (205 degrees C). Gently place a dough circles into the hot oil and fry until golden brown on both sides, turning once, about 3 minutes per side. Fry bread will expand in size as it cooks. Drain the fried bread pieces on paper towels and place on baking sheets. Transfer to the oven to keep warm while you finish frying the bread.\nTop fried bread with ground beef mixture to serve.\n",
        "picture_link": "4Ctmy7BH8esvBwKTY2BP6HMZ3MlM2PG"
    },
    {
        "title": "Chicken and Feta Burgers",
        "ingredients": [
            "1 1/2 pounds ground chicken ADVERTISEMENT",
            "3 tablespoons chopped fresh oregano ADVERTISEMENT",
            "1 tablespoon Kalamata-olive tapenade ADVERTISEMENT",
            "2 ounces crumbled feta cheese ADVERTISEMENT",
            "1 1/2 tablespoons crushed garlic ADVERTISEMENT",
            "1/4 teaspoon kosher salt ADVERTISEMENT",
            "1/8 tablespoon coarse-ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix chicken, oregano, tapenade, feta cheese, and garlic together in a bowl; form into 4 patties. Season burgers with salt and pepper.\nPreheat an outdoor grill for high heat and lightly oil the grate with olive oil.\nCook patties until charred on bottom, about 5 minutes. Flip the burgers and finish cooking, refraining from flattening with your spatula until no longer pink in the middle, about 5 minutes more. Drain on a plate lined with paper towels before serving.\n",
        "picture_link": ".JepvpS8VhjQixzxYNHx1V9hu8AE2JC"
    },
    {
        "title": "Ice Cream Sandwich Dessert",
        "ingredients": [
            "22 ice cream sandwiches ADVERTISEMENT",
            "1 (16 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "1 (12 ounce) jar caramel ice cream topping ADVERTISEMENT",
            "1 1/2 cups salted peanuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut one ice cream sandwich in half. Place one whole and one half sandwich along a short side of a high-sided 9x13-inch casserole dish. Repeat until bottom is covered, alternating the whole and half sandwiches. Spread with half of the whipped topping. Pour caramel on top. Sprinkle with half of the peanuts. Repeat layers with remaining ice cream sandwiches, whipped topping, and peanuts. The pan will be full. Cover and freeze for up to 2 months. Remove from freezer 20 minutes before serving. Cut into squares.\n",
        "picture_link": "aa1oxO.eryutVgP.9mksloM3TbOpime"
    },
    {
        "title": "Chinese Restaurant Style Hot Mustard",
        "ingredients": [
            "1/4 cup dry mustard ADVERTISEMENT",
            "3 tablespoons cold water ADVERTISEMENT",
            "1/8 teaspoon ground white pepper (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk mustard, water, and white pepper together in a bowl.\n",
        "picture_link": "/SahcmqaIfaN6io76lNHie13WcYcs8G"
    },
    {
        "title": "Mema's Corn Fritters",
        "ingredients": [
            "5 tablespoons biscuit baking mix (such as Bisquick®) ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "2/3 cup shredded Parmesan cheese ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 cups whole kernel corn, drained ADVERTISEMENT",
            "2 tablespoons finely chopped onion ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk baking mix with salt, black pepper, and Parmesan cheese in a small bowl. Beat eggs in a separate bowl and stir in corn and onion. Lightly stir biscuit mix-cheese mixture into corn mixture just until moistened; do not overmix.\nMelt butter with vegetable oil in a large skillet over medium heat. Drop batter into hot skillet with a tablespoon and flatten fritters slightly with spoon. Cook fritters until browned on both sides, about 3 minutes per side, and drain on paper towels.\n",
        "picture_link": "u5mtJqGZxLmBh5quGQVTPy77e3AUxyC"
    },
    {
        "title": "Green Gazpacho",
        "ingredients": [
            "2 cups diced honeydew melon ADVERTISEMENT",
            "1 English (seedless) cucumber, peeled and diced ADVERTISEMENT",
            "1 small onion, diced ADVERTISEMENT",
            "1 avocado - peeled, pitted, and chopped ADVERTISEMENT",
            "1 jalapeno pepper, seeded and coarsely chopped ADVERTISEMENT",
            "1 clove garlic, chopped ADVERTISEMENT",
            "1/4 cup white balsamic vinegar ADVERTISEMENT",
            "1 tablespoon lime juice ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend honeydew melon, cucumber, onion, avocado, jalapeno pepper, garlic, white balsamic vinegar, lime juice, salt, and black pepper in a blender until smooth. Adjust seasonings if desired and chill before serving.\n",
        "picture_link": "ix4dM5DCN5tZRHQPtVRURDL1mHoYvXy"
    },
    {
        "title": "Taco Pasta Salad",
        "ingredients": [
            "2 cups spiral pasta ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 (1.25 ounce) package taco seasoning ADVERTISEMENT",
            "3 cups shredded lettuce ADVERTISEMENT",
            "2 cups halved cherry tomatoes ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1/2 cup French salad dressing ADVERTISEMENT",
            "1 (7 ounce) bag corn chips ADVERTISEMENT",
            "2 tablespoons sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook spiral pasta at a boil, stirring occasionally, until cooked through yet firm to the bite, about 12 minutes; drain.\nHeat a large skillet over medium-high heat and stir in ground beef. Cook and stir until beef is crumbly, evenly browned, and no longer pink, about 10 minutes. Drain and discard any excess grease. Stir taco seasoning into beef mixture; cool.\nStir beef mixture into pasta; toss lettuce, tomatoes, Cheddar cheese, onion, French dressing, and corn chips into pasta mixture. Top with sour cream.\n",
        "picture_link": "Edf0zM4.HAAdABrSr7AFJKST6cwB062"
    },
    {
        "title": "Grilled Chicken Spiedies",
        "ingredients": [
            "3/4 cup white wine vinegar ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "1/4 cup freshly squeezed lemon juice ADVERTISEMENT",
            "1/2 cup fresh mint leaves ADVERTISEMENT",
            "6 cloves garlic ADVERTISEMENT",
            "4 teaspoons white sugar ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper ADVERTISEMENT",
            "3 pounds boneless skinless chicken thighs, cut into 3 pieces ADVERTISEMENT",
            "6 skewers ADVERTISEMENT",
            "6 Italian-style hoagie buns ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine vinegar, olive oil, lemon juice, mint, garlic, sugar, oregano, basil, salt, red pepper flakes, and black pepper in a blender. Puree until liquefied, about 30 seconds.\nPlace chicken thighs in a large resealable plastic bag, pour in marinade and massage to coat. Squeeze out excess air and seal the bag. Marinate in the refrigerator for 24 hours, turning occasionally.\nPreheat an outdoor grill for high heat and lightly oil the grate.\nRemove chicken and place on the skewers. Season with salt. Pour the marinade into a small saucepan. Bring to a simmer and cook until reduced slightly, about 2 minutes.\nPlace skewers on the preheated grill and cook for 5 to 6 minutes, turn and cook until the chicken is no longer pink in the center and the juices run clear, 5 to 6 more minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Remove from grill and rest the meat for a few minutes.\nToast hoagie rolls and spread each with some of the reserved marinade. Place a skewer on each roll and carefully remove the skewer, leaving the chicken in the bun.\n",
        "picture_link": "Fm/D4m/7F5LIImCr703scReVBqdNLWe"
    },
    {
        "title": "Savory Zucchini Chard Muffins",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "5 slices bacon, diced ADVERTISEMENT",
            "3/4 cup diced onion ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "8 chard leaves, stems removed and leaves thinly sliced ADVERTISEMENT",
            "2 cups shredded zucchini ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "3/4 cup finely shredded Swiss cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Generously spray 12 muffin cups with cooking spray.\nMelt butter in a skillet over medium heat; add bacon. Cook gently until bacon begins to curl, 3 to 5 minutes. Add onion, garlic, and chard leaves; cook and stir until chard has wilted, stirring occasionally, 5 to 8 minutes.\nTransfer chard mixture to a large bowl; stir in zucchini, eggs, salt, and black pepper. Add flour and baking powder; mix until flour is evenly distributed and moistened. Stir in Swiss cheese. Spoon batter into prepared muffin tin.\nBake in the preheated oven until edges of muffin turn golden brown, about 20 minutes.\n",
        "picture_link": "j8c2cxKC7E8PfXPICyWAe4cseeqToTa"
    },
    {
        "title": "Fat Granny's Minestrone Soup",
        "ingredients": [
            "1 teaspoon Italian seasoning ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon celery seed ADVERTISEMENT",
            "1 teaspoon dried parsley ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1/2 cup elbow macaroni ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 large carrot, diced ADVERTISEMENT",
            "2 stalks celery, diced ADVERTISEMENT",
            "1 large onion, diced ADVERTISEMENT",
            "1 tablespoon finely chopped garlic ADVERTISEMENT",
            "1 green bell pepper, diced ADVERTISEMENT",
            "1 red bell pepper, diced ADVERTISEMENT",
            "1 small zucchini, diced ADVERTISEMENT",
            "1 (28 ounce) can diced San Marzano tomatoes with juice ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "1 (15.5 ounce) can three bean salad, drained and rinsed ADVERTISEMENT",
            "1 1/2 (10 ounce) packages frozen French-cut green beans ADVERTISEMENT",
            "6 cups chicken stock ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine Italian seasoning, onion powder, garlic powder, celery seed, parsley, thyme, basil, oregano, salt, black pepper, and bay leaf in a small bowl.\nBring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until cooked through but firm to the bite, 8 minutes. Drain.\nHeat olive oil and butter together in a large saucepan over medium-high heat; cook and stir carrot, celery, and onion until heated through, 2 to 3 minutes. Add garlic, green bell pepper, red bell pepper, zucchini, and Italian seasoning mixture; stir to combine.\nStir tomatoes and their juice, tomato sauce, three bean salad, green beans, and chicken stock into seasoned vegetable mixture. Bring to a boil, reduce heat, and simmer, stirring occasionally, until flavors are blended, about 30 minutes. Stir in elbow macaroni before serving.\n",
        "picture_link": "vQ/BogCyQ0.5nvesFqmn1hIqWoAcUHC"
    },
    {
        "title": "Oreo® Vanilla Milkshake",
        "ingredients": [
            "2 scoops vanilla ice cream ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 teaspoon pure vanilla extract ADVERTISEMENT",
            "4 chocolate sandwich cookies (such as Oreo®) ADVERTISEMENT",
            "1/4 cup whipped cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend ice cream, milk, vanilla extract, and chocolate sandwich cookies in a blender until smooth. Pour into 2 glasses and top with whipped cream.\n",
        "picture_link": "tNR74vgOTLy4DHGCA3oRD04tt7byZM2"
    },
    {
        "title": "Rice Cooker Rice Pudding",
        "ingredients": [
            "5 1/2 cups skim milk ADVERTISEMENT",
            "2 cups short-grain white rice ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "2 1/2 cups skim milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place 5 1/2 cups skim milk, rice, sugar, and cinnamon in a rice cooker; stir to combine. Cover and cook for one cycle in rice cooker until rice is tender and creamy, 20 minutes. Stir in the remaining 2 1/2 cup milk. Allow to cool before serving.\n",
        "picture_link": "SGbL8pbxT9uwjl/QYz6Z8/i/gfFtPJK"
    },
    {
        "title": "Herbs de Provence",
        "ingredients": [
            "2 tablespoons dried rosemary ADVERTISEMENT",
            "1 tablespoon fennel seed ADVERTISEMENT",
            "2 tablespoons dried savory ADVERTISEMENT",
            "2 tablespoons dried thyme ADVERTISEMENT",
            "2 tablespoons dried basil ADVERTISEMENT",
            "2 tablespoons dried marjoram ADVERTISEMENT",
            "2 tablespoons dried lavender flowers ADVERTISEMENT",
            "2 tablespoons dried Italian parsley ADVERTISEMENT",
            "1 tablespoon dried oregano ADVERTISEMENT",
            "1 tablespoon dried tarragon ADVERTISEMENT",
            "1 teaspoon bay powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grind rosemary and fennel seed in a spice grinder; transfer to a mixing bowl. Stir savory, thyme, basil, marjoram, lavender, parsley, oregano, tarragon, and bay powder with the rosemary and fennel. Store in an air-tight container between uses.\n",
        "picture_link": "CJvVflYSQdzMhWt7WwUmdnziJH7YTo."
    },
    {
        "title": "Sweet Slow Cooker Ham",
        "ingredients": [
            "1 (16 ounce) package light brown sugar, divided ADVERTISEMENT",
            "1 (6 to 7 pound) bone-in picnic ham, rinsed ADVERTISEMENT",
            "1 (20 ounce) can crushed pineapple ADVERTISEMENT",
            "3/4 cup chai tea latte concentrate (such as Tazo®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread about 3/4 of the brown sugar into the bottom of the crock of your slow cooker to cover completely. Place ham atop the brown sugar with the flat side facing down. Pour pineapple over the ham. Rub remaining brown sugar over the ham. Pour chai tea latte concentrate over the ham.\nPlace cover on the slow cooker and cook on Low until an instant-read thermometer inserted into the center of the ham reads at least 160 degrees F (70 degrees C), about 5 1/2 hours. Baste ham once or twice with juices while cooking.\n",
        "picture_link": "06b3PE6Wk6XgkkeNRVeSBQKmjzn/wIC"
    },
    {
        "title": "Cajun Potato Wedges",
        "ingredients": [
            "4 baking potatoes ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 teaspoon minced fresh garlic ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 1/2 teaspoons onion powder ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Grease a baking sheet.\nCut each potato into 12 wedges; place in a large bowl. Toss potatoes with olive oil, garlic, salt, pepper, onion powder, and paprika. Arrange in a single layer on prepared baking sheet.\nBake in preheated oven for 20 minutes. Turn potatoes over and continue baking until golden and crisp, 25 to 30 minutes longer.\n",
        "picture_link": "3u6zrMsuoE6KEwGpFHBG04wywRBQsVq"
    },
    {
        "title": "Deep Fried Corn Meal Sticks (Sorullitos de Maiz) with Dipping Sauce",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "3 tablespoons white sugar, or more to taste ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups cornmeal, or as needed ADVERTISEMENT",
            "3 cups vegetable oil for frying ADVERTISEMENT",
            "vegetable oil ADVERTISEMENT",
            "1/2 cup mayonnaise, or to taste ADVERTISEMENT",
            "1/4 cup ketchup ADVERTISEMENT",
            "1 pinch garlic salt, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water to a boil in a saucepan and stir in sugar, butter, and salt until sugar has dissolved. Turn heat to low and whisk in 1 cup of cornmeal until smooth. Stir in remaining 1/2 cup cornmeal to make a very thick, workable dough.\nHeat 3 cups vegetable oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C). Grease your hands well with 2 teaspoons of oil and scoop about 3 tablespoons of cornmeal dough; roll the dough into a ball, then shape into a 3-inch long stick about 1/2 inch wide. Repeat with remaining dough, oiling your hands as needed. Deep-fry the cornmeal sticks until golden brown, working in batches of 3 or 4 at a time. Drain fried cornmeal sticks on paper towels and keep warm.\nMix mayonnaise, ketchup, and garlic salt in a bowl until well combined; serve cornmeal sticks with the sauce for dipping.\n",
        "picture_link": "o/oxiD0UzqOdgLTFqRza4sJALKNVDHe"
    },
    {
        "title": "Easy Microwave Maple Fudge",
        "ingredients": [
            "1 (16 ounce) package confectioners' sugar ADVERTISEMENT",
            "3 tablespoons milk ADVERTISEMENT",
            "1 tablespoon maple extract ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "3/4 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line a baking dish with plastic wrap.\nSift the confectioners' sugar into a large, microwave-safe bowl. Add the milk, maple extract, and butter to the bowl, but do not stir.\nHeat in microwave on full power for 3 minutes.\nStir the walnuts into the fudge mixture until the fudge begins to thicken; pour into the lined baking dish. Smooth the top of the fudge with a spatula. Refrigerate until firm, about 15 minutes. Remove the fudge from the pan using the plastic wrap as a handle. Cut into small squares and store in an airtight container.\n",
        "picture_link": "UWV9c2Cw9ffrxzfHA.PyqOERTnABkku"
    },
    {
        "title": "Chipotle Blue Cheese Dip",
        "ingredients": [
            "1 (7 ounce) can chipotle peppers in adobo sauce ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1 1/2 cups chunky blue cheese dressing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Puree the chipotle peppers with the adobo sauce in a blender until smooth. Add the mayonnaise, milk, and dressing; blend again until thoroughly mixed.\n",
        "picture_link": "cSm0PfJo4xMMNQUF4GxVPTJrBnsOdgq"
    },
    {
        "title": "Fried Pumpkin",
        "ingredients": [
            "1 small sugar pumpkin ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut pumpkin in half, remove seeds, pith and outer skin. Cut into 2x3 inch pieces.\nPlace 1/2 of pumpkin (2 to 3 pounds) in large bowl and season with salt and pepper. Add flour and stir to evenly coat.\nMelt butter in a large deep skillet over medium heat. Add pumpkin and cook, turning often until golden brown and tender.\n",
        "picture_link": "CLMpTrseoIwKfvevBN3F3p7MEc76lmy"
    },
    {
        "title": "Mexican Vegetable Rice",
        "ingredients": [
            "2 tablespoons canola oil ADVERTISEMENT",
            "1 cup diced onion ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "1 1/2 cups white rice ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "3/4 teaspoon cayenne pepper ADVERTISEMENT",
            "3 cups vegetable stock ADVERTISEMENT",
            "1 (10 ounce) package frozen mixed peas and carrots, thawed ADVERTISEMENT",
            "1 1/2 cups tomatoes, deseeded and diced ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "2 green onions, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saute pan, saute onion, garlic, and rice in canola oil until onion is soft and rice is opaque. Add salt, cayenne pepper, and vegetable stock to the pan. Bring the liquid to a boil. Cover the pan and reduce heat to low, simmer for 20 minutes or until all of the liquid is absorbed.\nAdd vegetables and tomatoes. Cover pan and allow to sit for 5 minutes. Turn off heat. Sprinkle top of rice with parsley and green onions.\n",
        "picture_link": "HtBX6oXVNHIOiQLAi8GthmGGOV4BiOS"
    },
    {
        "title": "No Bake Chocolate Cookies I",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1/2 cup evaporated milk ADVERTISEMENT",
            "5 teaspoons unsweetened cocoa powder ADVERTISEMENT",
            "1 cup flaked coconut ADVERTISEMENT",
            "3 cups rolled oats ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix oatmeal and coconut together in a large bowl.\nPut other ingredients in a saucepan over medium heat, stirring constantly. When mixture comes to a boil, let it boil for 2 minutes.(any longer your cookies will be crumbly, any shorter, your cookies will be gooey)\nRemove from heat and pour over the oatmeal-coconut mixture. Working quickly now, mix well and drop by spoon onto waxed paper. Let sit until firm and cool. Excellent for freezing.\n",
        "picture_link": "IULpaz5Bx0ODmZSi2E5zls0oEpnapiq"
    },
    {
        "title": "Nougat Cookies",
        "ingredients": [
            "1/2 cup white sugar ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 teaspoons water ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Butter a small cake pan.\nTo prepare Nougat: In a frying pan place 1/2 cup of sugar over medium heat and stir. Sugar will turn into liquid caramel. When syrup becomes dark brown, pour into cake pan and let harden.\nCrush nougat in a mortar or between waxed paper with a hammer into small pieces.\nPreheat oven to 375 degrees F (175 degrees C). In a medium bowl, cream the butter and sugar until light and fluffy. Separate the egg and add the yolk and water. Blend thoroughly. Stir in 1/2 cup of sifted flour and the nougat. Mix well. Sift in the rest of the flour.\nKnead the dough lightly on a board. Roll the dough into a 1-inch in diameter log. Slice into 1/2-inch thick cookies. Place on greased cookie sheets 3 inches apart and press down with a fork.\nBake 10 to 12 minutes.\n",
        "picture_link": "7Lmm9trevk5yAkJ1KskisghgK.93cRS"
    },
    {
        "title": "Pork Pie",
        "ingredients": [
            "2 (9 inch) unbaked pie shells ADVERTISEMENT",
            "2 pounds lean ground pork ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "1 1/2 cups mashed potatoes ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Brown ground beef and ground pork over medium heat until thoroughly cooked. Drain off grease.\nMix together cooked meat, potatoes, salt, pepper, and nutmeg.\nLine a 9 inch pie dish with pastry. Spoon pork mixture into pie crust, and top with second pie crust. Brush top crust with egg white. Shield crust edges with aluminum foil to prevent burning.\nBake at 375 degrees F (190 degrees C) for 45 minutes. Remove foil for final 15 minutes of baking to brown edges.\n",
        "picture_link": "bAbZH4Fx7mBFWeV9LIKKftNMyLXrsn."
    },
    {
        "title": "Pineapple Casserole I",
        "ingredients": [
            "1/2 cup white sugar ADVERTISEMENT",
            "2 teaspoons all-purpose flour ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "1 (20 ounce) can crushed pineapple with juice ADVERTISEMENT",
            "3 slices white bread, cut into cubes ADVERTISEMENT",
            "6 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 1 quart baking dish.\nIn a small bowl, mix together the sugar, flour and salt.\nAdd eggs, pineapple and juice. Mix well.\nPour into baking dish, top with bread cubes and dot with butter. Bake for 45 minutes or until top is golden brown.\n",
        "picture_link": "E1eQX.veMma.ASfxRy/4Mbw4w/hBNRe"
    },
    {
        "title": "Cranberry Pudding",
        "ingredients": [
            "2 cups cranberries ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/3 cup boiling water ADVERTISEMENT",
            "1/2 cup molasses ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/2 cup heavy whipping cream ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Lightly grease a 2-quart metal pudding mold or a clean 1-pound coffee can. Pick over whole cranberries; wash and drain.\nSift together the flour and salt; dredge cranberries in flour mixture.\nDissolve soda into boiling water and add molasses. Stir and allow to foam up.\nAdd to the flour and cranberry mixture. Mix together until well blended. Spoon into prepared mold or pan; cover with a double layer of aluminum foil and fasten with heavy elastic band or string.\nPlace into a deep saucepan and fill with water up to about the halfway mark on the pudding can. Cover saucepan and place over high heat. Bring water to boil, reduce heat, and simmer for 1 hour. Remove from water and allow to cool.\nPrepare the sauce by mixing together the sugar, butter and cream. Cook over medium heat until thick, stirring constantly. Remove from heat and add vanilla.\nWhen ready to serve the pudding, invert pan or open bottom of can and push through. Slice in 1/2-inch pieces. Pour sauce over individual slices of pudding.\n",
        "picture_link": "xu8ZxphvM2Te.UFNR/q9PDrcAQ09iq6"
    },
    {
        "title": "Potato Dumplings",
        "ingredients": [
            "6 cups baked potatoes -- peeled, cooled and riced ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "3 slices square sandwich bread ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "The day before, boil potatoes with the skins on until tender. Cook enough to make at least 6 cups cold riced potatoes. Peel the potatoes, and rice them. Refrigerate them until needed.\nBrown 2 to 3 pieces of bread in butter or margarine for croutons. Cut into small pieces, and let cool.\nCombine riced potatoes, 5 or 6 beaten eggs, salt, and flour. Add croutons, and mix together. The mixture should stick together. Too much flour will make them heavy.\nForm into balls about the size of tennis balls. Drop into boiling water in a large pot. Cover and cook for 10 minutes. Serve immediately.\n",
        "picture_link": "J7GUVbV0qzTia4QHkWFbLgk3FVlr48S"
    },
    {
        "title": "Carrot Cookies III",
        "ingredients": [
            "3/4 cup white sugar ADVERTISEMENT",
            "3/4 cup shortening ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup mashed cooked carrots, cooled ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "2 tablespoons orange juice ADVERTISEMENT",
            "1 tablespoon orange zest ADVERTISEMENT",
            "1/3 cup confectioners' sugar for decoration ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCream together the sugar, shortening and the egg.\nAdd cooked cooled mashed carrots, flour, baking powder, salt and vanilla. Mix well.\nDrop on greased cookie sheet and bake for 15 minutes.\nTo Make Frosting: Combine orange juice with the grated rind of one orange. Add enough confectioners' sugar to thicken. Put on cookies while hot.\n",
        "picture_link": "LA5XuBIZahF5e5s8ma0C/onLuY9lAqi"
    },
    {
        "title": "Easy Soda Cracker Bars",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1 cup crushed saltine crackers ADVERTISEMENT",
            "1 cup flaked coconut ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "1 cup chopped walnuts (optional) ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (180 degrees C).\nMelt the margarine and add soda crackers; spread in a 13 x 9 inch cake pan.\nSprinkle coconut, chocolate chips and nuts evenly over soda cracker mixture. Pour milk over nuts and bake for 20 minutes.\n",
        "picture_link": "yNvBRnGOsu9lJvQGBMuLJckWi0woPPu"
    },
    {
        "title": "Crab Bisque",
        "ingredients": [
            "1 (10.75 ounce) can condensed tomato soup ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "15 fluid ounces milk ADVERTISEMENT",
            "1 (12 ounce) package imitation crabmeat, diced ADVERTISEMENT",
            "1 bunch green onions, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan, combine tomato soup, mushroom soup, milk and crab meat. Cook over medium heat stirring frequently. When hot, ladle into soup bowls and sprinkle with green onions.\n",
        "picture_link": "dDTHmfQN5MNpJLOMTVEuRAD0huVq5va"
    },
    {
        "title": "Arny Cookies",
        "ingredients": [
            "2 cups shortening ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "4 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 pound confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 deg. F (180 deg. C).\nCream together shortening and granulated sugar.\nBeat in 4 eggs, then stir in flour, salt and baking soda.\nDrop by heaping teaspoonfuls on to ungreased cookie sheets.\nBake at 350 deg. F (180 deg. C) for 10 to 12 minutes.\nPrepare frosting by combining melted butter, vanilla, 1 egg, and powdered sugar in a medium bowl. Beat with electric mixer until smooth. Frost cookies when they are cool.\n",
        "picture_link": "9MRRRbI658x/ti3272Nu8/PtkBIbkAO"
    },
    {
        "title": "Moore's Cranberry Gelatin Salad",
        "ingredients": [
            "2 (3 ounce) packages raspberry flavored Jell-O® mix ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 cups boiling water ADVERTISEMENT",
            "1 1/2 cups cold water ADVERTISEMENT",
            "1 pound cranberries ADVERTISEMENT",
            "1 orange ADVERTISEMENT",
            "1 1/2 cups crushed pineapple, drained ADVERTISEMENT",
            "2 cups seedless red grapes, halved ADVERTISEMENT",
            "1 1/2 cups diced apples ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Add the sugar to the gelatin. Stir in the boiling water and stir until the gelatin is dissolved. Stir in the cold water or the pineapples juice. Chill until gelatin is thick.\nFinely grind the cranberries and the orange in food processor or run through the meat grinder.\nAdd the ground cranberry mixture, drained crushed pineapple, grapes and cubed apples to the thickened gelatin. Pour mixture into one 9 x 13 inch pan or a large bowl. Refrigerate overnight before serving.\n",
        "picture_link": "r88x4F5H7FhwPEJuNIy2qGBbO.fNnoS"
    },
    {
        "title": "Marinated Rosemary Chicken",
        "ingredients": [
            "2 (2 to 3 pound) whole chicken ADVERTISEMENT",
            "2 bunches fresh parsley, chopped ADVERTISEMENT",
            "1 bunch fresh thyme ADVERTISEMENT",
            "6 tablespoons dried rosemary ADVERTISEMENT",
            "3 tablespoons grated lemon zest ADVERTISEMENT",
            "12 cloves crushed garlic ADVERTISEMENT",
            "3 tablespoons ground black pepper ADVERTISEMENT",
            "1 cup olive oil ADVERTISEMENT",
            "1 cup white wine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To Make Marinade: In a food processor blend together the parsley, thyme, rosemary, lemon zest, garlic, pepper, oil and wine. Run processor until ingredients are mixed all together and mixture is smooth.\nRemove first two wing joints of chickens and truss with twine so that the legs are held tightly against the bodies. Rub marinade both inside the cavity and all over the outside, making sure to get a little under the skin of the breasts. Place chickens in a glass dish, breast side up, and pack remaining marinade on top of the breast and around the legs. Cover dish and marinate in refrigerator for 24 to 36 hours.\nPreheat oven to 350 degrees F (175 degrees C). Remove chickens from marinade dish, discarding any remaining marinade. Place in a lightly greased 9x13 inch baking dish and bake in the preheated oven for about 1 1/2 hours or until chickens are no longer pink inside and their juices run clear.\n",
        "picture_link": "2Elg6Dbydud27Pe7rf/8LFQeGrzIVyi"
    },
    {
        "title": "Caramel Pecan Cookies",
        "ingredients": [
            "1 cup butter or margarine, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "3/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 cup chopped pecans, divided ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "5 rolls chocolate-covered caramel candies ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, cream together the butter, 1 cup white sugar, and brown sugar until smooth. Beat in the eggs one at a time, then stir in the vanilla. Combine the flour, cocoa, and baking soda; stir into the sugar mixture until well blended. Stir in 1/2 cup of the pecans. Cover, and refrigerate dough for 1 hour, or until firm.\nPreheat oven to 375 degrees F (190 degrees C). In a shallow bowl, combine the remaining 1/2 cup pecans and 1 tablespoon of sugar; set aside.\nPress 1 tablespoon of cookie dough around each chocolate coated caramel, forming a ball. Dip one side of each ball into the pecan mixture; and place pecan side up, 2 inches apart on ungreased baking sheets.\nBake for 8 minutes in the preheated oven (the cookies will look soft). Cool on the pans for one minute before removing to wire racks to cool completely.\n",
        "picture_link": "/3hm17tPTxwCkYcSZ4mbLj6Hgs2UfCm"
    },
    {
        "title": "Fruity Granola Bars",
        "ingredients": [
            "3/4 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "3 cups rolled oats ADVERTISEMENT",
            "1 cup toasted and sliced almonds ADVERTISEMENT",
            "1 cup wheat germ ADVERTISEMENT",
            "1/4 cup sesame seeds ADVERTISEMENT",
            "1/2 cup dried cherries ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1/2 cup chopped pitted dates ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan or electric frying pan, combine sugar, butter, honey, water, and salt. Bring to a simmer and cook for 5 minutes. Stir in oats, almonds, wheat germ, and sesame seeds. Cook, stirring frequently, for 15 minutes. Remove from heat and add fruits.\nPour into a jelly roll pan lined with wax paper or parchment. Score deeply into bars of desired size. Allow to cool for 30 minutes. Break along score lines. Store in an airtight container.\n",
        "picture_link": "aJRgD4bT.zqBSQ8RUAPFCxM9RA6rQRO"
    },
    {
        "title": "Oatmeal Thumbprints",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "2 1/2 cups quick cooking oats ADVERTISEMENT",
            "1/2 cup finely chopped walnuts ADVERTISEMENT",
            "1 teaspoon almond extract ADVERTISEMENT",
            "1/4 cup raspberry jam ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (205 degrees C).\nCream butter and shortening with sugars. Beat in eggs. In a separate bowl, sift together flour, baking soda, salt, nuts and cinnamon. Add to butter mixture alternately with water. Stir in oats and almond extract.\nDrop by teaspoons on ungreased cookie sheets. Make a small indentation in each cookie. Fill with preserves.\nBake for 10-12 minutes.\n",
        "picture_link": "7eaulfq3uo0.NmYU.u1rMyt6yoEWdiS"
    },
    {
        "title": "Cottage Cheese Loaf I",
        "ingredients": [
            "1 (16 ounce) container low-fat cottage cheese ADVERTISEMENT",
            "4 cups crushed cornflakes cereal ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Coat a 9x9 inch cooking dish with cooking spray.\nHeat 1 tablespoon oil in medium skillet. Saute the onion until soft and translucent.\nIn a large bowl combine cottage cheese, cornflake crumbs, egg, oil and sauteed onion. Gradually stir in the milk to moisten. You might only need 1/2 cup of the milk, the mixture should be moist but not soupy.\nSpread the cottage cheese mixture into the prepared pan and bake at 350 degrees F (175 degrees C) for 30 to 40 minutes or until bubbly and a knife inserted in the center comes out clean.\n",
        "picture_link": "bfXRYrQ62ocx05L52WQIG.XC4oBnuii"
    },
    {
        "title": "Martina Cookies",
        "ingredients": [
            "2 cups butter, softened ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Line a baking sheet with parchment paper.\nBeat butter in a large bowl until creamy and fluffy. Mix flour, confectioners' sugar, and vanilla extract into the creamed butter to form a dough. Roll dough into walnut-sized balls and arrange on the prepared baking sheet. Press the dough balls with the bottom of a glass until dough is flattened to 1/2-inch thick.\nBake in the preheated oven until cookies are light brown, 10 to 13 minutes.\n",
        "picture_link": "sYIJJ0WQ3L24npCHXQpkxRde.v7swcC"
    },
    {
        "title": "Grands!® Ham and Cheese Melts",
        "ingredients": [
            "1 (16.3 ounce) can Pillsbury® Grands!® refrigerated biscuits (any variety) ADVERTISEMENT",
            "8 slices American cheese ADVERTISEMENT",
            "8 ounces thinly sliced deli ham ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 375 degrees F. Press 4 biscuits into 5-inch rounds on ungreased large cookie sheet. Top each with 2 slices cheese and 2 ounces ham.\nPress remaining 4 biscuits into 6-inch rounds; place over ham. Press edges with fork to seal. Beat egg and water with fork; brush over biscuits.\nBake 13 to 18 minutes or until golden brown. Cut each in half. Serve warm.\n",
        "picture_link": "57q8LAtLjOUaM1AUUeMU9Fs/22x/ZAK"
    },
    {
        "title": "Nectarine Sunshine Smoothie",
        "ingredients": [
            "2 large nectarines, pitted and quartered ADVERTISEMENT",
            "1 banana, cut into pieces and frozen ADVERTISEMENT",
            "1 large orange, peeled and quartered ADVERTISEMENT",
            "1 cup vanilla yogurt ADVERTISEMENT",
            "1 cup orange juice ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the nectarines, frozen banana chunks, orange, vanilla yogurt, orange juice, and honey into a blender, and blend until smooth.\n",
        "picture_link": "o2igdlzOe4QnwcLkttA4vrhvnhw/ela"
    },
    {
        "title": "Best Ever Kabob Marinade",
        "ingredients": [
            "1/2 cup honey ADVERTISEMENT",
            "1/2 cup soy sauce ADVERTISEMENT",
            "1/4 cup tomato-based chili sauce ADVERTISEMENT",
            "1 tablespoon ground cumin, or more to taste ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk honey, soy sauce, chili sauce, cumin, and vegetable oil together in a bowl.\n",
        "picture_link": "7XARonIu.15xy1hEAPP27IbgbVA83Mu"
    },
    {
        "title": "Christmas Green Chile Egg Casserole",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1 (16 ounce) package cottage cheese ADVERTISEMENT",
            "1 pound shredded Monterey Jack cheese ADVERTISEMENT",
            "2 (4 ounce) cans diced green chiles ADVERTISEMENT",
            "10 eggs ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Set butter in a 6x10-inch casserole dish; place dish in the preheating oven until butter is melted.\nMix cottage cheese, Jack cheese, green chiles, eggs, flour, baking powder, and salt in a large bowl using an electric hand mixer. Pour mixture into the melted butter in the casserole dish.\nBake in the preheated oven for 15 minutes. Reduce heat to 350 degrees F (175 degrees C); bake until middle of casserole is set, about 50 more minutes. Allow to stand for 10 minutes before serving.\n",
        "picture_link": "r7wVzybgEBhcc14DA61uC7zFcqDRQQy"
    },
    {
        "title": "Turkey Thighs in Brown Sauce",
        "ingredients": [
            "2 turkey thighs ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 tablespoon poultry seasoning ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 small onion, sliced ADVERTISEMENT",
            "1 (8 ounce) package sliced fresh mushrooms ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1/2 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "2 tablespoons dry sherry ADVERTISEMENT",
            "1 1/2 teaspoons dried oregano ADVERTISEMENT",
            "1 1/2 teaspoons dried parsley ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse and pat the turkey thighs dry with paper towels, then sprinkle with salt and pepper. In a shallow bowl, mix the flour with poultry seasoning until well combined.\nHeat the olive oil in a large skillet over medium-high heat; dredge the turkey thighs all over with the seasoned flour, shake off excess flour, then cook the turkey thighs in the hot oil until the meat is browned, about 5 minutes per side.\nStir the onion, mushrooms, and garlic into the pan. Stir until the mushrooms have begun to give up their juice and the onions are translucent, about 5 minutes. Whisk the chicken broth, cream of chicken soup, and sherry together in a bowl, and stir in the oregano, parsley, and garlic powder. Pour the mixture over the turkey thighs. Cover the pan, reduce heat to medium-low, and simmer until the turkey meat is no longer pink inside and the juices run clear, about 30 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Slice the turkey thighs, and serve with sauce.\n",
        "picture_link": "Rvp/m.Ie05ad/B1AZxKgQ3tx99s8KPS"
    },
    {
        "title": "Sausage, Spinach and Ricotta Calzone",
        "ingredients": [
            "Crust: ADVERTISEMENT",
            "1 1/2 cups all-purpose flour, or more if needed ADVERTISEMENT",
            "1 envelope Fleischmann's® Pizza Crust Yeast ADVERTISEMENT",
            "1 teaspoon sugar ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "2/3 cup very warm water (120 degrees to 130 degrees F)* ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "8 ounces Italian sausage ADVERTISEMENT",
            "2 cups fresh spinach leaves ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "3/4 cup ricotta cheese ADVERTISEMENT",
            "3/4 cup shredded mozzarella cheese ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon Spice Islands® Italian Herb Seasoning ADVERTISEMENT",
            "1/2 teaspoon Spice Islands® Crushed Red Pepper ADVERTISEMENT",
            "1/2 teaspoon Spice Islands® Garlic Salt ADVERTISEMENT",
            "Pizza sauce OR marinara sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F.\nCombine 1 cup flour, undissolved yeast, sugar and salt in a large bowl. Add very warm water and oil; mix until well blended, about 1 minute. Gradually add enough remaining flour to make a soft dough. Dough should form a ball and will be slightly sticky. Knead** on a floured surface, adding additional flour if necessary, until smooth and elastic, about 4 minutes. Cover and let rest on floured surface while preparing filling.\nCook sausage in skillet over medium-high heat until cooked through; remove from skillet and drain excess fat. Add spinach and water to skillet; saute 1 to 2 minutes until spinach is wilted; drain. Return sausage to pan.\nCombine ricotta, mozzarella and egg in a mixing bowl. Stir in Italian herb seasoning, crushed red pepper and garlic salt; set aside.\nTo make calzones divide dough into four portions. Roll 1 portion into an 8-inch circle on a floured surface. Spread approximately 1/3 cup ricotta mixture in center bottom half of dough. Top with heaping 1/3 cup sausage spinach mixture leaving outer 1/2-inch free of filling. Fold top half of dough over filling. Pull edge of lower crust over top; folding and pressing layers together to form a seal. Carefully transfer to greased baking sheet. Cut 3 to 4 vents in top. Repeat with remaining dough. Bake for 15 to 20 minutes until lightly browned. Transfer to cooling rack to keep bottom crust crisp while cooling slightly. Serve with pizza sauce or other sauce for dipping.\n",
        "picture_link": "wKwBNPekCUiDHX0AE8Nsq/WvaDYlmU6"
    },
    {
        "title": "Monkey Tails",
        "ingredients": [
            "10 ice pop sticks ADVERTISEMENT",
            "5 very ripe bananas, peeled and halved crosswise ADVERTISEMENT",
            "1 (16 ounce) package semisweet chocolate chips ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "10 tablespoons flaked coconut, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Insert 1 pop stick into the cut end of each banana. Place the bananas on a wax paper covered baking sheet and freeze until the bananas are frozen, about 2 hours.\nMelt the chocolate and butter in a microwave-safe glass or ceramic bowl in 30-second intervals, stirring after each melting, for 1 to 3 minutes (depending on your microwave).\nDip the frozen bananas in the melted chocolate, spooning the chocolate over the banana to cover it completely. Roll in coconut if desired. Place the dipped bananas on the wax paper-covered baking sheet, and freeze until the chocolate is firm.\n",
        "picture_link": "28li5zORcsgjbzHcGGdE3nltLvUkX7i"
    },
    {
        "title": "Spinach and Chicken Enchiladas",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "1/2 cup sliced green onions ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 large cooked chicken breast halves, diced ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped spinach - thawed, drained, and squeezed dry ADVERTISEMENT",
            "1/2 teaspoon chili powder ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1 cup ricotta cheese ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1 1/2 cups shredded Monterey Jack cheese, divided ADVERTISEMENT",
            "1 1/2 cups shredded mozzarella cheese, divided ADVERTISEMENT",
            "5 (10 inch) flour tortillas ADVERTISEMENT",
            "2 (10 ounce) cans enchilada sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMelt butter in a saucepan over medium heat; cook and stir green onions and garlic in butter until fragrant and softened, about 2 minutes. Stir chicken, spinach, chili powder, black pepper, and salt into the green onion mixture and cook until heated through, about 5 minutes. Remove from heat. Mix ricotta cheese, sour cream, 1 cup Monterey Jack cheese, and 1 cup of mozzarella cheese into chicken mixture until thoroughly combined. Reserve remaining Monterey Jack and mozzarella cheeses for topping.\nPlace tortillas into a plastic bag, seal bag, and microwave on high until warm and soft, 30 to 45 seconds. Spoon about 3/4 cup of chicken filling down the center of each tortilla in a line. Roll tortillas around filling and place with seam sides down into a 9x13-inch baking dish.\nPour enchilada sauce over filled enchiladas and sprinkle the remaining 1/2 cup of Monterey Jack and mozzarella cheeses over the top.\nBake in the preheated oven until filling is bubbling and cheese topping is browned at the edges, about 30 minutes.\n",
        "picture_link": "/QunC8A6bQsey3H2ZSgvppUAguuuvmO"
    },
    {
        "title": "Mediterranean Lamb Burgers",
        "ingredients": [
            "1 pound ground lamb ADVERTISEMENT",
            "1/2 pound ground beef ADVERTISEMENT",
            "3 tablespoons chopped fresh mint ADVERTISEMENT",
            "1 teaspoon minced fresh ginger root ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 (16 ounce) container Greek yogurt ADVERTISEMENT",
            "1/2 lemon, zested ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 large sweet onion, cut into 1/2-inch slices ADVERTISEMENT",
            "4 slices green tomato ADVERTISEMENT",
            "4 ciabatta sandwich rolls, sliced horizontally ADVERTISEMENT",
            "1 (8 ounce) package feta cheese, sliced ADVERTISEMENT",
            "8 baby arugula leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium-high heat, and lightly oil the grate.\nMix the ground lamb, ground beef, mint, ginger, 1 teaspoon garlic, 1 teaspoon salt, and pepper in a large bowl until just combined. Divide evenly into four portions and shape in to large patties. Set aside. Mix Greek yogurt, lemon zest, 1 clove garlic, and 1/2 teaspoon salt in a bowl; cover and refrigerate.\nCook the lamb and beef patties on the preheated grill until the burgers are cooked to your desired degree of doneness, 3 to 4 minutes per side for well done. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C). Place the slices of onion and green tomato on the grill. Cook until lightly charred, about 1 minute on each side.\nSpread yogurt sauce over the sliced ciabatta rolls. Assemble each burger by placing the patty on the the roll, and dividing the feta cheese slices over the patties. Top with a slice of grilled tomato, grilled onion, and 2 leaves of arugula, followed by the top half of the roll.\n",
        "picture_link": "VBjnyolxfQ96yPMQr5bW/MTjHsGxhUW"
    },
    {
        "title": "Chelsea's Bacon Roast Chicken",
        "ingredients": [
            "2 tablespoons dried thyme ADVERTISEMENT",
            "2 tablespoons dried oregano ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1 1/2 tablespoons ground cumin ADVERTISEMENT",
            "1 1/2 tablespoons salt ADVERTISEMENT",
            "1 tablespoon ground paprika ADVERTISEMENT",
            "2 teaspoons ground black pepper ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "3 tablespoons unsalted butter, softened ADVERTISEMENT",
            "1 (4 pound) whole chicken, rinsed and patted dry ADVERTISEMENT",
            "3 cloves garlic, crushed ADVERTISEMENT",
            "6 slices of thick-cut bacon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nMix the thyme, oregano, brown sugar, cumin, salt, paprika, and black pepper in a bowl. Remove half the spice mixture to another bowl; stir the minced garlic and softened butter into the mix in one of the bowls.\nLoosen the skin of the chicken over the breast, back, and thighs. Rub the spice mixture containing garlic and butter thickly underneath the loosened skin. Rub the dry spice mixture generously over the outside of the chicken and sprinkle some in the cavity. Place the crushed garlic cloves into the cavity. Place the chicken on a roasting rack set in a roasting pan; arrange the bacon strips over the chicken in a basket-weave pattern.\nBake in the preheated oven for 15 minutes; lower the oven temperature to 400 degrees F (205 degrees C) and cook another 15 minutes. Reduce oven heat to 375 degrees F (190 degrees C) and roast until no longer pink at the bone and the juices run clear, about 30 minutes. If the bacon starts to look too brown during roasting, cover the chicken with a sheet of aluminum foil. An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read at least 165 degrees F (75 degrees C) when the meat is done. Remove the chicken from the oven and allow to rest in a warm area for 10 minutes before slicing.\n",
        "picture_link": "3gKMyDHASNPLJ07phb62Cax1enTzgUC"
    },
    {
        "title": "Fish with Maille® Dijon Originale Mustard",
        "ingredients": [
            "4 thick cod steaks (or other firm white fish) ADVERTISEMENT",
            "2 tablespoons oil ADVERTISEMENT",
            "4 teaspoons Maille® Dijon Originale mustard ADVERTISEMENT",
            "1 tablespoon finely chopped flat parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Trim fish, then season on both sides. Heat oil in a pan (which can be transferred to the oven.) Fry steaks on one side until crisp underneath. Using a pastry brush, paint Maille(R) Dijon Originale mustard over the top side of the cod.\nPlace in a pre-heated oven at 400 degrees F for around 5 minutes, depending on thickness.\nSprinkle with chopped parsley and serve.\n",
        "picture_link": "KgVLYnSR/pta3Wi.TQs4xRZly6vQ1FW"
    },
    {
        "title": "Stuffed Pork Loin",
        "ingredients": [
            "3 tablespoons margarine ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1/2 cup chopped mushrooms ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "3 cups torn day-old bread ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 (4 pound) boneless pork loin roast ADVERTISEMENT",
            "3 tablespoons water, or as needed ADVERTISEMENT",
            "1 tablespoon ground thyme ADVERTISEMENT",
            "1 tablespoon herbes de Provence ADVERTISEMENT",
            "1 pinch garlic powder, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C).\nHeat margarine in a skillet over medium heat; cook and stir onion, mushrooms, and celery in the hot margarine until vegetables are tender, about 12 minutes. Transfer vegetables to a bowl. Stir bread into vegetables until moistened; season with salt and black pepper.\nCut the pork loin almost in half lengthwise, cutting to about 1 inch from the bottom; open pork loin like a book. Cover with plastic wrap and lightly pound with a meat mallet to flatten the meat. Spoon stuffing onto the pork loin, roll the meat over the stuffing, and tie pork loin together in three places using kitchen twine.\nPlace tied loin into a roasting pan and pour about 3 tablespoons water around the roast. Season roast with salt, black pepper, thyme, herbes de Provence, and garlic powder.\nRoast stuffed pork loin until an instant-read meat thermometer inserted into the center of the stuffing reads 160 degrees F (70 degrees C), 2 1/2 to 3 hours. Rest meat for 15 minutes before untying and slicing.\n",
        "picture_link": "MvnRkEAtx4TuGAQPlKO4z.SDYf8ig6K"
    },
    {
        "title": "Perfect Marinated Chicken Breasts",
        "ingredients": [
            "1 1/2 cups lemon-lime soda ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "1/2 cup soy sauce ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "4 (6 ounce) skinless, boneless chicken breast halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk lemon-lime soda, olive oil, soy sauce, and garlic powder in a bowl and pour into a resealable plastic bag. Add chicken breasts, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator overnight.\nPreheat grill for medium heat and lightly oil the grate.\nRemove chicken from marinade and discard used marinade. Cook chicken breasts on preheated grill until no longer pink in the center and the juices run clear, 7 to 8 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "hUo3WaPF/DQbwD0U37dkSzQae5thmXK"
    },
    {
        "title": "Homemade Nacho Cheese Sauce",
        "ingredients": [
            "1/4 cup melted butter ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1 teaspoon all-purpose flour ADVERTISEMENT",
            "3 cups cold milk ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "1/4 teaspoon ground dried chipotle pepper ADVERTISEMENT",
            "1/4 teaspoon ancho chile powder ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1/2 pound sharp Cheddar cheese, shredded ADVERTISEMENT",
            "1/4 pound Monterey Jack cheese, shredded ADVERTISEMENT",
            "1/4 pound Muenster cheese, shredded ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large pot or Dutch oven over medium heat. Sprinkle in 3 tablespoons plus 1 teaspoon flour. Whisk constantly until the mixture is thick and all the flour is incorporated, 3 to 4 minutes.\nSlowly pour cold milk into the butter mixture, whisking constantly until combined. Simmer, stirring occasionally, until slightly thickened, about 5 minutes. Stir in paprika, ground chipotle, ancho chile powder, cayenne pepper, and salt.\nReduce heat to low and add sharp Cheddar cheese, Monterey Jack cheese, and Muenster cheese, a handful at a time; stir until thoroughly melted. Season with salt to taste.\n",
        "picture_link": "YIxFP4W5Aq0Izz7icKwxWXbdm4tLcyK"
    },
    {
        "title": "Coffee Jelly",
        "ingredients": [
            "1 (.25 ounce) package unflavored gelatin ADVERTISEMENT",
            "2 tablespoons hot water ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "2 cups fresh brewed coffee ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dissolve gelatin in the hot water in a small bowl. Pour gelatin mixture, coffee, and sugar in a saucepan and bring to a boil over high heat. Pour coffee mixture into glasses for individual servings or a large pan for cubing. Chill in the refrigerator until solidified, 6 to 7 hours.\n",
        "picture_link": "KV0hi1NiFcn2J4kMKavDccg3NXOYd5i"
    },
    {
        "title": "Apple Pear Sauce",
        "ingredients": [
            "4 pears, cut into chunks ADVERTISEMENT",
            "3 apples, cut into chunks ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a skillet over medium heat; add pears, apples, water, and vanilla extract to the hot skillet. Cover and simmer fruit mixture for 10 minutes; remove lid and cook until most of liquid is evaporated and fruit is softened, 10 to 15 more minutes.\nRemove skillet from heat and transfer fruit mixture and any remaining liquid to a food processor. Process until smooth; stir in cinnamon. Serve warm or refrigerate up to 4 days.\n",
        "picture_link": "ymiWhB4BhkAjskyGSODchJXVL.ryZva"
    },
    {
        "title": "Curried Chicken and Broccoli Casserole",
        "ingredients": [
            "cooking spray (such as Pam®) ADVERTISEMENT",
            "1 bunch broccoli, cut into chunks - or more to taste ADVERTISEMENT",
            "1 (3 pound) cooked rotisserie chicken, meat removed from bones and chopped ADVERTISEMENT",
            "2 (10.75 ounce) cans cream of chicken soup ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "1 teaspoon curry powder ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 cup crushed corn flakes cereal ADVERTISEMENT",
            "1/4 cup slivered almonds (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray a 9x13-inch baking dish with cooking spray.\nPlace broccoli into a microwave-safe dish with a lid, pour in a small amount of water, cover, and cook on high in microwave until broccoli is steaming and bright green, 2 to 3 minutes. Carefully remove lid and spread broccoli into the bottom of the prepared baking dish. Spread cooked chicken in a layer over the broccoli.\nWhisk cream of chicken soup, mayonnaise, lemon juice, curry powder, salt, and black pepper in a bowl and pour sauce over the chicken and broccoli. Spread the Cheddar cheese over the sauce and sprinkle casserole with corn flake crumbs and almonds.\nBake uncovered in the preheated oven until the casserole is bubbling, the cheese has melted, and the crumb topping is browned, about 30 minutes.\n",
        "picture_link": "I0EUN3oMN9Ve2tlmcmqt2CYEUeEjsVm"
    },
    {
        "title": "Best Braised Balsamic Pot Roast",
        "ingredients": [
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 (3 1/2) pound beef chuck roast ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 large onion, sliced ADVERTISEMENT",
            "2 tablespoons red wine vinegar ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "1 (28 ounce) can crushed tomatoes ADVERTISEMENT",
            "2 teaspoons dried thyme leaves ADVERTISEMENT",
            "2 teaspoons hot pepper sauce, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nHeat olive oil in large, heavy pot over medium-high heat. Season roast with salt and black pepper. Place flour into a shallow bowl and press roast into the flour to coat completely. Cook the meat in the hot oil until browned completely, about 5 minutes per side.\nSpread onion slices over the roast; pour red wine vinegar into the pot around the roast. Drizzle half the balsamic vinegar over the roast and pour the remainder around it. Spread half the crushed tomatoes over the roast and distribute the remaining tomatoes around it. Sprinkle thyme leaves over roast; drizzle hot sauce atop thyme.\nCover the pot and roast in the preheated oven until the meat is very tender, about 3 1/2 hours.\n",
        "picture_link": "x4J0kGfoZhoxb8v5muCqLSjLgoxUSd6"
    },
    {
        "title": "Rachel's Sugar Plum Spice Jam",
        "ingredients": [
            "10 red plums, pitted and chopped ADVERTISEMENT",
            "2 cups chopped fresh pineapple ADVERTISEMENT",
            "1/2 cup apple juice ADVERTISEMENT",
            "1/2 (12 fluid ounce) can frozen orange juice concentrate ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "1 1/2 teaspoons ground cloves ADVERTISEMENT",
            "1 teaspoon ground allspice ADVERTISEMENT",
            "1 (1.75 ounce) package powdered fruit pectin ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "8 cups white sugar ADVERTISEMENT",
            "4 drops red food coloring ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the plums, pineapple, apple juice, orange juice concentrate, and lemon juice into a large pot over medium-low heat, cover, and cook until the plums are soft, 15 to 20 minutes. Mash the plums and pineapple with a potato masher until thoroughly broken up, but leave small chunks of fruit in the mixture. With the fruit mixture at a slow simmer, stir in the cloves, allspice, pectin, and butter (to reduce foaming). Raise heat to high and bring the mixture to a full, rolling boil for 1 minute, stirring constantly. Mix in the sugar, stirring constantly, and cook for 1 more minute at a full, rolling boil. Remove from heat, stir in red food coloring until even in color, and skim off any foam.\nSterilize 12-ounce canning jars and lids in boiling water for at least 5 minutes. Pack the plum jam into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings.\nPlace a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil over high heat, then carefully lower the jars into the pot using a holder. Leave a 2 inch space between the jars. Pour in more boiling water if necessary until the water level is at least 1 inch above the tops of the jars. Bring the water to a full boil, cover the pot, and process for 10 minutes.\nRemove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area.\n",
        "picture_link": "1HUHOXY8Z/FvWZN1SFgiOYHExg54IOm"
    },
    {
        "title": "Chicken Won Tons",
        "ingredients": [
            "1 (14 ounce) package wonton wrappers ADVERTISEMENT",
            "1 pound shredded, cooked chicken ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace small amount of shredded chicken lengthwise along each won ton wrapper; roll up and seal by dampening edge of wrapper with a finger dipped in water. When you run out of chicken meat, place rolled won tons in a lightly greased 9x13 inch baking dish.\nBake at 350 degrees F (175 degrees C) for 15 to 20 minutes or until wrapper is crisp.\nNOTE: These can also be frozen in a single layer, then placed in a storage bag and baked or deep fried as needed.\n",
        "picture_link": "Kr3KywpNbdcsaHiGHoD4p.XPtmR.UUK"
    },
    {
        "title": "Layin' the Chocolate Smack Down",
        "ingredients": [
            "1 (20 ounce) package fudge brownie mix ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 (5.9 ounce) package instant chocolate pudding mix ADVERTISEMENT",
            "3 cups milk ADVERTISEMENT",
            "1 (16 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "10 chocolate sandwich cookies, crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare the fudge brownies according to package directions, using the oil, water and eggs. Bake in a 9x13 inch pan. allow to cool.\nWhen brownies are cool, prepare the pudding; in a large bowl, combine pudding mix and milk. mix until smooth and set aside to thicken.\nCut the brownies into 3 inch squares. Line the bottom of a large serving bowl unevenly with 1/2 of the brownie squares. Pour half of the pudding over the brownies, then cover with half of the whipped topping. Repeat layers. Sprinkle top with crumbled cookies.\n",
        "picture_link": "hPu/U1ViHo2nyY82jOFRgnYaEoaWiFa"
    },
    {
        "title": "Finnish Pannu Kakku",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "4 eggs, beaten ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Melt the butter in a 9x13 inch pan.\nIn a medium bowl, stir together the sugar, flour, baking powder and salt. Add the beaten eggs and milk; mix well. Tilt the baking pan to coat all of the sides with butter, then pour the excess butter into the batter, and mix until combined. Pour the batter into the prepared pan.\nBake for 15 to 20 minutes in the preheated oven. Serve hot.\n",
        "picture_link": "41L4sEu98DOOgPJeB.mRYOvSzD0izPW"
    },
    {
        "title": "Lynn's Carrot Cake",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 cup unsweetened cocoa powder ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups vegetable oil ADVERTISEMENT",
            "2 cups grated carrots ADVERTISEMENT",
            "1 cup crushed pineapple with juice ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 pound confectioners' sugar ADVERTISEMENT",
            "1/2 cup flaked coconut ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour three 9 inch round cake pans.\nIn a medium bowl, stir together the flour, sugar, baking soda, salt and cocoa, set aside. In another bowl, stir together the eggs, vanilla and oil. Stir in the dry ingredients until they are completely absorbed. Fold in the carrots and pineapple. Pour the batter evenly between the three prepared pans.\nBake for 30 minutes in the preheated oven, until a toothpick inserted comes out clean. To make the frosting, combine the cream cheese, butter and confectioners sugar in a medium bowl. Beat until smooth, then stir in the coconut and nuts. Frost cake when cool.\n",
        "picture_link": "CfzpSd/rlM28.FGolsJfAcHBQTQAN0e"
    },
    {
        "title": "One - Two - Three - Four Cake IV",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "3 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour six 9 inch round pans. Sift together the flour, baking powder and salt; set aside.\nIn a large bowl, cream together the butter and sugar until light and fluffy. Beat in the eggs one at a time, then stir in the vanilla. Alternately beat in the flour mixture and the milk, mixing just until incorporated.\nDivide batter into six 9 inch pans. Bake in the preheated oven for 15 to 20 minutes, or until a toothpick inserted into the center of the cake comes out clean.\n",
        "picture_link": "AA3UjN9onbMaShcWimAXCD3IwwROeuS"
    },
    {
        "title": "Coq au Creme",
        "ingredients": [
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 teaspoon dried rosemary ADVERTISEMENT",
            "2 (4.5 ounce) cans sliced mushrooms, drained ADVERTISEMENT",
            "1 1/2 cups chicken broth ADVERTISEMENT",
            "1 (16 ounce) container sour cream, room temperature ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large skillet over medium heat. Add onion and garlic and saute until slightly clear, then reduce heat to medium low (careful not to burn, but browning is okay).\nMeanwhile, melt butter or margarine in another large skillet over medium high heat. Rinse chicken breasts and pat dry; season with salt and pepper to taste and brown on both sides, about 2 minutes each side.\nDrain and add browned chicken breasts to onion/garlic mixture, then add rosemary, mushrooms and chicken broth. Stir to mix together, making sure chicken breasts are evenly spaced in the skillet. Reduce heat to simmer, cover skillet tightly and cook for 30 minutes.\nAdd sour cream and stir well, breaking up any clumps with a spoon. Cover skillet again and allow to heat through for 10 minutes.\nStrain about 3/4 cup of the liquid from the skillet into a small bowl; add flour and mix well with a fork to break up any clumps. Pour mixture into the chicken mixture, stir well and cook over medium heat for about 15 to 20 more minutes to thicken the sauce. Serve hot.\n",
        "picture_link": "4YQ1sooFbzqM8mWPmox5uHPvy0rLf7C"
    },
    {
        "title": "Edie's Patatosalata",
        "ingredients": [
            "1/2 cup extra virgin olive oil ADVERTISEMENT",
            "3 tablespoons red wine vinegar ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 red onion, thinly sliced ADVERTISEMENT",
            "5 large red potatoes ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, combine olive oil, wine vinegar, oregano, parsley, and onion. Mix and set aside.\nAdd potatoes to a large pot of boiling, lightly salted water. Boil for about 20 minutes, or until potatoes are tender. Drain water and let cool.\nWhen cooled, peel and dice. Place in a large bowl, add dressing and season with salt and pepper to taste. Toss to coat, cover bowl and refrigerate for several hours or overnight.\n",
        "picture_link": "D8mIgypIBU1p8PSl8vF0s8yfJ571M3a"
    },
    {
        "title": "Crispy French Toast",
        "ingredients": [
            "8 cups vegetable oil for deep-frying ADVERTISEMENT",
            "6 thick slices white bread ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups cornflakes cereal ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat deep-fryer to 375 degrees F (190 degrees C).\nIn a large bowl combine eggs, milk, sugar, cinnamon and vanilla; beat well. Place cornflakes in a separate bowl. Dip bread slices in egg mixture and press into cornflakes.\nCarefully slide coated bread slices into hot oil. Fry on each side until golden brown. Drain on paper towels and serve hot.\n",
        "picture_link": "HgICECY3S0V9YlZ.aJVFuQXkddSAjWi"
    },
    {
        "title": "Tangerine Orange Cake",
        "ingredients": [
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1 (3 ounce) package instant lemon pudding mix ADVERTISEMENT",
            "3/4 cup tangerine juice ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 teaspoon lemon extract ADVERTISEMENT",
            "1/3 cup tangerine juice ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease a 10 inch Bundt pan or line a muffin pan with paper cups.\nIn a medium bowl, stir together the cake mix and instant pudding. Add the tangerine juice, oil, eggs and lemon extract, mix until well blended. Pour into the prepared pan or pans.\nBake for 35 to 40 minutes in the preheated oven, until the cake springs back to the touch. For cupcakes, bake for 15 to 17 minutes. Let cool in the pan for 10 minutes before removing from pan to cool completely.\nIn a small saucepan, combine the remaining tangerine juice, sugar and butter over medium heat. Stir frequently until the mixture is smooth. Drizzle over cooled cake or cupcakes.\n",
        "picture_link": "4ODYp9QJn/d0r4Y71P0OTDctg4iIOlO"
    },
    {
        "title": "Butterkuchen",
        "ingredients": [
            "2 (.25 ounce) packages dry yeast ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Butter a 9x13 inch pan and set aside. In a small mixing bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes. Place milk, 1/2 cup sugar, salt and 1/2 cup butter in saucepan. Heat until sugar dissolves and butter melts. Cool to lukewarm. Add dissolved yeast and set aside.\nIn large bowl combine flour, eggs and yeast mixture. Stir until smooth and blended. Pour into a buttered 9x13 inch pan, spreading dough evenly. Let rise in warm place for 45 minutes. Meanwhile, preheat oven to 375 degrees F (190 degrees C).\nIn a small bowl, combine 1/2 cup butter, 1 cup sugar and 1/2 teaspoon cinnamon. mix together and sprinkle over the dough. Bake in preheated oven for 30 minutes, or until the top is golden and syrupy.\n",
        "picture_link": "qJop79/x9SS0IpHmpeCE8hgrWKwG3oW"
    },
    {
        "title": "Hornets Nest Cake",
        "ingredients": [
            "1 (4.6 ounce) package non-instant vanilla pudding mix ADVERTISEMENT",
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "2 cups butterscotch chips ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan.\nPrepare pudding as directed on box. Allow to cool slightly. Mix in yellow cake mix. Stir well. Pour batter into 9x13 cake pan. Sprinkle top with butterscotch chips and chopped walnuts.\nBake in preheated oven for 35 to 40 minutes. Cut into squares and serve.\n",
        "picture_link": ".o8Ryv0TmFchFcE4J4swomiqyOS/QXq"
    },
    {
        "title": "Cream of Potato Soup III",
        "ingredients": [
            "4 potatoes - peeled and cubed ADVERTISEMENT",
            "1 1/2 cups chicken broth ADVERTISEMENT",
            "1 tablespoon unsalted butter ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 tablespoon chopped onion ADVERTISEMENT",
            "1/8 teaspoon dried dill weed ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot over high heat, boil the potatoes in the broth for 15 minutes, or until potatoes are tender. Carefully separate the potatoes from the broth and transfer to a blender or food processor.\nAdd 3/4 cup of the broth to the potatoes and puree for 5 seconds or more depending on how smooth you want the soup to be. Add remaining broth and set aside.\nMelt the butter in a large saucepan over medium heat. Add the salt, ground black pepper, onion and dill weed to the butter, stir and saute for 2 minutes. Sprinkle with the flour and stir well.\nPour in the milk and heat until the mixture starts to thicken, about 1 to 2 minutes. Stir in the pureed potato mixture. Allow to heat through and serve.\n",
        "picture_link": "dq5tNJIdj4wXx7/qnA9FWneGGxfzEq6"
    },
    {
        "title": "Best Ever New Zealand Pavlova",
        "ingredients": [
            "3 egg whites ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "3 teaspoons cornstarch ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon distilled white vinegar ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 275 degrees F (135 degrees C). Grease a cookie sheet, line it with parchment paper and sprinkle a little water over paper.\nIn a large glass or metal mixing bowl, beat egg whites until foamy. Gradually add sugar, continuing to beat until stiff peaks form. Beat in water, then mix in cornstarch, vanilla, vinegar and salt.\nPour entire meringue mixture onto the center of the pan. Pavlova will spread as it bakes.\nBake in the preheated oven for 45 minutes. Turn oven off and leave Pavlova in the oven until cold. Turn upside-down onto plate and top with fresh fruit and whipped cream.\n",
        "picture_link": "WFfXLy7rnKq6AKQ03T7VkVZqAMqQ9/2"
    },
    {
        "title": "No Commercial Yeast Starter",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 cups bottled (non-chlorinated) water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine flour and spring water in a medium bowl; stir well. Cover loosely with a cloth and let sit on a kitchen counter for 2 to 3 days, or until bubbly.\nTo use and feed your starter; take out the amount needed for your recipe and then replace that amount with equal parts flour and spring water. If you keep your starter at room temperature it should be fed every other day, and if refrigerated, fed weekly. If you accumulate more starter than you need, simply pour a few cups down the drain before feeding it.\n",
        "picture_link": "qk9PHRqnsinGojStvoQhxQbOs2JIrmO"
    },
    {
        "title": "Mom's Chicken Paprika",
        "ingredients": [
            "1 (4 pound) whole chicken, cut into pieces ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon seasoned salt ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 cup shortening ADVERTISEMENT",
            "2 tablespoons paprika ADVERTISEMENT",
            "1/2 teaspoon garlic salt ADVERTISEMENT",
            "2 1/2 cups hot water ADVERTISEMENT",
            "2 onions, peeled and sliced into rings ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a shallow dish or bowl, combine 1/2 cup four, seasoned salt, thyme and ground black pepper. Mix together; coat chicken pieces in this mixture and fry in shortening in a large skillet until lightly browned on all sides.\nSprinkle paprika and garlic salt over chicken. Add hot water to skillet and simmer for 30 minutes. Placed onion rings on top of chicken pieces and simmer for another 30 minutes. Remove chicken, with onions on top, to a serving platter and reserve.\nIn a small bowl, blend 2 tablespoons flour with milk and add to liquid in skillet. Cook, stirring, until thickened. Pour thickened mixture over chicken and serve with hot cooked white rice or egg noodles, if desired.\n",
        "picture_link": "Cua/Iw5.BcuiddVbvVpnQt2br5jGoVS"
    },
    {
        "title": "Blonde Brownies IV",
        "ingredients": [
            "1/2 cup margarine, melted ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "1 cup chopped pecans (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 325 degrees F (165 degrees C). Grease a 9x13 inch pan or two 8x8 inch pans.\nIn a medium bowl, mix together the melted margarine, brown sugar and white sugar until smooth. Beat in the eggs one at a time, then stir in the vanilla. Combine the flour, baking powder, and baking soda , gradually stir into the creamed mixture. Spread evenly into the prepared pan, and sprinkle the chocolate chips and pecans over the top.\nBake for 12 to 15 minutes in the preheated oven until surface of cookies appears dry. Cool, and cut into squares.\n",
        "picture_link": "GNxor0rQN2RswplpRTAS8551y8QSlh6"
    },
    {
        "title": "Robert E. Lee's Orange Pie",
        "ingredients": [
            "1 (9 inch) unbaked pie crust ADVERTISEMENT",
            "3 egg yolks, beaten ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 tablespoon butter, melted ADVERTISEMENT",
            "1 tablespoon grated orange zest ADVERTISEMENT",
            "1 cup orange juice ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "6 tablespoons white sugar ADVERTISEMENT",
            "1 large orange, sliced in rounds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (225 degrees C).\nIn a medium bowl, beat together egg yolks and 1/2 cup sugar until mixture is thick and lemon-colored. Add flour, melted butter, grated orange rind, and orange juice. Mix thoroughly, then pour into pastry shell.\nBake in preheated oven for 10 minutes. Reduce heat to 350 degrees F (175 degrees C) and bake an additional 25 minutes, until custard is set.\nIn a large glass or metal mixing bowl, beat egg whites until foamy. Gradually add 6 tablespoons sugar, continuing to beat until whites form stiff peaks. Spread meringue over pie, covering completely. Return to oven for 10 minutes, until meringue is golden brown. Cool before serving. Garnish with orange slices.\n",
        "picture_link": "OA7qnyYIfO9HOj2Hmyh2.MGwQG6xu0C"
    },
    {
        "title": "Pink Panther",
        "ingredients": [
            "1 cup crushed ice ADVERTISEMENT",
            "1 fluid ounce amaretto liqueur ADVERTISEMENT",
            "1 fluid ounce vodka ADVERTISEMENT",
            "8 fluid ounces pineapple juice ADVERTISEMENT",
            "1 teaspoon grenadine syrup ADVERTISEMENT",
            "1 slice fresh pineapple ADVERTISEMENT",
            "1 maraschino cherry ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender combine ice, amaretto, vodka, pineapple juice and grenadine. Blend well and pour into a tall chilled glass. garnish with an umbrella, pineapple slice and cherry.\n",
        "picture_link": "c/nF.cRf1qof0yhiuN0VqMfz1eir/Le"
    },
    {
        "title": "Romano Cheese Crisp",
        "ingredients": [
            "1 cup grated Romano cheese ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 (1 pound) loaf French bread ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to broil. Slice bread into 1/2 inch slices.\nIn a medium-size mixing bowl, combine Romano cheese, garlic, and cream cheese. Spread the cheese mixture onto the sliced French bread.\nBroil for about 3 minutes, or until the cheese melts.\n",
        "picture_link": "2BSeAzttr2TJfsEgujlxAHki58s/OKG"
    },
    {
        "title": "Zucchini Delight",
        "ingredients": [
            "3 zucchini, sliced ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 (14.5 ounce) can canned peeled and diced tomatoes ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSlice zucchini and onion and place in a glass dish baking dish. Add can of tomatoes, salt and pepper. Sprinkle cheese over top. Place lid on dish.\nBake in the preheated 350 degrees F (175 degrees C) until zucchini becomes tender, 20 minutes.\n",
        "picture_link": "JyUjlwpu47uyJvDmBHhAEDFllT2lODi"
    },
    {
        "title": "Annette's Great Ham Glaze",
        "ingredients": [
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "8 tablespoons butter ADVERTISEMENT",
            "1/2 cup gold rum (such as Bacardi Gold®) ADVERTISEMENT",
            "1/4 cup dark molasses ADVERTISEMENT",
            "3 tablespoons spicy mustard ADVERTISEMENT",
            "1 tablespoon cider vinegar ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine brown sugar, butter, rum, molasses, mustard, and cider vinegar in a large saucepan over medium heat. Bring to a boil, and reduce heat to low. Simmer, stirring constantly, until sugar has melted and the glaze has thickened, about 8 minutes. Season to taste with salt and pepper.\n",
        "picture_link": "nTB3YrchKEG5oS2A8h0SG4BK8/zDvh2"
    },
    {
        "title": "California Taco Dip",
        "ingredients": [
            "3 large avocados, peeled and pitted ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "2 tablespoons mayonnaise ADVERTISEMENT",
            "1 (1.25 ounce) package taco seasoning mix (such as Lawry's®) ADVERTISEMENT",
            "1 (16 ounce) can refried beans ADVERTISEMENT",
            "1 cup shredded Mexican blend cheese ADVERTISEMENT",
            "2 chopped green onion tops ADVERTISEMENT",
            "2 tomatoes, seeded and diced ADVERTISEMENT",
            "1 (2.25 ounce) can sliced black olives, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a bowl, mash the avocados and mix in the lemon juice. In a separate bowl, mix the sour cream, mayonnaise, and taco seasoning.\nSpread the refried beans over the bottom of a large serving platter or bowl. Top with avocado mixture. Spread sour cream mixture over the avocado, and sprinkle with cheese. Layer cheese with green onions (just the green part), then tomatoes, and top with the olives. Cover, and chill in the refrigerator 2 to 4 hours before serving.\n",
        "picture_link": "FKWkhibZuXbmq.g.qdAtlYAbt.8mY6G"
    },
    {
        "title": "Delish Sloppy Joes",
        "ingredients": [
            "2 pounds ground beef ADVERTISEMENT",
            "1 (10.75 ounce) can condensed tomato soup (such as Campbell's®) ADVERTISEMENT",
            "2 tablespoons brown sugar, or to taste ADVERTISEMENT",
            "1/4 teaspoon Worcestershire sauce, or to taste ADVERTISEMENT",
            "2 tablespoons distilled white vinegar ADVERTISEMENT",
            "8 hamburger buns, split and toasted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium-high heat, and stir in the ground beef. Cook and stir until the beef is crumbly, evenly browned, and no longer pink. Drain and discard any excess grease.\nStir in the condensed tomato soup, brown sugar, Worcestershire sauce, and vinegar. Cook and stir until thick, about 5 minutes. Adjust seasoning to taste, and serve on the toasted hamburger buns.\n",
        "picture_link": "2F2o5BmlLp9LJUFBY5YsARKhYELSltW"
    },
    {
        "title": "Pumpkin Pecan Pancakes",
        "ingredients": [
            "1 1/2 cups whole wheat pastry flour ADVERTISEMENT",
            "1/2 cup multigrain hot cereal (uncooked) ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "3/4 cup pureed pumpkin ADVERTISEMENT",
            "3/4 cup plain yogurt ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3/4 cup finely chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a bowl, combine whole wheat pastry flour, multigrain hot cereal, and baking powder.\nIn a second bowl, beat eggs and combine with milk, pumpkin, yogurt, vanilla extract, sugar and salt. Add wet ingredients to dry, being careful not to overmix the batter. Fold in pecans.\nHeat a lightly oiled griddle or frying pan over medium-high heat. Pour or scoop the batter onto the griddle, using approximately 1/4 cup for each pancake. Bubbles will start to form in the pancakes. Cook until the edges of the pancakes start to look dry, and a bubble popped near the edge holds its shape. Flip the pancakes over, and continue cooking until the other side is golden brown. Repeat with remaining batter, adding more oil to the griddle if necessary. Stack the pancakes on a plate and keep warm until serving. For larger batches, keep pancakes warm in a single layer on a cooling rack positioned over a baking sheet in a 300 degrees F oven (150 degrees C).\n",
        "picture_link": "75m0U4MGzQLL/oRX7Z7JcUa2I60m0cm"
    },
    {
        "title": "Creamy Drunken Mushroom Pork Chops",
        "ingredients": [
            "4 thick cut bone-in pork chops ADVERTISEMENT",
            "1 (10.75 ounce) can reduced-fat, reduced-sodium cream of mushroom soup ADVERTISEMENT",
            "1 (3 ounce) can chopped mushrooms, drained ADVERTISEMENT",
            "1/3 cup red wine ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the pork chops in the bottom of a slow cooker. Stir the mushroom soup, mushrooms, red wine, garlic, and pepper together in a bowl; pour over the pork chops. Cover and cook on Low 6 to 8 hours.\n",
        "picture_link": "317r/BFD8x7hcTSHmJn4W/1KheDddwa"
    },
    {
        "title": "Hawaiian Beef Casserole",
        "ingredients": [
            "2 tablespoons cooking oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 (19 ounce) can kidney beans with liquid ADVERTISEMENT",
            "1 (19 ounce) can pineapple chunks with juice ADVERTISEMENT",
            "1 cup ketchup ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "2 teaspoons ground mustard ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C).\nHeat the oil in a skillet over medium heat; cook the onion in the hot oil until softened, about 5 minutes. Crumble the ground beef into the skillet and cook and stir until completely browned, 5 to 7 minutes. Drain.\nStir the kidney beans with liquid, pineapple with juice, ketchup, brown sugar, cornstarch, mustard, and salt together in a large bowl. Add the ground beef and onions to the mixture and stir to coat. Pour into a large casserole dish.\nBake in the preheated oven until completely heated through, about 45 minutes.\n",
        "picture_link": "rwVGhX7WVcy26aaaTua1G31xxggEVWu"
    },
    {
        "title": "Twilight Dark Chocolate Truffles",
        "ingredients": [
            "1 cup heavy cream ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "4 (1 ounce) squares baking chocolate ADVERTISEMENT",
            "2 3/4 cups semi-sweet chocolate chips ADVERTISEMENT",
            "2 tablespoons instant espresso powder (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the heavy cream, butter, baking chocolate, chocolate chips, and espresso powder in a saucepan over medium heat; stirring constantly, cook until the chocolate has melted into a smooth and thick mixture. Remove from heat. Pour into a bowl and chill in refrigerator until the mixture hardens, about 1 hour\nLine a baking sheet with waxed paper. Scoop small balls of the chocolate mixture onto the waxed paper. Store in refrigerator until the balls harden completely. Store in a cool, dry place.\n",
        "picture_link": "bC4sKCcbC1x/wmynR9iKVGHW2HbWr8."
    },
    {
        "title": "Mexican Hot Carrots",
        "ingredients": [
            "6 carrots, peeled and sliced ADVERTISEMENT",
            "1 (16 ounce) jar sliced jalapeno peppers, with liquid ADVERTISEMENT",
            "2 onions, thinly sliced ADVERTISEMENT",
            "1 cup vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the carrots in a saucepan with enough water to cover and cook over medium heat until nearly boiling, 7 to 10 minutes. Immediately drain the carrots and set aside to cool.\nDivide the cooled carrots into two 1-quart glass jars. Alternate layers of onion and jalapeno peppers atop the carrots until the jars are full.\nMix the liquid from the jalapeno peppers and the vinegar in a saucepan; bring the mixture to a rolling boil. Remove from heat and pour the liquid into the jars until full. Seal the jars with lids. Place the jars in the refrigerator until cold, at least 8 hours.\n",
        "picture_link": "cLrjUJ3/2pe8gXqmp0WSapsOh2KF2Ya"
    },
    {
        "title": "Lighter Chocolate Chip Pancakes",
        "ingredients": [
            "1 3/4 cups white whole wheat flour ADVERTISEMENT",
            "1/4 cup wheat germ ADVERTISEMENT",
            "2 tablespoons baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 3/4 cups skim milk ADVERTISEMENT",
            "1/4 cup margarine, melted ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "3 tablespoons demerara sugar ADVERTISEMENT",
            "1/2 cup semisweet chocolate chips ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine flour, wheat germ, baking powder, and salt in a large bowl. Set bowl aside. In a separate bowl, whisk together the skim milk, melted margarine, eggs, and sugar. Make a well in the center of the dry ingredients; stir in the wet ingredients, being careful not to over mix the batter. Gently fold in the chocolate chips.\nHeat a large skillet over medium heat, and coat with cooking spray. Pour 1/4 cupfuls of batter onto the skillet, and cook until bubbles appear on the surface. Flip with a spatula, and cook until golden brown on the other side.\n",
        "picture_link": "TAeFHfsski98HhBb9ABsfHV3xNq4Uve"
    },
    {
        "title": "Turkey Soup with Root Vegetables",
        "ingredients": [
            "1 roast turkey carcass, cut into pieces ADVERTISEMENT",
            "12 cups cold water ADVERTISEMENT",
            "3 stalks celery, chopped ADVERTISEMENT",
            "2 carrots, chopped ADVERTISEMENT",
            "1 Spanish onion, chopped ADVERTISEMENT",
            "1/4 bunch Italian parsley ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "12 whole black peppercorns ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 red onion, chopped ADVERTISEMENT",
            "2 stalks celery, diced ADVERTISEMENT",
            "2 carrots, diced ADVERTISEMENT",
            "1 large parsnip, peeled and diced ADVERTISEMENT",
            "1/2 pound rutabagas, peeled and diced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons minced Italian parsley ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "1 cup uncooked orzo pasta ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring the turkey carcass and water to a boil in a large pot over high heat. Skim off and discard any scum that forms. Add the chopped celery, chopped carrots, chopped Spanish onion, 1/4 bunch parsley, bay leaves, and peppercorns and return to a simmer. Reduce heat to medium-low and simmer uncovered for 3 hours. Strain the turkey broth through a mesh sieve and skim off any fat that floats to the surface.\nHeat the olive oil in a large pot over medium heat. Stir in the red onion; cook until the onion has softened and turned translucent, about 5 minutes. Add the diced celery, diced carrots, parsnip, and rutabaga; cook 5 minutes more. Stir in the garlic and chopped parsley, and cook for 1 minute more. Pour in the turkey broth, season to taste with salt and pepper, and bring to a simmer over high heat.\nReduce heat to medium-low and simmer until the vegetables are nearly tender, 15 to 20 minutes. Stir in the orzo and cook until just tender, about 7 minutes. Cover and remove the pot from the heat. Let stand until the orzo is tender, about 5 minutes.\n",
        "picture_link": "zhnq1LTuLnO3MTiToAAIC84jUxIDbdi"
    },
    {
        "title": "Tomato Chicken",
        "ingredients": [
            "8 chicken thighs ADVERTISEMENT",
            "4 tomatoes, quartered ADVERTISEMENT",
            "8 cloves garlic, minced ADVERTISEMENT",
            "4 teaspoons minced fresh ginger root ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1 pinch ground turmeric ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon coconut oil (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the chicken, tomatoes, garlic, ginger, chili powder, turmeric, and salt in a large, heavy pot over high heat; cook and stir until the chicken begins to brown; reduce heat to medium-low and allow mixture to simmer until the chicken is no longer pink in the center and the juices run clear, about 45 minutes. Sprinkle with coconut oil to serve.\n",
        "picture_link": "a/ZlWbDpEOfBWyh9XlGbhZiCy6Evk8C"
    },
    {
        "title": "Ethiopian Vegetable Bowl",
        "ingredients": [
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon ground cloves ADVERTISEMENT",
            "1 teaspoon fenugreek seeds ADVERTISEMENT",
            "1 head garlic, minced ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3 large onions, chopped ADVERTISEMENT",
            "4 large carrots, cubed ADVERTISEMENT",
            "4 large potatoes, cubed ADVERTISEMENT",
            "1/4 head cabbage, chopped ADVERTISEMENT",
            "2 cups tomato puree ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a large skillet over medium-high heat. Stir in the ginger, turmeric, black pepper, cloves, fenugreek, garlic, and one teaspoon salt. Continue to stir until the spices and garlic are well coated in oil, about 30 seconds. Stir in the onions; cook, stirring, until translucent, about 5 minutes. Add the carrots, potatoes, and cabbage; cook, stirring frequently, until the vegetables begin to soften, about 3 minutes.\nStir in the tomato puree and the water. Continue to cook over very low heat, until vegetables are soft and the tomato sauce thickens, about 30 to 40 minutes. Taste for seasoning and add additional salt and pepper, if needed.\n",
        "picture_link": "Gz3WiTjUVpEC4upl9jk1uqYjx9G1NqG"
    },
    {
        "title": "Mexican Chorizo",
        "ingredients": [
            "2 pounds boneless pork butt (shoulder), cut into 3/4-inch pieces ADVERTISEMENT",
            "1 1/2 tablespoons crushed Aleppo peppers ADVERTISEMENT",
            "1 1/2 tablespoons chili powder ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1/4 teaspoon ground coriander ADVERTISEMENT",
            "1/2 cup distilled white vinegar ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the pork, Aleppo pepper, chili powder, garlic, salt, black pepper, oregano, cumin, cloves, and coriander into a bowl, and lightly toss the pork with the seasonings until thoroughly blended. Cover the bowl, and refrigerate the meat, your meat grinder's head assembly, and grinder hopper for 1 hour.\nFill a large mixing bowl with ice cubes, and place a smaller metal bowl in the ice cubes to catch the ground meat. Assemble the chilled meat grinder, and grind the pork and seasonings using a coarse cutting plate. Return ground meat to refrigerator for 30 minutes. Lightly stir the ground pork with the vinegar and water until thoroughly mixed, form into patties, and refrigerate overnight, covered, to let flavors develop.\nHeat vegetable oil in a heavy skillet over medium-low heat, and pan-fry the patties until browned and no longer pink in the middle, 5 to 8 minutes per side.\n",
        "picture_link": "pR0YnoDHAFe3unNcfYjq2JKN1jR52fK"
    },
    {
        "title": "Japanese Sesame Steak Sauce",
        "ingredients": [
            "1/4 cup tahini ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "1 tablespoon mayonnaise ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 1/2 teaspoons ground ginger ADVERTISEMENT",
            "1 pinch paprika ADVERTISEMENT",
            "1/4 cup water, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk the tahini, soy sauce, mayonnaise, garlic, ginger, and paprika together in a bowl. Gradually stir the water into the mixture until you reach a desired consistency. Refrigerate until ready to use.\n",
        "picture_link": "9Jh13A0PLoIW4gJTt1eP7nKzCO/z8Du"
    }
]