[
    {
        "title": "Panamanian Gingerbread (Yiyimbre)",
        "ingredients": [
            "7 1/4 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/2 cup vegetable shortening ADVERTISEMENT",
            "3/4 pound fresh ginger root, minced ADVERTISEMENT",
            "2 pints molasses ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 450 degrees F (230 degrees C). Grease and flour a 15x20-inch baking dish. Whisk together the flour, salt, and baking powder in a bowl.\nMix together the shortening, ginger, and molasses until smooth. Stir in the flour mixture until no dry lumps remain. Pour into the prepared baking dish.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 40 to 45 minutes. Let cool for 15 minutes. Cut into 2-inch squares. Cool 2 to 3 more hours before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Rarebit Savories",
        "ingredients": [
            "8 slices bacon ADVERTISEMENT",
            "1/2 pound aged Cheddar cheese, cubed ADVERTISEMENT",
            "1 onion, cut into chunks ADVERTISEMENT",
            "2 teaspoons mayonnaise ADVERTISEMENT",
            "1 teaspoon dry mustard powder ADVERTISEMENT",
            "60 slices sandwich bread, cut into rounds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble and set aside.\nPlace the bacon, Cheddar cheese, onion, mayonnaise, and mustard into the bowl of a food processor; process until well blended. Scoop into a container, cover, and refrigerate several hours to overnight to allow the flavors to blend.\nAdjust oven rack to the topmost position, and set oven to Broil.\nSpread the bread rounds evenly with cheese mixture and place onto a cookie sheet. Toast under the broiler until browned and puffed, 5 to 8 minutes. Serve immediately.\n",
        "picture_link": "HlPBVyWuuSZp4peDOWniE51rJQKjOEO"
    },
    {
        "title": "Salvadorian Roasted Turkey",
        "ingredients": [
            "10 large Roma (plum) tomatoes, halved and seeded ADVERTISEMENT",
            "1 large green bell pepper, halved and seeded ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 (10 pound) whole turkey, neck and giblets removed ADVERTISEMENT",
            "1 Granny Smith apple - peeled, quartered, and cored ADVERTISEMENT",
            "1 (5 ounce) jar pitted green olives, drained ADVERTISEMENT",
            "2 dried ancho chiles, stemmed and seeded ADVERTISEMENT",
            "1/2 cup raw pumpkin seeds ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "1 onion, cut into chunks ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place an oven rack in the topmost position and preheat oven on the broil setting. Line a baking sheet with aluminum foil.\nPlace tomatoes and bell pepper onto the baking sheet, cut-side down. Broil on top rack of preheated oven until the skins begin to blacken, about 5 minutes. Place charred vegetables into a bowl and seal with plastic wrap to steam until their skins loosen. Lower oven rack to accommodate a roasting pan, and turn oven to 325 degrees F (165 degrees C).\nMeanwhile, pour vegetable oil into a roasting pan (or skillet large enough to fit the turkey), and place over medium-high heat. When hot, add the turkey and sear on all sides until browned, about 10 minutes. Once the turkey has been browned, place breast side up into the roasting pan, and stuff with quartered apples and olives. Set aside.\nHeat a skillet over medium-high heat. Add the ancho chiles, pumpkin seeds, and bay leaves. Cook and stir until the pumpkin seeds begin to smell toasted, about 5 minutes, then pour the mixture into a blender.\nOnce the tomatoes and peppers have steamed enough that the skins have loosened, remove and discard the skins. Place tomatoes, green peppers, and onion into the blender with the pumpkin seeds. Blend until you have a thick, smooth sauce. Season with salt and pepper to taste, adding a little liquid from the olives if desired.\nBrush the sauce onto the turkey, and place into preheated oven. Cook until a meat thermometer inserted in the meaty part of the thigh reads 180 degrees F (80 degrees C), about 3 hours, basting occasionally.\n",
        "picture_link": "q..qcL/t0XGtelaJxzSKwsK0OGgou6W"
    },
    {
        "title": "Indian-Style Vegetable Rice",
        "ingredients": [
            "3 tablespoons corn oil ADVERTISEMENT",
            "1 onion, finely chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 cup chopped red bell pepper ADVERTISEMENT",
            "3 whole cloves ADVERTISEMENT",
            "1 cup long grain rice ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "1 tablespoon salt, or to taste ADVERTISEMENT",
            "1 tablespoon cayenne pepper ADVERTISEMENT",
            "1 cup chopped fresh broccoli ADVERTISEMENT",
            "1/2 cup corn kernels ADVERTISEMENT",
            "1/2 cup fresh green beans, cut into 1 inch pieces ADVERTISEMENT",
            "1/2 carrot, chopped ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "1 1/2 tablespoons ground black pepper ADVERTISEMENT",
            "1/4 cup roasted cashews ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the corn oil in a large saucepan over medium-high heat. Stir in the onion, garlic, red bell pepper, and whole cloves. Cook and stir until the onion has softened and begun to brown, about 10 minutes. Stir in the rice, and cook for 1 minute, stirring constantly. Add 4 cups of water, salt, and cayenne pepper. Bring to a boil, then reduce heat to medium-low, cover, and simmer until the rice is tender, about 20 minutes.\nMeanwhile, place the broccoli, corn, green beans, carrot, and 1/4 cup water into a microwave-safe bowl. Cover, and cook in the microwave at full power until the vegetables are tender, 2 to 4 minutes depending on the microwave. Once the rice has finished cooking, gently stir the vegetables into the rice along with the turmeric, black pepper, and cashews. Sprinkle with cilantro to serve.\n",
        "picture_link": "Gma443pXcBErt8ojp5f9IiCQqG0QpY6"
    },
    {
        "title": "Candied Walnut Salad with Walnut Vinaigrette",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "12 ounces walnut halves ADVERTISEMENT",
            "1/2 cup apple cider vinegar ADVERTISEMENT",
            "2 tablespoons chopped fresh chives ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1 1/4 teaspoons chopped fresh dill ADVERTISEMENT",
            "1 tablespoon chopped fresh chervil ADVERTISEMENT",
            "1/2 cup walnut oil ADVERTISEMENT",
            "1/2 cup peanut oil ADVERTISEMENT",
            "10 ounces arugula leaves or spring mix ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground multi-colored peppercorns to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C). Line a baking sheet with foil.\nMelt butter in a small saucepan over medium heat. Stir in brown sugar, and cook until the sugar has melted and turned deep brown - but not burnt, 5 to 8 minutes.\nOnce the sugar has browned, stir in walnut halves until coated with caramelized sugar. Spread out onto prepared baking sheet, and place into preheated oven. Cook until the center of the walnuts have just turned a light golden brown, about 5 minutes. Once done, remove from the oven and allow to cool until warm or room temperature.\nWhisk the vinegar together with the chives, parsley, dill, and chervil. Whisk in walnut and peanut oils until well combined.\nTo serve, toss the arugula with enough dressing to moisten in a large bowl. Season to taste with salt and pepper. Place onto salad plates and garnish with candied walnuts.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Thanksgiving-Style Turkey Meatloaf",
        "ingredients": [
            "2 pounds ground turkey ADVERTISEMENT",
            "2 eggs, beaten slightly ADVERTISEMENT",
            "1 onion, coarsely chopped ADVERTISEMENT",
            "3/4 cup regular rolled oats ADVERTISEMENT",
            "1/2 cup fresh green beans, chopped ADVERTISEMENT",
            "1/2 cup fresh cranberries, chopped ADVERTISEMENT",
            "1 teaspoon dried rosemary ADVERTISEMENT",
            "1 teaspoon bay leaf, crumbled ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 pound thinly sliced pancetta ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon freshly grated nutmeg ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/2 cup chicken broth ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease a 9x9 inch square baking dish.\nMix the ground turkey with the eggs, onion, rolled oats, green beans, cranberries, rosemary, and bay leaf in a large bowl. Use your hands to thoroughly blend the ingredients. Season to taste with salt and pepper. Spread the ground turkey mixture over the bottom of the prepared dish. Top with a layer of pancetta.\nBake the meatloaf in preheated oven for 45 minutes to 1 hour. Check for doneness when juices run clear, and an internal thermometer inserted into the meatloaf reaches 160 degrees F (70 degrees C).\nMeanwhile, to make the gravy, melt the butter in a pan over medium heat. Stir in the flour, and cook for 1 to 2 minutes until the mixture becomes paste-like and light brown. Stir in the garlic, cinnamon, and nutmeg. Gradually whisk in the milk and chicken broth, bringing the mixture to a boil. Lower the heat to medium, and continue cooking and whisking until desired thickness is reached. Season to taste with salt and pepper. Serve spooned over sliced meatloaf.\n",
        "picture_link": "ZOTwLWOnb5lTGJ4p7rMbUdPM2Ua7Qza"
    },
    {
        "title": "Anise Seed Rolls",
        "ingredients": [
            "2 cups milk ADVERTISEMENT",
            "2 (.25 ounce) envelopes active dry yeast ADVERTISEMENT",
            "1 quart water, divided ADVERTISEMENT",
            "2/3 cup shortening ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 teaspoons anise seeds ADVERTISEMENT",
            "8 cups all-purpose flour, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the milk into a pan, and heat just until bubbles form around the edge of the pan. Remove from heat and cool to lukewarm (110 degrees F/45 degrees C).\nDissolve yeast in 1 cup lukewarm (110 degrees F/45 degrees C) water. Allow to rest 5 minutes.\nBeat the shortening with the sugar, eggs, salt, and anise seeds in a large mixing bowl. Stir in the milk and yeast mixture. Gradually mix in the flour, stirring to make a soft dough (dough should not be sticky). Add more flour if needed. Cover bowl with a clean cloth, and let dough rise in a warm place until doubled in size, about 1 1/2 hours.\nLightly grease 2 baking sheets. Punch down dough, divide into two pieces, and roll out each piece into a rectangle about 1/2 inch thick. Cut dough into 8x1 inch strips. Twist each strip into a simple knot, and place on prepared baking sheet. Cover with a clean cloth, and allow to rise until doubled in size, about 1 hour.\nPreheat oven to 400 degrees F (200 degrees C).\nPour 1 quart water into a pan and bring to a boil over high heat. Dip each roll quickly into the boiling water, and return to baking sheet.\nBake rolls in preheated oven until tops are golden brown, 10 to 15 minutes.\n",
        "picture_link": "Tu8cAU1dd755sE57Ys38DB98ih67eA2"
    },
    {
        "title": "Flowering Vidalia Onion",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "1 teaspoon cayenne pepper ADVERTISEMENT",
            "1/4 teaspoon dried thyme ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 large Vidalia or other sweet onion, peeled ADVERTISEMENT",
            "1/2 cup creamy salad dressing (such as Miracle Whip™) ADVERTISEMENT",
            "2 tablespoons prepared horseradish ADVERTISEMENT",
            "2 teaspoons ketchup ADVERTISEMENT",
            "1/4 teaspoon paprika ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1/8 teaspoon dried oregano ADVERTISEMENT",
            "1/4 teaspoon black pepper ADVERTISEMENT",
            "1 quart vegetable oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the flour, 1 teaspoon salt, 1/2 teaspoon black pepper, 1 teaspoon cayenne pepper, and thyme in a bowl, and set aside. Whisk together the egg and milk in a separate small bowl, and set aside.\n\"Flower\" the onion by cutting 1 inch off of the top of the onion, leaving the root intact. Make slices in the onion from top to bottom, 1/2 inch apart, making sure not to cut the roots. Gently separate the pieces of the onion making it look like a blossom. Dip the onion flower into the milk mixture, making sure to moisten all of the \"petals\". Coat the flower with the seasoned flour, and gently shake off any excess flour. Place the onion onto a plate, and refrigerate for 45 minutes.\nStir together the creamy salad dressing, horseradish, ketchup, paprika, 1/4 teaspoon salt, 1/4 teaspoon cayenne pepper, oregano, and 1/4 teaspoon black pepper to make the dipping sauce for the onion.\nHeat the frying oil in deep-fryer to 350 degrees F (175 degrees C).\nFry the onion in the hot oil until the onion is tender on the inside, and crispy golden brown on the outside, 10 to 12 minutes. Drain upside down on a paper towel-lined plate for several minutes before serving with the sauce.\n",
        "picture_link": "EpJzQxBqqZR9c4VJ/WUPIcB..j6qCDS"
    },
    {
        "title": "Gooey Toasted PB and J's",
        "ingredients": [
            "3 tablespoons peanut butter ADVERTISEMENT",
            "2 tablespoons strawberry jelly ADVERTISEMENT",
            "2 tablespoons marshmallow creme ADVERTISEMENT",
            "4 slices bread ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together peanut butter, strawberry jelly, and marshmallow creme until just combined. Spread the peanut butter mixture on 2 slices of bread, and top with the remaining 2 bread slices.\nMelt the butter in a skillet over medium-high heat, and fry sandwiches, turning once, until golden brown on both sides, about 3 minutes per side. Remove from heat, cut in half, and serve.\n",
        "picture_link": "FvFPFzJhjF5IipKcdnogySAFUWJf.Mm"
    },
    {
        "title": "The Fabulous",
        "ingredients": [
            "1 cup ice cubes ADVERTISEMENT",
            "1 1/4 fluid ounces raspberry vodka ADVERTISEMENT",
            "3 fluid ounces club soda ADVERTISEMENT",
            "1 fluid ounce lemon-lime soda ADVERTISEMENT",
            "1 lime twist ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a rocks glass with ice, and pour in the vodka, club soda, and lemon-lime soda. Top with a lime twist and serve with a straw.\n",
        "picture_link": "PGyqTlTHQKL.vyZkrg91bYRGkAcU0h6"
    },
    {
        "title": "Gambas Pil Pil (Prawns, Chilean Style)",
        "ingredients": [
            "10 cloves garlic, peeled and slightly crushed ADVERTISEMENT",
            "1/2 cup grapeseed oil or olive oil ADVERTISEMENT",
            "1 1/2 pounds large shrimp, peeled and deveined ADVERTISEMENT",
            "1 cacho de cabra pepper, or Anaheim pepper, seeded and cut into 1/2-inch pieces ADVERTISEMENT",
            "3 tablespoons pisco or brandy ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "cayenne pepper to taste ADVERTISEMENT",
            "1 lime, cut into wedges, for serving ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the garlic cloves and grapeseed oil in a skillet over medium-high heat. Let the garlic slowly turn golden brown as the oil becomes hot; continue cooking until the garlic has turned golden-brown, and the oil is quite hot.\nAdd the shrimp, stir to coat with oil, and cook for 15 seconds before stirring in the chile pepper. Continue to cook until shrimp is pink and firm. Pour in pisco, and cook for 30 seconds to let the alcohol evaporate. Season with salt to taste, then pour the mixture into a serving dish. Serve sprinkled with cayenne pepper, and garnished with lime wedges.\n",
        "picture_link": "sPeazOzxVBmiksl6bdOvfjk.gkoiQg."
    },
    {
        "title": "Fried Gorgonzola Olives",
        "ingredients": [
            "1 (15 ounce) can jumbo pitted black olives, drained ADVERTISEMENT",
            "4 ounces soft Gorgonzola cheese ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 cup Italian-style dry bread crumbs ADVERTISEMENT",
            "oil for deep frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Drain olives well on paper towels. Place Gorgonzola cheese in a pastry bag, or a heavy plastic bag, and squirt into each olive.\nWhisk together the eggs and milk; place the bread crumbs in a shallow bowl. Dip olives in the egg mixture, shake off the excess, and roll in bread crumbs to coat; set aside.\nHeat at least 4 inches of oil in a large pot to 375 degrees F (190 degrees C).\nFry olives in hot oil until golden brown and drain on paper towels. Allow to cool slightly before serving.\n",
        "picture_link": "JQw9.uR4Lkrw6JzO0jPIntMEw3mdcJy"
    },
    {
        "title": "Goat Cheese Torta",
        "ingredients": [
            "1/4 cup sweetened shredded coconut ADVERTISEMENT",
            "1/4 cup chopped pecans ADVERTISEMENT",
            "1 (8 ounce) package reduced-fat cream cheese ADVERTISEMENT",
            "1 (8 ounce) package goat cheese ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 cup whole berry cranberry sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line a 6-inch springform pan with plastic wrap, and sprinkle half of the coconut and pecans evenly onto the bottom. Beat together the cream cheese, goat cheese, honey, and cinnamon in a bowl until no lumps of cheese remain. Spread half of the cheese into the springform pan, then spread the cranberry sauce on top. Carefully spread the remaining cheese over the cranberry sauce, and sprinkle with the remaining coconut and pecans. Cover the torta with a sheet of plastic wrap, and press down firmly to pack. Refrigerate overnight before serving. Remove the springform pan and plastic wrap to serve.\n",
        "picture_link": "hAEn2Wh0TkxwGYWjlOiN.qXJWFMvBiC"
    },
    {
        "title": "Couscous Gourmet",
        "ingredients": [
            "1 1/4 cups water ADVERTISEMENT",
            "1 (10 ounce) box whole wheat couscous with flaxseed ADVERTISEMENT",
            "5 teaspoons butter ADVERTISEMENT",
            "1 teaspoon chopped fresh basil, or to taste ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 pound fresh asparagus, trimmed and cut into thirds ADVERTISEMENT",
            "1 zucchini, sliced ADVERTISEMENT",
            "1 red bell pepper, cut into strips ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 sprig fresh basil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water to a boil in a saucepan and stir in couscous. Bring back to a boil, reduce heat to low, cover the pan, and simmer couscous until water is absorbed, about 5 minutes. Remove from heat and allow to stand covered for about 5 more minutes to let couscous dry.\nStir butter and 1 teaspoon basil lightly into couscous until butter is melted; set couscous aside.\nHeat olive oil in a skillet over medium heat; cook and stir asparagus, zucchini, red bell pepper, and garlic in the hot oil until the vegetables are tender and just starting to brown, about 10 minutes. Season with salt and black pepper.\nPack the couscous tightly into a measuring cup or bowl; place serving platter face down on top of the cup, invert the platter, and remove cup to turn couscous out onto the platter in a rounded shape.\nArrange cooked vegetables around the mound of couscous; place 1 sprig of basil in center of couscous to serve.\n",
        "picture_link": "DVihSzLrvQZPuV.eW3jyt1BANbTfCPm"
    },
    {
        "title": "My Pickled Little Smokies",
        "ingredients": [
            "2 (14 ounce) packages little smoked sausages ADVERTISEMENT",
            "1 1/2 cups distilled white vinegar ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 teaspoon pickling salt ADVERTISEMENT",
            "1 teaspoon pickling spice, or more to taste ADVERTISEMENT",
            "1 teaspoon whole mustard seeds ADVERTISEMENT",
            "1 teaspoon celery seeds ADVERTISEMENT",
            "1 teaspoon dill seeds ADVERTISEMENT",
            "1 small onion, thickly sliced ADVERTISEMENT",
            "1 clove garlic, minced, or to taste ADVERTISEMENT",
            "20 whole black peppercorns ADVERTISEMENT",
            "2 tablespoons pickled banana pepper rings (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the sausages into a saucepan, cover with water, and bring to a boil. Reduce heat to medium-low and simmer for 20 minutes, poking sausages with a sharp fork to release fat. Drain and rinse the sausages.\nPlace the sausages into a 1-quart glass canning jar.\nPour white vinegar and water into a saucepan, and stir in the pickling salt, pickling spice, mustard seeds, celery seeds, dill seeds, onion slices, garlic, black peppercorns, and banana pepper rings.\nBring to a boil over medium heat and cook for 5 minutes, stirring often.\nPour the vinegar mixture over the sausages in the jar; cap the jar, and refrigerate at least 3 days before serving.\n",
        "picture_link": ".TkZpHv0qp8JGcrosxIgLwX14oaGxAe"
    },
    {
        "title": "Chipotle Chicken Sandwich",
        "ingredients": [
            "2 teaspoons olive oil ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 tablespoon red wine vinegar ADVERTISEMENT",
            "1 tablespoon fresh lime juice ADVERTISEMENT",
            "1/2 teaspoon white sugar ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 green onion, chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/3 cup light mayonnaise ADVERTISEMENT",
            "1 tablespoon canned chipotle peppers in adobo sauce, seeded and minced ADVERTISEMENT",
            "1 1/2 tablespoons chopped green onion ADVERTISEMENT",
            "1 1/2 tablespoons sweet pickle relish ADVERTISEMENT",
            "8 slices sourdough bread ADVERTISEMENT",
            "4 slices mozzarella cheese ADVERTISEMENT",
            "1 cup torn lettuce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large skillet over medium heat and pan-fry chicken breasts until browned and no longer pink inside, about 10 minutes per side.\nSprinkle chicken breasts with red wine vinegar, lime juice, sugar, salt, black pepper, 1 chopped green onion, garlic, and oregano; pan-fry until green onion is soft, an additional 5 minutes per side. Transfer chicken breasts to a plate and keep warm.\nPlace light mayonnaise and chipotle pepper into a blender and blend until smooth. Transfer to a bowl and stir in 1 1/2 tablespoon of chopped green onion and sweet pickle relish.\nToast sourdough bread slices.\nLayer 4 bread slices each with 1/4 cup of lettuce, a chicken breast, and 1 mozzarella cheese slice. Spread remaining slices with chipotle mayonnaise and place on top to make sandwiches. Serve while still warm.\n",
        "picture_link": "PHCmgY9MwSzG0Q7tjbKSdG9oVRcsAn."
    },
    {
        "title": "Wholesome Buckwheat Crepes",
        "ingredients": [
            "2/3 cup raw buckwheat groats ADVERTISEMENT",
            "water, to cover ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup water, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine buckwheat groats with about 1 1/3 cup water in a bowl; allow to soak, draining and rinsing once or twice during soaking, 4 hours to overnight.\nRinse and drain groats one final time. Transfer drained groats to a blender with egg, brown sugar, cinnamon, salt, and 1/2 cup water; blend into a smooth batter. Blend more water into the mixture as needed to reach a smooth, spreadable texture.\nLightly grease a skillet and place over medium heat.\nPour about 1/3 cup batter into the skillet; lift and tilt the skillet to swirl the batter evenly over the skillet; return to heat.\nCook for about 2 minutes. Gently flip the crepe and cook the other side until the crepe is firm in the middle, about 2 minutes more; flip again and cook about 12 seconds. Plate and serve immediately.\n",
        "picture_link": "dUMVyt.u09rd5Ry6eGGjYetyygEdZFe"
    },
    {
        "title": "Green Apple, Jicama, and Prawn Salad with Mint, Lemongrass, and Dijon Dressing",
        "ingredients": [
            "12 medium shrimp ADVERTISEMENT",
            "1 cup matchstick-cut Granny Smith apple ADVERTISEMENT",
            "1 cup matchstick-cut jicama ADVERTISEMENT",
            "1/2 cup matchstick-cut carrots ADVERTISEMENT",
            "1/2 cup fresh mint leaves ADVERTISEMENT",
            "1/2 cup extra virgin olive oil ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "2 tablespoons white vinegar ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "1 teaspoon chopped garlic ADVERTISEMENT",
            "1 teaspoon chopped lemongrass ADVERTISEMENT",
            "2 sprigs cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a small pot of water to boil. Cook shrimp in boiling water until they are bright pink on the outside and the meat is no longer transparent in the center, 3 to 5 minutes; drain.\nRinse shrimp with cold water to cool completely. Peel, devein, and slice shrimp in half lengthwise; set aside in a bowl.\nToss apple, jicama, and carrots together in a large bowl.\nPlace mint leaves, olive oil, sugar, vinegar, Dijon mustard, garlic, and lemongrass in a food processor. Pulse until blended but slightly chunky, about two 10-second intervals.\nPour dressing over apple mixture; toss until well mixed. Cover salad and shrimp separately with plastic wrap; refrigerate until ready to serve.\nMix shrimp into salad before serving; garnish with cilantro.\n",
        "picture_link": "SDCJkOfOxG7mEbFt/OpD1CuFgS08p0a"
    },
    {
        "title": "Cajun Kale and Rice",
        "ingredients": [
            "1 1/4 cups chicken broth ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 teaspoon garlic pepper blend ADVERTISEMENT",
            "1 teaspoon cayenne pepper ADVERTISEMENT",
            "1 cup shredded kale ADVERTISEMENT",
            "1/2 cup uncooked rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir chicken broth, salt, oregano, paprika, garlic pepper blend, and cayenne pepper together in a pot over medium heat; bring to a boil\nStir kale and rice into the boiling broth mixture; return the broth to a boil, place a cover on the pot, reduce heat to low, and continue cooking at a simmer until the rice is cooked through and tender, 20 to 25 minutes.\n",
        "picture_link": "TmIWMr6myMXXaveicirQkzkDS5PzuS."
    },
    {
        "title": "Healthy-ish Irish Oatmeal Cookies",
        "ingredients": [
            "1 1/4 cups coconut oil ADVERTISEMENT",
            "1/2 cup firmly packed brown sugar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups whole wheat flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon coarse salt ADVERTISEMENT",
            "3 cups quick-cooking Irish oatmeal (such as McCann's®) ADVERTISEMENT",
            "1 egg, beaten (optional) ADVERTISEMENT",
            "1/2 cup golden raisins ADVERTISEMENT",
            "1/2 cup chopped almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nGrease 18 muffin cups with coconut oil.\nBeat coconut oil, brown sugar, and white sugar with an electric mixer in a large bowl until smooth. Mix in the flour mixture until just incorporated.\nBeat 1 egg and vanilla extract into the coconut oil mixture.\nWhisk flour, baking soda, and coarse salt together in a bowl; beat into the coconut oil mixture until a dough forms.\nFold oatmeal, raisins, and almonds into dough. Mix beaten egg into dough if needed for moisture.\nSpoon dough into prepared muffin cups to about half full.\nBake in preheated oven until center is set and top is lightly browned, 12 to 14 minutes.\n",
        "picture_link": "zCwCOsBu7LyXZmvppKMKfAGne0yoG.y"
    },
    {
        "title": "Honey-Roasted Potatoes and Mushrooms",
        "ingredients": [
            "1 pound potatoes, cut into bite-sized chunks ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 pound cremini mushrooms, trimmed and halved ADVERTISEMENT",
            "1/2 white onion, chopped ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1 teaspoon dried rosemary ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "1/8 teaspoon dried sage ADVERTISEMENT",
            "1 pinch dry mustard powder ADVERTISEMENT",
            "1 pinch garlic powder ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nPlace potato chunks into a 9x13-inch baking dish, drizzle with olive oil, and toss potatoes to coat.\nBake in the preheated oven for 10 minutes.\nRemove from oven, and stir cremini mushrooms, onion, honey, rosemary, thyme, sage, mustard powder, garlic powder, salt, and black pepper into the potatoes.\nReturn baking dish to oven and bake until mushrooms and potatoes are tender, about 15 more minutes.\n",
        "picture_link": "6uTT0Nhw.koNXt7j/5lF8..PsOsG44q"
    },
    {
        "title": "Spotted Dog Irish Bread",
        "ingredients": [
            "5 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "2 2/3 tablespoons baking powder ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "2 cups raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C).\nGrease a 12-inch cast iron skillet.\nSift flour, sugar, and baking powder together in a large bowl.\nBeat eggs with milk in a separate bowl.\nStir egg mixture into flour mixture until moistened; batter will be very thick.\nFold in raisins until thoroughly combined.\nSpread batter into prepared cast iron skillet.\nBake in the preheated oven until bread has risen and is golden brown on top, about 1 hour.\n",
        "picture_link": "dCQOYLX1HJNuqAM50AWMjaEK.LO5kzq"
    },
    {
        "title": "Delicious Spicy Micheladas",
        "ingredients": [
            "1 (64 ounce) bottle tomato and clam juice cocktail (such as Clamato®) ADVERTISEMENT",
            "1 (12 fluid ounce) can frozen orange juice concentrate, thawed ADVERTISEMENT",
            "5 limes, juiced ADVERTISEMENT",
            "1/3 cup Worcestershire sauce ADVERTISEMENT",
            "1/2 cup hot sauce (such as Valentina® or Tabasco®) ADVERTISEMENT",
            "3 tablespoons ground black pepper ADVERTISEMENT",
            "1 1/2 teaspoons cayenne pepper, or to taste ADVERTISEMENT",
            "2 tablespoons salt ADVERTISEMENT",
            "salt for rimming glasses ADVERTISEMENT",
            "24 wedges lime ADVERTISEMENT",
            "ice cubes ADVERTISEMENT",
            "24 (12 fluid ounce) cans Mexican beer ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine tomato and clam juice cocktail, thawed frozen orange juice concentrate, and lime juice in a large pitcher; mix.\nStir the Worcestershire sauce, hot sauce, black pepper, cayenne pepper, and 2 tablespoons salt through the cocktail mixture until the salt has dissolved.\nPour 1/4 cup salt for rimming glasses onto a small, shallow plate. Moisten the rim of a large beer glass with a wedge of lime, dip the moistened rim into the salt. Tap off excess.\nFill the rimmed glass with ice. Pour 1/3 to 1/2 cup michelada mix, or to taste, over the ice. Fill the rest of the glass with beer and stir to serve.\n",
        "picture_link": "NvYIk7pNB3xScg4Ff5wBaEvzCm5XE/K"
    },
    {
        "title": "Natalie's Amazing Irish Potato Soup",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "3 stalks celery, chopped ADVERTISEMENT",
            "1 cup chopped green onion ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 (2 pound) package frozen hash brown potatoes, thawed ADVERTISEMENT",
            "1 (10.5 ounce) can chicken broth ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of celery soup ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a soup pot over medium heat. Cook and stir celery, green onions, salt, and black pepper in melted butter until slightly tender, about 5 minutes.\nStir potatoes, chicken broth, and water with celery mixture. Bring to a boil over medium-high heat, cover, and lower heat to a simmer until vegetables are softened, about 30 minutes.\nStir cream of celery soup, cream of chicken soup, milk with the potatoes mixture. Season with salt and pepper. Cook until heated through, stirring occasionally, 5 to 10 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Vinny's Red Kidney Bean Salad",
        "ingredients": [
            "2 cups red kidney beans, drained ADVERTISEMENT",
            "1 (5 ounce) can tuna, drained and flaked ADVERTISEMENT",
            "1/4 cup chopped red onion ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 teaspoon dried parsley ADVERTISEMENT",
            "1 teaspoon curry powder ADVERTISEMENT",
            "salt and ground black pepper to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine kidney beans, tuna, and red onion in a bowl.\nStir olive oil, parsley, curry powder, salt, and black pepper into kidney bean mixture until well combined.\n",
        "picture_link": "OtcGCXGp7g9K6tbmEyW7je5aGa8vfC2"
    },
    {
        "title": "Creole Coffee ",
        "ingredients": [
            "1 cup hot brewed coffee with chicory ADVERTISEMENT",
            "1 tablespoon molasses ADVERTISEMENT",
            "1 tablespoon half and half, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour coffee into a large mug; stir in the molasses and half-and-half cream until smooth.\n",
        "picture_link": "NCETfxDnqg2vaqlms8JH5uhoiLZy5RO"
    },
    {
        "title": "Apple Tapioca Pudding ",
        "ingredients": [
            "4 cups apples - peeled, cored and sliced ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "3/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 tablespoons small pearl tapioca ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "1 cup boiling water ADVERTISEMENT",
            "1/2 cup raisins (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the apples, brown sugar, cinnamon, salt, and tapioca into a bowl, and toss to coat apple slices.\nPlace the apple mixture into a slow cooker. Pour lemon juice and boiling water over the apples.\nSet the cooker to High and cook until apples are tender and thickened, 3 to 4 hours.\nMix in raisins if desired; serve warm.\n",
        "picture_link": "FJeVKRSdGO1aSdTZj6Ky0RgwrgDspxK"
    },
    {
        "title": "Baked Chicken Oscar Dinner (Yep, the Whole Shebang)",
        "ingredients": [
            "6 skinless, boneless chicken breast halves ADVERTISEMENT",
            "12 small red potatoes ADVERTISEMENT",
            "2 tablespoons olive oil, divided ADVERTISEMENT",
            "2 teaspoons sea salt ADVERTISEMENT",
            "2 teaspoons garlic powder ADVERTISEMENT",
            "2 teaspoons lemon and herb seasoning ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "6 slices Havarti cheese, folded in half ADVERTISEMENT",
            "3 (.9 ounce) packages hollandaise sauce mix (such as Knorr®) ADVERTISEMENT",
            "3 cups milk ADVERTISEMENT",
            "3/4 cup butter ADVERTISEMENT",
            "1 teaspoon ground white pepper ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1 pinch garlic powder (optional) ADVERTISEMENT",
            "1 pound fresh asparagus, trimmed ADVERTISEMENT",
            "1 (8 ounce) package imitation crabmeat, chopped ADVERTISEMENT",
            "1/4 teaspoon paprika ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nPlace chicken breasts into a 9x13-inch baking dish.\nPlace red potatoes into a separate 8x8-inch baking dish.\nDrizzle 1 tablespoon olive oil over chicken breasts and 1 tablespoon oil over potatoes.\nCombine sea salt, 2 teaspoons garlic powder, lemon and herb seasoning, onion powder, 1 teaspoon dried basil, and black pepper in a small bowl. Sprinkle chicken and potatoes each with half the seasoning mix.\nCover both baking dishes with aluminum foil.\nBake chicken and potatoes in the preheated oven for 40 to 45 minutes; remove chicken and top each breast with a folded slice of Havarti cheese. Return chicken to oven and bake until Havarti cheese is melted, chicken is no longer pink inside and juices juices run clear, about 5 more minutes.\nRemove chicken and potatoes from oven and allow to rest covered for 5 minutes.\nWhisk hollandaise sauce mix with milk in a saucepan over medium heat; bring to a boil and stir in butter until melted. Reduce heat to low and simmer sauce until thickened, about 1 minute. Remove from heat and stir in white pepper, 1 teaspoon dried basil, and 1 pinch garlic powder.\nPlace asparagus into a skillet over medium heat. Pour water into skillet about 1-inch deep and bring to a boil. Cover skillet and steam asparagus just until tender but still bright green, 2 to 4 minutes.\nTo serve, place each chicken breast onto a serving plate and top breasts with imitation crab meat.\nPour about 2 tablespoons of hollandaise sauce over each serving and place several spears of asparagus on top; drizzle 2 more tablespoons of sauce over each portion. Serve remaining hollandaise sauce on the side. Garnish with a pinch of paprika and serve with 2 red potatoes on each serving plate.\n",
        "picture_link": "QyevMg0xZzQHrcdwaKxb826e3XkcWha"
    },
    {
        "title": "Fluffy Strawberry Pie",
        "ingredients": [
            "1 (3 ounce) package strawberry-flavored Jell-O® mix ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/2 cup boiling water ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "2 1/2 cups sliced fresh strawberries ADVERTISEMENT",
            "1 (9 inch) prepared graham cracker crust ADVERTISEMENT",
            "4 fresh strawberries, halved (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix strawberry-flavored gelatin mix, sugar, and boiling water together in a large bowl, stirring until gelatin and sugar have dissolved.\nRefrigerate gelatin mixture until it begins to turn thick and syrupy, about 10 minutes.\nGently fold frozen whipped topping into the gelatin mixture until thoroughly combined.\nFold the 2 1/2 cups of sliced strawberries into the whipped topping mixture.\nSpoon filling into the graham cracker crust and decorate edge of filling with 8 strawberry halves.\nRefrigerate at least 2 hours before serving.\n",
        "picture_link": "ni.PjlhQPnCO.cem19q8odPWlrU6QAm"
    },
    {
        "title": "Ham and Asparagus Brunch Bake",
        "ingredients": [
            "3 cups biscuit baking mix (such as Bisquick®) ADVERTISEMENT",
            "1 teaspoon dried tarragon ADVERTISEMENT",
            "1 teaspoon dry mustard powder ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "2 pounds fresh asparagus, tough ends trimmed ADVERTISEMENT",
            "1 cup cubed fully-cooked Black Forest ham ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1 cup Parmesan cheese, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nGrease a 9x13-inch baking dish.\nCombine baking mix, tarragon, dry mustard, and black pepper in a bowl.\nWhisk eggs and milk together in a separate bowl; pour the egg mixture into the baking mix and seasonings, and whisk until smooth.\nPour half the batter into the bottom of the prepared baking dish.\nArrange half the asparagus spears over the batter.\nTop asparagus spears with ham and onion; sprinkle on 1/2 cup of Parmesan cheese.\nPour the remaining batter over the Parmesan cheese, and arrange the remaining asparagus spears on top. Sprinkle casserole with remaining 1/2 cup Parmesan cheese.\nBake in the preheated oven until the casserole is golden brown and a toothpick inserted into the center comes out clean, 35 to 40 minutes.\n",
        "picture_link": ".Pi5W3d2LiMeXjzk5HEYgrEu3ekoU3O"
    },
    {
        "title": "Irish Cream Truffles",
        "ingredients": [
            "1 cup heavy cream ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 (16 ounce) package semisweet chocolate chips ADVERTISEMENT",
            "1 tablespoon Irish cream liqueur ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk heavy cream and sugar together in a small saucepan over medium heat. Heat until the edges of the cream show fine bubbles but mixture does not boil, allowing sugar to dissolve. Remove from heat.\nWhisk butter, chocolate chips, and Irish cream into cream mixture until butter and chocolate chips are melted. Cool to room temperature.\nScoop up the chocolate mixture about 1 tablespoon at a time and roll into a 1-inch ball; set truffles on a plate.\nRefrigerate until firm, about 1 hour.\n",
        "picture_link": "e11kG7Nk5TlmKTE0y43QpI76ycSO.Jq"
    },
    {
        "title": "Garlic Asparagus Soup",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "5 cloves garlic, thinly sliced ADVERTISEMENT",
            "4 green onions, coarsely chopped ADVERTISEMENT",
            "1 1/2 pounds asparagus, trimmed and coarsely chopped ADVERTISEMENT",
            "2 (14 ounce) cans vegetable broth ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a saucepan over medium heat.\nCook and stir garlic and green onions in saucepan until garlic is just golden, about 3 minutes.\nCook and stir asparagus with garlic and green onions until slightly softened, about 2 more minutes.\nPour in vegetable broth and bring to a boil. Reduce heat and simmer until asparagus is tender, about 10 minutes. Turn off heat and allow to cool slightly.\nPour soup into blender, filling no more than halfway full. Cover with a lid. Carefully start the blender, using a few quick pulses to get soup moving before leaving it on to puree. Puree in batches until smooth.\nTransfer soup back to saucepan and reheat. Season with salt and ground black pepper to taste.\n",
        "picture_link": "bGN/Y5FZMAbT9zJEDiC.uxIY6nqq7La"
    },
    {
        "title": "Garlic Potato Soup",
        "ingredients": [
            "3 1/2 cups Swanson® Chicken Broth (Regular, Natural Goodness® or Certified Organic) ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "4 medium red potatoes, cut into cubes ADVERTISEMENT",
            "2 medium carrots, diced ADVERTISEMENT",
            "1 medium onion, chopped ADVERTISEMENT",
            "1 stalk celery, chopped ADVERTISEMENT",
            "2 slices bacon, cooked and crumbled ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 cup instant mashed potato flakes or buds ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the broth, garlic,potatoes, carrots, onion, celery and bacon in a 4-quart saucepan over medium-high heat to a boil. Reduce the heat to low. Cover and cook for15 minutes or until the vegetables are tender.\nReduce the heat to medium. Stir the milk, potato flakes and parsley in the saucepan. Cook until the mixture is hot and bubbling, stirring occasionally.\n",
        "picture_link": "vm7.4RKaiNu.oMextbCbuPz050RahqS"
    },
    {
        "title": "Amazing Apple Butter",
        "ingredients": [
            "10 pounds apples, quartered ADVERTISEMENT",
            "4 cups unsweetened apple juice ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 tablespoon apple cider vinegar ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1/2 teaspoon ground allspice ADVERTISEMENT",
            "6 half-pint canning jars with lids and rings ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine apples and apple juice in a stockpot; bring to a boil. Reduce heat and cook at a simmer until apples are soft and mushy, 20 to 30 minutes.\nSpoon apples into a food mill and process into puree while discarding the cores and peels remaining in the mill. Transfer process apples to a slow cooker.\nCook on High with the lid off until the moisture evaporates and the volume reduces by about half, overnight to 24 hours.\nStir sugar, apple cider vinegar, cinnamon, cloves, and allspice through the apple puree.\nContinue cooking on High until mixture mounds on a chilled plate without any water separating from the edges, another 2 to 6 hours.\nSterilize the jars and lids in boiling water for at least 5 minutes. Pack the apple butter into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings.\nPlace a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process 5 to 10 minutes.\nRemove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area.\n",
        "picture_link": "kd6XaDhDa6DyvRSP.aprstxVf9cd2nG"
    },
    {
        "title": "Catfish Po Boy",
        "ingredients": [
            "Coleslaw: ADVERTISEMENT",
            "1 (16 ounce) package shredded coleslaw mix ADVERTISEMENT",
            "1/4 cup pickled pepperoncini peppers, chopped ADVERTISEMENT",
            "1/4 cup diced red onion ADVERTISEMENT",
            "1/3 cup mayonnaise ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "1 tablespoon red wine vinegar ADVERTISEMENT",
            "1 teaspoon Dijon mustard ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 tablespoon granulated garlic ADVERTISEMENT",
            "1/2 teaspoon granulated onion ADVERTISEMENT",
            "1/4 teaspoon lemon pepper ADVERTISEMENT",
            "Catfish: ADVERTISEMENT",
            "8 (3 ounce) fillets catfish ADVERTISEMENT",
            "2 tablespoons hot sauce (such as Tabasco®) ADVERTISEMENT",
            "1/2 cup Cajun seasoning ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 cups cornmeal ADVERTISEMENT",
            "2 cups bread crumbs ADVERTISEMENT",
            "1 tablespoon granulated garlic ADVERTISEMENT",
            "1 tablespoon granulated onion ADVERTISEMENT",
            "1 1/2 teaspoons ground black pepper ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "1 cup olive oil for frying ADVERTISEMENT",
            "Assembly: ADVERTISEMENT",
            "4 Italian-style hoagie buns, split lengthwise ADVERTISEMENT",
            "1 cup remoulade-style sandwich spread (see footnote for recipe link) ADVERTISEMENT",
            "1 lemon, cut into wedges ADVERTISEMENT",
            "1 cup cherry tomato halves ADVERTISEMENT",
            "1/2 cup banana pepper rings ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine coleslaw mix, pepperoncini peppers, red onion, mayonnaise, lemon juice, red wine vinegar, Dijon mustard, sugar, salt, 1/2 teaspoon granulated garlic, 1/2 teaspoon granulated onion, and lemon pepper in a large bowl. Toss until well combined. Cover and refrigerate until ready to use.\nPlace catfish fillets in a large shallow baking dish. Sprinkle hot sauce over the top and turn the fillets to coat.\nCombine Cajun seasoning, flour, cornmeal, bread crumbs, 1 tablespoon granulated garlic, 1 tablespoon granulated onion, black pepper, and cayenne pepper in a large brown paper bag. Add catfish fillets and shake gently to coat fillets thoroughly.\nHeat olive oil in a large skillet over medium-high heat. Fry breaded catfish fillets until browned and crisp, about 3 minutes per side. Place on paper towel-lined paper plates to drain.\nSpread each hoagie bun with 1/4 cup remoulade-style spread. Place 2 catfish fillets on top and top with 1 to 2 cups coleslaw. Garnish with lemon wedge, cherry tomato halves, and banana pepper rings.\n",
        "picture_link": "I3.cKGfX9HecVlPHQtTIeqmFomwJDSy"
    },
    {
        "title": "Pecan Pie Pancake Syrup",
        "ingredients": [
            "1/2 cup water ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat water in a saucepan over medium-low heat; cook and stir white sugar into hot water until dissolved, about 5 minutes. Stir brown sugar and salt into the sugar mixture until dissolved; stir in butter.\nWhisk eggs and vanilla together in a bowl until smooth; stir 2 to 3 tablespoons hot sugar mixture into eggs, 1 tablespoon at a time, to slowly bring eggs up to temperature without cooking them. Slowly stir egg mixture into saucepan of sugar mixture. Fold in pecans.\nIncrease temperature to medium heat; cook and stir mixture until thickened and bubbling, about 5 minutes. Reduce heat to low before serving.\n",
        "picture_link": "8/U2dphBZU7naEA1kq0NXEQoALwy7c2"
    },
    {
        "title": "Slow Cooked Goose",
        "ingredients": [
            "1 bunch celery, chopped ADVERTISEMENT",
            "1 (12 ounce) package baby carrots, chopped ADVERTISEMENT",
            "1 cup cream of celery soup ADVERTISEMENT",
            "1 cup cream of chicken soup ADVERTISEMENT",
            "1 cup cream of mushroom soup ADVERTISEMENT",
            "1 cup cut-up mushrooms ADVERTISEMENT",
            "8 fresh sage leaves ADVERTISEMENT",
            "3 tablespoons fresh rosemary ADVERTISEMENT",
            "2 tablespoons fresh thyme ADVERTISEMENT",
            "2 (10 pound) goose, cut up ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix celery, carrots, cream of celery soup, cream of chicken soup, cream of mushroom soup, mushrooms, sage, rosemary, and thyme in a bowl.\nPut goose pieces in a slow cooker. Pour soup and vegetable mixture over the goose.\nCook on High until goose is tender, 6 to 8 hours.\n",
        "picture_link": "6ADaVWRW7HKsOxhSS669dHo082Vd8xu"
    },
    {
        "title": "Curried Stuffed Acorn Squash",
        "ingredients": [
            "2 acorn squash, halved and seeded ADVERTISEMENT",
            "1 tablespoon olive oil, or as needed ADVERTISEMENT",
            "1/2 cup diced red bell pepper ADVERTISEMENT",
            "1/2 cup sliced daikon radish ADVERTISEMENT",
            "1/4 cup sliced leek ADVERTISEMENT",
            "1/4 cup diced celery ADVERTISEMENT",
            "1 jalapeno pepper, diced ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "2 cups vegetable stock ADVERTISEMENT",
            "1 cup brown rice ADVERTISEMENT",
            "1 cup chopped collard greens ADVERTISEMENT",
            "1 tablespoon curry powder ADVERTISEMENT",
            "1 1/2 teaspoons red curry paste ADVERTISEMENT",
            "1/4 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup crumbled feta cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Wrap each squash half with plastic wrap.\nPlace wrapped squash, cut side down, in microwave; cook on high until squash is tender, 12 to 15 minutes. Leave squash wrapped while preparing filling.\nHeat olive oil in a large skillet over medium heat; cook and stir red bell pepper, radish, leek, celery, jalapeno pepper, and garlic in the hot oil until softened, about 10 minutes. Add vegetable stock and rice; stir to combine. Cover and simmer until broth is absorbed and rice is tender, about 45 minutes.\nSprinkle greens into rice mixture; cover and simmer until greens are wilted, about 5 minutes. Add curry powder, curry paste, and walnuts to rice mixture; stir to combine.\nUnwrap squash and set halves, cut sides up, into 4 soup bowls. Spoon about 2 tablespoons feta cheese into each squash half. Add a large scoop of rice mixture atop feta layer. Top rice mixture layer with any leftover feta.\n",
        "picture_link": "lA0FXxZ2Fa2WSz0mMeqKcdPiO.hgDi."
    },
    {
        "title": "Golden Soft Pretzels",
        "ingredients": [
            "2 (.25 ounce) packages active dry yeast ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 cups warm water (110 to 115 degrees F/43 to 46 degrees C) ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "6 1/2 cups all-purpose flour, or as needed ADVERTISEMENT",
            "5 cups water ADVERTISEMENT",
            "1/2 cup baking soda ADVERTISEMENT",
            "1 tablespoon coarse sea salt, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dissolve yeast and sugar in 2 cups warm water in a large bowl; let stand until bubbling, about 10 minutes. Beat butter, egg, and 1 teaspoon salt into yeast mixture until smooth. Mix in 2 cups flour to make a wet dough. Stir remaining flour into dough, 1 cup at a time, to make a stiff dough. Form dough into a ball.\nGrease a large bowl and turn dough around in greased bowl to coat. Cover lightly with a kitchen towel, place in a warm area, and let dough rise until doubled, at least 1 hour. Punch dough down.\nPreheat oven to 400 degrees F (200 degrees C). Grease baking sheets.\nDivide dough in half; cut each half into 8 pieces. Roll pieces out on a floured surface into ropes about 1/2-inch thick. Shape each rope into a pretzel.\nBring 5 cups water to a boil in a large saucepan and dissolve baking soda in the boiling water. Boil pretzels, a few at a time, in the baking soda water for 10 minutes. Arrange pretzels on prepared baking sheets and sprinkle with coarse sea salt.\nBake in the preheated oven until pretzels are shiny and golden brown, 15 to 20 minutes.\n",
        "picture_link": "hmQS5.x4vJnu1fkrje9rNUsx.7jiAwq"
    },
    {
        "title": "Swiss Cheese Green Bean Casserole",
        "ingredients": [
            "1 1/2 pounds fresh green beans, trimmed and snapped ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 tablespoons grated onion ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 cups sour cream ADVERTISEMENT",
            "8 ounces coarsely shredded Swiss cheese ADVERTISEMENT",
            "2 cups corn flakes, crushed ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nPlace a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add green beans, cover, and steam until slightly tender, about 5 minutes.\nStir 2 tablespoons butter, flour, onion, sugar, and salt together in a saucepan over medium heat; gradually stir in sour cream. Cook and stir mixture until hot, thickened, and smooth, about 10 minutes. Add steamed green beans to the cream mixture. Pour green bean-cream mixture into a 2-quart casserole dish; sprinkle with Swiss cheese.\nMix corn flakes and 2 tablespoons butter in a bowl until well coated; sprinkle over Swiss cheese layer.\nBake in the preheated oven until cheese is bubbling and topping is browned, about 20 minutes.\n",
        "picture_link": "WSAyattnOhw.ctKl8Kt2Md9sbh4wsz6"
    },
    {
        "title": "Fresh Apple Cake by MeMom",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "2 1/2 cups white sugar ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground allspice ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "1 tablespoon pure vanilla extract ADVERTISEMENT",
            "4 cups sliced apples ADVERTISEMENT",
            "1 1/2 cups chopped pecans ADVERTISEMENT",
            "1/2 cup margarine ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 tablespoon pure vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a fluted tube pan.\nMix 3 cups all-purpose flour, white sugar, baking soda, cinnamon, allspice, salt, cloves, and nutmeg together in a bowl.\nBeat eggs in a separate large bowl; add vegetable oil, buttermilk, and 1 tablespoon vanilla. Beat until smooth. Pour egg mixture into flour mixture; stir together with a large spoon. Fold apples and pecans into batter. Pour batter into the prepared pan.\nBake in the preheated oven until a knife inserted in the center of the cake comes out clean, 60 to 75 minutes. Cool cake in pan.\nCook and stir margarine and brown sugar together in a saucepan over medium heat until sugar is dissolved, about 5 minutes. Add 2 tablespoons flour; stir constantly until combined. Stir in milk and 1 tablespoon vanilla. Cook and stir until thickened, 5 minutes.\nInvert cake onto a plastic cake carrier or container; poke holes over entire cake using a knife. Pour hot icing over entire cake. Pour any remaining icing into the center of the cake. The icing will absorb into the cake overnight.\n",
        "picture_link": "qHicvY7BvgDz8un/wjn2/yVuaX/Mkzm"
    },
    {
        "title": "Amazingly Delicious Prime Rib",
        "ingredients": [
            "2 tablespoons olive oil, or as needed ADVERTISEMENT",
            "1 (7 pound) beef prime rib roast ADVERTISEMENT",
            "2 teaspoons dried rosemary ADVERTISEMENT",
            "2 teaspoons coffee beans ADVERTISEMENT",
            "2 teaspoons lemon pepper ADVERTISEMENT",
            "2 teaspoons ground black pepper ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nRub olive oil generously over all sides of prime rib roast. Grind rosemary with coffee beans in a spice grinder and sprinkle the mixture over the roast. Sprinkle lemon pepper and black pepper over the meat, followed by garlic powder and onion powder. Place roast into a large roasting pan and cover with non-stick aluminum foil.\nRoast in the preheated oven for 1 hour and 15 minutes. Uncover and continue roasting until meat is browned and an instant-read meat thermometer inserted into the thickest part of the roast reads at least 145 degrees F (65 degrees C), about 1 hour and 15 more minutes. Let roast rest for at least 10 minutes before slicing.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Iced Mocha Cola",
        "ingredients": [
            "ice, or as needed ADVERTISEMENT",
            "1 tablespoon instant coffee granules ADVERTISEMENT",
            "1 (12 fluid ounce) can or bottle cola-flavored carbonated beverage, or as needed. ADVERTISEMENT",
            "1 1/2 fluid ounces half-and-half ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a tall glass with ice. Add instant coffee granules. Slowly pour cola into the glass. Gently stir half-and-half into the cola to integrate.\n",
        "picture_link": "nsqUtQYmte7665d4FXG1hQPlPnuvqTO"
    },
    {
        "title": "Grandma's Corn Flake Coconut Macaroons",
        "ingredients": [
            "1 egg white ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup shredded coconut ADVERTISEMENT",
            "1 cup cornflakes cereal ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C).\nGrease a baking sheet.\nBeat egg white in a bowl with an electric hand-mixer until stiff peaks form.\nGradually beat sugar, 1 tablespoon at a time, into egg whites until fully incorporated. Stir salt and vanilla extract into egg whites until thoroughly mixed.\nFold coconut and corn flakes into the mixture.\nDrop coconut mixture by the teaspoon onto the prepared baking sheet.\nBake cookies in the preheated oven until lightly crisp, 20 minutes.\nTransfer cookies to wire rack to cool, at least 15 minutes.\n",
        "picture_link": "TBs1DoGGgL8yWpRX9hO6sbxRDbigEBS"
    },
    {
        "title": "Southwestern Falafel",
        "ingredients": [
            "1 quart vegetable oil for frying, or as needed ADVERTISEMENT",
            "1 onion, quartered ADVERTISEMENT",
            "1 small green bell pepper, chopped ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "3 cloves garlic ADVERTISEMENT",
            "1 (1.25 ounce) package dry taco seasoning mix ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "2 teaspoons peanut oil ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "1 (16 ounce) can pinto beans, drained ADVERTISEMENT",
            "1 dash hot sauce, or to taste ADVERTISEMENT",
            "1 cup dry bread crumbs, or more as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat vegetable oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C).\nPlace onion, green bell pepper, egg, garlic, taco seasoning, baking powder, peanut oil, cumin, salt, and cayenne pepper in a food processor. Puree until smooth.\nPour pinto beans into mixture and pulse until pinto beans are chopped and integrated, but not smooth.\nTransfer bean mixture to a large bowl; stir hot sauce into mixture.\nStir enough bread crumbs into mixture to form a dough that holds together, but isn't sticky.\nForm dough into quarter-sized balls.\nDeep-fry in hot oil until falafel are deep brown, about 3 to 5 minutes.\n",
        "picture_link": "6pzCiV0ZYDYScty7c2Jg8BnksXHyjeC"
    },
    {
        "title": "Frankenburgers",
        "ingredients": [
            "2 teaspoons olive oil ADVERTISEMENT",
            "3 tablespoons diced red bell pepper ADVERTISEMENT",
            "3 tablespoons minced red onion ADVERTISEMENT",
            "2 small garlic cloves, minced ADVERTISEMENT",
            "1 cup cooked black beans ADVERTISEMENT",
            "4 1/2 teaspoons prepared yellow mustard ADVERTISEMENT",
            "2 teaspoons flour ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a skillet over medium heat; cook and stir diced red bell pepper, red onion, and garlic in the hot oil until soft, 5 to 7 minutes.\nCombine the bell pepper mixture, black beans, mustard, flour, chili powder, cumin, salt, and black pepper in a food processor; blend until the beans are completely mashed.\nForm the mixture into 2 patties.\nCook the patties in a skillet over medium heat until heated through, 4 to 5 minutes per side.\n",
        "picture_link": "ZWjplw4Aa3d81Tf8VsWdigU5pBpvyEG"
    },
    {
        "title": "Boston Creme Mini-Cupcakes",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 (18.25 ounce) box yellow cake mix ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1 (3.5 ounce) package instant French vanilla pudding ADVERTISEMENT",
            "2 cups cold milk ADVERTISEMENT",
            "1 (16 ounce) can prepared chocolate frosting ADVERTISEMENT",
            "1 cup whipped cream (optional) ADVERTISEMENT",
            "6 maraschino cherries, quartered (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSpray 24 mini muffin cups with cooking spray.\nStir yellow cake mix, water, eggs, and vegetable oil in a bowl until moistened. Beat with an electric mixer on medium speed for 2 minutes.\nSpoon cake batter into the prepared mini muffin cups, filling them about 2/3 full.\nBake in the preheated oven until cupcakes have risen and are lightly golden brown, 15 to 19 minutes. Check for doneness after 10 minutes. A toothpick inserted into the center of a cupcake should come out clean. Allow cupcakes to cool for about 20 minutes.\nWhisk instant French vanilla pudding mix and milk together in a bowl for 2 minutes. Allow pudding to stand for 5 more minutes to thicken.\nPipe the vanilla pudding into each cupcake with about 1 1/4 teaspoon vanilla pudding.\nFreeze filled cupcakes for at least 1 hour to make frosting them easier.\nSpread a very thin coating of chocolate frosting over each cupcake; refrigerate cupcakes for 15 minutes.\nSpread second, thicker layer of frosting over the first layer. Place small dollop of whipped cream into center of each frosted cupcake and top with a quarter of a maraschino cherry. Refrigerate mini cupcakes until serving time.\n",
        "picture_link": "sWj.3z33sMS66l.6ZpCqgLNayLgINEK"
    },
    {
        "title": "Potato and Mustard Greens Salad",
        "ingredients": [
            "2 1/2 pounds Yukon Gold potatoes, peeled and halved ADVERTISEMENT",
            "4 cloves garlic, peeled and sliced ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/3 cup white wine vinegar ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 teaspoon sambal oelek (Thai chile paste) or plain hot sauce ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "1/2 cup chopped cornichons ADVERTISEMENT",
            "1 cup washed and cut mustard greens ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Boil potatoes and garlic in a large pot of salted water until just tender, 15 to 20 minutes. Drain and let cool to room temperature. Discard the garlic.\nWhisk mayonnaise, vinegar, olive oil, and sambal oelek together in a large bowl. Season with salt and pepper to taste.\nRoughly chop cooled potatoes into a large bowl. Add cornichons, mustard greens, and mayonnaise mixture. Toss to coat. Cover and set aside in the refrigerator for 1 hour. Season with salt and pepper to taste.\n",
        "picture_link": "5ivlVj/Hmi/2Oc1vPgnlWFApYTpGsTe"
    },
    {
        "title": "Lettuce-Free Salad",
        "ingredients": [
            "1 (15 ounce) can garbanzo beans, drained and rinsed twice ADVERTISEMENT",
            "1 (15 ounce) can red kidney beans, drained and rinsed twice ADVERTISEMENT",
            "2 (15 ounce) cans quartered artichoke hearts, drained ADVERTISEMENT",
            "2 large cucumbers, chopped ADVERTISEMENT",
            "2 large tomatoes, chopped ADVERTISEMENT",
            "1 (8 ounce) package feta cheese ADVERTISEMENT",
            "2 tablespoons chopped fresh dill ADVERTISEMENT",
            "1/2 cup fat free Italian-style dressing (such as Wishbone®) ADVERTISEMENT",
            "2 (15 ounce) cans sliced beets, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine garbanzo beans, red kidney beans, and artichoke hearts in a large bowl.\nTop bean mixture with cucumbers and tomatoes.\nCrumble feta cheese over the top.\nSprinkle dill onto feta cheese layer.\nStir Italian dressing into the mixture.. Arrange beets around the sides to serve.\n",
        "picture_link": "Ml4yoSWTwguCVMFXZ8/zLKlm48b2Cm."
    },
    {
        "title": "Classic Red Velvet Cupcakes",
        "ingredients": [
            "1 package Duncan Hines® Red Velvet Cake Mix ADVERTISEMENT",
            "1 1/4 cups water ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "3 large eggs ADVERTISEMENT",
            "1 (16 ounce) container Duncan Hines® Creamy Home-Style Cream Cheese Frosting ADVERTISEMENT",
            "Sprinkles or additional garnishes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F. Grease muffin pans or line with paper baking cups.\nBlend dry mix, water, oil and eggs in large bowl at low speed until moistened (about 30 seconds). Beat at medium speed for 2 minutes. Spoon batter into muffin pan or paper cups.\nBake cupcakes for 19-22 minutes. Add 3-5 minutes to bake time for dark or coated pans. Cupcakes are done when toothpick inserted in center comes out clean.\nCool in pan on wire rack for 15 minutes. Cool completely before frosting.\nGarnish, and enjoy!\n",
        "picture_link": "7CWulti7CS0LudLZ78cItHTBcjaMayS"
    },
    {
        "title": "My Grandmother's Cabbage and Noodles",
        "ingredients": [
            "3 cups water ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 (12 ounce) package bacon, chopped ADVERTISEMENT",
            "1 head cabbage, cored and chopped ADVERTISEMENT",
            "1 (8 ounce) package egg noodles ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place water and butter in a large, deep skillet and bring to a boil; stir in bacon and return to a boil.\nStir cabbage into the bacon mixture; simmer until the thickest pieces of cabbage are fork-tender and the liquid has almost evaporated, about 20 minutes. Drain.\nFill a large pot with lightly salted water and bring to a rolling boil. Stir in egg noodles and return to a boil. Cook noodles uncovered, stirring occasionally, until tender but still slightly firm, about 5 minutes. Drain well.\nLightly toss egg noodles with bacon and cabbage; season to taste with salt and black pepper.\n",
        "picture_link": "bTQ1nrpt978/Z6ot5dkEy6wdUHpQ3PS"
    },
    {
        "title": "Minced Collops",
        "ingredients": [
            "1 pound lean ground beef ADVERTISEMENT",
            "1/2 onion, minced ADVERTISEMENT",
            "1 teaspoon salt, to taste ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "2/3 cup steel-cut oats ADVERTISEMENT",
            "1 1/2 cups beef stock ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Crumble the ground beef into a skillet over medium heat; add onion, salt, and pepper. Cook and stir the ground beef until no longer pink, 7 to 10 minutes.\nStir oats into beef mixture to coat in beef drippings. Pour beef stock over beef mixture; bring to a boil, place cover on the skillet, and reduce heat to low. Cook at a simmer until the oats are cooked, about 30 minutes.\nStir Worcestershire sauce through the beef mixture to serve.\n",
        "picture_link": "Tm9k3s2uV65K6eSQLuLUAzAM69QynYe"
    },
    {
        "title": "Little Ann's Peach and Blueberry Pie",
        "ingredients": [
            "1 pastry for a double-crust 9-inch pie ADVERTISEMENT",
            "3 cups sliced peaches ADVERTISEMENT",
            "1 cup blueberries ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 tablespoons quick-cooking tapioca ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 tablespoons butter, cut into pieces ADVERTISEMENT",
            "1 egg yolk, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Place one pie crust on the bottom of a pie plate.\nToss peach slices and blueberries in a large bowl with lemon juice. Combine sugar, tapioca, and salt in a small bowl; pour over peach mixture and toss to coat. Transfer to prepared pie plate and scatter butter pieces over fruit. Cover pie with remaining crust; press and seal the top and bottom crusts.\nCut several slits in the top crust to allow steam to escape, then brush with egg yolk.\nBake in preheated oven until golden brown, 45 to 50 minutes.\n",
        "picture_link": "xKaUPpoMrBdSZN9HbhW12VBX0PeizUu"
    },
    {
        "title": "Black-Eyed Pea Bratwurst Stew",
        "ingredients": [
            "2 pounds bratwurst sausages, cut into thirds ADVERTISEMENT",
            "2 (15 ounce) cans black-eyed peas, rinsed and drained ADVERTISEMENT",
            "2 (9 ounce) packages frozen cut green beans, thawed ADVERTISEMENT",
            "2 cups cubed potatoes ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 (32 fluid ounce) container chicken stock ADVERTISEMENT",
            "2 tablespoons hot Buffalo wing sauce (such as Frank's® REDHOT Buffalo Wing Sauce), or to taste ADVERTISEMENT",
            "2 tablespoons ketchup ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1/2 teaspoon ground thyme ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 cup all-purpose flour (optional) ADVERTISEMENT",
            "1 cup water (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bratwurst sausages, black-eyed peas, green beans, potatoes, onion, garlic, chicken stock, Buffalo wing sauce, ketchup, Worcestershire sauce, thyme, salt, and black pepper in a slow cooker.\nCook on High setting until vegetables are tender and soup is thickened, 3 to 4 hours.\nFor a thicker stew, whisk flour and water together in a bowl until smooth. Pour mixture into stew and simmer until thickened, about 5 minutes.\n",
        "picture_link": "PCLoME8IaqEMIHR.HRX7T4APdbMy2JC"
    },
    {
        "title": "Spicy and Savory Slow Cooker Beef Ragout",
        "ingredients": [
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 tablespoon Cajun seasoning blend (such as Tony Chachere's®) ADVERTISEMENT",
            "1 pound cubed lean beef stew meat ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 (16 ounce) package frozen stew vegetables, thawed ADVERTISEMENT",
            "4 cups beef broth ADVERTISEMENT",
            "1 pound fresh morel mushrooms, sliced ADVERTISEMENT",
            "1 (10 ounce) can diced tomatoes and green chiles (such as RO*TEL® Mild) ADVERTISEMENT",
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "1/2 cup chopped fresh basil ADVERTISEMENT",
            "2 tablespoons garlic, minced ADVERTISEMENT",
            "1 tablespoon herbes de Provence (optional) ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "1/2 cup Merlot wine ADVERTISEMENT",
            "sea salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine flour and Cajun seasoning in a resealable plastic bag.\nPat stew meat pieces dry with paper towels; place meat, a few pieces at a time, into the bag. Seal the bag and shake several times to coat beef with seasoned flour. Set seasoned beef aside; repeat with remaining meat.\nHeat olive oil in a large skillet over medium heat. Cook the meat in batches until browned on all sides, stirring often.\nPlace stew vegetables, beef broth, morel mushrooms, diced tomatoes with green chiles, tomato sauce, basil, garlic, herbe de Provence, and bay leaves in a large slow cooker set on High setting.\nStir the browned beef into the stew, cover, and cook until beef is tender, about 6 hours.\nReduce slow cooker setting to Low and stir in Merlot wine. Cover cooker and cook until wine is slightly reduced and flavors have blended, about 30 more minutes. Season with sea salt and black pepper.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Raw Vegan Strawberry Pie",
        "ingredients": [
            "1 cup almonds ADVERTISEMENT",
            "1 cup shredded coconut ADVERTISEMENT",
            "1 cup pitted dates ADVERTISEMENT",
            "2 tablespoons coconut oil ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "2 cups strawberries ADVERTISEMENT",
            "2 cups shredded coconut ADVERTISEMENT",
            "2 tablespoons coconut oil ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "3 strawberries, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place almonds, 1 cup coconut, dates, 2 tablespoons coconut oil, and salt in a blender. Puree until ingredients form a dough.\nPress dough into a pie pan to form the crust.\nPlace 2 cups strawberries, 2 cups coconut, 2 tablespoons coconut oil, and salt in a blender. Puree into a cream.\nPour cream over the crust. Top with sliced strawberries. Refrigerate until cream is thickened, about 2 hours.\n",
        "picture_link": "NoiXnxE64PaaFcnVapRsX1f0L03OQIm"
    },
    {
        "title": "Spinach Stuffed Portobello Mushrooms with Avocado",
        "ingredients": [
            "6 sun-dried tomatoes ADVERTISEMENT",
            "4 large portobello mushrooms, stems reserved and gills removed ADVERTISEMENT",
            "extra-virgin olive oil, or as needed ADVERTISEMENT",
            "1 tablespoon chopped fresh oregano ADVERTISEMENT",
            "sea salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 large red bell pepper, cut into 1-inch pieces ADVERTISEMENT",
            "2 cloves garlic, coarsely chopped ADVERTISEMENT",
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "2 (10 ounce) bags fresh spinach leaves ADVERTISEMENT",
            "3 large avocados - peeled, pitted, and diced ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Soak sun-dried tomatoes in a bowl of hot water until softened, about 20 minutes. Drain.\nPreheat oven to 400 degrees F (200 degrees C).\nLine a baking sheet with parchment paper.\nRub the caps of the portobello mushrooms with 2 tablespoons olive oil, or as needed; arrange mushrooms gill sides up on the prepared baking sheet. Season mushrooms with oregano, sea salt, and black pepper.\nBake mushrooms in the preheated oven until tender, 8 to 10 minutes.\nPlace the mushroom stems, sun-dried tomatoes, red bell pepper, and garlic cloves in a food processor; pulse until finely chopped.\nHeat 1 tablespoon olive oil in a large skillet over medium-high heat. Cook and stir sun-dried tomato mixture in the hot oil until fragrant, about 2 minutes.\nStir spinach into the skillet; cover, reduce heat to medium-low, and cook until spinach is wilted, about 3 minutes more, stirring occasionally. Drain excess liquid from skillet.\nSpoon spinach mixture over baked mushroom caps.\nDivide diced avocado atop stuff mushrooms and sprinkle with Parmesan cheese to serve.\n",
        "picture_link": "vKZNNO13bVn7iuJnCYl19rgrxGc3IRW"
    },
    {
        "title": "Canadian Walleye (Pickerel)",
        "ingredients": [
            "vegetable oil for frying ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "2 cups Italian seasoned bread crumbs ADVERTISEMENT",
            "8 walleye fillets ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1/8 inch of vegetable oil in two large cast-iron or heavy-duty frying pans over medium-high heat.\nArrange three separate pie plates or shallow bowls for breading the fish. Combine flour, salt and pepper in one bowl, milk and eggs in another, and bread crumbs in the third bowl.\nCoat each fillet in the flour mixture, then dredge them in egg wash, then coat them well with bread crumbs.\nPlace 4 fillets in each frying pan. Cook until golden brown, about 5 to 7 minutes per side. Drain on paper towels and serve immediately.\n",
        "picture_link": "USzsP2fakj4qXrgkj3pINYTW45suoiO"
    },
    {
        "title": "Deep-Fried Asparagus",
        "ingredients": [
            "2 cups vegetable oil for frying, or as needed ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 1/2 cups biscuit mix ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 bunch fresh asparagus, trimmed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat vegetable oil in a large skillet over medium heat.\nWhisk milk and eggs together in a bowl.\nStir biscuit mix, Parmesan cheese, salt, and black pepper together in a separate bowl.\nDip asparagus into milk mixture.\nRoll and coat asparagus in dry ingredient mixture. Repeat with a second layer for each asparagus.\nCarefully place coated asparagus in the hot oil; fry until golden brown, 2 to 4 minutes.\n",
        "picture_link": "Jg2cv8dEjgqmJx5PJFI1bLtG8v7aAGe"
    },
    {
        "title": "Insalata Caprese with Avocado",
        "ingredients": [
            "2 avocados - peeled, pitted, and cubed ADVERTISEMENT",
            "1 1/2 tablespoons lemon juice ADVERTISEMENT",
            "4 large tomatoes, cubed ADVERTISEMENT",
            "1 pound fresh mozzarella cheese, cubed ADVERTISEMENT",
            "1/3 cup basil leaves, thinly sliced ADVERTISEMENT",
            "3 1/2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "1 pinch fine sea salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine avocados and lemon juice in a large bowl; toss to coat. Add tomato, mozzarella, and basil; toss again. Drizzle with olive oil and season with salt.\n",
        "picture_link": "//90jN5tvJjSRV3oIh2UM4zXClLzvQW"
    },
    {
        "title": "Protein No Bake Drops",
        "ingredients": [
            "1 cup crunchy peanut butter ADVERTISEMENT",
            "1 cup honey ADVERTISEMENT",
            "1 cup oats ADVERTISEMENT",
            "1 cup chopped dried mixed fruit ADVERTISEMENT",
            "3/4 cup sliced almonds ADVERTISEMENT",
            "3 scoops chocolate-flavored whey protein powder ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon, or as desired (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place peanut butter and honey in a microwave-safe bowl; heat in microwave on high until melted enough to stir, about 30 seconds. Add oats, dried fruit, almonds, whey protein powder, and cinnamon; stir to combine. Form into balls and place on a plate. Chill in refrigerator, about 1 hour.\n",
        "picture_link": "ebpBvSSC3HTYLE8uAlaoX7XNeK3Wqye"
    },
    {
        "title": "Alfredo Rutabaga",
        "ingredients": [
            "1 rutabaga, peeled and cubed ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a pot of water to a boil. Add rutabaga and boil until tender, about 30 minutes; drain.\nMelt butter in a saucepan over medium heat. Pour heavy cream into melted butter and bring to a simmer, stirring constantly.\nStir Parmesan cheese, nutmeg, and salt into cream until cheese is completely melted, about 3 minutes.\nWhisk in egg yolk; simmer until sauce is thickened, about 3 more minutes, whisking constantly.\nMix rutabaga into the sauce until well coated.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Refreshing Cucumber Salsa",
        "ingredients": [
            "1/2 bunch fresh spinach, minced ADVERTISEMENT",
            "1 cucumber, cubed ADVERTISEMENT",
            "1 tomato, cubed ADVERTISEMENT",
            "1/2 small red onion, cut into 1/4-inch pieces ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 teaspoon sea salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix spinach, cucumber, tomato, red onion, garlic, lemon juice, olive oil, salt, and black pepper in a large bowl. Cover with plastic wrap and refrigerate, 1 hour to overnight.\n",
        "picture_link": "gRFxQ.ggSNSYgTfTmWyYSJ7LT2liVsK"
    },
    {
        "title": "Vinegar Pie IX",
        "ingredients": [
            "1 (9 inch) pie shell ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1/4 teaspoon ground allspice ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 teaspoon distilled white vinegar ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "2 teaspoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large saucepan combine sugar, flour, cinnamon, cloves, allspice, and salt. Mix well, then whisk in egg, vinegar, and water. Add butter or margarine and cook mixture over low heat until thick, stirring constantly. Pour mixture into pastry shell.\nBake in preheated oven for 20 to 25 minutes. Cool before serving. Garnish with whipped cream if desired.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Creamy Cheese Pie",
        "ingredients": [
            "10 graham crackers, crushed ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "4 (3 ounce) packages cream cheese, softened ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1/2 teaspoon lemon juice ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "3 1/2 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nTo Make Crust: In a small bowl, mix together crushed graham crackers and melted butter or margarine. Press mixture into bottom and sides of a 9 inch pie pan.\nTo Make Filling: In a medium mixing bowl whip cream cheese until fluffy. Beat in 3/4 cup sugar, then add eggs, 2 teaspoons vanilla extract, and lemon juice. Mix until smooth. Pour into crust.\nBake in preheated oven for 15 to 20 minutes, until set around edges. Remove and cool 5 minutes.\nTo Make Topping: Mix together sour cream, 3 1/2 tablespoons sugar, and 1 teaspoon vanilla. Spread over top of pie and return to oven for 10 minutes. Chill at least 5 hours before serving.\n",
        "picture_link": "soGBgvKY7zEYGjVO5akJgVRAqEZU5SK"
    },
    {
        "title": "Cranberry Pear Upside-Down Cake",
        "ingredients": [
            "2/3 cup caramel ice cream topping ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "1 (15 ounce) can pear halves ADVERTISEMENT",
            "1 (16 ounce) package cranberry quick bread mix ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray one 2 quart baking dish or one 10-inch round cake pan with non-stick cooking spray.\nPour and spread caramel topping to cover bottom of dish. Sprinkle pecans around the outer edge of caramel topping to make a 1-inch border, reserve 1 tablespoon of pecans.\nSpoon reserved 1 tablespoon pecans over center of dish. Cut pears into 1/4 inch slices; arrange over caramel topping and pecans with small ends toward center.\nIn medium bowl, combine bread mix, water, oil and egg. Stir with spoon until mix is moistened. Pour batter slowly over pears and pecans; carefully spread to cover.\nBake for 30 to 40 minutes or until toothpick inserted in center comes out clean. Loosen cake from sides of pan and invert onto serving plate leaving pan over cake for 1 minute. Carefully remove pan. If any topping remains in pan, spoon over cake. Cool for 30 minutes; top with ice cream if desired.\n",
        "picture_link": "zFbMKg9FFa/NOyK.QpmHawhR7kWqnGO"
    },
    {
        "title": "Spiced Turkey Roast",
        "ingredients": [
            "1 1/2 pounds boneless turkey roast ADVERTISEMENT",
            "2 teaspoons olive oil ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "2 teaspoons ground cloves ADVERTISEMENT",
            "1 teaspoon ground allspice ADVERTISEMENT",
            "1 tablespoon coarsely ground black pepper ADVERTISEMENT",
            "1 cup cranberries ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "2 tablespoons orange juice ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace turkey in a roasting pan, and rub with olive oil. Combine the cinnamon, cloves, allspice and peppercorns; rub over turkey.\nPlace turkey in the oven and roast for about 1 hour until juices run clear.\nPrepare a sauce by combining the cranberries and 2 cups water in a saucepan and bringing to a boil. Lower the heat and cook until cranberries begin to pop; add the orange juice. Combine the cornstarch or arrowroot with 2 tablespoons water and add to the sauce. Cook until thick and serve over sliced turkey.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Essene Bread for the Bread Machine",
        "ingredients": [
            "1/2 cup sprouted wheat berries, ground ADVERTISEMENT",
            "3/4 cup buttermilk ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 tablespoons maple syrup ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/3 teaspoon baking soda ADVERTISEMENT",
            "2 tablespoons vital wheat gluten ADVERTISEMENT",
            "2 1/4 cups whole wheat flour ADVERTISEMENT",
            "1 1/2 teaspoons active dry yeast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beginning several days before you hope to be eating this bread, rinse 1/2 cup raw wheat berries in cool water; drain. Soak the berries with cool water in a large bowl. Cover the bowl with a plate or cloth, and allow the berries to soak at normal room temperature overnight or for about 12 hours. The berries will soak up a considerable amount of water. Drain the berries in a colander, cover the colander with a plate to prevent the berries from drying out, and set it in a place away from light. Rinse the berries about 3 times a day, and they will soon begin to sprout. In a couple of days the sprouts will reach their optimum length of about l/4 inch. Drain the sprouts and grind them in a blender or food processor.\nPlace ingredients in the pan of the bread machine in the order recommended by the manufacturer. Select Whole Wheat cycle and Medium Crust setting; press Start.\nIf your machine has a raisin cycle, you can put the sprouts in at the beep for more intact sprouts. If not, the bread may have a mushy consistency.\n",
        "picture_link": "vqk8QSe94c0mAgkQ4hLVMEmvVc2jLg6"
    },
    {
        "title": "Chicken Veggie Soup I",
        "ingredients": [
            "2 (14.5 ounce) cans chicken broth ADVERTISEMENT",
            "1 cup baby carrots, halved ADVERTISEMENT",
            "2 potatoes, peeled and cubed ADVERTISEMENT",
            "1/2 (4.5 ounce) can mushrooms, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan over medium high heat, combine the chicken stock, carrots and potatoes and simmer for 20 minutes, or until potatoes are tender. Add the mushrooms and simmer for 5 more minutes.\n",
        "picture_link": "HNYzA2cnKuMGlrP/cCWqdEoA6nZC59q"
    },
    {
        "title": "French Apple Cream Pie",
        "ingredients": [
            "1 recipe pastry for a 9 inch double crust pie ADVERTISEMENT",
            "1 (21 ounce) can apple pie filling ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1 teaspoon lemon zest ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "3 ounces cream cheese ADVERTISEMENT",
            "1/4 cup sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Roll out pastry shell and allow to rest in refrigerator.\nLine a 9 inch pie pan with one rolled out pastry crust. In a medium mixing bowl combine pie filling, cinnamon, nutmeg, and lemon rind. Stir until fully combined and spread into pastry lined pan.\nIn a small mixer bowl combine egg, sugar, lemon juice, cream cheese, and sour cream. Beat at medium speed until smooth. Spread cheese mixture over apple mixture, and place top crust over filling. Seal edges, cut some steam vents in top crust, and sprinkle top with sugar. Bake in preheated oven for 25 to 30 minutes, until golden brown. Cool completely before serving.\n",
        "picture_link": "mkSbn/fHtU4ryP7a3JdBhqKQJFa1X8O"
    },
    {
        "title": "Chocolate Mint Cookies II",
        "ingredients": [
            "1 (18.25 ounce) package devil's food cake mix ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1/2 cup unsweetened cocoa powder ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "3 drops peppermint oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine the cake mix, eggs, water, oil and cocoa; mix until smooth, about 3 minutes. Let stand for 15 to 20 minutes to set up.\nPreheat the oven to 400 degrees F (200 degrees C). Grease cookie sheets. Roll the dough into very small balls, about 1/2 inch. Place onto the prepared cookie sheet, 2 inches apart and smash down flat.\nBake for 8 to 10 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely. Melt chocolate chips in a microwave oven or in a bowl over a pan of simmering water. Stir in the peppermint oil. Dip the cookies into the chocolate, or spread it on. set on parchment lined sheets and chill to set.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sugar Pie III",
        "ingredients": [
            "1 prepared 8 inch pie crust ADVERTISEMENT",
            "1 cup maple sugar ADVERTISEMENT",
            "1 cup packed light brown sugar ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl, mix together maple sugar, brown sugar, and flour. Add cream and vanilla extract. Stir until smooth. Pour mixture into pastry shell.\nBake in preheated oven for 30 to 35 minutes. Let stand at least 45 minutes before serving. Store in refrigerator.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Portuguese Pork and Clams",
        "ingredients": [
            "1 cup white wine ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1 pound boneless pork loin, cubed ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "1 pound cooked and diced potatoes ADVERTISEMENT",
            "1 (15 ounce) can cannellini beans ADVERTISEMENT",
            "1 pinch ground cayenne pepper ADVERTISEMENT",
            "18 clams ADVERTISEMENT",
            "3 tablespoons chopped fresh parsley, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To Marinate: Combine the wine, garlic, oregano, salt, pepper, bay leaves, and cumin in a nonporous glass dish or bowl. Mix together. Add pork and toss to coat. Cover dish or bowl and refrigerate to marinate for 2 to 3 hours.\nHeat oil in a large skillet over medium heat. Add onion and saute until soft. Remove pork from dish or bowl (reserving marinade) and add to skillet; brown quickly, then add potato cubes, reserved marinade, beans, cayenne pepper and clams or mussels. Cook until open, about 7 minutes. Garnish with parsley and serve hot.\n",
        "picture_link": "nSxaRD4V3uLcogVtOAZJNPBE5tUsnPO"
    },
    {
        "title": "Tracie's Savory Fried Chicken",
        "ingredients": [
            "10 chicken legs ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons shortening ADVERTISEMENT",
            "1/2 teaspoon dried savory ADVERTISEMENT",
            "1 teaspoon herb-and-spice seasoning blend ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse chicken and pat dry. Put flour in a shallow dish or bowl and roll chicken in flour.\nHeat shortening in a large skillet over medium heat. Add floured chicken and sprinkle with savory and seasoning. Fry for about 20 minutes each side; I fry on three sides, so it takes about 60 minutes (1 hour).\n",
        "picture_link": "J0K5qcfjmPpqRMAWVZmMG6pTXKMmEja"
    },
    {
        "title": "Spicy Apricot Loaf",
        "ingredients": [
            "1/3 cup chopped dried apricots ADVERTISEMENT",
            "1/2 cup pineapple juice ADVERTISEMENT",
            "1 1/2 cups whole wheat flour ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "3 tablespoons brown sugar ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1 teaspoon ground coriander ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "3/4 cup buttermilk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place apricots and pineapple juice in a small saucepan. Warm over medium heat until bubbling. Remove from heat and set aside to cool.\nPreheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x5 inch loaf pan.\nIn a large bowl, mix together whole wheat flour, all-purpose flour, baking powder, baking soda, brown sugar, ginger, coriander and cinnamon.\nIn a separate bowl, beat together egg, vegetable oil and buttermilk; combine with cooled apricot mixture. Gradually stir buttermilk/apricot mixture into flour mixture until blended. Pour batter into prepared 9x5 inch loaf pan.\nBake in preheated oven for 50 minutes or until a toothpick inserted into center of the loaf comes out clean. Let cool 5 minutes then loosen sides of loaf with a blunt knife. Remove from pan and allow to cool completely on a wire rack before slicing.\n",
        "picture_link": "UecDTZwUjdeBEssox.l/E1sEQ0T.VSy"
    },
    {
        "title": "Banana Bonkers",
        "ingredients": [
            "3 bananas ADVERTISEMENT",
            "3 cups fresh grapefruit juice ADVERTISEMENT",
            "2 cups lemon sherbet ADVERTISEMENT",
            "1 cup crushed ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Puree bananas in a blender or food processor. In a gallon pitcher combine pureed bananas, grapefruit juice, lemon sherbet and crushed ice. Stir and serve.\n",
        "picture_link": "heTFZrsEb4ATPZOa6MlMBW52DIVHI9y"
    },
    {
        "title": "Raspberry Vinaigrette II",
        "ingredients": [
            "1/2 cup raspberry vinegar ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 tablespoon fresh mint leaves, finely chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place vinegar in a container with tight lid. Add sugar and mint, cover with lid, and shake to dissolve sugar. Stir in additional sugar (up to another teaspoon) if necessary to smooth out the vinegar flavor.\n",
        "picture_link": "sJ7EO1EUjEAzAwm7X7LhrT4H4bUAeD6"
    },
    {
        "title": "Hearty Tartar Sauce",
        "ingredients": [
            "2 green onion, chopped ADVERTISEMENT",
            "2 medium sweet pickles, chopped ADVERTISEMENT",
            "1 dill pickle, chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 cup pitted and chopped green olives ADVERTISEMENT",
            "2 cups mayonnaise ADVERTISEMENT",
            "1/4 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1/4 teaspoon taco sauce ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place green onion, sweet and dill pickles, garlic, olives, mayonnaise, Worcestershire, taco sauce and lemon juice into a food processor or blender and process briefly. Do not puree. Refrigerate before serving.\n",
        "picture_link": "B4bTT1cdUolrg1qv5s4QK46IWbADa8q"
    },
    {
        "title": "Tater Salad",
        "ingredients": [
            "8 potatoes, peeled and cubed ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "2 tablespoons prepared mustard ADVERTISEMENT",
            "1 tablespoon ground turmeric ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of salted water to a boil. Add potatoes and cook until tender but still firm, about 10 minutes. Drain and set aside.\nPlace eggs in a saucepan and cover with cold water. Bring water to a boil and immediately remove from heat. Cover and let eggs stand in hot water for 10 to 12 minutes. Remove from hot water, cool, peel and chop.\nIn a large bowl, whisk together the mayonnaise, mustard, turmeric and onion. Add the still-warm potatoes and stir until evenly coated. Gently mix in the hard-cooked eggs. Serve immediately, or refrigerate and serve cold.\n",
        "picture_link": "Km2M3baNtqvvDNWWNz9hFQnbF/fHZCy"
    },
    {
        "title": "Portuguese Sweet Bread III",
        "ingredients": [
            "2 (0.6 ounce) cakes compressed fresh yeast ADVERTISEMENT",
            "1/4 cup warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "3 1/2 cups white sugar ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "5 pounds all-purpose flour ADVERTISEMENT",
            "1 1/4 tablespoons salt ADVERTISEMENT",
            "8 ounces butter, melted ADVERTISEMENT",
            "4 cups milk ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes.\nIn a medium bowl, beat 6 eggs and the sugar together until light and fluffy. Sift the flour and salt into a large bowl. Stir in the dissolved yeast, the egg and sugar mixture and the cooled, melted butter. Slowly add the milk to the flour mixture until the dough is of working consistency. Turn dough out onto a lightly floured surface. Knead until the dough is soft and elastic, about 15 minutes. Place into a well oiled bowl, and cover with a damp cloth. Set aside to rise overnight.\nThe next morning, preheat oven to 400 degrees F (205 degrees C). Grease two 10 inch round cake pans. Divide dough in half, shape into round loaves, and place into prepared pans. Brush the tops with beaten egg.\nBake at 400 degrees F (200 degrees C) for 15 minutes, then lower temperature to 350 degrees F (175 degrees C) and bake for another 40 minutes, or until the top is golden brown and the loaves sound hollow when tapped on the bottom.\n",
        "picture_link": "lRijJIIAUNYkZ5n1Fgla1fx1lwcLQEq"
    },
    {
        "title": "Italian-French Toast",
        "ingredients": [
            "6 eggs ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "2 teaspoons dried parsley ADVERTISEMENT",
            "12 slices white sandwich bread ADVERTISEMENT",
            "6 ounces mozzarella cheese ADVERTISEMENT",
            "1 cup vegetable oil for frying ADVERTISEMENT",
            "1 clove garlic, crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium-sized bowl, beat together eggs, milk, and parsley; set aside.\nSlice the mozzarella into 12 rounds. Make 6 sandwiches with the bread and mozzarella, dip each sandwich in egg mixture.\nIn a large skillet, lightly saute garlic in oil, then remove and discard garlic. Fry dipped sandwiches in the oil. When the sandwiches are browned, cut them into quarters on the diagonal and serve warm.\n",
        "picture_link": "nyBuBz6wervgORxX1T3GszMzFmWdy9m"
    },
    {
        "title": "Chicken Roti From India",
        "ingredients": [
            "5 dried red chile peppers, chopped ADVERTISEMENT",
            "1 teaspoon coriander seeds ADVERTISEMENT",
            "2 teaspoons chili powder ADVERTISEMENT",
            "1 teaspoon poppy seeds ADVERTISEMENT",
            "1 teaspoon cumin seeds ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon ground cardamom ADVERTISEMENT",
            "1 teaspoon anise seeds ADVERTISEMENT",
            "3 green chile peppers, chopped ADVERTISEMENT",
            "1 1/2 tablespoons tamarind pulp, seeded ADVERTISEMENT",
            "1 slice fresh ginger root ADVERTISEMENT",
            "1 teaspoon dried cilantro ADVERTISEMENT",
            "4 tablespoons olive oil ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "3 1/2 pounds shredded chicken meat ADVERTISEMENT",
            "1/2 cup fresh shredded coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To Make Ground Masala: In a small skillet saute the red chili peppers, coriander, chili powder, poppy seed, cumin, garlic, cardamom and anise. Let cool and transfer to a small bowl, then grind together with the green chile peppers, tamarind, ginger and cilantro to make a smooth paste. Set aside.\nHeat oil in a large skillet over medium heat and saute onions until brown. Add ground masala paste and saute for about 7 to 10 minutes.\nAdd chicken pieces, reduce heat to low and simmer for 25 to 30 minutes or until chicken is cooked through and juices run clear. Bring all to a boil, boil for 1 minute, then remove from heat. Garnish with shredded coconut and serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Tennille's Italian Pasta Salad",
        "ingredients": [
            "1 cup fresh broccoli florets ADVERTISEMENT",
            "1 cup fresh cauliflower florets ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 (32 ounce) package seashell pasta ADVERTISEMENT",
            "1 (16 ounce) bottle Italian-style salad dressing ADVERTISEMENT",
            "1 cup shredded carrots ADVERTISEMENT",
            "2 cucumbers, diced ADVERTISEMENT",
            "3 tomatoes, diced ADVERTISEMENT",
            "8 ounces shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Steam broccoli and cauliflower florets until tender. Place broccoli and cauliflower in a large bowl, toss with butter and salt.\nBring a large pot of salted water to a boil. Stir in the macaroni and return the water to a boil. Let cook until the noodles are al dente, drain well.\nIn a large mixing bowl, mix the Italian dressing with the hot macaroni. Next, mix in the carrots, cucumbers, tomatoes, broccoli, and cauliflower. Cover the bowl and refrigerate for 30 minutes.\nAfter the pasta and vegetables have been chilling for 30 minutes, stir in the cheese. Return the bowl to the refrigerator for another 30 to 45 minutes before serving.\n",
        "picture_link": ".dl7m4tmIQCn.085SnscRaY6HP1ST4m"
    },
    {
        "title": "Curried Cheese Bites",
        "ingredients": [
            "1 (4.25 ounce) can black olives, chopped ADVERTISEMENT",
            "1/2 cup pitted green olives, chopped ADVERTISEMENT",
            "1 tablespoon chopped green onion, or to taste ADVERTISEMENT",
            "1 1/2 cups shredded Cheddar cheese ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon curry powder ADVERTISEMENT",
            "6 English muffins, split in half ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn a medium bowl, combine olives, green onions, cheese, salt and curry powder. Spread this mixture on top of the sliced muffins. Arrange muffins on a cookie sheet.\nBake at 375 degrees F (190 degrees C) until cheese is melted and slightly browned, about 10 minutes. Cut muffins into bite-sized wedges.\n",
        "picture_link": "0KHFfX.I6Z/uZSrg9NhFrpiMkoJopB2"
    },
    {
        "title": "Chicken Susan",
        "ingredients": [
            "2 (8 ounce) packages egg noodles, cooked ADVERTISEMENT",
            "1/2 pound Swiss cheese, cubed ADVERTISEMENT",
            "2 cups sliced fresh mushrooms ADVERTISEMENT",
            "4 stalks celery, chopped ADVERTISEMENT",
            "2 cups chicken stock ADVERTISEMENT",
            "4 chicken breast halves with skin and bone, steamed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nPlace cooked egg noodles in a lightly greased 9x13 inch baking dish. Add cheese, mushrooms and celery and mix well; pour in chicken stock. (Note: If level of chicken stock cannot be seen through noodles, add more until it can.) Place chicken breasts on top of noodle mixture, bone side down.\nBake at 400 degrees F (200 degrees C) for 30 minutes, or until skin is brown and crisp and chicken juices run clear.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Trifle",
        "ingredients": [
            "1 (9 inch) sponge cake ADVERTISEMENT",
            "1 cup strawberry jelly ADVERTISEMENT",
            "2 (3 ounce) packages strawberry flavored Jell-O® ADVERTISEMENT",
            "15 ounces prepared vanilla pudding ADVERTISEMENT",
            "1/2 pint heavy cream ADVERTISEMENT",
            "2 ounces finely chopped bittersweet chocolate ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Slice cake and spread pieces with jelly or jam. Sandwich pieces of cake together and arrange pieces in bottom of glass trifle bowl or other glass serving bowl. Prepare the gelatin according to package directions and pour over cake. Refrigerate until set, 2 hours.\nPour prepared pudding or custard over the set gelatin. In a medium bowl, whip cream until stiff peaks form. Spread over pudding. Sprinkle with chocolate and chill in refrigerator until serving.\n",
        "picture_link": "BCkFxUW2gSbnVs7hiVdWqMri5WYEzYa"
    },
    {
        "title": "Pecan Butterscotch Pie",
        "ingredients": [
            "1/2 cup packed dark brown sugar ADVERTISEMENT",
            "1/4 cup cornstarch ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1/4 cup light corn syrup ADVERTISEMENT",
            "3 egg yolks, beaten ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3/4 cup chopped pecans ADVERTISEMENT",
            "1 (9 inch) pie shell, baked ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "1/4 teaspoon cream of tartar ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "3/8 cup white sugar ADVERTISEMENT",
            "1/4 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In the top of a double boiler, combine brown sugar, cornstarch, and 1/4 teaspoon. salt. Stir in milk and corn syrup. Cook over boiling water, stirring constantly, 20 minutes or until thickened.\nIn a medium bowl, beat egg yolks until thick and lemon colored. Gradually stir 1/2 cup of hot mixture into yolks. Pour back into remaining milk mixture, stirring constantly. Cook 5 minutes over boiling water, stirring frequently. Remove from heat; stir in butter, vanilla and 3/4 cup pecans. Pour into pastry shell. Preheat oven to 350 degrees F (175 degrees C.)\nBeat egg whites cream of tartar, and pinch of salt until foamy. Gradually add sugar, beating until stiff peaks form. Spread meringue over filling, sealing to edge of pastry. Sprinkle with remaining 1/4 cup pecans.\nBake in the preheated oven for 12 minutes, or until golden brown. Cool to room temperature. Chill thoroughly.\n",
        "picture_link": "GvfJwNPAcRiASqXs6x2EEZgk.gPmftG"
    },
    {
        "title": "Manifold Stew",
        "ingredients": [
            "2 squirrels - skinned, gutted, and cut into pieces ADVERTISEMENT",
            "4 potatoes, peeled and diced ADVERTISEMENT",
            "1 yellow onion, chopped ADVERTISEMENT",
            "3 carrots, sliced ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "1 (14 ounce) can chicken broth ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "2 teaspoons paprika ADVERTISEMENT",
            "2 teaspoons rubbed sage ADVERTISEMENT",
            "2 teaspoons dried rosemary, crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat car for at the amount of time it takes to prepare vegetables, about 20 minutes.\nPlace squirrel, potatoes, onion, carrots and garlic into a medium sized dutch oven with a lid. Pour in the can of chicken broth and water. Stir in the salt, pepper, paprika, sage and rosemary. Place pot between the fender skirt and manifold. Be sure to place the lid on the pot.\nDrive at least 60 mph (95 kmph) for 4 to 5 hours or until squirrel is tender.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Selkirk Bannock",
        "ingredients": [
            "3/4 cup milk ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "3 cups bread flour ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 (.25 ounce) package instant yeast ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 1/2 cups golden raisins ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small saucepan heat milk to simmering and remove from heat. Mix in the butter and stir until melted. Let cool until lukewarm.\nIn a large bowl, mix flour, sugar, yeast and salt. Stir lukewarm milk into flour mixture until a soft dough is formed. Turn dough out onto a lightly floured surface and knead until smooth and elastic, about 5 minutes. Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.\nDeflate the dough and turn it out onto a lightly floured surface. Knead in raisins and shape into a large round loaf. Place the loaf on a lightly greased baking sheet, cover with a damp cloth and let rise until doubled in volume, about 60 minutes.\nPreheat oven to 375 degrees F (190 degrees C). In a small bowl, beat together egg yolk and water.\nBrush risen loaf with egg yolk mixture. Bake in preheated oven until loaf is golden and bottom sounds hollow when tapped, about 40 minutes. Transfer to a wire rack to cool.\n",
        "picture_link": "PlRZpcEw62bgp6Nz6ZgGQklrc6rJhgK"
    },
    {
        "title": "Green Goddess Dressing II",
        "ingredients": [
            "1/2 cup evaporated milk ADVERTISEMENT",
            "1/4 cup chopped green onion ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1 teaspoon anchovy paste ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon vegetable oil ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "1 clove garlic, crushed ADVERTISEMENT",
            "1 teaspoon dried tarragon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender, combine the evaporated milk, chopped green onions, lemon juice, anchovy paste, salt, oil, parsley, garlic and tarragon. Blend until smooth and refrigerate until chilled.\n",
        "picture_link": "c61wvou/oOsz2IO.SvmKcpC/hihe2EO"
    },
    {
        "title": "Potato Donut Holes",
        "ingredients": [
            "4 potatoes, peeled ADVERTISEMENT",
            "1/3 cup margarine, melted ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "5 1/2 cups all-purpose flour ADVERTISEMENT",
            "4 teaspoons baking powder ADVERTISEMENT",
            "1 1/2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 quart vegetable oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Wash and peal potatoes. If using large potatoes cut them in half. Place potatoes in a medium sauce pan covered with water. Cook over medium heat until tender, about 20 minutes. Drain, cool, and mash.\nIn a large mixing bowl, combine 1 1/2 cup mashed potatoes with butter or margarine, eggs, buttermilk and vanilla; beat until smooth. In another bowl, sift together flour, baking powder, baking soda, and salt. Gradually add flour mixture to the potato mixture; stirring until well combined. Refrigerate batter for 1 hour.\nFill a 2 to 4 quart sauce pan 1 to 2 inches deep with vegetable oil and heat to 350 degrees F (175 degrees C).\nForm the chilled batter in 1 tablespoon size balls. Use a spoon to carefully slide the potato balls into the hot oil. Let cook until brown, turn, and cook opposite side. Remove from oil, briefly drain on paper towels, and roll in powdered sugar. Serve hot.\n",
        "picture_link": "5xwgvLuyHjdpIWYyTPYDVu4UT2k2N.u"
    },
    {
        "title": "My Mom's Best Bread Pudding",
        "ingredients": [
            "1 quart whole milk ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup butter, chilled ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "12 slices bread ADVERTISEMENT",
            "4 eggs, well beaten ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "3 tablespoons cornstarch ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 tablespoon ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan over medium-low heat, heat milk until bubbles just begin to form at edges. Remove from heat and stir in 1/2 cup sugar, 1/2 cup butter and salt. Stir until sugar dissolves. Let stand until butter melts entirely.\nPreheat oven to 350 degrees F (175 degrees C). Butter a 4 quart casserole and dust generously with nutmeg.\nTear bread apart, 2 slices at a time, into 2 inch pieces and stir into milk mixture. Gently stir beaten eggs into milk mixture. Pour into prepared pan and sprinkle the surface with nutmeg.\nLine a roasting pan with a damp kitchen towel. Place baking dish on towel, inside roasting pan, and place roasting pan on oven rack. Fill roasting pan with boiling water to reach halfway up the sides of the baking dish. Bake 45 minutes, until center is almost set. Serve warm with hard sauce.\nHard sauce: In a small saucepan over medium heat, combine water, 1/2 cup sugar, cornstarch, 1/4 cup butter and 1 tablespoon nutmeg. Bring to a rolling boil, remove from heat and set aside until serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Fruit BBQ Marinade",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1/2 red bell pepper ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1 teaspoon garlic ADVERTISEMENT",
            "1 tablespoon dry mustard ADVERTISEMENT",
            "1/2 cup cider vinegar ADVERTISEMENT",
            "4 cups pineapple juice ADVERTISEMENT",
            "1 (16 ounce) jar pineapple fruit preserves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Brown onions, and red peppers in olive oil. Add brown sugar, garlic, mustard, and cider vinegar. Cook for one minute on high or until bubbly. Add pineapple juice.\nMarinade meat of choice overnight or up to 24 hours.\nCook on barbecue and baste frequently with the marinade. Near the end of the cooking, add preserves to top and allow to brown slightly.\n",
        "picture_link": "hjwy0i5xPmd/ryvtXiUJpKLalymPHP6"
    },
    {
        "title": "Apricot-Filled Pinwheels",
        "ingredients": [
            "1 cup dried apricots ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 cup margarine, softened ADVERTISEMENT",
            "1/3 cup ice water ADVERTISEMENT",
            "1/2 teaspoon distilled white vinegar ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "1 tablespoon milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small saucepan over medium heat, combine the dried apricots with the 3/4 cup of water. bring to a boil, then stir in the sugar. Cover the pan and simmer for about 15 minutes, or until apricots are tender. Puree the mixture in a food processor or press through a sieve. Set aside to cool.\nMeasure flour into a large bowl, cut in the margarine until the mixture is like fine meal. Combine the cold water and vinegar, sprinkle over the flour mixture. Gather the dough into a ball, flatten slightly, then wrap with plastic wrap and chill for at least 1 hour.\nPreheat the oven to 425 degrees F (210 degrees C). On a lightly floured surface, roll the dough out, one half at a time, to form a 12x9 inch rectangle. Cut into 3 inch squares using a knife or pizza wheel. Make a 1 1/4 inch slit at each corner of the squares, going in towards the center. Place one teaspoon of apricot filling into the center of each square. Fold every other tip from the corners into the middle to form the pinwheel design. Press down firmly in the center to seal. Place onto ungreased baking sheets and brush with a mixture of the egg yolk and milk. Sprinkle with finely chopped pecans if desired.\nBake for 10 to 12 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n",
        "picture_link": "UKzKf1XLKAUhCDTE9wSQfQ3IJBtazfW"
    },
    {
        "title": "Mocha Cigars with Coffee Cream",
        "ingredients": [
            "CIGARS ADVERTISEMENT",
            "2 cups sifted confectioners' sugar ADVERTISEMENT",
            "1 1/4 cups sifted all-purpose flour ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "5/8 cup butter, melted and cooled ADVERTISEMENT",
            "1 vanilla bean, split and scraped ADVERTISEMENT",
            "6 egg whites, room temperature ADVERTISEMENT",
            "1 tablespoon heavy cream ADVERTISEMENT",
            "1 1/2 ounces bittersweet chocolate, grated ADVERTISEMENT",
            "COFFEE CREAM FILLING ADVERTISEMENT",
            "1/4 cup coffee flavored liqueur ADVERTISEMENT",
            "1 1/2 teaspoons instant espresso coffee powder ADVERTISEMENT",
            "2 1/2 cups heavy cream ADVERTISEMENT",
            "1/4 cup confectioners' sugar ADVERTISEMENT",
            "1 1/2 ounces bittersweet chocolate, grated ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix 2 cups confectioners' sugar, flour and salt. Make a well in the center and set aside.\nIn another bowl, combine melted butter and vanilla scrapings. Pour vanilla butter, egg whites and 1 tablespoon cream into well of dry ingredients. Mix until smooth. Fold in 1 1/2 ounces grated chocolate. Chill in refrigerator 2 hours or overnight.\nPreheat oven to 400 degrees F (200 degrees C). Line a baking sheet with waxed paper.\nMake a stencil by using a utility knife to cut a 4 1/2 inch (11.5 centimeter) circle in the center of a flexible plastic lid. Place the stencil on the baking sheet and spread 2 teaspoons of batter inside circle; remove stencil. Make 3 circles on a baking sheet.\nBake in preheated oven 2 minutes, rotate pan and bake 2 minutes more, until golden. Working quickly, remove cookie from tray with a spatula and roll around the handle of a wooden spoon. Place rolled cookies on wire rack to cool completely. If cookies harden before rolling, return to oven for 30 seconds to soften. Repeat to use all remaining batter.\nTo make coffee cream: Beat together coffee liqueur and espresso powder until powder is dissolved. Beat in 2 1/2 cups cream and 1/4 cup confectioners' sugar until soft peaks form. Refrigerate 15 minutes.\nFill cooled cookies with coffee cream using a pastry bag fitted with a 3/8 inch round tip. Dip each end of filled cookies in grated chocolate. Serve at once, or store in an airtight container up to 3 days.\n",
        "picture_link": "y7VQp5rBXsP5h2KdH/.12IISK17i.Ym"
    },
    {
        "title": "Green Beans and Hot Sauce",
        "ingredients": [
            "2 pounds fresh green beans, washed and trimmed ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes with juice ADVERTISEMENT",
            "2 hot yellow banana peppers, diced ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "6 slices bacon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place green beans, onions, tomatoes, banana peppers, bell pepper, and water in a large pot. Bring to a boil over high heat, then reduce heat to low. Cover pot and simmer approximately 10 minutes, until green beans are tender.\nWhile green beans are steaming, arrange bacon slices in a medium skillet. Fry over medium heat until crispy, approximately 10 minutes. Drain on paper towels. Crumble and set aside.\nSpoon green bean mixture and juice into a serving dish. Sprinkle crumbled bacon over top and serve immediately.\n",
        "picture_link": "DinomQhZUA67ifpEt72DtxO7o.lHsxe"
    },
    {
        "title": "Black Pepper Rings",
        "ingredients": [
            "12 eggs ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "6 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "2 tablespoons coarsely ground black pepper ADVERTISEMENT",
            "3 tablespoons baking powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of water to boil over medium-high heat. Preheat oven to 450 degrees F (230 degrees C).\nIn a large bowl, beat eggs. Stir in melted butter and oil. In a separate bowl, mix together flour, salt, pepper and baking powder.\nMake a well in the center of the flour mixture and pour in the egg mixture. Mix until dough pulls together. Turn dough out onto a lightly floured surface and knead briefly. Divide dough into 12 equal pieces. Roll each piece into an 8 inch long cylinder. Bend each cylinder into a ring shape and pinch ends together. With a sharp knife, score each ring around its outside edge.\nDrop rings two at a time into boiling water and boil for 1 minute. Remove rings from water and place on lightly greased cookie sheets.\nBake in preheated oven for 20 minutes, until golden brown.\n",
        "picture_link": "3vnURQcjDLUl6CD0fQcrocCnCTUthwS"
    },
    {
        "title": "Old Time Bread",
        "ingredients": [
            "1 1/2 cups bread flour ADVERTISEMENT",
            "1 1/2 cups whole wheat flour ADVERTISEMENT",
            "1/2 cup yellow cornmeal ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 (0.6 ounce) cake compressed fresh yeast ADVERTISEMENT",
            "1/2 cup warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "3/4 cup warm milk (110 degrees F/45 degrees C) ADVERTISEMENT",
            "1 tablespoon pumpkin seeds ADVERTISEMENT",
            "1 tablespoon sesame seeds ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "2 tablespoons sunflower seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine bread flour, whole wheat flour, cornmeal and salt. Crumble the yeast into a separate bowl and mix with the water and 3/4 cup milk. Make a well in the center of the flour mixture and pour in the yeast mixture. Mix until the dough begins to pull together.\nWhen the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes. Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 1 hour.\nDeflate the dough and turn it out onto a lightly floured surface. Flatten the dough, and gently knead in the pumpkin and sesame seeds. Form the dough into a single round loaf and place on a lightly oiled baking sheet. Cover with a damp cloth and let rise until doubled in volume, about 40 minutes. Meanwhile, preheat oven to 400 degrees F (200 degrees C).\nBrush loaf with 2 tablespoons milk and sprinkle on the sunflower seeds. Bake in preheated oven for 30 to 35 minutes, or until the top is golden brown and the bottom of the loaf sounds hollow when tapped. Let cool on a wire rack before serving.\n",
        "picture_link": "KV8aRLko3CMcc./XPHneTOVZYuHwija"
    },
    {
        "title": "Meaty Barbeque Sandwiches",
        "ingredients": [
            "1/3 cup shortening ADVERTISEMENT",
            "1 pound chopped onion ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon dry mustard ADVERTISEMENT",
            "1/2 teaspoon chili powder ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 cup distilled white vinegar ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 pound cooked pork meat, finely chopped ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1/2 teaspoon hot pepper sauce ADVERTISEMENT",
            "1 cup ketchup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat shortening in a large skillet over medium high heat. Saute onion until brown; then add the sugar, salt, flour, dry mustard, chile powder, pepper, vinegar and water. Mix and cook together until mixture is thick.\nStir in chopped meat, Worcestershire sauce, hot pepper sauce and ketchup. Heat through, then serve on buns.\n",
        "picture_link": "ArIR7dZh.jpbg75x9sgnkWF7EKMDvIy"
    },
    {
        "title": "Overnight Casserole",
        "ingredients": [
            "2 cups small seashell pasta ADVERTISEMENT",
            "4 hard-cooked eggs, chopped ADVERTISEMENT",
            "1/2 pound Cheddar cheese, cubed ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed cream of mushroom soup ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 1/2 pounds dried beef, torn in pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the macaroni, eggs, cheese, pepper, milk, soup, onion and beef in a 9x13 inch baking dish. Mix well, cover and refrigerate overnight.\nPreheat oven to 350 degrees F (175 degrees C).\nBake casserole, covered, at 350 degrees F (175 degrees C) for 1 hour.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    }
]