[
    {
        "title": "Southwestern Veggie Skillet",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 onion, sliced into rings ADVERTISEMENT",
            "1 zucchini, cut into 1/4-inch slices ADVERTISEMENT",
            "1 yellow squash, cut into 1/4-inch slices ADVERTISEMENT",
            "1 ear corn, kernels cut from cob ADVERTISEMENT",
            "4 roma (plum) tomatoes, peeled and chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro, or more to taste ADVERTISEMENT",
            "1/2 lime ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large skillet over medium heat; cook and stir onion in hot oil until tender, 5 to 10 minutes. Stir zucchini and yellow squash into onion; cook until slightly tender, about 3 minutes. Add corn; cook for 1 minute.\nStir tomatoes and garlic into onion mixture; cook and stir until heated through, about 3 minutes. Season with cumin, salt, and pepper. Cook to desired doneness, 5 to 10 more minutes. Sprinkle in cilantro; stir until wilted. Remove from heat and squeeze lime over mixture.\n",
        "picture_link": "OZqIcogbNFGkVsAmCwzNnsHZvdcnmJm"
    },
    {
        "title": "Strawberry Shortcakes",
        "ingredients": [
            "2 pints fresh strawberries, hulled and thickly sliced ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1/2 teaspoon sea salt ADVERTISEMENT",
            "6 tablespoons chilled unsalted butter, cut into cubes ADVERTISEMENT",
            "2 cups heavy whipping cream, or as needed - divided ADVERTISEMENT",
            "2 tablespoons confectioners' sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 tablespoons confectioners' sugar for dusting, or to taste - divided ADVERTISEMENT",
            "6 sprigs fresh mint for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nToss strawberries with 1/2 cup confectioners' sugar in a bowl; set aside at room temperature for 1 hour for juice to form.\nWhisk flour, white sugar, baking powder, and sea salt in a bowl. Cut unsalted butter into flour mixture with a pastry cutter until mixture resembles coarse crumbs. Pour 1 cup cream into flour mixture, starting with 1/2 cup and adding a tablespoon or two at a time as needed. Stir to make a soft dough. Add more cream as needed. Place dough into a floured bowl and knead a few times with the heel of your hand.\nRoll dough out 1/2 inch thick on a floured surface; cut dough into 6 3-inch rounds using a biscuit cutter. Place onto ungreased baking sheet.\nBake until tops are golden brown, 10 to 12 minutes. Cool on wire racks.\nWhip remaining 1 cup cream in a metal or glass bowl, using an electric mixer, until cream forms soft peaks when beaters are lifted directly up out of cream; gently fold in 2 tablespoons of confectioners' sugar and vanilla extract. Cover and refrigerate cream until ready to serve.\nTo serve, split each shortcake round horizontally, using a serrated knife, and place bottoms of shortcakes onto serving plates. Spoon about 1/2 cup of strawberries and juice onto shortcake half; top with 1/4 cup of whipped cream. Place shortcake tops onto desserts; dust each dessert with about 1 teaspoon confectioners' sugar and a sprig of mint.\n",
        "picture_link": "XZWF97quM/BfQ3sySKrMh3Wf9yM24Xu"
    },
    {
        "title": "Cola Marinated Sirloin Steak",
        "ingredients": [
            "1 cup cola-flavored carbonated beverage ADVERTISEMENT",
            "1/2 cup soy sauce ADVERTISEMENT",
            "2 tablespoons Dijon mustard ADVERTISEMENT",
            "1 tablespoon prepared horseradish (optional) ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "2 pounds sirloin steak ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together cola, soy sauce, Dijon mustard, horseradish, garlic, and black pepper in a bowl and pour into a resealable plastic bag. Add steak, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator for 24 hours.\nPreheat the grill to 400 degrees F (200 degrees C).\nRemove steak from resealable bag and discard remaining marinade.\nCook steak on the preheated grill to desired doneness, about 5 minutes per side. An instant-read thermometer inserted into the center should read 140 degrees F (60 degrees C).\n",
        "picture_link": "1ZC2OBcK685nHCXnSAiDNuSDmmZPt8K"
    },
    {
        "title": "Cheesy and Creamy Chicken Tetrazzini",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1/2 pound fettuccine pasta ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 skinless, boneless chicken breast halves, cut into strips ADVERTISEMENT",
            "1 1/2 tablespoons margarine ADVERTISEMENT",
            "1/2 cup sliced mushrooms (optional) ADVERTISEMENT",
            "1/2 small onion, finely chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 red bell pepper, cubed ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "3/4 cup heavy whipping cream ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "10 tablespoons shredded Swiss cheese, divided ADVERTISEMENT",
            "10 tablespoons shredded Cheddar cheese, divided ADVERTISEMENT",
            "6 tablespoons shredded Parmesan cheese, divided ADVERTISEMENT",
            "1 pinch dried thyme, or to taste ADVERTISEMENT",
            "1 pinch salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray a casserole dish with cooking spray.\nFill a large pot with lightly salted water and bring to a rolling boil. Stir in the fettuccine, bring back to a boil, and cook pasta over medium heat until cooked through but still firm to the bite, about 8 minutes. Drain.\nHeat olive oil in a skillet over medium heat; cook and stir chicken strips in the hot oil until no longer pink, about 10 minutes. Remove chicken to a bowl, leaving pan drippings in skillet. Melt margarine in the hot skillet; cook and stir mushrooms, onion, and garlic in skillet until mushrooms have softened and given up their liquid, about 5 minutes. Stir red bell pepper into mixture and sprinkle with flour. Stir to coat and cook, stirring constantly, for 1 minute.\nSlowly mix chicken broth into vegetables, stirring to form a thick sauce; mix cream and milk into sauce. Simmer until thickened, about 1 minute. Mix 1/2 cup Swiss cheese, 1/2 cup Cheddar cheese, 1/4 cup Parmesan cheese, thyme, salt, and black pepper into sauce and simmer until cheese have melted and combined with sauce.\nSpread half the cooked fettuccine pasta into bottom of prepared casserole dish, top with half the chicken and half the cream sauce. Repeat layers once more and sprinkle remaining 2 tablespoons Swiss cheese, 2 tablespoons Cheddar cheese, and 2 tablespoons Parmesan cheese over the top.\nBake in the preheated oven until cheese topping is nicely browned, 25 to 30 minutes.\n",
        "picture_link": "BltA7nEXniM2frl/k7MyNRBy6I/SuVy"
    },
    {
        "title": "Sugar Cookie Bars",
        "ingredients": [
            "1 cup unsalted butter at room temperature ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "4 large eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "5 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "3 cups prepared frosting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Line a 10x15-inch baking pan with parchment paper.\nPlace butter and sugar into the work bowl of a large stand mixer fitted with paddle attachment; mix on medium-high speed until butter and sugar are light and fluffy, 2 to 3 minutes.\nBeat eggs into butter mixture one at a time, letting each egg blend in before adding the next. Beat in vanilla extract. Whisk flour, salt, and baking soda together in a separate bowl. Gradually beat flour mixture into moist ingredients, blending each portion in before adding more. Spread dough into prepared pan.\nBake in the preheated oven until lightly golden brown and a toothpick inserted into the center comes out clean, 30 to 35 minutes. Let cool completely in pan.\nRemove from pan and spread frosting over the top; cut into bars and serve.\n",
        "picture_link": "u4TJIHUfANNxXctNcWTrn62u5AXoueG"
    },
    {
        "title": "Non-fat Honey Mustard Dressing",
        "ingredients": [
            "1/2 cup plain fat-free Greek yogurt ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1/4 cup spicy brown mustard ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir yogurt, honey, mustard, and lemon juice in a bowl until evenly mixed. Store in a covered container in the refrigerator until ready to serve.\n",
        "picture_link": "pW/7CY4m1JiNYDZZoGISizf3zY/XgkC"
    },
    {
        "title": "Paneer Butter Masala",
        "ingredients": [
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1/2 pound paneer, cut into 1/2-inch cubes ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 onions, finely chopped ADVERTISEMENT",
            "1 teaspoon ginger paste ADVERTISEMENT",
            "1 teaspoon garlic paste ADVERTISEMENT",
            "1 tablespoon ground cashews ADVERTISEMENT",
            "1 teaspoon ground red chiles ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon ground coriander ADVERTISEMENT",
            "1/2 teaspoon garam masala ADVERTISEMENT",
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "1/2 cup half-and-half ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 teaspoon white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large skillet over medium heat; fry paneer in 2 batches until golden, about 5 minutes. Transfer fried paneer to a paper towel-lined plate to drain, retaining vegetable oil in skillet.\nMelt butter in the same skillet over medium heat; cook and stir onion until golden brown, about 10 minutes. Add ginger paste and garlic paste. Continue to cook until fragrant, about 1 minute more. Stir cashews, ground red chiles, cumin, coriander, and garam masala into onion mixture. Cook and stir for 1 minute.\nStir tomato sauce, half-and-half, milk, sugar, and salt into spice mixture; simmer until thickened, about 5 minutes. Reduce heat to low. Add fried paneer and simmer until heated through, about 5 minutes more.\n",
        "picture_link": "Iz/qiEBjVNwEroKJzD9.x/i411FuU2W"
    },
    {
        "title": "Grilled Pork Chops and Onions",
        "ingredients": [
            "6 bone-in pork chops (3/4-inch to 1-inch thick) ADVERTISEMENT",
            "1 large yellow onion, cut into 3/4-inch thick rounds ADVERTISEMENT",
            "1 1/2 cups Goya Mojo Chipotle, divided ADVERTISEMENT",
            "Goya Adobo All-Purpose Seasoning with Pepper, to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a zip-top bag* or a large container with a lid, combine the pork, onions and 1 cup Mojo. Seal bag and transfer to refrigerator; chill at least 3 hours, or overnight.\nPrepare a grill to medium-high heat, or heat a large, lightly-greased grill pan over medium-high heat. Remove pork and onions from the marinade; discard any leftover liquid. Season pork with Adobo. Cook pork until golden brown and internal temperature registers 145 degrees F (63 degrees C) on a quick-read thermometer, basting with remaining mojo, flipping once, 15 to 20 minutes. Cook onions until soft and golden brown, about 10 minutes.\nDivide pork and onions evenly among serving dishes.\n",
        "picture_link": "7roWzB37fHVrQPawPZNzqQKVdEGPjCS"
    },
    {
        "title": "Apricot Almond Galette",
        "ingredients": [
            "10 small fresh apricots, pitted and quartered ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1 cup almond meal ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 (9 inch) refrigerated pie crust (such as Pillsbury®) ADVERTISEMENT",
            "1/3 cup apricot jam, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Roll out pie crust onto a baking sheet.\nToss the quartered apricots with the white sugar in a bowl. Mix almond meal, confectioners' sugar, and egg together in another bowl to create a paste. Spread almond paste on the center of the pie crust, leaving 1/2 inch of bare crust all around the edge. Arrange the sugared apricots over the almond paste. Fold the 1/2-inch bare edge of the crust inward over the almond paste and apricots, leaving the center of the tart uncovered. Crimp the edge down with a fork as you go around the tart.\nBake in the preheated oven until the crust is golden brown, about 40 minutes. Brush the melted apricot jam over the hot galette. Slice and serve.\n",
        "picture_link": "GqDZ5rqhVxR/wbs/vY5eWRG3zaOwH8e"
    },
    {
        "title": "Lavender Ice Cream",
        "ingredients": [
            "3 cups milk ADVERTISEMENT",
            "2 stems of fresh lavender flowers ADVERTISEMENT",
            "8 egg yolks ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "3 cups heavy cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the milk and lavender in a 3-quart saucepan over low heat until warmed through. Remove from heat, and allow lavender to infuse for about 20 minutes. Remove flowers.\nBeat the egg yolks and sugar together in large bowl. Whisk the lavender-infused milk into the egg mixture, then pour it back into the saucepan. Heat the mixture over low heat, whisking constantly, until the mixture thickens and can coat the back of a spoon, 7 to 10 minutes. Remove from heat, and cool slightly, about 5 minutes. Stir in the heavy cream. Transfer the mixture to a bowl, and chill in refrigerator at least 4 hours.\nPour the chilled mixture into an ice cream maker and freeze according to manufacturer's directions until it reaches \"soft-serve\" consistency. Transfer ice cream to a lidded container; cover surface with plastic wrap and seal. For best results, ice cream should be place in the freezer at least 2 hours or overnight.\n",
        "picture_link": "5.K5WmrvjwDADDEkkysv3Obmln3zIbG"
    },
    {
        "title": "Chicken Artichoke Casserole",
        "ingredients": [
            "3 bone-in chicken breasts ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "2 (10.5 ounce) cans cream of chicken soup ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "1 teaspoon curry powder ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 (6.5 ounce) jar marinated artichoke hearts, liquid reserved ADVERTISEMENT",
            "4 cups cubed bread ADVERTISEMENT",
            "1 cup shredded extra-sharp Cheddar cheese ADVERTISEMENT",
            "4 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of water to a boil; cook the chicken breasts in the boiling water until no longer pink at the bone and the juices run clear, about 30 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).\nWhile the chicken boils, stir the mayonnaise, cream of chicken soup, lemon juice, curry powder, salt, and pepper together in a bowl; set aside.\nCut the cooked chicken meat into bite-size pieces and arrange in the bottom of a 9x13-inch casserole dish. Cut the artichoke hearts into bite-size pieces and scatter over the chicken. Sprinkle 1 tablespoon of the reserved liquid from the artichoke jars over the chicken and artichoke mixture. Pour the soup mixture over the chicken and artichokes. Scatter the Cheddar cheese atop the soup.\nPreheat an oven to 350 degrees F (175 degrees C).\nMelt the butter in a skillet over medium heat; cook and stir the bread cubes in the melted butter until browned. Sprinkle the croutons over the entire casserole.\nBake the casserole in the preheated oven until the top is bubbling, about 30 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Squash and Kohlrabi Empanadas",
        "ingredients": [
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 (1 inch) piece fresh ginger, minced ADVERTISEMENT",
            "2 kohlrabi bulbs, peeled and cubed ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 large yellow squash, cubed ADVERTISEMENT",
            "2 green onions, chopped ADVERTISEMENT",
            "1/2 cup chopped fresh spinach ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon water ADVERTISEMENT",
            "1 (15 ounce) package pastry for a 9 inch double crust pie ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil and butter in a skillet over medium heat. Stir in garlic and ginger; cook and stir until fragrant, about 3 minutes. Stir in kohlrabi, and season with salt and pepper. Cook and stir until kohrabi has softened, 3 to 4 minutes. Toss in yellow squash and continue to cook until squash is tender for 4 more minutes. Stir in the green onion, spinach, and nutmeg. Add more salt and pepper, as needed. Cook until the spinach has wilted, about 1 minutes. Set mixture aside to cool.\nPreheat an oven to 425 degrees F (220 degrees C). Line a baking sheet with parchment paper. Beat the egg with water in a small bowl; set aside.\nRoll out the pie crust by running a rolling pin over it once or twice. Cut out about 16 6-inch circles using a large cookie cutter or cereal bowl. Fill the center of each circle with about 1 tablespoon of the kohlrabi mixture. Brush the edges of the pastry with water, then fold the dough in half. Crimp the edge of the dough with a fork to seal, and place on the prepared baking sheet. Repeat with the remaining pastry and vegetable filling. Prick each empanada with a fork, then brush with the egg wash.\nBake in the preheated oven until golden brown and flaky, 5 to 7 minutes. Serve hot from the oven.\n",
        "picture_link": "izJr1PsOwniEHcRB/u8KAr9H14AarAm"
    },
    {
        "title": "Mobile Bay Seafood Gumbo",
        "ingredients": [
            "2/3 cup clarified butter ADVERTISEMENT",
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1 pound fresh okra, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 (16 ounce) can tomato paste ADVERTISEMENT",
            "1 3/4 cups diced tomatoes ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "1 tablespoon seafood seasoning (such as Old Bay®) ADVERTISEMENT",
            "2 pounds uncooked medium shrimp, peeled and deveined ADVERTISEMENT",
            "1 pound cooked crabmeat ADVERTISEMENT",
            "1 pound shucked oysters ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the clarified butter in a large saucepan over medium heat until a pinch of flour sprinkled into the oil will just begin to bubble. Whisk in the flour to form a thick paste the consistency of cake frosting. Continue cooking, whisking constantly, until the flour turns the color of melted chocolate, about 45 minutes. Slowly whisk in the water and bring to a simmer. Whisk until no lumps of roux remain; set aside.\nMeanwhile, heat the olive oil in a large pot over medium-low heat. Stir in the onion, okra, and green bell pepper. Cook and stir until the vegetables have softened and begun to brown, about 30 minutes.\nStir the tomato paste into the okra mixture until no lumps of tomato paste remain. Add the tomatoes, garlic, salt, black pepper, bay leaves, seafood seasoning, and roux-thickened water. Bring to a simmer over medium-high heat, then reduce heat to medium-low, cover, and simmer 1 hour.\nStir the shrimp, crab, and oysters into the gumbo, recover, and cook 20 minutes longer.\n",
        "picture_link": "yFo7Skh28iSx4ZyRc0uXnuBN1CQou2W"
    },
    {
        "title": "PHILLY Cheesecake Brownies",
        "ingredients": [
            "1 (440 gram) package brownie mix ADVERTISEMENT",
            "1/2 cup applesauce ADVERTISEMENT",
            "3 egg whites, divided ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 (250 g) package PHILADELPHIA Light Brick Cream Cheese Spread, softened ADVERTISEMENT",
            "1/2 cup sugar ADVERTISEMENT",
            "1/4 cup flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 350 degrees F.\nMix brownie mix, applesauce, 2 egg whites and water until well blended. Pour into 13x9-inch pan sprayed with cooking spray.\nBeat cream cheese spread, sugar, flour and remaining egg white with mixer until well blended; spoon over brownie batter. Swirl gently with knife.\nBake 28 to 30 minutes or until toothpick inserted in centre comes out with fudgy crumbs. (Do not overbake.) Cool completely.\n",
        "picture_link": "BDnvVB3RR/gllz6emeXZXwt9O9RcC/W"
    },
    {
        "title": "A-Plus Italian Olive Oil Balsamic Bread Dip",
        "ingredients": [
            "3 large cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "5 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "1/2 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1 teaspoon fresh rosemary, chopped ADVERTISEMENT",
            "1 pinch salt and black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the garlic, balsamic vinegar, olive oil, red pepper flakes, rosemary, and salt and pepper into a shallow bowl in that order. To serve, spoon small amount onto bread.\n",
        "picture_link": "QR3NHRNSPjq6Qy6PnvPUyG2sLKQD8kS"
    },
    {
        "title": "Apricot Oat Bread",
        "ingredients": [
            "4 1/4 cups bread flour ADVERTISEMENT",
            "2/3 cup rolled oats ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "2 teaspoons active dry yeast ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "2 tablespoons butter, cut up ADVERTISEMENT",
            "1 2/3 cups orange juice ADVERTISEMENT",
            "1/2 cup diced dried apricots ADVERTISEMENT",
            "2 tablespoons honey, warmed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bread ingredients in the pan of the bread machine in the order recommended by the manufacturer; add the dried apricots just before the knead cycle ends.\nRemove the bread promptly from the machine when it's finished, and glaze with the warmed honey. Allow to cool completely before serving.\n",
        "picture_link": "wfSa0N5afcclHYzL4EnIi0/VzW28.86"
    },
    {
        "title": "Sicilian Sunset",
        "ingredients": [
            "2 cups ice cubes ADVERTISEMENT",
            "1 cup Prosecco (Italian sparkling wine) ADVERTISEMENT",
            "1 cup orange juice ADVERTISEMENT",
            "1 cup cranberry juice ADVERTISEMENT",
            "2 lemons, zested ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the ice in a glass pitcher. Pour in the Prosecco, orange juice, and cranberry juice; stir. Pour the cocktail into champagne flutes, and sprinkle with lemon zest to serve.\n",
        "picture_link": "p82mYw5ckbxcy9ukw4/PA8sgpe6..sy"
    },
    {
        "title": "Skinny Foster",
        "ingredients": [
            "2 teaspoons butter ADVERTISEMENT",
            "2 teaspoons brown sugar ADVERTISEMENT",
            "1 orange, juiced ADVERTISEMENT",
            "1 banana, split lengthwise ADVERTISEMENT",
            "2 scoops vanilla ice cream ADVERTISEMENT",
            "2 tablespoons sliced almonds, toasted (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat butter, brown sugar, and orange juice in a skillet over medium heat. Once the butter has melted, add the banana. Cook until the banana has softened and the sauce is slightly syrupy, flipping the banana occasionally, about 2 minutes.\nServe each slice of banana with a scoop of vanilla ice cream. Drizzle with the sauce and sprinkle with almond slices.\n",
        "picture_link": "PFC.ib2reWjzjqFkbwMoQryOhQ1byPy"
    },
    {
        "title": "Ketchup Dip",
        "ingredients": [
            "1 (16 ounce) container sour cream ADVERTISEMENT",
            "1/2 cup ketchup, or more to taste ADVERTISEMENT",
            "2 teaspoons Worcestershire sauce, or to taste ADVERTISEMENT",
            "1/2 white onion, minced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir the sour cream, ketchup, Worcestershire sauce, and white onion together in a bowl until smooth. Refrigerate 2 hours before serving.\n",
        "picture_link": "zLntbrlGP5dSz89Bmy7vNKxNNMdA9me"
    },
    {
        "title": "Tropical Quinoa",
        "ingredients": [
            "1/2 cup uncooked quinoa, rinsed ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/4 cup chopped dried pineapple ADVERTISEMENT",
            "1/4 cup chopped dried mango ADVERTISEMENT",
            "1/4 cup sweetened coconut flakes ADVERTISEMENT",
            "1/4 cup dry-roasted macadamia nuts, chopped ADVERTISEMENT",
            "1 tablespoon hot mango chutney ADVERTISEMENT",
            "2 tablespoons regular mango chutney ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the quinoa and water in a saucepan over medium heat, and bring to a boil. Cover, reduce heat, and simmer until all the water is absorbed, 10 to 12 minutes. Remove from heat, and stir in the dried pineapple, dried mango, coconut flakes, macadamia nuts, hot and regular mango chutney until thoroughly combined. Serve hot.\n",
        "picture_link": "/u9jIWLf79RTjzRPJAq8iAKYpGq2J9G"
    },
    {
        "title": "Fanny's Italian Casserole",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 yellow onion, diced ADVERTISEMENT",
            "2 (26 ounce) jars tomato, onion, and garlic spaghetti sauce (such as Prego®) ADVERTISEMENT",
            "1 tablespoon dried basil ADVERTISEMENT",
            "1 large bay leaf ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon celery salt ADVERTISEMENT",
            "1 (16 ounce) package elbow macaroni ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "2 1/4 cups shredded sharp Cheddar cheese, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the hamburger into a large saucepan over medium heat, and cook and stir the meat until no longer pink, breaking the meat up into crumbles as it cooks, about 10 minutes. Stir in the onion and continue to cook and stir until the onion is translucent, about 5 more minutes. Drain grease from the pan, and stir in the 2 jars of sauce, basil, bay leaf, oregano, and celery salt. Reduce heat, and simmer the sauce for 1 hour. Remove from heat.\nAbout 15 minutes before the sauce is finished simmering, fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the macaroni, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 8 minutes. Drain well in a colander set in the sink.\nPreheat oven to 375 degrees F (190 degrees C). Spray a 9x13-inch baking dish with cooking spray.\nWhisk together the mushroom soup and water in a bowl until smooth.\nLayer 1/3 of the meat sauce into the bottom of the prepared baking dish, and spread half of the cooked macaroni over the sauce. Spoon half the soup mixture over the macaroni, and spread 1 cup of shredded Cheddar cheese. Repeat the layers with 1/3 of the remaining sauce, the remaining pasta, the remaining soup mix, and 1 more cup of Cheddar cheese. Spread the last third of the meat sauce over the casserole, and sprinkle with the remaining 1/4 cup of Cheddar cheese. Spray a piece of aluminum foil with cooking spray, and cover the dish with the foil.\nBake the casserole in the preheated oven for 30 minutes, then remove the foil and bake until the cheese topping is browned and the casserole is bubbling, about 15 more minutes.\n",
        "picture_link": "t1lFb/R./7dR6pirQsqkeK4fElRMxwG"
    },
    {
        "title": "Kale Chips with Honey",
        "ingredients": [
            "2 bunches dino kale, cut into 2-inch pieces ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 teaspoon sea salt ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the kale pieces, olive oil, lemon juice, and sea salt in a resealable bag. Seal and massage the mixture for 3 minutes. The kale will be starting to break down a bit. Drizzle the honey over the mixture and again massage gently for another 3 minutes; the kale will now be half the bulk you started with.\nLay flat and even in a food dehydrator; cook at 115 degrees F (46 degrees C) until crispy, about 8 hours. Alternately, you can bake in an oven at 145 degrees F (65 degrees C) until crispy, 4 to 5 hours.\n",
        "picture_link": "30LIp7qtA/SgXrgp3qUYPV6FM9bv4GW"
    },
    {
        "title": "Savory Beef Tenderloin",
        "ingredients": [
            "4 (6 ounce) beef tenderloin steaks, about 1 1/2-inch thick ADVERTISEMENT",
            "Goya Adobo with Pepper, to taste ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 tablespoon Goya Extra Virgin Olive Oil ADVERTISEMENT",
            "2 cloves garlic, thinly sliced ADVERTISEMENT",
            "1 tablespoon finely chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season beef with adobo on both sides. Heat butter and oil in a large skillet over medium-high heat. Add steaks to pan and cook until well browned and medium rare, flipping once, about 6 minutes. Transfer meat to a plate; cover with foil to keep warm.\nLower heat to medium. Add garlic to skillet and cook until light golden brown, about 1 minute. Add parsley and cook 30 seconds more.\nDivide steaks evenly among serving dishes. Top steaks evenly with garlic mixture.\n",
        "picture_link": "qIL6IV6e0ys1/qIf7KcfJt52OOs229a"
    },
    {
        "title": "Trail Blazer Barbecue Sauce",
        "ingredients": [
            "2 cups chopped onions ADVERTISEMENT",
            "1 cup strong black coffee ADVERTISEMENT",
            "1 cup ketchup ADVERTISEMENT",
            "1 cup Worcestershire sauce ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/2 cup apple cider vinegar ADVERTISEMENT",
            "1/4 cup hot chili peppers, minced ADVERTISEMENT",
            "3 tablespoons chili powder ADVERTISEMENT",
            "6 cloves garlic, minced ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together the onions, coffee, ketchup, Worcestershire sauce, brown sugar, cider vinegar, hot chilies, chili powder, garlic, and salt in a saucepan until the brown sugar has dissolved. Place over medium heat, bring to a boil, reduce heat, and simmer for 30 minutes.\nPour the sauce into a blender, filling the pitcher no more than halfway full. Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender, using a few quick pulses to get the sauce moving before leaving it on to puree. Puree in batches until smooth. Store in glass container in refrigerator.\n",
        "picture_link": "VzzOykGGevP06uUxPiu0Rydszw6N9lO"
    },
    {
        "title": "Rainbow Salad with Lemon Poppyseed Dressing",
        "ingredients": [
            "3 cups torn romaine lettuce leaves ADVERTISEMENT",
            "1 cup chopped English cucumber ADVERTISEMENT",
            "2 green onions, chopped ADVERTISEMENT",
            "1/2 cup chopped yellow bell pepper ADVERTISEMENT",
            "1/2 cup chopped red bell pepper ADVERTISEMENT",
            "1 large carrot, peeled and sliced thin ADVERTISEMENT",
            "1 Granny Smith apple, sliced thin ADVERTISEMENT",
            "1 cup fresh blueberries ADVERTISEMENT",
            "1/2 cup walnuts ADVERTISEMENT",
            "2/3 cup crumbled feta cheese ADVERTISEMENT",
            "3 tablespoons apple cider vinegar ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "2 teaspoons Dijon mustard ADVERTISEMENT",
            "2 teaspoons honey ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "1/4 teaspoon kosher salt ADVERTISEMENT",
            "1/2 cup grapeseed oil ADVERTISEMENT",
            "2 tablespoons poppy seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss the romaine lettuce, cucumber, green onions, yellow bell pepper, red bell pepper, and carrot together in a large bowl. Arrange the apple slice atop the vegetable mixture. Scatter the blueberries, walnuts, and feta cheese over the top of the salad.\nWhisk the apple cider vinegar, lemon juice, Dijon mustard, honey, onion powder, and salt together in a small bowl. Slowly drizzle the grapeseed oil into the mixture, whisking constantly until combined. Stir the poppy seeds into the dressing; drizzle over the salad to serve.\n",
        "picture_link": "p0GfTkrpKc7P2jRTyFc280mJtQDZ8uW"
    },
    {
        "title": "Spicy Shrimp (Chingri Maach)",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "1 tomato, chopped ADVERTISEMENT",
            "1 teaspoon garlic paste ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "1/2 teaspoon garam masala ADVERTISEMENT",
            "2 green chile peppers, seeded and minced ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 pound peeled and deveined shrimp ADVERTISEMENT",
            "1/4 cup cilantro leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil over medium-high heat in a large skillet, and cook and stir onions until golden brown, about 8 minutes. Stir in tomato and cook for 2 minutes. Stir in garlic paste, turmeric, garam masala, green chile peppers, and salt, and cook for 2 minutes more.\nReduce heat to low, add the shrimp, and cook and stir over low heat until the shrimp are bright pink on the outside and the meat is no longer transparent in the center, about 8 minutes. Add a small amount of water if needed; the sauce should be thick. Sprinkle with cilantro.\n",
        "picture_link": "iZYQWyo2Oczhb1kg9n4k5.abQvxykuy"
    },
    {
        "title": "Trio of Mashed Roots (Parsnip, Turnip and Carrot)",
        "ingredients": [
            "6 carrots, peeled and chopped ADVERTISEMENT",
            "4 large parsnips, peeled and chopped ADVERTISEMENT",
            "2 turnips, peeled and chopped ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup heavy whipping cream ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place carrots, parsnips, and turnips into a pot and cover with cold, lightly salted water. Bring to a boil and cook until a fork easily breaks apart the vegetables, about 25 minutes; drain. Return vegetables to the pot.\nMix butter, cream, nutmeg, cayenne pepper, salt, and black pepper into vegetables; roughly mash together with a potato masher until vegetables are broken down but individual colors are still visible.\n",
        "picture_link": "bWBLelrvLJaOggfvu2sLwFVhoVlIgT."
    },
    {
        "title": "Pineapple Rocket Salad",
        "ingredients": [
            "4 cups torn arugula leaves ADVERTISEMENT",
            "1/4 fresh pineapple - peeled, cored, and chopped ADVERTISEMENT",
            "1/4 red onion, thinly sliced ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "3 tablespoons apple cider vinegar ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 teaspoons maple syrup ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix arugula, pineapple, red onion, and cilantro in a salad bowl. Whisk apple cider vinegar, olive oil, maple syrup, and salt in a small bowl; pour dressing over salad and toss to coat.\n",
        "picture_link": "IvXNIR.8DrptjMkWoFS4dsXKDAHE7lG"
    },
    {
        "title": "Cereal Squares",
        "ingredients": [
            "3 cups toasted oat cereal (such as Cheerios®) ADVERTISEMENT",
            "3 cups corn flake cereal ADVERTISEMENT",
            "1 cup peanuts ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1/2 cup corn syrup ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup peanut butter ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine oat cereal, corn flake cereal, and peanuts together in a large bowl.\nMix brown sugar, corn syrup, and butter together in a saucepan; bring to a boil. Remove from heat and stir in peanut butter and vanilla extract until smooth. Pour peanut butter mixture over cereal mixture; stir to coat. Press coated cereal mixture into a 9x13-inch casserole dish. Refrigerate until set, at least 1 hour. Cut into squares.\n",
        "picture_link": "1.4ZtnEgfpDc/RnbjA0snWrbHbYpDKC"
    },
    {
        "title": "Pancetta-Wrapped Haddock with Lemon Aioli and Roasted Asparagus",
        "ingredients": [
            "Lemon Aioli Sauce: ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "1 tablespoon lemon zest ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "Roasted Asparagus: ADVERTISEMENT",
            "1 bunch asparagus, bottom 1 inch trimmed ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "sea salt to taste ADVERTISEMENT",
            "Pancetta-Wrapped Haddock: ADVERTISEMENT",
            "4 6-ounce haddock fillets ADVERTISEMENT",
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "1/2 teaspoon cracked black pepper ADVERTISEMENT",
            "1/2 teaspoon crushed dried rosemary ADVERTISEMENT",
            "12 thin slices pancetta bacon, or as needed - divided ADVERTISEMENT",
            "2/3 cup white wine ADVERTISEMENT",
            "1 tablespoon warm water, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine mayonnaise, lemon juice, lemon zest, and garlic in a bowl; refrigerate for 15 to 30 minutes to blend flavors.\nMove an oven rack into the middle of oven and place another rack into top third; preheat oven to 400 degrees F (200 degrees C).\nLay asparagus spears in a row onto a baking sheet and spray with cooking spray; sprinkle with sea salt.\nDrizzle haddock fillets with olive oil and sprinkle with black pepper and rosemary. Wrap each fillet loosely with 3 slices pancetta bacon, wrapping bacon so that ends meet over skinned side of fillets. Place fillets into a 9x13-inch baking dish with bacon ends on the bottom. Pour white wine around the fillets.\nPlace fish onto lower rack of preheated oven and bake for 7 minutes. Place asparagus onto upper rack of oven. Continue baking until pancetta is browned, fish is opaque and flakes easily, and asparagus are lightly browned on the tips, 7 to 8 more minutes.\nStir warm water into lemon aioli sauce until sauce is pourable; pour about 2 tablespoons sauce onto each of 4 serving dishes. Arrange haddock fillets onto sauce and spread 1/4 of the roasted asparagus in a fan shape next to each fillet.\n",
        "picture_link": "G0I4ie9RXhBi1tp0YCV4gB4BJFbAaf."
    },
    {
        "title": "Perfect Crispy Fried Chicken",
        "ingredients": [
            "3 chicken leg quarters, cut into thighs and drumsticks ADVERTISEMENT",
            "2 cups buttermilk, or as needed to cover ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup cornmeal ADVERTISEMENT",
            "1 teaspoon granulated onion ADVERTISEMENT",
            "1 teaspoon granulated garlic ADVERTISEMENT",
            "1 teaspoon ground thyme ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "1/4 teaspoon monosodium glutamate (MSG) (optional) ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "1/8 teaspoon cayenne pepper ADVERTISEMENT",
            "4 egg whites, beaten until foamy ADVERTISEMENT",
            "vegetable oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken drumsticks and thighs in a bowl and pour enough buttermilk over chicken to cover. Cover and refrigerate for 12 to 24 hours.\nCombine flour, cornmeal, granulated onion, granulated garlic, thyme, salt, paprika, monosodium glutamate, baking powder, and cayenne pepper in a large, wide bowl.\nRemove chicken from buttermilk and shake off excess. Discard buttermilk. Pat chicken dry with paper towels.\nDip chicken into egg whites and press into flour mixture. Allow coated chicken to rest on a wire rack for 20 to 30 minutes.\nFill a cast-iron skillet or deep fryer with vegetable oil about 1/3 full. Heat to 350 degrees F (175 degrees C).\nPreheat oven to 250 degrees F (120 degrees C).\nFry chicken in hot oil in batches until golden brown and no longer pink in the center, 8 to 10 minutes per side. Thighs may take longer to fry than drumsticks. Transfer fried chicken to a wire rack or a paper towel-lined tray to drain. Keep chicken warm in preheated oven while frying remaining pieces.\n",
        "picture_link": "fUD0yBRUx3wv5BsjUL6fR024wsBmEbW"
    },
    {
        "title": "ChocoFlan",
        "ingredients": [
            "1/2 cup Mexican caramel sauce (cajeta) ADVERTISEMENT",
            "1 (12 fluid ounce) can evaporated milk ADVERTISEMENT",
            "1 (8 ounce) package PHILADELPHIA Cream Cheese, cubed, softened ADVERTISEMENT",
            "7 large eggs, divided ADVERTISEMENT",
            "1 teaspoon vanilla ADVERTISEMENT",
            "1 cup sugar ADVERTISEMENT",
            "1 (18.25 ounce) package chocolate cake mix ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/3 cup oil ADVERTISEMENT",
            "1/2 cup BREAKSTONE'S or KNUDSEN Sour Cream ADVERTISEMENT",
            "1 cup thawed Cool Whip whipped topping ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 375 degrees F.\nPour caramel sauce into 12-cup fluted tube pan sprayed with cooking spray. Blend evaporated milk, cream cheese, 4 eggs, vanilla and sugar in blender until smooth.\nBeat cake mix, water, oil and remaining eggs with mixer until blended. Add sour cream; mix well. Pour over caramel in tube pan; gently ladle flan mixture over cake batter. Cover pan with foil sprayed with cooking spray, sprayed-side down. Place in larger pan. Add enough water to larger pan to come halfway up side of tube pan.\nBake 1-1/2 hours or until toothpick inserted near center comes out clean. Cool completely in pan on wire rack. Refrigerate 2 hours. Loosen dessert from side of pan; invert onto plate. Remove pan. Serve dessert topped with COOL WHIP.\n",
        "picture_link": "nJryJwB1EEQExIDazecySAVcLx/JNWG"
    },
    {
        "title": "Sausage Potato Stuff",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 large russet potatoes, peeled and cut into 1-inch cubes ADVERTISEMENT",
            "1 (14 ounce) beef smoked sausage (such as Hillshire Farms®), cut into 1/2-inch slices ADVERTISEMENT",
            "2 (4 ounce) cans chopped green chiles ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large skillet over medium-high heat. Cook and stir potatoes and sausage in hot oil until the potatoes are tender, 7 to 10 minutes. Stir green chiles into the potato mixture; cook and stir another 5 minutes. Remove skillet from heat and sprinkle Cheddar cheese over the potato mixture. Place lid on the skillet and set aside until the cheese melts, 3 to 5 minutes.\n",
        "picture_link": "Hwx8UzRAZnyQKX37caTsOyo0jW/DrsK"
    },
    {
        "title": "Tangy Potato Salad",
        "ingredients": [
            "4 potatoes ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/4 cup diced red onion ADVERTISEMENT",
            "1/4 cup diced dill pickles ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/4 cup spicy mustard ADVERTISEMENT",
            "2 tablespoons chopped fresh chives ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring two pots of water to a boil; cook potatoes in one pot and eggs in the other pot until potatoes are semi-soft, 20 minutes. Transfer potatoes and eggs to a bowl of cold water until both are cooled.\nDice potatoes and place in a large bowl. Cut eggs in half; remove yolks and place in a separate bowl. Dice egg whites; add to potatoes. Mix red onion and pickles into potato mixture.\nWhisk mayonnaise, mustard, chives, black pepper, and egg yolks together until smooth. Gently mix mayonnaise mixture into potato mixture until evenly coated; refrigerate for 10 to 15 minutes.\n",
        "picture_link": "4Br84RLmfTvaUj0aqLqr2vQKo4CpWFi"
    },
    {
        "title": "Spinach Alfredo Enchiladas",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 yellow onion, diced ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 (8 ounce) package sliced fresh mushrooms ADVERTISEMENT",
            "1 1/2 pounds fresh spinach, stems removed ADVERTISEMENT",
            "1 1/2 cups shredded Monterey Jack cheese ADVERTISEMENT",
            "3/4 cup cottage cheese ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "10 (6 inch) flour tortillas ADVERTISEMENT",
            "1 (16 ounce) jar Alfredo sauce ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nHeat olive oil in a saucepan over medium heat; cook and stir onion and garlic until softened, about 2 minutes. Add mushrooms; cook and stir until mushrooms begin to soften, about 1 minute. Fold spinach into mixture and cook until wilted, 3 to 5 minutes. Remove saucepan from heat.\nMix Monterey Jack cheese, cottage cheese, sour cream, salt, and black pepper into spinach mixture.\nHeat a skillet over medium heat; warm tortillas, 1 at a time, in the hot skillet until flexible, about 30 seconds per side.\nSpoon spinach mixture down the center of each warmed tortilla. Roll tortilla around filling; place filled tortillas seam sides down into a 9x13-inch casserole dish. Pour Alfredo sauce over the enchiladas; top with mozzarella cheese.\nBake in the preheated oven until sauce is bubbling and cheese topping is slightly browned, 20 to 25 minutes.\n",
        "picture_link": "6VmSpZSAYBg1uv5UB3L/06bPWX6r5B."
    },
    {
        "title": "Baked Crab Rangoon from PHILADELPHIA®",
        "ingredients": [
            "1 (6 ounce) can crabmeat, drained, flaked ADVERTISEMENT",
            "4 ounces PHILADELPHIA Neufchatel Cheese, softened ADVERTISEMENT",
            "2 green onions, thinly sliced ADVERTISEMENT",
            "1/4 cup KRAFT Light Mayo Reduced Fat Mayonnaise ADVERTISEMENT",
            "12 won ton wrappers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 350 degrees F.\nCombine first 4 ingredients.\nPlace 1 won ton wrapper in each of 12 muffin pan cups sprayed with cooking spray, extending edges of wrapper over rim of cup. Fill with crab mixture.\nBake 18 to 20 min. or until edges of cups are golden brown and filling is heated through.\n",
        "picture_link": "vrNx.gsV4yxbnxZGwzekoflUZbmaS4i"
    },
    {
        "title": "Healthy Sweet Potato Muffins",
        "ingredients": [
            "1 cup mashed, cooked sweet potato ADVERTISEMENT",
            "2 large egg whites ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1/4 cup unsweetened applesauce ADVERTISEMENT",
            "2 tablespoons canola oil ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1 tablespoon orange zest ADVERTISEMENT",
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "3/4 cup whole wheat flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1 cup cranberry sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 12-cup muffin tin.\nMix sweet potato, egg whites, sugar, water, applesauce, canola oil, vanilla extract, and orange zest together in a bowl.\nWhisk all-purpose flour, whole wheat flour, baking powder, salt, and baking soda together in a separate bowl. Mix flour mixture into sweet potato mixture until just combined. Gently stir cranberry sauce into batter. Spoon batter into the prepared muffin tin.\nBake in the preheated oven until muffins are browned and tops spring back when pressed lightly in the middle, about 30 minutes. Cool in the muffin tin for 5 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "9iCSwQYx9zgXpqZdbGLkOeBJQLI4uW2"
    },
    {
        "title": "Quick Pumpkin Cake",
        "ingredients": [
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1 (15 ounce) can pumpkin puree ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 teaspoons pumpkin pie spice ADVERTISEMENT",
            "3/4 cup cream cheese, softened ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "3 cups confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch pan.\nMix cake mix, pumpkin puree, vegetable oil, eggs, and pumpkin pie spice together in a bowl; pour into the prepared pan.\nBake in the preheated oven until a toothpick inserted in the center of the cake comes out clean, about 20 minutes; remove from oven and cool cake completely.\nBeat cream cheese, butter, and vanilla extract together in a bowl until light and creamy. Gradually beat confectioners' sugar into mixture until smooth; spread onto cooled cake.\n",
        "picture_link": "gvAxj0nyBd6F6ABuCwKFeWXB7idlEAe"
    },
    {
        "title": "Creamy Biscuits and Gravy",
        "ingredients": [
            "Biscuits: ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "4 teaspoons baking powder ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "2/3 cup milk ADVERTISEMENT",
            "1 tablespoon butter, melted ADVERTISEMENT",
            "Gravy: ADVERTISEMENT",
            "1 (16 ounce) package bulk pork breakfast sausage (such as Jimmy Dean®) ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 (12 fluid ounce) can evaporated milk ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease a baking sheet.\nWhisk 2 cups flour, baking powder, sugar, and salt together in a bowl; cut shortening into flour mixture with a pastry cutter until mixture is crumbly. Mix in egg and milk until incorporated. Turn dough out onto a well-floured work surface and knead for 1 minute.\nRoll dough out to a thickness of 3/4 to 1-inch thick, cut with a biscuit cutter, and place biscuits onto prepared baking sheet. Brush tops of biscuits with melted butter.\nBake in the preheated oven until biscuits are golden brown, 8 to 10 minutes.\nCook and stir sausage in a large skillet over medium heat until browned and crumbly, about 10 minutes. Drain excess grease. Stir 1/4 cup butter into sausage until butter has melted and mix in 1/4 cup flour until thoroughly combined. Pour evaporated milk and water into sausage mixture, bring gravy to a simmer, and reduce heat to low; simmer gravy until thickened, about 5 minutes. Season gravy with salt and black pepper to taste.\nServe biscuits with sausage gravy.\n",
        "picture_link": "V4Q1zvdCIzsVE8PzidQdDbDIS6BXbKe"
    },
    {
        "title": "Sweet Potato Cranberry Bake",
        "ingredients": [
            "1 (12 ounce) package whole cranberries ADVERTISEMENT",
            "1 small unpeeled orange, sliced ADVERTISEMENT",
            "1 1/3 cups white sugar ADVERTISEMENT",
            "1/2 cup pecan pieces ADVERTISEMENT",
            "1/4 cup orange juice ADVERTISEMENT",
            "3/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/8 teaspoon ground mace ADVERTISEMENT",
            "1 (40 ounce) can cut yams, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nCombine cranberries, orange slices, sugar, pecans, orange juice, cinnamon, nutmeg, and mace in a 2-quart baking dish.\nBake in preheated oven until cranberries soften, about 30 minutes. Stir yams into cranberry mixture and continue baking until heated through, about 15 minutes more.\n",
        "picture_link": "IKIPjMQEmsQtXZ.TF0SAgNkYchXRT2a"
    },
    {
        "title": "Old-Fashioned Cracker Dressing",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 large onion, diced ADVERTISEMENT",
            "3 stalks celery, diced ADVERTISEMENT",
            "1 teaspoon salt, or to taste ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper, or to taste ADVERTISEMENT",
            "1/2 teaspoon dried sage ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "1/2 teaspoon dried rosemary ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "2 3/4 cups chicken broth ADVERTISEMENT",
            "1 pound saltine crackers, crushed ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lightly coat a baking dish with cooking spray.\nMelt butter in a large skillet over medium heat. Cook and stir onion, celery, and 1 teaspoon salt in melted butter until onion begins to turn translucent, about 5 minutes. season with black pepper, sage, thyme, rosemary, and cayenne pepper; cook and stir about 1 minute.\nRemove skillet from heat and stir in chicken broth.\nCombine crushed crackers and onion mixture in a large bowl. Add egg and cream; mix until combined. Season with salt and black pepper.\nSpread cracker mixture evenly in a large baking dish and smooth the top.\nBake in the preheated oven until top is golden brown, 40 to 45 minutes.\n",
        "picture_link": "kS2AVC93yN0JI8BQJCtDAZme0zCMoPu"
    },
    {
        "title": "A 20-Minute Chicken Parmesan",
        "ingredients": [
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup seasoned bread crumbs ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 3/4 cups pasta sauce (such as Barilla Napoletana®) ADVERTISEMENT",
            "1/2 cup shredded mozzarella cheese ADVERTISEMENT",
            "1 tablespoon grated Parmesan cheese ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Press chicken breasts with the palm of your hand to flatten to an even thickness.\nBeat egg into a shallow bowl; place bread crumbs into a separate shallow bowl. Dip each chicken breast into beaten egg and press into bread crumbs to coat.\nHeat butter in a large skillet over medium heat and fry coated chicken breasts until golden brown, about 5 minutes per side.\nPour pasta sauce over chicken, cover, and bring sauce to a boil. Reduce heat to low and simmer for 10 minutes. Sprinkle chicken with mozzarella cheese, Parmesan cheese, and parsley. Cover and simmer until cheeses melt, about 5 more minutes.\n",
        "picture_link": "eyAqC2ST1sxLNQoiKxUKPAgwk00eHaa"
    },
    {
        "title": "Hawaiian Haystacks",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves, cut into small cubes ADVERTISEMENT",
            "1/2 cup chicken broth ADVERTISEMENT",
            "1 (10.75 ounce) can cream of mushroom soup ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1 teaspoon dried parsley ADVERTISEMENT",
            "4 cups cooked rice ADVERTISEMENT",
            "1 cup chopped pineapple ADVERTISEMENT",
            "1 cup chopped green bell pepper ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 cup chopped fresh tomatoes ADVERTISEMENT",
            "1 cup chow mein noodles ADVERTISEMENT",
            "1/2 cup toasted sliced almonds ADVERTISEMENT",
            "1/2 cup chopped green onions ADVERTISEMENT",
            "1/2 cup shredded coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a skillet over medium heat; cook and stir chicken in the hot oil until no longer pink in the center, 5 to 7 minutes. Add chicken broth; simmer until slightly reduced, about 5 minutes. Mix cream of mushroom soup, basil, and parsley into chicken mixture until smooth; cook until warmed, about 5 minutes. Transfer chicken sauce to a small bowl.\nSpread cooked rice onto a serving platter; top with chicken sauce. Layer pineapple, green bell pepper, Cheddar cheese, tomatoes, chow mein noodles, almonds, green onions, and coconut, respectively, onto chicken sauce.\n",
        "picture_link": "oebdNObg5zNQPxuQZ09eQzmCDP8KcrO"
    },
    {
        "title": "Healthy Popcorn Treat",
        "ingredients": [
            "3 tablespoons coconut oil ADVERTISEMENT",
            "3/4 cup popcorn kernels ADVERTISEMENT",
            "2 tablespoons honey, or more to taste ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 pinch ground cinnamon, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat coconut oil in a large pot over high heat. Drop 3 popcorn kernels into the hot oil and place a lid on the pot; cook until 1 kernel has popped. Remove the lid and pour in the remaining popcorn. Return the lid to the pot and cook popcorn, shaking pot back and forth over burner, until there are 1 to 2 seconds between pops, about 5 minutes.\nQuickly transfer popcorn to a large bowl; evenly drizzle honey over popcorn. Add salt and cinnamon; toss popcorn with your hands to coat evenly.\n",
        "picture_link": "LYYIcymXis56V6vXoSUpuhaW1m4aPvO"
    },
    {
        "title": "Easy Carbonara Sauce",
        "ingredients": [
            "6 ounces bacon, diced ADVERTISEMENT",
            "1 large onion, diced ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1 (12 ounce) jar Alfredo sauce ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "3 roma (plum) tomatoes - halved, seeded, and chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook bacon in a large skillet over medium-high heat until evenly browned, about 10 minutes. Drain all but about 2 tablespoons bacon drippings from skillet. Cook and stir onion with bacon in reserved drippings until onion is translucent, 5 to 10 minutes. Add garlic; cook and stir until fragrant, 2 minutes.\nPour Alfredo sauce into onion-bacon mixture; rinse jar with the water and pour into skillet. Stir sauce with a wooden spoon, thoroughly scraping any brown bits of food from bottom of the skillet. Bring sauce to a simmer; add tomatoes. Simmer sauce until flavors blend, about 5 minutes.\n",
        "picture_link": "MQdPI.hBMbLjhVzx/VrgGOsjcgfeJD."
    },
    {
        "title": "BLT Rollers",
        "ingredients": [
            "4 ounces PHILADELPHIA Cream Cheese, softened ADVERTISEMENT",
            "1/4 cup KRAFT Real Mayo Mayonnaise ADVERTISEMENT",
            "8 slices OSCAR MAYER Bacon, cooked, crumbled ADVERTISEMENT",
            "1/2 cup chopped tomatoes ADVERTISEMENT",
            "2 (8 inch) flour tortillas ADVERTISEMENT",
            "1/2 cup shredded romaine lettuce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix cream cheese and mayo in medium bowl. Add bacon and tomatoes; mix well.\nSpread onto tortillas; top with lettuce. Roll up tightly.\nCut each into 7 diagonal slices.\n",
        "picture_link": "dDLivCbvi4C.PFTeUzJT5MY4EkoX4jC"
    },
    {
        "title": "Fourth of July Layered Gelatin",
        "ingredients": [
            "1 (6 ounce) package cherry flavored Jell-O® mix ADVERTISEMENT",
            "2 (.25 ounce) envelopes unflavored gelatin ADVERTISEMENT",
            "2 cups boiling water ADVERTISEMENT",
            "4 (.25 ounce) envelopes unflavored gelatin ADVERTISEMENT",
            "1 cup boiling water ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 (6 ounce) package blue raspberry flavored Jell-O® mix ADVERTISEMENT",
            "2 (.25 ounce) envelopes unflavored gelatin ADVERTISEMENT",
            "2 cups boiling water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cherry gelatin mix into a heatproof bowl, stir in 1 packet of unflavored gelatin, and mix with 2 cups of boiling water, stirring until the gelatin has dissolved and the mixture is clear, about 2 minutes. Pour into the bottom of a 9x13 rectangular glass baking dish. Place in refrigerator until completely cold and set, about 1 hour.\nSprinkle 4 packets of unflavored gelatin onto 1 cup of boiling water in a heatproof bowl, allow to stand for about 3 minutes, and stir until dissolved; mix in the sweetened condensed milk. Allow to cool but not thicken, about 10 minutes; gently pour into a layer on top of the cherry layer. Return to refrigerator and allow to chill completely, about 1 more hour.\nPlace blue raspberry gelatin mix and 1 packet of unflavored gelatin into a heatproof bowl, and mix with 2 cups of boiling water, stirring until the blue gelatin is clear, about 2 minutes. Allow to stand and cool but not thicken, about 10 minutes; gently pour onto the white layer. Chill in refrigerator until the dessert is firm and cold, about 1 hour. To serve, cut into squares.\n",
        "picture_link": "hXoBm/Ca3KMIBYYKTNNs0qSZoY/Dthe"
    },
    {
        "title": "James Gang Red Velvet Cake",
        "ingredients": [
            "1/2 cup vegetable shortening ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 ounces red food coloring ADVERTISEMENT",
            "2 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 tablespoon white vinegar ADVERTISEMENT",
            "1 teaspoon butter flavored extract ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 cup vegetable shortening ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup flaked coconut, or as desired (optional) ADVERTISEMENT",
            "1 tablespoon chopped nuts (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pre-heat oven to 350 degrees. Grease and flour 2 9-inch or 3 8-inch round cake pans.\nIn a large bowl, mash together 1/2 cup of vegetable shortening with 1 1/2 cup of sugar until combined, then mix in the eggs, one at a time, stirring until the mixture is thoroughly blended. In a small bowl, stir the red food coloring with the cocoa powder to make a smooth paste, and stir the coloring into the shortening mixture.\nSprinkle in the salt, and mix in the flour in several additions, alternating with buttermilk. As you mix, sprinkle in the baking soda, then drizzle in the vinegar, butter extract, and vanilla extract. Stir just until the mixture is smooth. Pour batter into prepared cake pans.\nBake in the preheated oven until the cakes are set in the center and a toothpick inserted into the center of a cake comes out clean, about 30 minutes. Allow to cool.\nIn a saucepan over medium-low heat, whisk together 3 tablespoons of flour with milk until smooth. Bring just to a simmer, whisking constantly, and cook until thickened, about 30 seconds. Remove from heat, and let cool completely. In a bowl, mash together 1 cup of vegetable shortening with 1 cup of sugar and 1 teaspoon of vanilla extract until thoroughly combined, and slowly beat in the cooled milk mixture with an electric mixer, about 1 tablespoon at a time. Beat until the frosting is fluffy, 1 to 2 more minutes. Frost the cooled cake layers with the frosting, and sprinkle cake with coconut and chopped nuts to serve.\n",
        "picture_link": "RLNjqAtRgWWpaUKHjRi8nvgrovR7y0u"
    },
    {
        "title": "Ultimate Hoagie Dip",
        "ingredients": [
            "1/2 pound bologna, cut into pieces ADVERTISEMENT",
            "1/2 pound ham, chopped ADVERTISEMENT",
            "1/4 pound Genoa salami, chopped ADVERTISEMENT",
            "1/4 pound pepperoni, chopped ADVERTISEMENT",
            "1/4 pound American cheese, cut into pieces ADVERTISEMENT",
            "1/4 pound provolone cheese, cut into pieces ADVERTISEMENT",
            "3/4 cup mayonnaise ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 tablespoon dried oregano ADVERTISEMENT",
            "1 kosher pickle, chopped ADVERTISEMENT",
            "1 cup shredded lettuce ADVERTISEMENT",
            "1 tomatoes, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the bologna, ham, salami, pepperoni, American cheese, and provolone cheese in a bowl. Stir in the mayonnaise, garlic powder, and oregano. Sprinkle the pickle, lettuce, and tomato on top.\n",
        "picture_link": "oh2hqm76D6lm3e5umzaw0tiOVeZghNG"
    },
    {
        "title": "Baked French Toast With Maple Syrup and Granola",
        "ingredients": [
            "1 (1 pound) loaf challah bread, sliced 1/2-inch thick ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 quart half-and-half cream ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup light brown sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1 cup granola cereal ADVERTISEMENT",
            "1/2 cup maple syrup ADVERTISEMENT",
            "1/2 cup unsalted butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Butter a 9x13-inch baking dish. Lay the bread slices into the prepared baking dish in 2 layers. Beat eggs, half-and-half cream, orange juice, white sugar, brown sugar, cinnamon, and nutmeg together in a bowl until smooth, and pour over the bread. With a large spoon, press the bread down into the egg mixture so all the bread becomes soaked with the mixture.\nSprinkle the granola evenly over the casserole, and drizzle with maple syrup and melted butter. Cover the dish with plastic wrap, and refrigerate overnight.\nAbout 1 hour before serving, remove the casserole from the refrigerator, and take off the plastic wrap. Preheat oven to 300 degrees F (150 degrees C).\nBake in the preheated oven for 30 minutes, then turn oven temperature up to 375 degrees F (190 degrees C). Bake the casserole until browned, about 15 more minutes. Serve warm.\n",
        "picture_link": "Wh3eZWifO/JvB/hbIaBHDnt0QNGUz3q"
    },
    {
        "title": "Yia Yia's Avgolemono",
        "ingredients": [
            "1 (2.5 pound) whole chicken ADVERTISEMENT",
            "1 teaspoon kosher salt ADVERTISEMENT",
            "1 onion, quartered ADVERTISEMENT",
            "2 carrots, cut into 2-inch chunks ADVERTISEMENT",
            "3 stalks celery with leaves, cut into 2-inch pieces ADVERTISEMENT",
            "8 cups water ADVERTISEMENT",
            "3/4 cup uncooked orzo pasta ADVERTISEMENT",
            "2 eggs, separated ADVERTISEMENT",
            "2 lemons, juiced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the chicken, salt, onion, carrots, celery, and water into a stock pot. Bring to a boil over high heat, then reduce heat to medium-low, and simmer until the chicken is tender, about 1 1/2 hours. Skim away any scum that forms as the chicken simmers.\nStrain and reserve the broth in a clean pot. Pick the meat from the chicken, discarding the bones, skin, and vegetables. Cut the meat into small pieces, and set aside. Bring the broth to a boil over medium heat and stir in the orzo pasta. Let simmer 20 minutes.\nWhile the orzo is cooking, beat the egg whites to stiff peaks, then whisk in the egg yolks until completely incorporated. Measure out 2 cups of the simmering broth, and combine it with the lemon juice. Slowly pour the lemon mixture into the eggs while whisking continuously until incorporated.\nWhen the orzo is nearly done, return the chicken meat to the soup, and cook until reheated. Stir in the egg mixture, stirring gently until incorporated into the soup. Serve immediately.\n",
        "picture_link": "a1.uAjWPPshT9qilZve8Sjl3zbCVraq"
    },
    {
        "title": "Lemon Cream Cupcakes",
        "ingredients": [
            "Cream Filling: ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "3/4 cup cream cheese, softened ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 teaspoon lemon zest ADVERTISEMENT",
            "Cupcake Batter: ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3/4 cup butter ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "6 eggs at room temperature ADVERTISEMENT",
            "1/4 cup fresh lemon juice ADVERTISEMENT",
            "2 teaspoons lemon zest ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Grease 24 muffin cups, or line with paper muffin liners.\nPrepare the filling by beating 1/4 cup sugar, cream cheese, 1 tablespoon lemon juice, and 1 teaspoon lemon zest with an electric mixer until smooth. Scoop the filling into a pastry bag, and set aside. Whisk together the flour, baking powder, and salt in a mixing bowl; set aside.\nBeat butter and 1 1/4 cups sugar with an electric mixer in a large bowl until light and fluffy. The mixture should be noticeably lighter in color. Add the eggs one at a time, allowing each egg to blend into the butter mixture before adding the next. Beat in 1/4 cup lemon juice and 2 teaspoons lemon zest with the last egg. Beat in the flour mixture, mixing until just incorporated.\nPour the batter into prepared pans, filling the muffin cups half full. Pipe about 1 tablespoon of the filling onto the center of each cupcake, then top with the remaining batter to fill the muffin cup 3/4 full.\nBake in the preheated oven until the tops are light golden brown, about 15 minutes. Cook completely on a wire rack.\n",
        "picture_link": "DSfdq8FbdTvacc3ezG.xYWpGozKTzLu"
    },
    {
        "title": "Bacon Gouda Patties",
        "ingredients": [
            "2 slices bacon ADVERTISEMENT",
            "3/4 cup shredded Gouda cheese ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "1 1/2 tablespoons Dijon mustard ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1/4 cup bread crumbs ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 hamburger buns, split and toasted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate. Cool and crumble into a bowl. Stir in the gouda cheese, parsley, and Dijon mustard. Set filling aside.\nPlace the ground beef into a mixing bowl with the bread crumbs, egg, chopped garlic, and garlic powder. Season to taste with salt and black pepper. Mix until evenly blended, and form into 4 very thin patties.\nPreheat an outdoor grill for medium-high heat, and lightly oil the grate.\nDivide the filling in half and spread each half onto a patty. Top filling with remaining patties to make 2 stuffed burgers. Press and seal edges tightly together to keep the filling enclosed.\nCook stuffed burgers on the preheated grill until the patties are cooked to your desired degree of doneness and the cheese has melted, 3 to 5 minutes per side for well done. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C). Serve on toasted hamburger buns.\n",
        "picture_link": "nlmSt3OE/m8njlWyctTd3VzVUjbvLKu"
    },
    {
        "title": "Raspberry-Lemon Pie In a Toasted Coconut Crust",
        "ingredients": [
            "2 cups shredded coconut ADVERTISEMENT",
            "1/2 cup unsalted butter, melted ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1/2 cup unsalted butter ADVERTISEMENT",
            "1/4 cup fresh lemon juice ADVERTISEMENT",
            "3 eggs at room temperature ADVERTISEMENT",
            "2 egg yolks at room temperature ADVERTISEMENT",
            "1 tablespoon grated lemon zest ADVERTISEMENT",
            "1 1/2 pints fresh raspberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSpread the coconut onto a baking sheet, and bake in the preheated oven until lightly toasted and golden, about 10 minutes. Watch carefully to prevent burning. Mix the coconut and 1/2 cup melted butter in a bowl, and chill until it begins to firm, about 15 minutes. Pat the coconut mixture into the bottom and up the sides of a 9-inch pie dish. Chill until set, at least 30 minutes.\nPlace sugar, 1/2 cup of butter, lemon juice, eggs, and egg yolks in a saucepan. Place over low heat, and whisk constantly until thickened, 15 to 20 minutes. Do not boil. Strain the custard through a fine-mesh strainer into a bowl, and stir in the lemon zest. Place a sheet of plastic wrap directly onto the surface of the custard, and chill thoroughly.\nSpoon the lemon custard into the coconut crust, and top with fresh raspberries.\n",
        "picture_link": "19n6ETWBIqtoat2rG21GandWdcxB6nS"
    },
    {
        "title": "Petite Blanquette de Poulet a l'Estragon (Tarragon Chicken)",
        "ingredients": [
            "1 whole onion ADVERTISEMENT",
            "1 whole clove ADVERTISEMENT",
            "6 cups water ADVERTISEMENT",
            "7 fluid ounces white wine ADVERTISEMENT",
            "1 stalk celery, cut into chunks ADVERTISEMENT",
            "1 clove garlic ADVERTISEMENT",
            "1 sprig fresh thyme ADVERTISEMENT",
            "1 sprig fresh parsley ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 (3 pound) whole chicken, cut into 8 pieces ADVERTISEMENT",
            "2 carrots, cut into chunks ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 1/2 ounces butter ADVERTISEMENT",
            "4 1/2 ounces fresh mushrooms, trimmed and halved ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "3 tablespoons heavy cream ADVERTISEMENT",
            "1 sprig fresh tarragon leaves, finely chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Poke the whole clove into the onion, and place onion into a large soup pot. Stir in water, white wine, celery, garlic, thyme, parsley, salt, and black pepper; bring the mixture to a boil over medium heat. Place the chicken pieces and carrots into the liquid, cover, and simmer for 20 minutes. Remove the chicken pieces to a bowl; strain the stock and reserve about 2 cups. Discard vegetables and herbs.\nSprinkle the chicken pieces with flour. Melt butter in a large skillet over medium heat, and pan-fry the chicken until golden brown, about 5 minutes per side. Remove chicken pieces; place mushrooms into the skillet, and cook, stirring occasionally, until the mushrooms have just started to brown, about 10 minutes.\nReturn chicken to skillet; pour in enough stock to barely cover the chicken and mushrooms (about 2 cups); cover and simmer for 20 minutes. Remove chicken and mushrooms to a serving dish. Boil the remaining liquid until reduced by half, stirring constantly, about 10 minutes.\nIn a bowl, whisk together the egg yolk, lemon juice, and cream; remove the skillet from the heat, and gradually whisk the egg yolk mixture into the reduced stock until the sauce thickens. Whisk in tarragon. Serve sauce over the chicken and mushrooms.\n",
        "picture_link": "W2.AYIqKq6KXk3Fq8dZ/sVOOL.rXt5O"
    },
    {
        "title": "Chocolate Peppermint Meringue Drops",
        "ingredients": [
            "3 egg whites ADVERTISEMENT",
            "1/8 teaspoon cream of tartar ADVERTISEMENT",
            "4 drops peppermint oil, or to taste ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 drop red food coloring, or as needed (optional) ADVERTISEMENT",
            "3 peppermint candy canes, crushed ADVERTISEMENT",
            "1/2 cup chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C). Line a baking sheet with parchment paper.\nBeat egg whites, cream of tartar, and peppermint oil together in a mixing bowl with an electric mixer on medium-high speed until soft peaks form. Beat in sugar, about 1 tablespoon at a time; beat in food coloring if desired, until the mixture is glossy and forms stiff peaks. Very gently fold in the crushed candy canes and chocolate chips. Drop the meringue by tablespoon onto the prepared baking sheet.\nBake in the preheated oven until dry, 28 to 33 minutes. Cool the cookies on baking sheet on a rack for 20 minutes before removing from parchment paper.\n",
        "picture_link": "GR55907j6PjHhvinHs2Pl58I8de340G"
    },
    {
        "title": "Cajun Chicken Pot Pie",
        "ingredients": [
            "1 deep dish pastry for double crust ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "3 skinless, boneless chicken breast halves, cut into bite size pieces ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 (8 ounce) package portobello mushrooms, chopped ADVERTISEMENT",
            "1 (10.75 ounce) can reduced-fat, reduced-sodium condensed cream of chicken soup, undiluted ADVERTISEMENT",
            "1 (10.75 ounce) can reduced-fat, reduced-sodium cream of mushroom soup, undiluted ADVERTISEMENT",
            "1/2 cup chicken broth, or more as needed ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/2 (14.5 ounce) can chopped tomatoes, drained ADVERTISEMENT",
            "3 cups frozen mixed vegetables, thawed ADVERTISEMENT",
            "1/4 teaspoon crushed red pepper flakes (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 375 degrees F (190 degrees C). Spray a deep dish pie pan with cooking spray. Arrange one pie crust on the bottom of the pan.\nHeat the olive oil in a skillet over medium heat. Stir in the the chicken breast and season with salt and pepper. Cook and stir until the chicken is no longer pink in the center, about 7 minutes. Add the portobello mushrooms; cook and stir until the mushrooms are tender. Stir in the cream of chicken and cream of mushroom soups, chicken broth, cream cheese, and tomatoes. Stir in more chicken broth if the mixture becomes too thick. Stir in the mixed vegetables and red pepper flakes.\nPour chicken mixture into the prepared pan, reserving any leftover filling. Place the top crust on top, crimping the edges of the crusts to seal. Poke 4 to 5 holes in the top crust. Cover loosely with aluminum foil.\nBake in the preheated oven until golden brown, about 45 minutes. Serve with the leftover chicken mixture.\n",
        "picture_link": "/iSlz1wAhIo7jUsXf3DWZwhWFBWV3fm"
    },
    {
        "title": "Mom's Venison Barbeque Sauce",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "1 small onion, minced ADVERTISEMENT",
            "1 cup ketchup ADVERTISEMENT",
            "3 tablespoons lemon juice ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "3 tablespoons brown sugar ADVERTISEMENT",
            "2 tablespoons prepared yellow mustard ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "4 (4 ounce) venison steaks ADVERTISEMENT",
            "2 teaspoons cornstarch ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 325 degrees F (165 degrees C).\nMelt the butter in a large skillet over medium heat. Cook and stir the onion in the melted butter until softened, about 5 minutes. Stir the ketchup, lemon juice, Worcestershire sauce, brown sugar, and yellow mustard into the onion and butter; allow mixture to warm completely.\nHeat a separate skillet over medium-high heat. Season the steaks with salt and black pepper; cook in the skillet until browned on each side, 3 to 4 minutes per side. Transfer the steaks to a 9x13-inch baking dish. Pour the sauce from the skillet over the steaks.\nBake in the preheated oven until meat is cooked through and no longer pink in the middle, about 1 hour.\nTransfer the steaks from the baking dish to a platter, shaking any excess sauce from the meat. Stir the cornstarch and water together until smooth in a small bowl, then mix into the hot sauce remaining in the baking dish until the mixture begins to thicken; pour over the steaks to serve.\n",
        "picture_link": "sNZiTMdqcXvKbijVGAGhFUfXTq5x0E6"
    },
    {
        "title": "Moroccan Quinoa Salad",
        "ingredients": [
            "3 tablespoons olive oil ADVERTISEMENT",
            "5 cloves garlic, minced ADVERTISEMENT",
            "3 shallots, diced ADVERTISEMENT",
            "1 1/2 teaspoons ground cumin ADVERTISEMENT",
            "1 1/2 teaspoons ground ginger ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "4 cups chicken broth ADVERTISEMENT",
            "2 cups red quinoa ADVERTISEMENT",
            "1 1/4 cups raisins ADVERTISEMENT",
            "2 cups hot water ADVERTISEMENT",
            "lemon, juiced ADVERTISEMENT",
            "1 (29 ounce) can garbanzo beans, drained ADVERTISEMENT",
            "2 carrots, shredded ADVERTISEMENT",
            "1/3 cup chopped fresh parsley ADVERTISEMENT",
            "1/3 cup chopped fresh basil ADVERTISEMENT",
            "1/3 cup chopped fresh mint ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a skillet over medium heat. Stir in the garlic and shallots; cook and stir until the shallots have softened and turned translucent, about 5 minutes. Stir in the cumin, ginger, and cinnamon. Cook until fragrant, about 1 minute more. Add the chicken broth and quinoa, and bring to a boil, then reduce heat to low. Cover and cook until the quinoa is tender and the liquid has been absorbed, about 20 minutes.\nMeanwhile, place raisins in a bowl and cover with hot water. Soak until the raisins soften and plump up, about 15 minutes. Drain and set aside.\nFluff the quinoa with a fork and stir in the lemon juice. Remove from heat and allow to cool to room temperature. Stir in the garbanzo beans, raisins, carrots, parsley, basil, and mint. Serve at room temperature or chilled.\n",
        "picture_link": "3935SVu.lFvguGJ3UcWGBl27aeWCXhy"
    },
    {
        "title": "Chompo Bars",
        "ingredients": [
            "1/4 cup light corn syrup ADVERTISEMENT",
            "3 cups miniature marshmallows ADVERTISEMENT",
            "6 cups chocolate flavored crispy rice cereal ADVERTISEMENT",
            "1 1/4 cups peanut butter ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grease a 9x13-inch baking pan.\nHeat the corn syrup and marshmallows in a large saucepan over medium-low heat until marshmallows are melted, 5 to 7 minutes. Remove from heat, and stir in the crispy rice cereal. Press the cereal mixture into the prepared baking pan. Place a sheet of aluminum foil over the cereal mixture, and use a soup can to press the cereal together firmly to create a dense layer. Remove the foil, and spread the peanut butter on top, then refrigerate the pan.\nMeanwhile, melt the chocolate chips with the vegetable oil in the top of a double boiler over just-barely simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching. Once the chocolate mixture is smooth, allow it to cool slightly before spreading over the peanut butter layer. Return pan to the refrigerator, and chill until the chocolate layer has hardened, about 30 minutes. Cut into 36 bars.\n",
        "picture_link": "/WW7uGli0wiF/dg3Pwh/RBEfBxjjJfa"
    },
    {
        "title": "Refreshing Watermelon Lemonade Slush",
        "ingredients": [
            "1 cup cubed seeded watermelon ADVERTISEMENT",
            "1 1/4 cups water ADVERTISEMENT",
            "3 tablespoons sweetened strawberry lemonade drink mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the watermelon pieces onto a plastic-wrapped baking sheet, and freeze until solid, about 45 minutes.\nPlace the frozen watermelon, water, and strawberry lemonade drink mix in a blender; blend until slushy.\n",
        "picture_link": "zR8kcrN3hNlyfP6vxXw/7uYNkhcWlKi"
    },
    {
        "title": "Beef and Broccoli Stir Fry with Whole Grain Brown Rice",
        "ingredients": [
            "Nonstick cooking spray ADVERTISEMENT",
            "2 cups broccoli florets, blanched ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 pound beef sirloin steak, thinly sliced ADVERTISEMENT",
            "4 green onions, thinly sliced ADVERTISEMENT",
            "1 cup UNCLE BEN'S® Fast & Natural™ Whole Grain Instant Brown Rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet, spray with non-stick spray and saute the beef until browned.\nAdd the garlic, green onion, broccoli and soy sauce; saute for 1 minute.\nAdd the rice and water (according to package directions), bring to a simmer, cover and cook for 10 minutes.\n",
        "picture_link": "GdCWrdkrIeGf5qFg5JQE5tiEmqBCFFG"
    },
    {
        "title": "Thanksgiving Leftover Wontons with Cranberry Salsa",
        "ingredients": [
            "3/4 cup lemon juice ADVERTISEMENT",
            "1 cup dried cranberries ADVERTISEMENT",
            "1 1/2 cups shredded cooked turkey ADVERTISEMENT",
            "1 cup prepared stuffing ADVERTISEMENT",
            "4 ounces cream cheese, softened ADVERTISEMENT",
            "1/4 cup thick turkey gravy ADVERTISEMENT",
            "1 (14 ounce) package wonton wrappers ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "3 cups canola oil for frying ADVERTISEMENT",
            "2 tablespoons minced onion ADVERTISEMENT",
            "1 tablespoon lime juice ADVERTISEMENT",
            "1 teaspoon seeded and minced jalapeno pepper - or to taste ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1 teaspoon water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the lemon juice over the dried cranberries in a bowl; set aside. Mix the turkey, stuffing, cream cheese, and turkey gravy in a separate bowl until thoroughly combined.\nPlace a wonton wrapper on a work surface; spoon about 1 tablespoon of the filling in the center of the wrapper. Moisten two opposite edges of the wrapper with a finger dipped in water, fold the wrapper in half the long way, and press the edges together with a fork. Sprinkle the wrapper with salt. Repeat with remaining filling and wrappers.\nHeat the canola oil in a large, deep skillet over medium heat; pan-fry the filled wontons in batches until crisp and golden brown, about 2 minutes per side. Drain the fried wontons on paper towels; allow to cool for about 5 minutes to set the filling.\nDrain the lemon juice from the dried cranberries. Place cranberries into a food processor; pulse several times until the cranberries are finely chopped. Transfer to a bowl and mix in the onion, lime juice, jalapeno pepper, garlic, and water. Serve with the hot fried wontons.\n",
        "picture_link": "VWNJmk7VyT30NZbVSe4jas/i0V3L1kq"
    },
    {
        "title": "My Own Strawberry Rhubarb Pie",
        "ingredients": [
            "3 cups strawberries, cut into 1/2-inch pieces ADVERTISEMENT",
            "3 cups chopped rhubarb ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground allspice ADVERTISEMENT",
            "1 tablespoon cornstarch, or as needed ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 tablespoon butter, diced ADVERTISEMENT",
            "1 recipe pastry for a 9 inch double crust pie ADVERTISEMENT",
            "1 tablespoon milk ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the strawberries, rhubarb, brown sugar, 1/2 cup of white sugar, cinnamon, allspice, cornstarch, and flour into a bowl; stir until the flour and cornstarch are smoothly combined. Let the filling stand for 30 minutes. If the filling is very juicy, add an additional tablespoon of cornstarch.\nPreheat oven to 400 degrees F (200 degrees C).\nDivide the pie pastry in half; roll out half into a circle on a floured work surface, and line a 9-inch pie dish with bottom crust. Roll the remaining half out into a 10-inch circle on a floured work surface, and set aside.\nPour the filling into the crust-lined pie dish. Scatter diced butter over the top.\nCut the remaining crust into 3/4-inch wide strips (use a scalloped edge pastry cutter for a prettier crust). Moisten the rim of the filled bottom crust with a bit of water, and lay the two longest strips in a cross in the middle of the pie. Working from the next longest down to the shortest strips, alternate horizontal and vertical strips, weaving the strips as you go. Press the lattice strips down onto the bottom crust edge to seal, and trim the top crust strips neatly. Brush the crust with milk, and sprinkle with 1 tablespoon of sugar. Cover pie edges with aluminum foil strips.\nBake pie in preheated oven for 15 minutes; lower temperature to 375 degrees F (190 degrees C), and bake until the filling is bubbling and the crust is golden brown, about 40 minutes. Remove aluminum foil about 15 minutes before end of baking. Turn off oven, and allow pie to rest for 15 minutes with the door open, and 15 more minutes with the door closed. Allow to cool completely on wire rack for several hours or overnight; filling will thicken as it sits.\n",
        "picture_link": "1MFk/zSrPA0CDf6BT9/q3yGtF09t4gS"
    },
    {
        "title": "Hearty Whole Grain Muffins",
        "ingredients": [
            "1/2 cup raisins ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 cup whole wheat flour ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground allspice ADVERTISEMENT",
            "1/2 cup nonfat dry milk powder ADVERTISEMENT",
            "1/4 cup toasted wheat germ ADVERTISEMENT",
            "1/4 cup wheat bran ADVERTISEMENT",
            "3 tablespoons uncooked farina hot cereal (such as Cream of Wheat®) ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "1 1/4 cups unsweetened applesauce ADVERTISEMENT",
            "1 large carrot, peeled and shredded ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1/4 cup bran cereal ADVERTISEMENT",
            "3 tablespoons raw sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line 18 muffin cups with paper liners.\nIn a small bowl, cover the raisins with water, and set aside to plump. In a large mixing bowl, whisk together the all-purpose flour, whole wheat flour, sugar, baking powder, baking soda, salt, cinnamon, allspice, dry milk powder, wheat bran, and farina cereal until thoroughly combined.\nDrain water from the raisins. In a separate bowl, beat the egg whites until frothy, then mix in the drained raisins, applesauce, carrot, vegetable oil, and bran cereal. Pour the liquid ingredients into the flour mixture, and briefly mix just to moisten (do not overmix). Fill muffin cups about 2/3 full, and sprinkle each muffin with about 1/2 teaspoon of raw sugar.\nBake in the preheated oven until the muffins are set and the tops are golden brown, 25 to 30 minutes. A toothpick inserted into the center of a muffin should come out clean. Serve warm.\n",
        "picture_link": "JUrJBjU68ACqO7PeexWj44Fhf/sIxLe"
    },
    {
        "title": "Roast Beef Panini with Caramelized Shallots and Roquefort",
        "ingredients": [
            "3 tablespoons unsalted butter ADVERTISEMENT",
            "6 large shallots, sliced ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "2 French baguettes, halved lengthwise ADVERTISEMENT",
            "2 tablespoons Dijon mustard, or to taste ADVERTISEMENT",
            "1 cup Roquefort cheese, crumbled ADVERTISEMENT",
            "1 pound thinly sliced deli roast beef ADVERTISEMENT",
            "1/2 cup cold heavy cream ADVERTISEMENT",
            "1 1/2 tablespoons finely shredded horseradish root ADVERTISEMENT",
            "1 pinch salt and white pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a skillet over medium heat. Stir in the sliced shallots; cook and stir until very tender and golden-brown, about 10 minutes. Season to taste with salt and black pepper. Set aside.\nPreheat a panini press according to manufacturer's instructions.\nSpread the cut sides of the baguettes with Dijon mustard, then sprinkle evenly with Roquefort cheese. Divide the roast beef among the bottom pieces, then spread the shallots out over the roast beef. Top with the top pieces. Cut each baguette into two or three pieces to fit your panini machine.\nGrill the sandwiches on the preheated press until the bread is golden and crisp, and the cheese has melted, about 4 minutes. While the sandwiches are cooking, beat the heavy cream to soft peaks in a metal bowl. Stir in the horseradish, and season with salt and white pepper to taste.\nWhen ready, cut each sandwich in half, and serve with horseradish cream.\n",
        "picture_link": "fgYe6A58UesH0f96YJblD3R3x8SkXcW"
    },
    {
        "title": "Easy Tortellini Salad",
        "ingredients": [
            "1 (8 ounce) package dried spinach tortellini ADVERTISEMENT",
            "1 (8 ounce) package dried three-cheese tortellini ADVERTISEMENT",
            "1 cup grape tomatoes, halved ADVERTISEMENT",
            "1 (6 ounce) jar marinated artichoke hearts, drained and chopped ADVERTISEMENT",
            "1 (6 ounce) can sliced black olives, drained ADVERTISEMENT",
            "1/2 red onion, thinly sliced ADVERTISEMENT",
            "1/4 cup grated carrots ADVERTISEMENT",
            "1 1/2 cups oil and vinegar dressing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with lightly salted water and bring to a rolling boil. Stir in spinach and three-cheese tortellini and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through but is still slightly firm, 10 to 11 minutes.\nDrain well, and allow tortellini to cool.\nToss together the tortellini, grape tomatoes, artichoke hearts, olives, red onion, carrots, and dressing in a large bowl.\nCover and refrigerate until chilled, at least 3 hours or overnight.\n",
        "picture_link": "fOblNvefhr.Q9ROdxoF0QmpzyeWwEgy"
    },
    {
        "title": "Cajun Baked Catfish Dijon",
        "ingredients": [
            "2 pounds catfish fillets ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "3/4 cup thinly sliced red onion ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1/4 cup Dijon mustard ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1 teaspoon hot chile oil ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C).\nArrange the catfish in a shallow baking dish; season liberally with salt and pepper.\nSpread onion slices over the fish.\nDot fish with butter.\nBake in the preheated oven until the fish flakes easily with a fork, about 20 minutes.\nRemove baking dish from oven.\nPreheat the oven's broiler.\nMix the mayonnaise, Dijon mustard, lemon juice, and hot chile oil together in a bowl.\nSpread the mayonnaise mixture over the fish.\nReturn the fish to the oven and broil until the sauce is browned and bubbly, 2 to 3 minutes.\nGarnish with chopped cilantro.\n",
        "picture_link": "pRP7vntHqjM2jYPX9tOdirSpVothJfm"
    },
    {
        "title": "Mom's Ranger Cookies",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 large eggs ADVERTISEMENT",
            "1 3/4 teaspoons vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 1/2 tablespoons all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 1/2 teaspoons baking soda ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "1 3/4 cups rolled oats ADVERTISEMENT",
            "1 3/4 cups corn flake cereal ADVERTISEMENT",
            "1/2 cup flaked coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nBeat butter, brown sugar, and white sugar together in a bowl until creamy.\nBeat in eggs and vanilla extract until smooth.\nIn a separate bowl, whisk together both amounts of flour, salt, baking soda, and baking powder. Mix flour mixture into the liquid ingredients.\nGently mix rolled oats, corn flakes, and coconut into the dough until thoroughly combined.\nDrop the dough by tablespoons onto baking sheets.\nBake in the preheated oven until the cookies are light golden brown, 10 to 12 minutes.\nCool in the pans for 10 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "9uTIrzlD6mJM3A0oUJfaHCM2woiG2vy"
    },
    {
        "title": "Salmon Burgers with Lemon Basil Mayo",
        "ingredients": [
            "2 pounds salmon, finely diced ADVERTISEMENT",
            "1 small yellow onion, finely diced ADVERTISEMENT",
            "3/4 cup panko bread crumbs ADVERTISEMENT",
            "1 green bell pepper, finely diced ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "2 cloves fresh garlic, minced ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1 teaspoon Dijon mustard ADVERTISEMENT",
            "1/2 teaspoon lemon pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine salmon, onion, bread crumbs, green bell pepper, 3 cloves garlic, egg, soy sauce, 1 teaspoon lemon juice, and salt in a large bowl; mix until evenly blended. Shape salmon mixture into eight patties.\nHeat a large non-stick skillet over medium-high heat. Cook salmon patties until golden brown, 4 to 6 minutes per side.\nWhisk mayonnaise, 2 cloves garlic, basil, 1 teaspoon lemon juice, Dijon mustard, and lemon pepper in a bowl until well mixed. Serve mayonnaise mixture with salmon patties.\n",
        "picture_link": "wbsTyyXyTGb2./pScG/FP0tzCJ/TPX."
    },
    {
        "title": "Spicy Lentil Soup",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "4 cloves garlic, chopped ADVERTISEMENT",
            "1 large carrot, chopped ADVERTISEMENT",
            "1 large stalk celery, chopped ADVERTISEMENT",
            "2 tablespoons tomato paste ADVERTISEMENT",
            "1/8 teaspoon crushed red pepper flakes, or more to taste ADVERTISEMENT",
            "1/8 teaspoon cayenne pepper, or more to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "6 cups chicken stock ADVERTISEMENT",
            "1 1/2 cups dry lentils ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large saucepan over medium heat; cook and stir onion and garlic until onion is translucent, about 5 minutes.\nStir in carrot and celery; cook, stirring often, until vegetables are tender, about 8 more minutes.\nStir in tomato paste, crushed red pepper, cayenne pepper, salt, and black pepper; mix in chicken stock and lentils.\nBring soup to a boil and reduce heat to low; simmer until lentils are soft, about 20 minutes.\n",
        "picture_link": "o1ApvUwJEJ3v3Id/FrwpZhSBGBkfAYK"
    },
    {
        "title": "Kickin' Chicken Stir Fry",
        "ingredients": [
            "4 cups water ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "3 dried red chiles, broken into several pieces ADVERTISEMENT",
            "2 cups uncooked white rice ADVERTISEMENT",
            "1 tablespoon sesame oil ADVERTISEMENT",
            "2 garlic cloves, minced ADVERTISEMENT",
            "2 tablespoons soy sauce, divided ADVERTISEMENT",
            "1 skinless, boneless chicken breast half, diced ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1 teaspoon ground white pepper ADVERTISEMENT",
            "1/2 teaspoon dry ground mustard ADVERTISEMENT",
            "1 pinch ground tumeric ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 1/2 cups broccoli florets ADVERTISEMENT",
            "1 cup diced green bell pepper ADVERTISEMENT",
            "1 cup diced red bell pepper ADVERTISEMENT",
            "1/2 cup diced onion ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water, salt, 2 tablespoons butter, and red chili peppers in a pot over medium-high heat. Bring to a boil.\nStir in rice, cover, and lower heat to medium. Cook until rice is tender, 15 to 20 minutes, stirring occasionally.\nHeat sesame oil in a skillet or wok over medium heat. Cook and stir garlic until fragrant, about 1 minute; pour in half the soy sauce.\nCook and stir chicken, basil, white pepper, dry mustard, and turmeric with garlic until chicken is browned, no longer pink in the center, and juices run clear, 5 to 8 minutes.\nMix remaining soy sauce into chicken mixture.\nCook and stir 1 tablespoon butter with broccoli, green pepper, red pepper, and onion in a separate skillet until tender, about 10 minutes. Stir lemon juice into vegetables.\nToss vegetables with chicken.\n",
        "picture_link": "X8laS/v/HNPtM2BL3YP4Ad7owKms0Hm"
    },
    {
        "title": "Sweet Sesame Mahi Mahi",
        "ingredients": [
            "2 cups pineapple chunks ADVERTISEMENT",
            "1/4 cup fresh cilantro, chopped ADVERTISEMENT",
            "1 tablespoon minced red onion ADVERTISEMENT",
            "2 tablespoons lime juice ADVERTISEMENT",
            "4 (8 ounce) mahi mahi fillets ADVERTISEMENT",
            "2 teaspoons sesame oil ADVERTISEMENT",
            "1/4 cup white sesame seeds ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss the pineapple, cilantro, red onion, and lime juice together in a bowl until evenly mixed; set aside.\nRub the mahi mahi fillets with the sesame oil to lightly coat.\nSprinkle the sesame seeds evenly over one side of each fillets; gently press the seeds into the fish to assure they stick.\nHeat the vegetable oil in a large non-stick skillet over medium heat.\nLay the fillets with the seeded side down into the hot oil; cook for 4 minutes, turn, and continue cooking until the flesh turns opaque and flakes easily with a fork, another 3 to 5 minutes. Serve with the pineapple mixture.\n",
        "picture_link": "8qD9YbPHiAX7PZ8AJuqjuygIO.ZwOM."
    },
    {
        "title": "Baked Ziti with Johnsonville Italian Sausage",
        "ingredients": [
            "1 (19 ounce) package Johnsonville® Fresh Italian Sweet Sausage Links, casings removed ADVERTISEMENT",
            "3 tablespoons olive oil, divided ADVERTISEMENT",
            "12 ounces ziti pasta ADVERTISEMENT",
            "1 small eggplant, cut into 1/2-inch cubes ADVERTISEMENT",
            "1 medium onion, chopped ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup red wine ADVERTISEMENT",
            "1 (28 ounce) can crushed plum tomatoes ADVERTISEMENT",
            "1/4 cup chopped fresh basil ADVERTISEMENT",
            "1/3 cup pitted kalamata olives, chopped ADVERTISEMENT",
            "2 1/2 cups shredded mozzarella cheese, divided ADVERTISEMENT",
            "salt and fresh ground pepper to taste ADVERTISEMENT",
            "1/2 cup shredded Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a 12-inch nonstick skillet, heat 1 tablespoon of oil over medium heat. Add sausage, crumble and cook until no longer pink and lightly browned. Drain and transfer into a large mixing bowl. Meanwhile prepare ziti according to package directions. Drain and rinse with cold water, cover and set aside.\nUsing the same skillet, heat 1 tablespoon of oil over medium-high heat. Add eggplant and cook until tender and lightly browned. Transfer to bowl with sausage.\nUsing the same skillet, heat remaining oil over medium heat. Add onion and garlic, sauté until tender. Pour wine into skillet, increase heat to medium-high and continue to stir until most of the liquid has evaporated. Add tomatoes and reduce heat to medium. Simmer for 10 minutes. To the bowl with the sausage mixture, add cooked pasta, basil, olives, 2 cups of mozzarella cheese, tomato sauce, salt and pepper. Stir to combine ingredients.\nTransfer mixture to a greased 3-quart baking dish. Sprinkle with remaining mozzarella and Parmesan cheese. Cover and bake at 400 degrees F for 25 to 30 minutes. Uncover and bake for 5 minutes longer, or until lightly browned. Let stand 5 minutes before serving.\n",
        "picture_link": "kgqCLFG/G.WmaX/jibkDjDxeSmxbbsa"
    },
    {
        "title": "Gorgonzola Stuffed Mini Potatoes",
        "ingredients": [
            "20 small new potatoes ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "coarse sea salt to taste ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1/4 cup crumbled Gorgonzola cheese ADVERTISEMENT",
            "2 tablespoons chopped fresh chives ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSpread potatoes in a single layer on a baking sheet; drizzle with the oil, and toss to coat. Season with salt. Place potatoes in preheated oven and bake until very tender when pierced with a fork, 45 to 50 minutes.\nWith a small knife, cut a cross in the top of each potato; press firmly on sides to open. Combine sour cream and Gorgonzola in a small bowl. Top each potato with a generous spoonful of the cheese mixture; garnish with chives. Serve hot or at room temperature.\n",
        "picture_link": "Qf8bcrT4o3CS1i.GZ9.8NsGrY2mKzha"
    },
    {
        "title": "Homemade Cream-Filled Sponge Cakes",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1 (18.25 ounce) box yellow cake mix ADVERTISEMENT",
            "1 (5.1 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "1/2 cup butter at room temperature ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3 cups confectioners' sugar ADVERTISEMENT",
            "1 (7 ounce) jar marshmallow creme ADVERTISEMENT",
            "2 cups boiling water (optional) ADVERTISEMENT",
            "1 (3 ounce) package raspberry-flavored Jell-O® mix (optional) ADVERTISEMENT",
            "2 cups flaked coconut (optional) ADVERTISEMENT",
            "2 tablespoons cornstarch, or as needed (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 325 degrees F (165 degrees C).\nCut a 12x14-inch sheet of aluminum foil. Fold it in half lengthwise, then in half again widthwise.\nWrap the foil partially around a spice jar lengthwise, bringing foil up around the jar and crushing the foil around the ends of the jar to make a boat-shaped baking form about 4 inches long, 2 1/2 inches tall, and 1 1/2 inch wide. Repeat with 15 more pieces of foil to make 16 boat-shaped baking forms. Shape the bottoms of the forms to be slightly flat so forms can stand up.\nSpray the forms with cooking spray, and place onto a baking sheet.\nMix together 1 cup water, eggs, and vegetable oil in a bowl with an electric mixer set on low speed.\nBeat in yellow cake mix on medium speed for 2 minutes.\nBeat in the vanilla pudding mix until smooth, about 3 minutes more.\nDivide the batter evenly into the prepared aluminum foil baking forms, filling each form about 1/2 full.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 11 to 15 minutes. Cool in the forms for 10 minutes before removing to cool completely on a wire rack.\nBeat together the butter, shortening, vanilla extract, and salt in a bowl with an electric mixer until smooth, about 3 minutes.\nBeat in the confectioners' sugar on low speed, gradually increasing speed to high until frosting is smooth and fluffy.\nMix in the marshmallow fluff, beating on high speed until light and airy.\nSpoon frosting into a pastry bag equipped with a round pastry tip.\nRemove the cakes from the baking forms.\nWith a sharp knife, cut a 2-inch slit lengthwise on the flat bottom side of a cake.\nPipe a generous amount of the frosting into the slit, holding the shape of the cake with your hand to prevent splitting. Repeat with the remaining cakes.\nFor the coconut-raspberry variation: Bring 2 cups water and raspberry gelatin mix to a boil in a saucepan until the gelatin dissolves, about 5 minutes.\nPour mixture into a shallow dish and refrigerate until thickened but not set, about 15 minutes.\nPlace coconut flakes in a food processor. Pulse until flakes are finely chopped.\nTransfer the coconut to a shallow dish and stir in enough cornstarch to achieve a loose texture.\nDip a filled cake in the thickened gelatin, turning to coat all sides; roll the cake in the coconut mixture. Repeat with remaining cakes.\nArrange the coconut-coated cakes on a wire rack until gelatin and coconut are set, about 2 hours.\n",
        "picture_link": "8/tlwkRtBBudz8nwFYvYsO3bpW.5l6W"
    },
    {
        "title": "Asian Kale with Noodles",
        "ingredients": [
            "1 (8 ounce) package spaghetti ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 (1 inch) piece fresh ginger root, minced ADVERTISEMENT",
            "4 cups torn kale leaves ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "4 eggs, beaten ADVERTISEMENT",
            "1 teaspoon crushed red pepper (optional) ADVERTISEMENT",
            "1 teaspoon sesame oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a rolling boil. Cook the spaghetti at a boil until tender yet firm to the bite, about 12 minutes; drain and set aside.\nHeat the vegetable oil in a large skillet over medium heat.\nCook and stir the garlic and ginger in the hot oil until fragrant, about 1 minute.\nStir the kale into the garlic and ginger mixture; continue cooking and stirring 1 minute more.\nAdd the drained spaghetti to the kale mixture; toss while cooking about 30 seconds before adding the soy sauce and water. Bring the mixture to a simmer and cook for 2 minutes.\nMake a well in the middle of the spaghetti mixture. Pour the eggs into the well; gently fold the eggs into the noodle mixture as they cook until they are evenly distributed through the noodles and cooked, about 5 minutes.\nSeason with the crushed red pepper flakes. Drizzle the sesame oil over the noodles to serve.\n",
        "picture_link": "D09gfN.JGiBjvhYdqPUES2K5Zf2hRTC"
    },
    {
        "title": "Springfield Cashew Chicken",
        "ingredients": [
            "1/2 quart vegetable oil for frying ADVERTISEMENT",
            "1/2 quart peanut oil for frying ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "3 pounds skinless, boneless chicken breast halves, cut into 1-inch cubes ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "5 tablespoons cornstarch ADVERTISEMENT",
            "6 chicken bouillon cubes ADVERTISEMENT",
            "2 tablespoons oyster sauce ADVERTISEMENT",
            "ground white pepper to taste ADVERTISEMENT",
            "1 cup cashews ADVERTISEMENT",
            "1 cup chopped green onions ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C).\nPreheat the oven to 200 degrees F (95 degrees C).\nBeat egg and 2 tablespoons water in a bowl.\nMeasure flour into a separate bowl.\nDip chicken cubes in egg mixture; remove. Roll chicken in flour until completely coated.\nCarefully place small batches of coated chicken into hot oil using a slotted spoon. Fry until chicken is golden brown and center is no longer pink, 6 to 8 minutes. Remove with a slotted spoon.\nArrange cooked chicken on a baking sheet and place in preheated oven to keep warm while continuing to fry remaining chicken.\nWhisk 3 cups water, cornstarch, chicken bouillon cubes, oyster sauce, and white pepper together in a saucepan; simmer over medium heat until thickened, about 5 minutes.\nPour sauce over cooked chicken to serve. Sprinkle cashews and green onions over each serving.\n",
        "picture_link": "0/yPCxmtikVINH.d4LLJmQNzxYg.4Qm"
    },
    {
        "title": "Potato Soup in Seven Minutes",
        "ingredients": [
            "2 (10.5 ounce) cans cream of chicken soup ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "8 cups 2% milk ADVERTISEMENT",
            "1 (32 ounce) package frozen Southern-style hash brown potatoes ADVERTISEMENT",
            "1 (14 ounce) package precooked bacon, chopped ADVERTISEMENT",
            "2 tablespoons butter-flavored granules ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together cream of chicken soup and cream cheese in a large pot.\nWhisk in milk, 2 cups at a time, until smooth.\nStir in hash brown potatoes, bacon, butter-flavored granules, salt, and pepper.\nBring soup to a boil over medium-high heat, then reduce heat to medium-low and simmer until potatoes are tender, 30 to 45 minutes.\n",
        "picture_link": "Ybr9NuUVdiQZPTYw8yrOevb609Dqo6q"
    },
    {
        "title": "Cranberry Sauce with Bourbon",
        "ingredients": [
            "12 ounces cranberries ADVERTISEMENT",
            "4 cups white sugar ADVERTISEMENT",
            "1/2 cup bourbon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nStir the cranberries, white sugar, and bourbon together in a baking dish.\nBake in the preheated oven, stirring occasionally, until thick, about 1 hour.\n",
        "picture_link": "1oxwfm2hNUUyltWXhqxnuJXDpu/sJru"
    },
    {
        "title": "Jalapeno Lime Cheesecake",
        "ingredients": [
            "2 cups graham cracker crumbs ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "3 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "3/4 cup sour cream ADVERTISEMENT",
            "3 eggs at room temperature ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup fresh lime juice ADVERTISEMENT",
            "1 jalapeno pepper, seeded and minced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nMix the graham cracker crumbs and butter in a large bowl until evenly moistened; press into the bottom of a 9-inch springform pan.\nBake in the preheated oven until the crust has lightly browned and smells toasted, about 5 minutes. Remove from the oven and allow to cool.\nBeat the cream cheese, sugar, and sour cream with an electric mixer in a large bowl until light and fluffy. Beat in the eggs, one at a time, allowing each egg to blend into the cream cheese mixture before adding the next. Beat the flour, vanilla extract, and lime juice into the cream cheese mixture with the last egg. Fold the jalapeno pepper into the mixture; mixing just enough to evenly combine. Pour into the prepared crust.\nBake in the preheated oven for 15 minutes. Reduce heat to 250 degrees F (120 degrees C) and continue baking until the center has just set, 50 to 55 minutes. Remove from the oven, run the tip of a paring knife around the edges of the pan, set the pan on a wire rack, and allow the cheesecake to cool at room temperature for 1 hour before placing into the refrigerator, and cooling 4 hours to overnight.\n",
        "picture_link": "9t41OM1hM8JCfmJXBifnf9Ss3qTM5Ta"
    },
    {
        "title": "Lorene's Slow Cooker Potato Soup",
        "ingredients": [
            "2 large onions, diced ADVERTISEMENT",
            "4 stalks celery, chopped ADVERTISEMENT",
            "4 pounds potatoes, diced ADVERTISEMENT",
            "1 tablespoon dried dill weed ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "vegetable broth to cover ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the onions, celery, potatoes, and dill weed in a slow cooker; drizzle the olive oil over the mixture. Pour the vegetable broth into the slow cooker.\nCook on High until the vegetables are tender, about 6 hours.\n",
        "picture_link": "e2sPzTvGXkJmZkIIvlAT/aanBeoAYQ."
    },
    {
        "title": "Ham 'n Swiss Biscuits",
        "ingredients": [
            "1 (6.75 ounce) can canned chunk ham, flaked ADVERTISEMENT",
            "1 teaspoon dried minced onion ADVERTISEMENT",
            "1 teaspoon poppy seeds ADVERTISEMENT",
            "2 tablespoons margarine ADVERTISEMENT",
            "1 (10 ounce) can refrigerated biscuits (10 biscuits per can), divided ADVERTISEMENT",
            "5 (1 ounce) slices Swiss cheese ADVERTISEMENT",
            "1/2 teaspoon poppy seeds for sprinkling ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nMix canned ham, dried onion, 1 teaspoon of poppy seeds, and margarine together in a bowl until thoroughly combined.\nSeparate the biscuits; press 5 biscuits onto an ungreased baking sheet so each biscuit is flattened and about 3 1/2 inches in diameter.\nSpoon about 2 tablespoons of ham mixture into the center each flattened biscuit.\nFold Swiss cheese slices to break into quarters and place 4 quarters atop the ham.\nSpoon the remaining ham mixture over the Swiss cheese pieces.\nOn a floured work surface, lightly press remaining 5 biscuits into 4-inch circles.\nLay a 4-inch biscuit circle onto of each topped biscuit and lightly stretch the top biscuit to cover the filling. Press the edges together lightly but do not seal tightly together.\nSprinkle each filled biscuit with a pinch of poppy seeds for garnish.\nBake in the preheated oven until biscuit tops are golden brown and the filling is hot, 10 to 15 minutes. Serve warm.\n",
        "picture_link": "NwjqOo65xQeScRnmF3VVTYjTCypGo7a"
    },
    {
        "title": "Sarah's Slow-Cooker Corned Beef and Cabbage",
        "ingredients": [
            "1 (4 pound) lean raw corned beef brisket ADVERTISEMENT",
            "3 tablespoons pickling spice ADVERTISEMENT",
            "2 stalks celery, cut into halves ADVERTISEMENT",
            "1 pound carrots, cut into 4-inch pieces ADVERTISEMENT",
            "1 1/4 pounds red potatoes, quartered ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "1 head Savoy cabbage, cut into 6 wedges ADVERTISEMENT",
            "1 (12 fluid ounce) can or bottle Irish stout beer ADVERTISEMENT",
            "hot water, as needed ADVERTISEMENT",
            "1/3 cup grated horseradish, drained ADVERTISEMENT",
            "1/3 cup sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the corned beef into the bottom of a large slow cooker.\nScatter the pickling spice over the brisket.\nLayer the celery, carrots, potatoes, and onion atop the brisket, respectively.\nPour the stout beer into the slow cooker. Add enough hot water to the slow cooker to cover the brisket by at least 1 inch.\nCook on High until the brisket reaches the desired consistency, 7 to 8 hours.\nRemove the brisket and vegetables from the slow cooker to a large bowl; cover with aluminum foil to keep warm.\nRemove 1 cup of the liquid in the slow cooker; pour into a small pot over medium heat. Cook the liquid until the volume is reduced by about half, about 10 minutes. Transfer the reduced liquid to a small bowl; stir the horseradish and sour cream into the liquid to make a sauce.\nSubmerge the cabbage wedges in the liquid remaining in the slow cooker; cook until the cabbage softens yet retains some crispiness, 20 to 30 minutes. Remove the cabbage to a platter. Ladle remaining liquid from the slow cooker into a bowl.\nSlice the brisket across the grain. Serve with the vegetable mixture, cabbage, horseradish sauce, and liquid from the slow cooker.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sister Schubert's® Meatball Casserole",
        "ingredients": [
            "5 Sister Schubert's Whole Wheat Dinner Yeast Rolls ADVERTISEMENT",
            "2 teaspoons olive oil ADVERTISEMENT",
            "1 green bell pepper, cut into strips ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1 teaspoon Italian herb seasoning ADVERTISEMENT",
            "24 small frozen meatballs, defrosted ADVERTISEMENT",
            "8 ounces shredded mozzarella cheese ADVERTISEMENT",
            "1 (28 ounce) jar favorite spaghetti sauce ADVERTISEMENT",
            "1 cup chicken stock ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F. Lightly mist a 9 x 13-inch baking dish with non-stick spray.\nSplit rolls in half, horizontally, and place in bottom of prepared pan.\nHeat olive oil in a saute pan; add peppers and onions and saute until tender, about 5 minutes. Add Italian herbs to vegetables and remove from heat.\nTo assemble casserole, layer meatballs and peppers and onions and half cheese over bread. Combine spaghetti sauce and chicken stock and pour over all. Top with remaining cheese and bake 30 to 35 minutes. Serve.\n",
        "picture_link": "kw12byr9se9ex./kLK5Zh2JWtXmiXdm"
    },
    {
        "title": "Butterbeer V",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "2 teaspoons honey ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 ounce butterscotch topping ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "2 teaspoons hot chocolate powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter with the honey in a small saucepan over medium heat. Stir the milk, sugar, vanilla extract, and butterscotch topping into the butter mixture; heat until just about to boil and remove from heat. Whisk the cinnamon and hot chocolate powder into the mixture; pour into a mug to serve.\n",
        "picture_link": "776Mor1rIV6sLoekjJMvUntsKldSHg2"
    },
    {
        "title": "Butter Garlic Cabbage and Kluski Noodles",
        "ingredients": [
            "1 (12 ounce) package kluski noodles ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 sweet onion, finely chopped ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1 pinch crushed red pepper flakes ADVERTISEMENT",
            "1/2 teaspoon dried Italian herb seasoning ADVERTISEMENT",
            "1 large head cabbage, cored and finely chopped ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "3 tablespoons butter (optional) ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 pinch garlic powder, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with lightly salted water and bring to a rolling boil. Stir in kluski noodles and return to a boil. Cook kluski noodles uncovered, stirring occasionally, until tender but still slightly firm, 7 to 10 minutes. Drain well. Return to pot and stir in 3 tablespoons butter until butter has melted and coated the noodles. Set noodles aside.\nMelt 2 tablespoons butter in a large pot over medium heat; cook and stir sweet onion in butter until translucent, about 5 minutes. Add garlic; cook and stir until fragrant, about 30 seconds.\nThoroughly mix in crushed red pepper flakes and Italian seasoning. Stir cabbage and water into onion mixture until well combined. Cover and cook, stirring often, until cabbage is tender and reduced in volume by about half, 15 to 20 minutes. There should be a small amount of liquid left in pot.\nGently stir the buttered kluski noodles into the cabbage mixture until well combined. For a more buttery flavor, stir in 3 more tablespoons butter if desired; season to taste with salt, black pepper, and garlic powder.\n",
        "picture_link": "TmFkP/mIxi/nZTlIRA/eI6IYwHEgQZm"
    },
    {
        "title": "Sour Cream Rhubarb Coffee Cake",
        "ingredients": [
            "2 cups sifted all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups chopped rhubarb ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nWhisk flour, baking soda, and baking powder in a bowl. Beat butter and brown sugar with an electric mixer in a separate large bowl until smooth, and stir in sour cream, egg, and vanilla extract, mixing well. Stir flour mixture into sour cream mixture just until incorporated; pour batter into prepared baking dish. Spread rhubarb over batter. Mix white sugar with cinnamon in a small bowl and sprinkle the cinnamon sugar over the rhubarb.\nBake in the preheated oven until a toothpick inserted into the center of the cake comes out clean, 35 to 45 minutes.\n",
        "picture_link": "Ae1i59wxH.sau9NlSdj3YyVjoAG8.0m"
    },
    {
        "title": "Horchata Made Easy",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "2 quarts rice milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat water, sugar, and cinnamon in a saucepan over medium heat. Simmer until sugar is dissolved, whisking occasionally, about 5 minutes. Allow mixture to cool for 10 minutes.\nPour rice milk into a large pitcher.\nStir sugar water into rice milk. Serve chilled or over ice.\n",
        "picture_link": "8.2T2Fo3OtB8KDDjTWmM237LXNxjKdm"
    },
    {
        "title": "Healthier Grandmother's Buttermilk Cornbread",
        "ingredients": [
            "6 tablespoons butter ADVERTISEMENT",
            "1 cup low-fat buttermilk ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 cup cornmeal ADVERTISEMENT",
            "1 cup white whole wheat flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup frozen corn ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (175 degrees C).\nHeat a 9-inch iron skillet in the oven for 10 minutes. Melt butter in skillet and brush over sides of skillet. Pour excess butter into a large bowl. Whisk buttermilk and eggs into excess butter.\nMix sugar, baking soda, cornmeal, whole-wheat flour, and salt in another bowl. Whisk cornmeal mixture and frozen corn into buttermilk mixture. Scrape cornbread mixture into skillet.\nBake in preheated oven until a toothpick inserted into the center of skillet comes out clean, 20 to 25 minutes.\n",
        "picture_link": "56NOSKv0Eb4.e6xFPLzdjywEhhRvLF2"
    },
    {
        "title": "Healthier Chewy Chocolate Chip Oatmeal Cookies",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/4 cup non-fat plain yogurt ADVERTISEMENT",
            "1 cup packed light brown sugar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "3 cups quick cooking oats ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup semisweet chocolate chips ADVERTISEMENT",
            "1/4 cup carrots, shredded ADVERTISEMENT",
            "1/4 cup dried cranberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nBeat butter, yogurt, brown sugar, and white sugar with an electric mixer in a large bowl until smooth. Add eggs one at a time. Beat in vanilla extract. Mix in flour and baking soda until just incorporated. Fold in quick oats, walnuts, chocolate chips, carrots, and cranberries. Roll dough into walnut-sized balls and place 2 inches apart onto ungreased baking sheets.\nBake in preheated oven until cookies are golden brown, about 12 minutes. Allow cookies to cool on baking sheet for 5 minutes before transferring to a wire rack to cool completely.\n",
        "picture_link": "D/yaOoTEB6hOC.EkGfRP7jySEO1NPUe"
    },
    {
        "title": "Tortellini Picnic Salad",
        "ingredients": [
            "2 (9 ounce) packages cheese tortellini ADVERTISEMENT",
            "1 (8 ounce) package crumbled feta cheese ADVERTISEMENT",
            "3 roma tomatoes, diced ADVERTISEMENT",
            "1 (6 ounce) can black olives ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1 bunch green onions, sliced ADVERTISEMENT",
            "5 cloves garlic, chopped ADVERTISEMENT",
            "1 cup white vinegar ADVERTISEMENT",
            "1/2 cup olive oil, or as needed ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook tortellini in the boiling water, stirring occasionally until pasta floats to the surface, about 5 minutes. Drain.\nMix tortellini, feta cheese, tomatoes, olives, walnuts, green onions, and garlic together in a large bowl.\nWhisk vinegar, olive oil, and basil together in a separate small bowl. Pour dressing over tortellini mixture; toss to coat. Sprinkle with salt. Chill in refrigerator for 1 hour before serving.\n",
        "picture_link": "cU7/v0ElHPyitc9p5iNvjaIzqQOtgMi"
    },
    {
        "title": "Margarita Chicken Quesadillas",
        "ingredients": [
            "1 cup bottled margarita mix ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "2 tablespoons lime juice ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "2 skinless, boneless chicken breast halves - cut into bite-size pieces ADVERTISEMENT",
            "8 (10 inch) flour tortillas ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 cup shredded Monterey Jack cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nStir margarita mix, lemon juice, lime juice, and garlic powder together in a large bowl.\nHeat vegetable oil in a large skillet over medium heat. Cook and stir chicken in the hot oil until no longer pink in the center and juices run clear, 5 to 7 minutes. Drain excess oil from chicken. Pour margarita mixture into the skillet with chicken; simmer until most of margarita mixture is evaporated, 15 to 20 minutes. Transfer and drain chicken to a paper towel-lined plate.\nLayer 4 tortillas with chicken, Cheddar cheese, and Monterey Jack cheese; top with remaining 4 tortillas. Place the prepared quesadillas, 1 or 2 at a time, on a large baking sheet.\nBake quesadillas in the preheated oven until cheese is melted, about 15 minutes. Repeat with remaining quesadillas; cut into quarters to serve.\n",
        "picture_link": "N3v.WTsM79DDvz.Mul32Jskp35zvHxi"
    },
    {
        "title": "Spicy Black Bean Burgers",
        "ingredients": [
            "1 egg ADVERTISEMENT",
            "1 1/2 tablespoons ground cumin ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1 teaspoon chile-garlic sauce (such as Sriracha®) ADVERTISEMENT",
            "1 (16 ounce) can black beans, rinsed and drained ADVERTISEMENT",
            "1 jalapeno pepper, minced ADVERTISEMENT",
            "1 cup canned whole kernel corn, drained ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup bread crumbs ADVERTISEMENT",
            "1/2 cup whole wheat flour ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk egg, cumin, chili powder, and chile-garlic sauce together in a bowl.\nMash black beans in a separate bowl until they reach a paste-like consistency.\nStir jalapeno pepper, corn, and garlic through the black bean paste.\nMix the egg mixture into the black bean mixture.\nScatter the bread crumbs over the black bean mixture; mix with your hands to evenly incorporate.\nForm the resulting mixture into 4 patties.\nPour flour into the bottom of a shallow dish; coat the patties in the flour to help them hold shape.\nHeat vegetable oil in a skillet over medium heat. Cook the patties in hot oil until cooked through, about 5 minutes per side.\n",
        "picture_link": "TnsagNTOn8c8LUcZe.D4ruLtjPoxsMe"
    },
    {
        "title": "Omi's Cucumber Salad",
        "ingredients": [
            "2 English cucumbers, sliced very thin ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "3 green onions, finely chopped ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "4 teaspoons vinegar ADVERTISEMENT",
            "2 teaspoons vegetable oil ADVERTISEMENT",
            "1 teaspoon dried dill weed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix cucumbers and salt in a bowl; let sit for 1 hour. Drain cucumber in a colander, squeezing as much excess liquid as you can with your hands.\nCombine cucumbers and green onions in a bowl.\nStir sour cream, vinegar, oil, and dill together in a small bowl; drizzle over cucumber mixture and toss to coat.\n",
        "picture_link": "UYciUPReSF59YcPN6Zsx7hrOM0.5HSC"
    },
    {
        "title": "Pickled Padron Peppers",
        "ingredients": [
            "1/2 teaspoon vegetable oil ADVERTISEMENT",
            "12 fresh Padron chile peppers ADVERTISEMENT",
            "3 cups white vinegar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "4 cloves garlic, peeled, halved ADVERTISEMENT",
            "1 teaspoon black peppercorns ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat vegetable oil in a large skillet over medium-high heat. Place peppers in the skillet; cook and stir until peppers are shiny and lightly blistered, 4 to 5 minutes. Remove from heat. Transfer whole hot peppers to 1 quart mason jar and press down.\nCombine white vinegar, sugar, garlic, black peppercorns, and red pepper flakes in a saucepan over medium-high heat. Bring to a boil, remove from heat. Pour mixture over peppers into mason jar, leaving about 1/2-inch head space. Screw on 2-piece top; let seal over 24 hours.\n",
        "picture_link": "X6PFyvrWuA1vE9G2Rp9wkz/ZZTFHM5O"
    },
    {
        "title": "Barbeque Sauce for Meat Sandwiches",
        "ingredients": [
            "1 cup ketchup ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 tablespoon prepared mustard ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 1/2 teaspoons chili powder ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir ketchup, brown sugar, Worcestershire sauce, honey, butter, mustard, lemon juice, chili powder, and garlic powder together in a saucepan over medium heat; simmer until hot, about 5 minutes.\n",
        "picture_link": "bP..jLSAn7RFVL8XmRqWbuQgjavWONa"
    },
    {
        "title": "Semi-Indulgent Easy Brown Rice",
        "ingredients": [
            "1 cup instant brown rice (such as Minute®) ADVERTISEMENT",
            "1/2 teaspoon dried parsley ADVERTISEMENT",
            "1/4 teaspoon ground black pepper (optional) ADVERTISEMENT",
            "1 tablespoon unsalted butter ADVERTISEMENT",
            "1/2 teaspoon lemon juice ADVERTISEMENT",
            "7 fluid ounces low-sodium chicken broth, or more if needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine instant brown rice, parsley, and black pepper in a microwave-safe dish.\nPlace butter and lemon juice in a measuring cup.\nPour chicken broth into measuring cup with butter and lemon juice to measure a total of 1 cup.\nStir chicken broth mixture into rice mixture until all ingredients are moistened. Cover with microwave-safe lid.\nHeat in the microwave oven until rice is tender and has absorbed the liquid, about 7 minutes.\nRemove and let stand for 5 minutes. Fluff with fork before serving.\n",
        "picture_link": "tYzmhvpb5YkCQDHVax5dQhowvHnJl.O"
    },
    {
        "title": "Biscuits with Blue Cheese Butter",
        "ingredients": [
            "1 (7.5 ounce) package refrigerated biscuit dough ADVERTISEMENT",
            "1/2 cup unsalted butter, melted ADVERTISEMENT",
            "2 tablespoons crumbled blue cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Grease a 9x13-inch baking dish.\nSeparate biscuits and cut into quarters; place biscuit pieces into prepared baking dish. Mix unsalted butter and blue cheese together in a bowl until thoroughly combined and brush the butter mixture over the biscuits.\nBake in the preheated oven until biscuits are golden brown, 10 to 15 minutes. Pull apart to serve.\n",
        "picture_link": "Mha.IpT8x4UB7M6AXplehKUfgaVHY6K"
    },
    {
        "title": "Refreshing Summer Cucumber Lemonade",
        "ingredients": [
            "2 cups hot water ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup lemon juice from concentrate ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "1/2 large cucumber, sliced ADVERTISEMENT",
            "3 (12 fluid ounce) cans or bottles lemon-lime flavored soda ADVERTISEMENT",
            "2 cups ice cubes, or as needed ADVERTISEMENT",
            "1 lemon, thinly sliced ADVERTISEMENT",
            "1/2 large cucumber, sliced and then halved ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir hot water and sugar together in a large pitcher until sugar is dissolved. Stir in lemon juice concentrate, lemon juice, and sliced cucumbers. Refrigerate for 30 minutes or until ready to serve.\nPour lemon-lime soda into pitcher. Serve lemonade over ice and garnished with lemon slices and halved cucumber slices.\n",
        "picture_link": "XqSIFWT2qHECHLRMrawrhm6n0GxLN.y"
    }
]