[
    {
        "title": "Beef Tenderloin Asturias",
        "ingredients": [
            "1/4 cup olive oil ADVERTISEMENT",
            "4 (6 ounce) beef tenderloin steaks ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 small onion, minced ADVERTISEMENT",
            "1 tablespoon paprika ADVERTISEMENT",
            "1/4 cup dry white wine ADVERTISEMENT",
            "1/2 cup beef broth ADVERTISEMENT",
            "4 ounces Spanish blue cheese, such as Cabrales or Valdeon ADVERTISEMENT",
            "2 tablespoons chopped parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large skillet over medium-high heat until smoking. Season steaks to taste with salt and pepper, then sear on both sides in hot oil. Reduce heat to medium and continue cooking until steaks reach desired doneness, about 6 minutes for medium-rare. Remove steaks from skillet and keep warm.\nStir in minced onion and cook until softened and translucent, about 5 minutes. Season with paprika and cook for an additional minute. Increase heat to medium-high, then pour in wine. Simmer until the wine has reduced by half, then add the beef broth, return to a simmer, and cook for 2 minutes. Stir in the crumbled blue cheese until just melted.\nTo serve, pour the sauce over the steaks and sprinkle with chopped parsley.\n",
        "picture_link": "zzABH/YnTaA7y17cgdbd49udbZtI45i"
    },
    {
        "title": "Authentic Lebanese Fattoush",
        "ingredients": [
            "1/2 cup water ADVERTISEMENT",
            "1 teaspoon cornstarch ADVERTISEMENT",
            "1/3 cup lemon juice ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 teaspoons sumac powder ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 head romaine lettuce, torn into bite-size pieces ADVERTISEMENT",
            "1 medium cucumber, diced ADVERTISEMENT",
            "2 large tomatoes, diced ADVERTISEMENT",
            "4 green onions, chopped ADVERTISEMENT",
            "1/4 cup chopped fresh flat-leaf parsley ADVERTISEMENT",
            "1/4 cup chopped fresh mint ADVERTISEMENT",
            "1 green bell pepper, seeded and chopped ADVERTISEMENT",
            "1 cup chopped purslane ADVERTISEMENT",
            "1/2 (5 ounce) package arugula ADVERTISEMENT",
            "4 pita rounds, toasted and torn into pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the water and cornstarch in a small saucepan over medium-high heat until thickened. Remove from heat, and mix in lemon juice, garlic, sumac, salt, and pepper. Refrigerate until ready to use.\nIn a large bowl, toss together the lettuce, cucumber, tomatoes, green onions, parsley, mint, bell pepper, purslane, and arugula. Toss with the dressing, and serve with pita.\n",
        "picture_link": "55ZtLAbmBia2/LaiivqlhqJt3cqgXQW"
    },
    {
        "title": "Toum",
        "ingredients": [
            "4 cloves garlic, peeled ADVERTISEMENT",
            "1/4 cup vegetable oil, or as needed ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Crush garlic in a mortar and pestle with a generous pinch of salt. Mix in oil a teaspoon at a time until the mixture will absorb no more oil. Stir in the lemon juice. serve at room temperature with Lebanese breads, hummus or Tabbouleh.\n",
        "picture_link": "LuRhUETQNfsiiIa7Ydbkjj/UZKatgSO"
    },
    {
        "title": "Zucchini Miso",
        "ingredients": [
            "1 1/2 tablespoons sesame seeds ADVERTISEMENT",
            "1/4 cup chicken broth ADVERTISEMENT",
            "3 tablespoons miso paste ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "1 tablespoon rice vinegar ADVERTISEMENT",
            "1 tablespoon lime juice ADVERTISEMENT",
            "1/2 teaspoon Thai chile sauce ADVERTISEMENT",
            "2 teaspoons brown sugar ADVERTISEMENT",
            "1/2 cup chopped green onions ADVERTISEMENT",
            "1/4 cup chopped cilantro ADVERTISEMENT",
            "6 medium zucchini, julienned ADVERTISEMENT",
            "2 sheets nori, cut into thin slices ADVERTISEMENT",
            "2 tablespoons slivered almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place sesame seeds in a skillet over medium heat. Cook 5 minutes, stirring frequently, until lightly toasted.\nIn a large bowl, mix the chicken broth, miso paste, soy sauce, rice vinegar, lime juice, chile sauce, brown sugar, green onions, and cilantro. Toss zucchini in the dressing to coat just before serving, and top with toasted sesame seeds, nori, and almonds.\n",
        "picture_link": "8m3gweU8VrFYZaKVl93B0DXykEH62/2"
    },
    {
        "title": "Rachel's Snappy Balsamic Dressing",
        "ingredients": [
            "1/2 cup balsamic vinegar ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "2 cloves garlic, pressed ADVERTISEMENT",
            "2 teaspoons crushed fennel seed ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a jar with a tight fitting lid, or cruet with a stopper, combine the balsamic vinegar, olive oil, garlic, fennel seed, salt and pepper. Seal, and shake vigorously to mix. Shake again just before serving.\n",
        "picture_link": "cWYsEEruhD5wUg/PwX91R0TZF9uwyva"
    },
    {
        "title": "Campfire Foil Onion",
        "ingredients": [
            "1 large onion, peeled ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "seasoned salt to taste ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "pepper to taste ADVERTISEMENT",
            "garlic pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Set peeled onion upright on a sheet of foil. Make several deep slices in the onion without cutting completely through the onion.\nPour butter over the onion. Sprinkle with seasoned salt, salt, pepper, and garlic pepper. Place the onion on a grill directly above a hot campfire, and cook until the onion is soft, about 20 minutes.\n",
        "picture_link": "GzLLM4HrYLzqE7AdKy3RvKHZX2G75Xm"
    },
    {
        "title": "Scrambled Eggs and Tomatoes",
        "ingredients": [
            "2 large eggs, beaten ADVERTISEMENT",
            "2 tomatoes, coarsely chopped ADVERTISEMENT",
            "1 1/2 teaspoons sugar ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 dash soy sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a skillet over medium heat, scramble eggs until almost done. Remove to a plate.\nReturn skillet to medium heat, and stir in tomatoes. Cook 2 to 3 minutes. Stir in sugar, salt, and soy. Return eggs to skillet; cook, stirring, about 1 minute more.\n",
        "picture_link": "NIgpWsXOlRBsom9tUjR6FIIPn46yHO2"
    },
    {
        "title": "Bird Seed Squares",
        "ingredients": [
            "3/4 cup peanut butter ADVERTISEMENT",
            "3/4 cup brown sugar ADVERTISEMENT",
            "3/4 cup honey ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup unsweetened cocoa powder ADVERTISEMENT",
            "2 cups crisp rice cereal ADVERTISEMENT",
            "1 1/2 cups rolled oats ADVERTISEMENT",
            "1 cup coconut ADVERTISEMENT",
            "3/4 cup sesame seeds ADVERTISEMENT",
            "3/4 cup sunflower seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine the cocoa powder, rice cereal, oats, coconut, and sesame seeds. Set aside.\nIn a saucepan over medium heat, stir together the peanut butter, brown sugar, honey, and vanilla. Cook and stir until melted and loose. Pour over the cereal mixture, and stir to coat evenly. Press lightly into a buttered 9x13 inch baking dish. Cool for about 1 hour to firm, then cut into squares.\n",
        "picture_link": "6xsdXJXTV6ISw0ixLvGwgf7qjmyqO56"
    },
    {
        "title": "Tanya's Boneless Short Ribs",
        "ingredients": [
            "4 pounds boneless beef short ribs, trimmed and cut into 2-inch pieces ADVERTISEMENT",
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "1 cup tomato juice ADVERTISEMENT",
            "1 small onion, finely chopped ADVERTISEMENT",
            "3 tablespoons cider vinegar ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon hot sauce ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1 pinch ground cloves ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven broiler.\nPlace ribs on a rack in a broiler pan, and broil on top oven rack 15 minutes, or until well browned. Remove from heat, and transfer to a baking dish. Reduce oven temperature to 350 degrees F (175 degrees C).\nIn a saucepan over medium heat, mix the tomato sauce, tomato juice, onion, vinegar, Worcestershire sauce, and hot sauce. Season with cinnamon, cloves, and pepper. Bring to a boil. Pour over the ribs in the baking dish.\nBake ribs in the 350 degrees F (175 degrees C) oven 45 minutes, or until meat pulls apart easily with a fork and reaches a minimum internal temperature of 160 degrees F (70 degrees C).\n",
        "picture_link": "BNc8m3YUItSxjA8fozMDyx1Tl4lA5GW"
    },
    {
        "title": "Roasted Garlic Teriyaki Fried Rice with Chicken",
        "ingredients": [
            "1/2 pound boneless skinless chicken breasts ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "3 green onions and tops, chopped ADVERTISEMENT",
            "1 carrot, julienned ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "4 cups cold cooked rice ADVERTISEMENT",
            "3 tablespoons Kikkoman Roasted Garlic Teriyaki Marinade & Sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut chicken into thin strips.\nHeat oil in hot wok or large skillet over high heat. Add chicken, green onions and carrot. Stir-fry 3 minutes, or until chicken is thoroughly cooked.\nAdd egg; cook, stirring gently, until firm. Stir in rice and cook until heated through.\nAdd roasted garlic teriyaki sauce; remove pan from heat. Stir mixture until well mixed. Serve immediately.\n",
        "picture_link": "/KIlobzO9jyVDC/WLIFTZaVWVPqNX1."
    },
    {
        "title": "Melitzanes Imam",
        "ingredients": [
            "1 eggplant ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes, drained ADVERTISEMENT",
            "1 tablespoon tomato paste ADVERTISEMENT",
            "1 medium onion, chopped ADVERTISEMENT",
            "1 tablespoon minced garlic, or to taste ADVERTISEMENT",
            "1 teaspoon ground cinnamon, or to taste ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nSlice the eggplant in half lengthwise, and hollow out the halves leaving about a 1 centimeter shell. Set the flesh from the insides aside for later use. Place the shells on a baking tray, and drizzle with a little olive oil.\nBake for about 30 minutes in the preheated oven, until soft.\nWhile those are baking, chop the leftover eggplant into small pieces. Heat about 2 tablespoons of olive oil in a large skillet over medium heat. Add the onion and garlic; cook and stir for a few minutes. Add the chopped eggplant; cook and stir until tender. Mix in the tomatoes and tomato paste until well blended. Simmer over low heat until the halves in the oven are ready.\nRemove the baked eggplant shells from the oven, and spoon in the tomato and eggplant mixture. Sprinkle a little cinnamon over the top of each one, and return them to the oven. Bake for another 30 minutes or so.\n",
        "picture_link": "XfarTyKiSwCtMKL0t6SSyn0j8DT1Fw6"
    },
    {
        "title": "Tropical Coconut Black Bean Soup",
        "ingredients": [
            "1 (15.5 ounce) can Mexican-seasoned black beans ADVERTISEMENT",
            "1 (14 ounce) can light coconut milk ADVERTISEMENT",
            "1 (6 ounce) package frozen green peas ADVERTISEMENT",
            "2 cups chicken stock or water ADVERTISEMENT",
            "1 tablespoon fresh lime juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a stock pot or large saucepan, combine the black beans, coconut milk, peas and stock or water. Bring to a boil, then simmer over low heat for 10 minutes. Pour into a blender and puree until smooth. Return to the pan and stir in the lime juice.\n",
        "picture_link": "ApN.cA4E13L73Pgg.PKt6ReDScGGeA6"
    },
    {
        "title": "Runza Burgers",
        "ingredients": [
            "1 1/2 pounds lean ground beef ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 small head cabbage, shredded ADVERTISEMENT",
            "1 (14 ounce) can beef broth ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "2 tablespoons yellow mustard ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "10 hamburger buns, split ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Brown ground beef in a large skillet over high heat. Drain fat. Stir in garlic, onion, and cabbage; cook until vegetables are wilted and soft. Stir in the beef broth, Worcestershire sauce, and mustard. Cook over medium heat, uncovered, until reduced to a sloppy joe consistency. Season with salt and pepper.\nPlace hamburger buns on top of meat mixture; cover skillet to steam, about 1 minute. To serve, fill steamed buns with beef and cabbage mixture.\n",
        "picture_link": "CtHBhz6Jg1BZnGymo4Rn9bAQ9ZJJVJa"
    },
    {
        "title": "Preety's Chickpea Salad",
        "ingredients": [
            "1 clove garlic, minced ADVERTISEMENT",
            "2 teaspoons olive oil ADVERTISEMENT",
            "1 (16 ounce) can garbanzo beans (chickpeas), drained and rinsed ADVERTISEMENT",
            "1 tomato, chopped ADVERTISEMENT",
            "1/3 onion, chopped ADVERTISEMENT",
            "1 teaspoon cider vinegar (optional) ADVERTISEMENT",
            "1/2 teaspoon salt, or to taste ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "1/2 lemon, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the garlic and olive oil in a small microwave-safe bowl. Cook 15 seconds in the microwave on High, or just until warm.\nIn a large bowl, toss together the garlic and olive oil, garbanzo beans, tomato, onion, and vinegar. Season with salt and pepper, and garnish with lemon slices. Cover and chill until serving.\n",
        "picture_link": "ftB4WueviVKeHfdwsxCPXY1L7155nPO"
    },
    {
        "title": "Stuffed Fish in Puff Pastry",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "1 cup finely chopped onion ADVERTISEMENT",
            "1 cup minced celery ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "8 ounces crabmeat ADVERTISEMENT",
            "8 ounces shrimp, peeled, deveined and minced ADVERTISEMENT",
            "1/4 cup dry vermouth ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1/4 teaspoon hot pepper sauce ADVERTISEMENT",
            "1/2 cup bread crumbs ADVERTISEMENT",
            "1 (17.5 ounce) package frozen puff pastry sheets, thawed ADVERTISEMENT",
            "2 pounds flounder fillets ADVERTISEMENT",
            "2 egg yolks, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To make the stuffing: Melt butter or margarine in a large saucepan over a medium-low heat. Saute onion, celery, and parsley until all of the vegetables are just tender. Mix in crabmeat, shrimp, and vermouth. Season with salt, pepper and hot pepper sauce; cook until shrimp is finished cooking (it will be pink). Mix in bread crumbs, a little at a time. When the mixture holds together well, stop adding bread crumbs. Taste and add more seasoning (salt, pepper, and hot pepper sauce) if necessary. Set this mixture aside to let it cool.\nSpray a baking sheet with non-stick cooking spray.\nRoll 1 sheet of puff pastry onto a flat surface. The puff pastry, once rolled should be about 1/3 to 1/4 inch thick and large enough for you to lay the fish on top of it and still have puff pastry on the sides. Lay one of the fish fillets on top of the puff pastry. Spread the stuffing mixture evenly over the fish fillet. Place the remaining fillet over the stuffing. Trim the pastry around the filets in roughly the shape of a fish. Save the trimmings.\nRoll second sheet of puff pastry out to about 1/3 to 1/4 inch thick. Drape second sheet over stuffed fillets, making sure that there is enough of the top sheet to tuck under the bottom sheet of puff pastry. Trim the top sheet of pastry about 1/2 inch larger than the bottom sheet. Brush underside of top pastry sheet with water and tuck under bottom sheet of puff pastry pressing lightly to totally encase the fish and stuffing package. Place the sealed packet on the prepared baking sheet, and let it cool for 10 to 15 minutes.\nWhile packet is chilling, roll out pastry scraps. From the scraps cut out fins, an eye and 'lips'. Attach cut-outs to chilled package with a little water. Use an inverted teaspoon to make indentations in puff pastry to resemble fish scales but do not puncture pastry. Chill entire package.\nWhile the package is chilling, preheat the oven to 425 degrees F (220 degrees C).\nRemove the fish from the refrigerator and brush the package with the egg yolks. Measure the thickness of the package at its thickest part. Bake for 15 minutes, then reduce the temperature to 350 degrees F (175 degrees C) and bake the fish for 10 extra minutes per inch of measured thickness. Test for doneness by inserting a thermometer into the package, when the temperature reaches 140 degrees F (70 degrees C) the fish is finished cooking.\n",
        "picture_link": "r1GSP8R6kzYTB6aRGMWfJK9LRnUziwe"
    },
    {
        "title": "Banana Blast I",
        "ingredients": [
            "1 banana ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "2 cups crushed ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender combine banana, nutmeg, vanilla, milk and crushed ice. Blend until smooth. Pour into glasses and serve.\n",
        "picture_link": "ha02skugxRmj9FeytK0tBTFAhWCNkPm"
    },
    {
        "title": "Rich White Bread",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 (.25 ounce) package rapid rise yeast ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "3/4 cup warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Insert metal blade in food processor bowl. Add flour, sugar, yeast, and salt; process 10 seconds to combine. Place butter and egg in food processor. Begin processing, then slowly pour warm water through feed tube just until dough forms a ball, about 10 to 15 seconds. Continue processing for 60 seconds to knead dough. Carefully remove dough from processor bowl and place on a lightly floured surface. Cover and let rest for 10 minutes.\nForm dough into a loaf and place in a lightly greased 8x4 inch loaf pan. Cover and let rise until doubled, about 45 minutes. Meanwhile, preheat oven to 375 degrees F (190 degrees C).\nBake in the preheated oven for about 30 minutes or until the top is golden brown and the bottom of the loaf sounds hollow when tapped.\n",
        "picture_link": "t.ryl6HkZmg5GkY1ZlHEVudLK41eGuW"
    },
    {
        "title": "Snickerdoodle Cake II",
        "ingredients": [
            "1/4 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "2 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 cup shortening ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour an 8 inch square pan. Make topping by mixing 1/4 cup sugar and 1/2 teaspoon cinnamon with 1 tablespoon butter. Set aside.\nIn a large bowl mix flour, baking powder and 1/2 cup sugar. Cut in shortening to a fine grain. In a separate small bowl beat egg, then pour in milk and mix together. Beat into dry mixture with minimum of strokes.\nSpread batter into prepared pan and sprinkle with topping. Bake in the preheated oven for 20 to 25 minutes, or until a toothpick inserted into the center of the cake comes out clean. Serve warm.\n",
        "picture_link": "SGnLXVPESFIDeb/vVfZs3jtJihS/PxW"
    },
    {
        "title": "Mr. Kirk's Won Tons",
        "ingredients": [
            "1/2 pound ground pork, finely chopped ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1/2 (8 ounce) can water chestnuts, drained and finely chopped ADVERTISEMENT",
            "1/4 cup bamboo shoots, drained and finely chopped ADVERTISEMENT",
            "1/4 cup green onions, finely chopped ADVERTISEMENT",
            "1/2 cup bean sprouts, finely chopped ADVERTISEMENT",
            "1/2 egg, beaten ADVERTISEMENT",
            "2 leaves bok choy, finely chopped ADVERTISEMENT",
            "1 tablespoon cooking sherry ADVERTISEMENT",
            "1 (14 ounce) package wonton wrappers ADVERTISEMENT",
            "2 quarts oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix the pork, salt, soy sauce, water chestnuts, bamboo shoots, green onions, bean sprouts, egg, bok choy and sherry.\nPlace 1 teaspoon of the pork mixture in the center of each wonton wrapper. Fold the wrappers to the center forming a triangle. Gently press together the edges with moistened fingers. Fold in half again lengthwise, then fold back and bring together the corners. Press two corners together.\nIn a heavy skillet or wok, heat oil over high heat. Deep fry each wonton 2 minutes. Remove and drain on paper towels.\n",
        "picture_link": "mW4i2yljfrNtSVwL.E4Ey5lzTQtygga"
    },
    {
        "title": "Ribbon Meatloaf",
        "ingredients": [
            "3 slices soft bread, torn into small pieces ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "1 pound ground lean pork ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "1/4 cup minced onion ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon ground dry mustard ADVERTISEMENT",
            "1/4 teaspoon dried sage ADVERTISEMENT",
            "1/4 teaspoon celery salt ADVERTISEMENT",
            "1/4 teaspoon garlic salt ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 egg white, beaten ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "2 slices soft bread, torn into small pieces ADVERTISEMENT",
            "5 ounces shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x5 inch loaf pan.\nIn a large bowl, stir together the bread and milk. Add the beef, pork, egg yolk, onion, salt, ground black pepper, dry mustard, sage, celery salt, garlic salt and Worcestershire sauce. Mix well and set aside.\nTo make filling, in a medium bowl combine the egg white and water. Toss lightly with the bread pieces and Cheddar cheese.\nPat 1/2 of the meat mixture into the prepared loaf pan. Cover with the cheese filling and top with the remaining meat mixture.\nBake in the preheated oven for 1 1/2 hours.\n",
        "picture_link": "B7PC2tMtgQHaDjUTxYNQ.GM1/4.Jpi6"
    },
    {
        "title": "Orange Cream Milkshake",
        "ingredients": [
            "1/2 cup milk ADVERTISEMENT",
            "4 scoops vanilla ice cream ADVERTISEMENT",
            "3 tablespoons frozen orange juice concentrate, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender combine milk, ice cream and orange juice concentrate. Blend until smooth. Pour into glasses, garnish with an orange slice and serve.\n",
        "picture_link": "6qVzcfX7ig7kD1y/kQ/HYhKw1o.7wQq"
    },
    {
        "title": "Cranberry Sauce with Jalapeno Peppers",
        "ingredients": [
            "12 ounces fresh or frozen cranberries ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 fresh jalapeno peppers, seeded and minced ADVERTISEMENT",
            "3 teaspoons lemon juice ADVERTISEMENT",
            "1/2 cup sherry ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse berries in cold water; drain.\nIn a saucepan, stir together water and sugar until the sugar has dissolved and come to a boil. Stir in the cranberries, jalapeno peppers and lemon juice; return the mixture to a boil. Reduce heat and simmer gently for 10 minutes; stirring occasionally.\nStir lemon juice and sherry into the mixture until blended. Remove the pan from heat and allow the mixture to cool completely at room temperature. Refrigerate the cooled mixture in a glass container with lid until you are ready to serve.\n",
        "picture_link": "QvJArc7Q9fqDNseqcdS8GDnDpHlMoSi"
    },
    {
        "title": "Apple and Sunflower Seed Salad",
        "ingredients": [
            "2 green apples - washed, cored and cubed ADVERTISEMENT",
            "1/2 cup sunflower seeds ADVERTISEMENT",
            "1 head romaine lettuce - rinsed, dried, and chopped ADVERTISEMENT",
            "2 dill pickles, diced ADVERTISEMENT",
            "2 tomatoes, diced ADVERTISEMENT",
            "1/2 cup ranch-style salad dressing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix together the apples, sunflower seeds, lettuce, pickles and tomato. Pour dressing on top, toss and enjoy!\n",
        "picture_link": "wwVlV.pGgyhcO661dHECes2FZ2j15EO"
    },
    {
        "title": "Loosemeat Sandwiches II",
        "ingredients": [
            "1 pound lean ground beef ADVERTISEMENT",
            "1 (10.75 ounce) can condensed chicken gumbo soup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In large skillet over medium heat, cook ground beef until brown, 5 to 10 minutes. Drain. Return meat to skillet, with soup. Simmer until heated through, 5 minutes. Serve hot.\n",
        "picture_link": "H4Kg/kLMDLCegrzoS79SragWEQaExBW"
    },
    {
        "title": "Grandma Grippin's Brown Pudding",
        "ingredients": [
            "2 cups brown sugar ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "4 tablespoons margarine ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup margarine ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). In a large saucepan stir together brown sugar, water and 4 tablespoons margarine; bring to a boil over medium heat.\nMeanwhile, cream together white sugar and 1/2 cup margarine in a large bowl, using an electric mixer. In a separate bowl combine flour, baking powder and cinnamon. Blend flour mixture into butter mixture alternately with milk until smooth.\nPour boiling brown sugar mixture into 9x13 inch baking dish and drop flour mixture by spoonfuls into the liquid mixture.\nBake 20 to 25 minutes, or until set.\n",
        "picture_link": "VDTTqW9yUQC8QnsMwBt8fuZpxdMTnp."
    },
    {
        "title": "Garlic Vegetable Soup",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 carrots, chopped ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "1/4 medium head cabbage, shredded ADVERTISEMENT",
            "6 cups chicken broth ADVERTISEMENT",
            "2 (14.5 ounce) cans peeled and diced tomatoes ADVERTISEMENT",
            "3 1/2 cups water ADVERTISEMENT",
            "1 cup elbow macaroni ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a large pot over medium heat. Saute the carrots, celery and cabbage in the oil for about 8 minutes, stirring well.\nRaise heat to high and pour in the broth, tomatoes and water. Bring to a boil, reduce heat to low, cover and simmer for 1 hour.\nRemove lid, stir in macaroni and heat for 5 minutes, or until macaroni is tender. Remove from heat and stir in the garlic and ground black pepper.\n",
        "picture_link": "jI/wgOLYJYe0R9ShobbyNcvCX0anZL6"
    },
    {
        "title": "Green Bean Bundles I",
        "ingredients": [
            "1 pound bacon ADVERTISEMENT",
            "3 (15 ounce) cans whole green beans, drained ADVERTISEMENT",
            "1 (16 ounce) bottle French dressing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nSlice bacon in half (easiest to slice whole package at once right down the middle). Bundle 6 to 7 green beans together and wrap one slice of bacon around the middle of the bundle. Secure with a toothpick. Arrange bundles in one layer in a baking dish. Pour French dressing over all of the bundles - make sure to drizzle some on each bundle.\nBake in a preheated 375 degrees F (190 degrees C) oven for 30 minutes or until the bacon is done.\n",
        "picture_link": "Rx8mWIIijUW.IwVohwd6CT0qiWwZnsW"
    },
    {
        "title": "Peanut Butter Eggs II",
        "ingredients": [
            "2 cups creamy peanut butter ADVERTISEMENT",
            "3/4 cup butter ADVERTISEMENT",
            "3 1/2 cups confectioners' sugar ADVERTISEMENT",
            "3 cups crispy rice cereal ADVERTISEMENT",
            "1 (12 ounce) package semisweet chocolate chips ADVERTISEMENT",
            "2 tablespoons shortening ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a mixing bowl, combine peanut butter and butter. Stir in confectioners' sugar and crisp rice cereal until a dough is formed. Place this mixture in the refrigerator for about an hour to allow it to cool until it is easier to work with. Shape mixture into egg shapes and freeze for 20 minutes.\nMelt chocolate chips and shortening in a double boiler over low heat. When melted, dip egg shapes in chocolate. Place on waxed paper and allow to cool.\n",
        "picture_link": "kRieT2HTmGADc1xKWvbevdSlgvwYTwm"
    },
    {
        "title": "Apple Nut Muffins",
        "ingredients": [
            "3/4 cup butter ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "3 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1 1/2 teaspoons baking soda ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups sour cream ADVERTISEMENT",
            "1 (21 ounce) can apple pie filling ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease or line 24 muffin cups.\nIn a large bowl, cream together butter and 1 1/2 cup sugar. Beat in eggs and vanilla. Combine flour, baking powder, baking soda and salt. Stir into the creamed mixture alternately with sour cream. Fold in apple pie filling and walnuts. Spoon batter into prepared muffin cups. Combine 1/4 cup sugar and cinnamon; sprinkle over the muffins.\nBake in preheated oven for 16 to 18 minutes, until a toothpick inserted into the center of a muffin comes out clean.\n",
        "picture_link": "Nm.EQlyLmJjAmiHnT8w/emuHsTVMXN."
    },
    {
        "title": "Messy Taco Salad",
        "ingredients": [
            "1 pound lean ground beef ADVERTISEMENT",
            "1 pound shredded Cheddar cheese ADVERTISEMENT",
            "1 (15 ounce) can ranch-style beans ADVERTISEMENT",
            "1 head iceberg lettuce, shredded ADVERTISEMENT",
            "1 1/4 ounces taco seasoning mix ADVERTISEMENT",
            "16 ounces thousand island dressing ADVERTISEMENT",
            "14 1/2 ounces tortilla chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, toss the lettuce and cheese.\nIn a separate bowl, mix together the dressing, taco seasoning, and beans.\nBrown ground beef in a large skillet over medium-high heat, and drain. Add the ground beef and the dressing mixture to the lettuce and cheese, and mix well. Refrigerate until just before serving, then crush the tortilla chips while still in the bag and combine them with the salad.\n",
        "picture_link": "pTwxkzuPndT3tzQ0MC9wWiYVCJUDOBq"
    },
    {
        "title": "Crab Puffs",
        "ingredients": [
            "1 quart oil for deep frying ADVERTISEMENT",
            "1 pound cooked crabmeat ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "2 teaspoons garlic salt ADVERTISEMENT",
            "2 (16 ounce) packages small won ton wrappers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in large, heavy saucepan to 375 degrees F (190 degrees C).\nIn a medium bowl, mix together cooked crabmeat, cream cheese and garlic salt.\nRoll a small amount of the crabmeat mixture inside each won ton wrapper and seal.\nIn small batches, carefully place won tons into the hot oil. Fry 2 to 3 minutes, until golden brown. Drain on paper towels.\n",
        "picture_link": "NIcwcV0/QQJ2O/HZV6jLKKetMpM6Koe"
    },
    {
        "title": "Rhubarb Cheesecake Pie",
        "ingredients": [
            "1/4 cup cornstarch ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "3 cups chopped rhubarb ADVERTISEMENT",
            "1 (9 inch) prebaked deep dish pie shell ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C.)\nIn a saucepan, combine cornstarch, 1 cup sugar, salt, water and rhubarb. Cook, stirring occasionally, until thickened. Pour into pie shell.\nBake in the preheated oven for 10 minutes. Remove from oven and reduce temperature to 325 degrees F (165 degrees C.)\nIn a medium bowl, beat cream cheese, eggs and 1/2 cup sugar until smooth. Pour over rhubarb in the pan.\nBake in the preheated oven for 35 minutes, or until filling is set.\n",
        "picture_link": "IGFStfIRPW.kKN8MBkRLjJZXcIxO8vO"
    },
    {
        "title": "Leftover Special Casserole",
        "ingredients": [
            "4 cups uncooked egg noodles ADVERTISEMENT",
            "1 (10 ounce) package frozen mixed peas and carrots, thawed ADVERTISEMENT",
            "1 small onion, minced ADVERTISEMENT",
            "2 cups cooked ham, diced ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking dish. Bring a large pot of water to a boil. Add egg noodles, and cook for 8 to 10 minutes, or until done; drain.\nLayer noodles, mixed peas and carrots, onions, and ham in prepared baking dish. Mix together soup and milk, then pour mixture over casserole. Season with salt and pepper, then press with the back of a fork to help soup mixture seep through casserole layers.\nBake at 350 degrees F (175 degrees C) for 30 minutes, or until bubbly and hot.\n",
        "picture_link": "xmboQxSf6aKK81KJDjfs0x9cSUy1UT."
    },
    {
        "title": "Millet Delight",
        "ingredients": [
            "1 cup uncooked millet ADVERTISEMENT",
            "1/2 cup soy milk powder ADVERTISEMENT",
            "5 1/2 cups hot water ADVERTISEMENT",
            "2/3 cup chopped dates ADVERTISEMENT",
            "1/2 cup flaked coconut ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine millet, soy milk powder, hot water, chopped dates, coconut, and vanilla in a 9x13 inch casserole dish.\nBake casserole in preheated oven for 30 minutes, then remove and stir. Return casserole to oven and bake an additional 30 minutes. Serve hot.\n",
        "picture_link": "y4iGdLDnHOERqv5U3hNK1F4.odjLq.C"
    },
    {
        "title": "Zucchini and Blue Cheese Side",
        "ingredients": [
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "2 zucchini, halved lengthwise and sliced ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 (14.5 ounce) can fire roasted chopped tomatoes (such as Hunts®) ADVERTISEMENT",
            "1/4 cup crumbled blue cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large skillet over medium-high heat. Place the zucchini and garlic in the skillet, cover. Cook until zucchini is just tender, about 5 minutes. Stir in tomatoes; heat until warmed through. Remove from heat; sprinkle immediately with blue cheese. Cover, and allow cheese to soften before serving.\n",
        "picture_link": "OypLn/puUsRx0s7/T1C1Gq/1gLpbTO2"
    },
    {
        "title": "Eel Sauce",
        "ingredients": [
            "1/2 cup soy sauce ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup mirin (Japanese sweet wine) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat soy sauce, sugar, and mirin into a small saucepan over medium heat. Cook and stir until liquid is reduced to about 3/4 cup.\n",
        "picture_link": ".RB8lsmQtBRaoYcCYmhUpgNZrIaXBpS"
    },
    {
        "title": "Spiced Cranberry Apple Chutney",
        "ingredients": [
            "2 cups fresh cranberries ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "3 tablespoons water, or more as needed ADVERTISEMENT",
            "1 large Granny Smith apple - peeled, cored and chopped ADVERTISEMENT",
            "2 stalks celery, finely chopped ADVERTISEMENT",
            "1 tablespoon grated orange zest ADVERTISEMENT",
            "1 cup fresh orange juice ADVERTISEMENT",
            "1/4 cup pecans (optional) ADVERTISEMENT",
            "1 cup golden raisins ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1 pinch salt, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the cranberries, sugar, and water in a large saucepan, and bring to a boil. Reduce heat to medium, and cook until all the cranberries have popped, 8 to 10 minutes. Stir in the apple, celery, orange zest, orange juice, pecans, raisins, ginger, cloves, and salt, and cook over medium heat, stirring frequently, until the celery is tender and the sauce is reduced, about 35 minutes. Turn off the heat, cover the saucepan, and let the chutney stand to thicken, about 15 minutes. Serve warm.\n",
        "picture_link": "gA1OAUpkU0rRupAe4AJbAu4bLlUKR0C"
    },
    {
        "title": "Dar's Super Savory Sauerkraut Potato Bake",
        "ingredients": [
            "1/3 cup all-purpose flour ADVERTISEMENT",
            "2 teaspoons chicken bouillon granules ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/4 cup sour cream ADVERTISEMENT",
            "1 small onion, finely chopped ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 cup drained sauerkraut ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon caraway seeds (optional) ADVERTISEMENT",
            "3 tablespoons unsalted butter, melted ADVERTISEMENT",
            "1 (16 ounce) package frozen shredded hash brown potatoes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nWhisk the flour, bouillon granules, water, and milk together in a medium saucepan; bring to a boil until thick, 1 to 2 minutes, whisking continuously. Remove from heat and stir the sour cream into the flour mixture; set aside to cool.\nCombine the onion, Cheddar cheese, sauerkraut, salt, pepper, and caraway seeds in a large mixing bowl. Stir the sour cream sauce and the melted butter into the sauerkraut mixture; fold the hash brown potatoes into the mixture. Pour into the prepared baking dish. Use a spatula to flatten into an even layer.\nBake in the preheated oven until the potatoes are tender and the top is brown and bubbly, 60 to 70 minutes.\n",
        "picture_link": "5MyJlxVnRuNNi3vsRiui6fcSf8n38W."
    },
    {
        "title": "Bacon Deviled Eggs",
        "ingredients": [
            "12 eggs ADVERTISEMENT",
            "6 slices bacon ADVERTISEMENT",
            "1/4 cup ranch dressing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the eggs into a saucepan in a single layer and fill with water to cover the eggs by 1 inch. Cover the saucepan and bring the water to a boil over high heat. Remove from the heat and let the eggs stand in the hot water for 15 minutes. Drain. Cool the eggs under cold running water. Peel once cold. Halve the eggs lengthwise and scoop the yolks into a bowl. Mash the yolks with a fork.\nCook the bacon in a large, deep skillet over medium-high heat until evenly browned, about 10 minutes. Drain on a paper towel-lined plate; chop once cool. Add to the egg yolks with the ranch dressing. Spoon the mixture into the egg white halves. Arrange on a tray and refrigerate at least 30 minutes before serving.\n",
        "picture_link": "y0J0x4M6i.PHW0DJg2i5onZIvCqudfW"
    },
    {
        "title": "Pepperoni Crisps",
        "ingredients": [
            "1 ounce sliced pepperoni ADVERTISEMENT",
            "1 teaspoon Cajun seasoning (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nArrange pepperoni in a single layer on an ungreased baking sheet; sprinkle with Cajun seasoning.\nBake in preheated oven for 10 minutes. Remove sheet from oven and pat away grease with paper towels. Return to oven and bake until crisp, 2 to 4 additional minutes. Drain on paper towels. Store cooled chips in an airtight container.\n",
        "picture_link": "6RMP3G.9vsoFgevfK6R7EZytzE9QLz6"
    },
    {
        "title": "My Favorite Green Bean Casserole",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 cup diced onion ADVERTISEMENT",
            "1 tablespoon minced fresh flat-leaf parsley ADVERTISEMENT",
            "1 cup diced fresh mushrooms ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon fresh lemon juice ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "2 (14.5 ounce) cans French-style green beans, drained ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 cup crushed buttery round crackers ADVERTISEMENT",
            "1/4 cup melted butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C).\nMelt 2 tablespoons butter in a skillet over medium heat. Cook and stir the onions, parsley, and mushrooms in the melted butter until the onions are translucent and the mushrooms are giving off their juices, 7 to 10 minutes. Add the flour, salt, pepper, and lemon juice; cook until the flour is slightly browned, 2 to 3 minutes. Stir the sour cream into the mixture. Mix the green beans into the mixture. Pour the green bean mixture into a 9-inch square baking dish. Sprinkle the Cheddar cheese over the mixture. Stir the crackers and melted butter together in a small bowl until evenly mixed; spread evenly over the Cheddar cheese layer.\nBake in the preheated oven until bubbly and brown, 20 to 30 minutes.\n",
        "picture_link": "K8Iu4P1tPbBzVSEy/CenIzlpeJRHKjy"
    },
    {
        "title": "Pink Cloud",
        "ingredients": [
            "1 (3 ounce) package raspberry flavored gelatin (such as Jell-O®) ADVERTISEMENT",
            "1 (16 ounce) package frozen whipped topping, thawed ADVERTISEMENT",
            "1 (16 ounce) package large curd cottage cheese ADVERTISEMENT",
            "1 (20 ounce) can crushed pineapple, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine gelatin, whipped topping, cottage cheese, and pineapple in a large bowl. Mix until evenly pink. Refrigerate until ready to serve.\n",
        "picture_link": "4P6J.l.n8FTvwAjH0w5dgKMstybZc0O"
    },
    {
        "title": "Raspberry Chipotle Sauce",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 large jalapeno peppers, seeded and diced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "4 teaspoons adobo sauce ADVERTISEMENT",
            "2 (6 ounce) containers fresh raspberries ADVERTISEMENT",
            "1/2 cup apple cider vinegar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a skillet over medium heat. Stir in jalapenos; cook until tender, about 5 minutes. Mix in garlic, and adobo sauce; bring to a simmer. Stir the raspberries into the sauce; cook until soft, about 3 minutes. Stir in the vinegar, salt, brown sugar, and white sugar. Mix well. Simmer until thickened and reduced by half, about 15 minutes. Transfer sauce to a heatproof bowl; allow to cool to room temperature before serving, about 20 minutes.\n",
        "picture_link": "uvtlclQndmZh8FdOpcOz1pyY3qPr7wa"
    },
    {
        "title": "Noodles Riviera",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 pound extra lean ground beef ADVERTISEMENT",
            "1/2 teaspoon ground dried thyme ADVERTISEMENT",
            "1 (1.5 ounce) envelope spaghetti sauce seasoning mix ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "1 (8 ounce) package egg noodles ADVERTISEMENT",
            "1 (3 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1 (8 ounce) container sour cream ADVERTISEMENT",
            "1 cup shredded mozzarella cheese, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large skillet over medium-high heat and stir in the ground beef. Cook and stir until the beef is crumbly, evenly browned, and no longer pink, 5 to 7 minutes. Drain and discard any excess grease, then stir in the thyme, spaghetti sauce mix, tomato paste, and water; season to taste with salt and pepper. Bring to a simmer, then reduce heat to medium-low, cover, and simmer 25 minutes, stirring occasionally.\nPreheat an oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking dish.\nWhile the meat is simmering, fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the egg noodles, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 5 minutes. Drain well in a colander set in the sink.\nMix the cream cheese with the parsley and Parmesan cheese in a bowl until the cream cheese is no longer lumpy. Stir in the sour cream and 3/4 of the shredded mozzarella until evenly combined. Pour half of the drained egg noodles into the prepared baking dish, followed by half of the meat sauce. Spread half of the sour cream mixture over the meat sauce. Repeat the layers with the remaining egg noodles, meat sauce, and sour cream mixture. Sprinkle with the remaining mozzarella cheese.\nBake in the preheated oven until the mozzarella cheese is bubbly and golden brown, about 35 minutes.\n",
        "picture_link": "2RFR.HcCsvawyFqzui0m7px0hLtcGEq"
    },
    {
        "title": "Candy Cane Popcorn",
        "ingredients": [
            "1/2 cup unpopped popcorn ADVERTISEMENT",
            "4 ounces vanilla-flavored confectioners' coating, or as needed ADVERTISEMENT",
            "6 peppermint candy canes, crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Using an air popper, pop the popcorn, place into a large bowl, and discard unpopped kernels. Melt the confectioners' coating according to the package directions.\nPour the melted coating over the popcorn, and sprinkle the crushed candy canes over the mixture. Using your hands, work the candy coating and crushed candy canes all through the popcorn. Let the mixture cool, and break apart into bite-size pieces.\n",
        "picture_link": "Qe3XzxA6fci0aq9Ax.vIQPjrem31s/q"
    },
    {
        "title": "Mexican Veggies with Queso",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1/2 cup chopped red onion ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 zucchini, thinly sliced ADVERTISEMENT",
            "1 yellow squash, thinly sliced ADVERTISEMENT",
            "1 chayote squash, thinly sliced ADVERTISEMENT",
            "1 cup peeled, chopped jicama ADVERTISEMENT",
            "2 tomatoes, chopped ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 cup shredded queso asadero (white Mexican cheese) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the vegetable oil in a skillet over medium heat. Stir in the onion and garlic; cook and stir until the onion has softened and turned translucent, about 5 minutes. Add zucchini, yellow squash, and chayote. Cover, stirring occasionally, until the vegetables are tender, about 5 minutes. Add the chopped jicama; cover and cook 3 minutes. Stir in the tomatoes, chili powder, cumin, cayenne, salt, and pepper. Cover and let cook for 2 minutes.\nRemove from heat and stir in the shredded cheese. Serve immediately.\n",
        "picture_link": "eB9AWFqzlKkZPiWS/m8VnscIOf1rk5i"
    },
    {
        "title": "Cranberry Pumpkin Banana Bread",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 1/4 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1 tablespoon butter, softened ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1 cup solid pack pumpkin puree ADVERTISEMENT",
            "1/2 cup whole cranberry sauce ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 banana, mashed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Sift flour, baking soda, salt, cinnamon, and nutmeg into a large bowl.\nBeat the butter, brown sugar, pumpkin, cranberry sauce, egg, and banana with an electric mixer in a bowl until smooth. Gradually stir in the flour mixture, mixing until just combined. Pour batter into a 9x5-inch loaf pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 1 hour. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "gkYXXraeTv18K.TmftzZIh4l1Yx/4yy"
    },
    {
        "title": "Charlie's Sweet Island Brussels Sprouts",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 pounds Brussels sprouts, trimmed and halved lengthwise ADVERTISEMENT",
            "2 teaspoons garlic powder ADVERTISEMENT",
            "1 tablespoon jerk seasoning ADVERTISEMENT",
            "1 tablespoon curry powder ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter with olive oil in a large skillet over medium heat. Stir in Brussels sprouts, garlic powder, jerk seasoning, curry powder, and brown sugar. Cook and stir the Brussels sprouts, tossing them in the butter and seasonings, until tender, 5 to 10 minutes.\n",
        "picture_link": "6dugsSffUVlzjOqVOhRRGfKjpXCt5VK"
    },
    {
        "title": "Chilean Empanada",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon cumin ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 pound ground pork ADVERTISEMENT",
            "3 hard-cooked eggs, chopped ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "1 cup chopped black olives ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 teaspoon cornstarch ADVERTISEMENT",
            "1 cup lukewarm milk ADVERTISEMENT",
            "1 cup shortening, melted ADVERTISEMENT",
            "5 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a large skillet over medium heat; cook the onion, garlic, oregano, cumin, salt, and pepper in the melted butter until the onion is golden brown, 5 to 7 minutes. Add the ground pork and cook until completely browned, 7 to 10 minutes more; drain the fat from the skillet. Stir the eggs, raisins, and olives into the mixture. Whisk the water and cornstarch together in a small bowl; pour into the skillet and stir until the liquid thickens. Remove from heat and set aside.\nWhisk the milk and melted shortening together in a bowl until evenly blended. Stir the flour and salt together in a separate large bowl. Pour the wet mixture into the dry and whisk until well mixed into a dough. Set aside to rest for 10 minutes.\nPreheat an oven to 400 degrees F (200 degrees C).\nPlace the dough onto a lightly-floured board and roll to about 1/8-inch thick; cut into circles with a round cookie cutter or glass. Drop equal portions of the pork mixture into the center of each circle. Fold each circle in half and press edges with a fork to seal. Brush the tops of the empanadas with beaten egg.\nBake in the preheated oven until golden brown, about 25 minutes.\n",
        "picture_link": "eY5TF28wmf3tIPPEpAW9lKqhkApWYC6"
    },
    {
        "title": "Essanaye's Pizza Sauce",
        "ingredients": [
            "3 tablespoons olive oil ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 (28 ounce) can tomato sauce ADVERTISEMENT",
            "1/2 teaspoon crushed red pepper ADVERTISEMENT",
            "2 teaspoons dried thyme ADVERTISEMENT",
            "2 teaspoons Italian seasoning ADVERTISEMENT",
            "2 teaspoons dried basil ADVERTISEMENT",
            "2 teaspoons dried oregano ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 tablespoon brown sugar, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir the olive oil, garlic, tomato sauce, red pepper, thyme, Italian seasoning, basil, oregano, salt, and brown sugar together in a saucepan over low heat; simmer, stirring occasionally, for 45 minutes. Refrigerate overnight before using.\n",
        "picture_link": "EHft4v2rcNqOGH.or0xm4ws3JFjNTSu"
    },
    {
        "title": "Grilled Cheese, Cinnamon, and Apple Sandwich",
        "ingredients": [
            "1 tablespoon softened butter ADVERTISEMENT",
            "2 slices white bread ADVERTISEMENT",
            "1 small apple - peeled, cored, and sliced ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1 slice American cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place a skillet over medium heat. Spread butter evenly and completely over one side of each bread slice. Arrange the apple slices on the unbuttered side of one of the bread slices. Sprinkle the cinnamon over the apples. Place the cheese slice atop the apples. Top with the remaining bread slice with the buttered side facing outward. Lie gently into the skillet. Cook sandwich on both sides until golden brown, 2 to 3 minutes per side.\n",
        "picture_link": "FoHr0KnyQw0o5v7IpVQ/5VpH5cwMi2W"
    },
    {
        "title": "Canada Day Nanaimo Bar Cheesecake",
        "ingredients": [
            "2 1/2 cups crushed chocolate cream-filled sandwich cookies (such as OREO® Cookies) ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1/4 cup chopped pecans ADVERTISEMENT",
            "1/2 cup flaked coconut ADVERTISEMENT",
            "4 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/4 cup custard powder (such as Bird's® Custard Powder) ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "6 (1 ounce) squares semisweet chocolate ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C).\nStir together the cookie crumbs, melted butter, pecans, and coconut in a bowl until the mixture is well combined. Press into the bottom of a 9x13-inch baking dish, and refrigerate while making filling.\nBeat cream cheese, sugar, and custard powder in a large bowl with an electric mixer until light and fluffy, and beat in eggs, 1 at a time, beating each until fully incorporated before adding the next. Layer the filling over the crust.\nBake in the preheated oven until the center is almost set, about 40 minutes. Refrigerate the cheesecake until fully cold, at least 3 hours.\nMelt the semisweet chocolate in a saucepan over very low heat with the cream, and stir until the mixture is smooth and well blended. Pour the chocolate mixture over the cheesecake, spread with a spatula to cover the middle layer, and refrigerate until the topping is firm, 15 to 20 minutes. Serve cold. Store leftovers in refrigerator.\n",
        "picture_link": "liICsbnOR.C5pihIfAVxz42DF/KcnxK"
    },
    {
        "title": "Quick and Easy Pumpkin Mousse",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "24 marshmallows ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup canned pumpkin ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon pumpkin pie spice ADVERTISEMENT",
            "1/3 cup confectioners' sugar ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a large skillet. Stir in the marshmallows, milk, and pumpkin. Stir frequently until melted and smooth. Remove from heat; stir in vanilla and pumpkin pie spice. Cool completely, about 30 minutes.\nCombine 1/3 cup confectioners' sugar and 1 cup heavy cream in a large bowl. Use an electric mixer to beat until stiff peaks form. Fold whipped cream into cooled pumpkin mixture. Pour mousse into ramekins or chocolate shells. Cover and refrigerate until firm, about 2 hours.\n",
        "picture_link": "SAYI3lZZM4P3rVR5kN0f0IVywtGiOe6"
    },
    {
        "title": "Very Old Meatloaf Recipe",
        "ingredients": [
            "2 pounds ground beef ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1 tablespoon milk ADVERTISEMENT",
            "1 cup bread crumbs ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1 carrot, diced ADVERTISEMENT",
            "1 small Granny Smith apple, diced ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C).\nMix ground beef with water and milk in a large bowl using your hands until beef is evenly moistened.\nMix bread crumbs, onion, carrot, apple, and egg into the beef mixture until evenly integrated.\nForm the beef mixture into a loaf.\nTransfer the meatloaf to a deep baking dish; tent with a sheet of aluminum foil.\nBake in preheated oven for 1 hour; remove foil tent and bake until no longer pink the center, about 30 minutes more.\n",
        "picture_link": "oe28yF4C9La6mLmthCisHrNrU2hjdYy"
    },
    {
        "title": "Creepy Mini Pizzas",
        "ingredients": [
            "Crust: ADVERTISEMENT",
            "3 1/4 cups all-purpose flour, or more as needed ADVERTISEMENT",
            "1 envelope Fleischmann's® Pizza Crust Yeast or RapidRise Yeast ADVERTISEMENT",
            "1 1/2 tablespoons sugar ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 1/3 cups very warm water (120 degrees to 130 degrees F)* ADVERTISEMENT",
            "1/3 cup Mazola® Vegetable Plus! Oil ADVERTISEMENT",
            "Suggested Toppings: ADVERTISEMENT",
            "Green, red and yellow bell peppers ADVERTISEMENT",
            "Mushrooms ADVERTISEMENT",
            "Black olives ADVERTISEMENT",
            "Pepperoni slices ADVERTISEMENT",
            "Curly leaf parsley or other fresh herbs ADVERTISEMENT",
            "1 pound shredded white and yellow cheeses such as mozzarella and cheddar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F.\nCombine 2 cups flour, undissolved yeast, sugar and salt in a large bowl. Add very warm water and oil; mix until well blended, about 1 minute.\nGradually add enough remaining flour to make a soft dough. Dough should form a ball and will be slightly sticky. Knead** on a floured surface, adding additional flour if necessary, until smooth and elastic, about 4 minutes. Divide dough into 8 portions; cover. (If using RapidRise Yeast, let dough rise at this point for 10 minutes.)\nPat each portion of dough with floured hands into an 8-inch circle on a greased baking sheet. Form a rim by pinching the edge of the dough. Add a second crust to the same baking sheet.\nBake for 6 to 7 minutes, dough will be just set and only lightly browned on the bottom. Remove crusts to a wire rack to cool. Continue with remaining pizza dough. (Works best to use several baking sheets.) May use crusts immediately or place in freezer bags and freeze for up to 1 month.\nWhen ready to bake, preheat oven to 475 degrees F. Spread each crust with pizza sauce. Top with desired toppings to make Halloween designs! Repeat with remaining pizzas. Place on a baking sheet and bake for 6 to 8 minutes, until cheese is melted and lightly browned and bottom of crust is browned.\n",
        "picture_link": "UFT/Tqm4DRDgqzaQlDnaH1HrVdbry2m"
    },
    {
        "title": "Buttery Caramel Apple Jam",
        "ingredients": [
            "8 half-pint canning jars with lids and rings ADVERTISEMENT",
            "8 cups Granny Smith apples - peeled, cored, and chopped ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "3 cups brown sugar ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 1/2 (1.75 ounce) packages powdered fruit pectin ADVERTISEMENT",
            "1 tablespoon clear butter flavoring (such as Wilton®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sterilize the jars and lids in boiling water for at least 5 minutes.\nBring apples, water, and butter to a boil in a large pot. Reduce heat to low, cover, and simmer until apples are softened, about 8 minutes. Mix in brown sugar, white sugar, pectin powder, and butter flavoring. Bring to a full rolling boil, stirring often. Cook at a boil for 2 minutes without stirring.\nPack the apple jam into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids and screw on rings.\nPlace a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower jars into the boiling water using a holder. Leave a 2-inch space between the jars. Pour in more boiling water if necessary to bring the water level to at least 1 inch above the tops of the jars. Bring the water to a rolling boil, cover the pot, and process for 15 minutes.\nRemove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Let stand 8 hours to overnight before use. Store in a cool, dark area; refrigerate opened jars.\n",
        "picture_link": ".PSO2/yFSq2R1Xf83oy8Xa0qT4p9AdS"
    },
    {
        "title": "Paleo Coconut Curry Stir Fry",
        "ingredients": [
            "1 1/2 cups coconut milk ADVERTISEMENT",
            "1 tablespoon minced ginger ADVERTISEMENT",
            "1 tablespoon lime juice ADVERTISEMENT",
            "1 tablespoon fish sauce ADVERTISEMENT",
            "1 teaspoon oyster sauce ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "1/2 teaspoon chile-garlic sauce (such as Sriracha®) ADVERTISEMENT",
            "2 tablespoons white sugar or sugar substitute ADVERTISEMENT",
            "1 tablespoon avocado oil ADVERTISEMENT",
            "1 pound chicken breast, cut into bite-sized pieces ADVERTISEMENT",
            "1/2 onion, sliced ADVERTISEMENT",
            "1 1/2 teaspoons curry powder ADVERTISEMENT",
            "2 cups broccoli florets ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix coconut milk, ginger, lime juice, fish sauce, oyster sauce, garlic, chile-garlic sauce, and sugar together in a small bowl.\nHeat avocado oil in a large skillet or wok over medium-high heat. Stir-fry chicken in the hot oil until no longer pink, 8 to 10 minutes. Remove from wok and keep warm. Leave remaining avocado oil in skillet.\nStir onion and curry powder into hot oil in skillet; cook 2 minutes. Stir in broccoli; stir-fry 3 minutes. Add coconut milk mixture and bring to a boil. Reduce heat to medium and simmer sauce and vegetables for 3 minutes. Return chicken to skillet; cover and cook until chicken has heated through and vegetables are tender, about 3 minutes.\n",
        "picture_link": "9.AsiDPlK/oN2M6b6TntoEfjdj3WAFq"
    },
    {
        "title": "Simple Beef Tips and Noodles",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 pound cubed beef stew meat ADVERTISEMENT",
            "1 large onion, diced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 (8 ounce) package sliced button mushrooms ADVERTISEMENT",
            "1 (32 ounce) carton beef stock ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 (8 ounce) package wide egg noodles ADVERTISEMENT",
            "3 tablespoons cornstarch ADVERTISEMENT",
            "1/2 cup cold water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in the pressure cooker over medium-high heat and stir in beef cubes. Cook until the beef is browned on all sides; remove beef and set it aside. Drain and discard excess grease.\nLower the heat to medium and add onion; cook and stir until onion has softened and turned translucent, about 5 minutes. Stir in garlic and mushrooms and continue to cook about 5 minutes more, until garlic is fragrant but not brown.\nPour in beef stock, beef stew meat, and any accumulated drippings; season with salt and pepper. Return to high heat, seal the lid, and bring to full pressure.\nReduce the heat to low, maintaining full pressure, and cook for 20 minutes.\nWhile the stew is cooking, bring a large pot of lightly salted water to a boil. Stir in noodles and cook until tender, stirring often, about 8 minutes. Drain and set aside.\nRemove the pressure cooker from the heat and allow the pressure to drop naturally. Dissolve cornstarch into 1/2 cup of cold water. When the pressure has dropped, remove the lid and whisk in the cornstarch mixture. Bring the beef and mushrooms back to a boil and cook, stirring constantly, for 2 minutes or until the sauce has thickened. Pour the beef over the noodles and serve.\n",
        "picture_link": "A5UosS7cSTcwzuz8pTNuITdf8Pe6AjO"
    },
    {
        "title": "Spaghetti Squash Mediterranean-Style",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 spaghetti squash, halved lengthwise and seeded ADVERTISEMENT",
            "2 tablespoons olive oil, divided ADVERTISEMENT",
            "3 (4 ounce) Italian sausage links, casings removed ADVERTISEMENT",
            "2 spring onions, finely chopped ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 zucchini, diced ADVERTISEMENT",
            "1 red bell pepper, seeded and diced ADVERTISEMENT",
            "1 tablespoon Italian seasoning ADVERTISEMENT",
            "4 ounces crumbled feta cheese, or more to taste ADVERTISEMENT",
            "sea salt to taste ADVERTISEMENT",
            "1 pinch lemon pepper, or to taste ADVERTISEMENT",
            "1 small tomato, finely chopped ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley, or as desired (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Coat large baking dish with cooking spray.\nPlace spaghetti squash cut-side down in prepared baking dish.\nBake in preheated oven until spaghetti squash is tender when pierced with a fork, about 45 minutes. Turn squash over and bake for another 5 minutes. Remove spaghetti squash from oven. Scrape the strands from the skin and place into a large bowl.\nHeat 1 tablespoon of olive oil in a large skillet over medium heat. Add Italian sausage and cook, stirring occasionally, until sausage is brown and crumbly, 5 to 8 minutes. Remove sausage.\nReturn skillet to heat; add 1 tablespoon olive oil, spring onions, and garlic, cook and stir until onions are softened, about 5 minutes. Add zucchini, red peppers, and Italian seasoning and continue to cook and stir until the vegetables are soft, about 5 minutes.\nStir spaghetti squash and feta cheese into vegetable mixture; cook and stir until cheese melts, about 3 minutes. Stir sausage into vegetable mixture; season with salt and lemon pepper. Sprinkle tomato and parsley on top to serve.\n",
        "picture_link": "WjkpMN9ZrVLC13DJKM6tff7eAxLlilW"
    },
    {
        "title": "Old Fashioned Flaky Pie Crust",
        "ingredients": [
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "3 1/2 tablespoons water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk flour with salt in a bowl; use a fork to stir in vegetable oil. Mix in water, 1 tablespoon at a time, before adding more water. Gather dough into a ball, divide in half, and roll out on a floured work surface.\n",
        "picture_link": "prs0Wi5fr1mPVuU1OGxcKeDq5ymNLOG"
    },
    {
        "title": "Roasted Mushroom Soup",
        "ingredients": [
            "1 (8 ounce) package fresh mushrooms, halved ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 teaspoon rosemary ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 onions, sliced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon chopped fresh thyme ADVERTISEMENT",
            "1/2 cup heavy cream, divided ADVERTISEMENT",
            "1 (14.5 ounce) can chicken broth ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 400 degrees F (200 degrees C).\nMix the mushrooms, 1 minced clove garlic, rosemary, and salt together in a bowl. Drizzle the olive oil over the mushroom mixture, and toss to coat evenly; transfer to a baking sheet.\nRoast the mushrooms in the preheated oven until golden brown, about 15 minutes.\nMelt the butter in a large saucepan over medium heat. Stir the onions, 2 minced cloves garlic, and the thyme into the melted butter; cook and stir until the onions are completely soft, 7 to 10 minutes.\nCombine the mushroom mixture and the onion mixture in the bowl of a blender or food processor with about half of the heavy cream; blend on low until combined yet slightly chunky. Return the blended mixture to the stockpot. Stir the remaining heavy cream, the chicken broth, milk, and black pepper through the blended mixture; bring the resulting soup to a simmer, and cook until the flavors are thoroughly combined, at least 15 minutes.\n",
        "picture_link": "k7.7tsYYv1VaqnnVUOKDrLbLm3C3YmK"
    },
    {
        "title": "Basmati Rice Pilaf",
        "ingredients": [
            "1 1/2 cups chicken stock ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1/4 cup finely diced onion ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1 cup uncooked basmati rice ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 tablespoon unsalted butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat chicken stock in a saucepan until boiling; keep hot until ready to use.\nHeat vegetable oil in a 2 quart saucepan over medium-high heat. Cook and stir onion and bay leaf in the hot oil until onion is tender, about 5 minutes.\nStir basmati rice into onion mixture until rice is coated with oil.\nPour hot chicken stock into the rice mixture. Season with salt; stir.\nBring rice mixture to a boil; cover and reduce heat to medium-low. Continue simmering until rice is tender and liquid is absorbed, about 20 minutes.\nRemove saucepan from heat and discard bay leaf. Add butter and fluff the rice with a fork.\n",
        "picture_link": "i0oG0TKxzXI/jwecHBAlor/AvdEyyzG"
    },
    {
        "title": "Collard Greens with White Beans",
        "ingredients": [
            "2 tablespoons water, or more as needed ADVERTISEMENT",
            "1 1/4 cups chopped onion ADVERTISEMENT",
            "3 tablespoons minced garlic ADVERTISEMENT",
            "1 cube beef-flavored vegetarian bouillon ADVERTISEMENT",
            "7 ounces collard greens, chopped ADVERTISEMENT",
            "1 (14.5 ounce) can no-salt-added diced tomatoes ADVERTISEMENT",
            "1 1/4 cups water ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 (14.5 ounce) can great Northern beans, rinsed and drained ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 2 tablespoons water in a large skillet over medium heat. Cook and stir onion and garlic in water until onion is softened and translucent, about 10 minutes, adding more water as needed to prevent scorching. Stir vegetarian bouillon into onion mixture.\nStir collard greens, tomatoes, and 1 1/4 cup water into onion mixture. Season with salt and pepper; cover and simmer until vegetables are tender, about 20 minutes. Stir in great Northern beans and sugar and continue to simmer until liquid evaporates, about 10 minutes more. Adjust seasoning as needed.\n",
        "picture_link": "Hr/JiO0gFHha0l3J.ha5MSTFtl7IPhi"
    },
    {
        "title": "Val's Spicy Baked Shrimp",
        "ingredients": [
            "3 slices bacon ADVERTISEMENT",
            "3/4 pound butter ADVERTISEMENT",
            "2 tablespoons Dijon mustard (such as Grey Poupon Country Mustard™) ADVERTISEMENT",
            "1 1/2 teaspoons chili powder ADVERTISEMENT",
            "1/4 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1/4 teaspoon dried basil ADVERTISEMENT",
            "1/4 teaspoon dried thyme ADVERTISEMENT",
            "2 tablespoons chopped onion ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup dry white wine ADVERTISEMENT",
            "1 tablespoon seafood seasoning (such as Old Bay®) ADVERTISEMENT",
            "2 pounds uncooked medium shrimp, peeled and deveined ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C).\nCook the bacon in a large, deep skillet over medium-high heat until evenly browned, about 10 minutes.\nTransfer bacon to a paper-lined plate to drain, reserving bacon grease in the skillet. Dice the bacon once cooled enough to handle.\nMelt butter in the remaining bacon grease over medium heat. Cook and stir diced bacon, Dijon mustard, chili powder, red pepper flakes, basil, thyme, onion, and garlic until onion is tender, about 5 minutes.\nStir wine and seafood seasoning into onion mixture; add shrimp and toss to coat.\nPour shrimp and onion mixture into a 9x13-inch baking dish.\nBake in the preheated oven until the shrimp are bright pink on the outside and the meat is no longer transparent in the center, about 20 minutes.\n",
        "picture_link": "EQgoi2ShXHA3eGNGpCNAwt5Jh0c1Fb."
    },
    {
        "title": "Sufferin' Succotash Salad",
        "ingredients": [
            "2 tablespoons barbeque sauce ADVERTISEMENT",
            "2 tablespoons rice vinegar ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "2 ears corn, kernels cut from cob ADVERTISEMENT",
            "1 large red bell pepper, diced ADVERTISEMENT",
            "4 green onions, chopped ADVERTISEMENT",
            "1 (14.5 ounce) can white beans, drained and rinsed ADVERTISEMENT",
            "1 pinch salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk barbeque sauce, rice vinegar, and oil in a large bowl until smooth. Stir in corn kernels, red bell pepper, green onions, and white beans to coat. Cover and refrigerate for at least 2 hours.\n",
        "picture_link": "LpZt466oSP0XPDMnxT1yxnSJ9OFRA7u"
    },
    {
        "title": "Aunt Kate's Strawberry Cake",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "2 eggs, room temperature ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup mashed fresh strawberries ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "1/4 cup butter, room temperature ADVERTISEMENT",
            "1/4 cup mashed fresh strawberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nGrease a cake pan.\nBeat white sugar and shortening together until light and fluffy.\nBeat eggs, one at a time, into sugar mixture until well mixed; stir in vanilla extract.\nStir 1 cup strawberries and baking soda in a large bowl until baking soda is dissolved. This will help strawberries foam and rise in the cake.\nWhisk flour and salt together in a separate bowl. Stir flour mixture and strawberry mixture by hand, into sugar mixture, alternating flour mixture, then strawberry mixture, beginning and ending with flour mixture.\nPour batter into prepared cake pan.\nBake in the preheated oven until a toothpick inserted in the center comes out clean, 25 to 30 minutes.\nBeat confectioners' sugar, butter, and 1/4 cup strawberries in a bowl with an electric mixer until blended; frost the cooled strawberry cake.\n",
        "picture_link": "y9eEhOXojf3NWc3ONvpQOY5t5Cn2.s2"
    },
    {
        "title": "Sausage, Potato, Carrot Bake",
        "ingredients": [
            "2 Kielbasa sausage rings, cut into 2-inch pieces ADVERTISEMENT",
            "8 potatoes, peeled and quartered ADVERTISEMENT",
            "1 onion, cut into chunks ADVERTISEMENT",
            "1 (8 ounce) package baby carrots ADVERTISEMENT",
            "4 cloves garlic, crushed ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix Kielbasa, potatoes, onion, baby carrots, and garlic in a roasting pan; season with salt and pepper. Drizzle olive oil over the mixture; stir to coat. Cover the baking dish with aluminum foil.\nBake in preheated oven for 1 hour. Remove aluminum foil and bake until potatoes are completely cooked, about 30 minutes more.\n",
        "picture_link": "01/H4QwJUBURsM49lCfNG.L/vnicQhW"
    },
    {
        "title": "Savory Portobello Mushroom Burgers ",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 teaspoon Worcestershire sauce (optional) ADVERTISEMENT",
            "1 pinch salt and ground black pepper ADVERTISEMENT",
            "4 large portobello mushrooms, stems removed ADVERTISEMENT",
            "4 kaiser rolls, split ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill for medium-high heat and lightly oil the grate.\nWhisk olive oil, balsamic vinegar, Dijon mustard, garlic, Worcestershire sauce, salt, and pepper in a bowl. Brush the mixture over the tops and bottoms of the mushrooms; let stand for 10 minutes.\nGrill mushrooms on the preheated grill with the cover closed until mushrooms are browned and tender, about 10 minutes, turning once. Serve on kaiser rolls.\n",
        "picture_link": "aeIB6gVjyoRTWyEkMld.MikmXD7gLfy"
    },
    {
        "title": "Summer Fresh Pasta with Tomatoes and Prosciutto",
        "ingredients": [
            "1 (12 ounce) package angel hair pasta ADVERTISEMENT",
            "4 tomatoes, seeded and coarsely chopped ADVERTISEMENT",
            "1/2 teaspoon sea salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/3 cup extra-virgin olive oil ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 large shallot, thinly sliced ADVERTISEMENT",
            "2 cloves garlic cloves, minced ADVERTISEMENT",
            "4 ounces thinly sliced prosciutto, cut into thin strips ADVERTISEMENT",
            "1/4 cup fresh basil leaves, thinly sliced ADVERTISEMENT",
            "1/4 cup freshly grated Parmigiano-Reggiano cheese, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a rolling boil. Cook angel hair pasta at a boil until tender but still slightly firm, 4 to 5 minutes. Drain the pasta, reserving 1 cup of the cooking water for later use. Transfer the drained pasta to a large serving bowl.\nPlace tomatoes in a bowl; season with sea salt and black pepper.\nPour 1/3 cup extra-virgin olive oil over the tomato mixture and gently toss; set aside.\nHeat 1 tablespoon olive oil in a small skillet over medium heat.\nCook and stir sliced shallot in the hot oil until just becoming translucent, 1 to 2 minutes.\nStir garlic into the shallot; continue cooking and stirring 1 minute more. Remove the skillet from heat.\nAssemble the dish by adding the tomato mixture, the shallot and garlic mixture, and the prosciutto to the pasta; toss to combine. Use the reserved water from cooking the pasta to make it easier to mix.\nTop the pasta dish with basil and Parmigiano-Reggiano cheese to serve.\n",
        "picture_link": "T7Ymv5EQvJlnFxxPTI4d4cBe6NVAm8C"
    },
    {
        "title": "Cucumber Sandwich Appetizers",
        "ingredients": [
            "1 (8 ounce) package spreadable cream cheese ADVERTISEMENT",
            "1/4 cup sour cream ADVERTISEMENT",
            "1 (.7 ounce) package dry Italian-style salad dressing mix ADVERTISEMENT",
            "1 (1 pound) loaf sliced pumpernickel party bread ADVERTISEMENT",
            "2 cucumbers, peeled and thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix cream cheese, sour cream, and Italian salad dressing mix in a bowl until well blended.\nSpread cream cheese mixture atop pumpernickel party bread and top each slice with 1 to 2 cucumber slices.\n",
        "picture_link": "dlbu9bsOAeG/VdmtC07Hg22iNyRgknm"
    },
    {
        "title": "Green Bean and Asparagus Salad",
        "ingredients": [
            "1 pound fresh green beans, trimmed and cut into bite-size pieces ADVERTISEMENT",
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "1 pound fresh asparagus, trimmed and cut into bite-size pieces ADVERTISEMENT",
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "1/2 red onion, chopped ADVERTISEMENT",
            "2 cups cherry tomatoes, halved ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "kosher salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 tablespoon extra-virgin olive oil, or as desired (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 400 degrees F (200 degrees C).\nToss green bean pieces and 1 tablespoon olive oil in a bowl until the green beans are evenly coated; spread onto a baking sheet.\nRoast green beans in preheated oven until tender, about 10 minutes.\nToss asparagus pieces and 1 tablespoon oil in a bowl until the asparagus is evenly coated; spread onto the baking sheet with the partially roasted green beans.\nContinue roasting the green bean and asparagus mixture until tender, 10 to 12 minutes.\nToss the roasted green beans and asparagus with red onion, cherry tomatoes, and parsley in a large bowl; season with kosher salt and black pepper. Drizzle with olive oil to taste, if desired.\n",
        "picture_link": "TTpVCQDGXw7JgP52QeQ2.hSXqCCxkji"
    },
    {
        "title": "Touchdown Taco Dip",
        "ingredients": [
            "1 (16 ounce) container sour cream ADVERTISEMENT",
            "1 (8 ounce) package shredded Cheddar cheese ADVERTISEMENT",
            "1 (4 ounce) can chopped green chilies ADVERTISEMENT",
            "1/2 (4 ounce) can chopped black olives, drained ADVERTISEMENT",
            "1 (1 ounce) package taco seasoning ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the sour cream, Cheddar cheese, chopped green chilies, black olives, and taco seasoning into a bowl, and stir to combine.\n",
        "picture_link": "haiaht2rZXWd97odrnjxsAGb1t/N4Py"
    },
    {
        "title": "Cajun Crab Cakes (No Breadcrumbs)",
        "ingredients": [
            "For the Crab Cakes: ADVERTISEMENT",
            "2 tablespoons salted butter ADVERTISEMENT",
            "1/2 onion, finely chopped ADVERTISEMENT",
            "2 stalks celery, finely chopped ADVERTISEMENT",
            "1/2 large red bell pepper, finely chopped ADVERTISEMENT",
            "1 bunch green onions (green portion only), chopped ADVERTISEMENT",
            "1/2 large carrot, finely chopped ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon parsley flakes ADVERTISEMENT",
            "2 teaspoons Creole seasoning (such as Tony Chachere's®) ADVERTISEMENT",
            "2 teaspoons dried basil ADVERTISEMENT",
            "2 teaspoons ground black pepper ADVERTISEMENT",
            "1 teaspoon dried dill weed ADVERTISEMENT",
            "1/2 teaspoon oregano ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "2 large eggs, beaten ADVERTISEMENT",
            "1 pound lump crabmeat, picked free of shell ADVERTISEMENT",
            "9 buttery crackers (such as Keebler Club® crackers), crushed ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "For the Spicy Cajun Dipping Sauce: ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1 tablespoon chile-garlic sauce (such as Sriracha®) ADVERTISEMENT",
            "2 teaspoons Creole seasoning (such as Tony Chachere's®) ADVERTISEMENT",
            "2 teaspoons parsley flakes ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large, heavy skillet over medium heat. Stir in onion; cook and stir until the onion has softened and turned translucent, about 5 minutes.\nStir in the celery, bell pepper, green onion, carrot, and garlic. Continue to cook and stir until vegetables are tender, about 10 minutes more.\nSeason with 1 tablespoon parsley flakes, 2 teaspoons Creole seasoning, basil, pepper, dill weed, oregano, and thyme. Cook and stir until fragrant, 5 minutes more.\nTransfer cooked vegetables to a large bowl; allow to cool for about 10 minutes. Set skillet aside for later use.\nStir the beaten eggs into the vegetables. Mix in the crabmeat and cracker crumbs with your hands, making sure not to break up the chunks of crab too much.\nShape the crab mixture into 12 small cakes.\nHeat vegetable oil in the skillet over medium high heat.\nPan-fry the crab cakes in batches until golden brown on each side, about 3 minutes.\nTo make dipping sauce: Whisk together the mayonnaise, chile-garlic sauce, 2 teaspoon Creole seasoning, 2 teaspoon parsley flakes, and paprika.\n",
        "picture_link": "o.Cp/vcOHICixP7tuiRkzDtdFIO2iFu"
    },
    {
        "title": "Pan Cream Puff",
        "ingredients": [
            "1/2 cup margarine ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, at room temperature ADVERTISEMENT",
            "3 cups milk ADVERTISEMENT",
            "2 (3 ounce) packages instant vanilla pudding mix ADVERTISEMENT",
            "1 (16 ounce) package frozen whipped topping, thawed ADVERTISEMENT",
            "1/4 cup chocolate syrup ADVERTISEMENT",
            "1 cup sliced almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease and flour a 9x13-inch pan.\nIn a saucepan or in the microwave, bring water and margarine to a boil. Mix in the flour, then beat in the eggs, one at a time. Spread mixture in the prepared pan; bake in preheated oven until puffed and golden, about 25 minutes. Press down any large bubbles with a wooden spoon. Cool cream puff before filling.\nFor the filling: Beat the cream cheese until fluffy. Stir in the milk and pudding mix. Beat until mixture is thick, then spread over cream puff. Top with whipped topping, drizzle with chocolate syrup and sprinkle with almonds. Refrigerate 24 hours before serving.\n",
        "picture_link": "llXVKoLjJEnjIVSwG8jjktWF9P9RqCa"
    },
    {
        "title": "Shmunky's Colby Jack Cheddar Biscuits",
        "ingredients": [
            "1 teaspoon olive oil ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1 1/2 teaspoons dried parsley ADVERTISEMENT",
            "1/8 teaspoon ground thyme ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 cup shredded Colby-Monterey Jack cheese ADVERTISEMENT",
            "1/4 cup shredded white Cheddar cheese ADVERTISEMENT",
            "6 tablespoons butter ADVERTISEMENT",
            "1 cup 2% milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Using olive oil, grease a baking sheet.\nWith a fork, mix together the flour, baking powder, parsley, thyme, salt, sugar, Colby-Monterey Jack cheese, and white Cheddar cheese together in a bowl. Cut the butter into the flour mixture in coarse chunks, then use the fork to further cut the butter into the flour-cheese mixture until the mixture resembles coarse crumbs. Lightly stir in the milk just until the dough holds together.\nDrop the batter by heaping 1/8-cup measuring cup onto the prepared baking sheet, and bake in the preheated oven until risen and golden brown, 20 to 30 minutes.\n",
        "picture_link": "tm5iYBrgDR.Eu8SWPRf9E5aLOJprX2W"
    },
    {
        "title": "White Chili III",
        "ingredients": [
            "1 1/2 tablespoons butter ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "2 stalks celery, thinly sliced ADVERTISEMENT",
            "4 cups cooked, chopped turkey meat ADVERTISEMENT",
            "2 (15 ounce) cans cannellini beans, drained and rinsed ADVERTISEMENT",
            "2 (14.5 ounce) cans chicken broth ADVERTISEMENT",
            "1 (11 ounce) can white corn, drained ADVERTISEMENT",
            "2 (4 ounce) cans chopped green chile peppers ADVERTISEMENT",
            "4 teaspoons ground cumin ADVERTISEMENT",
            "1/2 teaspoon hot pepper sauce, or to taste ADVERTISEMENT",
            "1 cup shredded Monterey Jack cheese ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan over medium heat, melt butter. Add onion and celery; cook until the onion is translucent. Put the turkey, beans, chicken broth, corn and green chilies into the pot. Season with cumin and hot pepper sauce. Cover and cook for 15 to 20 minutes.\nLadle chili into bowls and garnish with shredded cheese and chopped parsley.\n",
        "picture_link": "0vYvz6JJpihyAl.TmppUnCTE5K6/YJ6"
    },
    {
        "title": "Fry Bread II",
        "ingredients": [
            "4 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "4 tablespoons shortening ADVERTISEMENT",
            "1 1/3 cups cold water, or as needed ADVERTISEMENT",
            "2 quarts oil for deep frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk baking powder, salt and flour together. Cut in shortening. Add cold water gradually until a soft dough is made (it will still be a little sticky). Flour hands and knead about 5 minutes until smooth and no longer sticky. Divide into 8 pieces. Cover dough with plastic. Working one piece at a time, flatten each piece until about 1/2 inch thick and the size of a lunch plate.\nHeat oil in deep-fryer to 375 degrees F (190 degrees C).\nFry dough in oil; turn with tongs to brown each side. Drain on paper towels. Keep warm in paper towels in a 200 degree oven while cooking the rest.\n",
        "picture_link": "LaQGGiAEHyBtF.dPwyQxstNiBzGTlKC"
    },
    {
        "title": "Sweet-n-Sour Kielbasa",
        "ingredients": [
            "2 pounds kielbasa sausage, cut into 1/4-inch slices ADVERTISEMENT",
            "1 (12 ounce) bottle tomato-based chili sauce (such as Heinz®) ADVERTISEMENT",
            "1 (12 ounce) jar red currant jelly ADVERTISEMENT",
            "1 tablespoon crushed red pepper flakes ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir the sausage slices, chili sauce, red currant jelly, red pepper flakes, and water together in a slow cooker, cover, and set the cooker to Low. Cook at least 4 hours, stirring once every hour.\n",
        "picture_link": "TPgCO8jCLz30ziK9vT7Rxqkpujxymtu"
    },
    {
        "title": "Father-in-Law's Scallops with Sun-Dried Tomatoes and Bacon",
        "ingredients": [
            "4 slices double smoked bacon ADVERTISEMENT",
            "1 1/2 tablespoons olive oil ADVERTISEMENT",
            "12 large scallops, patted dry ADVERTISEMENT",
            "1/2 cup dry white wine ADVERTISEMENT",
            "3 tablespoons sun-dried tomatoes packed in oil, drained and thinly sliced ADVERTISEMENT",
            "1/4 cup heavy cream ADVERTISEMENT",
            "2 tablespoons butter, at room temperature ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "1 (8 ounce) package angel hair pasta ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate. Chop the bacon, and set aside.\nBring a large pot of lightly salted water to a boil for the pasta. While water is coming to a boil, heat olive oil in a large, heavy skillet over high heat, and pan-fry the scallops until browned and opaque, about 2 minutes per side. Remove scallops to a plate.\nStir the angel hair pasta into the boiling water, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, 4 to 5 minutes. Drain well in a colander set in the sink, and divide the hot pasta between 4 plates.\nPour white wine and sun-dried tomatoes into the skillet, and scrape up and dissolve any browned flavor bits left in the pan. Stir in the cream, bring to a boil over medium heat, reduce heat, and simmer until thickened, about 2 minutes. Remove the pan from the heat, and add the butter and garlic. Whisk the butter into the sauce, return the scallops to the pan, and cover with sauce.\nSpoon scallops and sauce over the pasta, sprinkle with chopped bacon, and season to taste with salt and pepper.\n",
        "picture_link": "mzpvA3o3pZ1sFtdE.oB.7SCJgvWKb4a"
    },
    {
        "title": "Penne with Eggplant",
        "ingredients": [
            "1 (8 ounce) package penne pasta ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 eggplant, halved lengthwise and cut into small pieces ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "2 tablespoons olive oil, or more if needed ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/4 cup sun-dried tomato spread ADVERTISEMENT",
            "1 cup tomato sauce, or more if needed ADVERTISEMENT",
            "4 leaves chopped fresh basil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the penne, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 11 minutes. Drain well in a colander set in the sink, reserving 1 cup pasta water.\nHeat 2 tablespoons olive oil in a large skillet over medium heat. Stir in eggplant and garlic, and drizzle with remaining olive oil to coat; cook and stir until the eggplant is tender and lightly browned, 5 to 7 minutes. Season with salt and pepper. Stir in the sun-dried tomato spread and tomato sauce; cook and stir until heated, through about 5 minutes more. Add penne and toss. Stir in pasta water if the sauce is too thick. Sprinkle with basil before serving.\n",
        "picture_link": "ncGSxBt5ggQ.ZlxISRAiYcUSmuaX2My"
    },
    {
        "title": "Chickeny Chickeny Rice",
        "ingredients": [
            "3 cups water ADVERTISEMENT",
            "2 cubes chicken bouillon ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 1/2 cups uncooked white rice ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nIn a medium saucepan heat water and bullion to a slow boil over medium-high heat. In a large oven safe skillet, heat oil over medium heat. Saute onions until transparent. Increase heat to high and add butter and rice. Stir constantly until the rice becomes starchy, about 3 minutes, and then carefully pour the chicken bouillon stock into the skillet.\nPlace the skillet in the oven and bake for 20 minutes. Season with salt and pepper to taste.\n",
        "picture_link": "wlVy/YdsbCOgwOgRwAkFBdBSsQec4O."
    },
    {
        "title": "Chocolate Dream Cake",
        "ingredients": [
            "1 (18.25 ounce) package chocolate cake mix ADVERTISEMENT",
            "1 (21 ounce) can cherry pie filling ADVERTISEMENT",
            "1 (10.5 ounce) package miniature marshmallows ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch pan.\nMix cake batter according to directions on package. Coat bottom of prepared pan with a layer of marshmallows, then pour batter over marshmallows. Spread cherry pie filling on top of batter layer.\nBake in the preheated oven for 30 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool. Serve with whipped topping if desired.\n",
        "picture_link": "ieQMtKGMIvy5sUrVqPP4ywktbTyjy/S"
    },
    {
        "title": "Pumpkin Pie Cake II",
        "ingredients": [
            "1 (29 ounce) can pumpkin ADVERTISEMENT",
            "1 (12 fluid ounce) can evaporated milk ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "3 teaspoons ground cinnamon ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "3/4 cup butter, melted ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking pan.\nIn a medium bowl, mix the pumpkin, evaporated milk, sugar, eggs, cinnamon and salt. Pour the mixture into the baking dish. Sprinkle cake mix over the pumpkin mixture. Drizzle with butter. Top with pecans.\nBake in the preheated oven 50 to 60 minutes. Cool before serving.\n",
        "picture_link": "IyuXb9Pnc7BT4x3XAldacKAzbzqn9a6"
    },
    {
        "title": "Tina's Peach Cobbler",
        "ingredients": [
            "8 cups fresh peaches - peeled, pitted, and sliced ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/3 cup unsalted butter ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour, sifted ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3/8 cup lard ADVERTISEMENT",
            "3/8 cup shortening ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/8 cup cold water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large saucepan, combine peaches, sugar and nutmeg. Cook over medium heat, stirring occasionally, until mixture thickens and begins to bubble and peaches are tender, 10 minutes. Remove from heat and stir in butter and vanilla until butter is melted. Pour into a 9x13 inch baking dish.\nIn a medium bowl, combine flour and salt. Blend in lard and shortening with pastry blender until mixture resembles pea-sized crumbs. Combine egg and cold water in a separate bowl and sprinkle mixture over pastry, a little at a time, stirring just until dough comes together. Roll out on a floured surface into a 9x13 inch rectangle. Lay crust over peach mixture.\nBake in preheated oven 50 to 60 minutes, until crust is golden.\n",
        "picture_link": "RNu3Tjy77VPjVpQ3yIgyeN8c1m0emde"
    },
    {
        "title": "Connie's Southern Style Chicken and Dumplings",
        "ingredients": [
            "1 whole chicken, rinsed and giblets removed ADVERTISEMENT",
            "8 cups water ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "4 teaspoons butter ADVERTISEMENT",
            "1 3/4 cups all-purpose flour, or as needed ADVERTISEMENT",
            "1 tablespoon butter (optional) ADVERTISEMENT",
            "1/4 cup evaporated milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the chicken into a large soup pot, and pour in the water. Add salt and 2 tablespoons butter, bring to a boil, and reduce heat to medium-low. Simmer the chicken until the meat is very tender, 2 1/2 to 3 hours. Remove the chicken from the stock, and allow the chicken and stock to cool. Separate the chicken meat from the skin and bones, and chop the meat into bite-size pieces. Strain chicken stock through a wire mesh strainer into a large pot; set aside.\nBring all but 2/3 cup of the reserved chicken stock to a boil over medium heat. In a separate saucepan, bring 2/3 cup of chicken stock to a boil. Stir in 1/2 teaspoon salt and 4 teaspoons of butter, and bring the mixture to a boil over medium heat. Beat in the flour to form a slightly sticky dough.\nRemove dough to a well-floured surface, and roll to desired thickness. Knead in more flour if dough is too sticky. Cut the dough into strips about 4 inches long; drop dumplings into the boiling chicken stock. Reduce heat to low, and simmer the dumplings until tender, about 10 minutes. Stir 1 more tablespoon of butter into the stock to add richness, if desired; return chopped chicken meat to the pan. Stir in evaporated milk; simmer until chicken meat is hot.\n",
        "picture_link": "JDQfo4MYTDuRiCPyHrlGF80QTeamPFy"
    },
    {
        "title": "Dianne's Fish Seasoning",
        "ingredients": [
            "1 tablespoon dried basil ADVERTISEMENT",
            "1 tablespoon dried crushed rosemary ADVERTISEMENT",
            "1 tablespoon dried parsley ADVERTISEMENT",
            "2 teaspoons sea salt ADVERTISEMENT",
            "2 teaspoons ground black pepper ADVERTISEMENT",
            "2 teaspoons ground dried sage ADVERTISEMENT",
            "2 teaspoons dried thyme leaves ADVERTISEMENT",
            "2 teaspoons dried marjoram leaves ADVERTISEMENT",
            "1 teaspoon dried oregano leaves ADVERTISEMENT",
            "1 teaspoon celery salt ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the basil, rosemary, parsley, sea salt, black pepper, sage, thyme, marjoram, oregano, celery salt, and garlic powder in a mixing bowl until evenly blended. Store in an airtight container.\n",
        "picture_link": "tVtvOX7AJFwpTNiz.jzPo8PGgD09FI."
    },
    {
        "title": "Hash Brown Casserole III",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1 (2 pound) package frozen hash browns ADVERTISEMENT",
            "2 cups shredded Colby cheese ADVERTISEMENT",
            "1/4 cup minced onion ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/2 cup beef broth ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 dash garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Coat a large baking dish with 1 tablespoon of butter.\nIn a large bowl, mix together the hash browns, Colby cheese and onion. Transfer to the baking dish.\nIn a medium bowl, mix together the remaining butter, milk, beef broth, pepper, salt and garlic powder. Pour over the hash brown mixture.\nMicrowave the casserole in 5 minute increments, stirring before restarting, until the cheese has melted.\nBake in the preheated oven 20 minutes, or until the surface begins to brown.\n",
        "picture_link": "6F28ZaMP120GAQ0Jy/UOw.j3ZBE9XFy"
    },
    {
        "title": "Rice Pudding II",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "1 cup uncooked white rice ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "4 cups milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan bring water to a boil. Add rice and stir. Reduce heat, cover and simmer for 20 minutes.\nPreheat oven to 325 degrees F (165 degrees C).\nIn a large bowl combine the cooked rice, sugar, eggs and salt. Mix well. Stir in flour, raisins and vanilla. Stir in milk. Pour into 9x13 inch baking dish.\nBake in preheated oven 25 to 30 minutes, until lightly set.\n",
        "picture_link": "SWmq9GLUM9g2PtuCnXg/X7P4IS.QdWu"
    },
    {
        "title": "Fantastic Green Rice Dish",
        "ingredients": [
            "1 cup uncooked white rice ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 small onion, grated ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "1 cup fresh parsley ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 250 degrees F (120 degrees C).\nIn a saucepan bring 2 cups of water to a boil. Add rice and stir. Reduce heat, cover and simmer for 20 minutes.\nTo the cooked rice add cheese, onion, eggs and butter. Mix well and gently stir in parsley and milk. Transfer to a 2 quart casserole dish.\nBake in preheated oven for 1 1/2 hours.\n",
        "picture_link": "11.MNh3CiVH/AwBUwRC/e4JFKzNxGS."
    },
    {
        "title": "Un-Slimy Okra",
        "ingredients": [
            "1/2 pound fresh okra, cut into 1/2 inch slices ADVERTISEMENT",
            "8 cherry tomatoes, halved ADVERTISEMENT",
            "olive oil ADVERTISEMENT",
            "kosher salt and ground black pepper to taste ADVERTISEMENT",
            "garlic powder to taste ADVERTISEMENT",
            "1/2 cup panko bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 425 degrees F (220 degrees C).\nPlace the okra and tomatoes in a bowl. Pour in the olive oil and sprinkle with kosher salt, pepper, and garlic powder. Stir until the vegetables are coated with oil. Add the panko bread crumbs and stir. Spread the vegetables on to a lightly greased baking sheet. Bake for 13 to 15 minutes until the tomatoes are soft and the okra is lightly browned.\n",
        "picture_link": "VXBfrM5gMg0XR1Sh3Y7/mIMuHJqCvZO"
    },
    {
        "title": "Grilled BBQ Meatloaf",
        "ingredients": [
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "1 1/2 pounds ground pork ADVERTISEMENT",
            "2 cups dry bread crumbs ADVERTISEMENT",
            "1 cup finely chopped sweet onion (such as Vidalia®) ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1 teaspoon dried tarragon ADVERTISEMENT",
            "1 teaspoon sea salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 cup barbeque sauce ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium heat, and scrape the grates clean. Spray grates with nonstick cooking spray.\nIn a bowl, mix together the ground beef, ground pork, bread crumbs, onion, egg, Worcestershire sauce, garlic, tarragon, sea salt, and black pepper. Divide the mixture in half, and form 2 loaves, each about 4 inches in diameter and 6 inches long. In a small bowl, mix the barbecue sauce with ketchup until well combined.\nPlace each meatloaf directly on the prepared grill grates, then spread each with about 3 tablespoons of barbecue sauce mixture; grill until the loaves reach an internal temperature of at least 160 degrees F (73 degrees C), about 1 hour.\n",
        "picture_link": "8nyEfPH6h3VOaCuWdWMOdqdCX5g.x0u"
    },
    {
        "title": "Fully Loaded Cauliflower Salad",
        "ingredients": [
            "4 slices bacon ADVERTISEMENT",
            "1 head cauliflower, chopped into bite size pieces ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 cup fat-free sour cream ADVERTISEMENT",
            "1/2 cup reduced-fat mayonnaise ADVERTISEMENT",
            "4 ounces shredded sharp white Cheddar cheese ADVERTISEMENT",
            "4 green onions, chopped ADVERTISEMENT",
            "1 bunch chopped fresh chives ADVERTISEMENT",
            "2 dashes hot pepper sauce (such as Frank's RedHot®) ADVERTISEMENT",
            "1/4 teaspoon paprika ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate. When cool, crumble into bacon bits.\nPreheat an oven to 400 degrees F (200 degrees C). Line a baking sheet with foil.\nCombine the cauliflower, olive oil, garlic, salt, and black pepper in large bowl. Spread the cauliflower on the foil-lined baking sheet, and roast in the preheated oven until the cauliflower is lightly browned, about 15 to 20 minutes. Cool.\nPlace the cooled roasted cauliflower, sour cream, and mayonnaise in a large bowl; stir. Fold in the shredded Cheddar cheese, bacon bits, green onion, chives, pepper sauce, and paprika. Adjust salt and black pepper. Refrigerate for 1 to 2 hours before serving.\n",
        "picture_link": "iqF5K4AFiNTAZu83TYjEeNYjMEoHEN2"
    },
    {
        "title": "Doris's Shrimp Salad",
        "ingredients": [
            "1 pound cooked shrimp - peeled, deveined, and cut into thirds ADVERTISEMENT",
            "1 stalk celery, finely chopped ADVERTISEMENT",
            "1 small onion, minced ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "6 small tomatoes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine shrimp, celery, onion, lemon juice, salt, pepper and one cup mayonnaise in a mixing bowl. Refrigerate and chill the shrimp mixture for at least one hour.\nCut the tops off of the tomatoes and scoop out their insides; chill until the shrimp mixture is well chilled.\nScoop the shrimp mixture into the hollowed out tomatoes. Serve.\n",
        "picture_link": "RUHzb6Ym0N0jjiMAqz/KsBTquXukp02"
    },
    {
        "title": "Chocolate Walnut Pie",
        "ingredients": [
            "3 eggs ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/3 cup margarine ADVERTISEMENT",
            "2 (1 ounce) squares semisweet chocolate ADVERTISEMENT",
            "1 cup corn syrup ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "1 recipe pastry for a 9 inch single crust pie ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the margarine and the chocolate together, stirring until chocolate is smooth. Add eggs, sugar, salt, and syrup. Stir until everything is mixed thoroughly. Stir in walnuts. Pour into unbaked pie shell.\nBake at 375 degrees F (190 degrees C) for 40-50 minutes, or until pie is set. Let sit for 30 minutes before slicing.\n",
        "picture_link": "ZCDs0brO1hoM.LMAMFx4DspTUcZw3ae"
    },
    {
        "title": "Spaghetti Salad II",
        "ingredients": [
            "1 pound spaghetti ADVERTISEMENT",
            "1 tablespoon grated Parmesan cheese ADVERTISEMENT",
            "1 tablespoon sesame seeds ADVERTISEMENT",
            "1 teaspoon poppy seeds ADVERTISEMENT",
            "2 teaspoons seasoning salt ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "1 cucumber, chopped ADVERTISEMENT",
            "1 red onion, chopped ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "1 orange bell pepper, chopped ADVERTISEMENT",
            "2 tomatoes, chopped ADVERTISEMENT",
            "1 head fresh broccoli, chopped ADVERTISEMENT",
            "1 (16 ounce) bottle Italian-style salad dressing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook spaghetti in a large pot with boiling salted water. Rinse with cool water, drain.\nPlace grated Parmesan cheese, sesame and poppy seeds, seasoning salt, paprika, garlic powder, black pepper, cayenne pepper, chopped cucumber, onion, red and yellow pepper, tomatoes, and broccoli in a large bowl.\nTo large bowl add cooled pasta. Pour entire bottle of Italian dressing over pasta and vegetables. Mix well.\nRefrigerate pasta salad for at least 2 hours. Serve.\n",
        "picture_link": "XOCtp9uTySrCowzOODmB3JJtyjt.It6"
    },
    {
        "title": "Chocolate Pecan Sandies",
        "ingredients": [
            "1 cup butter, room temperature ADVERTISEMENT",
            "4 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 3/4 cups sifted all-purpose flour ADVERTISEMENT",
            "1 cup ground pecans ADVERTISEMENT",
            "1/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "1/3 cup sifted confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease baking sheets.\nCream butter and sugar together until light. Beat in the vanilla. Mix in the flour, pecans and cocoa powder.\nForm dough into 1 inch balls and place onto the prepared baking sheets. Bake in the preheated oven for 20 to 25 minutes. Cool, then roll each cookie in confectioners' sugar.\n",
        "picture_link": "sCcNR/Z0un13YqjVj9bKjJUUhmALMmK"
    },
    {
        "title": "Sweet Sourdough Cookies",
        "ingredients": [
            "1 cup sourdough starter ADVERTISEMENT",
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease or line a baking sheet with parchment paper.\nIn a large bowl cream the butter or margarine with the sugar. Beat in the egg and the Sweet Sourdough Starter. Stir in the flour, salt, baking soda, baking powder and vanilla. Mix until smooth.\nDrop dough by teaspoonfuls onto the prepared baking sheets. Bake at 350 degrees F (175 degrees C) for 10 to 12 minutes.\n",
        "picture_link": "vsg41D4OaqT0X8PZnZYRj/wfd0ThxH."
    },
    {
        "title": "Apple Danish Cheesecake",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup ground almonds ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/2 cup butter, chilled ADVERTISEMENT",
            "1/4 teaspoon almond extract ADVERTISEMENT",
            "8 ounces cream cheese, softened ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/4 teaspoon cream of tartar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/3 cup packed brown sugar ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "4 cups thinly sliced apples ADVERTISEMENT",
            "1/3 cup blanched slivered almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To make dough: in a small bowl, combine 1 cup flour, 1/2 cup ground almonds, and 1/4 cup sugar; cut in butter until crumbly. Add extract. Shape dough into a ball, gently press dough against the bottom and up the sides of a 9-inch springform or cake pan. Refrigerate for 30 minutes.\nTo make filling: in a medium-sized mixing bowl, beat cream cheese, 1/4 cup sugar, and cream of tartar until smooth. Add egg; beat on low just until combined. Pour over crust.\nTo make topping: in another medium-sized bowl, combine brown sugar, 1 tablespoon flour, and cinnamon. Add apples and stir until coated. Spoon over the filling. Sprinkle with 1/3 cup slivered almonds.\nBake at 350 degrees F (175 degrees C) for 40-45 minutes or until golden brown. Cool on a wire rack for 10 minutes. Carefully run a knife around edge of pan to loosen; cool 1 hour longer. Refrigerate overnight. Remove from pan.\n",
        "picture_link": "UjEGi8WlpIiA9Ezcn5BtjgO7IHomi8W"
    },
    {
        "title": "Toffee Pie Bars",
        "ingredients": [
            "14 graham crackers ADVERTISEMENT",
            "1 cup unsalted butter ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups chopped pecans ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a jellyroll pan.\nArrange graham crackers side by side on the entire bottom of the jelly roll pan. In a small saucepan, cook the butter and brown sugar, stirring constantly until the sugar is dissolved. Bring to a boil and simmer for one minute. Remove from heat, stir in the vanilla, and pour the entire mixture evenly over the graham crackers. Sprinkle the pecans all over. Bake in the preheated oven for 10 minutes.\nAfter removing cookies from the oven, sprinkle with the chocolate chips. Let stand until completely cool before cutting into bars. For best results, try to cut along the perforations of the graham crackers.\n",
        "picture_link": "bdhW603g9CvF1JAz4.eiUi4PXLzZEbW"
    },
    {
        "title": "Chocolate Peanut Butter Pie I",
        "ingredients": [
            "1 (9 inch) prepared chocolate cookie crumb crust ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "8 (1 ounce) squares semisweet chocolate ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "1 cup smooth peanut butter ADVERTISEMENT",
            "1/3 cup heavy whipping cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt 6 ounces semi sweet chocolate, and cool to room temperature. Beat the eggs with 3/4 cup butter or margarine, chocolate and confectioners' sugar for a FULL 5 minutes. Mixture will be thick and smooth.\nIn a separate bowl, beat the peanut butter, 1/4 cup butter, and cream.\nSpoon chocolate filling into crust. Swirl peanut butter filling into chocolate filling.\nDrizzle remaining 2 oz of melted chocolate on top of pie. Refrigerate for at least 1 hour, and serve.\n",
        "picture_link": "D3CbKa1qPdpjGrjQtMvS/oXTwVoabA6"
    }
]