[
    {
        "title": "Hot Peanut Butter Fudge Topping",
        "ingredients": [
            "1 (12 ounce) can evaporated milk ADVERTISEMENT",
            "3/4 cup peanut butter ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix milk, peanut butter, honey, and brown sugar together in a saucepan over medium-high heat; cook and stir, scraping sides and bottom of saucepan with a rubber spatula, until topping is thickened, 10 to 15 minutes.\n",
        "picture_link": "wCcGsOAeN5GaWiJh9Y/bFGFhuqFjvpC"
    },
    {
        "title": "Black Bean Mango Salsa",
        "ingredients": [
            "1/2 cup diced mango ADVERTISEMENT",
            "1/2 cup diced green bell pepper ADVERTISEMENT",
            "1/2 cup diced yellow bell pepper ADVERTISEMENT",
            "1/2 cup seeded and diced Roma (plum) tomatoes ADVERTISEMENT",
            "1/2 cup corn kernels ADVERTISEMENT",
            "1/2 cup low-sodium black beans, drained and rinsed ADVERTISEMENT",
            "1/3 cup apple cider vinegar ADVERTISEMENT",
            "1/4 cup finely chopped cilantro ADVERTISEMENT",
            "1 jalapeno pepper, minced ADVERTISEMENT",
            "1 lime, zested and juiced ADVERTISEMENT",
            "2 tablespoons diced red onion ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix mango, green bell pepper, yellow bell pepper, tomatoes, corn, black beans, apple cider vinegar, cilantro, jalapeno pepper, lime zest, lime juice, red onion, sugar, and salt together in a bowl.\n",
        "picture_link": "yVslCv3MaBaRvndyfNBaBSE5i6IiyPa"
    },
    {
        "title": "Fiesta Steak Chili",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 pounds beef top round steak, cut into 1/2-inch cubes ADVERTISEMENT",
            "2 teaspoons ground black pepper ADVERTISEMENT",
            "2 yellow onions, diced ADVERTISEMENT",
            "2 tablespoons chopped garlic ADVERTISEMENT",
            "2 green bell pepper, diced ADVERTISEMENT",
            "1 yellow bell pepper, diced ADVERTISEMENT",
            "1 red bell pepper, diced ADVERTISEMENT",
            "3 (14.5 ounce) cans diced tomatoes ADVERTISEMENT",
            "2 (15 ounce) cans kidney beans, drained and rinsed ADVERTISEMENT",
            "2 (15 ounce) cans black beans, drained and rinsed ADVERTISEMENT",
            "1 (15 ounce) can yellow corn, drained ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large pot over medium heat. Cook and stir steak and ground black pepper in hot oil until browned on all sides, 5 to 10 minutes.\nStir onions into beef; saute until onions are translucent, 3 to 4 minutes. Add garlic and cook until fragrant, about 1 minute.\nStir green bell peppers, yellow bell pepper, and red bell pepper into beef mixture one pepper at a time. Cook and stir until fragrant, 3 to 5 minutes.\nPour diced tomatoes, kidney beans, black beans, corn, and tomato sauce into beef-pepper mixture. Bring to a simmer and cook, stirring occasionally, until flavors blend and meat is tender, about 1 hour.\n",
        "picture_link": "HiGtFokpOPUQSDL/AHF2yuqfhlynyW."
    },
    {
        "title": "Pico De Gallo Grilled Cheese Sandwich",
        "ingredients": [
            "Pico de Gallo: ADVERTISEMENT",
            "1 tomato, diced ADVERTISEMENT",
            "1/2 white onion, diced ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro, or to taste (optional) ADVERTISEMENT",
            "1/2 lime, juiced ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "Sandwich: ADVERTISEMENT",
            "3 tablespoons softened butter, or as needed ADVERTISEMENT",
            "10 slices white bread ADVERTISEMENT",
            "10 slices provolone cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix tomato, onion, cilantro, lime juice, salt, and pepper together in a bowl.\nSpread butter onto 1 side of each bread slice. Arrange bread, butter-side down, onto a work surface. Place 1 slice provolone cheese onto each bread slice and spoon pico de gallo onto 5 of the bread-cheese slices. Top each pico de gallo layer with remaining bread-cheese slices, butter-side up.\nHeat a skillet over medium heat. Grill each sandwich in the hot skillet until golden brown and cheese is melted, 3 to 4 minutes per side.\n",
        "picture_link": "V.U0v2vDIkjCqnJqSCJJYcvkhVIXX66"
    },
    {
        "title": "Stan's Seasoned Ketchup",
        "ingredients": [
            "1 (28 ounce) bottle ketchup ADVERTISEMENT",
            "1/4 cup prepared yellow mustard (such as French's®) ADVERTISEMENT",
            "2 tablespoons ground smoked black pepper (such as McCormick® Smokehouse®) ADVERTISEMENT",
            "1 tablespoon dried onion granules ADVERTISEMENT",
            "2 teaspoons hot pepper sauce (such as Tabasco®) ADVERTISEMENT",
            "2 teaspoons granulated garlic ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir ketchup, mustard, smoked pepper, onion granules, hot pepper sauce, and granulated garlic together in a bowl; funnel into a squeezable bottle and refrigerate between uses.\n",
        "picture_link": "NaJNW4IF1iUxlfAqa/1vj0IEtY1yEoy"
    },
    {
        "title": "Orange Almond Pound Cake",
        "ingredients": [
            "3 cups all-purpose flour, sifted ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 pound butter, softened ADVERTISEMENT",
            "3 cups white sugar ADVERTISEMENT",
            "3 ounces marzipan ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "1/3 cup half-and-half ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "1/3 cup orange juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 10-inch tube pan.\nWhisk flour, baking powder, and baking soda together in a bowl.\nBeat butter and sugar together in a bowl until creamy. Add marzipan. Add eggs one at a time, beating well after each addition. Beat half-and-half into butter mixture.\nStir 1 cup of flour mixture into the butter mixture. Stir in milk. Add another 1 cup flour mixture to the butter mixture and stir milk into mixture. Add remaining flour mixture and stir in orange juice. Scrape down the sides of the bowl with a spatula and give batter a final mix. Pour batter into prepared tube pan.\nBake in the preheated oven until a toothpick inserted in the center of the cake comes out clean, about 90 minutes.\nCool cake in the pan for 15 to 20 minutes before turning out onto a wire rack to cool completely.\n",
        "picture_link": "/GNCQrCAZQ/OxnlK89UfQ7uccfSD11."
    },
    {
        "title": "Dairy-Free Peanut Butter and Banana Smoothie",
        "ingredients": [
            "1 cup vanilla-flavored cultured coconut milk ADVERTISEMENT",
            "1 banana, sliced ADVERTISEMENT",
            "2 tablespoons peanut butter ADVERTISEMENT",
            "1 1/2 tablespoons honey ADVERTISEMENT",
            "1/4 cup ice, or as desired ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend coconut milk, banana, peanut butter, and honey in a blender until smooth, about 1 minute. Add ice and blend again until the ice is crushed, 2 to 3 minutes.\n",
        "picture_link": "WiPiG4qF22gHwu/gYH57tcFzAxeXtjy"
    },
    {
        "title": "Mexican Sopes ",
        "ingredients": [
            "1 1/2 cups masa harina (corn flour) ADVERTISEMENT",
            "3 tablespoons flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1/4 cup shortening, melted ADVERTISEMENT",
            "2 cups vegetable oil for frying, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine masa harina, flour, and salt in a bowl. Stir water and egg into the masa mixture; add melted shortening and mix well to form dough.\nGently knead dough until moist but retains shape; transfer to a bowl, cover bowl with plastic wrap, and refrigerate for 1 hour.\nDivide chilled dough into 15 portions. Roll 1 portion of dough into a ball, while keeping remaining dough covered to prevent it from drying. On a lightly floured work surface, pat ball into a 3-inch round. Pinch along the edges of the round to make a ridge. Repeat with remaining dough portions.\nPour enough oil into a skillet to be about 1/2-inch deep; heat to 365 degrees F (185 degrees C). Fry a couple shells in hot oil at a time until crisp, 1 to 2 minutes per side. Remove sopes from oil using a slotted spoon to a plate lined with paper towel. Add more oil as needed and reheat between batches.\n",
        "picture_link": "e6BInkFofk7Q57/3vMMrXpvfGa4fgga"
    },
    {
        "title": "Key Lime Cheesecake Dip",
        "ingredients": [
            "16 ounces cream cheese, softened ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "2 small limes, juiced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat cream cheese and sugar together in a bowl until light and creamy; add milk and beat until smooth.\nStir lime juice into cream cheese mixture. Cover bowl with plastic wrap and refrigerate until chilled, at least 1 hour.\n",
        "picture_link": "Rm6ZNSWcZLKRDebi7KgS4NAbRziq0j2"
    },
    {
        "title": "Dark Chocolate Sea Salt Cookies with Truvia® Baking Blend",
        "ingredients": [
            "1 1/4 cups Gold Medal® all-purpose flour ADVERTISEMENT",
            "1/3 cup unsweetened cocoa powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "3/4 cup butter, softened ADVERTISEMENT",
            "1/2 cup Truvia® Baking Blend ADVERTISEMENT",
            "2 teaspoons vanilla ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup miniature semisweet chocolate chips ADVERTISEMENT",
            "1 tablespoon Truvia® Baking Blend ADVERTISEMENT",
            "3 tablespoons water ADVERTISEMENT",
            "1 teaspoon coarse sea salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 325 degrees F.\nIn medium bowl, mix flour, cocoa and baking soda; set aside.\nIn large bowl, beat butter, 1/2 cup Truvia(R) Baking Blend, vanilla and egg with electric mixer on medium speed, or mix with spoon. Stir in flour mixture. Stir in chocolate chips. Drop dough by rounded tablespoons on ungreased cookie sheet. Press down slightly.\nBake 13 to 15 minutes or just until set. Cool 1 to 2 minutes; remove from cookie sheet to cooling rack. Cool completely, about 15 minutes\nMeanwhile, in small bowl, beat 1 tablespoon Truvia(R) Baking Blend and water. Brush over cookies (discard any remaining water mixture); sprinkle with salt.\n",
        "picture_link": "DGkl1N6N9mcGGkdaSeS/BCjw6dAhmv."
    },
    {
        "title": "Italian Christmas Cookies with Cocoa and Orange Liqueur",
        "ingredients": [
            "Cookies: ADVERTISEMENT",
            "3 1/2 cups all-purpose flour, or as needed ADVERTISEMENT",
            "4 teaspoons baking powder ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 cup cocoa powder ADVERTISEMENT",
            "2 tablespoons orange-flavored liqueur ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "Icing: ADVERTISEMENT",
            "2 cups sifted confectioners' sugar ADVERTISEMENT",
            "2 tablespoons orange-flavored liqueur ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease 2 baking sheets.\nSift flour and baking powder together in a bowl. Beat white sugar and butter together in a separate bowl using an electric mixer until smooth and creamy; beat in eggs. Stir creamed butter mixture, cocoa powder, 2 tablespoons liqueur, and 2 teaspoons vanilla extract into flour mixture until dough is just combined.\nTurn dough onto a lightly floured work surface and knead, adding flour as needed to keep from dough sticking to your hands. Roll dough, 1 to 2 tablespoons per cookie, in your hands and form a log-shape; twirl log into desired shape. Place cookies on the prepared baking sheet.\nBake in the preheated oven until edges of cookies are lightly browned, about 10 minutes.\nStir confectioners' sugar, 2 tablespoons liqueur, water, and 2 teaspoons vanilla extract together in a bowl until icing is creamy. Dip cookies into icing. Place a piece of waxed paper under a wire rack and place cookies on wire rack to cool.\n",
        "picture_link": "dQCfIeT0NntQgx.l7Gb1vtFJuA83U9i"
    },
    {
        "title": "Quick and Easy Chunky Microwave Maple Cinnamon Apple/Pear Sauce",
        "ingredients": [
            "4 Cortland apples - peeled, cored, and chopped ADVERTISEMENT",
            "2 Golden Delicious apples - peeled, cored, and chopped ADVERTISEMENT",
            "2 Bartlett pears - peeled, cored, and chopped ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1 pinch ground nutmeg (optional) ADVERTISEMENT",
            "2 tablespoons maple syrup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine Cortland apples, Golden Delicious apples, and Bartlett pears together in a large, microwave-safe bowl. Add water, cinnamon, and nutmeg to the apple-pear mixture and toss to coat.\nCover bowl tightly with plastic wrap and cut a 1-inch slot in the center of the plastic wrap to allow steam to escape.\nCook apple mixture in the microwave on high for 10 minutes. Carefully remove and discard plastic wrap. Stir apple mixture. Cook in the microwave on high until fruit is hot and tender, another 6 minutes.\nStir maple syrup into fruit mixture. Cool completely before refrigerating.\n",
        "picture_link": "6P7i7nAvx8DkF6A4yy8o10DgVGWNiK6"
    },
    {
        "title": "Spicy Black-Eyed Pea Soup",
        "ingredients": [
            "1 pound bacon, diced ADVERTISEMENT",
            "1 cup chopped white onion ADVERTISEMENT",
            "2 tablespoons diced fresh jalapeno pepper ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "4 (15 ounce) cans black-eyed peas, undrained ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "2 cups canned diced tomatoes ADVERTISEMENT",
            "2 cubes beef bouillon ADVERTISEMENT",
            "3 cups shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook and stir bacon in a stockpot over medium heat until slightly browned, 5 to 10 minutes. Add onion, jalapeno pepper, and garlic; cook until bacon is slightly crisp, 5 to 10 more minutes. Add black-eyed peas, water, tomatoes, and beef bouillon; bring to a low boil.\nReduce heat and simmer, stirring frequently, until flavors have blended, about 30 minutes. Add Cheddar cheese and continue to cook, stirring frequently, until cheese is melted, about 15 minutes.\n",
        "picture_link": "kbOBJ1gwtMqY/2rwGiShwrG1T31/l9u"
    },
    {
        "title": "Gluten-Free Flour Mix",
        "ingredients": [
            "4 cups sweet rice flour ADVERTISEMENT",
            "2 cups tapioca flour ADVERTISEMENT",
            "2 cups cornstarch ADVERTISEMENT",
            "4 tablespoons xanthan gum ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix rice flour, tapioca flour, cornstarch, xanthan gum, salt, and sugar together in a bowl; pour into a sealable container for storage.\n",
        "picture_link": "kpa3aepn9SzxkxXpnoL4qyZUPiNo5yW"
    },
    {
        "title": "Campfire S'Mores Latte",
        "ingredients": [
            "1 fluid ounce brewed espresso ADVERTISEMENT",
            "3 tablespoons marshmallow ice cream topping (such as Smucker's®) ADVERTISEMENT",
            "1 1/2 teaspoons white sugar ADVERTISEMENT",
            "1 1/2 teaspoons cocoa powder ADVERTISEMENT",
            "2/3 cup milk ADVERTISEMENT",
            "1/4 cup whipped cream ADVERTISEMENT",
            "1 tablespoon graham cracker crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour espresso into a mug; stir in marshmallow topping, sugar, and cocoa powder until well blended.\nHeat milk in a saucepan over medium-low heat until lightly boiling, 3 to 5 minutes; remove from heat and froth milk with a frothing wand or a whisk. Pour frothed milk over espresso mixture. Top latte with whipped cream and graham cracker crumbs.\n",
        "picture_link": "dX2l5XQjj6YMuqq09KefrArsobVjVsq"
    },
    {
        "title": "Kahlua® Fruit Dip",
        "ingredients": [
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "1 (3 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup coffee-flavored liqueur (such as Kahlua®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix whipped topping, pudding mix, milk, and coffee-flavored liqueur together in a bowl. Refrigerate dip until set, 1 hour to overnight.\n",
        "picture_link": "v1IObu20FjTqszVSHiqUsgSZlvvyxpS"
    },
    {
        "title": "Chicken Salad Avocado",
        "ingredients": [
            "4 cups green leafy lettuce, or to taste ADVERTISEMENT",
            "1 1/2 cups thinly sliced cooked chicken breast ADVERTISEMENT",
            "1 cup sliced black olives ADVERTISEMENT",
            "1/2 cup thinly sliced green bell pepper ADVERTISEMENT",
            "1/2 cup thinly sliced red bell pepper ADVERTISEMENT",
            "1/4 cup diced red onion ADVERTISEMENT",
            "Dressing: ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1/4 cup red wine vinegar ADVERTISEMENT",
            "1/4 cup fresh lemon juice ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/8 teaspoon chopped garlic, or more to taste ADVERTISEMENT",
            "1 avocado - peeled, pitted, and thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine lettuce, chicken, black olives, green bell pepper, red bell pepper, and red onion together in a bowl; cover with plastic wrap and refrigerate until chilled, about 30 minutes.\nMix oil, red wine vinegar, lemon juice, sugar, salt, pepper, and garlic in a container with lid; cover and shake until well combined. Refrigerate until chilled, about 30 minutes.\nMix avocado into salad. Shake dressing and drizzle over salad; toss lightly.\n",
        "picture_link": "HliIp/Hqn3Dc9kXFAbZt/AkqO9OSSOa"
    },
    {
        "title": "Chocolate Peanut Butter Blossoms",
        "ingredients": [
            "1/2 cup shortening ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/2 cup peanut butter ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 cup white sugar, or as needed ADVERTISEMENT",
            "48 milk chocolate candy kisses (such as Hershey's Kisses®), unwrapped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nBeat shortening, 1/2 cup white sugar, brown sugar, peanut butter, egg, milk, and vanilla extract together in a large bowl with an electric mixer until creamy.\nWhisk flour, baking powder, and salt together in a bowl. Stir flour mixture into peanut butter mixture.\nPour 1/4 cup white sugar into a shallow bowl. Wrap each chocolate kiss in about 1 1/2 teaspoons of dough and shape into a ball. Roll the dough ball in sugar to coat. Place each ball about 1 1/2 inches apart on baking sheets.\nBake cookies in the preheated oven until chocolate softens and cookie is set, about 6 minutes. Flatten cookies immediately by pressing on them with the bottom of a glass.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Strawberry Margarita Pizza",
        "ingredients": [
            "1 (18 ounce) package sugar cookie dough, room temperature ADVERTISEMENT",
            "1 1/2 cups milk, divided ADVERTISEMENT",
            "1 (3.3 ounce) package instant white chocolate pudding mix ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 cup prepared margarita mix ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "1 (10 ounce) package frozen sliced strawberries, thawed ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nPut cookie dough onto a 12-inch pizza pan, rolling to fit to the edges in an even layer.\nBake cookie dough 'crust' in preheated oven until golden brown, 10 to 14 minutes. Cool crust at room temperature until cool enough to handle. Carefully slide spatula under the 'crust' and remove from pan to a large, flat serving platter.\nWhisk 1 cup milk and pudding mix together in a bowl until smooth; put aside until set.\nBeat cream cheese and 1/2 cup milk together in a separate bowl. Add pudding mixture to the cream cheese mixture and stir until smooth; spread evenly over the 'crust.'\nStir margarita mix, sugar, and cornstarch together in a saucepan over medium-high heat; cook and stir until the sugar dissolves completely and the mixture thickens into a syrup. Remove from heat to cool slightly. Stir strawberries into the syrup; pour onto the pizza 'crust' and spread evenly.\nDot the strawberry layer with whipped topping.\n",
        "picture_link": "u2/huZJVtIJYmh3nmL/lTQVdfo15k9q"
    },
    {
        "title": "Easy Pickled Mushrooms",
        "ingredients": [
            "1 onion, thinly sliced ADVERTISEMENT",
            "1/3 cup red wine vinegar ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1 teaspoon Dijon mustard ADVERTISEMENT",
            "2 (12 ounce) cans whole mushrooms, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring onion, vinegar, oil, sugar, and Dijon mustard to a boil in a saucepan. Add mushrooms and simmer until liquid is slightly reduced, 5 to 6 minutes. Transfer mixture to a covered container and chill. Drain before serving.\n",
        "picture_link": "Lv0ZQSbPqlVX0sS8spENuunMKIydm7G"
    },
    {
        "title": "Baked Taro Chips",
        "ingredients": [
            "1 large taro root, peeled and sliced into 1/4-inch disks ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nPlace taro disks in a 1- to 2-inch deep dish. Brush disks evenly with olive oil and sprinkle with salt.\nBake in the preheated oven until tops of chips are crisp, about 15 minutes; flip chips and continue baking until second side is crisp, about 15 more minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chicken Rangoon",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 pinch onion powder, or to taste ADVERTISEMENT",
            "1 pinch garlic powder, or to taste ADVERTISEMENT",
            "1 dash Worcestershire sauce, or to taste ADVERTISEMENT",
            "1 dash soy sauce, or to taste ADVERTISEMENT",
            "1 pinch salt, or to taste ADVERTISEMENT",
            "1 pinch ground black pepper, or to taste ADVERTISEMENT",
            "1 cup chopped cooked chicken ADVERTISEMENT",
            "1 (16 ounce) package wonton wrappers ADVERTISEMENT",
            "peanut oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a deep-fryer or deep, large saucepan to 375 degrees F (190 degrees C).\nStir cream cheese, onion powder, garlic powder, Worcestershire sauce, soy sauce, salt, and pepper together in a bowl. Add chicken and stir until completely incorporated.\nSeparate and place wonton wrappers onto work surface. Spoon about 1 teaspoon of the cream cheese filling onto the center of each wrapper. Use your finger or a pastry brush to lightly moisten the edges of the wonton wrappers with water. Fold one corner of the wrapper over the filling onto the opposite corner to form a triangle. Press the edges together to seal.\nWorking in batches, cook wontons in hot oil until wonton is lightly browned, 2 to 4 minutes. Remove to paper towel-lined plate to drain.\n",
        "picture_link": "4ZFosWxKBolEAtSKS1hTF5HR87xiqTu"
    },
    {
        "title": "Cathy's Pecan Pie",
        "ingredients": [
            "4 eggs ADVERTISEMENT",
            "1 cup corn syrup ADVERTISEMENT",
            "4 (1 gram) packets granulated artificial sweetener ADVERTISEMENT",
            "2 tablespoons dry milk powder ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 1/2 cups chopped pecans ADVERTISEMENT",
            "1 tablespoon wheat germ ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix syrup, sugar substitute and butter in saucepan; bring to rolling boil 3-4 minutes. Beat whole eggs until thick.\nFold in wheat germ and powdered milk. Pour hot syrup into egg mixture.\nSpread pecans in unbaked pie shell. Pour syrup mixture over pecans. Bake 25-30 minutes at 400 degrees F (205 degrees C).\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Almond Melon Tart",
        "ingredients": [
            "1/2 (11 ounce) package pie crust mix ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup ground blanched almonds ADVERTISEMENT",
            "1/2 cup light corn syrup ADVERTISEMENT",
            "1/4 teaspoon almond extract ADVERTISEMENT",
            "1/2 cup soft style cream cheese with pineapple ADVERTISEMENT",
            "1 cantaloupe, peeled and seeded ADVERTISEMENT",
            "1/2 mango, peeled and seeded ADVERTISEMENT",
            "1/4 cup apple jelly ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small mixing bowl combine pie crust mix and 1/4 cup sour cream; stir till moistened. Turn dough onto a generously floured surface. Knead about 12 times, or till dough is firm enough for easy handling. Spray a 10 inch round tart pan with a removable bottom with cooking spray. Press dough evenly onto the bottom and up the sides of the pan.\nIn another bowl beat egg slightly. Stir in almonds, corn syrup, and almond extract. Pour mixture into tart shell, spreading evenly. Bake at 375 degrees F ( 190 degrees C) for 25 to 30 minutes, or till crust is brown and filling set. Cool in pan on a wire rack.\nIn a small mixing bowl, stir together remaining 3/4 cup sour cream and cream cheese. Spread atop the almond mixture.\nUsing a cheese slicer or a vegetable peeler, thinly slice the peeled melon and mango or papaya. Arrange the fruit slices atop the filling. Cover and chill for up to 2 hours.\nBefore serving, melt the apple jelly over medium heat in a small saucepan. Brush onto melon and mango. Cut into squares or wedges, and serve immediately.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sugarless Pumpkin Pie I",
        "ingredients": [
            "1 recipe pastry for a 9 inch single crust pie ADVERTISEMENT",
            "1 cup solid pack pumpkin puree ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "6 packets granulated artificial sweetener ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat egg, sugar substitute and spices until fluffy. Add milk and pumpkin; mix well.\nPour into unbaked 8-inch pie shell. Bake at 350 degrees F for 30 minutes or until inserted knife comes out clean.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Fruit Dip IV",
        "ingredients": [
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "1/2 (12 fluid ounce) can frozen orange juice concentrate, thawed ADVERTISEMENT",
            "1 tablespoon mayonnaise ADVERTISEMENT",
            "1 tablespoon confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, mix the whipped topping, orange juice, mayonnaise and confectioner's sugar. Serve chilled.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sour Cream Raisin Pie III",
        "ingredients": [
            "1 prepared 8 inch pastry shell ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nIn a large bowl, beat eggs lightly. Stir in sugar, salt, and spices. Stir in sour cream and raisins. Pour filling into pastry shell.\nBake for 10 minutes, then reduce heat to 350 degrees F (175 degrees C). Bake for an additional 30 minutes, or until a knife inserted in center comes out dry. Serve warm.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Ice Cream Brandy Punch",
        "ingredients": [
            "2 1/2 cups milk ADVERTISEMENT",
            "1/2 cup brandy ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 pint vanilla ice cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine milk, brandy and egg in a bowl and beat until smooth. Add ice cream (cut into small pieces) and beat until frothy. Serve and enjoy!\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Lemonade Pie II",
        "ingredients": [
            "1 (9 inch) deep dish pie crust, baked and cooled ADVERTISEMENT",
            "1 (6 ounce) can frozen lemonade concentrate, thawed ADVERTISEMENT",
            "1 (8 ounce) can crushed pineapple with juice ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix lemonade, crushed pineapple, and sweetened condensed milk. Fold in whipped topping. Pour filling into pie crust, and freeze. Serve frozen.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Fried Fruit Pies",
        "ingredients": [
            "12 ounces dried apricots ADVERTISEMENT",
            "water to cover ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1 (15 ounce) package frozen prepared pie crusts, thawed ADVERTISEMENT",
            "1/2 cup vegetable oil for frying ADVERTISEMENT",
            "1 tablespoon confectioners' sugar, for dusting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place apricots in a saucepan, and add water to cover. Bring to a boil. Reduce heat to low and simmer for 30 minutes, or until tender. Drain, reserving 5 tablespoons liquid.\nPlace apricots and reserved liquid in a food processor container fitted with steel blade. Process until smooth. Add sugar, butter, and cinnamon; process until blended.\nRoll out one crust on lightly floured surface and cut it into six 4 inch squares. Place 1 tablespoon apricot filling in the center of each square. Fold each square in half diagonally to form a triangle. Press a fork dipped in flour onto the edges to seal, and poke tops to permit steam to escape. Repeat with remaining crust and apricot mixture.\nHeat oil in a large skillet on medium-high heat. Cook triangles, a few at a time, 2 to 3 minutes on each side; fry until the crust is golden brown. Drain on paper towels. Sprinkle with confectioners' sugar.\n",
        "picture_link": "aCIlRs0T9d/OS2lcOrsC2Sd3h8wzbKW"
    },
    {
        "title": "Raspberry Punch",
        "ingredients": [
            "1 (46 fluid ounce) can pineapple juice ADVERTISEMENT",
            "1/2 gallon raspberry sherbet ADVERTISEMENT",
            "1 (2 liter) bottle ginger ale ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour pineapple juice into ice cube trays; freeze until solid, at least 2 hours.\nPlace pineapple cubes in a large punch bowl; add sherbet. Pour ginger ale slowly over pineapple cubes and sherbet and stir.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Traditional Muhammara (Syrian Hot Pepper Dip)",
        "ingredients": [
            "2 sweet bell peppers, seeded and quartered ADVERTISEMENT",
            "3 slices whole wheat bread, crusts removed ADVERTISEMENT",
            "3/4 cup toasted walnuts, chopped ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "2 tablespoons Aleppo pepper ADVERTISEMENT",
            "2 teaspoons pomegranate molasses ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 teaspoon cumin seeds, coarsely ground ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "1 pinch sumac powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Line a baking sheet with aluminum foil.\nPlace the bell peppers with cut sides down onto the prepared baking sheet; roast under the preheated broiler until the skin of the peppers has blackened and blistered, 5 to 8 minutes.\nToast the bread slices in a toaster and let cool; place into a resealable plastic bag, squeeze out air, seal bag, and crush with a rolling pin to make crumbs.\nTransfer peppers to a bowl and tightly seal with plastic wrap. Set aside until the skins of the peppers are loose, about 15 minutes; remove and discard skins. Mash the peeled peppers with a fork.\nCombine mashed peppers, bread crumbs, walnuts, lemon juice, Aleppo pepper, pomegranate molasses, garlic, cumin, and salt in a food processor; pulse the mixture a few times to blend before running at lowest setting. Slowly stream olive oil into the pepper mixture as it blends until integrated completely; transfer mixture to a serving dish. Sprinkle sumac over the mixture to serve.\n",
        "picture_link": "NMIjwjA.4DP5esOR9c8Hm7jQFrytSDC"
    },
    {
        "title": "Orange and Cinnamon Tequila Shot",
        "ingredients": [
            "1 slice orange, seeds removed ADVERTISEMENT",
            "1 pinch ground cinnamon, or more to taste ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger tequila ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place orange slice between forefinger and thumb of left hand. Lick the skin just below thumb of left hand and sprinkle with a pinch of cinnamon. Place shot of tequila in right hand. Lick cinnamon, drink shot, and bite orange slice.\n",
        "picture_link": "AVWSU/0Hy.xL3Sx1XWAgEKt7v1h.cta"
    },
    {
        "title": "Herb Spaetzle",
        "ingredients": [
            "4 cups all-purpose flour ADVERTISEMENT",
            "2 tablespoons dried basil ADVERTISEMENT",
            "1 tablespoon onion powder ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "1 3/4 cups water ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "2 tablespoons salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix flour, basil, and onion powder in a large bowl. Season with salt and black pepper to taste. Make a well in the center of the flour mixture. Whisk eggs and 1 3/4 cups water in another bowl; pour egg mixture into the well and stir until combined. Dough will be thick.\nBring 4 cups water and 2 tablespoons salt to a boil in a wide pot. Place part of the dough into a spaetzle press or potato ricer. Press dough into boiling water; cook and stir until pasta is tender, about 1 minutes. Remove pasta with a slotted spoon to a large bowl. Repeat with remaining dough.\n",
        "picture_link": "/cCECihCxg0l/VIy9nQTdYZPjRNb7Hm"
    },
    {
        "title": "Spicy Chicken Orecchiette",
        "ingredients": [
            "2 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 cup uncooked orecchiette pasta ADVERTISEMENT",
            "1 cup tomato pasta sauce ADVERTISEMENT",
            "1/2 cup broccolini, cut into 1 inch pieces ADVERTISEMENT",
            "1/2 (14.5 ounce) can stewed tomatoes, drained ADVERTISEMENT",
            "1/3 cup sliced portobello mushrooms ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "2 teaspoons crushed red pepper flakes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill for medium heat and lightly oil the grate.\nGrill chicken breast halves until they show dark grill marks and are no longer pink inside, about 5 minutes per side. Let the chicken breasts cool, then place into a bowl and coarsely shred with 2 forks.\nBring a large pot of lightly salted water to a boil. Cook orecchiette pasta in the boiling water, stirring occasionally until cooked through but firm to the bite, 5 to 8 minutes. Drain and return pasta to pot.\nStir chicken breast meat, pasta sauce, broccolini, stewed tomatoes, portobello mushrooms, garlic, and red pepper flakes into the cooked pasta. Place over medium heat and cook, stirring frequently, until the mushrooms and broccolini are cooked through and tender, 5 to 10 minutes.\n",
        "picture_link": "GoIsGBvB5Zaew11IzMcVxf7ldgO.2lW"
    },
    {
        "title": "Pasta Marsala with Feta",
        "ingredients": [
            "1/2 (8 ounce) package penne pasta ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 sweet onion (such as Vidalia®), chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 teaspoons dried basil ADVERTISEMENT",
            "1/2 cup sugar snap peas ADVERTISEMENT",
            "1/3 cup chicken stock ADVERTISEMENT",
            "1/3 cup Marsala wine ADVERTISEMENT",
            "1 splash sweet white wine ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 cup crumbled feta cheese, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with lightly salted water and bring to a boil. Stir in penne and return to a boil. Cook pasta uncovered, stirring occasionally, until cooked through but still firm to the bite, about 11 minutes; drain.\nHeat olive oil in a large skillet over medium heat; cook and stir onion, garlic, and basil in the hot oil until onion is softened, about 5 minutes. Stir snap peas into onion mixture and cook for 2 to 3 minutes. Pour chicken stock, Marsala wine, and white wine into skillet. Add penne pasta; cook and stir until liquid is absorbed, about 5 minutes more. Season with salt and pepper.\nDivide pasta and snap pea mixture into 2 bowls and sprinkle with crumbled feta cheese to serve.\n",
        "picture_link": "tttZZD5behaUETVmKKx892HzES.hmfm"
    },
    {
        "title": "Lemon Chia Fudge",
        "ingredients": [
            "1 cup chocolate chips ADVERTISEMENT",
            "3/4 cup raisins ADVERTISEMENT",
            "2 tablespoons chia seeds ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1/2 cup walnuts, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt chocolate chips in a saucepan over low heat.\nBlend raisins, chia seeds, lemon juice, and vanilla extract in a blender until smooth; stir into the melted chocolate. Fold walnuts into the chocolate mixture; spread into a small glass baking dish, smoothing the top.\nFreeze in freezer until firm but not hardened; cut into squares to serve. Store in freezer.\n",
        "picture_link": "eDYb1/ETwN6jze7nUlbjRZpc8Cr0xPS"
    },
    {
        "title": "Waldorf Salad Nouveau",
        "ingredients": [
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1 pear - peeled, cored, and thinly sliced ADVERTISEMENT",
            "1 crisp apple - peeled, cored, and thinly sliced ADVERTISEMENT",
            "1 Asian pear - peeled, cored, and thinly sliced ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3 cups cold water ADVERTISEMENT",
            "4 large lettuce leaves ADVERTISEMENT",
            "4 sprigs watercress ADVERTISEMENT",
            "4 fresh strawberries, sliced ADVERTISEMENT",
            "1/4 cup low-fat yogurt ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "1 tablespoon apple cider vinegar ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 cup black raisins ADVERTISEMENT",
            "1/4 cup golden raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toast walnuts in a small skillet over medium heat, stirring constantly, until walnuts are fragrant and begin to release oil, 7 to 10 minutes. Set aside to cool thoroughly.\nDissolve 1/2 teaspoon salt in a bowl of cold water; place pear slices, apple slices, and Asian pear in the water, about 5 minutes; drain.\nArrange 1 lettuce leaf, 1 watercress leaf, and 1 sliced strawberry decoratively on top of each other on 4 salad plates.\nWhisk yogurt, mayonnaise, and vinegar together in a small bowl for the dressing; season with salt and black pepper.\nCombine black raisins and golden raisins in a small bowl.\nPlace 3 to 4 slices pear, apple, and Asian pear in fan-shape on each lettuce leaf.\nSprinkle raisins and walnuts, and drizzle dressing over fruit slices.\n",
        "picture_link": "EwBxBfBYqdGGVNoEB2Y.vuW6Su2bLvO"
    },
    {
        "title": "Uli's Onion Bacon Sauce",
        "ingredients": [
            "1 stick butter ADVERTISEMENT",
            "6 ounces thick-cut bacon, diced ADVERTISEMENT",
            "3/4 cup diced sweet onion ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a skillet over medium-high heat. Add bacon; cook, stirring, until almost crisp, 3 to 4 minutes. Stir in onions. Cook, stirring, until bacon is crisp and onions are soft and translucent, 8 to 10 minutes.\n",
        "picture_link": "4Fa/AOk.TiWalP/a/ADlW.qGuxQjPEa"
    },
    {
        "title": "Cauliflower Broccoli Salad",
        "ingredients": [
            "2 heads broccoli, cut into florets ADVERTISEMENT",
            "1 head cauliflower, cut into florets ADVERTISEMENT",
            "1 (20 ounce) package frozen peas, thawed ADVERTISEMENT",
            "2 carrots, thinly sliced ADVERTISEMENT",
            "1 (4 ounce) can sliced black olives ADVERTISEMENT",
            "1 1/2 cups creamy salad dressing (such as Miracle Whip®) ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "2 teaspoons garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place broccoli, cauliflower, peas, carrots, and olives in a large bowl.\nStir creamy salad dressing, sour cream, and garlic powder together in a bowl until well blended.\nStir dressing a spoonful at a time into the broccoli mixture until vegetables are coated.\n",
        "picture_link": "bqw0ClH/ptPH1yOFnk.2tzXx4sbrheu"
    },
    {
        "title": "Garlic Baked Ham",
        "ingredients": [
            "1 (8 pound) ham ADVERTISEMENT",
            "20 cloves garlic, peeled ADVERTISEMENT",
            "10 whole cloves ADVERTISEMENT",
            "1 (6 ounce) can pineapple juice ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "2 teaspoons dry mustard powder ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nRinse ham and pat dry with paper towels; arrange ham cut-side down in a shallow roasting pan.\nMake 20 incisions with the point of a knife all over the ham; stuff one garlic clove into each incision.\nPress whole cloves into the ham.\nCover ham with aluminum foil.\nBake in the preheated oven for 1 hour and 20 minutes.\nWhile ham is baking, mix pineapple juice, brown sugar, dry mustard, and ginger in a bowl.\nRemove foil from ham. Pour pineapple juice glaze over ham.\nReturn ham to oven uncovered and continue baking until glaze thickens, about 45 minutes more. Baste ham every 15 minutes.\nAllow ham to rest 5 to 10 minutes. Remove garlic and whole cloves before slicing.\n",
        "picture_link": "jejKiiUqe49SeHkJen9c6C2yaDFbAda"
    },
    {
        "title": "My Great Grandmother's Ham Croquettes",
        "ingredients": [
            "1/2 pound diced ham ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 tablespoon mayonnaise ADVERTISEMENT",
            "1 cup dry breadcrumbs, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix ham, egg, mayonnaise, and half the breadcrumbs together in a bowl; shape into 6 meatballs. Spread the remaining breadcrumbs onto a plate; roll the balls in the breadcrumbs to coat. Arrange the balls in a baking dish.\nBake in the preheated oven until golden brown, 20 to 25 minutes.\n",
        "picture_link": "uaDKtkpFmCr/vyCo44EyoOtE44kYRqC"
    },
    {
        "title": "Charoses",
        "ingredients": [
            "6 large apples - peeled, cored, and shredded ADVERTISEMENT",
            "1/2 pound pecans, very finely chopped ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon white sugar, or to taste ADVERTISEMENT",
            "1 tablespoon red wine, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir shredded apples, pecans, cinnamon, and sugar together in a bowl until thoroughly combined. Mix in red wine as needed to help the mixture hold together.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pesto Pancakes",
        "ingredients": [
            "3/4 cup baking mix (such as Bisquick ®), or as needed ADVERTISEMENT",
            "1/3 cup water, or as needed ADVERTISEMENT",
            "1 (8 ounce) package Cheddar cheese, shredded ADVERTISEMENT",
            "5 teaspoons prepared pesto ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a greased griddle until drops of water sprinkled on it evaporate noisily.\nStir baking mix, water, Cheddar cheese, and pesto together in a bowl to form a batter; adjust amount of baking mix and water according to your preference.\nPour 1/4 cup batter onto the griddle. Cook until bubbles begin to form on top, 2 to 3 minutes; turn and cook second side to a golden brown color, another 2 to 3 minutes. Repeat until all batter is used.\n",
        "picture_link": "sZZXkbWL8J8Qr.GGTZTtbtieksyiJ2y"
    },
    {
        "title": "Awesome Sauce",
        "ingredients": [
            "3 gallons water ADVERTISEMENT",
            "3 cups white sugar ADVERTISEMENT",
            "1 (16 ounce) can tomato paste (such as Contadina®) ADVERTISEMENT",
            "1 cup dried basil ADVERTISEMENT",
            "1 cup dried minced onion ADVERTISEMENT",
            "1/4 cup dried oregano ADVERTISEMENT",
            "1/4 cup granulated garlic ADVERTISEMENT",
            "1/4 cup salt ADVERTISEMENT",
            "1 1/2 teaspoons cayenne pepper ADVERTISEMENT",
            "1 pork neck ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir water, sugar, tomato paste, basil, minced onion, oregano, granulated garlic, salt, cayenne pepper, and pork neck together in a large pot.\nBring the mixture to a simmer and cook until thickened to desired consistency, about 30 minutes.\nRemove pork neck bones to serve.\n",
        "picture_link": "6wecihcETar7MWM0VhMihTfqRFShtG."
    },
    {
        "title": "Avocado Sushi with Brown Rice",
        "ingredients": [
            "1 cup uncooked short grain brown rice ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 pinch sea salt ADVERTISEMENT",
            "1 tablespoon brown rice vinegar ADVERTISEMENT",
            "1 avocado - peeled, pitted, and thinly sliced ADVERTISEMENT",
            "1/4 red bell pepper, cut into matchsticks ADVERTISEMENT",
            "1/4 cup alfalfa sprouts, or to taste ADVERTISEMENT",
            "4 sheets nori (dry seaweed) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse and drain brown rice, place into a saucepan over medium heat, and pour in water. Stir in sea salt, bring to a boil, and simmer until rice has absorbed the water, about 45 minutes. Let rice cool until warm; stir in brown rice vinegar. Rice will be slightly sticky.\nTo roll the sushi, cover a bamboo sushi rolling mat with plastic wrap. Lay a sheet of nori, rough side up, on the plastic wrap. With wet fingers, firmly pat a thick, even layer of brown rice over the nori, leaving top edge about 1/2-inch deep uncovered with rice. Place 1 or 2 slices of avocado and a small amount of red bell pepper strips and alfalfa sprouts in a line along the bottom edge of the sheet.\nPick up the edge of the bamboo rolling sheet, fold the bottom edge of the sheet up, enclosing the vegetables, and tightly roll the sushi into a thick cylinder. Dampen the bare nori edge with a wet finger and seal the roll. Once the sushi is rolled, wrap it in the mat and gently squeeze to compact it tightly. Let rolls rest for a few minutes before cutting each roll into 6 pieces for serving.\n",
        "picture_link": "O/vQvj9IJKUj7T8C.rxslovVIZA9aAO"
    },
    {
        "title": "New Orleans Steamer",
        "ingredients": [
            "parchment paper ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "2 cups cooked white rice ADVERTISEMENT",
            "1 1/2 teaspoons gumbo file powder ADVERTISEMENT",
            "1 1/2 teaspoons Cajun seasoning ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "2 tomatoes, chopped ADVERTISEMENT",
            "1 red bell pepper, sliced ADVERTISEMENT",
            "1 green bell pepper, sliced ADVERTISEMENT",
            "1 green onion, sliced ADVERTISEMENT",
            "4 fresh okra, chopped (optional) ADVERTISEMENT",
            "1 1/2 teaspoons Cajun seasoning ADVERTISEMENT",
            "1/2 pound crawfish, thawed if frozen ADVERTISEMENT",
            "1/2 pound large shrimp, peeled and deveined ADVERTISEMENT",
            "1/2 pound andouille sausage, sliced ADVERTISEMENT",
            "1 1/2 teaspoons Cajun seasoning ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/4 cup chicken broth ADVERTISEMENT",
            "16 littleneck clams ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spray four 10x20-inch sheets of parchment paper with cooking spray.\nMix cooked rice, file powder, 1 1/2 teaspoons Cajun seasoning, 1/2 teaspoon garlic powder, and 1/2 teaspoon cumin in a bowl. Divide rice mixture evenly over prepared parchment paper.\nToss tomatoes, red bell pepper, green bell pepper, green onion, and okra in a large bowl with 1 1/2 teaspoon Cajun seasoning until well coated. Divide vegetable mixture evenly over rice.\nCombine crawfish, shrimp, andouille sausage, remaining 1 1/2 teaspoons Cajun seasoning, 1/2 teaspoon garlic powder, and 1/2 teaspoon cumin in another bowl. Divide seafood mixture evenly over vegetables. Pour about 1 tablespoon chicken broth over seafood mixture and top each portion with 4 clams.\nFold parchment paper around seafood mixture, sealing edges to form a pouch. Place the pouches on a microwave-safe platter.\nHeat pouches in microwave on high until shrimp are bright pink on the outside and the meat is no longer transparent in the center, about 4 minutes.\n",
        "picture_link": "DSY1qLGRTlhOxNvtvwrQWaUvp4OpqCO"
    },
    {
        "title": "Courtney's Crawfish Chowder",
        "ingredients": [
            "2 cups finely diced potatoes ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "1 cup chopped celery ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "5 bay leaves ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "1/2 cup water, or as needed ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "4 cups half-and-half ADVERTISEMENT",
            "4 teaspoons Cajun seasoning ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 (12 ounce) package cooked and peeled whole crawfish tails ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes, onion, celery, 1/4 cup butter, bay leaves, and thyme in a large saucepan with water. Bring to a boil, reduce heat, and simmer until vegetables are tender, about 20 minutes.\nMelt remaining 1/2 cup butter over medium-low heat. Whisk flour into melted butter for 2 minutes; slowly whisk half-and-half into flour mixture and season with Cajun seasoning, salt, and black pepper. Whisk continuously to prevent boiling until mixture is thickened. Stir in potato mixture and crawfish tails; cook, stirring constantly, until heated through, about 5 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Fenelon Poutine",
        "ingredients": [
            "3 potatoes, cut into fries ADVERTISEMENT",
            "1 quart vegetable oil for frying ADVERTISEMENT",
            "1/2 cup beef gravy, or as needed ADVERTISEMENT",
            "1/2 cup shredded mozzarella cheese, or to taste ADVERTISEMENT",
            "2 tablespoons mayonnaise, or to taste ADVERTISEMENT",
            "1 tablespoon ketchup, or to taste ADVERTISEMENT",
            "1/2 cup shredded lettuce ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C). Fry potatoes in batches in the hot oil until tender and golden brown, about 5 minutes. Remove to drain on a plate lined with paper towels.\nHeat gravy in a small saucepan over medium heat until heated through, about 5 minutes.\nSpread a layer of fries into two bowls, sprinkle with cheese and add a small amount of gravy; repeat these layers once. Squirt each serving with 1 tablespoon mayonnaise and 1 1/2 teaspoons ketchup. Sprinkle each bowl with half the lettuce; season with salt and pepper.\n",
        "picture_link": "CuMdlqoR9aG/zEIQ6/jDCuXlFkZRWny"
    },
    {
        "title": "Sazerac Cocktail",
        "ingredients": [
            "ice ADVERTISEMENT",
            "3 dashes Peychaud's Bitters® ADVERTISEMENT",
            "2 dashes Angostura Bitters® ADVERTISEMENT",
            "1 sugar cube ADVERTISEMENT",
            "1 cup ice cubes ADVERTISEMENT",
            "2 fluid ounces rye whiskey ADVERTISEMENT",
            "1 lemon peel ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a rocks glass with 1 cup ice and set aside to chill, about 5 minutes. Discard ice.\nCombine Peychaud's Bitters, Angostura Bitters and sugar cube in a cocktail shaker; mash well with a cocktail muddler. Add 1 cup ice and whiskey. Stir until chilled and strain into the chilled glass.\nTwist a lemon peel over the surface of the cocktail to extract the essence; discard lemon peel.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Rick's Best Chicken Parmesan",
        "ingredients": [
            "4 skinless, boneless chicken breasts ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup crushed fish-shaped crackers (such as Goldfish®) ADVERTISEMENT",
            "3 tablespoons grated Parmesan cheese, divided ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3/4 cup vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken breasts between 2 sheets of heavy plastic on a solid, level surface. Firmly pound with the smooth side of a meat mallet to 1/2-inch thickness.\nCombine flour, crackers, 1 1/2 tablespoons Parmesan cheese, garlic powder, salt, and pepper in a resealable plastic bag.\nBeat eggs in a shallow bowl. Dip chicken breasts into eggs to coat; place in flour mixture and seal bag. Toss chicken in the flour mixture until well covered.\nHeat oil in a skillet over high heat. Add chicken breasts; cook until underside is browned and crispy, 4 to 5 minutes. Flip; sprinkle 1 teaspoon Parmesan cheese over each chicken breast. Spoon hot oil over cheese until melted. Drain on paper towels for 2 to 3 minutes before serving.\n",
        "picture_link": "bEfdPxcF1K45wKIivSfw8aK1GCJFDOy"
    },
    {
        "title": "The Best Roasted Chicken",
        "ingredients": [
            "1/4 cup butter, softened ADVERTISEMENT",
            "4 cloves garlic, chopped ADVERTISEMENT",
            "1 tablespoon chopped fresh thyme ADVERTISEMENT",
            "1 tablespoon chopped fresh rosemary ADVERTISEMENT",
            "1 lemon, zested and halved ADVERTISEMENT",
            "1 teaspoon salt, divided ADVERTISEMENT",
            "1 teaspoon ground black pepper, divided ADVERTISEMENT",
            "1 whole chicken ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nMix butter, garlic, thyme, rosemary, lemon zest, 1/2 teaspoon salt, and 1/2 teaspoon pepper together in a bowl.\nLoosen skin on chicken breast; rub butter mixture between skin and breast meat. Press on the skin to distribute evenly. Rub oil, remaining 1/2 teaspoon salt, and 1/2 teaspoon pepper all over; place lemon halves inside cavity. Set in a baking pan.\nRoast in the preheated oven, basting after 30 minutes, until chicken is no longer pink, about 1 hour. An instant-read thermometer inserted into the thickest part of the thigh, near the bone, should read 165 degrees F (74 degrees C). Let rest before carving, about 15 minutes.\n",
        "picture_link": "tgqRg7Uxneq429aQ8X16VisbGOP3I9i"
    },
    {
        "title": "Giant Gingersnaps",
        "ingredients": [
            "2 cups flour ADVERTISEMENT",
            "4 teaspoons ground ginger ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1/2 teaspoon ground allspice ADVERTISEMENT",
            "1/4 teaspoon mustard powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon black pepper ADVERTISEMENT",
            "2 sticks butter, at room temperature ADVERTISEMENT",
            "1/2 cup date, coconut, or brown sugar ADVERTISEMENT",
            "1/2 cup raw cane sugar ADVERTISEMENT",
            "1/3 cup date syrup ADVERTISEMENT",
            "1 large egg ADVERTISEMENT",
            "1 tablespoon raw cane sugar, for sprinkling ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Arrange racks in upper and lower thirds of oven. Line 2 baking sheets with parchment paper.\nWhisk together flour, ginger, baking soda, allspice, mustard powder, salt, and pepper in a bowl. Beat together butter, date sugar, and 1/2 cup raw sugar in a separate bowl with an electric mixer at medium speed until light and fluffy, about 3 minutes. Beat in syrup and egg. Reduce mixer speed to low and gradually beat in flour mixture until a soft dough forms. Turn out dough and wrap in plastic wrap; refrigerate 1 hour.\nCut dough into 14 pieces and roll each into a ball between your hands until smooth. Transfer to prepared baking sheets, spacing at least 3 inches apart. Flatten into 2 1/2-inch rounds (about 1/2 inch thick). Sprinkle with remaining tablespoon raw sugar.\nBake, switching positions of sheets halfway through baking, until set, 12 to 15 minutes. Let cool 1 minute on baking sheets, then transfer to a wire rack to cool completely, about 20 minutes.\n",
        "picture_link": "Fbr9x13SbQqZGRKfCdkfggyaZ4ZVGqG"
    },
    {
        "title": "Bacon Avocado Pasta",
        "ingredients": [
            "1 (8 ounce) package bow-tie pasta ADVERTISEMENT",
            "6 slices bacon ADVERTISEMENT",
            "2/3 cup chopped basil ADVERTISEMENT",
            "3 tablespoons lemon juice ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "2 avocados, chopped ADVERTISEMENT",
            "1/2 cup grated Romano cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta; cook, stirring occasionally, until tender yet firm to the bite, about 12 minutes. Drain.\nPlace bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain on paper towels; crumble into small pieces.\nMix basil, lemon juice, olive oil, garlic, pepper, and salt together in a small bowl.\nCombine bacon pieces and avocado in a large bowl. Stir in basil mixture. Add pasta; toss to combine. Sprinkle Romano cheese on top.\n",
        "picture_link": "on7.EBGErK.tXnOdaoEoVGb2HGHGir6"
    },
    {
        "title": "Vegan Cheese Sauce",
        "ingredients": [
            "1/4 cup nutritional yeast ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 pinch garlic powder, or to taste ADVERTISEMENT",
            "1 pinch ground cumin, or to taste ADVERTISEMENT",
            "1 cup water, or more as needed ADVERTISEMENT",
            "2 tablespoons margarine ADVERTISEMENT",
            "1 1/2 cups salsa ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine nutritional yeast, flour, paprika, salt, garlic powder, and cumin in a saucepan; add water. Whisk constantly over medium heat until thick and bubbly, about 5 minutes; remove from heat.\nStir margarine into the yeast mixture until melted. Mix in salsa.\nCook and stir over low heat until tomatoes are warmed through, about 5 minutes.\n",
        "picture_link": "Y1qv2QMD2/gvJFUJK07bBPEhSZYDJnK"
    },
    {
        "title": "The Sriracha Chicken Marinade",
        "ingredients": [
            "1 3/4 cups sriracha sauce (such as Huy Fong Foods®) ADVERTISEMENT",
            "1 1/4 cups apple cider vinegar ADVERTISEMENT",
            "3 tablespoons maple syrup ADVERTISEMENT",
            "1/2 teaspoon ghost pepper hot sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix sriracha sauce, apple cider vinegar, maple syrup, and hot sauce together in a large bowl or bottle.\n",
        "picture_link": "YmIJnZwwXES3zD/BmF06lioTLa3P7ty"
    },
    {
        "title": "Graduation Pasta Salad",
        "ingredients": [
            "1 (16 ounce) package tri-color rotini pasta ADVERTISEMENT",
            "3 1/2 tablespoons lemon juice ADVERTISEMENT",
            "2 1/2 tablespoons canola oil ADVERTISEMENT",
            "3/4 cup mayonnaise ADVERTISEMENT",
            "2 1/2 tablespoons seasoned salt (such as LAWRY'S®) ADVERTISEMENT",
            "1 1/4 teaspoons flavor enhancer (such as Accent®) ADVERTISEMENT",
            "2 cucumbers, seeded and diced ADVERTISEMENT",
            "2 tomatoes, seeded and diced ADVERTISEMENT",
            "1 (5 ounce) jar sliced pimento-stuffed green olives ADVERTISEMENT",
            "1 (3 ounce) can chopped black olives ADVERTISEMENT",
            "1/4 cup chopped green bell pepper ADVERTISEMENT",
            "1/4 cup chopped green onions ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil; cook rotini pasta at a boil until tender yet firm to the bite, about 8 minutes. Drain and rinse; transfer to a large bowl.\nWhisk lemon juice and canola oil together in a small bowl. Stir in mayonnaise, seasoned salt, and flavor enhancer. Pour over pasta and toss to coat.\nRefrigerate pasta mixture, tossing occasionally, until flavors combine, 8 hours to overnight.\nBring pasta mixture to room temperature, about 1 hour. Stir in cucumbers, tomatoes, green olives, black olives, green bell pepper, and green onions; toss to distribute evenly.\n",
        "picture_link": "I0cJvTVwww8ukw2ENv66yYmmXSoKVaW"
    },
    {
        "title": "Abbey's Best Roast Chicken",
        "ingredients": [
            "1 whole chicken, giblets removed ADVERTISEMENT",
            "3 tablespoons Himalayan pink salt ADVERTISEMENT",
            "1 1/2 tablespoons ground black pepper, divided ADVERTISEMENT",
            "3 stalks celery, halved ADVERTISEMENT",
            "1 tablespoon olive oil, or to taste ADVERTISEMENT",
            "1 tablespoon kosher sea salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nPlace chicken in a large baking dish. Spread pink salt and 1 tablespoon pepper evenly inside the cavity. Stuff the cavity with celery.\nCoat chicken skin with olive oil. Sprinkle with remaining pepper and kosher salt.\nRoast in the preheated oven until the juices run clear and an instant-read thermometer inserted into the thickest part of the thigh, near the bone, reads 165 degrees F (74 degrees C), about 1 1/2 hours.\nCover chicken with aluminum foil and allow to rest for 10 minutes before serving.\n",
        "picture_link": "57sa58reBFIIt2ol9ktg.SXFr928rci"
    },
    {
        "title": "Healthy Steak Stir-Fry",
        "ingredients": [
            "1 tablespoon steak sauce ADVERTISEMENT",
            "1 tablespoon reduced-sodium soy sauce ADVERTISEMENT",
            "1 tablespoon rice wine vinegar ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1 tablespoon sesame oil, or to taste ADVERTISEMENT",
            "1/4 cup sliced onion ADVERTISEMENT",
            "1 tablespoon minced fresh ginger root ADVERTISEMENT",
            "1 (4 ounce) boneless beef sirloin steak, thinly sliced ADVERTISEMENT",
            "1/2 cup broccoli florets ADVERTISEMENT",
            "1/2 cup sliced fresh mushrooms ADVERTISEMENT",
            "1 clove garlic, minced (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix steak sauce, soy sauce, rice wine vinegar, and brown sugar together in a bowl until sauce is smooth.\nHeat sesame oil in a wok or large skillet over high heat; saute onion and ginger over medium-high heat until onion is lightly browned, 2 to 3 minutes. Add steak, broccoli, mushrooms, and garlic; cook, stirring occasionally, until steak is cooked through and vegetables are soft, about 8 minutes.\nPour sauce over steak mixture; cook and stir until evenly coated, about 2 minutes.\n",
        "picture_link": "F9UoVlpP31he3UnCsUKb2l/O1OTdIzq"
    },
    {
        "title": "Slow-Cooked Chicken and Sausage Gumbo",
        "ingredients": [
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1/3 cup all-purpose flour ADVERTISEMENT",
            "1 (19 ounce) package mild Italian sausage, cut into bite-size pieces ADVERTISEMENT",
            "4 chicken thighs, cut into bite-size pieces ADVERTISEMENT",
            "1 (14 ounce) can diced tomatoes ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1 yellow bell pepper, diced ADVERTISEMENT",
            "2 stalks celery, diced ADVERTISEMENT",
            "1 jalapeno pepper, finely chopped ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon ground paprika ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "2 cups chicken broth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large saucepan over medium heat. Add flour; cook and stir until a golden brown paste forms, about 10 minutes.\nHeat a large skillet over medium heat. Add sausage; cook and stir until golden brown, 8 to 10 minutes. Transfer to a slow cooker.\nPlace chicken thighs in the same skillet; cook and stir until no longer pink, about 5 minutes. Transfer chicken thighs to the slow cooker.\nStir diced tomatoes, onion, yellow bell pepper, celery, jalapeno pepper, and minced garlic into the slow cooker. Add flour paste, garlic powder, paprika, onion powder, pepper, and oregano. Stir in chicken broth.\nCook on Low until flavors combine, 6 to 8 hours.\n",
        "picture_link": "gGa/YIPJiRGttI2hBbbz1eqwwo9wDKm"
    },
    {
        "title": "Edible Cookie Dough",
        "ingredients": [
            "3/4 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1/2 cup milk chocolate chips ADVERTISEMENT",
            "1/2 cup mini chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine brown sugar and butter in a large bowl; beat with an electric mixer until creamy. Beat in vanilla extract and salt. Add flour; mix until a crumbly dough forms. Mix in milk. Fold in milk chocolate chips and mini chocolate chips.\n",
        "picture_link": "uWdbpaZg.qOxMRTrV2k/vudOcY2M422"
    },
    {
        "title": "Apple Bread Pudding",
        "ingredients": [
            "1 (14 ounce) wide loaf French bread, crust removed and bread cut into 2x1-inch cubes ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 apples - peeled, quartered, cored, sliced crosswise into 1/4-inch thick pieces ADVERTISEMENT",
            "1 cup muscovado or packed brown sugar, plus more for garnish ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "4 large eggs ADVERTISEMENT",
            "2 large egg yolks ADVERTISEMENT",
            "3 cups milk ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease a 9x13-inch baking dish.\nSpread bread cubes on a baking sheet and bake until crisp, about 20 minutes.\nMeanwhile, melt butter in a skillet over medium heat. Saute apples until tender, 7 minutes, then transfer to prepared baking dish along with bread. Toss to combine.\nWhisk together sugar, cinnamon, and salt in a large bowl. Whisk in whole eggs and yolks until well combined, then whisk in milk, cream, and vanilla. Pour mixture evenly over bread mixture. Let stand, covered, 45 minutes at room temperature.\nPreheat oven to 325 degrees F (165 degrees C).\nBake pudding until bread has absorbed custard and is set, about 50 minutes.\n",
        "picture_link": "WV/u1E8ksZ19irOKWLrAQzwzEi5MxHa"
    },
    {
        "title": "Black-Eyed Pea Cabbage Salad",
        "ingredients": [
            "1/2 cup dried black-eyed peas ADVERTISEMENT",
            "1 1/2 cups shredded cabbage ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1/4 cup finely sliced green onions ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place black-eyed peas in a large container and cover with at least 2 inches of cool water; let soak, 8 hours to overnight.\nTransfer black-eyed peas and water to a pot; bring to a boil. Reduce heat to low and simmer until tender, 15 to 20 minutes. Drain and let cool, about 15 minutes.\nCombine black-eyed peas, cabbage, olive oil, green onions, lemon juice, parsley, salt, and pepper in a large bowl. Chill for at least 1 hour before serving.\n",
        "picture_link": "etiOv25HF6XGgF4IX14NxLZ23wBj0yK"
    },
    {
        "title": "Kickin' Vegetarian Collard Greens",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 large onion, halved and thinly sliced ADVERTISEMENT",
            "4 cloves garlic, thinly sliced ADVERTISEMENT",
            "2 sprigs fresh thyme, leaves stripped ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "2 (14 ounce) cans chopped tomatoes ADVERTISEMENT",
            "1 cup vegetable broth ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1 tablespoon molasses ADVERTISEMENT",
            "1 tablespoon liquid smoke flavoring ADVERTISEMENT",
            "2 pounds collard greens, chopped ADVERTISEMENT",
            "1 1/2 cups cooked white beans (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil and butter in a large pot over medium heat until butter melts and starts to brown, 1 to 2 minutes. Add onion and garlic; cook and stir until onion turns translucent, about 5 minutes. Stir in thyme and bay leaves.\nPour chopped tomatoes, vegetable broth, brown sugar, molasses, and liquid smoke into the pot; bring to a simmer. Stir in collard greens gently. Reduce heat to low and simmer, covered, until tender, about 30 minutes.\n",
        "picture_link": "rKhEST5Q7dy.TGa.eSISER4miRZDjyq"
    },
    {
        "title": "Leftover Roast Beef Hash",
        "ingredients": [
            "3 russet potatoes ADVERTISEMENT",
            "2 cups 1/2-inch cubes roast beef ADVERTISEMENT",
            "1 onion, finely chopped ADVERTISEMENT",
            "1 green bell pepper, thinly sliced ADVERTISEMENT",
            "1/2 cup sliced fresh mushrooms ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes on a microwave-safe plate and prick skins with a fork. Cook in the microwave until slightly tender, 7 to 8 minutes. Cut into 1-inch cubes.\nCombine potatoes, roast beef, onion, green bell pepper, and mushrooms in a bowl.\nPreheat an electric skillet to 350 degrees F (175 degrees C). Coat with oil.\nSpread potato mixture evenly in the skillet. Let cook, without stirring, until browned, about 5 minutes. Flip and continue cooking until second side is crisp, about 5 minutes more.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "4-Ingredient Slow Cooker Pulled Pork",
        "ingredients": [
            "2 1/2 pounds boneless center-cut pork loin ADVERTISEMENT",
            "1/2 cup salsa ADVERTISEMENT",
            "2 tablespoons chipotle peppers in adobo sauce ADVERTISEMENT",
            "water to cover ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place pork loin, salsa, and chipotle peppers in a slow cooker. Pour in enough water to cover the pork halfway.\nCook on High until pork is very tender, 4 to 5 hours.\nTransfer to a cutting board; shred with a fork and knife.\n",
        "picture_link": "sjTXhKGXAD1wwxBGGiV4RjSvrO378by"
    },
    {
        "title": "Chopped Steak",
        "ingredients": [
            "1 1/2 pounds lean ground beef ADVERTISEMENT",
            "2 tablespoons sea salt ADVERTISEMENT",
            "1 tablespoon coarsely ground black pepper ADVERTISEMENT",
            "2 teaspoons garlic powder ADVERTISEMENT",
            "1 teaspoon dried rosemary ADVERTISEMENT",
            "1 teaspoon mustard ADVERTISEMENT",
            "1/2 teaspoon ground paprika ADVERTISEMENT",
            "1/2 teaspoon dill weed ADVERTISEMENT",
            "1/2 large white onion, finely chopped ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "3/4 cup finely crushed unsalted saltine crackers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ground beef into a large bowl and break into smaller pieces. Cover with salt, black pepper, garlic powder, rosemary, mustard, paprika, and dill weed; knead thoroughly. Knead in onion, egg, and Worcestershire sauce. Mix in crackers until thoroughly incorporated.\nShape beef mixture into 5-ounce, 1/2-inch thick patties.\nPreheat a grill pan over medium heat. Grill patties until an instant-read thermometer into the center reads 165 degrees F (74 degrees C), 5 to 7 minutes per side.\n",
        "picture_link": "41rVfoo0Jr5K3zM04FiB6HPMBx9rc0W"
    },
    {
        "title": "Chocolate Coffee Oatmeal",
        "ingredients": [
            "1/4 cup rolled oats ADVERTISEMENT",
            "1 tablespoon chia seeds ADVERTISEMENT",
            "3/4 cup freshly brewed coffee ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "2 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1 tablespoon maple syrup, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine oats and chia seeds in a microwave-safe bowl. Stir in coffee. Let stand for 2 minutes.\nCook oats in the microwave until tender, about 2 minutes. Stir in milk, cocoa powder, and maple syrup.\n",
        "picture_link": "nCi2MB5XbEl60vM5bQXlp1rr4TiaE.W"
    },
    {
        "title": "Cinnamon Apple and Banana \"Granolameal\"",
        "ingredients": [
            "1 apple - peeled, cored, and chopped ADVERTISEMENT",
            "2 bananas, sliced ADVERTISEMENT",
            "1/2 cup granola ADVERTISEMENT",
            "1/3 cup ground cinnamon, or to taste ADVERTISEMENT",
            "1 teaspoon white sugar (optional) ADVERTISEMENT",
            "1 teaspoon unsweetened cocoa powder (optional) ADVERTISEMENT",
            "1 teaspoon butter (optional) ADVERTISEMENT",
            "1 tablespoon almond milk, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place apple, bananas, granola, cinnamon, sugar, and cocoa powder in a container with a lid. Cover and shake until combined.\nMelt butter in a skillet over medium-high heat. Add apple mixture; increase heat slightly and cook, stirring constantly, until cinnamon starts to darken and turn into a paste, 2 to 3 minutes. Stir in milk.\nReduce heat to medium; cook, covered, until flavors combine, about 1 minute. Uncover and stir. Cover and simmer for 1 minute more. Remove from heat and stir.\n",
        "picture_link": "U17XumFDk.ZP5nw/IJ5CRpGZUX9aYoS"
    },
    {
        "title": "Sekanjabin (Iranian Mint Vinegar Syrup)",
        "ingredients": [
            "8 cups orange blossom honey ADVERTISEMENT",
            "5 cups water ADVERTISEMENT",
            "2 cups white wine vinegar ADVERTISEMENT",
            "12 large sprigs fresh mint ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir honey and water together in a pot; bring to a boil and stir constantly until honey dissolves. Add vinegar, reduce heat to low, and simmer until syrup flavors combine, about 20 minutes. Remove from heat.\nSubmerge mint in hot syrup and cool to room temperature. Remove and discard mint. Chill in the refrigerator.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cucumber Raita with Mint",
        "ingredients": [
            "1/2 teaspoon cumin seeds ADVERTISEMENT",
            "2 1/2 cups plain yogurt ADVERTISEMENT",
            "1 cucumber, peeled and thinly sliced ADVERTISEMENT",
            "2 tablespoons chopped fresh mint ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a small, heavy skillet over medium heat. Toast cumin seeds in hot skillet until darkened and fragrant, about 5 minutes; pour into a wide bowl to cool.\nGrind cumin seeds in a mortar and pestle into a fine powder.\nPut yogurt in a bowl and beat lightly with a fork or whisk until smooth and creamy.\nStir toasted cumin seeds, cucumber, mint, salt, and cayenne pepper into the yogurt; season with black pepper.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Samosa Pot Pie",
        "ingredients": [
            "3 tablespoons salted butter ADVERTISEMENT",
            "1 large sweet onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon salt, divided ADVERTISEMENT",
            "1/2 teaspoon ground black pepper, divided ADVERTISEMENT",
            "1 1/2 cups chopped carrots ADVERTISEMENT",
            "4 cups chopped yellow potatoes ADVERTISEMENT",
            "1 cup whole milk ADVERTISEMENT",
            "1 cup half-and-half ADVERTISEMENT",
            "1 tablespoon ground coriander ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "2 teaspoons curry powder ADVERTISEMENT",
            "2 teaspoons garam masala ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1 1/2 cups frozen peas ADVERTISEMENT",
            "1 sheet frozen puff pastry ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nMelt butter in a large stockpot over medium heat. Cook and stir sweet onion, garlic, 1/2 teaspoon salt, and 1/4 teaspoon black pepper in hot butter until onion is translucent, about 10 minutes.\nStir carrots into the onion mixture; continue cooking and stirring until the carrot is slightly softened, about 5 minutes more. Add potatoes; stir.\nMix milk, half-and-half, 1/2 teaspoon salt, 1/4 teaspoon pepper, coriander, cumin, curry powder, garam masala, and ginger together in a bowl until the spices are dissolved into the liquid; pour over the vegetable mixture in the pot. Bring the mixture to a boil. Stir peas into the boiling mixture; cook until peas are warmed, 2 to 3 minutes. Pour contents of pot into a 13x9-inch baking dish.\nCut frozen puff pasty lengthwise into 3 even pieces; arrange atop the vegetable mixture.\nBake in preheated oven until the pastry is puffed and golden brown and the vegetables are tender, about 40 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Mashed Potato Souffle",
        "ingredients": [
            "1 teaspoon butter, or as needed ADVERTISEMENT",
            "5 potatoes, peeled and cut into large chunks ADVERTISEMENT",
            "1 cup light cream ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 dash hot pepper sauce (such as Tabasco®), or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 cup chopped scallions ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a baking dish with butter.\nPlace potatoes into a large pot; add enough water to cover and bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes; drain.\nWhip potatoes, cream, cream cheese, and egg together in a large bowl; season with hot sauce, salt, and pepper. Fold scallions into the potato mixture and transfer to the prepared baking dish.\nBake in the preheated oven until heated through and fluffy, about 45 minutes.\n",
        "picture_link": "GwCW0mkIx7AynC3ui9fHiIKTiJk01XG"
    },
    {
        "title": "Marianne's Hot Dish",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1/2 onion, minced ADVERTISEMENT",
            "3 large cloves garlic, minced ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 (8 ounce) package sliced fresh mushrooms ADVERTISEMENT",
            "1 (8 ounce) package fresh sugar snap peas ADVERTISEMENT",
            "5 slices American cheese, or more to taste ADVERTISEMENT",
            "1 1/2 cups frozen diced southern-style hash brown potatoes, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nHeat a large skillet over medium-high heat. Cook and stir beef, onion, and garlic in the hot skillet until browned and crumbly, 5 to 7 minutes. Transfer ground beef mixture, using a slotted spoon, to a 2-quart casserole dish; retain drippings in the skillet.\nSpread cream of mushroom soup over ground beef mixture.\nCook and stir mushrooms in the beef drippings over medium heat until tender and browned, 5 to 10 minutes; spread over soup layer in casserole dish.\nArrange snap peas over mushroom layer; cover with American cheese slices. Layer potatoes over cheese.\nBake in the preheated oven until cheese is melted and potatoes are browned and crisp, about 1 hour.\n",
        "picture_link": "GGGb0YyhZeijBUimy.3Ix6KsrrgOiCq"
    },
    {
        "title": "Crab Salad Sandwich",
        "ingredients": [
            "1/2 cup chopped crab meat ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "1 English muffin, split and toasted ADVERTISEMENT",
            "sea salt to taste ADVERTISEMENT",
            "2 tablespoons shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Set oven rack about 6 inches from the heat source and preheat the oven's broiler.\nMix crab meat and mayonnaise together in a bowl; spread onto each English muffin half. Sprinkle each crab meat layer with sea salt and Cheddar cheese. Place English muffins on a baking sheet.\nBroil in the preheated oven until cheese is melted and bubbling, 3 to 5 minutes.\n",
        "picture_link": "3ER88xPs9EnlnHFq5KW/4ujt.ePXQYe"
    },
    {
        "title": "Peach and Cranberry Muffins",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 1/4 cups applesauce ADVERTISEMENT",
            "3 eggs, lightly beaten ADVERTISEMENT",
            "2 cups peeled, pitted, and chopped peaches ADVERTISEMENT",
            "1 1/2 (12 ounce) packages fresh cranberries ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease 24 muffin cups or line with paper muffin liners.\nWhisk 3 cups flour, cinnamon, baking soda, and salt together in a large bowl. Stir white sugar, applesauce, and eggs together in another bowl. Add sugar mixture to flour mixture and stir until batter is just combined. Fold peaches and cranberries into batter. Spoon batter into prepared muffin cups.\nStir brown sugar and 2 tablespoons flour together in a small bowl. Sprinkle brown sugar mixture over the tops of the muffins.\nBake in the preheated oven until a toothpick inserted into the center of a muffin comes out clean, about 25 minutes. Cool for 10 minutes before transferring muffins to a wire rack to cool completely.\n",
        "picture_link": "GqzjnWGbnTl1GBE2r55PZXpGql.TORu"
    },
    {
        "title": "Easy Onion Jam",
        "ingredients": [
            "1 tablespoon olive oil, or as needed ADVERTISEMENT",
            "2 onions, coarsely chopped ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/4 cup balsamic vinegar ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a saucepan over medium-high heat. Saute onion in hot oil until soft and caramelized, 10 to 12 minutes. Add water, balsamic vinegar, and brown sugar; stir until sugar is dissolved and mixture is simmering. Reduce heat to low and cook until mixture thickens and reaches desired consistency, about 30 minutes.\n",
        "picture_link": "YioH5FWpnZbfCRHUMH4RgNb27hVETXG"
    },
    {
        "title": "Eastern-Style Mulligatawny Soup",
        "ingredients": [
            "water to cover ADVERTISEMENT",
            "1 cup dried split peas ADVERTISEMENT",
            "4 cups water, or more as needed ADVERTISEMENT",
            "3/4 teaspoon ground turmeric ADVERTISEMENT",
            "1/2 teaspoon ground dried chile pepper ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "2 tablespoons tomato paste ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1/2 teaspoon minced garlic ADVERTISEMENT",
            "1/2 teaspoon cumin seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour enough water over split peas in a large bowl to cover by at least 1 inch; soak at least 30 minutes.\nDrain split peas and transfer to a large pot. Pour 4 cups water over the split peas. Stir turmeric, ground dried chile pepper, and salt into the water; bring to a boil, reduce heat to medium-low, and simmer, adding more water as needed to thin, until split peas are tender, 30 to 40 minutes.\nStir lemon juice and tomato paste into the split pea mixture; increase heat to medium and cook until the mixture thickens, about 10 minutes more.\nHeat vegetable oil in a small saucepan over medium heat. Fry garlic and cumin seeds in hot oil until the garlic browns, about 5 minutes; stir into the soup.\n",
        "picture_link": "Yl1Ta46aSJvVjXU8ESYiNnQ2V13Eywm"
    },
    {
        "title": "Homemade Coffee Creamer (Chocolate-Caramel)",
        "ingredients": [
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "14 ounces heavy whipping cream ADVERTISEMENT",
            "3 tablespoons chocolate syrup ADVERTISEMENT",
            "3 tablespoons caramel syrup ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour sweetened condensed milk, cream, chocolate syrup, caramel syrup, and vanilla extract in a sealable container. Seal the container and shake until mixture is completely combined. Store in the refrigerator.\n",
        "picture_link": "cXHMewT8wqqkZFtOEf4c9J8CUO6h2k6"
    },
    {
        "title": "My Jambalaya",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "2 Polish sausages, halved lengthwise and cut into 1/4-inch thick pieces ADVERTISEMENT",
            "1 large onion, diced ADVERTISEMENT",
            "6 cloves garlic, finely chopped ADVERTISEMENT",
            "3 green bell peppers, seeded and diced ADVERTISEMENT",
            "2 zucchini, chopped, or to taste ADVERTISEMENT",
            "1 (14 ounce) can crushed tomatoes ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1/2 cup rice ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce, or to taste ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1 pound chopped cooked chicken breast ADVERTISEMENT",
            "1 pound peeled cooked shrimp ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil and butter together in a large saucepan over medium heat; cook and stir sausage and onion until onion starts to brown, about 10 minutes. Add garlic; cook and stir until fragrant, 1 to 2 minutes.\nMix green bell peppers, zucchini, tomatoes, chicken broth, rice, Worcestershire sauce, and bay leaf into onion-sausage mixture; bring to a boil. Reduce heat and simmer until rice is tender and mixture is thickened, about 15 minutes.\nStir chicken and shrimp into tomato-sausage mixture; simmer until chicken and shrimp are heated through, 1 to 2 minutes.\n",
        "picture_link": "mF2ZCAPlez/cjPaaGXS.TAki0cNHBpq"
    },
    {
        "title": "Zucchini Bread with Truvia® Baking Blend",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "3 whole eggs ADVERTISEMENT",
            "1 cup Truvia® Baking Blend ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "2 cups coarsely grated zucchini, loosely packed ADVERTISEMENT",
            "1/2 cup pecans, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F.\nSpray two 8 x 4 bread pans with non-stick cooking spray.\nIn a large bowl, beat eggs until frothy. Gradually add Truvia(R) Baking Blend, oil, and vanilla. Beat until thick and yellow colored. Stir in zucchini.\nIn a medium bowl, whisk together flour, cinnamon, baking soda, baking powder, and salt.\nStir dry mixture into the wet mixture. Add chopped pecans (optional).\nPour batter into pans and level.\nBake for 1 hour or until a toothpick inserted in the center comes out clean.\nCool for 10 minutes and remove to a wire rack to complete cooling.\n",
        "picture_link": "hAhjnLbuN5AlwM7I6kw7VjPF6DTRUQq"
    },
    {
        "title": "Simple Greek Yogurt Egg Salad",
        "ingredients": [
            "1/4 cup Greek yogurt ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "8 hard-boiled eggs, peeled and chopped ADVERTISEMENT",
            "1/4 cup chopped celery ADVERTISEMENT",
            "1/4 cup chopped green onion ADVERTISEMENT",
            "2 tablespoons sweet pickle relish ADVERTISEMENT",
            "2 tablespoons yellow mustard ADVERTISEMENT",
            "1/4 teaspoon dill weed ADVERTISEMENT",
            "1/4 teaspoon paprika ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk yogurt and brown sugar together in a bowl. Add eggs, celery, green onion, relish, mustard, dill, paprika, and black pepper; mix well.\n",
        "picture_link": "xcFxonMCQooENT8rOlNiWNt9it7Msda"
    },
    {
        "title": "Citrus Asada Fajitas",
        "ingredients": [
            "2 oranges, juiced ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "1 chipotle chile pepper, minced ADVERTISEMENT",
            "1/2 teaspoon sea salt ADVERTISEMENT",
            "1 pound skirt steak ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk orange juice, cumin, chile pepper, and sea salt together in a bowl and pour into a resealable plastic bag. Add the steak, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator for 24 hours.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate. Remove steak from marinade and discard marinade.\nCook the steak until it starts to firm and is reddish-pink and juicy in the center, 3 to 4 minutes per side. An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C).\n",
        "picture_link": "bHNNIIoziprm6vWVPlkhChM6qYr79CS"
    },
    {
        "title": "Banana Teff Waffles (Gluten-Free and Soy-Free)",
        "ingredients": [
            "1 cup brown rice flour ADVERTISEMENT",
            "1/2 cup teff flour ADVERTISEMENT",
            "1/2 cup finely chopped California walnuts ADVERTISEMENT",
            "1/4 cup sweet rice flour ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "2 bananas, mashed ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/2 cup yogurt ADVERTISEMENT",
            "3 tablespoons oil ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat and lightly grease a waffle iron according to manufacturer's instructions.\nWhisk brown rice flour, teff flour, walnuts, rice flour, brown sugar, baking soda, and baking powder together in a bowl. Beat milk, bananas, eggs, yogurt, oil, and vanilla extract together in a separate bowl. Stir flour mixture into banana mixture until batter is just mixed.\nPour 1/4 to 1/2 cup batter into the preheated waffle iron; cook according to manufacturer's instructions until golden brown, 5 to 10 minutes. Repeat with remaining batter.\n",
        "picture_link": "PJY6iyrThv0w7NPJ5Cy4p3DmaHjNKx6"
    },
    {
        "title": "Gladiator",
        "ingredients": [
            "1 fluid ounce amaretto liqueur ADVERTISEMENT",
            "1 fluid ounce peach-flavored bourbon liqueur (such as Southern Comfort ®) ADVERTISEMENT",
            "1 fluid ounce orange juice ADVERTISEMENT",
            "1 fluid ounce lemon-lime soda (such as Sprite®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir amaretto liqueur, bourbon liqueur, orange juice, and lemon-lime soda together in a glass.\n",
        "picture_link": "zjykQX0nKo4mDIE8Sw0PTAAZZMjcFki"
    },
    {
        "title": "Classic Macaroni Salad with a Twist",
        "ingredients": [
            "1 (16 ounce) package elbow macaroni ADVERTISEMENT",
            "12 1/2 ounces chopped cooked white-meat chicken ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1 (8 ounce) can pineapple tidbits in juice, drained, juice reserved ADVERTISEMENT",
            "1/2 cup chopped cilantro ADVERTISEMENT",
            "1/4 cup finely chopped red onion ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until cooked through but firm to the bite, 8 minutes; drain. Rinse macaroni with cold water until cool; drain.\nMix macaroni, chicken, mayonnaise, pineapple with about half the reserved juice, cilantro, red onion, and salt together in a large bowl.\nCover bowl with plastic wrap and refrigerate until chilled, at least 15 minutes.\n",
        "picture_link": "dir.LFW1uKpctnovaE1F305fBIK.pRa"
    },
    {
        "title": "Florentine Fettuccini",
        "ingredients": [
            "18 ounces fettuccine ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 pound fresh spinach, chopped ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "1 1/2 cups grated Parmesan cheese ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a rolling boil. Cook fettuccine at a boil until cooked through yet firm to the bite, about 8 minutes; drain.\nMelt butter with olive oil in a large skillet over medium heat. Cook and stir garlic in the butter mixture until softened, 2 to 3 minutes; add spinach and cook to wilt slightly, about 1 minute.\nStir fettuccine with the spinach mixture. Pour cream over the pasta and spinach. Increase heat to medium-high and cook until the cream is slightly thickened and reduced in volume, about 5 minutes.\nStir Parmesan cheese into the sauce to melt; season with black pepper. Toss to coat noodles with the cheesy sauce.\n",
        "picture_link": "XoiKewbE56Ape1SsCCLx9Y504AWEQGe"
    },
    {
        "title": "Tasty Strawberry Smoothie",
        "ingredients": [
            "1 (6 ounce) container low-fat strawberry yogurt ADVERTISEMENT",
            "3/4 cup low-fat milk ADVERTISEMENT",
            "1/2 cup frozen strawberries ADVERTISEMENT",
            "1/4 cup ground oats ADVERTISEMENT",
            "1 teaspoon flax seed meal ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend yogurt, milk, strawberries, oats, flax, and vanilla extract in a blender until smooth, about 30 seconds.\n",
        "picture_link": "ICPPIO5DkGUws842o5FOoQQsaCeo/li"
    },
    {
        "title": "Wilted Lettuce with Bacon",
        "ingredients": [
            "5 slices bacon, chopped ADVERTISEMENT",
            "1 head red leaf lettuce, torn ADVERTISEMENT",
            "1 1/2 cups buttermilk ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 tablespoon all-purpose flour (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large skillet; cook and stir over medium-high heat until evenly browned and crispy, about 10 minutes. Add lettuce; cook and stir in the bacon grease until lettuce wilts, 2 to 3 minutes. Mix buttermilk, salt, and pepper into bacon-lettuce mixture; cook and stir until buttermilk sauce thickens, 5 to 10 minutes. Whisk flour into sauce if needed to thicken.\n",
        "picture_link": "EVSGRNWhB.qleoVJxPFAcsQKcXCatxi"
    },
    {
        "title": "Piereth Pie I",
        "ingredients": [
            "1 (9 inch) pie shell, baked ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 (1 ounce) squares unsweetened chocolate ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup slivered almonds ADVERTISEMENT",
            "1 (3.4 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "1 cup frozen whipped topping, thawed ADVERTISEMENT",
            "1/4 cup grated semisweet chocolate, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, cream together butter or margarine and sugar. In a microwave-safe bowl, microwave chocolate until melted. Stir occasionally until chocolate is smooth. Stir in melted chocolate, then beat in the eggs one at a time. Stir in almonds. Pour mixture into pastry shell and chill in refrigerator.\nPrepare pudding mix according to package directions. Pour pudding over chocolate layer, then spread whipped topping over pudding. Sprinkle with grated chocolate. Chill several hours before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sunflower Almond Wheat Bread",
        "ingredients": [
            "1 (.25 ounce) package instant yeast ADVERTISEMENT",
            "1/4 cup light brown sugar ADVERTISEMENT",
            "1 cup warm skim milk ADVERTISEMENT",
            "1/4 cup ground sunflower seeds ADVERTISEMENT",
            "1 cup high-gluten bread flour ADVERTISEMENT",
            "2 1/2 cups whole wheat flour ADVERTISEMENT",
            "2 tablespoons almond oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small mixing bowl, dissolve yeast and sugar in warm milk. Let stand until creamy, about 10 minutes.\nIn a large bowl, combine the yeast mixture with sunflower seeds, flour and salt; mix well. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 10 minutes. Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 30 minutes.\nLightly grease a 9x5 inch loaf pan. Deflate the dough and turn it out onto a lightly floured surface. Form the dough into a loaf and place it into the prepared pan. Brush the top with almond oil and cover with a damp cloth. Let rise until doubled in volume, about 40 minutes. Preheat oven to 350 degrees F (175 degrees C).\nBake in the preheated oven for about 30 minutes or until the top is golden brown and the bottom of the loaf sounds hollow when tapped. Let cool on a wire rack 20 minutes before slicing.\n",
        "picture_link": "rUCKRi74Ig2nv0LiFAsR437xKwlqdeu"
    },
    {
        "title": "Champagne Cake III",
        "ingredients": [
            "1 (18.25 ounce) package white cake mix ADVERTISEMENT",
            "1 (3.4 ounce) package instant pistachio pudding mix ADVERTISEMENT",
            "1 cup carbonated water ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/4 tablespoon vegetable oil ADVERTISEMENT",
            "1 (4 ounce) jar maraschino cherries, drained and chopped ADVERTISEMENT",
            "1 (20 ounce) can crushed pineapple, drained ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "1 cup flaked coconut ADVERTISEMENT",
            "6 tablespoons margarine, melted ADVERTISEMENT",
            "4 cups confectioners' sugar ADVERTISEMENT",
            "2 tablespoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour three 9 inch pans.\nIn a large bowl, combine the cake mix and instant pudding. Add club soda, eggs and oil, mix well. Stir in the pineapple, chopped nuts and cherries. Spread evenly into the prepared pans.\nBake for 20 minutes in the preheated oven, or until a toothpick inserted into the cake comes out clean. Cool cake completely before icing.\nTo make the icing: In a medium bowl, combine 1 cup pecans, 1 cup coconut, melted margarine, confectioners' sugar and vanilla, mix until well blended. Frost cake.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Enchilada Sauce \"Salsa Negra\"",
        "ingredients": [
            "3 dried negro (pasilla) chile peppers, stemmed and seeded ADVERTISEMENT",
            "3/4 pound fresh tomatillos, husks removed ADVERTISEMENT",
            "1/4 white onion ADVERTISEMENT",
            "1 clove garlic, peeled ADVERTISEMENT",
            "water to cover ADVERTISEMENT",
            "3/4 pound Roma tomatoes, halved lengthwise ADVERTISEMENT",
            "1/2 teaspoon chicken bouillon granules, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chile peppers in the bottom of a small saucepan. Add tomatillos, onion, and garlic. Pour in enough water to almost cover tomatillos. Arrange tomatoes over tomatillos.\nCover saucepan and bring water to a boil. Reduce heat and simmer until tomatoes soften, about 5 minutes. Remove saucepan from heat and let cool, about 10 minutes.\nPour off most of the water and transfer mixture to a blender; puree until smooth. Season with chicken bouillon to taste.\n",
        "picture_link": "zF46V0963kPeStR55VsOd1BstbbqdZK"
    },
    {
        "title": "Blackberry Lemonade ",
        "ingredients": [
            "3 tablespoons blackberries ADVERTISEMENT",
            "1 1/3 cups boiling water ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "5 lemons, juiced ADVERTISEMENT",
            "3 1/2 cups water ADVERTISEMENT",
            "ice cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place blackberries into a bowl. Pour boiling water on top. Let sit until steam stops rising from the bowl, about 10 minutes.\nTransfer mixture to a pitcher; stir in sugar. Pour in lemon juice and cold water. Place in the refrigerator until chilled. Serve over ice cubes.\n",
        "picture_link": "KVc9gxcuwfr1uCfhebNFBIgiV1XVb7S"
    },
    {
        "title": "Chicken Fajita Kabob",
        "ingredients": [
            "1/4 cup fresh lime juice ADVERTISEMENT",
            "1/4 cup orange juice ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 tablespoon paprika ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 teaspoon Archer Farms™ ancho chile powder ADVERTISEMENT",
            "1/4 teaspoon Archer Farms™ ground cinnamon ADVERTISEMENT",
            "1/8 teaspoon cayenne pepper ADVERTISEMENT",
            "2 (14 ounce) packages Just Bare™ Chicken Breast Fillets, cut into 1-inch pieces ADVERTISEMENT",
            "1 large white onion, cut into 1-inch pieces ADVERTISEMENT",
            "1 red, orange or yellow bell pepper (or more as needed), cut into 1-inch pieces ADVERTISEMENT",
            "12 (12-inch) skewers* ADVERTISEMENT",
            "Lime wedges ADVERTISEMENT",
            "Fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix juices, oil and spices in large plastic food storage bag. Add chicken cubes; seal bag. Massage bag to coat chicken. Refrigerate 4 hours or overnight to marinate.\nHeat grill. Thread chicken, onion and bell peppers onto skewers. Grill about 10 minutes until chicken is cooked through, turning as needed for even browning.\nServe with squeeze of fresh lime and garnish with cilantro.\n",
        "picture_link": "ucz6AaWBO3vBn7fE5dDq08FUocCjNr2"
    },
    {
        "title": "Blueberry Cobbler from Land O'Lakes",
        "ingredients": [
            "Filling: ADVERTISEMENT",
            "4 cups fresh blueberries ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/2 cup freshly squeezed orange juice ADVERTISEMENT",
            "1 teaspoon fresh grated orange zest ADVERTISEMENT",
            "3/4 cup sugar ADVERTISEMENT",
            "3 tablespoons cornstarch ADVERTISEMENT",
            "Batter: ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 tablespoons cold LAND O LAKES® Butter, cut into small pieces ADVERTISEMENT",
            "1/2 cup sugar ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 teaspoon freshly grated orange zest ADVERTISEMENT",
            "1/2 teaspoon vanilla ADVERTISEMENT",
            "Topping: ADVERTISEMENT",
            "Sanding sugar (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 375 degrees F. Spray 8-inch square baking dish with no-stick cooking spray. Set aside.\nPlace blueberries, water, orange juice and 1 teaspoon orange zest into 3-quart saucepan.\nCombine 3/4 cup sugar and corn starch in bowl; stir into blueberry mixture. Cook over medium heat until bubbles begin to form; continue cooking 3-5 minutes or until juices are thickened.\nCombine flour, baking powder and salt in bowl. Cut in butter, using pastry blender or two forks, until mixture resembles coarse crumbs. Add all remaining batter ingredients; stir until well mixed.\nPour hot blueberry mixture into prepared baking dish. Dollop tablespoons of batter over hot filling. Sprinkle with sanding sugar, if desired.\nBake 25-30 minutes or until light golden brown or toothpick inserted in center comes out clean.\n",
        "picture_link": "Y1/SYCigcha7Zoiv0AYfZ4emGm6Ljsa"
    },
    {
        "title": "Chili Lime Chicken Tacos",
        "ingredients": [
            "1 pound boneless, skinless chicken breasts, cut into bite-size pieces ADVERTISEMENT",
            "2 tablespoons olive oil, divided ADVERTISEMENT",
            "1 1/2 teaspoons chili powder ADVERTISEMENT",
            "1 clove garlic, finely chopped ADVERTISEMENT",
            "2 tablespoons fresh lime juice ADVERTISEMENT",
            "1 medium poblano pepper, chopped ADVERTISEMENT",
            "1 small red onion, chopped ADVERTISEMENT",
            "1 (5.5 ounce) package Knorr® Rice Sides™ - Rice Pilaf ADVERTISEMENT",
            "8 corn tortillas or taco shells ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season chicken, if desired, with salt and pepper. Combine 1 tablespoon olive oil with chili powder in large bowl; add chicken and toss to coat.\nHeat large nonstick skillet over medium heat and cook chicken, stirring frequently, until thoroughly cooked, about 6 minutes. Add garlic to skillet and cook, stirring, until fragrant, about 30 seconds. Add lime juice; toss. Remove and set aside.\nHeat remaining 1 tablespoon oil in same skillet over medium-high heat and cook poblano pepper and onion, stirring occasionally, until softened, about 4 minutes. Add 2 cups water to skillet and Knorr(R) Rice Sides(TM) - Rice Pilaf and cook according to package directions. Stir in chicken.\nServe in corn tortillas or taco shells and serve, if desired, with sour cream, lime wedges and salsa verde.\n",
        "picture_link": "uOOZw6RFlobJY5o0u2JtEk9fB9fiCiS"
    },
    {
        "title": "Sweet and Spicy Tuna Cups",
        "ingredients": [
            "1/3 cup gyoza dipping sauce ADVERTISEMENT",
            "2 teaspoons granulated sugar ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 teaspoon sesame oil ADVERTISEMENT",
            "1/4 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1 sheet frozen puff pastry, thawed ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "2 (5 ounce) cans Bumble Bee® Solid White Albacore Tuna in Water, drained ADVERTISEMENT",
            "1/3 cup finely diced fresh mango ADVERTISEMENT",
            "1 tablespoon chopped green onion ADVERTISEMENT",
            "2 tablespoons minced green bell pepper ADVERTISEMENT",
            "1/2 tablespoon toasted sesame seeds (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine gyoza dipping sauce, sugar, garlic, toasted sesame oil and red pepper flakes in a small sauce pan. Cook over medium heat until reduced by half. Remove from heat and set aside.\nPreheat oven to 400 degrees F (200 degrees C).\nPlace defrosted puff pastry sheet on a lightly floured work surface. Dust the top of the puff pastry sheet with flour, and roll out slightly to form an 11 x 13-inch rectangle. Cut the pastry sheet into 24 equal size rectangles by cutting the 11-inch dimension into 4 equal strips, and then cutting the 13-inch dimension into 6 equal strips.\nLay each rectangle over the hole of a mini muffin tin, and push the middle of the dough down into the muffin tin, to form a cup. (There will be some excess dough that sits on top of the muffin tin, and depending on the size of your mini muffin pan, you may need to bake these in batches, skipping every-other hole of the muffin tin, so that the excess dough does not touch.)\nBake for 8 minutes. Remove from oven and punch down the puffed up middle portion of the pastry cups with a fork. Return to the oven and bake an additional 3 minutes, or until lightly golden brown. Remove from the oven and punch down the centers again with a fork, forming a nice hole for the filling. Let cool completely before removing from the muffin tin.\nIn a medium bowl, lightly toss the tuna, mango, and sweet bell pepper until evenly combined. Using a small spoon, fill each puff pastry cup with the tuna filling. Drizzle the reserved sauce over the tuna filling and garnish with the chopped green onions and toasted sesame seeds.\n",
        "picture_link": "C86U8UIP11nCeRbuvCGxlQD40CgAiqi"
    },
    {
        "title": "Fiesta Tostadas",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 (5.4 ounce) package Knorr® Fiesta Sides™ - Mexican Rice ADVERTISEMENT",
            "1/2 cup red bell pepper, diced ADVERTISEMENT",
            "12 corn tostada shells ADVERTISEMENT",
            "1/2 head iceberg lettuce, shredded ADVERTISEMENT",
            "2 tomatoes, diced ADVERTISEMENT",
            "1 cup grated queso fresco cheese ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Brown ground beef in a medium sized pot until it is crumbled and no longer pink. Remove browned beef with a slotted spoon; set aside. Pour off the fat.\nIn the same skillet, prepare Knorr(R) Fiesta SidesTM- Mexican Rice according to the package directions. Add browned ground beef and diced red bell pepper. Mix well.\nDivide the mixture among 12 tostada shells. Stack them 2 high making 6 double-decker tostadas. Top with shredded lettuce, tomato, queso fresco, and sour cream.\n",
        "picture_link": "K0zT/3b1QmnCGhp3KGFpulM05qxCmie"
    },
    {
        "title": "Very Banana-y Whole Wheat Banana Bread",
        "ingredients": [
            "1/2 cup lightly packed brown sugar ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/3 cup unsweetened applesauce ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 3/4 cups mashed bananas ADVERTISEMENT",
            "1 3/4 cups whole wheat flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Line the bottom of a 9x5-inch nonstick loaf pan with parchment paper.\nBeat brown sugar and oil together in a large bowl until well-blended. Add eggs, applesauce, and vanilla extract; mix well to combine. Stir in mashed bananas. Add whole wheat flour and baking soda; stir until incorporated. Fold walnuts into the batter.\nPour batter into the prepared loaf pan.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 1 hour. Cover loaf with a clean towel and cool on a wire rack for 30 minutes before slicing.\n",
        "picture_link": "ZllsT/eAuDOZM4elKpqt6/1k3pe0eta"
    }
]