[
    {
        "title": "Mrs Espy's Enchilada Sauce",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1/4 cup chili powder ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1/4 cup tomato sauce ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "garlic powder to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a medium saucepan over medium heat. Stir in the flour and cook for 1 minute, then add the chili powder and cook for 1 more minute. Gradually stir in the water, mixing well with a whisk to make sure you get out all the lumps, then stir in the tomato sauce and season with salt and garlic powder to taste.\nReduce heat to low and simmer for 10 to 15 minutes. (Note: If sauce thickens too much, just add a little water to thin it out a bit.)\n",
        "picture_link": "JE5iATWkvGKNfL7BvMtPfsEvWOQIyd2"
    },
    {
        "title": "Chicken Breasts with Chipotle Green Onion Gravy",
        "ingredients": [
            "2 skinless, boneless chicken breast halves ADVERTISEMENT",
            "salt and fresh ground pepper to taste ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "3/4 cup chicken broth ADVERTISEMENT",
            "2 tablespoons minced green onions ADVERTISEMENT",
            "1/2 teaspoon chipotle chile powder, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken breast halves between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound chicken with the smooth side of a meat mallet to a thickness of 1/2-inch. Season with salt and pepper to taste.\nHeat olive oil in a skillet on high heat until it begins to shimmer, about 1 minute. Reduce heat to medium; cook chicken breasts until browned and no longer pink inside, about 5 minutes per side. Transfer cooked chicken to a warm plate and loosely cover with aluminum foil.\nMelt butter in the skillet; stir in flour and cook for about 2 minutes. Stir in chicken broth, scraping up any browned bits from the bottom of the pan; cook and stir until gravy begins to simmer and thicken, 1 to 2 minutes.\nStir in green onions and chipotle chile powder.\nReturn chicken breasts to the skillet and cook until heated through, 1 to 2 minutes.\n",
        "picture_link": "hvxqcsohMzXbNni8lGciGVLrbUYvFTK"
    },
    {
        "title": "Old Fashioned Strawberry Pie",
        "ingredients": [
            "2 (9 inch) unbaked pie crusts ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "1/3 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "4 cups fresh strawberries ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Place one crust in a nine inch pie pan.\nMix together sugar, flour, and cinnamon. Mix lightly through the berries. Pour filling into pastry lined pan, and dot fruit with butter or margarine. Cover with top crust, and cut slits in the top. Seal and flute the edges.\nBake for 35 to 45 minutes, or until the crust is slightly browned.\n",
        "picture_link": "KFRAeJxHxAQyc.jOrbqytGNqpaXwUuy"
    },
    {
        "title": "Johnny's Spice Rub",
        "ingredients": [
            "1 tablespoon garlic powder ADVERTISEMENT",
            "2 tablespoons ground black pepper ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 tablespoon mustard powder ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "4 tablespoons ground paprika ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small, nonporous bowl, combine the garlic powder, ground black pepper, salt, mustard powder, chili powder, cumin, brown sugar, paprika and oregano. Mix well and apply to meat.\n",
        "picture_link": "wVgXFLrQR9jfXnOTtffendKY1cKJSdC"
    },
    {
        "title": "Twice Baked Potatoes II",
        "ingredients": [
            "6 large baking potatoes ADVERTISEMENT",
            "1 (16 ounce) container sour cream ADVERTISEMENT",
            "1/4 cup shredded Cheddar cheese ADVERTISEMENT",
            "3/4 cup butter ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "3 slices American cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBake potatoes for 1 hour or until soft.\nCut enough of the skin off the top of each potato to be able to scoop the potato out of the skin and into a mixing bowl.\nAdd butter, sour cream, grated cheese and mix together well. Add salt and pepper to taste.\nFill the skins with the mix and top with 1/2 slice American cheese. Bake for 20 to 25 minutes just until heated through.\n",
        "picture_link": "kBGnscA7AxBYjrIQBqnQl9M.i4LZXPq"
    },
    {
        "title": "Amazing Southwest Cilantro Lime Mango Grilled Chicken Sandwiches",
        "ingredients": [
            "MARINADE ADVERTISEMENT",
            "1/4 cup finely chopped fresh cilantro ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/4 jalapeno chile pepper, seeded and minced ADVERTISEMENT",
            "2 tablespoons finely grated fresh lime zest ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon chipotle chile powder ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 pound chicken breast tenderloins or strips ADVERTISEMENT",
            "SALSA ADVERTISEMENT",
            "1 medium tomato, chopped ADVERTISEMENT",
            "1 small sweet onion, finely chopped ADVERTISEMENT",
            "2 tablespoons finely chopped fresh cilantro ADVERTISEMENT",
            "1/2 jalapeno chile pepper, seeded and minced ADVERTISEMENT",
            "1 clove garlic, finely chopped ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon sea salt ADVERTISEMENT",
            "1/8 teaspoon chipotle chile powder ADVERTISEMENT",
            "1 tablespoon fresh lime juice ADVERTISEMENT",
            "GRILLED VEGETABLES ADVERTISEMENT",
            "1 sweet onion cut into 1/2-inch slices ADVERTISEMENT",
            "1 red bell pepper, quartered ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon minced garlic ADVERTISEMENT",
            "LIME MAYONNAISE ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "2 tablespoons fresh lime juice ADVERTISEMENT",
            "16 thick slices French bread ADVERTISEMENT",
            "2 mangos - peeled, seeded, and sliced ADVERTISEMENT",
            "8 slices Monterey Jack cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "For the marinade: Place 1/4 cup cilantro, 1 clove minced garlic, 1/4 jalapeno, lime zest, 1 1/2 teaspoons salt, onion powder, 1/4 teaspoon black pepper, 1/4 teaspoon chipotle chile powder, and 1 tablespoon olive oil in a small bowl and stir until well combined. Place the chicken breast tenderloins in a large resealable plastic bag. Pour the marinade into the bag with the chicken, seal, and shake the bag to coat. Refrigerate for 1 hour.\nFor the salsa: Combine the tomato, 1 small onion, 2 tablespoons cilantro, 1/2 jalapeno, 1 clove garlic, 1/4 teaspoon black pepper, sea salt, 1/8 teaspoon chipotle pepper, and 1 tablespoon lime juice in a bowl. Cover with plastic wrap and refrigerate.\nTo prepare the grilled vegetables, toss the onions and red peppers with 1 tablespoon olive oil, 1/4 teaspoon salt, and 1 clove garlic in a bowl; set aside.\nFor the lime mayonnaise: Whisk together the mayonnaise and 2 tablespoons of lime juice; cover with plastic wrap and refrigerate.\nPreheat an outdoor grill for medium-high heat.\nGrill the marinated chicken on the prepared grill until no longer pink in the center and juices run clear, 8 to 10 minutes. Grill the red pepper and onions until tender and golden brown, 8 to 10 minutes. Remove the chicken and vegetables from the grill. Slice the grilled pepper into thin strips.\nSpread each slice of bread with 1 1/2 teaspoons of prepared lime mayonnaise. Layer half of the pieces of bread with sliced mango, 1 tablespoon prepared salsa, grilled chicken tenderloins, grilled peppers, grilled onions, and a slice of Monterey Jack cheese. Top off the sandwiches with the remaining slices of bread. Return the sandwiches to the grill, turning when the bottom is golden brown\nReturn the sandwiches to the grill and grill them until the bread is toasted and the cheese melts, about 2 minutes per side.\n",
        "picture_link": "Gv3wI.IDWk6AsfnnXI2vGjb6BROVSia"
    },
    {
        "title": "Magic Mango Bread",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3 cups peeled, seeded and chopped mango ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup shredded coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease two 9x5 inch loaf pans.\nIn a large bowl, sift together flour, baking soda, salt and cinnamon. In a large bowl, beat together the butter, oil and sugar until light and fluffy. Stir in the eggs one at a time, beating well with each addition, then stir in the vanilla. Blend this mixture into the flour mixture; just to combine. Fold in the mango, raisins, walnuts and coconut; mixing just enough to evenly combine.\nLet stand for 20 minutes then bake in preheated oven for 50 to 60 minutes or until a toothpick inserted into center of the loaf comes out clean.\n",
        "picture_link": "dSVLiitbUXA/Ep5LBzLN0iqBVFz1jlu"
    },
    {
        "title": "Irish Potato Casserole",
        "ingredients": [
            "2 cups peeled and shredded potatoes ADVERTISEMENT",
            "1/2 cup melted butter ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 teaspoon minced onion ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon paprika ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Butter a 1.5 quart baking dish.\nIn a medium bowl, combine the potatoes, butter, eggs, onion, salt and paprika. Mix well.\nPlace potato mixture into the prepared baking dish and pour milk over top. Bake in the preheated oven for 40 minutes. Sprinkle top with cheese, return to oven and bake until cheese melts and is slightly browned.\n",
        "picture_link": "f4gBDMSwtO1XbC1TG5RpI5XamTVBWq2"
    },
    {
        "title": "Bacon Wrapped Water Chestnuts II",
        "ingredients": [
            "1 pound bacon ADVERTISEMENT",
            "2 (8 ounce) cans water chestnuts ADVERTISEMENT",
            "1/3 cup packed brown sugar ADVERTISEMENT",
            "1/3 cup mayonnaise ADVERTISEMENT",
            "1/3 cup chili sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCut each strip of bacon in half. Wrap one strip around one water chestnut. Secure with a wooden toothpick. Place in shallow baking dish.\nBake at 350 degrees F (175 degrees C) for 20 minutes.\nWhile the wraps are baking, in a small mixing bowl combine brown sugar, mayonnaise, and chili sauce to make barbecue sauce. After the wraps have finished baking, transfer them (removing them from the grease) to a second shallow baking dish. Pour the sauce over the wraps.\nBake at 350 degrees F (175 degrees C) for 10 to 15 additional minutes, or until bacon is crispy. Serve hot out of dish with toothpicks.\n",
        "picture_link": "OOCk5yqB3EJLVURYI2ukaHZOXLJZHTa"
    },
    {
        "title": "Broccoli Cheese Bake",
        "ingredients": [
            "8 cups fresh broccoli ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1 1/4 cups milk ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "4 cups shredded Swiss cheese ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nPlace broccoli in a steamer over 1 inch of boiling water, and cover. Cook until tender but still firm, about 2 to 6 minutes. Drain.\nMelt butter in a medium saucepan over medium heat and add flour; cook until bubbly. Stir in onion and gradually add milk, stirring well. Bring to a boil and cook for 1 minute. Remove from heat and season with salt and pepper. Stir in cheese and eggs; mix well. Combine mixture with broccoli and transfer to a 9 x 13 inch casserole dish.\nBake in preheated oven for 30 minutes.\n",
        "picture_link": "zTF2sQ10pX.hqn7Wmmha3cV0a1YBL/m"
    },
    {
        "title": "Sausage Potato Bake",
        "ingredients": [
            "8 cups cubed potatoes ADVERTISEMENT",
            "1 pound smoked sausage, sliced ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 (10.75 ounce) can condensed vegetable beef soup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "For oven: Preheat oven to 350 degrees F (175 degrees C).\nIn a 4 quart casserole dish, combine the potatoes, kielbasa OR sausage, mushroom soup and vegetable beef soup. Mix together well.\nBake at 350 degrees F (175 degrees C) for 1 1/2 hours.\nFor slow cooker: Place the potatoes, kielbasa OR sausage, mushroom soup and vegetable soup in a slow cooker.\nCook on low setting for 6 to 8 hours.\n",
        "picture_link": "cwjzmfIfQh3raT79HAvZMQtLkq/kLna"
    },
    {
        "title": "Bagel and Cheese Bake",
        "ingredients": [
            "1/2 pound bacon, diced ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "3 plain bagels ADVERTISEMENT",
            "1 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "12 eggs, beaten ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "2 teaspoons chopped fresh parsley ADVERTISEMENT",
            "1/4 teaspoon pepper ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the bacon and onion in a large, deep skillet. Cook over medium-high heat until evenly brown. Drain, and set aside. Slice each bagel into 4 thin slices.\nArrange 6 bagel slices in the bottom of a lightly greased 9x13 inch baking dish. Cover with the bacon and onion mixture, followed by the Cheddar cheese. Top with remaining bagel slices.\nIn a medium bowl, whisk together the eggs, milk, parsley, and pepper. Pour the egg mixture over the bagel layers. Cover, and refrigerate 8 hours or overnight.\nPreheat oven to 400 degrees F (200 degrees C). Uncover the chilled bagel dish, and bake in the preheated oven 25 to 30 minutes, or until eggs are firm. Sprinkle with Parmesan cheese, and serve warm.\n",
        "picture_link": "IgDQjS04hIf4X6BXAQUrb8ccB.A3mR2"
    },
    {
        "title": "Chiles Rellenos Pie",
        "ingredients": [
            "6 fresh poblano chile peppers ADVERTISEMENT",
            "2 cups Monterey Jack cheese, shredded ADVERTISEMENT",
            "2 cups mild Cheddar cheese, shredded ADVERTISEMENT",
            "1 1/2 cups diced cooked chicken ADVERTISEMENT",
            "4 tablespoons all-purpose flour ADVERTISEMENT",
            "1 cup evaporated milk ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "2 cups salsa ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven on broiler setting. Roast chiles under broiler on cookie sheet until skin is brown and charred on all sides. Cool until you are able to touch peppers, then peel off skin. Make a slit down one side of the pepper, and remove stem and seeds. Reduce oven temperature to 350 degrees F (175 degrees C).\nLine the bottom of an 11 inch square baking dish with chiles. Layer Monterey Jack cheese and Cheddar cheese evenly over chilies. Spread cooked chicken over cheese. In a medium bowl, using a wire whisk, mix flour with a small amount of evaporated milk until it forms a smooth paste, then whisk in remaining milk and sour cream. Beat in eggs, one at a time. Pour evenly over chicken.\nBake in preheated oven for 40 minutes, or until center of pie becomes firm. Spread salsa over top, and bake for 15 minutes. Allow to cool 10 minutes before serving.\n",
        "picture_link": "rNdzcpmgmHRxUmhQeIWa7TdwKGVxbYW"
    },
    {
        "title": "English Trifle",
        "ingredients": [
            "2 (8 or 9 inch) white cake layers, baked and cooled ADVERTISEMENT",
            "2 pints fresh strawberries ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 pint fresh blueberries ADVERTISEMENT",
            "2 bananas ADVERTISEMENT",
            "1/4 cup orange juice ADVERTISEMENT",
            "1 (3.5 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "1/4 cup blanched slivered almonds ADVERTISEMENT",
            "12 maraschino cherries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Slice strawberries and sprinkle them with sugar. Cut the bananas into slices and toss with orange juice. Combine pudding mix with milk and mix until smooth. Cut the cake into 1 inch cubes.\nUse half of the cake cubes to line the bottom of a large glass bowl. Layer half of the strawberries followed by half of the blueberries, and then half of the bananas. Spread half of the pudding over the fruit. Repeat layers in the same order.\nIn a medium bowl, whip the cream to stiff peaks and spread over top of trifle. Garnish with maraschino cherries and slivered almonds.\n",
        "picture_link": "utA.pWiRh6q5If8B9qGku9AIPLaIOBC"
    },
    {
        "title": "Lemon Cooler Cream Cake",
        "ingredients": [
            "1 (18.25 ounce) package lemon cake mix ADVERTISEMENT",
            "1 cup hot water ADVERTISEMENT",
            "1 cup cold water ADVERTISEMENT",
            "2 (3 ounce) packages lemon flavored Jell-O® mix ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 (3.4 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare cake and bake according to package directions in a 9x13 inch baking dish. With a fork, poke holes all over top of cake.\nCombine 1 cup hot water and 1 cup cold water with one package of lemon gelatin. Stir until gelatin is dissolved, and pour mixture over cake. Chill in refrigerator until cool.\nIn large bowl stir together milk, vanilla pudding mix and remaining package of lemon gelatin until powders are dissolved. Fold in whipped topping and spread mixture over cake. Refrigerate until serving.\n",
        "picture_link": "/b6/TFvUZxKmA/e0taEFx/C8a5NzPHm"
    },
    {
        "title": "Bubble 'n' Squeak",
        "ingredients": [
            "1/2 medium head cabbage, sliced ADVERTISEMENT",
            "3 slices bacon, diced ADVERTISEMENT",
            "1 onion, thinly sliced ADVERTISEMENT",
            "1 cup cubed cooked ham ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "3 cups potatoes - baked, cooled and thinly sliced ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan, cook cabbage in a small amount of water for about 5 minutes, or until tender. Drain, and set aside.\nIn a well-seasoned cast iron skillet, cook bacon and onion until onion is soft and bacon is cooked. Add ham, and cook until heated through. Add butter, then mix in the cooked cabbage and potatoes. Season with paprika, salt, and pepper. Cook until browned on bottom, turn, and brown again.\n",
        "picture_link": "1VEss43rKQyozAUn7O9THVIuRJPj0PO"
    },
    {
        "title": "Wonton Wrappers",
        "ingredients": [
            "1 egg ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, beat the egg. Mix in the water.\nIn a large bowl, combine the flour and salt. Create a well in the center of the mixture and slowly pour in the egg and water. Mix well. If the mixture is too dry, increase the amount of water one teaspoon at a time until a pliable dough has formed.\nOn a lightly floured surface, knead the dough until elastic. Cut dough into two separate balls. Cover the balls with a damp cloth for a minimum of 10 minutes.\nCut each ball into four equal pieces. Roll the pieces into 10 1/2 by 10 1/2 inch squares. Cut each into nine 3 1/2 by 3 1/2 inch squares. Use in any recipe that calls for wonton wrappers.\n",
        "picture_link": "jckxAxYn/25ESydEM1lkz7xvjNrxN22"
    },
    {
        "title": "Lite Carrot Cake",
        "ingredients": [
            "1 cup cake flour ADVERTISEMENT",
            "1 cup whole wheat flour ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "2/3 cup buttermilk ADVERTISEMENT",
            "1 1/2 cups grated carrots ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease and flour one 9x13 inch pan or two 9 inch round cake pans.\nSeparate eggs and beat egg whites until frothy, then continue whipping and gradually add 1/2 cup of the white sugar. Beat until stiff.\nIn a large bowl combine; the cake flour, wheat flour, brown sugar, baking powder, baking soda, and cinnamon, mix until blended. Add the oil and the buttermilk and mix well. Add the egg yolks and mix well. Fold in the egg whites and then the carrots. Pour batter into prepared pan.\nBake at 350 degrees F (175 degrees C) for 25 to 35 minutes. Cool and frost with your favorite Cream Cheese frosting using light cream cheese.\n",
        "picture_link": "ILNeHRGOBYEjgxPU2wzwLQ49mHqreN6"
    },
    {
        "title": "Crusty White Bread",
        "ingredients": [
            "2 tablespoons active dry yeast ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "2 tablespoons margarine, softened ADVERTISEMENT",
            "6 cups bread flour ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small mixing bowl, dissolve yeast and sugar in the warm water. Let stand until creamy, about 10 minutes.\nIn a large mixing bowl, combine the yeast mixture with the milk, the butter or margarine, 4 cups of the flour and the salt; stir until well combined. Add the remaining flour, 1/2 cup at a time, stirring well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and supple, about 8 minutes.\nLightly oil a large mixing bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and put in a warm place to rise until doubled in volume, about 1 hour.\nPreheat oven to 400 degrees F (200 degrees C).\nDeflate the dough and turn it out onto a lightly floured surface. Divide the dough into two equal pieces and form into loaves. Place the loaves into two lightly greased 9x5 inch loaf pans. Cover the loaves with a damp cloth and let rise until doubled in volume, about 40 minutes.\nMist loaves with water and bake at 400 degrees F (200 degrees C) oven for 20 to 30 minutes or until the loaves are golden brown and the bottom of a loaf sounds hollow when tapped.\n",
        "picture_link": "2D0yfyv9Lr08LTkLTX9b7uB3K1GH4qu"
    },
    {
        "title": "Three Bean Salad",
        "ingredients": [
            "1 (15 ounce) can garbanzo beans (chickpeas), drained and rinsed ADVERTISEMENT",
            "1 (15 ounce) can kidney beans, drained and rinsed ADVERTISEMENT",
            "1 (15 ounce) can green beans, drained and rinsed ADVERTISEMENT",
            "4 green onions, chopped ADVERTISEMENT",
            "1 stalk celery, sliced ADVERTISEMENT",
            "1/2 cup cider vinegar ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1/2 teaspoon ground dry mustard ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon onion powder (optional) ADVERTISEMENT",
            "1/4 teaspoon ground cayenne pepper (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a bowl, gently mix the garbanzo beans, kidney beans, green beans, green onions, and celery. In a separate bowl, whisk together the vinegar, oil, honey, mustard, garlic powder, black pepper, onion powder, and cayenne pepper. Pour dressing over the salad, and toss gently to coat. Cover, refrigerate at least 2 hours, and gently toss before serving.\n",
        "picture_link": "w7o12sAR4jF3Dr6Ig7ewVaOHwoRJcXK"
    },
    {
        "title": "Tasty Green Beans",
        "ingredients": [
            "2 pounds fresh green beans, rinsed and trimmed ADVERTISEMENT",
            "1/2 cup margarine ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "1/2 cup soy sauce ADVERTISEMENT",
            "2 tablespoons beef bouillon ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of water to a boil. Add green beans and cook for 5 minutes. Drain and rinse with cold water.\nMelt margarine in a large saucepan over high heat. Mixing well, add green beans, onions and garlic. Stir in soy sauce. While stirring, add bouillon and water. Reduce heat to low and simmer, stirring occasionally, for 20 minutes. Season with salt and pepper to taste.\n",
        "picture_link": "0hpLhe0H3hjl7ZJY25X5DY6PX1ex8Y6"
    },
    {
        "title": "Mama's Potato Salad",
        "ingredients": [
            "5 pounds potatoes, peeled and cubed ADVERTISEMENT",
            "2 cups mayonnaise ADVERTISEMENT",
            "1/2 cup yellow mustard ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "2 tablespoons prepared horseradish ADVERTISEMENT",
            "sea salt to taste ADVERTISEMENT",
            "8 hard-cooked eggs, chopped ADVERTISEMENT",
            "3 dill pickles, chopped (optional) ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the potatoes in a large pot with enough water to cover. Bring to a boil, and cook for about 10 minutes, or until tender. Drain, and place in a serving bowl.\nStir the onion, salt and pepper into the potatoes while they are still hot. This allows the potatoes to absorb the flavor. Allow to cool for about 20 minutes.\nAdd the mayonnaise, mustard and horseradish to the salad, and mix well. Gently stir in the eggs and dill pickles. Finish off with a generous grinding of black pepper on top. Chill for about 30 minutes before serving.\n",
        "picture_link": "jp4eHXIv.B4g3aEE9p5PHqmj1VlPBii"
    },
    {
        "title": "Romanian Apple Cake",
        "ingredients": [
            "5 apples, peeled and cored ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "3/4 cup vegetable oil ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "3/4 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan. Cut the apples into 1 inch wedges. Set aside.\nIn a large bowl, whisk together the eggs and sugar until blended. Mix in the baking soda, oil, cinnamon and vanilla. Stir in the flour, just until incorporated. Fold in the apples and walnuts.\nPour batter into prepared pan. Bake in the preheated oven for 55 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool slightly. May be served warm or at room temperature.\n",
        "picture_link": "2pII08CRyBeIbd/FQZDyA2XuLskdHei"
    },
    {
        "title": "Coconut Tofu Keema",
        "ingredients": [
            "1/4 cup olive oil ADVERTISEMENT",
            "4 cloves garlic, pressed ADVERTISEMENT",
            "1 medium onions, minced ADVERTISEMENT",
            "1 (14 ounce) package extra firm tofu, diced ADVERTISEMENT",
            "1 (16 ounce) can coconut milk ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "1 teaspoon curry powder ADVERTISEMENT",
            "1 1/2 teaspoons ground ginger ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 tablespoon red pepper paste ADVERTISEMENT",
            "6 cups tomato sauce ADVERTISEMENT",
            "1 1/2 cups frozen peas, thawed ADVERTISEMENT",
            "1 1/2 cups chopped carrot ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large saucepan over medium heat. Stir in garlic, onion, and tofu; cover, and cook, stirring occasionally for 5 to 10 minutes. Stir in coconut milk, cumin, curry powder, ginger, salt, and red pepper paste; bring to a simmer. Stir in tomato sauce, peas, and carrots; simmer, covered, about 30 minutes.\n",
        "picture_link": "PgGUqjHMBt/kEdZV1.bZap5oy0XjLcu"
    },
    {
        "title": "Classic Texas Caviar",
        "ingredients": [
            "2 (15.8 ounce) cans black-eyed peas, drained ADVERTISEMENT",
            "1 (14.5 ounce) can petite diced tomatoes, drained ADVERTISEMENT",
            "2 fresh medium jalapenos, stemmed, seeded and minced ADVERTISEMENT",
            "1 small onion, cut into small dice ADVERTISEMENT",
            "1/2 yellow bell pepper, stemmed, seeded and cut into small dice ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "6 tablespoons red wine vinegar ADVERTISEMENT",
            "6 tablespoons olive oil (not extra virgin) ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 1/2 teaspoons ground cumin ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix all ingredients in a medium bowl; cover and refrigerate 2 hours or up to 2 days. Before serving, adjust seasonings to taste, adding extra vinegar, salt and pepper. Transfer to a serving bowl.\n",
        "picture_link": "E2P31BOLmg3ZMGbYY.zD5K2dPU9QozW"
    },
    {
        "title": "Chicken Dijon",
        "ingredients": [
            "4 skinless, boneless chicken breasts ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1/2 cup half-and-half cream ADVERTISEMENT",
            "2 tablespoons Dijon-style prepared mustard ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet, brown chicken in butter/margarine for about 15 to 20 minutes or until cooked through and juices run clear. Remove from skillet and place on a warm oven-proof platter.\nPreheat oven to 150 degrees F (65 degrees C).\nStir flour into skillet drippings. Add broth and deglaze skillet by stirring vigorously until flour is somewhat dissolved and liquid has the consistency of a sauce. Add cream. Simmer, stirring, over moderate heat for about 10 minutes until sauce is a little thick. Stir in mustard and heat through.\nPour mustard sauce over chicken breasts. Put platter in warm preheated oven for about 10 to 15 minutes, then serve!\n",
        "picture_link": "2zppkAUse2eozHiPHnshYQUPY9PS8ra"
    },
    {
        "title": "Cinnamon Raisin Bread II",
        "ingredients": [
            "1 cup milk, room temperature ADVERTISEMENT",
            "3 tablespoons butter, softened ADVERTISEMENT",
            "3 tablespoons honey ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1 egg, room temperature ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "3 cups bread flour ADVERTISEMENT",
            "2 1/4 teaspoons bread machine yeast ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Add all ingredients, except raisins, in the order given above, or as directed in your bread machine manual. Set the bread maker on Sweet Dough setting.\nAdd the raisins at the signal, or about 5 minutes before the kneading cycle has finished.\n",
        "picture_link": "j.r5QhPqpZ4vqGICfL8LOLCJKUlO1mG"
    },
    {
        "title": "Mediterranean Greek Salad",
        "ingredients": [
            "3 cucumbers, seeded and sliced ADVERTISEMENT",
            "1 1/2 cups crumbled feta cheese ADVERTISEMENT",
            "1 cup black olives, pitted and sliced ADVERTISEMENT",
            "3 cups diced roma tomatoes ADVERTISEMENT",
            "1/3 cup diced oil packed sun-dried tomatoes, drained, oil reserved ADVERTISEMENT",
            "1/2 red onion, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large salad bowl, toss together the cucumbers, feta cheese, olives, roma tomatoes, sun-dried tomatoes, 2 tablespoons reserved sun-dried tomato oil, and red onion. Chill until serving.\n",
        "picture_link": "fnPnmpGJKIeSZ2XT2Unl0hBAnCptJcK"
    },
    {
        "title": "Easy Snack Wraps",
        "ingredients": [
            "12 (10 inch) flour tortillas ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "1 head lettuce ADVERTISEMENT",
            "1 (6 ounce) package sliced deli-style turkey ADVERTISEMENT",
            "2 cups shredded carrots ADVERTISEMENT",
            "2 cups minced tomato ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread cream cheese evenly over the tortillas. Top the cream cheese with lettuce leaves. Arrange the turkey slices in even layers on top of the lettuce. Sprinkle the carrots and tomato over the turkey slices. Roll the tortillas into wraps. Cut the wraps diagonally into bite-sized pieces. Secure with toothpicks.\n",
        "picture_link": "R/JXAiuooKlZA8Ofem34XuuYi7m9ugW"
    },
    {
        "title": "Bacon Ranch Pea Salad",
        "ingredients": [
            "4 slices bacon ADVERTISEMENT",
            "1 quart water ADVERTISEMENT",
            "1 (16 ounce) package frozen green peas ADVERTISEMENT",
            "1/3 cup chopped onions ADVERTISEMENT",
            "1/2 cup Ranch dressing ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a skillet over medium-high heat, and cook until evenly brown. Drain, crumble, and set aside.\nBring the water to a boil in a pot. Boil the peas 1 minute, until just tender, and drain. Cool peas under cold running water.\nIn a bowl, toss together bacon, peas, onion, Ranch dressing, and Cheddar cheese. Refrigerate 30 minutes or until chilled before serving.\n",
        "picture_link": "k1AjY7n.69tYkTvMbSFq0hwg0H8SE9O"
    },
    {
        "title": "Caramel Brownies II",
        "ingredients": [
            "1 (14 ounce) package individually wrapped caramels ADVERTISEMENT",
            "2/3 cup evaporated milk ADVERTISEMENT",
            "1 (18.25 ounce) package German chocolate cake mix ADVERTISEMENT",
            "3/4 cup butter, melted ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease one 9x13 inch baking dish.\nMelt caramels and 1/3 cup of the evaporated milk over very low heat, stirring occasionally until smooth.\nCombine cake mix, melted butter, the remaining 1/3 cup evaporated milk, vanilla and nuts. Mix well and spread 1/2 of the batter into the prepared pan.\nBake at 350 degrees F (175 degrees C) for 8 minutes.\nSprinkle the chocolate chips evenly over the partially cooked brownies. Pour the melted caramel mixture over the top and with a teaspoon drop the remaining 1/2 of the batter evenly over the top.\nBake at 350 degrees F (175 degrees C) for 20 minutes. Let brownies cool in pan then cut into bars.\n",
        "picture_link": "xIbx.sCe10e7C6YeM/tYCKpw3fzC5Zq"
    },
    {
        "title": "Black Bean Salsa",
        "ingredients": [
            "3 (15 ounce) cans black beans, drained and rinsed ADVERTISEMENT",
            "1 (11 ounce) can Mexican-style corn, drained ADVERTISEMENT",
            "2 (10 ounce) cans diced tomatoes with green chile peppers, partially drained ADVERTISEMENT",
            "2 tomatoes, diced ADVERTISEMENT",
            "2 bunches green onions, chopped ADVERTISEMENT",
            "cilantro leaves, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix together black beans, Mexican-style corn, diced tomatoes with green chile peppers, tomatoes and green onion stalks. Garnish with desired amount of cilantro leaves. Chill in the refrigerator at least 8 hours, or overnight, before serving.\n",
        "picture_link": "MH1AXLCHt.yTbHzINIkjsiy0fquQGKm"
    },
    {
        "title": "Christmas Wreaths",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "30 large marshmallows ADVERTISEMENT",
            "1 1/2 teaspoons green food coloring ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "4 cups cornflakes cereal ADVERTISEMENT",
            "2 tablespoons cinnamon red hot candies ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large saucepan over low heat. Add marshmallows, and cook until melted, stirring constantly. Remove from heat, and stir in the food coloring, vanilla, and cornflakes.\nQuickly drop heaping tablespoonfuls of the mixture onto waxed paper, and form into a wreath shape with lightly greased fingers. Immediately decorate with red hot candies. Allow to cool to room temperature before removing from waxed paper, and storing in an airtight container.\n",
        "picture_link": "QWIBHmZLZncvJ4odBVL.3s7RNbszEZm"
    },
    {
        "title": "Sweet, Salty, Spicy Party Nuts",
        "ingredients": [
            "Cooking spray ADVERTISEMENT",
            "1 cup untoasted walnut halves ADVERTISEMENT",
            "1 cup untoasted pecan halves ADVERTISEMENT",
            "1 cup unsalted, dry roasted almonds ADVERTISEMENT",
            "1 cup unsalted, dry roasted cashews ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1/4 teaspoon ground cumin ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with aluminum foil and lightly coat with cooking spray.\nCombine walnut halves, pecan halves, almonds, and cashews in a large bowl. Add salt, black pepper, cumin, and cayenne pepper; toss to coat.\nHeat sugar, water, and butter in a small saucepan over medium heat until the butter is melted. Cook for 1 minute and remove from heat. Slowly pour butter mixture over the bowl of nuts and stir to coat.\nTransfer nuts to the prepared baking sheet and spread into a single layer.\nBake nuts in the preheated oven for 10 minutes. Stir nuts until the warm syrup coats every nut. Spread into a single layer, return to the oven, and bake until nuts are sticky and roasted, about 6 minutes. Allow to cool before serving.\n",
        "picture_link": "wKVUEGJOf/FNHsPYraNEjeRYmf4x9um"
    },
    {
        "title": "Italian Biscotti",
        "ingredients": [
            "12 ounces butter ADVERTISEMENT",
            "1 3/4 cups white sugar ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "1 teaspoon anise extract ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "6 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "8 ounces chopped almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F ( 165 degrees C ).\nIn a large bowl, cream the butter and sugar together. Add eggs one at a time; beat until fluffy. Stir in the anise and vanilla extracts. Sift together the flour, baking powder, and salt; Add them to the egg mixture along with the chopped almonds. Stir with a spoon and as the dough comes together, Knead by hand.\nDivide the dough into 4 parts. Roll each piece into a log about 15 inches long. Place logs onto cookie sheets, 2 to a sheet, the long way. Flatten the logs out until they are about 3 inches wide with a slight hump going down the middle. Bake for 25 to 30 minutes in the preheated oven, loaves should be firm. Cut the loaves into diagonal slices 1/2 inch wide, place the slices onto the cookie sheets and return to the oven. Toast on one side, then turn them over to do the other side. This will take about 7 to 10 minutes.\n",
        "picture_link": "xjc8LJkoefxKVQUN6eoo7GdnLU8hKZK"
    },
    {
        "title": "Baked Spinach Artichoke Dip",
        "ingredients": [
            "1 (10 ounce) package frozen chopped spinach, thawed ADVERTISEMENT",
            "1 (14 ounce) can artichoke hearts, drained and chopped ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "1/4 teaspoon ground white pepper ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl, combine spinach, artichoke hearts, 1/2 cup Parmesan cheese, mozzarella cheese, white pepper, and lemon juice. Mix well, and spoon mixture into a 1 quart baking dish. Top with remaining 1/4 cup parmesan cheese.\nBake for 15 to 20 minutes, or until hot and bubbly.\n",
        "picture_link": "8x/f4kJHNLbw269Rb8bTJMWgsIRJap."
    },
    {
        "title": "Sauteed Green Beans",
        "ingredients": [
            "5 slices bacon ADVERTISEMENT",
            "1/2 cup slivered almonds ADVERTISEMENT",
            "1 (16 ounce) package frozen cut green beans ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large skillet over medium-high heat. Cook until browned on one side, then turn over to cook on the other side. Add the almonds to the skillet at this time, and cook, stirring until light golden brown.\nRemove the bacon from the skillet, leaving the bacon drippings. Crumble or chop bacon, and return to the skillet. Melt the butter in with the drippings. Add the green beans; cook and stir until tender, about 8 minutes.\n",
        "picture_link": "Ga7TZeWiXA9wsM7/XrIF1Kdke0jqlHK"
    },
    {
        "title": "Special Irish Beef Stew",
        "ingredients": [
            "2 teaspoons vegetable oil ADVERTISEMENT",
            "1 pound lean beef stew meat ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "2 cups sliced fresh mushrooms ADVERTISEMENT",
            "6 cloves garlic, minced ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "2 cups beef broth ADVERTISEMENT",
            "1 (12 fluid ounce) can or bottle Irish stout beer ADVERTISEMENT",
            "4 cups sliced carrot ADVERTISEMENT",
            "2 large potatoes, peeled and diced ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1 tablespoon cold water ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a Dutch oven or large pot over medium-high heat. Coat beef cubes with flour, shaking off the excess. Fry beef cubes until browned on all sides. Remove from the pot. Add the onion, mushrooms, and garlic to the pot, and cook stirring constantly until onion is tender, about 3 minutes.\nReturn beef to the pot, and stir in tomato paste, beef broth, and beer. Add potatoes and carrots, cover, and simmer over low heat for about 1 hour. Mix together the cornstarch and cold water. Stir into the stew, and simmer until thickened. Sprinkle with parsley and serve.\n",
        "picture_link": "LBYUjhHQJ/lkv4sHVSsi9s1BZ968.F6"
    },
    {
        "title": "Gobi Aloo (Indian Style Cauliflower with Potatoes)",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 teaspoon cumin seeds ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1 teaspoon ginger paste ADVERTISEMENT",
            "2 medium potatoes, peeled and cubed ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon garam masala ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 pound cauliflower ADVERTISEMENT",
            "1 teaspoon chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a medium skillet over medium heat. Stir in the cumin seeds, garlic, and ginger paste. Cook about 1 minute until garlic is lightly browned. Add the potatoes. Season with turmeric, paprika, cumin, garam masala, and salt. Cover and continue cooking 5 to 7 minutes stirring occasionally.\nMix the cauliflower and cilantro into the saucepan. Reduce heat to low and cover. Stirring occasionally, continue cooking 10 minutes, or until potatoes and cauliflower are tender.\n",
        "picture_link": "JFRlGYFIlyNVQZ/MsWkJ72J6q8gTUXG"
    },
    {
        "title": "Poppy Seed Chicken II",
        "ingredients": [
            "5 cups chopped cooked chicken ADVERTISEMENT",
            "1 (10.5 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 1/2 cups crushed buttery round crackers ADVERTISEMENT",
            "1 teaspoon poppy seeds ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nPlace the chicken into a 9x13 inch baking dish. In a medium bowl, stir together the condensed soup and sour cream. Pour over the chicken. In a separate bowl, stir together the crushed crackers, poppy seeds and melted butter. Sprinkle over the chicken and sauce.\nBake for 30 minutes in the preheated oven, until the top of the casserole is browned and the sauce is bubbly.\n",
        "picture_link": "f05PjvvgSBlzS0XXkRz2D9/mutQbRKu"
    },
    {
        "title": "French Toast Stars",
        "ingredients": [
            "8 thick slices white bread ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/4 cup heavy cream ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1 tablespoon grated orange zest ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place a slice of bread on a cutting board. Align a star-shaped cookie cutter in the center of the slice. Push the cookie cutter through the bread, rocking it gently back and forth. Once the cookie cutter makes it all the way through bread, remove bread outside the cutter. Hold the cutter down on the bread during this step to prevent the star from tearing. Use a sharp knife to trim any bread that lingers outside the cookie cutter. Gently remove the star from the cutter and put aside. Repeat on all slices of bread.\nIn a medium bowl, beat together eggs, whipping cream, honey, salt, cinnamon, orange zest and vanilla extract.\nIn a griddle or frying pan, melt the butter over medium high heat.\nDip both sides of the stars in the egg mixture and carefully transfer to the hot griddle. Brown on both sides and transfer to a warm plate while remaining stars cook. Serve hot.\n",
        "picture_link": "7fYoPYXrRTrGQtRRZXX83Y6KKaZD5vO"
    },
    {
        "title": "Cheesy Vegetable Lasagna",
        "ingredients": [
            "12 lasagna noodles ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 heads fresh broccoli, chopped ADVERTISEMENT",
            "2 carrots, thinly sliced ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "2 green bell peppers, chopped ADVERTISEMENT",
            "2 small zucchini, sliced ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "3 cups milk ADVERTISEMENT",
            "3/4 cup Parmesan cheese, divided ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon pepper ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped spinach, thawed ADVERTISEMENT",
            "1 (8 ounce) container small curd cottage cheese ADVERTISEMENT",
            "24 ounces ricotta cheese ADVERTISEMENT",
            "2 1/2 cups shredded mozzarella cheese, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease a 9x13-inch casserole dish.\nBring a large pot of lightly salted water to a boil. Add lasagna noodles and cook for 8 to 10 minutes or until al dente; drain.\nHeat oil in a large cast iron skillet over medium heat. When oil is hot add broccoli, carrots, onions, bell peppers, zucchini and garlic. Saute for 7 minutes; set aside.\nPlace flour in a medium saucepan and gradually whisk in milk until well blended. Bring to a boil over medium heat. Cook 5 minutes, or until thick, stirring constantly. Stir in 1/2 cup Parmesan cheese, salt and pepper; cook for 1 minute, stirring constantly. Remove from heat; stir in spinach. Reserve 1/2 cup spinach mixture. In a small bowl, combine cottage and ricotta cheeses; stir well.\nSpread about 1/2 cup of spinach mixture in the bottom of the prepared pan. Layer noodles, ricotta mixture, vegetables, spinach mixture, and 2 cups mozzarella cheese, ending with noodles. Top with reserved spinach mixture, 1/2 cup mozzarella cheese and 1/4 cup parmesan cheese.\nBake in preheated oven for 35 minutes, or until lightly browned on top. Cool for approximately 10 minutes before serving.\n",
        "picture_link": "06T30jZEpaokN5DGCmLqIAFfZvSrYRi"
    },
    {
        "title": "Jersey Fresh Tomato Soup",
        "ingredients": [
            "7 cups peeled, seeded, and chopped tomato ADVERTISEMENT",
            "1 cup finely chopped carrots ADVERTISEMENT",
            "3/4 cup finely chopped onion ADVERTISEMENT",
            "1 (13.75 ounce) can chicken broth ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "2 teaspoons sea salt ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1 cup 2% milk ADVERTISEMENT",
            "2 teaspoons dried basil ADVERTISEMENT",
            "1/2 teaspoon celery salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring the tomatoes, carrots, and onion to a boil over medium-high heat in a stockpot, then reduce heat to medium-low. Simmer for 30 minutes. Stir in the chicken broth, sugar, and salt.\nMelt the butter over medium-low heat in a small saucepan. Whisk in the flour, stirring until thick. Slowly whisk in the milk until smooth. Cook and stir, whisking constantly until thickened, about 5 minutes, then stir milk mixture in to the stockpot. Season with basil, celery salt, black pepper, and garlic powder. Continue to simmer the soup on low to reduce and thicken, about 1 hour.\n",
        "picture_link": "PCgUaKASVEKgOR5vhp9cHz5DnqGDmB2"
    },
    {
        "title": "Ropa Vieja in a Slow Cooker",
        "ingredients": [
            "1 (2 pound) beef chuck pot roast ADVERTISEMENT",
            "3 cloves garlic ADVERTISEMENT",
            "2 red bell peppers, cut into large wedges ADVERTISEMENT",
            "2 green bell peppers, cut into large wedges ADVERTISEMENT",
            "1 yellow onion, cut into wedges ADVERTISEMENT",
            "1 sweet onion, cut into wedges ADVERTISEMENT",
            "1/2 (6 ounce) can tomato paste, or to taste ADVERTISEMENT",
            "1/4 cup red wine vinegar ADVERTISEMENT",
            "1/8 teaspoon garlic powder, or to taste ADVERTISEMENT",
            "1/8 teaspoon seasoned salt, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pierce the beef roast to tenderize it and let the flavors in, and place it into a slow cooker with the garlic, red bell peppers, green bell peppers, yellow onions and sweet onions. Stir in the tomato paste and red wine vinegar. Sprinkle with the garlic powder, seasoned salt, salt, and ground black pepper.\nCover, and cook on Low until the beef is tender, 7 to 8 hours. Remove beef, and shred into long strands using two forks. Return the meat to the slow cooker and combine with the vegetables.\nCook on Low until the meat and vegetables are very tender, about 30 minutes.\n",
        "picture_link": "BR7B7MCapaluyiThxuXx2RNf7bj7E4y"
    },
    {
        "title": "Linda's Monster Cookies",
        "ingredients": [
            "1 cup margarine ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "2 cups light brown sugar ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "4 cups rolled oats ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "1 cup candy-coated chocolate pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nIn a very large bowl, cream together the margarine, butter, brown sugar and white sugar until smooth. Beat in the eggs one at a time then stir in the vanilla. Combine the flour, baking soda, baking powder, salt and rolled oats; stir into the sugar mixture. Mix in chocolate chips and candy-coated chocolate pieces. Drop by tablespoonfuls onto the prepared cookie sheets.\nBake for 10 to 11 minutes in the preheated oven, or until the edges are golden. If you like chewy cookies, take them out before they look done.\n",
        "picture_link": "/Ud7Um.wN/jJWV2VjEW2.8Yddb2CmlS"
    },
    {
        "title": "Ham with Pineapple",
        "ingredients": [
            "1 (12 pound) bone-in ham ADVERTISEMENT",
            "1/2 cup whole cloves ADVERTISEMENT",
            "1 (20 ounce) can pineapple rings in heavy syrup ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1 (12 fluid ounce) can or bottle lemon-lime flavored carbonated beverage ADVERTISEMENT",
            "1 (4 ounce) jar chopped maraschino cherries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 325 degrees F (160 degrees C).\nPlace ham in a roasting pan. Score the rind of the ham with a diamond pattern. Press a clove into the center of each diamond. Drain the juice from the pineapple rings into a medium bowl, and stir in the brown sugar and lemon-lime soda. Coat the ham with this mixture. Arrange the pineapple rings over the outside of the ham. Place a maraschino cherry in the center of each pineapple ring, and secure with a toothpick.\nBake uncovered for 4 to 5 hours, basting frequently with the juices, until the internal temperature of the ham is 160 degrees F (72 degrees C). Be sure the meat thermometer is not touching the bone. Remove toothpicks before serving.\n",
        "picture_link": "5LX88Ns5F5l2.QgNEjaCz86tE7To/1O"
    },
    {
        "title": "Chicken Broth in a Slow Cooker",
        "ingredients": [
            "2 1/2 pounds bone-in chicken pieces ADVERTISEMENT",
            "6 cups water ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "2 carrots, chopped ADVERTISEMENT",
            "1 onion, quartered ADVERTISEMENT",
            "1 tablespoon dried basil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the chicken pieces, water, celery, carrots, onion, and basil in a slow cooker.\nCook on Low setting for 8 to 10 hours. Strain before using, and discard vegetables. Chicken may be removed from the bones, and used in soup.\n",
        "picture_link": "kAPAoTo9t31zWr3rt4qunpJflv6sN0q"
    },
    {
        "title": "Spicy Shrimp and Grits",
        "ingredients": [
            "4 cups chicken broth ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 cup quick-cooking grits ADVERTISEMENT",
            "2 tablespoons margarine ADVERTISEMENT",
            "1 bunch green onions, chopped ADVERTISEMENT",
            "1 green bell pepper, diced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 pound peeled and deveined small shrimp ADVERTISEMENT",
            "1 cup shredded Monterey Jack cheese ADVERTISEMENT",
            "3/4 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "1 (10 ounce) can diced tomatoes and green chilies ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "1/4 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x12 inch baking dish.\nBring chicken broth and salt to a boil in a large saucepan over high heat. Stir in the grits, return to a simmer, then reduce heat to medium-low, and continue cooking for 20 minutes, stirring frequently.\nMeanwhile, melt the margarine in a skillet over medium heat. Stir in the green onions, green pepper, and garlic; cook until the peppers have softened, about 5 minutes. Stir in the shrimp, and cook until they begin to firm.\nStir the Monterey Jack cheese, 3/4 cup Cheddar cheese, shrimp and vegetable mixture, canned tomatoes, and black pepper into the grits; pour into prepared baking dish and sprinkle with remaining 1/4 cup Cheddar cheese.\nBake in preheated oven until the cheese is bubbly and beginning to brown, 30 to 45 minutes.\n",
        "picture_link": "WwfFqL7cJWTdye.IjiIuChfhdIqsLsi"
    },
    {
        "title": "Tofu Peanut Stir-Fry",
        "ingredients": [
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "1 (16 ounce) package frozen stir-fry vegetables ADVERTISEMENT",
            "1/2 teaspoon minced fresh ginger ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 cup cornstarch ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 (14 ounce) package firm tofu, drained and cubed ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "3/4 cup peanut sauce ADVERTISEMENT",
            "1/4 cup chopped peanuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a large skillet or wok over medium heat, and cook the vegetables until tender. Mix in the ginger, and season with salt and pepper. Remove vegetables from skillet, and set aside.\nPlace the eggs in a bowl. In a separate bowl, mix the cornstarch, salt, and pepper. Dip tofu cubes first in the egg, then the cornstarch mixture to coat.\nHeat the remaining oil in the skillet or wok over medium heat, and cook the coated tofu 5 minutes, or until golden brown. Stir in the peanut sauce and peanuts. Continue to cook and stir until sauce has thickened and tofu is well-coated. Serve with the vegetables.\n",
        "picture_link": "nPapgskZFg2AFz.Oa5bQr7zI5rfs0bS"
    },
    {
        "title": "Throw Together Mexican Casserole",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 (15 ounce) can sweet corn, drained ADVERTISEMENT",
            "1 cup mild, chunky salsa ADVERTISEMENT",
            "1/4 cup sliced black olives ADVERTISEMENT",
            "3 1/2 cups cooked egg noodles ADVERTISEMENT",
            "1 (15.25 ounce) can kidney beans, drained and rinsed ADVERTISEMENT",
            "1/4 cup taco sauce ADVERTISEMENT",
            "1 (1.25 ounce) package taco seasoning mix ADVERTISEMENT",
            "1/2 cup tomato sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nIn a skillet over medium heat, cook the ground beef until evenly brown; drain.\nIn a 9x13 inch baking dish combine the beef, corn, salsa, olives, cooked noodles, beans, taco sauce, seasoning mix and tomato sauce.\nBake in the preheated oven for 1/2 hour, or until cooked through.\n",
        "picture_link": "Mf4qC5Ye1Q0DqEi.zc2L1Ymf33IAB6i"
    },
    {
        "title": "Cheesy Buffalo Chicken Dip",
        "ingredients": [
            "2 bone-in chicken breast halves ADVERTISEMENT",
            "1 teaspoon olive oil ADVERTISEMENT",
            "1 stalk celery, finely diced ADVERTISEMENT",
            "1 (8 ounce) package reduced-fat cream cheese ADVERTISEMENT",
            "3/4 cup blue cheese dressing ADVERTISEMENT",
            "3/4 cup ranch dressing ADVERTISEMENT",
            "1/3 cup hot pepper sauce (such as Frank's RedHot®) ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken breasts in a large saucepan; cover with water. Boil until cooked through, about 20 minutes. Remove from water, and cool. Pull meat from bones and skin. Shred meat and reserve.\nPreheat oven to 350 degrees F (175 degrees C).\nHeat olive oil in large skillet. Stir in celery; cook until soft. Mix in the cream cheese, blue cheese dressing, and ranch dressing. Cook and stir until smooth and creamy. Stir in the shredded chicken and hot sauce. Spoon mixture into an 8x8 baking dish. Sprinkle with the shredded cheese.\nBake in preheated oven until golden and bubbly, about 30 minutes.\n",
        "picture_link": "lbgyKzXuhowy9GaTK.OHgILSkh7TSEW"
    },
    {
        "title": "Southern Pecan Pie I",
        "ingredients": [
            "3 eggs ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup corn syrup ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups pecan halves ADVERTISEMENT",
            "1 recipe pastry for a 9 inch single crust pie ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (205 degrees C).\nBeat eggs slightly in medium bowl. Beat in sugar, and then blend in syrup, butter or margarine, vanilla, salt, and pecans. Pour filling into unbaked pie shell.\nBake in preheated oven for 15 minutes. Reduce heat to 350 degrees F (175 degrees C), and continue baking 35 to 40 minutes; the pie will be brown and slightly puffed.\n",
        "picture_link": "1ALxQy1gLQNUV4mAor0NdJATbkGC0HC"
    },
    {
        "title": "Spicy African Yam Soup",
        "ingredients": [
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1 large sweet potato, peeled and diced ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "4 cups chicken broth ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1 cup chunky salsa ADVERTISEMENT",
            "1 (15.5 ounce) can garbanzo beans, drained ADVERTISEMENT",
            "1 cup diced zucchini ADVERTISEMENT",
            "1/2 cup cooked rice ADVERTISEMENT",
            "2 tablespoons creamy peanut butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a stockpot over medium heat. Saute onion, sweet potato, and garlic until onion is soft. Turn down heat if necessary to prevent burning.\nStir in the chicken broth, thyme and cumin. Bring to a boil, cover and simmer for about 15 minutes. Stir in salsa, garbanzo beans and zucchini. Simmer until tender, about 15 minutes.\nStir in the cooked rice and peanut butter until the peanut butter has dissolved. Serve hot with pita chips and a green salad.\n",
        "picture_link": "Qp6qi5fta0uHpTDsEb8YFe1UTh59in6"
    },
    {
        "title": "Very Easy Mushroom Barley Soup",
        "ingredients": [
            "1/4 cup olive oil ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "3/4 cup diced carrots ADVERTISEMENT",
            "1/2 cup chopped celery ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1 pound sliced fresh mushrooms ADVERTISEMENT",
            "6 cups chicken broth ADVERTISEMENT",
            "3/4 cup barley ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a large soup pot over medium heat. Add the onion, carrots, celery and garlic; cook and stir until onions are tender and transparent. Stir in mushrooms and continue to cook for a few minutes. Pour in the chicken broth and add barley. Bring to a boil, then reduce heat to low. Cover and simmer until barley is tender, about 50 minutes. Season with salt and pepper before serving.\n",
        "picture_link": "KF/xBKWQz7qgb.VN4lwxeSJhHucZ4D6"
    },
    {
        "title": "Banana Nut Muffins",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "1 cup mashed bananas ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "1 teaspoon lemon zest ADVERTISEMENT",
            "1/4 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray muffin tins with non-stick cooking spray.\nIn large bowl, stir together flour, baking powder, soda, and salt.\nIn a medium bowl, beat egg whites slightly. Stir in bananas, sugar, oil, and lemon peel. Add to flour mixture, stirring just until combined. Stir in walnuts. Fill muffin pan cups 2/3 full.\nBake for about 20 to 25 minutes, or until tops are lightly browned. Remove muffins from pan.\n",
        "picture_link": "PKtHnJY/0K1aQI1OCDYsh/EAccHF.Yy"
    },
    {
        "title": "Chocolate-Zucchini Cupcakes",
        "ingredients": [
            "2 (1 ounce) squares unsweetened chocolate, melted ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 3/4 cups packed brown sugar ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 cups grated zucchini ADVERTISEMENT",
            "3/4 cup chopped walnuts ADVERTISEMENT",
            "1 (16 ounce) package chocolate frosting ADVERTISEMENT",
            "1/2 cup walnut halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nIn a large bowl, beat eggs with sugar for about 10 minutes or until thickened and pale. Blend oil and cooled chocolate into the beaten egg mixture.\nIn a small bowl stir together flour, baking powder, baking soda and salt; stir flour mixture into egg mixture until just blended. Stir in zucchini and chopped nuts. Using an ice-cream scoop, spoon batter into 24 paper-lined or greased muffin cups, filling the cups 2/3 full.\nBake for 20 minutes or until fork or toothpick inserted in a cupcake's center comes out clean. Let cool in pans on rack for 10 minutes. Remove from pans; let cool completely. Spread with chocolate frosting and garnish with walnut or pecan halves.\n",
        "picture_link": "iH8Ldw8pEFqGJvmaKawcDoISBGJQsQu"
    },
    {
        "title": "Chicken Salad with Bacon, Lettuce, and Tomato",
        "ingredients": [
            "5 slices bacon ADVERTISEMENT",
            "3 cups diced cooked chicken ADVERTISEMENT",
            "1 cup chopped fresh tomato ADVERTISEMENT",
            "2 stalks celery, thinly sliced ADVERTISEMENT",
            "3/4 cup mayonnaise ADVERTISEMENT",
            "2 tablespoons minced green onion ADVERTISEMENT",
            "1 tablespoon chopped parsley ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1 dash Worcestershire sauce ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "12 leaves romaine lettuce ADVERTISEMENT",
            "1 large avocado, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels; crumble.\nStir chicken, bacon, tomato, and celery together in a bowl.\nWhisk mayonnaise, parsley, green onions, lemon juice, Worcestershire sauce, salt, and black pepper together in a bowl until dressing is smooth. Pour dressing over chicken mixture; toss to coat. Refrigerate until chilled, at least 30 minutes.\nStir chicken mixture and serve over romaine lettuce leaves; garnish with avocado slices.\n",
        "picture_link": "EtWzV5UNYQrAwWSHuCgK.2RPy6K655K"
    },
    {
        "title": "Brown Rice, Broccoli, Cheese and Walnut Surprise",
        "ingredients": [
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1/2 teaspoon minced garlic ADVERTISEMENT",
            "1 cup uncooked instant brown rice ADVERTISEMENT",
            "1 cup vegetable broth ADVERTISEMENT",
            "1 pound fresh broccoli florets ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Place walnuts on small baking sheet, and bake for 6 to 8 minutes or until toasted.\nMelt butter in a medium saucepan over medium heat. Cook onion and garlic in melted butter for 3 minutes, stirring frequently. Stir in the rice, add the broth, and bring to a boil. Reduce heat to medium-low. Cover, and simmer until liquid is absorbed, about 7 to 8 minutes.\nPlace broccoli in a microwave-safe casserole dish, and sprinkle with salt and pepper. Cover, and microwave until tender.\nSpoon rice onto a serving platter, and top with broccoli. Sprinkle walnuts and cheese on top.\n",
        "picture_link": "llf82jQkofChFh9..WcfvPtTg5kA2SK"
    },
    {
        "title": "Indian Chicken Curry I",
        "ingredients": [
            "8 bone-in chicken breast halves, skinless ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 onions, peeled and quartered ADVERTISEMENT",
            "1 teaspoon finely chopped fresh ginger root ADVERTISEMENT",
            "1 teaspoon crushed garlic ADVERTISEMENT",
            "1 tablespoon hot (Madras) curry powder ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "1 (10 ounce) can coconut milk ADVERTISEMENT",
            "4 whole cloves ADVERTISEMENT",
            "4 pods cardamom ADVERTISEMENT",
            "1 cinnamon stick ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse chicken and pat dry; season with salt and pepper to taste. Heat oil in a large skillet over medium high heat, then saute chicken until browned. Remove chicken from skillet and set aside.\nSaute onions in skillet until translucent; add ginger and garlic and saute until fragrant, then stir in curry powder.\nReturn chicken to skillet and add tomato sauce, coconut milk, cloves, cardamom and cinnamon stick. Season with salt to taste and stir all together.\nReduce heat to low and simmer until chicken is tender and cooked through (no longer pink inside), about 20 to 25 minutes.\n",
        "picture_link": "DJJqAEIN41VAC5TcvKFrGIpDmpjKBIi"
    },
    {
        "title": "Lasagna Stuffed Shells",
        "ingredients": [
            "18 jumbo pasta shells ADVERTISEMENT",
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "2 tablespoons chopped onion ADVERTISEMENT",
            "1 (12 ounce) can tomato paste ADVERTISEMENT",
            "1 (14 ounce) can tomato sauce ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3 cups cottage cheese ADVERTISEMENT",
            "1 (16 ounce) package shredded mozzarella cheese, divided ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "2 tablespoons dried parsley ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 375 degrees F (190 degrees C). Fill a large pot with lightly-salted water and bring to a rolling boil; stir in the shell pasta and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has nearly cooked through but still very firm to the bite, about 5 minutes. Drain well and rinse with cold water.\nWhile the shells are cooking, heat a large skillet over medium-high heat; cook and stir the beef and onion in the hot skillet until the beef is crumbly, evenly browned, and no longer pink. Drain and discard any excess grease; stir in the tomato paste, tomato sauce, salt, oregano, and garlic powder. Bring to a simmer and cook for 5 minutes. Spread half of the sauce into a 9x13-inch baking dish.\nBeat the eggs in a mixing bowl. Stir in the cottage cheese, 3/4 of the mozzarella cheese, Parmesan cheese, parsley, salt, and pepper. Spoon the cheese mixture into the shells and set them into the prepared baking dish. Once all the shells have been filled, pour the remaining meat sauce over the shells and sprinkle with the remaining mozzarella cheese.\nBake in the preheated oven until the shells are hot in the center and the mozzarella cheese is melted and bubbly, 25 to 30 minutes.\n",
        "picture_link": "guZk0R24HKtUN2kEHOkPePbanJatyGq"
    },
    {
        "title": "Pan Seared Lemon Tilapia with Parmesan Pasta",
        "ingredients": [
            "4 ounces elbow macaroni ADVERTISEMENT",
            "2 tablespoons light olive oil ADVERTISEMENT",
            "2 tilapia fillets ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1/8 teaspoon dried oregano ADVERTISEMENT",
            "1 pinch dried basil ADVERTISEMENT",
            "1 pinch dried cilantro ADVERTISEMENT",
            "1 pinch salt and ground black pepper ADVERTISEMENT",
            "For the pasta: ADVERTISEMENT",
            "1 tablespoon light olive oil ADVERTISEMENT",
            "1/4 cup freshly grated Parmesan cheese ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1 pinch garlic powder ADVERTISEMENT",
            "1 pinch dried basil ADVERTISEMENT",
            "1 pinch dried oregano ADVERTISEMENT",
            "1 pinch dried cilantro (optional) ADVERTISEMENT",
            "1 pinch salt and ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a saucepan of lightly salted water to a boil over medium heat, stir in the macaroni, and return to a boil. Cook the macaroni uncovered, stirring occasionally, until it is cooked through but still firm to the bite, about 8 minutes. Drain well.\nMeanwhile, heat 2 tablespoons of olive oil in a skillet over medium heat. Sprinkle both sides of the tilapia fillets with lemon juice, oregano, basil, cilantro, salt, and pepper, and lay the fillets in the heated skillet, making sure they don't touch. Sear the fillets for 2 to 4 minutes on each side, until the fish is golden brown on the outside, and opaque and flaky inside.\nReturn the hot, cooked macaroni to the saucepan, and stir in 1 tablespoon of olive oil to coat the pasta. Sprinkle on the Parmesan cheese, stir to mix, and stir in 1 teaspoon of lemon juice, the garlic powder, basil, oregano, cilantro, salt, and pepper. Divide the pasta between two plates, and top each with a tilapia fillet.\n",
        "picture_link": "sPEkEyjYp0X7VptzTdWJxqA9q/Q/FmS"
    },
    {
        "title": "Sunday's Apple Pie",
        "ingredients": [
            "1 recipe pastry for a 9 inch double crust pie ADVERTISEMENT",
            "6 tart apples - peeled, cored and sliced ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "3 tablespoons butter, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Place a baking sheet on an oven rack.\nPlace sliced apples in a large bowl. In a small bowl, combine sugar, cinnamon, and flour. Stir well and pour mixture over apples. Cut half of butter into small pieces and add to apples. Toss apples until thoroughly coated.\nRoll out pastry to fit an 8- or 9-inch pie plate. Roll out top crust and set aside. Pour apples into pastry-lined pie pan.\nDot apples with remaining butter. Place second pastry on top. Seal edges and cut steam vents in top crust.\nBake in preheated oven on the baking sheet until apple filling is bubbly and crust is golden brown, 50 minutes to 1 hour.\n",
        "picture_link": "H5lVVLkRUQc30p3n3SQs8lUyRZUvlCG"
    },
    {
        "title": "Mexican Style Cornbread",
        "ingredients": [
            "2 eggs ADVERTISEMENT",
            "1/4 cup corn oil ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "1 1/2 cups shredded Cheddar cheese ADVERTISEMENT",
            "1 (8 ounce) can cream-style corn ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "2 fresh jalapeno peppers, seeded and minced ADVERTISEMENT",
            "1 cup cornmeal ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease an 8 inch square baking dish or a cast iron skillet.\nIn a small bowl, beat eggs. Mix in corn oil and buttermilk. Stir in 1 cup shredded cheese, creamed corn, onion, and jalapenos.\nIn a large bowl, whisk together cornmeal, flour, baking powder, soda, and salt. Stir the egg mixture into the dry ingredients. Mix well. Pour batter into prepared pan. Sprinkle remaining 1/2 cup cheese on top.\nBake for 30 to 35 minutes until center is set and top is golden brown.\n",
        "picture_link": "DdX4umL406PT3.KBWwPUj5eSdKpa5OC"
    },
    {
        "title": "Spicy Pumpkin Chili",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1/2 teaspoon crushed red pepper flakes, or to taste ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1/2 large onion, diced ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "1 (15 ounce) can kidney beans, rinsed and drained ADVERTISEMENT",
            "1 (15 ounce) can black beans, rinsed and drained ADVERTISEMENT",
            "1 (15 ounce) can Great Northern beans, drained and rinsed ADVERTISEMENT",
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "1 (4 ounce) can tomato sauce with garlic and onions ADVERTISEMENT",
            "2 (14.5 ounce) cans petite diced tomatoes ADVERTISEMENT",
            "1 (14.5 ounce) can fire roasted diced tomatoes ADVERTISEMENT",
            "1 (15 ounce) can pumpkin puree ADVERTISEMENT",
            "2 teaspoons pumpkin pie spice ADVERTISEMENT",
            "2 teaspoons chili powder ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon salt, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium-high heat; cook and stir the beef in the skillet until crumbly and no longer pink, about 5 minutes. Stir in the red pepper flakes, garlic, and onion; continue cooking until the beef has browned and the onion has softened and turned translucent. Add the green and red bell pepper and cook 5 minutes more.\nWhile the beef is cooking, combine the kidney beans, black beans, Great Northern beans, tomato sauce, tomato sauce with garlic and onions, petite diced tomatoes, fire roasted diced tomatoes, and pumpkin puree in a large slow cooker. Season with pumpkin pie spice, chili powder, cumin, and salt. Stir in the ground beef mixture.\nCook on Low until the chili is hot, 1 to 2 hours.\n",
        "picture_link": "c1qsGwWoZk.A8XR1R62F1C/x3V0ITJK"
    },
    {
        "title": "Maple Pecan Shortbread Squares",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/3 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup softened butter ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/3 cup packed brown sugar ADVERTISEMENT",
            "3 tablespoons pure maple syrup ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C).\nCombine the flour and 1/3 cup brown sugar in a mixer. Mix in the softened butter until a dough has formed. Press into an ungreased 8x8-inch baking dish, and prick with a fork.\nBake the shortbread in the preheated oven until golden brown, about 20 minutes. While the shortbread is baking, beat the egg in a mixing bowl along with 1/3 cup brown sugar, maple syrup, and pecans. Pour the pecan mixture over the hot crust, and return to the oven. Continue baking until firmed, 12 to 15 minutes. Remove from the oven, and immediately run a knife around the edges to prevent sticking. Cool completely, then cut into 1-inch squares to serve.\n",
        "picture_link": "vT/IxwEaAPtA1/CXCZBHqvVRsW0MDgO"
    },
    {
        "title": "Broccoli Salad I",
        "ingredients": [
            "1 pound bacon ADVERTISEMENT",
            "4 cups broccoli florets ADVERTISEMENT",
            "5 green onions, chopped ADVERTISEMENT",
            "1/4 cup sunflower seeds ADVERTISEMENT",
            "1/4 cup golden raisins ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "6 tablespoons red wine vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large skillet. Cook over medium-high heat until evenly browned. Cool, crumble, and set aside.\nIn a large bowl, toss together broccoli, green onions, sunflower seeds, raisins, and bacon.\nIn a small bowl, mix together mayonnaise, sugar, and red wine vinegar. Toss with vegetables to coat. Cover, and chill until serving.\n",
        "picture_link": "hMWM/MjSGs0DptXdlu43IcXH4Ti71AC"
    },
    {
        "title": "Funnel Cakes I",
        "ingredients": [
            "2 eggs ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "2 cups sifted all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 cups vegetable oil ADVERTISEMENT",
            "1/4 cup confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sift together the flour, baking powder, and salt.\nIn a large mixing bowl, stir together the eggs and the milk. Add flour mixture to the egg mixture, and beat with a mixer until smooth. The consistancy should be thin enough to run through a small kitchen funnel. Test it, and if it is too thick beat in a little more milk; if too thin, beat in a bit more flour.\nIn an eight inch skillet, heat the oil to 360 degrees F (182 degrees C).\nPut your finger over the bottom opening of the funnel, and fill the funnel with a generous 1/2 cup of the batter. Hold the funnel close to the surface of the oil, and release the batter into the oil while making a circular motion. Fry until golden brown. Use tongs and wide spatula to turn the cake over carefully. Fry the second side one minute. Drain on paper towels, and sprinkle with sifted confectioners' sugar.\n",
        "picture_link": "Sdd.j1IDa3JqHg36ZiyX39N9WukpY/u"
    },
    {
        "title": "Enchilada Casserole",
        "ingredients": [
            "1 (15 ounce) can black beans, rinsed and drained ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 (4 ounce) can diced green chile peppers ADVERTISEMENT",
            "1 jalapeno pepper, seeded and minced ADVERTISEMENT",
            "1 (8 ounce) package tempeh, crumbled ADVERTISEMENT",
            "6 (6 inch) corn tortillas ADVERTISEMENT",
            "1 (19 ounce) can enchilada sauce ADVERTISEMENT",
            "1 (6 ounce) can sliced black olives ADVERTISEMENT",
            "8 ounces shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees (175 degrees C). Lightly oil a 9x13 inch baking dish.\nIn a medium bowl, combine the beans, garlic, onion, chile peppers, jalapeno pepper, and tempeh. Pour enchilada sauce into a shallow bowl.\nDip three tortillas in the enchilada sauce, and place them in the prepared baking dish. Be sure to cover the bottom of the dish as completely as possible. Place 1/2 of the bean mixture on top of the tortillas, and repeat. Drizzle the remaining sauce over the casserole, and sprinkle with olives and shredded cheese.\nCover, and bake for 30 minutes. Uncover, and continue baking for an additional 15 minutes, or until the casserole is bubbling and the cheese is melted.\n",
        "picture_link": "9m6LXBiggrXQPfYXc4QKMiH.Z/Z67.K"
    },
    {
        "title": "Mushroom Pie",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 (10 ounce) package fresh mushrooms, sliced ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "4 slices bacon, chopped ADVERTISEMENT",
            "3/4 cup heavy cream ADVERTISEMENT",
            "1 cup shredded Swiss cheese ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 teaspoon chopped fresh dill ADVERTISEMENT",
            "1 (17.25 ounce) package frozen puff pastry, thawed ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nHeat the oil in a large skillet over medium-high heat. Add the mushrooms, onion and bacon; cook and stir for about 5 minutes, or until vegetables are tender. Reduce the heat to medium, and add the cream and dill; cook and stir for about 10 more minutes. Remove from the heat, and stir in the cheese.\nPlace one sheet of puff pastry on a well oiled baking sheet, and pour the mushroom filling over the top. Cover with the other sheet, and press the edges together to seal. Make some holes in the top with a fork. Brush the top with beaten egg.\nBake for about 40 minutes in the preheated oven, or until golden brown. Cool, then cut into squares to serve.\n",
        "picture_link": "ihEfrL0Z3.F0qCW9ZUSUuJ1w53ziCm2"
    },
    {
        "title": "Oatmeal and Applesauce Pancakes",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/3 cup quick cooking oats ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon cinnamon ADVERTISEMENT",
            "3/4 cup unsweetened applesauce ADVERTISEMENT",
            "1/2 cup fat free sour cream ADVERTISEMENT",
            "1 egg, lightly beaten ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a lightly oiled griddle over medium-low heat.\nIn a bowl, mix the flour, oats, baking powder, baking soda, and cinnamon. In a separate bowl, mix applesauce, sour cream, egg, and vanilla. Stir applesauce mixture and milk into the flour mixture until evenly moist and thick.\nScoop about 1/4 cup batter for each pancake onto the prepared griddle, and cook, turning once, until golden brown on both sides.\n",
        "picture_link": "POQdU9FaiHVY2zV/oKN8.ba8uQnQPTy"
    },
    {
        "title": "Russian Cabbage Borscht",
        "ingredients": [
            "1 1/2 cups thinly sliced potatoes ADVERTISEMENT",
            "1 cup thinly sliced beets ADVERTISEMENT",
            "4 cups vegetable stock or water ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 1/2 cups chopped onions ADVERTISEMENT",
            "1 teaspoon caraway seed (optional) ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 celery stalk, chopped ADVERTISEMENT",
            "1 large carrot, sliced ADVERTISEMENT",
            "3 cups coarsely chopped red cabbage ADVERTISEMENT",
            "black pepper to taste ADVERTISEMENT",
            "1/4 teaspoon fresh dill weed ADVERTISEMENT",
            "1 tablespoon cider vinegar ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1 cup tomato puree ADVERTISEMENT",
            "sour cream, for topping ADVERTISEMENT",
            "chopped tomatoes, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place sliced potatoes and beets in a medium saucepan over high heat; cover with stock, and boil until vegetables are tender. Remove potatoes and beets with a slotted spoon, and reserve stock.\nMelt butter in a large skillet over medium heat. Stir in onions, caraway seeds, and salt; cook until onions become soft and translucent. Then stir in celery, carrots, and cabbage. Mix in reserved stock; cook, covered, until all vegetables are tender, about 10 minutes.\nAdd potatoes and beets to the skillet. Season with black pepper and dill weed. Stir in cider vinegar, honey, and tomato puree. Cover, reduce heat to medium low, and simmer at least 30 minutes. Serve topped with sour cream, extra dill weed, and chopped fresh tomatoes.\n",
        "picture_link": "NzSqx3coVcIq1uD5IQ2aJQk3sHELSmW"
    },
    {
        "title": "New Wife Tuna Salad",
        "ingredients": [
            "4 (5 ounce) cans tuna, drained ADVERTISEMENT",
            "5 hard-boiled eggs, chopped ADVERTISEMENT",
            "1/2 cup chopped sweet onion ADVERTISEMENT",
            "1 stalk celery, chopped ADVERTISEMENT",
            "3/4 cup mayonnaise ADVERTISEMENT",
            "1 1/2 tablespoons dill pickle relish ADVERTISEMENT",
            "2 teaspoons honey mustard ADVERTISEMENT",
            "1/2 teaspoon celery seed ADVERTISEMENT",
            "1/2 teaspoon seasoned salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine tuna, eggs, onion, and celery in a large bowl.\nIn a small bowl, stir together mayonnaise, relish, honey mustard, celery seed, seasoned salt, and pepper. Pour over the ingredients in the other bowl, and stir gently to coat. Serve at room temperature or chill until ready to serve.\n",
        "picture_link": "mgyaOT86Iu883wp6mqMtikR3cwQP6Ku"
    },
    {
        "title": "JIF® Buckeyes",
        "ingredients": [
            "1 1/2 cups Smucker's® Creamy Natural Peanut Butter, stirred OR Jif® Creamy Peanut Butter ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3 cups powdered sugar, or as needed ADVERTISEMENT",
            "1 (12 ounce) package semi-sweet chocolate chips ADVERTISEMENT",
            "2 tablespoons Crisco® All-Vegetable Shortening ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine peanut butter, butter, vanilla and salt in large bowl. Beat with an electric mixer on LOW until blended. Add 2 cups powdered sugar, beating until blended. Beat in additional powdered sugar until mixture, when shaped into a ball, will stay on a toothpick. Shape into 1-inch balls. Refrigerate.\nPlace chocolate chips and shortening in microwave-safe bowl. Microwave on MEDIUM for 30 seconds. Stir. Repeat until mixture is smooth. Reheat as needed while coating peanut butter balls.\nInsert toothpick in peanut butter ball. Dip 3/4 of ball into chocolate, leaving top uncovered to resemble a buckeye. Remove excess. Place on wax paper-lined tray. Remove toothpick. Smooth over holes. Refrigerate until firm.\n",
        "picture_link": "eVeZCAmzFSx4.3cEyPgkKew7glWO1X2"
    },
    {
        "title": "Brazilian Cheese Bread (Pao de Queijo)",
        "ingredients": [
            "1/2 cup olive oil or butter ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "1/3 cup milk or soy milk ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 cups tapioca flour ADVERTISEMENT",
            "2 teaspoons minced garlic ADVERTISEMENT",
            "2/3 cup freshly grated Parmesan cheese ADVERTISEMENT",
            "2 beaten eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nPour olive oil, water, milk, and salt into a large saucepan, and place over high heat. When the mixture comes to a boil, remove from heat immediately, and stir in tapioca flour and garlic until smooth. Set aside to rest for 10 to 15 minutes.\nStir the cheese and egg into the tapioca mixture until well combined, the mixture will be chunky like cottage cheese. Drop rounded, 1/4 cup-sized balls of the mixture onto an ungreased baking sheet.\nBake in preheated oven until the tops are lightly browned, 15 to 20 minutes.\n",
        "picture_link": "OGfIPKIv5MWG0a2m4mD.rs1mFOtU.16"
    },
    {
        "title": "Tomato Gorgonzola Soup",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/4 large red onion, diced ADVERTISEMENT",
            "1/2 cup red bell pepper, diced ADVERTISEMENT",
            "2 cloves cloves garlic, minced ADVERTISEMENT",
            "1/4 cup Gorgonzola cheese, crumbled ADVERTISEMENT",
            "4 ounces cream cheese, softened ADVERTISEMENT",
            "1/4 cup heavy cream ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "1 1/2 cups tomato juice ADVERTISEMENT",
            "2 teaspoons dried basil ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/4 teaspoon ground white pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a medium saucepan over medium heat. Add the onion, pepper, and garlic; cook and stir 4 to 5 minutes or until vegetables are soft.\nAdd the cheeses, cream, and milk; heat mixture until cheeses melt and the mixture is simmering.\nStir in the tomatoes (including their liquid), tomato juice, basil, sugar, and pepper. Continue to simmer mixture for 15 to 20 minutes while stirring constantly. Do not boil.\n",
        "picture_link": "AcA9jehS.4OHbRWIC7Ve2LBbydGir3G"
    },
    {
        "title": "Linguine with Chicken and Sauteed Vegetables",
        "ingredients": [
            "1/2 cup vegetable oil ADVERTISEMENT",
            "10 cloves garlic, finely chopped ADVERTISEMENT",
            "1 (12 ounce) package uncooked linguine pasta ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1/2 cup chopped broccoli ADVERTISEMENT",
            "1/2 cup chopped cabbage ADVERTISEMENT",
            "1/2 cup shredded carrots ADVERTISEMENT",
            "1/2 cup chopped cauliflower ADVERTISEMENT",
            "2 tablespoons diced green onions ADVERTISEMENT",
            "1 pound chicken tenders, cut into bite-size pieces ADVERTISEMENT",
            "3 1/2 tablespoons soy sauce ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 cup chopped cilantro ADVERTISEMENT",
            "4 lime wedges ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a skillet over medium heat. Mix in garlic. Cook and stir until golden. Remove from heat and allow to cool.\nBring a large pot of lightly salted water to a boil. Place linguine in pot and cook 8 to 10 minutes, until al dente. Drain and transfer to a large bowl. Set aside 1 tablespoon garlic oil and toss remainder with pasta to coat. Season pasta with salt.\nBring a pot of water to a boil. Immerse broccoli, cabbage, carrots, cauliflower and green onions in water for about 30 seconds. Drain and set aside.\nHeat reserved garlic oil in skillet over medium heat. Mix in chicken and 2 tablespoons soy sauce. Cook until chicken juices run clear. Mix in vegetables and remaining soy sauce. Season with salt and pepper. Toss with linguine, and garnish with cilantro and lime to serve.\n",
        "picture_link": "g.940PV.ngt3P2l1pbfu8hVLbacFGZ."
    },
    {
        "title": "Ann's Dirty Rice",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 yellow onion, chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "2 teaspoons beef bouillon granules ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon seasoned salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 cup uncooked white rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium-high heat and stir in the ground beef, onion, green and red peppers, beef bullion, salt, seasoned salt, and pepper. Cook and stir until the beef is crumbly, evenly browned, and no longer pink. Drain and discard any excess grease. Stir in the water and rice. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer until the rice is tender, and the liquid has been absorbed, 20 to 25 minutes.\n",
        "picture_link": "3VqhIB40LdHBgiw33KraP9Q2FSfDhOS"
    },
    {
        "title": "Simple Roasted Chickpea Snack",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon chili powder ADVERTISEMENT",
            "1 pinch sea salt ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "1 dash crushed red pepper ADVERTISEMENT",
            "1 (15 ounce) can chickpeas, rinsed and drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C).\nWhisk the oil, cumin, garlic powder, chili powder, sea salt, black pepper, and red pepper together in a small bowl; add the chickpeas and toss to coat. Spread into a single layer on a baking sheet.\nRoast in the preheated oven, stirring occasionally, until nicely browned and slightly crispy, about 45 minutes.\n",
        "picture_link": "j.stqDMwOtjUgvYmczVmkhnGSpFNWjS"
    },
    {
        "title": "Blueberry Cornmeal Muffins",
        "ingredients": [
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup cornmeal ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 cup frozen blueberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease muffin cups or line with paper muffin liners.\nSift flour, cornmeal, brown sugar, salt and baking powder together into a large bowl. Dredge the blueberries in the sifted ingredients. In a small bowl, combine the milk, butter and egg. Stir the wet ingredients into the flour mixture just until moistened. Spoon batter into prepared muffin tins.\nBake in preheated oven for 20 minutes. Let muffins sit for 10 minutes before removing from the pan.\n",
        "picture_link": "IOBZbnf.1yokite71ntzuixzgutp0.K"
    },
    {
        "title": "Chocolate Chip Oatmeal Cookies",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1 1/4 cups packed brown sugar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 1/2 cups rolled oats ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nBeat together margarine and sugars until creamy. Add eggs, milk and vanilla; beat well. Add combined flour, baking soda and salt; mix well. Stir in oats, chocolate chips and nuts; mix well.\nDrop by rounded tablespoonfuls onto ungreased cookie sheet. Bake 9-10 minutes. Cool for 1 minute on cookie sheet; remove to wire rack.\n",
        "picture_link": "XSiwzggiTdC5ozfXT1OU/6ArmmyYV1W"
    },
    {
        "title": "Chocolate Peanut Butter Fudge",
        "ingredients": [
            "3 cups white sugar ADVERTISEMENT",
            "1 cup evaporated milk ADVERTISEMENT",
            "1/4 cup cocoa ADVERTISEMENT",
            "1/2 cup peanut butter ADVERTISEMENT",
            "1 tablespoon margarine ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Butter one 9x9 inch pan.\nCombine the sugar, evaporated milk and cocoa in saucepan. Stir over high heat until mixture comes to a rolling boil. Lower heat to medium and continue cooking to a soft ball stage.\nRemove from heat, add peanut butter and margarine. Beat by hand until creamy; pour into prepared pan. Allow to cool and cut into squares.\n",
        "picture_link": ".PXjbbV9/ul0egb1ohffnDDMZLLGkE6"
    },
    {
        "title": "Cilantro-Lime Rice",
        "ingredients": [
            "1 cup long grain white rice ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 teaspoon chicken bouillon granules ADVERTISEMENT",
            "2 tablespoons fresh lime juice ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring the rice, water, and chicken bouillon to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the rice is tender, 20 to 25 minutes. Remove from the heat, add the lime juice, cilantro, and salt; fluff with a fork and serve.\n",
        "picture_link": "YRQbBlPH87ludOYCK1GaDPkbs63kjly"
    },
    {
        "title": "Haddock Bubbly Bake",
        "ingredients": [
            "2 pounds haddock fillets ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 onion, thinly sliced ADVERTISEMENT",
            "1 cup shredded mild Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly butter a 2 quart casserole dish.\nArrange fish fillets in the bottom of the prepared casserole dish, and sprinkle with salt and pepper to taste. Layer onion slices over fish. Spread cream of mushroom soup over all, and top with shredded cheese.\nBake in preheated oven for about 40 minutes, or until bubbly and fish flakes easily with a fork.\n",
        "picture_link": "iyO7Ioshi6yLII1D2eezo1Hsy0jiQ7O"
    },
    {
        "title": "Strawberry Cobbler I",
        "ingredients": [
            "1/2 cup white sugar ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "3 cups strawberries, hulled ADVERTISEMENT",
            "2 tablespoons butter, diced ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1/2 cup heavy whipping cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (205 degrees C). Butter a 2-quart baking dish.\nCombine sugar, cornstarch, and water. Cook over medium heat, stirring constantly, until thick and hot. Stir in strawberries, and remove from heat. Pour mixture into the baking dish, and dot with 2 tablespoons butter.\nSift together the flour, sugar, baking powder, and salt. Cut in 3 tablespoons butter. Stir in cream. Mixture should be fairly soft. Spoon on top of berries.\nBake for 25 minutes in the preheated oven, or until biscuit is golden brown and filling is bubbly.\n",
        "picture_link": "MVRjTr2G7V.3py5nIX30FUKpE59iYMO"
    },
    {
        "title": "Chocolate Cream Cheese Frosting",
        "ingredients": [
            "4 (1 ounce) squares unsweetened chocolate ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "4 cups confectioners' sugar ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "2 tablespoons evaporated milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Have all ingredients at room temperature. Melt the chocolate in a double boiler or microwave oven.\nIn a large bowl, beat cream cheese until fluffy. Pour melted chocolate into cream cheese and mix on medium speed until well blended. Add vanilla and pinch of salt. Slowly mix in the confectioners sugar.\nScrape the sides of the bowl and increase mixer speed to medium-high. Slowly add evaporated milk until the frosting is spreading consistency.\n",
        "picture_link": "Aei1Ef97CfDqpHYVhS6sG/024i9E.8."
    },
    {
        "title": "Grilled Pizza Wraps",
        "ingredients": [
            "2 tablespoons margarine, softened ADVERTISEMENT",
            "8 (10 inch) flour tortillas ADVERTISEMENT",
            "1 (16 ounce) package shredded Cheddar-Monterey Jack cheese blend ADVERTISEMENT",
            "1/2 cup pizza sauce ADVERTISEMENT",
            "4 ounces sliced pepperoni ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium-low heat. Spread margarine over one side of a tortilla, and place it margarine-side down in the skillet. Spoon a tablespoon of pizza sauce onto half of the tortilla. Sprinkle 1/2 cup of shredded cheese over the sauce, and top with a few slices of pepperoni. Fold the clean half of the tortilla over the filling, and cook until golden on each side. Repeat with remaining tortillas.\n",
        "picture_link": "BKJ1PtGjpB7JqIHRkKsYPRXnuy8fu66"
    },
    {
        "title": "Slow Cooker Casserole",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1 (16 ounce) package frozen mixed vegetables, thawed ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed cream of chicken soup ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed cream of mushroom soup ADVERTISEMENT",
            "3 teaspoons garlic powder ADVERTISEMENT",
            "3 teaspoons onion powder ADVERTISEMENT",
            "3 (3 ounce) packages chicken flavored ramen noodles ADVERTISEMENT",
            "6 skinless, boneless chicken breast halves, cut into bite size pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut butter or margarine into small chunks and put chunks in the bottom of the slow cooker. Add the vegetables, cream of chicken soups and cream of mushroom soups. Stir. Sprinkle with the garlic powder, onion powder and seasoning packets from the ramen noodle packages. Put chicken pieces in slow cooker. Cover and cook for 6 hours on LOW.\nBreak each ramen noodle packet into quarters (4 'pieces'). Put noodles in slow cooker and stir to cover noodles. Cook 1 hour on HIGH. Reduce heat and let simmer until ready to serve.\n",
        "picture_link": "Z4j2qNP/AC/.EFR9.Hou/qBE66iN9v6"
    },
    {
        "title": "Chocolate Revel Bars",
        "ingredients": [
            "3 cups quick cooking oats ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "2 cups packed brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "4 teaspoons vanilla extract ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 1/2 cups semisweet chocolate chips ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking pan.\nIn a large bowl, beat together 1 cup butter and brown sugar until fluffy. Mix in eggs and 2 teaspoons vanilla. In another bowl, combine oats, flour, baking soda, and 1 teaspoon salt; stir into butter mixture. Set aside.\nIn a medium saucepan, heat sweetened condensed milk, chocolate chips, 2 tablespoons butter, and 1/2 teaspoon salt over low heat, stirring until smooth. Remove from heat. Stir in walnuts and 2 teaspoons vanilla.\nPat 2/3 of the oat mixture into the bottom of the prepared pan. Spread chocolate mixture evenly over the top, and dot with remaining oat mixture.\nBake for 30 to 35 minutes in preheated oven. Let cool on a wire rack, then cut into bars.\n",
        "picture_link": "0o6mZNvbaCk1BNbYdqJl1fIbsRhV.IS"
    },
    {
        "title": "Parmesan Broccoli Balls",
        "ingredients": [
            "1 (10 ounce) package chopped frozen broccoli, thawed ADVERTISEMENT",
            "1 (6 ounce) package chicken flavored dry stuffing mix ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1 medium onion, chopped ADVERTISEMENT",
            "6 eggs, beaten ADVERTISEMENT",
            "3/4 cup margarine, melted ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon garlic salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place broccoli in a medium saucepan with enough water to cover. Cover, and bring to a boil. Cook 5 minutes. Uncover, and continue cooking 2 to 3 minutes, until tender. Remove from heat, drain, and cool.\nIn a large bowl, mix broccoli, stuffing mix, Parmesan cheese, onion, eggs, margarine, pepper, and garlic salt. Cover, and chill in the refrigerator approximately 1 hour, until moisture has been absorbed.\nPreheat oven to 325 degrees F (165 degrees C).\nRoll the chilled mixture into 1 inch balls, and arrange on a medium baking sheet.\nBake 15 to 20 minutes in the preheated oven, until browned.\n",
        "picture_link": "uA9mdzrEPmO9U3g7C9n.YkKeUQs/jY."
    },
    {
        "title": "Aunt Bev's Famous Apple Pie",
        "ingredients": [
            "7 tart apples, peeled and cored ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon, or to taste ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "2 recipes unbaked pie shells ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nCut the apples into 1/4 inch slices.\nIn a mixing bowl, combine sugar, cinnamon, flour, nutmeg (or apple pie spice), and salt; mix thoroughly. Pour the spice mix over the apples and stir until the apples are coated.\nLine one crust in a 9 inch deep dish pie pan. Place the apples in the pie crust. Dot the apple filling evenly with butter. Fit the top crust over the apples. Press the crust down gently and cut 3 or 4 slits in the top crust to allow steam to escape while the pie bakes\nBake in the preheated oven 50 minutes, or until the crust is golden brown. Check the pie after the first 30 minutes of cooking: if the crust is already browned reduce the heat to 350 degrees F (175 degrees C) to allow the apples to cook without the crust burning.\n",
        "picture_link": "E4fpibnYr.Vm32ZEsHWFr3RPFnTTyEy"
    },
    {
        "title": "Deep Fried Oreos®",
        "ingredients": [
            "2 quarts vegetable oil for frying ADVERTISEMENT",
            "1 large egg ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "2 teaspoons vegetable oil ADVERTISEMENT",
            "1 cup pancake mix ADVERTISEMENT",
            "1 (18 ounce) package cream-filled chocolate sandwich cookies (such as Oreo®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in deep-fryer to 375 degrees F (190 degrees C).\nWhisk together the egg, milk, and 2 teaspoons of vegetable oil in a bowl until smooth. Stir in the pancake mix until no dry lumps remain. Dip the cookies into the batter one at a time, and carefully place into the hot frying oil. Fry only 4 or 5 at a time to avoid overcrowding the deep fryer. Cook until the cookies are golden-brown, about 2 minutes. Drain on a paper towel-lined plate before serving.\n",
        "picture_link": "xBa/dj/n9fI8Zs4WFksXw/5H0kZghbG"
    },
    {
        "title": "Chimichurri Sauce",
        "ingredients": [
            "1 cup fresh parsley ADVERTISEMENT",
            "3/4 cup extra virgin olive oil ADVERTISEMENT",
            "3 tablespoons red wine vinegar ADVERTISEMENT",
            "2 tablespoons dried oregano ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 tablespoon minced garlic ADVERTISEMENT",
            "1/2 tablespoon pepper sauce (such as Frank's Red Hot®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the parsley, olive oil, red wine vinegar, oregano, cumin, salt, garlic and hot pepper sauce into the container of a blender or food processor. Blend for about 10 seconds on medium speed, or until ingredients are evenly blended.\n",
        "picture_link": "Ub19BjnwhbesXBHfUyRZFlkVqtgbdOi"
    },
    {
        "title": "American-Italian Pasta Salad",
        "ingredients": [
            "1 (16 ounce) package fusilli pasta ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1 (.7 ounce) package dry Italian-style salad dressing mix ADVERTISEMENT",
            "1 cup frozen petite peas, thawed ADVERTISEMENT",
            "2 (2 ounce) cans sliced black olives ADVERTISEMENT",
            "1 cup cubed Genoa salami ADVERTISEMENT",
            "3/4 cup chopped green onions ADVERTISEMENT",
            "3/4 cup chopped celery ADVERTISEMENT",
            "1/2 cup chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot of salted boiling water, cook pasta until al dente, rinse under cold water, and drain.\nIn a medium bowl, combine mayonnaise, sour cream, milk and Italian dressing mix. Whisk together until smooth, set aside.\nIn a large salad bowl combine cooked and cooled pasta, peas, olives, salami, green onions, celery and parsley. Mix in dressing last, reserving 1/2 cup. Let sit overnight in fridge. Stir before serving. Add extra dressing if pasta appears dry.\n",
        "picture_link": "HpHvRNAByGhp9fISkXH/Q5wTy7hWH7C"
    },
    {
        "title": "A Number One Egg Bread",
        "ingredients": [
            "2 (.25 ounce) packages active dry yeast ADVERTISEMENT",
            "2/3 cup warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "6 egg yolks ADVERTISEMENT",
            "3 eggs, room temperature ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "4 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, dissolve yeast in water. Stir in the yolks, 3 eggs, oil, sugar, and salt. Add about 3-1/2 cups of flour to make a sticky dough.\nTurn dough out onto a lightly floured surface. Knead with remaining flour until smooth and elastic, about 7 minutes. Place in a well oiled bowl, and turn to oil the entire surface of the dough. Cover with a damp cloth. Place in a warm place until double in size, about 1-1/2 hours.\nPunch down the dough, and divide into 3 pieces. Roll each piece into a rope about 12 inches long. Braid the three strands together, and seal the ends. Place the bread on a greased cookie sheet. Beat the remaining 1 egg with a pinch of salt; brush onto bread. Let the bread rise until doubled, about 45 minutes.\nPreheat the oven to 375 degrees F (190 degrees C). Brush the bread with eggwash again.\nBake for 40 minutes, or until golden. Cool on a wire rack.\n",
        "picture_link": "/j43Izwsw5LK9IjGtSa6n92K02sUOD2"
    },
    {
        "title": "Touchdown Chili",
        "ingredients": [
            "2 pounds ground beef ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "6 cloves garlic, chopped ADVERTISEMENT",
            "1/3 cup chili powder ADVERTISEMENT",
            "1 1/2 teaspoons ground cumin ADVERTISEMENT",
            "1 1/2 teaspoons dried basil ADVERTISEMENT",
            "1 (28 ounce) can diced tomatoes with juice ADVERTISEMENT",
            "1 (4 ounce) can diced green chile peppers, drained ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "1 (12 fluid ounce) can or bottle beer ADVERTISEMENT",
            "1 tablespoon white vinegar ADVERTISEMENT",
            "3 tablespoons brown sugar ADVERTISEMENT",
            "1 teaspoon hot pepper sauce (e.g. Tabasco™) ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the ground beef, onion and garlic in a large saucepan over medium heat. Cook, stirring to crumble the beef, until the beef is no longer pink and the onion is tender. Drain off the fat and return the pan to the stove. Combine the chili powder, cumin and basil; sprinkle over the beef. Cook and stir to coat the meat and toast the spices a little.\nPour in the tomatoes, green chilies, tomato sauce, beer and vinegar. Bring to a boil and stir to loosen any bits that are stuck to the bottom of the pan. Mix in the brown sugar, hot pepper sauce, salt and pepper. Reduce the heat to low, cover and simmer for 3 hours. Remove the lid for the last 30 minutes of cooking.\n",
        "picture_link": "EeIs6YkfIWAg2zJZoXEbglcHdEWwUwK"
    },
    {
        "title": "Vinegar Cookies",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon distilled white vinegar ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (170 degrees C).\nCream butter or margarine and sugar. Add other ingredients. Drop by teaspoon on lightly greased cookie sheet.\nBake for 18-20 minutes.\n",
        "picture_link": "7pL1hvY0J/Qxb/x2ACjopN9lU8ioHKe"
    },
    {
        "title": "Chicken Enchilada Soup II",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 pound boneless, skinless chicken breast halves ADVERTISEMENT",
            "1/2 cup diced onion ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "4 cups chicken broth ADVERTISEMENT",
            "1 cup masa harina ADVERTISEMENT",
            "3 cups water, divided ADVERTISEMENT",
            "1 cup enchilada sauce ADVERTISEMENT",
            "1 pound processed cheese, cubed ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large pot over medium heat. Brown chicken breasts for 4 to 5 minutes on each side. Shred and set aside.\nTo the pot add onions and garlic; saute for 2 minutes, or until onions are translucent. Pour in chicken broth.\nIn a medium bowl combine masa harina with 2 cups of water and whisk until well blended.\nTo the onions and garlic add the masa harina mixture, remaining water, enchilada sauce, cheese, salt, chili powder and cumin. Bring to a boil; add shredded chicken. Reduce heat to low and simmer 30 to 40 minutes, or until thickened.\n",
        "picture_link": "MzZyBM.bY0Jz0CFnmeyCwJVlBJrfW5i"
    },
    {
        "title": "Barbecue Tofu Sandwiches",
        "ingredients": [
            "1 (12 ounce) package extra firm tofu ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "1 onion, thinly sliced ADVERTISEMENT",
            "1 1/2 cups barbecue sauce ADVERTISEMENT",
            "6 hamburger buns ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Drain the tofu between paper towels until most of the water has been squeezed out.\nSlice tofu into 1/4 inch thick slices.\nHeat vegetable oil in a large skillet, fry tofu strips until golden brown on both sides. Add onion and cook for a few minutes, until onion is at your desired consistency.\nPour in barbeque sauce (use more or less, according to your taste). Cook the mixture for ten minutes on low and serve on buns.\n",
        "picture_link": "QJZxqm4.7xOxHVCDw6ychEqGpexamiq"
    },
    {
        "title": "Cedar Plank-Grilled Salmon with Garlic, Lemon and Dill",
        "ingredients": [
            "1 (3 pound) whole filet of salmon, skin on, scored (up to but not through the skin) into serving pieces ADVERTISEMENT",
            "6 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "4 large garlic cloves, minced ADVERTISEMENT",
            "1/4 cup minced fresh dill ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon lemon zest, plus lemon wedges for serving ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Soak an untreated cedar plank (or planks) large enough to hold a side of salmon (5 to 7 inches wide and 16 to 20 inches long) in water, weighting it with something heavy, like a brick, so it stays submerged 30 minutes to 24 hours.\nWhen ready to grill, either build a charcoal fire in half the grill or turn grill burners on high for 10 minutes. Meanwhile, mix oil, garlic, dill, salt, pepper and lemon zest; rub over salmon and into scored areas to coat.\nPlace soaked cedar on hot grill grate, close lid, and watch until wood starts to smoke, about 5 minutes. Transfer salmon to hot plank, move salmon off direct charcoal heat or turn burners to low, and cook covered until salmon is just opaque throughout (130 on a meat thermometer inserted in the thickest section) 20 to 25 minutes or longer, depending on thickness and grill temperature. Let sit 5 minutes; serve with lemon wedges.\n",
        "picture_link": "5Ehl/9EX5C6vWzQ4/viQ3ORxoAm2p5m"
    },
    {
        "title": "Banana Wheat Bread",
        "ingredients": [
            "2 cups whole wheat flour ADVERTISEMENT",
            "1/4 cup wheat germ ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 1/2 cups mashed bananas ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grease a 9 x 5 inch loaf pan. Preheat oven to 350 degrees (175 degrees C).\nCombine oil, honey, eggs, vanilla, and mashed bananas in a bowl.\nIn a large bowl, whisk together flour, wheat germ, salt, and baking soda. Make a well in dry ingredients, and add the banana mixture. Mix together until dry ingredients are moistened. Stir in nuts. Pour batter into prepared pan.\nBake 1 hour in preheated oven. Test for doneness, and cool on wire rack.\n",
        "picture_link": "W7keZUBVtlFhSidugrZVPubKLY2unQ."
    }
]