[
    {
        "title": "Potato Spinach Casserole",
        "ingredients": [
            "7 large potatoes, peeled and cubed ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped spinach, thawed and drained ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "2 tablespoons chopped green onions ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1/4 teaspoon black pepper ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease a 2 quart casserole dish.\nBring a large pot of salted water to a boil. Add potatoes and cook until tender, about 15 minutes. Drain and mash.\nIn a large bowl combine mashed potatoes, spinach, sour cream, butter, green onions, salt and pepper. Spoon into prepared dish.\nBake for 15 minutes. Top with cheese and bake 5 minutes longer.\n",
        "picture_link": "5cmb0ZM7/rjhRbdXfspY8Ofz/eV/wFe"
    },
    {
        "title": "Crab Crusted Grouper",
        "ingredients": [
            "2 tablespoons Parmesan cheese flavored bread crumbs ADVERTISEMENT",
            "2 tablespoons chopped red bell pepper ADVERTISEMENT",
            "2 tablespoons chopped yellow bell pepper ADVERTISEMENT",
            "2 green onions, chopped ADVERTISEMENT",
            "1/4 jalapeno pepper, seeded and minced ADVERTISEMENT",
            "4 tablespoons butter, melted ADVERTISEMENT",
            "1 (6 ounce) can crabmeat, drained and flaked ADVERTISEMENT",
            "2 tablespoons shredded mozzarella cheese ADVERTISEMENT",
            "4 (6 ounce) fillets grouper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C).\nIn a medium bowl, stir together the bread crumbs, red pepper, yellow pepper, green onions, jalapeno, butter, crabmeat, and mozzarella cheese. Arrange grouper fillets in a single layer in a 9x13 inch baking dish. Spread the crumb topping evenly over the fish.\nBake for 30 minutes in the preheated oven, or until fish is easily flaked with a fork. If you have thin fillets, you may broil for 10 minutes instead of baking.\n",
        "picture_link": "vRGyZqxwPQzHM.rJXAAKWl1oAzNo6q."
    },
    {
        "title": "Pork Stew in Green Salsa (Guisado de Puerco con Tomatillos)",
        "ingredients": [
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1 (3 pound) boneless pork shoulder roast, trimmed of excess fat and cut into 1-inch cubes ADVERTISEMENT",
            "2 tablespoons olive oil, or more if needed ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "2 cups chopped fresh tomatillos ADVERTISEMENT",
            "1 (7 ounce) can diced green chiles, drained ADVERTISEMENT",
            "2 fresh jalapeno peppers, seeded and chopped ADVERTISEMENT",
            "2 teaspoons dried marjoram ADVERTISEMENT",
            "1/2 cup chopped fresh cilantro ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 pinch salt, or to taste (optional) ADVERTISEMENT",
            "2 tablespoons sour cream, divided ADVERTISEMENT",
            "6 sprigs cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together the flour, 1 teaspoon salt, pepper, and cumin in a large bowl. Place the cubed pork into the mixture, and stir well to coat the meat with the seasonings.\nHeat the olive oil in a large, heavy pan or Dutch oven over medium-high heat until the oil shimmers. Working in batches if necessary, place the meat into the hot pan in a single layer. Pan-fry the pork until brown on all sides, about 15 minutes. Remove the pork to a bowl, and cover to keep warm.\nCook and stir the onion in the hot pan over medium heat, adding more olive oil if necessary, until the onion is translucent and beginning to brown, about 7 minutes. Return the meat to the pan and stir in the garlic, tomatillos, chiles, marjoram, chopped cilantro, and water. Check seasoning and add 1 pinch of salt to taste, if needed. Cover and simmer over low heat, stirring occasionally, until the meat is tender, about 1 hour. Skim excess fat off the stew before serving in bowls, garnished with a dollop of sour cream and a cilantro sprig on each bowl.\n",
        "picture_link": "BleXurC0fnjkmwyQ6ox52jUZc2Q7sba"
    },
    {
        "title": "Italian Chicken Sausage Risotto ",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 (16 ounce) package al fresco® All Natural Sweet Italian Chicken Sausage ADVERTISEMENT",
            "1 cup chopped sweet onion ADVERTISEMENT",
            "1 tablespoon minced fresh garlic ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "1 1/4 cups Arborio rice ADVERTISEMENT",
            "1 cup Chardonnay or other dry white wine ADVERTISEMENT",
            "3 1/2 cups chicken broth, low-sodium ADVERTISEMENT",
            "1 cup frozen petite sweet peas ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a heavy, large Dutch oven or saucepan, heat oil over medium heat. Saute sausage and onion until onion is translucent, about 3 minutes. Add garlic and thyme and cook until garlic is fragrant, about 30 seconds. Add rice and wine; stir 1-2 minutes or until wine is absorbed.\nStir in 3 cups broth. Lower heat to medium-low and simmer, uncovered, until broth is absorbed, stirring occasionally, for about 15 minutes. Continue adding stock, 1/4 cup at a time, stirring until liquid is adsorbed and rice is tender and creamy, about 5 minutes. Stir in peas and 1/4 cup Parmesan; cook 1 minute or until heated throughout. Season with 1/4 teaspoon black pepper. Garnish with parsley and additional cheese. Serve immediately.\n",
        "picture_link": "v2i97goY6Y2xIVfCb8k/8TpBLSlkpT6"
    },
    {
        "title": "Ham and Cheese Breakfast Casserole",
        "ingredients": [
            "18 (1 ounce) slices white bread, cubed ADVERTISEMENT",
            "8 ounces cooked ham, cubed ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "1 1/2 cups diced Swiss cheese ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "3 1/2 cups milk ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "2 cups crushed cornflakes cereal ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Lightly grease a 9x13 inch baking dish. Line the bottom of the dish with half the bread cubes. Sprinkle with ham, Cheddar cheese, and Swiss cheese, and top with remaining bread. In a bowl, beat together the eggs, milk, and onion powder. Pour evenly over bread. Cover, and refrigerate overnight.\nPreheat oven to 375 degrees F (190 degrees C). In a small bowl, blend the crushed cornflakes and melted butter. Spread evenly over the casserole.\nBake 40 minutes in the preheated oven, or until bubbly and golden brown. Let stand 5 minutes before serving.\n",
        "picture_link": "w9JctFrdeu2Vh3TMxwVlGe/sET/n9vu"
    },
    {
        "title": "Ono Butter Mochi",
        "ingredients": [
            "1 pound mochiko (glutinous rice flour) ADVERTISEMENT",
            "2 1/2 cups white sugar ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "3 cups whole milk ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup sweetened, flaked coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking dish.\nIn a medium bowl, whisk together the eggs, vanilla and milk. In a separate larger bowl, stir together the rice flour, sugar, and baking powder. Pour the wet ingredients into the dry ingredients, and stir to blend. Mix in melted butter and coconut. Pour into the prepared pan.\nBake for 1 hour in the preheated oven. Cool completely, then cut into squares to serve.\n",
        "picture_link": "F42tscHFvoKfvHkrRLVvrfovk8LoWjO"
    },
    {
        "title": "Old Fashioned Paradise Pumpkin Pie",
        "ingredients": [
            "1 (9 inch) pie shell ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 1/4 cups pumpkin puree ADVERTISEMENT",
            "1 cup evaporated milk ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/4 cup packed brown sugar ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "2 tablespoons butter, softened ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nTo Make Cheesecake Layer: In a medium mixing bowl, beat cream cheese until smooth. Beat in 1/4 cup sugar, then add vanilla extract and 1 egg. Beat mixture until light and smooth. Chill mixture for 30 minutes, then spread into pastry shell.\nTo Make Pumpkin Layer: In a large bowl, combine pumpkin puree, evaporated milk, 2 eggs, 1/4 cup brown sugar, 1/4 cup white sugar, cinnamon, nutmeg, and salt. Mix until all ingredients are thoroughly combined.\nPour pumpkin mixture over cream cheese layer. Cover edges of crust with aluminum foil.\nBake in preheated oven for 25 minutes. Remove foil from edges and bake an additional 25 minutes.\nTo Make Pecan Streusel Layer: While pie is in oven, combine flour and 2 tablespoons brown sugar in a small bowl. Mix well, then add softened butter or margarine and stir until ingredients are combined. Mix in pecans.\nAfter pie has been in oven for 50 minutes, remove and sprinkle pecan streusel evenly over top. Bake for an additional 10 to 15 minutes, until a toothpick inserted in center comes out clean.\n",
        "picture_link": "z0OoZY8/S9izz400ZMHTsnHhSmSLAlm"
    },
    {
        "title": "Sand Art Brownies",
        "ingredients": [
            "5/8 cup all-purpose flour ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1/3 cup unsweetened cocoa powder ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "2/3 cup packed brown sugar ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "1/2 cup semisweet chocolate chips ADVERTISEMENT",
            "1/2 cup vanilla baking chips ADVERTISEMENT",
            "1/2 cup walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the 5/8 cup of flour with salt. In a clean, wide mouth 1 quart or 1 liter jar, layer the ingredients in the order given. Starting with the flour and salt mixture, and ending with the walnuts.\nAttach a decorative tag to the out side of the jar with the following directions: Sand Art Brownies: 1. Preheat oven to 350 degrees F (175 degrees C). Grease one 9x9 inch square baking pan. 2. Pour the contents of the jar into a large bowl, and mix well. 3. Stir in 1 teaspoon vanilla, 2/3 cup vegetable oil, and 3 eggs. Beat until just combined. 4. Pour the batter into the prepared pan, and bake in the preheated oven for 25 to 30 minutes.\n",
        "picture_link": "pT4H8oEHOm40vpSvm3r6VkutHFUk0gW"
    },
    {
        "title": "Slow Cooker Baked Beans",
        "ingredients": [
            "24 ounces dry white beans ADVERTISEMENT",
            "1 pound ham hocks ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup maple syrup ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "2 tablespoons prepared mustard ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot over high heat, combine the beans with water to cover and bring to a boil for 10 minutes. Remove from heat but let sit for 1 hour. Drain beans and place them in a slow cooker. Add the ham hocks, onion, brown sugar, maple syrup, salt and water.\nMix well, cover and cook on high setting for 4 to 5 hours, stirring occasionally. During the final hour of cooking, add the ketchup and mustard, remove the ham from the hocks and discard the hocks. Mix well and serve.\n",
        "picture_link": "9VrDjQifDBO1pVADVtD9pIoiZef7OQG"
    },
    {
        "title": "Sausage Stuffing",
        "ingredients": [
            "1 pound breakfast sausage ADVERTISEMENT",
            "3/4 cup chopped onion ADVERTISEMENT",
            "1 1/2 cups finely diced celery ADVERTISEMENT",
            "3/4 cup margarine, melted ADVERTISEMENT",
            "8 cups white bread cubes ADVERTISEMENT",
            "3 teaspoons poultry seasoning ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook sausage. Drain.\nMelt margarine. Add enough to sausage drippings to make 1 cup.\nSaute; onions and celery in margarine/dripping mixture until onion is tender. DO NOT BROWN. Stir in about 1/3 bread cubes. Put in big bowl and add remaining bread cubes, poultry seasoning, and pepper. Watch your hands, it's hot. Mix well.\nStuff turkey. You can also omit the sausage, increase the bread cubes to 9 cups, and add a teaspoon or two of salt. You can also add apples, giblets, oysters, etc. This recipe is very adaptable. When cooking extra in the oven, place the stuffing in a buttered casserole dish, and place in a pan of hot water. Cover, and baste with turkey drippings occasionally. It comes out really good.\n",
        "picture_link": "84Z/ity5xzMVWpaLTeKX8yOMsPq.mdm"
    },
    {
        "title": "One Egg Lemon Pound Cake",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon lemon extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C) grease and flour an 8x4 inch loaf pan.\nIn a large bowl, mix flour, baking powder, sugar and salt. Cut in butter. Break 1 egg into a measuring cup and then fill to the 1 cup line with milk. Add to dry ingredients and beat well. Add vanilla and lemon flavoring.\nPour batter into an 8x4 inch loaf pan. Bake at 350 degrees F (175 degrees C) for 30 minutes or until a toothpick inserted into the center of cake comes out clean.\n",
        "picture_link": "3Rtu9BA5sjRJrUUexuOm71rztWjTDjW"
    },
    {
        "title": "Chinese Steamed Buns",
        "ingredients": [
            "1 tablespoon active dry yeast ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1/2 cup warm water ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together yeast, 1 teaspoon sugar, 1/4 cup flour, and 1/4 cup warm water. Allow to stand for 30 minutes.\nMix in 1/2 cup warm water, flour, salt, 2 tablespoons sugar, and vegetable oil. Knead until dough surface is smooth and elastic. Roll over in a greased bowl, and let stand until triple in size, about 2 1/2 to 3 hours.\nPunch down dough, and spread out on a floured board. Sprinkle baking powder evenly on surface, and knead for 5 minutes. Divide dough into 2 parts, and place the piece you are not working with in a covered bowl. Divide each half into 12 parts. Shape each part into a ball with smooth surface up. Put each ball on a wax paper square. Let stand covered until double, about 30 minutes.\nBring water to a boil in wok, and reduce heat to medium; the water should still be boiling. Place steam-plate on a small wire rack in the middle of the wok. Transfer as many buns on wax paper as will comfortably fit onto steam-plate leaving 1 to 2 inches between the buns. At least 2 inches space should be left between steam-plate and the wok. Cover wok with lid. Steam buns over boiling water for 15 minutes.\nREMOVE LID BEFORE you turn off heat, or else water will drip back onto bun surface and produce yellowish \"blisters\" on bun surfaces. Continue steaming batches of buns until all are cooked.\n",
        "picture_link": "1xlZ3.tIsNjcNcwi0pPiSY7tosbBCUq"
    },
    {
        "title": "Easy Pasta Fagioli",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 carrot, diced ADVERTISEMENT",
            "1 stalk celery, diced ADVERTISEMENT",
            "1 thin slice onion, diced ADVERTISEMENT",
            "1/2 teaspoon chopped garlic ADVERTISEMENT",
            "4 (8 ounce) cans tomato sauce ADVERTISEMENT",
            "1 (14 ounce) can chicken broth ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "1 tablespoon dried parsley ADVERTISEMENT",
            "1/2 tablespoon dried basil leaves ADVERTISEMENT",
            "1 (15 ounce) can cannellini beans, drained and rinsed ADVERTISEMENT",
            "1 1/2 cups ditalini pasta ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a saucepan over medium heat. Saute carrot, celery and onion until soft. Add garlic and saute briefly. Stir in tomato sauce, chicken broth, pepper, parsley and basil; simmer for 20 minutes.\nBring a large pot of lightly salted water to a boil. Add ditalini pasta and cook for 8 minutes or until al dente; drain.\nAdd beans to the sauce mixture and simmer for a few minutes. When pasta is done, stir into sauce and bean mixture.\n",
        "picture_link": "Dlpwmli58avYPV2fDBmbs.MjqGlnkWy"
    },
    {
        "title": "Aunt Betty's Banana Pudding",
        "ingredients": [
            "2 (3.4 ounce) packages instant vanilla pudding mix ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 (8 ounce) container sour cream ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "6 bananas, sliced ADVERTISEMENT",
            "1/2 (12 ounce) package vanilla wafers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, combine pudding mix and milk and stir until mix is dissolved. Refrigerate 15 minutes, until partially set.\nStir condensed milk into pudding mixture until smooth. Fold in sour cream and whipped topping. Fold in bananas.\nMake a single layer of vanilla wafers in the bottom of a 9x13 inch dish. Spread pudding evenly over wafers. Crush remaining wafers and sprinkle on top. Refrigerate until serving.\n",
        "picture_link": "pBkDs6y5F5dYIY2w3tJbW9v283AYgdC"
    },
    {
        "title": "Absolutely Amazing Ahi",
        "ingredients": [
            "3/4 pound sashimi grade tuna steak, diced ADVERTISEMENT",
            "1/2 cup diced cucumber ADVERTISEMENT",
            "1 avocados - peeled, pitted and diced ADVERTISEMENT",
            "1/4 cup chopped green onion ADVERTISEMENT",
            "1 1/2 teaspoons red pepper flakes ADVERTISEMENT",
            "1 tablespoon toasted sesame seeds ADVERTISEMENT",
            "1 1/2 teaspoons lemon juice ADVERTISEMENT",
            "2 teaspoons sesame oil ADVERTISEMENT",
            "1/2 cup soy sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, combine the tuna, cucumber, avocado, green onion, red pepper flakes and sesame seeds. Pour in the lemon juice, sesame oil and soy sauce, and stir carefully to blend so as not to mash the avocado. Place this bowl into a larger bowl that has been filled with ice. Chill in the refrigerator for 15 minutes, but no longer - the terrific freshness of the fish will be lost.\nOnce chilled, remove the bowl from the ice, and invert onto a serving plate. Serve with toasted bread or your favorite crackers.\n",
        "picture_link": "oIrmNwirls6CQPpEh6MqfZVqoOVKQlq"
    },
    {
        "title": "Asparagus, Feta and Couscous Salad",
        "ingredients": [
            "2 cups couscous ADVERTISEMENT",
            "1 bunch fresh asparagus, trimmed and cut into 2-inch pieces ADVERTISEMENT",
            "8 ounces grape tomatoes, halved ADVERTISEMENT",
            "6 ounces feta cheese, crumbled ADVERTISEMENT",
            "3 tablespoons balsamic vinegar ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "Black pepper, to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook couscous according to package instructions. Put aside and allow to cool slightly.\nMeanwhile, place asparagus in a steamer over 1 inch of boiling water, and cover. Cook until tender but still firm, about 2 to 6 minutes. Drain and cool.\nToss the asparagus, tomatoes, and feta with couscous. Add the olive oil, balsamic vinegar, and black pepper and toss to incorporate.\n",
        "picture_link": "J5YiwJL/8p.uGkBP6hARPSd1pm4uppa"
    },
    {
        "title": "Lemon Chicken III",
        "ingredients": [
            "6 skinless, boneless chicken breast halves ADVERTISEMENT",
            "2 cups fresh lemon juice ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "2 teaspoons paprika ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1/3 cup light brown sugar ADVERTISEMENT",
            "1/4 cup chicken broth ADVERTISEMENT",
            "6 slices lemon ADVERTISEMENT",
            "1/2 cup finely minced fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To Marinate: Combine chicken and lemon juice in a large resealable plastic bag. Squeeze out air and seal bag. Refrigerate to marinate overnight, turning once.\nRemove chicken from marinade, reserving 2 tablespoons marinade and disposing of the remainder. Mix together flour, salt, paprika and pepper in a large resealable plastic bag. Add chicken breasts one at a time, seal bag and shake to coat evenly.\nPreheat oven to 350 degrees F (175 degrees C).\nHeat oil in a large skillet over medium high heat. Fry coated chicken until well browned, about 10 to 15 minutes. Arrange browned chicken in a 9x13 inch baking dish and sprinkle with brown sugar. Mix broth with reserved marinade and pour mixture over chicken. Top each breast with a lemon slice and sprinkle all with parsley.\nBake in the preheated oven for about 20 to 30 minutes, or until cooked through (juices run clear) and tender.\n",
        "picture_link": "qGW.f8JQ9I.PEQlNgEPbC9PaYkcr8Ua"
    },
    {
        "title": "Sugar-Free Peanut Butter Cookies",
        "ingredients": [
            "2 cups smooth natural peanut butter ADVERTISEMENT",
            "2 cups granular no-calorie sucralose sweetener (e.g., Splenda ®) ADVERTISEMENT",
            "2 large eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a baking sheet.\nThoroughly mix together the peanut butter, sucralose, and eggs in a bowl. Drop mixture by spoonfuls onto the prepared baking sheet.\nBake in the preheated oven until center appears dry, about 8 minutes.\n",
        "picture_link": "e2YJuUZBjsdJJbY9n6FWR1trOzxWOfm"
    },
    {
        "title": "Red Chard and Caramelized Onions",
        "ingredients": [
            "1 large yellow onion, chopped ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 teaspoon brown sugar ADVERTISEMENT",
            "1 bunch red Swiss chard, rinsed and chopped ADVERTISEMENT",
            "1/4 cup kalamata olives ADVERTISEMENT",
            "2 tablespoons capers ADVERTISEMENT",
            "1/2 teaspoon coarse sea salt, or to taste ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a cast iron skillet, cook onions in olive oil over medium-high heat until they begin to brown. Stir in brown sugar, and continue cooking for a few minutes.\nWhen onions are brown and tender, stir in chard and olives. Cook until chard is slightly wilted. Stir in capers and salt, and continue cooking until chard is completely wilted, about 3 minutes. Season with black pepper and squeeze lemon over the top.\n",
        "picture_link": "YJQ7QZHHgzE1vYy0SgmzRgETlLxm.wy"
    },
    {
        "title": "Mexican Pork Chops",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "4 boneless pork chops ADVERTISEMENT",
            "2 (14.5 ounce) cans chopped stewed tomatoes, with juice ADVERTISEMENT",
            "1 (8.75 ounce) can whole kernel corn, drained ADVERTISEMENT",
            "1 (8 ounce) can red kidney beans, drained ADVERTISEMENT",
            "1/2 cup uncooked long grain white rice ADVERTISEMENT",
            "1 (4 ounce) can diced green chilies, drained ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nHeat the oil in a skillet over medium heat. Brown the pork chops about 5 minutes on each side. Remove chops from skillet and drain oil.\nMix the tomatoes, corn, kidney beans, rice, chilies, and salt into the skillet. Bring liquid to a boil. Cook and stir for 1 minute, until heated through. Transfer the tomato mixture to a baking dish. Arrange the browned pork chops over the mixture.\nBake covered 30 minutes in the preheated oven. Uncover, and continue baking 10 minutes, until rice is tender and pork has reached an internal temperature of 145 degrees F (63 degrees C).\n",
        "picture_link": "z2g8b63sktQxsIPUn4jGH7JPuNMveAu"
    },
    {
        "title": "Creamy Pesto Chicken and Bow Ties",
        "ingredients": [
            "3 cups uncooked bow tie pasta ADVERTISEMENT",
            "2 tablespoons butter or margarine ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast, cubed ADVERTISEMENT",
            "1 (10.75 ounce) can Campbell's® Condensed Cream of Chicken Soup (Regular or 98% Fat Free) ADVERTISEMENT",
            "1/2 cup pesto sauce ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook pasta according to package directions. Drain.\nMeanwhile, heat butter in skillet. Add chicken and cook until browned, stirring often.\nAdd soup, pesto sauce and milk. Bring to a boil. Cook over low heat 5 minutes or until done. Stir in drained pasta and heat through.\n",
        "picture_link": "y5dDxB5TW0LQ7Da.9P1J.ppZLVboAfC"
    },
    {
        "title": "Grilled Lemon Yogurt Chicken",
        "ingredients": [
            "1/2 cup plain low-fat Greek yogurt ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "1 tablespoon lemon zest ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "4 cloves garlic, crushed ADVERTISEMENT",
            "1 tablespoon paprika ADVERTISEMENT",
            "1 teaspoon herbes de Provence ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 (5 pound) whole chicken, cut into 8 pieces ADVERTISEMENT",
            "1/2 cup plain low-fat Greek yogurt ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 teaspoon harissa ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the 1/2 cup yogurt, the juice from 1/2 lemon, lemon zest, olive oil, garlic, paprika, herbes de Provence, 1 teaspoon salt, and black pepper in a bowl. Pour into a resealable plastic bag. Add chicken, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in refrigerator for at least 3 hours.\nPreheat an outdoor grill for medium-high heat, and lightly oil the grate.\nCombine 1/2 cup yogurt, 1 tablespoon lemon juice, and harissa in a small bowl. Set aside.\nRemove chicken from bag and transfer to a plate or baking sheet lined with paper towels. Pat chicken pieces dry with more paper towels. Season with pinch of salt.\nGrill chicken, skin-side down, on the preheated grill for 2 minutes. Turn each piece and move to indirect heat.\nGrill, turning often, with lid down until well-browned and meat is no longer pink in the center, 30 to 35 minutes. An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 165 degrees F (74 degrees C).\nServe chicken with the yogurt harissa mixture on the side.\n",
        "picture_link": "rcOw3781OTNdGkO/gt1Yp.aYZrlR0FO"
    },
    {
        "title": "Mexican Turkey Burgers",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 medium onion, finely chopped ADVERTISEMENT",
            "1 medium green bell pepper, finely chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 cup salsa ADVERTISEMENT",
            "1 (15.25 ounce) can whole kernel corn, drained ADVERTISEMENT",
            "1 pound ground turkey ADVERTISEMENT",
            "1 (1.25 ounce) package taco seasoning mix ADVERTISEMENT",
            "1/3 cup dry bread crumbs ADVERTISEMENT",
            "6 (10 inch) flour tortillas ADVERTISEMENT",
            "6 tablespoons sour cream ADVERTISEMENT",
            "2 cups shredded lettuce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C). Coat a medium baking dish with cooking spray.\nHeat the olive oil in a skillet over medium heat, and saute the onion, green pepper, and garlic 5 minutes. Remove from heat, and cool slightly.\nIn a small bowl, mix the salsa and 1/2 the corn. In a large bowl, mix the onion mixture with the turkey, taco seasoning, and 2 tablespoons of the salsa mixture. Divide into 6 patties, and press into the breadcrumbs to lightly coat on all sides. Arrange coated patties in the prepared baking dish.\nBake the patties 10 minutes in the preheated oven. Drain any liquid from the dish, turn patties, and spread with the remaining salsa mixture. Continue baking 10 minutes, to an internal temperature of 165 degrees F (75 degrees C).\nWarm the tortillas in the microwave, about 30 seconds on High. Wrap the cooked turkey patties in the warmed tortillas with sour cream and lettuce. Sprinkle with remaining corn to serve.\n",
        "picture_link": "wOsEON2dhAl7S1wU3LrAiNPnkDS1jLS"
    },
    {
        "title": "Mexican White Cheese Dip/Sauce",
        "ingredients": [
            "1 pound white American cheese, cubed ADVERTISEMENT",
            "1/2 cup milk, or as needed ADVERTISEMENT",
            "1 tablespoon butter or margarine ADVERTISEMENT",
            "2 (4 ounce) cans chopped green chilies ADVERTISEMENT",
            "2 teaspoons cumin ADVERTISEMENT",
            "2 teaspoons garlic powder ADVERTISEMENT",
            "2 teaspoons onion powder ADVERTISEMENT",
            "cayenne pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cheese, milk, and butter in a medium saucepan over low heat. Cook until cheese has melted, stirring frequently. Stir in green chilies, cumin, garlic powder, onion powder, and cayenne pepper to taste. Add more milk if dip is too thick. Heat through and serve immediately.\n",
        "picture_link": "1aOZVFUu7Y/rQP/oLUJyKIXZJjHnNOq"
    },
    {
        "title": "Cranberry Salsa",
        "ingredients": [
            "1 (12 ounce) bag cranberries, fresh or frozen ADVERTISEMENT",
            "1 bunch cilantro, chopped ADVERTISEMENT",
            "1 bunch green onions, cut into 3 inch lengths ADVERTISEMENT",
            "1 jalapeno pepper, seeded and minced ADVERTISEMENT",
            "2 limes, juiced ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine cranberries, cilantro, green onions, jalapeno pepper, lime juice, sugar, and salt in the bowl of a food processor fitted with a medium blade. Chop to medium consistency. Refrigerate if not using immediately. Serve at room temperature.\n",
        "picture_link": "l3ggq9pIqo0XQqu0YBXE3y4gS9VVhaO"
    },
    {
        "title": "Buttermilk Coleslaw",
        "ingredients": [
            "2 cups mayonnaise ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon celery seed ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "2 (16 ounce) packages shredded coleslaw mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, stir together the mayonnaise, buttermilk, sugar, celery seed and black pepper. Fold in the coleslaw mix, and refrigerate until serving. This tastes best if it is refrigerated for a few hours before serving.\n",
        "picture_link": "XMoNmgX1PL8nSncqMjRepedvWRk3KRa"
    },
    {
        "title": "Cream Cheesy Cubed Zucchini with Lemon and Oregano",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "4 cups cubed zucchini ADVERTISEMENT",
            "1/2 teaspoon lemon zest ADVERTISEMENT",
            "1 pinch red pepper flakes ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "cayenne pepper to taste ADVERTISEMENT",
            "2 tablespoons cream cheese ADVERTISEMENT",
            "2 teaspoons chopped fresh oregano ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in skillet over high heat; stir in zucchini, lemon zest, and red pepper flakes. Cook for about 2 minutes.\nStir in salt, black pepper, and cayenne pepper; cook and stir until zucchini is tender, about 5 minutes.\nStir cream cheese into zucchini mixture; cook until cream cheese begins to melt, about 1 minute. Remove from heat and stir in oregano.\n",
        "picture_link": "x2R0y8VnA72LOPh3CBpen/bqvhymROW"
    },
    {
        "title": "Dave's Mocha Chicken",
        "ingredients": [
            "2/3 cup soy sauce ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/4 cup cooking sherry ADVERTISEMENT",
            "1/4 cup strong brewed coffee ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "6 chicken legs ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium, nonreactive container, mix the soy sauce, brown sugar, sherry, coffee, and 2 tablespoons olive oil. Place chicken legs in the mixture. Cover, and marinate in the refrigerator 3 to 4 hours.\nRemove chicken from the marinade mixture, and set aside. Transfer the marinade to a medium saucepan, and bring to a boil.\nHeat remaining olive oil in a medium skillet over medium-high heat. Season chicken with pepper, and brown on all sides in the skillet. Pour the hot marinade mixture into the skillet. Reduce heat, and simmer 30 minutes, or until chicken is no longer pink and juices run clear. Cool slightly before serving.\n",
        "picture_link": "KwE9/akodK3UnjlR5IatYULBP8N9J0S"
    },
    {
        "title": "Crab Legs with Garlic Butter Sauce",
        "ingredients": [
            "1 pound Snow Crab clusters, thawed if necessary ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 1/2 teaspoons dried parsley ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon fresh-ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut a slit, length-wise, into the shell of each piece of crab.\nMelt the butter in a large skillet over medium heat; cook the garlic in the butter until translucent; stir in the parsley, salt, and pepper. Continue to heat mixture until bubbling. Add the crab legs; toss to coat; allow to simmer in the butter mixture until completely heated, 5 to 6 minutes.\n",
        "picture_link": "eV/AmPrzwmrB8MLDRdR4MHhdwTMmfaC"
    },
    {
        "title": "Easy Homestyle Green Beans",
        "ingredients": [
            "3 slices bacon, cut into 1 inch pieces ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "1 (15 ounce) can green beans, with liquid ADVERTISEMENT",
            "1 cube chicken bouillon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a saucepan over medium heat, and add the bacon pieces. Fry for a few minutes, then add the onions. Cook and stir until the onions are tender, about 5 minutes. Pour in the green beans, and crumble in the bouillon cube. Stir to blend, then simmer for about 15 minutes. If you wish to simmer longer, add more water to keep the beans from scorching.\n",
        "picture_link": "IsS52ihtjQfbnM.EO8/CcPW4I6/DGbe"
    },
    {
        "title": "Mama Corleone's Sausage and Peppers",
        "ingredients": [
            "1 (8 ounce) package thin spaghetti ADVERTISEMENT",
            "4 (4 ounce) links sweet Italian sausage ADVERTISEMENT",
            "5 assorted bell peppers, seeded and cut into strips ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/4 cup extra virgin olive oil ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/4 cup minced flat leaf parsley ADVERTISEMENT",
            "freshly grated Parmesan cheese to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add spaghetti, and cook until al dente, about 5 minutes. Drain, and set aside.\nWhile the pasta is getting started, slice sausages lengthwise, and remove the casings. Brown sausages in a large skillet over medium-high heat with a drizzle of the olive oil. Remove sausages to a platter, and keep warm in the oven. Add the bell peppers, garlic, oregano and basil to the skillet, and drizzle with the remaining olive oil. Saute over medium heat until peppers are tender.\nToss the pepper mixture with the drained spaghetti until well blended, and season with salt and pepper to taste. Transfer to a serving platter, and arrange the sausages on the top. Garnish with Italian parsley and Parmesan cheese.\n",
        "picture_link": "YMmo3R0YxEbHBE42vW8i3Cb7KXjeWtC"
    },
    {
        "title": "Honey Grilled Chicken",
        "ingredients": [
            "2 tablespoons butter or margarine ADVERTISEMENT",
            "1 clove garlic, chopped ADVERTISEMENT",
            "1/3 cup honey ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat a grill for medium heat.\nMelt butter in a skillet over medium heat. Add the garlic, and cook until fragrant, 1 to 2 minutes. Whisk in honey and lemon juice. Reserve half for basting, and brush the other half onto the chicken breasts.\nLightly oil the grill grate, and place chicken on the grill. Cook for 6 to 8 minutes per side, turning frequently. Baste often during the last 5 minutes. Chicken is done when the meat is firm, and juices run clear.\n",
        "picture_link": "GtJFs7EK9OQaSYAkoV03c74xpNFIvDG"
    },
    {
        "title": "Plain Egg Less Cake",
        "ingredients": [
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 cup orange juice ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 cup melted butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan.\nSift the flour, baking powder and baking soda together in a large bowl. Make a well in the center and pour in the sweetened condensed milk, orange juice, vanilla and melted butter. Mix well and pour into prepared pan.\nBake in the preheated oven for 30 to 45 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool.\n",
        "picture_link": "j5W9PI9mtWBrrs4vlQFKU9Bmufj8Th2"
    },
    {
        "title": "Portuguese Chicken I",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "4 bone-in chicken breast halves, with skin ADVERTISEMENT",
            "1 1/2 cups chicken stock, or as needed ADVERTISEMENT",
            "1 cup dry white wine ADVERTISEMENT",
            "4 cloves garlic, peeled ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon pepper ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large skillet over medium-high heat. Add chicken breasts, and cook until nicely browned on both sides. Pour in chicken stock and white wine, using enough chicken stock so that the chicken pieces are covered halfway to two thirds by liquid. Add whole garlic cloves. Reduce heat to medium-low, sprinkle flour over the top of the contents of the pan and cover with a lid. Simmer for 40 to 45 minutes, until chicken is cooked through.\nWhen chicken is cooked through, remove to a dish, and keep warm. Boil the liquid in the skillet until it is reduced to about 1 1/2 cups. Whisk cream into the reduced liquid, breaking up the garlic cloves as much as you can. Return chicken to the pan, and heat through.\n",
        "picture_link": "UMI5SGGhIm6qXvGT7cRkmAFuyuW6pU."
    },
    {
        "title": "Banana Loaf",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3 ripe bananas, mashed ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x5 inch loaf pan.\nIn a large bowl, cream together the butter and sugar until light and fluffy. Stir in the eggs one at a time, beating well with each addition, stir in the mashed bananas.\nIn a large bowl, sift together flour, baking powder, baking soda, salt. Blend the banana mixture into the flour mixture; stirring just to combine. Fold in the nuts.\nBake in preheated oven for 60 minutes, until a toothpick inserted into center of the loaf comes out clean.\n",
        "picture_link": "lkljH7poFhEGgwalOfzc6GOK/UotYT."
    },
    {
        "title": "Garlic Herb Grilled Pork Tenderloin",
        "ingredients": [
            "3 pounds pork tenderloin ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "1/2 teaspoon chopped fresh thyme ADVERTISEMENT",
            "1/2 tablespoon chopped fresh rosemary ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "2 tablespoons ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut a horizontal slit in the pork tenderloin, leaving the halves attached. Rub tenderloin with olive oil.\nInsert garlic into the slit and on onto the fatty part of pork. Press thyme and rosemary into slit. Sprinkle tenderloin with salt and pepper.\nPreheat an outdoor grill for medium-high heat.\nLightly oil the grill grate. Place pork on grill. Cook approximately 1 hour, turning every 15 minutes, to a minimum internal temperature of 145 degrees F (63 degrees C).\n",
        "picture_link": "C4dxXlTAt.UAwmgtPc4re2Yh0UsPwnq"
    },
    {
        "title": "Sausage Smothered in Red Cabbage",
        "ingredients": [
            "1 small head red cabbage, shredded ADVERTISEMENT",
            "1 apple, cored and diced ADVERTISEMENT",
            "3 teaspoons salt, divided ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "1 tablespoon wine vinegar ADVERTISEMENT",
            "1 pound kielbasa sausage, cut into 1 inch pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the cabbage in a large kettle, and add the diced apple, 2 teaspoons of the salt, lemon juice, and 1/2 cup water. Bring to a boil then simmer, covered, about 15 minutes stirring occasionally.\nIn hot butter, saute the onion until golden. Add the onion to the cabbage along with 1 teaspoon salt, pepper, vinegar and sausage. Cook, covered, 20 to 30 minutes until sausage is heated through. To serve, spoon the cabbage onto a heated platter, topping it with the sausage.\n",
        "picture_link": "xga//vE5/eiMdl8ZJl30/aIpcFoUo3y"
    },
    {
        "title": "Secret Burger Sauce",
        "ingredients": [
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/4 cup ketchup ADVERTISEMENT",
            "1/2 cup chopped dill pickles ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together the mayonnaise, ketchup, pickles, garlic powder, and pepper in a bowl, and place a dollop on your hamburger!\n",
        "picture_link": "4GA0.qCK5wAJcGaNt2f/BshBA.TUgky"
    },
    {
        "title": "Italian Chicken and Chickpeas",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "2 tablespoons dried rosemary ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "1 teaspoon Italian seasoning ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "1 1/2 teaspoons white sugar ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1/4 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1 (15 ounce) can garbanzo beans, drained and rinsed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 2 tablespoons olive oil in a large skillet over medium heat. Season the chicken with the rosemary on both sides; cook the chicken in the hot oil until browned evenly, 3 to 4 minutes per side. Remove the chicken from the pan and set aside.\nPour 1 tablespoon olive oil into the skillet. Cook and stir the garlic in the hot oil until fragrant, about 1 minute. Add the tomato sauce, Italian seasoning, cayenne pepper, sugar, bay leaf, and red pepper flakes to the skillet; stir. Return the chicken to the skillet; cover and reduce heat to medium-low. Simmer until the chicken is no longer pink in the center and the juices run clear, 10 to 12 minutes.\nStir the garbanzo beans into the skillet; continue cooking until the beans are heated, 2 to 3 minutes more.\n",
        "picture_link": "BnWtkrJHek2HFJzWn8pDmlvrRv6r5Im"
    },
    {
        "title": "Quick and Easy Grilled Potatoes",
        "ingredients": [
            "2 large russet potatoes, scrubbed ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Poke each potato with the tines of a fork. Place the potatoes in a microwave oven, and cook on high power for about 5 minutes. Check about halfway through, and turn potatoes over for even cooking. Slice each potato in half the long way and cook potatoes another 2 minutes on high power.\nPreheat a grill for medium heat.\nBrush the potato tops with olive oil, and season with salt and pepper to taste.\nCook on prepared grill for 15 to 20 minutes, turning once.\n",
        "picture_link": "gg.awwl8YnKr.pBaoBoX1A9Mlkfim76"
    },
    {
        "title": "Asian Style Country Ribs",
        "ingredients": [
            "1/4 cup lightly packed brown sugar ADVERTISEMENT",
            "1 cup soy sauce ADVERTISEMENT",
            "1/4 cup sesame oil ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 tablespoons rice vinegar ADVERTISEMENT",
            "2 tablespoons lime juice ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "2 tablespoons minced fresh ginger ADVERTISEMENT",
            "1 teaspoon Sriracha hot pepper sauce ADVERTISEMENT",
            "12 boneless country-style pork ribs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together the brown sugar, soy sauce, sesame oil, olive oil, rice vinegar, lime juice, garlic, ginger, and Sriracha in the crock of a slow cooker. Add the ribs; cover and refrigerate. Allow ribs to marinate in the refrigerator for 8 hours or overnight.\nBefore cooking, drain marinade and discard. Cook on Low for 9 hours. Drain cooked meat and shred, using 2 forks.\n",
        "picture_link": "tpFMjTNV/uO5lmHDM/ZJutUd3WkyJqu"
    },
    {
        "title": "French Canadian Tourtiere",
        "ingredients": [
            "1 pound lean ground pork ADVERTISEMENT",
            "1/2 pound lean ground beef ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1/2 teaspoon dried thyme, crushed ADVERTISEMENT",
            "1/4 teaspoon ground sage ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/8 teaspoon ground cloves ADVERTISEMENT",
            "1 recipe pastry for a 9 inch double crust pie ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan, combine pork, beef, onion, garlic, water, salt, thyme, sage, black pepper and cloves. Cook over medium heat until mixture boils; stirring occasionally. Reduce heat to low and simmer until meat is cooked, about 5 minutes. Allow to cool to room temperature.\nPreheat oven to 425 degrees F (220 degrees C).\nSpoon the meat mixture into the pie crust. Place top crust on top of pie and pinch edges to seal. Cut slits in top crust so steam can escape. Cover edges of pie with strips of aluminum foil.\nBake in preheated oven for 20 minutes; remove foil and return to oven. Bake for an additional 15 to 20 minutes, or until golden brown. Let cool 10 minutes before slicing.\n",
        "picture_link": "tSV4COtAk3Y.ow02uxdDh3NdgNn.LAS"
    },
    {
        "title": "Pralines",
        "ingredients": [
            "1 1/2 cups toasted pecans ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "3/8 cup butter ADVERTISEMENT",
            "3/4 cup brown sugar ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line a baking sheet with aluminum foil.\nIn large saucepan over medium heat, combine pecans, sugar, butter, brown sugar, milk and vanilla. Heat to between 234 and 240 degrees F (112 to 116 degrees C), or until a small amount of syrup dropped into cold water forms a soft ball that flattens when removed from the water and placed on a flat surface.\nDrop by spoonfuls onto prepared baking sheet. Let cool completely.\n",
        "picture_link": "6CPrIFlHm5DObGyK0WKbMOhbI3IgAp6"
    },
    {
        "title": "Pretzel Salad",
        "ingredients": [
            "2 cups crushed pretzels ADVERTISEMENT",
            "3/4 cup margarine, melted ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "4 1/2 ounces frozen whipped topping, thawed ADVERTISEMENT",
            "1 (6 ounce) package strawberry flavored Jell-O® ADVERTISEMENT",
            "2 cups boiling water ADVERTISEMENT",
            "2 (10 ounce) packages frozen strawberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nIn a medium bowl, mix crushed pretzels, margarine and sugar.\nPress crushed pretzel mixture into the bottom of a 9x13 inch baking dish, and bake in the preheated oven 8 minutes. Remove from heat and allow to cool.\nBlend together the cream cheese and sugar. Fold in whipped topping and spread evenly over cooled pretzel mixture.\nIn a medium bowl, dissolve the strawberry flavored gelatin in boiling water. Mix in strawberries and set aside to cool for 15 minutes.\nPour gelatin mixture over cream cheese mixture and refrigerate until set, about 4 hours.\n",
        "picture_link": "bWkFoMYYwKkGA4aWpNHKnep8xtMbFKa"
    },
    {
        "title": "False Cabbage Rolls",
        "ingredients": [
            "1 pound lean ground beef ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "1 medium head cabbage, sliced ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed tomato soup ADVERTISEMENT",
            "10 3/4 fluid ounces water ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium-high heat. Cook and stir beef and sliced onion in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease.\nStir in sliced cabbage, tomato soup, water (use the empty soup can to measure), salt, and pepper. Cover and simmer until cabbage is tender, stirring occasionally, about 25 minutes. Stir in sour cream just before serving.\n",
        "picture_link": "yfZbhzkwqZp02w/RhHZYOD1vCcVOBm2"
    },
    {
        "title": "Super Easy Slow Cooker Chicken",
        "ingredients": [
            "1 (10.75 ounce) can condensed low fat cream of chicken and herbs soup ADVERTISEMENT",
            "1 (4 ounce) can mushroom pieces, drained ADVERTISEMENT",
            "1/2 red onion, chopped ADVERTISEMENT",
            "1 1/2 pounds skinless, boneless chicken breast halves - cut into strips ADVERTISEMENT",
            "1 dash Marsala wine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine soup, mushroom pieces, onion, chicken, and wine in slow cooker.\nCook on Low setting for 2 1/2 to 3 hours.\n",
        "picture_link": "9HBW/Pe2MVnHG23iVwZ3qoth2703oZ2"
    },
    {
        "title": "Little Smokies",
        "ingredients": [
            "1 (18 ounce) bottle barbeque sauce ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1/3 cup chopped onion ADVERTISEMENT",
            "2 (16 ounce) packages little wieners ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together barbecue sauce, brown sugar, ketchup, Worcestershire sauce, onion, and wieners in the bowl of a slow cooker. Cook on LOW for 2 hours, or until ready to serve.\n",
        "picture_link": "GY3mDmkV3JqzYS8/RYznXW/XnIK0weW"
    },
    {
        "title": "Best in Show Blackberry Cobbler",
        "ingredients": [
            "1/2 cup white sugar ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/4 cup melted margarine ADVERTISEMENT",
            "2 cups fresh blackberries ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Grease a 9x9-inch baking dish.\nWhisk 1/2 cup sugar together with the flour and baking powder in a mixing bowl. Stir in the milk and margarine until a batter forms. Scrape into the prepared baking dish. Add the blackberries, and sprinkle with 1/2 cup sugar. Pour in the water.\nBake in the preheated oven until the batter has risen and the top is brown, 45 minutes to 1 hour. Cool before serving.\n",
        "picture_link": "YRQ9KGdlWFONbvVqlq5hQfTnB5cc.kq"
    },
    {
        "title": "Thai Chicken Balls",
        "ingredients": [
            "2 pounds ground chicken ADVERTISEMENT",
            "1 cup dry bread crumbs ADVERTISEMENT",
            "4 green onions, sliced ADVERTISEMENT",
            "1 tablespoon ground coriander seed ADVERTISEMENT",
            "1 cup chopped fresh cilantro ADVERTISEMENT",
            "1/4 cup sweet chili sauce ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix together the chicken and bread crumbs. Season with green onion, ground coriander, cilantro, chili sauce and lemon juice; mix well.\nUsing damp hands, form mixture into evenly shaped balls that are either small enough to eat with your fingers, or large enough to use as burgers.\nHeat oil in a large skillet over medium heat. Fry the chicken balls in batches until well browned all over.\n",
        "picture_link": "EXvf.BX8qAhveeVDPRjd3GoVOLjXnBe"
    },
    {
        "title": "Fried Zucchini",
        "ingredients": [
            "2 zucchini, quartered and sliced ADVERTISEMENT",
            "1 onion, sliced into rings ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup cornmeal ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1 cup vegetable oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place zucchini and onions in a medium bowl and mix together.\nIn a small bowl mix flour, cornmeal, salt, pepper and garlic powder.\nPour dry mixture over zucchini/onion mixture, cover bowl and shake well. Let mixture sit for about 30 minutes; a batter will form on the vegetables.\nIn a medium skillet heat oil over medium heat. When oil is hot add breaded vegetables and fry, turning to brown evenly.\n",
        "picture_link": "oq3tJUg3PYz6tXkjcZydxafVn/gI..C"
    },
    {
        "title": "Parmesan Tomatoes",
        "ingredients": [
            "4 ripe tomatoes, sliced ADVERTISEMENT",
            "4 tablespoons mayonnaise ADVERTISEMENT",
            "4 tablespoons Parmesan cheese ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "1 tablespoon brown mustard ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 teaspoon chopped fresh parsley ADVERTISEMENT",
            "1/4 cup shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nArrange tomato slices in a single layer on a baking sheet. In a small bowl, mix together mayonnaise, parmesan, Dijon mustard, and brown mustard. Season with oregano, and salt and pepper to taste. Use a spoon to top each tomato slice with a small amount of the mayonnaise mixture. Sprinkle with mozzarella , and then top with parsley.\nBake in preheated oven for approximately 15 minutes, or until golden brown. Serve immediately.\n",
        "picture_link": "hTUH1uDn3EZKP0q2K88YfW9iE32edv2"
    },
    {
        "title": "Lisa's Easy Chicken",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 tablespoon garlic salt ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "1 tablespoon chopped fresh chives ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon Old Bay® Seasoning ADVERTISEMENT",
            "1 teaspoon seasoning salt ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "2 medium green bell peppers, chopped ADVERTISEMENT",
            "2 large tomatoes, chopped ADVERTISEMENT",
            "1 red onion, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl, mix the olive oil, garlic salt, parsley, chives, pepper, Old Bay Seasoning, and seasoning salt. Rub the chicken breasts with 1/2 the mixture, and place the breasts in a medium baking dish.\nToss the green bell peppers, tomatoes, and red onion with the remaining olive oil mixture. Arrange over the chicken.\nBake 1 hour in the preheated oven, stirring the vegetables once, until the vegetables are tender, the chicken is no longer pink, and its juices run clear.\n",
        "picture_link": "eMqFX/V6MvFVpzdVk8WvOFN4k5en3xu"
    },
    {
        "title": "Potato and Cheese Frittata",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 large russet potatoes, peeled and shredded ADVERTISEMENT",
            "1 medium onion, diced ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "4 eggs, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 400 degrees F (200 degrees C).\nHeat oil in a 12 inch skillet over medium-high heat. When the skillet is hot, add the potatoes, and fry until crispy and golden, about 15 minutes. Reduce heat to medium, and add onions. Cook, stirring, until softened. Season with salt and pepper. Pour eggs over the potatoes and onions.\nPlace the skillet in the oven for about 10 minutes, or until eggs are firm. Remove from the oven, and sprinkle shredded cheese over the top. Return to the oven for about 5 minutes, or until cheese is melted.\n",
        "picture_link": "WgfCfl.uU8.pAbvmcdFBBpOzcWwBHcy"
    },
    {
        "title": "Mimi's Smoked Salmon Chowder",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "1/2 cup chopped celery ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "6 cups chicken broth or vegetable broth ADVERTISEMENT",
            "1 pound potatoes - peeled and cubed ADVERTISEMENT",
            "1 teaspoon dried dill weed ADVERTISEMENT",
            "1 teaspoon dried tarragon ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "8 ounces smoked salmon, cut into 1/2 inch pieces ADVERTISEMENT",
            "1/4 cup white wine ADVERTISEMENT",
            "1 tablespoon fresh lemon juice ADVERTISEMENT",
            "1/4 teaspoon hot sauce ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon fresh-ground black pepper ADVERTISEMENT",
            "1 cup half and half ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large stockpot over medium-high heat, combine the butter, olive oil, onion, garlic, and celery. Cook 8 to 10 minutes, or until the onions are transparent. Sprinkle flour over the mixture and stir well to make a dry roux. Gradually add the chicken broth and stir until slightly thickened. Stir in the potatoes, dill, tarragon, thyme, and paprika. Reduce heat to medium, cover, and simmer for 15 minutes.\nStir in the salmon, wine, lemon juice, hot sauce, salt, and pepper. Simmer over low heat, uncovered for 10 minutes.\nMix in the half-and-half and continue to simmer for 30 minutes, stirring occasionally. Do not let the chowder boil after adding the half-and-half. Serve hot.\n",
        "picture_link": "PT3ZciUNZqQYpJ9YsxjEQMoG1g8AQLy"
    },
    {
        "title": "Refrigerator Dill Pickles",
        "ingredients": [
            "3 1/2 cups water ADVERTISEMENT",
            "1 1/4 cups white vinegar ADVERTISEMENT",
            "1 tablespoon sugar ADVERTISEMENT",
            "1 tablespoon sea salt ADVERTISEMENT",
            "4 cups cucumber spears ADVERTISEMENT",
            "2 cloves garlic, whole ADVERTISEMENT",
            "2 heads fresh dill ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir water, vinegar, sugar, and sea salt together in a saucepan over high heat. Bring to a boil; remove from heat and cool completely.\nCombine cucumber spears, garlic cloves, and fresh dill in a large glass or plastic container. Pour cooled vinegar mixture over cucumber mixture. Seal container with lid and refrigerate for at least 3 days.\n",
        "picture_link": "SbnutRI6hWi3ni0/7.g7EwfxCJ1y3Nq"
    },
    {
        "title": "Banana Waffles",
        "ingredients": [
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "3 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "1 cup 1% milk ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 ripe bananas, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat waffle iron. In a large mixing bowl, sift together flour, baking powder, salt and nutmeg. Stir in milk and eggs until mixture is smooth.\nSpray preheated waffle iron with non-stick cooking spray. Pour two tablespoons of the waffle batter onto the hot waffle iron. Place two slices of banana on top of the batter and then spoon another two tablespoons of batter on top of the banana. Cook until golden brown. Serve hot.\n",
        "picture_link": "AShcbZBYROOX8RkA8cMrokUqDskqmJy"
    },
    {
        "title": "Spinach and Mushroom Frittata",
        "ingredients": [
            "1 (10 ounce) package frozen chopped spinach, thawed and squeezed thoroughly to remove liquid ADVERTISEMENT",
            "4 eggs or equivalent egg substitute ADVERTISEMENT",
            "1 cup part-skim ricotta cheese ADVERTISEMENT",
            "3/4 cup freshly grated Parmesan cheese ADVERTISEMENT",
            "3/4 cup chopped portobello mushrooms ADVERTISEMENT",
            "1/2 cup finely chopped scallions with some green tops ADVERTISEMENT",
            "1/4 teaspoon dried Italian seasonings ADVERTISEMENT",
            "1 pinch Salt and pepper, to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees.\nIn a large bowl, whisk together all ingredients until well mixed. Spray a 9-inch pie plate with cooking spray and fill with the spinach mixture.\nBake for 30 minutes, or until browned and set. Let cool for 20 minutes, cut in wedges and serve.\n",
        "picture_link": "BbS5wKf6w6GYi.xUTZFqt.LjiHIAKHK"
    },
    {
        "title": "Wassail Punch",
        "ingredients": [
            "2 quarts apple cider ADVERTISEMENT",
            "2 cups orange juice ADVERTISEMENT",
            "1/2 cup lemon juice ADVERTISEMENT",
            "12 whole cloves ADVERTISEMENT",
            "4 cinnamon sticks ADVERTISEMENT",
            "1 pinch ground ginger ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a slow-cooker or a large pot over low heat, combine apple cider, orange juice and lemon juice. Season with cloves, ginger and nutmeg. Bring to a simmer. If using a slow cooker, allow to simmer all day. Serve hot.\n",
        "picture_link": "zPdu.RA6CaI9HNpVOmbUtIVQQyrsSgC"
    },
    {
        "title": "Grandma B's Bean Soup",
        "ingredients": [
            "1 pound dry navy beans ADVERTISEMENT",
            "3 carrots, peeled and shredded ADVERTISEMENT",
            "2 medium potatoes, peeled and diced ADVERTISEMENT",
            "3 stalks celery, sliced ADVERTISEMENT",
            "1 medium onion, diced ADVERTISEMENT",
            "2 cups cubed cooked ham ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the beans in a slow cooker with enough water to cover, and soak 6 to 8 hours, or overnight.\nDrain the beans, and return to the slow cooker. Cover with water, and mix in the carrots, potatoes, celery, onion, and ham.\nCover slow cooker, and cook soup on High for 3 1/2 hours. Switch to Low, and continue cooking at least 6 1/2 hours. The longer it cooks the more flavorful it becomes.\n",
        "picture_link": "J3sMeTSJmOHqiTS7QVJ1BXnJ4Kj3vEO"
    },
    {
        "title": "Polish Chicken and Dumplings",
        "ingredients": [
            "1 (3 pound) whole chicken ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 stalk celery, with leaves ADVERTISEMENT",
            "1 tablespoon poultry seasoning ADVERTISEMENT",
            "1 teaspoon whole allspice ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon black pepper ADVERTISEMENT",
            "1 teaspoon seasoning salt ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup (optional) ADVERTISEMENT",
            "DUMPLINGS: ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 teaspoon black pepper ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken, onion, and celery in a large pot, and then fill pot with water. Season with poultry seasoning, whole allspice, basil, 1/2 teaspoon salt, 1 teaspoon pepper, and seasoning salt. Bring to a boil. Reduce heat, and simmer for approximately 2 hours, or until chicken is done.\nRemove chicken from broth, and strain broth to remove seasonings and any bone. Return broth to pan, stir in cream of chicken soup, and continue simmering. Set chicken aside to cool.\nIn a medium bowl, stir together eggs, olive oil, 1 tablespoon salt, and 1 teaspoon pepper with 2 cups water. Gradually add flour, and stir until thick.\nUsing a large spoon and knife, scoop a spoonful of the dough and cut small pieces into the broth. Repeat until all the dough has been used. Stir, cover, and simmer for about 15 minutes.\nMeanwhile, skin and debone the chicken. Cut the meat into small pieces, add to the broth, and heat through. Serve.\n",
        "picture_link": "FaYAb46DvFb.W3cmYK8APd4EiZ90veG"
    },
    {
        "title": "Chicken, Rice and Vegetable Soup",
        "ingredients": [
            "5 cups water ADVERTISEMENT",
            "1 (14.5 ounce) can chicken broth ADVERTISEMENT",
            "1 skinless, boneless chicken breast halves - cut into cubes ADVERTISEMENT",
            "3 carrots, chopped ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3 stalks celery, chopped ADVERTISEMENT",
            "2 cubes chicken bouillon ADVERTISEMENT",
            "1/3 cup uncooked white rice ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan over high heat, combine 4 cups water and the chicken broth and bring to a boil. Add the chicken, carrots, onion, celery and bouillon and reduce heat to low. Cover and simmer for about 15 minutes or until the vegetables are soft.\nAdd more water as necessary. Add the rice and allow to simmer for another 15 minutes, or until the rice is tender. Add salt and pepper to taste.\n",
        "picture_link": "4VkEQT4KGGYuGOZvefcSx/XxmbBOLIm"
    },
    {
        "title": "Clams Italiano",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "5 cloves garlic, minced ADVERTISEMENT",
            "2 cups dry white wine ADVERTISEMENT",
            "1 tablespoon dried oregano ADVERTISEMENT",
            "1 tablespoon dried parsley ADVERTISEMENT",
            "1 teaspoon crushed red pepper flakes (optional) ADVERTISEMENT",
            "36 clams in shell, scrubbed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large skillet over medium heat. Cook garlic in butter briefly. Stir in wine, and season with oregano, parsley, and red pepper flakes.\nPlace clams in the wine mixture. Cover, and steam until all the clams have opened: discard any that do not open. Serve in soup bowls, and ladle broth generously over them.\n",
        "picture_link": "gZiIWw9mI4.B8sp4PUWtEGKBGjvZac6"
    },
    {
        "title": "Strawberry Soup I",
        "ingredients": [
            "2 pints strawberries ADVERTISEMENT",
            "2 cups plain yogurt ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/8 teaspoon ground cardamom ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender, combine the strawberries, yogurt, orange juice, sugar, water and cardamom. Puree until well mixed. Chill and serve.\n",
        "picture_link": "EywgGsFMbnCAiprfTwzqH24LFX35NYK"
    },
    {
        "title": "Chicken Cashew Salad",
        "ingredients": [
            "2 cups seashell pasta ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1 cup creamy salad dressing (e.g. Miracle Whip) ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "1 tablespoon distilled white vinegar ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "2 cups chopped celery ADVERTISEMENT",
            "1/2 cup chopped green bell pepper ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3 boneless chicken breast halves, cooked and cut into bite-sized pieces ADVERTISEMENT",
            "1 cup cashew halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain and rinse with cold water.\nIn large bowl, combine brown sugar, salad dressing, lemon juice, vinegar and salt. Toss dressing mixture with cooked pasta, celery, green pepper, onion and chicken. Chill until ready to serve. Mix in cashews just before serving.\n",
        "picture_link": "BdXvVtE2ObDP5mZST3QGrK2xnpFygQO"
    },
    {
        "title": "Campfire Banana Splits",
        "ingredients": [
            "6 large bananas, unpeeled, stems removed ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "1 (10.5 ounce) package miniature marshmallows ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the grill for high heat.\nSpray 4 sheets of aluminum foil, large enough to wrap bananas, with cooking spray.\nSlice the peel of the banana from stem to bottom, while slicing the banana inside lengthwise. The bananas can be cut into slices instead if you like, (while still in the peel) for easier handling later.\nCarefully open the banana just wide enough to place the chocolate chips and marshmallows inside the peel with the banana. Stuff with as much of the chocolate chips and marshmallows as desired.\nWrap the bananas with the aluminum foil and place on the grill or directly in the coals of a fire. Leave in long enough to melt the chips and the marshmallows, about 5 minutes. Unwrap bananas, open the peels wide, and eat with a spoon.\n",
        "picture_link": "FRRQeOweYwZWDrseTsibt7DWTmAiXUS"
    },
    {
        "title": "Slow Cooker Beef Stroganoff II",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 1/2 pounds round steak, cubed ADVERTISEMENT",
            "1/4 cup all-purpose flour for coating ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed golden mushroom soup ADVERTISEMENT",
            "3 1/2 cups water ADVERTISEMENT",
            "3 cubes beef bouillon ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 (16 ounce) package egg noodles ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large skillet over medium high heat. Roll the beef in flour and saute in the hot oil until well browned, about 5 minutes.\nTransfer the meat to the slow cooker and top with the soup, water and bouillon.\nCook on high setting for 8 hours. Stir in the sour cream during the last 30 minutes.\nCook the egg noodles according to package directions. Serve the meat over the noodles.\n",
        "picture_link": "2fBhaK/BkSTdCBwTZd01wV.wi2hQYbG"
    },
    {
        "title": "Potato and Bean Enchiladas",
        "ingredients": [
            "1 pound potatoes, peeled and diced ADVERTISEMENT",
            "1 teaspoon cumin ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 tablespoon ketchup ADVERTISEMENT",
            "1 pound fresh tomatillos, husks removed ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 bunch fresh cilantro, coarsely chopped, divided ADVERTISEMENT",
            "2 (12 ounce) packages corn tortilla ADVERTISEMENT",
            "1 (15.5 ounce) can pinto beans, drained ADVERTISEMENT",
            "1 (12 ounce) package queso fresco ADVERTISEMENT",
            "oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (205 degrees C). In a bowl, toss diced potatoes together with cumin, chili powder, salt, and ketchup, and place in an oiled baking dish. Bake in the preheated oven for 20 to 25 minutes, or until tender.\nMeanwhile, boil tomatillos and chopped onion in water to cover for 10 minutes. Set aside to cool. Once cooled, puree with half of the cilantro until smooth.\nFry tortillas individually in a small amount of hot oil until soft.\nMix potatoes together with pinto beans, 1/2 cheese, and 1/2 cilantro. Fill tortillas with potato mixture, and roll up. Place seam side down in an oiled 9x13 inch baking dish. Spoon tomatillo sauce over enchiladas, and spread remaining cheese over sauce. Bake for 20 minutes, or until hot and bubbly.\n",
        "picture_link": "wyMLY8eIIVeiSUV5Wyn6rNJUhkgS2Cq"
    },
    {
        "title": "Pumpkin Pie Cake I",
        "ingredients": [
            "1 (29 ounce) can pumpkin puree ADVERTISEMENT",
            "1 (12 fluid ounce) can evaporated milk ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "4 teaspoons pumpkin pie spice ADVERTISEMENT",
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "3/4 cup butter ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease one 9 x 13 inch pan (preferably metal).\nIn a large bowl, combine pumpkin, evaporated milk, eggs, sugar, salt, and pumpkin pie spice. Mix well. Pour batter into the prepared pan.\nSprinkle the dry cake mix evenly over the pumpkin mixture. Melt the butter or margarine, and drizzle it over the cake mix. Sprinkle walnuts over the top.\nBake for 55 to 60 minutes, or until done.\n",
        "picture_link": "eVEI1lUvinWaLpctSsMkh5y45l3fQFu"
    },
    {
        "title": "Teriyaki Onion Burgers",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1/4 cup teriyaki marinade sauce ADVERTISEMENT",
            "1 (3 ounce) can French-fried onions ADVERTISEMENT",
            "4 slices Cheddar cheese ADVERTISEMENT",
            "4 hamburger buns, split ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat a grill for high heat.\nIn a medium bowl, mix together the ground beef, teriyaki marinade and French-fried onions. Form the mixture into 4 patties.\nLightly oil the grilling surface, and place patties on the preheated grill. Grill for 4 to 5 minutes per side, or until well done. Top with cheese, and serve on hamburger buns.\n",
        "picture_link": "0jQyYJwgCWc/74zUNvZYF4CR0G/ulga"
    },
    {
        "title": "London Broil",
        "ingredients": [
            "1 1/2 pounds top round, London Broil cut ADVERTISEMENT",
            "1 tablespoon meat tenderizer ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "2 teaspoons seasoning salt ADVERTISEMENT",
            "1/4 teaspoon lemon pepper ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "4 teaspoons chopped fresh parsley ADVERTISEMENT",
            "2 teaspoons tarragon vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Score top and bottom of meat with a 1 1/2 inch square pattern, and score the side. Sprinkle meat liberally with unseasoned meat tenderizer, then pierce with fork 1/8 inch apart and at least half-way through the meat on both sides. Sprinkle lightly with water, and rub in tenderizer. Place on a plate, cover, and set aside for an hour.\nIn a small bowl, mix together oil, lemon juice, seasoned salt, lemon pepper, garlic, parsley, and tarragon vinegar. Pour marinade over meat, reserving a portion to be used for brushing (Note: DO NOT mix the reserved marinade with the meat; set aside for later). Pour remaining marinade over meat, recover dish and refrigerate for three hours, turning every half hour.\nPreheat grill for hot heat.\nLightly oil grate, and position it 2 inches above the coals. Place meat on grill, and cook for 5 minutes. Turn meat over, brush with marinade, and cook for another 5 minutes.\n",
        "picture_link": "fJlHIOg2dlwNadAKNYkNBUX3FhO6xLW"
    },
    {
        "title": "Irresistible Double Chocolate Muffins",
        "ingredients": [
            "1 cup whole wheat flour ADVERTISEMENT",
            "3/4 cup ground flax seed ADVERTISEMENT",
            "1/2 cup wheat germ ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/2 cup cocoa powder ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1/2 cup miniature semisweet chocolate chips ADVERTISEMENT",
            "1 cup low-fat buttermilk ADVERTISEMENT",
            "3/4 cup pumpkin puree ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 400 degrees F (200 degrees C). Grease 12 muffin cups, or line with paper muffin liners.\nCombine flour, flax seed, wheat germ, baking soda, baking powder, cocoa powder, cinnamon, and chocolate chips in a large bowl. In another bowl, beat the buttermilk, pumpkin puree, brown sugar, egg, and vanilla until smooth. Gently stir the wet ingredients into the dry, mixing just until combined. Spoon equal amounts of batter into muffin cups.\nBake until a toothpick inserted in the center of a muffin comes out clean, about 20 to 30 minutes.\n",
        "picture_link": "6pN7dXewGi14lw7V7fdV1ZESn75jQie"
    },
    {
        "title": "Slow Cooker Cocktail Smokies",
        "ingredients": [
            "2 (16 ounce) packages miniature smoked sausage links ADVERTISEMENT",
            "1 (8 ounce) jar grape jelly ADVERTISEMENT",
            "1 (12 ounce) bottle barbeque sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine grape jelly and barbeque sauce in a slow cooker. Stir in the miniature smoked sausage links. Cook on High, until heated through, 2 to 3 hours.\n",
        "picture_link": "/l/1FUd7lmQc/qjWxv4ZRfsESEgv4n2"
    },
    {
        "title": "Poor Man's Hamburger Steaks",
        "ingredients": [
            "3 pounds ground beef ADVERTISEMENT",
            "25 saltine crackers, crushed ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon Italian seasoning ADVERTISEMENT",
            "3 (10.75 ounce) cans condensed cream of mushroom soup ADVERTISEMENT",
            "1 (8 ounce) can mushrooms, drained (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nIn a large bowl, mix together the ground beef, crackers, milk, pepper, salt, garlic powder, and Italian seasoning. Form 6 or 8 large beef patties, and place in a 9x13 inch baking dish, or other shallow casserole dish. Pour the condensed soup evenly over the top of the patties, and sprinkle canned mushrooms over the top. Cover the pan with a lid or aluminum foil.\nBake for about 45 minutes in the preheated oven, or until beef patties are well done.\n",
        "picture_link": "lMEZVutbtq53VF2Jq8dY99BepDJlS.6"
    },
    {
        "title": "Double Chili Cheese Dip",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 (15 ounce) can chili without beans ADVERTISEMENT",
            "4 green onions, thinly sliced ADVERTISEMENT",
            "1/4 cup diced green chiles, drained ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9-inch pie plate.\nSpread cream cheese into the prepared pie plate. Top the cream cheese with chili, onions, chilies, and cheese.\nBake at 350 degrees F (175 degrees C) for 15 to 20 minutes.\n",
        "picture_link": "4LFuvyyhVHVBVuWKq3hngRGTmKcXq9K"
    },
    {
        "title": "Jalapeno Cream Cheese Chicken Enchiladas",
        "ingredients": [
            "3 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 teaspoon cayenne pepper ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 large onion, minced ADVERTISEMENT",
            "2 jalapeno peppers, seeded and minced (wear gloves) ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "1/2 teaspoon chili powder ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1 (28 ounce) can green enchilada sauce ADVERTISEMENT",
            "7 flour tortillas ADVERTISEMENT",
            "8 ounces shredded Monterey Jack cheese, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSeason chicken breasts with 1 teaspoon of cayenne pepper, 1/2 teaspoon of garlic powder, salt, and black pepper. Place into a baking dish.\nBake in the preheated oven until the chicken is no longer pink inside and the juices run clear, about 45 minutes. Allow chicken to cool, and shred with 2 forks. Set chicken aside.\nHeat butter in a large nonstick skillet over medium heat, and cook the onion and jalapenos until the onion is translucent, about 5 minutes; stir in the cream cheese in chunks, and allow cream cheese to melt and soften. Stir the cream cheese into the vegetables, and mix in 1/2 teaspoon of cayenne pepper, 1 tablespoon of garlic powder, the paprika, chili powder, and cumin. Mix in the cooked chicken meat; remove from heat.\nPour half the green enchilada sauce into the bottom of a 9x13-inch baking dish. Lay tortillas out onto a work surface, and place chicken mixture in a line down the center of each tortilla; sprinkle with about 1 tablespoon of Monterey Jack cheese per tortilla. Roll up the tortillas, and place into the sauce in the dish, seam sides down; pour the remaining sauce over the enchiladas. Sprinkle remaining 4 ounces of Monterey Jack cheese over the top.\nBake in the preheated oven until the filling is hot and bubbling and the cheese has melted, 30 to 35 minutes.\n",
        "picture_link": "MUJlxS5lNoc8Cm1Sfmk0GgT.phzoptC"
    },
    {
        "title": "Jenny's Jambalaya",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 large onions, chopped ADVERTISEMENT",
            "2 (14.5 ounce) cans stewed tomatoes, drained ADVERTISEMENT",
            "2 boneless chicken breast halves, cooked and shredded ADVERTISEMENT",
            "1 pound turkey sausage links, without casings, cooked and chopped ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1 tablespoon hot sauce ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 1/2 cups uncooked long-grain rice ADVERTISEMENT",
            "3 cups chicken broth ADVERTISEMENT",
            "1 pound large shrimp, peeled and deveined ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Select a medium-high setting for an electric skillet; heat oil in hot skillet. Cook onion in oil until soft. Stir in tomatoes, chicken, and sausage. Season with garlic powder, hot sauce, salt, and pepper. Stir in rice, pour in broth, and add shrimp.\nCover electric skillet. Cook at 300 degrees F (150 degrees C) for about 20 to 25 minutes, or until rice is tender.\n",
        "picture_link": "KOzRxVbweMAF70AoEiUlaiVjmTebHoi"
    },
    {
        "title": "Peachy Bread Pudding with Caramel Sauce",
        "ingredients": [
            "2 cups fresh peaches - peeled, pitted and halved ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "3 eggs, lightly beaten ADVERTISEMENT",
            "1 1/4 cups hot water ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "4 cups French bread, torn into small pieces ADVERTISEMENT",
            "CARAMEL SAUCE ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2 tablespoons light corn syrup ADVERTISEMENT",
            "1 tablespoon rum ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 325 degrees F (165 degrees C). Grease a 9x13-inch baking dish.\nChop the peaches and lightly mash them in a mixing bowl. Combine the sweetened condensed milk and the eggs; add them to the peaches and mix well. Stir in the hot water, melted butter, cinnamon, and vanilla. Stir the French bread into to the custard mixture until the bread is completely moistened. Turn the pudding into the prepared baking dish.\nBake until a knife inserted in the center of the pudding comes out clean, about 1 hour and 10 minutes.\nWhile the pudding is baking, combine the brown sugar, 1/2 cup butter, corn syrup, and rum in a saucepan. Bring to a boil over medium heat and simmer for 3 to 4 minutes or until just slightly thickened. Let cool slightly.\nRemove the pudding from the oven and let it cool for about ten minutes before serving. Serve warm with the caramel sauce. Cool and cover any leftover pudding and store it in the refrigerator.\n",
        "picture_link": "BDNWaDFSHVaYomTP2xlJjbER.6qDcZ6"
    },
    {
        "title": "Spinach, Red Lentil, and Bean Curry",
        "ingredients": [
            "1 cup red lentils ADVERTISEMENT",
            "1/4 cup tomato puree ADVERTISEMENT",
            "1/2 (8 ounce) container plain yogurt ADVERTISEMENT",
            "1 teaspoon garam masala ADVERTISEMENT",
            "1/2 teaspoon ground dried turmeric ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon ancho chile powder ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "1 (1 inch) piece fresh ginger root, grated ADVERTISEMENT",
            "4 cups loosely packed fresh spinach, coarsely chopped ADVERTISEMENT",
            "2 tomatoes, chopped ADVERTISEMENT",
            "4 sprigs fresh cilantro, chopped ADVERTISEMENT",
            "1 (15.5 ounce) can mixed beans, rinsed and drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse lentils and place in a saucepan with enough water to cover. Bring to a boil. Reduce heat to low, cover pot, and simmer over low heat for 20 minutes. Drain.\nIn a bowl, stir together tomato puree and yogurt. Season with garam masala, turmeric, cumin, and chile powder. Stir until creamy.\nHeat oil in a skillet over medium heat. Stir in onion, garlic, and ginger; cook until onion begins to brown. Stir in spinach; cook until dark green and wilted. Gradually stir in yogurt mixture. Then mix in tomatoes and cilantro.\nStir lentils and mixed beans into mixture until well combined. Heat through, about 5 minutes.\n",
        "picture_link": "KM3150DDx3/KPlwCzKJtEugdt1jlb8O"
    },
    {
        "title": "Easy Fried Spinach",
        "ingredients": [
            "1/4 cup canola oil ADVERTISEMENT",
            "1/4 cup unsalted butter ADVERTISEMENT",
            "2 (10 ounce) bags fresh spinach leaves ADVERTISEMENT",
            "8 cloves garlic, thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter with the canola oil in a large skillet over medium heat until it stops bubbling. This allows the water from the butter to evaporate. Add the garlic; cook and stir for about 2 minutes, until it is just beginning to brown. Put in the spinach leaves and cook for about 5 minutes while stirring, until the leaves are dark and are about 1/4 of their original size.\n",
        "picture_link": "jsPJXZInSOQZVP8O8go2VCEh3trJNW6"
    },
    {
        "title": "Creamed Cabbage",
        "ingredients": [
            "4 slices bacon ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 large head cabbage, cored and shredded ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Remove the bacon slices to cool.\nWhisk the butter, flour, and salt into the drippings in the same pan. Stir in the cabbage, and cook, stirring occasionally, over medium heat until cabbage is tender, about 15 minutes. Crumble the bacon; stir the bacon pieces and sour cream into the cabbage mixture.\n",
        "picture_link": "SA9vfLyHX.CzenKrQzsa.1/mh45.Q4y"
    },
    {
        "title": "Glo's Sausage Fried Rice",
        "ingredients": [
            "1 pound ground pork sausage ADVERTISEMENT",
            "5 eggs, beaten ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "1/2 head cabbage, cored and shredded ADVERTISEMENT",
            "3 carrots, chopped ADVERTISEMENT",
            "6 cups cooked white rice, cold ADVERTISEMENT",
            "1/4 cup soy sauce, or to taste ADVERTISEMENT",
            "1 (14.5 ounce) can bean sprouts, drained ADVERTISEMENT",
            "1 (6 ounce) package frozen green peas, thawed ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "3 green onions, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a skillet over medium-high heat, cook the sausage until evenly browned. Drain, and remove sausage from the pan. In the same pan, using the remaining coating of grease from the sausage, scramble the eggs, stirring frequently until cooked through. Set aside.\nHeat the oil in a very large skillet or electric skillet over medium-high heat. Stir fry the cabbage and carrots just until the cabbage has wilted. Add the cold rice, and fry, stirring so that there are no clumps. Mix in the sausage and pour in some soy sauce. Stir in bean sprouts, peas, and eggs, mixing well so there are no big chunks of egg. Season with pepper, and stir in green onions just before removing from the heat. Adjust soy sauce to taste, and serve.\n",
        "picture_link": "QMjviwk78evBh/ccMUGwV6Q6aPxa8/."
    },
    {
        "title": "Cashew Avocado Chicken Salad",
        "ingredients": [
            "4 cooked, boneless chicken breast halves, shredded ADVERTISEMENT",
            "1/4 cup ranch salad dressing, or to taste ADVERTISEMENT",
            "1 1/2 tablespoons chopped fresh dill ADVERTISEMENT",
            "1 cup cashews ADVERTISEMENT",
            "1 avocado - peeled, pitted and diced ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "12 slices bacon ADVERTISEMENT",
            "6 slices Swiss cheese ADVERTISEMENT",
            "12 slices bread, toasted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix the cooked chicken, dressing, dill, cashews, and avocado. Season with salt and pepper. Cover, and chill in the refrigerator at least 30 minutes.\nPlace bacon in a large, deep skillet. Cook over medium high heat until evenly brown; drain.\nSpread even amounts of the chicken mixture on 6 slices of toasted bread. Top each with 2 slices bacon and 1 slice Swiss cheese. Top with remaining bread slices to make sandwiches.\n",
        "picture_link": "gYqPkLgVEXchWLdxdqqE3pKE7QGesYu"
    },
    {
        "title": "Banana Cake X",
        "ingredients": [
            "2 tablespoons lemon juice ADVERTISEMENT",
            "2/3 cup milk ADVERTISEMENT",
            "2 large very ripe bananas, mashed ADVERTISEMENT",
            "1 (18.25 ounce) package butter cake mix ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan. Put 1 tablespoon lemon juice in a measuring cup with 2/3 cup milk. Set aside. Mash bananas with a fork, adding the remaining 1 tablespoon lemon juice to them as you mash. Set aside.\nIn a large bowl, combine cake mix and baking soda. Stir to combine. Add bananas, softened butter, milk mixture, eggs and vanilla. Beat at low speed until moistened (about 30 seconds). Beat at medium speed for 4 minutes. Pour into prepared pan.\nBake in the preheated oven for 30 to 35 minutes, or until center of cake springs back when lightly tapped. A toothpick stuck in the center may leave a slight crumb. Allow to cool on a wire rack.\n",
        "picture_link": "iHH.EbSqc.7XL8zaCtLzA2APY7UP0SW"
    },
    {
        "title": "Sweet Coated Pecans",
        "ingredients": [
            "1 egg white ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 cup sugar ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1 pound pecan halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 250 degrees F (120 degrees C). Lightly butter a baking sheet.\nIn a bowl, beat the egg white until foamy. Mix in cinnamon, sugar, salt, and water. Mix well. Stir in pecan halves, stirring until well coated. Spread on baking sheet.\nBake in preheated oven for 1 hour, stirring every 15 minutes.\n",
        "picture_link": ".RVQk2liXjQ3402lvBzsPmv2BvF4S8a"
    },
    {
        "title": "Doughnut Muffins",
        "ingredients": [
            "1/3 cup shortening ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease muffin cups or line with paper muffin liners.\nIn a large bowl, cream together shortening and 1 cup sugar; beat in egg. Stir together flour, baking powder, salt and 1/4 teaspoon cinnamon. Stir flour into egg mixture alternately with milk. Spoon batter into prepared muffin cups.\nBake in preheated oven for 20 minutes, or until a toothpick inserted into center of a muffin comes out clean. While muffins bake, combine 1/2 cup sugar and 1 teaspoon cinnamon. Remove muffins from pan and let cool for 5 minutes. While muffins are still warm, roll tops of muffins in cinnamon sugar mixture.\n",
        "picture_link": "7gBmIF7tWgmu1CTw4Y6sYibLgQYIj22"
    },
    {
        "title": "Nana's Acorn Squash",
        "ingredients": [
            "1 acorn squash, halved and seeded ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "4 tablespoons butter, divided ADVERTISEMENT",
            "4 tablespoons brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a microwave safe casserole dish pour enough water to reach 1 1/2 inches in depth. Place the squash halves cut side down in the water, and pierce the skin with a fork a few times. Microwave on high for 15 to 20 minutes. Drain.\nSprinkle each half with salt and pepper to taste. Place 2 tablespoons butter and 2 tablespoons brown sugar in each half.\nBroil 5 minutes, or until butter is melted. Mix the melted butter and sugar into the flesh, and serve.\n",
        "picture_link": "MjIsGHShnTciMPPJY1L.DPGA/Z/0voe"
    },
    {
        "title": "Grilled Onions",
        "ingredients": [
            "4 large onions ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "4 cubes chicken bouillon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill for medium heat.\nPeel outer layer off onions. Slice a small section off of one end of each onion, and make a small hole in the center. Fill the center of each onion with a bouillon cube and 2 tablespoons butter or margarine. Replace the top of the onion, and wrap in aluminum foil.\nPlace onions on grill over indirect heat, and close the lid. Cook for 1 hour, or until tender. Remove the tops, and cut into bite size chunks. Place in a serving dish with all the juices from the foil.\n",
        "picture_link": "8hy5A3XCRBH3Gh9CumFlCc3Hh7VWdey"
    },
    {
        "title": "No Roll Pie Crust II",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup canola oil ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a 9 inch pie plate, sift flour, sugar and salt. make a well in the center and pour in oil and milk. Mix with a fork, then press into the bottom and sides of pie plate.\nTo bake: Preheat oven to 450 degrees F (230 degrees C.) Bake for 8 to 10 minutes, or until golden brown.\n",
        "picture_link": "NKHKVSJPqB/.Y5ddGkOC5kKbLPivI2u"
    },
    {
        "title": "Almond Maple Granola",
        "ingredients": [
            "3 cups rolled oats ADVERTISEMENT",
            "1 cup blanched slivered almonds ADVERTISEMENT",
            "1/4 cup wheat germ ADVERTISEMENT",
            "1 (14 ounce) package flaked coconut ADVERTISEMENT",
            "1/3 cup unsalted sunflower seeds (optional) ADVERTISEMENT",
            "6 tablespoons pure maple syrup ADVERTISEMENT",
            "6 tablespoons packed dark brown sugar ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "2 tablespoons warm water ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 250 degrees F (120 degrees C). Lightly grease a cookie sheet with sides, or a large cake pan with cooking spray.\nIn a large bowl, toss together the oats, almonds, wheat germ, coconut, and sunflower seeds. In a separate bowl, whisk together the maple syrup, brown sugar, oil, water and salt. Pour the liquid over the oat and nut mixture, and stir until evenly coated. Spread out on the prepared cookie sheet. If you want some chunky bits, squeeze some small handfuls into little clumps.\nBake for 1 hour and 15 minutes in the preheated oven, stirring occasionally until evenly toasted. Mix in raisins. Cool, and store in an airtight container at room temperature.\n",
        "picture_link": "PCySnslpO1rf38va4oeOvYWnOIK6nre"
    },
    {
        "title": "Cream Of Carrot Soup",
        "ingredients": [
            "1/4 cup butter, cubed ADVERTISEMENT",
            "2 1/2 cups sliced carrots ADVERTISEMENT",
            "1 large potato, peeled and cubed ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "1 stalk celery, chopped ADVERTISEMENT",
            "3 cups chicken broth ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1/2 cup heavy whipping cream ADVERTISEMENT",
            "1 teaspoon curry powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat butter in a Dutch oven over medium heat; add carrots, potato, onion, celery, chicken broth, and ginger. Cover and cook, stirring occasionally, until vegetables are tender, about 30 minutes. Uncover and cool for 15 minutes.\nTransfer soup in batches to a food processor; blend until smooth. Return soup to the Dutch oven; stir in cream. Add curry powder, salt, and black pepper; cook over low heat until heated through, about 10 minutes.\n",
        "picture_link": "bWe8qOjPJtiZeU5jruP80CkJ7FZasii"
    },
    {
        "title": "Best Strawberry Daiquiri",
        "ingredients": [
            "6 cups ice ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "4 ounces frozen strawberries ADVERTISEMENT",
            "1/8 cup lime juice ADVERTISEMENT",
            "1/2 cup lemon juice ADVERTISEMENT",
            "3/4 cup rum ADVERTISEMENT",
            "1/4 cup lemon-lime flavored carbonated beverage ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender, combine ice, sugar and strawberries. Pour in lime juice, lemon juice, rum and lemon-lime soda. Blend until smooth. Pour into glasses and serve.\n",
        "picture_link": "p24x.WI2T0rPuGgiEDD8bjA.F/4BVDq"
    },
    {
        "title": "Broccoli with Lemon Butter Sauce",
        "ingredients": [
            "1/4 cup butter or margarine ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 (16 ounce) package frozen broccoli florets ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet, combine the butter, water, lemon juice, cayenne pepper, salt and pepper. Bring to a simmer over medium heat. Add the broccoli to the pan, stir to coat, and cover with a lid. Cook for 10 to 15 minutes over medium-low heat, stirring once, until broccoli is tender but still bright green. Serve warm, or refrigerate and serve cold.\n",
        "picture_link": "dU70MZ00CXMTpoQ2uhD8vc2BsRVNMym"
    },
    {
        "title": "Easy Lima Beans",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1/2 medium onion, finely chopped ADVERTISEMENT",
            "1 1/2 cups chicken broth ADVERTISEMENT",
            "1 (16 ounce) package frozen baby lima beans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large saucepan over medium heat, and spray with cooking spray. Saute onions until soft and translucent. Pour in chicken broth, and bring to a boil. Add lima beans, and enough water just to cover. Bring to a boil, then reduce heat to low, cover, and simmer for 30 minutes, until beans are tender.\n",
        "picture_link": "kmInHANrOw5Dgq63bQd6apRIYXokAN2"
    },
    {
        "title": "Homemade Dog Food",
        "ingredients": [
            "6 cups water ADVERTISEMENT",
            "1 pound ground turkey ADVERTISEMENT",
            "2 cups brown rice ADVERTISEMENT",
            "1 teaspoon dried rosemary ADVERTISEMENT",
            "1/2 (16 ounce) package frozen broccoli, carrots and cauliflower combination ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the water, ground turkey, rice, and rosemary into a large Dutch oven. Stir until the ground turkey is broken up and evenly distributed throughout the mixture; bring to a boil over high heat, then reduce heat to low and simmer for 20 minutes. Add the frozen vegetables, and cook for an additional 5 minutes. Remove from heat and cool. Refrigerate until using.\n",
        "picture_link": "RzDQwpcT7NcU.bOGb2YZjnnqr7zAHWe"
    },
    {
        "title": "Steakhouse Black Bread",
        "ingredients": [
            "1 1/3 cups strong brewed coffee, room temperature ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1/4 cup dark molasses ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1 cup whole wheat flour ADVERTISEMENT",
            "1 cup rye flour ADVERTISEMENT",
            "2 cups bread flour ADVERTISEMENT",
            "2 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "2 1/2 teaspoons active dry yeast or bread machine yeast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place all ingredients in bread machine pan in order suggested by manufacturer. Select Dough cycle. When the machine indicates the end of the final rise, remove the dough.\nPreheat the oven to 375 degrees F (190 degrees C). Shape the dough into 12 dinner rolls, or one 9x5 inch loaf. Let rise until doubled in size while the oven preheats, they should rise quickly.\nBake for 20 minutes in the preheated oven for rolls, or 35 minutes for a loaf, or until the loaf sounds hollow when tapped on the bottom.\n",
        "picture_link": "fFfcn2yJDgVyYHE0VJAU8Ips11dAN3W"
    },
    {
        "title": "Bierocks (German Meat Turnovers)",
        "ingredients": [
            "2 (1 pound) loaves frozen bread dough, thawed ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 clove garlic, crushed ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 1/2 teaspoons lemon pepper ADVERTISEMENT",
            "1 small head cabbage, chopped ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "2 teaspoons caraway seeds ADVERTISEMENT",
            "1/2 cup melted butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Saute beef, onion and garlic, salt and lemon pepper in a large skillet over medium high heat, until beef is browned. Add cabbage, Worcestershire sauce and caraway seeds. Cook until cabbage is limp; drain liquid from mixture.\nPreheat oven to 350 degrees F (175 degrees C).\nOn a lightly floured board, roll each loaf of dough into a 12 inch circle. Cut each circle into 6 wedges. Spoon cabbage/beef filling onto center of each dough piece, dividing equally. Pull three points of each wedge up to the center and pinch to seal. Place bierocks on a lightly greased cookie sheet. If desired, brush dough with melted butter or egg wash (1 egg white with 2 tablespoons water).\nBake in preheated oven for 30 minutes, or until golden brown. Serve hot, or wrap and freeze for heating later.\n",
        "picture_link": "ZH2VHufvMMMcg4nEvTlp3FuANzg2.fm"
    },
    {
        "title": "Cherry Fluff",
        "ingredients": [
            "1 (21 ounce) can cherry pie filling ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 (20 ounce) can crushed pineapple, drained ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix the cherry pie filling, sweetened condensed milk, crushed pineapple and whipped topping. Chill in the refrigerator at least 2 hours before serving.\n",
        "picture_link": "DI/Z4z8zcK.6XBZXP0H2Zrwa7vcfBrO"
    },
    {
        "title": "Grilled Mediterranean Vegetable Sandwich",
        "ingredients": [
            "1 eggplant, sliced into strips ADVERTISEMENT",
            "2 red bell peppers ADVERTISEMENT",
            "2 tablespoons olive oil, divided ADVERTISEMENT",
            "2 portobello mushrooms, sliced ADVERTISEMENT",
            "3 cloves garlic, crushed ADVERTISEMENT",
            "4 tablespoons mayonnaise ADVERTISEMENT",
            "1 (1 pound) loaf focaccia bread ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nBrush eggplant and red bell peppers with 1 tablespoon olive oil; use more if necessary, depending on sizes of vegetables. Place on a baking sheet and roast in preheated oven. Roast eggplant until tender, about 25 minutes; roast peppers until blackened. Remove from oven and set aside to cool.\nMeanwhile, heat 1 tablespoon olive oil and cook and stir mushrooms until tender. Stir crushed garlic into mayonnaise. Slice focaccia in half lengthwise. Spread mayonnaise mixture on one or both halves.\nPeel cooled peppers, core and slice. Arrange eggplant, peppers and mushrooms on focaccia. Wrap sandwich in plastic wrap; place a cutting board on top of it and weight it down with some canned foods. Allow sandwich to sit for 2 hours before slicing and serving.\n",
        "picture_link": "Q8C5PRbKGik4bPXlVTmeSvVyUQ/vaFO"
    },
    {
        "title": "Honey Soy Tilapia",
        "ingredients": [
            "3 tablespoons honey ADVERTISEMENT",
            "3 tablespoons soy sauce ADVERTISEMENT",
            "3 tablespoons balsamic vinegar ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "2 (3 ounce) fillets tilapia ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "1 teaspoon freshly cracked black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the honey, soy sauce, balsamic vinegar, and garlic together in a bowl. Place the tilapia fillets in the mixture; allow to marinate in refrigerator at least 30 minutes.\nPreheat an oven to 350 degrees F (175 degrees C). Spray a baking dish with cooking spray.\nRemove tilapia from marinade, and discard the marinade. Place fillets into the prepared baking sheet, and sprinkle the black pepper over the fish.\nBake in the preheated oven until the fish flakes easily with a fork, 15 to 20 minutes.\n",
        "picture_link": "VaYWgB6/DEW50Y4E9IJafBlMbZdaqe."
    },
    {
        "title": "Peanut Butter Sheet Cake",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "3/4 cup butter or margarine, softened ADVERTISEMENT",
            "1/2 cup peanut butter ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup buttermilk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "1/3 cup evaporated milk ADVERTISEMENT",
            "1 tablespoon butter or margarine ADVERTISEMENT",
            "1/3 cup chunky peanut butter ADVERTISEMENT",
            "1/3 cup miniature marshmallows ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Grease a 10x15x1 inch jellyroll pan.\nIn a large bowl, stir together the flour, 2 cups sugar, baking soda and salt. Set aside. Combine the water and 3/4 cup of butter in a saucepan, and bring to a boil. Remove from the heat and stir in 1/2 cup peanut butter and vegetable oil until well blended. Stir this mixture into the dry ingredients. Combine the eggs, buttermilk and vanilla; stir into the peanut butter mixture until well blended. Spread the batter evenly in the prepared pan.\nBake for 18 to 26 minutes in the preheated oven, or until a toothpick inserted near the center comes out clean.\nWhile the cake bakes, place 2/3 cup sugar, evaporated milk, and butter in a saucepan. Bring to a boil, stirring constantly. Cook stirring for 2 minutes. Remove from heat and stir in the peanut butter, marshmallows and vanilla until marshmallows are melted and the mixture is smooth.\nSpoon the frosting over the warm cake and spread in an even layer. Allow to cool before cutting and serving.\n",
        "picture_link": "OTIlmExhp6gRhkxGaXzGaQIjrOYSYBa"
    }
]