[
    {
        "title": "Ann's Berry Green Smoothie",
        "ingredients": [
            "2 cups frozen strawberries ADVERTISEMENT",
            "1 1/2 cups warm water ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 1/2 cups fresh spinach, or to taste ADVERTISEMENT",
            "1 cup frozen blueberries ADVERTISEMENT",
            "1 frozen chopped banana ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place strawberries in a bowl; add warm water.\nBlend milk and spinach together in a blender until smooth. Add blueberries, banana, and honey and blend until smooth. Add strawberries-water mixture and lemon juice and blend until smooth.\n",
        "picture_link": "maSXxZG6ocnu2tpof9HMfVO5xuOj2qm"
    },
    {
        "title": "Cauliflower Dream",
        "ingredients": [
            "1 large head cauliflower, broken into florets ADVERTISEMENT",
            "2 cups white mushrooms, diced ADVERTISEMENT",
            "1 tablespoon olive oil, or more as needed ADVERTISEMENT",
            "2 tablespoons nutritional yeast ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon dried minced onion ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cauliflower in a food processor and pulse until chopped into rice-shaped pieces.\nCombine cauliflower, mushrooms, and olive oil in a skillet over high heat; cook and stir until mushrooms are soft, 5 to 10 minutes. Mix nutritional yeast, black pepper, garlic powder, and minced onion into cauliflower mixture; cook and stir over low heat until heated through, 5 to 10 minutes.\n",
        "picture_link": "L207.Q1P1UR.8npQOlx3Rpnyw0/NgXm"
    },
    {
        "title": "Spider Web S'mores",
        "ingredients": [
            "10 tablespoons marshmallow fluff ADVERTISEMENT",
            "10 graham cracker squares ADVERTISEMENT",
            "2 (1 ounce) squares unsweetened baking chocolate, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread about 1 tablespoon marshmallow fluff evenly onto 1 side of each graham cracker square.\nMelt chocolate in top of a double boiler over simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching. Cool chocolate for 1 to 2 minutes. Spoon chocolate into a piping bag or a plastic bag with a corner snipped.\nPipe chocolate in the shape of a spider web onto the marshmallow fluff of each graham cracker. Put a dot with some legs in the corner to represent a spider.\n",
        "picture_link": "XbMm4rXMvC7cWtjs6umxtFR2dqZu42K"
    },
    {
        "title": "Maple Almond Butter Salad Dressing",
        "ingredients": [
            "3 tablespoons maple almond butter ADVERTISEMENT",
            "2 tablespoons maple syrup ADVERTISEMENT",
            "1 tablespoon seasoned rice wine vinegar ADVERTISEMENT",
            "2 teaspoons toasted sesame oil ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine maple almond butter, maple syrup, seasoned rice vinegar, sesame oil, and salt in a jar or container with a tight-fitting lid. Cover jar and shake until smooth.\n",
        "picture_link": "1ONVWJNa//P/FzEuKXGtQ3xrTuceGtO"
    },
    {
        "title": "Savory Stuffed Eggplant",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 (6 ounce) package herb-seasoning stuffing mix (such as Kraft® Stove Top®) ADVERTISEMENT",
            "1 large eggplant, halved lengthwise ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "2 tablespoons mayonnaise ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "paprika to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray a baking dish with cooking spray.\nBring water and butter to a boil in a saucepan; add stuffing mix and cover saucepan. Remove saucepan from heat and let stand for 5 minutes; fluff stuffing with a fork.\nScoop the flesh from eggplant and dice, reserving shells. Mix eggplant pulp, stuffing, Parmesan cheese, mayonnaise, and egg together in a bowl. Fill each eggplant shell with stuffing mixture and top with paprika.\nBake in the preheated oven until filling is cooked through and crisp on the top, 30 to 35 minutes.\n",
        "picture_link": "bpVFQ6HAipNoBAXZ9/5tG4JxKOGGPh2"
    },
    {
        "title": "Italian Portuguese Meat Loaf Fusion",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "2 links chorizo sausage, casings removed ADVERTISEMENT",
            "1 cup plain bread crumbs ADVERTISEMENT",
            "1/2 cup prepared pasta sauce ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "2 teaspoons jarred minced garlic ADVERTISEMENT",
            "1 teaspoon Italian seasoning ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 tablespoon prepared pasta sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix ground beef, chorizo sausage, bread crumbs, 1/2 cup pasta sauce, egg, garlic, Italian seasoning, salt, and pepper together in a bowl until well combined. Shape meat mixture into a loaf pan. Spread 1 tablespoon prepared pasta sauce over top of loaf.\nBake in preheated oven until no longer pink in the center, about 1 hour. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C).\n",
        "picture_link": "WEoVhrkbhz.mt9qkEkQntO/N47aOhXC"
    },
    {
        "title": "Grilled Tilapia with Tomato-Olive Tapenade",
        "ingredients": [
            "4 (6 ounce) tilapia fillets ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 cup chopped tomatoes ADVERTISEMENT",
            "5 pitted Kalamata olives, chopped ADVERTISEMENT",
            "1 tablespoon chopped onion ADVERTISEMENT",
            "1 tablespoon capers ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nPlace tilapia fillets on a baking sheet and brush with olive oil.\nBake tilapia in the preheated oven until opaque and easily flaked with a fork, 10 to 15 minutes.\nCombine chopped tomatoes, olives, onion, and capers in a small saucepan. Cook over medium-high heat, stirring occasionally, until tomatoes begin to break down and tapenade flavors are combined, 5 to 10 minutes. Spoon tapenade over baked fillets.\n",
        "picture_link": "MoBoQvTbDR5jolXkHKvH3FQ9hCR.W6W"
    },
    {
        "title": "Grilled Tilapia with Orange Salsa ",
        "ingredients": [
            "1 orange, peeled and cut into small chunks ADVERTISEMENT",
            "2 green onions, diced ADVERTISEMENT",
            "1/2 jalapeno pepper, seeded and diced ADVERTISEMENT",
            "4 (6 ounce) tilapia fillets ADVERTISEMENT",
            "1/2 lemon, juiced, or more to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 teaspoon butter ADVERTISEMENT",
            "1 teaspoon oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine orange chunks, green onions, and jalapeno pepper together in a small bowl. Let sit until flavors combine, about 10 minutes.\nSeason tilapia fillets with lemon juice, salt, and black pepper.\nHeat butter and oil in a large grill pan over medium-high heat. Cook fish until opaque on one side, about 3 minutes. Flip fish and cook until lightly browned and fish flakes easily with a fork, about 3 minutes more. Top fish with orange salsa and a sprinkle of lemon juice.\n",
        "picture_link": "YkhLsBsDaBe/9EQoBhY9W0IZ2OOaviC"
    },
    {
        "title": "Easy Foil Packet Baked Fish Piccata",
        "ingredients": [
            "4 sheets aluminum foil ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "4 (4 ounce) fillets swai fish ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 lemon, thinly sliced and seeds removed ADVERTISEMENT",
            "6 mushrooms, thinly sliced ADVERTISEMENT",
            "1/2 onion, thinly sliced ADVERTISEMENT",
            "2 tablespoons capers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Arrange aluminum foil on a work surface and lightly spray cooking spray onto 1 side of each.\nPlace 1 swai fish fillet onto the middle of each piece of foil; season with salt and pepper. Layer lemon slices, mushroom slices, onion slices, and capers onto each swai fillet. Fold foil over each swai fillet creating a packet. Place packets on a baking sheet.\nBake in the preheated oven until fish flakes easily with a fork, about 15 minutes.\n",
        "picture_link": "RrIwPAC5m2sfhFFfKoyDzNb4SZMZjwa"
    },
    {
        "title": "Super Spinach Salad",
        "ingredients": [
            "2 cups packed fresh spinach ADVERTISEMENT",
            "1/2 cup cooked quinoa ADVERTISEMENT",
            "1/4 cup shredded carrots ADVERTISEMENT",
            "1/4 cup dried cranberries ADVERTISEMENT",
            "1/4 cup canned chickpeas (garbanzo beans) ADVERTISEMENT",
            "1/4 cup edamame (green soybeans) ADVERTISEMENT",
            "2 tablespoons pumpkin seeds ADVERTISEMENT",
            "1/4 cup ginger-miso dressing, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine spinach, quinoa, carrots, cranberries, chickpeas, edamame, and pumpkin seeds in a bowl; add dressing and toss to coat.\n",
        "picture_link": "HHZQb1Ef/gc4p/cpfAqeR83miyvEWHy"
    },
    {
        "title": "Agave Nectar Chocolate Syrup ",
        "ingredients": [
            "1 cup unsweetened cocoa powder (not Dutch-process) ADVERTISEMENT",
            "3/8 teaspoon unprocessed stevia powder ADVERTISEMENT",
            "1/2 cup cold water ADVERTISEMENT",
            "1 cup raw agave nectar ADVERTISEMENT",
            "1/2 teaspoon pure vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cocoa powder and stevia in a large glass measuring cup or bowl. Slowly add water, stirring constantly, until mixture is thick and creamy with a fudge-like consistency. Add agave nectar and vanilla extract; mix well. Pour the chocolate syrup into a squeeze bottle.\n",
        "picture_link": "yP807UkC1CaTV0r1RbcUHHAyHXhXUkK"
    },
    {
        "title": "Hot Dog Sausages",
        "ingredients": [
            "1 1/4 pounds lean ground beef ADVERTISEMENT",
            "1/4 pound ground pork ADVERTISEMENT",
            "4 teaspoons kosher salt ADVERTISEMENT",
            "1 tablespoon paprika ADVERTISEMENT",
            "2 teaspoons ground black pepper ADVERTISEMENT",
            "1 teaspoon granulated onion powder ADVERTISEMENT",
            "1 teaspoon granulated garlic ADVERTISEMENT",
            "1/2 teaspoon smoked paprika ADVERTISEMENT",
            "1/3 cup ice water ADVERTISEMENT",
            "4 hot dog buns, split and toasted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ground beef, ground pork, salt, paprika, black pepper, granulated onion, granulated garlic, smoked paprika, and ice water in a bowl. Mix together with fingers until well blended and mixture is dense and solid, about 4 minutes. It's okay to overmix. Wrap dough in plastic; refrigerate at least 2 hours or overnight.\nPlace a sheet of plastic wrap on a work surface. Have a bowl of ice water nearby to keep your hands wet and cold. Place 1/4 of the mixture on the plastic wrap. Roughly shape meat into a thick roll and wrap with the plastic. Shape into a thinner roll about as long as a hot dog bun. You can unroll the plastic and \"fine tune\" the sausage shape after wetting your hands in ice water. Rewrap in plastic and place on a dish; repeat for the remaining sausages. Refrigerate until ready to cook.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate.\nCarefully place sausages on grill and let them cook undisturbed for about 2 minutes to seal the bottom edge. Gently turn completely over to brown the opposite side; cook until brown, about 2 minutes. Brown all surfaces, turning carefully to avoid breaking the sausages, about 5 minutes more. Remove sausages from grill and serve on toasted hot dog buns.\n",
        "picture_link": "yYjDJ7n2n2CFA35uit6EqL7cIhDwxni"
    },
    {
        "title": "Tequila Meatballs",
        "ingredients": [
            "Meatballs: ADVERTISEMENT",
            "1 pound lean ground turkey ADVERTISEMENT",
            "1/2 cup Parmesan cheese ADVERTISEMENT",
            "1/2 cup cornmeal (such as PAN®) ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 jalapeno pepper, finely chopped ADVERTISEMENT",
            "Sauce: ADVERTISEMENT",
            "2 (12 fluid ounce) cans or bottles Mexican beers ADVERTISEMENT",
            "1 (12 ounce) bottle chili sauce ADVERTISEMENT",
            "1/2 cup pickle relish ADVERTISEMENT",
            "1/4 cup tequila ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine turkey, Parmesan cheese, cornmeal, Worcestershire sauce, egg, and jalapeno pepper together in a bowl; form into meatballs.\nMix beer, chili sauce, pickle relish, and tequila in a separate bowl until sauce is evenly combined. Transfer sauce to a saucepan and add meatballs.\nSimmer meatballs in the sauce over medium-low heat until meatballs are cooked through, about 30 minutes.\n",
        "picture_link": "ireheTYx9zsr.Yf0R5RxCyEe3i5PF2e"
    },
    {
        "title": "Eggplant Stuffed with Chicken and Cheese",
        "ingredients": [
            "2 eggplants, halved lengthwise ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "3 tablespoons olive oil, or more if needed ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "6 cooked chicken breasts, shredded ADVERTISEMENT",
            "1/2 (10 ounce) basket grape tomatoes, halved ADVERTISEMENT",
            "1/2 (8 ounce) package shredded Cheddar-Monterey Jack cheese blend ADVERTISEMENT",
            "1/4 cup chopped scallions ADVERTISEMENT",
            "3 tablespoons finely chopped fresh basil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with parchment paper or aluminum foil.\nPlace eggplant, cut-side up, on the prepared baking sheet. Sprinkle garlic over each and coat with olive oil; season with salt and pepper.\nBake in the preheated oven until eggplant is mostly tender, 25 to 30 minutes. Add chicken, tomatoes, and Cheddar-Monterey Jack cheese to each eggplant. Continue cooking in the oven until cheese is melted, about 10 minutes. Top each with scallions and basil.\n",
        "picture_link": "ouWRLY9301Y5S8dJGD3CA.gtxoGnwsm"
    },
    {
        "title": "Cajun Sausage and Rice from Knorr®",
        "ingredients": [
            "1/2 pound Italian sausage, removed from casings and crumbled ADVERTISEMENT",
            "1 tablespoon I Can't Believe It's Not Butter!® Spread ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "2 1/4 cups water ADVERTISEMENT",
            "1 (5.6 ounce) package Knorr® Cajun Sides™ - Red Beans & Rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook sausage in large nonstick skillet over medium-high heat, stirring occasionally, until cooked through. Remove and set aside.\nAdd Spread and green pepper and cook, stirring occasionally, 3 minutes or until tender.\nStir in water and Knorr(R) Cajun Sides(TM) - Red Beans & Rice and bring to a boil. Continue boiling over medium heat, stirring occasionally, 10 minutes or until rice and beans are tender. Stir in sausage; heat through.\n",
        "picture_link": "rylasxEkdPBymo2gd/5/WeG7bfhKDwq"
    },
    {
        "title": "My Cinco de Mayo Chili",
        "ingredients": [
            "2 pounds ground beef ADVERTISEMENT",
            "2 pounds ground pork ADVERTISEMENT",
            "2 large sweet onions, diced ADVERTISEMENT",
            "3 large green onions, chopped ADVERTISEMENT",
            "4 large garlic cloves, minced ADVERTISEMENT",
            "2 (14.5 ounce) cans fire-roasted diced tomatoes ADVERTISEMENT",
            "1 (12 fluid ounce) can or bottle beer ADVERTISEMENT",
            "1/2 cup chili powder ADVERTISEMENT",
            "1/4 cup ground cumin ADVERTISEMENT",
            "2 ounces fire-roasted diced green chile peppers ADVERTISEMENT",
            "2 tablespoons corn meal ADVERTISEMENT",
            "1 large dried ancho chile pepper ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger tequila ADVERTISEMENT",
            "6 slices pickled jalapeno pepper, chopped ADVERTISEMENT",
            "1 teaspoon unsweetened cocoa powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 cup frozen fire-roasted corn ADVERTISEMENT",
            "1 (15 ounce) can black beans, rinsed and drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large stock pot over medium heat. Cook and stir beef and pork in the pot until completely browned, about 10 minutes. Drain as much grease from the meat mixture as you can and return pot to heat.\nStir sweet onions, green onions, and garlic through the meat mixture; cook and stir until the onions are translucent, 5 to 7 minutes.\nStir tomatoes, beer, chili powder, cumin, chile peppers, corn meal, ancho chile pepper, tequila, jalapeno pepper, cocoa powder, and salt into the meat mixture. Bring the mixture to a simmer and cook until the tomatoes are dissolving into the liquid, 1 to 2 hours. Stir corn and black beans into the chili; continue cooking until hot, 10 to 15 minutes.\n",
        "picture_link": "YAvV0hlhOdyb7zP7UWohMS1Px5bjv7W"
    },
    {
        "title": "Lunchbox Cookies ",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 cup whole wheat pastry flour ADVERTISEMENT",
            "1 cup quick-cooking oats ADVERTISEMENT",
            "1/2 cup 5-grain hot cereal mix ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line baking sheets with parchment paper.\nWhisk all-purpose flour, whole wheat pastry flour, oats, 5-grain cereal, baking powder, baking soda, and salt together in a bowl. Mix butter with white and brown sugar in a separate large bowl until mixture is smooth and creamy. Beat eggs into creamed mixture with an electric mixer until thoroughly combined. Gradually beat dry ingredients into moist ingredients to make a dough. Stir chocolate chips into dough. Drop batter by heaping teaspoonfuls onto prepared baking sheets, keeping cookies about 2 inches apart.\nBake in the preheated oven until cookies are lightly browned, about 10 minutes.\n",
        "picture_link": "UVd2MTuZq0QVWn/p5Yteti2TmmjWOb2"
    },
    {
        "title": "Habanero Cream Sauce",
        "ingredients": [
            "2 habanero peppers ADVERTISEMENT",
            "2/3 cup milk, divided (or as needed) ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 pinch ground paprika ADVERTISEMENT",
            "1 tablespoon chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nRoast peppers in preheated oven until nearly browned, 5 to 10 minutes.\nRemove and discard seeds and stems from peppers. Transfer peppers to a food processor. Blend peppers and 2 tablespoons milk in the food processor until smooth.\nMelt butter in a skillet over medium heat until bubbly. Stir flour into the melted butter; cook until the mixture starts to brown, 2 to 3 minutes. Add the pepper mixture to the flour mixture. Begin whisking milk into the mixture; cook, whisking regularly, until it begins to thicken, thinning with additional milk as needed. Season with salt and paprika. Sprinkle cilantro over the sauce to serve.\n",
        "picture_link": "hP984epBx5r61n8vQ05tTrXvPiGWPDK"
    },
    {
        "title": "Habanero, Rosemary, and Cheddar Bread",
        "ingredients": [
            "1 tablespoon active dry yeast ADVERTISEMENT",
            "1 tablespoon quick-rise yeast ADVERTISEMENT",
            "3 tablespoons water ADVERTISEMENT",
            "5 cups all-purpose flour, divided ADVERTISEMENT",
            "2 cups water, divided ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "1 habanero pepper, finely chopped (wear gloves) ADVERTISEMENT",
            "1/2 teaspoon finely chopped fresh rosemary ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix active and quick-rise yeast with 3 tablespoons water in a bowl to make a paste. Mix 4 cups of flour with 1 cup water in a large bowl until thoroughly combined; stir yeast mixture into flour mixture.\nBeat remaining 1 cup water, baking powder, salt, sharp Cheddar cheese, habanero pepper, and rosemary into dough; beat remaining 1 cup flour into dough. Turn out onto a floured work surface and knead until dough is soft and elastic, at least 6 minutes. Form dough into a ball, place into an oiled bowl, and turn the dough around in the bowl to pick up a thin coating of oil. Cover bowl and let rise for 2 hours.\nPunch the dough down, turn out onto a floured work surface, and knead for 6 more minutes. Divide dough in half and form each half into a loaf; place loaves on a baking sheet. Cover loaves and let rise until doubled, 15 to 20 minutes.\nPreheat oven to 400 degrees F (205 degrees C).\nBake loaves in the preheated oven for 15 minutes. Reduce oven heat to 350 degrees F (175 degrees C) and bake until golden brown, 20 to 25 minutes.\n",
        "picture_link": "h8en0B15dbu4PWcXSStTOrOPtZOO4my"
    },
    {
        "title": "Cajun Chicken and Sausage Pasta",
        "ingredients": [
            "1 skinless, boneless chicken breast half ADVERTISEMENT",
            "1/2 teaspoon Cajun seasoning, or to taste ADVERTISEMENT",
            "1 link pork sausage with jalapeno pepper ADVERTISEMENT",
            "4 ounces farfalle (bow tie) pasta ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1/2 red bell pepper, chopped ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "1 clove garlic, chopped ADVERTISEMENT",
            "1 1/2 cups fat-free half-and-half, divided ADVERTISEMENT",
            "1 tablespoon cornstarch, or as needed ADVERTISEMENT",
            "1 pinch Cajun seasoning, or to taste ADVERTISEMENT",
            "1 pinch dried basil, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium-high heat and lightly oil the grate.\nSprinkle both sides of chicken breast with 1/2 teaspoon Cajun seasoning, or to taste.\nGrill chicken breast and pork sausage on the preheated grill until browned and no longer pink inside, about 5 minutes per side. Transfer to a plate and let rest for 5 minutes. Cut chicken and sausage into bite-size pieces.\nBring a large pot of lightly salted water to a boil. Cook the farfalle pasta at a boil, stirring occasionally, until cooked through yet firm to the bite, about 12 minutes; drain.\nMelt butter in a large skillet over medium heat. Cook and stir green bell pepper, red bell pepper, onion, and garlic in hot butter until slightly softened, 2 to 3 minutes. Stir chicken and sausage pieces into vegetables, reduce heat to medium-low, and pour 1 cup half-and-half into skillet. Stir to combine.\nMix cornstarch into remaining 1/2 cup half-and-half in a small bowl until smooth; pour into skillet and stir until sauce simmers and thickens, about 5 minutes. Toss cooked farfalle pasta into mixture until coated; season with additional Cajun seasoning and dried basil.\n",
        "picture_link": "wDc05H18tKlaplM/ZYFBBOxs8dCYPmi"
    },
    {
        "title": "Taco Salad Dip",
        "ingredients": [
            "1 (15 ounce) can ranch-style beans, drained ADVERTISEMENT",
            "1 (14 ounce) can refried beans ADVERTISEMENT",
            "1/2 (1 ounce) package taco seasoning mix ADVERTISEMENT",
            "1 (8 ounce) container sour cream ADVERTISEMENT",
            "1 (1 ounce) package dry onion soup mix ADVERTISEMENT",
            "1 (8 ounce) jar salsa ADVERTISEMENT",
            "1/4 head iceberg lettuce, torn into bite-sized pieces ADVERTISEMENT",
            "1/2 cup crushed tortilla chips ADVERTISEMENT",
            "1/4 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix ranch-style beans and refried beans together in the bottom of a shallow casserole dish; season with taco seasoning mix and stir. Spread the bean mixture into an even layer.\nMix sour cream and onion soup mix together in a small bowl; spread over the bean mixture. Top the sour cream layer with salsa.\nRefrigerate dish until the bean layer firms, about 30 minutes.\nLayer lettuce atop the salsa. Sprinkle tortilla chips in a layer over the lettuce. Finish with a layer of Cheddar cheese.\n",
        "picture_link": "dSOT9IXIKbJeUlXKLBslE4YHdkZWp/G"
    },
    {
        "title": "Butterfinger Banana Cake",
        "ingredients": [
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "2 medium ripe bananas, mashed ADVERTISEMENT",
            "36 pieces NESTLE® BUTTERFINGER® Bites Candy, chopped, divided ADVERTISEMENT",
            "1 (16 ounce) container prepared white frosting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F. Grease and flour 13 x 9-inch baking pan.\nPrepare cake mix batter according to package directions; stir in bananas and 3/4 cup chopped Butterfinger. Pour into prepared pan.\nBake for 40 to 50 minutes or until wooden pick inserted in center comes out clean. Cool completely in pan on wire rack.\nFrost cake; sprinkle with remaining chopped Butterfinger.\n",
        "picture_link": "45JSiS99RtSab8gQCoVRn8ehdz.q8QO"
    },
    {
        "title": "Heavenly Honeydew Juice",
        "ingredients": [
            "1 (5 pound) honeydew melon, quartered and seeded ADVERTISEMENT",
            "2 cups ice cubes ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Scrape flesh from honeydew melon quarters into a blender; add ice cubes, water, and sugar. Blend until smooth and sugar has dissolved. Serve immediately.\n",
        "picture_link": "3mfDyO034RVYEM.G.Pwox.gwoniQz.S"
    },
    {
        "title": "Eggnog Whipped Cream",
        "ingredients": [
            "1 cup heavy whipping cream ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1 tablespoon rum ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Chill metal beaters for an electric mixer and a large metal bowl in the freezer for at least 5 minutes. Pour cream into chilled bowl and whip with electric mixer on high speed until cream is soft and fluffy, about 2 minutes. Slowly beat in sugar, whipping cream until it holds stiff peaks. Gradually beat in vanilla, rum, nutmeg; whipping cream to stiff peaks each time before adding next ingredient. Serve immediately.\n",
        "picture_link": "9tQy./c6fzRcmIFBCudQlTww03ExbGu"
    },
    {
        "title": "Moroccan Sweet Potato and Raisin Salad",
        "ingredients": [
            "1/3 cup raisins ADVERTISEMENT",
            "1 pound sweet potatoes, peeled and cut into 1/2-inch cubes ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1/8 teaspoon ground turmeric ADVERTISEMENT",
            "3 saffron threads, crumbled, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place raisins into a bowl, cover with boiling water, and let stand to plump.\nPlace sweet potatoes into a saucepan, cover with 2 cups water, and bring to a boil. Add honey, butter, salt, cinnamon, black pepper, turmeric, and saffron to potatoes; reduce heat to low. Simmer until potatoes are tender but not mushy, 8 to 10 minutes. Drain raisins and stir into sweet potato mixture.\nContinue to simmer until mixture has thickened, about 10 more minutes. Let cool before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Salty Pancakes",
        "ingredients": [
            "2/3 cup water ADVERTISEMENT",
            "2/3 cup milk ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1/3 teaspoon salt ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk water, milk, eggs, vegetable oil, and salt together in a bowl. Slowly whisk flour into wet ingredients until incorporated. Let batter rest for 1 hour; stir again.\nHeat a lightly oiled griddle over medium-high heat. Drop batter by large spoonfuls onto the griddle and cook until bubbles form and the edges are dry, 2 to 4 minutes. Flip and cook until browned on the other side, 2 to 4 more minutes. Repeat with remaining batter.\n",
        "picture_link": "q5sdShN9k3quVJfIXlPGEvpdRt05maC"
    },
    {
        "title": "Simple Marinated Broccoli",
        "ingredients": [
            "1/2 cup olive oil ADVERTISEMENT",
            "1/4 cup red wine vinegar ADVERTISEMENT",
            "1 (.7 ounce) package dry Italian salad dressing mix (such as Good Seasons®) ADVERTISEMENT",
            "3 heads broccoli, cut into florets ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine olive oil, red wine vinegar, and Italian dressing mix in a sealable container; shake vigorously.\nPlace broccoli in a plastic storage container, cover with marinade, and refrigerate, stirring occasionally, for at least 3 hours.\n",
        "picture_link": "RI7lXu82fyxLeYNeuSMyKArUUtZryey"
    },
    {
        "title": "Sesame Sake Pork Medallions",
        "ingredients": [
            "1 cup Holland House® Sake Cooking Wine ADVERTISEMENT",
            "2 tablespoons brown sugar, not packed ADVERTISEMENT",
            "1 teaspoon toasted sesame oil ADVERTISEMENT",
            "1 teaspoon cornstarch ADVERTISEMENT",
            "1 1/2 pounds pork tenderloin ADVERTISEMENT",
            "2 tablespoons toasted sesame seeds, or more if desired ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "Minced green onion (garnish) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine sake cooking wine, sugar, sesame oil and cornstarch. Stir to dissolve cornstarch; set aside.\nCut pork into 1/2-inch slices; season with salt and pepper to taste. Press half the sesame seeds onto one side of each medallion. Melt butter in 12-inch saute pan. Cook pork, seed side down, over medium-high heat until lightly browned, about 8 minutes. While cooking, press remaining sesame seeds onto tops of medallions. Turn over and continue to cook 4-6 minutes. Increase heat to high, add sauce and cook 2 minutes or until sauce bubbles and thickens slightly. Serve pork medallions drizzled with sake sauce. Sprinkle with any remaining sesame seeds and green onion.\n",
        "picture_link": "hTm/GYGSUN31HbuPrZ80Hhs00pcECLa"
    },
    {
        "title": "Old South Herbed Cornbread Dressing",
        "ingredients": [
            "Crisco® Original No-Stick Cooking Spray ADVERTISEMENT",
            "Cornbread: ADVERTISEMENT",
            "1 large egg ADVERTISEMENT",
            "1 1/3 cups milk ADVERTISEMENT",
            "1/4 cup Crisco® Pure Vegetable Oil ADVERTISEMENT",
            "2 cups Martha White® Self-Rising Enriched White Corn Meal Mix ADVERTISEMENT",
            "Dressing: ADVERTISEMENT",
            "3/4 cup butter ADVERTISEMENT",
            "1 cup finely chopped onion ADVERTISEMENT",
            "1/2 cup finely chopped celery ADVERTISEMENT",
            "6 cups crumbled cornbread (from above) ADVERTISEMENT",
            "2 cups dry bread cubes or crumbled toasted biscuits ADVERTISEMENT",
            "2 teaspoons dried sage leaves ADVERTISEMENT",
            "1/2 teaspoon dried thyme leaves ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "1/2 teaspoon pepper ADVERTISEMENT",
            "1 large egg, beaten ADVERTISEMENT",
            "2 cups chicken broth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 450 degrees F. Spray 10 1/2-inch cast iron skillet with no-stick cooking spray. Place in oven to heat. Beat egg in large bowl. Add remaining cornbread ingredients; mix well. Pour into hot skillet. Bake 20 to 25 minutes. Cool cornbread; crumble to make 6 cups; set aside. Reduce heat to 425 degrees F.\nSpray 13 x 9-inch baking dish or pan with no-stick cooking spray. Melt butter in large skillet over medium heat. Add onions and celery; cook and stir until vegetables are tender.\nCombine vegetable mixture, crumbled cornbread and remaining ingredients in large bowl; toss gently to mix. Add enough broth to make mixture very moist. Spoon into prepared baking dish or form into 12 oval cakes or pones; place in prepared baking dish. Bake 30 to 35 minutes or until golden brown.\n",
        "picture_link": "R0RCXma2wnLX4Qus9RktJmPaTdIBHji"
    },
    {
        "title": "Ham and Mac Bake",
        "ingredients": [
            "1 cup elbow macaroni ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "2 tablespoons brown mustard ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 pinch ground black pepper to taste ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "2 cups cubed fully cooked ham ADVERTISEMENT",
            "2 cups peeled and sliced Granny Smith apples ADVERTISEMENT",
            "1 1/2 cups soft bread crumbs ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until cooked through but firm to the bite, 8 minutes. Drain.\nMelt 1/4 cup butter in a large saucepan over medium heat; whisk flour, brown sugar, mustard, salt, and black pepper into butter. Pour in milk and bring to a simmer; reduce heat to low and whisk until sauce is thick and bubbly, about 5 minutes. Stir macaroni, ham, and apple slices into sauce. Spread mixture into a 2-quart casserole.\nCombine soft bread crumbs with 2 tablespoons melted butter in a bowl; sprinkle crumbs over casserole.\nBake in the preheated oven until casserole is bubbly and crumb topping is browned, about 35 minutes.\n",
        "picture_link": "VtQ7YVgwbeYOUuMlntiDyFuG3YgqY2K"
    },
    {
        "title": "Spiced Blackberry and Peach Compote",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "2 tablespoons maple sugar ADVERTISEMENT",
            "2 teaspoons grated fresh ginger ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon freshly grated nutmeg ADVERTISEMENT",
            "3 cups frozen peach slices ADVERTISEMENT",
            "1 cup frozen blackberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a saucepan over medium heat. Stir maple sugar, ginger, cinnamon, and nutmeg into the melted butter. Add peaches and stir to coat. Cook the peaches at a simmer until soft and the juices begin to thicken, about 20 minutes.\nGently fold blackberries into the peach mixture; cook until the berries soften, about 5 minutes more.\n",
        "picture_link": "x1FTx3YtcBayTODivrpb9au.qNP7t/G"
    },
    {
        "title": "Warm Chicken, Bacon, and Egg Salad with Mayonnaise Dressing",
        "ingredients": [
            "2 slices smoked bacon ADVERTISEMENT",
            "2 large eggs ADVERTISEMENT",
            "2 teaspoons vegetable oil ADVERTISEMENT",
            "2 skinless, boneless chicken breast halves, cubed ADVERTISEMENT",
            "1 white onion, sliced ADVERTISEMENT",
            "3/4 cup sliced fresh mushrooms ADVERTISEMENT",
            "3 cups torn iceberg lettuce ADVERTISEMENT",
            "1/2 red bell pepper, diced ADVERTISEMENT",
            "10 cherry tomatoes ADVERTISEMENT",
            "2 ounces white Cheddar cheese, cut into 1/2-inch cubes ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on paper towels. Chop bacon when cool enough to handle.\nBring a saucepan of water to a boil, reduce heat to medium, and gently lower eggs into the boiling water using a spoon. Boil for 8 minutes. Remove immediately from heat, drain, and cover eggs with cold water.\nHeat vegetable oil in a skillet over medium heat; cook and stir chicken cubes, onion, and mushrooms in the hot oil until the meat is no longer pink inside and mushrooms are softened, about 10 minutes.\nPlace iceberg lettuce into a salad bowl. Add chicken-mushroom mixture and bacon. Top with red bell pepper, cherry tomatoes, and white Cheddar cheese. Stir mayonnaise into salad, tossing gently to coat. Peel eggs and cut each egg in half; cut halves horizontally into 3 wedges apiece. Arrange eggs on top of salad; serve warm.\n",
        "picture_link": "iQxbokL3KltPyJhCzYjV1v9Hj53qUKC"
    },
    {
        "title": "Easy No-Bake Butterfinger® and Peanut Butter Pretzel Bars",
        "ingredients": [
            "Nonstick cooking spray ADVERTISEMENT",
            "4 cups miniature marshmallows ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 3/4 cups NESTLE® TOLL HOUSE® Milk Chocolate Morsels, divided ADVERTISEMENT",
            "2 tablespoons creamy peanut butter ADVERTISEMENT",
            "4 cups toasted rice cereal squares ADVERTISEMENT",
            "37 pieces NESTLE® BUTTERFINGER® Bites Candy, coarsely chopped ADVERTISEMENT",
            "1 cup small pretzel twists, broken into 1/2-inch pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line 13 x 9-inch baking pan with foil leaving an overhang on two sides. Spray foil with nonstick cooking spray.\nHeat marshmallows, butter and salt in large, heavy-duty saucepan over medium-low heat, stirring frequently, for 5 to 10 minutes, until smooth. Remove from heat. Add 1 cup morsels and peanut butter; stir until melted.\nWorking quickly, stir in cereal, chopped Butterfinger and pretzels. Stir in remaining 3/4 cup morsels. Spread mixture into prepared baking pan with greased spatula, pressing down lightly. Cool for 2 hours or until set. Lift from pan; remove foil. Cut into bars with serrated knife.\n",
        "picture_link": "jpfHKj.UyUGgrsHaD5S0tMzPT7hbBMm"
    },
    {
        "title": "Butterfinger Banana Split",
        "ingredients": [
            "4 bananas, ripe, peeled, and halved lengthwise ADVERTISEMENT",
            "12 scoops ice cream, different flavors ADVERTISEMENT",
            "12 pieces NESTLE® BUTTERFINGER® Bites Candy, chopped, or more if desired ADVERTISEMENT",
            "Chocolate Flavor NESTLE® NESQUIK™ Syrup ADVERTISEMENT",
            "whipped cream ADVERTISEMENT",
            "4 maraschino cherries, stemmed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Arrange two banana halves in each of 4 ice cream dishes. Top each with three scoops ice cream.\nSprinkle with chopped Butterfinger, then drizzle with Nesquik.\nTop with whipped cream and a cherry. Serve immediately.\n",
        "picture_link": "cpTogDQj7kpsrSnS9.EQMYcKSWClXxK"
    },
    {
        "title": "Southern Addiction Mint Julep",
        "ingredients": [
            "2 tablespoons simple syrup ADVERTISEMENT",
            "10 fresh mint leaves ADVERTISEMENT",
            "1/2 cup crushed ice, or as needed ADVERTISEMENT",
            "2 fluid ounces peach-flavored bourbon liqueur (such as Southern Comfort ®) ADVERTISEMENT",
            "1 1/2 fluid ounces peach schnapps ADVERTISEMENT",
            "2 fluid ounces club soda ADVERTISEMENT",
            "2 1/2 fluid ounces sweet tea, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Muddle simple syrup and mint leaves together in a large glass; add ice. Pour in peach-flavored bourbon liqueur, peach schnapps, club soda, and sweet tea. Stir well.\n",
        "picture_link": "GBj32egxA2nXv5fdUzr/YXsV90cJ7BW"
    },
    {
        "title": "Chocolate Krisps",
        "ingredients": [
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "1 cup crispy rice cereal (such as Rice Krispies®) ADVERTISEMENT",
            "1/2 cup chopped almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Arrange 24 paper candy cups on a tray.\nPlace chocolate chips in a microwave-safe bowl; heat in the microwave until melted, about 2 minutes. Stir.\nStir crispy rice cereal and almonds into melted chocolate. Drop a spoonful of chocolate mixture into each candy cup. Refrigerate until set, 1 to 2 hours.\n",
        "picture_link": "sdprqmCGGky4fqfmhhM5gA22isW19oi"
    },
    {
        "title": "Mama Long's Goulash Soup",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 pound beef stew meat, cubed ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "3 tablespoons paprika ADVERTISEMENT",
            "1 tablespoon vinegar ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "2 teaspoons chopped garlic ADVERTISEMENT",
            "2 beef bouillon cubes ADVERTISEMENT",
            "1 teaspoon dry mustard ADVERTISEMENT",
            "1/2 teaspoon lemon juice ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "2 potatoes, peeled and cubed ADVERTISEMENT",
            "1 (8 ounce) package wide egg noodles ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large pot over medium heat; cook and stir beef and onion in hot oil until meat is browned, about 10 minutes. Add water, tomato sauce, paprika, vinegar, Worcestershire sauce, garlic, beef bouillon, mustard, lemon juice, and bay leaf. Reduce heat, cover, and simmer over low heat until beef is very tender, 2 to 3 hours.\nStir potatoes into soup and continue to simmer until potatoes are tender, about 30 minutes more. For a thicker soup, leave the pot uncovered; for a thinner soup, replace lid.\nBring a large pot of lightly salted water to a boil. Cook egg noodles in the boiling water, stirring occasionally until cooked through but firm to the bite, about 5 minutes. Drain.\nServe soup over egg noodles in bowls.\n",
        "picture_link": "wK/Zf6KlRqDAfPMDy5rehkM964c5mDC"
    },
    {
        "title": "Crumble-Topped Chocolate Peanut Butter Cake",
        "ingredients": [
            "1 2/3 cups NESTLE® TOLL HOUSE® Peanut Butter & Milk Chocolate Morsels, divided ADVERTISEMENT",
            "1/2 cup NESTLE® TOLL HOUSE® Semi-Sweet Chocolate Morsels ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups granulated sugar ADVERTISEMENT",
            "3/4 cup butter or margarine, softened ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3 large eggs ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "24 pieces Butterfinger® Bites, coarsely chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F. Grease 13 x 9-inch baking pan.\nMicrowave 1 cup peanut butter and milk chocolate morsels and semi-sweet morsels in medium, uncovered, microwave-safe bowl on medium high (70%) power for 1 minute; Stir. The morsels may retain some of their original shape. If necessary, microwave at additional 10- to 15-second intervals, stirring just until melted.\nCombine flour, baking soda and salt in small bowl. Beat sugar, butter and vanilla extract in large mixer bowl until creamy. Add eggs, one at a time, beating well after each addition. Beat in melted morsels. Gradually beat in flour mixture alternately with water until smooth. Spread into prepared pan.\nBake for 40 to 45 minutes or until wooden pick inserted in center comes out clean. Immediately sprinkle remaining peanut butter and milk chocolate morsels. Let stand 5 minutes or until morsels are shiny; spread evenly. Sprinkle with BUTTERFINGER(R) pieces. Cool completely in pan on wire rack.\n",
        "picture_link": "kwwraO0bIq1aA9CYuP8IA7UcAVWYxvu"
    },
    {
        "title": "Cute Bunny Cupcakes",
        "ingredients": [
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 1/3 cups buttermilk ADVERTISEMENT",
            "1/2 cup vegetable shortening ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "4 egg whites ADVERTISEMENT",
            "2 (16 ounce) packages vanilla frosting, divided ADVERTISEMENT",
            "sweetened flake coconut, or as needed ADVERTISEMENT",
            "1 drop red food coloring, or as needed ADVERTISEMENT",
            "12 whole graham cracker squares (4 cookies each) ADVERTISEMENT",
            "48 miniature semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line 24 cupcake cups with paper liners.\nWhisk flour, sugar, baking powder, and baking soda together in a bowl. Beat buttermilk, vegetable shortening, vanilla extract, and salt into dry ingredients until thoroughly combined; beat egg whites into batter. Pour batter into prepared cupcake cups, filing them 2/3 full.\nBake in the preheated oven until cupcakes are lightly browned, about 30 minutes. Let cool.\nDivide a container of frosting in half and tint half pink with red food coloring; set remaining vanilla frosting aside. Use second frosting container to frost cupcakes. Cover cupcakes with coconut.\nBreak graham crackers into individual cookies and cut each cookie carefully into a leaf shape pointed at both ends to make 48 ears. Cover each ear with remaining white frosting and frost the inside of each ear shape with pink frosting. Stick 2 ears into each cupcake. Push 2 mini chocolate chips into tops of cupcakes below ears to make eyes; add a dot of pink frosting to each for a nose.\n",
        "picture_link": "4bBKz.b7qMm9cLVHNGHMKuEDe3Km14q"
    },
    {
        "title": "Homemade Granola Cereal",
        "ingredients": [
            "4 1/2 cups rolled oats ADVERTISEMENT",
            "2 cups whole wheat flour ADVERTISEMENT",
            "1 1/4 cups honey ADVERTISEMENT",
            "3/4 cup wheat germ ADVERTISEMENT",
            "1/2 cup chopped raw cashews (optional) ADVERTISEMENT",
            "1/2 cup chopped raw almonds (optional) ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1/4 cup flaked coconut (optional) ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 250 degrees F (120 degrees C).\nMix oats, flour, honey, wheat germ, cashews, almonds, vegetable oil, coconut, brown sugar, vanilla, and salt together in a large bowl; spread onto a baking sheet.\nBake in preheated oven for 15 minutes, stir, and increase heat to 325 degrees F (165 degrees C). Continue cooking until the granola is golden brown, about 10 minutes more. Cool granola completely before storing in an air-tight container.\n",
        "picture_link": "YKt4EPdOW7/VV7NzbVXCCWbEpgQKZ3G"
    },
    {
        "title": "Crab Cakes with Lemon Aioli",
        "ingredients": [
            "1 (4 ounce) package Idahoan® Butter & Herb or Roasted Garlic Mashed Potatoes ADVERTISEMENT",
            "1 egg, lightly beaten ADVERTISEMENT",
            "1/3 cup green onions, chopped ADVERTISEMENT",
            "1/4 cup red bell pepper, diced ADVERTISEMENT",
            "1 tablespoon Italian parsley, coarsely chopped ADVERTISEMENT",
            "2 teaspoons Dijon mustard ADVERTISEMENT",
            "1 1/2 teaspoons Old Bay Seasoning™ ADVERTISEMENT",
            "1 teaspoon lemon pepper seasoning ADVERTISEMENT",
            "16 ounces cooked crab meat* ADVERTISEMENT",
            "1 cup panko (Japanese-style breading) ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "Watercress leaves (optional) ADVERTISEMENT",
            "Lemon Aioli: ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1/2 teaspoon lemon zest ADVERTISEMENT",
            "1 tablespoon fresh lemon juice ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1/2 teaspoon ground coriander ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare mashed potatoes following package directions, set aside to cool.\nPreheat oven to 300 degrees F.\nIn a large bowl, combine egg, green onions, red bell pepper, parsley, mustard, and seasonings.\nAdd crab meat and mix well.\nBlend in cooled potatoes until well distributed.\nShape into 2-inch wide patties. Press panko breading onto both sides of each patty. In a large skillet, heat 1 teaspoon each of the butter and oil over medium heat.\nAdd patties and cook for about 4 minutes on each side until golden and heated through.\nTransfer crab cakes to a baking sheet. Keep warm in oven.\nRepeat with the remaining butter, oil and patties.\nTo make lemon aioli, combine all ingredients and mix well. Cover and chill. Can be made a day ahead.\nServe warm on a bed of watercress with Lemon Aioli.\n",
        "picture_link": "ckx5O2N7hVDD/EiPYnVVCM.H5/s1nw6"
    },
    {
        "title": "Pineapple Orange Fruit Mold",
        "ingredients": [
            "1 1/2 cups boiling water ADVERTISEMENT",
            "1 (6 ounce) package peach flavor gelatin mix ADVERTISEMENT",
            "1 1/2 cups cold water ADVERTISEMENT",
            "1 (20 ounce) can DOLE® Pineapple Chunks, drained* ADVERTISEMENT",
            "1 (11 ounce) can DOLE Mandarin Oranges, drained ADVERTISEMENT",
            "1 1/2 cups thawed whipped topping ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir boiling water into gelatin in large bowl at least 2 minutes until completely dissolved. Stir in cold water. Refrigerate 45 minutes or until slightly thickened. Remove 1-1/2 cups gelatin; let stand at room temperature.\nStir drained fruit into remaining gelatin. Spoon into 6-cup mold sprayed with nonstick cooking spray. Refrigerate 15 minutes or until set not firm.\nWhisk whipped topping into reserved gelatin until blended. Spoon over gelatin layer in mold. Refrigerate 4 hours or until firm. Unmold.\n",
        "picture_link": "0dJBTxHA6OlttXCAP1FDYD7aS7VlyM."
    },
    {
        "title": "Yogurt Crunch Parfaits from DOLE®",
        "ingredients": [
            "1 cup granola or banana nut crunch cereal ADVERTISEMENT",
            "1 (20 ounce) can DOLE® Pineapple Chunks, drained ADVERTISEMENT",
            "1 (6 ounce) container strawberry yogurt or any flavor ADVERTISEMENT",
            "1 (8 ounce) tub light thawed whipped topping ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Layer granola, pineapple chunks, yogurt and whipped topping in parfait or dessert glasses. Serve.\n",
        "picture_link": "pVWjrGjM9OJcPScHsuQ6qktCAVcyt/S"
    },
    {
        "title": "Chorizo Chili",
        "ingredients": [
            "2 teaspoons olive oil, or as needed ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "12 ounces chorizo sausage ADVERTISEMENT",
            "1 (14 ounce) can diced tomatoes ADVERTISEMENT",
            "1 (14 ounce) can prepared chili ADVERTISEMENT",
            "1 (14 ounce) can butter beans ADVERTISEMENT",
            "3/4 cup tomato sauce ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1 tablespoon salt-free seasoning blend (such as Mrs. Dash® Chipotle seasoning) ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a skillet over medium heat; cook and stir onion and garlic in hot oil until tender, about 5 minutes. Stir ground beef and chorizo sausage into onion mixture; cook, breaking meat apart while stirring, until no longer pink, 10 to 15 minutes.\nMix ground beef-chorizo mixture, diced tomatoes, chili, butter beans, tomato sauce, chili powder, chipotle seasoning blend, salt, and black pepper in a slow cooker.\nCook on High until flavors have blended, 3 to 4 hours.\n",
        "picture_link": "MY5ArdOJi0QKKIgIncdBx.c/NacWXzG"
    },
    {
        "title": "Grandma's Christmas Cupcakes",
        "ingredients": [
            "9 tablespoons butter, softened ADVERTISEMENT",
            "1 cup superfine sugar ADVERTISEMENT",
            "4 drops almond extract, or more to taste ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 cup self-rising flour ADVERTISEMENT",
            "1 3/4 cups ground almonds ADVERTISEMENT",
            "round cookie or biscuit cutter ADVERTISEMENT",
            "small holly leaf-shaped cutter ADVERTISEMENT",
            "1 pound ready-to-use white fondant, divided ADVERTISEMENT",
            "1/4 cup confectioners' sugar, or as needed ADVERTISEMENT",
            "2 drops green food coloring, or as desired ADVERTISEMENT",
            "1 drop red food coloring, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line 16 muffin cups with paper liners.\nBeat the butter, sugar, and almond extract in a mixing bowl with an electric mixer until light and fluffy. Beat in the eggs one at a time, mixing well after each addition, followed by the self-rising flour. Gently fold the ground almonds into the batter; spoon batter into the prepared cupcake cups, filling them about halfway.\nBake the cupcakes until they have risen and a toothpick inserted into the center of a cupcake comes out clean, about 20 minutes. Allow the cupcakes to cool completely.\nTo decorate, knead the fondant until pliable; set aside about 1/3 of the fondant. Roll out the larger portion of the fondant on a work surface dusted generously with confectioners' sugar. Using a round cookie or biscuit cutter the same size as the cupcake tops, cut out circles of the fondant; place a fondant circle on each cupcake. Press the fondant down lightly.\nDivide the remaining fondant into four even portions; place 3 portions into a bowl and the other into a second small bowl. Tint the larger portion to your desired shade of green with the green food coloring. Tint the smaller portion to your desired shade of red food coloring.\nRoll out the green fondant on a work surface generously dusted with confectioners' sugar and cut out 32 holly leaves with leaf-shaped cutter. Use your finger to rub away any white confectioners' sugar on the green leaves and arrange 2 leaves on each cupcake. Roll red fondant into 48 small red berries and place 3 berries on the leaves of each cupcake.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Strawberry Raisin Rhubarb Pie",
        "ingredients": [
            "1 recipe pastry for a 9 inch double crust pie ADVERTISEMENT",
            "2 cups fresh strawberries, halved lengthwise ADVERTISEMENT",
            "4 cups rhubarb, stalks only, sliced 1/2 inch thick ADVERTISEMENT",
            "1/2 cup raisins, or to taste ADVERTISEMENT",
            "6 tablespoons all-purpose flour ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "1/4 teaspoon ground ginger ADVERTISEMENT",
            "1 egg white, beaten ADVERTISEMENT",
            "1 1/2 tablespoons unsalted butter, diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Line a 9-inch pie dish with a pastry crust.\nMix together the strawberries, rhubarb, raisins, flour, sugar, and ginger in a bowl; allow the mixture to stand for 15 minutes. Meanwhile, roll the remaining crust out into a 10-inch circle on a floured work surface. Brush the bottom crust with egg white, and pour in the filling. Dot the filling evenly with butter.\nCut the remaining crust into 3/4-inch wide strips (use a scalloped edge pastry cutter for a prettier crust). Moisten the rim of the filled bottom crust with a bit of water, and lay the two longest strips in a cross in the middle of the pie. Working from the next longest down to the shortest strips, alternate horizontal and vertical strips, weaving the strips as you go. Press the lattice strips down onto the bottom crust edge to seal, and trim the top crust strips neatly. Place the pie into a rimmed baking sheet.\nBake in the preheated oven for 20 minutes; lower oven heat to 400 degrees F (205 degrees C), and bake until golden brown, about 20 more minutes. Line the crust edges with aluminum foil if they brown too quickly.\n",
        "picture_link": "JhxtfRhGHhH/yUfcEBLo0Fyq6ZRikR2"
    },
    {
        "title": "Steamed Walleye (Pickerel) on the Grill",
        "ingredients": [
            "8 (4 ounce) fillets walleye ADVERTISEMENT",
            "1/4 cup clarified butter ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "1 large onion, sliced into rings ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium-high heat, and lightly oil the grate.\nPlace 2 fillets onto the center of a sheet of heavy duty aluminum foil. Drizzle with butter and lemon juice, season with salt and pepper, and place some of the onion rings over top. Bring the sides of the aluminum foil over the fish and fold several times. Roll up the ends, making the pouch airtight. Repeat with remaining ingredients.\nPlace the pouches onto the grill, and cook until the fish is no longer opaque in the center, and flakes easily with a fork, 15 to 20 minutes.\n",
        "picture_link": "wqKeFVuyY/WiSTO4qlnuLQYYLx7RnTq"
    },
    {
        "title": "Spaghetti Pasta Sauce",
        "ingredients": [
            "1 teaspoon olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1/2 cup prepared mincemeat, crumbled, or to taste ADVERTISEMENT",
            "1 (28 ounce) jar prepared pasta sauce ADVERTISEMENT",
            "1/2 cup tomato puree, or to taste (optional) ADVERTISEMENT",
            "5 leaves fresh basil, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a pot, heat the olive oil over medium heat, and cook and stir the onion until slightly browned, about 10 minutes. Stir in the mincemeat, and cook and stir until mincemeat is hot and well mixed with onion. Pour in the pasta sauce and tomato puree, and mix in the basil leaves. Bring the sauce to a simmer, and cook until the flavors have blended, about 10 minutes. Stir often.\n",
        "picture_link": "zgzzXp69LbjY2O3TOx/G7OcZ1/iRe2K"
    },
    {
        "title": "Mushroom Crusted Beef Tenderloin",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "2 tablespoons dried chives ADVERTISEMENT",
            "1 tablespoon dried tarragon ADVERTISEMENT",
            "1/2 teaspoon pureed garlic ADVERTISEMENT",
            "4 (6 ounce) 1 1/2 inch thick filet mignon steaks ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 (.5 ounce) package dried mushrooms, or more if needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the butter, chives, tarragon, and garlic together in a bowl until well-blended. Place the butter mixture on a large piece of plastic wrap. Wrap the butter with the plastic and shape it into a log about 1-inch thick. Place the log in the refrigerator to chill.\nSeason the beef tenderloin steaks with salt and black pepper. Place the dried mushrooms in a spice grinder or food processor. Process until the mushrooms are finely ground. Spread some of the ground mushroom on a plate. Press each steak into the mushroom powder until well coated, adding more mushroom to the plate as necessary.\nMelt about 2 tablespoons herb butter in a large skillet over medium heat. Arrange the steaks in the skillet and cook until they start to firm, and are reddish-pink and juicy in the center, about 6 minutes per side. An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C) for medium rare, 140 degrees F (60 degrees C) for medium. Top each steak with 1 teaspoon herb butter before serving.\n",
        "picture_link": "bEAF6/weaLu0xbn6IwlGL2pT7sqq/86"
    },
    {
        "title": "Frosted Strawberry Shortcake",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "1 teaspoon almond extract ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 pint strawberries, hulled and sliced ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/4 cup cornstarch ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "1 cup chilled heavy cream ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "4 strawberries, halved for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour an angel food tube pan. In a bowl, whisk together the flour, baking powder, and salt.\nIn a separate large bowl, beat 2 cups of sugar with the butter and almond extract using an electric mixer on low speed until creamy; beat in the eggs on high speed for 3 minutes, scraping down the side of the bowl a few times. Beat in the flour mixture alternating with about 1/3 cup of milk at a time, and beat until smooth and creamy, 1 to 2 minutes. Pour the batter into the prepared cake pan.\nBake in the preheated oven until the cake is golden brown and set, about 1 hour and 15 minutes. A toothpick inserted into the center of the cake should come out clean. Allow to cool completely.\nWhile cake is cooling, place 1 pint of strawberries and 1 cup of sugar in a saucepan over medium heat, stirring constantly, until the strawberries soften and give up their juice, 5 to 8 minutes. Mix the cornstarch and water in a small bowl, and stir the slurry into the strawberries; bring the filling to a boil, reduce heat to a simmer, and cook, stirring constantly, until thickened, about 2 minutes. Set the filling aside and allow to cool for 5 minutes.\nRemove cake from pan, and cut in half horizontally. Place the bottom half of the cake on a serving platter, and spread the slightly warm strawberry filling over the cake. Place the top half of the cake on top of the filling. Chill the cake in the refrigerator until the filling has set, about 1 hour.\nBeat the whipped cream in a chilled metal bowl with an electric mixer set on high speed, adding 1/4 cup of sugar gradually, until the cream forms stiff peaks. Spread the whipped cream over the top, sides, and into center hole of the cake; top with halved strawberries for garnish.\n",
        "picture_link": "PVWx9WMem5KGcM1rplXwEFqVUHiHTt6"
    },
    {
        "title": "Coconut Chicken Soup",
        "ingredients": [
            "1 cup coconut milk ADVERTISEMENT",
            "2 lemon grass, chopped ADVERTISEMENT",
            "4 slices (1/2-inch) piece peeled fresh ginger ADVERTISEMENT",
            "5 kaffir lime leaves, torn in half ADVERTISEMENT",
            "3/4 pound skinless, boneless chicken breasts, cut into strips ADVERTISEMENT",
            "5 tablespoons fish sauce ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 cup coconut milk ADVERTISEMENT",
            "1/2 cup lime juice ADVERTISEMENT",
            "1 teaspoon red curry paste ADVERTISEMENT",
            "1/4 cup coarsely chopped cilantro ADVERTISEMENT",
            "15 green Thai chiles, crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring 1 cup coconut milk, lemon grass, ginger, and kaffir lime leaves to a boil in a large skillet over medium-high heat. Stir in the chicken, fish sauce, and sugar. Reduce heat to medium, and continue cooking until the chicken no longer pink in the center, about 5 minutes. Stir in the remaining 1 cup coconut milk, and bring to a simmer, about 3 minutes.\nDivide the lime juice and curry paste into 4 bowls. Pour soup into bowls, and garnish with cilantro and Thai chiles.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Southern Possum Pie",
        "ingredients": [
            "2 (3 ounce) packages cream cheese, softened ADVERTISEMENT",
            "3/4 cup confectioners' sugar ADVERTISEMENT",
            "1 (9 inch) prepared graham cracker crust ADVERTISEMENT",
            "1/4 cup chopped pecans ADVERTISEMENT",
            "1/3 cup instant chocolate pudding mix ADVERTISEMENT",
            "1/4 cup instant vanilla pudding mix ADVERTISEMENT",
            "2 cups cold milk ADVERTISEMENT",
            "3/4 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup heavy cream, whipped ADVERTISEMENT",
            "30 pecan halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat the softened cream cheese and confectioners' sugar until smooth. Spread the mixture into the bottom of the prepared graham cracker crust. Sprinkle the chopped pecans over the mixture.\nStir together the chocolate and vanilla pudding mixes. Pour in the milk and vanilla extract; beat on low speed for 2 minutes. Spoon into the pie pan. Cover and refrigerate for at least 2 hours. Top with the prepared whipped cream and pecan halves.\n",
        "picture_link": "9F3AyX8D8bOsRfxRRyIUgbOjtjVicw6"
    },
    {
        "title": "Linda's Fried Walnuts",
        "ingredients": [
            "6 cups shelled walnut halves ADVERTISEMENT",
            "1/2 cup white sugar, or as needed ADVERTISEMENT",
            "1 cup canola oil ADVERTISEMENT",
            "1 pinch salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a pot of water to a boil, and stir in half the walnuts; reduce heat to medium, and boil for 1 minute. Remove nuts with a slotted spoon, and let drain in a colander set in the sink. Repeat with remaining walnuts. Rinse the walnuts under hot water, and transfer to a mixing bowl. Toss the walnuts with the sugar.\nIn an electric skillet with heat set to 350 degrees F (175 degrees C), heat the canola oil. With a metal slotted spoon, place enough nuts to cover the bottom of the skillet; the oil will sizzle and pop, so be careful to avoid spatters. Gently stir the nuts with the spoon. Fry the walnuts until golden brown, about 5 minutes per batch. Transfer the walnuts in clumps to a baking sheet.\nSprinkle the nuts with salt, and let cool. Store in airtight container.\n",
        "picture_link": "ocNAdB/46Ac1PWhX3Qidm5jy/O9I0rC"
    },
    {
        "title": "Al Pastor Barbeque Sauce",
        "ingredients": [
            "1 tomato ADVERTISEMENT",
            "10 dried New Mexico chiles - stemmed, seeded, and cut into strips ADVERTISEMENT",
            "2 dried chipotle chiles - stemmed, seeded, and cut into strips ADVERTISEMENT",
            "2 dried guajillo chiles - stemmed, seeded, and cut into strips ADVERTISEMENT",
            "2 dried ancho chiles - stemmed, seeded, and cut into strips ADVERTISEMENT",
            "1 1/2 pounds chopped sweet onion ADVERTISEMENT",
            "1/2 head garlic, minced ADVERTISEMENT",
            "2 tablespoons dried mustard powder ADVERTISEMENT",
            "1 tablespoon sea salt ADVERTISEMENT",
            "1 1/2 teaspoons ground black pepper ADVERTISEMENT",
            "1 1/2 teaspoons ground coriander ADVERTISEMENT",
            "1 1/2 teaspoons ground cloves ADVERTISEMENT",
            "2 cups pineapple juice ADVERTISEMENT",
            "1 1/2 cups mango juice ADVERTISEMENT",
            "1/2 cup cider vinegar ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven's broiler and set the oven rack about 6 inches from the heat source.\nPlace the tomato on a baking dish, and broil, turning occasionally, until blackened on all sides. Once done, remove, and let cool until.\nMeanwhile, pack the New Mexico chiles, chipotle chiles, guajillo chiles, ancho chiles, onion, and garlic into a half-gallon glass jar. Sprinkle with mustard powder, sea salt, black pepper, coriander, and cloves. Remove the peel from the cooled tomato, cut in half, and squeeze out the seeds. Roughly chop the tomato and place it into the jar. Pour in half of the pineapple juice. Refrigerate at least 2 hours to soften the peppers.\nPlace the chile mixture into a food processor, and pulse several times to roughly chop the peppers. Pour in the remaining pineapple juice, mango juice, and vinegar. Blend well until finely chopped, about 2 minutes. Pour the pepper mixture back into the glass jar, seal with a lid, and refrigerate at least 1 week.\nAfter 1 week, pour the pepper puree back into the food processor, and blend 2 minutes until smooth. Pour into a large saucepan, and bring to a simmer over medium heat. Reduce heat to low, and simmer, stirring occasionally, for 30 minutes. Stir in 1/2 cup water, and return to the food processor. Puree 1 minute.\nPlace a large wire mesh strainer over a clean saucepan, and place 4 to 6 layers of cheesecloth into it to cover. Pour in the pepper puree, and allow to drip into the saucepan for 30 minutes. Gather up the corners of the cheesecloth, and gently twist together to extract all of the liquid from the pepper pulp. Be gentle to ensure that none of the solids are squeezed into the saucepan.\nReturn the saucepan to a simmer over medium heat, then reduce heat to low, and cook 30 minutes until desired thickness has been reached. Remember that it will thicken somewhat as it cools. Let cool, and store in the refrigerator until ready to use.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pina Colada Macaroons",
        "ingredients": [
            "2/3 cup all-purpose flour ADVERTISEMENT",
            "5 1/2 cups flaked coconut ADVERTISEMENT",
            "1 cup finely diced dried pineapple ADVERTISEMENT",
            "1/2 cup finely chopped salted macadamia nuts ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 teaspoon rum flavored extract ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Line baking sheet with parchment paper or a silicone mat.\nCombine the flour, coconut, pineapple, macadamia nuts, and salt in a large bowl. Stir in the sweetened condensed milk, rum extract, and vanilla extract. Drop golf ball-sized scoops of the dough 2 inches apart onto the prepared baking sheets.\nBake in the preheated oven until coconut is toasted, 12 to 15 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Citrus Ice Pops",
        "ingredients": [
            "1/2 cup grapefruit juice ADVERTISEMENT",
            "1 cup orange juice ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 (8 ounce) container vanilla yogurt ADVERTISEMENT",
            "1/2 cup chopped strawberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the grapefruit juice, orange juice, water, lemon juice, and sugar in a saucepan over medium heat, and bring to a boil. Cook, stirring, until the sugar has dissolved, about 5 minutes. Remove from heat, and chill the mixture in the freezer until very cold, about 10 minutes.\nMix the vanilla yogurt with the strawberries, and chill.\nSpoon a little of the cold juice mixture into 6 ice pop molds, using about 1 1/2 tablespoon of mixture for each mold. Place the molds into the freezer until the juice freezes, 30 minutes to 1 hour. Spoon about 1 tablespoon of the cold strawberry yogurt into each ice pop, and top each pop with the remaining citrus juice mixture. Freeze until fully hardened, 1 to 1 1/2 hours.\n",
        "picture_link": "VmSMpcz6b24qQpZqUY1iPJ87mFQcaQ2"
    },
    {
        "title": "Firecracker Crab Cakes",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 bunch green onions, sliced ADVERTISEMENT",
            "1 large carrot, shredded ADVERTISEMENT",
            "1 red bell pepper, diced ADVERTISEMENT",
            "1 bunch chopped fresh parsley ADVERTISEMENT",
            "2 (6 ounce) cans crabmeat, drained ADVERTISEMENT",
            "1 (14 ounce) can black beans, drained and rinsed ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup bread crumbs ADVERTISEMENT",
            "1/2 cup spicy mayonnaise ADVERTISEMENT",
            "1/2 cup canola oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a skillet over medium heat; cook the green onions, carrot, red bell pepper, and parsley in the hot oil until the green onions are softened, about 10 minutes.\nCombine the green onion mixture with the crabmeat and black beans in a large mixing bowl. Stir the egg, bread crumbs, and mayonnaise into the mixture until evenly mixed; divide into 12 approximately equal portions and shape into patties. Refrigerate the patties until set, about 1 hour.\nHeat the canola oil in a large skillet over medium-high heat; fry the patties in the hot oil until browned and cooked through, about 5 minutes per side.\n",
        "picture_link": "A9GZhsXxjMHGbVHOGg2OdbP0By7wBf."
    },
    {
        "title": "ZEB (Z'Herbes)",
        "ingredients": [
            "2 pounds boneless pork chops, cubed ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "garlic salt to taste ADVERTISEMENT",
            "seasoned salt to taste ADVERTISEMENT",
            "3 tablespoons bacon drippings ADVERTISEMENT",
            "4 onions, chopped ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 small head cabbage, sliced ADVERTISEMENT",
            "1 small head lettuce, sliced ADVERTISEMENT",
            "2 bunches green onions, chopped ADVERTISEMENT",
            "2 bunches celery, leaves only, chopped ADVERTISEMENT",
            "1 (13.5 ounce) can spinach, undrained and liquid reserved ADVERTISEMENT",
            "1 (10 ounce) package frozen mustard greens ADVERTISEMENT",
            "1 bunch turnip greens, washed and chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss pork chop cubes in a bowl with salt, garlic salt, and seasoned salt, and set aside. Heat the bacon drippings in a large skillet, and cook and stir the onions until lightly browned, about 10 minutes.\nMelt the butter in a large, heavy saucepan over low heat, mix in the flour, and cook and stir until the roux is golden brown, about 10 minutes. Watch carefully, the roux burns easily. For a darker roux, stir constantly over low heat until it turns a deep reddish brown, 20 to 30 minutes. Raise heat to medium. Mix the cooked onions with drippings and seasoned pork cubes into the roux. Cook until the pork is browned, about 10 minutes, stirring frequently.\nStir in the cabbage, lettuce, green onions, celery leaves, drained spinach, mustard greens, and turnip greens, and cook until tender, about 30 minutes, stirring often. If mixture becomes too dry, stir in reserved spinach liquid, a little at a time as needed.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Black Forest Cheesecake",
        "ingredients": [
            "1/2 cup semi-sweet chocolate chips ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 cup graham cracker crumbs ADVERTISEMENT",
            "1/3 cup brown sugar ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "5 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup semi-sweet chocolate chips ADVERTISEMENT",
            "1/2 (16 ounce) jar maraschino cherries - drained, chopped, and juices reserved ADVERTISEMENT",
            "2 teaspoons cornstarch ADVERTISEMENT",
            "1/2 (16 ounce) jar maraschino cherries, halved ADVERTISEMENT",
            "3 tablespoons semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 500 degrees F (260 degrees C). Place a roasting pan filled halfway with water on the bottom rack of the oven. Grease a 10-inch pie pan.\nHeat 1/2 cup chocolate chips and 1/2 cup butter in a microwave in a microwave-safe bowl until melted, about 1 minute. Stir to combine. Stir in the graham cracker crumbs, brown sugar, water, and cinnamon. Press the cracker mix into the bottom and about 1 in h up the sides of the prepared pie pan. Set aside.\nBeat the cream cheese and white sugar with an electric mixer in a large bowl until light and fluffy. Add the eggs one at a time, allowing each egg to blend into the cream cheese mixture before adding the next. Beat in the vanilla with the last egg. Reserve 1/3 of the cream cheese mixture in a bowl. Pour the remaining 2/3 batter into the prepared crust.\nMelt 1/2 cup chocolate chips in a microwave-safe glass or ceramic bowl in 15-second intervals, stirring after each melting, for 1 to 3 minutes (depending on your microwave). Do not overheat or chocolate will scorch. Stir in the reserved cream cheese batter. Pour the chocolate mixture into the pan over the white filling. Run a knife through the filling decoratively to create a marble look. Sprinkle the chopped maraschino cherries on top. Place the pie pan on a baking sheet.\nBake on the top rack of the preheated oven for 10 minutes, then reduce heat to 200 degrees F (95 degrees C). Continue baking until the edges of the cheesecake have nicely puffed and the surface of the cheesecake is firm except for a small spot in the center that will jiggle when the pan is gently shaken, about 1 hour. Turn the oven off and allow the cheesecake to rest in the oven with the door closed for 1 1/2 hours. Run the tip of a paring knife around the edges of the pan, set the pan on a wire rack, and allow the cheesecake to cool at room temperature for 30 minutes before placing into the refrigerator, and cooling 3 hours.\nHeat the cornstarch and reserved maraschino cherry juice in a saucepan over medium heat. Cook and stir until the sauce has thickened, 5 to 7 minutes. Set aside to cool completely. Pour the cooked sauce over the cheesecake. Sprinkle the halved cherries on top. Melt the remaining 3 tablespoons chocolate chip in a microwave-safe bowl in 15-second intervals, stirring after each melting. Drizzle chocolate over the cheesecake. Refrigerate at least 2 more hours before serving.\n",
        "picture_link": "v.FRXjGCNn7KBPhIF7b1NprWCKsqN9S"
    },
    {
        "title": "New Orleans Greens",
        "ingredients": [
            "6 slices bacon ADVERTISEMENT",
            "8 cups water ADVERTISEMENT",
            "4 onions, chopped ADVERTISEMENT",
            "1 turnip, peeled and chopped ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "2/3 cup apple cider vinegar ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "5 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "1 tablespoon hot pepper sauce ADVERTISEMENT",
            "2 teaspoons celery seed ADVERTISEMENT",
            "3 pounds mustard greens, washed and chopped ADVERTISEMENT",
            "6 1-quart canning jars with lids and rings (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the bacon into a large stock pot over medium heat, and pan-fry until crisp and brown, turning often, about 10 minutes. Remove bacon, allow to cool, and crumble when cooled. Set bacon aside.\nPour water into the pot with the drippings, and stir in the onions, turnip, green and red bell peppers, apple cider vinegar, honey, garlic, black pepper, hot pepper sauce, and celery seed. Bring to a boil, and stir in the mustard greens. Reduce heat to a simmer, and cook until greens are very tender, at least 2 hours. Crumble bacon into the greens to serve.\nFor canning, sterilize the jars and lids in boiling water for at least 5 minutes. Pack the greens into the hot, sterilized jars, filling the jars to within 1/4 inch of the top. Run a knife or a thin spatula around the insides of the jars after they have been filled to remove any air bubbles. Wipe the rims of the jars with a moist paper towel to remove any food residue. Top with lids, and screw on rings.\nPlace a rack in the bottom of a large dial-gauge or weighted-gauge pressure canner. Place the jars into the pressure canner, and add water to completely cover the jars. Seal the pressure canner, place over medium heat, and bring to 12 pounds of pressure. Reduce heat just enough to hold the pressure steady, and process for 75 minutes, or the length of time recommended for your area. Remove from heat, and allow pressure in the canner to release gradually; remove the lid, and remove hot jars with a canning tongs.\nPlace jars onto a cloth-covered or wood surface, several inches apart, until cool. Once cool, press the top of each lid with a finger, ensuring that the seal is tight (lid does not move up or down at all). Store in a cool, dark area.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Cheesy Asparagus Beef Roll-Ups",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "2 bunches fresh asparagus spears, cut in half crossways ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1/2 red onion, chopped ADVERTISEMENT",
            "1 teaspoon red wine vinegar ADVERTISEMENT",
            "1 teaspoon soy sauce ADVERTISEMENT",
            "1/2 cup chicken broth ADVERTISEMENT",
            "1 teaspoon garlic salt, or to taste ADVERTISEMENT",
            "1 tablespoon garlic and herb seasoning blend (such as Mrs. Dash®) ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "3 (1/2 pound) beef cube steaks (tenderized beef round) ADVERTISEMENT",
            "2 teaspoons garlic salt, or to taste ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 tablespoon garlic and herb seasoning blend (such as Mrs. Dash®) ADVERTISEMENT",
            "3 tablespoons Dijon mustard ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup sauerkraut, drained ADVERTISEMENT",
            "3 slices American cheese, torn into pieces ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup, divided ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "1 slice American cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a large skillet over medium-high heat. Stir in the asparagus, 3 minced cloves of garlic, red onion, red wine vinegar, soy sauce, chicken broth, 1 teaspoon garlic salt, 1 tablespoon garlic herb seasoning blend, and 1 teaspoon black pepper. Cover and simmer until the asparagus is tender, stirring once, about 10 minutes. Remove from heat and set aside.\nPreheat an oven to 350 degrees F (175 degrees C).\nSeason both sides of the steaks with the remaining 2 teaspoons garlic salt, 1 teaspoon black pepper, and 1 tablespoon garlic and herb seasoning blend. Spread the Dijon mustard evenly on one side of each steak, then top with the remaining 2 minced cloves of garlic. Divide the sauerkraut evenly over the steaks, then arrange 3 to 4 pieces of asparagus on top. Spread 3 torn slices American cheese over the asparagus, then spoon about 3 tablespoonfuls of the cream of mushroom soup on top. Roll each steak up like a jelly roll and place in a casserole dish. Distribute the remaining asparagus spears around the rolled steaks.\nPlace the remaining cream of mushroom soup, sour cream, Parmesan cheese, and 1 slice American cheese into a blender. Cover, and puree until smooth. Pour the soup mixture over the steaks and asparagus. Cover the casserole dish with aluminum foil.\nBake in the preheated oven until the meat is beginning to firm, and is hot and slightly pink in the center, about 45 minutes. An instant-read thermometer inserted into the center should read at least 140 degrees F (60 degrees C).\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Grapefruit Soda",
        "ingredients": [
            "1 (12 fluid ounce) can frozen concentrated grapefruit juice, thawed ADVERTISEMENT",
            "1 (12 fluid ounce) can frozen white grape juice concentrate, thawed ADVERTISEMENT",
            "9 cups chilled club soda ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the grapefruit juice and white grape juice concentrates in a 1-quart pitcher until thoroughly combined. Store mixture in refrigerator. To serve, pour 1/3 cup of concentrate mix into a glass, and mix with 1 cup of cold club soda or sparkling water.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sweet Dressing For Fruit Salad",
        "ingredients": [
            "8 ounces sour cream ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon almond extract ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon, or to taste ADVERTISEMENT",
            "1/4 teaspoon ground cardamom, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk the sour cream, sweetened condensed milk, vanilla, almond extract, cinnamon, and cardamom together in a mixing bowl. Refrigerate the dressing until ready to serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Bone-in Pork Roast with Apple-Rhubarb Glaze",
        "ingredients": [
            "1 (5 pound) bone-in pork loin roast ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 cup chopped fresh sage ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 shallot, minced ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "1 pound diced rhubarb ADVERTISEMENT",
            "4 Gala apples - peeled, cored, and diced ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/4 cup red wine vinegar ADVERTISEMENT",
            "2 cups apple juice ADVERTISEMENT",
            "2 quarts chicken stock ADVERTISEMENT",
            "1/4 cup cornstarch ADVERTISEMENT",
            "1/2 cup cold water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 200 degrees F (95 degrees C). Place the pork onto a roasting rack, and rub all over with salt, black pepper, and sage.\nSlow roast the pork in the preheated oven until the pork is no longer pink near the bone, about 5 hours. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C).\nWhile the pork is cooking, melt the butter in a large pot over medium heat. Stir in the garlic, shallot, and onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Stir in the rhubarb, apple, brown sugar, vinegar, apple juice, and chicken stock. Bring to a boil over high heat, then reduce heat to medium, and simmer until the sauce has reduced to half of its original volume, about 30 minutes. Dissolve the cornstarch in the cold water, then stir into the simmering sauce. Continue to cook and stir until the sauce has thickened to the consistency of maple syrup.\nOnce the pork has reached an internal temperature of 145 degrees F (63 degrees C), spoon enough rhubarb glaze over the pork roast to cover completely. Return the pork to the oven, and continue baking until the glaze has set, and the internal temperature has reached 160 degrees F (71 degrees C), about 20 minutes. Let rest 10 minutes before slicing. Serve with the remaining apple-rhubarb glaze.\n",
        "picture_link": "EJvAQI3O./8.tUAF0Mo5rHusBJ8swXS"
    },
    {
        "title": "Farm-to-Table Pico de Gallo",
        "ingredients": [
            "4 Roma (plum) tomatoes, diced ADVERTISEMENT",
            "1 cup diced onion ADVERTISEMENT",
            "1 carrot, peeled and chopped ADVERTISEMENT",
            "1/4 cup fresh cilantro leaves, or to taste ADVERTISEMENT",
            "3 small jalapeno peppers ADVERTISEMENT",
            "2 green chile peppers ADVERTISEMENT",
            "1/4 large poblano chile ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "1 tablespoon chopped garlic ADVERTISEMENT",
            "1 teaspoon sea salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix tomatoes and onion in a bowl.\nProcess carrot, cilantro, jalapeno peppers, green chile peppers, poblano chile, lime juice, and garlic in a food processor to your preferred texture; add to tomato mixture and stir. Season the mixture with sea salt.\nCover bowl with plastic wrap and refrigerate at least 2 hours before serving.\n",
        "picture_link": "8TILGW4iQR1gq5Nz2tKM/c0Iww8dh0S"
    },
    {
        "title": "Hot and Creamy Jalapeno Corn Dip",
        "ingredients": [
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 (15.25 ounce) can whole kernel corn, drained ADVERTISEMENT",
            "2 jalapeno peppers, chopped ADVERTISEMENT",
            "1 1/2 teaspoons ground cumin ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine cream cheese and butter in a microwave-safe bowl; heat in microwave until mostly melted, about 30 seconds. Add corn, jalapeno peppers, cumin, and garlic powder to cream cheese mixture.\nHeat mixture in microwave until warm, 1 to 2 minutes.\n",
        "picture_link": "rChwhg4tkmkxWMsK.0KvcbR605GEQ8C"
    },
    {
        "title": "Sweet and Sour Country-Style Ribs",
        "ingredients": [
            "1 (4 pound) package country-style pork ribs, or to taste ADVERTISEMENT",
            "1 (20 ounce) can pineapple chunks, undrained ADVERTISEMENT",
            "2 (8 ounce) cans tomato sauce ADVERTISEMENT",
            "2 green bell peppers, sliced ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1/4 cup cider vinegar ADVERTISEMENT",
            "1/4 cup tomato paste ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ribs in slow cooker.\nMix pineapple with juice, tomato sauce, green bell pepper, onion, brown sugar, cider vinegar, tomato paste, Worcestershire sauce, and garlic together in a bowl; pour over the ribs.\nCook on Low until ribs are cooked through and tender, 8 to 10 hours.\n",
        "picture_link": "B/0/.eYfLuupcHSOqDPecDKihDYDJC."
    },
    {
        "title": "Garlic, Blue Cheese, and Bacon Biscuits",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "6 tablespoons butter, frozen and grated ADVERTISEMENT",
            "1 1/4 cups crumbled blue cheese ADVERTISEMENT",
            "4 slices cooked bacon, crumbled ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C). Line a baking sheet with parchment paper.\nWhisk flour, baking powder, salt, and pepper together into a large bowl. Mash grated butter into the flour mixture until the result resembles coarse crumbs. Mix blue cheese, bacon, and 2 cloves minced garlic into the flour mixture.\nMake a well in the center of the flour mixture. Pour buttermilk into the well and mix with your hands until the dry ingredients are just moistened. Drop mixture by heaping spoonfuls onto prepared baking sheet.\nBake in preheated oven until lightly browned, 12 to 15 minutes. Switch oven to preheat the broiler.\nStir melted butter and 1 clove minced garlic together in a small bowl; brush over the top of the biscuits.\nHeat biscuits under the broiler just until the tops are browned, about 2 minutes.\n",
        "picture_link": "vEcmvMcDGuYgoMIk1lwAr2nFLtvXaXu"
    },
    {
        "title": "Ang's Chicken Salad",
        "ingredients": [
            "2 cups hickory-smoked chicken, shredded ADVERTISEMENT",
            "1 cup halved red seedless grapes ADVERTISEMENT",
            "3 stalks celery, finely chopped ADVERTISEMENT",
            "3/4 cup olive oil mayonnaise ADVERTISEMENT",
            "1/4 cup finely chopped red onion ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix chicken, grapes, celery, mayonnaise, red onion, pepper, and paprika together in a bowl; refrigerate until chilled, at least 30 minutes.\n",
        "picture_link": "UZQLf7OuAZQQWWAilHZOrE9TsYrUGoi"
    },
    {
        "title": "Clockwatcher's Choice",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1 (10.75 ounce) can golden mushroom soup ADVERTISEMENT",
            "1 (10 ounce) package frozen cut green beans ADVERTISEMENT",
            "1 cup chopped canned tomatoes ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 dash ground black pepper ADVERTISEMENT",
            "3 cups frozen bite-size potato nuggets (such as Tater Tots®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium-high heat. Cook and stir ground beef and onion together in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease.\nStir mushroom soup, green beans, tomatoes, oregano, salt, and pepper with the beef mixture; bring to a boil and top with potato nuggets. Place a cover on the skillet, reduce heat to medium-low, and simmer until the green beans and potato nuggets are heated through, about 15 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Rich Black Forest Brownies",
        "ingredients": [
            "1 1/3 cups white sugar ADVERTISEMENT",
            "3/4 cup melted butter ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "2 large eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "3/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 (3.5 ounce) package instant chocolate pudding mix ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup dark chocolate chips ADVERTISEMENT",
            "1/4 cup mini chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nBeat sugar, butter, and water together in a large bowl; add eggs 1 at a time, beating well after each addition. Stir in vanilla extract.\nWhisk flour, cocoa powder, pudding mix, baking powder, and salt together in another bowl. Add flour mixture, 1/2 cup at a time, to butter mixture, stirring batter well after each addition. Stir dark chocolate chips and mini chocolate chips into batter. Pour batter into prepared baking dish.\nBake in the preheated oven until a toothpick inserted into the center of the brownies comes out slightly sticky with chocolate, 20 to 30 minutes. Cool in baking dish for 10 minutes before cutting into bars.\n",
        "picture_link": "aZ6LOkOzsWw0tHB85YHkARdfzVkQNbm"
    },
    {
        "title": "Balsamic Vinegar Tofu and Asparagus Pasta Salad",
        "ingredients": [
            "1 (12 ounce) package extra-firm tofu, cut into 1x2x2-inch pieces ADVERTISEMENT",
            "1 pound fresh asparagus, trimmed ADVERTISEMENT",
            "1 (16 ounce) package bow-tie pasta (farfalle) ADVERTISEMENT",
            "1/4 cup extra-virgin olive oil ADVERTISEMENT",
            "1/4 cup balsamic vinegar ADVERTISEMENT",
            "1 pound grape tomatoes, halved ADVERTISEMENT",
            "1 cup crumbled feta cheese ADVERTISEMENT",
            "2 tablespoons chopped fresh basil, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Arrange tofu on a baking sheet.\nCook tofu in the preheated oven until cooked through and lightly browned, about 20 minutes.\nBring a large pot of lightly salted water to a boil. Add asparagus and cook uncovered until tender yet firm to the bite, 3 to 5 minutes. Drain.\nBring a large pot of lightly salted water to a boil. Cook the bow-tie pasta at a boil, stirring occasionally, until cooked through yet firm to the bite, about 12 minutes; drain and transfer pasta to a serving bowl.\nHeat olive oil and balsamic vinegar in a skillet over medium-high heat; fry tofu until liquid has reduced and tofu is slightly crisp, 2 to 3 minutes.\nMix tofu, asparagus, tomatoes, feta cheese, and basil together with pasta.\n",
        "picture_link": "4Ht47BsnYqZFMQQhpWJeoK/EptqVJyK"
    },
    {
        "title": "Easy Beer Bratwurst",
        "ingredients": [
            "1 (12 fluid ounce) bottle dark German beer ADVERTISEMENT",
            "1 cup thinly sliced onions ADVERTISEMENT",
            "1 tablespoon maple syrup ADVERTISEMENT",
            "1 tablespoon white vinegar ADVERTISEMENT",
            "1/2 teaspoon caraway seeds ADVERTISEMENT",
            "1/2 teaspoon dried thyme, crushed ADVERTISEMENT",
            "1/2 teaspoon Worcestershire sauce ADVERTISEMENT",
            "6 uncooked bratwurst links ADVERTISEMENT",
            "6 hoagie buns, split and toasted ADVERTISEMENT",
            "1 1/2 cups shredded Cheddar cheese ADVERTISEMENT",
            "1 1/2 cups shredded lettuce (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line a 5- to 6-quart slow cooker with a Reynolds(R) Slow Cooker Liner.\nAdd beer, onions, maple syrup, vinegar, caraway seeds, thyme, and Worcestershire sauce to the prepared slow cooker. Stir gently with a rubber spatula to combine. Place bratwurst on top of the mixture in cooker.\nCover and cook for 4 hours on high or for 8 hours on low.\nServe bratwursts and onions in toasted buns topped with cheese and lettuce, if desired.\n",
        "picture_link": "XUJAXOwtIFoD5eTEJoej97naVChRSXe"
    },
    {
        "title": "Fajitas On A Stick",
        "ingredients": [
            "Marinade: ADVERTISEMENT",
            "1/4 cup extra-virgin olive oil ADVERTISEMENT",
            "1/2 lime, zested and juiced ADVERTISEMENT",
            "2 cloves garlic, minced, or more to taste ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/4 teaspoon red pepper flakes, or more to taste ADVERTISEMENT",
            "1/4 teaspoon ground chipotle pepper ADVERTISEMENT",
            "1 1/2 pounds beef sirloin, cut into 1-inch cubes ADVERTISEMENT",
            "1 red bell pepper, cut into 1-inch cubes ADVERTISEMENT",
            "1 green bell pepper, cut into 1-inch cubes ADVERTISEMENT",
            "1/2 onion, cut into 1-inch cubes ADVERTISEMENT",
            "skewers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk olive oil, lime juice, lime zest, garlic, cumin, red pepper flakes, and chipotle pepper together in a large glass or ceramic bowl. Add sirloin and toss to evenly coat. Cover the bowl with plastic wrap and marinate in the refrigerator, 30 minutes to 2 hours.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate.\nRemove sirloin from marinade and discard marinade. Thread sirloin, red bell pepper, green bell pepper, and onion onto skewers.\nCook on the preheated grill until sirloin is browned and vegetables are tender, about 4 minutes per side.\n",
        "picture_link": "z6SMnlPsPlmq6xDj.YyRXzCeCcZhe2e"
    },
    {
        "title": "Frozen Grape Bites",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 1/2 cups heavy whipping cream ADVERTISEMENT",
            "24 green grapes, frozen ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spray 24 miniature muffin cups with cooking spray.\nPour 1 tablespoon cream into each muffin cup. Place 1 grape into each muffin cup, swirling grape in the cream to coat.\nFreeze grape mixture until solid, about 1 hour.\n",
        "picture_link": "oeKmes8tXHrHjQEWY/cQkUN4KHrpJd."
    },
    {
        "title": "Beef and Bell Pepper Fajitas",
        "ingredients": [
            "2 tablespoons oil, divided ADVERTISEMENT",
            "1 pound boneless beef sirloin steak, cut into thin strips ADVERTISEMENT",
            "1 medium onion, thinly sliced ADVERTISEMENT",
            "1 medium green bell pepper, thinly sliced ADVERTISEMENT",
            "1 (6.9 ounce) package ZATARAIN'S® Spanish Rice ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes, undrained ADVERTISEMENT",
            "8 (8 inch) flour tortillas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1 tablespoon of the oil in large nonstick skillet on medium-high heat. Add beef; cook and stir 3 to 5 minutes or until meat is no longer pink. Transfer beef to medium bowl. Heat remaining 1 tablespoon oil in skillet. Add vegetables; cook and stir 2 minutes or until tender-crisp. Add to beef in bowl. Keep warm.\nStir Rice Mix, water and tomatoes into skillet. Bring to boil. Reduce heat to low; cover and simmer 25 minutes or until most of the water is absorbed and rice is tender.\nReturn beef and vegetables to skillet; cook and stir until heated through. Serve in warmed tortillas.\n",
        "picture_link": "/GJoub3Wlw.XspPSYrv6qiBZk5TmXZO"
    },
    {
        "title": "Auntie Mae's Irish Bread",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 1/4 cups milk, or more as needed ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 tablespoons caraway seeds (optional) ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease an 8-inch round glass baking dish.\nMix flour, milk, raisins, sugar, caraway seeds, vegetable oil, baking powder, baking soda, and salt together in a bowl until dough is not wet enough to pour and not dry enough to handle. Add more milk if dough is too dry. Transfer dough to the baking dish.\nBake in the preheated oven until a toothpick inserted in the center comes out clean, about 50 minutes.\n",
        "picture_link": "UN1FlJE30oUTixlRE/vItHdp7xl3sRu"
    },
    {
        "title": "Orange Pancakes",
        "ingredients": [
            "2 cups white whole wheat flour ADVERTISEMENT",
            "2 tablespoons baking powder ADVERTISEMENT",
            "2 tablespoons ground flax meal ADVERTISEMENT",
            "17 fluid ounces orange juice ADVERTISEMENT",
            "1 teaspoon orange extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk flour, baking powder, and flax meal together in a bowl; stir orange juice and orange extract into flour mixture until batter is well-combined.\nHeat a lightly oiled griddle over medium-high heat, or an electric griddle to 375 degrees F (190 degrees C). Drop batter by large spoonfuls onto the griddle and cook until bubbles form and the edges are dry, 3 to 4 minutes. Flip and cook until browned on the other side, 2 to 3 minutes. Repeat with remaining batter.\n",
        "picture_link": "qzcZNjSPqljl4ESqAdLkwr3BtCUUFXS"
    },
    {
        "title": "Gluten-Free Apple Crisp",
        "ingredients": [
            "Apple Mix: ADVERTISEMENT",
            "5 cups chopped apples ADVERTISEMENT",
            "1/4 cup rice flour ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "Crumble Topping: ADVERTISEMENT",
            "3/4 cup brown sugar ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1/2 cup rice flour ADVERTISEMENT",
            "1/2 cup quinoa flakes ADVERTISEMENT",
            "1/2 cup rice flakes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine apples, 1/4 cup rice flour, white sugar, and cinnamon in a bowl; transfer to an 8-inch baking dish.\nMix brown sugar, butter, 1/2 cup rice flour, quinoa flakes, and rice flakes in the same bowl used for apple mixture. Sprinkle crumble topping over apple mixture and pat down gently.\nBake in the preheated oven until apples are tender and topping is slightly browned, 35 minutes.\n",
        "picture_link": "sKqZQfzY4E/Fd2I.768LF9YL4rSafcK"
    },
    {
        "title": "Spicy Sushi Roll",
        "ingredients": [
            "1/4 cup mayonnaise ADVERTISEMENT",
            "1 tablespoon chile sauce ADVERTISEMENT",
            "1 1/2 teaspoons togarashi (Japanese seven spice) ADVERTISEMENT",
            "1 teaspoon prepared wasabi ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "3 (3 ounce) fillets imitation crabmeat, cut into 1 1/2-inch pieces ADVERTISEMENT",
            "2 cups cooked sushi rice ADVERTISEMENT",
            "3 sheets nori (dry seaweed) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix mayonnaise, chile sauce, togarashi, wasabi, chili powder, and paprika together in a bowl; fold in imitation crabmeat until evenly coated.\nSpread rice in an even layer across each nori sheet. Spoon a layer of crabmeat mixture in a row along the top edge of each nori sheet. Roll nori sheet around the crabmeat mixture filling, starting on the filling side until completely wrapped. Cut each roll into 8 equal pieces.\n",
        "picture_link": "uIxCTB8t/h9BmWTnoPEdUJf6AtudSEy"
    },
    {
        "title": "Black Forest Brownies",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "4 (1 ounce) squares semi-sweet baking chocolate ADVERTISEMENT",
            "3/4 cup butter ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup packed all-purpose flour ADVERTISEMENT",
            "1/2 cup pecans ADVERTISEMENT",
            "1/2 cup dried cherries ADVERTISEMENT",
            "1/2 cup chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a 9x13-inch baking pan with enough aluminum foil to hang over the edges. Spray the foil with cooking spray.\nMelt baking chocolate and butter together in a microwave-safe glass or ceramic bowl in 30-second intervals, stirring after each melting, for 1 to 3 minutes. Stir sugar into chocolate mixture until dissolved. Cool mixture slightly.\nMix eggs into into chocolate mixture until well mixed; stir in vanilla extract. Stir flour into chocolate mixture just until batter is moistened.\nProcess pecans and dried cherries in a food processor until chopped; fold into batter with chocolate chips. Spread batter into the prepared baking pan.\nBake in the preheated oven until brownies begin to pull away from the edges and are set in the middle, about 1 hour.\n",
        "picture_link": "WPCt.XzfiImzBPdA1pmO/2wDHcRnBYu"
    },
    {
        "title": "Garbanzo Bean and Veggie Burritos",
        "ingredients": [
            "1 1/2 tablespoons olive oil ADVERTISEMENT",
            "1/2 large onion, diced ADVERTISEMENT",
            "3 cloves garlic, minced, or more to taste ADVERTISEMENT",
            "2 tomatoes, divided ADVERTISEMENT",
            "2 (15 ounce) cans garbanzo beans, drained ADVERTISEMENT",
            "2 tablespoons lemon juice, divided ADVERTISEMENT",
            "2 teaspoons olive oil, divided ADVERTISEMENT",
            "1 1/2 teaspoons butter ADVERTISEMENT",
            "2 zucchini, chopped ADVERTISEMENT",
            "1 yellow squash, chopped ADVERTISEMENT",
            "1 green bell pepper, diced ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 1/2 teaspoons ground cumin ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "6 (10 inch) flour tortillas ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese (optional) ADVERTISEMENT",
            "1 dash hot sauce, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1 1/2 tablespoons olive oil in a skillet over medium heat; cook and stir onion and garlic until onion is translucent, 5 to 10 minutes. Add 1/2 of the chopped tomatoes; cook and stir for 1 minute. Add garbanzo beans, 1 tablespoon lemon juice, and 1 teaspoon olive oil; cover skillet and cook, stirring occasionally, until heated through, about 10 minutes.\nHeat butter and remaining 1 teaspoon olive oil in a separate skillet over medium heat; cook and stir zucchini, yellow squash, and green bell pepper until tender, about 5 minutes. Season with salt and black pepper.\nMix remaining 1 tablespoon lemon juice into garbanzo bean mixture; cover and cook for 5 minutes more. Mash garbanzo beans with a potato masher while skillet is still over heat until desired consistency is reach. Mix cumin, chili powder, and paprika into garbanzo beans; stir to coat.\nLayer garbanzo bean mixture, vegetable mixture, and remaining tomatoes onto each tortilla; top with Cheddar cheese and hot sauce. Fold opposing edges of the tortilla to overlap the filling. Roll 1 of the opposing edges around the filling into a burrito.\n",
        "picture_link": "HCxSQZJlZ7yj1mRftBdipKxG4ENbEPC"
    },
    {
        "title": "Valentine Conversation Heart Cookies",
        "ingredients": [
            "2/3 cup butter, softened ADVERTISEMENT",
            "3/4 cup granulated sugar ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 tablespoon milk ADVERTISEMENT",
            "1 teaspoon vanilla ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 (16 ounce) can vanilla frosting ADVERTISEMENT",
            "Food coloring ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F. Line two cookie sheets with Reynolds(R) Parchment Paper.\nBeat butter in a large bowl with an electric mixer on medium to high speed for 30 seconds. Add sugar, baking powder, and salt. Beat until combined, scraping the sides of the bowl occasionally. Beat in the egg, milk, and vanilla until combined. Beat in as much of the flour as you can with the mixer. Using a wooden spoon, stir in any remaining flour. Divide dough in half. If necessary, cover and chill dough about 30 minutes or until easy to handle.\nRoll half the dough at a time between two sheets of parchment paper to 1/8- to 1/4-inch thickness. Using a 2 1/2-inch heart-shape cookie cutter, cut out cookie shapes, re rolling dough as needed until all the dough is cut out. Place shapes 1 inch apart on prepared cookie sheets.\nBake 6 to 8 minutes or until edges are firm and bottoms are very light brown. Transfer the parchment paper with baked cookies to wire racks and let cool. Once cooled, slide the parchment paper onto a work surface.\nTint frosting as desired with food coloring. Frost cookies with one color and use another color to pipe a message over the frosted cookies.\n",
        "picture_link": "sBdUtNaJt.S89dM2K.MQNOp3nbK78Qi"
    },
    {
        "title": "d'Anjou Pear and Almond Tarts",
        "ingredients": [
            "18 (3 inch) unbaked tart shells ADVERTISEMENT",
            "7 tablespoons brown sugar ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "1 teaspoon pear-flavored white balsamic vinegar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "3 large ripe d'Anjou pears - peeled, cored, and diced ADVERTISEMENT",
            "3 tablespoons chopped almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Place tart shells on a baking sheet.\nStir brown sugar, melted butter, balsamic vinegar, and cinnamon together in a bowl; stir in pears and chopped almonds until completely coated. Spoon pear mixture into tart shells.\nBake in the preheated oven until golden, about 45 minutes.\n",
        "picture_link": "FoHDz5sea9jmzSL/zK5yUtROgUwIv6e"
    },
    {
        "title": "Calico Veggie Beans",
        "ingredients": [
            "1 (15 ounce) can black beans ADVERTISEMENT",
            "1 (15 ounce) can kidney beans, drained ADVERTISEMENT",
            "1 (15 ounce) can butter beans ADVERTISEMENT",
            "1 (15 ounce) can lima beans, drained ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "1/2 cup fresh tomato sauce ADVERTISEMENT",
            "1/2 cup chopped celery ADVERTISEMENT",
            "3 tablespoons white wine vinegar ADVERTISEMENT",
            "1 teaspoon mustard powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nStir black beans, kidney beans, butter beans, lima beans, brown sugar, onion, tomato sauce, celery, vinegar, and mustard powder together in a four-quart casserole dish; cover with aluminum foil.\nBake in the preheated oven for 1 hour.\n",
        "picture_link": "2/fnF5SepO8IOsM6IUa7GEKe0SwiJSW"
    },
    {
        "title": "Grandma Freel's Cranberry Salad",
        "ingredients": [
            "1 pound fresh cranberries ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "2 (3 ounce) packages cherry-flavored gelatin (such as JELL-O®) ADVERTISEMENT",
            "1 1/2 cups chopped celery ADVERTISEMENT",
            "1 1/2 cups chopped, peeled apple ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir cranberries, sugar, and water together in a saucepan; cook over medium heat, stirring often, until most of the berries have popped open, about 20 minutes.\nRemove saucepan from heat. Stir gelatin into the cranberries mixture until dissolved completely; add celery, apple, and pecans and stir. Pour into a glass 13x9-inch dish.\nRefrigerate until set in the center, 10 to 12 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Easy Breakfast Pizzas",
        "ingredients": [
            "5 plain bagels, split ADVERTISEMENT",
            "1 (14 ounce) package cooked bacon, cut into 1/4-inch pieces ADVERTISEMENT",
            "1 cup prepared sausage gravy ADVERTISEMENT",
            "1 (8 ounce) package shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nArrange bagels onto a baking sheet with the cut sides up. Arrange bacon pieces atop the bagel halves. Spoon gravy lightly atop the bacon. Sprinkle mozzarella cheese over the gravy.\nBake in preheated oven until the cheese melts, about 10 minutes.\n",
        "picture_link": "FmEI8QuRMj.kz6Fen4R46FoWjQEYU8O"
    },
    {
        "title": "Oatmeal Pie Crust",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "2 cups quick-cooking oats ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg (optional) ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly spray a 9-inch pie dish with cooking spray.\nCombine oats, confectioners' sugar, butter, cinnamon, nutmeg, and salt together in a bowl; press into the prepared pie dish.\nBake in the preheated oven until lightly browned, 15 to 20 minutes. Cool completely.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Gluten-Free Fried Chicken",
        "ingredients": [
            "2 cups oil ADVERTISEMENT",
            "1 cup gluten-free all-purpose flour ADVERTISEMENT",
            "2 teaspoons powdered buttermilk (optional) ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 teaspoon celery salt ADVERTISEMENT",
            "1/2 teaspoon ground white pepper ADVERTISEMENT",
            "1/2 teaspoon xanthan gum ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "2 pounds skinless, boneless chicken breast halves, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C).\nCombine flour, powdered buttermilk, paprika, celery salt, white pepper, xanthan gum, baking soda, and cayenne pepper together in a gallon-size resealable plastic bag; shake to mix well. Place chicken in bag, seal the bag, and shake until each piece is coated in flour mixture.\nWorking in batches, drop coated chicken into preheated oil and cook, turning once, until no longer pink in the center and the juices run clear, about 10 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Transfer cooked chicken to a paper-towel lined plate to drain.\n",
        "picture_link": "qN6TzbbDCILrBLqNY/aJPoLvI35w/H2"
    },
    {
        "title": "Habanero Simple Syrup",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 habanero peppers, quartered ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water to a boil in a saucepan. Slowly stir sugar into boiling water until sugar is dissolved, 2 to 3 minutes. Add habanero peppers to sugar-water mixture, reduce heat to medium-low, and simmer until syrup is thickened and pepper has slightly colored the syrup, about 15 minutes.\nRemove saucepan from heat and let syrup cool, about 1 hour. Remove peppers from syrup and store syrup in a glass jar.\n",
        "picture_link": "YRJCoaQcUmCGmM06VxWHxrXPsaQb.Je"
    },
    {
        "title": "Roast Quail with Cured Lemon ",
        "ingredients": [
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons olive oil, divided ADVERTISEMENT",
            "1/2 teaspoon cumin ADVERTISEMENT",
            "1/4 teaspoon ground coriander ADVERTISEMENT",
            "1 pinch cayenne pepper (optional) ADVERTISEMENT",
            "4 whole quail ADVERTISEMENT",
            "8 slices cured lemon, patted dry ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1 slice cured lemon, minced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nWhisk 1 tablespoon olive oil, cumin, and coriander together in a large bowl; place quail in bowl and toss to coat quail completely.\nPlace 1 cured lemon slice in the cavity of each quail. Tie a piece of twine around the wings and under breast above the legs of each quail; tie legs together with twine.\nHeat remaining olive oil in a large skillet over high heat. Cook quail in hot oil until browned on all sides, 2 to 4 minutes per side. Remove from heat. Turn each quail, breast-side facing up. Place 1 slice cured lemon on each quail breast and sprinkle each with cayenne pepper.\nRoast in the preheated oven until slightly pink at the bone, 10 to 15 minutes.\nRemove quail to a plate. Pour chicken broth into skillet and bring to a boil while scraping the browned bits of food off of the bottom of the skillet with a wooden spoon. Cook until reduced by half, about 5 minutes. Stir minced lemon into broth mixture. Return quail to skillet and pour sauce over quail until heated through, 2 to 3 minutes.\n",
        "picture_link": "oF5vbD/xmZcq5zaZOuMVjbyP36XpLOu"
    },
    {
        "title": "Asian Broccoli Slaw",
        "ingredients": [
            "2 (3 ounce) packages any flavor ramen noodles ADVERTISEMENT",
            "1/2 cup sunflower seeds ADVERTISEMENT",
            "1 (16 ounce) package broccoli coleslaw mix ADVERTISEMENT",
            "1/2 cup chopped fresh pineapple ADVERTISEMENT",
            "1/2 cup chopped fresh cilantro (optional) ADVERTISEMENT",
            "2 green onions (white and green parts), chopped, or more to taste ADVERTISEMENT",
            "Dressing: ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup cider vinegar ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "1/2 teaspoon sesame oil ADVERTISEMENT",
            "2 pinches cayenne pepper, or to taste (optional) ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Crush the ramen noodles and set the seasoning packets aside.\nHeat a skillet over medium-low heat. Cook and stir ramen noodles and sunflower seeds in the hot skillet until toasted and fragrant, 5 to 10 minutes.\nCombine broccoli coleslaw mix, pineapple, cilantro, and green onions in a large bowl.\nWhisk sugar, vinegar, olive oil, sesame oil, cayenne pepper, black pepper, and ramen seasoning packets together in a bowl until dressing is smooth. Pour dressing over slaw mixture and toss to coat. Add toasted ramen noodles and sunflower seeds just before serving.\n",
        "picture_link": "mSlmKwo5Ogs5Lj6x7V68Bv2HgLU0p4W"
    },
    {
        "title": "Cheesy Chilada Casserole",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1 green bell pepper, diced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 (16 ounce) can pinto beans, rinsed and drained ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "1 cup picante sauce ADVERTISEMENT",
            "1 1/2 teaspoons ground cumin ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1 teaspoon dried cilantro ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "12 corn tortillas, divided ADVERTISEMENT",
            "2 cups shredded Monterey Jack cheese, divided ADVERTISEMENT",
            "1 cup shredded Cheddar cheese, divided ADVERTISEMENT",
            "2 cups shredded lettuce (optional) ADVERTISEMENT",
            "1 large tomato, diced (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nHeat olive oil in a large pot over medium-high heat. Saute onion and bell pepper in hot oil until softening, 2 to 3 minutes. Add garlic and continue to saute until fragrant, about 1 minute more.\nBreak ground beef into small chunks and add to the pot; cook, stirring frequently, until the beef is completely browned, 7 to 10 minutes. Drain grease from the pot and return to heat.\nStir pinto beans, tomato sauce, picante sauce, cumin, chili powder, cilantro, salt, red pepper flakes, and black pepper into the beef mixture; bring to a simmer, reduce heat to medium-low, and cook at a simmer until the flavors blend, about 15 minutes.\nSpoon enough of the beef mixture into the bottom of a 13x9-inch baking dish to cover. Arrange 6 tortillas atop the beef mixture. Sprinkle 1 cup Monterey Jack cheese and 1/2 cup Cheddar cheese in a layer to cover the tortillas. Arrange remaining 6 tortillas atop the cheese layer; top with remaining meat mixture. Cover the dish tightly with aluminum foil.\nBake in preheated oven for 20 minutes. Remove the aluminum foil and sprinkle the remaining Monterey Jack cheese and Cheddar cheese over the top. Continue baking until the cheese is melted, 5 to 10 minutes. Let cool for 10 minutes before cutting; top with lettuce and tomato.\n",
        "picture_link": "akCGpn4Wj5ftyU4vDrfvxc6.B4WEYo2"
    },
    {
        "title": "Sweet Potato Breakfast Pancakes",
        "ingredients": [
            "Dry Ingredients: ADVERTISEMENT",
            "2 1/2 cups baking mix (such as Bisquick ®) ADVERTISEMENT",
            "3 tablespoons brown sugar ADVERTISEMENT",
            "2 1/2 teaspoons pumpkin pie spice ADVERTISEMENT",
            "Wet Ingredients: ADVERTISEMENT",
            "1 3/4 cups milk ADVERTISEMENT",
            "1 cup mashed sweet potatoes ADVERTISEMENT",
            "2 tablespoons white vinegar ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "2 tablespoons vegetable oil, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix baking mix, brown sugar, and pumpkin pie spice together in a large bowl. Beat milk, mashed sweet potatoes, white vinegar, and 2 tablespoons vegetable oil together in a separate bowl until smooth; gradually beat into the dry mixture to incorporate into a batter.\nHeat a large skillet over medium heat; add just enough oil to cover the cooking surface and let oil get hot. Pour batter onto hot skillet by 1/4 cup portion, taking care to not overcrowd the skillet. Cook pancakes until browned, 3 to 5 minutes per side. Repeat cooking steps until all batter is used.\n",
        "picture_link": "3/sj75nwaZVqq15o2kO5HBgLL756Q1C"
    },
    {
        "title": "Ron's Favorite Linguine with White Clam Sauce",
        "ingredients": [
            "1 (16 ounce) package linguine pasta ADVERTISEMENT",
            "1/4 cup extra-virgin olive oil ADVERTISEMENT",
            "4 cloves garlic, finely chopped ADVERTISEMENT",
            "1 pinch red pepper flakes ADVERTISEMENT",
            "1 cup dry white wine ADVERTISEMENT",
            "1 (6.5 ounce) can baby clams, drained with juices reserved ADVERTISEMENT",
            "1 tablespoon cold unsalted butter ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 cup chopped flat-leaf parsley ADVERTISEMENT",
            "1 tablespoon chopped oregano ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook linguine at a boil until tender yet firm to the bite, about 11 minutes; drain.\nHeat oil in a stockpot over high heat. Saute garlic in hot oil until fragrant, about 1 minute.\nStir red pepper flakes with the garlic; add white wine and reserved clam juice. Cook the mixture until the liquid reduces in volume by half, about 3 minutes.\nDrop butter into the liquid and cook until melted, 2 to 3 minutes; season with salt and pepper. Add clams to the pot; cook until he clams are heated through, 1 to 2 minutes. Stir linguine with the clam mixture to coat; season with parsley and oregano.\n",
        "picture_link": "PQzHASTK4iwFilDWfgOm85p82lnjrUu"
    },
    {
        "title": "Cranberry Chocolate-Dipped Cookies",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "3/4 cup packed brown sugar ADVERTISEMENT",
            "1/4 cup granulated sugar ADVERTISEMENT",
            "1 (3.3 ounce) package JELL-O White Chocolate Flavor Instant Pudding ADVERTISEMENT",
            "1 teaspoon vanilla ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "2 1/4 cups flour ADVERTISEMENT",
            "1 (12 ounce) package BAKER'S Semi-Sweet Chocolate Morsels ADVERTISEMENT",
            "1 cup dried cranberries ADVERTISEMENT",
            "1/2 cup chopped PLANTERS Walnuts ADVERTISEMENT",
            "2 (4 ounce) packages BAKER'S Semi-Sweet Chocolate, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 375 degrees F.\nBeat butter, sugars, pudding mix and vanilla in large bowl with mixer until blended. Add eggs and baking soda; mix well. Gradually beat in flour. Stir in chocolate morsels, cranberries and nuts.\nDrop teaspoonfuls of dough, 2 inches apart, onto baking sheets.\nBake 8 to 10 min. or until golden brown. Cool on baking sheets 3 min. Remove to wire racks; cool completely.\nDip half of each cookie into melted chocolate. Place on waxed-paper covered baking sheet; let stand until chocolate is firm.\n",
        "picture_link": "aASpyQgWLF/AChZlh2.gG4yMm.6QV3i"
    },
    {
        "title": "Better-Than-a-Restaurant Cheese Fondue",
        "ingredients": [
            "2 cloves garlic, lightly crushed ADVERTISEMENT",
            "1 cup Sauvignon Blanc wine ADVERTISEMENT",
            "8 ounces Gruyere cheese, shredded ADVERTISEMENT",
            "8 ounces Cheddar cheese, shredded ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour enough water into a large pot to be a few inches deep. Set a large stainless steel bowl atop the pot to make a double-boiler. Put garlic cloves into the bowl and turn heat below double-boiler to medium; cook until the garlic is fragrant and warm, 2 to 3 minutes.\nPour wine into the bowl; cook until fragrant, 2 to 3 minutes. Remove garlic from wine and discard.\nMix Gruyere cheese, Cheddar cheese, and flour in a bowl; gradually add to the wine while stirring continually. Cook and stir the mixture until the cheese is melted and the mixture is smooth, 2 to 3 minutes.\n",
        "picture_link": "VyPfu4zZRF0cy2j080KoCFxmHShAzRK"
    },
    {
        "title": "Pizza-Style Portabello Mushrooms",
        "ingredients": [
            "2 large portobello mushroom caps ADVERTISEMENT",
            "1/2 cup diced tomatoes ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon chopped fresh basil ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "1 pinch dried parsley, or to taste ADVERTISEMENT",
            "1 pinch red pepper flakes, or to taste ADVERTISEMENT",
            "4 ounces shredded pepperjack cheese ADVERTISEMENT",
            "4 ounces shredded mozzarella cheese ADVERTISEMENT",
            "2 tablespoons sliced black olives, or to taste (optional) ADVERTISEMENT",
            "1 tablespoon Italian-style seasoned bread crumbs, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Place mushrooms in a baking dish.\nCook and stir tomatoes, balsamic vinegar, olive oil, basil, garlic, parsley, and red pepper flakes in a large skillet over medium heat until heated through, 5 to 10 minutes.\nTop each mushroom with 1/2 of the tomato mixture. Sprinkle pepperjack cheese and mozzarella cheese on top of tomato mixture; top with black olives and bread crumbs.\nBake in the preheated oven until golden brown and crispy, about 25 minutes.\n",
        "picture_link": "RanRpTslhD1BKS.VDlqRBhFADTHmx6m"
    },
    {
        "title": "Dale's Awesome Sauce",
        "ingredients": [
            "2 large Roma (plum) tomatoes, halved ADVERTISEMENT",
            "1 large green bell pepper, halved and seeded ADVERTISEMENT",
            "1 white onion, halved ADVERTISEMENT",
            "1 head garlic, halved crosswise ADVERTISEMENT",
            "2 tablespoons olive oil, or as needed ADVERTISEMENT",
            "1/4 teaspoon garlic powder, or to taste ADVERTISEMENT",
            "sea salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 1/2 cups mayonnaise ADVERTISEMENT",
            "1 teaspoon ground dried chipotle pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for high heat, and lightly oil the grate.\nRub tomato halves, bell pepper halves, onion halves, and garlic halves with olive oil; season with garlic powder, sea salt, and black pepper.\nCook vegetables on preheated grill, turning regularly, until wrinkled and slightly charred, 5 to 10 minutes.\nPut grilled vegetables into a blender bowl with mayonnaise and dried chipotle pepper; blend until smooth.\n",
        "picture_link": "5ZvYqy/sENvOQHGeTIYB.tauJDbTgCe"
    },
    {
        "title": "Cherry-Chocolate Layered Dessert",
        "ingredients": [
            "1 (9 ounce) package chocolate wafer cookies, finely crushed ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 1/2 cups boiling water ADVERTISEMENT",
            "2 (3 ounce) packages JELL-O Cherry Flavor Gelatin ADVERTISEMENT",
            "1 (8 ounce) package PHILADELPHIA Cream Cheese, softened ADVERTISEMENT",
            "2 1/2 cups thawed COOL WHIP Whipped Topping, divided ADVERTISEMENT",
            "2 ounces BAKER'S Semi-Sweet Chocolate, shaved into curls ADVERTISEMENT",
            "2 1/4 cups fresh dark sweet cherries, pitted ADVERTISEMENT",
            "1 teaspoon powdered sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 350 degrees F.\nMix cookie crumbs and butter; press onto bottom of 13x9-inch pan. Bake 12 to 15 min. or until firm. Cool.\nMeanwhile, add boiling water to gelatin mixes in small bowl; stir 2 min. until completely dissolved. Whisk cream cheese in large bowl until blended. Gradually whisk in gelatin. Refrigerate 30 min. or until chilled.\nWhisk 1 cup COOL WHIP into gelatin mixture; pour over crust. Refrigerate 2 hours or until firm.\nSpread remaining COOL WHIP over dessert; top with chocolate curls and cherries. Garnish with sifted powdered sugar just before serving.\n",
        "picture_link": "Qo4Rb7DVM.5ZhmgszhUqPhrUDxcEaXq"
    }
]