[
    {
        "title": "Aracely's Flan",
        "ingredients": [
            "10 egg yolks ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 (12 ounce) can evaporated milk ADVERTISEMENT",
            "3 tablespoons margarine ADVERTISEMENT",
            "3 tablespoons brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the yolks, condensed milk, and evaporated milk; set aside. Melt margarine in a small saucepan over medium heat. Stir in the brown sugar; keep stirring until the brown sugar has dissolved, and is smooth. Evenly spread the sugar over the bottom of a pie plate, then pour in the custard. Cover with foil. (See note at bottom.)\nFill a large pot approximately 3/4 full with water and bring to a simmer on the stove. Place the pie plate over the simmering water and cook for 65 to 70 minutes, until flan has set. Remove flan from the boiling water and allow to cool for at least 30 minutes.\nTo serve, loosen the flan from the pie plate by running a knife around the edges; invert onto a serving plate. Serve at room temperature or cold.\n",
        "picture_link": "SNB92GPLx3YCFVgSCUiE5Hc9kz2PwMC"
    },
    {
        "title": "Baked Haddock with Spinach and Tomatoes",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "1 cup thinly sliced onion ADVERTISEMENT",
            "2 (10 ounce) packages chopped frozen spinach, thawed and squeezed dry ADVERTISEMENT",
            "1/4 teaspoon freshly grated nutmeg ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/2 pounds haddock fillets ADVERTISEMENT",
            "1 (14.5 ounce) can diced Italian plum tomatoes, juices reserved ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "1/4 teaspoon dried tarragon ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 tablespoon minced onion ADVERTISEMENT",
            "1 teaspoon cornstarch ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lightly butter a 2-quart casserole or baking dish large enough to hold haddock fillets in a single layer.\nMelt 1 tablespoon of the butter in a skillet over medium heat and cook the onion slices, stirring occasionally, until soft, about 5 minutes. Stir in spinach and nutmeg and cook for about 3 minutes.\nArrange haddock fillets in baking dish. Spoon equal portions of the spinach mixture between the fillets. Spoon drained tomatoes around fillets and sprinkle with the thyme, tarragon and salt.\nBake, uncovered, for 20 to 25 minutes or until fish flakes easily with a fork.\nWhile fish is baking, make the sauce. If necessary add enough water to reserved tomato liquid to make 1 cup. In the skillet, melt the remaining 1 tablespoon butter over medium heat. Stir in the minced onion and cook until soft, about 5 minutes. Add 3/4 cup of the tomato juice to the onions. Bring mixture to a boil. Whisk the cornstarch into the remaining 1/4 cup juice, then add to the skillet. Reduce heat and simmer, stirring, until sauce thickens slightly. Pour sauce over baked fillets and serve.\n",
        "picture_link": "cWy3UWEQSPSMVnlOHuNSKALjHYythN2"
    },
    {
        "title": "Light Chicken Piccata",
        "ingredients": [
            "8 ounces lowfat plain yogurt ADVERTISEMENT",
            "4 boned and skinned chicken breast halves ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 teaspoon margarine ADVERTISEMENT",
            "1 1/2 tablespoons lemon juice ADVERTISEMENT",
            "1 cup white vermouth ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup lemon juice ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "2 tablespoons capers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Coat chicken with yogurt, cover, and refrigerate at least 2 hours, preferably overnight.\nRinse chicken, and pat dry with paper towels.\nIn a bowl, stir together flour, paprika, salt, and pepper.\nHeat oil, margarine, and 1 1/2 tablespoons lemon juice in skillet over medium heat. Dredge chicken in flour mixture. Place chicken in skillet; cook, turning to brown both sides, about 15 minutes. Remove chicken to a plate, and keep warm.\nPour vermouth into skillet, and scrape brown bits with a wooden spoon. Stir in garlic, 1/4 cup lemon juice, water, and capers. Cook until reduced by half.\nReturn chicken to the pan, and simmer 3 minutes.\n",
        "picture_link": "ErUlXVR20wow.P2oQ9O2SCXCpOeHBeW"
    },
    {
        "title": "Spinach Ranch Salad",
        "ingredients": [
            "4 cups baby spinach, rinsed and dried ADVERTISEMENT",
            "1/2 cup cucumber ADVERTISEMENT",
            "1 cup broccoli florets ADVERTISEMENT",
            "1/2 cup feta cheese, crumbled ADVERTISEMENT",
            "1/4 red onion, chopped ADVERTISEMENT",
            "2 small, cooked chicken breast, cut into small pieces ADVERTISEMENT",
            "bacon bits ADVERTISEMENT",
            "1/2 cup ranch dressing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss together spinach, cucumber, broccoli, feta, onion, chicken, and bacon in a large bowl. Pour dressing over salad, and gently toss again.\n",
        "picture_link": "JqjgvYBYTkbe.6wmniSPbj9fZ4BGiB."
    },
    {
        "title": "Yogurt Cheese",
        "ingredients": [
            "3 cups plain yogurt ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon pepper ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line a strainer with two layers of cheesecloth. In a medium bowl, mix together the yogurt, salt, pepper and garlic.\nPour into the cheesecloth lined strainer. Place the strainer over another bowl to catch the liquid, and refrigerate for 1 to 2 days, until all of the liquid has drained off. Empty the drainage bowl occasionally so you can see when the cheese has stopped draining.\nTransfer cheese to a covered container, and store in the refrigerator for up to two weeks.\n",
        "picture_link": "rTg4xiZILxTr5HzyBi/yPLQnt.KZxV2"
    },
    {
        "title": "Dynamite Sauce",
        "ingredients": [
            "1 cup mayonnaise ADVERTISEMENT",
            "1 tablespoon sugar ADVERTISEMENT",
            "1 tablespoon chili garlic sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, stir together the mayonnaise, sugar and chili garilc sauce. Use immediately or refrigerate and use within one week.\n",
        "picture_link": "GewOhyw/wKuc4SRFzyBnpxGDr29ZQtS"
    },
    {
        "title": "Salmon Patties With Dill Sauce",
        "ingredients": [
            "Salmon Patties: ADVERTISEMENT",
            "1 (5 ounce) can salmon, drained and flaked ADVERTISEMENT",
            "1/2 cup dried breadcrumbs ADVERTISEMENT",
            "2 tablespoons minced onion ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "1 egg, lightly beaten ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "sea salt and ground black pepper to taste ADVERTISEMENT",
            "1 tablespoon olive oil, or as needed ADVERTISEMENT",
            "Dill Sauce: ADVERTISEMENT",
            "1/4 cup light sour cream ADVERTISEMENT",
            "1 teaspoon dill weed ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "sea salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix salmon, breadcrumbs, onion, Dijon mustard, egg, and lemon juice together in a bowl; form into 2 patties.\nHeat olive oil in a skillet over medium-high heat. Cook patties in the hot oil until lightly browned and cooked through, 4 minutes per side; season with sea salt and black pepper.\nMix sour cream, dill, garlic powder, and sea salt together in a bowl; serve alongside salmon patties.\n",
        "picture_link": "nuzheSqyAwMHg7JjUhM/8nLNzt9juv6"
    },
    {
        "title": "Bisquick® Sausage Balls",
        "ingredients": [
            "6 cups baking mix (such as Bisquick ®) ADVERTISEMENT",
            "2 pounds shredded extra-sharp Cheddar cheese ADVERTISEMENT",
            "1 pound sage-flavored pork sausage (such as Neese's® Extra Sage Sausage), at room temperature ADVERTISEMENT",
            "1 pound hot pork sausage (such as Neese's® Hot Sausage), at room temperature ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C). Grease a baking sheet.\nMix baking mix, Cheddar cheese, sage-flavored pork sausage, and hot pork sausage together in a bowl. Roll mixture into golf ball-sized balls; arrange balls on the prepared baking sheet.\nBake in the preheated oven until meatballs are no longer pink in the middle and browned on the outside, 25 to 30 minutes.\n",
        "picture_link": "g406pAlu1w7byyDlU96oxsPc9rwgcnC"
    },
    {
        "title": "Mayo Chicken",
        "ingredients": [
            "1 cup mayonnaise ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "1 tablespoon finely chopped fresh rosemary ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "1 whole chicken, cut into 6 pieces ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nStir mayonnaise, garlic, rosemary, salt, and black pepper together in a bowl. Place chicken pieces into a 9x13-inch baking dish, spread mayonnaise mixture over chicken, and top with Parmesan cheese.\nBake until the juices run clear, chicken is no longer pink in the middle, and an instant-read meat thermometer inserted into the thickest chicken piece reads at least 160 degrees F (70 degrees C), about 1 hour and 10 minutes.\n",
        "picture_link": "ClYU8I9ZupDlnO.uSx2FduMq8qTP57."
    },
    {
        "title": "Skillet Gnocchi with Chard & White Beans",
        "ingredients": [
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "1 (16 ounce) package shelf-stable gnocchi (see Tip) ADVERTISEMENT",
            "1 teaspoon extra-virgin olive oil ADVERTISEMENT",
            "1 medium yellow onion, thinly sliced ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "6 cups chopped chard leaves or spinach ADVERTISEMENT",
            "1 (15 ounce) can diced tomatoes with Italian seasonings ADVERTISEMENT",
            "1 (15 ounce) can white beans, rinsed ADVERTISEMENT",
            "1/4 teaspoon freshly ground pepper ADVERTISEMENT",
            "1/2 cup shredded part-skim mozzarella cheese ADVERTISEMENT",
            "1/4 cup finely shredded Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1 tablespoon oil in a large nonstick skillet over medium heat. Add gnocchi and cook, stirring often, until plumped and starting to brown, 5 to 7 minutes. Transfer to a bowl.\nAdd the remaining 1 teaspoon oil and onion to the pan and cook, stirring, over medium heat, for 2 minutes. Stir in garlic and water. Cover and cook until the onion is soft, 4 to 6 minutes. Add chard (or spinach) and cook, stirring, until starting to wilt, 1 to 2 minutes. Stir in tomatoes, beans and pepper and bring to a simmer. Stir in the gnocchi and sprinkle with mozzarella and Parmesan. Cover and cook until the cheese is melted and the sauce is bubbling, about 3 minutes.\n",
        "picture_link": "PecxFIe6JXRAsWhmMt0wnolGCS9ayLi"
    },
    {
        "title": "Bruschetta Chicken",
        "ingredients": [
            "4 (5 ounce) boneless skinless chicken breasts ADVERTISEMENT",
            "1/4 cup Mazola® Corn Oil ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "2 garlic cloves, finely minced ADVERTISEMENT",
            "1 tablespoon Spice Islands® Italian Herb Seasoning ADVERTISEMENT",
            "1/2 teaspoon Spice Islands® Fine Grind Sea Salt ADVERTISEMENT",
            "1/4 teaspoon Spice Islands® Fine Grind Black Pepper ADVERTISEMENT",
            "2 cups diced plum tomatoes ADVERTISEMENT",
            "1/4 cup diced red onion ADVERTISEMENT",
            "1/2 cup shredded Italian blend cheese ADVERTISEMENT",
            "1/4 cup finely chopped fresh basil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken breasts in a large resealable plastic freezer bag, one at a time. Lightly pound chicken breasts to an even thickness of about 3/4-inch. Combine oil, balsamic vinegar, garlic, Italian herb seasoning, salt and pepper in a small bowl and whisk until combined. Pour half of the marinade over the chicken, reseal bag, and set aside to marinate for at least 15 minutes. (Chicken and marinade can be prepared ahead; covered and refrigerated overnight.)\nPreheat grill to medium heat or about 350 degrees F. Combine remaining marinade with diced tomatoes and red onion; set aside. Transfer chicken from marinade onto grill surface and discard marinade. Grill chicken for 4 to 6 minutes per side or until cooked through. Transfer the chicken to a serving plate and sprinkle with shredded cheese. Spoon bruschetta mixture over chicken and top with basil; serve immediately.\n",
        "picture_link": "Jy/sPgY3XBx8X/kwKyJ47xeIsPd.T0m"
    },
    {
        "title": "Buffalo Chicken Calzone",
        "ingredients": [
            "1 pound skinless, boneless chicken breast halves ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/4 cup Buffalo wing sauce ADVERTISEMENT",
            "1 refrigerated pizza dough ADVERTISEMENT",
            "2 tablespoons vegetable oil, divided ADVERTISEMENT",
            "2 cups shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 410 degrees F (210 degrees C). Grease a pizza pan.\nPlace chicken into a large pot and cover with salted water; bring to a boil. Cook the chicken breasts until no longer pink in the center and the juices run clear, about 15 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Transfer chicken to a bowl and shred with two forks.\nMelt butter in a skillet over medium-high heat. Cook and stir chicken and Buffalo wing sauce in the hot butter until chicken is coated and heated through, 2 to 4 minutes.\nTurn pizza dough out onto a generously floured surface. Roll dough into a 12-inch round. Brush dough with 1 tablespoon vegetable oil and spread 1 cup mozzarella cheese in the center of the dough, leaving a 1-inch border. Spread chicken mixture over cheese; top chicken mixture with remaining 1 cup cheese.\nFold pizza dough in half and pinch edges together to seal. Transfer calzone to prepared pizza pan and brush top with remaining 1 tablespoon oil.\nBake in the preheated oven until crust is golden brown, 17 to 20 minutes.\n",
        "picture_link": "XSCXMD1w2qd44xtBMzyijPtNSWUrsBu"
    },
    {
        "title": "Quick Super-Delicious Zuppa Toscana",
        "ingredients": [
            "1 pound bulk mild Italian sausage ADVERTISEMENT",
            "1 1/4 teaspoons red pepper flakes ADVERTISEMENT",
            "4 slices bacon, cut into 1/2 inch pieces ADVERTISEMENT",
            "1 large onion, diced ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "8 3/4 cups chicken broth ADVERTISEMENT",
            "6 potatoes, thinly sliced ADVERTISEMENT",
            "6 cups chopped fresh kale ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook and stir Italian sausage and red pepper flakes in a Dutch oven over medium-high heat until sausage is browned and crumbly, 10 to 15 minutes. Transfer sausage mixture to a bowl.\nStir bacon into the same Dutch oven and cook over medium heat until bacon is crisp, about 10 minutes. Drain fat, leaving a few tablespoons of drippings in the Dutch oven.\nStir onion and garlic into bacon; cook and stir until onions are soft and translucent, about 5 minutes. Pour chicken broth into bacon mixture; bring to a boil. Stir potatoes and kale into broth; cook until potatoes are tender and soup is flavorful, about 15 minutes.\nStir sausage and heavy whipping cream into soup, reduce heat to medium, and cook until soup is heated through, about 5 minutes more.\n",
        "picture_link": "3Jog6k8aRdkhRHYbSolAqVctzNPF7Mq"
    },
    {
        "title": "Green Bean \"Almondine\" with Garlic and Blue Cheese",
        "ingredients": [
            "3 heads garlic, minced ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "salt and freshly ground pepper to taste ADVERTISEMENT",
            "1 pound fresh green beans, trimmed ADVERTISEMENT",
            "1 teaspoon butter ADVERTISEMENT",
            "1/3 cup sliced almonds ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 pinch cayenne pepper, or more to taste ADVERTISEMENT",
            "2 ounces crumbled blue cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Line a baking dish with aluminum foil.\nCut top 1/3 off garlic heads, exposing the cloves. Place garlic in the prepared baking dish cut side up. Pour olive oil over the garlic and season with salt. Fold up foil and seal to create a tight packet.\nBake in the preheated oven until a paring knife inserts easily into the center of a garlic clove, about 1 hour; set aside to cool. Once cool, remove each garlic clove from the skin. Reserve remaining olive oil.\nIncrease oven temperature to 400 degrees F (200 degrees C).\nBring a large pot of salted water to a boil; add green beans and cook until bright green and nearly tender, 4 to 6 minutes. Drain beans and transfer to a large bowl of ice water to cool completely; drain well and set aside.\nMelt butter in a large skillet over medium heat. Add almonds; cook and stir until lightly browned, 3 to 4 minutes.\nToss green beans, roasted garlic and reserved olive oil, toasted almonds, and 1 tablespoon olive oil together in a large bowl; season with cayenne pepper, salt, and black pepper. Transfer to a shallow baking dish and top with blue cheese.7\nBake until cheese is melted and beans are fully tender, about 15 minutes.\n",
        "picture_link": "YhsNWlQHVu48YL4/.Whvv9PzTHS73Ju"
    },
    {
        "title": "Meat and Veggie Stromboli",
        "ingredients": [
            "1 (1 pound) loaf frozen bread dough, thawed ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "2 egg yolks ADVERTISEMENT",
            "1 teaspoon dried parsley ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "5 slices pepperoni ADVERTISEMENT",
            "5 slices Virginia baked ham ADVERTISEMENT",
            "5 slices provolone cheese ADVERTISEMENT",
            "2 teaspoons vegetable oil, or as needed ADVERTISEMENT",
            "1/4 cup chopped green bell pepper ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "1/4 cup sliced fresh mushrooms ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "1 teaspoon grated Parmesan cheese ADVERTISEMENT",
            "1/4 teaspoon Italian seasoning ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place thawed bread dough in a bowl in a warm area and let rise until doubled in size, 30 to 60 minutes.\nPreheat oven to 350 degrees F (175 degrees C). Grease a baking sheet.\nSpread dough into a large rectangle on the prepared baking sheet.\nMix 2 tablespoons Parmesan cheese, 2 tablespoons vegetable oil, egg yolks, parsley, oregano, garlic powder, and black pepper together in a bowl; spread mixture onto dough. Top Parmesan mixture layer with pepperoni, ham, and provolone cheese.\nHeat 2 teaspoons vegetable oil in a skillet over medium heat; cook and stir green bell pepper, onion, and mushrooms in the hot oil until tender, 5 to 10 minutes. Spoon mixture over provolone layer.\nRoll dough around the filling and place stromboli, seam side-down, onto the baking sheet. Brush the top of stromboli with egg whites; sprinkle 1 teaspoon Parmesan cheese and Italian seasoning over stromboli.\nBake in the preheated oven until dough is golden brown, 30 to 40 minutes.\n",
        "picture_link": "t/kU0T4VgUI5SYCWn4IOXnjQzujR/Yq"
    },
    {
        "title": "Cucumbers with Dressing",
        "ingredients": [
            "1 cup mayonnaise ADVERTISEMENT",
            "1/4 cup vinegar ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "4 cups sliced cucumbers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir mayonnaise, vinegar, sugar, and salt together in a large bowl until smooth; fold sliced cucumbers into the mayonnaise mixture. Cover bowl with plastic wrap and refrigerate at least 2 hours. Serve chilled.\n",
        "picture_link": "Zxstu7SlUIGJf31vvKD94836JxMb/ju"
    },
    {
        "title": "Beefy Lasagna Roll-Ups",
        "ingredients": [
            "6 lasagna noodles ADVERTISEMENT",
            "1 pound extra-lean ground beef ADVERTISEMENT",
            "1 small onion, finely diced ADVERTISEMENT",
            "1 (28 ounce) jar pasta sauce ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1/2 teaspoon dried parsley ADVERTISEMENT",
            "1/2 teaspoon dried chives ADVERTISEMENT",
            "1/8 teaspoon dried oregano ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "2 cups shredded yellow and white marbled Cheddar cheese, divided ADVERTISEMENT",
            "1 (8 ounce) package light cream cheese, softened ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of lightly salted water to a boil. Cook lasagna noodles in the boiling water, stirring occasionally until cooked through, about 8 minutes. Drain and pat noodles dry with paper towels.\nBrown ground beef and onion in a large skillet over medium heat, breaking the meat into crumbles as it cooks, about 10 minutes. Pour pasta sauce into beef mixture and stir garlic powder, basil, parsley, chives, oregano, and nutmeg into beef and sauce.\nSpread half of the beef sauce into a 2-quart casserole dish and sprinkle with 1 cup Cheddar cheese.\nLay a lasagna noodle out onto a lightly floured work surface and spread with 2 tablespoons cream cheese. Spread 2 tablespoons ground beef sauce onto noodle; roll noodle and place with seam side down atop cheese in casserole dish. Repeat with remaining noodles. Sprinkle remaining beef sauce and 1 cup Cheddar cheese over noodle rolls.\nBake in the preheated oven until cheese and sauce bubble, 10 to 15 minutes.\n",
        "picture_link": "OZVjwk.FF1e3.tnOW/nGsMQSSJ1WBhq"
    },
    {
        "title": "Avocado Banana and Walnut Muffins",
        "ingredients": [
            "1/2 cup mashed Avocado from Mexico ADVERTISEMENT",
            "1/2 cup mashed ripe bananas ADVERTISEMENT",
            "2 large eggs ADVERTISEMENT",
            "1/2 cup low-fat milk ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "3/4 cup sugar ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 375 degrees F. Grease 12 muffin tin wells or line with paper cups.\nIn a large bowl, mix avocado, bananas, eggs and milk. In a separate bowl, whisk or sift together flour, sugar, baking soda and salt. Stir into avocado mixture; do not over-mix. Stir in walnuts.\nSpoon batter into prepared muffin tin; bake 15 to 20 minutes or until tops start to brown and a toothpick inserted into a muffin comes out clean.\n",
        "picture_link": "U/zbZS8vu7ca0pCssL4Cj3SvAZQh1WS"
    },
    {
        "title": "Classic Spicy Meatloaf",
        "ingredients": [
            "2 tablespoons unsalted butter ADVERTISEMENT",
            "1 cup finely chopped onion ADVERTISEMENT",
            "1/2 cup finely chopped green onions ADVERTISEMENT",
            "1 carrot, finely chopped ADVERTISEMENT",
            "1 rib celery, finely chopped ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "2/3 cup ketchup, divided ADVERTISEMENT",
            "2 teaspoons Worcestershire sauce ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 1/2 teaspoons ground black pepper ADVERTISEMENT",
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "3/4 pound spicy ground pork sausage ADVERTISEMENT",
            "1 cup bread crumbs ADVERTISEMENT",
            "1/3 cup minced fresh parsley ADVERTISEMENT",
            "2 large eggs, slightly beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nHeat butter in a large heavy skillet over medium heat; cook and stir onion, green onions, carrot, celery, and garlic until fragrant, about 5 minutes. Cover skillet with a lid and cook, stirring occasionally, until carrot is tender, about 5 more minutes. Stir 1/3 cup ketchup, Worcestershire sauce, salt, and pepper into vegetable mixture; cook until warmed through, about 1 minute.\nMix ground beef, sausage, vegetable mixture, bread crumbs, parsley, and eggs in a large bowl; form into a loaf and place in a rectangular baking pan with 2-inch high sides. Cover loaf with remaining 1/3 cup ketchup.\nBake in the preheated oven until no longer pink in the center, about 1 hour. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C).\n",
        "picture_link": "XThN5tK15C2IYNzgl9yzap3W/T8qY6q"
    },
    {
        "title": "Gluten-Free Double Chocolate Cookies",
        "ingredients": [
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1/2 cup cocoa powder ADVERTISEMENT",
            "1/4 cup rice flour ADVERTISEMENT",
            "1/4 cup tapioca flour ADVERTISEMENT",
            "1/4 cup sorghum flour ADVERTISEMENT",
            "1/4 cup chestnut flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon xanthan gum ADVERTISEMENT",
            "4 ounces chocolate chips ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 teaspoon gluten-free vanilla extract ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "4 ounces chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Line a baking sheet with parchment paper or a silicon baking mat.\nMix white sugar, cocoa powder, rice flour, tapioca flour, sorghum flour, chestnut flour, baking soda, salt, and xanthan gum together in a large bowl.\nMelt 4 ounces chocolate chips, with butter and vanilla extract in the top of a double boiler over simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching. Remove from heat.\nStir eggs into the flour mixture; slowly pour melted chocolate mixture into flour mixture. Stir until incorporated. Fold 4 ounces chocolate chips into the batter.\nDrop batter roughly in a ball shape, 1 tablespoon per cookie, onto the prepared baking sheet, keeping balls 2 inches apart.\nBake in the preheated oven until cookies are spread and top surface is slightly cracked, 12 to 15 minutes. Cool on the pan for 10 minutes before removing to cool completely on a wire rack to allow cookies to set.\n",
        "picture_link": "WbeGGymEHZvVgX5doMtqqM5tFj0I.UO"
    },
    {
        "title": "Carrot and Cranberry Muffins",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 cup whole wheat flour ADVERTISEMENT",
            "1 tablespoon chia seeds ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon ground ginger ADVERTISEMENT",
            "1/2 cup unsalted butter, room temperature ADVERTISEMENT",
            "1/2 cup brown sugar, or to taste ADVERTISEMENT",
            "1/4 cup white sugar, or to taste ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 banana ADVERTISEMENT",
            "2 cups grated carrots ADVERTISEMENT",
            "1 tablespoon grated orange zest ADVERTISEMENT",
            "3/4 cup cranberries, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Line 12 muffin cups with paper liners.\nMix all-purpose flour, whole wheat flour, chia seeds, baking powder, salt, cinnamon, nutmeg, and ginger together in a large bowl.\nBeat butter, brown sugar, and white sugar together with an electric mixer in a large bowl until light and fluffy. Beat egg into the butter mixture. Mash banana into the butter mixture until smoothly incorporated. Fold carrot and orange zest into the mixture.\nMix flour mixture into the butter mixture about 1/2 cup at a time to make a batter. Fold cranberries into the batter. Divide evenly between prepared muffin cups to fill nearly to the top.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 20 to 30 minutes. Cool in the pans for 5 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "Z5MHBhKdoRlbgwFCOK9eNdl9GprAShe"
    },
    {
        "title": "Haldi Ka Doodh (Hot Turmeric Milk)",
        "ingredients": [
            "1/4 teaspoon ground turmeric, or to taste ADVERTISEMENT",
            "1/4 teaspoon ground cardamom ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "1 pinch ground ginger ADVERTISEMENT",
            "1 pinch ground cloves ADVERTISEMENT",
            "1 pinch ground allspice ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "3/4 teaspoon honey, or to taste ADVERTISEMENT",
            "1/8 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk turmeric, cardamom, black pepper, ginger, cloves, and allspice together in a small bowl.\nHeat milk in a small saucepan over medium heat until heated through, 3 to 4 minutes; stir honey and vanilla extract into milk until completely dissolved. Whisk 1 teaspoon turmeric mixture into milk mixture; reduce heat to medium-low and cook until flavors blend, 2 to 3 minutes. Pour mixture through a strainer.\n",
        "picture_link": "UKGxrCvyXrxYD88uhym7jn3tSNzuq9W"
    },
    {
        "title": "Amazing Mexican Quinoa Salad",
        "ingredients": [
            "2 cups cooked quinoa ADVERTISEMENT",
            "1 (15 ounce) can pinto beans, rinsed and drained ADVERTISEMENT",
            "1 (15 ounce) can kidney beans, rinsed and drained ADVERTISEMENT",
            "1 (14 ounce) can corn ADVERTISEMENT",
            "1 red onion, chopped ADVERTISEMENT",
            "1 cup cooked brown rice ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "Dressing: ADVERTISEMENT",
            "3/4 cup olive oil ADVERTISEMENT",
            "1/3 cup red wine vinegar ADVERTISEMENT",
            "1 tablespoon chili powder, or to taste ADVERTISEMENT",
            "2 cloves garlic, mashed ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix quinoa, pinto beans, kidney beans, corn, red onion, brown rice, red bell pepper, and cilantro together in a glass or plastic container with a lid.\nWhisk olive oil, vinegar, chili powder, garlic, salt, black pepper, and cayenne pepper together in a bowl; pour over quinoa mixture and toss to coat. Cover bowl with a lid and refrigerate until flavors blend, at least 2 hours. Stir again before serving.\n",
        "picture_link": ".8Pqx9zpe1we5oj/K.r3OcAWT7HkD6a"
    },
    {
        "title": "Asian Turkey Burgers",
        "ingredients": [
            "1 pound lean ground turkey ADVERTISEMENT",
            "1/2 cup finely chopped onion ADVERTISEMENT",
            "1/3 cup chopped water chestnuts ADVERTISEMENT",
            "2 tablespoons chopped green bell pepper (optional) ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon dried parsley ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1 tablespoon cold water ADVERTISEMENT",
            "2 teaspoons minced fresh ginger root ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium-high heat and lightly oil the grate.\nMix ground turkey, onion, water chestnuts, bell pepper, garlic, parsley, soy sauce, water, ginger, salt, and pepper in a bowl; shape into 4 patties.\nCook the turkey burgers on the preheated grill until no longer pink in the center and the juices run clear, about 4 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "uSQb4YigHNrW2ZcHz7epnTBx0HcfPkC"
    },
    {
        "title": "Quiche with Kale, Tomato, and Leek",
        "ingredients": [
            "1 cup chopped kale ADVERTISEMENT",
            "1 small leek, white and light green parts only, sliced ADVERTISEMENT",
            "4 ounces halved cherry tomatoes ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "4 ounces shredded Italian cheese blend ADVERTISEMENT",
            "1 sprig fresh rosemary, finely chopped ADVERTISEMENT",
            "1 pinch sea salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "1 tablespoon grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease an 8-inch pie dish.\nPlace a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add kale, cover, and steam until tender, 3 to 5 minutes. Remove from heat and place in prepared pie dish; add sliced leek and cherry tomatoes.\nBeat eggs in a bowl; stir in milk and shredded Italian cheese blend, followed by rosemary, sea salt, and ground black pepper.\nPour the egg mixture into the pie dish. Stir gently until egg mixture and kale mixture are evenly combined.\nBake quiche in preheated oven until the center has set, about 30 minutes. Remove from oven and top with grated Parmesan. Continue baking until quiche is lightly browned on top, about 20 more minutes. Remove from oven and enjoy!\n",
        "picture_link": "n77/.Rqqq8H9hBmEQssLUT5jfpPpphO"
    },
    {
        "title": "Green Beans",
        "ingredients": [
            "2 (14.5 ounce) cans green beans, drained ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/2 pound bacon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nPut green beans in a baking dish. Mix butter, brown sugar, and garlic powder together in a bowl; pour over green beans. Arrange bacon strips atop the beans.\nBake in preheated oven until the bacon is cooked and the green beans are tender, about 30 minutes.\n",
        "picture_link": "WBgir9iqlNsUkSVgmi69XL7KHj/BOBa"
    },
    {
        "title": "Caribbean-Spiced Pork Side Ribs",
        "ingredients": [
            "2 tablespoons brown sugar ADVERTISEMENT",
            "2 teaspoons fresh ginger root, grated ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1/4 teaspoon ground clove ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "2 teaspoons black pepper ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 limes, zested and juiced ADVERTISEMENT",
            "1 cup orange juice ADVERTISEMENT",
            "1 rack pork spareribs, cut in half ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix together the brown sugar, ginger, cayenne, clove, cinnamon, paprika, oregano, pepper, salt, and lime zest; set aside. Squeeze the limes, and add the juice to the orange juice. Rub the ribs well with the spice mixture. Place into a glass baking dish, and pour in the juice.\nCover the dish, and bake in preheated oven for 90 minutes. Uncover, then continue cooking until nicely colored, 20 to 30 minutes more. Brush the ribs with the pan juices a few times while they are cooking.\n",
        "picture_link": "2lKToZbVQDw1VAOspoIXSQn7s8nN0MO"
    },
    {
        "title": "Absolutely Delicious Baked Root Vegetables",
        "ingredients": [
            "1 pound new potatoes, halved ADVERTISEMENT",
            "1/2 large rutabaga, peeled and cubed ADVERTISEMENT",
            "1 large sweet potato, peeled and cubed ADVERTISEMENT",
            "2 large parsnips, peeled and cubed ADVERTISEMENT",
            "2 large carrots, peeled and cubed ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "3 tablespoons sweet red chili sauce ADVERTISEMENT",
            "1 1/2 teaspoons onion powder ADVERTISEMENT",
            "1 1/2 teaspoons garlic powder ADVERTISEMENT",
            "1 tablespoon steak seasoning ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nToss potatoes, rutabaga, sweet potato, parsnips, and carrots with olive oil and chili sauce in a large bowl until coated. Season with onion powder, garlic powder, grill seasoning, and pepper. Toss again until evenly coated, then spread vegetables into a 9x13 inch roasting pan.\nRoast vegetables in preheated oven for 20 minutes, then stir, return to oven, and continue cooking until the vegetables are tender, about 20 minutes more.\n",
        "picture_link": ".WZaJCjREnOXzWAVu7TYti6eMGLE/6a"
    },
    {
        "title": "The Ultimate Burger Topping",
        "ingredients": [
            "5 strips bacon ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 cup onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup light mayonnaise (such as Hellmann's Light®) ADVERTISEMENT",
            "1/2 cup crumbled blue cheese ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook the bacon in a large, deep skillet over medium-high heat until evenly browned, about 10 minutes; drain on a plate lined with paper towels. Crumble the bacon once cooled enough to handle.\nHeat the olive oil in a skillet over medium heat; cook and stir the onion and garlic in the hot oil until translucent, about 5 minutes; transfer to a bowl. Add the crumbled bacon, light mayonnaise, blue cheese, and black pepper to the onion and garlic; stir to combine.\n",
        "picture_link": "HEy2rOIF9D3FS2UXo8SNGizIkJ569iS"
    },
    {
        "title": "Lover's Loaf",
        "ingredients": [
            "1 (10 ounce) bag washed spinach leaves ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 pound ground pork ADVERTISEMENT",
            "3 large eggs, lightly beaten ADVERTISEMENT",
            "1 1/4 cups bread crumbs ADVERTISEMENT",
            "1 cup grated Romano or Parmesan cheese ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "6 slices provolone cheese ADVERTISEMENT",
            "6 slices prosciutto or ham, thinly sliced ADVERTISEMENT",
            "all-purpose flour for dusting ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 cups red wine ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nPlace spinach in a microwave safe bowl with a splash of water. Cover, and microwave until the spinach has wilted, about 5 minutes. Drain and allow to cool.\nIn a large bowl, mix together beef, pork, eggs, bread crumbs, and Romano cheese. Season with salt and pepper. Divide into two equal portions, and roll each into balls.\nPlace a 15-inch long piece of plastic wrap on your work surface and lightly sprinkle with flour. Place one of the balls onto the plastic wrap and pat into a thin, 8-inch by 10-inch rectangle. Cover evenly with half of the spinach and 3 slices of prosciutto, then shingle three slices of provolone running along the edge facing you.\nUsing the plastic wrap to lift the meat, roll the loaf starting from the cheese side into a firmly packed spiral, peeling away the plastic wrap as you go. Make a second loaf with remaining ingredients.\nTo bake, pour wine into a broiler pan bottom. Oil the slotted top with some of the olive oil before placing the loaves on and brushing them with remaining oil. Cover loaves with a sheet of aluminum foil and bake in preheated oven for 40 minutes.\nRemove the foil and pour water into the pan. Continue baking for another 35 minutes, until the internal temperature reaches 160 degrees F (72 degrees C). Allow to rest 10 minutes before slicing into 1-inch thick slices to serve.\n",
        "picture_link": "8SLMvykEaGgLACuwm01gjXU66WA3Byu"
    },
    {
        "title": "Greek Shrimp Dish From Santorini",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "2 tablespoons garlic, minced ADVERTISEMENT",
            "1 bunch flat-leaf parsley, chopped ADVERTISEMENT",
            "2 pints grape tomatoes, halved ADVERTISEMENT",
            "1/2 (750 milliliter) bottle dry white wine ADVERTISEMENT",
            "2 pounds peeled and deveined medium shrimp ADVERTISEMENT",
            "1 (4 ounce) container crumbled feta cheese ADVERTISEMENT",
            "2 lemons, halved ADVERTISEMENT",
            "2 sprigs fresh flat-leaf parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a saucepan over medium heat. Stir in the garlic, chopped parsley, tomatoes, and wine. Bring to a simmer, then reduce heat to medium-low, and cook for 1 hour, stirring occasionally, until the sauce has slightly thickened.\nPreheat oven to 250 degrees F (120 degrees C).\nStir the shrimp into the tomato sauce, and cook for 2 minutes; remove from the heat. Pour the shrimp mixture into a shallow baking dish, and sprinkle with crumbled feta cheese. Bake in the preheated oven until the feta has softened and the shrimp are no longer translucent, 45 minutes to 1 hour. Squeeze the lemon halves over the shrimp and garnish with the parsley sprigs to serve.\n",
        "picture_link": "7Kbpq3r/e8KUR3rAM0KZ1moVNGAnl7m"
    },
    {
        "title": "The Devil's Own Deviled Eggs",
        "ingredients": [
            "12 eggs ADVERTISEMENT",
            "1 jalapeno pepper, minced ADVERTISEMENT",
            "1 habanero peppers, seeded and minced ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "1 teaspoon yellow mustard ADVERTISEMENT",
            "1/8 teaspoon paprika ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the eggs into a saucepan in a single layer, and fill with water to cover the eggs by at least 1 inch. Bring the water to a boil over high heat. Cover, and remove from the heat; let the eggs stand in the hot water for 15 minutes. Pour out the hot water, then cool the eggs under cold running water in the sink. Peel.\nCut the cooled eggs in half lengthwise. Remove the yolks, and place them into a mixing bowl along with the jalapeno, habanero, mayonnaise, and mustard; mash together until smooth. Transfer the yolk mixture to a pastry bag, and decoratively squeeze into the white halves. Sprinkle with paprika to garnish.\n",
        "picture_link": "gQUZCpyzej.nbi4q6SmDGDKqVF7hR/a"
    },
    {
        "title": "Pepperoni Dip",
        "ingredients": [
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "8 ounces sour cream ADVERTISEMENT",
            "2 (8 ounce) packages sliced pepperoni, quartered ADVERTISEMENT",
            "2 (4 ounce) cans chopped green chilies ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nStir the cream cheese, sour cream, pepperoni, and green chiles together in a baking dish.\nBake in the preheated oven until thoroughly heated, about 30 minutes.\n",
        "picture_link": "dLgUXCjUYF9gfKGS4jRhk2fxEyoKA66"
    },
    {
        "title": "Cheese-Garlic Biscuits",
        "ingredients": [
            "2 cups Original Bisquick® mix ADVERTISEMENT",
            "2/3 cup milk ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "2 tablespoons butter or margarine ADVERTISEMENT",
            "1/8 teaspoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 450 degrees F.\nStir Bisquick mix, milk and cheese until soft dough forms. Drop dough by 9 spoonfuls onto ungreased cookie sheet.\nBake 8 to 10 minutes or until golden brown. Stir together butter and garlic powder; brush over warm biscuits.\n",
        "picture_link": "NvmEBaZBrugdbF3nBq8hsh4kwY1Gg7C"
    },
    {
        "title": "Miso Braised Pork",
        "ingredients": [
            "1 tablespoon canola oil ADVERTISEMENT",
            "5 pounds pork butt (shoulder roast) cut into 2-inch slices ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "1 teaspoon minced ginger ADVERTISEMENT",
            "2 cups water, more if needed ADVERTISEMENT",
            "1/3 cup soy sauce ADVERTISEMENT",
            "1/3 cup brown sugar ADVERTISEMENT",
            "3/4 cup white (shiro) miso ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat canola oil in a large Dutch oven over medium-high heat until hot. Sear pork slices until well browned on both sides, then remove. Stir in the garlic and ginger, cook until fragrant, about 30 seconds. Add the water, soy sauce, brown sugar, and miso; bring to a simmer, scraping the bottom of the pan to dissolve the caramelized juices.\nPlace pork into pot, add additional water if needed to cover pork with the sauce. Then, reduce heat to medium-low, cover, and simmer for 3 hours until the pork is tender, and the sauce has thickened.\n",
        "picture_link": "K/gmIX0a2nTLE6PjhmzQyYL9/LLzp2q"
    },
    {
        "title": "Jicama Appetizer",
        "ingredients": [
            "1 jicama, peeled and cut into bite-sized pieces ADVERTISEMENT",
            "2 tablespoons fresh lime juice ADVERTISEMENT",
            "2 tablespoons chili powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Arrange the jicama on a platter. Sprinkle the lime juice and chili powder over the jicama. Serve immediately.\n",
        "picture_link": "otn9JSzuCEoSAPpb.DQqGMI/uw8OxpS"
    },
    {
        "title": "Chicken and Red Bell Pepper Salad Sandwiches",
        "ingredients": [
            "2 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1/2 red bell pepper, seeded ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "1 tablespoon heavy cream ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "4 slices white bread ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of water to a boil; add chicken and cook until no longer pink in the center and the juices run clear, about 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Drain, cool and chop.\nBring a small pot of water to a boil; add the bell pepper and cook until soft, about 10 minutes.\nCombine the bell pepper, chicken, cream, and mayonnaise in a food processor. Blend until mostly smooth. Season with salt and pepper. Spread about half of the mixture on each of two slices of bread and sandwich with the remaining bread.\n",
        "picture_link": "JubJ75Oe9Yi9OZ897ZCHWCCoJqiaEsO"
    },
    {
        "title": "Pasta With Shrimp, Oysters, and Crabmeat",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "3 tablespoons minced garlic ADVERTISEMENT",
            "1 1/4 cups chopped fresh parsley ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "1 pinch crushed red pepper ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 (16 ounce) package bow tie pasta ADVERTISEMENT",
            "2 (10 ounce) containers shucked small oysters, drained ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 1/4 pounds peeled and deveined small shrimp ADVERTISEMENT",
            "1 pound fresh lump crabmeat ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt 1/2 cup butter and 1/2 cup olive oil together in a saucepan over medium heat. Stir in the garlic, and cook until fragrant, about 3 minutes. Stir in the 1 1/4 cups of parsley, and cook for 1 minute more. Season with lemon juice, crushed red pepper, salt, and pepper; set aside.\nBring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nMeanwhile, bring a few cups of water to a boil in a saucepan over high heat. Stir in the oysters and turn off the heat. Allow the oysters to stand for 3 minutes, then drain and set aside. Melt 1/4 cup butter and 1 tablespoon olive oil together in a large skillet over medium-high heat. Stir in the shrimp, and cook until they turn pink and begin to firm. Add the crab meat and drained oysters; continue cooking until the shrimp have turned opaque in the center, and the crab is hot.\nToss the seafood with the drained pasta, and season to taste with salt and pepper. Pour in the sauce, and toss gently to coat. Sprinkle with remaining 1/4 cup of chopped parsley before serving.\n",
        "picture_link": "g2oeghyGI2OjbBKDDQg6X05hzuHC2bm"
    },
    {
        "title": "Roasted Garlic and Eggplant Soup",
        "ingredients": [
            "1 bulb garlic ADVERTISEMENT",
            "1/4 teaspoon olive oil ADVERTISEMENT",
            "1 (1 1/2 pound) eggplant ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/4 cup finely chopped onion ADVERTISEMENT",
            "6 cups chicken broth ADVERTISEMENT",
            "3/4 cup tomato puree ADVERTISEMENT",
            "1 dash cayenne pepper ADVERTISEMENT",
            "1 1/4 cups half-and-half ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with foil.\nPeel away any excess paper from the bulb of garlic, then cut the top off to expose the cloves. Rub exposed cloves with 1/4 teaspoon olive oil, and set onto the prepared baking sheet. Poke the eggplant all over with a fork; place onto baking sheet.\nBake in preheated oven until the garlic has turned golden brown and the eggplant is tender, 30 to 40 minutes. Allow to cool until cool enough to handle. Peel eggplant and chop into large chunks; peel or squeeze the roasted garlic from its skin, and set aside.\nHeat 1 tablespoon olive oil in a large saucepan over medium heat. Stir in onion, and cook until soft and translucent, about 5 minutes. Pour in chicken broth, then stir in reserved eggplant, roasted garlic, tomato puree, and cayenne pepper. Bring to a boil over medium-high heat, then reduce heat to medium-low, cover, and simmer for 40 minutes.\nOnce cooked, carefully puree soup in batches in a blender or food processor until smooth. Return soup to the stove in a clean saucepan. Stir in half-and-half, season to taste with salt and pepper; cook over medium-low heat until hot.\n",
        "picture_link": "WE7FoDruPKE69kVSXwMvgh1SrS0M/42"
    },
    {
        "title": "Grandma Jensen's Nuts and Bolts",
        "ingredients": [
            "2 cups bite-size wheat square cereal (such as Wheat Chex®) ADVERTISEMENT",
            "2 cups bite-size corn square cereal (such as Corn Chex®) ADVERTISEMENT",
            "2 cups bite-size rice square cereal (such as Rice Chex®) ADVERTISEMENT",
            "2 cups toasted oat cereal rings (such as Cheerios®) ADVERTISEMENT",
            "2 cups cheese-flavored crackers (such as Cheez-It®) ADVERTISEMENT",
            "2 cups pretzels ADVERTISEMENT",
            "2 cups mixed nuts ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "2 1/2 teaspoons garlic powder ADVERTISEMENT",
            "3 tablespoons Worcestershire sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 225 degrees F (110 degrees C). Combine the wheat cereal, corn cereal, rice cereal, oat cereal, cheese-flavored crackers, pretzels, and mixed nuts in a large bowl; set aside.\nMelt the butter in a saucepan over medium heat. Whisk in the garlic powder and Worcestershire sauce until evenly blended. Pour over the cereal mixture, and gently stir until the cereal is evenly coated with the seasoned butter. Spread the cereal mixture onto baking sheets.\nBake in the preheated oven for 1 hour, stirring every 15 minutes. Allow to cool to room temperature before storing in an airtight container.\n",
        "picture_link": "xf3zrdWRgOWgNNRdIWUBWLd/K8W0zEG"
    },
    {
        "title": "Ham and Brussels Sprout Bake",
        "ingredients": [
            "20 Brussels sprouts, halved ADVERTISEMENT",
            "1 cup cubed ham ADVERTISEMENT",
            "1 cup sliced fresh mushrooms ADVERTISEMENT",
            "3 finely chopped green onions (white portion only) ADVERTISEMENT",
            "1 tablespoon grated Parmesan cheese ADVERTISEMENT",
            "1 tablespoon grated Asiago cheese ADVERTISEMENT",
            "1/2 cup sauerkraut, drained ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "1 tablespoon fresh lemon juice ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "2 teaspoons dried basil ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 tablespoon Italian-style bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nToss together the Brussels sprouts, ham, mushrooms, green onion, Parmesan cheese, Asiago Cheese, and sauerkraut in a large bowl until combined. Add the olive oil, lemon juice, garlic, basil, and pepper; toss until coated. Pour this mixture into a 2 quart baking dish and sprinkle with bread crumbs.\nBake in preheated oven until the Brussels sprouts are tender, about 45 minutes.\n",
        "picture_link": "9wV7O.cyySG5/.xemXJOKEi7bmo5Saq"
    },
    {
        "title": "Aji de Gallina",
        "ingredients": [
            "2 pounds skinless, bone-in chicken breast halves ADVERTISEMENT",
            "1 onion, coarsely chopped ADVERTISEMENT",
            "2 carrots, chopped ADVERTISEMENT",
            "2 cloves garlic ADVERTISEMENT",
            "2 quarts water ADVERTISEMENT",
            "1 loaf white bread, crusts removed and cubed ADVERTISEMENT",
            "1 (12 fluid ounce) can evaporated milk ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1/4 cup walnut pieces ADVERTISEMENT",
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 teaspoons aji amarillo chile paste ADVERTISEMENT",
            "2 teaspoons ground turmeric ADVERTISEMENT",
            "4 hard-cooked eggs, sliced ADVERTISEMENT",
            "1/4 cup kalamata olives, pitted and quartered ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken breasts, onion, carrot, and 2 cloves garlic in a large saucepan, pour in 2 quarts of water and slowly bring to a simmer over medium-high heat. Skim off the foam which forms on top, then cover, reduce heat to medium-low, and simmer until the chicken is tender, about 30 minutes. Remove chicken to a plate and allow to cool. Strain the resulting chicken stock, discarding the vegetables.\nPour evaporated milk and 1/2 cup chicken stock into the bowl of a blender. Add bread cubes and puree until smooth. Add Parmesan cheese and walnuts; puree until smooth. Shred the cooled chicken and discard the bones.\nHeat vegetable oil in a large saucepan over medium heat. Stir in minced garlic and minced onion; cook until the onion has softened and turned translucent, about 5 minutes. Stir in shredded chicken and aji amarillo until heated through. Pour in bread puree and cook until hot, stirring frequently. Add more chicken stock if needed to keep from getting too thick. Season with turmeric and simmer for 5 minutes more.\nServe garnished with hard-cooked egg slices and sprinkled with kalamata olives.\n",
        "picture_link": "FWiv3U1k3fzDtLkCj.k9nzg.YzVYygq"
    },
    {
        "title": "Marinated Pork Medallions with a Ginger-Apple Compote",
        "ingredients": [
            "2 cups balsamic vinegar ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "1 tablespoon chopped fresh thyme ADVERTISEMENT",
            "1 cup olive oil ADVERTISEMENT",
            "1 pork tenderloin, cut into 2 inch pieces ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/4 cup packed brown sugar ADVERTISEMENT",
            "1 apple, thinly sliced ADVERTISEMENT",
            "1/4 cup dried cherries ADVERTISEMENT",
            "1 tablespoon minced fresh ginger root ADVERTISEMENT",
            "1 pinch ground cinnamon ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Puree the balsamic vinegar, garlic, and thyme in a blender until mixed. With the blender running, slowly pour in the olive oil until thickened and incorporated. Pour the marinade into a resealable plastic bag. Add the pork pieces, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator for 30 minutes.\nPreheat an outdoor grill for medium heat, and lightly oil the grate. Remove the pork from the marinade, and shake off excess. Discard the remaining marinade.\nCook the pork on the preheated grill until no longer pink in the center, about 10 minutes. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C). Once cooked, remove from the grill, cover with aluminum foil, and allow to rest for 5 to 10 minutes before slicing.\nWhile the pork is cooking, melt the butter in a saucepan over medium heat. Stir in the brown sugar until it begins to simmer. Add the apples, cherries, ginger, cinnamon, and nutmeg. Cook and stir until the apple is tender, about 5 minutes. Serve the sliced pork topped with the apple compote.\n",
        "picture_link": "0RS.P4T7e2npa2i.lMvVTl4H6ID9rem"
    },
    {
        "title": "Chicken with Buttery Lemon Cream Sauce",
        "ingredients": [
            "Marinade: ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "2 teaspoons lemon pepper ADVERTISEMENT",
            "2 teaspoons Italian seasoning ADVERTISEMENT",
            "salt and pepper ADVERTISEMENT",
            "Lemon Cream Sauce: ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 large yellow onion, minced ADVERTISEMENT",
            "1/4 cup white wine ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken breasts in a oven proof baking dish. Squeeze the juice of one lemon over the chicken, and season with lemon pepper, Italian seasoning, and salt and pepper. Cover with plastic wrap, and marinate in the refrigerator for 2 hours or overnight.\nPreheat an oven to 350 degrees F (175 degrees C).\nMelt butter in large saucepan over medium-high heat. Add onions and white wine; cook and stir until the onions are soft. Lower the heat to medium; whisk in the flour. Gradually whisk heavy cream into the flour mixture. Stir in the milk and remaining lemon juice. Pour the cream sauce directly over the chicken breasts in the baking dish.\nCover baking dish with aluminum foil. Cook the chicken breasts until no longer pink in the center and the juices run clear, about 30 to 40 minutes. An instant-read thermometer inserted into the center of a chicken piece should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "8hAXfrrhiAer8RtZjn0nmmKb5NVqbdC"
    },
    {
        "title": "Three Cheese Green Salad",
        "ingredients": [
            "1 large head leaf lettuce - rinsed, dried and torn into bite-size pieces ADVERTISEMENT",
            "1 cup cubed Swiss cheese ADVERTISEMENT",
            "1 cup crumbled feta cheese ADVERTISEMENT",
            "1 cup shredded Parmesan cheese ADVERTISEMENT",
            "1 cup toasted pecan pieces ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "1/2 cup white balsamic vinegar ADVERTISEMENT",
            "1 tablespoon Italian seasoning ADVERTISEMENT",
            "1 tablespoon freshly ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine lettuce, Swiss cheese, feta cheese, Parmesan cheese and pecans in a large bowl. In a small bowl, whisk together oil, vinegar, Italian seasoning, and pepper. Add dressing to salad and toss well.\n",
        "picture_link": "jUE2q6Azjx8qhMv7uM6fDF0zxXw9IgW"
    },
    {
        "title": "Quick Egg Roll Dipping Sauce",
        "ingredients": [
            "3 tablespoons soy sauce ADVERTISEMENT",
            "3 tablespoons rice vinegar ADVERTISEMENT",
            "1/8 teaspoon sesame oil ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together soy sauce, rice vinegar, sesame oil, ginger, garlic powder, and onion powder until smooth. Distribute in small dipping dishes.\n",
        "picture_link": "bF5/sQdpRQ2vpWfeBr1WjnMydIrb0u6"
    },
    {
        "title": "Stir Fried Asparagus",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "1/4 sweet onion, chopped ADVERTISEMENT",
            "1 pound fresh asparagus, trimmed ADVERTISEMENT",
            "1 teaspoon chopped roasted garlic ADVERTISEMENT",
            "2 teaspoons teriyaki sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large skillet over medium heat. Saute onions until tender. Stir in asparagus and garlic; saute for 3 to 5 minutes, or until slightly cooked and heated through.\nDrizzle with teriyaki sauce and serve immediately.\n",
        "picture_link": "3RXmZcPmTYJbZT5eGBpyv6d36OVfubC"
    },
    {
        "title": "Plum and Ginger Chicken",
        "ingredients": [
            "1 cup uncooked long grain white rice ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "2/3 cup plum sauce ADVERTISEMENT",
            "1/2 cup light corn syrup ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "4 packets chicken bouillon granules ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves - cut into bite-size pieces ADVERTISEMENT",
            "4 tablespoons cornstarch ADVERTISEMENT",
            "3/4 teaspoon minced fresh ginger root ADVERTISEMENT",
            "2 cups snow peas, trimmed ADVERTISEMENT",
            "1 cup sliced fresh mushrooms ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring the rice and water to a boil in a pot. Cover, reduce heat to low, and simmer 20 minutes.\nMix the plum sauce, corn syrup, soy sauce, garlic, and bouillon in a small bowl.\nHeat oil in a skillet over medium heat. Coat the chicken in cornstarch, and cook 5 minutes in the skillet, or until juices run clear. Mix in ginger, snow peas, and mushrooms, and continue cooking until tender. Stir in the plum sauce mixture. Cook until heated through.\n",
        "picture_link": "uV3kNEQy2V13dLet8vZRhDoF2xsIJ8i"
    },
    {
        "title": "Chicken, Rice, and Green Bean Casserole",
        "ingredients": [
            "1 (6 ounce) package wild rice (such as Uncle Ben's ®) ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast meat - cut into chunks ADVERTISEMENT",
            "1 (14.5 ounce) can French-cut green beans, drained ADVERTISEMENT",
            "1 (10.75 ounce) can cream of mushroom soup ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C).\nBring the wild rice and water to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the rice is tender but not mushy, 20 to 25 minutes. Drain off any excess liquid, fluff the rice with a fork, and cook uncovered 5 minutes more.\nWhile the rice cooks, heat the oil in a pan over medium heat. Add the chicken and cook until completely browned on all sides, about 5 minutes. Combine the rice, chicken, green beans, mushroom soup, and mayonnaise in a large baking dish.\nBake in the preheated oven until the chicken is no longer pink in the center, about 45 minutes.\n",
        "picture_link": "pcPpMG14TJ7cM7HI05Sk2bqC6SjYr6e"
    },
    {
        "title": "Almond Cream-Puff Ring",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 (3.4 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "1 1/4 cups milk ADVERTISEMENT",
            "1 cup heavy cream, whipped ADVERTISEMENT",
            "1 teaspoon almond extract ADVERTISEMENT",
            "1/2 cup semi-sweet chocolate chips ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 1/2 teaspoons milk ADVERTISEMENT",
            "1 1/2 teaspoons light corn syrup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease and flour a cookie sheet, or use parchment paper. Using a dinner plate as a guide, trace a circle on the sheet.\nIn 2 quart saucepan over medium heat, combine water, butter, and salt. Bring to a boil. With a wooden spoon, vigorously stir in flour all at once, until mixture forms a ball, and leaves the sides of the pan. Remove from heat, and beat in the eggs one at a time, until mixture is smooth. Drop batter into 10 mounds inside the circle traced on the cookie sheet, to form a ring.\nBake in preheated oven for 40 minutes, or until golden brown. Turn off oven, leaving ring in for another 15 minutes. Remove from oven, and cool on wire rack. When cool, slice in half horizontally, and place bottom ring on serving plate. Spoon Almond Cream Filling on bottom ring, then replace top ring. Chill in refrigerator.\nTo make Almond Cream Filling: Prepare pudding according to instructions on package, but use only 1 1/4 cups milk. Fold in whipped cream, and 1 teaspoon almond extract.\nTo make Chocolate Glaze: In a double boiler over hot (not boiling) water, combine chocolate chips, 1 tablespoon butter, 1 1/2 teaspoons milk, and 1 1/2 teaspoons corn syrup. Heat until melted and smooth, stirring occasionally. Spoon over the top of chilled ring.\n",
        "picture_link": "SdTAH4AYIdRBaJgaYQKE3lgRIL4ZYYu"
    },
    {
        "title": "Low Carb Cheesecake",
        "ingredients": [
            "1 (8 ounce) package fat-free cream cheese ADVERTISEMENT",
            "1 (15 ounce) container part-skim ricotta cheese ADVERTISEMENT",
            "1/2 cup fat-free sour cream ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1/2 cup granular sucrolose sweetener (such as Splenda®) ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 325 degrees F (165 degrees C). Grease a 9 inch pie plate.\nIn a medium bowl, mix together the cream cheese, ricotta cheese, sour cream and egg whites until smooth. Stir together the flour and sugar substitute; mix into the cheese batter along with vanilla. Pour into the prepared pie plate and smooth the top.\nBake for 60 minutes in the preheated oven, or until the top is nicely browned. Cool completely before slicing and serving.\n",
        "picture_link": "JpQ3TE3sXsG3rAvpSNmt935pnf6XKkG"
    },
    {
        "title": "Vegan Carrot Soup",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 large onion, diced ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "4 large carrots, sliced ADVERTISEMENT",
            "5 new potatoes, quartered ADVERTISEMENT",
            "2 cups vegetable broth ADVERTISEMENT",
            "2 teaspoons grated fresh ginger ADVERTISEMENT",
            "1 teaspoon curry powder ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a soup pot over medium heat. Add onion and garlic, and cook stirring often until onion is translucent. Add carrots and potatoes, and cook for just a few minutes to allow the carrots to sweat out some of their juices.\nPour the vegetable broth into the pot, and season with ginger, curry powder, salt and pepper. Bring to a boil, then reduce heat to low. Simmer for 15 to 20 minutes, until carrots are tender.\nPuree soup in small batches using a food processor or blender, or if you have an immersion blender, it can be done in the soup pot. Reheat soup if necessary, and serve.\n",
        "picture_link": "VmE40NbQ6ODcsLua9VOeisbyf/Xo7HG"
    },
    {
        "title": "Nut Burgers (Vegetarian)",
        "ingredients": [
            "1/2 cup finely chopped walnuts ADVERTISEMENT",
            "1/2 cup unsalted sunflower seeds ADVERTISEMENT",
            "1 cup canned chickpeas, drained ADVERTISEMENT",
            "1/4 cup diced red onion ADVERTISEMENT",
            "1 beaten egg ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "1/4 teaspoon fresh ground black pepper ADVERTISEMENT",
            "1 tablespoon salt-free herb seasoning blend ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 slices mild Cheddar cheese ADVERTISEMENT",
            "1 pita bread round ADVERTISEMENT",
            "1/4 cup prepared Ranch salad dressing ADVERTISEMENT",
            "2 leaves romaine lettuce ADVERTISEMENT",
            "1 medium tomato, thinly sliced ADVERTISEMENT",
            "1/2 avocado - peeled, pitted and sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place walnuts and sunflower seeds in a dry skillet over medium heat. Cook, stirring occasionally until lightly toasted and fragrant, about 5 minutes.\nIn a medium bowl, mash garbanzo beans with a fork, or chop in a food processor. Stir in the onion, egg, parsley, and toasted nuts. Season with pepper and seasoning blend, and mix well.\nHeat olive oil in a skillet over medium heat. Divide the bean mixture into 2 patties, and fry in the hot oil for about 3 minutes on each side, or until well browned and heated through. Place a slice of cheese over each patty, and remove from heat.\nPlace the pita round in the same dry skillet the nuts were in, and heat for about 1 minute on each side. Cut the round in half, spread ranch dressing inside of each, and line the pockets with romaine leaves. Place a cheesy patty into each one, and top with sliced tomato and avocado. Serve with tortilla or potato chips.\n",
        "picture_link": "RnPXIvR59NUjbqyPZH.zfCFA5bfN4FG"
    },
    {
        "title": "Fabulous Pesto Pasta Salad",
        "ingredients": [
            "1 1/2 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon salt, or to taste ADVERTISEMENT",
            "1 1/2 teaspoons ground black pepper ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1 1/2 teaspoons Dijon mustard ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "1 1/2 cups chopped fresh basil ADVERTISEMENT",
            "1/2 cup chopped fresh oregano ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "2 teaspoons hot pepper sauce (e.g. Tabasco™) ADVERTISEMENT",
            "1/3 cup red wine vinegar ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1 (4 ounce) package grated Parmesan cheese ADVERTISEMENT",
            "4 roma (plum) tomatoes, chopped ADVERTISEMENT",
            "6 green onions, chopped ADVERTISEMENT",
            "1 (4 ounce) can minced black olives ADVERTISEMENT",
            "1 (16 ounce) package farfalle (bow tie) pasta ADVERTISEMENT",
            "1/2 cup pine nuts ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, whisk together the sugar, salt, pepper, onion powder, mustard, garlic, basil, oregano, cilantro, hot pepper sauce, red wine vinegar, olive oil, lemon juice, and Parmesan cheese. Add the tomatoes, green onions and olives to the bowl, and stir to coat. Refrigerate.\nBring a large pot of lightly salted water to a boil. Add the pasta, and cook for 7 minutes, or until tender. Drain, and rinse with cold water to cool. Add pasta to the bowl of dressing, and mix well. Top with mozzarella cheese and pine nuts. Refrigerate for at least 1 hour before serving.\n",
        "picture_link": "HeHIjCkWP3o2pLCJPjKeeT6uqiF6wHy"
    },
    {
        "title": "Carrot Souffle with Brown Sugar",
        "ingredients": [
            "2 pounds carrots, peeled and chopped ADVERTISEMENT",
            "1/2 cup margarine ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "3/4 cup brown sugar ADVERTISEMENT",
            "1/4 cup flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "3/4 teaspoon baking soda ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBring a stockpot of salted water to a boil. Cook carrots until tender, 10 to 15 minutes. Remove from heat, and drain well.\nPlace carrots in a food processor with the margarine, and pulse to puree. Add the eggs, brown sugar, flour, baking powder, and baking soda, and process until smooth.\nPour carrot mixture into a 1quart, round baking dish. Place the dish inside a larger dish with 1 inch of water to prevent burning bottom of casserole.\nBake, uncovered, in the preheated oven for 1 hour, or until firm.\n",
        "picture_link": "gxy14.uZPEbsG3YlKti6VSMh55xAtNu"
    },
    {
        "title": "Oven Stew with Burgundy Wine",
        "ingredients": [
            "2 pounds cubed beef stew meat ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "4 carrots, sliced ADVERTISEMENT",
            "2 stalks celery, sliced ADVERTISEMENT",
            "2 onions, sliced ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "1 teaspoon ground dry mustard ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "3 cubes beef bouillon, crumbled ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 cup Burgundy wine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCook the beef on the stove over medium heat in a large, ovenproof pot or roaster until brown. Remove from heat and stir in flour until cubes are coated. Stir in carrots, celery and onions. Season with salt, thyme, mustard, pepper and bouillon. Finally, pour in water and wine. Cover.\nBake in preheated oven 4 hours. Serve hot.\n",
        "picture_link": "wvnW4MmloGgymBjzvGsNqYYMCBlxL3C"
    },
    {
        "title": "Beanie-Weenie",
        "ingredients": [
            "1 (16 ounce) package hot dogs , cut into 1/4-inch slices ADVERTISEMENT",
            "1 (28 ounce) can baked beans with pork ADVERTISEMENT",
            "2/3 cup ketchup ADVERTISEMENT",
            "2 tablespoons cider vinegar ADVERTISEMENT",
            "1/4 cup Worcestershire sauce ADVERTISEMENT",
            "1 1/2 teaspoons garlic powder ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet, combine the hot dogs, baked beans, ketchup, cider vinegar, Worcestershire sauce, garlic powder and parsley. Mix to blend, and bring to a boil. Turn heat to low, cover, and simmer for 25 to 30 minutes, stirring occasionally.\n",
        "picture_link": "lXEfTqNGz7Tk1PLzOvaFwPPayMqrpkq"
    },
    {
        "title": "Cubed Steak and Wild Rice",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1 pound cube steak, cut into bite size pieces ADVERTISEMENT",
            "1 (4.5 ounce) package long grain and wild rice mix ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "5 fresh mushrooms, sliced ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "2 tablespoons garlic powder ADVERTISEMENT",
            "1 tablespoon onion powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a skillet over medium heat, melt the butter, and saute the cube steak until evenly browned.\nIn a medium pot, mix the cooked steak and juices, rice, water, mushrooms, Worcestershire sauce, garlic powder, and onion powder. Bring to boil. Reduce heat to low, and simmer 25 minutes, or until all liquid has been absorbed.\n",
        "picture_link": "IXlbH1wVvBEVWmhbSwh7Mlba/4trVie"
    },
    {
        "title": "Zucchini and Cheese",
        "ingredients": [
            "2 tablespoons unsalted butter ADVERTISEMENT",
            "1 large zucchini, chopped ADVERTISEMENT",
            "1 large white onion, chopped ADVERTISEMENT",
            "4 tomatoes, chopped ADVERTISEMENT",
            "1 large green bell pepper, chopped ADVERTISEMENT",
            "dried Italian seasoning to taste ADVERTISEMENT",
            "1 (8 ounce) package shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a medium casserole dish.\nMelt the butter in a skillet over medium heat. Stir in the zucchini and onion, and cook 5 minutes, or until onion is golden brown.\nIn the prepared casserole dish, mix the zucchini, onion, tomatoes, and green pepper. Season with Italian seasoning, and top with cheese.\nBake 25 minutes in the preheated oven, or until cheese is melted and bubbly.\n",
        "picture_link": "LYly9k4qj1ZqEeCC6Su.gfu61HxLzQe"
    },
    {
        "title": "Crawfish and Corn Soup",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 medium onion, chopped ADVERTISEMENT",
            "1/4 cup chopped green onion ADVERTISEMENT",
            "4 cups milk ADVERTISEMENT",
            "2 (15 ounce) cans cream-style corn ADVERTISEMENT",
            "1 (15 ounce) can whole kernel corn ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of potato soup ADVERTISEMENT",
            "1/4 teaspoon Creole seasoning ADVERTISEMENT",
            "1/2 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1 dash pepper sauce (such as Frank's Red Hot®) ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 pound crawfish, peeled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large pot over low heat, and stir in flour. Cook, stirring constantly to make a light roux, about 5 minutes.\nAdd onions, and cook until wilted. Pour in milk, creamed corn, whole kernel corn, and cream of potato soup. Season with Creole seasoning, Worcestershire sauce, pepper sauce, and salt. Stir to blend, and cook over medium heat for 20 minutes. Add the crawfish, and cook for 20 more minutes.\n",
        "picture_link": "5lgaABpyw9aSqSviIRdLTi9J1V78ieG"
    },
    {
        "title": "Old Fashioned Fudge",
        "ingredients": [
            "1/2 cup unsweetened cocoa powder ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 tablespoon light corn syrup ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan, stir together the cocoa powder, sugar and salt. Mix in corn syrup, and milk until well blended. Add butter, and heat to between 234 and 240 degrees F (112 to 116 degrees C), or until a small amount of syrup dropped into cold water forms a soft ball that flattens when removed from the water and placed on a flat surface. Stir occasionally.\nRemove from heat, and beat with a wooden spoon until the mixture is thick and loses its gloss. Stir in vanilla, and pour into a buttered 9x9 inch baking dish. Let cool until set. Cut into small squares to serve.\n",
        "picture_link": "IUh9zt3ZU.yDdcpiRyL9OE19foTTjgm"
    },
    {
        "title": "Coconut-Lime Sorbet",
        "ingredients": [
            "1 (15 ounce) can cream of coconut ADVERTISEMENT",
            "1/2 cup fresh lime juice ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the cream of coconut, lime juice, and water in the container of an ice cream maker. Freeze according to manufacturer's instructions.\n",
        "picture_link": "yuqbHtlFDo/LUes.9tM2WRpxCTdNFGW"
    },
    {
        "title": "Hot and Sour Tofu Soup (Suan La Dofu Tang)",
        "ingredients": [
            "4 cups vegetable broth ADVERTISEMENT",
            "1 (12 ounce) package silken tofu, diced ADVERTISEMENT",
            "2 green onions, chopped ADVERTISEMENT",
            "1 eggs, beaten ADVERTISEMENT",
            "1 portobello mushroom, halved and sliced ADVERTISEMENT",
            "2 cups chopped cabbage ADVERTISEMENT",
            "1 tablespoon Thai chile sauce ADVERTISEMENT",
            "1 tablespoon rice vinegar ADVERTISEMENT",
            "3 tablespoons soy sauce ADVERTISEMENT",
            "1 teaspoon citric acid powder (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Measure broth into a saucepan, and bring to a simmer over medium-low heat. Add tofu and green onions. Slowly drizzle in the beaten egg to make long strands of egg. Add mushrooms and cabbage, and simmer for 5 minutes. Remove from heat, and season with chili sauce, vinegar and soy sauce. Stir in citric acid if using.\n",
        "picture_link": "j1AXK7wKBFxlnBYl9UBuZ8UnrpwcXVW"
    },
    {
        "title": "Zulandt's Lentil Casserole",
        "ingredients": [
            "2 3/4 cups water ADVERTISEMENT",
            "3 cubes vegetable bouillon ADVERTISEMENT",
            "1 1/2 cups brown rice ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 medium zucchini, chopped ADVERTISEMENT",
            "1 white onion, chopped ADVERTISEMENT",
            "1 1/2 tablespoons cumin ADVERTISEMENT",
            "2 teaspoons dried oregano ADVERTISEMENT",
            "2 cups dry brown lentils ADVERTISEMENT",
            "6 cups water ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 (8 ounce) package sharp Cheddar cheese, grated and divided ADVERTISEMENT",
            "3/4 cup bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan, bring water and bouillon cubes to a boil. Add rice and stir. Reduce heat, cover and simmer for 50 minutes, or until rice is tender and all liquid has been absorbed.\nHeat oil in a stockpot over medium-high heat. Cook zucchini and onion until tender, but still slightly firm, about 5 minutes. Stir in cumin, oregano, lentils, and about 6 cups water gradually. Bring to a soft boil, and continue cooking until lentils are tender, 45 to 60 minutes, adding water as needed.\nPreheat oven to 375 degrees F (190 degrees C).\nMix the cooked rice together with the lentils, and season to taste with salt and pepper. Stir in 3/4 of the Cheddar cheese, and transfer mixture into a 9x13 inch pan. Mix remaining cheese together with the breadcrumbs, and spread evenly over the top of the dish.\nBake in the preheated oven just until cheese has melted, about 10 minutes.\n",
        "picture_link": "R4bf1DykQHKTgQ83gnNfRsSLsN8VLta"
    },
    {
        "title": "Celery and Carrot Soup",
        "ingredients": [
            "2 tablespoons extra virgin olive oil ADVERTISEMENT",
            "1 small onion, minced ADVERTISEMENT",
            "1 small carrot, peeled and thinly sliced ADVERTISEMENT",
            "1 celery rib, thinly sliced ADVERTISEMENT",
            "1/2 teaspoon dried tarragon ADVERTISEMENT",
            "2 cups vegetable broth ADVERTISEMENT",
            "1/2 cup dry white wine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a medium saucepan over medium-high heat. Saute onions until tender, approximately 5 minutes. Slowly stir in carrots, celery, and tarragon, and continue cooking another 5 minutes, or until carrots are tender.\nStir in vegetable broth and wine, and bring to a boil. Reduce to a simmer, and continue cooking 15 minutes longer. Serve hot.\n",
        "picture_link": "k9cXxQ9XW/VCaNSnRb8ayw9Ilpa.ABK"
    },
    {
        "title": "Southern Style Holiday Greens",
        "ingredients": [
            "3 bunches fresh mustard greens ADVERTISEMENT",
            "3 bunches fresh turnip greens ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/2 cup dill pickle juice ADVERTISEMENT",
            "5 slices bacon ADVERTISEMENT",
            "1/3 cup sliced onion ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse the mustard and turnip greens thoroughly to remove gritty dirt, and place in a 12 quart pot with 8 cups of water. Add the butter, pickle juice, bacon and onion, and bring to a rolling boil.\nContinue cooking at a full boil for 20 minutes, then reduce the heat to low, and simmer for an additional 30 minutes, until tender. Taste and season with salt and pepper.\n",
        "picture_link": "ECEuJfWptPN1nm92pVI1CW7cvmlgQbW"
    },
    {
        "title": "Quick Shrimp Lo Mein",
        "ingredients": [
            "1 (8 ounce) package angel hair pasta ADVERTISEMENT",
            "1 teaspoon sesame oil ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "1 tablespoon oyster sauce ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 pound medium shrimp - peeled, deveined, and cut into 1/2-inch pieces ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "3/4 cup sliced green bell pepper ADVERTISEMENT",
            "3/4 cup chopped celery ADVERTISEMENT",
            "3/4 cup broccoli florets ADVERTISEMENT",
            "3/4 cup snap peas ADVERTISEMENT",
            "1/2 cup onion slices ADVERTISEMENT",
            "1/2 cup shredded cabbage ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook angel hair in the boiling water until cooked through yet firm to the bite, 4 to 5 minutes; drain. Toss with sesame oil in a bowl to coat.\nMix water, soy sauce, cornstarch, oyster sauce, and ground ginger into a sauce a small bowl.\nHeat 1 tablespoon vegetable oil in a large skillet or wok over medium-high heat. Cook and stir shrimp in hot oil until pink, 2 to 3 minutes. Remove shrimp from skillet to a bowl and return pan to heat.\nHeat remaining 1 tablespoon vegetable oil in the pan. Cook and stir bell pepper, celery, broccoli, snap peas, onion, cabbage, and garlic in oil until slightly tender, about 5 minutes. Pour prepared sauce over vegetable mixture; stirring continually, bring to a simmer and cook until slightly thickened, 30 to 45 seconds. Return shrimp to the pan; cook 1 minute more. Add drained pasta; toss to coat.\n",
        "picture_link": "Ew6et9YMH3pIkBmcbpijFBIi3D/NcAa"
    },
    {
        "title": "4-Bean Baked Beans",
        "ingredients": [
            "1 (15 ounce) can kidney beans, drained ADVERTISEMENT",
            "1 (15 ounce) can butter beans, drained ADVERTISEMENT",
            "1 (15 ounce) can lima beans, drained ADVERTISEMENT",
            "1 (16 ounce) can pork and beans, drained ADVERTISEMENT",
            "1/2 pound bacon, cut into small pieces ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "3/4 cup brown sugar ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "1/2 cup vinegar ADVERTISEMENT",
            "1/4 cup molasses ADVERTISEMENT",
            "1 teaspoon dry mustard ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace kidney beans, butter beans, lima beans, and pork and beans in a 2-quart casserole dish.\nHeat a saucepan over medium heat; cook and stir bacon, onion, and garlic until bacon is browned, about 10 minutes. Pour off excess fat.\nWhisk brown sugar, ketchup, vinegar, molasses, and mustard into bacon mixture; simmer until cooked through, about 20 minutes. Pour sauce over beans in the casserole dish.\nBake in the preheated oven until bubbling, 1 hour 15 minutes.\n",
        "picture_link": "3HrMiaGFIytZBxHbD5lkL447tUtj1sC"
    },
    {
        "title": "Lucy's Quick Tonkatsu Sauce",
        "ingredients": [
            "1/2 cup ketchup ADVERTISEMENT",
            "2 1/2 tablespoons reduced-sodium soy sauce ADVERTISEMENT",
            "2 1/2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1 1/2 tablespoons dry sherry ADVERTISEMENT",
            "1 1/2 tablespoons white sugar ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the ketchup, soy sauce, Worcestershire sauce, sherry, sugar, garlic powder, and ginger in a microwave-safe coffee mug or glass measuring cup. Stir well with a fork and microwave on high for 1 minute. Stir again and set aside.\nLet stand for 1 hour to allow the flavors to incorporate.\n",
        "picture_link": "fruo2057hWLMC5kEWkHCIp43DgP0oy2"
    },
    {
        "title": "Currant Scones",
        "ingredients": [
            "3/4 cup dried currants ADVERTISEMENT",
            "4 3/4 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "3/4 teaspoon baking soda ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 1/4 teaspoons salt ADVERTISEMENT",
            "1 cup chilled unsalted butter, cut into 1/2-inch cubes ADVERTISEMENT",
            "1 tablespoon chilled unsalted butter, cut into 1/2-inch cubes ADVERTISEMENT",
            "1 1/2 cups buttermilk ADVERTISEMENT",
            "1 teaspoon lemon zest ADVERTISEMENT",
            "2 tablespoons melted butter ADVERTISEMENT",
            "1/4 cup coarse sugar crystals ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with parchment paper.\nCover currants with warm water in a bowl and set aside to moisten.\nSift flour, baking powder, and baking soda in the bowl of a stand mixer. Using the paddle attachment at low speed, mix white sugar and salt into the flour mixture. Add all the unsalted butter to the mixer bowl and mix on low speed until butter cubes reduce to the size of small peas, about 30 seconds.\nDrain currants and discard soaking water; mix currants, buttermilk, and lemon zest into the flour mixture on low speed just until the dough starts to hold together.\nTurn dough out onto a lightly floured work surface and gently shape into a rectangle 18 inches long, 5 inches wide, and 1 1/2 inches thick. Brush dough with melted butter and sprinkle with sugar crystals.\nCut the dough in half crosswise with a sharp knife; cut each half into thirds, and cut each third diagonally to make 12 triangular-shaped scones. Place on the prepared baking sheet.\nBake in the preheated oven until scones are lightly golden brown, about 18 minutes. Eat warm.\n",
        "picture_link": "UcJhiMQUqMpaIRogzZsdi62d1UAibHK"
    },
    {
        "title": "Mock Chocolate Cookie Crust",
        "ingredients": [
            "1 1/4 cups white sugar ADVERTISEMENT",
            "2/3 cup all-purpose flour ADVERTISEMENT",
            "3/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nWhisk sugar, flour, cocoa powder, and salt together in a bowl until thoroughly combined. Pour melted butter into the mixture and stir to incorporate. Press dough into the bottom and up the sides of a 9-inch pie pan.\nBake crust in preheated oven until the sides are firm and the bottom bubbles slightly, about 10 minutes.\n",
        "picture_link": "1f8hi594MP9b1ZzaVP6oGDfUo/xBZdC"
    },
    {
        "title": "American French Onion Soup",
        "ingredients": [
            "1/4 cup unsalted butter ADVERTISEMENT",
            "6 large yellow onions, diced ADVERTISEMENT",
            "3 tablespoons dry sherry ADVERTISEMENT",
            "1 tablespoon sherry vinegar, or to taste ADVERTISEMENT",
            "4 cups chicken broth ADVERTISEMENT",
            "4 cups beef broth ADVERTISEMENT",
            "3 sprigs fresh thyme ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "6 slices French bread ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "1 cup shredded extra-sharp Cheddar cheese ADVERTISEMENT",
            "1 cup shredded Monterey Jack cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nMelt 1/4 cup butter in a large, oven-safe skillet on medium heat. Stir in onions until they are all coated in butter. Transfer skillet to the preheated oven and cook onions, stirring occasionally, until they are tender and well browned, about 1 hour.\nTransfer skillet to the stovetop; cook and stir onions over medium heat until they start to brown and stick to the bottom of the pan, about 5 minutes. Pour sherry and vinegar into the pan, and bring to a boil while scraping browned bits of onion off the bottom of the pan with a wooden spoon.\nPlace caramelized onions in a large soup pot. Pour in chicken broth, beef broth, and thyme. Bring to a boil, skimming off any foam and fat that appear on top. Reduce heat to low and simmer for about an hour. Season with salt and pepper to taste.\nPreheat the oven's broiler and set the oven rack about 6 inches from the heat source.\nGenerously brush French bread slices with melted butter. Place on a baking sheet and broil in the preheated oven until crisp and golden, about 5 minutes.\nLadle soup into heat-proof bowls, top each bowl with a piece of toasted bread, sprinkle with 2 to 3 tablespoons of Cheddar cheese and Monterey Jack cheese.\nBroil bowls of soup under the broiler until cheese is golden and bubbly, 5 to 6 minutes.\n",
        "picture_link": "DS8sUvYqFLe0Lh2Hww4WwIIAiz9lbIi"
    },
    {
        "title": "Classic Ham Glaze",
        "ingredients": [
            "1 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix brown sugar, orange juice, and honey together in a bowl until the brown sugar has dissolved.\n",
        "picture_link": "MYRxkPwffQ10tvlUYVF2z/3hEAYPbwq"
    },
    {
        "title": "Half Time Hoisin Chicken Wings",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1/2 cup hoisin sauce ADVERTISEMENT",
            "1/3 cup low sodium teriyaki sauce ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon grated fresh ginger ADVERTISEMENT",
            "1 tablespoon chile-garlic sauce, or to taste ADVERTISEMENT",
            "3 pounds chicken wings, cut apart at joints, wing tips discarded ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C).\nSpray a baking sheet with cooking spray.\nWhisk together hoisin sauce, teriyaki sauce, brown sugar, garlic, ginger, and chili-garlic sauce in a bowl.\nArrange chicken wing pieces on the prepared baking sheet.\nBrush chicken with hoisin sauce mixture.\nBake in the preheated oven until chicken wings are no longer pink in the center, 20 to 25 minutes on each side, basting every 15 minutes.\n",
        "picture_link": "Q5nKWdohjBFM4dV5ddXBDdoXWRqWb9y"
    },
    {
        "title": "Coco's Meatloaf",
        "ingredients": [
            "3/4 cup chopped yellow onion ADVERTISEMENT",
            "1/2 cup chopped green bell pepper ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1/4 cup ketchup ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 pounds ground beef ADVERTISEMENT",
            "2 cups crushed saltine crackers ADVERTISEMENT",
            "2 teaspoons kosher salt ADVERTISEMENT",
            "1 teaspoon dry mustard ADVERTISEMENT",
            "2 tablespoons ketchup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nCombine onion, green bell pepper, milk, 1/4 cup ketchup, and eggs in a blender and puree until smooth.\nStir ground beef, crushed saltine crackers, kosher salt, dry mustard in a large bowl. Add onion and egg mixture; stir to combine.\nTransfer beef mixture to a shallow baking dish and shape into a loaf. Drizzle top of the meatloaf with 2 tablespoons ketchup.\nBake in the preheated over for 45 minutes. Remove from oven and let meatloaf to rest uncovered for 15 minutes. Slice and serve.\n",
        "picture_link": "r6ZqXBIP6QUmj08hpG3w6.XfT0XyEVG"
    },
    {
        "title": "Easiest Falafel",
        "ingredients": [
            "1 (16 ounce) can garbanzo beans, drained ADVERTISEMENT",
            "1/4 cup panko bread crumbs, or as needed ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 tablespoons dried parsley ADVERTISEMENT",
            "1 tablespoon curry powder ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1/2 tablespoon ground black pepper ADVERTISEMENT",
            "1/4 cup panko bread crumbs, or as needed ADVERTISEMENT",
            "1 cup olive oil for frying, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place garbanzo beans, 1/4 cup panko bread crumbs, onion, 1/4 cup olive oil, egg, parsley, curry powder, garlic powder, lemon juice, and black pepper in a food processor or blender. Puree until coarse crumbles form. Blend more panko crumbs into mixture if it is too moist.\nRoll mixture into balls about the size of a golf ball; place on a plate.\nPress into patties and coat in panko bread crumbs.\nHeat about 1-inch olive oil in a skillet over medium heat.\nPan-fry patties until crispy, about 3 minutes on each side.\n",
        "picture_link": "xjpOZuQs.5yXfUANuLUse70cKHQh.xu"
    },
    {
        "title": "English Tea Cucumber Sandwiches",
        "ingredients": [
            "1 cucumber, peeled and thinly sliced ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon onion salt ADVERTISEMENT",
            "1 dash Worcestershire sauce ADVERTISEMENT",
            "1 (1 pound) loaf sliced bread, crusts removed ADVERTISEMENT",
            "1 pinch lemon pepper (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cucumber slices between 2 paper towels set in a colander. Allow liquid to drain, about 10 minutes.\nMix cream cheese, mayonnaise, garlic powder, onion salt, and Worcestershire sauce in a bowl until smooth.\nSpread cream cheese mixture evenly on one side of each bread slice.\nDivide cucumber slices over half of the bread slices; sprinkle lemon pepper on cucumber.\nStack the other half of the bread slices with spread sides down over the cucumber slices to make sandwiches.\n",
        "picture_link": "4ECxj3kchafMqjlewnhcC9NazCgIQCe"
    },
    {
        "title": "Butterscotch Pumpkin Pudding Cake",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 (18.25 ounce) package white cake mix ADVERTISEMENT",
            "1 cup canned pure pumpkin ADVERTISEMENT",
            "1 (3.4 ounce) package instant butterscotch pudding mix ADVERTISEMENT",
            "4 eggs, beaten ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1/4 cup canola oil ADVERTISEMENT",
            "2 teaspoons pumpkin pie spice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 250 degrees F (120 degrees C). Spray a 10-inch fluted tube pan (such as a Bundt(R)) with cooking spray.\nMix white cake mix, pumpkin, butterscotch pudding mix, eggs, water, canola oil, and pumpkin pie spice in a bowl until all ingredients are thoroughly combined and the batter is smooth. Pour batter into prepared cake pan.\nBake in the preheated oven until a toothpick inserted into the center of the cake comes out with moist crumbs, about 1 hour and 10 minutes. Let cake cool in the pan for 15 minutes before inverting onto a serving dish to remove cake from pan.\n",
        "picture_link": "X42zYUNMa2lJIFRAkwTT3IheHlVZ5WC"
    },
    {
        "title": "Quick Peach Cobbler ",
        "ingredients": [
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 cup self-rising flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 (28 ounce) can sliced peaches ADVERTISEMENT",
            "1 teaspoon almond extract ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Place butter in a 9x9-inch baking pan; melt in the preheating oven.\nMix flour, sugar, and milk together in bowl until smooth. Open peaches and add almond extract to the peaches and juice.\nPour peaches over melted butter in the 9x9-inch pan; spoon batter atop peaches without mixing. Sprinkle with cinnamon.\nBake in the preheated oven until bubbling and top is lightly browned, about 45 to 60 minutes.\n",
        "picture_link": "5v44pToFn5vGsmFYtx/cga67hBi3wJa"
    },
    {
        "title": "Cornell Chicken",
        "ingredients": [
            "2 cups cider vinegar ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "3 tablespoons salt ADVERTISEMENT",
            "1 tablespoon poultry seasoning ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 (3 to 3 1/2 pound) broiler-fryer chicken, cut in half ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the cider vinegar, oil, egg, salt, poultry seasoning, and black pepper in a blender. Cover, and puree until smooth.\nPour blended mixture into a resealable plastic bag. Add the chicken halves, coat with the marinade, squeeze out excess air, and seal the bag. Marinate in the refrigerator for at least 4 hours (up to overnight).\nRemove chicken halves from bag and transfer to a plate or baking sheet lined with paper towels. Pat chicken dry with more paper towels. Reserve marinade mixture.\nPreheat an outdoor grill for medium-high heat, and lightly oil the grate.\nGrill chicken, skin-side down, on the preheated grill for 2 minutes. Turn each piece, brush with marinade mixture, and move to indirect heat.\nGrill, brushing with glaze and turning often, until well-browned and meat is no longer pink in the center, about 45 minutes. An instant-read thermometer inserted into the thickest part of the thigh, near the bone, should read 180 degrees F (82 degrees C).\n",
        "picture_link": "gc538E5i.uz/q9rguIl5gJTGwZf81d."
    },
    {
        "title": "Cranberry and Almond Rice Pilaf ",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "3/4 cup chopped onions ADVERTISEMENT",
            "1/2 cup dried cranberries ADVERTISEMENT",
            "1 1/2 cups uncooked jasmine rice ADVERTISEMENT",
            "3 cups low-sodium chicken broth ADVERTISEMENT",
            "1 teaspoon kosher salt, or to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "2 green onions, chopped (optional) ADVERTISEMENT",
            "3 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "1/4 cup slivered almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large skillet or Dutch oven over medium heat. Cook and stir onion in hot oil until tender and translucent, about 5 minutes.\nStir cranberries and jasmine rice into onion until rice is coated with oil and rice is lightly toasted, about 5 minutes more.\nPour chicken broth into skillet and season with kosher salt and black pepper.\nBring rice mixture to a boil over high heat, then cover and reduce heat to low. Simmer until rice is tender and liquid is absorbed, about 22 minutes.\nRemove skillet from heat; stir green onions, cilantro, and almonds into rice mixture. Adjust seasoning if necessary.\n",
        "picture_link": "bEqAHxyqgiBiXqZ5CGsGDB0Xju1y7Su"
    },
    {
        "title": "Bacon Brownies",
        "ingredients": [
            "1/4 pound bacon, cut into 1/4-inch dice ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "1/2 cup melted butter ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "2 eggs, lightly beaten ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup cocoa powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease an 8-inch square baking dish.\nFry bacon in a skillet over medium-high heat until nearly crisp, about 5 minutes. Add honey and stir until the foaming subsides. Remove the bacon with a slotted spoon to a plate to cool.\nMix melted butter, brown sugar, white sugar, and vanilla extract in a large bowl; mix in eggs.\nSift flour, cocoa powder, and salt together in a bowl; add to the egg mixture. Fold bacon and chocolate chips into the mixture; pour into the prepared baking dish.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 25 to 35 minutes. Allow brownies to cool for 20 minutes before cutting into squares.\n",
        "picture_link": "AH5AnbLDk9ZAzr.FaiqKGcDzFoX6JEq"
    },
    {
        "title": "Cinnamon Sugar Crisps",
        "ingredients": [
            "32 (3.5 inch square) wonton wrappers ADVERTISEMENT",
            "1 1/2 tablespoons margarine, melted ADVERTISEMENT",
            "3 tablespoons cinnamon sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 400 degrees F (200 degrees C).\nLay the wonton wrappers out flat on a baking sheet. Brush evenly with melted margarine. Sprinkle 1/4 teaspoon of cinnamon sugar over the top of each one.\nBake for 5 minutes in the preheated oven, or until crisp. Remove from baking sheets to cool on wire racks.\n",
        "picture_link": "k3yAnEy5NJkWmTiGMcUDht/.OuojkkW"
    },
    {
        "title": "Chicken with Sausage and Dried Fruit",
        "ingredients": [
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 (6 inch) smoked turkey sausage link, sliced ADVERTISEMENT",
            "1 green bell pepper, seeded and chopped ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "3/4 cup chopped dried apples ADVERTISEMENT",
            "1/2 cup sweetened dried cranberries ADVERTISEMENT",
            "1 tablespoon dried parsley ADVERTISEMENT",
            "2 teaspoons dried chives ADVERTISEMENT",
            "1 cup chicken stock ADVERTISEMENT",
            "1 pinch salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the chicken breasts in the bottom of a slow cooker. They can still be frozen if you have those on hand. Layer the sausage, green pepper, onion, garlic, apples, and cranberries over the chicken. Sprinkle with parsley and chives. Pour the chicken stock over everything, and season with salt and pepper. Cover, and cook on Low for 8 to 9 hours.\n",
        "picture_link": "heCdBkwbEYxFOE/vAWKpfSFLxGIZ08e"
    },
    {
        "title": "Easy 'Charro' Beans",
        "ingredients": [
            "1/2 pound bacon strips ADVERTISEMENT",
            "1/2 cup bacon drippings ADVERTISEMENT",
            "1 large onion, finely chopped ADVERTISEMENT",
            "1/2 pound cooked ham, diced ADVERTISEMENT",
            "1/4 pound chorizo sausage, crumbled ADVERTISEMENT",
            "5 (16 ounce) cans pinto beans, rinsed and drained ADVERTISEMENT",
            "1 whole chipotle pepper ADVERTISEMENT",
            "2 cloves garlic, pricked with a fork ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fry bacon strips in a large skillet over medium heat until crisp. With a slotted spoon, remove bacon to paper towels. Reserve 1/2 cup bacon drippings.\nPlace drippings in a large pot, and warm over medium heat. Fry onions until light brown. Stir in ham and chorizo. Reserve 1 cup of beans, and add the rest to the pot, along with the chipotle and garlic.\nMash the reserved beans, then add to the pot. Simmer beans until thick and soupy, about 30 minutes. (If the beans become too dry, stir in water). Remove chipotle and garlic, and serve.\n",
        "picture_link": "u0cQ8IMsB9i//51CBsAtJR60kJJwZ9u"
    },
    {
        "title": "Grand Marnier Chicken",
        "ingredients": [
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 cup dry bread crumbs ADVERTISEMENT",
            "1 cup grated Parmesan cheese ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1 cup olive oil ADVERTISEMENT",
            "1 orange, sliced into rounds ADVERTISEMENT",
            "1 cup dry white wine ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "1 (10.5 ounce) can chicken broth ADVERTISEMENT",
            "1/4 cup brandy-based orange liqueur (such as Grand Marnier®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Slice chicken breasts in thirds horizontally to make 12 thin chicken fillets. Lightly pound each piece. Place in a dish, and pour milk over them. Soak for 10 minutes. In a shallow bowl, stir together the bread crumbs, Parmesan cheese and parsley. Set aside.\nHeat olive oil in a large heavy skillet over medium-high heat. Dredge chicken pieces in the bread crumb mixture, and place in the hot oil. Quickly brown on both sides, then remove to a buttered 9x13 inch baking dish, or similar size. Season with salt and pepper to taste. Place orange slices over the top of the chicken.\nPreheat the oven to 350 degrees F (175 degrees C). Drain the oil from the skillet, reserving 1/4 cup. Heat the reserved oil with the wine over medium heat until reduced by 1/2. Add broth and orange juice, and reduce by 1/2 again. Pour the sauce over the chicken, then drizzle with Grand Marinier.\nBake for 20 to 25 minutes in the preheated oven, until bubbly.\n",
        "picture_link": "Zz1KUYvlyjch6QuKDXqRxZalTljK/aC"
    },
    {
        "title": "Bacon Asparagus Pizza",
        "ingredients": [
            "5 thick slices bacon, cut into 1 inch pieces ADVERTISEMENT",
            "1 unbaked pizza crust ADVERTISEMENT",
            "1 pound shredded mozzarella cheese ADVERTISEMENT",
            "1 cup chopped fresh asparagus ADVERTISEMENT",
            "1 cup halved cherry or grape tomatoes ADVERTISEMENT",
            "1 (11 ounce) log fresh chevre (goat cheese) ADVERTISEMENT",
            "1 teaspoon red pepper flakes ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C).\nPlace bacon in a skillet over medium-high heat. Cook for a few minutes to release most of the grease, but do not cook until crisp. Remove to paper towels to drain.\nSpread the pizza crust out on a pizza pan or large baking sheet. Top with mozzarella cheese, bacon pieces, asparagus, and tomatoes. Dot with goat cheese, then season with red pepper flakes and black pepper.\nBake for 15 to 20 minutes in the preheated oven, until the crust is golden brown underneath when you lift it up to take a peek. Let cool for about 5 minutes before slicing and serving.\n",
        "picture_link": "BZXl9ELzVvl9hp3XkNw9oQQn.8GnSLO"
    },
    {
        "title": "Afghan Beef Raviolis (Mantwo)",
        "ingredients": [
            "3/4 cup plain yogurt ADVERTISEMENT",
            "1 teaspoon chopped fresh mint leaves ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 1/2 cups chopped onion ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 carrot, grated ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 1/2 teaspoons ground coriander ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "26 wonton wrappers ADVERTISEMENT",
            "1 tablespoon tomato paste ADVERTISEMENT",
            "1/8 teaspoon red pepper flakes ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1/2 cup dried yellow split peas ADVERTISEMENT",
            "1/8 teaspoon red pepper flakes ADVERTISEMENT",
            "1 teaspoon ground coriander ADVERTISEMENT",
            "1/4 teaspoon ground cumin ADVERTISEMENT",
            "1 cube chicken bouillon ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, stir together yogurt, mint, and garlic. Refrigerate.\nIn a large skillet over medium heat, cook ground beef and onions until meat is browned, stirring occasionally to crumble; drain fat. Stir in 1 cup water, carrot, salt, black pepper, 1 1/2 teaspoons coriander, and 1/2 teaspoon cumin; simmer uncovered for 30 minutes or until water evaporates.\nLay out wonton wrappers on aluminum foil. Mound two large spoonfuls of beef mixture in the center of one wrapper. Dip a finger in water and trace it around all four edges. Lay a second wonton wrapper on top of the first, and press on all edges to seal. Roll up the edges to create a round, hat-shaped ravioli. Repeat, making 13 ravioli.\nPlace ravioli in steamer and steam 40 minutes.\nMeanwhile, mix together the yellow split peas, 1/8 teaspoon red pepper flakes, 1 teaspoon coriander, 1/4 teaspoon cumin, chicken bouillon, and 1 1/2 cups of water in a saucepan. Bring to a boil, then simmer over medium-low heat for about 45 minutes, or until it reaches a thick slurry-like consistency.\nMeanwhile, in the large skillet, mix remaining beef mixture with 2 tablespoons water, tomato paste, and 1/8 teaspoon red pepper flakes. Simmer over low heat until liquid has evaporated, about 10 minutes.\nTo serve, spread yogurt on a serving plate. Top with ravioli, and top again with split pea mixture. Finally, top with tomato and beef mixture. Serve immediately.\n",
        "picture_link": "I.YJT51/UOxHZYOidBQrizW4NXLjmr."
    },
    {
        "title": "Honey Baked Apples",
        "ingredients": [
            "6 green apples ADVERTISEMENT",
            "1 1/2 cups fresh cranberries ADVERTISEMENT",
            "2 1/4 cups water ADVERTISEMENT",
            "3/4 cup packed brown sugar ADVERTISEMENT",
            "3 tablespoons honey ADVERTISEMENT",
            "6 scoops vanilla ice cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nCore the apples, and remove the peel from the top third of each one. Place them in a baking dish, and fill the core holes with as many cranberries as you can fit.\nMeanwhile, stir together the water, brown sugar and honey in a small saucepan. Bring to a boil, stirring occasionally to dissolve the sugar and honey if necessary. Once it comes to a boil, pour the mixture over the apples.\nBake for 1 hour in the preheated oven, basting with the juices every 15 to 20 minutes. Serve with vanilla ice cream.\n",
        "picture_link": "1kbXRyTXpmzIOMTI9BMZH1OpHY9Vnem"
    },
    {
        "title": "I Don't Know",
        "ingredients": [
            "7 small baking potatoes, peeled and sliced ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 (16 ounce) package frozen mixed vegetables, thawed ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). In a medium bowl, stir together the mixed vegetables and mushroom soup. Set aside.\nPlace the potatoes in a large saucepan with enough water to cover. Bring to a boil, then simmer over medium heat until tender, about 5 minutes. Drain and set aside.\nMeanwhile, crumble the ground beef into a large skillet over medium-high heat. Cook until evenly browned, stirring to break up large lumps. Drain excess grease from the beef and place in the bottom of a 9x13 inch baking dish. Pour the vegetable mixture over the beef, then arrange the potato slices over the vegetables. Season with salt and pepper. Sprinkle cheese over the top.\nBake uncovered for 25 minutes in the preheated oven, until cheese is melted and the dish is heated through and bubbly.\n",
        "picture_link": "f6C2/86Be568H4RBcRBB.KqVN2Z.JgO"
    },
    {
        "title": "Turkey and Hash Brown Casserole",
        "ingredients": [
            "1/4 cup oil for frying ADVERTISEMENT",
            "1 pound frozen hash brown potatoes, thawed ADVERTISEMENT",
            "1 pound ground turkey breast ADVERTISEMENT",
            "1 large onion, cut into chunks ADVERTISEMENT",
            "1 (10 ounce) package frozen broccoli, thawed ADVERTISEMENT",
            "1 (10.75 ounce) can reduced fat cream of mushroom soup ADVERTISEMENT",
            "1 cup reduced fat cream of celery soup ADVERTISEMENT",
            "1 cup shredded fat free Cheddar cheese ADVERTISEMENT",
            "1/3 cup skim milk ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "seasoned salt to taste ADVERTISEMENT",
            "1 medium tomato, diced (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease an 8x12 inch casserole dish.\nHeat oil in a skillet over medium heat and cook hash browns until golden. Spread hash browns over bottom and sides of casserole dish to form a crust. In a separate skillet over medium heat, cook turkey until lightly brown. Mix in onion and cook until tender. Place broccoli in a microwave safe bowl and cook in microwave 4 to 5 minutes on High, or until tender. Spread turkey, onion and broccoli over hash browns in the casserole dish.\nIn a bowl, mix cream of mushroom soup, cream of celery soup, Cheddar cheese, milk, garlic powder, pepper and seasoned salt. Pour over casserole.\nBake 25 minutes in the preheated oven, until bubbly. Garnish with chopped tomatoes to serve.\n",
        "picture_link": "nq9zFK3YpTurcRy6l/ba25ZvoG010mq"
    },
    {
        "title": "Shortcut Potato Onion Perogies",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2/3 cup water ADVERTISEMENT",
            "1 tablespoon extra virgin olive oil ADVERTISEMENT",
            "1 small yellow onion, diced ADVERTISEMENT",
            "1 (7.6 ounce) package instant mashed potato flakes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, stir together the flour and salt. Cut in the butter using a fork until pieces are very small. Stir in the water and mix until well blended. If the dough is too sticky, stir in a little more flour until you can knead it on a floured surface. Knead the dough for 2 to 3 minutes. Cover, and let rest for 10 or 15 minutes.\nOn a lightly floured surface, roll the dough out to 1/4 inch thickness. Cut into circles using a cookie cutter or large glass. Set aside while you prepare the filling.\nTo make the filling, prepare the mashed potato flakes according to package directions. Set aside. Heat the olive oil in a skillet over medium heat. Add the onions; cook and stir until soft and transparent. Remove from the heat, and mix in the mashed potatoes.\nPlace one tablespoon of the pierogi filling onto each circle of dough. Fold circles over and pinch the edges to seal tightly so that no filling will escape while they boil. They can be frozen at this time if you like.\nBring a large pot of water to a boil. Carefully drop several perogies into the water. They are done when they float to the top. Continue the process with remaining perogies. You can also fry the perogies in some butter with onion before serving if you like.\n",
        "picture_link": "EdyLVWjDE8kiJ0y2Yvw8o7gX6PWVRQe"
    },
    {
        "title": "Spicy Polynesian Wrap",
        "ingredients": [
            "2 pounds skinless, boneless chicken breast halves - cut into 1 inch strips ADVERTISEMENT",
            "1 (14 ounce) can coconut milk ADVERTISEMENT",
            "1 cup uncooked long grain white rice ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 tablespoons curry powder ADVERTISEMENT",
            "1 tablespoon garlic salt ADVERTISEMENT",
            "3/4 cup vegetable oil ADVERTISEMENT",
            "2 limes ADVERTISEMENT",
            "10 (10 inch) flour tortillas ADVERTISEMENT",
            "1/2 cup shredded coconut ADVERTISEMENT",
            "1/2 cup chopped green onions ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the chicken and coconut milk in a bowl, and marinate in the refrigerator 1 hour.\nIn a pot, bring the rice and water to a boil. Cover, reduce heat to low, and simmer 20 minutes.\nIn a small bowl, mix the flour, curry powder, and garlic salt. Drain the chicken, and discard marinade. Dredge chicken in the flour mixture to coat.\nHeat the oil in a skillet over medium heat, and cook the coated chicken strips 5 minutes per side, or until golden brown and juices run clear. Squeeze lime juice over chicken, and discard limes.\nOn each tortilla, place equal amounts of rice, chicken, coconut, and green onions. Wrap burrito style.\n",
        "picture_link": "wzKgcq1qmFWdGUJZXDDgxmzqyFWvXfa"
    },
    {
        "title": "D's Skillet Gravy",
        "ingredients": [
            "3 tablespoons beef drippings ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sprinkle flour over the beef drippings in a skillet over medium heat. Cook, stirring constantly, until smooth and brown. Gradually stir in the water so that no lumps form. Boil until thickened, about 10 minutes, stirring constantly. Season with salt and pepper.\n",
        "picture_link": "iuchfBADs0TX7zhxaLxFMisvGeQgccS"
    },
    {
        "title": "Red Apple Martini",
        "ingredients": [
            "1 (1.5 fluid ounce) jigger sour apple schnapps ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger Canadian whiskey ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger cranberry juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a drink shaker with ice, and pour in the sour apple schnapps, whiskey, and cranberry juice. Shake well, then strain into a martini glass.\n",
        "picture_link": "rLcPKoaZ1z.T9bZagXeoBE6yrKBthiG"
    },
    {
        "title": "Gulab Jamun",
        "ingredients": [
            "1 cup dry milk powder ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "2 tablespoons ghee (clarified butter), melted ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/2 cup warm milk ADVERTISEMENT",
            "1 tablespoon chopped almonds (optional) ADVERTISEMENT",
            "1 tablespoon chopped pistachio nuts (optional) ADVERTISEMENT",
            "1 tablespoon golden raisins (optional) ADVERTISEMENT",
            "1 pinch ground cardamom ADVERTISEMENT",
            "1 quart vegetable oil for deep frying ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "7 fluid ounces water ADVERTISEMENT",
            "1 teaspoon rose water ADVERTISEMENT",
            "1 pinch ground cardamom ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, stir together the milk powder, flour, baking powder, and cardamom. Stir in the almonds, pistachios and golden raisins. Mix in the melted ghee, then pour in the milk, and continue to mix until well blended. Cover and let rest for 20 minutes.\nIn a large skillet, stir together the sugar, water, rose water and a pinch of cardamom. Bring to a boil, and simmer for just a minute. Set aside.\nFill a large heavy skillet halfway with oil. Heat over medium heat for at least 5 minutes. Knead the dough, and form into about 20 small balls. Reduce the heat of the oil to low, and fry the balls in one or two batches. After about 5 minutes, they will start to float, and expand to twice their original size, but the color will not change much. After the jamun float, increase the heat to medium, and turn them frequently until light golden. Remove from the oil to paper towels using a slotted spoon, and allow to cool. Drain on paper towels and allow to cool slightly.\nPlace the balls into the skillet with the syrup. Simmer over medium heat for about 5 minutes, squeezing them gently to soak up the syrup. Serve immediately, or chill.\n",
        "picture_link": "sxFHEw3lSExXUru3b69klxR.aAEmLJW"
    },
    {
        "title": "Tuna Broccoli Roll Up Casserole",
        "ingredients": [
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 (9 ounce) can tuna, drained and flaked ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped broccoli, thawed ADVERTISEMENT",
            "1 cup shredded Cheddar cheese, divided ADVERTISEMENT",
            "1 (2.8 ounce) can French-fried onions ADVERTISEMENT",
            "6 (7 inch) flour tortillas ADVERTISEMENT",
            "1 medium tomato, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nIn a medium bowl, stir together the cream of mushroom soup and milk. Set aside. In another bowl, stir together the tuna, broccoli, 1/2 cup of Cheddar cheese and half of the French fried onions. Stir in 3/4 cup of the soup.\nDivide the tuna mixture evenly between the tortillas, and roll up. Place rolls seam side down in a lightly greased 9x13 inch baking dish. Pour the remaining soup over the rolls, and spread evenly using the back of a spoon. It will be a thin layer. Sprinkle the rest of the French fried onions over the soup, then the tomato, and finally the remaining Cheddar cheese. Cover with nonstick or lightly greased aluminum foil.\nBake for 30 minutes in the preheated oven. Remove the aluminum foil, and bake for 5 more minutes to allow the cheese to melt and brown slightly.\n",
        "picture_link": "Fc2NXiutY7EI.4f.hLxIORT5wyMP8R2"
    },
    {
        "title": "Heddy's Black and Red Bean Soup",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "2 stalks celery, chopped ADVERTISEMENT",
            "2 carrots, chopped ADVERTISEMENT",
            "6 cloves garlic, chopped ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "2 tablespoons chili powder, or to taste (optional) ADVERTISEMENT",
            "2 teaspoons maple syrup (optional) ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "4 cups vegetable broth ADVERTISEMENT",
            "2 (15 ounce) cans black beans, drained and rinsed ADVERTISEMENT",
            "2 (15.5 ounce) cans canned red beans, drained and rinsed ADVERTISEMENT",
            "1 (15 ounce) can whole kernel corn, with liquid ADVERTISEMENT",
            "1 (14.5 ounce) can crushed tomatoes, with liquid ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large pot over medium-high heat. Add the onion, celery, carrots and garlic; cook and stir for a few minutes to release the flavors. Season with maple syrup, cumin, chili powder, and black pepper. Pour in the vegetable broth, black beans, 1 can of red beans, and corn. Bring to a boil.\nMeanwhile, combine the remaining can of red beans and crushed tomatoes in the container of a large food processor or blender. Process until smooth. Pour into the soup pot, and stir to blend. Reduce heat to medium, and simmer for 15 minutes.\n",
        "picture_link": "HHoqTIs726sn2CiI2hCLZOUkD6tkOPC"
    },
    {
        "title": "Nana's Southern Pickled Peaches",
        "ingredients": [
            "4 cups sugar ADVERTISEMENT",
            "1 cup white vinegar ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "2 tablespoons whole cloves ADVERTISEMENT",
            "4 pounds fresh clingstone peaches, blanched and peeled ADVERTISEMENT",
            "5 (3 inch) cinnamon sticks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the sugar, vinegar and water in a large pot, and bring to a boil. Boil for 5 minutes. Press one or two cloves into each peach, and place into the boiling syrup. Boil for 20 minutes, or until peaches are tender.\nSpoon peaches into sterile jars and top with liquid to 1/2 inch from the rim. Put one cinnamon stick into each jar. Wipe the rims with a clean dry cloth, and seal with lids and rings. Process in a hot water bath for 10 minutes to seal, or consult times recommended by your local extension.\n",
        "picture_link": "e1NyMdD4u9lSxZ.OIcZ1ubhtfj6Ui32"
    },
    {
        "title": "Shiny Chocolate Glaze",
        "ingredients": [
            "8 (1 ounce) squares bittersweet chocolate, chopped ADVERTISEMENT",
            "1/2 cup unsalted butter ADVERTISEMENT",
            "1 tablespoon light corn syrup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the chocolate and butter in the top of a double boiler. Add corn syrup and set over a pan of simmering water. Stir occasionally until melted and smooth. use immediately.\n",
        "picture_link": "ooNQXMUvga1dmkjJ8I03W/nzQ2ydadm"
    }
]