[
    {
        "title": "Slow Cooker Chocolate Candy",
        "ingredients": [
            "2 pounds dry roasted peanuts ADVERTISEMENT",
            "4 (1 ounce) squares German sweet chocolate ADVERTISEMENT",
            "1 (12 ounce) bag semi-sweet chocolate chips ADVERTISEMENT",
            "2 1/2 pounds white almond bark ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Layer peanuts, German chocolate squares, chocolate chips, and white almond bark, respectively, into slow cooker.\nSet slow cooker to low and cook for 3 hours. Do not stir.\nStir mixture with wooden spoon until smooth. Drop by tablespoonfuls into miniature muffin cups. Cool until hardened, about 30 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Overnight Sweet Potato Oatmeal for One",
        "ingredients": [
            "1/3 cup water ADVERTISEMENT",
            "1/4 cup plain fat-free Greek yogurt ADVERTISEMENT",
            "1/4 cup old-fashioned rolled oats ADVERTISEMENT",
            "1/2 scoop vanilla protein powder ADVERTISEMENT",
            "1 tablespoon ground flax seed ADVERTISEMENT",
            "1 1/2 teaspoons chia seeds ADVERTISEMENT",
            "1/2 teaspoon pumpkin pie spice ADVERTISEMENT",
            "1/4 cup sweet potato puree ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir 1/3 cup water, yogurt, oats, protein powder, ground flax seed, chia seeds, and pumpkin pie spice together in a bowl; add sweet potatoes and 2 tablespoons water and stir until well mixed.\nRefrigerate 8 hours to overnight.\n",
        "picture_link": "ppAVKLmJdJtRD61umeDcCOoVBQAHrrq"
    },
    {
        "title": "Spicy Shrimp and Sweet Potato Soup",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 red onion, chopped ADVERTISEMENT",
            "1/2 teaspoon minced garlic ADVERTISEMENT",
            "4 cups vegetable stock ADVERTISEMENT",
            "4 cups corn ADVERTISEMENT",
            "2 cups peeled and diced sweet potatoes ADVERTISEMENT",
            "1 (10 ounce) can diced tomatoes with green chile peppers (such as RO*TEL®) ADVERTISEMENT",
            "1 cup salsa ADVERTISEMENT",
            "2 teaspoons chili powder ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 1/2 pounds peeled medium shrimp ADVERTISEMENT",
            "4 green onions, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large pot over medium heat. Cook and stir onion and garlic in the hot oil until onion is tender, about 10 minutes. Add vegetable stock, corn, sweet potatoes, diced tomatoes with green chile peppers, salsa, chili powder, cumin, salt, and pepper to onion mixture; bring to a boil for 5 minutes.\nStir shrimp into stock mixture and return to a boil; reduce heat to medium and simmer until shrimp are cooked through, about 10 minutes more. Stir green onion into soup; season with salt and pepper.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Secret Ingredient Smoothie",
        "ingredients": [
            "3 cups chopped romaine lettuce ADVERTISEMENT",
            "1/3 cup milk, or more as needed ADVERTISEMENT",
            "4 frozen strawberries, or more to taste ADVERTISEMENT",
            "1 frozen banana, cut into chunks ADVERTISEMENT",
            "1/4 teaspoon vanilla extract, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put romaine lettuce into the bottom of a blender pitcher; add enough milk to cover completely and blend on High until smooth.\nDrop one strawberry at a time into the blender while still running on High and allow the berry to blend completely before adding the next. Blend one banana chunk at a time into the mixture in the same manner as the strawberries. Thin the smoothie with additional milk to keep smoothie blending properly. Blend vanilla extract into the smoothie.\n",
        "picture_link": "qs2fIQg77c/8TGSAfyx8AFMFcRh1eOW"
    },
    {
        "title": "Pumpkin Mac and Cheese",
        "ingredients": [
            "1 cup elbow macaroni ADVERTISEMENT",
            "1 cup pumpkin puree ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until cooked through but firm to the bite, 8 minutes; drain.\nStir pumpkin puree, butter, and cheese with the drained macaroni in a large bowl until the butter is melted and the noodles completely coated.\n",
        "picture_link": "dXXLHPE7oRvZ329Vt8dX41MwqUhXrga"
    },
    {
        "title": "Berry Punch Parfaits",
        "ingredients": [
            "1 pound strawberries ADVERTISEMENT",
            "1/3 cup Mott's® Fruit Punch Rush ADVERTISEMENT",
            "2 cups vanilla-flavored nonfat Greek yogurt ADVERTISEMENT",
            "2 tablespoons Mott's® Fruit Punch Rush ADVERTISEMENT",
            "1/4 cup your favorite granola, or more if needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse, stem, and slice the strawberries into bite-size pieces.\nHeat the strawberries and 1/3 cup Mott's Fruit Punch Rush in a wide skillet or saucepan over medium-low heat. Stir occasionally for about 10 minutes until the strawberries have softened.\nCool the strawberries to room temperature and assemble the parfaits.\nStir the yogurt and remaining 2 tablespoons Mott's Fruit Punch Rush together in a medium bowl.\nSpoon 1/4 cup yogurt into each jar, then top with about 2 tablespoons cooled strawberries. Sprinkle with 1-2 tablespoons granola.\nRepeat with another layer of each ingredient in each jar. Refrigerate until ready to serve.\nThe granola in each parfait will stay crunchy for up to 4 hours; after that, it will be soggier but still delicious.\n",
        "picture_link": "SDufuROwODCelDPn0wkizHxl1hoQq6C"
    },
    {
        "title": "Black-Eyed Pea, Pork, and Mustard Green Gumbo",
        "ingredients": [
            "1 (6 pound) pork butt, cut into cubes ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 pinch ground thyme, or to taste ADVERTISEMENT",
            "8 slices bacon, cut into 1-inch pieces ADVERTISEMENT",
            "1 1/2 pounds okra, sliced crosswise into 1/2-inch-wide pieces ADVERTISEMENT",
            "3 pounds smoked sausage, sliced and halved ADVERTISEMENT",
            "2 cups chopped onion ADVERTISEMENT",
            "2 cups chopped bell pepper ADVERTISEMENT",
            "2 cups chopped celery ADVERTISEMENT",
            "2 tablespoons chopped garlic ADVERTISEMENT",
            "1 gallon chicken stock, divided ADVERTISEMENT",
            "1 (16 ounce) jar premade roux (such as Kary's®) ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1 tablespoon paprika ADVERTISEMENT",
            "2 teaspoons ground black pepper ADVERTISEMENT",
            "1 1/2 teaspoons file powder ADVERTISEMENT",
            "1 teaspoon dried rosemary ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "4 bay leaves ADVERTISEMENT",
            "1 pinch Creole seasoning (such as Slap Ya Mama®) ADVERTISEMENT",
            "5 (15 ounce) cans black-eyed peas, undrained ADVERTISEMENT",
            "4 (15 ounce) cans mustard greens, drained ADVERTISEMENT",
            "2 (10 ounce) cans diced tomatoes with green chile peppers (such as RO*TEL®) ADVERTISEMENT",
            "1 (16 ounce) package sliced fresh mushrooms ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nSeason pork cubes with salt, pepper, and thyme to taste and place in a cast iron skillet.\nCook pork cubes in the preheated oven until cooked through, about 30 minutes. Transfer pork from skillet to a bowl, reserving drippings.\nCook and stir bacon in a 9-quart Dutch oven or heavy pot over medium heat until browned, 5 to 7 minutes. Remove bacon with a slotted spoon and place on a paper towel-lined plate, reserving bacon grease.\nCook and stir okra in the bacon grease over medium heat until lightly browned, about 5 minutes. Transfer okra to a bowl, reserving bacon grease. Cook and stir smoked sausage in bacon grease until browned, about 5 minutes. Add onion, bell pepper, celery, and garlic to sausage; cook and stir until softened, 5 to 10 minutes.\nStir 48 fluid ounces chicken stock into sausage mixture and bring to a simmer. Stir roux into broth mixture until dissolved and slightly thickened, 2 to 3 minutes. Slowly stir 48 fluid ounces chicken stock into thickened stock; bring back to a simmer.\nMix pork, pork drippings, bacon, chili powder, paprika, 2 teaspoons black pepper, file powder, rosemary, 1 teaspoon thyme, bay leaves, and Creole seasoning into thickened chicken stock; simmer, stirring often and skimming off fat, until flavors blend, about 1 hour.\nStir black-eyed peas, mustard greens, okra, diced tomatoes with green chile peppers, mushrooms, and remaining chicken stock into pork-stock mixture; simmer for 1 hour more.\n",
        "picture_link": "PFxoNRugKPBGY5gSTCehWOVfvfBLtCu"
    },
    {
        "title": "Stout Skirt Steak",
        "ingredients": [
            "1 (12 fluid ounce) bottle Irish stout beer (such as Guinness®) ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1/3 cup red wine vinegar ADVERTISEMENT",
            "3 tablespoons dark brown sugar ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "1 tablespoon hot pepper sauce (such as Crystal ®) ADVERTISEMENT",
            "2 pounds skirt steak, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk beer, olive oil, vinegar, brown sugar, garlic, and hot sauce together in a glass or ceramic bowl until marinade is smooth. Add steak to marinade and turn to coat. Cover the bowl with a lid or plastic wrap and marinate in the refrigerator, 8 hours to overnight.\nPreheat an outdoor grill for high heat, and lightly oil the grate.\nRemove steak from marinade and shake off any excess. Discard marinade.\nCook steak on the preheated grill, turning once, until steak starts to firm and is reddish-pink and juicy in the center, 5 to 6 minutes per side. An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C). Let rest for 2 to 3 minutes before serving.\n",
        "picture_link": "FP.kdoGcptVhHYa2R39S4nqg5oG3oz2"
    },
    {
        "title": "Tasty Breakfast Smoothie",
        "ingredients": [
            "1 cup milk ADVERTISEMENT",
            "1 banana, cut into chunks ADVERTISEMENT",
            "2 fresh apricots, peeled and pitted ADVERTISEMENT",
            "1/2 cup plain yogurt ADVERTISEMENT",
            "2 teaspoons wheat germ ADVERTISEMENT",
            "2 teaspoons oat bran ADVERTISEMENT",
            "2 teaspoons maple syrup, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend milk, banana, apricots, yogurt, wheat germ, oat bran, and maple syrup in a blender until smooth and frothy.\n",
        "picture_link": ".21zglGcUU3HsgoksJ7dwjDl9SPKts."
    },
    {
        "title": "Rustic Marinara Sauce",
        "ingredients": [
            "1/2 cup olive oil ADVERTISEMENT",
            "2 white onions, diced ADVERTISEMENT",
            "8 cloves garlic, minced ADVERTISEMENT",
            "1 (28 ounce) can petite diced tomatoes ADVERTISEMENT",
            "1 (28 ounce) can diced tomatoes ADVERTISEMENT",
            "1 cup dry white wine ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "1 tablespoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon white sugar ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon red pepper flakes ADVERTISEMENT",
            "3 bay leaves ADVERTISEMENT",
            "1 cup freshly grated Pecorino-Romano cheese, divided ADVERTISEMENT",
            "3/4 cup chopped fresh basil ADVERTISEMENT",
            "1/2 cup chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large Dutch oven or heavy pot over medium heat; cook and stir onions for 5 minutes. Add garlic and cook, stirring occasionally, until onions are translucent, about 5 minutes more.\nMix petite diced tomatoes, diced tomatoes, white wine, tomato paste, oregano, salt, sugar, black pepper, red pepper flakes, and bay leaves into onion mixture; reduce heat to low, cover Dutch oven, and simmer, stirring occasionally, until flavors blend, about 1 hour.\nRemove Dutch oven from heat. Add 1/2 cup Pecorino-Romano cheese, basil, and parsley into into sauce; stir until cheese melts, about 5 minutes. Discard bay leaves. Sprinkle remaining cheese over sauce when serving.\n",
        "picture_link": "Yft1spNkvBmwN7vVAze7Flp9CT65RyK"
    },
    {
        "title": "Sesame-Roasted Salmon",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 teaspoons soy sauce ADVERTISEMENT",
            "2 teaspoons Dijon mustard ADVERTISEMENT",
            "2 teaspoons honey ADVERTISEMENT",
            "1 1/4 pounds skin-on salmon fillet, cut into 4 pieces ADVERTISEMENT",
            "1 tablespoon black sesame seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil and spray with cooking spray.\nCombine garlic, soy sauce, Dijon mustard, and honey in a bowl. Place salmon, skin-side down, onto the prepared baking sheet. Prick salmon several times with a fork. Spread garlic mixture over salmon; top with sesame seeds.\nBake in the preheated oven until fish flakes easily with a fork, 10 to 20 minutes.\n",
        "picture_link": "hhlrK.zvat8HhQvnAB7xOU.mCn5Zb4q"
    },
    {
        "title": "Lemon Delights",
        "ingredients": [
            "1 cup butter or margarine, softened ADVERTISEMENT",
            "1 cup sugar ADVERTISEMENT",
            "1 (3 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 egg yolk, reserving egg white ADVERTISEMENT",
            "3 tablespoons ReaLemon® lemon juice from concentrate ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 1/4 cups unsifted flour ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "2 cups finely chopped nuts ADVERTISEMENT",
            "Lemon Cheese Filling: ADVERTISEMENT",
            "1 (3 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/4 cup sugar ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "1 tablespoon ReaLemon® lemon juice from concentrate ADVERTISEMENT",
            "Yellow food coloring (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine all ingredients except egg white, flour, nuts and Lemon Cheese Filling. With mixer, beat until well blended. Beat in flour. Wrap dough in plastic wrap.\nChill at least 1 hour.\nShape into 1-inch balls. With mixer, beat egg white lightly. Dip balls in egg white; roll in nuts. Place 2 inches apart on ungreased baking sheets. Press thumb deep into center of each cookie; fill with Lemon Cheese Filling (recipe below).\nBake in preheated 375 degrees oven 10 minutes or until filling is set. Cool slightly; remove from baking sheets. Store tightly covered in refrigerator.\nLemon Cheese Filling Directions: Beat cream cheese, sugar, egg yolk, ReaLemon(R) and 1 drop of yellow food coloring, if desired, until well blended and smooth.\n",
        "picture_link": "/io3Dtdl06kgvXC60dNd1uEOoxMspse"
    },
    {
        "title": "Peanut Butter and Honey Granola Bars",
        "ingredients": [
            "Dry Ingredients: ADVERTISEMENT",
            "3 cups rolled oats ADVERTISEMENT",
            "1 cup raw wheat bran ADVERTISEMENT",
            "1 cup unsweetened flaked coconut ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1/2 cup sliced almonds ADVERTISEMENT",
            "1/2 cup sunflower seeds ADVERTISEMENT",
            "1/2 cup pumpkin seeds ADVERTISEMENT",
            "1/4 cup wheat germ ADVERTISEMENT",
            "2 tablespoons ground flaxseed ADVERTISEMENT",
            "Wet Ingredients: ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/2 cup natural peanut butter ADVERTISEMENT",
            "1 tablespoon milk ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "3/4 teaspoon baking soda ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 275 degrees F (135 degrees C). Grease a baking sheet.\nCombine oats, wheat bran, coconut, raisins, almonds, sunflower seeds, pumpkin seeds, wheat germ, and flaxseed together in a bowl.\nMix honey, oil, brown sugar, and peanut butter together in a saucepan over low heat until dissolved, about 5 minutes. Whisk milk, vanilla extract, and baking soda together in a bowl; pour into honey mixture. Cook mixture, whisking constantly, until bubbling; remove from heat and immediately pour over dry ingredients.\nPress oat mixture into the prepared baking sheet using your hands until top is smooth and mixture is evenly distributed.\nBake in the preheated oven until top is lightly browned, 20 to 25 minutes. Cool to room temperature and cut into bars.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Big Game Sugar Steak",
        "ingredients": [
            "1 (5 pound) 3-inch thick beef top sirloin steak ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place steak in a large bowl. Knead sugar into meat to form a thick crust. Cover the bowl with plastic wrap and let sit at room temperature; 3 to 4 hours.\nPreheat an outdoor grill for high heat, and lightly oil the grate.\nCook steak on preheated grill until each side is caramelized, about 10 minutes per side.\nPreheat oven to 350 degrees F (175 degrees C). Line a baking sheet with aluminum foil; place steak on prepared baking sheet.\nRoast in the preheated oven until steak is starting to firm and is reddish-pink and juicy in the center, about 20 minutes per side. An instant-read thermometer inserted into the center should read 130 degrees F (54 degrees C). Remove from oven and let rest for 15 minutes before slicing.\n",
        "picture_link": "Bjs3LZ2V6vaugM6J5UrDjKg6hU2GU3C"
    },
    {
        "title": "Vegetarian Pumpkin Chili",
        "ingredients": [
            "1 pound dry black beans ADVERTISEMENT",
            "cold water, or as needed ADVERTISEMENT",
            "1/2 cup lentils ADVERTISEMENT",
            "2 tablespoons dry roux mix ADVERTISEMENT",
            "1 green bell pepper, diced ADVERTISEMENT",
            "1 (10.75 ounce) can condensed tomato soup ADVERTISEMENT",
            "1 cup pumpkin puree ADVERTISEMENT",
            "1 (1.25 ounce) package chili seasoning mix ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon nutmeg ADVERTISEMENT",
            "1 teaspoon ground cloves ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place black beans into a large bowl and cover with several inches cool water; let soak 8 hours to overnight.\nDrain and rinse beans thoroughly; place in a large pot. Cover with 1 inch of water; add lentils. Bring mixture to a boil; stir in roux mix until fully incorporated. Cover, reduce heat, and simmer until beans are tender, about 30 minutes.\nPlace diced bell pepper in a microwave-safe bowl; cook in the microwave until slightly tender, 30 to 60 seconds. Stir bell pepper, tomato soup, pumpkin puree, chili seasoning mix, sugar, cinnamon, nutmeg, cloves, and onion powder into bean mixture. Cover and simmer until flavors have blended, about 15 minutes, stirring occasionally.\n",
        "picture_link": "5r438kSXHBKbYiw53vLyfdaFZFV.8Di"
    },
    {
        "title": "Crab and Mushroom Quiche",
        "ingredients": [
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "1/2 cup butter-flavored shortening ADVERTISEMENT",
            "3 tablespoons ice water, or as needed ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "8 cremini mushrooms, thinly sliced ADVERTISEMENT",
            "4 green onions, chopped ADVERTISEMENT",
            "1/2 red bell pepper, diced ADVERTISEMENT",
            "1/4 teaspoon minced garlic ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 pinch celery salt ADVERTISEMENT",
            "3 dashes hot pepper sauce (such as Frank's RedHot®), or to taste ADVERTISEMENT",
            "1 (8 ounce) can lump crabmeat, drained ADVERTISEMENT",
            "1/2 (5.2 ounce) package garlic and herb cheese spread (such as Boursin®) ADVERTISEMENT",
            "3/4 cup shredded Italian cheese blend ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk flour, 1 egg, salt, and baking powder together in a bowl; Add butter-flavored shortening into flour mixture and combine by hand until mixture resembles coarse crumbs. Stir ice water into the mixture, adding enough so the dough just holds together. Form dough into a ball, wrap in waxed paper, and refrigerate 30 minutes.\nPreheat oven to 400 degrees F (200 degrees C).\nGenerously flour a large sheet of waxed paper and roll the dough out to an even circle about 11 inches across; fit crust into a 9-inch pie dish. Press edges of dough gently over rim of crust.\nBake the crust in the preheated oven until lightly browned, 6 to 7 minutes.\nReduce oven heat to 375 degrees F (190 degrees C).\nHeat butter in a large skillet over medium heat; cook and stir mushrooms, green onions, and red bell pepper in the hot butter until vegetables soften, about 7 minutes; stir in garlic and cook a few minutes more. Season vegetables with salt and black pepper.\nWhisk cream, eggs, celery salt, and hot sauce together in a bowl until thoroughly combined; stir crabmeat and mushroom mixture into egg mixture. Crumble about 3/4 of the herb cheese spread into the bottom of the crust and pour crabmeat mixture over the cheese spread. Crumble remaining herb cheese spread into crabmeat filling and spread Italian cheese blend over the top.\nBake in the oven until crabmeat filling is set and cheese topping is lightly golden brown, 30 to 35 minutes.\n",
        "picture_link": "zzNmrO6ECdi0gWTKJa4HK7Ot3VZn03e"
    },
    {
        "title": "Citrus Jell-O® Salad",
        "ingredients": [
            "1 (6 ounce) package orange flavored Jell-O® mix ADVERTISEMENT",
            "2 cups boiling water ADVERTISEMENT",
            "1 cup cold water ADVERTISEMENT",
            "1 cup orange juice ADVERTISEMENT",
            "1 (15 ounce) can red grapefruit, drained ADVERTISEMENT",
            "1 (11 ounce) can mandarin oranges, drained ADVERTISEMENT",
            "1 (8 ounce) container frozen non-dairy whipped topping, thawed ADVERTISEMENT",
            "1 (8 ounce) jar mayonnaise ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dissolve orange gelatin in boiling water in a large bowl, stirring for about 3 minutes; mix cold water and orange juice into gelatin. Pour gelatin mixture into a glass serving dish. Stir red grapefruit and mandarin oranges into mixture and refrigerate until set, about 4 hours.\nWhisk topping and mayonnaise in a bowl until smoothly combined; serve gelatin salad with a spoonful of dressing over each portion.\n",
        "picture_link": "uKsqt8EoncysyKXJd3jElhr7FJmZGFG"
    },
    {
        "title": "Harvest Salad from Oikos®",
        "ingredients": [
            "1 cup Dannon Oikos Plain Greek Nonfat Yogurt ADVERTISEMENT",
            "2 ounces crumbled goat cheese ADVERTISEMENT",
            "2 tablespoons cider vinegar ADVERTISEMENT",
            "2 tablespoons chopped parsley ADVERTISEMENT",
            "Salt and cracked pepper ADVERTISEMENT",
            "3 heads crisp Romaine hearts, shredded ADVERTISEMENT",
            "1 large apple, cored and sliced ADVERTISEMENT",
            "8 ounces roasted turkey, julienned ADVERTISEMENT",
            "1/2 cup dried cranberries ADVERTISEMENT",
            "1/2 cup toasted pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a bowl mix together, yogurt, goat cheese, vinegar, parsley, salt and cracked pepper. Let stand 15 minutes.\nIn a large bowl combine remaining ingredients. Toss dressing with greens and toss gently to coat. Divide salad evenly among 6 plates (2 cups per).\n",
        "picture_link": "XvUAkv.uXdj6mOsBrR6mWrHNsf1icHW"
    },
    {
        "title": "Glazed and Stuffed Pork Tenderloin",
        "ingredients": [
            "1 (1 pound) pork tenderloin ADVERTISEMENT",
            "1 tablespoon canola oil ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "3 celery ribs, chopped ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1/2 cup bread crumbs ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 tablespoon chopped parsley ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon dried rosemary ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon pepper ADVERTISEMENT",
            "1/4 cup cranberry jam ADVERTISEMENT",
            "1/4 cup jalapeno pepper jam ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1 teaspoon minced onion ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCut a lengthwise slit 3/4 of the way through pork tenderloin and spread tenderloin open. Pound the meat flat and to 1/4-inch thickness with a meat mallet.\nHeat canola oil in a large skillet over medium heat and brown the flattened tenderloin in the hot oil, about 5 minutes per side. Transfer tenderloin to a plate.\nHeat butter in skillet over medium heat and cook and stir celery and onion in the hot butter until tender, about 8 minutes. Stir bread crumbs, parsley, 1 teaspoon garlic powder, rosemary, salt, and black pepper into the celery and onions.\nOpen the tenderloin and spread the bread crumb mixture over the meat to within 1/2 inch of the edge. Fold the tenderloin over the stuffing and tie together with kitchen string; place into a shallow roasting pan.\nStir cranberry jam, jalapeno pepper jam, garlic, and garlic powder together in a bowl; spread mixture over the tenderloin.\nBake in the preheated oven until the jam mixture has baked into a glaze and an instant-read meat thermometer inserted into the middle of stuffing reads 160 degrees F (70 degrees C), 50 to 60 minutes. Let meat stand 5 minutes before untying and slicing.\n",
        "picture_link": "LSfqvPq8KSJG5HzvRlwLvgw4gnWFPba"
    },
    {
        "title": "The Beer Budget Bellini",
        "ingredients": [
            "2 (1.5 fluid ounce) jiggers peach schnapps ADVERTISEMENT",
            "1 (750 milliliter) bottle champagne ADVERTISEMENT",
            "2 (12 fluid ounce) cans or bottles lemon-lime flavored carbonated beverage ADVERTISEMENT",
            "4 peach slices (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour 1/2 jigger peach schnapps into each of 4 champagne flutes. Fill each glass halfway with champagne; top with lemon-lime soda. Drop a peach slice into each glass.\n",
        "picture_link": ".rBTbb3meWzc7uLs5S6KRr3sJ0ZrI1e"
    },
    {
        "title": "Lavender Mint Tea",
        "ingredients": [
            "1/4 cup fresh lavender petals ADVERTISEMENT",
            "1 cup fresh mint leaves ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place lavender petals and mint leaves into a saucepan, pour water over lavender and mint, and bring to a boil. Turn heat to low and simmer tea until flavor is your desired strength, 15 to 20 minutes. Strain out mint and lavender petals and serve tea hot. If you prefer, let strained tea cool serve over ice.\n",
        "picture_link": "vLhooq2VinO2wEFmOu1N.rbuwnYJqO."
    },
    {
        "title": "Tangy Pumpkin Butter",
        "ingredients": [
            "1 (29 ounce) can pumpkin puree ADVERTISEMENT",
            "3/4 cup brown sugar ADVERTISEMENT",
            "1/2 cup apple cider vinegar ADVERTISEMENT",
            "2 teaspoons pumpkin pie spice ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix pumpkin puree, brown sugar, apple cider vinegar, pumpkin pie spice, and cinnamon in a saucepan over medium-low heat; bring to a simmer. Cook pumpkin mixture until thickened, about 30 minutes.\nRefrigerate until cool before serving.\n",
        "picture_link": "Pp8dZdBC6e1qQYWivqxRqpvZSELVCU6"
    },
    {
        "title": "JELL-O® Aquarium",
        "ingredients": [
            "4 (.25 ounce) packages unflavored gelatin (such as Knox ®) ADVERTISEMENT",
            "3 tablespoons blue fruit-flavored gelatin mix (such as JELL-O®) ADVERTISEMENT",
            "4 cups white grape juice ADVERTISEMENT",
            "4 cups ice ADVERTISEMENT",
            "1 cup rock candy, or as needed ADVERTISEMENT",
            "1 8-cup fish bowl ADVERTISEMENT",
            "1 sprig fresh mint ADVERTISEMENT",
            "8 gummy fish candies ADVERTISEMENT",
            "hot water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix unflavored gelatin and fruit-flavored gelatin in a bowl.\nBring grape juice to a boil in a saucepan; pour over gelatin mixture and stir until gelatin is dissolved. Immediately add ice cubes and stir until ice is melted. The mixture should be cold, slightly set, but still pourable. If needed, refrigerate mixture to chill, as any heat could melt the rock candy.\nSpread rock candy into the bottom of the fish bowl to cover. Pour enough of the chilled gelatin mixture over the rock candy to cover by about 4 inches.\n'Plant' the mint sprig into the rock candy bottom. If the mixture is set enough, the mint won't float. It the mint floats, remove it and put the partially filled bowl into the fridge until it's nearly set and can support the mint. Once the mint is planted, carefully pour remaining gelatin mixture into the bowl; refrigerate until more set, 8 to 10 minutes.\nDip a long sharp knife into hot water and use it make vertical slices in the gelatin. Use skewer or chopstick to position gummy fish into the 'water.' If you're gentle, the gelatin will 'heal' around the insertion after the fish are positioned. If the top of the gelatin is bumpy, dip a spoon into hot water and use the back of it to smooth the surface.\nRefrigerate until fully set, about 30 minutes.\n",
        "picture_link": "2fAfXge/2oYY7ot4rpHFXFuDJGelYc2"
    },
    {
        "title": "Nutmeg Mashed Potatoes",
        "ingredients": [
            "4 large potatoes ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "2 teaspoons ground nutmeg, or to taste ADVERTISEMENT",
            "2 teaspoons salt, or to taste ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until potatoes are tender and split open, about 20 minutes. Drain and return potatoes to pot.\nMash potatoes with butter, nutmeg, and salt using a potato masher or fork until well incorporated; stir in sour cream until mashed potatoes are creamy.\n",
        "picture_link": "lDMfHTLRSXp01UctFrgzMHdR1InMNLa"
    },
    {
        "title": "Mamita's Mojito Scallop Kabobs with Stuffed Tomatoes",
        "ingredients": [
            "Mojito Marinade ADVERTISEMENT",
            "1 cup orange juice ADVERTISEMENT",
            "1/2 cup lemon juice ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 tablespoon onion powder ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 teaspoon black pepper ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "8 large large scallops ADVERTISEMENT",
            "2 yellow squash, cut into 4 large chunks ADVERTISEMENT",
            "2 zucchinis, cut into 4 large chunks ADVERTISEMENT",
            "1 (8 ounce) package portobello mushroom caps, cut into large chunks ADVERTISEMENT",
            "4 bamboo skewers, soaked in water for 60 minutes ADVERTISEMENT",
            "1/2 cup fresh basil ADVERTISEMENT",
            "Stuffed Tomatoes ADVERTISEMENT",
            "2 large tomatoes, cored ADVERTISEMENT",
            "1 (12 ounce) package microwaveable broccoli in cheese sauce ADVERTISEMENT",
            "1 1/2 cups cooked brown rice ADVERTISEMENT",
            "1 slice American cheese, cut into 4 strips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk orange juice, lemon juice, salt, onion powder, garlic powder, black pepper, and sugar together in a large bowl to dissolve seasoning into the liquid. Add scallops, yellow squash, zucchinis, and portobello mushroom to the mojito marinade; toss to coat.\nCover bowl with plastic wrap and refrigerate 8 hours to overnight.\nPreheat oven to 400 degrees F (200 degrees C).\nThread onto a skewer a piece of mushroom, yellow squash, zucchini, and a scallop, respectively. Repeat so there are two of each item on the skewer; repeat with remaining skewers. Sprinkle fresh basil evenly over the skewers.\nCarefully remove tomato insides with a spoon; discard tomato insides.\nPour broccoli with cheese sauce into a microwave-safe bowl; cook in microwave until broccoli is tender and the sauce is melted, 3 to 5 minutes.\nStir broccoli with cheese sauce and rice together in a bowl; spoon into the hollowed-out tomatoes. Place 2 strips American cheese atop the mixture in a crossing pattern.\nCook the skewers in preheated oven until the scallops are cooked through, 25 to 30 minutes. Remove from oven to a plate; cover with aluminum foil to keep warm.\nReduce oven heat to 350 degrees F (175 degrees C).\nBake tomatoes in the oven until the cheese is bubbling, 5 to 10 minutes. Serve with the skewers.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Stove Top Blueberry Grunt",
        "ingredients": [
            "Filling: ADVERTISEMENT",
            "8 cups fresh blueberries, divided ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1 teaspoon lemon zest ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 teaspoon cornstarch ADVERTISEMENT",
            "Topping: ADVERTISEMENT",
            "3/4 cup buttermilk ADVERTISEMENT",
            "6 tablespoons unsalted butter, melted and cooled slightly ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "6 tablespoons white sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine 4 cups blueberries, 1/2 cup white sugar, 1/2 teaspoon cinnamon, water, and lemon zest in a Dutch oven. Cook and stir over medium-high heat until mixture has thickened and has a jam-like texture, 10 to 12 minutes.\nWhisk lemon juice and cornstarch together in a small bowl until smooth; stir into blueberry mixture. Add remaining 4 cups blueberries to the blueberry mixture; cook and stir until blueberry mixture is heated through, about 1 minute. Remove pot from heat and cover to keep warm.\nMix buttermilk, butter, and vanilla extract together in a measuring cup. Whisk flour, baking powder, baking soda, salt, and 6 tablespoons sugar together in a large bowl. Slowly stir buttermilk mixture into flour mixture until dough forms. Scoop dough using a small ice cream scoop or 2 large spoons and drop golf ball-sized dumplings atop blueberry mixture.\nWrap lid of Dutch oven with a clean kitchen towel to absorb condensation during cooking. Cover pot with the towel-wrapped lid, keeping towel away from heat source.\nSimmer grunt until dumplings have doubled in size and a toothpick inserted in the center comes out clean, 16 to 22 minutes.\nMix 1/2 teaspoon cinnamon and 2 tablespoons white sugar together in a small bowl; sprinkle over dumplings.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Christmas Cosmo",
        "ingredients": [
            "2 fluid ounces vodka ADVERTISEMENT",
            "1 fluid ounce cranberry juice ADVERTISEMENT",
            "1 fluid ounce triple sec (orange-flavored liqueur) ADVERTISEMENT",
            "2 teaspoons fresh lime juice ADVERTISEMENT",
            "1 lime wedge ADVERTISEMENT",
            "2 cranberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a cocktail shaker with ice; add vodka, cranberry juice, triple sec, and lime juice. Cover and shake. Strain cocktail into a martini glass. Garnish with a lime wedge and cranberries.\n",
        "picture_link": "RBwgBC1LhBdN0/eLU47OzU7DDTdukj6"
    },
    {
        "title": "Top Shelf Sparkling Margarita Jell-O®",
        "ingredients": [
            "3 (3 ounce) packages lime-flavored gelatin mix (such as Jell-O®) ADVERTISEMENT",
            "1 (3 ounce) package lemon-flavored gelatin mix (such as Jell-O®) ADVERTISEMENT",
            "2 1/2 cups boiling water ADVERTISEMENT",
            "1 2/3 cups premium tequila ADVERTISEMENT",
            "2/3 cup triple sec ADVERTISEMENT",
            "2/3 cup brandy-based orange liqueur (such as Grand Marnier®) ADVERTISEMENT",
            "1/2 cup sweetened lime juice ADVERTISEMENT",
            "2 cups sparkling water ADVERTISEMENT",
            "1 lime, zested ADVERTISEMENT",
            "1 pinch margarita salt, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir lime gelatin, lemon gelatin, and boiling water together in a bowl until fully dissolved. Chill in refrigerator for 15 minutes.\nStir tequila, triple sec, orange liqueur, and sweetened lime juice into gelatin mixture. Gently stir in sparkling water. Ladle mixture into 24 small cups. Sprinkle each serving with lime zest. Refrigerate until set, at least 4 hours. Sprinkle each serving with margarita salt before serving.\n",
        "picture_link": "qRYE3ph9HMBJ719YEmo4T3xNAtA7tw6"
    },
    {
        "title": "Grunt",
        "ingredients": [
            "2 cups blueberries ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine blueberries, water, 1 cup white sugar, and 1 tablespoon butter in a saucepan; cook and stir over medium heat until heated through, about 5 minutes. Transfer blueberry mixture to a deep 1 1/2 to 2-quart baking dish.\nBeat 1/2 cup white sugar and 1 tablespoon butter together in a bowl until creamy. Sift flour, baking powder, and salt together in a separate bowl; stir into sugar-butter mixture. Add milk; stir until incorporated. Pour batter over blueberries.\nBake in the preheated oven until lightly browned and bubbling, about 30 minutes.\n",
        "picture_link": "DDJjb32t1wOYKLBUkfsnSU1buOHlN/i"
    },
    {
        "title": "Pasta Ai Fiori Di Zucca (Pasta With Zucchini Blossoms)",
        "ingredients": [
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 (8 ounce) package penne pasta ADVERTISEMENT",
            "15 fresh zucchini blossoms ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 bunch fresh parsley, chopped ADVERTISEMENT",
            "1 teaspoon saffron threads ADVERTISEMENT",
            "2 tablespoons fine cornmeal ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with water, stir in 1/2 teaspoon salt, and bring to a boil. Stir in penne and return to a boil. Cook pasta uncovered, stirring occasionally, until cooked through but still firm to the bite, about 11 minutes; drain, reserving 1/2 cup of pasta-cooking water.\nClean and rinse zucchini blossoms, removing the inner parts (stigma or anthers); coarsely chop the flowers.\nHeat olive oil in a large skillet over medium-low heat; cook and stir garlic in the hot oil until it begins to brown, 3 to 5 minutes. Stir parsley, saffron, and reserved 1/2 cup of pasta-cooking water into skillet; stir to combine. Add zucchini blossoms and simmer until tender, about 10 minutes. Sprinkle cornmeal into mixture and stir constantly until thickened, about 5 minutes.\nGently fold penne pasta into zucchini blossom mixture and top with Parmesan cheese, salt, and black pepper.\n",
        "picture_link": "MYJaHyut5mzk1npYRUFVYdrWPPaZRi."
    },
    {
        "title": "Sausage Rolls with Maille® Dijon Originale Mustard",
        "ingredients": [
            "6 ounces all-purpose flour ADVERTISEMENT",
            "4 ounces butter ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon Maille® Dijon Originale mustard ADVERTISEMENT",
            "2 tablespoons oil ADVERTISEMENT",
            "12 cocktail sausages ADVERTISEMENT",
            "4 slices ham ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "First make the pastry. Place the flour, butter, egg and Maille(R) Dijon Originale mustard into a processor and mix until a ball begins to form around the blade. Remove from the processor bowl and lightly shape into a ball. Wrap in cling and chill in the refrigerator for 30 minutes.\nMeanwhile, heat the oil in a pan and fry cocktail sausages all over until brown. Remove from pan and cool. Wrap each sausage in a strip of ham.\nRoll out the chilled pastry on a lightly floured board. Cut into rectangles large enough to enclose a wrapped sausage. Wrap the sausages in pastry and seal with beaten egg. Make slash marks along the top of each sausage roll and then brush with the beaten egg.\nBake in a pre-heated oven at 375 degrees F for around 15 minutes, or until the pastry is golden brown.\n",
        "picture_link": "qK4HVqxZt36sP0.1BS/On.akE/aETOm"
    },
    {
        "title": "St. Brenden's Chicken",
        "ingredients": [
            "1/4 cup extra-virgin olive oil ADVERTISEMENT",
            "1 teaspoon minced shallot ADVERTISEMENT",
            "1 small clove garlic, chopped ADVERTISEMENT",
            "1 3/4 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "1 1/3 tablespoons toasted pine nuts ADVERTISEMENT",
            "1/4 cup chopped fresh basil, or more to taste ADVERTISEMENT",
            "1 1/2 cups heavy whipping cream, divided ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "3 skinless, boneless chicken breast halves, cut into bite-size pieces ADVERTISEMENT",
            "1 (8 ounce) package farfalle (bow tie) pasta ADVERTISEMENT",
            "1 tablespoon grated Parmesan cheese, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1/4 cup olive oil in a large skillet and cook and stir shallot and garlic until shallot is translucent, about 5 minutes. Stir 1 3/4 tablespoon Parmesan cheese, pine nuts, and basil into the hot olive oil, cooking until basil is tender and wilted, about 10 more minutes.\nStir 1 cup cream into basil mixture and bring to a simmer. Reduce heat to low and simmer sauce until it has reduced by 1/3, about 15 minutes. Stir remaining 1/2 cup cream into sauce and simmer until thickened again, 15 to 30 more minutes. Stir occasionally.\nHeat 1 tablespoon olive oil in a separate skillet over medium heat and cook chicken until lightly browned outside and no longer pink inside, 10 to 12 minutes.\nBring a large pot of lightly salted water to a boil. Cook the bow-tie pasta at a boil, stirring occasionally, until cooked through yet firm to the bite, about 12 minutes; drain. Gently fold cooked pasta and chicken into basil sauce. Sprinkle with 1 tablespoon Parmesan cheese.\n",
        "picture_link": "3gVTxMtTdG0LjrMI1X7z4Fs.mFO7WG2"
    },
    {
        "title": "Blast-Off Blood Mary",
        "ingredients": [
            "4 cups chilled tomato juice ADVERTISEMENT",
            "1 1/3 cups vodka ADVERTISEMENT",
            "3 lemons, juiced ADVERTISEMENT",
            "1 1/2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1 1/2 tablespoons prepared horseradish, drained ADVERTISEMENT",
            "3/4 teaspoon hot pepper sauce (such as Tabasco®) ADVERTISEMENT",
            "1/2 teaspoon celery salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir tomato juice, vodka, lemon juice, Worcestershire sauce, horseradish, hot pepper sauce, celery salt, and black pepper together in a pitcher.\n",
        "picture_link": "Naqy6A47cwOItoxiKAXWVcfbjTVzIEW"
    },
    {
        "title": "Cranberry-Nut Bread",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "3/4 cup orange juice ADVERTISEMENT",
            "1 egg, well beaten ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 tablespoon grated orange zest ADVERTISEMENT",
            "1 1/2 cups cranberries ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x5-inch loaf pan.\nSift flour, white sugar, brown sugar, baking powder, baking soda, and salt together in a large mixing bowl. Mash butter into the flour mixture with a pastry cutter until the mixture resembles coarse cornmeal.\nStir orange juice, egg, vanilla extract, and orange zest together in a small bowl; add to flour mixture and stir just until the dry ingredients are moistened and batter-like. Fold cranberries and walnuts through the batter; spoon into the prepared loaf pan, spreading so the corners and sides are slightly higher than the center.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 1 hour. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "qqtlhVHRK9Tk4CTduut2r93GOs6uGW."
    },
    {
        "title": "Nutty Granola",
        "ingredients": [
            "6 cups old-fashioned oats ADVERTISEMENT",
            "1 cup slivered almonds ADVERTISEMENT",
            "1 cup flaked coconut ADVERTISEMENT",
            "1/2 cup hulled green pumpkin seeds ADVERTISEMENT",
            "1/2 cup shelled sunflower seeds ADVERTISEMENT",
            "1/2 cup crushed pecans ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2/3 cup honey ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup dried cranberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nStir oats, almonds, coconut, pumpkin seeds, sunflower seeds, pecans, and salt, together in a large bowl.\nStir butter and honey together in a small saucepan over low heat until the butter is fully melted.\nStir vanilla extract into the melted butter.\nPour butter mixture over oats mixture; stir until evenly coated.\nSpread the mixture onto 2 large baking sheets into single, even layers.\nBake in preheated oven 10 minutes. Remove from oven and gently turn the granola. Continue baking until golden brown, about 10 minutes more.\nSet granola aside to cool to room temperature; transfer to a large bowl.\nGently fold cranberries into the granola.\n",
        "picture_link": "52b8aZuAqKvWL9gYgTLmoe.slzQOnP2"
    },
    {
        "title": "Chicken Jook with Lots of Vegetables",
        "ingredients": [
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "3 bone-in chicken thighs ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 cup chopped scallions ADVERTISEMENT",
            "2 tablespoons minced fresh ginger ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "1 jalapeno pepper, seeded and minced ADVERTISEMENT",
            "6 cups water ADVERTISEMENT",
            "1 cup short-grain brown rice ADVERTISEMENT",
            "2 cups thinly sliced cabbage ADVERTISEMENT",
            "1 cup snow peas ADVERTISEMENT",
            "1 cup bean sprouts ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "1 tablespoon sesame oil ADVERTISEMENT",
            "1/2 cup chopped cilantro leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large pot over medium heat. Place chicken in hot oil, season with salt and ground black pepper and cook until well-browned, about 5 minutes per side. Remove chicken and set aside. Add scallions, ginger, garlic, and jalapeno pepper to the pot; cook until soft, about 2 minutes.\nPour water and rice into pot; bring to a boil, then lower heat to simmer. Cover the pot partially and cook for about 1 hour, stirring occasionally to prevent rice from sticking to the bottom.\nStir chicken into soup and cover partially. Continue to cook until the soup is creamy with a porridge-like consistency, stirring occasionally, about 1 hour.\nRemove chicken, pull meat from bones, and return meat to the pot. Stir in cabbage, snow peas, bean sprouts, soy sauce, and sesame oil; cook until vegetables are just tender, about 5 minutes. Garnish jook with cilantro.\n",
        "picture_link": "g8u8z3KnrmAeea5Dztmo5g0xI927L2e"
    },
    {
        "title": "Cafe Mocha in a Jar",
        "ingredients": [
            "1/2 cup instant coffee granules ADVERTISEMENT",
            "2 2/3 cups non-fat dry milk powder ADVERTISEMENT",
            "3/4 cup hot cocoa mix ADVERTISEMENT",
            "1/4 cup powdered non-dairy creamer ADVERTISEMENT",
            "1/4 cup confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place instant coffee granules in a food processor and process into a fine powder.\nStir ground instant coffee, milk powder, cocoa mix, creamer, and confectioners' sugar together in a bowl until evenly mixed. Keep in an airtight container.\n",
        "picture_link": "1c7mpDMUF8iXDCfhnfrpAPDKckuHxjW"
    },
    {
        "title": "Creamy Chocolate Hazelnut Frosting",
        "ingredients": [
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "1 cup chocolate-hazelnut spread (such as Jif® Mocha Capuccino-Flavored Hazelnut Spread) ADVERTISEMENT",
            "1 tablespoon milk ADVERTISEMENT",
            "1 1/2 teaspoons cream sherry (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat cream cheese in a bowl with an electric hand mixer until softened. Add hazelnut spread, milk, and cream sherry; continue beating until smoothly combined into a frosting.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Jamie's Pulled Pork Chili",
        "ingredients": [
            "2 (10.75 ounce) cans fat-free, low-sodium chicken broth ADVERTISEMENT",
            "2 cups diced tomatoes ADVERTISEMENT",
            "1 cup drained and rinsed kidney beans ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "2 tablespoons chili powder ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "1 (2 pound) pork shoulder roast ADVERTISEMENT",
            "1 (8 ounce) package shredded Cheddar cheese (such as Kraft®) ADVERTISEMENT",
            "1 1/4 cups sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine chicken broth, tomatoes, kidney beans, onion, chili powder, and cumin in a slow cooker. Add pork shoulder and cover.\nCook on Low for 10 to 12 hours (or cook on High for 7 hours).\nRemove pork shoulder and shred meat; return to slow cooker and stir. Top with Cheddar cheese and sour cream.\n",
        "picture_link": "K0T/wDRb2PGwth1rxD4j4U5VKmZJaRa"
    },
    {
        "title": "Roast Turkey with Cranberry and Pomegranate Glaze",
        "ingredients": [
            "Glaze: ADVERTISEMENT",
            "3/4 cup honey ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "1/2 cup unsalted butter ADVERTISEMENT",
            "1/2 cup cranberry juice ADVERTISEMENT",
            "1/2 cup pomegranate juice ADVERTISEMENT",
            "Turkey: ADVERTISEMENT",
            "1 (10 pound) whole turkey, neck and giblets removed ADVERTISEMENT",
            "1/2 cup unsalted butter, melted ADVERTISEMENT",
            "1/2 cup extra virgin olive oil ADVERTISEMENT",
            "1 tablespoon dried crushed rosemary leaves ADVERTISEMENT",
            "1 teaspoon kosher salt ADVERTISEMENT",
            "1 teaspoon dried thyme leaves ADVERTISEMENT",
            "1/4 teaspoon black pepper ADVERTISEMENT",
            "2 cups fresh whole cranberries ADVERTISEMENT",
            "1 diced sweet onion ADVERTISEMENT",
            "4 cups turkey or chicken stock ADVERTISEMENT",
            "8 sprigs chopped fresh rosemary ADVERTISEMENT",
            "3 bay leaves ADVERTISEMENT",
            "Reynolds Wrap® Aluminum Foil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium-sized pot over medium-high heat, bring the honey, white wine, butter, cranberry juice and pomegranate juice to a boil. Reduce heat to low and allow the mixture to simmer for 10 minutes. Remove from heat and set aside to cool.\nPreheat the oven to 450 degrees F. Rinse the turkey and pat dry. Vigorously whisk together melted butter, olive oil, rosemary, salt, thyme and black pepper until smooth. Rub the mixture all over the entire outside and inside of the turkey, as well as underneath the breast skin of the bird, taking care not to tear the skin.\nEvenly distribute the cranberries and onion on the bottom of a roasting pan. Place the turkey in the roasting pan, breast facing up. Stuff (if desired) and tie the turkey's legs together with cooking twine. Whisk together the turkey stock with 2/3 cup of the glaze and pour the mixture into the roasting pan, around but not over the turkey. Arrange 4 sprigs of rosemary around the bird in the stock and add the bay leaves to the stock in the pan.\nTent Reynolds Wrap® Aluminum Foil over the entire roasting pan, leaving 1 inch between the foil and the skin. Leave a small opening in the tent to allow for basting the bird as it cooks.\nRoast for 30 minutes and then lower the heat to 350 degrees F and continue cooking for 15-20 minutes per pound of turkey. Baste the bird every 20 minutes with the pan drippings and baste the bird with the glaze once per hour. Rotate the roasting pan once every hour to help the bird cook evenly.\nWhen the skin of the bird begins to look lightly golden, take the temperature of the turkey, and once it reaches 165 degrees F in the breast, stuffing cavity and thigh, it is safe to eat. If you want to brown the bird a bit more, remove the foil and roast another 10-15 minutes. It will brown very quickly due to the glaze's sugar content, so keep a close eye on it.\nOnce removed, place the remaining 4 sprigs of fresh rosemary around the turkey for garnish. Allow the bird to rest for 30 minutes before carving and serving.\n",
        "picture_link": "hCaCTbJ5F3lg3S8ASc8sqiMHy/6mcXe"
    },
    {
        "title": "Stuffed Zucchini Shells",
        "ingredients": [
            "2 zucchinis ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 small onion, diced ADVERTISEMENT",
            "4 ounces fresh mushrooms, sliced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 cup crumbled feta cheese ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nTrim ends from zucchini and half each length-wise. Scoop out flesh of zucchini; dice. Arrange zucchini shells into a baking dish.\nHeat olive oil in a 10-inch skillet over medium heat. Cook and stir onion, mushrooms, and garlic in hot oil until the onion is tender, 5 to 7 minutes; season with salt and pepper.\nStir diced zucchini flesh into the onion mixture; cook and stir until hot, about 5 minutes. Spoon zucchini mixture into the shells in the baking dish; top each with 1 tablespoon each feta cheese and Parmesan cheese.\nBake in preheated oven until the zucchini shells are soft, 30 to 40 minutes.\n",
        "picture_link": "BBdCXBYgKCI5e6hRp6GcOrGxdyaaxim"
    },
    {
        "title": "Lazy Green Peas",
        "ingredients": [
            "1 cup frozen peas ADVERTISEMENT",
            "1 tablespoon shredded Italian cheese blend (such as Wegmans®) ADVERTISEMENT",
            "1 teaspoon nutritional yeast, or more to taste ADVERTISEMENT",
            "1 pinch garlic powder, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat frozen peas in a small microwave-safe bowl on high in the microwave until hot, about 3 minutes.\nStir Italian cheese blend, nutritional yeast, and garlic powder into peas; season with salt and black pepper.\n",
        "picture_link": "wwNtuWTX3QQPfszCCVsz.vzMrJki6PW"
    },
    {
        "title": "Bacon Topped Holiday Apple Pie",
        "ingredients": [
            "8 slices Smithfield® Applewood Smoked Bacon ADVERTISEMENT",
            "7 cups sliced cooking apples (such as Granny Smith, Rome or Gala) ADVERTISEMENT",
            "1 1/2 cups fresh or frozen cranberries ADVERTISEMENT",
            "1 tablespoon grated fresh ginger ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "3 tablespoons brown sugar ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1 (9 inch) single pie crust pastry ADVERTISEMENT",
            "3 tablespoons orange juice ADVERTISEMENT",
            "3/4 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup flour ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 425 degrees F. Place pie crust in 9-inch pie plate and flute edges as desired.\nToss together apples and orange juice in large bowl. Add cranberries, walnuts and fresh ginger; mix well.\nStir together flour, 1/2 cup brown sugar, cinnamon and nutmeg in small bowl. Add to apples and toss until apples are evenly coated. Pour mixture into prepared pie crust.\nWeave bacon slices together over top of pie, leaving 1-inch spaces between slices (4 slices by 4 slices); tuck ends of strips under apples where needed. Sprinkle remaining 3 tablespoons brown sugar over top of bacon slices.\nBake pie in 425 degrees F oven for 15 minutes. Reduce temperature to 350 degrees F and bake approximately 50 minutes until bacon is browned and crisp. Cover edges of crust if start to get too dark. Let pie stand 15 minutes before slicing to serve. Cover and refrigerate leftovers. Pie is best served warm.\n",
        "picture_link": "vBgsTg5MZ0Tgrt2tyZvJQm3RO8SWAbq"
    },
    {
        "title": "Grilled Fish and Bacon Pinwheels",
        "ingredients": [
            "1 pound bacon ADVERTISEMENT",
            "3 pounds skinned and boned cobia fillet ADVERTISEMENT",
            "8 metal skewers ADVERTISEMENT",
            "1 cup barbecue sauce, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium-high heat and lightly oil the grate.\nCut cobia fillets into long strips about 1/2-inch thick and 18-inches long.\nPlace a strip of bacon atop each strip of fish. Starting at one end, begin to roll the layered strips into a flat coil like a pinwheel or the classic-style lollipop. Thread onto metal skewers to keep together.\nCook on preheated grill, basting with barbecue sauce, until the fish is firm and flaky and the bacon is cooked through, about 5 minutes per side.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chocolate Fig Cake",
        "ingredients": [
            "1 cup chopped dried black mission figs ADVERTISEMENT",
            "1 cup hot brewed coffee ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "1 cup Sugar In The Raw® Organic White ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 cup buttermilk ADVERTISEMENT",
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "3/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 1/2 teaspoons baking soda ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "2 ounces white chocolate baking bar ADVERTISEMENT",
            "1 ounce bittersweet chocolate baking bar ADVERTISEMENT",
            "1/4 teaspoon vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 350 degrees F. Spray heavy nonstick 12-cup fluted tube pan with cooking spray. In medium bowl, mix figs and coffee; set aside. In large bowl, beat butter and Sugar In The Raw Organic White with electric mixer on medium speed until smooth and creamy. Beat in eggs and vanilla. Slowly add buttermilk. Beat in 1 3/4 cups flour, cocoa, baking soda and baking powder on low speed until mixed. Drain figs, reserving coffee. Slowly mix in reserved coffee. Pour batter into pan. Pat figs dry with paper towels. Sprinkle with 1 tablespoon flour and toss to coat. Sprinkle over batter in pan. Pull table knife through batter to distribute figs. Bake 40 to 50 minutes or until toothpick inserted in center comes out clean. Cool in pan 10 minutes. Remove from pan to cooling rack. Cool completely, about 1 hour.\nIn 2 small microwaveable bowls, melt white baking bar and bittersweet baking bar with a few drops of oil. Drizzle white chocolate over cake with fork. Then drizzle dark chocolate over cake. Let stand until set, about 2 hours. Or refrigerate 15 minutes until completely set.\n",
        "picture_link": "PHVxuRtYKQfVDJM6mrCjmf3eWJeZ0ia"
    },
    {
        "title": "OREO & Apple Hand Pies",
        "ingredients": [
            "1 (14.1 ounce) package ready-to-use refrigerated pie crusts ADVERTISEMENT",
            "2 small Granny Smith apples ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "11 OREO Cookies, divided ADVERTISEMENT",
            "3 tablespoons powdered sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 375 degrees F.\nUnroll 1 pie crust on work surface; use 4-inch cutter to cut into 9 rounds, re-rolling scraps as necessary. Repeat with remaining pastry crust.\nCore apples; cut crosswise into a total of 9 rings. Whisk egg and water until blended.\nPlace 9 pastry rounds in single layer on parchment-covered baking sheet; brush edges with egg. Top each with 1 each apple ring and cookie. Cover with remaining pastry rounds; press edges together to seal.\nCrush remaining cookies finely; sprinkle over pies.\nBake 18 to 22 min. or until golden brown. Cool completely. Dust with sugar just before serving.\n",
        "picture_link": "Y8gTxdv7W0UsGFCEPMarG34gxUYSofy"
    },
    {
        "title": "Prosciutto-Wrapped Pork Tenderloin with Crispy Sage",
        "ingredients": [
            "1 pound pork tenderloin ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 bunch fresh sage, leaves removed and stems discarded, divided ADVERTISEMENT",
            "6 ounces prosciutto ADVERTISEMENT",
            "1 tablespoon olive oil, or more as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nLightly season pork with salt and black pepper. Arrange about 6 sage leaves over tenderloin. Wrap prosciutto around tenderloin and sage, overlapping prosciutto slightly; wrap in plastic wrap and refrigerate to allow prosciutto to set on pork tenderloin, 5 to 10 minutes. Remove plastic wrap.\nHeat olive oil in a skillet over medium heat. Fry wrapped tenderloin in the hot oil until prosciutto is crispy and lightly browned on all sides, 8 to 10 minutes. Transfer wrapped tenderloin to a baking dish, reserving oil in the skillet.\nBake tenderloin in the preheated oven until pork is cooked through, about 20 minutes. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C).\nHeat reserved oil in the skillet over medium heat; fry remaining sage leaves until crispy, adding more oil as needed, about 5 minutes.\nSlice tenderloin and serve with crispy sage leaves.\n",
        "picture_link": "fe7Miw2g4Gs.Echg8YWjo0hys8mbHg6"
    },
    {
        "title": "You're Bacon-Me Crazy",
        "ingredients": [
            "1 pound bacon, sliced crosswise into 1/2-inch pieces ADVERTISEMENT",
            "12 ounces sour cream ADVERTISEMENT",
            "12 ounces ranch dressing ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "1 (18 ounce) package scoop-shaped tortilla chips (such as Fritos® Scoops®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels until cool.\nStir sour cream, ranch dressing, and Cheddar cheese together in a large bowl. Crumble bacon into the dip; mix well.\nChill until flavors blend, about 1 hour. Serve dip with chips.\n",
        "picture_link": "BnknAPZVt.TkdreI2rgNqnC0tkAQJ7i"
    },
    {
        "title": "Pumpkin Pie Milkshake ",
        "ingredients": [
            "5 scoops vanilla ice cream ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "3 tablespoons pumpkin pie filling ADVERTISEMENT",
            "1 teaspoon brown sugar ADVERTISEMENT",
            "1/2 teaspoon pumpkin pie spice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend ice cream, milk, pumpkin pie filling, brown sugar, and pumpkin pie spice in a blender until smooth.\n",
        "picture_link": "14nJdFwVZeZX/Fj/ncs76Ym8soruSNC"
    },
    {
        "title": "Fennel, Apple and Blue Cheese Stuffed Pork Loin",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 medium shallots, diced ADVERTISEMENT",
            "1 medium fennel bulb, diced ADVERTISEMENT",
            "1/2 teaspoon fennel seeds, crushed ADVERTISEMENT",
            "2 tablespoons minced fresh rosemary, divided ADVERTISEMENT",
            "1 large tart, firm apple (like Granny Smith), diced ADVERTISEMENT",
            "1/2 teaspoon kosher salt ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1 teaspoon apple cider vinegar ADVERTISEMENT",
            "1 tablespoon apple brandy ADVERTISEMENT",
            "1/2 cup crumbled Gorgonzola dolce or other blue cheese ADVERTISEMENT",
            "2 bacon strips, cooked crisp, fat drained and crumbled ADVERTISEMENT",
            "1 3/4 pounds boneless pork loin roast, butterflied ADVERTISEMENT",
            "Kitchen twine ADVERTISEMENT",
            "Reynolds Wrap® Heavy Duty Aluminum Foil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F. In a medium saute pan, heat 1 tablespoon olive oil. Add the garlic and shallots and cook on medium heat until fragrant and translucent, about 1-2 minutes. Add the fennel, fennel seed, 1 tablespoon of the rosemary, apple, salt, black pepper, honey, vinegar, and apple brandy. Cook on medium heat until the apple and fennel are browned, about 15 minutes. Fennel should be soft but not mushy and still have some firmness. Remove the filling from heat and cool to room temperature. Toss in the blue cheese and the crispy bacon.\nLine a baking sheet with a heavy sheet of Reynolds Wrap® Heavy Duty Aluminum Foil, making sure the sheet is long enough to wrap up over the ends of the roast. Layer another two sheets of aluminum foil over the first one. Set aside.\nPlace the pork loin fat side down on a work surface, season the inside lightly with salt and pepper and then evenly spread the filling. Roll the pork up lengthwise and tie it securely with kitchen twine. Rub with remaining olive oil and season evenly with kosher salt. Heat a large heavy skillet (big enough to hold the entire loin) over high heat until very hot. Add the pork loin and brown very well on all sides, about 1 minute per side.\nUsing tongs, place the roast in the center of the foil. Sprinkle with pepper and the rest of the rosemary. Bring up foil sides. Double fold top and ends to seal packet, leaving room for heat circulation inside.\nBake the wrapped loin for 45 minutes or until an instant-read meat thermometer reads 130 degrees F. Let the pork rest, wrapped, for 10 minutes. Open packet carefully by cutting along top fold with a sharp knife, allowing steam to escape; then open top of foil packet. Slice and serve.\n",
        "picture_link": "o8UVMTJ2taH6jrn5mYRY0FYArUe9QhC"
    },
    {
        "title": "Roasted Sausage and Sauerkraut",
        "ingredients": [
            "2 (13 ounce) packages smoked kielbasa sausage, cut into bite-size pieces ADVERTISEMENT",
            "1 medium onion, thinly sliced ADVERTISEMENT",
            "1 (32 ounce) package sauerkraut, drained ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon butter, melted ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "1/4 teaspoon caraway seeds ADVERTISEMENT",
            "2 green apples, coarsely chopped ADVERTISEMENT",
            "Salt to taste ADVERTISEMENT",
            "Reynolds Wrap® Heavy Duty Aluminum Foil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F. Lay a large sheet of Reynolds Wrap® Heavy Duty Aluminum Foil on a baking sheet. In the center of the foil, combine the sausage, onion, sauerkraut, oil, butter, pepper and caraway seeds; mix well. Bring up foil sides. Double fold top and ends to make a packet, leaving room for heat circulation inside. Place the foil package in preheated oven and roast for 30 minutes.\nOpen packets carefully by cutting along top fold with a sharp knife, allowing steam to escape; then open top of foil packet. Stir in the green apples and reseal, adding another piece of foil to the top if necessary. Return to the oven for 10 more minutes. Remove from the oven, add salt to taste and serve.\n",
        "picture_link": "gTaFUUYeNy3qJVv6fQXoQHYQAbyJ4f6"
    },
    {
        "title": "Pineapple Mango Daiquiri",
        "ingredients": [
            "2 (1.5 fluid ounce) jiggers mango nectar ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger pineapple juice ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger rum ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger triple sec ADVERTISEMENT",
            "1/2 lime, juiced ADVERTISEMENT",
            "2 cups ice cubes, or as desired ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour mango nectar, pineapple juice, rum, triple sec, and lime juice into a blender and pulse once or twice to combine. Add ice cubes and blend until drink is slushy and no ice chunks remain, 1 to 2 minutes. Serve in a glass with additional ice if desired.\n",
        "picture_link": "dmbPO18HdgeZqVq74rAf4fqByB4xy5C"
    },
    {
        "title": "Eggnog Rum Muffins",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1 teaspoon nutmeg ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup walnuts, chopped (optional) ADVERTISEMENT",
            "1 cup eggnog ADVERTISEMENT",
            "1/3 cup butter, melted ADVERTISEMENT",
            "1/4 cup rum ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line 12 muffin cups with paper liners or grease.\nCombine flour, sugar, baking powder, nutmeg, and salt in a large bowl; mix in walnuts.\nCombine eggnog, melted butter, rum, egg, and vanilla extract in a separate bowl; stir into flour mixture until just moistened, forming a lumpy batter.\nPour batter into prepared muffin cups and bake in preheated oven until a toothpick inserted into the center comes out clean, about 15 minutes.\n",
        "picture_link": "6JVNR.fCayp1EiQ69IOqltZzdUK87zW"
    },
    {
        "title": "Homemade Peach Tea",
        "ingredients": [
            "Peach Syrup: ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 slices fresh peach, or more to taste ADVERTISEMENT",
            "Tea: ADVERTISEMENT",
            "6 cups water ADVERTISEMENT",
            "3 tea bags ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix 1 cup water, sugar, and peach slices together in a saucepan; bring to a boil. Reduce heat to medium and simmer, crushing peach slices as you stir, until sugar is dissolved, about 5 minutes. Remove saucepan from heat, cover, and allow peaches to infuse syrup, about 30 minutes. Strain to remove peach slices.\nBring 6 cups remaining water to a boil in a separate pot. Remove from heat, add tea bags, cover, and steep for about 5 minutes.\nRemove tea bags from the pot, pour in peach syrup, and cool to room temperature. Refrigerate until ready to serve.\n",
        "picture_link": "PbrO5vNwixJTgrsWYV1OP.tjKUgxicu"
    },
    {
        "title": "Peanut Butter Bliss Cookies - Vegan, Gluten-Free, No-Sugar-Added",
        "ingredients": [
            "1 1/4 cups finely chopped pitted dates ADVERTISEMENT",
            "1 cup natural peanut butter ADVERTISEMENT",
            "1/4 cup almond milk ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1/2 cup oat flour, or more as needed ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt (optional) ADVERTISEMENT",
            "2 tablespoons raisins, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Line 2 baking sheet with parchment paper.\nCombine dates and peanut butter in a food processor; process on high in 15-second intervals, gradually adding almond milk while processing, until mixture is smooth. Add vanilla extract and mix well.\nMix oat flour, baking soda, and salt together in a bowl. Mix date mixture into flour mixture, adding more oat flour if needed, until dough holds together. Form dough into balls, 1 to 2 tablespoons each, and arrange on the prepared baking sheets. Press a fork into each dough ball, dipping fork in water after each press. Gently press a few raisins into each one.\nBake in the preheated oven until edges are just beginning to turn golden, 8 to 12 minutes. Cool completely before eating.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Mrs. P's Biscotti",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "1/4 cup softened butter ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment.\nBeat sugar and butter together in a large bowl with an electric mixer until light and fluffy; beat in eggs, egg yolk, and vanilla extract. Whisk flour and baking powder together in a bowl. Stir flour mixture into butter mixture to form a fairly sticky dough.\nDivide dough in half; with wet hands, shape dough into two loaves, about 1-inch high at the center, on the prepared baking sheet.\nBake in the preheated oven until lightly browned, about 20 minutes; remove to cool completely on a wire rack, about 30 minutes.\nSlice loaves into 1/2-inch slices with a serrated knife. Place cookie slices back onto lined baking sheet, cut sides up.\nIncrease oven temperature to 450 degrees F (230 degrees C).\nBake in the preheated oven until golden brown, turning once, 3 to 4 minutes per side.\n",
        "picture_link": "L0hPIb.zxt7Dy5M1nESk8AEPT2MyrwC"
    },
    {
        "title": "Sauerbraten Beef in Gingersnap Gravy",
        "ingredients": [
            "2 pounds cubed beef stew meat ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "1 cup beef broth ADVERTISEMENT",
            "1 cup red wine vinegar ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "3 cups egg noodles ADVERTISEMENT",
            "3/4 cup crushed gingersnap cookies ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine beef stew meat, onion, beef broth, vinegar, and bay leaves in a slow cooker.\nCook on Low for 7 to 9 hours.\nBring a large pot of lightly salted water to a boil. Cook egg noodles in the boiling water, stirring occasionally until tender yet firm to the bite, 4 to 5 minutes. Drain.\nRemove bay leaves from beef mixture; stir in crushed gingersnaps and brown sugar. Cook beef mixture on Low until thickened, about 15 minutes. Serve sauerbraten over egg noodles and garnish with parsley.\n",
        "picture_link": "syOYl5W0.JNK4QeVgz4FhJniLZxQWjO"
    },
    {
        "title": "Becel Anything Goes Cookie Dough Salted Caramel Cookies",
        "ingredients": [
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup Becel® Buttery Taste or Original Margarine* ADVERTISEMENT",
            "1 cup firmly packed light brown sugar ADVERTISEMENT",
            "1/4 cup granulated sugar ADVERTISEMENT",
            "2 large Naturegg™ Omega 3 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3/4 cup HERSHEY'S® Chipits® SKOR™ Toffee Bits ADVERTISEMENT",
            "3/4 cup HERSHEY'S® Chipits® Butterscotch Flavoured Baking Chips ADVERTISEMENT",
            "1 teaspoon coarse sea salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 C). Combine flour, baking soda and salt in medium bowl; set aside.\nBeat Becel Buttery Taste margarine with sugars in large bowl. Beat in eggs and vanilla until blended. Gradually add in flour mixture; beat just until blended. Stir in toffee and butterscotch chips. Drop by tablespoonfuls on ungreased baking sheets, 2-inches (5 cm) apart. Evenly sprinkle with sea salt.\nBake 7 minutes or until edges are golden. Cool cookies on sheets 2 minutes on wire rack; remove cookies from sheets and cool completely.\n",
        "picture_link": "pOHb53X2MlfTPT9JRUBChJeXy3BhaJi"
    },
    {
        "title": "Zucchini Pasta with Roasted Red Pepper Sauce and Chicken",
        "ingredients": [
            "6 roma tomatoes ADVERTISEMENT",
            "3 red bell peppers, chopped ADVERTISEMENT",
            "1 large sweet onion, halved ADVERTISEMENT",
            "3 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "4 cloves garlic ADVERTISEMENT",
            "1 (28 ounce) can crushed tomatoes ADVERTISEMENT",
            "1 cup tightly packed fresh basil leaves, chopped ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 yellow summer squash, cut into spirals using a spiral slicer ADVERTISEMENT",
            "2 zucchini, cut into spirals using a spiral slicer ADVERTISEMENT",
            "2 cooked chicken breast halves, cubed ADVERTISEMENT",
            "1 tablespoon grated Parmesan cheese, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat grill for medium heat and lightly oil the grate.\nGrill tomatoes, bell peppers, and onion halves on the preheated grill until well charred, about 15 minutes. When peppers are cool enough to handle, split with a knife and remove seeds.\nHeat olive oil in a large skillet; cook and stir garlic until fragrant, about 1 minute. Stir canned crushed tomatoes, basil, grilled tomatoes, bell peppers, and onion into skillet; bring to a boil, reduce heat, and simmer until vegetables are tender, about 10 minutes. Puree vegetable mixture with a stick blender; season with salt and pepper and keep at a simmer.\nBring a large pot of water to a boil; drop in summer squash and zucchini spirals and cook until tender, about 3 minutes. Drain water from pot; lay spirals on paper towels to drain completely.\nPlace squash spirals on individual plates; top with a portion of cooked chicken, a generous amount of red pepper sauce, and Parmesan cheese.\n",
        "picture_link": "SFUOPCR8X9P8ssEF7qMeixdzL8Ypntq"
    },
    {
        "title": "Gingerbread Granola Bars",
        "ingredients": [
            "8 cups old-fashioned rolled oats ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "3 cups brown sugar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 tablespoon ground cinnamon ADVERTISEMENT",
            "1 1/2 teaspoons ground cloves ADVERTISEMENT",
            "1 1/2 teaspoons ground ginger ADVERTISEMENT",
            "2 cups vegetable oil ADVERTISEMENT",
            "1 cup honey ADVERTISEMENT",
            "3/4 cup molasses ADVERTISEMENT",
            "4 eggs, beaten ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease two 9x13-inch baking sheets.\nMix oats, flour, brown sugar, white sugar, salt, cinnamon, cloves, and ginger in a large bowl. Stir in oil, honey, molasses, and eggs. Mix until well-combined. Pat mixture onto baking sheets using your hands.\nBake in the preheated oven until edges begin to brown and center no longer looks glossy, 15 to 20 minutes.\nCool for about 10 minutes; cut into bars while still warm.\n",
        "picture_link": "VHxKme1GEHGqRiyFactRJM.xoUW1wPG"
    },
    {
        "title": "The Best Post Workout Shake",
        "ingredients": [
            "1 scoop whey protein powder ADVERTISEMENT",
            "1 tablespoon flax seed meal ADVERTISEMENT",
            "1 tablespoon unsweetened cocoa powder ADVERTISEMENT",
            "1 teaspoon brown sugar (optional) ADVERTISEMENT",
            "1 cup unsweetened almond milk ADVERTISEMENT",
            "1 banana ADVERTISEMENT",
            "1/2 cup frozen mixed berries ADVERTISEMENT",
            "1 tablespoon smooth peanut butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Layer protein powder, flax meal, cocoa powder, and brown sugar in a blender; add almond milk, banana, berries, and peanut butter. Blend until smooth, about 1 minute.\n",
        "picture_link": "xvhrqmPZNN7Rl9/NI8cbw5naIO1bTGa"
    },
    {
        "title": "Cheesy Vegetarian Egg Bake",
        "ingredients": [
            "2 tablespoons butter, divided ADVERTISEMENT",
            "1 cup sliced mushrooms ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "2 teaspoons dried parsley ADVERTISEMENT",
            "6 large eggs ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 cup shredded Cheddar cheese, divided ADVERTISEMENT",
            "1/2 (15 ounce) can black beans, rinsed and drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease an 8x8-inch casserole dish.\nMelt 1 tablespoon butter in a saucepan over medium heat; cook and stir mushrooms, green bell pepper, onion, and parsley until mushrooms are lightly browned, about 10 minutes.\nPlace remaining 1 tablespoon butter in a microwave-safe bowl; heat in microwave until melted, about 10 seconds. Whisk melted butter, eggs, milk, salt, and pepper together in a bowl; stir in mushroom mixture, 1/2 of the Cheddar cheese, and black beans. Pour egg mixture into the prepared baking dish and top with remaining Cheddar cheese.\nBake in the preheated oven until eggs are puffed and cheese is bubbling, about 45 minutes.\n",
        "picture_link": "gCWzT.e7gxKLcu1zsr43raMLrmQspp."
    },
    {
        "title": "Honey Bourbon Horseradish Glazed Ham",
        "ingredients": [
            "1 (12 ounce) bottle horseradish mustard, divided ADVERTISEMENT",
            "2/3 cup bourbon ADVERTISEMENT",
            "2/3 cup dark brown sugar ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1 tablespoon liquid hickory smoke flavoring ADVERTISEMENT",
            "1 (6 pound) smoked ham, or more to taste ADVERTISEMENT",
            "1 tablespoon whole cloves, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine 2/3 cup horseradish mustard, bourbon, brown sugar, honey, and liquid smoke together in a small saucepan; bring to a boil. Reduce heat to medium-low and simmer glaze, stirring frequently, until thickened, at least 30 minutes.\nLiberally coat ham with the remaining horseradish mustard and place in a roasting pan. Spoon glaze over ham.\nBake in the preheated oven, basting occasionally, until until the internal temperature of the ham has reached 160 degrees F (72 degrees C), about 2 hours. (Generally bake 22 minutes per pound.)\n",
        "picture_link": "SiGq60YLnLO035FOlLaYrtCZS8Lqwv2"
    },
    {
        "title": "Spicy Chickpea Tagine",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 onions, minced ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "2 teaspoons ground turmeric ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 1/2 teaspoons agave nectar ADVERTISEMENT",
            "2 tablespoons water, or as needed ADVERTISEMENT",
            "3 carrots, cut into 1/4-inch slices ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 (14 ounce) cans chickpeas (garbanzo beans), drained and rinsed ADVERTISEMENT",
            "4 lemon wedges ADVERTISEMENT",
            "4 sprigs fresh cilantro, or as desired ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a tagine or Dutch oven over medium heat; cook and stir onions and garlic until softened, 5 to 10 minutes. Add turmeric, cumin, agave nectar, cinnamon, cayenne pepper, and black pepper and stir until onion mixture is evenly coated. Add just enough water to cover the bottom of the tagine; add carrots and salt. Cook over medium-low for 12 minutes.\nMix chickpeas into carrot mixture, adding more water if needed to cover the bottom but keeping the sauce thick. Cook mixture for 7 minutes.\nServe tagine with lemon wedges and cilantro.\n",
        "picture_link": "nIFKiErEUTuFWa8naR3vQOZxPDjWFaS"
    },
    {
        "title": "Pink Peppermint Cupcake",
        "ingredients": [
            "1 (18.25 ounce) package white cake mix ADVERTISEMENT",
            "1 1/3 cups water ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "1/2 teaspoon peppermint extract ADVERTISEMENT",
            "1 dash red food coloring, or as desired (optional) ADVERTISEMENT",
            "1 (16 ounce) package vanilla frosting ADVERTISEMENT",
            "1/2 cup crushed peppermint candies ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line muffin cups with paper or aluminum foil liners.\nBeat cake mix, water, egg whites, butter, peppermint extract, and food coloring together in a bowl using an electric mixer on low speed for 30 seconds. Increase speed to medium and continue to beat until smooth, scraping down sides as needed, about 2 minutes. Spoon batter into prepared muffin cups, filling about 3/4-full.\nBake in the preheated oven until a toothpick inserted in the center comes out clean, 20 to 22 minutes. Rotate tins halfway through the baking process to promote even baking. Transfer cupcakes to a wire rack to cool completely.\nFrost cupcakes with vanilla frosting and top with crushed candies.\n",
        "picture_link": "y2r.nQvVco/JG8oKzPi0WfBAiMlpHK."
    },
    {
        "title": "Ultimate Flax Pizza Crust",
        "ingredients": [
            "7 fluid ounces water ADVERTISEMENT",
            "1 1/4 teaspoons active dry yeast ADVERTISEMENT",
            "1 teaspoon honey ADVERTISEMENT",
            "1 cup bread flour ADVERTISEMENT",
            "3/4 cup whole wheat flour ADVERTISEMENT",
            "1/2 cup flax seed meal ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix water, yeast, and honey together in the bowl of a stand mixer fitted with a dough hook; let sit until yeast is dissolved, about 5 minutes.\nCombine bread flour, whole wheat flour, flax seed meal, and salt in a bowl. Add flour mixture and olive oil to yeast mixture. Mix on low speed for 5 minutes. Increase speed to high and knead for 5 minutes more. Cover bowl with plastic wrap and let sit in a warm place until dough doubles in size, about 1 hour.\nTransfer dough to an oiled work surface about the same size as the pizza pan. Flatten dough with oiled hands by pressing it in the middle and working to the edges until dough has been flattened to the size of pizza pan.\nOil the pizza pan and invert it over the dough. Pick up the work surface and the pizza pan and invert the whole stack so the dough ends up on the pizza pan. If the dough doesn't come off right away, just set it down and the dough should fall onto the pizza pan within 5 minutes. Pull the edges of the dough to the edge of the pizza pan; let rest for 10 minutes.\n",
        "picture_link": "0V3IM4yHXrhjZEcdQFyldj8BHP6FKEa"
    },
    {
        "title": "Maple Granola",
        "ingredients": [
            "1/2 cup maple syrup ADVERTISEMENT",
            "1/3 cup coconut oil, melted ADVERTISEMENT",
            "4 cups old-fashioned oats, or more to taste ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "1/2 cup almond flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C).\nMix maple syrup and coconut oil together in a bowl; add oats, pecans, and almond flour and mix until evenly coated. Spread onto a baking sheet.\nBake in the preheated oven until lightly browned, about 40 minutes.\n",
        "picture_link": "DsC/COj5yUij/rN0zAiuepAtdR9YiW6"
    },
    {
        "title": "Gingerbread Latte Syrup",
        "ingredients": [
            "2/3 cup agave nectar ADVERTISEMENT",
            "1 tablespoon molasses ADVERTISEMENT",
            "1 tablespoon ground ginger ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "2 pinches ground cloves ADVERTISEMENT",
            "2 pinches salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk agave, molasses, ginger, vanilla extract, cinnamon, cloves, and salt in a bowl until well-mixed, about 2 minutes.\n",
        "picture_link": "Uk/Aly2J6ol5X1O6lx9QMEI8/y/b2jO"
    },
    {
        "title": "Love That Leftover Turkey Pot Pie",
        "ingredients": [
            "3/4 cup frozen peas and carrots ADVERTISEMENT",
            "3/4 cup frozen cut green beans ADVERTISEMENT",
            "3/4 cup sliced celery ADVERTISEMENT",
            "3/4 cup butter ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2/3 cup all-purpose flour ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 teaspoon celery seed ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "1 3/4 cups chicken broth ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 cup leftover cooked sweet potatoes, cubed or pureed ADVERTISEMENT",
            "2 cups leftover roast turkey, cubed ADVERTISEMENT",
            "2 unbaked 9-inch pie crusts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F.\nBoil peas, carrots, green beans, and celery in a saucepan until tender. Drain, set veggies aside.\nMelt butter in a saucepan on medium heat and cook onion until translucent. Stir in 2/3 cup of flour as well as salt, pepper, celery seed and onion powder. Slowly whisk in chicken broth and milk until the mixture is smooth, comes to a simmer, and thickens. Remove from stove and mix in sweet potatoes.\nStir vegetables and turkey meat into the mixture. Drape pie crust in bottom of pie dish. Spoon filling into the crust, then top with the second crust.\nPinch the edges, poke some steam holes on top, and bake in the preheated oven until crusts are golden brown and the internal temperature of the pie is at least 165 degrees F. This should take about 30-35 minutes. If the crust starts to brown before the filling gets hot, cover the top crust gently with a sheet of foil. Cool before serving.\n",
        "picture_link": "vrrlrYvWgZaEOW32p4yJXMdWKjbDwJe"
    },
    {
        "title": "Vern's Obatzda-Style Cheese",
        "ingredients": [
            "1 head garlic ADVERTISEMENT",
            "1 teaspoon olive oil ADVERTISEMENT",
            "16 ounces Camembert cheese, rind removed and cheese cut into pieces ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese ADVERTISEMENT",
            "1 (5 ounce) package grated Parmesan cheese ADVERTISEMENT",
            "3 ounces shredded extra-sharp Cheddar cheese ADVERTISEMENT",
            "1 cup German-style beer ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/2 cup minced onion ADVERTISEMENT",
            "2 teaspoons caraway seeds ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Bring all the refrigerated ingredients to room temperature.\nSlice the top off the garlic, exposing the cloves. Place in a square of aluminum foil and drizzle olive oil over garlic. Wrap foil around garlic.\nRoast in the preheated oven until garlic is tender, 35 to 40 minutes. Cool roasted garlic completely.\nCombine Camembert cheese, cream cheese, Parmesan cheese, Cheddar cheese, beer, and butter in a food processor; process until smooth. Add roasted garlic cloves, onion, caraway seeds, and paprika; process until smooth. The mixture may be a little on the \"soupy\" side but will firm up upon refrigeration; transfer to an air-tight container and refrigerate until flavors blend, at least 2 hours.\n",
        "picture_link": "nLHJJxMh3kQMS5c.jB4iWER4yLdroVq"
    },
    {
        "title": "Stuffing Meatloaf",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "3/4 cup chicken-flavored bread stuffing mix (such as Kraft® Stove Top®) ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup shredded mozzarella cheese, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease one 9x5-inch loaf pan with cooking spray.\nMix beef, onion, stuffing mix, and egg by hand in a bowl. Press beef mixture into prepared pan.\nBake in the preheated oven until no longer pink in the center, 35 to 40 minutes. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C).\nTop meatloaf with shredded mozzarella cheese and let rest while cheese melts, about 10 minutes.\n",
        "picture_link": "rqeEKbey9V828C.5JQ2lRcYr/eAWF.W"
    },
    {
        "title": "Becel Anything Goes Cookie Dough Apple Spice Oatmeal Cookies",
        "ingredients": [
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup Becel® Buttery Taste or Original Margarine* ADVERTISEMENT",
            "1 cup firmly packed light brown sugar ADVERTISEMENT",
            "1/4 cup granulated sugar ADVERTISEMENT",
            "2 large Naturegg™ Omega 3 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups old-fashioned or quick oats ADVERTISEMENT",
            "1/2 cup chopped dried apples or fresh apple ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "3 tablespoons HERSHEY'S® Chipits® White Chocolate Baking Chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Combine flour, baking soda and salt in medium bowl; set aside.\nBeat Becel Buttery Taste margarine with sugars in large bowl. Beat in eggs and vanilla until blended. Gradually add in flour mixture; beat just until blended. Stir in oats, apples and cinnamon.\nDrop by tablespoonfuls onto ungreased baking sheets, 2-inches (5 cm) apart.\nBake 8 minutes or until edges are golden. Cool 2 minutes on wire rack; remove cookies from sheets and cool completely. Microwave chocolate in small microwave-safe bowl until melted. Drizzle cookies with chocolate.\n",
        "picture_link": "mxfYFGdIhcjwwi7xWdOi8eochYiRUES"
    },
    {
        "title": "Rustic Whole Wheat Bread",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "3 cups whole wheat flour ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "2 tablespoons instant yeast ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "3 1/2 cups warm water (110 to 120 degrees F) ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir all-purpose flour, whole wheat flour, brown sugar, instant yeast, and salt together in the bowl of an electric mixer fitted with a dough hook attachment. Whisk water and oil together in a cup; pour into flour mixture. Mix on low speed until dough pulls away from the sides of the bowl into a ball.\nTurn dough out onto a lightly floured surface; knead just until dough is smooth, about 1 minute. Divide and shape dough into 3 balls for small loaves or 2 balls for larger loaves. Dust loaves with flour and place onto a baking sheet; cover with a towel, and let rise until doubled in size, about 25 minutes.\nPreheat oven to 375 degrees F (190 degrees C). Slash an \"X\" about 1/4-inch deep in tops of loaves with a sharp knife.\nBake in the preheated oven until loaves are golden brown and sound hollow when tapped, about 25 minutes. Remove from oven to cool completely on a wire rack.\n",
        "picture_link": "3OzIprCXcpnC5LuZrSv8i1WIpNYf5gW"
    },
    {
        "title": "Becel Anything Goes Cookie Dough Mocha Crinkle Cookies",
        "ingredients": [
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup Becel® Buttery Taste or Original Margarine* ADVERTISEMENT",
            "1 cup firmly packed light brown sugar ADVERTISEMENT",
            "1/4 cup granulated sugar ADVERTISEMENT",
            "2 large Naturegg™ Omega 3 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 cup instant coffee granules or instant espresso ADVERTISEMENT",
            "2 tablespoons skim milk or water ADVERTISEMENT",
            "1/2 cup HERSHEY'S® Cocoa ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Combine flour, baking soda and salt in medium bowl; set aside.\nBeat Becel Buttery Taste margarine with sugars in large bowl. Beat in eggs and vanilla until blended. Gradually add in flour mixture; beat just until blended. Stir coffee granules into milk. Stir milk mixture and cocoa powder into dough. Drop by tablespoonfuls into confectioners sugar; roll to generously coat. Arrange on ungreased cookie sheets.\nBake 8 minutes or until edges are firm. Cool 2 minutes on wire rack; remove cookies from sheets, cool completely.\n",
        "picture_link": "ABCREaza0U1eD6QamncYvGXw0Pcxs3q"
    },
    {
        "title": "Maggie's Spicy Tuna Sandwich",
        "ingredients": [
            "2 (5 ounce) cans tuna in water, drained ADVERTISEMENT",
            "1 large ripe tomato, diced ADVERTISEMENT",
            "2 tablespoons canned sliced jalapeno peppers with juice ADVERTISEMENT",
            "2 tablespoons chopped broccoli ADVERTISEMENT",
            "2 tablespoons basil pesto ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 teaspoon chopped fresh chives ADVERTISEMENT",
            "1/8 teaspoon cayenne pepper ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons seasoned croutons ADVERTISEMENT",
            "4 large lettuce leaves ADVERTISEMENT",
            "1 tomato, sliced ADVERTISEMENT",
            "8 slices whole wheat bread ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix tuna, diced tomato, jalapeno with liquid, broccoli, pesto, garlic, chives, and cayenne pepper in a bowl. Season to taste with salt and pepper. Mix well and top with seasoned croutons.\nAssemble sandwiches by layering lettuce leaves, sliced tomato, and tuna mixture between sliced bread.\n",
        "picture_link": "RiTPxXacPnKm9XKdQ/SfPri3bxhH6OK"
    },
    {
        "title": "Ice, Smoke, and Fire",
        "ingredients": [
            "1 (750 milliliter) bottle vodka ADVERTISEMENT",
            "1 (7 ounce) can chipotle peppers in adobo sauce, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour vodka into a plastic or glass bowl with a tight-fitting lid and stir in chilies with their sauce. Save the empty vodka bottle. Store vodka mixture in refrigerator for 4 weeks, shaking or stirring once per day. Strain through several layers of cheesecloth and pour back into the vodka bottle using a funnel. Seal the bottle and store the flavored vodka in the freezer.\n",
        "picture_link": "TBEGG0/56S59C94MCqrhqUZ8/jX7hgC"
    },
    {
        "title": "Millet and Beef Stuffed Peppers",
        "ingredients": [
            "1/2 cup millet ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "2 cubes vegetable bouillon ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 garlic cloves, crushed ADVERTISEMENT",
            "1/2 pound ground beef ADVERTISEMENT",
            "3 tablespoons tomato paste ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 teaspoon cumin ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 tablespoon chopped fresh cilantro ADVERTISEMENT",
            "1/4 cup chopped feta cheese ADVERTISEMENT",
            "4 large red bell peppers, tops removed and set aside and seeds removed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 450 degrees F (230 degrees C). Grease a baking dish.\nCombine millet, water, and vegetable bouillon in a saucepan; bring to a boil. Reduce heat to low, cover, and simmer until water is absorbed, about 15 minutes.\nHeat olive oil in a skillet over medium heat; cook and stir onion and garlic until onion is tender, 8 to 10 minutes. Add ground beef and cook until beef is crumbly and browned, 8 to 10 minutes. Stir in tomato paste, paprika, cumin, cayenne pepper, and black pepper; stir and simmer to combine flavors, about 5 minutes.\nMix cooked millet, cilantro, and feta cheese into ground beef mixture. Spoon mixture into red bell peppers; place in prepared baking dish.\nBake in the preheated oven until peppers are slightly tender, 15 to 20 minutes. Place the tops back on the peppers; bake until peppers are tender, 10 to 15 more minutes.\n",
        "picture_link": "jrQbIqIqF7ZhJa1mMXQIwASEsK2FFOC"
    },
    {
        "title": "Grilled Arctic Char on Bed of Greens",
        "ingredients": [
            "2 tablespoons extra virgin olive oil ADVERTISEMENT",
            "2 (6 ounce) filets arctic char ADVERTISEMENT",
            "1 teaspoon kosher salt ADVERTISEMENT",
            "freshly ground black pepper ADVERTISEMENT",
            "lemon juice ADVERTISEMENT",
            "1 (8 ounce) package mixed salad greens ADVERTISEMENT",
            "1 mango - peeled, seeded, and sliced ADVERTISEMENT",
            "6 strawberries, sliced ADVERTISEMENT",
            "1/4 cup roasted pecans ADVERTISEMENT",
            "2 teaspoons extra-virgin olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 2 tablespoons olive oil in a grill pan or skillet over medium-high heat. Season arctic char with kosher salt and black pepper. Cook fillets on grill pan skin side up until lightly browned, 3 to 4 minutes. Flip fillets and continue to cook until fish flakes easily with a fork, 3 to 4 minutes more. Pour lemon juice over fish; remove from heat.\nDivide salad greens over two plates and arrange mango, strawberries, and pecans on top; season with salt and black pepper. Carefully place an arctic char fillet on each portion and drizzle pan juices and remaining 2 teaspoon olive oil over salads.\n",
        "picture_link": "cqhPm4ydeNje36nNuuFgEydArHXdkj6"
    },
    {
        "title": "Quick Beef Taquitos",
        "ingredients": [
            "oil for frying, or as needed ADVERTISEMENT",
            "2 (13 ounce) cans roast beef in gravy, drained ADVERTISEMENT",
            "1 cup shredded pepperjack cheese ADVERTISEMENT",
            "1 (7 ounce) can diced green chiles ADVERTISEMENT",
            "18 corn tortillas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a skillet over medium-high heat.\nCombine roast beef, pepper jack cheese, and green chilies in a bowl. Use a fork to break up the beef and mix ingredients.\nFry tortillas in hot oil just long enough to soften, just a few seconds; drain on a plate lined with paper towels.\nBegin spooning beef mixture into tortillas making a line down the middle of the tortilla. Roll tortilla around the filling and place in frying pan with the edge of the rolled tortilla facing the bottom of the pan. Cook until the tortillas are completely browned, 5 to 8 minutes per side. Drain again on paper towels before serving.\n",
        "picture_link": "bin6LbQpQX6mGtx9MQXY1C19CFOj9e."
    },
    {
        "title": "Indian Tacos Deluxe",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 (15 ounce) cans pinto beans, undrained ADVERTISEMENT",
            "1 (15 ounce) can kidney beans, undrained ADVERTISEMENT",
            "1 (15 ounce) can pork and beans ADVERTISEMENT",
            "1 (16 ounce) can tomato sauce ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "3 tablespoons sugar ADVERTISEMENT",
            "1/2 (1.25 ounce) package chili seasoning mix ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1/2 teaspoon seasoned salt ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "2 tablespoons baking powder ADVERTISEMENT",
            "6 tablespoons white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 cups water, or as needed ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "3 cups vegetable oil for frying ADVERTISEMENT",
            "2 cups shredded lettuce ADVERTISEMENT",
            "2 tomatoes, chopped ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a skillet over medium heat and cook and stir 1 chopped onion in the melted butter until onion is translucent, about 5 minutes.\nPlace a large saucepan over medium-high heat and pour in pinto beans, kidney beans, pork and beans, tomato sauce, cooked onion, and 1/4 cup water, stirring to combine. Bring the mixture to a boil, reduce heat to low, and stir in 3 tablespoons sugar, chili seasoning mix, chili powder, and seasoned salt. Let the chili simmer while you finish the remaining steps, 10 to 20 minutes. Stir chili occasionally.\nMix 3 cups flour with baking powder, 6 tablespoons sugar, and salt in a large mixing bowl; stir in 2 cups of water or amount needed to make a workable dough. Spread 1 cup flour onto a work surface and scoop up about 1/4 cup of dough; drop it onto the flour and sprinkle surface with flour. Roll the dough into a flat round tortilla.\nHeat oil in a deep-fryer or large skillet to 375 degrees F (190 degrees C).\nGently lay tortilla into the hot oil and deep fry until golden brown on both sides, 2 to 3 minutes per side. Dough will expand as it fries. Remove fry bread and drain on paper towels; continue to make and fry pieces of dough until all dough has been used.\nPlace lettuce, tomatoes, Cheddar cheese, 1 chopped onion, and sour cream into separate bowls. To serve, spoon a ladle of chili onto each fry bread and sprinkle with desired garnishes; top each serving with a dollop of sour cream.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Easy Honey Mustard Ham",
        "ingredients": [
            "1 (6 to 7 pound) picnic ham ADVERTISEMENT",
            "3/4 cup honey mustard sauce ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place picnic ham in a slow cooker. Mix honey mustard sauce, brown sugar, water, and garlic powder together in a bowl; pour over the ham.\nCook on Low 8 hours to overnight.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Caipirinha Cocktail",
        "ingredients": [
            "1 lime, quartered ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "2 fluid ounces cachaca (Brazilian rum) ADVERTISEMENT",
            "1 1/2 cups ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine sugar and lime quarters in a pint glass. Crush and mix together using a cocktail muddler. Add cachaca and stir. Fill with ice and stir again.\n",
        "picture_link": "9a2WuE2nD42zoW9Gh8VE1QEOcD3NESW"
    },
    {
        "title": "Summertime Fun Pasta Salad",
        "ingredients": [
            "1 1/2 cups bow-tie pasta (farfalle) ADVERTISEMENT",
            "1 (5 ounce) can white tuna, drained, or more to taste ADVERTISEMENT",
            "1 cucumber, cut into small pieces ADVERTISEMENT",
            "1 1/2 cups ranch dressing, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook the bow-tie pasta at a boil, stirring occasionally, until cooked through yet firm to the bite, about 12 minutes; drain and cool.\nMix tuna and cucumber together in a salad bowl; stir in cooked bow-tie pasta and ranch dressing. Chill at least 1 hour.\n",
        "picture_link": "RTOVBGZvuxqZ5BXRcdEn0A110mj5cwW"
    },
    {
        "title": "Real Bacon Popcorn ",
        "ingredients": [
            "1 (1 pound) package bacon, cut into 1/2-inch dice ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 cup unpopped popcorn ADVERTISEMENT",
            "1 pinch salt, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon and vegetable oil in a large, deep pot with a tight-fitting lid over medium heat. Cook and stir bacon until crisp and brown, 8 to 10 minutes. Scatter the popcorn into the pan with the bacon and drippings and cover with the lid. When you hear kernels of popcorn begin to pop, shake the pan vigorously until popping slows to 1 or 2 pops per about 30 seconds.\nRemove lid facing away from you to avoid steam and transfer bacon popcorn to a large serving bowl. Season to taste with salt if desired.\n",
        "picture_link": "EhbdTScm9wAH9Jjjvd.SbPcGzaBAtsS"
    },
    {
        "title": "Kala Chola Pakistani-Style",
        "ingredients": [
            "1 1/2 cups dry black garbanzo beans (kala channa) ADVERTISEMENT",
            "water to cover ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "2 tomatoes, finely chopped ADVERTISEMENT",
            "1 onion, finely chopped ADVERTISEMENT",
            "1 jalapeno pepper, finely chopped ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "1/2 teaspoon ground red chile pepper ADVERTISEMENT",
            "4 dried red chile peppers (optional) ADVERTISEMENT",
            "water as needed ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "1 tablespoon finely chopped onion ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place garbanzo beans in a large bowl. Pour enough water over the beans to cover by several inches. Soak 8 hours to overnight. Rinse and drain the garbanzo beans thoroughly.\nCombine garbanzo beans, 3 cups water, tomatoes, 1 finely chopped onion, jalapeno pepper, vegetable oil, salt, turmeric, ground red chile pepper, and dried whole chiles in a large pot over medium-high heat; bring to a boil, reduce heat to medium-low, and cook until the garbanzo beans are tender, 3 to 4 hours, adding water as needed to keep about 1 inch of liquid at the bottom of the pot.\nGarnish with cilantro and 1 tablespoon finely chopped onion to serve.\n",
        "picture_link": "/gC2f9ZxY/rQeC.5ysYDRXAEb68dSXC"
    },
    {
        "title": "All-American Flag Cake",
        "ingredients": [
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 (3 ounce) package strawberry-flavored Jell-O® mix ADVERTISEMENT",
            "1/2 cup boiling water ADVERTISEMENT",
            "1 (3.5 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "1 cup frozen whipped topping, thawed ADVERTISEMENT",
            "1/2 cup fresh blueberries ADVERTISEMENT",
            "2 cups frozen whipped topping, thawed ADVERTISEMENT",
            "1/2 cup fresh blueberries ADVERTISEMENT",
            "1 1/2 cups sliced fresh strawberries ADVERTISEMENT",
            "1/2 cup miniature marshmallows ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13-inch baking pan.\nStir yellow cake mix, 1 cup water, vegetable oil, and eggs in a mixing bowl until moistened; beat with a mixer on medium speed for 2 minutes. Pour batter into prepared baking pan.\nBake cake in the preheated oven until lightly browned and a toothpick inserted into the center comes out clean, about 35 minutes. Cool completely on a wire rack. Poke holes about 1 inch apart all over the cake with a fork.\nDissolve strawberry gelatin in boiling water in a bowl and pour gelatin slowly over the cake, letting gelatin seep into holes. Refrigerate cake until gelatin sets, about 1 hour. Transfer cake to a serving platter and cut in half horizontally.\nMix instant vanilla pudding mix with milk in a bowl and whisk until thickened, about 2 minutes; stir in 1/2 cup blueberries. Spread blueberry filling onto bottom of cake and place top of cake over the filling. Spread 2 cups whipped topping smoothly over top and sides of cake and arrange 1/2 cup blueberries in a square in the upper left corner of the cake for stars. Arrange alternating layers of strawberries and miniature marshmallows into horizontal red and white stripes.\n",
        "picture_link": "RCe/wZwz6S64adCI/i4JAH69J0isKre"
    },
    {
        "title": "Grilled Shrimp Scampi Cocktail",
        "ingredients": [
            "2 pounds unpeeled large shrimp ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1 cup cocktail sauce ADVERTISEMENT",
            "1 lemon, cut into wedges ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place shrimp, olive oil, garlic, salt, and black pepper in a resealable plastic bag. Coat shrimp with oil mixture, squeeze out excess air, and seal bag. Marinate in refrigerator for up to 4 hours.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate.\nCook shrimp on preheated grill until they are bright pink on the outside and the meat is no longer transparent in the center, about 5 minutes per side. Peel shrimp.\nServe with cocktail sauce and lemon wedges.\n",
        "picture_link": "OV8HyXtnRtvdW4fyghmKEEHuvPmj.AS"
    },
    {
        "title": "Broiled, Marinated Tofu Sandwich",
        "ingredients": [
            "1 pound firm tofu ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon chili powder ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/4 cup white wine vinegar ADVERTISEMENT",
            "1/4 cup dry white wine ADVERTISEMENT",
            "10 slices whole wheat bread ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "5 Roma tomatoes, sliced ADVERTISEMENT",
            "1 cup arugula ADVERTISEMENT",
            "1 red onion, thinly sliced ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut tofu into 10 thin slices. Set on a baking sheet, cover with another baking sheet, and weigh down with something heavy, such as a large can of food. Drain until excess water is removed, at least 30 minutes.\nHeat olive oil in a small cast iron skillet over medium heat. Toast ground cumin, chili powder, and oregano in the hot oil until spices are aromatic, about 2 to 3 minutes.\nTransfer oil and spice mixture to a saucepan over medium heat; stir in minced garlic, white wine vinegar, and white wine. Bring to a simmer, then remove marinade from heat.\nPlace drained tofu into a glass dish; pour marinade over tofu. Cover with plastic wrap; refrigerate for at least 8 hours.\nSet oven rack about 6 inches from the heat source and preheat the oven's broiler.\nRemove tofu from marinade; pat dry with paper towels and place on broiler rack. Broil on each side until skin is crisp, about 6 minutes per side.\nTo assemble, spread mayonnaise on one side of each slice of bread; place 2 tofu slices on 5 of the bread slices; top tofu with sliced tomato, arugula, red onion, salt, black pepper, and remaining slices of bread.\n",
        "picture_link": "J6eGUnCpe1Is0Zte/eETrsyfZJGquLW"
    },
    {
        "title": "Rhubarb Strawberry Crisp",
        "ingredients": [
            "4 cups chopped rhubarb ADVERTISEMENT",
            "2 cups sliced fresh strawberries ADVERTISEMENT",
            "3/4 cup honey ADVERTISEMENT",
            "1/3 cup whole wheat flour ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1 cup whole wheat flour ADVERTISEMENT",
            "1 cup rolled oats ADVERTISEMENT",
            "1/4 cup molasses ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 cup butter, cut into pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine rhubarb, strawberries, honey, 1/3 cup flour, and cinnamon in a large bowl; let rest for 5 to 10 minutes, stirring occasionally. Transfer fruit mixture to a 9x13-inch baking dish.\nMix remaining 1 cup flour, rolled oats, molasses, and nutmeg in another bowl. Cut in butter with a knife or pastry blender until the mixture resembles coarse crumbs. Sprinkle crumb mixture over fruit.\nBake in preheated oven until crumb topping is golden brown, 35 to 40 minutes.\n",
        "picture_link": "adCXS2ExmYktBGJakvO1KFHOuHvKypK"
    },
    {
        "title": "Deep Dish Pizza Dough",
        "ingredients": [
            "1 (.25 ounce) package active dry yeast ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "2/3 cup water ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 cup bread flour ADVERTISEMENT",
            "1/4 cup corn oil ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "6 tablespoons vegetable oil ADVERTISEMENT",
            "1/2 cup all-purpose flour, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dissolve yeast and sugar in water in a bowl. Let stand until the yeast softens and begins to form a creamy foam, about 5 minutes.\nMix 2 cups all-purpose flour, bread flour, corn oil, and salt together in a bowl; add yeast mixture and knead on a work surface using about 1/2 all-purpose flour until well mixed. Let dough rise in a warm area until doubled in size; about 2 hours.\n",
        "picture_link": "IkV0LcjVtH75OdIerbD0DmwavKEo0Se"
    },
    {
        "title": "Creamy Dairy-Free Salad Dressing",
        "ingredients": [
            "1 cup cultured coconut milk ADVERTISEMENT",
            "1 1/2 teaspoons dried parsley ADVERTISEMENT",
            "1 1/2 teaspoons lemon juice ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon dill ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "1/2 teaspoon Dijon mustard ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk coconut milk, parsley, lemon juice, garlic powder, dill, onion powder, mustard, salt, and black pepper together in a bowl until smooth and creamy. Refrigerate until flavors blend, at least 30 minutes.\n",
        "picture_link": "TxWEFyVPeOnKLN8DGqgFCsQHqZSXC32"
    },
    {
        "title": "Deconstructed Screwdriver (The Raw Egg)",
        "ingredients": [
            "1/4 cup orange juice, or as desired ADVERTISEMENT",
            "2 (1.5 fluid ounce) jiggers vodka, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a food-safe silicon-based round ice mold will orange juice; freeze until solid, 2 to 3 hours.\nCarefully open the ice mold and place the orange juice ball into a martini glass; add vodka.\n",
        "picture_link": "PW9uFOh6msl4ZBKBeLxuG09cdssyNn2"
    },
    {
        "title": "Classic Ham and Swiss Casserole",
        "ingredients": [
            "1 (1 pound) loaf sourdough bread, cut into cubes ADVERTISEMENT",
            "1 (8 ounce) bottle honey mustard ADVERTISEMENT",
            "2 cups shredded Swiss cheese, divided ADVERTISEMENT",
            "2 cups diced ham, divided ADVERTISEMENT",
            "1 (6 ounce) jar dill pickle relish, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread the bread cubes into a shallow pan and let the bread sit until the cut surfaces are somewhat dried with the insides remaining soft, 2 to 3 hours.\nPreheat oven to 350 degrees F (175 degrees C). Grease a 2-quart baking dish.\nPut bread cubes into a large bowl. Pour honey mustard over the bread and mix to coat. Layer about half the bread cubes into the bottom of the prepared baking dish. Sprinkle 2/3 cup Swiss cheese over the bread cubes; top with 1 cup ham. Spread relish in a layer over everything. Layer remaining ham, 2/3 cup Swiss cheese, and remaining bread cubes, respectively, atop the relish layer. Finish by topping with the remaining Swiss cheese. Cover entire dish with aluminum foil.\nBake in preheated oven until hot in the center, about 30 minutes. Let cool 5 minutes before cutting to serve.\n",
        "picture_link": "M1SKQI6Xk0AiihcUYhlz2bvfTORgQP6"
    },
    {
        "title": "Cheesy Brunch Strata with Soy Sausage and Spinach",
        "ingredients": [
            "vegetable oil cooking spray ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 pound spinach ADVERTISEMENT",
            "1 pinch salt and ground black pepper to taste ADVERTISEMENT",
            "1 quart milk ADVERTISEMENT",
            "12 eggs ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "freshly ground black pepper, or to taste ADVERTISEMENT",
            "1 sourdough baguette, sliced ADVERTISEMENT",
            "1 pound soy sausages, cut into cubes ADVERTISEMENT",
            "6 ounces shredded extra-sharp Cheddar cheese ADVERTISEMENT",
            "6 ounces shredded low-fat mozzarella cheese ADVERTISEMENT",
            "1/2 cup thinly sliced scallions ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Set an oven rack in the center position of the oven. Prepare a 13x9-inch baking dish with cooking spray.\nHeat oil in a skillet over medium-high heat. Saute spinach in hot oil until wilted, 2 to 3 minutes; season with salt and pepper to taste.\nBeat milk, eggs, 1 teaspoon salt, and freshly ground black pepper together in a bowl until smooth.\nLine the bottom of the prepared baking dish with half the baguette slices. Spread about half the sausage cubes and half the sauteed spinach over the bread layer. Sprinkle 3 ounces Cheddar cheese, 3 ounces mozzarella cheese, and 1/4 cup scallions over the sausage and spinach. Pour 1 cup of the milk mixture over everything. Arrange remaining bread in a layer over the ingredients in the baking dish. Repeat layering of sausage, spinach, Cheddar cheese, mozzarella cheese, and green onions, respectively. Pour remaining milk mixture over the dish to soak ingredients completely.\nCover dish with plastic wrap. Weigh plastic wrap down with 3 soup cans to keep top of strata immersed in liquid. Let sit at room temperature for 15 minutes.\nBake in preheated oven until set in the center, about 50 minutes. Switch oven to Broil and continue cooking until the top of the strata begins to puff and turn brown in spots, about 5 minutes more. Let strata cool 8 to 10 minutes before serving.\n",
        "picture_link": "WXaUEaZvZI9zYabfFLjrrdbFKlH2hKm"
    },
    {
        "title": "Avocado Banana Nut Smoothie",
        "ingredients": [
            "1 cup almond milk ADVERTISEMENT",
            "1 avocado, peeled and pitted ADVERTISEMENT",
            "1 large banana, cut into chunks ADVERTISEMENT",
            "3 tablespoons creamy peanut butter ADVERTISEMENT",
            "2 cubes ice cubes ADVERTISEMENT",
            "1 teaspoon vanilla extract (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend almond milk, avocado, banana, peanut butter, ice cubes, and vanilla extract in a blender until smooth.\n",
        "picture_link": "09J0/1xIasA0ZCo9TvYNLAXrCTtF.dG"
    },
    {
        "title": "Banana Split Shake",
        "ingredients": [
            "4 large scoops vanilla ice cream ADVERTISEMENT",
            "1 banana ADVERTISEMENT",
            "1/2 cup frozen sliced strawberries ADVERTISEMENT",
            "1/2 cup crushed pineapple with juice ADVERTISEMENT",
            "1/4 cup chocolate syrup, or as needed ADVERTISEMENT",
            "Gay Lea Real Coconut Whipped Cream ADVERTISEMENT",
            "Maraschino cherries (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine ice cream, banana, strawberries, pineapple and chocolate syrup in a blender. Blend until smooth.\nDivide shake between 2 large (or 4 smaller) glasses. Squirt a generous amount of coconut whipped cream on top. Garnish with additional chocolate syrup and a cherry (if using). Serve immediately.\n",
        "picture_link": "/TIlPWYkhlf5up0MUAJtvG8zQDz3Uc6"
    },
    {
        "title": "Paleo Soy and Ginger Poached Flounder",
        "ingredients": [
            "1 1/2 cups water ADVERTISEMENT",
            "1/2 cup soy sauce ADVERTISEMENT",
            "1/2 cup chopped cilantro ADVERTISEMENT",
            "1 teaspoon rice vinegar ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 1/2 pounds flounder fillets ADVERTISEMENT",
            "1 tablespoon grated fresh ginger ADVERTISEMENT",
            "1/2 cup chopped scallions ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir water, soy sauce, cilantro, and rice vinegar together in a bowl.\nHeat olive oil in a deep skillet over medium-high heat. Saute ginger in hot oil until fragrant, about 1 minute; add the water mixture and flounder to the skillet. Bring the liquid to a boil and immediately remove skillet from heat. Place a tight-fitting lid on the skillet and poach flounder in hot liquid until the flesh easily flakes with a fork, about 10 minutes. Top fillets with chopped scallions.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Peanut Butter Rice Krispies® Treat Eggs",
        "ingredients": [
            "Yolk: ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "2 tablespoons softened butter ADVERTISEMENT",
            "2 tablespoons corn syrup ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "yellow food coloring ADVERTISEMENT",
            "Rice Krispies® Treats: ADVERTISEMENT",
            "6 tablespoons butter, softened ADVERTISEMENT",
            "1 (10 ounce) package marshmallows ADVERTISEMENT",
            "1/2 cup peanut butter ADVERTISEMENT",
            "6 cups crispy rice cereal (such as Rice Krispies®) ADVERTISEMENT",
            "1/4 teaspoon kosher salt ADVERTISEMENT",
            "1 (12 ounce) bag semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat confectioners' sugar, 2 tablespoons butter, corn syrup, vanilla extract, pinch salt, and yellow food coloring together in a bowl until smooth, adding food coloring as necessary until your desired \"yolk\" color is reached. Cover the bowl with plastic wrap and refrigerate until cold, at least 30 minutes.\nMelt 6 tablespoons butter in a pot over medium-high heat until butter turns golden and has a nutty fragrance, about 5 minutes. Reduce heat to medium-low, add marshmallows and peanut butter, and cook and stir until marshmallows and peanut butter are melted and mixture is well-combined. Remove from heat.\nStir rice cereal and kosher salt into marshmallow mixture until cereal treat mixture is well-combined. Cool to room temperature.\nRoll \"yolk\" mixture into gumball-size balls, about 1/2 teaspoon \"yolk\" mixture per ball. Scoop about 1/3 cup cereal treat mixture into your hand and form it into a 2-inch round; press an indentation into the center with your finger and place 1 \"yolk\" in the indentation. Wrap the cereal treat around the \"yolk\" and squeeze firmly to form an egg shape. Repeat with remaining cereal treat mixture and \"yolks.\" Set completed \"eggs\" on a plate and refrigerate until firmed, at least 15 minutes.\nMelt chocolate in the top of a double boiler over simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching. Use 2 forks to dip each cereal \"egg\" into chocolate to coat completely. Place finished eggs on a plate and refrigerate until chocolate sets, at least 15 minutes.\n",
        "picture_link": "1wSrcrvzot4B0QE2.A/dLRoq3bTgPBS"
    },
    {
        "title": "Basic Barbeque Sauce",
        "ingredients": [
            "1 cup ketchup ADVERTISEMENT",
            "6 fluid ounces tomato-vegetable juice cocktail (such as V8®), or more to taste ADVERTISEMENT",
            "3/4 cup molasses ADVERTISEMENT",
            "2 tablespoons Meyer lemon juice ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1 tablespoon minced fresh onion ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "2 teaspoons ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir ketchup, tomato-vegetable juice cocktail, molasses, Meyer lemon juice, Worcestershire sauce, brown sugar, onion, garlic, and black pepper together in a bowl.\nCover bowl with plastic wrap and refrigerate to let the flavors blend, at least 45 minutes.\n",
        "picture_link": "MWkWrzACm0sfXSzG25ouhG9h/9t5u4W"
    },
    {
        "title": "Avocado Dressing For Salads",
        "ingredients": [
            "2 avocados - peeled, pitted, and mashed ADVERTISEMENT",
            "3/4 cup sour cream ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1/2 teaspoon celery salt ADVERTISEMENT",
            "3 dashes hot pepper sauce, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk avocado, sour cream, milk, lemon juice, celery salt, and hot pepper sauce together in a bowl until smooth and creamy.\n",
        "picture_link": "kl5oKxLQVUvgAot6Hd87pQGFx7ySE7S"
    }
]