[
    {
        "title": "Pumpkin Swirl Bread",
        "ingredients": [
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1 cup pumpkin puree ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend cream cheese, 1/4 cup sugar, and 1 beaten egg. Set aside.\nCombine flour, 1 1/2 cups white sugar, baking soda, salt, and spices. Set aside.\nCombine pumpkin, butter or margarine, beaten egg, and water. Add flour mixture to pumpkin mixture, mixing just until moistened. Reserve 2 cups of the pumpkin batter. Pour the remaining batter into a greased and floured 9 x 5 inch loaf pan. Pour cream cheese mixture over pumpkin batter, and top with reserved pumpkin batter. Cut through batter several times with a knife for a swirl effect.\nBake at 350 degrees F (175 degrees C) for 70 minutes, or until tester comes out clean. Cool in the pan for 10 minutes, and then remove from pan to cool completely.\n",
        "picture_link": "9x5IIHK9Vn2y.GtXZDhj7Jfi7msfFzq"
    },
    {
        "title": "Strawberry Spinach Salad II",
        "ingredients": [
            "1/2 cup white sugar ADVERTISEMENT",
            "2 tablespoons sesame seeds ADVERTISEMENT",
            "1/2 teaspoon sesame oil ADVERTISEMENT",
            "1 tablespoon poppy seeds ADVERTISEMENT",
            "1 1/2 teaspoons dried minced onion ADVERTISEMENT",
            "1/4 teaspoon paprika ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1/2 cup balsamic vinegar ADVERTISEMENT",
            "2 bunches fresh spinach - chopped, washed and dried ADVERTISEMENT",
            "1 pint strawberries, halved ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the sugar, sesame seeds, sesame oil, poppy seeds, dried onion, paprika, oil and vinegar. Refrigerate until chilled.\nIn a salad bowl, combine the spinach and strawberries. Drizzle with dressing, toss lightly and serve.\n",
        "picture_link": "e3dLvAvUHc4.7SN/2O8UY5r3.fWzccW"
    },
    {
        "title": "Egg Free Chocolate Chip Pumpkin Cookies",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "1 cup shortening ADVERTISEMENT",
            "1 (15 ounce) can pumpkin puree ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "12 ounces semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nCream the sugar, shortening, pumpkin and vanilla together. Mix until light and well combined.\nMix the flour, baking soda and ground cinnamon. Stir the flour mixture into the creamed mixture. Mix until combined. Stir in the chocolate chips.\nDrop by teaspoons onto an ungreased baking sheet. Bake at 375 degrees F (190 degrees C) for 12 to 15 minutes or until set. Let cookies cool on a rack.\n",
        "picture_link": "E/CkqpMrumsxq0q7GAXm51.cuxstgr6"
    },
    {
        "title": "Chicken Rotini Stovetop Casserole",
        "ingredients": [
            "1 (12 ounce) package rotini pasta ADVERTISEMENT",
            "2 cups half-and-half cream ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2/3 cup freshly grated Parmesan cheese ADVERTISEMENT",
            "1/2 teaspoon dried basil leaves ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon chopped fresh chives ADVERTISEMENT",
            "1/2 teaspoon chopped fresh parsley ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves - cubed ADVERTISEMENT",
            "1/2 green bell pepper, chopped ADVERTISEMENT",
            "1/2 red bell pepper, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta, and cook for 8 to 10 minutes, or until al dente; drain.\nCombine half-and-half and butter in a saucepan over medium heat. Boil gently, stirring, until mixture has reduced to 1 1/2 to 1 2/3 cups. Remove pan from heat; whisk in cheese, basil, oregano, chives, and parsley. Cover, and set aside.\nSaute chicken in a large skillet until lightly browned on both sides. Stir in green and red bell pepper, and cook until vegetables are tender, and chicken is no longer pink in the middle.\nIn a casserole dish, combine the hot cooked pasta, chicken mixture, and sauce. Mix well, and serve immediately.\n",
        "picture_link": "4qqEPIJcMkx2A778hLmpTXkzKpWIEbm"
    },
    {
        "title": "Caramel Frosting V",
        "ingredients": [
            "1 pound light brown sugar ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/4 cup chopped pecans (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium, heavy saucepan, bring the brown sugar and cream to a rolling boil; boil 1 minute. Add baking soda; boil 1 more minute. Remove from heat. Add butter, but do not stir yet. Let the mixture cool.\nBeat well. Stir in pecans if desired.\n",
        "picture_link": "n.yagRa40L8EFBlF5qUzwgyJDj3/f3m"
    },
    {
        "title": "Mongolian Strawberry-Orange Juice Smoothie",
        "ingredients": [
            "1 cup chopped fresh strawberries ADVERTISEMENT",
            "1 cup orange juice ADVERTISEMENT",
            "10 cubes ice ADVERTISEMENT",
            "1 tablespoon sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender, combine strawberries, orange juice, ice cubes and sugar. Blend until smooth. Pour into glasses and serve.\n",
        "picture_link": "psRJgtfQaMvvwbllYO6wM12ialDQkxW"
    },
    {
        "title": "Carrot Cake I",
        "ingredients": [
            "3 cups grated carrots ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 1/4 cups vegetable oil ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 cups sifted all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1 cup golden raisins ADVERTISEMENT",
            "1 1/4 cups confectioners' sugar ADVERTISEMENT",
            "1 (3 ounce) package cream cheese ADVERTISEMENT",
            "1 tablespoon light corn syrup ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat together the eggs, oil, and white sugar. Blend mixture for thirty seconds.\nSift together flour, baking powder, baking soda, salt and spices. Add the carrots and raisins. Pour egg mixture into dry ingredients, and mix well.\nPour batter into well greased 10 inch tube or bundt pan. Bake at 350 degrees F (175 degrees C) oven for 60 to 70 minutes. Cool cake on wire rack, and then refrigerate until completely cooled.\nTo make Cream Cheese Glaze: Blend together confectioners' sugar, cream cheese, corn syrup, and vanilla. Spread over cooled cake.\n",
        "picture_link": "9Y6H5efV9ubXJaJ6XXUttROEmYn.4EW"
    },
    {
        "title": "Tomato Bisque III",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "1 small onion, finely chopped ADVERTISEMENT",
            "1 stalk celery, finely chopped ADVERTISEMENT",
            "1 carrot, finely chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "3 tablespoons tomato paste ADVERTISEMENT",
            "4 cups chicken broth ADVERTISEMENT",
            "2 (14.5 ounce) cans fire roasted diced tomatoes, drained ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 cup heavy cream ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a large saucepan over medium heat. Stir in the onion, celery, carrot, and garlic. Cook and stir until the vegetables are tender and beginning to brown, about 8 minutes. Stir in the flour and cook 1 minute longer, stirring constantly.\nStir in the tomato paste, chicken broth, tomatoes, sugar, and nutmeg. Bring to a boil over high heat, then reduce heat to medium-low, cover, and simmer 15 minutes until the vegetables are very tender.\nPour half to three-quarters of the soup into a blender-depending on how chunky you want it-filling the pitcher no more than halfway full. Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender, using a few quick pulses to get the soup moving before leaving it on to puree. Alternately, you can use a stick blender and puree the soup in the saucepan.\nReturn the pureed soup to the saucepan and stir in the cream. Cook over medium heat until the soup is hot. Season with salt and pepper to taste before serving.\n",
        "picture_link": "J6JYMmKhlSL6.tKcGiem0iaw.xsAmVm"
    },
    {
        "title": "Grilled Chicken Cordon Bleu Sandwiches",
        "ingredients": [
            "2 slices whole wheat bread ADVERTISEMENT",
            "2 tablespoons butter, softened ADVERTISEMENT",
            "1 tablespoon sour cream ADVERTISEMENT",
            "2 slices Swiss cheese ADVERTISEMENT",
            "1 thick slice deli cooked chicken breast meat ADVERTISEMENT",
            "1 slice deli ham ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread butter or margarine on the outsides of the bread slices. Spread sour cream on the insides of the bread slices. Then layer sandwich as follows: Bread slice, cheese slice, chicken, ham, 2nd cheese slice, 2nd bread slice.\nIn a small skillet over medium heat, grill sandwich until meat is heated through and cheese has melted.\n",
        "picture_link": "z4oJh.VnwJcvP4gFQa.vEfLb43VxjIW"
    },
    {
        "title": "Hot Peanut Sauce",
        "ingredients": [
            "4 tablespoons peanut butter ADVERTISEMENT",
            "4 tablespoons hot water ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "1 1/2 tablespoons brown sugar ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1 1/2 teaspoons lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl combine peanut butter and water; mix until a smooth paste forms. Stir in soy sauce, then brown sugar, cayenne and lemon juice. Mix by hand until well combined and smooth.\n",
        "picture_link": "C4r1CfMEM03bhjwzoIKwLqMVOvLJudS"
    },
    {
        "title": "Rainbow Pasta Salad II",
        "ingredients": [
            "1 (16 ounce) package tri-colored pasta assortment ADVERTISEMENT",
            "2 large tomatoes, diced ADVERTISEMENT",
            "1 large cucumber, peeled and diced ADVERTISEMENT",
            "1 red onion, finely chopped ADVERTISEMENT",
            "1 (16 ounce) bottle Italian-style salad dressing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain and rinse in cold water.\nIn a large bowl combine tomatoes, cucumbers, onion, cooled pasta and Italian dressing. Refrigerate overnight, or for at least 1 hour.\n",
        "picture_link": "ZvY58Gza/UQ6fi8eEnI92/WHefNAVyy"
    },
    {
        "title": "Red Potato Bites",
        "ingredients": [
            "1 1/2 pounds small round red potatoes ADVERTISEMENT",
            "4 slices bacon ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1/2 teaspoon seasoned salt ADVERTISEMENT",
            "1/4 teaspoon black pepper ADVERTISEMENT",
            "1 tablespoon chopped fresh chives ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Place potatoes in a saucepan, and add enough water to cover. Bring to boil, and cook until tender but still firm, about 10 minutes. Drain, and cool in a bowl of cold water.\nCook bacon in a skillet over medium-high heat until evenly browned. Drain, crumble, and set aside.\nRemove cooled potatoes from water. Pat dry with a paper towel, and cut in half. Using a small spoon, carefully remove a small amount from center, leaving approximately 1/4 inch rim around each potato. Set reserved potato aside.\nIn a bowl, mix together reserved potato, sour cream, bacon, seasoned salt, pepper, and chives. Spoon a small amount of mixture into each potato half and place on a baking sheet. Top each potato off with some shredded cheese.\nBake for 10 minutes in the preheated oven, or until cheese is melted and potatoes are warmed through. Garnish with parsley, and serve.\n",
        "picture_link": "/ilrJWUZok1Y2IdAh3vEMNEeRQuc52K"
    },
    {
        "title": "Bangers and Mash",
        "ingredients": [
            "8 large baking potatoes, peeled and quartered ADVERTISEMENT",
            "2 teaspoons butter, divided ADVERTISEMENT",
            "1/2 cup milk, or as needed ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 1/2 pounds beef sausage ADVERTISEMENT",
            "1/2 cup diced onion ADVERTISEMENT",
            "1 (.75 ounce) packet dry brown gravy mix ADVERTISEMENT",
            "1 cup water, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Place potatoes in a saucepan with enough water to cover. Bring to a boil, and cook until tender, about 20 minutes. Drain, and mash with 1 teaspoon of butter, and enough milk to reach your desired creaminess. Continue mashing, or beat with an electric mixer, until smooth. Season with salt and pepper.\nIn a large skillet over medium heat, cook the sausage until heated through. Remove from pan, and set aside. Add remaining teaspoon of butter to the skillet, and fry the onions over medium heat until tender. Mix gravy mix and water as directed on the package, and add to the skillet with the onions. Simmer, stirring constantly, to form a thick gravy.\nPour half of the gravy into a square casserole dish so that is coats the bottom. Place sausages in a layer over the gravy (you can butterfly the sausages if you wish). Pour remaining gravy over them, then top with mashed potatoes.\nBake uncovered for 20 minutes in the preheated oven, or until potatoes are evenly brown.\n",
        "picture_link": "L59w12eT6rqvltkwps0YNFOEnFyLyGi"
    },
    {
        "title": "Elizabeth's Extreme Chocolate Lover's Cake",
        "ingredients": [
            "CAKE: ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "6 (1 ounce) squares unsweetened chocolate, chopped ADVERTISEMENT",
            "1/2 cup unsalted butter ADVERTISEMENT",
            "2 1/2 cups dark brown sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 1/2 tablespoons vanilla extract ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "FROSTING: ADVERTISEMENT",
            "6 (1 ounce) squares unsweetened chocolate, chopped ADVERTISEMENT",
            "1/4 cup unsalted butter ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "4 cups confectioners' sugar ADVERTISEMENT",
            "2 tablespoons vanilla extract ADVERTISEMENT",
            "2 tablespoons heavy cream ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "GANACHE: ADVERTISEMENT",
            "2 cups bittersweet chocolate chips ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour 2 (9 inch) pans. Sift together the flour, baking soda and salt. Set aside. In the top of a double boiler, heat 6 ounces chocolate, stirring occasionally, until chocolate is melted and smooth. Remove from heat and allow to cool to lukewarm.\nIn a large bowl, cream together the butter and brown sugar until light and fluffy. Beat in the eggs one at a time, then stir in 1 1/2 teaspoon vanilla. Stir in the melted chocolate. Beat in the flour mixture alternately with the sour cream. Stir in boiling water (batter will be thin). Pour batter into prepared pans.\nBake in the preheated oven for 35 to 40 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pan for 10 minutes, then turn out onto a wire rack and cool completely.\nMake the Chocolate Buttercream Frosting: In the top of a double boiler, heat 6 ounces chocolate, stirring occasionally, until chocolate is melted and smooth. Remove from heat and allow to cool to lukewarm. In a large bowl, whip the butter for about 10 minutes until it is super fluffy, beat in egg yolk. Gradually blend in the confectioners' sugar, alternating with 2 tablespoons vanilla and 2 tablespoons cream, then blend in the melted chocolate. Beat in the softened cream cheese.\nMake the Ganache: In a large saucepan, combine chocolate chips and 1 cup heavy cream. Heat, stirring constantly, until chocolate is melted and smooth. Remove from heat and set aside.\nAssemble the cake: When cake is completely cooled, cover the bottom cake layer with as much ganache as desired. Refrigerate for 5 minutes, or until ganache has set. Spread frosting over the ganache. Cover with top layer of cake. Frost top and sides with buttercream, and garnish with more ganache.\n",
        "picture_link": "CiTKsaQ2ATsx2.SXcwhArnjfr6O/etO"
    },
    {
        "title": "Boston Iced Tea",
        "ingredients": [
            "1 gallon water ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "15 tea bags ADVERTISEMENT",
            "1 (12 fluid ounce) can frozen cranberry juice concentrate ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put water in large pot, and heat on high until boiling. Add sugar and stir until dissolved. Add teabags and let steep until desired strength is acquired. Stir in cranberry juice concentrate, and allow to cool.\n",
        "picture_link": "l4euiB7Qv2RTOZUhrDO5R3yE3Emrujm"
    },
    {
        "title": "Olive Oil Roasted Eggplant with Lemon",
        "ingredients": [
            "1 large eggplant ADVERTISEMENT",
            "3 tablespoons extra virgin olive oil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 400 degrees F (200 degrees C). Line a baking sheet with parchment paper or lightly grease.\nSlice the eggplant in half lengthwise, then cut each half into quarters lengthwise. Cut each of those in half to make two shorter quarters. Place the eggplant onto the baking sheet with the skin side down. Brush each piece with olive oil and season with salt and pepper.\nRoast in the preheated oven until softened and golden brown, 25 to 30 minutes. Remove from the oven and sprinkle with lemon juice. Serve hot.\n",
        "picture_link": "BMHk21z/W6GUUZk0l2XHBfAq6Kh6C1e"
    },
    {
        "title": "Taco Pies",
        "ingredients": [
            "2 (9 inch) deep dish frozen pie crusts, thawed ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 (16 ounce) can refried beans ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 cup crushed tortilla chips ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "2 cups shredded lettuce ADVERTISEMENT",
            "1 large tomato, diced ADVERTISEMENT",
            "sour cream ADVERTISEMENT",
            "black olives ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Bake pie crusts following package directions, but cutting the bake time in half.\nIn a large, heavy skillet over medium-high heat, cook the ground beef until evenly brown; drain excess fat.\nPlace half the refried beans in each pie shell, smearing over the bottom and the sides of the partially baked shells. Spread a layer of ground meat over the beans, and top with the onion, crushed tortilla chips, and cheese.\nBake 15 to 20 minutes, or until the crust is golden brown, and the cheese is bubbly. Top with lettuce, tomato, sour cream, and black olives.\n",
        "picture_link": "LflwrnWlTXOfxEAVtcikYS169ckrxp."
    },
    {
        "title": "Wedding Cake",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "3 cups white sugar ADVERTISEMENT",
            "7 eggs ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease and flour a 9x13 inch pan or a 10 inch Bunt pan.\nIn a large bowl, cream together the butter and sugar. Beat in the eggs, one at a time, mixing well after each. Then stir in the vanilla. Combine the flour, baking soda and baking powder, add to the creamed mixture and mix until all of the flour is absorbed. Finally, stir in the sour cream. Mix for 1 or 2 minutes just to be sure there are no lumps. Pour the batter into the prepared pan.\nBake in the preheated oven for 45 to 60 minutes, or until a toothpick inserted into the center of cake comes out clean. For Bunt cakes, allow the cake to cool in the pan for 10 minutes before inverting onto a wire rack.\n",
        "picture_link": "lQsa9QVF8fRa8NietHMIfQRGhcpyWMK"
    },
    {
        "title": "Roasted Butternut Squash and Garlic Lasagna",
        "ingredients": [
            "3 pounds butternut squash, halved and seeded ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 cup unsalted butter ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 quart milk ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "9 no-cook lasagna noodles ADVERTISEMENT",
            "1 1/3 cups finely grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 450 degrees F (230 degrees C). Grease a baking sheet.\nBrush the butternut squash halves with vegetable oil and season with salt. Roast in the preheated oven until golden and easily pierced with a knife, 45 to 50 minutes. Allow to cool for 15 to 20 minutes, then scoop the flesh into a bowl. Set aside.\nHeat the butter in a large skillet over medium-low heat. Cook and stir garlic in the butter until softened. Stir in flour and cook for 3 minutes. Whisk in the milk until smooth. Bring to a simmer, and cook until thick, about 10 minutes, whisking occasionally. Stir in the butternut squash and season with salt and pepper. Sauce can be made 3 days ahead and refrigerated.\nReduce oven temperature to to 375 degrees F (190 degrees C). Grease a 9x13 inch baking dish.\nBeat the heavy cream until foamy in a large glass or metal mixing bowl. Gradually add the salt, continuing to beat until medium peaks form. Lift your beater or whisk straight up: the tip of the peak formed by the cream should curl over slightly. Set aside.\nPour 1 cup of the butternut sauce into the baking dish and place 3 lasagna noodles on top in a single layer. Spread half of the remaining sauce over the noodles and sprinkle with 1/2 cup of Parmesan cheese. Place another layer of noodles and spread the remaining sauce on top and sprinkle with 1/2 cup of Parmesan cheese. Place the final layer of noodles on top. Spread the whipped cream over the final layer of noodles making sure the pasta is completely covered. Sprinkle with the remaining 1/3 cup of Parmesan. Cover baking dish tightly with aluminum foil.\nBake in the preheated oven for 30 minutes. Remove foil and continue baking until the top is bubbly and golden brown, about 10 minutes. Allow to rest for 5 minutes before serving.\n",
        "picture_link": "f.v4GNpo2nZUqPiYyQ.fheS4nIpJBG."
    },
    {
        "title": "Amazing Crusted Chicken",
        "ingredients": [
            "2 cups cheese flavored crackers (such as Cheez-It®), crushed ADVERTISEMENT",
            "1 cup French-fried onions, crushed ADVERTISEMENT",
            "1/2 cup Italian bread crumbs ADVERTISEMENT",
            "2 teaspoons sesame seed, toasted ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves - cut in half ADVERTISEMENT",
            "3 tablespoons mayonnaise ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C). Spray a baking dish with cooking spray.\nMix cheese-flavored crackers, French-fried onions, Italian bread crumbs, sesame seeds, salt, and pepper in a bowl. Set aside.\nWash and pat chicken breasts dry. Spread a thin layer of mayonnaise on one side of each piece and place mayonnaise-side down in the cracker mixture. Spread a thin layer of mayonnaise on the other side of the chicken and cover with the cracker mixture, patting firmly into the chicken. Place chicken breasts on the prepared baking dish. Sprinkle remaining cracker mixture on top; lightly spray the chicken with cooking spray.\nBake in the preheated oven until the chicken breasts are no longer pink in the center and the juices run clear, 35 to 40 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "DzS8D/JH5Y1pyK.1r.PqFCeJjjtCjBK"
    },
    {
        "title": "Super Summer Kale Salad",
        "ingredients": [
            "3/4 cup white sugar ADVERTISEMENT",
            "1/2 cup vinegar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 cup extra-virgin olive oil ADVERTISEMENT",
            "1 bunch kale, stems removed and leaves chopped ADVERTISEMENT",
            "1/2 (16 ounce) package frozen shelled edamame (soybeans), thawed ADVERTISEMENT",
            "1/4 red onion, sliced thin ADVERTISEMENT",
            "1 cup shredded carrot ADVERTISEMENT",
            "2/3 cup fresh blueberries ADVERTISEMENT",
            "1/2 cup sweetened dried cranberries (such as Ocean Spray® Craisins®) ADVERTISEMENT",
            "1/2 cup cashew pieces ADVERTISEMENT",
            "1/2 cup shelled, roasted sunflower seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk sugar, vinegar, salt, pepper, and olive oil together in a bowl until sugar is dissolved; set aside.\nToss kale, edamame, red onion, carrot, blueberries, dried cranberries, cashew pieces, and sunflower seeds together in a bowl. Pour about half the dressing over the mixture and toss to coat. Cover bowl with plastic wrap and refrigerate 4 to 6 hours. Serve remaining dressing on side.\n",
        "picture_link": "FwxZjDgZnAOw4gwdCaMw7ZM00fSQIy6"
    },
    {
        "title": "Tortellini Soup",
        "ingredients": [
            "5 1/4 cups vegetable broth ADVERTISEMENT",
            "1 (14.5 ounce) can Italian-style stewed tomatoes ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "1 (16 ounce) package prepared cheese tortellini, thawed ADVERTISEMENT",
            "10 ounces spinach, rinsed and chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Combine tortellini and spinach and bring to a boil; reduce heat slightly and boil for 7 minutes. Drain and add to the tomatoes and broth; simmer for 20 minutes. Serve.\n",
        "picture_link": "3r1vSQftlrmIkiohH.hadR5Mze7n.6O"
    },
    {
        "title": "Slow-Cooked Pulled Pork Shoulder",
        "ingredients": [
            "1 (3 pound) pork shoulder ADVERTISEMENT",
            "4 cups water, or as needed ADVERTISEMENT",
            "8 cups white vinegar, or as needed ADVERTISEMENT",
            "1/4 cup kosher salt ADVERTISEMENT",
            "1 large onion, cut into 8 wedges ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "1 tablespoon ground mustard ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the pork shoulder into the ceramic bowl of a slow cooker. Pour enough water and white vinegar into the slow cooker to assure the pork is completely covered, maintaining a 2-to-1 ratio of vinegar to water. Add the salt. Put the ceramic bowl in the refrigerator and allow the pork to marinate at least 12 hours and up to 24 hours.\nDrain enough of the liquid from the ceramic bowl until about 1/2-inch of pork is left exposed. Add the onion to the remaining liquid. Season the exposed surface of the pork with the cumin, mustard, chili powder, and brown sugar. Place the bowl into the base of the slow cooker and cook on High until the pork is tender and falls apart easily, 8 to 10 hours.\nCarefully remove the pork to a cutting board; shred the meat into strands using a pair of forks. Remove and discard any excess fat.\n",
        "picture_link": "sz04wpN0UpcAUaWt6.P/c9bE//mAF1S"
    },
    {
        "title": "Holly Christmas Cookies",
        "ingredients": [
            "1 (16 ounce) package large marshmallows ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "1 1/2 teaspoons green food coloring ADVERTISEMENT",
            "4 1/2 cups cornflakes cereal ADVERTISEMENT",
            "1 (2.25 ounce) package cinnamon red hot candies ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan over low heat, melt together the marshmallows, butter, vanilla, and food coloring. Mix in the cornflakes cereal.\nDrop by spoonfuls on wax paper, and decorate with red hots. Set aside, and allow to cool.\n",
        "picture_link": "i2zDT.SsjLlccJ291YISL2APSGBS2vu"
    },
    {
        "title": "Oatmeal Raisin Cookies VII",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "3/4 cup self-rising flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups quick cooking oats ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease a 9x13 inch pan.\nIn a medium bowl, cream together the butter, brown sugar and white sugar, until smooth. Beat in the egg then stir in the vanilla. Combine the flour, baking soda, cinnamon and salt: stir into the creamed mixture. Fold in the quick oats and raisins. Spread evenly into the prepared pan.\nBake for 10 to 12 minutes in the preheated oven, until the edges are starting to brown. Let cool in pan before cutting into bars.\n",
        "picture_link": "NTfpCxw.X7HrXXeUJzTZQWgXYBBFIS."
    },
    {
        "title": "Smoked Paprika Vinaigrette",
        "ingredients": [
            "1/2 cup red wine vinegar ADVERTISEMENT",
            "1/3 cup honey ADVERTISEMENT",
            "1 tablespoon stone-ground mustard ADVERTISEMENT",
            "1 tablespoon lime juice ADVERTISEMENT",
            "3/4 teaspoon ground black pepper ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1 1/4 teaspoons smoked paprika ADVERTISEMENT",
            "1 clove garlic ADVERTISEMENT",
            "2 tablespoons chopped onion ADVERTISEMENT",
            "1/4 teaspoon oregano ADVERTISEMENT",
            "1 pinch white sugar (optional) ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend the red wine vinegar, honey, mustard, lime juice, pepper, salt, paprika, garlic, onion, oregano, and sugar together in a blender until thoroughly mixed. Drizzle the olive oil into the mixture while blending on low. Chill at least 1 hour before serving.\n",
        "picture_link": "Wmw9MK4rKy42o0hXQqEEZmxzFVknMXW"
    },
    {
        "title": "Sweet Banana Bread",
        "ingredients": [
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "1 1/4 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1 (3 ounce) package non-instant vanilla pudding mix ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1 1/3 cups mashed ripe banana ADVERTISEMENT",
            "1/3 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, sift together flour, baking powder, baking soda, salt and vanilla pudding mix. In a large mixing bowl, beat sugar and shortening until light, scraping sides of the bowl often. Add the eggs one at a time, beating smooth after each addition. Mix in the milk.\nAdd flour mixture and mashed bananas alternately to creamed mixture, beating until smooth after each addition. Fold in nuts if desired. Pour batter into a lightly greased 8x4 inch loaf pan.\nBake in a cold, (non-preheated) oven set to 350 degrees F (175 degrees C). Bake for 50 minutes, then cover with foil to prevent burning and bake for additional 10 to 20 minutes or until toothpick inserted into the crown comes out clean. Leave in pan for 10 minutes, then remove from pan and cool.\n",
        "picture_link": "TC7RxkJEbC9cQ4T6Gqpy8PW8jZLjbPa"
    },
    {
        "title": "White Chocolate Covered Pretzels",
        "ingredients": [
            "6 (1 ounce) squares white chocolate ADVERTISEMENT",
            "1 (15 ounce) package mini twist pretzels ADVERTISEMENT",
            "1/4 cup red and green candy sprinkles (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt white chocolate in the top of a double boiler, stirring constantly.\nDip pretzel halfway into the white chocolate, completely covering half of the pretzel. Roll in topping if desired, and lay on wax paper.\nContinue the process until all of the white chocolate is finished. Place in refrigerator for 15 minutes to harden. Store in airtight container.\n",
        "picture_link": "zDX7cAZCSAOG4A8VMxXMHf7qc97OlyW"
    },
    {
        "title": "Anaheim Fish Tacos",
        "ingredients": [
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "1 Anaheim chile pepper, chopped ADVERTISEMENT",
            "1 leek, chopped ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "2 large tomatoes, diced ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1 1/2 pounds halibut fillets ADVERTISEMENT",
            "1 lime ADVERTISEMENT",
            "12 corn tortillas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a large skillet over medium heat, and saute the chile, leek, and garlic until tender and lightly browned. Season with salt and pepper.\nMix the chicken broth and tomatoes into the skillet, and season with cumin. Bring to a boil. Reduce heat to low. Place the halibut into the mixture. Sprinkle with lime juice. Cook 15 to 20 minutes until the halibut is easily flaked with a fork. Wrap in warmed corn tortillas to serve.\n",
        "picture_link": "izg4oeOghhTblH.LWsGENrHzcKPdeS."
    },
    {
        "title": "Bill Clinton's Lemon Chess Pie",
        "ingredients": [
            "1 (9 inch) pie shell ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "5 eggs, beaten ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1 tablespoon cornmeal ADVERTISEMENT",
            "1/4 cup fresh lemon juice ADVERTISEMENT",
            "3 tablespoons lemon zest ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large mixing bowl, cream together sugar and butter or margarine until light and fluffy. Beat in eggs and milk. Add flour, cornmeal, lemon juice, and lemon rind. Mix until smooth. Pour mixture into pastry shell.\nBake in preheated oven for 35 to 40 minutes, until set in center.\n",
        "picture_link": "YX2.ASt8R9CRjGv7mpQAbMyHJZGjd9C"
    },
    {
        "title": "Delicious Healthy Strawberry Shake",
        "ingredients": [
            "2 cups milk ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup frozen strawberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender, combine milk, honey, vanilla and frozen strawberries. Blend until smooth. Pour into glasses and serve.\n",
        "picture_link": "vxuDiEk03T1vlFJMYwcJ646pLPkGE2i"
    },
    {
        "title": "Avocado and Tuna Tapas",
        "ingredients": [
            "1 (12 ounce) can solid white tuna packed in water, drained ADVERTISEMENT",
            "1 tablespoon mayonnaise ADVERTISEMENT",
            "3 green onions, thinly sliced, plus additional for garnish ADVERTISEMENT",
            "1/2 red bell pepper, chopped ADVERTISEMENT",
            "1 dash balsamic vinegar ADVERTISEMENT",
            "black pepper to taste ADVERTISEMENT",
            "1 pinch garlic salt, or to taste ADVERTISEMENT",
            "2 ripe avocados, halved and pitted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together tuna, mayonnaise, green onions, red pepper, and balsamic vinegar in a bowl. Season with pepper and garlic salt, then pack the avocado halves with the tuna mixture. Garnish with reserved green onions and a dash of black pepper before serving.\n",
        "picture_link": "VYG5MmD7qVbCxlk7nUuxibG3iBvQ2d."
    },
    {
        "title": "Pound Cake III",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "3 cups white sugar ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1 1/4 cups milk ADVERTISEMENT",
            "3 cups all-purpose flour, sifted ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 10 inch Bundt pan. Sift together the flour, baking powder and salt. Set aside.\nIn a large bowl, cream together the butter, shortening and sugar until light and fluffy. Beat in the eggs one at a time, then stir in the vanilla. Beat in the flour mixture alternately with the milk. Pour batter into prepared pan.\nBake in the preheated oven for 80 to 90 minutes, or until a toothpick inserted into the center of the cake comes out clean. Let cool in pan for 10 minutes, then turn out onto a wire rack and cool completely.\n",
        "picture_link": "uw8U6rESH2m9PlMF8xmr8js7vhzhx/i"
    },
    {
        "title": "Easy Sweet and Sour Chicken",
        "ingredients": [
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast halves, cut into 1-inch cubes ADVERTISEMENT",
            "3 tablespoons vegetable oil, divided ADVERTISEMENT",
            "3 celery ribs, sliced ADVERTISEMENT",
            "2 green bell peppers, diced ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "1/2 cup lemon juice ADVERTISEMENT",
            "1/2 cup crushed pineapple with syrup ADVERTISEMENT",
            "1/3 cup packed brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine flour, garlic powder, salt, and black pepper in a shallow dish.\nRoll and coat chicken cubes in flour mixture.\nHeat 2 tablespoons vegetable oil in a skillet over medium-high heat.\nCook and stir chicken in hot oil until not longer pink in the center and juices run clear, 8 to 10 minutes; remove and set aside.\nHeat 1 tablespoon vegetable oil in the same skillet over medium heat.\nCook and stir celery, green peppers, and onion in heated oil until slightly tender, about 5 minutes.\nReturn chicken to the skillet.\nWhisk ketchup, lemon juice, pineapple, and brown sugar in a bowl; pour into the skillet; bring to a boil.\nCook and stir chicken and vegetables in sauce until heated through, 2 to 3 minutes.\n",
        "picture_link": "XG2oEZLG.VIQDyoEcdSyITzcFs0aXJW"
    },
    {
        "title": "Roasted Balsamic Chicken with Baby Tomatoes",
        "ingredients": [
            "1/2 cup balsamic vinegar ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon Dijon mustard, or more to taste ADVERTISEMENT",
            "1 clove garlic, or more to taste, minced ADVERTISEMENT",
            "salt and freshly ground pepper to taste ADVERTISEMENT",
            "4 large skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 pint cherry tomatoes, halved ADVERTISEMENT",
            "1 lemon, zested and juiced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix balsamic vinegar, olive oil, mustard, and garlic together in an oven-safe baking dish; season with salt and pepper. Lie the chicken breasts in the vinegar mixture.\nMarinate chicken in the refrigerator for at least 4 hours.\nPreheat oven to 400 degrees F (200 degrees C).\nRoast chicken in the preheated oven for about 30 minutes. Add tomatoes to the baking dish and continue cooking until the chicken is no longer pink in the center and the juices run clear, about 10 minutes more. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nSprinkle lemon zest and drizzle lemon juice over the chicken.\n",
        "picture_link": "fs7ADvKE7ESzUz9kJTYvD5QRU3gEtw2"
    },
    {
        "title": "Stir Fried Kale",
        "ingredients": [
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 cup bread crumbs ADVERTISEMENT",
            "3 bunches kale - washed, dried, and shredded ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil over medium-high heat in a large frying pan. Add onions and garlic; cook and stir until soft.\nMix in breadcrumbs, and cook and stir until brown.\nStir in kale, and cook until wilted. Serve hot or warm.\n",
        "picture_link": "xOer90WuKaTXoHpblWNs9NMhrZgbPGq"
    },
    {
        "title": "Rum Cake I",
        "ingredients": [
            "1 cup chopped walnuts ADVERTISEMENT",
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1/2 cup dark rum ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1 (3.5 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/8 cup water ADVERTISEMENT",
            "1/4 cup dark rum ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease and flour one 10 inch tube or Bundt pan. Sprinkle walnuts over the bottom of the pan.\nMix together the yellow cake mix, 1/2 cup dark rum, eggs, 1/2 cup cold water, cooking oil and instant vanilla pudding. Pour batter over nuts.\nBake at 325 degrees F (165 degrees C) for 1 hour. Cool, invert on a serving plate and prick the top.\nTo Make Glaze: Melt the butter in a saucepan. Stir in 1/8 cup water and sugar. Boil for 5 minutes, stirring constantly. Remove mixture from heat and stir in rum. Drizzle and smooth glaze evenly over the top and sides of cake. Enjoy!\n",
        "picture_link": "nv0R8UMVs22.70FYX4W4EAXNwTHcKDe"
    },
    {
        "title": "Six Week Bran Muffins",
        "ingredients": [
            "6 cups boiling water ADVERTISEMENT",
            "6 cups whole bran cereal ADVERTISEMENT",
            "3 cups shortening ADVERTISEMENT",
            "9 cups white sugar ADVERTISEMENT",
            "12 eggs ADVERTISEMENT",
            "12 cups buttermilk ADVERTISEMENT",
            "15 cups all-purpose flour ADVERTISEMENT",
            "5 tablespoons baking soda ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "12 cups whole bran cereal ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, add boiling water to the first 6 cups of bran cereal, cool.\nCream shortening or margarine, sugar, eggs, and buttermilk together. Add to bran mixture. Stir in flour, baking soda, and salt. Fold in the 12 cups of bran cereal. Stir only until moistened.\nBake in a preheated 425 degree F (220 degree C) oven for 20 to 25 minutes.\n",
        "picture_link": "XvefYH89R5cSFca9Gt3jOTMna0..NA6"
    },
    {
        "title": "Oatmeal Toffee Cookies",
        "ingredients": [
            "3/4 cup butter, softened ADVERTISEMENT",
            "1/2 cup packed light brown sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups rolled oats ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "2 cups toffee baking bits ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C). Line cookie sheets with parchment paper.\nIn a medium bowl, cream together the butter and brown sugar. Stir in the egg and vanilla until smooth. Sift together the flour, salt and baking soda, stir into the creamed mixture. Then stir in the rolled oats. Finally, stir in the pecans chopped candy bar pieces.\nDrop dough by rounded tablespoons onto the prepared cookie sheets, and flatten slightly. Bake for 10 to 18 minutes in the preheated oven. Cookies will have a dry appearance when finished baking.\n",
        "picture_link": "paAn9fQY.V7l9VeilRwuC/4FYowG482"
    },
    {
        "title": "Scrumptious Frosted Fudgy Brownies",
        "ingredients": [
            "8 (1 ounce) squares unsweetened baking chocolate ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "3 cups white sugar ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 cups chopped walnuts ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "5 (1 ounce) squares unsweetened baking chocolate ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease a 13x9-inch baking pan. Place 8 ounces of baking chocolate with 1 cup of butter in a microwave-safe bowl, and microwave on High until the chocolate is soft and the butter has melted, about 2 minutes. Stir to mix.\nPlace the eggs, 3 cups of sugar, and 1 tablespoon of vanilla extract in a large bowl, and beat with an electric mixer on high speed for 2 minutes. Reduce the mixer speed to low, and beat in the melted butter-chocolate mixture. Beat in the flour until just combined (do not overmix), and stir in the chopped walnuts. Spread the batter in the prepared pan.\nBake in the preheated oven until a toothpick inserted into the center comes out with fudgy crumbs, about 35 minutes. Cool in the pan before frosting.\nTo make frosting, combine 1 1/4 cup of sugar with the heavy cream in a saucepan over medium heat, and stir until the sugar dissolves and the mixture begins to simmer, about 3 minutes. Reduce the heat to low, and let the mixture simmer for 7 minutes without stirring.\nRemove the cream mixture from the heat, and stir in 5 ounces of baking chocolate and 1/2 cup butter, stirring to melt and blend the chocolate. Add 1 teaspoon vanilla extract; whisk until smooth. Place the frosting in the refrigerator and stir every few minutes until the frosting is chilled and thick, about 30 minutes. Frost the cooled brownies, and cut into squares.\n",
        "picture_link": "/H/YjeHLkO2ADEEXN4Wd2/Ip3e6qsWa"
    },
    {
        "title": "Pumpkin Pie",
        "ingredients": [
            "1 egg ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups pumpkin puree ADVERTISEMENT",
            "1 1/2 cups evaporated milk ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "2 tablespoons light corn syrup ADVERTISEMENT",
            "1 recipe pastry for a 9 inch single crust pie ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nAdd the sugar gradually to the pumpkin puree. Beat well an stir in the flour, salt and spices. Stir in the corn syrup and beat well. Stir in the slightly beaten egg, then slowly add the evaporated milk, mixing until well blended. Pour the batter into the unbaked pie shell.\nBake at 450 degrees F (230 degrees C) for 10 minutes then reduce the oven temperature to 325 degrees F (165 degrees F) and continue baking pie for an additional 30 minutes or until a knife inserted into the mixture comes out clean.\n",
        "picture_link": "1RYbNn/loDsn4go3J3plnFOEtnr/GAq"
    },
    {
        "title": "Liver and Onions",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "1 pound calves' livers ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium skillet, melt butter over medium heat. Stir in onion and saute until softened. Stir in sugar and continue to cook until onion caramelizes.\nRinse liver and remove thin outer membrane. Slice liver into 1/4 to 1/2 inch thick slices.\nHeat remaining butter in a medium skillet over medium heat\nDredge liver slices in flour and brown in melted butter for about 1 to 1 1/2 minutes per side. Remove from heat and season to taste with salt and pepper. Serve liver smothered with caramelized onions.\n",
        "picture_link": "IKPWbXUmK10lEQrbqHiY4NWGN3k1eIG"
    },
    {
        "title": "Mexican Bean Burgers",
        "ingredients": [
            "1 carrot, sliced ADVERTISEMENT",
            "1 (15 ounce) can kidney beans ADVERTISEMENT",
            "1/2 cup chopped green bell pepper ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "2 cups salsa ADVERTISEMENT",
            "1 cup dried bread crumbs ADVERTISEMENT",
            "1/2 cup whole wheat flour ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 pinch chili powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place carrot into a bowl, and fill with about 1/4 inch of water. Cover with plastic wrap, and cook in the microwave for 2 minutes, or until soft. Drain.\nMash beans and steamed carrot in a large bowl. Mix in green pepper, onion, salsa, bread crumbs, and whole wheat flour. Season with salt, black pepper, and chili powder. Add flour to create a firmer mixture, or more salsa if the mixture is too stiff. Form mixture into 8 patties, and place on a greased baking sheet.\nHeat a large skillet over medium-high heat, and coat with cooking spray. Fry the patties for about 8 minutes on each side, or until browned and firm.\n",
        "picture_link": ".Ecv0HGfK3EDP.TJh6/cN8OBzXoEQbm"
    },
    {
        "title": "Tomato Cucumber Salad",
        "ingredients": [
            "2 tomatoes, chopped ADVERTISEMENT",
            "1 cucumber, peeled and diced ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine tomatoes, cucumbers, and onions in a salad bowl. Season to taste with salt and black pepper. Sprinkle with lemon juice. Chill.\n",
        "picture_link": "OJy2Ksv8HgMP5Q6dL5rZA2t9fJ39Xp2"
    },
    {
        "title": "Tater Crisp Chicken",
        "ingredients": [
            "10 chicken legs ADVERTISEMENT",
            "1 cup melted butter ADVERTISEMENT",
            "2 cups dry potato flakes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nPlace melted butter or margarine in a shallow dish or bowl, then place potato flakes in a separate shallow dish or bowl. Roll chicken pieces in butter or margarine, then in potato flakes. Place coated chicken pieces in a 9x13 inch baking dish, skin side up.\nBake at 400 degrees F (200 degrees C) for 1 hour.\n",
        "picture_link": "gOrbXbhZaJuh8ZNSV8pdWGn0aNtuJ5W"
    },
    {
        "title": "Molasses Cookies II",
        "ingredients": [
            "3/4 cup shortening ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup light molasses ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream together shortening and brown sugar. Stir in egg and molasses and mix well. Fold in dry ingredients and stir. Cover and chill until firm (1 - 2 hours).\nPreheat oven to 350 degrees F (175 degrees C).\nRoll dough into small balls (I use a small melon baller to help with this) and roll in white sugar. Place on lightly greased cookie sheets.\nBake 9 - 10 minutes. Leave on cookie sheet one minute until set.\n",
        "picture_link": "9uLOcvFeMX1/uzrdcqEMd3jd/6vzvDi"
    },
    {
        "title": "Tanya's Snickerdoodles",
        "ingredients": [
            "3 3/4 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon cream of tartar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1 teaspoon almond extract ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "2 teaspoons brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sift together the flour, baking soda, cream of tartar and salt, set aside. In a medium bowl, cream together the butter and sugar. Stir in the eggs, milk, vanilla and almond extracts. Gradually stir in the dry ingredients until fully incorporated. Cover bowl and chill for 1 to 2 hours.\nPreheat oven to 375 degrees F (190 degrees C). Grease cookie sheets.\nIn a shallow bowl or saucer, stir together the remaining brown sugar, white sugar and cinnamon. Roll the chilled dough into 1 inch balls, then roll the balls in the sugar mixture. Place cookies 2 inches apart on the prepared cookie sheets.\nBake for about 8 minutes in the preheated oven, until cookies begin to brown at the edges. Remove from baking sheets to cool on wire racks.\n",
        "picture_link": "4O3BRdATZeia1qlnjhv2L1dxIsuap/G"
    },
    {
        "title": "German Chocolate Fudge",
        "ingredients": [
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "12 (1 ounce) squares German sweet chocolate ADVERTISEMENT",
            "1 (7 ounce) jar marshmallow creme ADVERTISEMENT",
            "4 1/2 cups white sugar ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 (12 fluid ounce) can evaporated milk ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "2 cups chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine chocolate chips, German sweet chocolate and marshmallow creme in large bowl.\nCombine sugar, butter, evaporated milk and salt in heavy skillet. Bring to a boil over medium heat. Cook for 6 minutes, stirring constantly.\nPour hot syrup over chocolate mixture. Stir with wooden spoon until smooth. Stir in pecans.\nSpread into buttered 10x15 inch pan. Let stand until firm; cut into squares.\n",
        "picture_link": "quMsaRImEs.AhPdnGEoFuF5jPKIqHGS"
    },
    {
        "title": "Slow Cooker Lime Chicken with Rice",
        "ingredients": [
            "1 1/4 pounds skinless, boneless chicken breast halves ADVERTISEMENT",
            "1/3 cup lime juice ADVERTISEMENT",
            "2 cups chicken broth ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 teaspoon dried thyme leaves ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 cups uncooked instant rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the chicken breasts into a slow cooker; pour in the lime juice and chicken stock. Add the garlic, thyme, pepper, and butter.\nCover, and cook on Low until the chicken is very tender, 8 to 10. Stir in the rice during the last 15 minutes of cooking time.\n",
        "picture_link": "aAHmySyIvTJiivJMb64i..H6sN7DdQy"
    },
    {
        "title": "Corn Tortillas",
        "ingredients": [
            "1 3/4 cups masa harina ADVERTISEMENT",
            "1 1/8 cups water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, mix together masa harina and hot water until thoroughly combined. Turn dough onto a clean surface and knead until pliable and smooth. If dough is too sticky, add more masa harina; if it begins to dry out, sprinkle with water. Cover dough tightly with plastic wrap and allow to stand for 30 minutes.\nPreheat a cast iron skillet or griddle to medium-high.\nDivide dough into 15 equal-size balls. Using a tortilla press, a rolling pin, or your hands, press each ball of dough flat between two sheets of plastic wrap.\nImmediately place tortilla in preheated pan and allow to cook for approximately 30 seconds, or until browned and slightly puffy. Turn tortilla over to brown on second side for approximately 30 seconds more, then transfer to a plate. Repeat process with each ball of dough. Keep tortillas covered with a towel to stay warm and moist until ready to serve.\n",
        "picture_link": "7mBfg8QxpuB84IIvGkFzgFL7okJmfa6"
    },
    {
        "title": "Quick and Easy Black Bean Soup",
        "ingredients": [
            "6 slices bacon, chopped ADVERTISEMENT",
            "1 large onion, diced ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "2 cups chicken broth ADVERTISEMENT",
            "pinch of dried oregano ADVERTISEMENT",
            "pinch of cayenne pepper ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "2 (14.5 ounce) cans black beans, rinsed and drained ADVERTISEMENT",
            "14 1/2 fluid ounces water ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "Relish: ADVERTISEMENT",
            "1/3 cup minced green onion ADVERTISEMENT",
            "2 teaspoons sambal paste (or minced red chiles) ADVERTISEMENT",
            "juice of 1 lime ADVERTISEMENT",
            "Garnish: ADVERTISEMENT",
            "chopped green onion (optional) ADVERTISEMENT",
            "sour cream (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a cold pot. Turn heat to medium, cook and stir until the bacon is cooked but not crisp.\nStir in onion; cook and stir for 5 minutes, until the onion turns translucent and golden.\nStir in garlic; cook for 2-3 minutes. Add chicken stock, turn heat to medium-high. Stir in oregano, cayenne and salt. Add black beans and water. Return to a simmer.\nSimmer on medium-low, stirring occasionally, for 20-30 minutes. While it's cooking, mash about half the beans to thicken the soup.\nStir in black pepper and cumin. Add salt to taste.\nMake the relish by stirring together minced green onion, sambal paste, and lime juice.\nServe garnished with relish, chopped green onions, and sour cream.\n",
        "picture_link": "x71TUSVvowcaXayhl/ha4ndrA45hddq"
    },
    {
        "title": "Allspice Cream Cheese Frosting",
        "ingredients": [
            "1 (3 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/3 cup butter, softened ADVERTISEMENT",
            "3/4 teaspoon ground allspice ADVERTISEMENT",
            "4 cups confectioners' sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, blend the cream cheese, butter, and allspice. Gradually mix in the confectioners' sugar, vanilla, and milk until the mixture is spreadable.\n",
        "picture_link": "PB.BItDkxtWMTAHYoqUDiDgMewgddx6"
    },
    {
        "title": "Spicy Shrimp Creole",
        "ingredients": [
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "2 cups julienne celery ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "4 cloves crushed garlic ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon cayenne pepper ADVERTISEMENT",
            "2 (14.5 ounce) cans crushed tomatoes ADVERTISEMENT",
            "1 (15 ounce) can tomato sauce ADVERTISEMENT",
            "1 bay leaf, crushed ADVERTISEMENT",
            "1 tablespoon hot pepper sauce ADVERTISEMENT",
            "2 pounds medium shrimp - peeled and deveined ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a Dutch oven on medium heat. Saute celery, onions, and garlic in the Dutch oven until the onions are pearly white and the celery has begun to soften.\nMix sugar, flour, salt, pepper and cayenne pepper into the Dutch oven. Add crushed tomatoes and tomato sauce, both pieces of bay leaf, and hot sauce. Bring the mixture to a boil, then turn the heat to low.\nLet the mixture simmer for 30 minutes, stirring occasionally.\nApproximately 15 minutes before serving, add shrimp to the pot and stir well. If necessary, raise the temperature to medium-low to ensure the Creole is bubbling but not burning. Scoop out the bay leaf halves before serving. Serve when the shrimp is pink and thoroughly cooked.\n",
        "picture_link": "RZyBruw2afs0SnoClLcd0cEpUT.kfQC"
    },
    {
        "title": "Picante Chicken Rice Burritos",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 cup chopped green onion ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "7 cups shredded, cooked chicken meat ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "2 1/2 cups chicken broth, divided ADVERTISEMENT",
            "1 (16 ounce) jar picante sauce, divided ADVERTISEMENT",
            "1 cup uncooked long grain rice ADVERTISEMENT",
            "1/2 cup sliced black olives ADVERTISEMENT",
            "3 cups shredded Cheddar cheese, divided ADVERTISEMENT",
            "12 (10 inch) flour tortillas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To Make Chicken Mixture: In a large skillet over medium heat, melt butter and saute green onion and garlic until soft; stir in chicken, chili powder, 1/4 cup broth and 3/4 cup picante sauce. Heat through, then set aside.\nTo Make Rice: In a large saucepan, bring rice and remaining 2 1/4 cups broth to a boil. Reduce heat, cover pan and simmer for 20 minutes. Stir in remaining 1 1/4 cups picante sauce, cover and simmer for another 5 to 10 minutes or until rice is tender.\nMeanwhile, preheat oven to 375 degrees F (190 degrees C).\nTo Assemble Burritos: Stir chicken mixture into rice, then add olives and 2 cups of the cheese. Mix well. Spoon 1 cup of filling onto each tortilla, off center. Fold sides and ends over filling, then roll up. Arrange filled tortillas in two 9x13 inch baking dishes and sprinkle remaining cup of cheese on top.\nBake at 375 degrees F (190 degrees C) for 10 to 15 minutes, or until heated through.\n",
        "picture_link": "Td.aytnHTJVO2pv/QIjr8QwIBos207a"
    },
    {
        "title": "Mom's Scalloped Potatoes",
        "ingredients": [
            "3 pounds potatoes, thinly sliced ADVERTISEMENT",
            "1/2 onion, thinly sliced ADVERTISEMENT",
            "9 tablespoons all-purpose flour, divided ADVERTISEMENT",
            "6 tablespoons butter, diced and divided ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "3 cups whole milk, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease a 9x13-inch baking dish.\nSpread about 1/3 of the potato slices into the bottom of the prepared baking dish. Top with about 1/3 of the onion slices. Sprinkle 3 tablespoons flour over the potato and onion. Arrange 2 tablespoons butter atop the flour. Season the entire layer with salt and pepper. Repeat layering twice more.\nHeat milk in a saucepan until warm. Pour enough warm milk over the mixture in the baking dish so the top of the liquid is level with the final layer of potatoes.\nBake in preheated oven until potatoes are tender, 45 to 60 minutes.\n",
        "picture_link": "rJyLG8JEPhoOsLlRW6T19rhgSDAN2Ce"
    },
    {
        "title": "Broccoli Garlic Angel Hair Pasta",
        "ingredients": [
            "1 1/2 pounds broccoli ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "6 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon red pepper flakes ADVERTISEMENT",
            "3 cups chicken stock ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 pound angel hair pasta ADVERTISEMENT",
            "1/2 cup freshly shredded Parmigiano-Reggiano cheese, plus a little more for garnish ADVERTISEMENT",
            "1 pinch red pepper flakes for garnish, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Hold a sharp knife at a 45-degree angle and cut the florets from the broccoli stems into a bowl. Chop remaining stems into small pieces and transfer stems to a separate bowl.\nHeat 2 tablespoons olive oil with butter in a skillet over medium heat and cook garlic in the hot oil-butter mixture, stirring often, until garlic is soft but not browned. Sprinkle in 1 teaspoon red pepper flakes and salt. Pour chicken stock into skillet and bring to a simmer. Stir broccoli stems into the stock mixture and simmer until tender, 10 to 12 minutes. Add a little water or stock if mixture starts to dry out.\nStir broccoli florets into skillet and cook broccoli sauce until florets are bright green and slightly tender, 3 to 4 minutes.\nBring a large pot of salted water to a boil and stir in angel hair pasta. Cook, stirring occasionally, until pasta strands are almost tender, about 4 minutes. Drain and transfer to a large pot.\nPour broccoli sauce over pasta, stir with a wooden spoon, and mix in 1/2 cup Parmigiano-Reggiano cheese. Cover pot with a lid and let stand until pasta absorbs excess liquid and finishes cooking, about 2 minutes.\nServe in bowls and sprinkle each serving with a dusting of Parmigiano-Reggiano cheese and a pinch of red pepper flakes.\n",
        "picture_link": "FV/JetLpZJ6t/nCsC.MknTlkNc55gfW"
    },
    {
        "title": "Ground Beef and Cabbage",
        "ingredients": [
            "1 large head cabbage, finely chopped ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes with juice ADVERTISEMENT",
            "1 onion, halved and thinly sliced ADVERTISEMENT",
            "1 tablespoon Italian seasoning ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine cabbage, tomatoes with juice, onion, Italian seasoning, salt, and black pepper in a large pot over low heat. Bring cabbage mixture to a simmer and crumble ground beef into the pot. Cover and cook until cabbage is tender and ground beef is cooked through, about 45 minutes. Stir occasionally.\n",
        "picture_link": "mOcJbO7NzvbhWd3KbYvgoX.WRRBYrny"
    },
    {
        "title": "Coconut Lime Rice",
        "ingredients": [
            "1 cup basmati rice ADVERTISEMENT",
            "1 tablespoon coconut oil ADVERTISEMENT",
            "1 teaspoon butter ADVERTISEMENT",
            "1/4 cup flaked coconut ADVERTISEMENT",
            "1 cup coconut milk ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "salt, to taste ADVERTISEMENT",
            "1 lime, zested and juiced ADVERTISEMENT",
            "ground black pepper, to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse rice until the water runs clear; drain. Heat coconut oil and butter in a large skillet over medium-high heat. Cook and stir rice and coconut flakes for 3 to 4 minutes. Stir in the lime juice, then add the coconut milk, chicken broth, salt and lime zest. Bring to a low boil, then cover and reduce heat to low. Cook for 20 minutes. Remove from heat and keep covered for 5 minutes. Fluff with fork and season with pepper.\n",
        "picture_link": "K0TyzIcmdU.O1E1mL3Am4nSNnM2pfGO"
    },
    {
        "title": "Slow Cooker Apple Cider Braised Pork",
        "ingredients": [
            "1 (4 pound) boneless pork shoulder roast ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "2 shallots, sliced ADVERTISEMENT",
            "1 rib celery, chopped ADVERTISEMENT",
            "1/2 cup apple cider vinegar ADVERTISEMENT",
            "2 1/2 cups apple cider ADVERTISEMENT",
            "4 cloves garlic, peeled ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1 1/2 teaspoons Dijon mustard ADVERTISEMENT",
            "1 pinch cayenne pepper, or more to taste ADVERTISEMENT",
            "2 tablespoons cold butter, cut into small pieces ADVERTISEMENT",
            "1 tablespoon chopped fresh herbs (Italian parsley, sage, or thyme) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season pork with salt and black pepper. Heat oil in a large skillet over high heat. Sear pork on all sides in the hot oil until browned, about 3 minutes per side. Transfer pork to the slow cooker.\nReduce stovetop temperature to medium; cook and stir shallots and celery in the skillet until they begin to soften, 3 to 4 minutes. Pour in apple cider vinegar and cook, scraping up any browned bits, until liquid is nearly evaporated, 4 to 5 minutes.\nPour shallot mixture over pork shoulder in the slow cooker. Add apple cider, garlic cloves, and bay leaf. Cover, set slow cooker to Low, and cook until fork-tender but not falling apart, about 6 hours. Turn pork over every 1 to 2 hours. Remove pork roast to a plate and cover loosely with foil.\nPour remaining liquid from the slow cooker through a fine mesh strainer into a large saucepan; place over high heat. Discard bay leaf and other solids. Bring sauce mixture to a boil, decrease heat and cook, skimming fat from the top, until reduced to 1/4 of the original volume, about 10 minutes.\nRemove sauce from heat and stir in Dijon mustard and cayenne pepper. Slowly whisk in cold butter until incorporated. Sprinkle in fresh herbs and season with salt and black pepper to taste.\nCut pork into 1/4-thick slices and serve with sauce poured over the top.\n",
        "picture_link": "bHB28IJXcsRb86XsmxczjKTCWDaG4J."
    },
    {
        "title": "Mongolian Beef from the Slow Cooker",
        "ingredients": [
            "1/4 cup cornstarch ADVERTISEMENT",
            "1 1/2 pounds beef flank steak ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "3/4 cup soy sauce ADVERTISEMENT",
            "3/4 cup brown sugar ADVERTISEMENT",
            "1/2 cup shredded carrots ADVERTISEMENT",
            "3 green onions, chopped ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 teaspoon minced fresh ginger root ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread cornstarch into a wide, shallow bowl. Dredge flank steak in the cornstarch to coat completely; put into a large resealable plastic bag.\nStir water, soy sauce, brown sugar, carrots, green onions, olive oil, garlic, and ginger together in a bowl; pour into the bag with the beef and seal.\nPut bag of marinating beef in the freezer until the day before you wish to prepare it.\nRemove bag from freezer and put bag into a bowl and place in refrigerator to thaw, at least 24 hours before you wish to prepare the beef.\nEmpty bag into the crock of a slow cooker.\nCook on High until the beef is tender, 2 to 3 hours. Alternately, you can cook this on Low for 4 to 5 hours.\n",
        "picture_link": "rplej7//00tbA18TX/eiVCPZ9JBEm72"
    },
    {
        "title": "Chorizo Stuffed Bell Peppers",
        "ingredients": [
            "6 bell peppers, tops cut off and seeded ADVERTISEMENT",
            "1 pound chorizo sausage ADVERTISEMENT",
            "1 stalk celery, minced ADVERTISEMENT",
            "1 carrot, minced ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 (14.5 ounce) can whole peeled tomatoes, chopped ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "chopped fresh parsley ADVERTISEMENT",
            "chopped fresh basil ADVERTISEMENT",
            "1/2 cup uncooked long grain rice ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/3 cup shredded Monterey Jack cheese ADVERTISEMENT",
            "1/3 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/3 cup shredded Mozzarella Cheese ADVERTISEMENT",
            "1 (10.75 ounce) can tomato soup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of water to boil. Place peppers in boiling water, and cook 5 minutes. Remove, and set aside to cool.\nPreheat oven to 350 degrees F (175 degrees C).\nIn a large skillet, cook chorizo until almost brown. Drain fat. Stir in celery, carrots, onions, and garlic. Cook until soft, about 5 minutes. Season with salt and pepper. Stir in tomatoes, Worcestershire sauce, parsley, basil, rice, and water. Cover, and simmer until rice is cooked, about 15 minutes. Remove from heat, and mix in Monterey Jack, Cheddar, and Mozzarella cheeses.\nPlace peppers upright on a baking sheet. Stuff each pepper with the chorizo mixture. Sprinkle extra cheese on top.\nIn a small bowl, combine tomato soup with just enough water to give the soup the consistency of gravy. Pour generously over peppers. Cover with foil.\nBake in preheated oven about 30 minutes.\n",
        "picture_link": "T1yWQNqPECvxrdFqj47HGcdXyary2fe"
    },
    {
        "title": "Roast Adobo Pork Loin",
        "ingredients": [
            "2 tablespoons chili powder ADVERTISEMENT",
            "1 tablespoon GOYA® Adobo All-Purpose Seasoning with Pepper ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon packed dark brown sugar ADVERTISEMENT",
            "1/8 teaspoon ground cinnamon ADVERTISEMENT",
            "2 tablespoons GOYA® Extra Virgin Olive Oil ADVERTISEMENT",
            "1 (2 pound) boneless pork loin roast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 450 degrees F. In small bowl, mix together chili powder, Adobo, cumin, dark brown sugar and cinnamon until well combined. Stir olive oil into Adobo mixture until completely saturated.\nUsing paper towels, pat pork loin dry. Rub pork all over with Adobo mixture. Transfer pork to foil-lined roasting pan. Cook until pork is dark golden brown and instant-read thermometer registers 145 degrees F when inserted into center of loin, about 35 minutes.\nTransfer pork to platter; tent with foil to keep warm. Let rest 10-15 minutes before slicing. Serve with accumulated juices.\n",
        "picture_link": "whxiVl7PVQGgUN3T4C7wXh2U.Ogyhz6"
    },
    {
        "title": "Barbequed Steelhead Trout",
        "ingredients": [
            "2 pounds steelhead trout fillets ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1/4 teaspoon paprika ADVERTISEMENT",
            "1/8 teaspoon cayenne pepper ADVERTISEMENT",
            "1/4 cup barbeque sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium heat, and lightly oil the grate.\nArrange the trout fillets on large piece of aluminum foil. Whisk together the butter, lemon juice, paprika, and cayenne pepper; brush the mixture onto the fillets.\nCook on the preheated grill until the fish flakes easily with a fork, about 10 minutes; brush the fillets with the barbeque sauce; cook another 2 minutes.\n",
        "picture_link": "lk9vAKx0BvirpKgBf4NFAEqOyazz35G"
    },
    {
        "title": "Unbelievably Good Fruit Dip",
        "ingredients": [
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 teaspoon fresh lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, blend cream cheese, sweetened condensed milk and lemon juice. Cover and chill in the refrigerator at least 3 hours before serving.\n",
        "picture_link": "J9Lmw3qudIMVgdMy22/veA86d66cV7."
    },
    {
        "title": "Parmesan Puffs",
        "ingredients": [
            "1/2 cup milk ADVERTISEMENT",
            "1/4 cup margarine ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1 cup marinara sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease a medium baking sheet.\nIn a medium saucepan, bring milk and margarine to boil over medium high heat. Stir in flour and reduce heat to low. Vigorously stir until thick enough to form into a ball. Remove from heat.\nBeat eggs into the mixture until smooth. Stir in Parmesan cheese.\nDrop the dough by rounded teaspoonfuls onto the prepared baking sheet. Bake in the preheated oven 15 minutes, or until puffed and golden brown. Serve warm with warmed marinara sauce for dipping.\n",
        "picture_link": "KrqGjuydmcKufx0t/FtcIG4cKX/x.XG"
    },
    {
        "title": "Very Simple Spelt Bread",
        "ingredients": [
            "8 cups spelt flour ADVERTISEMENT",
            "1/2 cup sesame seeds ADVERTISEMENT",
            "1/2 teaspoon salt, or to taste ADVERTISEMENT",
            "1 tablespoon blackstrap molasses ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "4 1/4 cups milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Grease two 9x5 inch loaf pans.\nIn a large bowl, mix together the spelt flour, sesame seeds, salt, molasses, baking soda and milk until well blended. Divide the batter evenly between the prepared pans.\nBake for 1 hour and 10 minutes in the preheated oven, or until golden. Placing a tin of the same size over the top of the loaf while baking gives it a lovely crust.\n",
        "picture_link": "4TwM9RZ16EzYj7K9datbGPWE6vRHQVe"
    },
    {
        "title": "Chile Rellenos",
        "ingredients": [
            "12 Anaheim chile peppers, charred and peeled ADVERTISEMENT",
            "1 pound Cheddar cheese, cut into strips ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon canola oil ADVERTISEMENT",
            "1/2 cup all-purpose flour for coating ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Remove seeds and membranes from peppers. Stuff each pepper with a strip of cheese.\nIn a small bowl combine milk, the 1 cup flour, egg, baking powder, baking soda, salt and canola oil; mix well to make a batter.\nPour enough oil in heavy frying pan to reach 1 inch in depth and heat over medium-high heat. Roll each pepper in the remaining flour and dip in the batter. Fry until lightly browned on both sides.\n",
        "picture_link": "fbSReljbr4UJGaTMCrGt0lX3e6lPfIe"
    },
    {
        "title": "Southwestern Turkey Casserole",
        "ingredients": [
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 (7 ounce) can diced green chile peppers, drained ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "16 (6 inch) corn tortillas, cut into strips ADVERTISEMENT",
            "10 ounces cooked turkey, diced ADVERTISEMENT",
            "8 ounces shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a mixing bowl, combine the chicken soup, mushroom soup, chile peppers and sour cream.\nLine the bottom of a 9x13 inch baking pan with corn tortillas. Follow with a layer of turkey. Pour soup mixture over turkey, sprinkle with 1/2 of the cheese. Repeat layers and top with cheddar cheese. Bake for 30 to 45 minutes or until cheese is browned and bubbly.\n",
        "picture_link": "wlG7ox2OiJU0M0s5U8Vupf4BRMqfrMa"
    },
    {
        "title": "Irish Champ",
        "ingredients": [
            "2 pounds potatoes, peeled and halved ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 bunch green onions, thinly sliced ADVERTISEMENT",
            "1/2 teaspoon salt, or to taste ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 pinch freshly ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes into large pot, and fill with enough water to cover. Bring to a boil, and cook until tender, about 20 minutes.\nDrain well. Return to very low heat and allow the potatoes to dry out for a few minutes. (It helps if you place a clean dish towel over the potatoes to absorb any remaining moisture.)\nMeanwhile, heat the milk and green onions gently in a saucepan, until warm.\nMash the potatoes, salt and butter together until smooth. Stir in the milk and green onion until evenly mixed. Season with freshly ground black pepper. Serve piping hot in bowls. Set out some extra butter for individuals to add to their servings.\n",
        "picture_link": "ANxJ4Fckuif5LpXftZam8l.zIhc9ff6"
    },
    {
        "title": "Heavenly Blueberry Smoothie",
        "ingredients": [
            "1 frozen banana, thawed for 10 to 15 minutes ADVERTISEMENT",
            "1/2 cup vanilla soy milk ADVERTISEMENT",
            "1 cup vanilla fat-free yogurt ADVERTISEMENT",
            "1 1/2 teaspoons flax seed meal ADVERTISEMENT",
            "1 1/2 teaspoons honey ADVERTISEMENT",
            "2/3 cup frozen blueberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut banana into small pieces and place into the bowl of a blender. Add the soy milk, yogurt, flax seed meal, and honey. Blend on lowest speed until smooth, about 5 seconds. Gradually add the blueberries while continuing to blend on low. Once the blueberries have been incorporated, increase speed, and blend to desired consistency.\n",
        "picture_link": "ZZd8q3QtzklP8pv8S3mUQdU4cn0.woS"
    },
    {
        "title": "Coconut Rice",
        "ingredients": [
            "2 1/2 cups Basmati rice ADVERTISEMENT",
            "4 (10 ounce) cans coconut milk ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan over high heat, combine rice, coconut milk and salt; bring to a boil.\nReduce heat, cover and simmer for 20 to 25 minutes, or until liquid is absorbed and rice is tender.\n",
        "picture_link": "4uT/xI7eiuqByXhyvUX24L933/A3i4a"
    },
    {
        "title": "Kraut Bierocks",
        "ingredients": [
            "1 1/2 (.25 ounce) packages active dry yeast ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 cups warm water ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup powdered milk ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "1 pound ground Italian sausage ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "3 cups shredded cabbage ADVERTISEMENT",
            "3 tablespoons prepared mustard ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "2 teaspoons ground black pepper ADVERTISEMENT",
            "1/2 cup shredded, processed American cheese ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To Make Sweet Dough: In a medium bowl combine the yeast, sugar and water and mix together; let stand 10 minutes. Stir in flour, dry milk, baking powder and shortening, then knead mixture for 10 minutes, adding as little flour as necessary. Cover bowl with a damp cloth and let rise in a warm place for 30 minutes, then knead again.\nTo Make Filling: Meanwhile, brown beef, sausage and onion in a large skillet over medium high heat. Drain extra fat from skillet, then stir in cabbage, mustard, salt and pepper and cook for 5 minutes. Add cheese and cook, stirring, until cheese is melted.\nPreheat oven to 350 degrees F (175 degrees C).\nFlatten a piece of dough. Place large spoonful of meat filling onto dough and fold over to form a round bun. Lay folded-side-down in a lightly greased 9x13 inch baking dish. Repeat with remaining dough and filling.\nBake in preheated oven for 20 minutes, or until golden brown.\n",
        "picture_link": "TYmMO8TGXf4J9JL2ZCxNx8zDy3plJqq"
    },
    {
        "title": "Kalbi (Korean BBQ Short Ribs)",
        "ingredients": [
            "3/4 cup soy sauce ADVERTISEMENT",
            "3/4 cup brown sugar ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "1 garlic clove, minced ADVERTISEMENT",
            "2 green onions, chopped ADVERTISEMENT",
            "1 tablespoon Asian (toasted) sesame oil ADVERTISEMENT",
            "2 pounds Korean-style short ribs (beef chuck flanken, cut 1/3 to 1/2 inch thick across bones) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a bowl, stir together the soy sauce, brown sugar, water, garlic, green onions, and sesame oil until the sugar has dissolved.\nPlace the ribs in a large plastic zipper bag. Pour the marinade over the ribs, squeeze out all the air, and refrigerate the bag for 3 hours to overnight.\nPreheat an outdoor grill for medium-high heat, and lightly oil the grate. Remove the ribs from the bag, shake off the excess marinade, and discard the marinade. Grill the ribs on the preheated grill until the meat is still pink but not bloody nearest the bone, 5 to 7 minutes per side.\n",
        "picture_link": "aOHYDPB9BVG5lsyQyEYAzN1XboE5FSS"
    },
    {
        "title": "Pan Seared Salmon I",
        "ingredients": [
            "4 (6 ounce) fillets salmon ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 tablespoons capers ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "4 slices lemon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat a large heavy skillet over medium heat for 3 minutes.\nCoat salmon with olive oil. Place in skillet, and increase heat to high. Cook for 3 minutes. Sprinkle with capers, and salt and pepper. Turn salmon over, and cook for 5 minutes, or until browned. Salmon is done when it flakes easily with a fork.\nTransfer salmon to individual plates, and garnish with lemon slices.\n",
        "picture_link": "6kqltd7yjBqXRHT4VgM4niWFAeFUylK"
    },
    {
        "title": "Italian Summer Squash Polenta Bake",
        "ingredients": [
            "3 carrots, sliced ADVERTISEMENT",
            "1 large zucchini, sliced ADVERTISEMENT",
            "1 large yellow squash, sliced ADVERTISEMENT",
            "1 red onion, chopped ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "1 cup spaghetti sauce ADVERTISEMENT",
            "4 tablespoons olive oil ADVERTISEMENT",
            "1 pinch garlic salt ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 1/2 cups shredded mozzarella cheese ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1 (18 ounce) package prepared polenta ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSaute carrots, zucchini, squash, onion and bell pepper in a large saucepan with a small amount of olive oil. Season with garlic salt and pepper. Saute vegetables for approximately 5 minutes and pour in spaghetti sauce. Stir, cover and simmer until vegetables are slightly tender.\nSlice polenta into 1/2 inch circles and season with garlic salt and pepper. Heat enough oil in a medium skillet so as to completely cover the entire bottom of the pan. Pan fry seasoned polenta in hot oil, about 3 minutes per side. Remove from oil and layer the slices in a large casserole dish. Spoon the vegetable mixture over the polenta and then sprinkle with Mozzarella and Parmesan cheese.\nBake casserole for 30 minutes. Remove from oven and let cool for 5 minutes before serving.\n",
        "picture_link": "wG.r7DOpCFbAV63wpPrYlrxUAfVQt3G"
    },
    {
        "title": "Herb, Garlic and Bacon Pork Loin",
        "ingredients": [
            "1 (5 pound) pork loin roast ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 pound sliced bacon ADVERTISEMENT",
            "3 cups chicken stock ADVERTISEMENT",
            "1 tablespoon dried rosemary ADVERTISEMENT",
            "1 tablespoon dried thyme ADVERTISEMENT",
            "6 fresh basil leaves ADVERTISEMENT",
            "6 fresh sage leaves ADVERTISEMENT",
            "4 cloves garlic, chopped ADVERTISEMENT",
            "8 fresh pearl onions, peeled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 300 degrees F (150 degrees C).\nRub the pork loin with olive oil and place in a roasting pan. Drape slices of bacon over the top. Combine the chicken stock, rosemary, thyme, basil, sage and garlic. Pour over the roast. Place onions around the sides. Cover with a lid or aluminum foil.\nBake for 1 hour and 30 minutes. Remove the lid or foil, and continue to bake for 30 minutes, or until the bacon is browned. Cook to at least 145 degrees F (63 degrees C).\n",
        "picture_link": "ngag.ed6R3T/IhxkQWtKhUM.2CMQBAW"
    },
    {
        "title": "Wilderness Place Lodge Cookies",
        "ingredients": [
            "2 cups butter ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 cups packed brown sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "6 cups quick cooking oats ADVERTISEMENT",
            "2 cups chocolate chips ADVERTISEMENT",
            "2 cups chopped and toasted walnuts ADVERTISEMENT",
            "1 cup coconut ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Grease cookie sheets.\nIn a very large bowl, cream together the butter, brown sugar and white sugar until smooth. Beat in the eggs one at a time, then stir in the vanilla. Combine the flour, salt and baking soda; stir into the sugar mixture until well incorporated. Mix in oats, then stir in the chocolate chips, nuts, coconut and raisins. Drop by heaping teaspoonfuls onto the prepared cookie sheets.\nBake for 10 to 12 minutes in the preheated oven, or until golden brown. Let cookies cool for a few minutes on the cookie sheets before removing to wire racks to cool completely.\n",
        "picture_link": "9.zTH66ridY44/J4gsZPm6C/Jzvx796"
    },
    {
        "title": "Mike's Homemade Pizza",
        "ingredients": [
            "DOUGH: ADVERTISEMENT",
            "1 (.25 ounce) envelope active dry yeast ADVERTISEMENT",
            "1 cup lukewarm water ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 tablespoons shortening ADVERTISEMENT",
            "SAUCE: ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "6 fluid ounces water ADVERTISEMENT",
            "1/2 teaspoon white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon dried basil ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/4 teaspoon dried marjoram ADVERTISEMENT",
            "1/4 teaspoon ground cumin ADVERTISEMENT",
            "1/4 teaspoon chili powder ADVERTISEMENT",
            "1/8 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes.\nIn a large bowl, combine flour, salt and shortening. Stir in the yeast mixture. When the dough has pulled together, turn it out onto a lightly floured surface, and knead until smooth and elastic, about 8 minutes. Lightly oil a large bowl, place the dough in the bowl, and turn to coat with oil. Cover with a damp cloth, and let rise in a warm place until doubled in volume, about 45 minutes.\nHeat oil in a small saucepan over medium heat. Saute onion until tender. Stir in tomato paste and water. Season with sugar, salt, black pepper, garlic powder, basil, oregano, marjoram, cumin, chili powder and red pepper flakes. Simmer 15 to 20 minutes.\nRecipe makes 2 (12 inch) pizzas. Divide dough in half, and spread onto pizza pans. Cover with sauce, and desired toppings. Bake at 400 degrees for 20 minutes, or until crust is golden brown.\n",
        "picture_link": "Qtzoy42Uo6flYCQxZIf1bEirEZilwoK"
    },
    {
        "title": "Tofu Tacos I",
        "ingredients": [
            "1 (16 ounce) package garden herb tofu, crumbled ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "2 teaspoons chili powder ADVERTISEMENT",
            "1/4 teaspoon paprika ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1/4 teaspoon ground cumin ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 lime, juiced ADVERTISEMENT",
            "1/2 cup tomato sauce ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "10 medium taco shells, heated ADVERTISEMENT",
            "2 cups shredded lettuce ADVERTISEMENT",
            "2 tomatoes, chopped ADVERTISEMENT",
            "1 avocado - peeled, pitted and diced ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/4 cup salsa ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Over a medium heat fry the tofu, oil, garlic and onion in a large skillet for 5 minutes. Add the chili powder, paprika, cayenne, cumin, salt, lime juice and tomato sauce to the skillet and stir. Cook for 3 minutes. Stir in the cilantro. Spoon mixture in a serving bowl.\nSpoon the tofu mixture into taco shells. Top the mixture with lettuce, tomatoes, avocado, Cheddar cheese and salsa.\n",
        "picture_link": "HPaFuB74knVkWelOC5U59lau2hFppnm"
    },
    {
        "title": "Argentine Lentil Stew",
        "ingredients": [
            "1 cup dry lentils ADVERTISEMENT",
            "1 quart water ADVERTISEMENT",
            "1 cube vegetable bouillon ADVERTISEMENT",
            "3 medium tomatoes, peeled and diced ADVERTISEMENT",
            "1 large onion, diced ADVERTISEMENT",
            "1 carrot, sliced ADVERTISEMENT",
            "1 medium apple - peeled, cored and diced ADVERTISEMENT",
            "1/2 cup frozen peas ADVERTISEMENT",
            "1 large clove garlic ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/4 cup barbeque sauce ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the lentils and water in a large pot, and mix in the vegetable bouillon. Bring to a boil, reduce heat to low, and simmer 20 minutes.\nStir the tomatoes, onion, carrot, apple, peas, garlic, olive oil, barbeque sauce, and paprika into the pot. Continue to simmer 20 minutes. Season with salt and pepper to serve.\n",
        "picture_link": "0tPmvjMwrpAT85ixfVdMcP9eumTkc3C"
    },
    {
        "title": "Vanilla and Chocolate Delight",
        "ingredients": [
            "1 cup finely chopped pecans ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "1 (16 ounce) container frozen whipped topping, thawed, divided ADVERTISEMENT",
            "3 cups milk ADVERTISEMENT",
            "1 (3.9 ounce) package instant chocolate pudding mix ADVERTISEMENT",
            "1 (3.4 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "2 (1.45 ounce) bars milk chocolate with crispy rice, crumbled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). In a medium mixing bowl, combine pecans, flour, and butter. Press into a 9x13 inch pan. Bake for 25 minutes. Allow to cool.\nIn a large bowl, beat together cream cheese and confectioners' sugar until smooth. Fold in half of the whipped topping. Spread on top of cooled crust.\nIn a large bowl, combine milk, chocolate pudding mix, and vanilla pudding mix. Beat until thick. Pour over cream cheese layer. Top with remaining whipped topping, and sprinkle with crushed chocolate bars.\n",
        "picture_link": "wtNbbhA2.hVAH.44eZ3tbu0aSH5cmWS"
    },
    {
        "title": "Amish Cookies",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "4 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "3/4 teaspoon cream of tartar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Grease cookie sheets.\nIn a large bowl, mix together the butter, oil, white sugar, and confectioners' sugar until smooth. Beat in the eggs one at a time, then stir in the vanilla. Combine the flour, baking soda, and cream of tartar. Stir into the sugar mixture until just combined. Drop dough by teaspoonfuls onto the prepared cookie sheets.\nBake for 8 to 10 minutes in preheated oven, or until bottoms are lightly browned. Remove from baking sheets to cool on wire racks.\n",
        "picture_link": "boTm41lOD2e6A14DzVx5XAY6fKfW/kS"
    },
    {
        "title": "Shrimp Chowder",
        "ingredients": [
            "1/2 cup sliced celery ADVERTISEMENT",
            "1/3 cup finely diced onion ADVERTISEMENT",
            "2 tablespoons margarine ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, diced ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 1/2 cups cubed potatoes ADVERTISEMENT",
            "1/2 pound frozen cooked shrimp, thawed and drained ADVERTISEMENT",
            "2 tablespoons dry white wine ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large stock pot saute celery and onions in margarine.\nAdd cream cheese and milk; and stir over low heat until cream cheese is completely melted.\nAdd potatoes, shrimp, dry white wine and salt. Heat thorough, stirring occasionally and then serve.\n",
        "picture_link": "diAVL7m0sNiFpx1wF5nmJsnrnLPD2b."
    },
    {
        "title": "Phoenician's Key Lime Pie",
        "ingredients": [
            "2/3 cup toasted slivered almonds ADVERTISEMENT",
            "1 cup graham cracker crumbs ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "4 egg yolks ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1/2 cup key lime juice ADVERTISEMENT",
            "3/4 cup cold heavy cream ADVERTISEMENT",
            "1/2 teaspoon grated lime zest ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C).\nPulse the almonds in a food processor until finely ground. Combine the almonds with the graham cracker crumbs, sugar, and salt. Pour in the melted butter and mix until evenly moistened. Press into a 9-inch pie plate.\nBake the crust in the preheated oven until golden brown, 10 to 13 minutes.\nWhile the crust is baking, beat the egg yolks in a bowl with the condensed milk, cream, and lime zest. Whisk in the lime juice a little at a time to thicken the custard. Pour the custard into the pie crust and return to the oven.\nBake in the oven for 15 minutes to help the custard begin to set. Cool to room temperature on a wire rack before covering loosely with plastic wrap and refrigerating overnight.\n",
        "picture_link": "pjIRp84CxxEvswYdii0uBpTN4tE.QAK"
    },
    {
        "title": "Bacon Wrapped Pesto Chicken",
        "ingredients": [
            "6 skinless, boneless chicken breast halves - pounded flat ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "6 tablespoons prepared basil pesto ADVERTISEMENT",
            "6 slices bacon ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nLay a chicken breast out flat, and sprinkle with salt and black pepper. Spread pesto sauce over the chicken breast, and roll the chicken breast in a slice of bacon, securing the roll with toothpicks. Lay the rolled chicken breast into a 9x9-inch baking dish. Repeat with remaining chicken breasts. Pour the vegetable oil over the chicken breasts.\nBake in the preheated oven until the chicken is no longer pink inside and the bacon is crisp, about 30 minutes. An instant-read thermometer inserted into the center of a roll should read at least 160 degrees F (70 degrees C).\n",
        "picture_link": "12gR7YtaEAzofmvh3u0BP5PNzX12VP."
    },
    {
        "title": "French Toast Corners",
        "ingredients": [
            "6 slices white bread ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2/3 cup milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut each slice of bread twice diagonally to make each slice into 4 triangles.\nBeat together eggs, milk, vanilla and cinnamon. Dip the bread slices into egg mixture.\nHeat butter over medium-high heat in a frying pan or skillet. Cook bread until golden brown. Serve warm with your favorite topping.\n",
        "picture_link": ".q7SWxYhTGK3Ew0u/s3r/W1I63lyuPO"
    },
    {
        "title": "Pasta Carbonara I",
        "ingredients": [
            "1/2 pound bacon, cut into small pieces ADVERTISEMENT",
            "4 eggs, room temperature ADVERTISEMENT",
            "1/4 cup heavy cream at room temperature ADVERTISEMENT",
            "1 cup grated Parmesan cheese ADVERTISEMENT",
            "16 ounces dry fettuccine pasta ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "1/4 cup chopped parsley ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook bacon until crisp. Drain on paper towels.\nIn medium bowl beat together eggs and cream just until blended. Stir in cheese and set aside.\nCook pasta according to package directions. Drain and return to pan. Toss with butter until it is melted. Add bacon and cheese mixture and toss gently until mixed.\n",
        "picture_link": ".xjeOUiEx/nskpsRZx2Br4okTbgjBPG"
    },
    {
        "title": "Old-Fashioned Scalloped Corn",
        "ingredients": [
            "3 (15 ounce) cans creamed corn ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup crushed saltine crackers ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Butter one 8x11x2 inch casserole dish.\nIn a medium sized mixing bowl, combine the creamed corn, eggs, 1/4 cup of the melted butter and 1/2 of the cracker crumbs. Pour mixture in into the prepared dish.\nIn a small bowl, mix the remaining melted butter, cracker crumbs, paprika and pepper. Sprinkle crumb topping over the casserole.\nBake at 350 degrees F (175 degrees C) for 30 to 40 minutes, until topping browns slightly and corn is bubbly around the edges.\n",
        "picture_link": "HlLHViT5j8QLxOrdDnN3Qocwk9cgDBC"
    },
    {
        "title": "Tuna Melts",
        "ingredients": [
            "1 (1 pound) loaf French bread ADVERTISEMENT",
            "1 small sweet onion, peeled and diced ADVERTISEMENT",
            "1 (12 ounce) can tuna, drained ADVERTISEMENT",
            "2 cups mozzarella cheese, shredded ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a mixing bowl, combine sweet onion, drained tuna, mozzarella, and mayonnaise. Mix thoroughly.\nSpread tuna mixture on slices of French bread to form a sandwich. Place sandwiches on a cookie sheet.\nBake in a preheated oven for 10 minutes.\n",
        "picture_link": "r6noxB7YtcsbIlItoAIdiyC3LHC54ZK"
    },
    {
        "title": "Stir Fried Sesame Vegetables with Rice",
        "ingredients": [
            "1 1/2 cups vegetable broth ADVERTISEMENT",
            "3/4 cup uncooked long-grain white rice ADVERTISEMENT",
            "1 tablespoon margarine ADVERTISEMENT",
            "1 tablespoon sesame seeds ADVERTISEMENT",
            "2 tablespoons peanut oil ADVERTISEMENT",
            "1/2 pound fresh asparagus, trimmed and cut into 1 inch pieces ADVERTISEMENT",
            "1 large red bell pepper, cut into 1 inch pieces ADVERTISEMENT",
            "1 large yellow onion, sliced ADVERTISEMENT",
            "2 cups sliced mushrooms ADVERTISEMENT",
            "2 teaspoons minced fresh ginger root ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "3 tablespoons soy sauce ADVERTISEMENT",
            "1 tablespoon sesame oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). In a saucepan combine broth, rice and margarine. Cover and bring to a boil over high heat. Reduce heat to low and simmer for 15 minutes, or until all liquid is absorbed.\nPlace sesame seeds on a small baking sheet and bake in preheated oven for 5 to 6 minutes, or until golden brown; set aside. Meanwhile, heat peanut oil in a large skillet or wok over medium-high heat until very hot. Add asparagus, bell pepper, onion, mushrooms, ginger and garlic and stir-fry for 4 to 5 minutes, or until vegetables are tender but crisp. Stir in soy-sauce and cook for 30 seconds. Remove from heat and stir in sesame oil and toasted sesame seeds. Serve over rice.\n",
        "picture_link": "1SlT6AekjCpWCw.yNVTw7Tjv0E05cpK"
    },
    {
        "title": "One Dish Chicken and Rice Bake",
        "ingredients": [
            "1 (10.75 ounce) can Campbell's® Condensed Cream of Mushroom Soup (Regular, 98% Fat Free or 25% Less Sodium) ADVERTISEMENT",
            "1 cup water* ADVERTISEMENT",
            "3/4 cup uncooked regular long-grain white rice ADVERTISEMENT",
            "1/4 teaspoon paprika ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "4 skinless, boneless chicken breasts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix soup, water, rice, paprika and black pepper in 2-quart shallow baking dish. Top with chicken. Season with additional paprika and pepper. Cover.\nBake at 375 degrees F 45 minutes or until done.\n",
        "picture_link": "zCj1xRZ75ijX94ydDxP7dVTZGuGYlWq"
    },
    {
        "title": "Creole Chicken I",
        "ingredients": [
            "8 chicken thighs ADVERTISEMENT",
            "1/4 pound cooked ham, cut into one inch cubes ADVERTISEMENT",
            "1 (16 ounce) can diced tomatoes ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "6 green onions, chopped ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 dashes hot pepper sauce ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 cup uncooked long grain white rice ADVERTISEMENT",
            "1/2 pound Polish sausage, sliced diagonally ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a slow cooker, place the chicken, ham, tomatoes, bell pepper, green onions, tomato paste, salt, and hot pepper sauce. Cover, and cook on Low for 4 to 5 hours.\nCombine water and rice in a medium saucepan. Bring to a boil. Reduce heat, cover, and simmer for 20 minutes.\nMix the cooked rice and sausage into the slow cooker. Cover, and cook on High for 15 to 20 minutes, or until the sausage is heated through.\n",
        "picture_link": "MeDnmGvRIO0vgpfSrTfAR1.OEsIK2x6"
    },
    {
        "title": "Slow Cooker Sauerkraut and Sausage",
        "ingredients": [
            "1 (20 ounce) can sauerkraut ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1 1/2 pounds ground pork sausage ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, combine the sauerkraut and brown sugar. then place in slow cooker. Arrange the sausage and onion over the sauerkraut.\nCook on high for two hours, check for dryness, adding some water if necessary, then reduce to low setting, and cook on low for two more hours.\n",
        "picture_link": "A2Tez07k9OXAWO1UjrQLlzpbeuLxfFa"
    },
    {
        "title": "Easy Garlic-Lemon Scallops",
        "ingredients": [
            "3/4 cup butter ADVERTISEMENT",
            "3 tablespoons minced garlic ADVERTISEMENT",
            "2 pounds large sea scallops ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon pepper ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large skillet over medium-high heat. Stir in garlic, and cook for a few seconds until fragrant. Add scallops, and cook for several minutes on one side, then turn over, and continue cooking until firm and opaque.\nRemove scallops to a platter, then whisk salt, pepper, and lemon juice into butter. Pour sauce over scallops to serve.\n",
        "picture_link": ".oTmxxpYkHr.oFKkC.7mugvrExt09cG"
    },
    {
        "title": "The Original Fantasy Fudge",
        "ingredients": [
            "3 cups white sugar ADVERTISEMENT",
            "3/4 cup margarine ADVERTISEMENT",
            "2/3 cup evaporated milk ADVERTISEMENT",
            "1 (12 ounce) package semisweet chocolate chips ADVERTISEMENT",
            "1 (7 ounce) jar marshmallow creme ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grease a 9x13-inch pan.\nMix sugar, margarine, and evaporated milk in a large, heavy saucepan over medium heat, stirring to dissolve sugar. Bring mixture to a full boil for 5 minutes, stirring constantly.\nRemove from heat and stir in chocolate chips until melted and thoroughly combined. Beat in marshmallow creme, walnuts, and vanilla extract. Transfer fudge to the prepared pan and let cool before cutting into squares.\n",
        "picture_link": "pE4uR/mwMJv7LYVkta7SEDmjMr97JxS"
    },
    {
        "title": "Japanese Ginger Salad Dressing",
        "ingredients": [
            "1 cup olive oil ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "3 tablespoons minced fresh ginger root ADVERTISEMENT",
            "1 teaspoon prepared Dijon-style mustard ADVERTISEMENT",
            "2 teaspoons honey ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, whisk together the soy sauce, lemon juice, garlic, ginger, mustard, honey and pepper. Once these are thoroughly combined, add the oil in a steady stream, whisking constantly. When all of the oil is incorporated into the dressing, pour into a glass jar and chill until serving.\n",
        "picture_link": "od78MLOTV0SsAvdasbxTk/Vy1l2su2i"
    },
    {
        "title": "Lemony Steamed Fish",
        "ingredients": [
            "6 (6 ounce) halibut fillets ADVERTISEMENT",
            "1 tablespoon dried dill weed ADVERTISEMENT",
            "1 tablespoon onion powder ADVERTISEMENT",
            "2 teaspoons dried parsley ADVERTISEMENT",
            "1/4 teaspoon paprika ADVERTISEMENT",
            "1 pinch seasoned salt, or more to taste ADVERTISEMENT",
            "1 pinch lemon pepper ADVERTISEMENT",
            "1 pinch garlic powder ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nCut 6 foil squares large enough for each fillet.\nCenter fillets on the foil squares and sprinkle each with dill weed, onion powder, parsley, paprika, seasoned salt, lemon pepper, and garlic powder. Sprinkle lemon juice over each fillet. Fold foil over fillets to make a pocket and fold the edges to seal. Place sealed packets on a baking sheet.\nBake in the preheated oven until fish flakes easily with a fork, about 30 minutes.\n",
        "picture_link": "BXK.x1wRAe.XGv6otN0rWaFQsGHo0pu"
    },
    {
        "title": "Chewy Coconut Bars",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2/3 cup shortening ADVERTISEMENT",
            "2 cups packed brown sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 1/2 cups semisweet chocolate chips ADVERTISEMENT",
            "3/4 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup shredded coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking pan.\nIn large bowl, cream the shortening, brown sugar, eggs and vanilla extract. Slowly blend in flour, baking powder, and salt. Mix until well blended. Fold in chocolate chips, walnuts and coconut. Spread the mixture evenly in pan.\nBake 20 to 25 minutes. Let cool before cutting into bars.\n",
        "picture_link": "vs.dJNjDlYgAcRETFkFj5ER4hNpuXPu"
    },
    {
        "title": "Strawberry Whipped Sensation",
        "ingredients": [
            "4 cups fresh strawberries, divided ADVERTISEMENT",
            "1 (14 ounce) can Eagle Brand® Sweetened Condensed Milk ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "1 (8 ounce) tub COOL WHIP Whipped Topping, thawed, divided ADVERTISEMENT",
            "8 OREO Chocolate Sandwich Cookies, finely chopped ADVERTISEMENT",
            "1 tablespoon butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line 9x5-inch loaf pan with foil, with ends of foil extending over sides of pan. Mash 2 cups of the strawberries in large bowl. Add condensed milk, juice and 2 cups of the whipped topping; mix well. Pour into prepared pan.\nMix chopped cookies and butter. Spoon over whipped topping mixture. Cover with ends of foil and gently press cookie mixture into whipped topping mixture. Freeze 6 hours or until firm.\nInvert dessert onto serving plate when ready to serve; remove pan and foil. Spread remaining whipped topping onto top and sides of dessert. Slice remaining 2 cups strawberries; arrange over dessert. Store leftovers in freezer.\n",
        "picture_link": "60HhmvnkV.F7/0H5GeEZE8rt4LfSfgi"
    },
    {
        "title": "Low-Carb Zucchini Pasta",
        "ingredients": [
            "2 zucchinis, peeled ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut lengthwise slices from zucchini using a vegetable peeler, stopping when the seeds are reached. Turn zucchini over and continue 'peeling' until all the zucchini is in long strips; discard seeds. Slice the zucchini into thinner strips resembling spaghetti.\nHeat olive oil in a skillet over medium heat; cook and stir zucchini in the hot oil for 1 minute. Add water and cook until zucchini is softened, 5 to 7 minutes. Season with salt and pepper.\n",
        "picture_link": "/VE.Zx..CNI1TRhewm3e6THCAztsPfi"
    }
]