[
    {
        "title": "Cinnamon Popcorn I",
        "ingredients": [
            "1/2 cup white corn syrup ADVERTISEMENT",
            "1 cup margarine ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 drop red food coloring ADVERTISEMENT",
            "1 teaspoon cinnamon oil ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "8 quarts popped popcorn ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 200 degrees F (93 degrees C).\nIn a medium saucepan over medium heat, combine corn syrup, margarine and salt. Heat to 242 to 248 degrees F (116 to 120 degrees C), or until a small amount of syrup dropped into cold water forms a firm but pliable ball. Remove from heat and stir in food coloring, cinnamon oil and baking soda. Pour over popcorn; toss to coat.\nPlace popcorn on baking sheet and into preheated oven. Bake 1 hour, stirring every 15 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Moody's Green Beans",
        "ingredients": [
            "1 pound pork sausage ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "2 (14.5 ounce) cans green beans, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium skillet, crumble sausage and fry over medium-high heat until browned. Drain grease. Preheat oven to 350 degrees F (175 degrees C).\nIn an 8x8 inch casserole dish, mix together sausage, mushroom soup, and green beans. Mix in 1 cup sour cream if desired. Cover dish with foil and bake for 30 minutes. If you like, sprinkle 1 cup shredded cheese over top and return to oven, uncovered, for 5 minutes or until cheese melts.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Planet Mars Almond Bars",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "1/4 cup light corn syrup ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "2/3 cup almonds ADVERTISEMENT",
            "35 caramels ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "24 ounces milk chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan, combine sugar, corn syrup and 1/2 cup water. Bring to a boil and add salt. Heat to 270 to 290 degrees F (132 to 143 degrees C), or until a small amount of syrup dropped into cold water forms hard but pliable threads.\nWhile the syrup is cooking, beat the egg whites in the metal bowl of an electric mixer until stiff peaks form. When the syrup is ready, set the mixer to low speed, remove the syrup from the heat, and pour it into the egg whites in a thin stream, blending continuously. Continue to mix until the nougat begins to thicken to the consistency of a soft dough, about 20 minutes. Lightly grease a 9x9 inch baking dish. Mix in almonds and press nougat into prepared dish and chill in refrigerator until firm, about 30 minutes.\nIn a small saucepan over low heat, melt the caramels with 2 tablespoons water. Pour melted caramel over nougat. Chill in refrigerator 30 minutes.\nCut the chilled candy into 14 oblong bars with a sharp knife. In a microwave-safe bowl, microwave chocolate until melted. Stir occasionally until chocolate is smooth. Dip bars into melted chocolate, let cool 2 hours on wire rack or waxed paper.\n",
        "picture_link": "kdFL2tONpRs.u6wdICUS0YjRnzXHDv2"
    },
    {
        "title": "Blackberry-Lemon Pie",
        "ingredients": [
            "1 recipe pastry for a 9 inch double crust pie ADVERTISEMENT",
            "3/4 cup brown sugar ADVERTISEMENT",
            "1 tablespoon lemon zest ADVERTISEMENT",
            "4 cups fresh blackberries, rinsed and drained ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 tablespoon lemon zest ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace bottom crust into a 9 inch pie pan. In a medium bowl, crumble remaining pie crust into a bowl with the brown sugar and 1 tablespoon lemon zest. Mix with hands until dough becomes pea-size crumbs. Set aside.\nIn a large bowl, combine blackberries, white sugar, flour and 1 tablespoon lemon zest. Fill bottom pie crust with blackberry mixture. Sprinkle crumb topping over mixture and dot with butter.\nBake pie in preheated oven for 45 minutes to 1 hour, or until crust is browned and berries are bubbling. Let stand before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Adele's Summer Special",
        "ingredients": [
            "5 tomatoes ADVERTISEMENT",
            "4 green bell peppers ADVERTISEMENT",
            "1 large red onion ADVERTISEMENT",
            "1 (8 ounce) bottle zesty Italian dressing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Slice tomatoes and peppers and set aside. Slice the red onion and separate the rings. Using a large bowl with a lid, layer the tomatoes, green pepper and onion until all vegetables are used. Shake the bottled dressing and pour over the vegetable layers. Refrigerate for 2-3 hours or, for best results, overnight. Before serving, turn bowl upside down to make sure all vegetables are coated with the dressing.\n",
        "picture_link": ".UciVJTuKwFaUHPIAlD/GdauWqZY7g."
    },
    {
        "title": "Raisin Soy Bread",
        "ingredients": [
            "1 1/4 cups soy milk ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "2 tablespoons butter, softened ADVERTISEMENT",
            "2 cups bread flour ADVERTISEMENT",
            "1 cup whole wheat flour ADVERTISEMENT",
            "1 cup soy flour ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "2 1/4 teaspoons active dry yeast ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ingredients in the pan of the bread machine in the order recommended by the manufacturer. Select basic bread setting, light/medium crust setting; press Start. If your machine has a Fruit setting, add the raisins and at the signal, or about 5 minutes before the kneading cycle has finished.\n",
        "picture_link": "eJkxWg9o4ZgNwCkQig8vl8aHWa7Bu1i"
    },
    {
        "title": "Edible Face",
        "ingredients": [
            "1 ounce Cheddar cheese ADVERTISEMENT",
            "8 thin wheat crackers ADVERTISEMENT",
            "2 cherry tomatoes, halved ADVERTISEMENT",
            "1/4 cup shredded carrot ADVERTISEMENT",
            "1 orange, peeled and segmented ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut cheese into shapes: squares, triangles, and circles. Place cheese shapes and cherry tomato halves on crackers. Use these, as well as shredded carrot and orange segments to make a face complete with eyes, nose, ears, mouth, and hair--use your imagination! The kids will love it.\n",
        "picture_link": "MtJbFwEIWrGZCWoazeWxy2Q7EaSD.22"
    },
    {
        "title": "Mint  Wafer Cookies",
        "ingredients": [
            "3/4 cup butter ADVERTISEMENT",
            "1 1/2 cups packed light brown sugar ADVERTISEMENT",
            "2 teaspoons water ADVERTISEMENT",
            "1 3/4 cups mint chocolate chips ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 1/4 teaspoons baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "20 chocolate covered thin mints ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small saucepan, combine the butter, brown sugar, water and mint chocolate chips. Cook over low heat, stirring occasionally until melted. Transfer to a medium bowl and set aside to cool for about 10 minutes.\nBeat the eggs into the chocolate mixture one at a time. Combine the flour, baking soda and salt, stir into the chocolate mixture. Cover dough, and chill for 1 hour.\nPreheat oven to 350 degrees F (175 degrees C). Roll dough into 1 inch balls and place 1 1/2 inches apart onto an unprepared cookie sheet.\nBake for 12 to 13 minutes in the preheated oven. As soon as the cookies are out of the oven, place 1/2 of a mint candy on top of each one. Let sit for 30 seconds, then swirl with a toothpick. Cool on wire racks.\n",
        "picture_link": "GTU6Wk7LiIRTrSBCSFNMB.wHe.Ca2ky"
    },
    {
        "title": "Lemon Sponge Pie II",
        "ingredients": [
            "1 (9 inch) pie shell ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 1/2 tablespoons fresh lemon juice ADVERTISEMENT",
            "1 tablespoon grated lemon zest ADVERTISEMENT",
            "1 tablespoon butter, melted ADVERTISEMENT",
            "2 egg yolks, beaten ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl combine sugar, lemon rind, and lemon juice. Mix well, then stir in melted butter or margarine and egg yolks. Mix in flour. Slowly pour in milk while stirring. Mix until all ingredients are thoroughly combined.\nIn a medium glass or metal bowl, beat egg whites until soft peaks form. Fold into milk mixture. Pour mixture into pastry shell.\nBake in preheated oven for 25 to 30 minutes, until golden brown on top.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Quick Macaroni and Cheese",
        "ingredients": [
            "1 cup elbow macaroni ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 (20 ounce) package frozen macaroni and cheese ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "1 1/2 cups shredded Cheddar cheese ADVERTISEMENT",
            "3 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven broiler. Grease a 1 1/2 quart microwave safe dish.\nBring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nMicrowave frozen mac and cheese according to package directions.\nStir together macaroni, mac and cheese, milk and pepper in prepared dish. Mix well. Microwave on high 2 minutes, until heated through. Sprinkle with Cheddar and Parmesan and place under oven broiler. Broil until cheese is melted and beginning to brown, 2 to 5 minutes.\n",
        "picture_link": "KprvPKyBAouyO8WsHCan3hi9RUxhKoa"
    },
    {
        "title": "Simmering Marinara with Brie",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "6 cloves garlic, minced ADVERTISEMENT",
            "2 pounds roma (plum) tomatoes, chopped ADVERTISEMENT",
            "1/2 cup chopped fresh basil ADVERTISEMENT",
            "8 ounces Brie cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet over medium heat, heat olive oil. Saute garlic, but do not allow to brown. Stir in tomatoes and half the basil. Reduce heat and simmer 45 minutes.\nStir in remaining basil. Remove the rind from the Brie and place in the pan. Allow the cheese to melt without stirring, then stir to combine and remove from heat. Serve sauce immediately.\n",
        "picture_link": "LYvq99DJ4l0ocFeg4QrlX4cdsuBPr.S"
    },
    {
        "title": "Gooseberry Pie II",
        "ingredients": [
            "1 recipe pastry for a 9 inch double crust pie ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup fresh gooseberries ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl, combine sugar, flour and salt. Stir in gooseberries and sour cream. Stir well.\nPour mixture into pie shell and then cover with second pie shell. Cut slits in top crust to allow for ventilation. Bake in preheated oven for 45 to 50 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Peach and Poppy Seed Bread",
        "ingredients": [
            "1/2 cup applesauce ADVERTISEMENT",
            "3/4 cup turbinado sugar ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "3 large peaches, peeled and chopped ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 teaspoon almond extract ADVERTISEMENT",
            "2 tablespoons poppy seeds ADVERTISEMENT",
            "2 cups whole wheat flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Prepare 2 9x5-inch bread pans with cooking spray.\nStir the applesauce, sugar, honey and eggs together in a bowl; fold the chopped peaches into the applesauce mixture. Add the baking soda, vanilla extract, almond extract, poppy seeds, and flour; stir to combine into a batter. Pour about half of the batter into each of the prepared pans.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 30 to 35 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "/cjgvVVgQclDdx/NiZDeorxK1JoZSjm"
    },
    {
        "title": "Apricot Salsa",
        "ingredients": [
            "3 cups chopped fresh apricot ADVERTISEMENT",
            "1 cup shallots, julienned ADVERTISEMENT",
            "1/2 cup chopped green bell pepper ADVERTISEMENT",
            "1/2 cup chopped red bell pepper ADVERTISEMENT",
            "1/2 cup chopped fresh pineapple ADVERTISEMENT",
            "1/4 cup chopped cherry tomatoes ADVERTISEMENT",
            "1 habanero pepper, seeded and minced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon minced fresh cilantro ADVERTISEMENT",
            "1/2 teaspoon cumin ADVERTISEMENT",
            "1/4 cup fresh lime juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the apricots, shallots, green bell pepper, red bell pepper, pineapple, cherry tomatoes, habanero pepper, garlic, cilantro, cumin, and lime juice together in a bowl; refrigerate at least 2 hours before serving.\n",
        "picture_link": "sNoIkVoiFAKESxRugGsLvi0bF/VXRh2"
    },
    {
        "title": "Chorizo Stuffed Chicken Breasts with Raspberry Mole",
        "ingredients": [
            "5 cloves garlic ADVERTISEMENT",
            "1 bunch cilantro ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 medium onion, chopped, divided ADVERTISEMENT",
            "1 roma (plum) tomato, chopped ADVERTISEMENT",
            "5 tablespoons olive oil, divided ADVERTISEMENT",
            "1/4 cup raspberry jam ADVERTISEMENT",
            "1/4 cup chipotle puree ADVERTISEMENT",
            "3 roma (plum) tomatoes, chopped ADVERTISEMENT",
            "1/4 cup orange juice ADVERTISEMENT",
            "1/4 cup lime juice ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 tablespoon mayonnaise ADVERTISEMENT",
            "1 pinch unsweetened cocoa powder ADVERTISEMENT",
            "4 (6 ounce) skinless, boneless chicken breast halves ADVERTISEMENT",
            "4 tablespoons prepared guacamole ADVERTISEMENT",
            "1/2 cup queso quesadilla cheese ADVERTISEMENT",
            "1/4 pound chorizo sausage, casing removed and meat finely diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Make a sofrito by combining the garlic, cilantro, green pepper, onion, 1 tomato, and 1 tablespoon olive oil in a food processor or blender. Puree until smooth. Transfer to a bowl and reserve.\nMake the mole sauce by combining the raspberry jam, chipotle puree, remaining tomatoes, orange juice, lime juice, milk, mayonnaise, and cocoa powder in the food processor or blender. Puree until smooth.\nPlace chicken breasts between 2 layers of plastic wrap; pound to a thickness of 1/2 inch. Divide the guacamole, cheese, and chorizo evenly onto the center of each breast. Roll the chicken around the filling, and secure with toothpicks.\nCombine the sofrito and remaining 4 tablespoons olive oil in a deep skillet over medium-high heat. Cook, stirring, until most of the liquid has evaporated. Add the chicken breasts, and cook until browned, 3 to 5 minutes per side. Pour the mole sauce into the pan, and lower the heat to medium-low. Cover, and cook for 1 hour, turning frequently. Serve the chicken with the thickened sauce spooned on top.\n",
        "picture_link": "T/TUgI94tuzvCMWEAehhSAI1QtexoOa"
    },
    {
        "title": "Best Watermelon Slushie",
        "ingredients": [
            "3 cups ice ADVERTISEMENT",
            "2 cups watermelon chunks ADVERTISEMENT",
            "1/2 cup cantaloupe chunks ADVERTISEMENT",
            "1/4 cup orange juice ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "4 sprigs mint, for garnish (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend the ice, watermelon, cantaloupe, orange juice, and honey together in a blender until no chunks remain and the mixture is a thick slush. Garnish with the mint if desired.\n",
        "picture_link": "04EbZQGMCNyqSqggk/2EznlS4F60mT6"
    },
    {
        "title": "Drozdzowka (Polish Yeast Plum Cake)",
        "ingredients": [
            "1/2 cup whole milk ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "2 (0.6 ounce) cakes cake yeast ADVERTISEMENT",
            "1 1/3 cups margarine ADVERTISEMENT",
            "1/2 cup dry bread crumbs ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 1/8 cups white sugar ADVERTISEMENT",
            "8 cups all-purpose flour ADVERTISEMENT",
            "4 teaspoons vanilla sugar ADVERTISEMENT",
            "1 cup whole milk, or as needed ADVERTISEMENT",
            "6 cups fresh plums, pitted and quartered ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan over very low heat, warm up 1/2 cup of milk to no more than 100 degrees F (38 degrees C); stir in 1 tablespoon of flour and 1 tablespoon of sugar. Remove from heat and transfer to a bowl. Crumble the cake yeast into the milk mixture, and gently stir until the mixture becomes creamy. Cover the pan with a cloth, and set aside in a warm place until the yeast forms a spongy texture, 20 to 30 minutes.\nMelt margarine in a saucepan over low heat; remove from heat and allow to cool to lukewarm.\nPreheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish, and sprinkle with bread crumbs.\nPlace eggs and 1 1/8 cup sugar into a blender, and process until the mixture is yellow and fluffy. In a large mixing bowl, whisk together 8 cups of flour with vanilla sugar. Stir in the egg mixture, activated yeast mixture, and lukewarm margarine; start kneading 1 cup milk, or as needed, into the dough, a little at a time, until the dough stops sticking to your fingers and becomes smooth and even. Knead for at least 15 minutes, working to incorporate as much air as possible into the dough as you knead.\nPress the dough evenly into the prepared baking sheet, and arrange the plums over the top of the dough. Set aside.\nIn a bowl, cut together 1 1/2 cup flour, the butter, and 1/2 cup of sugar with a pastry cutter until the mixture resembles fine crumbs; sprinkle the streusel mixture over the plums. Dust streusel with cinnamon, if desired.\nBake in the preheated oven until a toothpick inserted into the center of the cake comes out clean, 1 hour to 1 hour and 10 minutes.\n",
        "picture_link": "aP/oWYvKEsE5TzFtP5jW3BiYLivYwTO"
    },
    {
        "title": "Blackberry with Red Wine Sorbet",
        "ingredients": [
            "3/4 cup white sugar ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 1/2 pounds fresh blackberries ADVERTISEMENT",
            "1/2 cup semi-dry fruity red wine, such as Sangiovese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the sugar and water together in a small saucepan over medium-low heat; cook and stir until the sugar is dissolved completely, making a simple syrup. Set aside to cool.\nPuree the blackberries in a blender or food processor; strain through a fine-mesh strainer to remove any seeds or pulp. Whisk the strained blackberry juice, the cooled simple syrup, and the red wine together in a bowl; chill in refrigerator until cold.\nFreeze in the freezer canister of an ice cream maker according to the manufacturer's directions\n",
        "picture_link": "HTR8C0bDkv8yjEySwzF/KssjaumgMyi"
    },
    {
        "title": "Polish Meat Balls",
        "ingredients": [
            "2 onions, coarsely chopped ADVERTISEMENT",
            "6 stalks celery, coarsely chopped ADVERTISEMENT",
            "2 1/2 pounds ground veal ADVERTISEMENT",
            "2 1/2 pounds ground pork ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "40 saltine crackers, crushed ADVERTISEMENT",
            "3/4 cup dry bread crumbs ADVERTISEMENT",
            "1/2 (12 fluid ounce) can evaporated milk ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "4 teaspoons salt, or to taste ADVERTISEMENT",
            "1 teaspoon dried marjoram ADVERTISEMENT",
            "1 teaspoon dried onion flakes ADVERTISEMENT",
            "3/4 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Mix the onions and celery together in the bottom of a large roasting pan.\nIn a large bowl, thoroughly mix together the veal and pork with your hands; lightly mix in cream of mushroom soup, cracker crumbs, bread crumbs, evaporated milk, eggs, salt, marjoram, onion flakes, and pepper until well combined. Form the mixture into meat balls, dipping your hands in water between making the balls. Place the meat balls gently into the roasting pan on top of the onions and celery; cover the pan with foil.\nBake in the preheated oven for 1 hour and remove foil. Carefully separate the meat balls where they have stuck together and return the pan to the oven until the meat balls are browned, turning every 15 minutes, 30 to 45 additional minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Campfire Pepperoni Pizza",
        "ingredients": [
            "1 pound refrigerated pizza dough ADVERTISEMENT",
            "1/4 cup pizza sauce ADVERTISEMENT",
            "1/2 cup shredded mozzarella cheese ADVERTISEMENT",
            "1/2 cup sliced pepperoni ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place pizza stone on grill directly over wood fire. You may need to begin by spreading out the wood if the flames are too tall. Roll out the pizza dough to desired thickness. Place it on the pizza stone and cook 10 minutes on one side until golden.\nRemove from the fire and on the cooked side, spread the pizza sauce in an even layer over dough leaving about a half inch around the rim of the pizza dough bare. Sprinkle mozzarella cheese evenly on top of the sauce, followed by the pepperoni slices.\nPlace uncooked side down, back on the pizza stone. Cover with a foil tent and cook until cheese has melted, about 10 minutes more. Transfer pizza to a cutting board and let cool slightly before cutting and serving.\n",
        "picture_link": "RD.uXzkekd2ylP5upxnkHm0T5diZRqC"
    },
    {
        "title": "Green Goddess Dip",
        "ingredients": [
            "3/4 cup sour cream ADVERTISEMENT",
            "3/4 cup mayonnaise ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/4 cup fresh parsley leaves ADVERTISEMENT",
            "2 teaspoons chopped fresh tarragon ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "2 anchovy fillets ADVERTISEMENT",
            "1/4 cup minced fresh chives ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend the sour cream, mayonnaise, garlic, parsley, tarragon, lemon juice, and anchovy fillets in a food processor or blender until smooth and creamy; transfer to a bowl. Gently stir the minced chives into the sour cream mixture; season with salt and pepper. Refrigerate at least 1 hour before serving.\n",
        "picture_link": "D.citbdPGPmVu5ZfORg8HLWecuaGj76"
    },
    {
        "title": "Susan's Key Lime Martini",
        "ingredients": [
            "1 graham cracker, crushed into fine crumbs ADVERTISEMENT",
            "2 lime wedges ADVERTISEMENT",
            "1 1/2 fluid ounces vanilla flavored vodka ADVERTISEMENT",
            "1/2 fluid ounce melon liqueur (such as Midori®) ADVERTISEMENT",
            "2 1/2 fluid ounces pineapple juice ADVERTISEMENT",
            "1 dash almond flavored syrup ADVERTISEMENT",
            "1 cup whipped cream ADVERTISEMENT",
            "1 cup ice cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread the graham cracker crumbs onto a small, shallow plate. Moisten the rims of 2 martini glasses with the lime wedges; reserve the lime wedges. Dip the moistened glasses into the graham cracker crumbs and set aside. Reserve the lime wedges and remaining graham cracker crumbs to use as a garnish.\nPour the vodka, melon liqueur, pineapple juice, almond syrup, and whipped cream into a cocktail shaker over ice. Cover and shake until the outside of the shaker has frosted. Strain into the rimmed glasses. Place a lime wedge on the edge of each glass and sprinkle the cocktails with some of the reserved graham cracker crumbs to garnish.\n",
        "picture_link": "6FRuCltDkn2.GsAOsOaznuulTs1exFe"
    },
    {
        "title": "Chicken Plum Pie",
        "ingredients": [
            "1 sheet frozen puff pastry, thawed ADVERTISEMENT",
            "1 pound cooked chicken meat, shredded ADVERTISEMENT",
            "4 purple plums - pitted, peeled and chopped ADVERTISEMENT",
            "3 tablespoons chicken broth ADVERTISEMENT",
            "1/2 teaspoon ground mace ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1 pinch ground cloves ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "2 purple plums, pitted and sliced ADVERTISEMENT",
            "2 tablespoons melted butter ADVERTISEMENT",
            "1 tablespoon light brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Press the puff pastry sheet into an 8-inch round or square pan.\nBake in the preheated oven until the bottom of the pastry is very lightly browned, about 10 minutes.\nMix together the chicken, 4 chopped plums, chicken broth, mace, cinnamon, and cloves in a bowl, and season to taste with salt and pepper. Spoon the mixture over the partially-baked crust, and arrange slices of 2 plums over the top. Drizzle the pie with melted butter, and sprinkle with brown sugar.\nBake the pie in the oven until the crust is golden brown and the plum slices have caramelized, about 40 minutes.\n",
        "picture_link": "ViOeq3rP5AO9QeTJ6KI2PUZrIflZhsK"
    },
    {
        "title": "Poires Au Vin Rouge (Pears in Red Wine)",
        "ingredients": [
            "3 cups red wine ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 cinnamon sticks ADVERTISEMENT",
            "4 whole cloves ADVERTISEMENT",
            "1 strip orange zest ADVERTISEMENT",
            "1 teaspoon fennel seed (optional) ADVERTISEMENT",
            "3 whole black peppercorns (optional) ADVERTISEMENT",
            "2 bay leaves (optional) ADVERTISEMENT",
            "6 large firm pears ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the red wine, sugar, cinnamon, cloves, orange zest, fennel seed, peppercorns, and bay leaves in a large saucepan. Peel the pears, and remove the cores from the bottom, leaving the stems intact; set aside. Bring the wine to a boil over high heat, stirring until the sugar has dissolved. Add the pears, return to a simmer, then reduce the heat to medium-low, and continue simmering until tender, about 25 minutes.\nRemove the pears from the wine syrup, cover, and refrigerate until cold. Strain the syrup through a mesh sieve, and discard the spices. Simmer the syrup over medium heat until thickened enough to coat the back of a spoon. Refrigerate the syrup until cold.\nOnce the syrup is cold, pour over the pears, cover, and chill at least 2 hours before serving.\n",
        "picture_link": "vbjcnRtVp1.GVbe5hhFZUFsnZ6bipy6"
    },
    {
        "title": "Blueberry Flummery",
        "ingredients": [
            "1 (3.5 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "2 cups cold milk ADVERTISEMENT",
            "2 pints fresh blueberries ADVERTISEMENT",
            "1/2 cup white sugar, or more to taste ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk the pudding and 2 cups milk together in a bowl until thickened, about 2 minutes. Refrigerate the pudding until serving time.\nMix blueberries and 1/2 cup sugar in a large saucepan, and pour in enough water to just barely cover the berries. Bring the mixture to a boil over medium heat, reduce heat to low, and simmer while you make the biscuits.\nTo make drop biscuits, mix flour, baking powder, 1 tablespoon of sugar, and salt together in a bowl. Make a well in the center of the flour mixture, and pour in vegetable oil and 1 cup of milk. Stir until the mixture forms a soft dough.\nBring the berry mixture back to a boil, and drop the biscuit dough into the boiling blueberries by heaping spoonfuls. Cover, and simmer over medium-low heat until the biscuit dough is cooked through, about 15 minutes. A knife inserted into a dumpling will come out clean. To serve, scoop a biscuit into a serving bowl, spoon blueberry sauce over, and top with chilled vanilla pudding.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Bakery Fruit Tart",
        "ingredients": [
            "2 unbaked 9-inch pie crusts ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "1/2 lime, juiced ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 (15 ounce) can mandarin orange segments, drained, liquid reserved ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "3/4 cup half-and-half cream ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 (5.1 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "1 quart fresh strawberries, hulled and halved ADVERTISEMENT",
            "2 kiwis, peeled and sliced ADVERTISEMENT",
            "1 (16 ounce) can apricot halves, drained ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (205 degrees C). Place each pie crust into a 9-inch pie dish, and line pastry with a double layer of aluminum foil and a layer of pie weights or dried beans. Bake in the preheated oven until edges of crusts are golden, about 10 minutes. Carefully remove the foil and weights and bake until the crusts have set, about 5 minutes more. Remove from oven; set aside to cool.\nBring 3/4 cup water, lime juice, sugar, and the reserved liquid from the mandarin oranges to a simmer in a saucepan over medium heat. Mix cornstarch and 1 tablespoon water in a small bowl; stir into the saucepan. Continue simmering until syrup has thickened. Remove from heat; set aside.\nWhisk the milk, half-and-half, and vanilla extract into the vanilla pudding mix in a large bowl. Allow the pudding to thicken for 5 minutes before spreading evenly into the baked pie crusts. Arrange the strawberries, kiwis, apricots, and mandarin orange segments decoratively on the pudding. Drizzle the prepared glaze thoroughly over each pie. Chill in refrigerator before serving.\n",
        "picture_link": "Bw6sVp5shnXDFtEjhBzQhHxHA5BKp6G"
    },
    {
        "title": "Mild Thai Beef with a Tangerine Sauce",
        "ingredients": [
            "1 (8 ounce) package dry Chinese noodles ADVERTISEMENT",
            "1/4 cup hoisin sauce ADVERTISEMENT",
            "1/4 cup dry sherry ADVERTISEMENT",
            "1 teaspoon tangerine zest ADVERTISEMENT",
            "1/4 teaspoon ground ginger ADVERTISEMENT",
            "4 teaspoons vegetable oil ADVERTISEMENT",
            "1 pound flank beef steak, cut diagonally into 2 inch strips ADVERTISEMENT",
            "2 teaspoons vegetable oil ADVERTISEMENT",
            "1/2 small butternut squash - peeled, seeded, and thinly sliced ADVERTISEMENT",
            "1 cup sliced fresh mushrooms ADVERTISEMENT",
            "1 large red onion, cut into 2 inch strips ADVERTISEMENT",
            "3 cups cabbage, thinly sliced ADVERTISEMENT",
            "1 tangerine, sectioned and seeded ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the noodles, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 5 minutes. Drain, rinse, and set aside.\nWhisk together the hoisin sauce, sherry, tangerine zest, and ground ginger in a small bowl.\nHeat 2 teaspoons vegetable oil in a large wok or skillet over high heat. Add one half of the beef slices to the pan; cook, stirring constantly, until the meat is nicely browned, 2 to 3 minutes. Remove meat to a platter with a slotted spoon. Repeat with the remaining beef.\nHeat the remaining 2 teaspoons of oil in the pan. Stir in the butternut squash, mushrooms, and onion. Cook, stirring constantly, until vegetables are crisp-tender and slightly brown on the edges, 5 to 7 minutes. Add the cabbage, and cook and stir until slightly wilted, about 2 additional minutes.\nReduce the heat to medium. Stir the cooked beef, tangerine sections, and hoisin mixture into the vegetables. Cook until heated through, 2 to 3 minutes. Serve over Chinese noodles.\n",
        "picture_link": "JObN0nu3Hy9SX4Pl/RqpWe/K51cNEaO"
    },
    {
        "title": "Chipotle BBQ Sauce",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "1/2 cup diced onions ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "1/2 cup beer ADVERTISEMENT",
            "1/3 cup distilled white vinegar ADVERTISEMENT",
            "2 tablespoons prepared jalapeno pepper jelly ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1 teaspoon dry mustard ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "2 teaspoons ground dried chipotle pepper ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a saucepan over medium heat. Stir in the onion and garlic; cook until the onion has softened and turned translucent, about 5 minutes. Stir in the ketchup, beer, vinegar, jelly, brown sugar, mustard, cumin, chipotle pepper, paprika, and salt. Bring to a simmer, and cook a few minutes until slightly thickened.\n",
        "picture_link": "T7LnhA0D9YrMjMkw.3p.mXD8o1FkmIe"
    },
    {
        "title": "South African Brown Pudding",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "2 cups flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3 tablespoons distilled white vinegar ADVERTISEMENT",
            "2 tablespoons apricot jam ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "Sauce ADVERTISEMENT",
            "1 cup sugar ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/2 cup butter or margarine ADVERTISEMENT",
            "2 teaspoons vanilla ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C).\nBeat 2 cups sugar and eggs with an electric mixer in a large bowl until light and fluffy. Stir in the flour, baking powder, baking soda, salt, vinegar, and apricot jam. Pour in 2 cups of milk and stir until well combined. Spoon the batter into a greased, 2 quart oven-proof baking dish.\nBake in the preheated oven for 60 to 70 minutes, or until a knife inserted into the center comes out clean. Pierce the baked pudding several times with a skewer or fork.\nPlace 1 cup sugar, water, 1 cup milk, butter, and vanilla in a saucepan and stir over medium heat. When the mixture comes to a boil remove it from the heat and slowly pour the mixture over the hot pudding. Serve warm.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Sweet n' Sour Salad Dressing",
        "ingredients": [
            "1 cup olive oil ADVERTISEMENT",
            "1/2 cup rice vinegar ADVERTISEMENT",
            "1/2 cup balsamic vinegar ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk the olive oil, rice vinegar, balsamic vinegar, lemon juice, white sugar, and black pepper together in a bowl.\n",
        "picture_link": "8NK6.jCjoPJrafguzQxjlbpb5PuiPY2"
    },
    {
        "title": "Creamy Banana Blast",
        "ingredients": [
            "2 ripe bananas ADVERTISEMENT",
            "1 cup evaporated milk ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "2 cups crushed ice ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "4 pinches ground cinnamon, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend the bananas, evaporated milk, milk, sugar, ice, and nutmeg in a blender until smooth; pour into glasses and garnish each with a pinch of cinnamon to serve.\n",
        "picture_link": "meCY6uIIkq2ZZW63DwwuYQEz/Bzr4lq"
    },
    {
        "title": "Slow Cooker Turkey and Vegetables",
        "ingredients": [
            "2 pounds skinless turkey thighs, cubed ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes with juice ADVERTISEMENT",
            "1 (6.5 ounce) jar artichoke hearts, drained ADVERTISEMENT",
            "3 parsnips, peeled and cubed ADVERTISEMENT",
            "1/2 pound baby carrots ADVERTISEMENT",
            "1 yellow squash, cubed ADVERTISEMENT",
            "1 green bell pepper, cut into chunks ADVERTISEMENT",
            "4 cups chicken broth, or as needed to cover ADVERTISEMENT",
            "2 cubes chicken bouillon ADVERTISEMENT",
            "1 (15 ounce) can garbanzo beans, drained ADVERTISEMENT",
            "1 teaspoon chopped fresh dill, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sprinkle the turkey thigh cubes with salt and black pepper, and place into a slow cooker. Pour the diced tomatoes over the turkey, and follow with the artichoke hearts in a layer. Place the parsnips, baby carrots, yellow squash, and green bell pepper into the cooker, and pour in the chicken broth to cover. Place the bouillon cubes into the broth. Cover, and cook on Low for 8 to 10 hours. Pour in the garbanzo beans in the last hour. Garnish with fresh dill.\n",
        "picture_link": "nWlyc9au5fBNqfV4t4NP3NMcny9tHDm"
    },
    {
        "title": "Angry Shrimp with Tuscan White Beans",
        "ingredients": [
            "Bean Mixture: ADVERTISEMENT",
            "1 (19 ounce) can Progresso® cannellini beans, drained, rinsed ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "3/4 cup Progresso® chicken broth ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 tablespoon chopped fresh Italian (flat-leaf) parsley ADVERTISEMENT",
            "Coating Mixture: ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "4 1/2 teaspoons California chili powder ADVERTISEMENT",
            "1 tablespoon coarse sea salt (gray salt) ADVERTISEMENT",
            "1 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup Progresso® plain Panko crispy bread crumbs ADVERTISEMENT",
            "Shrimp Mixture: ADVERTISEMENT",
            "16 large uncooked shrimp, peeled (tail shells left on), deveined ADVERTISEMENT",
            "1/3 cup extra-virgin olive oil (or as needed) ADVERTISEMENT",
            "4 cloves garlic, thinly sliced ADVERTISEMENT",
            "1 small serrano chile, thinly sliced ADVERTISEMENT",
            "1 cup fresh whole basil leaves ADVERTISEMENT",
            "1 1/2 teaspoons grated orange peel ADVERTISEMENT",
            "Additional extra-virgin olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In small saucepan, heat beans, 2 tablespoons olive oil and the chicken broth to boiling. Reduce heat to low to keep mixture warm. (Lemon juice and parsley will be added later.)\nIn small bowl, mix flour, chili powder, 1 tablespoon salt and 1 teaspoon pepper. In another small bowl, beat egg lightly. In third small bowl, place bread crumbs.\nCoat shrimp with flour mixture, shaking off excess; next dip shrimp into egg and then coat with bread crumbs. In 10-inch skillet, heat 1/3 cup of the oil over high heat. Add shrimp to skillet in single layer. (Do not toss or move shrimp.) Cook about 3 minutes. Turn shrimp over; cook until browned. Remove shrimp from skillet to cookie sheet.\nAdd garlic to hot oil in skillet; cook and stir until light brown, adding more oil if necessary. Add chile; cook until soft. Carefully add basil (water in skillet will pop). Cook 45 to 60 seconds or until crisp.\nMeanwhile, stir lemon juice and parsley into bean mixture in saucepan; season to taste with additional salt and pepper.\nStir orange peel into basil mixture in skillet. Remove from heat. Return shrimp to skillet; toss to combine.\nSpoon bean mixture onto platter or individual plates. Drizzle with olive oil. Top with shrimp; spoon some of basil mixture with some of its oil over top.\n",
        "picture_link": "gGsYOJwYFwX4Gx8qN6mRVwEUS2gfJdm"
    },
    {
        "title": "Daddy's Pumpkin Soup",
        "ingredients": [
            "2 (3 pound) pumpkins - seeded, peeled, and cut into 1-inch cubes ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "1 cube chicken bouillon ADVERTISEMENT",
            "2 teaspoons chili powder ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "1 tablespoon pumpkin pie spice ADVERTISEMENT",
            "2 teaspoons ground ginger ADVERTISEMENT",
            "2 teaspoons grated orange zest ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the pumpkin, water, and chicken bouillon cube in a soup pot; bring to a boil. Reduce heat and simmer until the pumpkin is tender, about 30 minutes. Stir in the chili powder. Pour the mixture into a blender, filling the pitcher no more than halfway full. Hold down the lid of the blender with a folded kitchen towel and carefully start the blender, using a few quick pulses to get the pumpkin mixture moving before leaving it on to puree. Puree in batches until smooth and pour into a clean pot. Alternately, you can use a stick blender and puree the soup right in the cooking pot.\nReturn the soup to the pot and bring to a simmer over medium-low heat; stir in the cream, pumpkin pie spice, ginger, and orange zest and simmer for 10 more minutes. Return the hot soup to the blender and puree as before.\n",
        "picture_link": "GV2kIAlGm/maLZFoIYPVjYJfp.GBlv6"
    },
    {
        "title": "Perfect Pumpkin Seeds",
        "ingredients": [
            "1 1/2 cups raw cleaned whole pumpkin seeds ADVERTISEMENT",
            "1/2 cup Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon hot pepper sauce (such as Tabasco®) ADVERTISEMENT",
            "1 tablespoon bacon grease ADVERTISEMENT",
            "3/4 tablespoon liquid smoke flavoring ADVERTISEMENT",
            "1 1/2 tablespoons cayenne pepper, or to taste ADVERTISEMENT",
            "1 tablespoon garlic salt ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the pumpkin seeds in a container with a lid, and mix in the Worcestershire sauce, hot pepper sauce, bacon grease, and liquid smoke flavoring. Cover the container, and allow to stand overnight.\nPreheat the oven's broiler, and set the oven rack about 6 inches from the heat source.\nRemove the seeds from the flavorings with a slotted spoon, and transfer into a bowl. Mix the cayenne pepper and garlic salt into the seeds, and stir to coat well. Spread the seeds over a baking sheet in a single layer. Sprinkle with additional salt.\nRoast the seeds under the broiler until toasted and golden brown, about 8 minutes; turn the seeds over twice during broiling. Cool to room temperature.\n",
        "picture_link": "Txy2fBH5DZmuI7HMuh.A/9HhC30Rjya"
    },
    {
        "title": "Louisiana Yam-Apple Medley",
        "ingredients": [
            "2 (16 ounce) cans sliced yams, undrained ADVERTISEMENT",
            "1 (20 ounce) can sliced apples, undrained ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "1/4 cup packed brown sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "2 tablespoons margarine, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 375 degrees F (190 degrees C).\nMix the yams and apples, and place into the bottom of a 2-quart casserole dish. Stir the pecans, sugar, and cinnamon together in a bowl; scatter over the yams and apples. Drizzle the margarine over the mixture.\nBake in the preheated oven until the topping begins to brown, basting 1 or 2 times while cooking, about 20 minutes.\n",
        "picture_link": "7be3SpLmJTAOXVqVDFN2pFgofkT7xY."
    },
    {
        "title": "Hot and Tangy Apple Cider",
        "ingredients": [
            "8 whole cloves, or to taste ADVERTISEMENT",
            "1 gallon apple cider ADVERTISEMENT",
            "1/2 gallon orange juice ADVERTISEMENT",
            "1 quart grapefruit juice ADVERTISEMENT",
            "6 cinnamon sticks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the cloves into a tea ball, and place into a slow cooker. Pour the apple cider, orange juice, and grapefruit juice into the slow cooker, and drop in the cinnamon sticks. Stir once or twice. Set the cooker to High, cover, and cook until the mixture is hot; then keep warm on Low setting. Serve in mugs.\n",
        "picture_link": "pvn19Q5JmaOvbl.0aLstq/rtSFX0Xcq"
    },
    {
        "title": "Italian Onion Soup",
        "ingredients": [
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "1 tablespoon finely chopped garlic ADVERTISEMENT",
            "8 cups thinly sliced onions ADVERTISEMENT",
            "1/4 teaspoon gray salt or sea salt ADVERTISEMENT",
            "1 tablespoon finely chopped fresh sage leaves ADVERTISEMENT",
            "1/4 cup Progresso® balsamic vinegar ADVERTISEMENT",
            "1 (32 ounce) carton Progresso® beef broth ADVERTISEMENT",
            "4 (3/4 inch thick) slices Italian country bread ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In 12- to 14-inch skillet, heat oil over medium-high heat. Add garlic; cook and stir until garlic begins to brown. Stir in onions and salt. Cook about 7 minutes. Reduce heat to medium. Cook about 10 minutes longer, stirring occasionally, until onions are golden brown.\nStir in sage and vinegar. Cook 2 to 4 minutes, stirring occasionally, until liquid has evaporated. Stir in broth. Simmer over medium heat 10 minutes, stirring occasionally.\nMeanwhile, set oven control to broil. Sprinkle bread with cheese; place on cookie sheet. Broil with tops 4 to 6 inches from heat until cheese is melted (watch carefully). Place 1 slice of bread on each serving of soup.\n",
        "picture_link": "J7jVLTIVQyH8NriViHragZosB2NUA8K"
    },
    {
        "title": "Pumpkin Parfait by Jo",
        "ingredients": [
            "1 1/2 cups graham cracker crumbs ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1/4 cup melted butter ADVERTISEMENT",
            "1 (15 ounce) can pure pumpkin ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/8 teaspoon ground cloves ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 quart vanilla ice cream, softened ADVERTISEMENT",
            "1 cup whipped cream ADVERTISEMENT",
            "1 tablespoon confectioners' sugar ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the graham cracker crumbs, 1/4 cup of brown sugar, and melted butter in a bowl. Press the crust into a 9x9-inch square baking dish. Place the pumpkin into a large bowl, and mash it up with a spoon. Mix in 1/2 cup of brown sugar, salt, nutmeg, cloves, and 1 teaspoon of cinnamon until smooth. Gently stir in the softened ice cream. Spread the pumpkin mixture over the graham cracker crust. Freeze until firm, 4 to 6 hours; cut into squares.\nLightly mix the whipped cream with confectioners' sugar and a 1/4 teaspoon of cinnamon in a bowl; serve each square with a dollop of the sweetened whipped cream.\n",
        "picture_link": "WsoGMtEu27vi3dxd4Q5WbxXrUcIE0mG"
    },
    {
        "title": "Matbucha",
        "ingredients": [
            "1/4 cup extra-virgin olive oil ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "5 tomatoes, chopped ADVERTISEMENT",
            "5 green bell peppers, chopped ADVERTISEMENT",
            "1 jalapeno pepper, chopped ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 pinch sea salt (optional) ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large pot over medium heat. Stir in the garlic, tomatoes, bell pepper, and jalapeno pepper. Season with paprika, black pepper, and sea salt. Cook, stirring occasionally for 20 minutes until the vegetables are tender. Reduce heat to low, cover, and cook until the liquid evaporates and the salad thickens, about 2 hours more. Stir in the lemon juice, and refrigerate overnight before serving.\n",
        "picture_link": "cd8YnVdFgrAoga3cKUqQyw73.iAZmWe"
    },
    {
        "title": "Buffalo Wing Potato Pancakes",
        "ingredients": [
            "2 frozen, breaded chicken strips ADVERTISEMENT",
            "3 tablespoons hot sauce (such as Frank's RedHot ®) ADVERTISEMENT",
            "6 cups leftover mashed potatoes ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 (1 ounce) package ranch dressing mix ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook the chicken strips according to package directions. Dice the cooked chicken strips and place them in a bowl and toss with the hot pepper sauce.\nStir together the mashed potatoes, eggs, and ranch dressing mix in a large bowl.\nHeat oil in a large skillet over medium heat. In batches, drop 1/2 cup of the potato mixture into the skillet. Press to flatten. Sprinkle a heaping tablespoon of the coated chicken strips on the flattened pancake. Cook for about 4 minutes on each side, until the pancakes are golden brown. Garnish with shredded cheese and serve.\n",
        "picture_link": "Lg34wDmeQkC./IAMkTKuMbPXzQPBvEm"
    },
    {
        "title": "Xocolatl (Aztec Chocolate)",
        "ingredients": [
            "1 1/2 cups water ADVERTISEMENT",
            "1 green chile pepper, sliced ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "1/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring 1 1/2 cup water to a boil in a pot; add the chili pepper, seeds included, to the boiling water and cook at a boil for 5 to 10 minutes. Strain the chili pepper and seeds from the water; return the water to the pot. Add 4 cups water to the chili pepper-infused water, reduce heat to medium-low, and bring to a slow boil. Stir the cocoa powder and vanilla extract into the boiling water; cook and stir until the powder dissolves completely, 5 to 10 minutes.\n",
        "picture_link": "4jPt4Qa/Bdytw.N1bsoOsatGnM43ypi"
    },
    {
        "title": "Red Chicken",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 whole chicken, cut into pieces ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 cup tomato sauce ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "3 1/2 tablespoons chutney ADVERTISEMENT",
            "3 1/2 tablespoons white sugar ADVERTISEMENT",
            "3 1/2 tablespoons distilled white vinegar ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon paprika ADVERTISEMENT",
            "1 teaspoon ground dry mustard ADVERTISEMENT",
            "1 dash hot pepper sauce (such as Tabasco®), or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nPlace flour, salt, and black pepper into a resealable plastic zipper bag, close the bag, and shake several times to mix. Place chicken pieces into the bag, a few at a time, and shake to coat with seasoned flour; place chicken into the prepared baking dish.\nHeat butter in a skillet over medium heat, and cook the onion until translucent, about 5 minutes. Sprinkle the onion over the chicken pieces. Mix together the tomato sauce, water, chutney, sugar, vinegar, Worcestershire sauce, paprika, ground mustard, and hot pepper sauce in a bowl until the sugar dissolves. Pour the sauce over the onion and chicken.\nBake in the preheated oven until the sauce is bubbling, the chicken is no longer pink inside, and the juices run clear, about 1 hour. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Anise Waffle Cookies",
        "ingredients": [
            "3 cups all-purpose flour, or as needed ADVERTISEMENT",
            "1 tablespoon anise seed ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "3 small eggs ADVERTISEMENT",
            "1 drop anise oil ADVERTISEMENT",
            "1/2 cup confectioners' sugar, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat a waffle iron according to manufacturer's instructions. Whisk together flour, anise seed, and salt in a bowl.\nIn a separate bowl, mash the shortening until creamy, and stir with all of the sugar, eggs, and anise oil until thoroughly mixed. Stir the flour mixture into the wet ingredients to form a dough. Break off about 1 tablespoon of dough per cookie, and roll into 1-inch balls.\nSpray the waffle iron with cooking spray. Place dough balls onto the iron, close the lid, and bake until the iron stops emitting steam and the cookies are lightly golden brown, 1 to 3 minutes. Check after about 1 minute. Remove the cookies from the iron and sprinkle with confectioners' sugar while still warm. Cool on wire rack.\n",
        "picture_link": "eUyR4Q3x41koFz/Zd0Oq1yQKC5kVDK."
    },
    {
        "title": "The Ultimate Apple Cinnamon Grilled Cheese Sandwich",
        "ingredients": [
            "2 purchased cinnamon buns ADVERTISEMENT",
            "4 slices aged Cheddar cheese, divided ADVERTISEMENT",
            "4 slices Brie cheese, divided ADVERTISEMENT",
            "4 slices deli ham, shredded (divided) ADVERTISEMENT",
            "1 small apple - peeled, cored, and sliced (divided) ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Slice each bun in half, and place the slices on a work surface. To assemble a sandwich, place the toppings in this order: bottom of cinnamon bun, 1 slice Cheddar cheese, 1 slice of Brie cheese, apple slices, shredded ham, 1 slice of Brie cheese, 1 slice of Cheddar cheese, top of cinnamon bun. Repeat for 2nd sandwich, and gently press each sandwich together.\nMelt butter in a skillet over medium heat. Whisk eggs and milk together in a bowl.\nDip both sides of each sandwich quickly into the egg mixture, and pan-fry the sandwiches until golden brown on each side, about 2 minutes per side.\n",
        "picture_link": "Pu4IhqN7ovUbUt7XV73R8CeOB5ncOEi"
    },
    {
        "title": "Slow Cooker Turkey and Potatoes",
        "ingredients": [
            "2 1/2 cups water ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed cream of chicken and mushroom soup ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1/4 cup chopped green bell pepper ADVERTISEMENT",
            "1/4 cup chopped red bell pepper ADVERTISEMENT",
            "3 large turkey legs ADVERTISEMENT",
            "2 potatoes, cut into chunks ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 pinch seasoned meat tenderizer ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "garlic powder to taste ADVERTISEMENT",
            "2 cups uncooked long grain white rice ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir the water, cream of chicken and mushroom soup, and cream of mushroom soup into a large slow cooker until smoothly combined, and mix in the onion and the green and red bell pepper. Place the turkey legs into the slow cooker and cover with the sauce.\nSet the slow cooker to High, and cook for 3 hours, stirring occasionally.\nAfter 3 hours, stir in the potatoes and season with salt, meat tenderizer, black pepper, and garlic powder. Cook for 2 more hours on High, stirring occasionally. Remove turkey legs and cut the meat off the bones; chop the meat, and return to the cooker. Cook for 1 more hour on High.\nAbout 25 minutes before serving time, bring the rice and water to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the rice is tender, and the liquid has been absorbed, 20 to 25 minutes. Serve the turkey and sauce over the hot cooked rice.\n",
        "picture_link": "d7ZLK2o4uxqprBW9pOYYlyP3dLzq4T."
    },
    {
        "title": "Turkey Vegetable Soup",
        "ingredients": [
            "6 cups turkey pan drippings, fat skimmed ADVERTISEMENT",
            "8 cups water ADVERTISEMENT",
            "2 turkey legs ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "2 cups cubed cooked turkey ADVERTISEMENT",
            "6 red potatoes, diced ADVERTISEMENT",
            "1/2 onion, quartered and sliced ADVERTISEMENT",
            "3 carrots, sliced ADVERTISEMENT",
            "2 stalks celery, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large stock pot, stir together the turkey drippings, water, turkey legs, garlic, bay leaf, thyme, and black pepper. Bring to a boil, reduce heat to a simmer, and cover the pot; simmer until the turkey meat is starting to fall from the bones, about 30 minutes. Remove turkey legs, and pick the meat from the bones; return the leg meat to the soup.\nWhisk 1/4 cup of flour with 1/2 cup of milk in a bowl until smooth, and stir the mixture into the soup. Return soup to simmer, stirring constantly, and cook until thickened, about 30 more minutes. Mix in the cubed cooked turkey meat, red potatoes, onion, carrots, and celery; cover the pot again, and simmer until the celery is tender, about 30 more minutes.\n",
        "picture_link": "H3Cla0qjBWpE4O5KmZEpwRzxyB1drK."
    },
    {
        "title": "Pork Chops with Grapes and Almonds",
        "ingredients": [
            "1 (10 ounce) container Alfredo pasta sauce ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "4 (6 ounce) boneless pork chops ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 (4 ounce) package fresh mushrooms, coarsley chopped ADVERTISEMENT",
            "3 tablespoons chopped fresh basil ADVERTISEMENT",
            "3 tablespoons chopped fresh oregano ADVERTISEMENT",
            "1/2 teaspoon dried dill weed ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1/2 cup dry white wine ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "12 seedless red grapes, halved ADVERTISEMENT",
            "1/3 cup toasted sliced almonds ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour alfredo sauce into a small saucepan and stir over medium heat until hot. Reduce heat to low, and keep warm.\nHeat 2 tablespoons olive oil in a large skillet over medium-high heat. Season pork chops with salt and pepper, and place into pan. Cook pork chops until browned on both sides, and no longer pink in the center, about 10 minutes.\nMeanwhile, heat 2 tablespoons olive oil in a separate large skillet over medium-high heat. Stir in mushrooms, and cook for 1 minute before adding basil, oregano, dill, and 2 tablespoons parsley. Continue cooking until the mushrooms begin to release their liquid, then pour in wine. Simmer until the wine has reduced by half, then quickly stir in the butter.\nTo serve, place pork chops onto a serving platter and top with the mushroom mixture. Ladle Alfredo sauce over top, and sprinkle with grapes, almonds, and the remaining 2 tablespoons parsley to garnish.\n",
        "picture_link": "7Tg9TPXpik0hwcWk8Pyo683hBHlocoG"
    },
    {
        "title": "Grilled SPAM®, Tomato, Cheddar Cheese, and Sweet Onion Sandwiches",
        "ingredients": [
            "1/4 cup spicy brown mustard ADVERTISEMENT",
            "8 slices whole wheat bread ADVERTISEMENT",
            "1 (12 ounce) can fully cooked luncheon meat (such as SPAM®), cut into 1/4 inch slices ADVERTISEMENT",
            "8 slices Cheddar cheese ADVERTISEMENT",
            "2 large tomatoes, cut into 1/2-inch slices ADVERTISEMENT",
            "1 sweet onion, thinly sliced ADVERTISEMENT",
            "1/4 cup softened butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread the mustard onto one side of each of the bread slices. Place the luncheon meat onto half of the bread slices, then top each with 2 slices of Cheddar cheese, sliced tomato, and onion. Place the remaining bread slices, mustard-side-down onto the onions. Spread butter evenly onto the outside of each sandwich.\nHeat a large skillet over medium-low heat. Place the sandwiches into the skillet, and cook until they are golden brown, then flip the sandwiches over, and continue cooking until golden brown and crispy on the other side, about 6 minutes per side. Allow the sandwiches to cool slightly before serving.\n",
        "picture_link": "ZrEjrKHSyg5d5dstUczh9/RUtnETqW2"
    },
    {
        "title": "Roasted Beet, Crab and Vegetable Soup",
        "ingredients": [
            "4 beets, scrubbed, stems trimmed to 1 inch ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "salt and freshly ground pepper, to taste ADVERTISEMENT",
            "2 tablespoons fresh lemon juice, or to taste ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 tablespoons garlic, minced ADVERTISEMENT",
            "1/2 cup chopped celery ADVERTISEMENT",
            "1 (8 ounce) can sliced mushrooms ADVERTISEMENT",
            "2 (13.75 ounce) cans chicken broth ADVERTISEMENT",
            "1/2 (9 ounce) package frozen baby lima beans ADVERTISEMENT",
            "1/2 (14 ounce) package frozen mixed vegetables ADVERTISEMENT",
            "2 (14.4 ounce) cans diced tomatoes ADVERTISEMENT",
            "1/2 (15 ounce) can peas ADVERTISEMENT",
            "1/2 pound imitation crab meat, flaked ADVERTISEMENT",
            "2 teaspoons dried thyme ADVERTISEMENT",
            "1 dash Louisiana-style hot sauce, or to taste ADVERTISEMENT",
            "salt and freshly ground pepper, to taste ADVERTISEMENT",
            "2 teaspoons fresh lemon juice, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nPlace beets into a 9x13 inch baking dish. Drizzle with 2 tablespoons olive oil and lemon juice. Season with salt and pepper to taste.\nCook beets in preheated oven, turning occasionally, until fork tender, about 45 minutes. Remove from oven, cool, peel, and cut into 1/2 inch pieces.\nHeat 2 tablespoons olive oil in a large pot over medium heat. Stir in the onion, garlic, celery, and mushrooms; cook and stir until the onion becomes transparent, about 5 minutes. Pour in the chicken broth, and heat 5 minutes. Add the lima beans and mixed vegetables; bring soup to a boil over high heat. Reduce heat to medium-low, and stir in the tomatoes, peas, beets, and crab meat. Season with thyme, hot sauce, salt, and pepper, to taste. Simmer 10 minutes more, and turn off the heat. Just before serving, stir in 2 teaspoons lemon juice.\n",
        "picture_link": "pvvZiNtjZLcwo1WjCS/vtjUpzG7E.Ky"
    },
    {
        "title": "Red Swiss Chard with Pine Nuts and Prosciutto",
        "ingredients": [
            "2 teaspoons olive oil ADVERTISEMENT",
            "1/4 cup pine nuts ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "8 cups chopped red Swiss chard ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 pound sliced prosciutto, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large skillet over medium heat. Cook and stir the pine nuts in the hot oil until they turn a light golden brown, about 2 minutes; watch carefully, they burn easily. Stir in the garlic; cook until fragrant, about 1 more minute, stirring constantly.\nMix in the Swiss chard; cook and stir until the chard has wilted, 3 to 5 minutes. Season with salt and black pepper. Lightly stir in the chopped prosciutto; cook and stir just until prosciutto is hot, then serve.\n",
        "picture_link": "t.FnY2ppEv1VBxGURIkF6KopI1/XNBm"
    },
    {
        "title": "Pineapple Shish Kebobs",
        "ingredients": [
            "1 (8 ounce) can pineapple chunks in juice, undrained ADVERTISEMENT",
            "1 (12 ounce) bottle Italian-style salad dressing ADVERTISEMENT",
            "10 ounces skinless, boneless chicken breast, cut into bite-size pieces ADVERTISEMENT",
            "10 large shrimp, peeled and deveined ADVERTISEMENT",
            "1 green bell pepper, cut into bite-size pieces ADVERTISEMENT",
            "1 red bell pepper, cut into bite-size pieces ADVERTISEMENT",
            "1 sweet onion, cut into bite-size pieces ADVERTISEMENT",
            "10 ounces fresh mushrooms, halved ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 package bamboo skewers, soaked in water for 60 minutes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Gently stir the pineapple chunks in juice, Italian-style salad dressing, chicken, shrimp, green bell pepper, red bell pepper, sweet onion, mushrooms, and garlic together in a large bowl. Cover the bowl with plastic wrap; allow to marinate in refrigerator for 8 hours or overnight.\nPreheat an outdoor grill for medium heat, and lightly oil the grate.\nDrain the mixture in a colander over a bowl to catch the liquid; shake to remove excess liquid. Alternately thread the chicken, red bell pepper, onion, green bell pepper, onion, pineapple, mushroom, and shrimp onto a skewer until each skewer is full; repeat until all ingredients are used.\nPour the strained marinade into a small saucepan and bring to a boil over high heat. Reduce heat to medium-low, and simmer for 10 minutes; set aside.\nCook the skewers on the preheated grill, turning frequently, until the chicken is no longer pink in the center and the juices run clear, about 15 minutes. Baste skewers generously with the reserved marinade as they cook.\n",
        "picture_link": "x8Vo58iYFTn58R3EgZ5RgKv80FXQCd2"
    },
    {
        "title": "Slow-Cooker Baked Bean Stew",
        "ingredients": [
            "1 cup chopped onion ADVERTISEMENT",
            "1 cup chopped green bell pepper ADVERTISEMENT",
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "3/4 teaspoon crumbled dried sage ADVERTISEMENT",
            "3/4 teaspoon cumin seed ADVERTISEMENT",
            "1 pound smoked sausage, sliced ADVERTISEMENT",
            "2 (16 ounce) cans baked beans ADVERTISEMENT",
            "1 (15 ounce) can garbanzo beans, drained ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the onion, green bell pepper, olive oil, sage, and cumin seed into a slow cooker, and set the cooker on Low. Cover cooker, and simmer for 2 hours. Stir in the smoked sausage, baked beans, garbanzo beans, diced tomatoes, and garlic, and cook on Low until flavors are blended, an additional 2 to 4 hours.\n",
        "picture_link": "UfDK4j7ujgVDE48pFlMoi3nUnZ1nrYK"
    },
    {
        "title": "Sloppy Joe Meatloaf",
        "ingredients": [
            "1 small onion, minced ADVERTISEMENT",
            "2 stalks celery, minced ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "1 (1.3 ounce) envelope sloppy joe seasoning mix ADVERTISEMENT",
            "1 cup dry bread crumbs ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "6 slices bacon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil.\nIn a bowl, mix together the onion, celery, tomato paste, sloppy joe mix, bread crumbs, and egg. Work in the ground beef lightly with your fingers until thoroughly combined. Shape the mixture into a loaf shape, and place on the prepared baking sheet. Lay bacon strips across the loaf crosswise, overlapping if necessary.\nBake in the preheated oven for 30 minutes, then decrease temperature to 350 degrees F (175 degrees C). Bake until the meat loaf is no longer pink inside and the juices run clear, about 30 more minutes. Use a bulb baster to remove accumulating grease several times during baking. Allow to stand for 10 minutes before slicing.\n",
        "picture_link": "CYzXNMDJ5FWNSWo3sbxh58EdjPpg8eW"
    },
    {
        "title": "Feed Your Krewe Jambalaya",
        "ingredients": [
            "5 cups water ADVERTISEMENT",
            "1/4 cup vegetable oil (optional) ADVERTISEMENT",
            "2 (8 ounce) packages ZATARAIN'S® Jambalaya Mix, Original ADVERTISEMENT",
            "1 pound boneless, skinless chicken breast halves, cubed ADVERTISEMENT",
            "1 pound smoked sausage, sliced 1/4-inch thick ADVERTISEMENT",
            "1/2 cup sliced green onions (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water and oil to boil in large saucepan. Stir in Rice Mixes, chicken and sausage; return to boil. Reduce heat to low; cover and simmer 25 minutes or until rice is tender.\nRemove from heat. Let stand 5 minutes. Sprinkle with green onions before serving.\n",
        "picture_link": "kOKw6A925gYxd2r9D5uEoDYEFS5TYRG"
    },
    {
        "title": "Reduced Fat and Cholesterol Red Velvet Cake",
        "ingredients": [
            "Cooking spray ADVERTISEMENT",
            "2 1/4 cups whole wheat flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 cup unsweetened applesauce ADVERTISEMENT",
            "3/4 cup sugar and sucralose blend for baking (such as SPLENDA® Sugar Blend) ADVERTISEMENT",
            "1 tablespoon sugar and sucralose blend for baking (such as SPLENDA® Sugar Blend) ADVERTISEMENT",
            "1/2 cup liquid egg substitute ADVERTISEMENT",
            "3 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1 fluid ounce red food coloring ADVERTISEMENT",
            "1 cup reduced-fat buttermilk ADVERTISEMENT",
            "1 1/4 teaspoons vanilla extract ADVERTISEMENT",
            "1 tablespoon white vinegar ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "3/4 cup fat-free vanilla yogurt ADVERTISEMENT",
            "3/4 cup fat-free cottage cheese ADVERTISEMENT",
            "2 (8 ounce) packages fat-free cream cheese at room temperature, cubed ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon skim milk, or as needed (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray 2 9-inch cake pans with cooking spray. Whisk together the whole wheat flour and salt in a bowl.\nBeat together the applesauce, 3/4 cup plus 1 tablespoon of sugar and sucralose baking blend, and egg substitute with an electric mixer on Medium speed in a large mixing bowl. In a small bowl, stir the cocoa powder and red food coloring together until smooth, and mix into the liquid ingredients. Gradually beat in the whole wheat flour mixture, alternating with buttermilk in several additions, and mix in 1 1/4 teaspoon of vanilla extract. In a small bowl, stir the vinegar and baking soda together, and mix into the batter. Pour batter into the cake pans, and tap the filled pans on the counter to remove air bubbles.\nBake in the preheated oven until the cakes are set and a toothpick inserted into the center of a cake comes out clean, 20 to 25 minutes. Allow to cool completely before frosting.\nFor frosting, place the vanilla yogurt and cottage cheese into the work bowl of a food processor, and process until smooth; add the cream cheese, and process again to smoothly blend the mixture. Add confectioners' sugar and 1 teaspoon of vanilla extract, and process again to make a smooth frosting, 30 seconds to 1 more minute, scraping the sides of the bowl. If frosting seems too stiff to spread, blend in skim milk, 1 teaspoon at a time, until the frosting is spreadable and smooth. Chill frosting for 1 hour before frosting cake. After frosting, chill cake before serving for easier cutting.\n",
        "picture_link": "aWaCAdHtuNoh7eUtxl3H.3dz1sEzJzC"
    },
    {
        "title": "Sambusaks (Sumboosaks) with Chickpeas",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "1/3 cup warm water ADVERTISEMENT",
            "1 extra large onion, finely chopped ADVERTISEMENT",
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "1 (15 ounce) can garbanzo beans, drained and lightly mashed ADVERTISEMENT",
            "1/4 bunch fresh cilantro, finely chopped ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon ground coriander ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 cups vegetable oil for frying ADVERTISEMENT",
            "11 eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the flour, cornstarch, salt, baking powder, 3 tablespoons of vegetable oil, and water together in a bowl to form a dough; cover and allow to rest for 10 minutes. Divide the dough into 11 portions, and form into balls. Roll each dough ball out on a floured surface to a 5-inch circle.\nCook the onion in 1 teaspoon of vegetable oil in a skillet over medium heat until browned, about 10 minutes; stir in the garbanzo beans, cilantro, cumin, coriander, salt, and black pepper until thoroughly combined.\nHeat 2 cups of vegetable oil in a deep-sided skillet to 350 degrees F (175 degrees C).\nBreak an egg into a greased custard cup, cover with a square of waxed paper, and cook in a microwave oven on High setting for 40 seconds. Place about 1 1/2 tablespoons of the garbanzo bean filling onto a dough circle, place the slightly cooked egg onto the filling, and gently fold the dough into a half-moon shape. Fold the dough edge over and crimp with a fork to seal in the filling.\nDeep fry the sambusaks, one or two at a time, in the hot oil until golden brown, about 3 minutes per side. Remove with a wire strainer, and drain on paper towels.\n",
        "picture_link": "oKZbYJib0CFD5Lhsx0PqHMnq6q84V4."
    },
    {
        "title": "SARALEE'S Beet Salad",
        "ingredients": [
            "2 red beets ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 tablespoon distilled white vinegar ADVERTISEMENT",
            "1 1/2 teaspoons white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the beets into a saucepan, cover with water, and bring to a boil. Reduce heat to medium-low, and gently boil the beets until tender, about 45 minutes. Remove from heat, allow the beets to cool, and peel. Shred the beets using a box grater.\nIn a salad bowl, mix the onion, salt, black pepper, vinegar, and sugar together lightly until thoroughly combined and the sugar has dissolved; mix in beets, chill, and serve.\n",
        "picture_link": "eUPDwGMNBg/VOMP.UxGPxpbwgDnnyqa"
    },
    {
        "title": "Simple Lasagna Burgers",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 pound bulk Italian sausage ADVERTISEMENT",
            "1 tablespoon crushed red pepper flakes ADVERTISEMENT",
            "1 tablespoon Italian seasoning ADVERTISEMENT",
            "12 ounces ricotta cheese ADVERTISEMENT",
            "1 cup spaghetti sauce ADVERTISEMENT",
            "1/3 cup grated Parmesan cheese ADVERTISEMENT",
            "1 bunch fresh spinach ADVERTISEMENT",
            "6 hamburger buns, split ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium-high heat, and lightly oil the grate.\nMix the ground beef Italian sausage, red pepper flakes, and Italian seasoning. Form the mixture into 12 thin, wide patties. Place about 2 ounces of ricotta cheese in the middle of 6 patties. Place the remaining 6 patties over the ricotta topped patties, press down, and pinch the edges to seal the cheese in the center.\nCook on the preheated grill until the burgers are cooked to your desired degree of doneness, about 8 minutes per side for well done. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C).\nPlace the cooked burgers on buns, then top with spaghetti sauce, Parmesan cheese, and spinach leaves.\n",
        "picture_link": "Qk/xDgzNFg6VKFkvJeeC.Xxco7ZHZYm"
    },
    {
        "title": "Crab-Stuffed Mushrooms",
        "ingredients": [
            "1 pound large fresh mushrooms ADVERTISEMENT",
            "4 tablespoons butter, divided ADVERTISEMENT",
            "1/4 cup Kikkoman Panko Bread Crumbs ADVERTISEMENT",
            "1/2 cup imitation crabmeat, flaked ADVERTISEMENT",
            "1/4 teaspoon onion powder ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "2 tablespoons Kikkoman Panko Bread Crumbs ADVERTISEMENT",
            "1/8 teaspoon black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 375 degrees F. Wipe mushrooms gently with a damp paper towel. Remove and finely chop stems. In a large skillet over medium heat, melt 3 tablespoons of the butter. Add mushroom stems and cook for 5 minutes or until tender. Remove from heat and stir in 1/4 cup of the panko, the shredded crab, onion powder, salt and pepper.\nStuff mushrooms caps with crab mixture and place them stuffing side up on an ungreased rimmed baking sheet. In a small bowl, combine remaining butter and panko. Sprinkle evenly over the tops of the mushrooms and bake for 15 minutes.\n",
        "picture_link": "qD/6phnnI0JZL3a5ZJinDB.1PDBkS7."
    },
    {
        "title": "Independence Day Cupcakes ",
        "ingredients": [
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup vegetable shortening ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 (1 ounce) package instant sugar-free vanilla pudding mix ADVERTISEMENT",
            "2 cups skim milk ADVERTISEMENT",
            "1 (7 ounce) container light whipped cream ADVERTISEMENT",
            "12 thinly sliced strawberries, or as needed ADVERTISEMENT",
            "24 fresh blueberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line 24 cupcake cups with paper liners. Whisk together the flour, sugar, baking powder, and salt in a large mixing bowl.\nWith a pastry cutter, chop the shortening into the dry ingredients until the mixture becomes crumbly, then beat in the egg whites, vanilla extract, and 1 cup of milk to make a smooth batter. Spoon batter into the paper-lined cupcake cups, filling them about 2/3 full.\nBake in the preheated oven until a toothpick inserted into the center of a cupcake comes out clean, 22 to 26 minutes. Allow cupcakes to cool completely.\nIn a bowl, beat together the pudding mix and 2 cups of skim milk until the pudding is thickened, about 2 minutes. Allow to stand for 5 minutes to finish thickening. Spoon the pudding into a pastry bag with a medium tip.\nTo fill and decorate cupcakes, use a thin paring knife to cut a small hole, about 1/2 inch in diameter, into the top of a cupcake. Insert the knife about 3/4 of the way down into the cupcake, and remove the core. Use the pastry bag to fill the hole with pudding, piping in enough pudding to fill the hole flush with the top of the cupcake. Frost the tops of the filled cupcakes with light whipped cream, spreading it into a smooth layer.\nPlace a blueberry in the center of each cupcake. Around the blueberry, arrange 5 slices of strawberry, pointed ends outward, to make a star shape. Store in refrigerator.\n",
        "picture_link": "1e7ov5z8Rq7srIhvVbtj39PoGzzRRwu"
    },
    {
        "title": "Ice Cream Cupcakes",
        "ingredients": [
            "1 (18.25 ounce) package chocolate cake mix ADVERTISEMENT",
            "1 1/4 cups water ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 (1.5 quart) container vanilla ice cream, softened ADVERTISEMENT",
            "1 (16 ounce) container prepared chocolate fudge frosting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Grease or line 24 cupcake or muffin cups with paper baking liners.\nStir cake mix, water, oil and eggs in large bowl until moistened. Beat with a mixer on medium speed for 2 minutes or whisk by hand for 2 minutes. Drop 2 tablespoons of batter into each cupcake cup. Bake in the preheated oven until a toothpick inserted into the cake comes clean, about 8 to 10 minutes. When the cupcakes have cooled completely, cover and freeze until hard, about 4 hours.\nSpoon about 1/2 cup of the softened ice cream into each cup and gently pack it into the cup. Cover and return to the freezer until frozen, about 4 hours. Frost the cupcakes with the prepared frosting and serve.\n",
        "picture_link": "CobB1Pg99LWh8.ODKvP6vb0679Ql966"
    },
    {
        "title": "Rosemary Blue Cheese Garlic Bread",
        "ingredients": [
            "2 tablespoons dried rosemary ADVERTISEMENT",
            "4 teaspoons garlic powder ADVERTISEMENT",
            "2 teaspoons onion salt ADVERTISEMENT",
            "1/2 cup salted butter, softened ADVERTISEMENT",
            "1 loaf French bread, halved lengthwise ADVERTISEMENT",
            "1/4 pound blue cheese, sliced ADVERTISEMENT",
            "dried rosemary (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven's broiler and set the oven rack about 6 inches from the heat source.\nStir the 2 tablespoons of rosemary, garlic powder, and onion salt together in a bowl. Add the softened butter to the herb mixture; mix to combine. Spread the butter mixture evenly onto the cut sides of the bread loaf; top with the blue cheese slices. Transfer the bread to a baking sheet.\nPlace the bread under the broiler until the cheese is slightly melted, about 4 minutes. Sprinkle with additional rosemary if desired.\n",
        "picture_link": "Z5tH7MUE6QbXYnb9sExdwNCBeXWTWG6"
    },
    {
        "title": "Meat-Free Stuffed Shells ",
        "ingredients": [
            "1 (12 ounce) box jumbo pasta shells ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 cup sliced mushrooms ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 (12 ounce) package firm tofu ADVERTISEMENT",
            "1/2 cup dry bread crumbs ADVERTISEMENT",
            "1/2 (10 ounce) package frozen chopped spinach, thawed and drained ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1 teaspoon Italian seasoning ADVERTISEMENT",
            "1 egg (optional) ADVERTISEMENT",
            "2 cups shredded mozzarella cheese ADVERTISEMENT",
            "1 (16 ounce) jar spaghetti sauce, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nFill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the shell pasta, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 13 minutes. Drain well in a colander set in the sink, and set aside.\nMelt the butter in a skillet, and cook and stir the mushrooms, onion, and garlic until the onion is translucent, about 7 minutes. Mash the tofu roughly with a fork in a bowl, and mix in the mushroom mixture, bread crumbs, spinach, Parmesan cheese, and Italian seasoning; stir until combined. If mixture seems crumbly, stir in an egg.\nPour enough pasta sauce into the bottom of a 9x13-inch baking dish to coat the bottom. Fill each shell with about 1 1/2 tablespoon of filling, and place into the dish in a single layer. Spoon remaining sauce on top of shells. If there's any remaining filling, scatter that over the sauce, and sprinkle the mozzarella cheese over the top. Cover the dish with aluminum foil.\nBake in the preheated oven until the filling is hot and set and the cheese is melted and bubbling, about 30 minutes.\n",
        "picture_link": "A4pQydsKsMs9zUBe6KYTBvA4WtcwPbC"
    },
    {
        "title": "Joanne's Jalapeno Chicken ",
        "ingredients": [
            "2 tablespoons olive oil, divided ADVERTISEMENT",
            "6 jalapeno peppers, or to taste, seeded and chopped ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 pound chicken tenders, cut into bite-size pieces ADVERTISEMENT",
            "1/4 teaspoon chicken seasoning blend, or to taste ADVERTISEMENT",
            "1/2 (10 ounce) can pina colada mix ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1/2 (12 fluid ounce) can or bottle bock beer ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1 tablespoon of olive oil in a skillet over medium heat, and cook and stir the jalapeno peppers and onion until tender, about 8 minutes. Remove the vegetables from the skillet; add 1 tablespoon of olive oil to the hot skillet. Sprinkle the chicken tenders with chicken seasoning, and cook and stir in the olive oil until slightly golden brown and no longer pink inside, about 10 minutes. Transfer the chicken to a bowl.\nReturn the jalapeno peppers and onions to the skillet, and stir in the pina colada mix and sour cream. Bring the mixture just to a simmer, reduce heat, and simmer for 5 minutes; stir in the chicken, and mix in the bock beer. Simmer until the flavors have blended and the sauce has slightly thickened, 15 to 30 more minutes.\n",
        "picture_link": "bsWQXSkQGV1PTfsPOKkIJEPafKv9Pp2"
    },
    {
        "title": "Mango Chicken with Greens",
        "ingredients": [
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon curry powder ADVERTISEMENT",
            "1 tablespoon distilled white vinegar ADVERTISEMENT",
            "1 tablespoon balsamic vinegar ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1 pinch salt and ground black pepper, or to taste ADVERTISEMENT",
            "4 chicken drumsticks ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 large mango, peeled, seeded, and sliced - divided ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "1 clove garlic, crushed ADVERTISEMENT",
            "1 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "2 small onions, sliced - divided ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1 bunch mustard greens, washed and chopped ADVERTISEMENT",
            "1/4 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the cumin, curry powder, white and balsamic vinegar, olive oil, 1/4 cup brown sugar, salt, and black pepper into a resealable plastic bag, and smush the bag several times with your fingers to combine and mix all ingredients. Place the chicken drumsticks into the bag, and knead the bag again with your fingers to coat the chicken in seasonings.\nHeat butter in a large skillet over medium heat, and place the seasoned chicken pieces into the hot butter. Brown the chicken well on both sides, about 10 to 12 minutes.\nPlace half the mango slices, Dijon mustard, garlic, red pepper flakes, and 1 sliced onion into a blender, and blend until smooth, about 1 minute. Pour the mango mixture into the skillet over the chicken. Stir in 2nd sliced onion, white sugar, 1/4 cup of brown sugar, mustard greens, and raisins; stir mixture to dissolve sugar. Bring the mixture to a boil, reduce heat to a simmer, and cook until the chicken is no longer pink at the bone and the juices run clear, 10 to 15 more minutes. Stir often while cooking.\n",
        "picture_link": "BNugkebaggSPqoY2Rbjuuq.GtZz1pw6"
    },
    {
        "title": "Red Bean and Rice Party Dip",
        "ingredients": [
            "3 cups water ADVERTISEMENT",
            "1 (8 ounce) package ZATARAIN'S® Red Beans and Rice ADVERTISEMENT",
            "1 cup salsa ADVERTISEMENT",
            "2 tablespoons chopped jalapeno peppers ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare Rice Mix as directed on package, using 3 cups water instead of 3 1/4 cups.\nReserve 1/4 to 1/2 cup of the shredded cheese to garnish dip, if desired. Stir remaining ingredients into rice mixture. Place mixture into food processor or blender; cover. Process or blend until smooth.\nKeep dip warm in a chaffing dish or slow cooker, if desired.\n",
        "picture_link": "6RbtRMKzi5QNRJ9PSLOKzWwW0Guygvq"
    },
    {
        "title": "Fresh Pineapple Coolers",
        "ingredients": [
            "1/2 fresh pineapple - peeled, cored, and cut into chunks ADVERTISEMENT",
            "2 cups pineapple juice ADVERTISEMENT",
            "1/4 teaspoon coconut extract ADVERTISEMENT",
            "10 cubes ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender, combine pineapple chunks, pineapple juice and coconut extract. Puree until smooth. Then, with the blender running, drop ice cubes one at a time into the opening in the lid of the blender. Make sure each cube is crushed before adding the next. Blend to desired texture. Serve in tall glasses.\n",
        "picture_link": "AO1P0sAQJLFwtoN6nQ9v.pvQOM./Yki"
    },
    {
        "title": "Mocha Liqueur Shake",
        "ingredients": [
            "3/4 cup light rum ADVERTISEMENT",
            "1/4 cup coffee flavored liqueur ADVERTISEMENT",
            "1 pint vanilla ice cream ADVERTISEMENT",
            "4 cubes ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender, combine rum, coffee liqueur and ice cream. Insert ice cubes until volume reaches 5 cups. Blend until smooth. Pour into chilled glasses, and serve.\n",
        "picture_link": "Jygu1RQFkP9e//bUseBVGkpK/gJjCVG"
    },
    {
        "title": "Grace's Honey Cakes",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "3 1/3 cups white sugar ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "1/2 cup dark corn syrup ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 teaspoons unsweetened cocoa powder ADVERTISEMENT",
            "1/8 teaspoon ground cloves ADVERTISEMENT",
            "1/8 teaspoon ground allspice ADVERTISEMENT",
            "1/8 teaspoon ground cinnamon ADVERTISEMENT",
            "1/8 teaspoon ground nutmeg ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "5 cups all-purpose flour ADVERTISEMENT",
            "1 (16 ounce) container cream cheese frosting ADVERTISEMENT",
            "1/2 cup pecan halves (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Grease two 9x13 inch pans.\nIn a large bowl, cream together the butter and sugar until smooth. Stir in the honey and corn syrup, then beat in the eggs one at a time until the batter is light and fluffy. Stir in milk and vanilla. Combine the cocoa, cloves, allspice, cinnamon, nutmeg, salt, baking powder and flour; stir into the honey mixture until fully incorporated. Batter will be thick. Divide the batter evenly between the prepared pans, and spread flat.\nBake for 20 to 25 minutes in the preheated oven. Do not over bake, or the cakes will not be chewy. Cut into squares while still warm, remove from the pan, and let cool. Frost with cream cheese frosting, and garnish each piece with a pecan half.\n",
        "picture_link": "zXpMR2FSTYK4FzKe7FnLI9dsTRP4sW2"
    },
    {
        "title": "Lime Squeeze",
        "ingredients": [
            "1/4 teaspoon grated lime zest ADVERTISEMENT",
            "2 limes, juiced ADVERTISEMENT",
            "1 (2 liter) bottle carbonated water, chilled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a pitcher, combine lime zest, lime juice and carbonated water. Pour into tall glasses over ice.\n",
        "picture_link": "GZSam/isEJeEoIxLh5wov.iSTj6DUQe"
    },
    {
        "title": "Baked Cider Doughnuts",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 cup whole wheat flour ADVERTISEMENT",
            "1/4 cup powdered milk ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1 cup unsweetened apple juice concentrate, thawed ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Lightly grease the doughnut pan with cooking spray.\nIn a large bowl, stir together the all-purpose flour, whole wheat flour, powdered milk, baking powder, salt, cinnamon, and nutmeg. Make a well in the center and pour in the eggs, honey, apple juice concentrate and vanilla. Mix until well blended. Fill each depression in the prepared doughnut pan 2/3 full with batter.\nBake for 8 to 10 minutes in the preheated oven, or until the tops spring back when lightly touched. Allow doughnuts to cool before removing from pan.\n",
        "picture_link": "KMfr97n/.VeAmeDC36ovQdoDc4kW1rq"
    },
    {
        "title": "Chile for Tamales",
        "ingredients": [
            "20 dried red chile peppers - washed, with stems and seeds removed ADVERTISEMENT",
            "5 cups water ADVERTISEMENT",
            "1 teaspoon dried, crushed Mexican oregano ADVERTISEMENT",
            "3 cloves garlic, crushed ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Wash dried peppers and remove stems and seeds. Place in a blender or food processor with the water, oregano, garlic, and a pinch or two of salt.\nBlend on high until peppers are thoroughly pureed, pulsing occasionally. Adjust seasoning with salt, if needed.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Hot Swiss and Spinach Dip with Yogurt",
        "ingredients": [
            "1/2 cup creamy salad dressing, e.g. Miracle Whip ™ ADVERTISEMENT",
            "1/2 cup plain yogurt ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped spinach - thawed, drained and squeezed dry ADVERTISEMENT",
            "1 (4 ounce) can chopped green chile peppers, drained ADVERTISEMENT",
            "1 cup shredded Swiss cheese ADVERTISEMENT",
            "3/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1 clove garlic, peeled and minced ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "1 small tomato, diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl, mix together creamy salad dressing, plain yogurt, chopped spinach, green chile peppers, Swiss cheese, Parmesan cheese, garlic, salt and ground black pepper.\nTransfer the mixture to a 9 inch pie pan. Bake in the preheated oven 25 to 30 minutes, until bubbly and lightly browned. Sprinkle with tomato before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Orange Surprise",
        "ingredients": [
            "4 fluid ounces orange juice ADVERTISEMENT",
            "4 fluid ounces cola-flavored carbonated beverage ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a glass, stir together orange juice and cola.\n",
        "picture_link": "KNGNJgJCtGkkbwBWCl/YBOLSdYRUjiq"
    },
    {
        "title": "Hot Coffee Frosting",
        "ingredients": [
            "1 (16 ounce) package confectioners' sugar ADVERTISEMENT",
            "3 tablespoons butter, softened ADVERTISEMENT",
            "6 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 cup hot, brewed coffee ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine confectioners' sugar, butter, cocoa powder and vanilla. Beat on slow speed until ingredients are combined. While beating, slowly add hot coffee until desired consistency is achieved.\n",
        "picture_link": "PSmx7cPw7ae3aAyjjqkqKoJ8aP4/8Bm"
    },
    {
        "title": "Bean-Hole Beans",
        "ingredients": [
            "10 cups dried great Northern beans ADVERTISEMENT",
            "1 pound salt pork ADVERTISEMENT",
            "2 onions ADVERTISEMENT",
            "2 1/2 cups molasses ADVERTISEMENT",
            "1 teaspoon black pepper ADVERTISEMENT",
            "4 teaspoons dry hot mustard ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "The bean hole should be 2 1/2 to 3 feet deep, depending on your pot. The hole should be big enough around to have a 6 inch space between the pot and the edge of the hole on all sides. To help hold heat, put some old tire chains or stones in the hole before starting the fire.\nStart the fire and keep it filled with good dry hardwood. Let it burn for about 3 hours. The hole should be at least 3/4 full of hot coals. After the fire has been going for about an hour, place the beans in a large pot, on the stove with water to cover. Bring to a boil and cook until skins roll back when you blow on them, about 45 minutes. Watch closely, because they will get mushy if left too long.\nWhen the hole is ready, cut the salt pork in to 2 inch wide and 1/4 inch thick slices. Place them into the bottom of the bean pot. Peel and cut the onions in half; lay them on top of the pork. Pour the beans and their liquid into the pot, then mix in the molasses, black pepper and dry mustard. Slice butter and place on top. Add enough boiling water to cover the beans by one inch. Cover the top of the pot tightly with aluminum foil so that it goes down over the sides by at least 2 inches. Place lid onto bean pot.\nBefore putting the pot into the hole, remove about 1/3 of the coals using a shovel. Remove and discard any burning pieces of wood. Place the bean pot into the hole, and put the coals from the hole back in around the sides and over the top of the bean pot. Now start filling the hole in with the dirt, packing it down with your feet as you go. You should end up with about 2 feet of dirt covering the pot. Cover the place where the beans are buried with a tarp or piece of metal to keep out rain.\nLet the beans stew overnight in their bean hole. Carefully dig them out the next day and enjoy!\n",
        "picture_link": "Nln6Q609UZBL4MrCDw0EMVOocvbaZS."
    },
    {
        "title": "German Pancakes I",
        "ingredients": [
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "3 eggs, lightly beaten ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "16 ounces applesauce ADVERTISEMENT",
            "4 ounces raisins ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "3 tablespoons blanched slivered almonds ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn a medium bowl, prepare pancake batter by blending flour, 2 eggs, 1/4 teaspoon salt and 1 cup milk.\nHeat a lightly greased griddle or medium skillet over medium heat. Pour approximately 1/8 of the batter onto the griddle. Flip with a metal spatula when bubbles begin to form, and cook until golden brown. Repeat with remaining batter, making 8 pancakes.\nPlace applesauce in a medium bowl, and mix in raisins. Spread the applesauce mixture over one side of each pancake. Roll pancakes jelly roll style, and cut in half vertically. Arrange pancake halves cut side down in a medium baking dish.\nIn a small bowl, mix remaining egg, salt and milk with sugar and almonds. Pour mixture over the pancakes.\nDot pancakes with butter, and bake 40 minutes in the preheated oven. Serve warm.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Mushrooms a la Gill",
        "ingredients": [
            "2 cups uncooked macaroni pasta ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1/2 (10.75 ounce) can milk ADVERTISEMENT",
            "1/2 (10.75 ounce) can water ADVERTISEMENT",
            "1/4 cup sliced fresh mushrooms ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a saucepan of lightly salted water to a boil. Add pasta, and cook until al dente, about 8 minutes. Drain.\nIn a separate saucepan, stir together the cream of mushroom soup, milk, water and mushrooms. Bring to a simmer, and cook until mushrooms are tender. Mix with cooked macaroni, and serve.\n",
        "picture_link": "4xs2Z5vCdJD7TQeCylAqMR4ugJBRJtK"
    },
    {
        "title": "Watercress and Crab Salad",
        "ingredients": [
            "2 bunches watercress, trimmed and chopped ADVERTISEMENT",
            "6 ounces imitation crabmeat, chopped ADVERTISEMENT",
            "1 stalk celery, chopped ADVERTISEMENT",
            "2 green onions, chopped ADVERTISEMENT",
            "1 tomato, chopped ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1/4 cup rice vinegar ADVERTISEMENT",
            "1 teaspoon chopped fresh basil ADVERTISEMENT",
            "1 pinch salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine the watercress, imitation crabmeat, celery, green onion, and tomato. In a separate bowl, whisk together the olive oil, vinegar, basil, salt, and pepper. Pour over the watercress mixture, and toss to coat evenly. Serve immediately.\n",
        "picture_link": "HOjv02u2f9Efn4kd4W1/KDMyyFzQ1py"
    },
    {
        "title": "Yam Supreme",
        "ingredients": [
            "6 cups cubed yam ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "1 cup pecan halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place yams into a medium saucepan with water to cover. Bring to a boil and cook until tender. Remove from heat, drain and mash.\nPreheat oven to 350 degrees F (175 degrees C). In a medium bowl, mix together yams, milk, 1/4 cup butter and salt. Spread into the bottom of a 9 inch square pan. In a small saucepan over low heat, melt remaining 1 cup butter and brown sugar together. Spread over the top of the mashed yams. Arrange pecans decoratively over the top.\nBake for 20 to 25 minutes in the preheated oven, until bubbly.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Best Frozen Daiquiris",
        "ingredients": [
            "1 (12 fluid ounce) can frozen lemonade concentrate, thawed ADVERTISEMENT",
            "1 (6 ounce) can frozen limeade concentrate ADVERTISEMENT",
            "4 1/4 cups water ADVERTISEMENT",
            "1 (750 milliliter) bottle light rum ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large freezable container, mix lemonade concentrate, limeade concentrate, water and rum. Freeze for 24 hours.\nWhen frozen, break up with a wooden spoon, stir and serve. Store remainder in freezer until needed. Be sure to stir before serving, as the alcohol tends to settle to the bottom.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Superb Lamb Shanks",
        "ingredients": [
            "6 (1 pound) lamb shanks ADVERTISEMENT",
            "1/4 cup all-purpose flour for coating ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 onion, finely chopped ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 cup evaporated milk ADVERTISEMENT",
            "1 (10.75 ounce) can condensed tomato soup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large deep skillet over medium-high heat, and spray with cooking spray. Coat the lamb shanks lightly with flour, and brown on all sides in the hot pan. Drain off fat.\nAdd the water, onion, salt and pepper. Cover, and reduce heat to low, and cook until the lamb is tender, about 1 1/2 hours. Turn shanks occasionally while cooking, and add more water if necessary. When shanks are done, stir in the evaporated milk and tomato soup. Cover and cook for an additional 10 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Chocolate Martini II",
        "ingredients": [
            "2 1/2 fluid ounces creme de cacao liqueur ADVERTISEMENT",
            "1/2 fluid ounce butterscotch schnapps ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a cocktail mixer full of ice, combine creme de cacao liqueur and butterscotch schnapps. Shake vigorously and strain into glass.\n",
        "picture_link": "wm0eo4w9TrSkqUdRFsDK6Ss0LfXNL3m"
    },
    {
        "title": "Big M's Barbadian Chicken Skewers",
        "ingredients": [
            "4 cloves garlic ADVERTISEMENT",
            "1 onion, cut into 6 wedges ADVERTISEMENT",
            "2 habanero peppers, seeded ADVERTISEMENT",
            "1 bunch green onions, chopped into 1 inch pieces ADVERTISEMENT",
            "1 tablespoon dried thyme ADVERTISEMENT",
            "1 1/2 teaspoons ground allspice ADVERTISEMENT",
            "1 inch piece fresh ginger root, peeled ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "3/4 cup rum ADVERTISEMENT",
            "3/8 cup dark molasses ADVERTISEMENT",
            "4 limes, zested and juiced ADVERTISEMENT",
            "4 boneless skinless chicken breasts, cut into 1 inch pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place garlic, onion, habanero peppers, green onions, thyme, allspice, and ginger into the bowl of a food processor; blend until smooth. Season to taste with salt and pepper. Transfer mixture to a large, non metallic bowl, and stir in rum, molasses, and lime zest and juice. Place chicken in bowl, and turn to coat. Cover, and marinate for 24 hours.\nPreheat grill for high heat.\nRemove meat from marinade, and thread onto skewers. Boil marinade in a small saucepan for at least 3 minutes.\nBrush grate with oil, and arrange skewers on hot grate. Slowly cook the chicken until slightly charred and cooked through, brushing with the marinade every time you turn the meat.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Passover Chocolate Chip Cocoa Meringues",
        "ingredients": [
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "1/4 cup mini chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C). Line 2 baking sheets with parchment paper. Sift 1/4 cup sugar, cocoa, and salt into a small bowl.\nIn a large bowl, beat egg whites with an electric mixer until soft peaks begin to form. Mix in remaining 1/4 cup of sugar gradually, and beat until medium-firm peaks form. Sprinkle in cocoa mixture gradually, and continue beating until egg whites are stiff. Fold in chocolate chips. Drop mixture onto baking sheets by rounded teaspoonfuls, spacing about 1 inch apart.\nBake in preheated oven for 40 minutes for crispy cookies. Cool cookies on baking sheets.\n",
        "picture_link": "Laj3ZqU1LbDP7bM/GEYgQNic9tvS9Eq"
    },
    {
        "title": "Favorite Banana Bread",
        "ingredients": [
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons CALUMET Baking Powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1 (8 ounce) package PHILADELPHIA Cream Cheese, softened ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "1 cup sugar ADVERTISEMENT",
            "1 cup mashed fully ripe bananas ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup chopped PLANTERS Walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 350 degrees F.\nMix flour, baking powder and baking soda. Beat cream cheese, butter and sugar in large bowl with mixer until blended. Add bananas and eggs; mix well. Gradually add flour mixture, mixing well after each addition. Stir in nuts.\nPour into greased and floured 9x5-inch loaf pan.\nBake 1 hour 10 min. or until toothpick inserted in center comes out clean. Cool 5 minutes; remove from pan to wire rack. Cool completely.\n",
        "picture_link": "Vfd9TtGzu2uGeM/KvERLGh2VINli2Mm"
    },
    {
        "title": "Purple Beet, Carrot, and Onion Medley",
        "ingredients": [
            "3 beets, sliced ADVERTISEMENT",
            "3 large purple carrots, sliced ADVERTISEMENT",
            "1 cup sliced red onion ADVERTISEMENT",
            "3 tablespoons apple cider vinegar ADVERTISEMENT",
            "coarse salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nCombine beets, carrots, and onion in a casserole dish. Pour vinegar over vegetable mixture; season with salt and pepper. Cover dish with aluminum foil.\nBake in the preheated oven until vegetables are tender, about 40 minutes.\n",
        "picture_link": "Gfwrua06o0S4AEp2BX70P2AzO39WxjK"
    },
    {
        "title": "Perfectly Paired Turkey Injection Marinade and Rub ",
        "ingredients": [
            "Marinade: ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1/2 cup lemon juice ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 teaspoon English mustard powder ADVERTISEMENT",
            "1 teaspoon minced fresh ginger ADVERTISEMENT",
            "Rub: ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "3 sprigs fresh rosemary, leaves stripped and finely chopped ADVERTISEMENT",
            "2 sprigs fresh thyme, leaves stripped and chopped ADVERTISEMENT",
            "2 small cloves garlic, minced ADVERTISEMENT",
            "1 (14 pound) whole turkey, neck and giblets removed ADVERTISEMENT",
            "1 tablespoon olive oil, or to taste (optional) ADVERTISEMENT",
            "1 pinch salt and ground black pepper to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir chicken broth, lemon juice, 1/2 cup melted butter, 1 clove garlic, mustard powder, and ginger together in a bowl. Cover bowl with plastic wrap and refrigerate marinade for flavors to blend, about 30 minutes.\nMix 1 cup softened butter, rosemary, thyme, and 2 cloves garlic together in a bowl until rub is evenly combined.\nSeparate skin from the meat of the turkey by running your hand under the skin to separate. Spoon rub mixture evenly under the skin in several different parts of the turkey.\nPour marinade into a meat injector and inject the meatiest parts of turkey with marinade, changing the angle of the needle several times.\nBrush turkey with olive oil and season with salt and pepper; place in roasting pan and cover with plastic wrap. Refrigerate turkey for 12 to 24 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pile High Snack Stadium",
        "ingredients": [
            "400 slices bread ADVERTISEMENT",
            "200 slices Cheddar cheese ADVERTISEMENT",
            "400 slices thinly sliced ham ADVERTISEMENT",
            "23 ounces salsa con queso (such as Tostitos®), divided ADVERTISEMENT",
            "1 tablespoon chile-garlic sauce (such as Sriracha) ADVERTISEMENT",
            "1 tablespoon sour cream ADVERTISEMENT",
            "1 (16 ounce) jar tomatillo salsa, or as needed ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "2 pounds Cheddar cheese, divided ADVERTISEMENT",
            "4 pepperoni beef sticks (such as Slim Jim®) ADVERTISEMENT",
            "8 toothpicks, or as needed ADVERTISEMENT",
            "4 (10 ounce) containers hummus, or as needed ADVERTISEMENT",
            "4 (10 ounce) containers red pepper hummus, or as needed ADVERTISEMENT",
            "14 cardboard magazine holders ADVERTISEMENT",
            "duct tape as needed ADVERTISEMENT",
            "8 pounds baby carrots ADVERTISEMENT",
            "5 pounds broccoli florets ADVERTISEMENT",
            "4 (16 ounce) packages cheese-flavored crackers (such as Cheez-It®) ADVERTISEMENT",
            "4 (12 ounce) packages blue corn tortilla chips ADVERTISEMENT",
            "2 (13 ounce) packages ridged potato chips (such as Ruffles®) ADVERTISEMENT",
            "2 (6 ounce) packages pita chips ADVERTISEMENT",
            "8 sleeves buttery round crackers (such as Ritz®) ADVERTISEMENT",
            "20 (10 inch) skewers ADVERTISEMENT",
            "2 (13.5 ounce) packages nacho cheese-flavored tortilla chips (such as Doritos®) ADVERTISEMENT",
            "2 (13 ounce) packages crunchy cheese puffs (such as Cheetos®) ADVERTISEMENT",
            "2 (10.5 ounce) bags corn chips (such as Fritos®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place a slice of bread on a work surface; top with 1 slice Cheddar cheese and 3 slices ham. Cover with a second slice of bread to create a sandwich. Repeat with remaining bread slices, Cheddar cheese, and ham.\nPour salsa con queso into a 3-inch bowl representing the center field logo. Draw a logo atop the salsa con queso using chile-garlic sauce and 1 tablespoon sour cream. Place bowl in the center of a 9x13-inch baking dish.\nSpread tomatillo salsa into the bottom of the 9x13-inch baking dish and around the center field 'logo' for the 'field'. Fill a piping bag with 1/2 cup sour cream. Pipe 9 lines of sour cream onto the 'field' representing 10-yard lines.\nCut two 3-inch pieces of Cheddar cheese representing the base of the goal post. Cut pepperoni sticks into two 3-inch pieces, two 2-inch pieces, and four 1-inch pieces. Secure each 3-inch piece of pepperoni stick to each Cheddar cheese piece using a toothpick. Secure the 2-inch pieces of pepperoni stick horizontally to the 3-inch pieces using a toothpick. Secure the 1-inch pieces of pepperoni sticks as the sides of the goal post using toothpicks.\nPlace each goal post into the center of a 9x5-inch loaf pan. Spread hummus around goal post representing 1 end zone. Spread red pepper hummus into the other 9x5-inch loaf pan representing the other end zone.\nCover a table with a clean disposable table cloth. Arrange the 'field' in the center of the table. Place 'end zones' on either end of 'field'. Secure 2 sets of 5 and 2 set of 2 magazine holders together using duct tape for the 'seating sections'; arrange around the 'field'.\nFill the 'seating sections' with carrots, broccoli, cheese crackers, blue corn tortilla chips, potato chips, pita chips, and buttery round crackers.\nArrange the sandwiches around the 'seating sections' using a brick-layer pattern.\nMake 12 'flags' by cutting 1-inch triangles from the Cheddar cheese. Secure each 'flag' to a skewer. Pierce the flag skewers through sandwich 'walls' around the 'stadium'. Make 4 'stadium lights' by cutting 2x1-inch rectangles out of Cheddar cheese. Secure each 'light' to 2 skewers. Pierce the light skewers around the 4 corners of the 'stadium'.\nFill the corners of the 'stadium' with nacho-flavored tortilla chips, crunchy cheese puffs, and corn chips.\n",
        "picture_link": "AHghI//WC.DAJCHjZAu.tdBc4Ssk8tm"
    },
    {
        "title": "Kat's Cauliflower Leek Soup",
        "ingredients": [
            "2 tablespoons coconut oil ADVERTISEMENT",
            "2 tablespoons extra virgin olive oil ADVERTISEMENT",
            "3 leeks, cut into 1-inch pieces ADVERTISEMENT",
            "4 cloves garlic, chopped ADVERTISEMENT",
            "1 head white cauliflower, chopped ADVERTISEMENT",
            "2 carrots, peeled and chopped ADVERTISEMENT",
            "1 large potato, peeled and cut into cubes ADVERTISEMENT",
            "1 (32 ounce) carton low-sodium vegetable broth ADVERTISEMENT",
            "1 (15 ounce) can light coconut milk ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon ground allspice ADVERTISEMENT",
            "1/4 cup chopped fresh parsley, or as desired (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt coconut oil with olive oil in a large pot over medium-low heat. Cook and stir leeks and garlic in hot oil mixture until leeks are translucent, about 5 minutes.\nStir cauliflower, carrots, and potato into leek mixture; cook and stir until the vegetables are tender, 20 to 30 minutes.\nPour vegetable broth into the pot, bring to a simmer, and cover the pot. Reduce heat to low and simmer broth until vegetables are completely tender, 10 to 20 minutes.\nPour broth mixture into a blender no more than half full. Cover and hold lid down; pulse a few times before leaving on to blend. Puree in batches until smooth.\nReturn puree to pot and place over low heat. Stir coconut milk, black pepper, nutmeg, and allspice into the puree. Ladle into bowls and garnish with parsley.\n",
        "picture_link": "jTv.uchRz4qeDk.gUKsRadczHxZ5YGa"
    },
    {
        "title": "How to Make Dulce de Leche ",
        "ingredients": [
            "1 small finishing nail ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "3 cups water, or more as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Wash the nail and pound it into the top of can of sweetened condensed milk to make 2 small holes on opposite sides of the top. Remove nail.\nPlace the can of condensed milk into a small saucepan and pour in water to reach high up the side of the can. Bring water to a boil; reduce heat to low. Simmer milk in the can for 3 to 4 hours. Milk will slowly turn light to medium brown and become thicker as it cooks. Add more water as it boils down.\nRemove lid from can and pour dulce de leche into a bowl. Whisk to break up any lumps and mix thicker caramel from the bottom into the rest of the syrup.\n",
        "picture_link": "BnDBEtnVa2YceqcNebMmQj093Hf695S"
    },
    {
        "title": "Peanut Butter Chocolate Waffle Sandwich",
        "ingredients": [
            "2 frozen waffles ADVERTISEMENT",
            "1 cup chocolate chips, or to taste ADVERTISEMENT",
            "2 tablespoons peanut butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place waffles in the toaster oven and cook until halfway done, 2 to 3 minutes. Spread chocolate chips over waffles and return to toaster oven; cook until chocolate melts, 2 to 3 minutes.\nSpread chocolate evenly around waffle using a fork or toothpick. Spread peanut butter over chocolate layer. Close waffles together making a sandwich.\n",
        "picture_link": "E3IBw/EDuNhdV1zU2Eui47qCYb4xqlu"
    },
    {
        "title": "Paleo Tropical Ice Cream",
        "ingredients": [
            "4 cups frozen banana slices ADVERTISEMENT",
            "1 cup frozen pineapple chunks ADVERTISEMENT",
            "1 (14 ounce) can coconut milk ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "1 pinch kosher salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Thaw banana slices and pineapple chunks at room temperature for 5 minutes.\nBlend bananas, pineapple, and coconut milk in a food processor until smooth, about 1 minute; add lime juice and kosher salt and process again to mix.\nLine an 8x11-inch baking dish with plastic wrap. Pour banana mixture into the baking dish. Freeze until the 'ice cream' is of soft-serve consistency, 30 to 45 minutes.\n",
        "picture_link": "ud23fNJ/5ix8YgVMM.kOg7Wq4sj8dSG"
    },
    {
        "title": "Oatmeal Raisin Cookies with Truvia® Baking Blend",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1/4 cup Truvia® Baking Blend ADVERTISEMENT",
            "1 tablespoon molasses ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 teaspoon vanilla ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups rolled oats ADVERTISEMENT",
            "3/4 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F.\nIn a large mixing bowl cream butter, Truvia(R) Baking Blend, molasses, egg and vanilla until smooth.\nIn a second bowl, combine the flour, baking soda, cinnamon and salt.\nAdd the dry ingredients to the creamed mixture, mixing until uniform. Stir in the oats and raisins.\nDrop tablespoons of the dough onto an ungreased cookie sheet, leaving 2 inches between cookies.\nBake for 10 minutes or until just golden at the edges.\nRemove from oven and let rest for 5 minutes, then remove cookies to a wire rack to cool completely.\n",
        "picture_link": "gH3t/pVjIJGv3SISAmR7mFpgiQl5w3G"
    },
    {
        "title": "Any Way You Want It Kale Smoothie",
        "ingredients": [
            "2 cups chopped kale ADVERTISEMENT",
            "1/4 cup Greek yogurt ADVERTISEMENT",
            "3 tablespoons peanuts (optional) ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 frozen banana ADVERTISEMENT",
            "3 frozen strawberries, or more to taste ADVERTISEMENT",
            "1 tablespoon maple syrup ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend kale, yogurt, and peanuts together in a blender until smooth. Add milk, banana, strawberries, and maple syrup and blend until desired consistency is reached.\n",
        "picture_link": "RJ28CrHVLuExtkGRsL66ux0uAGAJGqS"
    },
    {
        "title": "Smooth Broccoli Vitamix® Soup",
        "ingredients": [
            "1 1/2 teaspoons olive oil ADVERTISEMENT",
            "1/2 small onion, diced ADVERTISEMENT",
            "2 potatoes, diced ADVERTISEMENT",
            "1 head broccoli, cut into florets ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "1/8 teaspoon sea salt ADVERTISEMENT",
            "1/8 teaspoon ground ginger ADVERTISEMENT",
            "1/8 teaspoon ground thyme ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a skillet over medium heat; saute onion until translucent, 5 to 10 minutes.\nSpread potatoes and broccoli onto a microwave-safe plate. Cook in microwave until tender, 4 to 5 minutes.\nPlace onion, potatoes, broccoli, milk, chicken broth, pepper, salt, ginger, and thyme in the Vitamix(R) or blender. Start on variable 1, slowly increase to variable 10, and end on high for 4 to 5 minutes. Serve hot.\n",
        "picture_link": "VlI4GtPbuLriJ/nP3CDHfoLT9kbu9Fi"
    },
    {
        "title": "Quick Hot Chocolate",
        "ingredients": [
            "1 1/2 cups water ADVERTISEMENT",
            "3 ounces unsweetened baking chocolate ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "4 1/2 cups milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat water and chocolate in a saucepan over medium heat, stirring constantly, until chocolate is melted and mixture is smooth, about 5 minutes.\nStir sugar and salt into chocolate mixture. Bring to a boil, reduce heat to low, and simmer, stirring constantly, until sugar is dissolved and flavors combine, about 4 minutes. Pour milk into chocolate mixture and cook until hot. Beat with a whisk until foamy or stir until smooth.\n",
        "picture_link": "snEIpCr6lvkqIthg3y3vl7VzFvFeGe2"
    },
    {
        "title": "Broccoli and Cheddar Nuggets",
        "ingredients": [
            "1 teaspoon vegetable oil, or as needed ADVERTISEMENT",
            "1 (16 ounce) package frozen chopped broccoli, thawed ADVERTISEMENT",
            "1 cup bread crumbs ADVERTISEMENT",
            "1 1/2 cups shredded Cheddar cheese ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease a baking sheet with oil.\nPlace a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil; add broccoli, cover, and steam until tender, 2 to 6 minutes. Let broccoli cool at room temperature until cool enough to touch.\nTransfer broccoli into a large mixing bowl. Add bread crumbs, Cheddar cheese, eggs, basil, oregano, and garlic powder to the broccoli; mix. Shape into nuggets or fun shapes and arrange onto the prepared baking sheet.\nBake in preheated for 15 minutes, flip, and continue baking until heated through and beginning to firm, 10 to 15 minutes more.\n",
        "picture_link": "zTExUOpLKUxv6BoeA8INuimALoBe7m6"
    },
    {
        "title": "Easy Eggnog Cupcakes",
        "ingredients": [
            "Cupcakes: ADVERTISEMENT",
            "1 (15.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1 1/2 cups eggnog ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "1 teaspoon nutmeg ADVERTISEMENT",
            "Frosting: ADVERTISEMENT",
            "1 cup eggnog ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/4 cup shortening ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease 24 muffin cups or line with paper muffin liners.\nStir yellow cake mix, 1 1/2 cups eggnog, eggs, 1/4 cup melted butter, and nutmeg together in a bowl until batter is smooth. Pour cupcake batter into prepared muffin cups to fill about 2/3 full.\nBake in the preheated oven until golden and the tops spring back when lightly pressed, 12 to 14 minutes. Transfer cupcakes to a wire rack to cool completely.\nStir 1 cup eggnog and flour together in a saucepan over medium-high heat until mixture thickens, 5 to 7 minutes. Remove from heat and cool completely.\nBeat butter, shortening, and sugar together in a bowl with an electric mixture until light and fluffy, 2 to 3 minutes. Slowly beat in cooled eggnog mixture and beat until desired frosting consistency is reached. Spread frosting onto cooled cupcakes.\n",
        "picture_link": "IXCJGpHdg5ffpXMoqlFQH3xGjQ4X./K"
    }
]