[
    {
        "title": "Pumpkin Truffles",
        "ingredients": [
            "1 1/4 cups almonds ADVERTISEMENT",
            "2 1/2 cups crushed vanilla wafers ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 cup semi-sweet chocolate chips, melted ADVERTISEMENT",
            "1/2 cup pumpkin puree (such as Libby's®) ADVERTISEMENT",
            "1/3 cup coffee-flavored liqueur ADVERTISEMENT",
            "1/2 cup semi-sweet chocolate chips, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Spread almonds onto a baking sheet.\nBake in the preheated oven until almonds are fragrant and toasted, 5 to 10 minutes. Remove from oven and cool; grind in a food processor until almonds are a flour-like texture.\nMix ground almonds, crushed vanilla wafers, confectioners' sugar, and cinnamon together in a bowl. Stir 1 cup melted chocolate chips, pumpkin, and coffee liqueur into vanilla wafer mixture. Shape mixture into 1-inch balls and arrange on a baking sheet. Refrigerate or freeze truffles until solid, 1 to 2 hours.\nMelt 1/2 cup chocolate chips in the top of a double boiler over simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching. Dip truffles in melted chocolate and return to baking sheet to harden.\n",
        "picture_link": "2Au57Bipp4ZOG4PNdmK51OjYZnSHFPa"
    },
    {
        "title": "Grilled Turkey and Swiss Sandwich",
        "ingredients": [
            "1 tablespoon mayonnaise ADVERTISEMENT",
            "2 slices thick-cut rye bread ADVERTISEMENT",
            "2 slices Swiss cheese ADVERTISEMENT",
            "2 slices leftover turkey meat, or to taste ADVERTISEMENT",
            "1/4 cup baby spinach, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Set oven rack about 6 inches from the heat source and preheat the oven's broiler.\nSpread mayonnaise onto 1 side of each bread slice. Layer Swiss cheese, turkey, and spinach onto the mayonnaise-side of 1 bread slice; top with second bread slice. Place sandwich on a baking sheet.\nBroil in the preheated oven until heated through and cheese is bubbling, about 5 minutes.\n",
        "picture_link": "C9Vdz2SItsV5x9Plr/wt88E/IBledBG"
    },
    {
        "title": "Fiesta Chili",
        "ingredients": [
            "12 3/4 ounces ground turkey, broken into small portions ADVERTISEMENT",
            "6 3/8 ounces bacon, chopped ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "1/4 cup chopped green bell pepper ADVERTISEMENT",
            "1 medium jalapeno pepper, seeded and minced ADVERTISEMENT",
            "1 (16 ounce) can kidney beans, rinsed and drained ADVERTISEMENT",
            "1 (15 ounce) can black beans, rinsed and drained ADVERTISEMENT",
            "1 (14.5 ounce) can stewed tomatoes, chopped ADVERTISEMENT",
            "1/4 teaspoon chili powder ADVERTISEMENT",
            "1/4 teaspoon ground cumin ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nMix turkey, bacon, onion, bell pepper, and jalapeno pepper in a baking dish.\nBake in preheated oven, stirring occasionally, until the turkey is completely browned and the bacon is crisp, about 15 minutes.\nStir kidney beans, black beans, tomatoes, chili powder, cumin, salt, and cayenne pepper together in a large pot; bring to a boil and reduce heat to medium-low.\nStir turkey mixture into the beans mixture. Cook chili at a simmer, stirring occasionally, until the beans are tender, about 40 minutes.\n",
        "picture_link": "FwpqRthEHVm9S.miotiYpOizTiqxqSO"
    },
    {
        "title": "Purple and Gold Margarita",
        "ingredients": [
            "1 (1.5 fluid ounce) jigger gold tequila ADVERTISEMENT",
            "1/2 cup sweet and sour mix ADVERTISEMENT",
            "1 (1.5 fluid ounce) jigger raspberry flavored liqueur ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Salt the rim of a large margarita glass. To do so, pour salt onto a small plate, moisten the rim of the glass on a damp towel and press into the salt.\nIn a cocktail mixer full of ice, combine tequila, sour mix and raspberry liqueur. Shake vigorously and strain into salt rimmed glass.\n",
        "picture_link": "/cLDaZ.0eXq0m9KUdXALeT8PAXk/Wwm"
    },
    {
        "title": "Pickle-Juice Bread-Machine Bread",
        "ingredients": [
            "1 1/2 cups pickle juice ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "3 1/2 tablespoons white sugar ADVERTISEMENT",
            "1/2 cup wheat germ ADVERTISEMENT",
            "3/4 cup rolled oats ADVERTISEMENT",
            "1 1/4 cups whole wheat flour ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon active dry yeast ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put dill pickle juice, water, vegetable oil, salt, white sugar, wheat germ, oats, whole wheat flour, all-purpose flour, and yeast, respectively, in the pan of a bread machine.\nSelect Sandwich and Three-Pound Loaf settings; press Start. Cycle should take about 3 hours 10 minutes to complete.\nRemove loaf from bread pan and allow to cool on wire rack at least 20 minutes before slicing.\n",
        "picture_link": "NWiB6Ed6VHgQzO209LqZvhnvOdF8vJy"
    },
    {
        "title": "Ricotta Gnocchi with Fresh Peas and Mushrooms ",
        "ingredients": [
            "Gnocchi: ADVERTISEMENT",
            "1 pound ricotta cheese ADVERTISEMENT",
            "3 large eggs ADVERTISEMENT",
            "1 teaspoon salt, or to taste ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "Sauce: ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 cup sliced fresh morel mushrooms, or more to taste ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "3 cups vegetable broth ADVERTISEMENT",
            "1 cup fresh green peas, or more to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Process ricotta, eggs, 1 teaspoon salt, pepper, and nutmeg in a food processor until smooth. Add flour and blend until a smooth, semi-stiff batter forms. Transfer gnocchi batter to a bowl, cover the bowl with plastic wrap, and refrigerate for 1 hour.\nHeat oil in a large saucepan over medium-high heat. Saute mushrooms in hot oil until soft and fragrant, 3 to 5 minutes. Add garlic and saute for 1 minute. Add vegetable broth, bring to a boil and reduce to a simmer; stir in peas. Cook until peas are soft, 3 to 5 minutes. Season with salt and pepper to taste.\nFill a large pot with lightly salted water and bring to a rolling boil.\nWorking in batches, drop spoonfuls of ricotta batter into boiling water. Bring water back to a boil and cook for 3 minutes. Remove gnocchi to ice water to stop the cooking process, then drain and reserve. Repeat with remaining batter.\nCombine gnocchi and mushroom sauce in a saucepan and cook until heated through, 2 to 5 minutes.\n",
        "picture_link": "Jo01j0oCjJq9Nk9UfBfrlllA8GkF7I6"
    },
    {
        "title": "Jalapeno-Bacon-Stuffed Pretzel Dippers",
        "ingredients": [
            "3/4 cup warm water ADVERTISEMENT",
            "3 tablespoons unsalted butter, melted ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1 package active dry yeast ADVERTISEMENT",
            "2 1/4 cups bread flour, or more as needed ADVERTISEMENT",
            "1 1/4 teaspoons kosher salt (such as Diamond Crystal®) ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "6 ounces cream cheese, softened ADVERTISEMENT",
            "1/2 cup shredded mozzarella cheese ADVERTISEMENT",
            "5 slices extra-crispy cooked bacon, crumbled ADVERTISEMENT",
            "1 jalapeno pepper, diced ADVERTISEMENT",
            "10 cups water ADVERTISEMENT",
            "3/4 cup baking soda ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "kosher salt (such as Diamond Crystal®) to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water, butter, honey, and yeast in the bowl of a stand mixer; let stand until yeast activates and foams, about 5 minutes.\nMix flour and 1 1/4 teaspoon salt into yeast mixture on low speed until dough is just combined. Increase the speed to medium and continue kneading until the dough is smooth and begins to pull away from the side of the bowl. Add additional flour if needed, a little a time, until the dough is no longer sticky.\nSpray inside of a bowl with cooking spray, place dough in bowl, and turn to coat. Cover bowl with a towel or plastic wrap and place in a warm place until dough doubles in size, about 1 hour.\nMix cream cheese, mozzarella, bacon, and jalapeno pepper together into a separate bowl.\nPreheat oven to 425 degrees F (220 degrees C). Line a baking sheet with parchment paper or a silicon mat.\nBring water to a boil in a large pot; slowly add baking soda, about 1 tablespoon at a time.\nDivide dough into 4 equal pieces on a floured work surface. Roll each piece into a long rope and cut into 1-inch pieces. Roll each piece flat using a rolling pin and fill with a spoonful of cheese mixture; fold dough over filling and pinch ends. Repeat filling the dough until all dough and filling are used.\nBoil the pretzel dippers in the water solution, working in batches, about 30 seconds per batch. Remove dippers with a large-slotted spoon and place on the prepared baking sheet, keeping dippers about 2-inches apart. Beat egg and cold water together in a bowl until smooth; brush over each dipper. Sprinkle kosher salt over each dipper.\nBake in the preheated oven until dippers are golden brown, 15 to 18 minutes. Cool dippers on the baking sheet for 5 minutes.\n",
        "picture_link": "zOinmqmXmRYP34Fcpf9NLWkZtlaf.8i"
    },
    {
        "title": "Easy Shrimp and Veggie Pasta Fresca",
        "ingredients": [
            "3 tablespoons soybean oil (often labeled \"vegetable oil\") ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "1 pound shrimp (30 to 35 per lb.), peeled and deveined ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes ADVERTISEMENT",
            "1 lemon, juiced and zested ADVERTISEMENT",
            "1 (8 ounce) package farfalle or bow-tie pasta, cooked according to package directions ADVERTISEMENT",
            "1 cup cherry tomatoes, halved ADVERTISEMENT",
            "3/4 cup shelled edamame, thawed ADVERTISEMENT",
            "1 carrot, cut into matchstick-size pieces ADVERTISEMENT",
            "1 red bell pepper, cut into 1-inch squares ADVERTISEMENT",
            "1/4 teaspoon sea salt ADVERTISEMENT",
            "1/4 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1 tablespoon Italian parsley, chopped ADVERTISEMENT",
            "2 tablespoons shredded Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat soybean oil in large skillet over medium high heat.\nAdd garlic and cook for 2 minutes, stirring occasionally.\nAdd shrimp, lemon juice and red pepper flakes. Cook for 2 to 3 minutes, stirring frequently, until shrimp is pink and cooked through.\nAdd carrots, edamame, bell peppers and tomatoes. Cook, stirring frequently, until the carrots are tender.\nAdd pasta, salt, pepper, cheese, parsley and lemon zest. Cook, tossing gently, until thoroughly heated.\nTop with Parmesan cheese, if desired.\n",
        "picture_link": "IyBcaIMlYchrdxu2sc.OR9mwG5vp0Oq"
    },
    {
        "title": "Mexican Gravy",
        "ingredients": [
            "1/2 cup flour ADVERTISEMENT",
            "2 tablespoons chili powder ADVERTISEMENT",
            "2 teaspoons onion powder ADVERTISEMENT",
            "1 teaspoon dried Mexican oregano ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "6 tablespoons vegetable oil ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix flour, chili powder, onion powder, oregano, and salt together in a small bowl.\nHeat oil in a large saucepan over low heat. Whisk flour mixture into hot oil until smooth. Pour water into mixture in small amounts and whisk to incorporate smoothly between additions. Bring the gravy to a simmer for 5 minutes. Remove from heat and cool 10 minutes.\n",
        "picture_link": "azo6.TIt0graYyhGSM0WiioFcs1f85m"
    },
    {
        "title": "Caesar Potato Salad",
        "ingredients": [
            "8 slices bacon ADVERTISEMENT",
            "24 baby red potatoes ADVERTISEMENT",
            "2 tablespoons olive oil, or as needed ADVERTISEMENT",
            "cracked black pepper to taste ADVERTISEMENT",
            "1/3 cup Caesar salad dressing ADVERTISEMENT",
            "4 green onions, diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nPlace bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on paper towels and crumble.\nPlace potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until slightly tender, about 8 minutes. Drain and transfer potatoes to a baking dish. Drizzle olive oil over potatoes and season with black pepper.\nBake in the preheated oven until tender, about 10 minutes.\nMix potatoes, bacon bits, Caesar salad dressing, and green onions together in a bowl. Serve warm.\n",
        "picture_link": "cjHLjm1z2kstkrSPKOa5Fnhu.EZlDvW"
    },
    {
        "title": "Kale Salad with Sprouts and Seeds",
        "ingredients": [
            "1/2 cup liquid amino acid (such as Bragg®) ADVERTISEMENT",
            "1/2 cup lemon juice ADVERTISEMENT",
            "1/2 cup extra-virgin olive oil ADVERTISEMENT",
            "1 red onion, halved and sliced ADVERTISEMENT",
            "1 cup alfalfa sprouts ADVERTISEMENT",
            "5 bunches kale - stems removed and discarded, leaves torn into bite-size pieces ADVERTISEMENT",
            "1/3 cup sunflower kernels ADVERTISEMENT",
            "1/3 cup hulled pepitas ADVERTISEMENT",
            "1/4 cup sesame seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk liquid amino acid, lemon juice, and olive oil together in a bowl until smooth; add red onion and alfalfa sprouts and stir to coat. Marinate onion and sprouts in the dressing for at least 15 minutes.\nPut kale into a large mixing bowl. Sprinkle sunflower kernels, pepitas, and sesame seeds over the kale. Pour the onion and sprout mixture with the dressing over the kale and seeds; mix together by hand to coat kale, massaging dressing into the leaves to soften.\nCover bowl with plastic wrap and refrigerate salad at least 1 hour.\n",
        "picture_link": "KV9ddINore5I9j7CuELTC2.5tlWH0dG"
    },
    {
        "title": "Soupier Mac and Cheese",
        "ingredients": [
            "3 cups elbow macaroni ADVERTISEMENT",
            "1 (10.75 ounce) can cream of mushroom soup ADVERTISEMENT",
            "2 cups shredded Cheddar cheese, divided ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 teaspoon prepared mustard ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "1 cup French-fried onions ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nBring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until cooked through but firm to the bite, 8 minutes; drain.\nStir cream of mushroom soup, 1 1/2 cups Cheddar cheese, milk, mustard, and pepper together in a large bowl; add macaroni and stir to coat. Pour macaroni mixture into a baking dish.\nBake in preheated oven for 25 minutes, top with remaining Cheddar cheese and French-fried onions, and continue baking until the cheese on top is melted completely, about 5 minutes more.\n",
        "picture_link": "AzRAEmMbMkAQF9oHhtGkeniTp9jfx.."
    },
    {
        "title": "Hunter's Beet Chips",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "5 large beets, peeled and thinly sliced ADVERTISEMENT",
            "1 tablespoon olive oil, or as needed ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Spray a baking sheet with cooking spray.\nSpread beets out in a single layer on the prepared baking sheet. Brush beets on both sides with olive oil and season with salt and pepper.\nBake in the preheated oven for 15 minutes. Turn beets and continue cooking until crisp, another 15 to 20 minutes. Transfer chips to a wire rack to cool.\n",
        "picture_link": "j9T1LZ7pTGOo7kLYnM2YyhJY5h/hARi"
    },
    {
        "title": "Toasted Coconut Granola Bars",
        "ingredients": [
            "3 cups old-fashioned oats ADVERTISEMENT",
            "1 cup shredded coconut ADVERTISEMENT",
            "1 cup almonds ADVERTISEMENT",
            "1 cup whole wheat flour ADVERTISEMENT",
            "1 cup raisins, or more to taste ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/3 cup wheat germ ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "3/4 cup canola oil ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "4 teaspoons pure vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSpread oats, coconut, and almonds onto a baking sheet; toast in preheated oven until lightly browned, about 15 minutes.\nMix toasted oats mixture with flour, raisins, brown sugar, wheat germ, cinnamon, and salt together in a large bowl; add eggs, canola oil, honey, and vanilla extract and mix into a sticky mixture.\nGenerously grease a baking sheet. Spread the mixture into the baking sheet in an even layer, reaching completely to the edges.\nBake in preheated oven until golden, about 30 minutes; carefully cut into bars immediately upon removal from oven.\nLet bars cool completely until hard before removing from sheet, at least 30 minutes.\n",
        "picture_link": "E2bN4xm3fBeJ8A0HHGVwzDBMrrmG7k6"
    },
    {
        "title": "Matcha Smoothie",
        "ingredients": [
            "1 cup ice cubes, or as desired ADVERTISEMENT",
            "1 cup orange juice ADVERTISEMENT",
            "1 ripe banana ADVERTISEMENT",
            "1/2 teaspoon matcha green tea powder, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend ice cubes, orange juice, banana, and matcha powder together in a blender until smooth.\n",
        "picture_link": "7rfKLLvJJ.XX/9PR.JCiceEs5wXzQFG"
    },
    {
        "title": "PeepSmoothies",
        "ingredients": [
            "8 cubes ice cubes ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "6 fluid ounces frozen lemonade concentrate ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "3 yellow marshmallow chicks (such as Peeps®) ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend ice cubes, milk, lemonade, water, marshmallow chicks, and vanilla extract in a blender until smooth.\n",
        "picture_link": "6PJe1YK02KEo5oXEmIFwY8Q6vKJ3JBu"
    },
    {
        "title": "Baked Ham with Glaze",
        "ingredients": [
            "1 (6 pound) bone-in whole ham ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "3 tablespoons ginger ale ADVERTISEMENT",
            "2 tablespoons dry mustard ADVERTISEMENT",
            "1/8 teaspoon ground cinnamon, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Place ham in a large baking dish.\nBake in the preheated oven for 45 minutes. Whisk brown sugar, ginger ale, mustard, and cinnamon together in a bowl; brush over ham. Continue baking ham until the meat pulls away easily from the bone, about 45 more minutes. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C).\n",
        "picture_link": "RtPyTYK7vAqJ6pXFx1wd8iYmWcu7/Mm"
    },
    {
        "title": "Tangy Tomato Tuna Casserole",
        "ingredients": [
            "1 (8 ounce) package elbow macaroni ADVERTISEMENT",
            "2 (8 ounce) cans tomato sauce ADVERTISEMENT",
            "2 (7 ounce) cans tuna, drained ADVERTISEMENT",
            "1 (8 ounce) container cottage cheese ADVERTISEMENT",
            "1 onion, minced ADVERTISEMENT",
            "1 (4 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/4 cup sour cream ADVERTISEMENT",
            "1 teaspoon salt (optional) ADVERTISEMENT",
            "1/2 cup bread crumbs ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until cooked through but firm to the bite, 8 minutes. Drain.\nPreheat oven to 350 degrees F (175 degrees C). Butter a 2 1/2-quart casserole dish.\nMix macaroni, tomato sauce, tuna, cottage cheese, onion, cream cheese, sour cream, and salt together in the prepared casserole dish. Stir bread crumbs and butter together in a bowl; spread over tuna mixture.\nBake in the preheated oven until casserole is cooked through and bubbling, 35 to 40 minutes.\n",
        "picture_link": "t0twgqEynOa.IZoOrJ54EEahPhsbj5i"
    },
    {
        "title": "Creamy and Crunchy Tuna Salad Supreme",
        "ingredients": [
            "2 tablespoons mayonnaise ADVERTISEMENT",
            "2 ounces cream cheese, softened, or as needed ADVERTISEMENT",
            "2 (5 ounce) cans solid white tuna packed in water, drained and flaked ADVERTISEMENT",
            "1/2 carrot, finely chopped ADVERTISEMENT",
            "1/4 cup diced red bell pepper ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir mayonnaise and cream cheese together in a bowl until smooth. Add tuna, carrot, and red pepper; season with pepper.\n",
        "picture_link": "ujBMyYMVdBIe51DNSRWGQazY6KenQWG"
    },
    {
        "title": "Quick Cucumber Salad",
        "ingredients": [
            "2 cups thinly sliced and peeled cucumber ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1/4 cup white balsamic vinegar ADVERTISEMENT",
            "2 tablespoons olive oil (optional) ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/2 teaspoon dried dill weed ADVERTISEMENT",
            "2 tomatoes, chopped, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread cucumber slices in a thin layer on a large platter. Sprinkle salt generously over the cucumber. Let salt soak into cucumber slices for about 30 minutes.\nTransfer cucumber to a colander and rinse with cold water; drain thoroughly and transfer to a dry surface. Pat cucumbers dry with paper towel.\nWhisk vinegar, olive oil, sugar, and dill together in a large bowl. Add cucumber slices and tomatoes; toss to coat.\n",
        "picture_link": "3I9crF2p1KkZfBOLR5sVbm04N9gb7X6"
    },
    {
        "title": "Jalapeno Lentil Burgers",
        "ingredients": [
            "1 1/2 cups water ADVERTISEMENT",
            "3/4 cup dry lentils ADVERTISEMENT",
            "1/2 cup grated carrots ADVERTISEMENT",
            "1/3 cup finely chopped onion ADVERTISEMENT",
            "1/2 jalapeno pepper, finely chopped ADVERTISEMENT",
            "2 cloves garlic, finely chopped ADVERTISEMENT",
            "1 1/2 cups panko bread crumbs ADVERTISEMENT",
            "3 eggs, lightly beaten ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 teaspoon salt (optional) ADVERTISEMENT",
            "1/2 teaspoon Italian seasoning ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water and lentils in a saucepan; bring to a boil. Reduce heat, cover saucepan, and simmer for 15 minutes. Add carrots, onion, jalapeno pepper, and garlic to lentils; cook until lentils are tender, about 15 minutes more. Remove saucepan from heat and slightly cool lentil mixture.\nPreheat oven to 400 degrees F (200 degrees C). Grease an oven-proof wire rack.\nMix bread crumbs, eggs, olive oil, salt, and Italian seasoning in a bowl; add lentil mixture and stir until well combined. Form mixture into 6 to 8 patties and place on the prepared wire rack; refrigerate for 15 minutes.\nPlace wire rack with patties onto a baking sheet.\nBake in the preheated oven until burgers are firm, about 20 minutes.\n",
        "picture_link": "6Qs5h4fNs1V1vtze6viZXaG4LPllUz2"
    },
    {
        "title": "Comforting Carbonara Bubble Up",
        "ingredients": [
            "2 (10 ounce) containers jumbo refrigerated biscuits ADVERTISEMENT",
            "1 (16 ounce) jar Ragu® Cheesy! Classic Alfredo Sauce ADVERTISEMENT",
            "1/4 cup chopped onions ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "8 slices bacon, diced, cooked until crisp, drained ADVERTISEMENT",
            "1 cup mozzarella cheese, shredded ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 cup grated Parmigiano-Reggiano cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees. Spray a 9 in x 13 in glass baking dish with non-stick cooking spray.\nCut each biscuit into 6 pieces and place in a large mixing bowl. Toss together biscuit pieces with Ragu(R) Classic Alfredo sauce, onions, garlic, bacon, mozzarella cheese, and black pepper.\nPour biscuit mixture evenly into the pan and top with Parmigiano-Reggiano cheese. Bake for 25 to 35 minutes or until biscuits are done. Make sure the biscuits in the middle are cooked through.\n",
        "picture_link": "VqUuxxAvBwi.dQS7J8nUbm0taR30TVa"
    },
    {
        "title": "Vegetarian 15-Bean Soup",
        "ingredients": [
            "1 (20 ounce) package 15-bean soup mix (seasoning packet not used) ADVERTISEMENT",
            "2 tablespoons olive oil, or more as needed ADVERTISEMENT",
            "1 large onion, diced ADVERTISEMENT",
            "12 carrots, peeled and chopped, or more to taste ADVERTISEMENT",
            "15 crimini mushrooms, sliced, or more to taste ADVERTISEMENT",
            "7 stalks celery, chopped, or more to taste ADVERTISEMENT",
            "6 leaves dinosaur kale, chopped ADVERTISEMENT",
            "4 leaves red Swiss chard, chopped ADVERTISEMENT",
            "3 large cloves garlic, minced ADVERTISEMENT",
            "12 cups vegetable broth ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "1 teaspoon dried rosemary ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place beans in a large container and cover with several inches of cool water; let stand 8 hours to overnight. Drain and rinse.\nHeat olive oil in a stockpot over medium heat; cook and stir onion until golden brown, 15 to 20 minutes. Add carrots, mushrooms, celery, kale, chard, and garlic; cook and stir until carrots and mushrooms are slightly tender, 5 to 10 minutes.\nPour broth over vegetable mixture and bring to a boil; reduce heat and add bay leaves, rosemary, basil, salt, and pepper. Add beans and simmer soup until beans are softened, 1 1/2 to 2 hours.\n",
        "picture_link": "Ontps6nJgPaFyaE5efN8mI.57snhqCm"
    },
    {
        "title": "Asian-Style Chicken Noodle Soup",
        "ingredients": [
            "32 ounces chicken broth ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "1 tablespoon fish sauce ADVERTISEMENT",
            "1 tablespoon shrimp bouillon ADVERTISEMENT",
            "1 teaspoon soy sauce ADVERTISEMENT",
            "1 teaspoon chicken bouillon ADVERTISEMENT",
            "1/2 teaspoon Chinese five-spice powder ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "6 carrots, diced ADVERTISEMENT",
            "6 stalks celery, diced ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3 ounces spaghetti ADVERTISEMENT",
            "1 pound shrimp (31-40 per pound), peeled and deveined ADVERTISEMENT",
            "4 cups fresh spinach, chopped ADVERTISEMENT",
            "1/4 cup dry white wine ADVERTISEMENT",
            "2 teaspoons minced fresh ginger root ADVERTISEMENT",
            "2 teaspoons chopped lemongrass ADVERTISEMENT",
            "1 tablespoon sesame oil ADVERTISEMENT",
            "1 pinch ground black pepper, or to taste ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir chicken stock, water, bay leaves, fish sauce, shrimp bouillon, soy sauce, chicken bouillon, Chinese five-spice powder, garlic powder, and onion powder together in a stockpot; bring to a boil and reduce heat to medium. Add carrots, celery, red bell pepper, and onion; bring stock to a simmer and cook until the vegetables begin to soften, about 5 minutes.\nAdd spaghetti to the stockpot; cook until tender yet firm to the bite, about 5 minutes.\nReduce heat to medium-low. Add shrimp, spinach, white wine, ginger, lemongrass, sesame oil, black pepper, and cayenne pepper; stir. Turn heat below stockpot off and let soup sit as the residual heat cooks the shrimp until they are firm and the vegetables are tender, about 30 minutes more.\n",
        "picture_link": "SupkXAm1BVobgONOk9PzOuRVEJs0kBq"
    },
    {
        "title": "Company's Coming Pie",
        "ingredients": [
            "1 1/2 cups crushed chocolate sandwich cookies ADVERTISEMENT",
            "1/3 cup butter, melted ADVERTISEMENT",
            "1 1/2 tablespoons instant coffee powder ADVERTISEMENT",
            "2 cups cold milk ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "1 (3 ounce) package cream cheese ADVERTISEMENT",
            "6 3/4 ounces instant chocolate fudge pudding mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine cookie crumbs and melted butter or margarine. Press in the bottom and up the sides of a 9 inch pie pan. Chill.\nMix pudding according to directions on the package using 2 cups of milk. Blend in cream cheese and coffee. Fold in nondairy whipped topping. Pour filling into cookie crust. Chill 2 to 4 hours prior to serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Upside Down Cookies",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "4 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon cream of tartar ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "2/3 cup milk ADVERTISEMENT",
            "1/4 cup packed brown sugar ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "3 teaspoons ground cinnamon ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease a muffin pan.\nIn a medium bowl, stir together flour, sugar, baking powder, and cream of tartar. Cut in shortening until mixture resembles coarse crumbs. Sprinkle on the milk, and stir to mix. Place dough on a floured surface and knead for about ten strokes. Too much kneading will toughen up the dough. Divide the dough in half.\nIn a small bowl, mix together the brown sugar and cinnamon. On a floured surface, roll out 1/2 of the dough at a time to a 12x10 inch rectangle. Brush with the melted butter, and sprinkle the cinnamon mixture evenly over the dough. Cut the rectangle into 5 strips 12 x 2 inches each. Stack the strips on top of one another, and cut the stack into 2 inch squares. Place the squares, layered side down, into the muffin cups. Bake in the preheated oven for 10 to 12 minutes.\nIn a small bowl, stir together the confectioners' sugar and milk until smooth. When cookies come out of the oven, drizzle the icing on.\n",
        "picture_link": "4.vH.LK0zCgKZcL4O8iKooYxnOnjriu"
    },
    {
        "title": "Chocolate Chip Monster Pops",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "2 egg ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 1/4 cups all-purpose flour ADVERTISEMENT",
            "3/4 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "15 popsicle sticks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C). Grease a large cookie sheet.\nIn a large bowl, cream the butter and sugar together. Add eggs and vanilla; mix until smooth. Sift together the flour, baking powder, and salt; stir into the creamed mixture until well blended. Mix in the chocolate chips.\nUsing a 1/3 cup measuring cup, drop cookies onto the cookie sheet. Be sure cookies are at least 2 inches apart. Insert a popsicle stick into each cookie, and bake for 25 to 30 minutes. Cool for 2 to 3 minutes before transferring to a wire rack to cool completely.\n",
        "picture_link": "aW5VWSeDrueBDMQFnZPoemRq3bEnjpm"
    },
    {
        "title": "Raspberry Chiffon Pie I",
        "ingredients": [
            "1 1/2 (.25 ounce) packages unflavored gelatin ADVERTISEMENT",
            "1/4 cup cold water ADVERTISEMENT",
            "4 egg yolks, beaten ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 cup fresh raspberries, crushed ADVERTISEMENT",
            "4 egg whites ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "3/4 cup heavy whipping cream, whipped ADVERTISEMENT",
            "1 (9 inch) vanilla wafer crust ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Soften gelatin in cold water.\nCombine egg yolks, 1/2 cup sugar, and lemon juice in a saucepan. Cook until mixture coats a spoon. Stir in gelatin, and then mix in crushed raspberries. Chill until partially set.\nBeat egg whites until stiff with 1/4 cup sugar and salt. Fold whipped cream and egg whites into raspberry mixture. Pour filling into chilled pie crust, and chill 3 to 4 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Avocado Lime Pie",
        "ingredients": [
            "1 cup sieved avocado pulp ADVERTISEMENT",
            "1 (14 ounce) can sweetened condensed milk ADVERTISEMENT",
            "1 teaspoon grated lime zest ADVERTISEMENT",
            "1/2 cup fresh lime juice ADVERTISEMENT",
            "2 egg yolks ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 recipe pastry for a 9 inch single crust pie ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine sweetened condensed milk, lime zest, lime juice, lightly beaten egg yolks, and salt; blend until mixture thickens. Stir in avocado pulp. Pour filling into pie shell.\nChill pie several hours. Garnish with whipped cream, and serve.\n",
        "picture_link": "M8J3b1HDFTsxCmb.OSzKgnwA.mFjh62"
    },
    {
        "title": "Spelt Noodles",
        "ingredients": [
            "1 cup white spelt flour ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "3 tablespoons water as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "(Preferred) Process all ingredients in a food processor until they form a ball that rides on the blades.\nYou can also let a bread machine knead the ingredients for about 5 minutes. (I've never tried this, but have heard it works well.)\nPasta can be rolled and cut in a regular (manual, hand-crank) pasta maker by passing it through repeatedly smaller (i.e., higher number) settings until nearly paper thin, and then run through the cutting blades. I am told it does not do so well in an automatic pasta maker.\n",
        "picture_link": "LjZYsvl5VyObi.iz4gkxT0yzZQoThV6"
    },
    {
        "title": "Pecos Pasta",
        "ingredients": [
            "4 ounces macaroni ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 (8.75 ounce) can whole kernel corn, drained ADVERTISEMENT",
            "1 (15 ounce) can chili with beans ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot of boiling salted water cook macaroni past until al dente. Drain well.\nMeanwhile, in a large skillet melt the butter or margarine and add chopped green bell pepper and chopped onion. Cook vegetables until tender. Add chili beans, corn, salt and pepper. Simmer on low heat for 5 minutes. Stir in cooked and drained macaroni. Cover and cook on low 5 minutes.\nServe warm.\n",
        "picture_link": "68gqYr14GWa/uh0vhUVXsxKXPyo7nQG"
    },
    {
        "title": "New Zealand Pavlova",
        "ingredients": [
            "3 egg whites ADVERTISEMENT",
            "1/3 cup super fine sugar ADVERTISEMENT",
            "1 teaspoon distilled white vinegar ADVERTISEMENT",
            "1 tablespoon boiling water ADVERTISEMENT",
            "2 cups heavy whipping cream ADVERTISEMENT",
            "1/4 cup confectioners' sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups sliced fresh fruit ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 475 degrees F (245 degrees C). Cover a baking sheet with foil, and spray lightly with cooking spray.\nIn a large bowl, beat the egg whites to form stiff peaks. Add white sugar slowly, and continue beating. When egg whites are very stiff, add vinegar and boiling water. Continue beating until glossy surface is beginning to fade, and mixture is very stiff. Pile meringue onto prepared baking sheet. Shape into a circle 1 1/2 inches thick. Form a slight dip in the center, and make the sides slightly higher.\nPlace meringue in the oven, shut the door, and turn the heat off. Leave in the oven for one hour. Check the texture of the meringue; it should be hard with no soft spots. If soft in the center, heat oven to 250 degrees F (120 degrees C). Place meringue back into the oven, and turn off the heat. Cool when done. Transfer onto a serving platter.\nWhip the cream until just stiff. Beat in vanilla and confectioners' sugar. Pile the whipped cream onto the meringue. Arrange the fruit on top of the whipped cream, and serve.\n",
        "picture_link": "r1ltVejI/CmolTM9PFxNxG38S4ofpU2"
    },
    {
        "title": "Ice Cream Pie Shell",
        "ingredients": [
            "1 cup peanut butter ADVERTISEMENT",
            "1 cup light corn syrup ADVERTISEMENT",
            "4 cups chocolate flavored cereal puffs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix peanut butter, corn syrup, and puffed cereal together. Pat into a 10 inch pie plate.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Garlic Oyster Linguini",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "8 ounces fresh mushrooms, quartered ADVERTISEMENT",
            "1 teaspoon Cajun seasoning ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "24 shucked oysters, quartered ADVERTISEMENT",
            "1/2 cup whole corn kernels, blanched ADVERTISEMENT",
            "2/3 cup French-style green beans, chopped ADVERTISEMENT",
            "2 tablespoons chopped pimento peppers ADVERTISEMENT",
            "1/2 cup seafood stock ADVERTISEMENT",
            "10 ounces fresh linguine pasta ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "3 tablespoons thinly sliced green onion ADVERTISEMENT",
            "4 ounces crabmeat ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small saucepan, melt 2 tablespoons butter or margarine. Stir in flour to make a paste. Set roux aside.\nSaute mushrooms, Cajun spice, and garlic in 1/4 cup butter or margarine over medium-high heat for 2 minutes. Add oysters, corn, string beans, and pimento. Saute for 1 1/2 minutes. Add stock and linguine, and bring to a slight simmer.\nFold in roux until sauce thickens, then reduce heat. Fold in parsley and scallions. Fold in lump crabmeat, and heat through. Serve immediately.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Scotch Broth I",
        "ingredients": [
            "2 pounds meaty beef soup bones ADVERTISEMENT",
            "2 quarts water ADVERTISEMENT",
            "6 whole black peppercorns ADVERTISEMENT",
            "1 cup chopped carrots ADVERTISEMENT",
            "1 cup turnips, chopped ADVERTISEMENT",
            "1 cup chopped celery ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1/4 cup pearl barley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large kettle, combine soup bones, water, and peppercorns. Cover and simmer for 1 1/2 hours or until the meat comes easily off the bones.\nRemove bones. Strain broth; chill.\nSkim off fat. Remove meat from bones; dice and return to broth along with carrots, turnips, celery, onion, and barley. Bring to a boil. Reduce heat; cover and simmer about 1 hour or until vegetables and barley are tender.\n",
        "picture_link": "haOeJY88JJxTA/b9U3WhuNfr3H6ETLS"
    },
    {
        "title": "Potato Chip Cookies V",
        "ingredients": [
            "3/4 cup butter ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "3/4 cup crushed potato chips ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl, cream butter and sugar until smooth. Stir in the egg yolk. Add the flour and nuts, mix until well blended. Stir in the potato chips last, so they don 't get too crunched up.\nRoll the dough into walnut sized balls. Place 2 inches apart on an unprepared cookie sheet. Bake for 10 to 12 minutes in the preheated oven. Remove from cookie sheet to cool on wire racks.\n",
        "picture_link": "ynyWNOp.8ZlNha7Metq4zovtAJzmgtC"
    },
    {
        "title": "Orange Drop Cookies III",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "1 cup shortening ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup sour milk ADVERTISEMENT",
            "1 tablespoon orange zest ADVERTISEMENT",
            "3 tablespoons fresh orange juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a medium bowl, cream together the sugar and shortening. Beat in eggs, one at a time. Combine the flour, baking powder, baking soda and salt, stir into the creamed mixture. Finally, stir in the milk, orange juice and orange zest. Drop by heaping spoonfuls onto an ungreased cookie sheet.\nBake for 8 to 10 minutes in the preheated oven, until the edges turn golden. Remove from baking sheet to cool on wire racks.\n",
        "picture_link": "H6NcEEYBvhlIA8zVr/uL4DS6mpgy9hi"
    },
    {
        "title": "Green Chili Stew",
        "ingredients": [
            "1 1/2 pounds pork neck bones ADVERTISEMENT",
            "2 (7 ounce) cans diced green chiles ADVERTISEMENT",
            "2 pounds potatoes, cubed ADVERTISEMENT",
            "28 ounces chopped stewed tomatoes ADVERTISEMENT",
            "1 large sweet onion, cubed ADVERTISEMENT",
            "3 stalks celery, chopped ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "2 tablespoons chili powder ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Place bones into a heavy roasting pan and add enough water to cover bottom of pan. Cover pan with a tight fitting lid and cook until browned. You may need to add more water while it is cooking so be sure to check.\nIn a large stock pot, combine browned boned, chilies, potatoes, tomatoes, onion, celery, cumin, chili pepper and liquid. Simmer for 5 to 6 hours.\nRemove bones from soup, remove any meat, and place meat back into soup. Once vegetables are tender, serve.\n",
        "picture_link": "jfUuEscfYjHVxpthIqVVgrpEf/Jt8uW"
    },
    {
        "title": "Frogmoor Stew",
        "ingredients": [
            "16 ounces kielbasa sausage ADVERTISEMENT",
            "1 (6 ounce) package dry crab boil ADVERTISEMENT",
            "6 cups water ADVERTISEMENT",
            "6 ears fresh corn ADVERTISEMENT",
            "3 pounds medium shrimp - peeled and deveined ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Slice kielbasa sausage into 1/2 inch pieces. Place bag of crab boil and sausage in water and boil for 30 minutes. Make sure water does not evaporate. Add more water while it is cooking to make sure ingredients are fully covered.\nAdd corn-on-the-cob and cook for 5 to 6 minutes and then add shrimp and boil for 3 minutes, stirring occasionally.\nDrain and serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Raisin Filled Spice Cookies",
        "ingredients": [
            "1/3 cup white sugar ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "1 1/2 teaspoons butter ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "2 1/4 cups sifted all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground allspice ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 tablespoon milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small saucepan, over medium heat, combine the 1/3 cup of sugar, water, raisins, butter and pinch of salt. Bring ingredients to a boil, and cook until thick, you should be able to see the bottom of the pan while stirring when finished. Remove from heat and set aside to cool.\nPreheat oven to 375 degrees F (190 degrees C).\nSift together the flour, cinnamon, allspice, cloves, salt and baking powder, set aside. In a medium bowl, cream shortening and sugar until smooth. Stir in the eggs and vanilla. Add dry ingredients, mix until blended, then finally stir in the milk.\nOn a lightly floured surface, roll the dough out to 1/4 to 1/8 inch thickness. Cut into 2 1/2 inch circles. Place a teaspoon of filling onto the center of half of the cookies. Cover with the other half of the cookies. Press the edges together with the tines of a fork. Sprinkle with sugar and bake on unprepared cookie sheets for 10 to 12 minutes in the preheated oven.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Babovka (Poppyseed Rings)",
        "ingredients": [
            "1/4 cup warm milk ADVERTISEMENT",
            "1 (.25 ounce) package active dry yeast ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/2 cup margarine ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1 pinch ground mace ADVERTISEMENT",
            "1 pinch ground ginger ADVERTISEMENT",
            "4 cups all-purpose flour ADVERTISEMENT",
            "42 ounces poppyseed filling ADVERTISEMENT",
            "2 tablespoons margarine, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place 1/4 cup milk in a small saucepan and warm over a low flame. NOTE: BE SURE THAT MILK IS WARM, NOT HOT, TO THE TOUCH. Add the yeast and l teaspoon sugar. Cover and let rise until creamy.\nHeat the 1 cup milk in a small saucepan until it bubbles, then remove from heat. Add butter or margarine and stir until melted; let cool. Add remaining sugar and salt and stir until dissolved; then add beaten eggs, yeast mixture, vanilla, mace and ginger and mix together. Add 3 l/2 to 4 cups flour and stir until smooth.\nPlace dough in a large lightly oiled bowl. Cover tightly with aluminum foil and set in the refrigerator overnight.\nPreheat oven to 375 degrees F (190 degrees C).\nTurn dough out onto a lightly floured surface and divide in half. Roll out on floured board like a jellyroll, large and oblong. Evenly spread one can of poppyseed filling over each piece of dough, then roll up each piece and pinch the ends together to form circle two circles. Place each ring in a lightly greased round cake pan with a hole in the center; press rings down to flatten. With kitchen shears, make about 22 cuts, each 3/4 inch deep. Twist each piece slightly so that the rolls fan out from the center of the pan. Brush or drizzle melted butter or margarine on top of the rolls, cover and let rise in a warm place for l l/2 hours, or until doubled in size.\nBake at 375 degrees F (190 degrees C) for 25 to 30 minutes or until golden.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Westcoast Style Clam Chowder",
        "ingredients": [
            "1/2 pound diced bacon ADVERTISEMENT",
            "2 small onion, chopped ADVERTISEMENT",
            "12 cups water ADVERTISEMENT",
            "3 carrots, chopped ADVERTISEMENT",
            "4 (6.5 ounce) cans minced clams ADVERTISEMENT",
            "2 1/4 cups clam juice ADVERTISEMENT",
            "4 potatoes, peeled and cubed ADVERTISEMENT",
            "1 teaspoon kosher salt ADVERTISEMENT",
            "2 (14.5 ounce) cans stewed tomatoes ADVERTISEMENT",
            "1 1/2 teaspoons ground black pepper ADVERTISEMENT",
            "4 large stalks celery, chopped ADVERTISEMENT",
            "1 cup ketchup ADVERTISEMENT",
            "4 cups whole milk ADVERTISEMENT",
            "1 1/2 cups dry potato flakes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In medium skillet lightly fry bacon over medium heat; drain off fat and discard. Add onions to bacon and saute approximately 3 minutes. Do not brown.\nIn a large stock pot add water and bring to boil. Once boiling add carrots, baby clams (including liquid), clam juice, potatoes, salt and pepper.\nUsing a food processor or blender, puree tomatoes. Add to stock pot along with bacon-onion mixture and bring to boil.\nReduce heat and simmer for 30 minutes or until carrots and potatoes are tender. Do not overcook.\nStir in celery and ketchup and cook for another 5 minutes.\nSlowly add milk, stirring constantly while bringing just to boiling.\nFinally, add instant potato flakes and cook for 3 minutes.\nAdjust seasoning to taste. If soup is not to your desired thickness add more instant potato flakes, about 2 tablespoons at a time.\nRemove soup from heat and let sit for about 15 minutes before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Popcorn Soup (Corn Chowder)",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 tablespoon dried parsley ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "2 quarts half-and-half cream ADVERTISEMENT",
            "2 (15.25 ounce) cans whole kernel corn ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Saute onion in butter with parsley flakes until onion is tender, about 8 minutes.\nSprinkle flour over mixture and stir (will be lumpy). Slowly stir in the half and half until smooth and creamy. Add corn and cook until slightly thickened, about 5 minutes.\nAdd salt and pepper to taste. To serve, ladle into bowls and garnish with popped corn.\n",
        "picture_link": "94jE8.T5fDUbKraigLsw22wzwdyZVf2"
    },
    {
        "title": "Pepper Pot Soup II",
        "ingredients": [
            "1 1/2 pounds round steak, cubed ADVERTISEMENT",
            "1 cup red wine ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "6 ounces spaghetti ADVERTISEMENT",
            "2 (14.5 ounce) cans stewed tomatoes ADVERTISEMENT",
            "1 onion, thinly sliced ADVERTISEMENT",
            "1 pinch white sugar ADVERTISEMENT",
            "1 (15 ounce) can kidney beans ADVERTISEMENT",
            "1 (10 ounce) package succotash ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Add cubed steak, red wine, and water to a large soup pot. Simmer, covered, over medium low heat for 1 hour.\nMeanwhile, cook pasta in a large pot of boiling water for 5 minutes. The pasta should be only partially cooked. Drain.\nAdd pasta, tomatoes, onion, and sugar to meat. Simmer for 30 minutes.\nStir beans, succotash, and green pepper into soup. Season with salt and pepper to taste. Simmer over low heat until soup is hot and vegetables are tender.\n",
        "picture_link": "bYgGmGjvYdOciTCAb5m3UrCFWEGDF1K"
    },
    {
        "title": "Holiday Fudge",
        "ingredients": [
            "1 (12 fluid ounce) can evaporated milk ADVERTISEMENT",
            "1 1/3 cups butter ADVERTISEMENT",
            "4 1/2 cups white sugar ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "2 (7 ounce) jars marshmallow creme ADVERTISEMENT",
            "12 ounces almond buttercrunch confection, chopped ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "1 pound chopped walnuts ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Lightly butter a 9x13 inch baking dish. Set aside.\nCombine milk, butter, sugar, and salt in a large heavy saucepan. Bring to a boil over medium-high heat. Then cook, stirring constantly, for 6 minutes.\nCombine marshmallow cream, candy bar, and chocolate chips in a large bowl. Pour hot sugar syrup over mixture, stir until chocolate is melted and well blended. Stir in walnuts and vanilla. Pour into prepared baking dish. Allow to cool before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Potato Soup II",
        "ingredients": [
            "2 (16 ounce) packages frozen hash brown potatoes, thawed ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "1 cup grated carrots ADVERTISEMENT",
            "1 cup chopped celery ADVERTISEMENT",
            "5 slices bacon, diced ADVERTISEMENT",
            "4 (14.5 ounce) cans chicken broth ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of celery soup ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "3 cups milk ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place hash browns, onions, carrots, celery, water, and chicken broth in large stock pot. Simmer for 30 minutes.\nStir in undiluted cream soups, milk, and bacon. Season with salt and pepper. Let simmer for another 30 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Italian Ricotta Cheese Pie",
        "ingredients": [
            "1 cup graham cracker crumbs ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 cup honey ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "4 cups ricotta cheese ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 tablespoons whole wheat flour ADVERTISEMENT",
            "2 teaspoons lemon zest, cut into thin slivers ADVERTISEMENT",
            "2 tablespoons blanched slivered almonds ADVERTISEMENT",
            "1 tablespoon shelled pumpkin seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small mixing bowl, combine graham cracker crumbs, butter and honey and mix well. Place in a 9 inch springform pan and spread evenly across the bottom. Refrigerate 30 minutes to chill.\nPreheat oven to 325 degrees F (165 degrees C).\nIn a large electric mixer bowl, combine ricotta and eggs (beat in one at a time until incorporated). Add tablespoon of honey, vanilla and flour. Beat until smooth. Fold in lemon peel and almonds. Pour mixture into chilled crust and scatter pumpkin seeds on top.\nBake for 1 hour or until just firm and lightly colored on top. Turn oven off, open door and leave pie inside to cool for 30 minutes.\nRemove pie from oven, refrigerate and chill for 2 hours to overnight before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Swiss Cheese Soup",
        "ingredients": [
            "6 cups chicken stock ADVERTISEMENT",
            "10 cloves garlic, crushed ADVERTISEMENT",
            "4 tablespoons unsalted butter ADVERTISEMENT",
            "4 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "2 1/2 cups shredded Swiss cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the stock in a large pot over high heat. Bring to a boil, stir in the garlic and reduce heat to low.\nIn separate skillet over medium heat, combine the butter and flour and stir well for a few minutes. Add the garlic and stock mixture along with the wine, stirring constantly. Bring to a boil to thicken.\nStir in the cheese and serve immediately. (Do NOT allow to boil once cheese has been added, and do not allow to sit long or the cheese will separate out.)\n",
        "picture_link": "/G5id7c4ANxk0Z.RwjA70ENU3KWj64O"
    },
    {
        "title": "Mexican Roll Ups",
        "ingredients": [
            "6 (12 inch) whole wheat tortillas ADVERTISEMENT",
            "6 leaves romaine lettuce ADVERTISEMENT",
            "1 1/4 pounds sliced roast beef ADVERTISEMENT",
            "1 cup chopped tomatoes ADVERTISEMENT",
            "1 cup chopped red bell pepper ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "3 tablespoons red wine vinegar ADVERTISEMENT",
            "2 tablespoons ground cumin ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "For each roll-up, tear off about a 15 inch piece of wax paper or aluminum foil. Place the tortilla on the paper or foil. Place a romaine lettuce leaf on top of the tortilla. Add about 3 ounces of beef on top of the lettuce for each tortilla. Divide the tomatoes, red and yellow bell peppers, oil, vinegar and cumin over each tortilla.\nBegin rolling the paper or foil over the tortilla to encase the filling. Roll until the sandwich is completely rolled up. To eat, peel back the paper or foil.\n",
        "picture_link": "vQ5TsV1RZxFhLqtPy4ZJEFfB6AYCV.G"
    },
    {
        "title": "Easter Brunch Casserole",
        "ingredients": [
            "1 pound bacon ADVERTISEMENT",
            "1 pound bulk pork sausage ADVERTISEMENT",
            "1/4 cup bacon drippings ADVERTISEMENT",
            "1 large sweet onion, chopped ADVERTISEMENT",
            "1/4 cup chopped garlic ADVERTISEMENT",
            "2 (4.5 ounce) cans diced green chile peppers, divided ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "2 dashes liquid smoke flavoring ADVERTISEMENT",
            "1/2 teaspoon hot pepper sauce (such as Cholula®) ADVERTISEMENT",
            "1/2 teaspoon seasoned salt (such as LAWRY'S®) ADVERTISEMENT",
            "1/8 teaspoon white pepper ADVERTISEMENT",
            "1 tablespoon dried parsley ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "3 pounds frozen hash brown potatoes, thawed ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "1 cup shredded pepper Jack cheese ADVERTISEMENT",
            "1 cup shredded Monterey Jack cheese ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 (4 ounce) can chopped black olives ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate. Place sausage into the bacon grease, and cook until crumbly and brown, about 10 minutes. Place the sausage on the plate with the bacon, and pour off all but 1/4 cup of the bacon drippings.\nReduce heat to medium, and stir in the onion, garlic, and one can of green chiles. Cook and stir until the onion has softened and turned translucent, about 10 minutes. Meanwhile, beat the eggs in a large mixing bowl with the liquid smoke, hot pepper sauce, seasoned salt, white pepper, parsley, and basil until smooth. Crumble the bacon, and stir bacon and sausage into the eggs with the remaining can of green chiles, hash browns, and cooked onions. Season to taste with salt and black pepper, and stir until evenly mixed.\nPrepare a 9x13-inch baking dish with cooking spray. Scoop the hash brown mixture into the prepared dish, and smooth the top. Cover with aluminum foil, and refrigerate overnight.\nPreheat an oven to 400 degrees F (200 degrees C).\nBake the covered dish in the preheated oven for 1 hour.\nRemove the casserole from the oven, uncover, and sprinkle evenly with pepper Jack and Monterey Jack cheeses. Sprinkle the Cheddar cheese in the shape of a cross, and outline with the black olives. Return to the oven, and bake until the cheese is hot and bubbly, 20 to 30 minutes more.\n",
        "picture_link": "JByXZPb6IxWdetAVqMI2Iq8t.gqfj7K"
    },
    {
        "title": "Carne con Chile",
        "ingredients": [
            "20 fresh tomatillos, husks removed ADVERTISEMENT",
            "2 large tomatoes, chopped ADVERTISEMENT",
            "7 serrano chile peppers, chopped (wear gloves) ADVERTISEMENT",
            "10 fresh chile de arbol peppers, chopped (wear gloves) ADVERTISEMENT",
            "5 cloves garlic, divided ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "2 pounds pork stew meat, coarsely chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the tomatillos, tomatoes, serrano peppers, chile de arbol peppers, and 3 whole garlic cloves into a saucepan over medium-low heat, and cool until the mixture is juicy and the peppers are tender, about 10 minutes. Remove and discard the garlic cloves. Pour the mixture into a blender, and blend until smooth, about 1 minute; set sauce aside. Mince 1 clove of garlic, or amount to taste, and mix into the sauce; season to taste with salt.\nMince 1 more clove of garlic, and place into a skillet with the pork over medium heat. Cook covered until the pork is no longer pink and the juices run clear, stirring often, about 30 minutes. Pour the blended sauce over the meat, and reduce heat to a simmer; cook, stirring often, until the pork is tender, 5 to 10 more minutes.\n",
        "picture_link": "6GJ0QDdrCMWE8LJLHSo1v6H8bWjYZam"
    },
    {
        "title": "Shrimp and White Bean Salad",
        "ingredients": [
            "1 (16 ounce) package frozen cooked shrimp, thawed and tails removed ADVERTISEMENT",
            "1 (14 ounce) can cannellini beans, drained and rinsed ADVERTISEMENT",
            "1 cup cherry tomatoes, coarsely chopped ADVERTISEMENT",
            "1/2 cup diced red onion ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 tablespoons red wine vinegar ADVERTISEMENT",
            "1 tablespoon Italian seasoning ADVERTISEMENT",
            "1 teaspoon garlic salt ADVERTISEMENT",
            "6 cups salad greens ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Toss the shrimp, cannellini beans, cherry tomatoes, and diced red onion together in a bowl.\nWhisk the olive oil, red wine vinegar, Italian seasoning, and garlic salt together in a small bowl until well blended; drizzle over the shrimp mixture and toss to coat. Cover the bowl with plastic wrap and chill in refrigerator 4 hours to overnight.\nPut the salad greens in a salad bowl, and top with the chilled shrimp mixture to serve.\n",
        "picture_link": "qRHTZhWEYyIfscX55acRbp78KmOZTAm"
    },
    {
        "title": "Chicken a la Queen",
        "ingredients": [
            "1 (10 ounce) can large refrigerated flaky biscuits ADVERTISEMENT",
            "1 (3 pound) rotisserie-roasted chicken ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 cup shredded carrots ADVERTISEMENT",
            "1 cup fresh mushrooms ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 red bell pepper, sliced into thin strips ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "4 cups chicken broth ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "1/2 pound fresh asparagus, trimmed and cut into 1 inch pieces ADVERTISEMENT",
            "1 cup frozen petite peas, thawed ADVERTISEMENT",
            "1 tablespoon chopped fresh tarragon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Place the biscuits 1 to 2 inches apart on an ungreased baking sheet.\nBake in the preheated oven until the biscuits are golden brown, 13 to 17 minutes. Remove biscuits to cool, and set aside. Cut meat from the rotisserie chicken into bite-size pieces, and set aside.\nHeat the olive oil in a skillet over medium heat. Stir in the onion, carrots, mushrooms, salt, and black pepper. Cook and stir until the onion has softened, the carrots are tender, and the mushrooms have released their liquid, about 7 minutes. Stir in the red bell pepper and cook for 2 more minutes. Remove from heat and set aside.\nMelt the butter in a saucepan over medium heat. Whisk in the flour to form a thick paste. Continue cooking, whisking constantly, until the flour has lost its raw smell, about 5 minutes. Whisk in the white wine, increase the heat to medium-high, and simmer for 1 minute. Whisk in the chicken broth and whipping cream and bring the sauce to a boil. Reduce the heat, stir in the shredded chicken, and simmer for 7 minutes.\nPour the chicken mixture into the skillet containing the vegetables and adjust the heat to medium. Add the asparagus and cook until the asparagus pieces are tender, about 4 minutes. Stir in the peas and tarragon and mix well.\nPlace a split biscuit on each plate and pour the chicken mixture over the biscuits.\n",
        "picture_link": "19TsUUoL6CxDxW4XGGl2JOZLhT4qw9i"
    },
    {
        "title": "Serano Chocolate Cake",
        "ingredients": [
            "For the Cake: ADVERTISEMENT",
            "1 cup self-rising flour ADVERTISEMENT",
            "1/2 cup unsweetened cocoa powder ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "For the Simple Syrup: ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "Italian Meringue-Chocolate Cream Filling: ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "7/8 cup white sugar ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "6 ounces bittersweet chocolate, chopped ADVERTISEMENT",
            "1 3/4 cups heavy cream, chilled ADVERTISEMENT",
            "1/3 cup heavy cream at room temperature ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Grease and flour a 9-inch cake pan or line it with parchment paper.\nSift the flour and cocoa powder together and set aside. Combine the eggs and 3/4 cup sugar in a mixing bowl and beat until very thick, about three minutes. Use a spatula to carefully fold in the flour mixture. Gently scoop the batter into the prepared pan and bake until the top springs back when lightly pressed and a toothpick inserted in the center comes out clean, 25 to 30 minutes. Cool the cake in the pan for 10 minutes before removing to cool completely on a wire rack.\nTo make the simple syrup, bring 1/2 cup water and 3/4 cup sugar to a boil in a saucepan over medium-high heat. Remove the pan from the heat and set aside.\nTo make the Italian meringue, combine 1/4 cup water with the 7/8 cup of sugar in a saucepan. Bring the mixture to a boil, stirring to dissolve the sugar (don't stir once the mixture begins to boil). Use a candy thermometer and bring the sugar to the soft ball stage (240 degrees F/115 degrees C). While the sugar is boiling, beat the egg whites with an electric mixer on medium-low speed until soft peaks form.\nWhen the boiling sugar syrup has nearly reached soft ball stage, increase the mixing speed for the egg whites to high. Carefully pour the hot sugar syrup into the egg whites between the beaters and the side of the bowl. Continue beating on high speed until the meringue has cooled to room temperature.\nMelt the bittersweet chocolate in the top of a double boiler over just-barely simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching, just until melted. Remove from heat and allow to cool until the chocolate is room temperature but still fluid.\nWhip the 1 3/4 cups cream until medium-stiff peaks form.\nUse a rubber spatula to fold the melted chocolate into the egg white meringue. Add 1/3 cup of room-temperature cream and mix gently until blended. Fold 1/3 of the whipped cream into the chocolate meringue mixture to lighten it; then gently fold in the remaining 2/3 of the whipped cream.\nTo assemble the cake, split the sponge cake into two layers. Set one cake layer on a turntable or plate. Brush the cake well with the simple syrup. The cake will literally act as a sponge and absorb the syrup, which will keep it from being dry. Spread 1/3 of the chocolate cream on the cake, and top it with the second cake layer. Repeat with the syrup and the cream. Spread the remaining chocolate cream on the sides of the cake. Refrigerate until serving.\n",
        "picture_link": "lnNSLOMD1L1nmg46gG/wp0bUPTa0J3W"
    },
    {
        "title": "Passover Iced Lemon Loaf",
        "ingredients": [
            "1 1/2 cups matzo cake flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 tablespoons margarine, softened ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon lemon extract ADVERTISEMENT",
            "1/3 cup lemon juice ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1 drop yellow food coloring, or as desired (optional) ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "1 teaspoon powdered non-dairy creamer ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1 tablespoon confectioners' sugar ADVERTISEMENT",
            "1/2 teaspoon lemon extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x5-inch loaf pan.\nWhisk together the matzo flour, baking soda, baking powder (see Note), and salt in a large mixing bowl.\nIn a separate bowl, beat the eggs, white sugar, margarine, vanilla extract, 1 teaspoon of lemon extract, lemon juice, vegetable oil, and food coloring with an electric mixer set on medium speed until smooth; pour the wet ingredients into the flour mixture. Stir until combined into a smooth batter, and pour into the prepared loaf pan.\nBake in the preheated oven until set and lightly browned, about 45 minutes. A toothpick inserted in the center of the loaf will come out clean. Cool completely, then remove from the pan.\nPlace 1 cup of confectioners' sugar in a bowl. In a separate small bowl, mix the non-dairy creamer with water, and stir in 1 tablespoon of confectioners' sugar. Stir the creamer mixture into the confectioners' sugar by teaspoons until the mixture forms an even, workable glaze. Mix in 1/2 teaspoon of lemon extract. Spread the glaze over the cooled lemon loaf. Allow to set, and serve in 1-inch slices.\n",
        "picture_link": "TiQwzvjFNG5OGaO.mBFPgjHNwRPF9IW"
    },
    {
        "title": "Cascadia Fideua",
        "ingredients": [
            "3 cups chicken stock, or more if needed ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 pinch saffron ADVERTISEMENT",
            "1 cup pancetta bacon, diced ADVERTISEMENT",
            "2 tablespoons olive oil, divided ADVERTISEMENT",
            "1/2 cup diced carrots ADVERTISEMENT",
            "1/2 cup frozen artichoke hearts, thawed ADVERTISEMENT",
            "1/2 cup fresh green beans ADVERTISEMENT",
            "2 cups diced white onion ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "2 cups diced tomatoes ADVERTISEMENT",
            "1 (16 ounce) package spaghetti, broken into 2-inch pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the chicken stock, garlic, and saffron in a saucepan. Warm until hot, but not too hot to put your finger in. Cover, and keep warm over low heat so the saffron can infuse while you continue with the recipe.\nCook and stir the diced pancetta in a cast iron skillet over medium heat until most of the fat has rendered out and the pancetta has cooked to your desired degree of doneness, about 10 minutes. Once done, remove the pancetta and set aside.\nDiscard the grease and pour in 1 tablespoon of olive oil. Cook and stir the carrots, artichoke hearts, and green beans until the vegetables begin to soften, then remove from the pan and set aside. Heat the remaining 1 tablespoon of olive oil in the skillet, and stir in the onion. Season with salt and pepper, and cook until the onion has softened, about 10 minutes. Add the tomatoes, and cook until the tomato-onion mixture is practically a paste, 15 to 20 minutes.\nSpread the onion mixture evenly over the bottom of the skillet, and sprinkle evenly with the broken spaghetti pieces. Pour in enough saffron broth to cover the noodles, then arrange the pancetta and cooked vegetables over top. Add additional saffron broth as needed to cover the vegetables. Bring to a simmer, then reduce heat to medium-low, and cook until the noodles are tender, about 15 minutes.\n",
        "picture_link": "AZuet6l3N.IfTbLMfWDUJGnlN2ec8i2"
    },
    {
        "title": "Brodetto (Fish Stew) Ancona-Style",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3 cloves garlic, finely chopped ADVERTISEMENT",
            "1 carrot, chopped ADVERTISEMENT",
            "2 celery ribs, chopped ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "1 cup chopped fresh parsley ADVERTISEMENT",
            "red pepper flakes to taste ADVERTISEMENT",
            "1 (28 ounce) can whole peeled tomatoes, mashed ADVERTISEMENT",
            "1 1/2 pounds red snapper fillets, cut into 2 inch pieces ADVERTISEMENT",
            "1/2 cup white vinegar ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "3 cups fish stock ADVERTISEMENT",
            "1 pound clams in shell, scrubbed ADVERTISEMENT",
            "1/2 pound medium shrimp, with shells ADVERTISEMENT",
            "6 (3/4 inch thick) slices Italian bread, toasted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large saucepan, Dutch oven, or preferably a clay pot over medium heat. Add the onion, garlic, carrot, celery, bay leaves, parsley, and red pepper flakes. Cook and stir until the onion has softened and turned translucent, about 5 minutes.\nStir in the mashed tomatoes and cook for 15 minutes over medium heat. Add the fish. Pour in the vinegar or wine. Cook until the liquid has almost evaporated, about 10 minutes; pour in the fish stock. Cover, reduce the heat to low, and simmer for 10 minutes.\nGently mix in the clams. Cook until clams have opened (discard any that don't open) about 2 minutes, and then stir in the shrimp. Cook until the shrimp are pink, about 3 minutes.\nPlace a slice of toasted bread in the bottom of each bowl. Ladle brodetto over the bread and serve immediately.\n",
        "picture_link": "C2MUTPnn2FZQbuEnmnJKScCYqBYQpwG"
    },
    {
        "title": "Sandwich Filling",
        "ingredients": [
            "1/2 pound lean ground beef ADVERTISEMENT",
            "8 ounces tomato sauce ADVERTISEMENT",
            "1/2 cup finely chopped onion ADVERTISEMENT",
            "1/2 cup chopped black olives ADVERTISEMENT",
            "1/4 cup chopped pimento peppers ADVERTISEMENT",
            "1 (8 ounce) can mushrooms, drained and chopped ADVERTISEMENT",
            "8 ounces extra-sharp Cheddar cheese, shredded ADVERTISEMENT",
            "1 1/2 teaspoons chili powder ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "4 hamburger buns, split ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nCook and stir ground beef in a large skillet until well browned, about 10 minutes; drain fat. Place cooked beef in a large bowl. Stir in tomato sauce, onion, black olives, pimentos, mushrooms, Cheddar cheese, chili powder, salt, and black pepper.\nSpoon sandwich filling on hamburger bun bottoms, spreading to the edges. Filling should be approximately 1/2\" thick in the center of the sandwich.\nBake in the preheated oven until the edges start to bubble, 5-10 minutes. Turn oven to Broil and continue to cook until heated through, about 3 minutes.\n",
        "picture_link": "8r2l.o.gz.D70YYRbFSfQ3MTDB5V2R."
    },
    {
        "title": "Remiscitti",
        "ingredients": [
            "1 (12 ounce) package egg noodles ADVERTISEMENT",
            "6 slices bacon, chopped ADVERTISEMENT",
            "2 pounds ground beef ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1 small green bell pepper, chopped ADVERTISEMENT",
            "1 (4.5 ounce) can sliced mushrooms, drained ADVERTISEMENT",
            "1 (28 ounce) can diced tomatoes, undrained ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese, or to taste ADVERTISEMENT",
            "1 (12 fluid ounce) can tomato juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nFill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the egg noodles, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 5 minutes. Drain well in a colander set in the sink, and rinse with cold water.\nPlace the bacon into a Dutch oven or enameled casserole dish over medium heat, and cook until just starting to soften, 3 to 4 minutes; add the ground beef, onion, and green pepper, and cook and stir until the meat is browned and the vegetables are tender, about 10 minutes. Drain excess fat. Mix in the cooked noodles, mushrooms, and diced tomatoes until thoroughly combined. Sprinkle the Parmesan cheese over the mixture, and pour the tomato juice over the casserole.\nBake in the preheated oven until browned and bubbling, about 1 hour.\n",
        "picture_link": "gPeiMocsrmgvyTChv0K7Clgg/u6a3Ee"
    },
    {
        "title": "Easy Cheddar Cheese Potato Bake",
        "ingredients": [
            "5 potatoes, peeled and sliced ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cheddar cheese soup ADVERTISEMENT",
            "1 1/4 cups milk ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x9-inch baking dish.\nLayer the potatoes into the prepared baking dish. Mix together the soup, milk, and melted butter in a bowl until thoroughly combined; pour the mixture over the potatoes.\nBake uncovered in the preheated oven on a lower rack until the potatoes are tender, about 1 hour.\n",
        "picture_link": "KmM6A8t5ZDXdqofmijSvf9UkgTaUS9."
    },
    {
        "title": "Grandmother's Lamb Recipe ",
        "ingredients": [
            "Grandmother's Chile Paste: ADVERTISEMENT",
            "1 teaspoon cumin seeds ADVERTISEMENT",
            "6 dried red chile peppers (preferably Kashmiri) ADVERTISEMENT",
            "1/4 cup apple cider vinegar ADVERTISEMENT",
            "1 clove garlic, coarsely chopped - or more to taste ADVERTISEMENT",
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "2 onions, finely chopped ADVERTISEMENT",
            "2 teaspoons ginger garlic paste ADVERTISEMENT",
            "5 tablespoons tomato paste ADVERTISEMENT",
            "1 teaspoon ground red pepper (cayenne) or to taste ADVERTISEMENT",
            "1/4 teaspoon ground turmeric ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "2 pounds lamb shanks, cut into 1 1/2-inch pieces ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "1 tablespoon chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the cumin seeds into a dry skillet over medium heat, and toast them, stirring constantly, until they give off a roasted fragrance and turn a darker brown, about 1 minute. Scrape the seeds into a bowl, and allow to cool. When cool, grind them with a mortar and pestle or a clean spice grinder. Set the ground seed aside.\nRemove stems of chiles if necessary, and soak pods in the apple cider vinegar in a bowl until soft, at least 1 hour. Place the softened chiles with vinegar, cumin, and garlic into a blender or food processor, and pulse until ground into a paste, 30 seconds to 1 minute or as needed.\nHeat the vegetable oil in a large pot over medium heat, and cook and stir the onions until lightly browned, about 10 minutes. Stir in ginger garlic paste and about 1 teaspoon of the Grandmother's Chile Paste mixture or as desired. Reduce heat to medium-low, and fry the onions with the spice pastes for 5 minutes to blend flavors. Stir in tomato paste, ground red pepper, turmeric, cinnamon, and cloves, and bring to a simmer. Cook to blend flavors, about 20 minutes.\nMix in the lamb shank pieces, and stir in salt to taste; simmer for 20 minutes, and stir in the water. Bring the lamb and sauce to a boil, reduce heat to a simmer, and simmer until lamb is very tender and sauce has thickened, 45 more minutes. Sprinkle with chopped cilantro to serve.\n",
        "picture_link": "Gye2qRf1csh7RyqMm3HLr4gdJukbqf2"
    },
    {
        "title": "Jeff's Recipe for Oysters in a Pan",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1 cup chopped onions ADVERTISEMENT",
            "1/2 cup chopped green bell pepper ADVERTISEMENT",
            "1 tablespoon chopped garlic ADVERTISEMENT",
            "1 cup green onions, chopped ADVERTISEMENT",
            "1/4 cup chopped celery (optional) ADVERTISEMENT",
            "50 shucked oysters ADVERTISEMENT",
            "1 tablespoon Creole seasoning (such as Tony Chachere's®) ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon hot pepper sauce ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 cup warm chicken stock ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a large cast-iron skillet over medium-high heat. Cook the onions, bell pepper, garlic, green onions, and celery in the melted butter until tender, about 10 minutes. Add the oysters to the vegetable mixture and cook until the oysters are cooked through, about 10 minutes more.\nStir the Creole seasoning, Worcestershire sauce, and hot pepper sauce into the oysters and vegetables to combine. Scatter the flour over the mixture and stir until thickened. Slowly pour the chicken stock into the mixture, stirring as you add it. Reduce heat to medium-low; cook and stir until the liquid reaches a desired thickness, 10 to 15 minutes.\n",
        "picture_link": "4ec5/52pw05mBNVkoBcDW2rPqCUaxCC"
    },
    {
        "title": "Chocolate Banana Fried Wontons with Grand Marnier® Caramel Sauce",
        "ingredients": [
            "2 very ripe bananas ADVERTISEMENT",
            "1/3 cup miniature semi-sweet chocolate chips ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 (14 ounce) package wonton wrappers ADVERTISEMENT",
            "oil for frying ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1 tablespoon brandy-based orange liqueur (such as Grand Marnier®) ADVERTISEMENT",
            "2 tablespoons light corn syrup ADVERTISEMENT",
            "2 tablespoons miniature semi-sweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the bananas, 1/3 cup chocolate chips, clove, cinnamon, and vanilla into a mixing bowl, and mash until evenly blended. Alternatively, chop the mixture in a food processor until the chocolate chips have been reduced in size. This will help prevent the chips from poking through the wonton skins as you handle them. It will also change the texture of the filling - you will not have pockets of melted chocolate in the wontons.\nTo make the wontons: Separate and place the wonton wrappers onto your work surface. Spoon about 1 teaspoon of the banana filling onto the center of each wrapper. Use your finger or a pastry brush to lightly moisten the edges of the wonton wrappers with water. Fold one corner of the wrapper over the filling onto the opposite corner to form a triangle. Press the edges together to seal. Repeat with the remaining ingredients.\nPrepare the sauce by combining the butter, brown sugar, orange liqueur, and corn syrup in a small saucepan. Bring to a simmer over medium heat, and cook until the sugar has dissolved and the sauce is smooth, about 4 minutes. Set aside to cool slightly.\nFry the wontons in the hot oil a few at a time until golden brown, about 4 minutes. Turn the wontons over halfway through cooking so they brown evenly. Remove, and drain on a paper towel-lined plate. Serve warm with the caramel sauce. Sprinkle with the remaining 2 tablespoons chocolate chips to garnish.\n",
        "picture_link": "yyc6NgiH8TofWNYVpm1IZaJY9EsXlPq"
    },
    {
        "title": "Chocolate Martinis For Two",
        "ingredients": [
            "2 tablespoons chocolate syrup (such as Hershey's®) ADVERTISEMENT",
            "ice ADVERTISEMENT",
            "1/2 cup vodka (such as Absolut®) ADVERTISEMENT",
            "1 fluid ounce chocolate liqueur (such as Godiva®) ADVERTISEMENT",
            "1 fluid ounce white creme de cacao ADVERTISEMENT",
            "2 maraschino cherries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Drizzle the chocolate syrup into two martini glasses, start 2/3 of the way up the side of the glass, and let the chocolate run to the bottom; set aside.\nPlace the ice into a cocktail shaker. Pour in the vodka, chocolate liqueur, and creme de cacao. Cover, and shake until the outside of the shaker has frosted. Strain into the prepared martini glasses. Garnish with maraschino cherries to serve.\n",
        "picture_link": "qsET3xYBIeIgZJ5GYZlBU4TC5a1lnP6"
    },
    {
        "title": "Meatloaf Muffins With Brown Gravy",
        "ingredients": [
            "3 slices thick-cut bacon, chopped ADVERTISEMENT",
            "1 sweet onion, minced ADVERTISEMENT",
            "2 1/2 pounds ground turkey ADVERTISEMENT",
            "1 pound ground veal ADVERTISEMENT",
            "2 cups dry bread crumbs ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/3 cup steak sauce ADVERTISEMENT",
            "2 tablespoons light brown sugar ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 tablespoon dried basil ADVERTISEMENT",
            "1 tablespoon dry ground mustard ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 1/2 teaspoons ground black pepper ADVERTISEMENT",
            "1 1/2 teaspoons sea salt ADVERTISEMENT",
            "1 1/2 teaspoons crumbled dried sage ADVERTISEMENT",
            "1/2 cup barbecue sauce ADVERTISEMENT",
            "2 (.75 ounce) packets dry brown gravy mix ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray 2 12-cup muffin pans with cooking spray.\nPlace the chopped bacon and onion in a skillet, and cook over medium-high heat, stirring occasionally, until the onions are translucent and the bacon is half cooked, about 5 minutes. Drain excess fat.\nPlace bacon mixture into a large bowl, and mix in the turkey, veal, bread crumbs, milk, eggs, steak sauce, brown sugar, garlic powder, basil, ground mustard, cumin, black pepper, sea salt, and sage until thoroughly combined. Fill the sprayed muffin cups with meatloaf mixture, and make a hole in the center of each muffin with your little finger for even cooking.\nBake in the preheated oven until the juices run clear and the internal temperature is at least 160 degrees F (70 degrees C) when measured with a meat thermometer, about 30 minutes. Brush each muffin with barbecue sauce, return to the oven, and bake 5 additional minutes.\nWhisk brown gravy mix and water in a saucepan, and place over medium heat. Continue whisking until the gravy comes to a boil. Reduce heat and allow to simmer until thickened, about 1 minute. To serve, place muffins in a deep serving dish, and pour the brown gravy over them.\n",
        "picture_link": "SQR7UUeNFCFiSo.xExsUlC9oRg5Atmu"
    },
    {
        "title": "Strawberry-Chocolate Mini Cupcakes with White Chocolate Ganache",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon baking soda ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1 cup unsweetened cocoa powder ADVERTISEMENT",
            "5 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1 (0.13 ounce) package unsweetened strawberry-flavored drink mix ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "5 tablespoons butter ADVERTISEMENT",
            "2 1/2 cups white sugar ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "2 1/2 teaspoons vanilla extract, or to taste ADVERTISEMENT",
            "1 3/4 cups milk ADVERTISEMENT",
            "1/4 cup heavy cream ADVERTISEMENT",
            "2 cups heavy cream ADVERTISEMENT",
            "2 (0.13 ounce) packages unsweetened strawberry-flavored drink mix ADVERTISEMENT",
            "36 ounces white chocolate, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 300 degrees F (150 degrees C). Line the cups of four 24-cup mini cupcake pans with paper liners. Sift the flour, baking soda, baking powder, all the cocoa powder, 1 package of strawberry drink mix, and salt in a mixing bowl.\nIn a separate bowl, beat butter and white sugar with an electric mixer on medium speed until light and fluffy; beat the eggs in, one at a time, adding each egg after the previous one has been completely incorporated. Beat in vanilla extract; mix in the flour-cocoa mixture in 4 additions, alternating each time with milk. Reduce mixer speed to low, and beat in the cream. Fill the cupcake cups 1/2 to 3/4 full.\nBake in the preheated oven until a toothpick inserted into the center of a cupcake comes out clean, 10 to 15 minutes. Remove to racks, and allow the cupcakes to cool.\nBring 2 cups of cream almost to a boil in a saucepan over medium-high heat; dissolve the 2 packets of strawberry drink mix into the cream. Stir in the white chocolate until the chunks melt and the mixture becomes melted, smooth, and shiny. Set aside and allow ganache to cool to warm temperature (about 95 degrees F/ 35 degrees C). Frost each cupcake with ganache.\n",
        "picture_link": "o7f5nuUfoRnl.TPkWQ6RGMmRMk9T6SO"
    },
    {
        "title": "Spicy Carrot Cake",
        "ingredients": [
            "1 (18.25 ounce) package spice cake mix ADVERTISEMENT",
            "1 (10.75 ounce) can condensed tomato soup ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/3 cup canola oil ADVERTISEMENT",
            "1/2 cup shredded carrot ADVERTISEMENT",
            "1/3 cup chopped pecans (optional) ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease and flour a 10-inch Bundt(R) pan.\nIn a bowl, mix together the cake mix, tomato soup, water, eggs, canola oil, carrot, and pecans until the mixture forms a smooth batter. Pour the batter into the prepared pan.\nBake in the preheated oven until a toothpick inserted into the middle of the cake comes out clean, about 45 minutes. Invert the pan and turn the cake out onto a cooling rack; cool to room temperature.\nIn a bowl, mix together the confectioners' sugar with lemon juice until smooth; drizzle glaze over cake.\n",
        "picture_link": "Z3IMOe4X9Nz1yCks7rkOv3vPy6aLU5y"
    },
    {
        "title": "John's Quiche Lorraine",
        "ingredients": [
            "1 frozen single pie crust ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1/2 pound slab bacon with rind removed, diced ADVERTISEMENT",
            "1 1/2 cups heavy cream ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Fit the pie crust into a quiche pan or 9-inch pie dish, and cover the crust with a sheet of aluminum foil. Fill the crust with pie weights or dried beans.\nBake the crust in the preheated oven just until the edges begin to turn golden brown, about 15 minutes. Remove from oven, and take out the pie weights and aluminum foil.\nMelt the butter in a large skillet over medium heat, and cook the bacon until browned, stirring frequently, about 7 minutes. Transfer the bacon to paper towels to drain, then sprinkle the bacon into the partially-baked crust. Whisk the cream, eggs, salt, black pepper, and nutmeg together in a bowl, and pour into the crust.\nReturn to oven, and bake until the filling is set in the middle and the quiche is puffy and golden brown, 30 to 35 minutes. Allow to cool until warm, about 1 hour, to serve.\n",
        "picture_link": "lkSdxaTU.qC9tTxnB0wDZ9VZXMtjzUy"
    },
    {
        "title": "Tiropita",
        "ingredients": [
            "6 tablespoons butter ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 pinch nutmeg ADVERTISEMENT",
            "1 pound feta cheese ADVERTISEMENT",
            "3 ounces grated Greek Kefalotiri cheese ADVERTISEMENT",
            "4 eggs, beaten ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "3/4 pound phyllo dough, thawed ADVERTISEMENT",
            "3/4 cup melted butter for brushing ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt 6 tablespoons butter in small saucepan over medium-low heat. Whisk in the flour until smooth and cook, stirring constantly, for 2 minutes. Gradually pour in the milk, stirring constantly with a whisk or wooden spoon. Add the salt and nutmeg, stirring occasionally, until mixture is bubbly and thickened, 5 to 10 minutes.\nMash the feta cheese with a fork in a bowl and stir in the grated kefalotiri, beaten eggs, and parsley. Pour in the hot white sauce and mix well.\nPreheat oven to 350 degrees F (175 degrees C). Butter a 9x13-inch baking dish.\nLine the buttered baking dish with a sheet of phyllo dough and brush it with melted butter; keep the remaining phyllo sheets covered with plastic wrap while you work. Repeat with half of the phyllo sheets, brushing each sheet with butter, and letting them come up the sides of the baking dish. Pour in the cheese filling.\nLay the remaining pastry sheets on top of the filling, brushing each with butter. Brush the top of the last sheet with butter and, with a sharp knife, score the top sheets into strips about 3 inches wide from one end of the baking dish to the other.\nBake in the preheated oven until the pastry is golden brown and crisp, about 45 minutes. Let stand for 5 minutes, then cut into squares and serve hot.\n",
        "picture_link": "U2YMMhVTYXnjkjh7au7pdC5cs/vdBMy"
    },
    {
        "title": "Carrot and Sweet Potato Tzimmes",
        "ingredients": [
            "canola oil ADVERTISEMENT",
            "2 (16 ounce) packages baby carrots ADVERTISEMENT",
            "2 sweet potatoes - peeled, quartered, and cut into chunks ADVERTISEMENT",
            "1 cup pitted prunes ADVERTISEMENT",
            "1 3/4 cups pineapple chunks, drained (juice reserved) ADVERTISEMENT",
            "1/2 cup pineapple juice from canned pineapple ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "1 1/4 cups orange juice ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon cornstarch ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Oil a 9x13-inch baking dish with canola oil.\nBring a large pot of water to a boil, and stir in the baby carrots. Reduce heat to a simmer, and cook the baby carrots until firm but tender, about 10 minutes. Stir in the sweet potato chunks, and simmer for 5 more minutes; drain.\nPlace the carrots, sweet potatoes, and prunes into the prepared baking dish, and stir to combine. In a bowl, whisk together the reserved pineapple juice, honey, orange juice, salt, and cinnamon until smooth, and pour the mixture over the carrots, sweet potatoes, and prunes. Cover the baking dish with aluminum foil.\nBake in the preheated oven until the mixture is bubbling, about 30 minutes. Remove from oven, and take off the aluminum foil. Mix in the pineapple chunks and cornstarch until thoroughly combined, and return to the oven until slightly thickened, about 10 more minutes.\n",
        "picture_link": "4I42D.qfDZlI/egyYyttO1dUxE0h.7W"
    },
    {
        "title": "Easy Noodle Kugel",
        "ingredients": [
            "1 (8 ounce) package wide egg noodles ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "2 cups small curd cottage cheese ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups applesauce ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "6 eggs, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly oil a 9x13-inch baking dish.\nFill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the egg noodles, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, 4 to 5 minutes. Drain well.\nMelt butter in the pot, and stir together the drained noodles, cottage cheese, salt, and applesauce. Mix in the sugar and cinnamon. Add the beaten eggs; stir to blend all ingredients. Pour mixture into prepared baking dish.\nBake until top is very brown, about 1 hour.\n",
        "picture_link": "ky9D1XIcI8jPxAZgobKB9Ct7Cg.tIMm"
    },
    {
        "title": "Simple and Delicious Cheese Fondue",
        "ingredients": [
            "24 baby red potatoes ADVERTISEMENT",
            "2 quarts water, or amount to cover ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "5 teaspoons kirsch liqueur ADVERTISEMENT",
            "3 cups dry white wine ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 pound Emmentaler cheese, shredded ADVERTISEMENT",
            "1 pound Gruyere cheese, shredded ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "2 loaves baguette-style French bread, cut into cubes ADVERTISEMENT",
            "1 (16 ounce) jar pickled pearl onions, drained ADVERTISEMENT",
            "1 (12 ounce) jar pickled cornichons ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes into a large pot with enough water to cover; stir in salt. Bring the water to a boil; reduce heat to medium-low, cover, and cook until tender, about 20 minutes. Drain potatoes, and set aside.\nStir the cornstarch and kirsch liqueur together in a small bowl until it forms a paste; set aside.\nCombine the white wine and garlic in a large saucepan over medium heat; bring to a simmer. Slowly whisk in the Emmentaler and Gruyere cheese, about 1/2 cup at a time, allowing each batch to melt before mixing in the next. Stir in a random pattern to prevent cheese from clumping into a ball. Whisk in cornstarch mixture and nutmeg to the cheese sauce; stir and cook at a simmer until thickened, 8 to 10 minutes.\nTransfer the cheese mixture to a fondue pot. Serve with the cooked red potatoes and French bread for dipping; garnish with pearl onions and cornichons.\n",
        "picture_link": "15nczW0HApcZPnA2tblC4qfrQaMCXs."
    },
    {
        "title": "Shish Kabob a la Holly",
        "ingredients": [
            "12 (10 inch) wooden skewers ADVERTISEMENT",
            "1 green bell pepper, cut into large chunks ADVERTISEMENT",
            "1 pound peeled and deveined shrimp ADVERTISEMENT",
            "1 small zucchini, sliced 1/4-inch thick ADVERTISEMENT",
            "1/2 pound skinless, boneless chicken breast - cut into cubes ADVERTISEMENT",
            "1/2 pint cherry tomatoes ADVERTISEMENT",
            "1 pound beef steak, cut into cubes ADVERTISEMENT",
            "24 pearl onions ADVERTISEMENT",
            "1/2 pound large fresh mushrooms, halved ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "1/4 teaspoon garlic powder, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 pound fettuccine ADVERTISEMENT",
            "2 tablespoons softened butter ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Soak the skewers in water for 1 hour.\nOnto each skewer, alternately thread green bell pepper chunks, shrimp, zucchini slices, chicken, cherry tomatoes, steak, onion, mushroom; repeat until skewer is full. Drizzle olive oil over the prepared skewers; season with 1/4 teaspoon garlic powder, salt, and black pepper. Allow to marinate in refrigerator at least 3 hours, turning every 45 minutes.\nPreheat an outdoor grill for medium-high heat, and lightly oil the grate.\nBring a pot of lightly salted water to a rolling boil. Cook the fettuccini in the boiling water, stirring occasionally, until cooked through yet firm to the bite, about 8 minutes; drain. Toss the hot pasta in a large bowl with the softened butter and 1/4 teaspoon garlic powder.\nWhile the pasta boils, cook the skewers on the preheated grill, turning frequently until nicely browned on all sides, the shrimp are pink and opaque, and the meat is no longer pink in the center, 10 to 15 minutes. Push the cooked meat and vegetables off the skewer onto the tossed pasta.\n",
        "picture_link": "yb85GgzGFOLcFch6JHhIvXDIfGCQLBW"
    },
    {
        "title": "Pizza Rustica (A Sicilian Sausage and Prosciutto Pie)",
        "ingredients": [
            "2 pounds ricotta cheese ADVERTISEMENT",
            "2 pounds bulk Italian sausage ADVERTISEMENT",
            "5 large eggs, beaten ADVERTISEMENT",
            "1 pound shredded mozzarella cheese ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1 tablespoon finely chopped parsley ADVERTISEMENT",
            "1/4 pound prosciutto, chopped ADVERTISEMENT",
            "freshly cracked black pepper to taste ADVERTISEMENT",
            "2 pounds prepared pizza dough ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place a piece of cheesecloth into a strainer, and place the ricotta cheese into the cheesecloth. Set a bowl underneath the strainer to catch drips, and refrigerate 8 hours, or overnight, to allow moisture to drip from ricotta.\nPreheat oven to 400 degrees F (200 degrees C).\nPlace sausage into a large skillet over medium heat, and cook and stir until browned and crumbly, about 10 minutes. Drain excess grease, and allow sausage to cool.\nPlace the drained ricotta cheese into a large bowl, and stir in 5 beaten eggs and mozzarella cheese until well mixed. Mix in the cooked sausage, Parmesan cheese, parsley, prosciutto, and black pepper until thoroughly combined.\nDivide the pizza dough into fourths, and roll out 2 of the pieces into 12-inch circles. Fit the circles into 2 10-inch pie plates, leaving 1 inch of dough hanging over the edge. Divide the filling between the 2 pies. Roll out 2 top crusts, place onto the pies, and fold the edges of the bottom crusts over the edges of the top crusts to seal. Crimp and flute the edges of the pie crusts.\nBeat 1 egg with water in a small bowl, and brush the egg wash over the tops and edges of both pies. Cut several slits into the top crusts to vent steam.\nBake pies in the preheated oven for 15 minutes, then lower oven temperature to 325 degrees F (165 degrees C). Continue to bake until the crust is browned and the filling is hot, 45 to 50 more minutes. Serve at room temperature.\n",
        "picture_link": "gBiTQl82vuOt8jVnybYDW5mE4hipjN."
    },
    {
        "title": "Chicken Satay Steaks",
        "ingredients": [
            "2 lemons, juiced ADVERTISEMENT",
            "1 tablespoon peanut butter ADVERTISEMENT",
            "1 tablespoon tomato puree ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1 teaspoon crushed garlic ADVERTISEMENT",
            "6 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, stir together the lemon juice, peanut butter, tomato puree, brown sugar, Worcestershire sauce, salt, black pepper, crushed red pepper flakes, and garlic until smooth.\nWith a meat pounder or the side of a sturdy saucer, pound the chicken breasts to about 1/2 inch thick. Place the chicken breasts into the marinade, and stir to coat all the chicken. Cover with plastic wrap, and marinate in the refrigerator for at least 30 minutes. Longer is better.\nHeat olive oil in a large, heavy skillet until oil is very hot. Remove chicken breasts from the marinade; discard used marinade. Pan-fry the chicken breasts in the oil until the juices run clear and the chicken is browned on both sides, 6 to 8 minutes per side. Chicken may stick to the pan due to the brown sugar and peanut butter, but it will add a slightly charred flavor.\n",
        "picture_link": "lq/HLSdwCMSBYuTa9zdBavBphNagCzu"
    },
    {
        "title": "Bates Banana Bread",
        "ingredients": [
            "1 1/4 cups brown sugar ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "5 very ripe bananas, mashed ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "2 1/2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/3 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup unsalted butter, cubed ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a large loaf pan.\nMash together the brown sugar and 1/2 cup of softened butter until smooth and creamy in a large bowl; beat in the eggs. In a bowl, combine the mashed bananas with lemon juice, and add them to the butter-sugar mixture. Beat in the milk and vanilla extract until smooth.\nIn a bowl, whisk together 2 1/2 cups of flour, baking soda, salt, and 1 teaspoon of cinnamon. Mix the flour mixture into the banana mixture in 2 or 3 increments, beating well after each addition. Scrape the batter into the prepared loaf pan.\nMix together the white sugar, 1/3 cup of flour, 1/4 cup of unsalted butter, and 1 1/2 teaspoon of cinnamon with a fork until the mixture is crumbly. Spoon the crumble mixture over the loaf.\nBake in the preheated oven until the bread is lightly browned and a toothpick inserted into the center comes out clean, 45 minutes to 1 hour.\n",
        "picture_link": "MhXr4b3EobioUD4lFtZau/0.UyrvLwO"
    },
    {
        "title": "Berry Bloody Smoothie",
        "ingredients": [
            "1 1/4 cups frozen strawberries ADVERTISEMENT",
            "2 tablespoons frozen raspberries, or to taste ADVERTISEMENT",
            "1/2 cup orange juice, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place frozen strawberries and raspberries into a blender, and pulse several times to break up the berries. Pour in half the orange juice with the blender running, and allow to blend until smooth and thick, about 30 seconds. If smoothie is too thick, blend in remaining orange juice. Serve immediately.\n",
        "picture_link": "1J/larsnaHr3ynXx77PUWpwPEcQR.ui"
    },
    {
        "title": "Cabbage Stuffed Pita Pockets",
        "ingredients": [
            "1 pound lean ground beef ADVERTISEMENT",
            "1 head cabbage, cored and chopped ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "1 cup shredded carrots ADVERTISEMENT",
            "1 (4.5 ounce) can mushroom stems and pieces, drained ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "6 whole wheat pita breads, halved ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large skillet over medium-high heat and cook and stir the ground beef until the meat is crumbly, evenly browned, and no longer pink. Drain and discard any excess grease. Transfer ground beef to a bowl; set aside. Cook and stir the cabbage, onion, carrots, and mushroom in the skillet over medium-high heat until the vegetables are tender, 5 to 7 minutes. Stir in the beef, and season with salt and pepper.\nFill each pita half with the hot cabbage mixture. Top with mozzarella cheese.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "GOYA® Easy Arroz con Pollo",
        "ingredients": [
            "1 pound chicken breasts and/or thighs* ADVERTISEMENT",
            "1/2 teaspoon GOYA® Adobo All-Purpose Seasoning with Pepper ADVERTISEMENT",
            "1 tablespoon GOYA® Extra Virgin Olive Oil ADVERTISEMENT",
            "1/2 medium yellow onion, finely chopped ADVERTISEMENT",
            "1/2 medium green bell pepper, finely chopped ADVERTISEMENT",
            "2 teaspoons GOYA® Minced Garlic ADVERTISEMENT",
            "1 (8 ounce) box GOYA® Yellow Rice ADVERTISEMENT",
            "1 (4 ounce) jar GOYA® Fancy Sliced Pimientos, drained ADVERTISEMENT",
            "8 GOYA® Manzanilla Olives Stuffed with Minced Pimientos, thinly sliced ADVERTISEMENT",
            "1/4 cup GOYA® Frozen Peas, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season chicken with Adobo. Heat oil in large skillet over medium-high heat. Add chicken to pan; cook until golden brown on all sides, about 5 minutes. Transfer to plate. Add onion and peppers to pan. Cook until vegetables are soft, about 5 min. Add garlic to pan; cook until fragrant, about 30 seconds more.\nPour 2 cups water into pan with vegetables; bring water mixture to boil; add rice and chicken to pan. Return water to boil; boil 1 min. Lower heat to medium low; simmer, covered, until water is absorbed, rice is tender and chicken is cooked through, about 25 min.\nArrange pimientos, olives and peas over Chicken and Rice.\n",
        "picture_link": "s5.T5lUyuULEq7CNgp/.uQwJK8Mo6ly"
    },
    {
        "title": "Dutch Bokkenpootjes - Goat's Feet ",
        "ingredients": [
            "Almond Meringue Cookies: ADVERTISEMENT",
            "8 egg whites ADVERTISEMENT",
            "1 3/4 cups white sugar ADVERTISEMENT",
            "5 1/4 cups almond meal ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "zest from 1 lemon ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "Buttercream Filling: ADVERTISEMENT",
            "3 1/2 tablespoons butter ADVERTISEMENT",
            "1 1/4 cups confectioners' sugar, sifted ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "4 ounces bittersweet chocolate, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat egg whites until foamy in a large glass or metal mixing bowl. Gradually add the white sugar, continuing to beat until stiff peaks form. Lift your beater or whisk straight up: the egg whites should form a sharp peak that holds its shape. Fold in the almond meal, cinnamon, lemon zest, and vanilla.\nLine a baking sheet with parchment paper. Transfer the meringue to a piping bag with a large plain tip (or a gallon-sized plastic zipper bag with the corner snipped off). Pipe the meringue into ladyfingers about 3 inches long. Set the pan aside and let the meringues dry at room temperature for 2 hours.\nPreheat an oven to 320 degrees F (160 degrees C).\nBake the cookies on the middle oven rack until dried but not yet brown, 15 to 20 minutes. Allow them to cool completely.\nMake the filling by creaming the butter and confectioners' sugar until smooth. Stir in the vanilla. Meanwhile, melt the chocolate in the top of a double boiler over just-barely simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching.\nTo assemble the cookies, spread buttercream on the back of a cookie, sandwich it together with another cookie, and dip both ends in the melted chocolate. Let the dipped cookies dry on waxed paper or parchment.\n",
        "picture_link": "ViluRxC7VfN7VrpB1gXfCj1PDGxxuYK"
    },
    {
        "title": "Spicy Habanero Dipping Sauce",
        "ingredients": [
            "1/4 cup malt vinegar ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1/4 cup chopped fresh cilantro ADVERTISEMENT",
            "1 habanero pepper, chopped (use gloves) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the malt vinegar, soy sauce, water, and sugar together in a small saucepan over high heat; bring to a boil, and immediately remove from heat.\nCombine the garlic, cilantro, and habanero pepper together in a bowl; pour the malt vinegar mixture over the garlic mixture, and allow to steep for 5 minutes before serving.\n",
        "picture_link": "wQRcBYKnq9dNofTlotyWqln9TULmdDq"
    },
    {
        "title": "Coal Region Boilo ",
        "ingredients": [
            "4 cups water ADVERTISEMENT",
            "4 1/2 pounds clover honey ADVERTISEMENT",
            "4 oranges, quartered ADVERTISEMENT",
            "3 lemons, quartered ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "6 cinnamon sticks ADVERTISEMENT",
            "1 teaspoon caraway seeds ADVERTISEMENT",
            "1/2 teaspoon whole allspice berries ADVERTISEMENT",
            "1/2 teaspoon whole cloves ADVERTISEMENT",
            "1/2 gallon 190 proof grain alcohol ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large pot over medium heat, mix the water with honey, and stir to combine. Stir in the orange and lemon quarters, raisins, cinnamon sticks, caraway seeds, allspice berries, and cloves, and bring mixture to a boil. Reduce heat to a simmer, and cook, stirring occasionally, for 30 minutes. Remove from heat, and strain the liquid into a large pot. Allow to cool for a few minutes.\nSlowly pour the grain alcohol into the honey mixture, and stir to combine. Pour into bottles, and cap; refrigerate until use. Serve gently warmed in shot glasses.\n",
        "picture_link": "0ZIT5vkGEpCDx4zValKYFWNOpMKMLE6"
    },
    {
        "title": "Momma's Poor Man's Lasagne",
        "ingredients": [
            "1 (8 ounce) package wide noodles ADVERTISEMENT",
            "1 1/2 pounds lean ground beef ADVERTISEMENT",
            "3/4 cup chopped sweet onion ADVERTISEMENT",
            "1 (8 ounce) can no-salt-added tomato sauce ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 (8 ounce) package cream cheese at room temperature ADVERTISEMENT",
            "1 cup small curd cottage cheese ADVERTISEMENT",
            "1/4 cup sour cream ADVERTISEMENT",
            "1/2 cup chopped green onion ADVERTISEMENT",
            "1/3 cup chopped green bell pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nBring a large pot of lightly salted water to a rolling boil. Boil the noodles until cooked through yet firm to the bite, about 5 minutes; drain.\nCook the ground beef and onions in a large skillet over medium heat, breaking the meat up into crumbles as it cooks, until the beef is completely browned, about 10 minutes. Mix in the tomato sauce; season with salt and black pepper.\nBeat the cream cheese in a bowl until smooth. Stir the cottage cheese, sour cream, green onion, and green pepper into the cream cheese.\nLayer half the cooked noodles into the bottom of the prepared baking dish; top with the cheese mixture, dropping it onto the noodles by spoonfuls and spreading over the noodles. Cover with the remaining half of the noodles, and spread the meat mixture on top in an even layer.\nBake in the preheated oven until the casserole is bubbly, about 40 minutes.\n",
        "picture_link": "mxHyD/lunB2Ahtv7wx5d2a01uHqF9SG"
    },
    {
        "title": "Karli's Ultimate Trail Mix",
        "ingredients": [
            "1/4 cup walnut halves ADVERTISEMENT",
            "1/4 cup pecan halves ADVERTISEMENT",
            "1/4 cup cashews ADVERTISEMENT",
            "1/4 cup almonds ADVERTISEMENT",
            "1/4 cup raw pumpkin seeds ADVERTISEMENT",
            "1/2 cup sesame snack sticks ADVERTISEMENT",
            "1/2 cup golden raisins ADVERTISEMENT",
            "1/2 cup dark raisins ADVERTISEMENT",
            "1/2 cup dried cranberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the walnuts, pecans, cashews, almonds, pumpkin seeds, sesame sticks, golden raisins, dark raisins, and cranberries in a bowl. Store at room temperature in an airtight container.\n",
        "picture_link": "KHfjsmZeO3hoqu95Non7QhUEMYR.Zme"
    },
    {
        "title": "Butterbeer III",
        "ingredients": [
            "1 cup brown sugar ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "6 tablespoons butter ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon cider vinegar ADVERTISEMENT",
            "1/4 cup heavy cream, divided ADVERTISEMENT",
            "1/2 teaspoon rum extract ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "4 (12 fluid ounce) cans or bottles cream soda ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir the brown sugar and water together in a small saucepan over medium heat; bring to a gentle boil, and cook until the mixture reads 240 degrees F (115 degrees C) on a candy thermometer. When a small amount of the syrup is dropped into a glass of cold water, it should form a soft ball. Add the butter, salt, cider vinegar, and 1/4 cup heavy cream, and stir. Remove from heat and set aside to cool completely; mix the rum extract into the cooled mixture.\nCombine 2 tablespoons of the brown sugar-cream syrup with remaining 1/2 cup heavy cream in a non-plastic bowl; beat with an electric mixer until whipped and cream holds soft peaks, 2 to 3 minutes.\nPour about 1/4 cup of the remaining brown sugar-cream mixture into a tall glass; stir about 1/4 of a bottle of cream soda into the cream mixture. Top with the remainder of the cream soda in the bottle. Top with about 1/4 of the whipped cream. Repeat with 3 more glasses to serve.\n",
        "picture_link": "Ot/bwo4fQtk.nFjFPqfu5sPEjZICmAa"
    },
    {
        "title": "Bloody Hand Sandwiches",
        "ingredients": [
            "3 (8 ounce) cans refrigerated crescent rolls ADVERTISEMENT",
            "2 (16 ounce) packages hot dogs, sliced in half the long way ADVERTISEMENT",
            "1/2 cup ketchup, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Line a baking sheet with parchment paper.\nOn a floured surface, roll out each tube of crescent dough into a large square about 1/4-inch thick. Place your hand or a hand shape cut out of paper onto the dough, and cut two hand shapes out of each tube of dough. Roll up the uncut dough, roll out again, and cut two more hand shapes (total of 8 shapes).\nTo assemble, lay four hand shapes onto the prepared baking sheet. Place two hot dog halves in a line, cut sides down, onto each finger and thumb. The hot dog halves should reach from 1/4 inch from the tip of each finger into the hand. Lay a second dough hand over the first one, covering the hot dogs, and pinch the two hand shapes together to enclose the hot dogs.\nBake in the preheated oven until the hands are golden brown, about 20 minutes. Allow to cool slightly; remove to a platter. Decorate the stumps of wrists with ketchup \"blood\" to serve.\n",
        "picture_link": "YyI1RjPEK5RBc.hslSrWV59AB8f1JNS"
    },
    {
        "title": "Hot Coffee Masala",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "2 cumin seeds, or to taste ADVERTISEMENT",
            "1 whole star anise pod ADVERTISEMENT",
            "1/2 cinnamon stick ADVERTISEMENT",
            "1 1/2 teaspoons instant coffee granules ADVERTISEMENT",
            "2 teaspoons nonfat dry milk powder ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan, bring the water to a boil, and stir in the cumin seeds, star anise pod, and cinnamon stick; reduce heat to a simmer, and cook for 3 minutes, stirring occasionally. Stir in the instant coffee, and allow the drink to simmer gently for 2 more minutes. Pour the drink into mugs, straining out the spices, and stir 1 teaspoon of nonfat dry milk powder and 1 teaspoon of white sugar into each mug.\n",
        "picture_link": "U5w3pZz1TuOBeHMOFqnO1JJI3ClE4EG"
    },
    {
        "title": "Mr. Mason's Chili",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 tablespoon chili powder (such as Gebhardt®) ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "1 tablespoon dried oregano ADVERTISEMENT",
            "1 tablespoon tomato paste ADVERTISEMENT",
            "1 tablespoon unsweetened cocoa powder ADVERTISEMENT",
            "1 cup water, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the ground beef and half the chili powder into a large saucepan over high heat, and cook until meat is browned, breaking the meat apart into crumbles as it cooks, about 10 minutes. Mix in the onion, and cook and stir until onion is softened, about 10 more minutes. Stir in garlic, and cook until fragrant, about 2 minutes. Stir in remaining chili powder, cumin, oregano, tomato paste, and cocoa powder, and cover pan.\nReduce heat to a simmer, and cook until meat is tender and flavors have blended, mixing enough water to make a thick chili, about 1 1/2 hours. Stir occasionally.\n",
        "picture_link": "Mj4xwFJN4KZgzkhq5sjvt590m009wRK"
    },
    {
        "title": "Grammy's Clam Fritters",
        "ingredients": [
            "oil for frying ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup minced clams ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C). Whisk the flour and baking powder together in a bowl; set aside.\nBeat the egg in a separate bowl until smooth. Stir in the minced clams and black pepper to taste. Stir in the flour to form a batter.\nDrop the fritters into the hot oil by the heaping tablespoonful. Fry until golden on both sides, about 1 minute per side. Drain on a paper towel-lined plate to serve.\n",
        "picture_link": "ptBIQvDqo5fCzZqPRomj3BcY3XW/xhC"
    },
    {
        "title": "Healthier Double Tomato Bruschetta",
        "ingredients": [
            "1 loaf whole grain artisan bread, cut into 3/4-inch slices ADVERTISEMENT",
            "6 roma (plum) tomatoes, chopped ADVERTISEMENT",
            "1/2 cup ready-to-eat sun-dried tomatoes, chopped ADVERTISEMENT",
            "3 cloves minced garlic ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 tablespoon balsamic vinegar ADVERTISEMENT",
            "1/4 cup fresh basil, stems removed and leaves chopped ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 cup shredded part-skim mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven on broiler setting. Arrange the artisan bread slices in a single layer on a baking sheet.\nCombine the roma tomatoes, sun-dried tomatoes, garlic, olive oil, vinegar, basil, salt, and pepper in a large bowl. Allow the mixture to sit for 10 minutes.\nBroil the bread until slightly brown, about 1 to 2 minutes.\nDivide the tomato mixture evenly over the bread slices. Top the slices with mozzarella cheese.\nReturn the baking sheet to the oven and broil until the cheese is melted, about 1 to 2 minutes.\n",
        "picture_link": "wUBL/MTlU834HefT2sJ0dZWZ1/eGDAW"
    },
    {
        "title": "Southwestern Corned Beef Quesadillas!",
        "ingredients": [
            "1/2 cup leftover corned beef brisket, shredded ADVERTISEMENT",
            "2 (8 inch) flour tortillas ADVERTISEMENT",
            "1/2 cup shredded Monterey Jack cheese ADVERTISEMENT",
            "2 tablespoons diced green chilies ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Warm corned beef in a small bowl in microwave on High, 30 seconds to 1 minute.\nHeat a skillet over medium heat. Place 1 tortilla in the hot skillet. Sprinkle with Monterey Jack cheese, corned beef, and green chilies.\nTop with the other tortilla. Heat until bottom tortilla is golden brown, 2 to 4 minutes . Carefully flip and heat until other side is golden brown and cheese is melted, 2 to 4 minutes. Cut in half to serve.\n",
        "picture_link": "rMGLL6.rWaT.SPUY0x/H4BL4SCzv75a"
    },
    {
        "title": "Tofu Walnut Burgers with Irish Stout",
        "ingredients": [
            "1 (8 ounce) package chopped walnuts ADVERTISEMENT",
            "1/2 (1 pound) package firm tofu, drained and crumbled ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup Irish stout beer (such as Guinness®) ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium heat and lightly oil the grate.\nPlace walnuts in a food processor; process until crushed.\nMix crushed walnuts, tofu, egg, and Irish stout beer in a large bowl until the mixture holds together when lightly squeezed. Stir in soy sauce and season with salt and black pepper.\nForm the mixture into six patties.\nGrill patties on the prepared grill until browned and set in the middle, 5 to 7 minutes per side.\n",
        "picture_link": "nPVLyyxQ1MIuVBNYyErqTSuRcEI9Fyi"
    },
    {
        "title": "Guilt-Free Cream of Asparagus Soup",
        "ingredients": [
            "2 small boiling potatoes ADVERTISEMENT",
            "1/4 cup fat-free sour cream ADVERTISEMENT",
            "1 pound asparagus ADVERTISEMENT",
            "6 cups vegetable broth ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "1 (8 ounce) package sliced fresh mushrooms ADVERTISEMENT",
            "1 clove garlic, crushed ADVERTISEMENT",
            "1/4 cup dry white wine (optional) ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the potatoes into a small pot with enough water to cover; bring to a boil, then reduce heat to medium-low, place a cover on the pot, and simmer until tender, about 20 minutes.\nDrain the potatoes and transfer to a bowl; add the sour cream and mash lightly; scrape into the bowl of a blender.\nCut asparagus into 3 parts: woody ends, tips, and center pieces.\nCombine the woody ends of the asparagus with the vegetable broth in a stockpot; bring to a boil and cook until the woody ends are tender. Remove woody ends with a slotted spoon and discard.\nRemove 2 tablespoons broth to a bowl with the asparagus tips. Transfer remainder of stock to blender with the potatoes.\nChop the middle segments of the asparagus.\nHeat olive oil in a skillet over low-heat; cook and stir the chopped asparagus, chopped onion, and 2 crushed cloves garlic in the hot oil until the asparagus is tender, about 10 minutes. Add to the broth in the blender, reserving oil in the skillet.\nBlend the mixture in the blender on high until smooth and creamy; return to the stockpot.\nCook and stir the sliced mushrooms and 1 crushed garlic clove in the remaining oil over medium-low heat until the mushrooms soften, 3 to 5 minutes. Add the white wine; cook another 1 to 2 minutes. Stir the mushroom mixture into the soup.\nHeat the asparagus tips and broth in the microwave for 2 minutes; stir into the soup.\nSeason the soup with cayenne pepper, salt, and black pepper.\n",
        "picture_link": "al/VvEkIxzrKniD8uHEUH7iSi9jxykG"
    },
    {
        "title": "Vegetable Curry Couscous ",
        "ingredients": [
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "1/2 small onion, chopped ADVERTISEMENT",
            "1 small leek, cleaned and thinly sliced ADVERTISEMENT",
            "1 stalk celery, thinly sliced ADVERTISEMENT",
            "1/2 red bell pepper, chopped ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 1/2 cups chicken stock ADVERTISEMENT",
            "1 carrot, grated ADVERTISEMENT",
            "2 tomatoes - peeled, seeded and chopped ADVERTISEMENT",
            "1/2 cup couscous ADVERTISEMENT",
            "1/4 cup golden raisins ADVERTISEMENT",
            "1/4 cup dried currants ADVERTISEMENT",
            "1 teaspoon curry powder, or to taste ADVERTISEMENT",
            "1 pinch ground turmeric, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons sliced almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place vegetable oil in a saucepan over medium heat, and cook and stir the onion, leek, celery, red bell pepper, and garlic until the onion is translucent, about 5 minutes.\nPour in the chicken stock, bring to a boil, and stir in the carrot, tomatoes, couscous, raisins, and currants. Season with curry powder, turmeric, salt, and black pepper; bring the mixture back to a boil. Reduce heat to low, cover the pan, and allow to cook for 5 minutes.\nRemove from heat. Let the couscous stand covered for 5 minutes, and fluff with a fork. Sprinkle with sliced almonds.\n",
        "picture_link": "oWGX7UDeACU0aOpG.3GOL8qxO2ftg2C"
    },
    {
        "title": "Moist Caramel Apple Cake by JELL-O",
        "ingredients": [
            "1 package (2-layer size) yellow cake mix ADVERTISEMENT",
            "1 (3.4 ounce) package JELL-O Vanilla Flavor Instant Pudding ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/3 cup oil ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "3 Granny Smith apples, peeled, coarsely chopped ADVERTISEMENT",
            "20 KRAFT Caramels ADVERTISEMENT",
            "3 tablespoons milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 350 degrees F.\nBeat first 6 ingredients in large bowl with mixer until blended. Stir in apples. Pour into greased and floured 12-cup fluted tube pan or 10-inch tube pan.\nBake 50 min. to 1 hour or until toothpick inserted near center comes out clean. Cool cake in pan 15 min. Loosen cake from sides of pan; invert onto wire rack. Gently remove pan. Cool cake completely. Transfer to plate.\nMicrowave caramels and milk in microwaveable bowl on HIGH 1-1/2 min. or until caramels are completely melted and sauce is smooth, stirring every 30 sec. Cool 10 min. or until slightly thickened. Drizzle over cake just before serving.\n",
        "picture_link": "SS2uNYMqWghReiUJBtp2IM43FkuOyIa"
    },
    {
        "title": "Roasted Asparagus and Apple Salad",
        "ingredients": [
            "1 1/2 pounds thin asparagus, trimmed and cut into 4-inch pieces ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "1/4 cup white wine vinegar ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 pound mixed salad greens ADVERTISEMENT",
            "1 apple - peeled, cored, and sliced thin ADVERTISEMENT",
            "1/4 pound shredded sharp white Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 400 degrees F (200 degrees C).\nArrange asparagus pieces on a baking sheet. Drizzle 2 tablespoons olive oil over the asparagus; toss gently to coat and spread into a single layer.\nRoast asparagus in preheated oven until tender, about 25 minutes. Remove from oven and set aside to cool.\nCombine honey, white wine vinegar, 2 tablespoons olive oil, and garlic in a jar; seal tightly and shake vigorously to blend into a salad dressing.\nArrange salad greens onto a large platter; top with apple slices, shredded white Cheddar cheese, and cooled asparagus.\nDrizzle the salad dressing over the salad greens and toppings.\n",
        "picture_link": "gQF0uGlOSxARLJr0qNcy1XNMZLyccRG"
    },
    {
        "title": "Tomato Basil Tagliatelle",
        "ingredients": [
            "4 large tomatoes, diced ADVERTISEMENT",
            "1/2 cup chopped fresh basil ADVERTISEMENT",
            "1/4 cup red wine vinegar ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 tablespoons chopped fresh oregano ADVERTISEMENT",
            "1/2 pound dry tagliatelle or wide fettucine pasta ADVERTISEMENT",
            "1 tablespoon shredded Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together the tomatoes, basil, red wine vinegar, olive oil, and oregano in a bowl; allow mixture to stand at least 10 minutes.\nFill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the tagliatelle pasta, and return to a boil. Cook the pasta uncovered, stirring occasionally, until cooked through, but still firm, about 8 minutes. Drain well. Mix the hot cooked tagliatelle into the tomato mixture; sprinkle with Parmesan cheese to serve.\n",
        "picture_link": "Mqlu22ikH9usWSV9kUSgvZ3oG/CFwYG"
    },
    {
        "title": "Deb's Cloverleaf Rolls",
        "ingredients": [
            "4 cups hot water ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 tablespoons active dry yeast ADVERTISEMENT",
            "9 cups bread flour, divided ADVERTISEMENT",
            "2 cups regular rolled oats ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the hot water, white sugar, and yeast together in the mixing bowl of a large stand mixer; let sit until it forms a creamy layer on top, about 10 minutes.\nFit the mixer with a dough hook, and slowly beat in 3 cups of bread flour and the rolled oats until the flour is thoroughly worked in. Place the mixing bowl in a warm place, cover with a cloth, and let the batter rise until doubled and puffy, about 1 hour.\nPlace the mixing bowl back onto the stand mixer, and pour in the butter; start the mixer on low speed, and beat in the remaining 6 cups of bread flour. Sprinkle salt into the dough. Turn the mixer up to medium, and knead the dough until smooth and elastic, 5 to 8 minutes.\nPreheat oven to 375 degrees F (190 degrees C). Grease 24 muffin cups.\nPinch off about 2 tablespoons of dough, and form into a ball about the size of a large cherry tomato. Place the dough ball into a greased muffin cup; make 2 more balls, and place them into the same cup (3 dough balls per cup). Repeat with remaining dough.\nBake the rolls in the preheated oven until the turn lightly golden brown, 38 minutes.\n",
        "picture_link": "OTfJI2dmsfl1ySIunDWpzr0iSeW2y3."
    },
    {
        "title": "Super Easy Breakfast Sausage Loaf",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 pound bulk pork sausage ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "4 large eggs ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 (8 ounce) package refrigerated crescent rolls ADVERTISEMENT",
            "1 cup shredded Colby-Monterey Jack cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Spray a 9x5-inch loaf pan with cooking spray.\nHeat a large skillet over medium-high heat and stir in the sausage and brown sugar. Cook and stir until the meat is crumbly, evenly browned, and no longer pink. Drain and discard any excess grease. Transfer sausage to a bowl; wipe the skillet clean.\nMelt the butter in the clean skillet over low heat. In a bowl, whisk together the eggs, milk, salt, and black pepper. Pour the eggs into the skillet. Allow the eggs to cook undisturbed until they begin to set, then gently stir the eggs until the curds are separate and set but not dry, 5 to 7 minutes.\nRoll out the crescent roll dough, and line the bottom and sides of the prepared pan with 3/4 of the dough. Layer the sausage, scrambled eggs, and Colby-Monterey Jack cheese into the pan, then top with the remaining 1/4 of dough. Pinch the corners and sides of the dough together.\nBake in the preheated oven until golden brown, 25 to 30 minutes.\n",
        "picture_link": "9Y4nGmellV7TxwfG2r5LJtdn5hKwuJK"
    },
    {
        "title": "Power Drink ***THE ORANGE***",
        "ingredients": [
            "2 ripe bananas, peeled ADVERTISEMENT",
            "4 carrots, scrubbed and trimmed ADVERTISEMENT",
            "2 apples, cored ADVERTISEMENT",
            "1 (8 ounce) container plain yogurt ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "1 tablespoon ground flax seed ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "4 pitted dates, or to taste (optional) ADVERTISEMENT",
            "8 cubes ice, or as needed (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend the bananas, carrots, apples, yogurt, orange juice, lemon juice, flax seed, salt, dates, and ice cubes in a blender until smooth.\n",
        "picture_link": "K.KiPVydEbOT6XqzQo5meyRqiuxz1KC"
    }
]