[
    {
        "title": "Mike's Taco Dip",
        "ingredients": [
            "2 (8 ounce) packages cream cheese, softened ADVERTISEMENT",
            "1 (8 ounce) container sour cream ADVERTISEMENT",
            "1 dash hot pepper sauce ADVERTISEMENT",
            "1 dash soy sauce ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "1 (16 ounce) jar salsa ADVERTISEMENT",
            "1 bunch green onions, chopped ADVERTISEMENT",
            "1 (2 ounce) can sliced black olives ADVERTISEMENT",
            "1/2 head iceberg lettuce - rinsed, dried, and shredded ADVERTISEMENT",
            "8 ounces finely shredded Cheddar cheese ADVERTISEMENT",
            "2 tomatoes, seeded and chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream together cream cheese, sour cream, hot sauce, soy sauce, and lemon juice. Spread this mixture into a 9x13 inch glass dish. Layer salsa, green onions, black olives, lettuce, cheddar cheese and tomatoes over the cream cheese mixture. Cover with plastic wrap and gently press the ingredients down to tighten the layers. Chill before serving.\n",
        "picture_link": "eZMjTOZ3UqE/LN.8cj7ZM3ZagS/Z732"
    },
    {
        "title": "Fudge Frosting",
        "ingredients": [
            "1 1/2 (1 ounce) squares unsweetened chocolate ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 1/2 cups confectioners' sugar ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt chocolate and butter in small heavy saucepan over low heat; stir to blend.\nBeat in powdered sugar. Beat in egg white and vanilla, adding a little water, if necessary, to make smooth, slightly soft frosting. Spoon over Chocolate Frosted Marshmallow Cookies cookies to cover marshmallows.\n",
        "picture_link": "G9Gbv/PfFG/BgoM6ChJf4EctyayJ2YC"
    },
    {
        "title": "Broccoli Cheese Soup IV",
        "ingredients": [
            "1/4 cup chopped red onion ADVERTISEMENT",
            "1 tablespoon margarine ADVERTISEMENT",
            "2 1/2 cups milk ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 pound processed cheese, cubed ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped broccoli ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter or margarine over medium heat in a 2 quart saucepan. Cook and stir onions in butter or margarine until tender.\nAdd milk and cream cheese; stirring until cream cheese melts. Stir in cheese food and broccoli. Stir until cheese food melts, and soup is heated through.\n",
        "picture_link": "c/VTSxRAJph2RKmcwpFav1AQZ6zpPCG"
    },
    {
        "title": "Green Bean Casserole III",
        "ingredients": [
            "4 (15 ounce) cans green beans, drained ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken and mushroom soup ADVERTISEMENT",
            "10 3/4 fluid ounces milk ADVERTISEMENT",
            "1 (6 ounce) can French fried onions ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, mix the green beans with the soup and milk. Gently stir in half the French fried onions. Transfer to a non-greased 9x13 inch baking dish, and season with salt and pepper. Top with remaining French fried onions.\nBake in the preheated oven for approximately 30 minutes or until bubbly. Serve hot.\n",
        "picture_link": "hGrF817k./sh6fWRTfuMGFZO1WazRQG"
    },
    {
        "title": "Cranberry Apple Pie III",
        "ingredients": [
            "1 1/4 cups white sugar ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 cups cranberries ADVERTISEMENT",
            "1/4 cup maple syrup ADVERTISEMENT",
            "5 apples - peeled, cored and sliced ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1 (9 inch) unbaked pie shell ADVERTISEMENT",
            "1 cup dry bread crumbs ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup packed brown sugar ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn a large saucepan, whisk together white sugar, 1/4 cup flour, and salt. Stir in cranberries and maple syrup. Cook over medium-high heat, stirring constantly. When mixture comes to a boil, reduce heat, cover, and simmer 5 minutes, stirring occasionally.\nStir apples into simmering mixture, and continue to cook for 5 minutes, or until apples are tender. Remove from heat, and stir in walnuts. Set aside and allow to cool to room temperature.\nIn a medium bowl, combine breadcrumbs, 3/4 cup flour, brown sugar, and melted butter. Mix well. Pour cooled apple mixture into pie shell and sprinkle crumb topping over apple filling.\nBake in preheated oven until topping is golden brown and filling is bubbly, about 30 minutes. Serve warm.\n",
        "picture_link": "BXVW6ZRpubEGK4Cl.yeSO0LghZrThNS"
    },
    {
        "title": "Oatmeal Date Cookies",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "3/4 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1 cup shortening ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups quick cooking oats ADVERTISEMENT",
            "1 cup dates, pitted and chopped ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F and grease cookie sheets.\nIn separate bowl, sift together flour, baking powder, baking soda and salt. Set aside.\nIn a large bowl, cream together shortening and both sugars until light and fluffy, using electric mixer at medium speed.\nAdd eggs, one at a time, beating well after each. Blend in vanilla.\nGradually add dry ingredients to creamed mixture, mixing well with spoon.\nStir in oats, dates and walnuts.\nDrop dough by teaspoonfuls, about 2 inches apart, on cookie sheet.\nBake for 8 minutes or until lightly browned. Remove from cookie sheets to cool on racks.\n",
        "picture_link": "KXZhnAUHSFO0Ia6t9xHxUJ5XYsh4a0S"
    },
    {
        "title": "Simmering Chicken Strawberry Kabobs",
        "ingredients": [
            "1 cup lemon juice ADVERTISEMENT",
            "2 (8 ounce) cans pineapple chunks, juice reserved ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "3 skinless, boneless chicken breast halves, cubed ADVERTISEMENT",
            "1 cup butter, melted ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1 teaspoon ground nutmeg ADVERTISEMENT",
            "24 large strawberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a shallow glass bowl combine lemon juice, juice from pineapple can, salt, pepper and 1 teaspoon cinnamon. Mix together. Add cubed chicken and marinate for 1 hour in the refrigerator.\nPreheat grill for medium heat and lightly oil the grate. Soak wooden skewers, if you're using them.\nCombine the melted butter, 1 teaspoon cinnamon, brown sugar, and nutmeg in a small bowl.\nUsing metal or soaked wooden skewers, arrange chicken, pineapple chunks, and strawberries on each stick (approximately 4 to 6 pieces of each item per skewer). Brush kabobs with butter mixture. Place the kabobs on the hot grill. Cook, turning on all sides, until chicken is cooked through and strawberries are sizzling, approximately 8 to 10 minutes.\n",
        "picture_link": "UT2jE7u7mCd3NU3iXywOnNdibBsFu/2"
    },
    {
        "title": "Kangaroo Chops",
        "ingredients": [
            "4 pork chops ADVERTISEMENT",
            "4 potatoes, quartered ADVERTISEMENT",
            "1 ear corn - husked, cleaned and quartered ADVERTISEMENT",
            "3 tablespoons soy sauce ADVERTISEMENT",
            "3 tablespoons Worcestershire sauce ADVERTISEMENT",
            "3 tablespoons water ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/8 cup dried bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace pork chops on a lightly greased large square of aluminum foil. Place potatoes and corn around chops. Pour soy sauce, Worcestershire sauce and water over all. Then distribute the onion and garlic amongst the chops and veggies; top by sprinkling bread crumbs and dry seasonings of your choice over all.\nClose foil around all and seal tightly. Place foil pouch in a 9x13 inch baking dish lines with another sheet of aluminum foil, in case of spilling. Bake in the preheated oven for 45 minutes. The pouch provides 'self-basting', so you need only remove from the oven and serve!\n",
        "picture_link": "wXy.aieF8xmqgcSOugf.vIaBK.eR86C"
    },
    {
        "title": "Hummus I",
        "ingredients": [
            "2 (15 ounce) cans garbanzo beans, drained ADVERTISEMENT",
            "1/2 cup roasted tahini ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "1 teaspoon grated lemon zest, minced ADVERTISEMENT",
            "2 cloves garlic ADVERTISEMENT",
            "1/4 cup packed flat leaf parsley ADVERTISEMENT",
            "1/4 cup chopped green onions ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place garbanzo beans, tahini, lemon juice, lemon zest, garlic, parsley, and green onion in the bowl of a food processor. Blend until smooth, adding water if the mixture is too thick. Season to taste with salt and pepper.\n",
        "picture_link": "fvi9gcPhwirnj9EqdFKqa3c4UEQnEJW"
    },
    {
        "title": "Bok Choy, Carrots and Green Beans",
        "ingredients": [
            "1 teaspoon peanut oil ADVERTISEMENT",
            "3 tablespoons minced shallots ADVERTISEMENT",
            "2 carrots, sliced diagonally ADVERTISEMENT",
            "1 cup fresh green beans, cut into 1 inch pieces ADVERTISEMENT",
            "1 cup chopped bok choy ADVERTISEMENT",
            "1/3 cup low sodium, low fat vegetable broth ADVERTISEMENT",
            "1 tablespoon light soy sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a wok or skillet over high heat. Add the shallots and saute for 3 minutes. Add the carrots and stir fry for 3 minutes. Add the green beans and stir fry for 2 minutes. Add the bok choy and stir fry for 2 minutes. Add the broth and simmer for 2 minutes. Add the soy sauce and serve.\n",
        "picture_link": "S8Oaxy7mDAVSbWdXR8nyq0DuVMP2vGO"
    },
    {
        "title": "Lemon Pudding Cookies",
        "ingredients": [
            "1 cup buttermilk baking mix ADVERTISEMENT",
            "1 (3 ounce) package instant lemon pudding mix ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1/3 cup granulated sugar for decoration ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (180 degrees C). Grease 2 large cookie sheets.\nMix baking mix, pudding, egg and oil in a large bowl until dough forms.\nRoll dough into 1 inch balls. Place balls 2 inches apart on the cookie sheets. Dip flat-bottomed glass or cookie press into sugar. Press onto dough ball and flatten into 1/4 inch thick cookie. Bake until just golden brown on the edges, about 10 minutes. Transfer to racks and cool completely.\n",
        "picture_link": "jCUFAr4C1RVhwROxvB2DqVbKf.MhNVy"
    },
    {
        "title": "Taco Soup VI",
        "ingredients": [
            "1 1/4 pounds lean ground beef ADVERTISEMENT",
            "46 ounces tomato-vegetable juice cocktail ADVERTISEMENT",
            "1 (29 ounce) can diced tomatoes ADVERTISEMENT",
            "1 (15 ounce) can kidney beans, drained and rinsed ADVERTISEMENT",
            "1 (15 ounce) can black beans, rinsed and drained ADVERTISEMENT",
            "1 (15.25 ounce) can whole kernel corn ADVERTISEMENT",
            "2 (1 ounce) packages taco seasoning mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large stock pot brown ground beef. Drain grease and add tomato vegetable juice, tomatoes, kidney beans, black beans, corn and taco seasoning. Heat through and serve.\n",
        "picture_link": "rz1TkNez/ZvyXy8BuWtYR6U9DTNLtVe"
    },
    {
        "title": "Easy Roasted Peppers",
        "ingredients": [
            "6 red bell peppers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 500 degrees F (260 degrees C).\nCut the peppers into quarters. Remove the seeds and the membranes. Roast the peppers until the skin blisters and turns black. Remove from oven and cover with plastic, or a tea towel, or place in a paper bag until cool. The skins should peel away off of the peppers easily when cooled.\n",
        "picture_link": "1.sr5i5S0Bq9pLWp1CNl9RGddLXxQ8a"
    },
    {
        "title": "Buttery Pan Rolls",
        "ingredients": [
            "5 1/2 cups all-purpose flour ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 1/2 teaspoons active dry yeast ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "5/8 cup butter, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine 3 cups of the flour, the sugar, salt and yeast in a large bowl. Stir well and set aside.\nCombine milk, water and 1/4 cup of the butter in a saucepan and cook over medium heat until butter melts, stirring occasionally. Remove from heat and let mixture cool to 120 to 130 degrees F (49 to 54 degrees C).\nGradually add milk to flour mixture and beat at low speed of an electric mixer for 30 seconds. Then beat for 2 minutes at high speed. Gradually stir in the remaining flour to make a soft dough.\nTurn dough out onto a lightly floured surface and knead for about 8 to 10 minutes or until dough is smooth and elastic. Place dough in a well greased bowl, turning to grease top. Cover and let rise in a warm place for about 1 hour and 15 minutes. Punch dough down, cover and let rest for 10 minutes.\nMelt remaining 1/4 cup plus 2 tablespoons butter.\nShape dough into 40 balls and dip each one in the melted butter. Place the balls in two greased 9 inch square baking pans. Cover and let rise for 45 minutes.\nBake in a preheated 375 degrees F (190 degrees C) oven for 15 minutes or until rolls are golden. Brush warm rolls with any remaining melted butter.\n",
        "picture_link": "HdhUiWOfD7jGUfgEubNCIcHOMM/jWDW"
    },
    {
        "title": "Peanut Butter Fudge III",
        "ingredients": [
            "4 cups white sugar ADVERTISEMENT",
            "1 cup evaporated milk ADVERTISEMENT",
            "1/2 cup margarine ADVERTISEMENT",
            "1 cup peanut butter ADVERTISEMENT",
            "1 cup marshmallow creme ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line a 9x13 inch pan with foil or parchment paper.\nIn a medium saucepan, combine the sugar, evaporated milk and butter. Cook over medium heat stirring frequently until it comes to a boil. Boil for 10 minutes, remove from heat and stir in peanut butter and marshmallow creme. Pour into the prepared pan and chill until set. Cut into squares and serve.\n",
        "picture_link": "G9emTstgOw3cvBPZ2DmIisrjroDL0sS"
    },
    {
        "title": "Teri Tips",
        "ingredients": [
            "1/2 cup soy sauce ADVERTISEMENT",
            "6 tablespoons white sugar ADVERTISEMENT",
            "4 tablespoons sesame oil ADVERTISEMENT",
            "2 pounds filet mignon, cubed ADVERTISEMENT",
            "1/8 cup white wine ADVERTISEMENT",
            "1 bunch green onions, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine soy sauce, sugar, and sesame oil in a shallow dish to make the marinade. Add meat, and refrigerate for 4 hours.\nPlace a large skillet over medium high heat, and cook meat until done.\nPour the marinade into a medium saucepan, and place over medium high heat. Bring to a boil, and cook for 5 minutes. Add cooked meat, green onions, and wine to the boiling marinade. Transfer the entire contents of the saucepan to a large bowl, and serve hot.\n",
        "picture_link": "FeQlYiXyVjWNu3dmitK6HW4mNePqalK"
    },
    {
        "title": "Chocolate and Almond Biscotti",
        "ingredients": [
            "1 1/2 cups blanched whole almonds ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "7/8 cup white sugar ADVERTISEMENT",
            "2 cups semisweet chocolate chips ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 tablespoons whiskey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Toast the almonds in a shallow pan for 12 to 15 minutes, shaking the pan a few times, until almonds are lightly colored. Set aside to cool.\nPreheat oven to 375 degrees F (190 degrees C). Line 2 or 3 cookie sheets with aluminum foil, shiny side up.\nIn a large bowl, stir together the flour, baking soda, baking powder, salt and sugar. Place 1/2 cup of these dry ingredients into the bowl of a food processor. Add about a half cup of the toasted almonds and process for about 30 seconds.\nReturn the mixture to the bowl of dry ingredients and stir in the remaining almonds and chocolate chips. In a large measuring cup, beat the eggs, vanilla and whiskey with a fork to blend. Stir into the dry ingredients until moistened. Wet your hands and divide the dough into four portions. Keeping hands wet, form each quarter into strips about 9 inches long, 2 inches wide and 1/2 inch high. Round the ends. Place two strips crosswise on each of the cookie sheets.\nBake for 25 minutes in the preheated oven. If baking more that one sheet at a time, reverse the sheets top to bottom halfway through cooking time.\nUsing a metal spatula remove the slabs from cookie sheets and let cool for 20 minutes on cutting board. Reduce oven temperature to 275 degrees F.\nWith a serrated knife, carefully cut at an angle into slices about 1/2 inch wide. Place the slices, cut side down, onto cookie sheets.\nBake 25 to 30 minutes in the preheated oven, until the biscotti is crispy and lightly toasted.\nTurn oven off and open the oven door, allowing the biscotti to cool in the oven. When cool, store in an airtight container.\n",
        "picture_link": "j0Rts52NtGEeC8yQclyQpoIuwdu/3xu"
    },
    {
        "title": "Buttermilk Chocolate Chip Cookies",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 cups buttermilk baking mix ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nMix butter or margarine, sugar and egg together. Stir in baking mix, nuts, and chocolate chips.\nDrop teaspoonfuls of dough about 2 inches apart on ungreased baking sheet. Bake about 10 minutes, or until lightly browned.\n",
        "picture_link": "5bZUzkvmuBK2nBLXzaHQG/V36cIfk4i"
    },
    {
        "title": "Jollof Rice",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 large onion, sliced ADVERTISEMENT",
            "2 (14.5 ounce) cans stewed tomatoes ADVERTISEMENT",
            "1/2 (6 ounce) can tomato paste ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon black pepper ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon chopped fresh rosemary ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 (3 pound) whole chicken, cut into 8 pieces ADVERTISEMENT",
            "1 cup uncooked white rice ADVERTISEMENT",
            "1 cup diced carrots ADVERTISEMENT",
            "1/2 pound fresh green beans, trimmed and snapped into 1 to 2 inch pieces ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour oil into large saucepan. Cook onion in oil over medium-low heat until translucent.\nStir in stewed tomatoes and tomato paste, and season with salt, black pepper, cayenne pepper, red pepper flakes, Worcestershire sauce and rosemary. Cover, and bring to a boil. Reduce heat, stir in water, and add chicken pieces. Simmer for 30 minutes.\nStir in rice, carrots, and green beans, and season with nutmeg. Bring to a boil, then reduce heat to low. Cover, and simmer until the chicken is fork-tender and the rice is cooked, 25 to 30 minutes.\n",
        "picture_link": "9goIGppflHWTqYAYg/rc0f9EpRSyvoi"
    },
    {
        "title": "Cherry Pork Chops",
        "ingredients": [
            "1 (21 ounce) can cherry pie filling ADVERTISEMENT",
            "4 pork chops ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour cherry pie filling into slow cooker. Add pork chops and stir to coat with filling. Cover and cook on low all day. Cook until meat is no longer pink inside and thermometer reads 145 degrees F (63 degrees C).\n",
        "picture_link": "KmUFDs5flHh3ZXi3Y9yQAqJ9FX7zLAK"
    },
    {
        "title": "Cozy Cottage Beef Stew Soup",
        "ingredients": [
            "3/4 pound beef stew meat, cut into 1 inch cubes ADVERTISEMENT",
            "2 onions, diced ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 large stalk celery, minced ADVERTISEMENT",
            "2 carrots, finely chopped ADVERTISEMENT",
            "1/4 pound green beans, cut into 1 inch pieces ADVERTISEMENT",
            "8 ounces fresh mushrooms, coarsely chopped ADVERTISEMENT",
            "3 potatoes, peeled and diced ADVERTISEMENT",
            "1 (14.5 ounce) can crushed tomatoes ADVERTISEMENT",
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "1/4 teaspoon dried marjoram ADVERTISEMENT",
            "2 (14.5 ounce) cans fat-free chicken broth ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "2 (10.5 ounce) cans beef consomme ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a slow cooker, combine beef, onions, garlic, celery, carrots, green beans, mushrooms, and potatoes. Pour in the tomatoes and tomato sauce. Season with bay leaf, pepper, thyme, and marjoram. Stir together chicken broth and flour. Pour chicken broth mixture and beef consomme into slow cooker, and stir.\nCover, and cook on Low 6 to 10 hours. Remove bay leaf before serving.\n",
        "picture_link": "MruT8aCEEOybP6vDC.6WBPRWofnP0e6"
    },
    {
        "title": "Succotash",
        "ingredients": [
            "1 cup butter, divided ADVERTISEMENT",
            "2 cups fresh lima beans ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "4 fresh tomatoes, peeled and chopped ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "4 ears fresh corn kernels, cut from the cob ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt 1/2 cup butter in a large saucepan over medium heat. Stir in lima beans and salt, and cook until tender, about 20 minutes.\nMeanwhile, in a separate saucepan heat tomatoes, sugar and remaining 1/2 cup butter. Cook until tomatoes are tender, about 20 minutes.\nStir tomatoes into lima beans and add corn; cook 10 minutes more.\n",
        "picture_link": "46nS.x7SYujKL5LYGXezEkwPXcRj6h6"
    },
    {
        "title": "Canadian Maple Rice Pudding",
        "ingredients": [
            "3/4 cup uncooked short-grain white rice ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "2 cups 2% milk ADVERTISEMENT",
            "1 teaspoon maple flavored extract ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1 pinch ground cloves ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the rice and water in a saucepan over medium heat. Bring to a boil, and let simmer over low heat for 20 minutes, or until all of the water has been absorbed.\nStir in 1 3/4 cups of the milk, sugar and maple flavoring, bring to a boil, and let simmer over medium heat until thick and creamy, about 15 minutes. Stir in the remaining milk, nutmeg, cinnamon, cloves and butter. Cook stirring over low heat for another 5 minutes. Pour into a casserole dish, or serving bowls, and let stand for 5 minutes before serving. This can be served cold also.\n",
        "picture_link": "xb43VYytO4klZ3Io4UDhWc.KjfONNBS"
    },
    {
        "title": "Coleslaw Dressing",
        "ingredients": [
            "1 egg yolk ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "1 tablespoon prepared mustard ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 cup white vinegar ADVERTISEMENT",
            "1/2 cup half-and-half ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan, stir together the egg yolk, sugar, mustard, butter and vinegar. Whisk together over medium heat and boil until thick. Remove from heat and cool. Whisk in the half-and-half. Refrigerate until using.\n",
        "picture_link": "qQLb9.X1ULrFJtj4zZ6MPnAY5EFZGeK"
    },
    {
        "title": "Curried Salmon Bake",
        "ingredients": [
            "1 cup sour cream ADVERTISEMENT",
            "1 teaspoon curry paste ADVERTISEMENT",
            "4 (6 ounce) fillets salmon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Coat a baking sheet with cooking spray.\nIn a bowl, mix the sour cream and curry paste. Spread the bottom of each salmon fillet with 1 tablespoon sour cream mixture, and arrange the fillets on the prepared baking sheet. Top fillets with remaining sour cream mixture.\nBake 25 minutes in the preheated oven, or until the salmon flakes easily with a fork.\n",
        "picture_link": "M3xQbd02I/grpc13com.MMLU7Cb9PQS"
    },
    {
        "title": "Strawberries and Cream Bread Pudding",
        "ingredients": [
            "2 tablespoons butter, melted ADVERTISEMENT",
            "7 (1 ounce) slices day-old bread, torn into small pieces ADVERTISEMENT",
            "3/4 cup chopped fresh strawberries ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 1/4 cups milk ADVERTISEMENT",
            "3/4 cup light cream ADVERTISEMENT",
            "1/4 cup strawberry preserves ADVERTISEMENT",
            "3/4 cup white sugar, or to taste ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Butter the bottom and sides of an 8 inch square baking dish with the melted butter.\nToss bread with the chopped strawberries, and place into the prepared pan. Beat the eggs, milk, cream, strawberry preserves, sugar, and vanilla in a medium bowl until frothy. Pour over the bread and lightly press down with a spatula until the bread has absorbed the milk mixture.\nBake in the preheated oven for 40 to 45 minutes, or until the top springs back when lightly tapped.\n",
        "picture_link": "qGA7BkoghxUj9wBnA73.YajEa.VtM9a"
    },
    {
        "title": "Banana Spring Rolls",
        "ingredients": [
            "2 large bananas ADVERTISEMENT",
            "8 (7 inch square) spring roll wrappers ADVERTISEMENT",
            "1 cup brown sugar, or to taste ADVERTISEMENT",
            "1 quart oil for deep frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oil in a deep-fryer or large cast-iron skillet to 375 degrees F (190 degrees C).\nPeel bananas, and slice them in half lengthwise, then crosswise into fourths. Place one piece of banana diagonally across the corner of a spring roll wrapper, and sprinkle with brown sugar to taste. Roll from the corner to the center, then fold top and bottom corners in, and continue rolling. Dip your finger in water and brush the last edge to seal. Repeat with remaining banana pieces.\nFry a few banana rolls at a time in the hot oil until evenly browned. Remove to paper towels to drain. Serve hot or cold.\n",
        "picture_link": "Ud/mpIA9Ca76b1SINJWJFHjxQBDvPq6"
    },
    {
        "title": "Frosty Strawberry Squares",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 cups sliced strawberries ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking dish.\nLine a rimmed baking sheet with aluminum foil. In a bowl, stir together the flour, brown sugar, walnuts and melted butter. Toast in the oven until walnuts are fragrant, about 15 minutes; stir occasionally. Sprinkle 2/3 of the walnut mixture evenly over the bottom of the 9x13 inch dish.\nIn a large bowl, whip the egg whites with the lemon juice until they can hold a soft peak. Gradually add white sugar while continuing to whip to firm peaks. Fold in the strawberries.\nIn a separate bowl, whip the cream with an electric mixer until stiff but not grainy. Fold into the strawberry mixture. Spoon over the crust in the dish and spread evenly. Top with the remaining walnut mixture. Freeze for 6 hours, or overnight.\n",
        "picture_link": "EiF6grTdVEOhDhEkGByrNkxDdZvN9IO"
    },
    {
        "title": "Blue Cheese Stuffed Mushrooms with Grilled Onions",
        "ingredients": [
            "1 pound fresh mushrooms, stems removed ADVERTISEMENT",
            "8 ounces blue cheese ADVERTISEMENT",
            "3 medium onions, sliced into rings ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for high heat, and lightly oil grate. Fill mushroom caps with crumbled blue cheese.\nPlace onion slices and mushrooms (cheese side up) onto the prepared grill. Turn onions over frequently until tender. Do not turn over mushrooms. Grill until blue cheese has melted, and mushrooms are tender. Remove mushrooms to a serving plate, and top with grilled onions.\n",
        "picture_link": "izcj1ZFq1mkfPGjmrThEe44qRHGnfpm"
    },
    {
        "title": "Field Grade Spaghetti Sauce",
        "ingredients": [
            "2 pounds lean ground beef ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup red wine ADVERTISEMENT",
            "1 (1 ounce) package dry onion soup mix ADVERTISEMENT",
            "1 (4.5 ounce) can canned mushrooms, drained ADVERTISEMENT",
            "2 teaspoons dried basil leaves, crushed ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon black pepper ADVERTISEMENT",
            "1 pinch ground cinnamon ADVERTISEMENT",
            "1 pinch ground allspice ADVERTISEMENT",
            "3 tablespoons chopped fresh parsley ADVERTISEMENT",
            "1 (28 ounce) can crushed tomatoes ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet, brown the meat with the garlic over medium heat. Stir in the wine; simmer, stirring often, for 10 minutes.\nMix in dry onion soup mix, mushrooms, basil, salt and pepper, cinnamon, allspice, parsley, crushed tomatoes, tomato paste, and water. Cover pan almost completely, allowing space for steam to escape, and simmer 1 hour. Add additional water if needed to prevent sticking.\n",
        "picture_link": "x7f.szwsXQoKqwCY.mARTMCiYtJ0VXC"
    },
    {
        "title": "Fresh Salsa II",
        "ingredients": [
            "2 ripe tomatoes, diced ADVERTISEMENT",
            "2 green bell peppers, diced ADVERTISEMENT",
            "1 white onion, diced ADVERTISEMENT",
            "1/2 bunch fresh cilantro, for garnish ADVERTISEMENT",
            "1 tablespoon fresh lemon juice ADVERTISEMENT",
            "1 jalapeno chile pepper, diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, mix tomatoes, green bell peppers, white onion, cilantro, lemon juice and jalapeno chile pepper. Cover and chill in the refrigerator until serving.\n",
        "picture_link": "T9UUjZIEXtUjXkG0euSHxdQipRsNbe."
    },
    {
        "title": "Easy Spiced Brown Rice With Corn",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "1 cup brown rice ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup frozen corn kernels ADVERTISEMENT",
            "1/2 teaspoon dried cilantro ADVERTISEMENT",
            "1/2 teaspoon cumin seed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan, mix the water, rice, olive oil, and salt, and bring to a boil. Mix in the corn, cilantro, and cumin. Reduce heat, cover, and simmer 45 to 60 minutes, until the liquid has been absorbed.\n",
        "picture_link": "ei2BRjdg3jYzzp92fjK/dPfOoIoh6CO"
    },
    {
        "title": "Pumpkin Fritters",
        "ingredients": [
            "1 cup pumpkin puree ADVERTISEMENT",
            "1 egg, lightly beaten ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon curry powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "4 cups vegetable oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, combine pumpkin, egg, flour, baking powder, curry powder, and salt. Mix until smooth.\nHeat oil in a deep saucepan to 325 degrees F (165 degrees C). Drop batter by spoonfuls into hot oil. Fry until golden brown, about 2 minutes. Remove with a slotted spoon, and serve immediately.\n",
        "picture_link": "RjAeCeB9MsSxNtDKrFZBPSvfjCysZLy"
    },
    {
        "title": "Curried Wild Rice and Squash Soup",
        "ingredients": [
            "1 cup uncooked wild rice ADVERTISEMENT",
            "3 cups water ADVERTISEMENT",
            "2 1/2 pounds butternut squash - peeled, seeded, and cubed ADVERTISEMENT",
            "2 1/2 cups chicken broth ADVERTISEMENT",
            "1/2 cup orange juice ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 medium onion, chopped ADVERTISEMENT",
            "1 clove garlic, finely chopped ADVERTISEMENT",
            "1 1/2 teaspoons curry powder ADVERTISEMENT",
            "1 1/4 teaspoons salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a pot, bring the wild rice and water to a boil. Reduce heat to low, cover, and simmer 45 minutes.\nPlace the squash in a medium pot with enough water to cover, and bring to a boil. Cook 15 minutes, or until tender. Drain, return to the pot, and mash. Mix in the chicken broth and orange juice.\nMelt the butter in a skillet over medium heat, and saute the onion and garlic until tender. Season with the curry powder. Reduce heat to low, and continue cooking about 12 minutes, stirring occasionally.\nIn a blender or food processor, blend the squash and broth with the onion and garlic mixture until smooth. Return to the medium pot, mix in the cooked wild rice, and cook until heated through. Season with salt and pepper to serve.\n",
        "picture_link": "MGLnRYQSfOcQ9si6QGohiWnt09oMiAC"
    },
    {
        "title": "Cheese Dip II",
        "ingredients": [
            "1 (2 pound) loaf processed cheese, cubed ADVERTISEMENT",
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "2/3 cup water ADVERTISEMENT",
            "1 (1.25 ounce) package taco seasoning mix ADVERTISEMENT",
            "1 (16 ounce) jar picante sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt processed cheese in a slow cooker set for high heat. Stir occasionally to avoid burning.\nPlace ground beef in a large skillet. Cook over medium high heat until evenly brown. Drain beef, and mix in water and taco seasoning mix. Cook and stir 2 to 4 minutes.\nStir seasoned beef into the melted processed cheese. Mix in salsa. Cook and stir until well blended. Serve warm.\n",
        "picture_link": "abgQ1/im.z6uV4NkUxX0Dihq1VU/7TS"
    },
    {
        "title": "Slow Cooker Spinach Marinara Sauce",
        "ingredients": [
            "1/4 cup olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "5 cloves garlic, minced ADVERTISEMENT",
            "1/3 cup grated carrot ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped spinach, thawed and drained ADVERTISEMENT",
            "2 2/3 (6 ounce) cans tomato paste ADVERTISEMENT",
            "1 (4.5 ounce) can sliced mushrooms, drained ADVERTISEMENT",
            "2 tablespoons salt ADVERTISEMENT",
            "2 tablespoons dried oregano ADVERTISEMENT",
            "2 tablespoons dried basil ADVERTISEMENT",
            "2 1/2 tablespoons crushed red pepper ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "1 (28 ounce) can peeled and crushed tomatoes, with liquid ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a 5 quart slow cooker, combine olive oil, onion, garlic, carrot, spinach, tomato paste, mushrooms, salt, oregano, basil, crushed red pepper, bay leaves and tomatoes.\nCover and cook on high for 4 hours. Stir, reduce heat to low and cook for 1 to 2 hours more.\n",
        "picture_link": "BWC3dVSipdCaHSu7QenF56FZv8qVLpy"
    },
    {
        "title": "Puerto Rican Garlic Marinade",
        "ingredients": [
            "1/2 cup olive oil ADVERTISEMENT",
            "4 teaspoons crushed garlic ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "2 1/2 teaspoons black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender or food processor, combine olive oil, garlic, salt, and pepper. Process for 3 to 5 minutes.\n",
        "picture_link": "CccWu/43lafR0eBz6K5BNhGaTB8YuF."
    },
    {
        "title": "One-Pan Taco Dinner",
        "ingredients": [
            "Nonstick cooking spray ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "1 (1.25 ounce) package taco seasoning mix ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "2 cups Minute® White Rice, uncooked ADVERTISEMENT",
            "1 cup shredded cheddar cheese ADVERTISEMENT",
            "2 cups shredded lettuce ADVERTISEMENT",
            "1 large tomato, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spray large nonstick skillet with nonstick cooking spray. Add meat and brown over medium-high heat; drain off excess fat.\nAdd seasoning mix and water; stir. Bring to boil.\nStir in rice. Sprinkle with cheese; cover. Reduce heat to low; simmer 5 minutes. Top with lettuce and tomato just before serving.\n",
        "picture_link": "3nfKDKAVBKD2YWeRHnId7yN5gMer/RW"
    },
    {
        "title": "Goat Cheese Stuffed Lamb Burgers",
        "ingredients": [
            "1 teaspoon olive oil ADVERTISEMENT",
            "1/2 cup diced onion ADVERTISEMENT",
            "2 pounds ground lamb ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup bread crumbs ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "4 1/2 teaspoons salt ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "4 ounces soft goat cheese ADVERTISEMENT",
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "1 tablespoon chopped fresh basil leaves ADVERTISEMENT",
            "1 tablespoon chopped fresh oregano ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1 teaspoon of olive oil in a small skillet over medium heat. Cook and stir the onions in the oil until soft and translucent, about 5 minutes.\nGently knead together the softened onions, lamb, egg, bread crumbs, garlic, salt, and pepper. Divide the mixture into 6 parts and roll into balls, then cover and refrigerate until ready to use.\nMix together the goat cheese, extra-virgin olive oil, basil, and oregano until well combined; cover and chill for 5 minutes.\nPreheat an outdoor grill for medium-high heat.\nWorking with one portion of meat at a time, make an indentation in the center of the ball with your thumb. Fill the indentation with a heaping tablespoon of the goat cheese mixture. Gently pull and form the meat patty around the cheese filling, making a burger-shaped patty. Repeat with each ball of the lamb mixture.\nGrill the patties on the preheated grill until no longer pink in the center and well done, about 8 minutes per side.\n",
        "picture_link": "p3O6b9tAk3AX3.m5dZ3jYlxV2AINHmi"
    },
    {
        "title": "Pumpkin Chipotle Pasta Sauce",
        "ingredients": [
            "1 tablespoon unsalted butter ADVERTISEMENT",
            "3 tablespoons minced sweet onion ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1 cup pumpkin puree ADVERTISEMENT",
            "2 chipotle peppers in adobo sauce, chopped ADVERTISEMENT",
            "1/3 cup low-fat milk ADVERTISEMENT",
            "1 teaspoon ground sage ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground coriander ADVERTISEMENT",
            "1 pinch ground cinnamon ADVERTISEMENT",
            "1 pinch ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a saucepan over medium heat, and cook and stir the onion and garlic until the onion is translucent, about 3 minutes. Whisk in the chicken broth, and bring to a boil; whisk in the pumpkin puree, chipotle peppers and their sauce, milk, sage, salt, coriander, cinnamon, and nutmeg. Allow sauce to come to a simmer, then lower heat to hold at a simmer until serving time.\n",
        "picture_link": "25/Jcfof7WPiTEOF3YY1XI8qU5fHiAW"
    },
    {
        "title": "Spicy Albondigas",
        "ingredients": [
            "Meatballs ADVERTISEMENT",
            "2 pounds ground beef ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup bread crumbs ADVERTISEMENT",
            "1/2 cup uncooked white rice ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "Soup ADVERTISEMENT",
            "10 cups chicken broth ADVERTISEMENT",
            "4 carrots, sliced ADVERTISEMENT",
            "1/2 large onion, chopped ADVERTISEMENT",
            "4 stalks celery, sliced ADVERTISEMENT",
            "1 (10 ounce) can diced tomatoes with green chile peppers (such as RO*TEL®) ADVERTISEMENT",
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "1 (7 ounce) can diced green chiles, drained ADVERTISEMENT",
            "1 bunch cilantro leaves, chopped ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine ground beef, egg, bread crumbs, rice, cumin, garlic powder, and salt in a large bowl. Mix well.\nBring chicken broth to a boil over medium heat in a large kettle.\nForm the beef mixture into 1 inch meatballs, using about 1 1/2 tablespoons of meat for each. Turn the heat down under the chicken broth to a simmer and drop the meatballs into the broth. Simmer the meatballs in the broth for 20 minutes, until meatballs are cooked through.\nStir in the carrots, onion, celery, canned diced tomatoes with green chiles, tomato sauce, canned chiles, cilantro, garlic powder, oregano, and cumin. Simmer the soup for 1 hour to cook the vegetables and blend the flavors.\n",
        "picture_link": "RBshpydZlQmB38pkgMHzoOeGwuhq/j."
    },
    {
        "title": "Yin-Yang Salmon",
        "ingredients": [
            "1/2 cup hot red pepper sauce ADVERTISEMENT",
            "1/2 cup brown sugar, or to taste ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "2 tablespoons fresh lemon juice ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 (2 pound) boneless salmon fillet ADVERTISEMENT",
            "1/4 cup chopped green onions ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 pinch freshly ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together the hot sauce, brown sugar, butter, honey, and lemon juice in a saucepan over medium heat. Stir continuously for 3 to 4 minutes, until the sugar has dissolved and the mixture is well blended. Remove from heat, and set aside.\nCoat a casserole dish with olive oil. Poke holes in the salmon with a fork, then place into the dish. Pour reserved sauce over the fish, top with green onions, and season with salt and pepper. Marinate for 30 minutes.\nPreheat oven to 425 degrees F (220 C).\nBake salmon in preheated oven, uncovered, until the fish flakes easily with a fork, about 25 minutes.\n",
        "picture_link": "IFj3tA4r8l5C6AEjYAMBcjb7AsqqPvy"
    },
    {
        "title": "Cheesy Potato Pancakes",
        "ingredients": [
            "4 russet potatoes, peeled and grated ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/4 cup real bacon bits (optional) ADVERTISEMENT",
            "1 teaspoon onion salt ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/4 cup corn oil ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together potatoes, eggs, and milk in a large bowl.\nStir flour, Parmesan cheese, Cheddar cheese, bacon bits, onion salt, baking powder, salt, and black pepper into potato mixture using a fork.\nHeat corn oil and butter in a large skillet over medium heat.\nSpoon about 2 tablespoons potato mixture into per patty into skillet. Cook patties until golden brown, about 4 minutes per side.\nDrain cooked pancakes on paper towel-lined plate.\n",
        "picture_link": "wrD1Y6Qc.a.GhVbwEpQH26Eivp1EkE6"
    },
    {
        "title": "Chef Scott's Pico de Gallo",
        "ingredients": [
            "7 tomatoes, cut into 1/4-inch dice ADVERTISEMENT",
            "1 large red onion, cut into 1/4-inch dice ADVERTISEMENT",
            "2 cups chopped fresh cilantro ADVERTISEMENT",
            "2 jalapeno peppers, seeded and minced ADVERTISEMENT",
            "2 tablespoons salt ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "2 tablespoons lime juice ADVERTISEMENT",
            "1/2 cup distilled white vinegar ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the tomatoes, red onion, cilantro, jalapeno pepper, salt, black pepper, garlic, and lime juice into a large mixing bowl. Pour in the vinegar and vegetable oil, and gently mix to combine. Cover, and refrigerate 1 hour before serving.\n",
        "picture_link": "CJms6WI5R5fdTl88tB9WIAGcar/xEBq"
    },
    {
        "title": "Caribbean Grilled Crab Cakes",
        "ingredients": [
            "For Crab Cakes: ADVERTISEMENT",
            "3/4 pound crabmeat ADVERTISEMENT",
            "1 cup plain bread crumbs ADVERTISEMENT",
            "3/4 cup mayonnaise ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "2 green onions, minced ADVERTISEMENT",
            "Hot sauce, to taste ADVERTISEMENT",
            "Salt and pepper, to taste ADVERTISEMENT",
            "For Mango Salsa: ADVERTISEMENT",
            "1 mango, peeled, pitted and diced ADVERTISEMENT",
            "1 red onion, diced ADVERTISEMENT",
            "3 tablespoons chopped fresh basil ADVERTISEMENT",
            "3 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "Minced jalapeno, to taste ADVERTISEMENT",
            "Salt and pepper, to taste ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Drain the crabmeat. In a large bowl, mix the crabmeat, bread crumbs, mayonnaise, egg, green onions, hot sauce, and salt and pepper until combined. Shape the mixture into 16 small cakes. Refrigerate for 30 minutes.\nMeanwhile, in a small bowl combine the diced mango, onion, basil, cilantro, lime juice, jalapeno (if using), and salt and pepper. Refrigerate until ready to use.\nTo grill: Preheat grill for medium heat and lightly oil the grate or a grill basket. Grill about 8 minutes, turning once.\nTo pan-fry: Heat 2 tablespoons vegetable oil in a large skillet over medium heat. Cook crab cake patties until crisp and golden brown on both sides, about 4 minutes per side.\nTop crab cakes with mango salsa and enjoy.\n",
        "picture_link": "yde37rTP4ubPfME8CRb72uzQdTAPnVu"
    },
    {
        "title": "Black-Eyed Peas with Pork and Greens",
        "ingredients": [
            "1 pound dried black-eyed peas ADVERTISEMENT",
            "1 pound pork neck bones ADVERTISEMENT",
            "3 slices bacon, cut into 1/2-inch pieces ADVERTISEMENT",
            "1 cup diced onion ADVERTISEMENT",
            "1 cup diced celery ADVERTISEMENT",
            "1 cup diced carrot ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "6 cups cold water ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 pinch cayenne pepper, or to taste ADVERTISEMENT",
            "1 (10 ounce) can diced tomatoes with green chile peppers ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "6 ounces smoked ham, diced ADVERTISEMENT",
            "1 bunch kale, ribs removed and leaves torn into pieces ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place black-eyed peas into a large container and cover with several inches of cool water; let stand 8 hours to overnight. Drain and set aside.\nCook pork necks and bacon in a Dutch oven over medium heat until lightly browned, about 5 minutes.\nStir in onion, celery, and carrot; cook and stir until softened, 6 to 7 minutes. Stir in garlic and cook 1 minute.\nPour cold water and black-eyed peas into pork mixture; increase heat to high.\nStir in bay leaf, thyme, cumin, black pepper, and cayenne pepper. Bring mixture to a simmer, reduce heat to low, cover, and simmer for 45 minutes.\nStir in tomatoes and salt. Simmer uncovered until beans are tender, about 40 minutes.\nRemove neck bones from mixture; separate any meat from bones, return meat to Dutch oven, and discard bones.\nStir in diced ham and kale; cook until greens are tender, 10 to 15 minutes. Serve over rice.\n",
        "picture_link": "noJ184lKv63IH5Jvjp3QJPG4lKFZIdC"
    },
    {
        "title": "PHILADELPHIA Double-Chocolate Cheesecake",
        "ingredients": [
            "24 OREO Cookies, crushed ADVERTISEMENT",
            "1/4 cup butter or margarine, melted ADVERTISEMENT",
            "4 (8 ounce) packages PHILADELPHIA Cream Cheese, softened ADVERTISEMENT",
            "1 cup sugar ADVERTISEMENT",
            "2 tablespoons flour ADVERTISEMENT",
            "1 teaspoon vanilla ADVERTISEMENT",
            "1 (8 ounce) package BAKER'S Semi-Sweet Chocolate, melted ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/2 cup blueberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 325 degrees F.\nMix crumbs and butter; press onto bottom of 13x9-pan lined with foil. Bake 10 min.\nBeat cream cheese, sugar, flour and vanilla with mixer until blended. Add chocolate; mix well.\nAdd eggs, 1 at a time, mixing on low after each just until blended. Pour over crust.\nBake 45 minutes or until center is almost set. Cool. Refrigerate 4 hours. Use foil to lift cheesecake from pan. Top with berries.\n",
        "picture_link": "68mA72wbocgvJwO3mVq4u2NVvJqcCVi"
    },
    {
        "title": "Smoked Cheese Ravioli",
        "ingredients": [
            "1 (16 ounce) package frozen cheese ravioli ADVERTISEMENT",
            "1 cup half-and-half cream ADVERTISEMENT",
            "1 cup shredded smoked Gouda cheese ADVERTISEMENT",
            "1 teaspoon chopped fresh parsley ADVERTISEMENT",
            "1 teaspoon white pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a rolling boil over high heat; stir in the frozen ravioli and return to a boil. Cook uncovered, stirring occasionally, until the ravioli float to the top and the filling is hot, 6 to 8 minutes. Drain.\nMeanwhile, bring the half-and-half to a simmer in a saucepan over medium heat. Whisk in the Gouda cheese until melted; season with parsley and white pepper. Pour the sauce over the cooked ravioli to serve.\n",
        "picture_link": "n8/9mGUnWW/PYEEPyFjW.0rXDUpW23."
    },
    {
        "title": "Southern-Style Pork Chops",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 (1 ounce) package dry onion soup mix ADVERTISEMENT",
            "6 boneless pork chops ADVERTISEMENT",
            "3/4 cup white wine ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a large, deep skillet over medium heat. Liberally sprinkle the onion soup mix over both sides of the pork chops. Fry the pork chops in the hot oil until the pork is no longer pink in the center, 4 to 6 minutes per side. Remove the chops from the skillet, and set aside.\nPour the white wine into the pan; bring to a boil while scraping the browned bits of food off of the bottom of the pan with a wooden spoon. Reduce heat to low. Stir the heavy cream, and season with garlic powder and salt and pepper. Gently lay the pork chops in the pan, turning to coat in the sauce. Simmer until thoroughly reheated, 5 to 10 minutes.\n",
        "picture_link": "69AU9k../dPikHlvsPgtyqOS..iGyO2"
    },
    {
        "title": "Unbelievable Squash Casserole",
        "ingredients": [
            "2 teaspoons vegetable oil ADVERTISEMENT",
            "3 crookneck yellow squash, diced ADVERTISEMENT",
            "1/2 sweet yellow onion, diced ADVERTISEMENT",
            "2 tablespoons water, or as needed ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1 (8 ounce) container sour cream ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese (optional) ADVERTISEMENT",
            "1/2 (6 ounce) box dry bread stuffing mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a baking dish.\nHeat oil in a skillet over medium heat; cook and stir squash and onion until tender, 8 to 10 minutes. Add water and simmer to soften squash, 2 to 4 minutes. Stir cream of chicken soup, sour cream, and Cheddar cheese into squash mixture; mix well.\nTransfer squash mixture to the prepared baking dish; top with stuffing mix.\nBake in the preheated oven until cheese is bubbling and stuffing is browned, about 30 minutes.\n",
        "picture_link": "7/4t5gJl6WxCRC0PxyDU7u2xlUGFKqy"
    },
    {
        "title": "Yogurt-Marinated Salmon Fillets (Dahi Machhali Masaledar)",
        "ingredients": [
            "1 cup fat-free plain yogurt ADVERTISEMENT",
            "1/2 tablespoon cayenne pepper ADVERTISEMENT",
            "6 cloves garlic, minced ADVERTISEMENT",
            "2 (2 inch) pieces fresh ginger root, minced ADVERTISEMENT",
            "2 tablespoons cilantro, finely chopped ADVERTISEMENT",
            "1 tablespoon ground coriander seed ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground turmeric ADVERTISEMENT",
            "4 (6 ounce) skinless, boneless salmon fillets ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the yogurt, cayenne pepper, garlic, ginger, cilantro, ground coriander, cumin, salt and turmeric in a resealable plastic bag. Close bag and mix everything together until evenly combined. Add the salmon and toss until well coated with the marinade; marinate overnight.\nPreheat the oven broiler. Lightly grease a baking pan.\nRemove salmon from marinade and shake off excess; discard remaining marinade. Place onto prepared baking pan and broil in preheated oven until salmon flakes easily with a fork, five to seven minutes per side.\n",
        "picture_link": ".NeC908mFhnGB.LPa7qTSfaHUpI0Iy."
    },
    {
        "title": "Lemon Zucchini Muffins",
        "ingredients": [
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "3/4 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 zucchini, shredded ADVERTISEMENT",
            "1 (8 ounce) container lemon yogurt ADVERTISEMENT",
            "6 tablespoons butter, melted ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 tablespoon lemon zest ADVERTISEMENT",
            "1/3 cup lemon juice ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "2 teaspoons lemon zest ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease 12 muffin cups, or line with paper muffin liners.\nMix flour, 3/4 cup sugar, baking powder, baking soda, and salt in a large bowl; make a well in the center of the flour mixture. Mix zucchini, yogurt, butter, egg, 1 tablespoon lemon juice, and 1 tablespoon lemon zest in a separate bowl; pour yogurt mixture into well. Gently stir yogurt, slowly incorporating the flour mixture until just blended. Batter may be slightly lumpy. Pour batter evenly into prepared muffin cups.\nBake in preheated oven until a toothpick inserted into the center of a cupcake comes out clean, about 20 minutes.\nWhile muffins are baking, whisk 1/3 cup lemon juice, 1/4 cup sugar, and 2 teaspoons lemon zest together in a saucepan over medium heat until mixture comes to a simmer and sugar is dissolved, about 5 minutes. Cover and keep glaze warm over low heat.\nPoke each muffin several times with a toothpick; spoon glaze over muffins. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "TMxY7t/ysm2sGm5vgdg3sdXz3mJCrda"
    },
    {
        "title": "Marty's Thai Chicken Satay",
        "ingredients": [
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "2 teaspoons tamarind paste ADVERTISEMENT",
            "1 stalk lemon grass, chopped ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon ground coriander ADVERTISEMENT",
            "1 tablespoon lime juice ADVERTISEMENT",
            "1 teaspoon muscovado sugar ADVERTISEMENT",
            "1/2 teaspoon chili powder ADVERTISEMENT",
            "2 pounds skinless, boneless chicken breast, cut into strips ADVERTISEMENT",
            "20 wooden skewers, soaked in water for 30 minutes ADVERTISEMENT",
            "2 tablespoons crunchy peanut butter ADVERTISEMENT",
            "2 tablespoons chopped peanuts ADVERTISEMENT",
            "1 (14 ounce) can coconut milk ADVERTISEMENT",
            "2 teaspoons red Thai curry paste ADVERTISEMENT",
            "1 tablespoon fish sauce ADVERTISEMENT",
            "1 teaspoon tomato paste ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place vegetable oil, soy sauce, tamarind paste, lemon grass, garlic, cumin, coriander, lime juice, muscovado sugar, and chili powder in a blender and process to a smooth paste. In a large bowl, or a large resealable plastic bag, toss chicken strips with marinade. Refrigerate for 1 hour.\nPreheat an outdoor grill for medium-high heat, and lightly oil the grate.\nIn a small saucepan, combine peanut butter, peanuts, coconut milk, curry paste, fish sauce, tomato paste, and brown sugar. Cook and stir over medium-low heat until smooth. Keep warm.\nThread chicken onto skewers. Grill until no longer pink in the center, 3 to 5 minutes on each side. Serve with peanut sauce.\n",
        "picture_link": "0LhS92LvpDJnbAr8pyLuaFLzkn8tJm6"
    },
    {
        "title": "Tex-Mex Patty Melts",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "3 tablespoons chili seasoning mix ADVERTISEMENT",
            "2 chipotle peppers in adobo sauce, minced ADVERTISEMENT",
            "1/2 fluid ounce beer ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "1 chipotle pepper in adobo sauce, minced ADVERTISEMENT",
            "6 (1 ounce) slices white bread ADVERTISEMENT",
            "6 (1/2 ounce) slices pepperjack cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together the ground beef, chili seasoning mix, 2 minced chipotle peppers with adobo sauce, and the beer in a bowl. Divide the mixture evenly into three patties.\nStir together the mayonnaise and 1 minced chipotle pepper with adobo sauce in a small bowl. Divide the mixture between the bread slices and spread evenly. Place a slice of pepperjack cheese on top of the mayonnaise mixture on each slice of bread.\nHeat a large skillet over medium-high heat. Cook the patties in the skillet until no longer pink in the center, 5 to 7 minutes each side for well done. Remove each burger to a slice of bread, sandwiching them with the remaining slices.\nDrain the skillet, reserving 2 tablespoons of the grease. Heat the reserved grease in the skillet over medium-high heat. Grill the sandwiches in the skillet until the bread is golden brown and the cheese is melted, 1 to 2 minutes per side.\n",
        "picture_link": "V4lfubBrK.o42YWeBnhxn1RQdNaXhVG"
    },
    {
        "title": "Macaroni and Tomatoes",
        "ingredients": [
            "1 (8 ounce) package macaroni ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 teaspoon bacon grease ADVERTISEMENT",
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "1 (14.5 ounce) can chopped stewed tomatoes, with juice ADVERTISEMENT",
            "1/2 teaspoon white sugar ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the macaroni, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, about 8 minutes. Drain well in a colander set in the sink.\nPour the macaroni into a saucepan and place over medium heat; stir in the butter, bacon grease, tomato sauce, stewed tomatoes with juice, and sugar; season with salt and pepper. Stir while cooking until butter and bacon grease has melted and incorporated completely, 5 to 10 minutes; remove from heat, cover, and allow to sit about 20 minutes before serving.\n",
        "picture_link": "n5pdyDs/aNdWouK8m8V9vKulDDw3wjq"
    },
    {
        "title": "Chocolate Strawberry Banana Milkshake",
        "ingredients": [
            "1 cup low-fat milk ADVERTISEMENT",
            "1/2 cup frozen unsweetened strawberries ADVERTISEMENT",
            "1/2 ripe banana ADVERTISEMENT",
            "2 tablespoons powdered chocolate drink mix ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender combine milk, frozen strawberries, 1/2 banana, chocolate milk powder, vanilla and sugar. Blend until smooth. If consistency is too runny, you may add more strawberries.\n",
        "picture_link": ".SBpbPjguTxYbAiCoinNY9.xaVo5iKi"
    },
    {
        "title": "Green Bean and Feta Salad",
        "ingredients": [
            "1 1/2 pounds fresh green beans ADVERTISEMENT",
            "1 sweet onion, peeled ADVERTISEMENT",
            "2 cloves garlic, chopped ADVERTISEMENT",
            "1/2 cup rice wine vinegar ADVERTISEMENT",
            "1/2 cup apple cider vinegar ADVERTISEMENT",
            "1/3 cup canola oil ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 dash hot sauce ADVERTISEMENT",
            "1 dash Worcestershire sauce ADVERTISEMENT",
            "4 ounces feta cheese, crumbled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Thinly slice the onion and place into a colander over the sink. Add the cleaned green beans to a large pot of boiling water and boil until crisp tender (about 4 minutes). When the beans are done, drain the water into the colander to slightly cook the onions. Immediately rinse all in cold water to stop the cooking process.\nFor the dressing: In a large bowl, whisk together the garlic, rice wine vinegar, cider vinegar, oil, sugar, salt, pepper, hot sauce and Worcestershire sauce. Add beans, onions and cheese and stir until combined. Place in a nonreactive container and refrigerate for at least 4 hours. Enjoy!\n",
        "picture_link": "fSmCgB9jWSnA1BNH5ZrLUBbB.ZsyzXK"
    },
    {
        "title": "Ice Pops",
        "ingredients": [
            "1 (3 ounce) package fruit flavored Jell-O® mix ADVERTISEMENT",
            "1 unsweetened, flavored soft drink mix package ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 cups boiling water ADVERTISEMENT",
            "2 cups cold water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dissolve gelatin, soft drink mix and sugar in boiling water. Stir in cold water and pour into popsicle molds or small plastic drinking cups. Add popsicle sticks when firm but not frozen completely; freeze until hard.\n",
        "picture_link": "7BQwYoiI/B64RcWnZv33inDPbt/0pPO"
    },
    {
        "title": "Power Cookies",
        "ingredients": [
            "4 cups rolled oats ADVERTISEMENT",
            "1 (15 ounce) can cannellini beans, drained and rinsed ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 cup chopped pitted dates ADVERTISEMENT",
            "1/2 cup flaked coconut ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 325 degrees F (165 degrees C). Grease cookie sheets. Grind the oats in a blender until resembling coarse flour.\nIn a medium bowl, mash beans to a smooth paste. Stir in the white sugar, brown sugar and vanilla until well blended. Combine the ground oats, baking powder, baking soda and cinnamon; blend into the bean mixture. Stir in the dates, coconut, raisins and walnuts. Drop dough by heaping spoonfuls onto the prepared cookie sheet.\nBake for 10 to 15 minutes in the preheated oven, until golden. Cool on baking sheets for 5 minutes then remove to wire racks to cool completely.\n",
        "picture_link": "6K92koC7bwY0s4wmDwIVEM0lZtFKCmS"
    },
    {
        "title": "Southern Fried Chicken Strips",
        "ingredients": [
            "30 saltine crackers ADVERTISEMENT",
            "2 tablespoons dry potato flakes ADVERTISEMENT",
            "1 teaspoon seasoned salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "3 skinless, boneless chicken breast halves, cut into 1-inch strips ADVERTISEMENT",
            "1/4 cup vegetable oil, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place crackers in a resealable bag; crush into coarse crumbs. Mix cracker crumbs, potato flakes, seasoned salt, and black pepper together in a shallow bowl. Beat egg in a separate small bowl. Place flour in a third shallow bowl.\nCoat chicken pieces in flour, beaten egg, and cracker mixture, respectively.\nHeat vegetable oil in a large skillet over medium heat. Pan-fry chicken strips until no longer pink in the center and coating is golden brown, 15 to 20 minutes.\n",
        "picture_link": "l8EDd6ob7c.MYeWPzzUWXs2SZoACqVy"
    },
    {
        "title": "Pork Fried Quinoa",
        "ingredients": [
            "1 cup quinoa ADVERTISEMENT",
            "1 1/2 cups cold water ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 cup cubed fully cooked ham ADVERTISEMENT",
            "1/2 cup diced red bell pepper ADVERTISEMENT",
            "1/2 cup chopped green onion, white and green parts separated ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon rice vinegar ADVERTISEMENT",
            "1 tablespoon soy sauce, or to taste ADVERTISEMENT",
            "1 teaspoon chile-garlic sauce (such as Sriracha®), or more to taste (optional) ADVERTISEMENT",
            "1 teaspoon sesame seeds, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse quinoa in cold water for about 1 minute and drain well.\nPlace in a saucepan and cover with 1 1/2 cup cold water and salt. Bring to a boil and reduce heat to low. Simmer, covered, until quinoa is tender, about 15 minutes. Remove from heat and let sit for 5 minutes.\nFluff quinoa with a fork and set aside.\nHeat vegetable oil in a large skillet over medium heat. Cook and stir ham, red bell pepper, and the white parts of the green onion until the ham begins to brown, about 5 minutes. Set chopped green onion tops aside. Add garlic, remove from heat, and stir until garlic becomes aromatic, 1 or 2 minutes.\nStir in quinoa and return to stove over medium-low heat. Cook and stir until warmed through, 2 to 3 minutes. Remove from heat and add vinegar, soy sauce, chile-garlic sauce, and sesame seeds. Garnish with reserved green onion tops.\n",
        "picture_link": "LKsKiqbsxU3UcVBIzmrFBdzNN7V6UJu"
    },
    {
        "title": "Smooth Buttercream Frosting",
        "ingredients": [
            "1/2 cup vegetable shortening ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "5 cups confectioners' sugar ADVERTISEMENT",
            "3 tablespoons milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Beat shortening and butter in a large bowl with an electric mixer until smooth, about 3 minutes; stir in vanilla extract. Beat sugar, one cup at a time, into butter mixture on medium speed. Add milk and beat on high speed until light and fluffy.\nKeep icing covered with a damp cloth until ready to decorate. For best results, keep icing refrigerated when not using.\n",
        "picture_link": "hwn7rRvKzSlCkmiczQgU/dVz1uqI4eq"
    },
    {
        "title": "Roasted Asparagus with Balsamic Vinegar",
        "ingredients": [
            "2 pounds fresh asparagus, trimmed ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/2 pinch ground sea salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "3 tablespoons balsamic vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (205 degrees C).\nPlace asparagus in a shallow 9x13-inch baking dish. Sprinkle with oil, salt, and pepper; toss to coat.\nBake in preheated oven until lightly browned, 15 to 20 minutes. Drizzle with vinegar just before serving.\n",
        "picture_link": "zLyBbWEc5cpWytqGrMtVQBAXmOXmUTu"
    },
    {
        "title": "Bengali Chicken Curry with Potatoes",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 large onions, diced ADVERTISEMENT",
            "1 tablespoon ginger-garlic paste ADVERTISEMENT",
            "2 large tomatoes, diced ADVERTISEMENT",
            "1 teaspoon cayenne pepper, or more to taste ADVERTISEMENT",
            "1 teaspoon curry powder ADVERTISEMENT",
            "1 teaspoon garam masala ADVERTISEMENT",
            "1 teaspoon ground turmeric ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves - cut into bite-size pieces ADVERTISEMENT",
            "2 large red-skinned potatoes, chopped ADVERTISEMENT",
            "1/2 cup fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large skillet over medium-high heat. Cook and stir the onions in the hot oil until translucent, about 5 minutes. Add the ginger-garlic paste and continue cooking another 5 minutes. Reduce heat to medium; stir the tomatoes into the mixture and cook until the tomatoes are pulpy, 5 to 10 minutes. Season with the cayenne pepper, curry powder, garam masala, turmeric, and cumin; cook and stir another 5 minutes.\nAdd the chicken and potatoes to the mixture in the skillet; simmer, stirring occasionally, until the potatoes are tender and the chicken is no longer pink in the center, about 20 minutes. Sprinkle the cilantro over the mixture and continue simmering another 10 minutes. Serve hot.\n",
        "picture_link": "LoWo8vOjvHMoSpajyvi8wImktNxECoK"
    },
    {
        "title": "Jack-O-Lantern Pumpkin Pancakes",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 cup quick cooking oats ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "3/4 cup canned pumpkin ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "3/4 cup semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together flour, oats, brown sugar, baking powder, cinnamon, cloves, and salt in a large bowl. In a separate large bowl, lightly beat together the milk, egg, pumpkin, and oil. Stir flour mixture into the pumpkin mixture, blending just until moistened.\nHeat a lightly greased griddle over medium high heat.\nPour batter, 1/3 cup at a time, onto the prepared griddle. Make a jack-o-lantern face in each pancake with the chocolate chips. Cook until bubbles appear on the surface, then flip and cook until golden brown on the other side, about 5 minutes per side.\n",
        "picture_link": "vnpi0GuQvYorJ2gZ4PaX71iGp1wWk8i"
    },
    {
        "title": "Greek Slow Cooker Chicken",
        "ingredients": [
            "1 (3 pound) whole chicken, skin removed ADVERTISEMENT",
            "1 lemon, cut in half ADVERTISEMENT",
            "6 cloves peeled garlic, or more to taste (divided) ADVERTISEMENT",
            "6 red potatoes, sliced into 1-inch thick rounds ADVERTISEMENT",
            "1 large onion, roughly chopped ADVERTISEMENT",
            "1/4 cup white wine ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 teaspoon chicken bouillon granules ADVERTISEMENT",
            "1/4 cup boiling water ADVERTISEMENT",
            "2 teaspoons dried oregano ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse the chicken, inside and out. Place one half of the lemon and 3 garlic cloves in cavity of chicken. Reserve other half of lemon.\nLayer the sliced potatoes and the onions in the crock of a slow cooker. Sprinkle remaining 3 garlic cloves around the inside of the cooker; place chicken onto the vegetables. Pour in the wine and olive oil. Dissolve bouillon in the boiling water, and add to the cooker.\nSqueeze the juice of remaining lemon half over chicken (strain out seeds); sprinkle with oregano. Season chicken with salt and black pepper.\nCover, and cook on Low setting for 8-10 hours, or on High setting 4-6 hours. A meat thermometer, inserted into the thickest part of a thigh, not touching a bone, should read at least 160 degrees F (70 degrees C).\n",
        "picture_link": "xeioV4S8CgNSKoYY/sjliBC9yc/fa3m"
    },
    {
        "title": "Super Lemon Ice Cream ",
        "ingredients": [
            "2 cups heavy whipping cream ADVERTISEMENT",
            "1 cup half-and-half cream ADVERTISEMENT",
            "1 1/8 cups white sugar ADVERTISEMENT",
            "3 tablespoons grated lemon zest ADVERTISEMENT",
            "5 egg yolks ADVERTISEMENT",
            "3/4 cup fresh lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine heavy cream, half and half, sugar, and lemon zest in a saucepan; bring to a simmer over low heat. Cook and stir until sugar is dissolved, about 5 minutes. Remove from heat. Cover saucepan and allow the mixture to steep for 10 minutes.\nUncover pan and bring back to a simmer over low heat. Beat the egg yolks in a bowl. Gradually stir one cup of the hot cream mixture into the eggs, several tablespoons at a time. This will help to bring the eggs up to temperature without scrambling them. Stir the egg mixture back into the cream mixture in the saucepan. Cook and stir over low heat until the mixture just coats the back of a spoon, 5 to 10 minutes. Transfer to a large bowl; cover. Refrigerate overnight.\nStir the lemon juice into the cold ice cream mixture. Freeze in a 4 to 5 quart ice cream maker according to manufacturer's directions. Transfer ice cream to a lidded freezer container, and freeze for 4 hours to ripen flavors before serving.\n",
        "picture_link": "EyYu.twuP7CO0O3nHsiVFQaWFqTt4pu"
    },
    {
        "title": "My Favorite Beet Salad",
        "ingredients": [
            "6 large beets, trimmed ADVERTISEMENT",
            "1/4 cup extra virgin olive oil ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 (8 ounce) package baby spinach leaves ADVERTISEMENT",
            "2 tomatoes, cut into bite-sized pieces ADVERTISEMENT",
            "2 avocados - peeled, pitted, and cut into bite-sized pieces ADVERTISEMENT",
            "1/2 red onion, chopped, or to taste ADVERTISEMENT",
            "1 (4 ounce) container crumbled feta cheese ADVERTISEMENT",
            "1/2 cup balsamic vinegar ADVERTISEMENT",
            "1/2 cup extra-virgin olive oil ADVERTISEMENT",
            "1 tablespoon Dijon mustard, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nPlace the beets into a large bowl, and drizzle with 1/4 cup olive oil, salt, and black pepper. Lay out 2 large squares of aluminum foil on a work surface, and place 3 beets onto the center of each sheet. Fold the aluminum foil into 2 envelopes, sealing the beets into the packets; place the packets into a baking dish.\nBake in the preheated oven until tender, 1 to 1 1/2 hours. Check for tenderness after 1 hour by piercing a beet with a fork. Open the foil, and allow the beets to cool until they can be handled; peel, and slice.\nLay out the spinach leaves on an attractive oblong-shaped serving platter. Sprinkle pieces of tomato and avocado over the spinach leaves, and top with chopped red onion. Lay the sliced warm beets over the salad, and top with crumbled feta cheese.\nWhisk together balsamic vinegar, 1/2 cup of olive oil, and Dijon mustard until smooth; pour over the salad to serve.\n",
        "picture_link": "sNXE9tlHuqE43ouUSxS.ygZJW32SmOC"
    },
    {
        "title": "Low Fat Full Flavor Cream of Broccoli Soup",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "4 leeks, chopped ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon fresh ground black pepper ADVERTISEMENT",
            "1/4 teaspoon ground coriander ADVERTISEMENT",
            "2 heads fresh broccoli, chopped ADVERTISEMENT",
            "1 (32 ounce) carton low-sodium chicken broth ADVERTISEMENT",
            "1 (12 fluid ounce) can fat-free evaporated milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large pot, and cook the leeks over medium heat until soft and translucent, about 5 minutes. Stir in salt, pepper, and coriander. Reserve about 1/4 cup of small broccoli florets, and cook the rest of the broccoli with the leeks until the broccoli is bright green, about 5 more minutes. Pour in the chicken stock, bring the soup to a boil, cover, then simmer until the broccoli is very tender, 10 to 15 minutes.\nPour the soup into a blender, filling the pitcher no more than halfway full. Hold down the lid of the blender with a folded kitchen towel, and carefully start the blender, using a few quick pulses to get the soup moving before leaving it on to puree. Puree in batches until smooth and pour into a clean pot. Alternately, you can use a stick blender and puree the soup right in the cooking pot.\nReturn the blended soup to the pot, stir in the reserved broccoli florets, and bring to a simmer over medium-low heat, stirring often. Simmer until the broccoli florets are tender, 5 to 7 minutes. Remove from heat, and mix in the condensed milk. Serve hot.\n",
        "picture_link": "atCmnWyD4zEY/J.ZxlPyZcmn7lSNgXy"
    },
    {
        "title": "Pork Tenderloin with Balsamic Plum Reduction",
        "ingredients": [
            "1 pork tenderloin ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 1/2 plums, pitted and chopped ADVERTISEMENT",
            "2 tablespoons balsamic vinegar ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "2 tablespoons blueberry juice (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with foil.\nSeason the pork tenderloin with salt and pepper. Heat olive oil in a heavy skillet over high heat until the oil shimmers; gently lay the tenderloin into the hot oil. After about 1 minute, gently loosen the meat from the bottom of the skillet, if necessary. Cook until the pork is seared a golden brown color, about 3 minutes per side. Transfer the pork to the lined baking sheet.\nRoast the seared tenderloin in the preheated oven until a thermometer inserted into the center of the pork reads at least 145 degrees F (63 degrees C), about 15 minutes. Remove the pork from the oven and allow to rest for 10 minutes before slicing into medallions.\nCook the plums, balsamic vinegar, brown sugar, honey, and blueberry juice in a small saucepan over medium-low heat, stirring often, until the plums are soft, about 10 minutes. Transfer the sauce to a blender and blend until smooth. Return the sauce to the saucepan and simmer until reduced and thickened to the consistency of apple butter, about 5 more minutes. Spoon plum sauce over the sliced pork to serve.\n",
        "picture_link": "UYvHRI.tX/JeJgDpptNkKwCckRMBhIe"
    },
    {
        "title": "Slow Cooker Cranberry Sauce",
        "ingredients": [
            "1/2 cup orange juice ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1 (12 ounce) package fresh cranberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine orange juice, water, brown sugar, white sugar, and cinnamon in slow cooker; stir in cranberries. Cook on High for 3 hours, stirring once each hour.\nRemove lid; stir well. Cook on High until sauce has thickened and most cranberries have popped, about 45 more minutes.\n",
        "picture_link": "b1M2QJQQukH5mTRtD4U5o.R2DSFMhm."
    },
    {
        "title": "Pan Fried Brussels Sprouts",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 teaspoons crushed garlic ADVERTISEMENT",
            "1/4 white onion, chopped ADVERTISEMENT",
            "1 (16 ounce) package trimmed Brussels sprouts ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "garlic powder to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a cast-iron skillet over medium heat until the oil shimmers, and cook garlic, stirring often, until golden brown and fragrant, about 3 minutes. Stir in onion and cook until soft, stirring often, about 5 minutes. Add Brussels sprouts to the skillet and cook without stirring until the undersides of the sprouts turn golden brown, 5 to 7 minutes. Stir to turn sprouts over, and cook other sides until golden brown, another 5 to 7 minutes. Season with salt, black pepper, and garlic powder.\n",
        "picture_link": "11WTsiycUbOOxVVUFbruEmiqKYqEeSC"
    },
    {
        "title": "Tandoori Fish",
        "ingredients": [
            "1/3 cup vinegar ADVERTISEMENT",
            "4 cloves garlic ADVERTISEMENT",
            "1 tablespoon chopped fresh ginger ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 tablespoon cayenne pepper ADVERTISEMENT",
            "1 tablespoon ground coriander ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "2 pounds thick catfish fillets, cut into large chunks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend the vinegar, garlic, ginger, salt, cayenne, coriander, cumin, and oil in a blender until you have a thick paste. Brush the fish chunks with the mixture to coat evenly and place in a shallow dish; pour the remaining marinade over the fish. Allow to marinate in refrigerator at least 4 hours.\nPreheat the oven's broiler. Arrange the marinated fish in a broiler-safe dish, reserving the marinade.\nBroil the fish under the preheated broiler on the oven's center rack for 10 minutes; turn the fish and brush with reserved marinade. Continue cooking until the fish flakes easily with a fork, about 7 minutes more. Serve hot.\n",
        "picture_link": "xzEvLPy/zF9q5Q9a9t0WYOO0YMCXfQS"
    },
    {
        "title": "Caramel Macchiato Banana Bread",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "2 large very ripe bananas ADVERTISEMENT",
            "1/2 cup caramel macchiato flavored liquid coffee creamer (such as International Delight®) ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "2 tablespoons instant coffee granules ADVERTISEMENT",
            "6 tablespoons unsalted butter ADVERTISEMENT",
            "6 tablespoons packed brown sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray a 9x5-inch loaf pan with cooking spray. In a bowl, whisk together flour, baking soda, baking powder, cinnamon, and salt.\nIn a large mixing bowl, mash the bananas with a fork until almost smooth, and stir in the coffee creamer, vegetable oil, eggs, sugar, and instant coffee granules until the coffee granules have dissolved. Gradually stir in the flour mixture, about 1/2 cup at a time, until batter is almost smooth, and pour batter into the prepared loaf pan.\nBake in preheated oven until a toothpick inserted into the center of the banana bread comes out clean, about 1 hour. Allow to cool before removing from pan.\nMelt the unsalted butter in a saucepan over medium heat, and mix in the brown sugar and vanilla extract. Bring the mixture to a boil, stirring to dissolve sugar, and reduce heat to a simmer. Simmer the syrup for 3 minutes, allow to cool to a warm but liquid temperature, and pour the glaze over the banana bread. Serve when glaze has set.\n",
        "picture_link": "fdvQ8dFLEQa59O66nVp.CM9MPckFOye"
    },
    {
        "title": "German Puff Pancakes",
        "ingredients": [
            "6 eggs ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "2 tablespoons salted butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 375 degrees F (190 degrees C).\nWhisk the eggs, flour, milk, salt, vanilla extract, and cinnamon in a bowl; set aside.\nPut the butter in a 9x11-inch baking dish. Melt the butter in the preheated oven, making sure it doesn't burn, about 5 minutes. Pour the batter into the baking dish with the melted butter.\nReturn to the oven and bake until the pancake is puffed and no longer moist in the center, 20 to 25 minutes.\n",
        "picture_link": "usWtF.lHR3Zo7n6PzejaEyQ1uRR/tRq"
    },
    {
        "title": "Sunday Afternoon Slow-Cooked Spare Ribs",
        "ingredients": [
            "8 meaty pork loin spareribs ADVERTISEMENT",
            "1 tablespoon light olive oil ADVERTISEMENT",
            "1 (14 ounce) can beef broth ADVERTISEMENT",
            "1/2 cup ketchup ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "2 tablespoons vinegar ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "1/2 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1 tablespoon seafood seasoning (such as Old Bay®) ADVERTISEMENT",
            "1/4 cup dried minced onion ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the ribs into a large pot, and cover with lightly salted water. Bring the ribs to a boil, and boil for 45 minutes. Drain off the water and set the ribs aside.\nHeat the olive oil in a large, heavy pot or Dutch oven over medium heat until the oil shimmers, and brown the ribs on all sides, about 10 minutes per side. Remove the ribs, and pour in the beef broth, ketchup, brown sugar, lemon juice, vinegar, Worcestershire sauce, soy sauce, red pepper flakes, seafood seasoning, dried onion, nutmeg, and salt and pepper. Stir the ingredients until the sauce has dissolved any brown bits of flavor from the bottom of the pan. Bring the sauce to a simmer over medium-low heat, and transfer the ribs back into the sauce.\nCoat the ribs with sauce, cover the pan, and simmer over low heat until the meat is very tender and falls off the bones, about 3 hours.\n",
        "picture_link": "XYR08euywbzLPmVWdbrxpxpP3hMmDZ2"
    },
    {
        "title": "Asian Cucumber Thai Salad",
        "ingredients": [
            "1/3 cup distilled white vinegar ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon ground coriander ADVERTISEMENT",
            "1/2 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 pounds cucumbers - halved, seeded, and sliced ADVERTISEMENT",
            "1/2 cup finely chopped red onion ADVERTISEMENT",
            "2 roma (plum) tomatoes, chopped ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "2 tablespoons chopped fresh mint ADVERTISEMENT",
            "1/4 cup chopped roasted peanuts ADVERTISEMENT",
            "fresh mint sprigs (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the vinegar, sugar, coriander, red pepper flakes, and salt in a salad bowl until the sugar is dissolved. Stir in the cucumbers, onion, tomatoes, cilantro, and chopped mint, and toss to coat with dressing. Cover and refrigerate for 1 hour to blend the flavors.\nBefore serving, toss again with chopped peanuts, and garnish with sprigs of fresh mint.\n",
        "picture_link": "FQRnq3mOZ8/qz24pG/HtBsRKKKGdrwK"
    },
    {
        "title": "Colombian Lentils",
        "ingredients": [
            "1/2 cup lentils ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "1 small tomato, chopped ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "2 small yellow potatoes, cubed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the lentils, water, tomato, onion, cumin, salt, and vegetable oil in a pot over medium heat; bring to a boil. Cook and stir at a boil until the lentils are soft, about 30 minutes. Add the potatoes and cook until the potatoes are tender, about 15 minutes more.\n",
        "picture_link": "RjYTpDD.C8cKdqBhhvyOHTF5bYi.0Y."
    },
    {
        "title": "Banh Mi",
        "ingredients": [
            "1/2 cup rice vinegar ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/4 cup carrot, cut into 1/16-inch-thick matchsticks ADVERTISEMENT",
            "1/4 cup white (daikon) radish, cut into 1/16-inch-thick matchsticks ADVERTISEMENT",
            "1/4 cup thinly sliced white onion ADVERTISEMENT",
            "1 skinless, boneless chicken breast half ADVERTISEMENT",
            "garlic salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 (12 inch) French baguette ADVERTISEMENT",
            "4 tablespoons mayonnaise ADVERTISEMENT",
            "1/4 cup thinly sliced cucumber ADVERTISEMENT",
            "1 tablespoon fresh cilantro leaves ADVERTISEMENT",
            "1 small jalapeno pepper - seeded and cut into 1/16-inch-thick matchsticks ADVERTISEMENT",
            "1 wedge lime ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place rice vinegar, water, and sugar into a saucepan over medium heat, bring to a boil, and stir until the sugar has dissolved, about 1 minute. Allow the mixture to cool.\nPour the cooled vinegar mixture over the carrot, radish, and onion in a bowl, and allow to stand for at least 30 minutes. Drain off the excess vinegar mixture after the vegetables have marinated.\nWhile the vegetables are marinating, preheat the oven's broiler, and set the oven rack about 6 inches from the heat source. Lightly oil a slotted broiler pan.\nSprinkle the chicken breast with garlic salt and pepper, and broil on slotted broiler pan, turning once, until the center of the chicken breast is no longer pink and the surface has browned, about 6 minutes per side. Remove the broiled chicken, and slice into bite-size pieces.\nSlice the baguette in half the long way, and pull the center of the bread out of the baguette halves, leaving a cavity for the filling. Place the baguette halves under the broiler to lightly toast, 2 to 3 minutes.\nTo assemble the bahn mi sandwich, spread each half of the toasted baguette with mayonnaise, and fill the cavity of the bottom half of the bread with broiled chicken, cucumber slices, pickled carrot, onion, and radish, cilantro leaves, and jalapeno pepper. Squeeze a wedge of lime over the filling, and top with the other half of the baguette.\n",
        "picture_link": "8Ga95PfkjSb36xO0Td06oMwfbt/Xeg."
    },
    {
        "title": "Pretzel Coated Fried Fish",
        "ingredients": [
            "1 quart oil for frying ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 pound frozen cod fillets, thawed ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "3/4 cup crushed pretzels ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil in a deep fryer to 350 degrees F (175 degrees C).\nMix the flour, salt, and pepper in a large resealable plastic bag. Place cod in the bag, and gently shake to coat. Place eggs and crushed pretzels in two separate shallow dishes. Dip coated cod in the eggs, then in the crushed pretzels.\nFry coated fish 10 minutes in the preheated oil, turning once, until golden brown and easily flaked with a fork.\n",
        "picture_link": "5lCKx7gWNji/kbP6.J6VKSOrote4CpW"
    },
    {
        "title": "Classic Pear Crisp",
        "ingredients": [
            "1 cup rolled oats ADVERTISEMENT",
            "1/3 cup brown sugar ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon finely chopped crystallized ginger ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 teaspoons finely chopped crystallized ginger ADVERTISEMENT",
            "8 cups peeled and sliced pears ADVERTISEMENT",
            "1 pint vanilla ice cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Grease a 2 quart casserole dish or 9 inch square baking dish.\nIn a medium bowl, stir together the oats, brown sugar, 1/2 cup flour, 1 teaspoon crystallized ginger, and cinnamon. Stir in the butter until the mixture is crumbly with pea sized lumps. Set aside.\nIn a separate bowl, stir together the white sugar, 2 tablespoons flour and 2 teaspoons of crystallized ginger. Add the sliced pears, and toss to blend. Transfer to the prepared baking dish. Spread with the oat topping.\nBake for 30 to 35 minutes in the preheated oven, until pears are soft and topping is golden brown. Cool slightly before serving with vanilla ice cream.\n",
        "picture_link": "VArqFDEtIBQ0/qfIDRo/eiqwLFujEDC"
    },
    {
        "title": "Avocado Salad with Bacon and Sour Cream",
        "ingredients": [
            "4 slices bacon, chopped ADVERTISEMENT",
            "2 avocados - peeled, pitted, and cubed ADVERTISEMENT",
            "3 green onions, finely chopped ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "red leaf lettuce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook the chopped bacon in a skillet over medium heat until crisp. With a slotted spoon, remove bacon to a paper towel. Drain fat.\nIn a large bowl, gently combine avocados, bacon, green onions, sour cream, lemon juice, and salt.\nArrange salad leaves on plates, and spoon avocado salad on top.\n",
        "picture_link": "ixWnD6JZJU94I9.61ezJoq96eTkDFza"
    },
    {
        "title": "Corned Beef Roast",
        "ingredients": [
            "1 (5 1/2 pound) corned beef brisket with spice packet ADVERTISEMENT",
            "7 small potatoes, peeled and diced ADVERTISEMENT",
            "4 carrots, peeled and diced ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "1 medium onion, diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 300 degrees F (150 degrees C).\nPlace the brisket in the center of a roasting pan. Arrange the potatoes and carrots around the sides. Place the onion and garlic on top of the roast, and season with salt and pepper. Empty the seasoning packet over the roast, and pour enough water into the pan to almost cover the potatoes. Cover with a lid or heavy aluminum foil.\nRoast for 5 to 6 hours in the preheated oven, until the roast is so tender it can be flaked apart with a fork.\n",
        "picture_link": "ciwpkwGpgX0x3ABfqyp8BFiDelS1GB6"
    },
    {
        "title": "Roasted Red Pepper and Potato Soup",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1 large carrot, diced ADVERTISEMENT",
            "1 celery stalk, diced ADVERTISEMENT",
            "2 cloves garlic, pressed ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 (48 fluid ounce) can chicken broth ADVERTISEMENT",
            "3 medium red potatoes, diced ADVERTISEMENT",
            "1 cup half-and-half cream ADVERTISEMENT",
            "1 (6 ounce) jar roasted red peppers, drained and chopped ADVERTISEMENT",
            "2 teaspoons fresh thyme ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt the butter in a large pot over medium heat, and mix in the olive oil. Saute the onion, carrot, and celery for about 5 minutes, until onion is lightly browned. Stir in the garlic, and continue to cook 1 minute. Mix in the flour. Whisk in the chicken broth, and bring to a boil. Place the potatoes in the pot, reduce heat to low, and cook 15 minutes, until potatoes are tender.\nMix the half-and-half into the pot. Stir in the roasted red peppers. Season with thyme, salt, and pepper. Continue cooking until heated through.\n",
        "picture_link": "fZ.h7Mk3RZ421BrXakgKp7JantW1lBO"
    },
    {
        "title": "Ribollita (Reboiled Italian Cabbage Soup)",
        "ingredients": [
            "2 cups dry cannellini beans ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "3 (32 ounce) cartons chicken broth ADVERTISEMENT",
            "5 cloves garlic, minced ADVERTISEMENT",
            "4 sage leaves ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "2 onions, diced ADVERTISEMENT",
            "3 carrots, peeled and sliced ADVERTISEMENT",
            "3 large stalks celery, chopped ADVERTISEMENT",
            "2 potatoes, peeled and cut into chunks ADVERTISEMENT",
            "1 1/2 cups cabbage, coarsely chopped ADVERTISEMENT",
            "1 bunch Swiss chard, trimmed and chopped ADVERTISEMENT",
            "1 bunch kale, trimmed and chopped ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "12 (1/2-inch-thick) slices French bread, lightly toasted ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "1 1/2 cups grated Parmesan cheese for topping ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sort and rinse the beans before placing them in a large pot with the water. Bring to a boil over medium-high heat and cook 5 minutes. Turn off heat, cover, and let stand 1 1/2 hours. Drain.\nPlace the beans, chicken broth, garlic, sage leaves, bay leaves, and salt in a large pot. Bring to a boil over medium-high heat. Reduce heat to low and simmer until beans are tender, about 2 hours. Cool. Remove 1 cup of beans. Discard the bay leaves and sage leaves. Blend the remaining bean mixture with a hand mixer until smooth. Set aside.\nHeat the olive oil in a large pot over medium-high heat. Add the onions; cook and stir until transparent, about 10 minutes. Combine the carrots, celery, potatoes, cabbage, Swiss chard, and kale with the onions. Stir in the tomatoes. Season with salt and pepper to taste. Cover, and cook until greens have wilted, stirring at least once, about 20 minutes. Stir in the pureed bean mixture, and cook 40 minute until the mixture thickens. Stir in the reserved beans. Adjust seasonings to taste. Add the toasted bread slices; cook until bread is soaked, about 10 minutes longer. Cool, and refrigerate overnight.\nReheat the soup over low heat until heated through, about 20 minutes. Serve each serving garnished with 2 tablespoons Parmesan cheese and a drizzle of olive oil.\n",
        "picture_link": "WZha6gMEeLm/TsRujJzRdbX6cpmac5a"
    },
    {
        "title": "Another Pork Chop Casserole",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "6 boneless pork chops ADVERTISEMENT",
            "1 (16 ounce) package tater tots ADVERTISEMENT",
            "1 (15.5 ounce) can French-style green beans, drained ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of celery soup ADVERTISEMENT",
            "3/4 cup sour cream ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking dish.\nHeat the oil in a skillet over medium heat, and brown pork chops on both sides. Remove chops, reserving pan dripping.\nArrange tater tots in a single layer in the prepared baking dish. Layer green beans over the tater tots. Place browned chops over the beans. In a bowl, mix reserved pan drippings, cream of celery soup, sour cream, salt, and pepper. Pour evenly over chops.\nCover dish with foil, and bake casserole 30 minutes in the preheated oven, or until pork chops are done.\n",
        "picture_link": "4EAPkTjaWD5zj3hJ0k7Lspng8pVEcPa"
    },
    {
        "title": "Zesty Chicken and Potatoes",
        "ingredients": [
            "1 cup fat free Italian-style dressing ADVERTISEMENT",
            "1 teaspoon lime juice ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1 teaspoon rosemary ADVERTISEMENT",
            "3 potatoes, chopped ADVERTISEMENT",
            "2 cloves garlic, quartered ADVERTISEMENT",
            "5 chicken thighs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease a medium baking dish.\nIn a bowl, mix the Italian salad dressing, lime juice, lemon juice, and rosemary.\nPlace potatoes in the baking dish. Distribute garlic evenly throughout dish. Place chicken on top of potatoes. Pour the dressing mixture over the chicken and potatoes. Seal dish with aluminum foil.\nBake 1 hour in the preheated oven, until potatoes are tender and chicken juices run clear.\n",
        "picture_link": "vylbGUU/vppre5wRm.UTfkBt5oVqO4."
    },
    {
        "title": "Balsamic Vinegar Potato Salad",
        "ingredients": [
            "10 medium red potatoes, diced ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1/2 cup diced roasted red peppers ADVERTISEMENT",
            "1 (4 ounce) can sliced black olives, drained ADVERTISEMENT",
            "1 (10 ounce) can quartered artichoke hearts, drained ADVERTISEMENT",
            "1/2 cup balsamic vinegar ADVERTISEMENT",
            "3 teaspoons olive oil ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1/2 teaspoon mustard powder ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes in a saucepan with enough water to cover. Bring to a boil, then cook for 5 to 10 minutes, until tender. Drain, and transfer to a large bowl.\nAdd the onion, red peppers, olives, and artichokes to the bowl with the potatoes. In a separate bowl, whisk together the balsamic vinegar, olive oil, oregano, basil, mustard powder and parsley. Pour over the vegetables, and stir to coat. Chill for at least 4 hours or overnight before serving.\n",
        "picture_link": ".7BqZH5rfn0GwpKE4Zf3hdFv651Tnv2"
    },
    {
        "title": "Japanese Cheesecake",
        "ingredients": [
            "1 (3 ounce) package cream cheese ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "2 egg yolks ADVERTISEMENT",
            "1/4 cup white sugar, divided ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "1/3 teaspoon cream of tartar ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1 1/2 tablespoons cornstarch ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Line the bottom of a 9 inch round cake pan cake pan with parchment paper.\nWarm the cream cheese and milk in a small saucepan over medium-low heat. Cook, stirring occasionally, until cream cheese is melted. Remove from the heat and set aside.\nIn a medium bowl, beat egg yolks and half of the sugar until light and fluffy using an electric mixer. Fold the cream cheese mixture into the yolks. Sift in the flour and cornstarch, and stir until blended.\nIn a separate bowl, using clean beaters, whip egg whites with cream of tartar until they can hold a soft peak. Gradually sprinkle in the remaining sugar and continue whipping to stiff peaks. Fold egg whites into the cream cheese mixture. Pour into the prepared cake pan. Place the pan on a baking sheet with sides.\nPlace the baking sheet with the cheesecake into the oven, and pour water into the baking sheet until it is half way full. Bake for 20 minutes in the preheated oven, then reduce the heat to 300 degrees F (150 degrees C). Continue to bake for 15 more minutes. Let the cake cool before removing from the pan.\nRun a knife around the outer edge of the cake pan, and invert onto a plate to remove the cake. Peel off the parchment paper and invert onto a serving plate so the top of the cake is on top again.\n",
        "picture_link": "lue5V8DaO4ejDRnDfEyyiSnGknuurjC"
    },
    {
        "title": "Microwave Mochi",
        "ingredients": [
            "1 1/2 cups mochiko (glutinous rice flour) ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "2 drops distilled white vinegar ADVERTISEMENT",
            "1/2 cup potato starch ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, mix together the mochiko, 1 cup of sugar, and water until well blended. Mix in the 2 drops of vinegar to soften. Pour into a microwave-safe dish, and loosely cover with plastic. Microwave for 8 to 10 minutes on HIGH. Remove, and let cool until cool enough to handle.\nIn a small bowl, combine the potato starch, 1/4 cup sugar, and salt. Turn the mochi out onto the plastic, and cut into pieces using a plastic or wooden knife. Metal knives tend to stick too much. Roll the pieces in the potato starch mixture.\n",
        "picture_link": "8wDxn0/ZgSqZXGkSrMCmzveNSmPF55q"
    },
    {
        "title": "Cheese Ring",
        "ingredients": [
            "1 pound shredded Cheddar cheese ADVERTISEMENT",
            "3/4 cup mayonnaise ADVERTISEMENT",
            "5 medium green onions, finely chopped (white parts only) ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "1 pinch garlic salt, or to taste ADVERTISEMENT",
            "1 (10 ounce) jar raspberry preserves ADVERTISEMENT",
            "1 (10 ounce) package thin wheat crackers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, mix together the Cheddar cheese, mayonnaise, green onion, cayenne pepper, and garlic salt until well blended. Coat a ring shaped gelatin mold generously with cooking spray. Spoon the cheese mixture into the mold, cover, and chill for 2 to 3 hours to set.\nUnmold onto a serving plate, and pour raspberry preserves into the center. Arrange wheat crackers around the outside of the ring.\n",
        "picture_link": "CpV1R1ntcV4p/ndUNV7rrLyQWTGe69W"
    },
    {
        "title": "Mushroom Stuffing Balls",
        "ingredients": [
            "8 ounces fresh mushrooms, chopped ADVERTISEMENT",
            "1 medium onion, chopped ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "4 eggs, beaten ADVERTISEMENT",
            "2 teaspoons dried parsley flakes ADVERTISEMENT",
            "1/8 teaspoon garlic powder ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "2 1/2 cups seasoned dry bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nIn a large bowl, mix together the mushrooms, onion, butter, eggs, parsley, garlic powder, and Parmesan cheese until creamy. Gradually mix in bread crumbs until the mixture is stiff enough to shape into balls. Form into 2 inch balls, and place on cookie sheets.\nBake for 18 minutes in the preheated oven, until the bottoms are lightly browned. Arrange on a serving tray and serve hot or warm.\n",
        "picture_link": "FT1FUWRMgSweB1WtUbL434LUji3Os5q"
    },
    {
        "title": "Bread Machine Swedish Coffee Bread",
        "ingredients": [
            "1 cup milk ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "2 tablespoons softened butter ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1/3 cup sugar ADVERTISEMENT",
            "1 (.25 ounce) envelope active dry yeast ADVERTISEMENT",
            "3 teaspoons ground cardamom ADVERTISEMENT",
            "2 egg whites, slightly beaten ADVERTISEMENT",
            "pearl sugar, or other decorative sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ingredients in the pan of the bread machine in the order recommended by the manufacturer. Select dough cycle; press Start.\nWhen the dough cycle has finished, divide into three equal portions. Roll each piece into a rope 12 to 14 inches long. Lay the three ropes side by side, then braid together. Tuck the ends underneath, and place onto a greased baking sheet, cover loosely with a towel, and allow to rise until doubled in bulk.\nPreheat oven to 375 degrees F (190 degrees C).\nBrush the braid with beaten egg white and sprinkle with pearl sugar. Bake in preheated oven until golden brown, 20 to 25 minutes.\n",
        "picture_link": "vj7NTrXL3p2LaU3gOfWdja0SBtLW1S2"
    },
    {
        "title": "Feta Shrimp Pasta",
        "ingredients": [
            "1 (16 ounce) package uncooked angel hair pasta ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons diced onion ADVERTISEMENT",
            "4 ounces crumbled feta cheese ADVERTISEMENT",
            "1/2 pound medium shrimp - peeled and deveined ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Place pasta in the pot, cook 4 minutes, until al dente, and drain. Transfer to a large bowl.\nMelt the butter in a skillet over medium heat. Place onion in the skillet and cook until tender. Stir in shrimp, and cook 3 minutes, or until opaque. Mix in feta cheese, and continue cooking 1 minute. Toss with the pasta and serve.\n",
        "picture_link": "3HMbRpB.pKqj/GUFgFRtdPx68W/.91W"
    },
    {
        "title": "Balsamic Green Bean Salad",
        "ingredients": [
            "1 pound fresh green beans, trimmed ADVERTISEMENT",
            "2 tablespoons chopped shallots ADVERTISEMENT",
            "2 tablespoons chopped garlic ADVERTISEMENT",
            "1/4 cup balsamic vinegar ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place green beans in a large saucepan. Fill with enough water to cover green beans, and bring to a boil over high heat. Reduce heat to medium low, and simmer 10 minutes. Drain, and let cool.\nIn a bowl, stir together shallots, garlic, balsamic vinegar, and oil. Pour over green beans. Cover, and refrigerate at least 1 hour. Serve cold.\n",
        "picture_link": "3dpoV8oFJkANgsxLmYRjKxgJb9XpEJy"
    },
    {
        "title": "Fudge Chunkies",
        "ingredients": [
            "1/2 cup semisweet chocolate chips ADVERTISEMENT",
            "5 tablespoons unsalted butter ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "2 tablespoons unsweetened cocoa powder, preferably Dutch-process ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1/3 cup chopped walnuts ADVERTISEMENT",
            "1/3 cup semisweet chocolate chips ADVERTISEMENT",
            "1/3 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a microwave-safe bowl, combine 1/2 cup of chocolate chips and butter. Heat for 1 minute at full power, stir and then continue to heat at 20 second intervals, stirring between each until chocolate has melted. Set aside to cool slightly.\nIn a separate bowl, whisk together the egg, vanilla and sugar briskly until thick and pale, this may take a few minutes. Stir in the chocolate mixture. Combine the flour, baking powder, cocoa powder and salt; whisk into the batter just until blended. Fold in the nuts, remaining chocolate chips and raisins. Cover and chill dough for 1 hour.\nPreheat the oven to 325 degrees F (175 degrees C). Line baking sheets with parchment paper or grease lightly. Scoop out heaping tablespoonfuls of dough and roll them into balls. Place them 2 inches apart on the baking sheets and flatten slightly.\nBake in the preheated oven until slightly puffed and just set, 13 to 15 minutes. Set the baking sheet on a cooling rack to cool. Cookies will firm up as they cool.\n",
        "picture_link": "7tiQYfZMywEJfz.k7TtAuqmRl4TdcaW"
    },
    {
        "title": "Spicy Lamb Patties",
        "ingredients": [
            "1 pound ground lamb ADVERTISEMENT",
            "3 green onions, minced ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon curry powder ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1/4 teaspoon dried red pepper flakes ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the grill for high heat.\nIn a bowl, mix the lamb, green onions, garlic, curry powder, cumin, red pepper, salt and pepper. Form into 4 patties.\nLightly oil grill grate. Grill patties 5 minutes on each side, or until done.\n",
        "picture_link": "0LiPNwnAD3E/W/vz8Hns5ygdlgSMStC"
    },
    {
        "title": "Aunt Kaye's Rhubarb Dump Cake",
        "ingredients": [
            "1 pound rhubarb, cut into 1/4 inch slices ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 (3 ounce) package strawberry flavored Jell-O® mix ADVERTISEMENT",
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/4 cup margarine, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Butter a 9x13 inch baking dish.\nSpread the rhubarb evenly in the bottom of the buttered baking dish. Sprinkle the sugar over the rhubarb, followed by the gelatin mix, and finally the cake mix. Pour the water and melted margarine over the top. Do not stir.\nBake for 45 minutes in the preheated oven, or until the rhubarb is tender.\n",
        "picture_link": "8caRMDIH4XHTM0yFM1sPzLzMVeIvQhC"
    },
    {
        "title": "Korean Salad with Sesame Dressing",
        "ingredients": [
            "1 head red leaf lettuce ADVERTISEMENT",
            "4 green onions (white part only) ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "5 tablespoons water ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "1/4 cup distilled white vinegar ADVERTISEMENT",
            "2 tablespoons sesame oil ADVERTISEMENT",
            "1 tablespoon red pepper flakes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Wash, rinse and dry lettuce leaves; cut into bite-size pieces and place in a salad bowl. Slice the white parts of the green onions lengthwise into long thin strips (if they curl as you slice them, they are perfectly thin); add the sliced onions to the salad bowl.\nIn a small mixing bowl, whisk together the soy sauce, water, white sugar, vinegar, sesame oil, and red pepper flakes.\nDirectly before serving, pour the dressing over the lettuce and green onions in the salad bowl and toss to coat.\n",
        "picture_link": "DbKK8PVzZVBRT1WAwl6NV2hizg7dNJK"
    },
    {
        "title": "Garlic and Herb Cream Cheese",
        "ingredients": [
            "1 stick butter, softened ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 1/2 teaspoons dried oregano ADVERTISEMENT",
            "1 teaspoon dried parsley ADVERTISEMENT",
            "1/4 teaspoon dried thyme ADVERTISEMENT",
            "1/4 teaspoon dried dill weed ADVERTISEMENT",
            "1/4 teaspoon dried basil ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together the butter, cream cheese, Parmesan cheese, garlic, oregano, parsley, thyme, dill, basil, and pepper in a bowl until evenly combined. Chill in refrigerator overnight or 8 hours. This can be frozen for long-term storage.\n",
        "picture_link": "yegCJRGjyIaceej91SYlKqBQMWMt9um"
    }
]