[
    {
        "title": "Spinach Cheese Manicotti",
        "ingredients": [
            "1 (15 ounce) container ricotta cheese ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped spinach, thawed and squeezed dry ADVERTISEMENT",
            "1/2 cup minced onion ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 teaspoons minced fresh parsley ADVERTISEMENT",
            "1/2 teaspoon pepper ADVERTISEMENT",
            "1/4 teaspoon garlic powder ADVERTISEMENT",
            "1 1/2 cups shredded mozzarella cheese, divided ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese, divided ADVERTISEMENT",
            "2 (26 ounce) jars spaghetti sauce ADVERTISEMENT",
            "1 1/2 cups water ADVERTISEMENT",
            "1 (8 ounce) package manicotti shells ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, combine ricotta, spinach, onion and egg. Season with parsley, pepper and garlic powder. Mix in 1 cup mozzarella and 1/4 cup Parmesan. In a separate bowl, stir together spaghetti sauce and water.\nSpread 1 cup sauce in the bottom of a 9x13 inch baking dish. Stuff uncooked manicotti shells with ricotta mixture, and arrange in a single layer in the dish. Cover with remaining sauce. Sprinkle with remaining mozzarella and Parmesan.\nBake in preheated oven for 45 to 55 minutes, or until noodles are soft.\n",
        "picture_link": "LYfS7gRkDTjKvBN6QDQGT7bnkXMegeO"
    },
    {
        "title": "Creamed Chipped Beef On Toast",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 1/2 cups warm milk ADVERTISEMENT",
            "1 (8 ounce) jar dried beef ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan over low heat, melt butter. Whisk in flour all at once to form a roux. Whisk in milk, a little at a time, increase heat to medium-high, and cook, stirring, until thickened. Bring to a boil, stir in beef and cayenne, heat through and serve over toast.\n",
        "picture_link": "SIm0fXd9MEcdTAofnNqlcXxHDjqgdLm"
    },
    {
        "title": "Nacho Cheese Sauce",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "7 slices processed American cheese ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium saucepan over medium heat, melt butter and stir in flour. Pour in the milk and stir until the mixture thickens. Stirring constantly, mix in cheese and salt. Continue to cook and stir until cheese has melted and all ingredients are well blended, about 15 minutes.\n",
        "picture_link": "9WW5F25hDU4i.ruAI3O5uvteTpV2Bxa"
    },
    {
        "title": "Asparagus with Parmesan Crust",
        "ingredients": [
            "1 pound thin asparagus spears ADVERTISEMENT",
            "1 tablespoon extra virgin olive oil ADVERTISEMENT",
            "1 ounce shaved Parmesan cheese ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "1/4 cup balsamic vinegar, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nPlace asparagus on a baking sheet. Drizzle with olive oil, and toss to coat. Arrange asparagus spears in a single layer. Spread Parmesan cheese over asparagus, and season with freshly ground black pepper.\nBake 12 to 15 minutes in the preheated oven, until cheese is melted and asparagus is tender but crisp. Serve immediately on warm plates, sprinkling with balsamic vinegar to taste.\n",
        "picture_link": "N7sDw93KaKrZk2ndhUeV.98c21A4jsK"
    },
    {
        "title": "Spicy Baked Sweet Potato Fries",
        "ingredients": [
            "6 sweet potatoes, cut into French fries ADVERTISEMENT",
            "2 tablespoons canola oil ADVERTISEMENT",
            "3 tablespoons taco seasoning mix ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 425 degrees F (220 degrees C).\nIn a plastic bag, combine the sweet potatoes, canola oil, taco seasoning, and cayenne pepper. Close and shake the bag until the fries are evenly coated. Spread the fries out in a single layer on two large baking sheets.\nBake for 30 minutes, or until crispy and brown on one side. Turn the fries over using a spatula, and cook for another 30 minutes, or until they are all crispy on the outside and tender inside. Thinner fries may not take as long.\n",
        "picture_link": "yWlBNoSFwRTfiJart21VJAuyeLS3ksi"
    },
    {
        "title": "All American Apple Pie",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "2 tablespoons cold milk ADVERTISEMENT",
            "1 1/2 teaspoons white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "6 Fuji apples, cored and sliced ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "3/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nTo Make Crust: In a large bowl, mix together 1 1/2 cups flour, oil, milk, 1 1/2 teaspoons sugar and salt until evenly blended. Pat mixture into a 9 inch pie pan, spreading the dough evenly over the bottom and up sides. Crimp edges of the dough around the perimeter.\nTo Make Filling: Mix together 3/4 cup sugar, 3 tablespoons flour, cinnamon, and nutmeg. Sprinkle over apples and toss to coat. Spread evenly in unbaked pie shell.\nTo Make Topping: Using a pastry cutter, mix together 1/2 cup flour, 1/2 cup sugar and butter until evenly distributed and crumbly in texture. Sprinkle over apples.\nPut pie in the oven on a cookie sheet to catch the juices that may spill over. Bake 45 minutes.\n",
        "picture_link": "VaOFyCxW9drJrIkIZivV2ibDsL.rzGC"
    },
    {
        "title": "Chocolate Truffle Cookies",
        "ingredients": [
            "4 (1 ounce) squares unsweetened chocolate, chopped ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "6 tablespoons butter ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In the microwave or in a metal bowl over a pan of simmering water, melt unsweetened chocolate, 1 cup of the chocolate chips, and the butter stirring occasionally until smooth. Remove from heat and set aside to cool. In a large bowl, whip eggs and sugar until thick and pale, about 2 minutes. Stir in the vanilla and the chocolate mixture until well mixed. Combine the flour, cocoa, baking powder and salt; gradually stir into the chocolate mixture. Fold in remaining 1 cup chocolate chips. Cover dough and chill for at least an hour or overnight.\nPreheat oven to 350 degrees F (175 degrees C). Roll chilled dough into 1 inch balls. Place on ungreased cookie sheets so they are 2 inches apart.\nBake for 9 to 11 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n",
        "picture_link": "CUsZETvxh7to5b4u29RzIjoPe450ie."
    },
    {
        "title": "Easy Tilapia with Wine and Tomatoes",
        "ingredients": [
            "4 (4 ounce) fillets tilapia ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "4 tablespoons butter ADVERTISEMENT",
            "3 cloves garlic, pressed ADVERTISEMENT",
            "4 fresh basil leaves, chopped ADVERTISEMENT",
            "1 large tomato, chopped ADVERTISEMENT",
            "1 cup white wine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat a grill for medium-high heat.\nPlace the tilapia fillets side by side on a large piece of aluminum foil. Season each one with salt and pepper. Place one tablespoon of butter on top of each piece of fish, and sprinkle garlic, basil and tomato. Pour the wine over everything. Fold foil up around fish, and seal into a packet. Place packet on a cookie sheet for ease in transportation to and from the grill.\nPlace foil packet on the preheated grill, and cook for 15 minutes, or until fish flakes easily with a fork. Open the packet carefully so as not to get burned from the steam, and serve.\n",
        "picture_link": "32dj/BibarOl8PzMF8sP3k1zPFR7yhK"
    },
    {
        "title": "Master Pizza Dough",
        "ingredients": [
            "2 1/2 cups all-purpose flour, or as needed ADVERTISEMENT",
            "1 envelope Fleischmann's® RapidRise Yeast* ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1 cup very warm water (120 degrees F to 130 degrees F) ADVERTISEMENT",
            "2 tablespoons olive or vegetable oil ADVERTISEMENT",
            "Cornmeal ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine 2 cups flour, undissolved yeast, and salt. Stir very warm water and olive oil into flour mixture. Stir in enough remaining flour to make soft dough. Knead on lightly floured surface until smooth and elastic, about 4 to 6 minutes. Cover; let rest on floured surface 10 minutes.\nLightly oil 1 (14-inch) or 2 (12-inch) round pizza pan(s).** Sprinkle with cornmeal. Shape dough into smooth ball. Divide and roll dough to fit desired pan(s). Top pizza as desired.\nBake at 400 degrees F for 20 to 30 minutes or until done. Baking time depends on size and thickness of crust and selected toppings.\n",
        "picture_link": "uvzLTkJa7kAEjYViiaHXAW.Ai8v4f6y"
    },
    {
        "title": "Spinach and Sun-Dried Tomato Pasta",
        "ingredients": [
            "1 cup vegetable broth ADVERTISEMENT",
            "12 dehydrated sun-dried tomatoes ADVERTISEMENT",
            "1 (8 ounce) package uncooked penne pasta ADVERTISEMENT",
            "2 tablespoons pine nuts ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/4 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 bunch fresh spinach, rinsed and torn into bite-size pieces ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small saucepan, bring the broth to a boil. Remove from heat. Place the sun-dried tomatoes in the broth 15 minutes, or until softened. Drain, reserving broth, and coarsely chop.\nBring a large pot of lightly salted water to a boil. Place penne pasta in the pot, cook 9 to 12 minutes, until al dente, and drain.\nPlace the pine nuts in a skillet over medium heat. Cook and stir until lightly toasted.\nHeat the olive oil and red pepper flakes in a skillet over medium heat, and saute the garlic 1 minute, until tender. Mix in the spinach, and cook until almost wilted. Pour in the reserved broth, and stir in the chopped sun-dried tomatoes. Continue cooking 2 minutes, or until heated through.\nIn a large bowl, toss the cooked pasta with the spinach and tomato mixture and pine nuts. Serve with Parmesan cheese.\n",
        "picture_link": "2WxD5IXCd3k/owhW7QggKmzXy2k6mqy"
    },
    {
        "title": "Vicki's Hush Puppies",
        "ingredients": [
            "2 eggs, beaten ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 large onion, diced ADVERTISEMENT",
            "1 cup self-rising flour ADVERTISEMENT",
            "1 cup self-rising cornmeal ADVERTISEMENT",
            "1 quart oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, mix together eggs, sugar, and onion. Blend in flour and cornmeal.\nHeat 2 inches of oil to 365 degrees F (185 degrees C). Drop batter by rounded teaspoonfuls in hot oil, and fry until golden brown. Cook in small batches to maintain oil temperature. Drain briefly on paper towels. Serve hot.\n",
        "picture_link": "WSyBaEl9YUKVJd5FS3/znTNW.zaAY8K"
    },
    {
        "title": "Baked Coconut Shrimp",
        "ingredients": [
            "1 pound large shrimp, peeled and deveined ADVERTISEMENT",
            "1/3 cup cornstarch ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3/4 teaspoon cayenne pepper ADVERTISEMENT",
            "2 cups flaked sweetened coconut ADVERTISEMENT",
            "3 egg whites, beaten until foamy ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 400 degrees F (200 degrees C). Lightly coat a baking sheet with cooking spray.\nRinse and dry shrimp with paper towels. Mix cornstarch, salt, and cayenne pepper in a shallow bow; pour coconut flakes in a separate shallow bowl. Working with one shrimp at a time, dredge it in the cornstarch mixture, then dip it in the egg white, and roll it in the coconut, making sure to coat the shrimp well. Place on the prepared baking sheet, and repeat with the remaining shrimp.\nBake the shrimp until they are bright pink on the outside and the meat is no longer transparent in the center and the coconut is browned, 15 to 20 minutes, flipping the shrimp halfway through.\n",
        "picture_link": "p4JZNSCS3S2iSLN7zQRQw6.QMT3Yxvy"
    },
    {
        "title": "Pan-Seared Tilapia",
        "ingredients": [
            "4 (4 ounce) fillets tilapia ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 tablespoons unsalted butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse tilapia fillets in cold water and pat dry with paper towels. Season both sides of each fillet with salt and pepper. Place the flour in a shallow dish; gently press each fillet into the flour to coat and shake off the excess flour.\nHeat the olive oil in a skillet over medium-high heat; cook the tilapia in the hot oil until the fish flakes easily with a fork, about 4 minutes per side. Brush the melted butter onto the tilapia in the last minute before removing from the skillet. Serve immediately.\n",
        "picture_link": "oaHos2LkGoW3NPKFdttUB7/wzfbYpsS"
    },
    {
        "title": "Best Egg Rolls",
        "ingredients": [
            "1 pound ground pork ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 quart peanut oil for frying ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "2 cups shredded cabbage ADVERTISEMENT",
            "2 ounces shredded carrots ADVERTISEMENT",
            "8 (7 inch square) egg roll wrappers ADVERTISEMENT",
            "2 tablespoons sesame seeds (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season pork with ginger and garlic powder and mix thoroughly. Heat mixture in a medium skillet, stirring, until pork is cooked through and no longer pink. Set aside.\nIn another large skillet heat oil to about 375 degrees F (190 degrees C) or medium high heat. While oil is heating, combine flour and water in a bowl until they form a paste. In a separate bowl combine the cabbage, carrots and reserved pork mixture. Mix all together.\nLay out one egg roll skin with a corner pointed toward you. Place about a 1/4 to 1/3 cup of the cabbage, carrot and pork mixture on egg roll paper and fold corner up over the mixture. Fold left and right corners toward the center and continue to roll. Brush a bit of the flour paste on the final corner to help seal the egg roll.\nPlace egg rolls into heated oil and fry, turning occasionally, until golden brown. Remove from oil and drain on paper towels or rack. Put on serving plate and top with sesame seeds if desired.\n",
        "picture_link": "Id0X9EXuk61GgpXcS/hikgJVmE7ZO6i"
    },
    {
        "title": "Chocolate Fudge Buttercream Frosting",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1/4 cup shortening ADVERTISEMENT",
            "1/3 cup unsweetened cocoa powder ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1 cup hot fudge topping ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream together the butter or margarine with the shortening.\nSift the cocoa with the confectioners' sugar and add to the creamed mixture. Mix together adding 1 tablespoon at a time of milk to keep mixture smooth. Don't add more than 1/4 cup of milk.\nAdd the hot fudge topping and the vanilla extract. Blend until smooth and creamy.\n",
        "picture_link": "hXpdmNYSEkSfcqru2..NdEezJ0tedTy"
    },
    {
        "title": "Authentic Enchiladas Verdes",
        "ingredients": [
            "2 bone-in chicken breast halves ADVERTISEMENT",
            "2 cups chicken broth ADVERTISEMENT",
            "1/4 white onion ADVERTISEMENT",
            "1 clove garlic ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "1 pound fresh tomatillos, husks removed ADVERTISEMENT",
            "5 serrano peppers ADVERTISEMENT",
            "1/4 white onion ADVERTISEMENT",
            "1 clove garlic ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "12 corn tortillas ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1 cup crumbled queso fresco ADVERTISEMENT",
            "1/2 white onion, chopped ADVERTISEMENT",
            "1 bunch fresh cilantro, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan, combine chicken breast with chicken broth, one quarter onion, a clove of garlic, and 2 teaspoons salt. Bring to a boil, and then boil for 20 minutes. Reserve broth, set chicken aside to cool, and discard onion and garlic. When cool enough to handle, shred chicken with your hands.\nPlace tomatillos and serrano chiles in a pot with water, enough to cover them. Bring to boil, and continue boiling until tomatillos turn a different shade of green (from bright green to a dull, army green). Strain tomatillos and chiles, and place in a blender with another quarter piece of onion, 1 clove garlic, and a pinch of salt. Pour in reserved chicken broth, so that liquid just covers the veggies in the blender by about an inch. Blend all ingredients until they are completely pureed. Pour salsa in a medium saucepan, and bring to a low boil.\nPour oil in a frying pan, and allow to get very hot. Slightly fry tortillas one by one in hot oil, setting each on a paper towel afterwards to soak some of the oil. Finally, dip slightly fried tortillas in low-boiling green salsa, until tortillas become soft again. Place on plates, 3 per person.\nFill or top tortillas with shredded chicken, then extra green sauce. Top with crumbled cheese, chopped onion, and chopped cilantro.\n",
        "picture_link": "HD1gbEgiY0B1TXI8xJpbK6WDujJ9O7q"
    },
    {
        "title": "Slow Cooker Split Pea Sausage Soup",
        "ingredients": [
            "1 pound dried split peas ADVERTISEMENT",
            "10 cups water ADVERTISEMENT",
            "1 pound smoked sausage of your choice, sliced ADVERTISEMENT",
            "5 cubes chicken bouillon ADVERTISEMENT",
            "1 1/2 cups chopped carrot ADVERTISEMENT",
            "1 cup chopped celery ADVERTISEMENT",
            "2 potatoes, peeled and chopped ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a 5 quart slow cooker, combine the peas, water, sausage, bouillon, carrot, celery, potatoes, garlic powder, oregano, bay leaves, and onion.\nCover, and cook on High for 4 to 5 hours. Remove bay leaves before ladling into bowls.\n",
        "picture_link": "/E1hARsQMpmNam.nCaKuQiZt7j8RZxG"
    },
    {
        "title": "Spinach Lasagna III",
        "ingredients": [
            "20 lasagna noodles ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 cup chopped fresh mushrooms ADVERTISEMENT",
            "1 cup chopped onion ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "2 cups fresh spinach ADVERTISEMENT",
            "3 cups ricotta cheese ADVERTISEMENT",
            "2/3 cup grated Romano cheese ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon dried basil leaves ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "3 cups shredded mozzarella cheese ADVERTISEMENT",
            "3 cups tomato pasta sauce ADVERTISEMENT",
            "1 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of lightly salted water to a boil. Add lasagna noodles and cook for 8 to 10 minutes or until al dente; drain.\nIn a skillet over medium-high heat, cook mushrooms, onions, and garlic in olive oil until onions are tender. Drain excess liquid and cool. Boil spinach for 5 minutes. Drain, then squeeze out excess liquid. Chop spinach.\nCombine ricotta cheese, Romano cheese, spinach, salt, oregano, basil, pepper, and egg in a bowl. Add cooled mushroom mixture. Beat with an electric mixer on low speed for 1 minute. Lay 5 lasagna noodles in bottom of a 9x13 inch baking dish. Spread one third of the cheese/spinach mixture over noodles. Sprinkle 1 cup mozzarella cheese and 1/3 cup Parmesan cheese on top. Spread 1 cup pasta sauce over cheese. Repeat layering 2 times.\nCover dish with aluminum foil and bake in a preheated oven for 1 hour. Cool 15 minutes before serving.\n",
        "picture_link": "9h62YV6k8hWQrNRkjYcBXIxCU6A2uEW"
    },
    {
        "title": "Dawn's Candied Walnuts",
        "ingredients": [
            "1 pound walnut halves ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "6 tablespoons milk ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spread nuts in a single layer over a baking sheet. Roast for approximately 8 to 10 minutes, or until the nuts start to turn brown and the smell of roasting nuts fills the kitchen.\nStir together sugar, cinnamon, salt, and milk in a medium saucepan. Cook over medium-high heat for 8 minutes, or until the mixture reaches the soft ball stage of 236 degrees F (113 degrees C). Remove from heat, and stir in vanilla immediately. .\nAdd walnuts to sugar syrup, and stir to coat well. Spoon nuts onto waxed paper, and immediately separate nuts with a fork. Cool, and store in airtight containers.\n",
        "picture_link": "hg9UFIZAgAGJJwIbyTmSH/ofuOIUceW"
    },
    {
        "title": "Restaurant Style Chicken Nachos",
        "ingredients": [
            "2 cloves garlic, crushed ADVERTISEMENT",
            "6 green onions, sliced, white parts and tops separated ADVERTISEMENT",
            "3 tablespoons canola oil ADVERTISEMENT",
            "1 shredded, cooked, whole chicken breast ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 cup salsa ADVERTISEMENT",
            "1/2 (12 ounce) package tortilla chips ADVERTISEMENT",
            "1 (8 ounce) package shredded Cheddar/Monterey Jack cheese blend ADVERTISEMENT",
            "1/2 large tomato, diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a 12 inch skillet over medium heat, cook and stir the garlic and white parts of the green onions in canola oil until tender. Mix in shredded chicken, salt and pepper. Toss until well coated with oil. Stir in the salsa.\nArrange tortilla chips on a large baking sheet. Spoon the chicken mixture over tortilla chips. Top with Cheddar/Monterey Jack cheese blend and tomato. Bake in the preheated oven 10 minutes, or until cheese has melted. Remove from heat and sprinkle with green onion tops before serving.\n",
        "picture_link": "04JED9zEkByUEVara7REwSfHO001Zv2"
    },
    {
        "title": "Slow Cooker Cranberry Roast",
        "ingredients": [
            "1 (1 ounce) envelope dry onion soup mix ADVERTISEMENT",
            "1 (3 pound) beef chuck roast ADVERTISEMENT",
            "1 (16 ounce) can jellied cranberry sauce ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place onion soup mix in the bottom of a slow cooker. Place roast in the slow cooker, and top with cranberry sauce.\nCover, and cook 8 hours on Low.\nRemove roast, and set aside. Set slow cooker to High. Whisk together butter and flour, and slowly mix into the liquid remaining in the slow cooker to create a thick gravy. Serve with the roast.\n",
        "picture_link": "Yu8Y/QX.G.IvgO17YFSa5HiUtlu/TEq"
    },
    {
        "title": "Five Minute Ice Cream",
        "ingredients": [
            "1 (10 ounce) package frozen sliced strawberries ADVERTISEMENT",
            "1/2 cup sugar ADVERTISEMENT",
            "2/3 cup heavy cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the frozen strawberries and sugar in a food processor or blender. Process until the fruit is roughly chopped. With the processor running, slowly pour in the heavy cream until fully incorporated. Serve immediately, or freeze for up to one week.\n",
        "picture_link": "lKPdPMwr/txcKy6/HI7wfvvPPguKRHa"
    },
    {
        "title": "Cedar Planked Salmon",
        "ingredients": [
            "3 (12 inch) untreated cedar planks ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1 1/2 tablespoons rice vinegar ADVERTISEMENT",
            "1 teaspoon sesame oil ADVERTISEMENT",
            "1/3 cup soy sauce ADVERTISEMENT",
            "1/4 cup chopped green onions ADVERTISEMENT",
            "1 tablespoon grated fresh ginger root ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "2 (2 pound) salmon fillets, skin removed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Soak the cedar planks for at least 1 hour in warm water. Soak longer if you have time.\nIn a shallow dish, stir together the vegetable oil, rice vinegar, sesame oil, soy sauce, green onions, ginger, and garlic. Place the salmon fillets in the marinade and turn to coat. Cover and marinate for at least 15 minutes, or up to one hour.\nPreheat an outdoor grill for medium heat. Place the planks on the grate. The boards are ready when they start to smoke and crackle just a little.\nPlace the salmon fillets onto the planks and discard the marinade. Cover, and grill for about 20 minutes. Fish is done when you can flake it with a fork. It will continue to cook after you remove it from the grill.\n",
        "picture_link": "B.NncDiljKeIF.0QY5gg/KPE4a9zdwm"
    },
    {
        "title": "Rosemary Chicken with Orange-Maple Glaze",
        "ingredients": [
            "1 cup orange juice ADVERTISEMENT",
            "1/2 cup dry white wine ADVERTISEMENT",
            "1/2 cup maple syrup ADVERTISEMENT",
            "2 teaspoons chopped fresh rosemary ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring orange juice and wine to a boil in a small saucepan. Reduce heat slightly, but keep high enough to continue a low boil for 5 minutes, stirring occasionally. Stir in maple syrup and continue boiling for another 5 to 6 minutes, stirring frequently, until glossy and just slightly thickened. Set aside.\nIn a small bowl mix together the rosemary, salt and pepper. Rub mixture on both sides of chicken breasts, and set aside.\nMelt butter and olive oil in a large skillet over medium high heat. Add chicken breasts, cover skillet and saute for about 5 minutes on each side until lightly browned. Pour orange-maple mixture over chicken (mixture will boil and bubble). Reduce heat to simmer; cover and let cook for another 10 minutes, basting occasionally, until chicken is cooked through and sauce has turned into a rich, thick glaze.\n",
        "picture_link": "ynOJqJCRcx1m/Q.ZRpOE02KZvLZ3rqG"
    },
    {
        "title": "Ali's Amazing Bruschetta",
        "ingredients": [
            "2 large tomatoes, coarsely chopped ADVERTISEMENT",
            "1/2 sweet onion, chopped ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 tablespoon chopped fresh oregano ADVERTISEMENT",
            "1 teaspoon chopped fresh basil ADVERTISEMENT",
            "2 teaspoons chopped fresh parsley ADVERTISEMENT",
            "1/2 (1 pound) loaf Italian bread, cut into 1 inch slices ADVERTISEMENT",
            "1/4 cup freshly grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nIn a medium bowl, combine tomatoes, onion, olive oil, oregano, basil and parsley. Place bread on a baking sheet, and top with tomato mixture. Sprinkle with Parmesan.\nBake in preheated oven for 8 to 10 minutes, or until bottom of bread is browned. Allow to cool 5 minutes before serving.\n",
        "picture_link": "IwunsBBysBvGU0tFbBkJBcWIVBpDxuK"
    },
    {
        "title": "Stuffed Peppers with Turkey and Vegetables",
        "ingredients": [
            "4 green bell peppers, tops removed, seeded ADVERTISEMENT",
            "1 pound ground turkey ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "1 cup sliced mushrooms ADVERTISEMENT",
            "1 zucchini, chopped ADVERTISEMENT",
            "1/2 red bell pepper, chopped ADVERTISEMENT",
            "1/2 yellow bell pepper, chopped ADVERTISEMENT",
            "1 cup fresh spinach ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes, drained ADVERTISEMENT",
            "1 tablespoon tomato paste ADVERTISEMENT",
            "Italian seasoning to taste ADVERTISEMENT",
            "garlic powder to taste ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nWrap the green bell peppers in aluminum foil, and place in a baking dish. Bake 15 minutes in the preheated oven. Remove from heat.\nIn a skillet over medium heat, cook the turkey until evenly brown. Set aside. Heat oil in the skillet, and cook onion, mushrooms, zucchini, red bell pepper, yellow bell pepper, and spinach until tender. Return turkey to the skillet. Mix in the tomatoes and tomato paste, and season with Italian seasoning, garlic powder, salt, and pepper. Stuff the green peppers with the skillet mixture.\nReturn peppers to the oven, and continue cooking 15 minutes.\n",
        "picture_link": "Vi/XOjK1eR2xHm.4GUXgm7Ng56KDv1q"
    },
    {
        "title": "Basic Baked Spaghetti",
        "ingredients": [
            "3/4 pound lean ground beef ADVERTISEMENT",
            "1 (16 ounce) jar spaghetti sauce ADVERTISEMENT",
            "1 pound spaghetti ADVERTISEMENT",
            "1 cup shredded mild Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). In large skillet, cook hamburger until brown. Mix spaghetti sauce into skillet. Reduce heat and simmer.\nMeanwhile, bring a large pot of lightly salted water to a boil. Mix in pasta and cook for 8 to 10 minutes or until al dente; drain.\nMix together spaghetti and meat mixture, pour into 9x13 pan. Top with cheese and bake for 30 minutes, or until heated through and cheese is bubbly.\n",
        "picture_link": "Ha/losx5YfauZGWBn/OMaXxtHkR3j5O"
    },
    {
        "title": "Mushroom Chicken Piccata",
        "ingredients": [
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "6 skinless, boneless chicken breast halves ADVERTISEMENT",
            "4 tablespoons butter ADVERTISEMENT",
            "1/2 pound fresh mushrooms, sliced ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a shallow dish or bowl, mix together flour, salt and paprika. In a separate dish or bowl, mix together egg and milk. Dip chicken pieces in egg mixture, then in seasoned flour.\nIn a large skillet, heat butter or margarine over medium-high heat. Saute chicken pieces until golden brown. Add mushrooms and onion and saute for 3 to 5 minutes.\nIn a medium bowl combine the broth, wine, lemon juice and cornstarch. Mix together and pour mixture over chicken and mushrooms. Reduce heat to medium low and let chicken mixture simmer for 25 minutes or until chicken is cooked through and juices run clear. Sprinkle with parsley and serve.\n",
        "picture_link": "IPx4EzUW3K/bdUPC4In2y94cAzwdoC2"
    },
    {
        "title": "Creamy Macaroni and Cheese",
        "ingredients": [
            "1 tablespoon salt ADVERTISEMENT",
            "1 pound elbow, shell or other bite-size shaped pasta ADVERTISEMENT",
            "2 (12 fluid ounce) cans evaporated milk ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1/3 cup flour ADVERTISEMENT",
            "1 1/2 tablespoons Dijon mustard ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "Freshly ground black pepper ADVERTISEMENT",
            "1 pound grated extra-sharp cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring 2 quarts of water to boil in large soup kettle. Add salt and pasta. Using package directions as a guide, cook until al dente. Drain. To prevent sticking, drain and immediately pour onto a large lipped baking sheet and let cool while preparing sauce.\nMeanwhile, microwave the milk and chicken broth in a 4-cup Pyrex measuring cup or bowl until hot and steamy (not boiling). Melt butter in the empty pasta pot; whisk in flour, then hot milk mixture. Continue to whisk until thick and bubbly, 3 to 4 minutes. Whisk in mustard, Parmesan and pepper. Turn off heat, stir in cheddar until melted.\nAdd drained pasta (and optional flavoring ingredients, see notes) to sauce, and stir until everything is well combined over low heat. Stir to heat through, and thin with a little water if the sauce is too thick. Serve hot.\n",
        "picture_link": "JpbGQ1mAa6z1tbDW79bfzpVOxkQmFWC"
    },
    {
        "title": "Creamy Frosting",
        "ingredients": [
            "1 cup milk ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 cup butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk milk into flour in small saucepan until smooth. Heat and stir until it boils and thickens. Cool thoroughly.\nCream butter, sugar and vanilla in bowl until light and fluffy. Add thickened milk. Beat until mixture resembles whipped cream. Makes enough to fill and frost 2 layer cake, about 3 1/2 cups.\n",
        "picture_link": "XQgZFQ0Y.aP4.6u.yDsMQ.tHTKWI7ku"
    },
    {
        "title": "Simple Baked Apples",
        "ingredients": [
            "6 apples - peeled, cored and sliced ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon ground cloves ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup whole milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 2 quart casserole dish, or coat with non-stick cooking spray.\nPlace apples in a large bowl. In a small bowl, mix together sugar, flour, cinnamon, nutmeg and cloves. Stir spice mixture into apples until evenly distributed. Fold in raisins and walnuts. Spoon into prepared dish. Pour milk evenly over apple mixture.\nBake in preheated oven for 45 to 60 minutes, or until soft and bubbly. Allow to cool slightly before serving.\n",
        "picture_link": "BF/SsJDlRIQaGWQsEZvFXhQzaV7U9c6"
    },
    {
        "title": "Whipped Shortbread Cookies",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup confectioners' sugar ADVERTISEMENT",
            "1/4 cup red maraschino cherries, quartered ADVERTISEMENT",
            "1/4 cup green maraschino cherries, quartered ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl, combine butter, flour, and confectioners' sugar. With an electric mixer, beat for 10 minutes, until light and fluffy. Spoon onto cookie sheets, spacing cookies 2 inches apart. Place a piece of maraschino cherry onto the middle of each cookie, alternating between red and green.\nBake for 15 to 17 minutes in the preheated oven, or until the bottoms of the cookies are lightly browned. Remove from oven, and let cool on cookie sheet for 5 minutes, then transfer cookies on to wire rack to cool. Store in an airtight container, separating each layer with waxed paper.\n",
        "picture_link": "tGG1HMs3hudwbm4lrMWWilF2sycanES"
    },
    {
        "title": "Mexican Lasagna",
        "ingredients": [
            "1 pound lean ground beef ADVERTISEMENT",
            "1 (1 ounce) package taco seasoning mix ADVERTISEMENT",
            "1 (14 ounce) can peeled and diced tomatoes with juice ADVERTISEMENT",
            "10 (6 inch) corn tortillas ADVERTISEMENT",
            "1 cup prepared salsa ADVERTISEMENT",
            "1/2 cup shredded Colby cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large skillet over medium-high heat, brown the ground beef, and stir in the taco seasoning and tomatoes. Line a 9x13-inch baking dish with half the tortillas. Spoon the beef mixture into the dish, then top with the remaining tortillas. Spread salsa over the tortillas and sprinkle with the cheese.\nBake at 350 degrees F (175 degrees C) for 20 to 30 minutes, or until cheese is melted and bubbly.\n",
        "picture_link": "TexZSBcsm1.shOIqNCsPFeAEsWoXu0G"
    },
    {
        "title": "Jimmy's Mexican Pizza",
        "ingredients": [
            "1/2 pound ground beef ADVERTISEMENT",
            "1 medium onion, diced ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 (16 ounce) can refried beans ADVERTISEMENT",
            "4 (10 inch) flour tortillas ADVERTISEMENT",
            "1/2 cup salsa ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 cup shredded Monterey Jack cheese ADVERTISEMENT",
            "2 green onions, chopped ADVERTISEMENT",
            "2 roma (plum) tomatoes, diced ADVERTISEMENT",
            "1/4 cup thinly sliced jalapeno pepper ADVERTISEMENT",
            "1/4 cup sour cream (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Coat 2 pie plates with non-stick cooking spray.\nPlace beef, onion and garlic in a skillet over medium heat. Cook until beef is evenly browned. Drain off grease. Season the meat with chili powder, cumin, paprika, salt and pepper.\nLay one tortilla in each pie plate, and cover with a layer of refried beans. Spread half of the seasoned ground beef over each one, and then cover with a second tortilla. Bake for 10 minutes in the preheated oven.\nRemove the plates from the oven, and let cool slightly. Spread half of the salsa over each top tortilla. Cover each pizza with half of the Cheddar and Monterey Jack cheeses. Place half of the tomatoes, half of the green onions, and half of the jalapeno slices onto each one.\nReturn the pizzas to the oven, and bake for 5 to 10 more minutes, until the cheese is melted. Remove from the oven, and let cool slightly before slicing each one into 4 pieces.\n",
        "picture_link": "ylxqD844blopGIrZTPeXcYLImyGxuTu"
    },
    {
        "title": "Slow Cooker Roast Beef",
        "ingredients": [
            "3 pounds beef chuck roast ADVERTISEMENT",
            "1/3 cup soy sauce ADVERTISEMENT",
            "1 (1 ounce) package dry onion soup mix ADVERTISEMENT",
            "2 teaspoons freshly ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the soy sauce and dry onion soup mix into the slow cooker. Mix well. Place chuck roast into slow cooker. Add water until the top 1/2 inch of the roast is not covered. Add the fresh ground pepper over the top.\nCover and cook on low for 22 hours.\n",
        "picture_link": "ZtoFvFIHGtOmc1UU3bfVHkTxqECtD0e"
    },
    {
        "title": "Cream Cheese Pound Cake I",
        "ingredients": [
            "1 1/2 cups butter ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "3 cups white sugar ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "1 teaspoon almond extract ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "3 cups cake flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease one 10 inch tube pan.\nCream together the butter, cream cheese, and sugar until light. Stir in the vanilla and the almond extracts. Add the flour and the eggs alternately, beginning and ending with the flour. Pour batter into the prepared pan.\nBake at 325 degrees F (165 degrees C) for 1 hour and 15 minutes or until a toothpick inserted in the center comes out clean.\n",
        "picture_link": "GmMZ4689vUMhUxC8ykS5lSRYVQQKRbW"
    },
    {
        "title": "Praline Sweet Potatoes",
        "ingredients": [
            "4 cups mashed sweet potatoes ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 tablespoons vanilla extract ADVERTISEMENT",
            "4 eggs, beaten ADVERTISEMENT",
            "1/2 pint heavy cream ADVERTISEMENT",
            "1/4 pound butter ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 1/4 cups chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Butter one 2 quart casserole dish. Preheat oven to 350 degrees F (175 degrees C).\nIn a mixing bowl, combine the sweet potatoes, sugar, vanilla extract, eggs and cream. Blend well, and spread evenly in casserole dish.\nPrepare the topping by combining the butter, brown sugar, flour and pecans. Mix until crumbly, and sprinkle over sweet potato mixture.\nBake for 30 minutes in the preheated oven.\n",
        "picture_link": "N9J50BoMOvPbqHET8CQ0cRbGt7IiebS"
    },
    {
        "title": "Honey Wheat Sandwich Rolls",
        "ingredients": [
            "1 1/4 cups warm milk ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "2 tablespoons butter, softened ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "2 3/4 cups bread flour ADVERTISEMENT",
            "1 cup whole wheat flour ADVERTISEMENT",
            "1 1/4 teaspoons bread machine yeast ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place ingredients in the pan of the bread machine in the order recommended by the manufacturer. Select dough cycle; press start.\nWhen dough cycle has finished, turn dough out onto a lightly floured surface and roll out 3/4 inch thick. Cut out rolls with a 3 to 4 inch diameter biscuit cutter. Place on lightly greased cookie sheets; cover and let rise until doubled, about 1 hour. Meanwhile, preheat oven to 350 degrees F (175 degrees C).\nBake in preheated oven for 10 to 15 minutes. When rolls are finished baking, brush with melted butter.\n",
        "picture_link": "K.92KqBFzPhqMb8hDZE1IWcwvacFAii"
    },
    {
        "title": "Peanut Blossoms II",
        "ingredients": [
            "1 cup shortening ADVERTISEMENT",
            "1 cup peanut butter ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "3 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 cup white sugar for decoration ADVERTISEMENT",
            "2 (9 ounce) bags milk chocolate candy kisses, unwrapped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease cookie sheets.\nIn a large bowl, cream together the shortening, peanut butter, brown sugar, and 1 cup white sugar until smooth. Beat in the eggs one at a time, and stir in the milk and vanilla. Combine the flour, baking soda, and salt; stir into the peanut butter mixture until well blended. Shape tablespoonfuls of dough into balls, and roll in remaining white sugar. Place cookies 2 inches apart on the prepared cookie sheets.\nBake for 10 to12 minutes in the preheated oven. Remove from oven, and immediately press a chocolate kiss into each cookie. Allow to cool completely; the kiss will harden as it cools.\n",
        "picture_link": "KJPQH8fBGIW0bBk.MycvAZQ.2RriC8C"
    },
    {
        "title": "Pork Chops to Live For",
        "ingredients": [
            "2 tablespoons shortening ADVERTISEMENT",
            "4 pork chops ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1 large onion, sliced ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed cream of mushroom soup ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt shortening in a large skillet over medium-high heat. Dip pork chops in beaten egg, then dredge in flour. Cook in hot skillet, turning once to brown both sides.\nPlace pork chops into a slow cooker, and arrange sliced onions over meat. Pour soup and milk over the meat and onions.\nCover, and cook on High for 4 to 5 hours, or on Low for 8 to 10 hours.\n",
        "picture_link": "ZtAejdCYjXJmOtwosnRnvfRCqlf2Y.O"
    },
    {
        "title": "Buttermilk Pancakes I",
        "ingredients": [
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 1/4 cups buttermilk ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat a skillet over medium heat. Combine all ingredients in a blender. Puree until smooth.\nPour batter onto the griddle, to form 5 pancakes. Flip pancakes when edges appear to harden. Cook pancakes on other side for same amount of time until golden brown.\n",
        "picture_link": "4u6lsQjmX49UdsRoNkCsg6FXtwiD.fG"
    },
    {
        "title": "Brown Sugar Chops",
        "ingredients": [
            "6 pork chops ADVERTISEMENT",
            "6 tablespoons brown sugar ADVERTISEMENT",
            "6 tablespoons margarine ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace the chops in a 9x13 inch baking pan. Place 1 tablespoon of brown sugar on top of every chop. Place 1 tablespoon of margarine on top of the brown sugar. Sprinkle chops with soy sauce.\nCover pan with foil and bake in preheated oven for 45 minutes. Remove foil and bake for an additional 15 minutes, until browned.\n",
        "picture_link": "oJDzzrIl30FoqYWvpIuHn6rOfZO0fgm"
    },
    {
        "title": "Peanut Butter Frosting",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1 cup creamy peanut butter ADVERTISEMENT",
            "4 cups confectioners' sugar ADVERTISEMENT",
            "1/3 cup cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, beat butter and peanut butter until light and fluffy. Slowly beat in 1/2 of the confectioner's sugar. Mix in 1/4 cup of the cream. Beat in the remaining confectioners' sugar. If necessary, add a little more cream or milk until the frosting reaches a good spreading consistency. Makes enough to frost one 2 layer 9 inch cake or one 9x13 inch cake.\n",
        "picture_link": "R2hMJsyppfsT8UyW6SRhV/iW5iP5Yg2"
    },
    {
        "title": "Cod with Italian Crumb Topping",
        "ingredients": [
            "1/4 cup fine dry bread crumbs ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "1 tablespoon cornmeal ADVERTISEMENT",
            "1 teaspoon olive oil ADVERTISEMENT",
            "1/2 teaspoon Italian seasoning ADVERTISEMENT",
            "1/8 teaspoon garlic powder ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "4 (3 ounce) fillets cod fillets ADVERTISEMENT",
            "1 egg white, lightly beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nIn a small shallow bowl, stir together the bread crumbs, cheese, cornmeal, oil, italian seasoning, garlic powder and pepper; set aside.\nCoat the rack of a broiling pan with cooking spray. Place the cod on the rack, folding under any thin edges of the filets. Brush with the egg white, then spoon the crumb mixture evenly on top.\nBake in a preheated oven for 10 to 12 minutes or until the fish flakes easily when tested with a fork and is opaque all the way through.\n",
        "picture_link": "hxbvu2JpV3fFHJsI9vCrOZxHgOyPqvW"
    },
    {
        "title": "Gary's Stuffed Mushrooms",
        "ingredients": [
            "12 large fresh mushrooms, stems removed ADVERTISEMENT",
            "1 (6 ounce) package chicken flavored dry stuffing mix ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/2 pound imitation crabmeat, flaked ADVERTISEMENT",
            "2 cups butter ADVERTISEMENT",
            "2 cloves garlic, peeled and minced ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "garlic powder to taste ADVERTISEMENT",
            "crushed red pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Arrange mushroom caps on a medium baking sheet, bottoms up. Chop and reserve mushroom stems.\nPrepare chicken flavored dry stuffing mix according to package directions.\nPreheat oven to 350 degrees F (175 degrees C).\nIn a medium saucepan over medium heat, melt butter. Mix in garlic and cook until tender, about 5 minutes.\nIn a medium bowl, mix together reserved mushroom stems, prepared dry stuffing mix, cream cheese and imitation crabmeat. Liberally stuff mushrooms with the mixture. Drizzle with the butter and garlic. Season with salt, pepper, garlic powder and crushed red pepper.\nBake uncovered in the preheated oven 10 to 12 minutes, or until stuffing is lightly browned.\n",
        "picture_link": "yMoyIrLyArxfpGRDPIl2aOls7UxApt6"
    },
    {
        "title": "Aw-some Coleslaw",
        "ingredients": [
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "2 1/2 tablespoons lemon juice ADVERTISEMENT",
            "1 1/2 tablespoons vinegar ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "9 1/2 cups shredded cabbage ADVERTISEMENT",
            "1/2 cup grated carrots ADVERTISEMENT",
            "1/4 cup minced sweet onion ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together mayonnaise, sugar, milk, lemon juice, vinegar, and salt and pepper in a large bowl.\nToss the cabbage, carrots, and onion into the dressing; mix well. Refrigerate for at least 3 hours or up to overnight before serving.\n",
        "picture_link": "5psX9Dxk0hfyWJ9ghucM6m5fkuxfNvy"
    },
    {
        "title": "French Crepes",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sift together flour, sugar and salt; set aside. In a large bowl, beat eggs and milk together with an electric mixer. Beat in flour mixture until smooth; stir in melted butter.\nHeat a lightly oiled griddle or frying pan over medium high heat. Pour or scoop the batter onto the griddle, using approximately 2 tablespoons for each crepe. Tip and rotate pan to spread batter as thinly as possible. Brown on both sides and serve hot.\n",
        "picture_link": "ILHLDuJm0fiy6UnYPUa3ACl5sK3EoMu"
    },
    {
        "title": "Whole Wheat and Honey Pizza Dough",
        "ingredients": [
            "1 (.25 ounce) package active dry yeast ADVERTISEMENT",
            "1 cup warm water ADVERTISEMENT",
            "2 cups whole wheat flour ADVERTISEMENT",
            "1/4 cup wheat germ ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a small bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes.\nIn a large bowl combine flour, wheat germ and salt. Make a well in the middle and add honey and yeast mixture. Stir well to combine. Cover and set in a warm place to rise for a few minutes.\nRoll dough on a floured pizza pan and poke a few holes in it with a fork.\nBake in preheated oven for 5 to 10 minutes, or until desired crispiness is achieved.\n",
        "picture_link": "0r8E8Oe0RyVJL8Ul.czo/1gfWhJ/IsS"
    },
    {
        "title": "Garlic Croutons",
        "ingredients": [
            "4 tablespoons butter ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "3 (3/4 inch thick) slices French bread, cut into cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large saute pan, melt butter over medium heat. Stir in garlic; cook and stir for 1 minute. Add bread cubes, and toss to coat. Spread on a baking sheet.\nBake for 15 minutes, or until crisp and dry. Check frequently to prevent burning. Cool.\n",
        "picture_link": "ttIX2m7ki.NcBlWlioDxkSn2NrURLTS"
    },
    {
        "title": "Smothered Green Beans",
        "ingredients": [
            "6 thick slices bacon, chopped ADVERTISEMENT",
            "1/2 cup onions, minced ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1 pound fresh green beans, trimmed ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bacon in a large, deep skillet. Cook over medium high heat until the fat begins to render. Stir in onions and garlic; let cook for 1 minute. Stir in beans and water. Let the beans cook until the water has evaporated and the beans are tender. If the beans are not tender once the water has evaporated, add a small amount more water and let them cook until tender. Season with salt and pepper (to taste) and serve.\n",
        "picture_link": "0UvRPdRSxfSV1ykJhjJ0i6RTD4dsA7S"
    },
    {
        "title": "Asian Glazed Chicken Thighs",
        "ingredients": [
            "1/2 cup rice vinegar ADVERTISEMENT",
            "5 tablespoons honey ADVERTISEMENT",
            "1/3 cup soy sauce (such as Silver Swan®) ADVERTISEMENT",
            "1/4 cup Asian (toasted) sesame oil ADVERTISEMENT",
            "3 tablespoons Asian chili garlic sauce ADVERTISEMENT",
            "3 tablespoons minced garlic ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "8 skinless, boneless chicken thighs ADVERTISEMENT",
            "1 tablespoon chopped green onion (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk the vinegar, honey, soy sauce, toasted sesame oil, chili garlic sauce, garlic, and salt in a bowl until smooth. Pour half the marinade into a large plastic zipper bag; retain the other half of the sauce. Place the chicken thighs into the bag containing marinade, squeeze all the air out of the bag, and seal. Shake a few times to coat chicken; refrigerate for 1 hour, turning bag once or twice.\nPreheat oven to 425 degrees F (220 degrees C).\nPour the other half of the marinade into a saucepan over medium heat, bring to a boil, and cook for 3 to 5 minutes, stirring often, to thicken sauce. Remove the chicken from the bag; discard used marinade. Place chicken thighs into a 9x13-inch baking dish, and brush with 1/3 of the thickened marinade from the saucepan.\nBake 30 minutes, basting one more time after 10 minutes; an instant-read thermometer inserted into a chicken thigh should read 165 degrees F (75 degrees C). Let stand for 5 or 10 minutes; meanwhile, bring remaining marinade back to a boil for 1 or 2 minutes, and serve chicken with marinade. Sprinkle with green onions.\n",
        "picture_link": "BALemcX4YvytyKvPYrnywiwZf4hYel6"
    },
    {
        "title": "Best Ever Sausage with Peppers, Onions, and Beer!",
        "ingredients": [
            "3 tablespoons olive oil ADVERTISEMENT",
            "3 pounds Italian sausage links ADVERTISEMENT",
            "3 red bell peppers, sliced ADVERTISEMENT",
            "2 green bell peppers, sliced ADVERTISEMENT",
            "2 large red onions, sliced ADVERTISEMENT",
            "3 cloves garlic, chopped ADVERTISEMENT",
            "2 (12 fluid ounce) bottles beer ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "3 tablespoons chopped fresh oregano ADVERTISEMENT",
            "3 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "2 tablespoons hot sauce ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large heavy skillet over medium high heat. Cook sausage until browned on all sides. Remove sausage from pan, and set aside. Pour in 1 bottle of beer to deglaze the pan, scraping up any blackened bits from the bottom. Place the red peppers, green peppers, onions and garlic in the pan. Stir in the remaining beer and the tomato paste. Season with oregano, cilantro, hot sauce, salt and pepper. Cover, and simmer until onions and peppers are tender. Slice the sausages into bite size pieces, and add to the peppers. Cover, and simmer until sausage is cooked through.\n",
        "picture_link": "3C9XGW..jZplhFEvcVw99uXGlbHe4Dm"
    },
    {
        "title": "Dutch Apple Pie with Oatmeal Streusel",
        "ingredients": [
            "1 (9 inch) pie shell ADVERTISEMENT",
            "5 cups apples - peeled, cored and sliced ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon ground allspice ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "3/4 cup rolled oats ADVERTISEMENT",
            "1 teaspoon lemon zest ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Fit pastry shell into pie pan and place in freezer.\nTo Make Apple Filling: Place apples in a large bowl. In a separate bowl combine 2 tablespoons flour, white sugar, 1/2 teaspoon cinnamon, nutmeg, and allspice. Mix well, then add to apples. Toss until apples are evenly coated.\nRemove pie shell from freezer. Place apple mixture in pie shell and dot with 2 tablespoons butter or margarine. Lay a sheet of aluminum foil lightly on top of filling, but do not seal.\nBake in preheated oven for 10 minutes.\nWhile filling is baking, make Streusel Topping: In a medium bowl combine 3/4 cup flour, 1/2 teaspoon cinnamon, brown sugar, oats, and lemon peel. Mix thoroughly, then cut in 1/2 cup butter or margarine until mixture is crumbly. Remove filling from oven and sprinkle streusel on top.\nReduce heat to 375 degrees F (190 degrees C). Bake an additional 30 to 35 minutes, until streusel is browned and apples are tender. Cover loosely with aluminum foil to prevent excess browning.\n",
        "picture_link": "w5S4Oq0X57T8UdUBTEqlY3EFPRA4nbS"
    },
    {
        "title": "Basic Biscuits",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup shortening ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nIn a large mixing bowl sift together flour, baking powder and salt. Cut in shortening with fork or pastry blender until mixture resembles coarse crumbs.\nPour milk into flour mixture while stirring with a fork. Mix in milk until dough is soft, moist and pulls away from the side of the bowl.\nTurn dough out onto a lightly floured surface and toss with flour until no longer sticky. Roll dough out into a 1/2 inch thick sheet and cut with a floured biscuit or cookie cutter. Press together unused dough and repeat rolling and cutting procedure.\nPlace biscuits on ungreased baking sheets and bake in preheated oven until golden brown, about 10 minutes.\n",
        "picture_link": "G3rZ3DMrdcgi4TrJ9yhSCv5i9LBN2K6"
    },
    {
        "title": "Sweet and Spicy Sweet Potatoes",
        "ingredients": [
            "2 large sweet potatoes, peeled and cubed ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "2 teaspoons packed brown sugar ADVERTISEMENT",
            "1 1/2 tablespoons paprika ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon poultry seasoning ADVERTISEMENT",
            "1/2 teaspoon chili powder ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 425 degrees F (220 degrees C).\nPlace the sweet potato chunks into a large mixing bowl. Drizzle with the olive oil, then sprinkle the brown sugar, paprika, black pepper, onion powder, garlic powder, poultry seasoning, chili powder, and cayenne pepper overtop. Toss until the potatoes are evenly coated with the seasoning. Spread onto a baking sheet.\nBake in the preheated oven for 15 minutes, then turn the potatoes over with a spatula, and continue baking until the sweet potatoes are golden and tender, 10 to 15 minutes more.\n",
        "picture_link": "4wfeG7S3AvAjIkk4DMv5giuEcToS0f2"
    },
    {
        "title": "Lisa's Chocolate Chocolate Chip Cake",
        "ingredients": [
            "1 (18.25 ounce) package chocolate cake mix ADVERTISEMENT",
            "1 (3.9 ounce) package instant chocolate pudding mix ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/2 cup hot water ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup mini semi-sweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a Bundt pan.\nCombine cake mix, pudding mix, oil, eggs, water, sour cream, and vanilla. Beat until smooth. Stir in chocolate chips. Pour batter into prepared pan.\nBake for 1 hour. Allow to cool.\n",
        "picture_link": "Jb9OCZzOxSX4YMDK.m2TmU6ITmhSGya"
    },
    {
        "title": "Chef John's Perfect Mashed Potatoes",
        "ingredients": [
            "3 large russet potatoes, peeled and cut in half lengthwise ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/2 cup whole milk ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the potatoes into a large pot, and cover with salted water. Bring to a boil, reduce heat to medium-low, cover, and simmer until tender, 20 to 25 minutes. Drain, and return the potatoes to the pot. Turn heat to high, and allow the potatoes to dry for about 30 seconds. Turn off the heat.\nMash the potatoes with a potato masher twice around the pot, then add the butter and milk. Continue to mash until smooth and fluffy. Whisk in the salt and black pepper until evenly distributed, about 15 seconds.\n",
        "picture_link": "OTIGmKzTpN3r4EhqqbrDeXYbBtS3ltq"
    },
    {
        "title": "Oatmeal Chocolate Chip Muffins",
        "ingredients": [
            "1 1/4 cups quick cooking oats ADVERTISEMENT",
            "1 1/4 cups milk ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "3/4 cup packed brown sugar ADVERTISEMENT",
            "3/4 cup semisweet chocolate chips ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "4 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine oats and milk and allow to stand for 15 minutes. Preheat oven to 400 degrees F (205 degrees C). Grease each cup of one 12-cup muffin tin.\nStir egg, oil, 1/2 cup of the brown sugar, chocolate chips and 1/2 cup of the pecans into the oat and milk mixture.\nCombine flour, baking powder and salt. Add oat mixture to flour mixture, stirring until just moist. Fill each cup of one 12-cup muffin tin 2/3 full. Sprinkle tops with the remaining brown sugar and pecans.\nBake at 400 degrees F (205 degrees C) for 20 to 25 minutes.\n",
        "picture_link": "F3nVd8cN69TUvi6nice602j0McTjh/e"
    },
    {
        "title": "Salsafied Chicken and Rice",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 pound skinless, boneless chicken breast halves - cubed ADVERTISEMENT",
            "1 (14.5 ounce) can chicken broth ADVERTISEMENT",
            "1 (8 ounce) jar salsa ADVERTISEMENT",
            "2 cups instant rice ADVERTISEMENT",
            "8 ounces shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large skillet over medium-high heat. Season chicken with salt and pepper. Cook and stir chicken in hot oil until cooked through and juices run clear, 5 to 7 minutes. Add the broth and salsa and bring to a boil; turn off the heat and stir in the instant rice. Sprinkle Cheddar cheese over the mixture. Cover the skillet and let sit until the rice is tender, about 5 minutes.\n",
        "picture_link": "fZnsNewhiv7BsFVGLt860sEtj67UOvy"
    },
    {
        "title": "Mom's Chicken Cacciatore",
        "ingredients": [
            "2 cups all-purpose flour for coating ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 (4 pound) chicken, cut into pieces ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "1/2 teaspoon dried oregano ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "2 cups fresh mushrooms, quartered ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the flour, salt and pepper in a plastic bag. Shake the chicken pieces in flour until coated. Heat the oil in a large skillet (one that has a cover/lid). Fry the chicken pieces until they are browned on both sides. Remove from skillet.\nAdd the onion, garlic and bell pepper to the skillet and saute until the onion is slightly browned. Return the chicken to the skillet and add the tomatoes, oregano and wine. Cover and simmer for 30 minutes over medium low heat.\nAdd the mushrooms and salt and pepper to taste. Simmer for 10 more minutes.\n",
        "picture_link": "WuFqg7vzhLslSSJGrvvcEf.Qn/zxHVO"
    },
    {
        "title": "Magic Cookie Bars II",
        "ingredients": [
            "1 1/2 cups graham cracker crumbs ADVERTISEMENT",
            "1/2 cup margarine, melted ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "3/4 cup semisweet chocolate chips ADVERTISEMENT",
            "3/4 cup butterscotch chips ADVERTISEMENT",
            "1 1/2 cups flaked coconut ADVERTISEMENT",
            "1 1/3 cups sweetened condensed milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a 9 x 13 inch pan pour in melted margarine. Sprinkle the graham cracker crumbs evenly over the margarine. Next place the chopped nuts over the crumbs, and spread the chocolate and butterscotch chips over the nuts. Add the coconut over all, and pour the milk evenly over the top.\nBake 25 to 30 minutes or until lightly brown on top. Cool at least 20 minutes then cut into desired sized bars.\n",
        "picture_link": "rX9p65LMMHbcUtQ2nZylmDUueitmo1K"
    },
    {
        "title": "Angie's Perfect Dinner Rolls",
        "ingredients": [
            "2 1/2 cups warm milk ADVERTISEMENT",
            "4 teaspoons active dry yeast ADVERTISEMENT",
            "1/2 cup sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "7 cups all-purpose flour, or as needed ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour milk into a large mixing bowl, and sprinkle yeast over the surface. Allow to rest for 5 minutes. Beat in the sugar, eggs, 1/2 cup butter, and salt; blend thoroughly. Gradually stir in the flour to make a soft dough. Cover bowl, and set in a warm place until dough doubles in size, about 1 hour.\nPunch down the dough, cover the bowl, and allow to rise again. Repeat this step two more times.\nBreak off 2 to 3 inch size pieces of dough, roll lightly into round shape, and place in prepared baking dish, edges touching. Repeat to make 36 dough balls. Cover and let rise until doubled in size.\nPreheat oven to 400 degrees F (200 degrees C). Lightly grease a 9x13 inch baking dish.\nBake rolls in preheated oven until tops turn golden brown, 10 to 15 minutes. When rolls are finished baking, drizzle melted butter over the top, and serve warm.\n",
        "picture_link": "YutVEHFHlLGJQE21xgXL0Bilh0dxfIe"
    },
    {
        "title": "Best Hamburger Ever",
        "ingredients": [
            "1 1/2 pounds lean ground beef ADVERTISEMENT",
            "1/2 onion, finely chopped ADVERTISEMENT",
            "1/2 cup shredded Colby Jack or Cheddar cheese ADVERTISEMENT",
            "1 teaspoon soy sauce ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 (1 ounce) envelope dry onion soup mix ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 teaspoon dried parsley ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1/2 teaspoon crushed dried rosemary ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat a grill for high heat.\nIn a large bowl, mix together the ground beef, onion, cheese, soy sauce, Worcestershire sauce, egg, onion soup mix, garlic, garlic powder, parsley, basil, oregano, rosemary, salt, and pepper. Form into 4 patties.\nGrill patties for 5 minutes per side on the hot grill, or until well done. Serve on buns with your favorite condiments.\n",
        "picture_link": "zSk3v6.wMRNrtmTqLl1NZviJlyPfadq"
    },
    {
        "title": "Cookie Balls",
        "ingredients": [
            "1 pound chocolate sandwich cookies, crushed ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1 pound vanilla-flavored candy coating, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large mixing bowl, combine crushed cookies and cream cheese to form a stiff dough. Roll into balls and dip with a fork in melted candy coating. Let rest on waxed paper until set.\n",
        "picture_link": "NPkdCnvT77EaDVnFgiV6HmfGrN4Sidm"
    },
    {
        "title": "Scottish Shortbread IV",
        "ingredients": [
            "2 cups butter ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "4 1/2 cups all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nCream butter and brown sugar. Add 3 to 3 3/4 cups flour. Mix well.\nSprinkle board with the remaining flour. Knead for 5 minutes, adding enough flour to make a soft dough. Roll to 1/2 inch thickness. Cut into 3x1 inch strips. Prick with fork and place on ungreased baking sheets.\nBake at 325 degrees F (165 degrees C) for 20 to 25 minutes.\n",
        "picture_link": "fF5oy0ONFhkTZ1v.2AvaeaxBMljllTe"
    },
    {
        "title": "Potato Latkes I",
        "ingredients": [
            "2 cups peeled and shredded potatoes ADVERTISEMENT",
            "1 tablespoon grated onion ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1/2 cup peanut oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the potatoes in a cheesecloth and wring, extracting as much moisture as possible.\nIn a medium bowl stir the potatoes, onion, eggs, flour and salt together.\nIn a large heavy-bottomed skillet over medium-high heat, heat the oil until hot. Place large spoonfuls of the potato mixture into the hot oil, pressing down on them to form 1/4 to 1/2 inch thick patties. Brown on one side, turn and brown on the other. Let drain on paper towels. Serve hot!\n",
        "picture_link": "kZRvwAtkjCiI4oUW0olGXRoT6gI7aXi"
    },
    {
        "title": "Smoky Grilled Pork Chops",
        "ingredients": [
            "1 tablespoon seasoned salt (such as LAWRY'S®) ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 tablespoon onion powder ADVERTISEMENT",
            "1 tablespoon ground paprika ADVERTISEMENT",
            "2 teaspoons Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon liquid smoke flavoring ADVERTISEMENT",
            "4 bone-in pork chops (1/2 to 3/4 inch thick) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium heat, and lightly oil the grate.\nIn a bowl, mix together the seasoned salt, black pepper, garlic powder, onion powder, paprika, Worcestershire sauce, and smoke flavoring until thoroughly combined. Rinse pork chops, and sprinkle the wet chops on both sides with the spice mixture. With your hands, massage the spice rub into the meat; allow to stand for 10 minutes.\nGrill the chops over indirect heat until no longer pink inside, about 12 minutes per side. An instant-read thermometer should read at least 145 degrees F (63 degrees C). Allow chops to stand for 10 more minutes before serving.\n",
        "picture_link": "yqkeLjp6kUREmyEhx8gdM.QDjnRPo1u"
    },
    {
        "title": "Manicotti Italian Casserole",
        "ingredients": [
            "1 pound rigatoni pasta ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 pound Italian sausage ADVERTISEMENT",
            "1 (8 ounce) can mushrooms, drained ADVERTISEMENT",
            "2 (32 ounce) jars spaghetti sauce ADVERTISEMENT",
            "1 1/2 pounds shredded mozzarella cheese ADVERTISEMENT",
            "thinly sliced pepperoni ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of lightly salted water to boil. Pour in rigatoni, and cook until al dente, about 8 to 10 minutes. Drain, and set pasta aside.\nMeanwhile, brown ground beef and italian sausage in a large skillet over medium heat. With a slotted spoon, remove beef and sausage to a baking dish. Stir mushrooms, spaghetti sauce, and cooked pasta into the baking dish. Sprinkle cheese and pepperoni over the top.\nBake in preheated oven until the cheese is brown and bubbly, about 20 minutes.\n",
        "picture_link": "b7GTCV.2DVI9Rw10cCOwDF0c4ybJDz2"
    },
    {
        "title": "Dark Chocolate Cake II",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "3/4 cup unsweetened cocoa ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 cup cold brewed coffee ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "2 teaspoons vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13-inch pan.\nIn a large bowl, combine the flour, sugar, cocoa, baking soda, baking powder and salt. Make a well in the center and pour in the eggs, coffee, milk, oil and vinegar. Mix until smooth; the batter will be thin. Pour the batter into the prepared pan.\nBake in the preheated oven for 35 to 40 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool.\n",
        "picture_link": "KBzXLKr.QO4IuqItvxivt5xDNmoBBmC"
    },
    {
        "title": "English Muffins",
        "ingredients": [
            "1 cup milk ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 (.25 ounce) package active dry yeast ADVERTISEMENT",
            "1 cup warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "1/4 cup melted shortening ADVERTISEMENT",
            "6 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Warm the milk in a small saucepan until it bubbles, then remove from heat. Mix in the sugar, stirring until dissolved. Let cool until lukewarm. In a small bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes.\nIn a large bowl, combine the milk, yeast mixture, shortening and 3 cups flour. Beat until smooth. Add salt and rest of flour, or enough to make a soft dough. Knead. Place in greased bowl, cover, and let rise.\nPunch down. Roll out to about 1/2 inch thick. Cut rounds with biscuit cutter, drinking glass, or empty tuna can. Sprinkle waxed paper with cornmeal and set the rounds on this to rise. Dust tops of muffins with cornmeal also. Cover and let rise 1/2 hour.\nHeat greased griddle. Cook muffins on griddle about 10 minutes on each side on medium heat. Keep baked muffins in a warm oven until all have been cooked. Allow to cool and place in plastic bags for storage. To use, split and toast. Great with orange butter, or cream cheese and jam.\n",
        "picture_link": "i/sYZ6pkcdkxEr/btoKDFVO5p9Qqqzi"
    },
    {
        "title": "Portobello Mushroom Stroganoff",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "3/4 pound portobello mushrooms, sliced ADVERTISEMENT",
            "1 1/2 cups vegetable broth ADVERTISEMENT",
            "1 1/2 cups sour cream ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "8 ounces dried egg noodles ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add egg noodles, and cook until al dente, about 7 minutes. Remove from heat, drain, and set aside.\nAt the same time, melt butter in a large heavy skillet over medium heat. Add onion, and cook, stirring until softened. Turn the heat up to medium-high, and add sliced mushrooms. Cook until the mushrooms are limp and browned. Remove to a bowl, and set aside.\nIn the same skillet, stir in vegetable broth, being sure to stir in any browned bits off the bottom of the pan. Bring to a boil, and cook until the mixture has reduced by 1/3. Reduce heat to low, and return the mushrooms and onion to the skillet.\nRemove the pan from the heat, stir together the sour cream and flour; then blend into the mushrooms. Return the skillet to the burner, and continue cooking over low heat, just until the sauce thickens. Stir in the parsley, and season to taste with salt and pepper. Serve over cooked egg noodles.\n",
        "picture_link": "12gHnBuFv4x6eXM1Zi8NCu3PobyX2bS"
    },
    {
        "title": "Italian Bread Bowls",
        "ingredients": [
            "2 (.25 ounce) packages active dry yeast ADVERTISEMENT",
            "2 1/2 cups warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "7 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon cornmeal ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, dissolve yeast in warm water. Let stand until creamy, about 10 minutes.\nAdd salt, oil and 4 cups flour to the yeast mixture; beat well. Stir in the remaining flour, 1/2 cup at a time, beating well with an electric mixer at medium speed after each addition.\nWhen the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and elastic, about 6 minutes. Lightly oil a large bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and let rise in a warm place until doubled in volume, about 40 minutes.\nPunch dough down, and divide into 8 equal portions. Shape each portion into a 4 inch round loaf. Place loaves on lightly greased baking sheets sprinkled with cornmeal. Cover and let rise in a warm place, free from drafts, until doubled in bulk, about 35 minutes.\nPreheat oven to 400 degrees F (200 degrees C). In a small bowl, beat together egg white and 1 tablespoon water; lightly brush the loaves with half of this egg wash.\nBake in preheated oven for 15 minutes. Brush with remaining egg mixture, and bake 10 to 15 more minutes or until golden. Cool on wire racks.\nTo make bowls: Cut a 1/2 inch thick slice from top of each loaf; scoop out centers, leaving 3/4-inch-thick shells. Fill bread bowls with hot soup and serve immediately.\n",
        "picture_link": "rNNR58bTbrz5kMtjP/lLBbWamXLgAe2"
    },
    {
        "title": "Homemade Vanilla Pudding",
        "ingredients": [
            "2 cups milk ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "3 tablespoons cornstarch ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In medium saucepan over medium heat, heat milk until bubbles form at edges. In a bowl, combine sugar, cornstarch and salt. Pour into hot milk, a little at a time, stirring to dissolve. Continue to cook and stir until mixture thickens enough to coat the back of a metal spoon. Do not boil. Remove from heat, stir in vanilla and butter. Pour into serving dishes. Chill before serving.\n",
        "picture_link": "erJMZuTFj.BV5EAZrYNKKseWpPOKkgq"
    },
    {
        "title": "Enchiladas Suizas",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "2/3 cup chopped Spanish onion ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1 1/2 cups chicken broth ADVERTISEMENT",
            "1 cup chopped green chile peppers ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1 dash ground cumin ADVERTISEMENT",
            "12 (8 inch) corn tortillas ADVERTISEMENT",
            "canola oil for frying ADVERTISEMENT",
            "1 cup shredded Monterey Jack cheese ADVERTISEMENT",
            "1 cup shredded mild Cheddar cheese ADVERTISEMENT",
            "2 cups shredded, cooked chicken breast meat ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "1/4 cup chopped green onion ADVERTISEMENT",
            "1/2 cup sliced green olives ADVERTISEMENT",
            "1 pint cherry tomatoes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare salsa verde: Melt butter in saucepan over medium heat. Saute the onion until soft. Stir in the flour. Add the broth, then add the chiles, garlic, salt, and cumin. Simmer about 15 minutes to blend flavors, then set aside. Preheat oven to 350 degrees F (175 degrees C.)\nIn a heavy skillet, lightly fry tortillas in shallow oil, being careful not to make them too crisp to roll. Combine the cheeses and keep 1/2 cup aside for topping. Dip each tortilla in salsa verde (both sides.) Place 2 heaping tablespoons chicken and about 2 tablespoons cheese down the center of each; roll and place seam side down in a shallow dish.\nAfter all the rolled tortillas are in the dish, spoon additional salsa verde over them and then cover evenly with heavy cream. Sprinkle with remaining 1/2 cup cheese mixture, and with the green onions.\nBake uncovered in preheated oven for 20 minutes. Serve immediately, garnished with the olives, cherry tomatoes, and with additional salsa on the side.\n",
        "picture_link": "xmdRMQbpOo.cZhpVDAKvVNwMECibboW"
    },
    {
        "title": "Oatmeal Butterscotch Cookies",
        "ingredients": [
            "3/4 cup butter, softened ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "3/4 cup packed brown sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3 cups rolled oats ADVERTISEMENT",
            "1 2/3 cups butterscotch chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn a large bowl beat the butter or margarine, white sugar and brown sugar together. Add the eggs and vanilla, beating well.\nStir together the flour, baking soda, cinnamon and salt. Gradually add the flour mixture to the butter mixture and stir until blended. Stir in the oats and the butterscotch chips. Drop by teaspoonfuls onto an ungreased cookie sheet.\nBake for 8 to 10 minutes in the preheated oven, until the edges begin to brown.\n",
        "picture_link": "1Mzn58Nd8FvJBYCqG9Q3bO0WU8wKgeC"
    },
    {
        "title": "Oven Scrambled Eggs",
        "ingredients": [
            "1/2 cup butter or margarine, melted ADVERTISEMENT",
            "24 eggs ADVERTISEMENT",
            "2 1/4 teaspoons salt ADVERTISEMENT",
            "2 1/2 cups milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\nPour melted butter into a glass 9x13 inch baking dish. In a large bowl, whisk together eggs and salt until well blended. Gradually whisk in milk. Pour egg mixture into the baking dish.\nBake uncovered for 10 minutes, then stir, and bake an additional 10 to 15 minutes, or until eggs are set. Serve immediately.\n",
        "picture_link": "hqKfGZ4/FYSb/ADBD4vW7WrdS5LM7my"
    },
    {
        "title": "Roast Potatoes",
        "ingredients": [
            "2 pounds red potatoes, cut into quarters ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1/2 teaspoon dried rosemary, crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (250 degrees C).\nPlace potatoes in a large roasting pan and toss with oil, salt, pepper, and rosemary until evenly coated. Spread out potatoes in a single layer.\nBake in preheated oven for 20 minutes, stirring occasionally. Serve immediately.\n",
        "picture_link": "vIeSza.edpmLCaKbBtluIW/S1ms2DVi"
    },
    {
        "title": "The Best Bean and Ham Soup",
        "ingredients": [
            "1 (20 ounce) package 15 bean mixture, soaked overnight ADVERTISEMENT",
            "1 ham bone ADVERTISEMENT",
            "2 1/2 cups cubed ham ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "3 stalks celery, chopped ADVERTISEMENT",
            "5 large carrots, chopped ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes, with liquid ADVERTISEMENT",
            "1 (12 fluid ounce) can low-sodium vegetable juice ADVERTISEMENT",
            "3 cups vegetable broth ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "2 tablespoons Dijon mustard ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "3 bay leaves ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 tablespoon dried parsley ADVERTISEMENT",
            "3 tablespoons lemon juice ADVERTISEMENT",
            "7 cups low fat, low sodium chicken broth ADVERTISEMENT",
            "1 teaspoon kosher salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the soaked beans into a large pot and fill with enough water to cover by about 1 inch. Bring to a boil, then simmer over low for 30 minutes. Drain. Add the ham bone, ham, onion, celery, carrots, tomatoes, vegetable juice, and vegetable broth. Season with Worcestershire sauce, Dijon mustard, chili powder, bay leaves, pepper, parsley and lemon juice. Pour in enough of the chicken broth to cover the ingredients.\nSimmer over low heat, stirring occasionally, for about 8 hours. Add more chicken broth as needed throughout the day. Remove the ham bone and season with salt if needed. Continue to simmer for a couple more hours. Remove bay leaves before serving.\n",
        "picture_link": "aGBA/84PzdJycCVVScHUuOVoJ5YOVIC"
    },
    {
        "title": "Bran Flax Muffins",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "3/4 cup ground flax seed ADVERTISEMENT",
            "3/4 cup oat bran ADVERTISEMENT",
            "1 cup brown sugar ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "3/4 cup skim milk ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "2 cups shredded carrots ADVERTISEMENT",
            "2 apples, peeled, shredded ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1 cup chopped mixed nuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease muffin pan or line with paper muffin liners.\nIn a large bowl, mix together flour, flax seed, oat bran, brown sugar, baking soda, baking powder, salt and cinnamon. Add the milk, eggs, vanilla and oil; mix until just blended. Stir in the carrots, apples, raisins and nuts. Fill prepared muffin cups 2/3 full with batter.\nBake at 350 F (175 degrees C) for 15 to 20 minutes, or until a toothpick inserted into the center of a muffin comes out clean.\n",
        "picture_link": "twGa.9m20dJVvEOj1xVwEYF2Dw/2YqG"
    },
    {
        "title": "Insanely Easy Vegetarian Chili",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 cup chopped onions ADVERTISEMENT",
            "3/4 cup chopped carrots ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 cup chopped green bell pepper ADVERTISEMENT",
            "1 cup chopped red bell pepper ADVERTISEMENT",
            "3/4 cup chopped celery ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1 1/2 cups chopped fresh mushrooms ADVERTISEMENT",
            "1 (28 ounce) can whole peeled tomatoes with liquid, chopped ADVERTISEMENT",
            "1 (19 ounce) can kidney beans with liquid ADVERTISEMENT",
            "1 (11 ounce) can whole kernel corn, undrained ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "1 1/2 teaspoons dried oregano ADVERTISEMENT",
            "1 1/2 teaspoons dried basil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large saucepan over medium heat. Saute onions, carrots, and garlic until tender. Stir in green pepper, red pepper, celery, and chili powder. Cook until vegetables are tender, about 6 minutes.\nStir in mushrooms, and cook 4 minutes. Stir in tomatoes, kidney beans, and corn. Season with cumin, oregano, and basil. Bring to a boil, and reduce heat to medium. Cover, and simmer for 20 minutes, stirring occasionally.\n",
        "picture_link": "pxDU6f9lxBV19vk3fDB8.EXnkUCyVxW"
    },
    {
        "title": "Best Bruschetta Ever",
        "ingredients": [
            "2 tomatoes, cubed ADVERTISEMENT",
            "1 teaspoon dried basil ADVERTISEMENT",
            "4 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 clove garlic, crushed ADVERTISEMENT",
            "seasoning salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, mix tomatoes, dried basil, Parmesan cheese, olive oil, garlic, seasoning salt and ground black pepper. Cover and chill in the refrigerator 8 hours, or overnight, before serving.\n",
        "picture_link": "qpXv9JK7WcFdbBWe.mRJ.kfwNgr0/b2"
    },
    {
        "title": "Easy Cream Cheese Danish",
        "ingredients": [
            "2 (10 ounce) cans refrigerated crescent roll dough ADVERTISEMENT",
            "2 (8 ounce) packages cream cheese, diced ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 1/2 teaspoons lemon juice ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 teaspoons sour cream ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "1 tablespoon milk ADVERTISEMENT",
            "1 tablespoon butter, softened ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking pan.\nLine bottom of baking pan with 1 can of crescent rolls. Pinch all seams together to seal.\nIn a large bowl, mix together cream cheese, white sugar, lemon juice, vanilla extract and sour cream. Spread filling on top of rolls. Place second can of rolls on top of filling.\nBake in preheated oven for 20 to 30 minutes.\nIn a small bowl, stir together confectioners' sugar, milk and butter. After Danish has cooled, drizzle with icing.\n",
        "picture_link": "DIinDvjCVFTqbYvDl6kzXxQhK/y1Ew."
    },
    {
        "title": "Fabulous Zucchini Grinders",
        "ingredients": [
            "Marinara Sauce: ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 cloves garlic, peeled and coarsely chopped ADVERTISEMENT",
            "1 pinch crushed red pepper flakes ADVERTISEMENT",
            "1 tablespoon chopped fresh basil ADVERTISEMENT",
            "1 teaspoon red wine vinegar ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "Grinders: ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "2 medium zucchini, cubed ADVERTISEMENT",
            "1 pinch red pepper flakes ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 1/2 cups shredded mozzarella cheese ADVERTISEMENT",
            "4 (6 inch) French or Italian sandwich rolls, split ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To make marinara sauce, heat olive oil in a saucepan over medium heat (see Cook's Note). Add garlic, basil and red pepper flakes; cook and stir for a minute or two until fragrant. Stir in sugar, vinegar, salt, and pepper. Pour in tomatoes with their juices and simmer over low heat for 15 minutes. Remove from heat and puree until smooth in food processor or blender.\nPreheat the oven to 350 degrees F (175 degrees C).\nMelt butter in a skillet over medium heat. Cook the zucchini in butter until browned and slightly tender. Season with red pepper flakes, salt, and pepper.\nSpoon a generous amount of the zucchini mixture into each sandwich roll. Cover zucchini with about 1/4 cup marinara sauce per roll. Top with a handful of shredded mozzarella. Close the rolls, and wrap individually in aluminum foil.\nBake for 15 minutes in the preheated oven, until bread is heated through, rolls are soft, and cheese is melted.\n",
        "picture_link": "JXxQ/rAFIuIeS4iRYNN7pz42mahn102"
    },
    {
        "title": "Gerry's Chicken Enchiladas",
        "ingredients": [
            "4 boneless, skinless chicken breast halves ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 (10 ounce) can diced tomatoes with green chile peppers ADVERTISEMENT",
            "1 (14.5 ounce) can stewed tomatoes ADVERTISEMENT",
            "12 small chile peppers, diced (optional) ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1 (14.5 ounce) can chicken broth ADVERTISEMENT",
            "1 bunch green onions, chopped ADVERTISEMENT",
            "1/2 pint heavy cream ADVERTISEMENT",
            "6 (6 inch) corn tortillas ADVERTISEMENT",
            "3 cups shredded Cheddar cheese ADVERTISEMENT",
            "1 (10 ounce) can enchilada sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut chicken breasts into 1 inch strips. Place in a medium bowl with desired marinade, and marinate in the refrigerator for at least 30 minutes.\nPreheat oven to 350 degrees F (175 degrees C).\nHeat oil in a large skillet over medium heat. Saute chicken and onions until chicken is evenly brown. Stir in diced tomatoes with green chile peppers, stewed tomatoes, chile peppers, soup and broth. Bring mixture to a boil. Reduce heat, cover skillet, and simmer for 20 to 30 minutes, or until chicken is no longer pink and juices run clear.\nRemove chicken from skillet, and shred when cool enough to handle. Meanwhile, allow skillet mixture to simmer and reduce to about 2 1/4 cups. In a medium bowl, combine shredded chicken and about 1/4 cup skillet mixture (just enough to make a paste like mixture). Mix together with half the chopped green onions. Pour remaining 2 cups of skillet mixture into a 9x13 inch baking dish.\nIn a second skillet, heat cream over low heat, being careful not to boil. Dip tortillas in the warm cream to soften and coat. Spoon about 1/3 cup chicken mixture onto each tortilla. Top chicken mixture with half the shredded cheese, and roll up tortillas. Place rolled tortillas in baking dish, seam side down, and drizzle with enchilada sauce. Cover with remaining shredded cheese, and sprinkle remaining chopped green onion over cheese. Bake uncovered in preheated oven for 25 minutes, or until cheese is melted and bubbling.\n",
        "picture_link": "E8RA8u1vm3vO0rIoJJ00QKUoVkhdK1."
    },
    {
        "title": "Bourbon Chicken",
        "ingredients": [
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "4 ounces soy sauce ADVERTISEMENT",
            "2 tablespoons dried minced onion ADVERTISEMENT",
            "1/2 cup packed brown sugar ADVERTISEMENT",
            "3/8 cup bourbon ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken breasts in a 9x13 inch baking dish. In a small bowl combine the ginger, soy sauce, onion flakes, sugar, bourbon and garlic powder. Mix together and pour mixture over chicken. Cover dish and place in refrigerator. Marinate overnight.\nPreheat oven to 325 degrees F (165 degrees C).\nRemove dish from refrigerator and remove cover. Bake in the preheated oven, basting frequently, for 1 1/2 hours or until chicken is well browned and juices run clear.\n",
        "picture_link": "PCQj7873Hr3rdF0Fq5Y5bbIOd/02REa"
    },
    {
        "title": "Prize Winning Baby Back Ribs",
        "ingredients": [
            "1 tablespoon ground cumin ADVERTISEMENT",
            "1 tablespoon chili powder ADVERTISEMENT",
            "1 tablespoon paprika ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "3 pounds baby back pork ribs ADVERTISEMENT",
            "1 cup barbeque sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat a gas grill for high heat, or arrange charcoal briquettes on one side of the barbeque. Lightly oil the grate.\nIn a small jar, combine cumin, chili powder, paprika, salt, and pepper. Close the lid, and shake to mix.\nTrim the membrane sheath from the back of each rack. Run a small, sharp knife between the membrane and each rib, and snip off the membrane as much as possible. Sprinkle as much of the rub onto both sides of the ribs as desired. To prevent the ribs from becoming too dark and spicy, do not thoroughly rub the spices into the ribs. Store the unused portion of the spice mix for future use.\nPlace aluminum foil on lower rack to capture drippings and prevent flare-ups. Lay the ribs on the top rack of the grill (away from the coals, if you're using briquettes). Reduce gas heat to low, close lid, and leave undisturbed for 1 hour. Do not lift the lid at all.\nBrush ribs with barbecue sauce, and grill an additional 5 minutes. Serve ribs as whole rack, or cut between each rib bone and pile individually on a platter.\n",
        "picture_link": "91HRehWvHPa/v02dKETYHpl0Mk9DWxi"
    },
    {
        "title": "Swiss Chicken Casserole I",
        "ingredients": [
            "6 skinless, boneless chicken breast halves ADVERTISEMENT",
            "6 slices Swiss cheese ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of chicken soup ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 (8 ounce) package dry bread stuffing mix ADVERTISEMENT",
            "1/2 cup melted butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking dish.\nArrange chicken breasts in the baking dish. Place one slice of Swiss cheese on top of each chicken breast. Combine cream of chicken soup and milk in a medium bowl, and pour over chicken breasts. Sprinkle with stuffing mix. Pour melted butter over top, and cover with foil.\nBake 50 minutes, or until chicken is no longer pink and juices run clear.\n",
        "picture_link": "rakgm2T.SlJ5GTDwQ/CPEpYjFUfUJDC"
    },
    {
        "title": "Blueberry Coffee Cake I",
        "ingredients": [
            "1 cup packed brown sugar ADVERTISEMENT",
            "2/3 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 cup fresh blueberries ADVERTISEMENT",
            "1/4 cup confectioners' sugar for dusting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 350 degrees F (175 degrees C). Coat a Bundt pan well with cooking spray.\nMake the streusel topping: Mix 1 brown cup sugar, 2/3 cup flour, and cinnamon in a medium bowl. Cut in 1/2 cup butter or margarine; topping mixture will be crumbly. Set aside.\nFor the cake: Beat 1/2 cup butter or margarine in large bowl until creamy; add 1 cup white sugar, and beat until fluffy. Beat in egg and vanilla. Whisk together 2 cups flour, baking powder, and salt; add alternately with the milk to the creamed mixture, beating well after each addition.\nSpread half the batter in the prepared pan. Cover with berries, and add remaining batter by tablespoons. Cover with streusel topping.\nBake at 350 degrees F (175 degrees C) for 55 to 60 minutes, until deep golden brown. Remove pan to wire rack to cool. Invert onto a plate after cake has cooled, and dust with confectioners' sugar.\n",
        "picture_link": ".sycaiuSlPujj5Bmezb1W3Ld0PGeV/u"
    },
    {
        "title": "Fruited Curry Chicken Salad",
        "ingredients": [
            "4 skinless, boneless chicken breast halves - cooked and diced ADVERTISEMENT",
            "1 stalk celery, chopped ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "1 small apple - peeled, cored and chopped ADVERTISEMENT",
            "1/3 cup golden raisins ADVERTISEMENT",
            "1/3 cup seedless green grapes, halved ADVERTISEMENT",
            "1/2 cup chopped toasted pecans ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon curry powder ADVERTISEMENT",
            "3/4 cup mayonnaise ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large salad bowl combine the chicken, celery, onion, apple, raisins, grapes, pecans, pepper, curry powder and mayonnaise. Mix all together, tossing to coat. Salad is ready to serve!\n",
        "picture_link": ".tX.7wop76e0cObRjzG9RK44K6X8YxG"
    },
    {
        "title": "Carrot Cake",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "3/4 cup vegetable oil ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3/4 cup buttermilk ADVERTISEMENT",
            "2 cups grated carrots ADVERTISEMENT",
            "1 cup flaked coconut ADVERTISEMENT",
            "1 (15 ounce) can crushed pineapple, drained ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "4 cups confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking pan. Set aside.\nIn a large bowl, mix together sugar, oil, eggs, vanilla, and buttermilk. Stir in carrots, coconut, vanilla, and pineapple. In a separate bowl, combine flour, baking soda, cinnamon, and salt; gently stir into carrot mixture. Stir in chopped nuts. Spread batter into prepared pan.\nBake for 55 minutes or until toothpick inserted into cake comes out clean. Remove from oven, and set aside to cool.\nIn a medium mixing bowl, combine butter or margarine, cream cheese, vanilla, and confectioners sugar. Blend until creamy. Frost cake while still in the pan.\n",
        "picture_link": "MenqAdsoVVS0PGVU6j79EpWmI78jCLm"
    },
    {
        "title": "Chicken with Asparagus and Roasted Red Peppers",
        "ingredients": [
            "1/2 cup chicken broth ADVERTISEMENT",
            "1 pound boned and skinned chicken breast halves ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/2 pound fresh asparagus, trimmed and cut into 2 inch pieces ADVERTISEMENT",
            "1 (7 ounce) jar roasted red peppers, drained and chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 cup chopped roma (plum) tomatoes ADVERTISEMENT",
            "1 teaspoon balsamic vinegar, or to taste ADVERTISEMENT",
            "1/2 cup shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the broth in a large skillet over medium-high heat. Season chicken with salt and pepper, and place in the skillet. Cook 15 minutes, until chicken is almost done.\nPlace asparagus, red peppers and garlic in skillet. Continue cooking 10 minutes, or until chicken juices run clear and asparagus is tender. Place tomatoes in skillet during last 2 minutes of cook time. Sprinkle with vinegar. Top with mozzarella cheese to serve.\n",
        "picture_link": "0BH5TCI6Tgah.jFS8r3U/M8EsuPtwjy"
    },
    {
        "title": "Snickerdoodles III",
        "ingredients": [
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 3/4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon cream of tartar ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (205 degrees C).\nCombine 1 1/2 cups white sugar, butter or margarine, vanilla and eggs. Mix well.\nStir in flour, cream of tartar, baking soda and salt. Blend well. Shape dough into 1 inch balls. Combine 2 tablespoons sugar and 2 teaspoons ground cinnamon. Roll dough in sugar/cinnamon mixture and place 2 inches apart on ungreased baking sheets. Bake 8 to 10 minutes or until set. Immediately remove from cookie sheets.\n",
        "picture_link": "tbRqjEVucBld9.RylqpUioNNS9/96OC"
    },
    {
        "title": "Baked Corn",
        "ingredients": [
            "1 (15.25 ounce) can whole kernel corn ADVERTISEMENT",
            "1 (14.75 ounce) can cream-style corn ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1 cup butter or margarine, melted ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 (12 ounce) package corn muffin mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine the whole-kernel corn, cream-style corn, sour cream, melted butter or margarine, beaten eggs and corn muffin mix. Mix well and pour into one 9x13 inch baking pan.\nBake at 350 degrees F (175 degrees C) for 35 to 45 minutes.\n",
        "picture_link": "j7m9/DnLmH8RsqpKytdBm22gBXDhguu"
    },
    {
        "title": "Easy Apple Cinnamon Muffins",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/3 cup milk ADVERTISEMENT",
            "2 apples - peeled, cored and chopped ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/3 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup butter, cubed ADVERTISEMENT",
            "1 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease six muffin cups or line with paper muffin liners.\nStir together 1 1/2 cup flour, 3/4 cup sugar, salt, baking powder and 1 teaspoon cinnamon. Mix in oil, egg and milk. Fold in apples. Spoon batter into prepared muffin cups, filling to the top of the cup.\nIn a small bowl, stir together 1/2 cup sugar, 1/3 cup flour, butter and 1 1/2 teaspoons cinnamon. Mix together with fork and sprinkle over unbaked muffins.\nBake in preheated oven for 20 to 25 minutes, until a toothpick inserted into center of a muffin comes out clean.\n",
        "picture_link": "NOE0mLX8U8DpyVxWwdB4J1FMnwlDdoC"
    },
    {
        "title": "Fabulous Beef Tenderloin",
        "ingredients": [
            "1 (3 pound) beef tenderloin roast ADVERTISEMENT",
            "3/4 cup soy sauce ADVERTISEMENT",
            "1/2 cup melted butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace roast into a shallow, glass baking dish. Pour soy sauce and melted butter over the tenderloin.\nBake in preheated oven for 10 minutes, then turn the roast over, and continue cooking 35 to 40 minutes, basting occasionally until the internal temperature of the roast is at 140 degrees F (60 degrees C) for medium. Or, cook to your desired degree of doneness. Let meat rest for 10 to 15 minutes before slicing.\n",
        "picture_link": "6/E4YYd8cPZWp8QPSfW615txINFK2Q2"
    },
    {
        "title": "Mom's Stovetop Pork Ribs",
        "ingredients": [
            "10 pork spareribs ADVERTISEMENT",
            "1/2 cup soy sauce ADVERTISEMENT",
            "10 cloves garlic, crushed ADVERTISEMENT",
            "1 tablespoon dried rosemary ADVERTISEMENT",
            "1 tablespoon dried oregano ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "10 sprigs fresh parsley ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "2 limes, cut into wedges ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the spareribs into a large pot, and fill with just enough water to cover. Add the soy sauce, garlic, rosemary, oregano, bay leaves, lime juice and 3/4 of the parsley. Bring to a boil, then simmer uncovered over medium heat until the water has completely evaporated, about 25 minutes.\nWhen all of the water is gone, remove the bay leaves, and allow meat to brown, turning occasionally. Use a spatula to scrape up browned bits and softened garlic from the bottom of the pot, and toss them with the pork. The garlic will dissolve onto the meat. Remove the meat, and drain on paper towels. Season with black pepper and garnish with lime wedges and remaining parsley.\n",
        "picture_link": "WRTLRvz43l67zRlxD934WVUTZVGu3Qe"
    },
    {
        "title": "German Spaetzle Dumplings",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1 pinch freshly ground white pepper ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 gallon hot water ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together flour, salt, white pepper, and nutmeg. Beat eggs well, and add alternately with the milk to the dry ingredients. Mix until smooth.\nPress dough through spaetzle maker, or a large holed sieve or metal grater.\nDrop a few at a time into simmering liquid. Cook 5 to 8 minutes. Drain well.\nSaute cooked spaetzle in butter or margarine. Sprinkle chopped fresh parsley on top, and serve.\n",
        "picture_link": "E57Z7ml12cehjlehQ/6ki8Xz6hHGOLG"
    },
    {
        "title": "Slow Cooker Sweet and Tangy Chicken",
        "ingredients": [
            "2 (18 ounce) bottles barbeque sauce ADVERTISEMENT",
            "1 (15 ounce) can pineapple chunks ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "8 boneless, skinless chicken breast halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, mix together barbecue sauce, pineapple with juice, green bell pepper, onion, and garlic.\nArrange 4 of the chicken breasts in the bottom of a slow cooker. Pour half of the barbecue sauce over the chicken. Place remaining chicken in slow cooker, and pour remaining sauce over the top.\nCover, and cook on Low for 8 to 9 hours.\n",
        "picture_link": "oGDfChqsReJ5ZiyZ43EoXOgfWf83KrO"
    },
    {
        "title": "Mini Cheesecakes III",
        "ingredients": [
            "Crust: ADVERTISEMENT",
            "1/3 cup graham cracker crumbs ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 tablespoon margarine, melted ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "1 1/2 teaspoons lemon juice ADVERTISEMENT",
            "1/2 teaspoon grated lemon zest ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease a 6-cup muffin pan.\nIn a medium bowl, mix together the graham cracker crumbs, sugar, and margarine with a fork until combined. Measure a rounded tablespoon of the mixture into the bottom of each muffin cup, pressing firmly. Bake in the pre-heated oven for 5 minutes, then remove to cool. Keep the oven on.\nBeat together the cream cheese, sugar, lemon juice, lemon zest and vanilla until fluffy. Mix in the egg.\nPour the cream cheese mixture into the muffin cups, filling each until 3/4 full. Bake at 325 degrees F (165 degrees C) for 25 minutes. Cool completely in pan before removing. Refrigerate until ready to serve.\n",
        "picture_link": "uJH5Uh8xZPvuV3ZfFt0vcFR.h7Tghmy"
    },
    {
        "title": "Vanilla - Chocolate Powdered Sugar Frosting",
        "ingredients": [
            "2 cups sifted confectioners' sugar ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 tablespoons milk ADVERTISEMENT",
            "2 tablespoons cocoa powder (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cream sugar, butter and vanilla. Add a small amount of milk (1 to 2 tablespoons). Add cocoa if desired and beat until fluffy. If frosting is too sweet add a little more milk.\n",
        "picture_link": "6LGxTedXiUlO8tioAMSyJhz.swwRF5q"
    }
]