[
    {
        "title": "Apple Muffins",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "3 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3/4 cup apple juice ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 cup apples - peeled, cored and finely diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 400 degrees F (205 degrees C). Grease bottoms only of 12 muffin cups or line with baking cups.\nIn a medium bowl, combine flour, sugar, baking powder, cinnamon, and salt; mix well. In a small bowl, combine apple juice, oil, and egg; blend well. Add dry ingredients all at once; stir just until dry ingredients are moistened (batter will be lumpy.) Stir in chopped apples.\nFill cups 2/3 full. Bake for 18 to 22 minutes or until toothpick inserted in center comes out clean. Cool 1 minute before removing from pan. Serve warm.\n",
        "picture_link": "Q8wL96fL8WLQhJzBEyi9hWLz3rWxKEu"
    },
    {
        "title": "Wisconsin Native's Beer Cheese Soup",
        "ingredients": [
            "1 1/2 cups diced carrots ADVERTISEMENT",
            "1 1/2 cups diced onion ADVERTISEMENT",
            "1 1/2 cups diced celery ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon hot pepper sauce ADVERTISEMENT",
            "1/8 teaspoon cayenne pepper ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon black pepper ADVERTISEMENT",
            "3 cups chicken broth ADVERTISEMENT",
            "2 cups beer ADVERTISEMENT",
            "1/3 cup butter ADVERTISEMENT",
            "1/3 cup flour ADVERTISEMENT",
            "4 cups milk or half and half ADVERTISEMENT",
            "6 cups shredded sharp Cheddar cheese ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "2 teaspoons Worcestershire sauce ADVERTISEMENT",
            "1 teaspoon dry mustard ADVERTISEMENT",
            "popped popcorn, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan over medium heat, stir together carrots, onion, celery, and garlic. Stir in hot pepper sauce, cayenne pepper, salt, and pepper. Pour in chicken broth and beer; simmer until vegetables are tender, about 12 minutes. Remove from heat.\nMeanwhile, heat butter in a large soup pot over medium-high heat. Stir in flour with a wire whisk; cook, stirring until the flour is light brown, about 3 or 4 minutes. Gradually stir in milk, whisking to prevent scorching, until thickened. Remove from heat, and gradually stir in cheese. Keep warm.\nStir beer mixture into cheese mixture. Stir in Dijon mustard, Worcestershire sauce, and dry mustard. Adjust for hot pepper sauce. Bring to a simmer, and cook 10 minutes. Serve topped with popcorn.\n",
        "picture_link": "vj9EmaPncMJ61Ue7a1btrv9ld88NX5e"
    },
    {
        "title": "Beef Stew IV",
        "ingredients": [
            "1 pound cubed beef stew meat ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "3 tablespoons shortening ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "1 onion, finely diced ADVERTISEMENT",
            "1/4 teaspoon paprika ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "3 carrots, quartered ADVERTISEMENT",
            "3 potatoes, peeled and quartered ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup frozen corn kernels ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dredge beef in flour and then, in a medium stock pot, brown beef on all sides in shortening. Add salt, pepper, water, onion, paprika, garlic, Worcestershire sauce and bay leave. Bring to a boil, cover and simmer for 2 hours or until meat is tender.\nAdd carrots and potatoes and simmer for 45 minutes or until tender.\nRemove bay leave and meat from stew, add 1 tablespoon flour or cornstarch and mix, in order to thicken stew. After mixing let sit for a few minutes to thicken, if not to desired thickness add more flour or cornstarch and repeat.\nOnce thickened return meat and add corn to stew, heat through and serve.\n",
        "picture_link": "xV7H6VVoYfJO5UUzriI0JSa7NG2.0TC"
    },
    {
        "title": "Beef and Noodle Bake",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "2 cups elbow macaroni ADVERTISEMENT",
            "4 cups spaghetti sauce ADVERTISEMENT",
            "12 ounces processed cheese food (eg. Velveeta), sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nBrown the ground beef in a large skillet over medium high heat; set aside. Cook macaroni according to package directions, drain and set aside.\nIn a 9x13 inch baking dish, layer the macaroni, ground beef, tomato sauce and cheese, repeating two times.\nBake at 375 degrees F (190 degrees C) for 30 minutes, or until top layer of cheese is bubbly.\n",
        "picture_link": "KsDQyhF3si.Kq.5qF1r19FYtcUxl5EW"
    },
    {
        "title": "Ham and Beans",
        "ingredients": [
            "1 pound dry great Northern beans ADVERTISEMENT",
            "1/2 pound cooked ham, diced ADVERTISEMENT",
            "1 small onion, diced ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1 tablespoon dried parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse beans in a large pot; discard shriveled beans and any small stones. Add 8 cups of cold water. Let stand overnight or at least 8 hours. Drain and rinse beans.\nReturn beans to pot and add ham, onion, brown sugar, salt, pepper, cayenne and parsley and water to cover. Bring to a boil; reduce heat and simmer 1 1/2 to 2 hours, until beans are tender. Add more water if necessary during cooking time.\n",
        "picture_link": "UVxW3x98MGaIc6RtRVClakxk8FFyUXu"
    },
    {
        "title": "Rosemary Turkey Meatloaf",
        "ingredients": [
            "1 1/2 pounds ground turkey ADVERTISEMENT",
            "2 cups dry bread crumbs ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/2 cup balsamic vinegar ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon pepper ADVERTISEMENT",
            "1 1/2 tablespoons chopped fresh rosemary ADVERTISEMENT",
            "1 cup canned tomato sauce ADVERTISEMENT",
            "3/4 cup brown sugar ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x5 inch loaf pan.\nIn a large mixing bowl, mix together the ground turkey, bread crumbs, onion, egg and milk. Season with balsamic vinegar, salt, pepper and rosemary. Press into the prepared pan. Blend together the tomato sauce, brown sugar and mustard; pour evenly over the top of the loaf.\nBake for 1 hour in the preheated oven, or until juices run clear when pricked with a knife.\n",
        "picture_link": "/Mm.mxWQlNWTI7KioLwAR90qoxYuk4m"
    },
    {
        "title": "Dinah's Stuffed Mushrooms",
        "ingredients": [
            "20 fresh mushrooms, stems removed ADVERTISEMENT",
            "2 (6.5 ounce) cans minced clams, drained ADVERTISEMENT",
            "2 cloves garlic, peeled and minced ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1 small onion, finely chopped ADVERTISEMENT",
            "3/4 cup dry bread crumbs ADVERTISEMENT",
            "1/2 cup chopped green bell pepper ADVERTISEMENT",
            "2 tablespoons dried parsley ADVERTISEMENT",
            "2 tablespoons Italian-style seasoning ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 1/2 cups butter, melted ADVERTISEMENT",
            "1/2 cup shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking dish.\nArrange mushroom caps hollow side up in the baking dish.\nIn a medium bowl, mix together minced clams, garlic, Parmesan cheese, onion, bread crumbs, green bell pepper, parsley, Italian-style seasoning and black pepper. Slowly stir in approximately 1/2 the butter, enough to make the mixture slightly moist.\nGenerously fill the mushroom caps with the clam mixture. Sprinkle with mozzarella cheese. Drizzle with remaining butter.\nBake in the preheated oven 30 minutes, or until lightly browned.\n",
        "picture_link": "fhED9Fl4jlE98U7HlZqrDzkvAkYSm3."
    },
    {
        "title": "Bow Tie Pasta with Sausage and Sweet Peppers",
        "ingredients": [
            "1 pound Italian sausage, cut into 1/2 inch pieces ADVERTISEMENT",
            "2 green bell peppers, chopped ADVERTISEMENT",
            "8 ounces farfalle pasta ADVERTISEMENT",
            "1/2 cup beef broth ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nWhile pasta is cooking, cook sausage and peppers in large skillet over medium heat until sausage is brown and juices run clear. Drain sausage mixture and return it to the pan. Pour in the broth, season with black pepper and bring to a boil.\nToss pasta with sausage sauce and serve.\n",
        "picture_link": "8gyL1AL17Spfh0otIrFR.fRSZH0VW1m"
    },
    {
        "title": "Baked Macaroni and Cheese III",
        "ingredients": [
            "1 (16 ounce) package elbow macaroni ADVERTISEMENT",
            "1/2 cup evaporated milk ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 (8 ounce) container sour cream ADVERTISEMENT",
            "1 teaspoon seasoning salt ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "1 1/2 cups shredded Cheddar cheese ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain and rinse with cold water.\nIn a bowl mix milk, eggs, sour cream, seasoning salt, and pepper. Layer macaroni, cheddar cheese, and milk mixture until pan is full. Sprinkle Parmesan cheese and pour melted butter on top.\nBake in a preheated oven for 20 to 30 minutes or until milk mixture is done.\n",
        "picture_link": "Bwj1hRxi66eXWu9yi64TfMjuydogNK6"
    },
    {
        "title": "Stuffed Chicken Valentino",
        "ingredients": [
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 teaspoon dried Italian seasoning ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "1 (6 ounce) jar roasted red bell peppers, drained ADVERTISEMENT",
            "1/4 cup chopped fresh chives ADVERTISEMENT",
            "4 tablespoons shredded mozzarella cheese ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Slice a chicken breast in half lengthwise, leaving the halves attached on one side: opened and laid flat, the chicken breast should resemble a butterfly. Place between two sheets of plastic wrap, and pound flat. Repeat with remaining chicken breasts.\nCombine Parmesan cheese with Italian seasoning and chives, and sprinkle over chicken breasts. At one end of each breast, place 3 strips of roasted pepper. Top with 1 tablespoon shredded cheese. Roll each breast up, starting on the side with the peppers and cheese. Insert a toothpick in each roll to prevent unrolling. Place in prepared baking dish. Season rolls with salt and pepper to taste, and drizzle with olive oil.\nBake in preheated oven for 15 minutes. Set oven to broil, and continue cooking for 5 to 10 minutes. Remove from oven, slice to display the colorful filling, and serve.\n",
        "picture_link": "Md/7TyrCGcLqSyWdr.5NydaSDiDrQlC"
    },
    {
        "title": "Amish Friendship Bread Starter",
        "ingredients": [
            "1 (.25 ounce) package active dry yeast ADVERTISEMENT",
            "1/4 cup warm water (110 degrees F/45 degrees C) ADVERTISEMENT",
            "3 cups all-purpose flour, divided ADVERTISEMENT",
            "3 cups white sugar, divided ADVERTISEMENT",
            "3 cups milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, dissolve yeast in water. Let stand 10 minutes. In a 2 quart container glass, plastic or ceramic container, combine 1 cup flour and 1 cup sugar. Mix thoroughly or flour will lump when milk is added. Slowly stir in 1 cup milk and dissolved yeast mixture. Cover loosely and let stand until bubbly. Consider this day 1 of the 10 day cycle. Leave loosely covered at room temperature.\nOn days 2 through 4; stir starter with a spoon. Day 5; stir in 1 cup flour, 1 cup sugar and 1 cup milk. Days 6 through 9; stir only.\nDay 10; stir in 1 cup flour, 1 cup sugar and 1 cup milk. Remove 1 cup to make your first bread, give 2 cups to friends along with this recipe, and your favorite Amish Bread recipe. Store the remaining 1 cup starter in a container in the refrigerator, or begin the 10 day process over again (beginning with step 2).\n",
        "picture_link": "F.Nwaq03TiC8L6vVPto5njIO3cevF3e"
    },
    {
        "title": "Quiche",
        "ingredients": [
            "1 1/2 cups shredded Swiss cheese ADVERTISEMENT",
            "4 teaspoons all-purpose flour ADVERTISEMENT",
            "1/2 cup cooked ham, diced ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground dry mustard ADVERTISEMENT",
            "1 (9 inch) unbaked pie crust ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley, for garnish ADVERTISEMENT",
            "2 tablespoons chopped pimento peppers, garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In medium bowl, toss 4 teaspoons flour with the grated cheese. Sprinkle mixture into the pie shell. On top of cheese, sprinkle 1/2 cup of diced ham.\nIn medium bowl, combine eggs, milk or cream, and then add salt and mustard powder. Beat until smooth and pour over cheese and ham.\nPut piece of plastic wrap large enough to overlap sides over top of quiche, then a piece of foil, and seal well around the edges. (plastic keeps the foil from sticking to the food). Place prepared quiche in freezer.\nWhen ready to prepare, preheat oven to 400 degrees F (200 degrees C.) Remove foil and plastic wrap. Put foil around edge of crust to protect it.\nBake in the preheated oven for 60 minutes, or until filling is set and crust is golden brown. Garnish with parsley and pimiento if desired\n",
        "picture_link": "s1hOCAYUL4xRBNGG6BKEdnvZEsI4B86"
    },
    {
        "title": "Ranch Crispy Chicken",
        "ingredients": [
            "8 skinless, boneless chicken breast halves ADVERTISEMENT",
            "2 (1 ounce) packages ranch dressing mix ADVERTISEMENT",
            "1/4 cup dry bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nCombine dressing mix and bread crumbs in a plastic bag. Add chicken and shake until coated.\nPlace coated chicken pieces on an ungreased cookie sheet and bake in preheated oven for 25 to 30 minutes, or until chicken is cooked through and juices run clear. Serve with rice or potatoes, if desired.\n",
        "picture_link": "oGZxiXsn0N3JmSDObvnd9.pAWwUO2eq"
    },
    {
        "title": "Lemon Cake",
        "ingredients": [
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1 (3.4 ounce) package instant lemon pudding mix ADVERTISEMENT",
            "1 3/4 cups water ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "3/4 cup nonfat milk ADVERTISEMENT",
            "1/2 teaspoon lemon extract ADVERTISEMENT",
            "1 (1 ounce) package instant sugar-free vanilla pudding mix ADVERTISEMENT",
            "1 (8 ounce) container frozen light whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Spray a 10x15 inch pan with non-stick cooking spray.\nIn a large bowl, mix together cake mix and pudding mix. Pour in water and egg whites. Beat on low speed for 1 minute. Increase speed to high and beat for 4 minutes. Pour batter into prepared 10x15 inch pan.\nBake in the preheated oven for 25 to 30 minutes, or until a toothpick inserted into the center of the cake comes out clean. Allow to cool completely.\nIn a large bowl, combine milk, lemon extract and vanilla pudding mix. Beat on low for 2 minutes. Fold in whipped topping. Spread over cooled cake. Store cake in refrigerator.\n",
        "picture_link": "gyAETQHAOjiiooQ4eCDOtb9AmwE3VwC"
    },
    {
        "title": "Honey-Ginger Grilled Salmon",
        "ingredients": [
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1/3 cup soy sauce ADVERTISEMENT",
            "1/3 cup orange juice ADVERTISEMENT",
            "1/4 cup honey ADVERTISEMENT",
            "1 green onion, chopped ADVERTISEMENT",
            "1 (1 1/2-pound) salmon fillet ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large self-closing plastic bag, combine ginger, garlic, soy sauce, orange juice, honey, and green onion; mix well. Place salmon in bag and seal tightly. Turn bag gently to distribute marinade. Refrigerate for 15 to 30 minutes.\nPreheat an outdoor grill for medium heat and lightly oil grate.\nRemove salmon from marinade, shake off excess, and discard remaining marinade. Grill for 12 to 15 minutes per inch of thickness, or until the fish flakes easily with a fork.\n",
        "picture_link": "jog6m6khh059xbtOS9uLy3ZDgKQtkRS"
    },
    {
        "title": "Slow Cooker Tender and Yummy Round Steak",
        "ingredients": [
            "3 potatoes, peeled and quartered ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "6 carrots, peeled and sliced into 1 inch pieces ADVERTISEMENT",
            "2 pounds boneless round steak ADVERTISEMENT",
            "1 (1 ounce) package dry onion soup mix ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the potatoes, onion, and carrots in slow cooker. Cut steak into six pieces, then place the meat on top of vegetables. In a mixing bowl, combine the soup mix, soup, and water; pour over beef.\nCover, and cook on Low for 7 to 10 hours.\n",
        "picture_link": "sCSvKC6ROiOa9S.tYCxSXDJTGFoOe6C"
    },
    {
        "title": "Rosemary Braised Lamb Shanks",
        "ingredients": [
            "6 lamb shanks ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 onions, chopped ADVERTISEMENT",
            "3 large carrots, cut into 1/4 inch rounds ADVERTISEMENT",
            "10 cloves garlic, minced ADVERTISEMENT",
            "1 (750 milliliter) bottle red wine ADVERTISEMENT",
            "1 (28 ounce) can whole peeled tomatoes with juice ADVERTISEMENT",
            "1 (10.5 ounce) can condensed chicken broth ADVERTISEMENT",
            "1 (10.5 ounce) can beef broth ADVERTISEMENT",
            "5 teaspoons chopped fresh rosemary ADVERTISEMENT",
            "2 teaspoons chopped fresh thyme ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sprinkle shanks with salt and pepper. Heat oil in heavy large pot or Dutch oven over medium-high heat. Working in batches, cook shanks until brown on all sides, about 8 minutes. Transfer shanks to plate.\nAdd onions, carrots and garlic to pot and saute until golden brown, about 10 minutes. Stir in wine, tomatoes, chicken broth and beef broth. Season with rosemary and thyme. Return shanks to pot, pressing down to submerge. Bring to a boil, then reduce heat to medium-low. Cover, and simmer until meat is tender, about 2 hours.\nRemove cover from pot. Simmer about 20 minutes longer. Transfer shanks to platter, place in a warm oven. Boil juices in pot until thickened, about 15 minutes. Spoon over shanks.\n",
        "picture_link": "OflYG2IAn4Ynu/f7yIp.Q/1ijkA4Ft."
    },
    {
        "title": "Cajun Pasta Fresca",
        "ingredients": [
            "1 pound vermicelli pasta ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "13 roma (plum) tomatoes, chopped ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "1 tablespoon Cajun seasoning ADVERTISEMENT",
            "1/2 cup shredded mozzarella cheese ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nWhile the pasta water is boiling, in a large skillet over medium heat, briefly saute garlic in oil. Stir in tomatoes and their juice and sprinkle with salt. When tomatoes are bubbly, mash slightly with a fork. Stir in parsley, reduce heat and simmer 5 minutes more.\nToss hot pasta with tomato sauce, Cajun seasoning, mozzarella and Parmesan.\n",
        "picture_link": "3.TREqkhXKvrxcpLlqkUvR3lZCgYMna"
    },
    {
        "title": "Garlic Alfredo Tilapia",
        "ingredients": [
            "4 tilapia fillets ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 tablespoon Creole seasoning, or to taste ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 cup Alfredo sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 425 degrees F (220 degrees C).\nBrush the tilapia fillets with oil on both sides, season with Creole seasoning to taste, then place into a 9x13-inch baking dish.\nBake in the preheated oven until the flesh is no longer translucent, and the fish flakes easily with a fork, about 10 minutes.\nMeanwhile, melt the butter in a small saucepan over medium heat. Stir in the garlic, and cook until the garlic has softened and the aroma has mellowed, about 2 minutes. Stir in the Alfredo sauce and bring to a simmer. Reduce the heat to low, and keep warm until the fish is ready. Pour the sauce over the fish to serve. Sprinkle with additional Creole seasoning if desired.\n",
        "picture_link": "yrV3Geoe9lqansLndR1KXS96J9HOIlq"
    },
    {
        "title": "Pumpkin Brownies",
        "ingredients": [
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3/4 cup butter, melted ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/4 cup cocoa powder ADVERTISEMENT",
            "1/2 cup semi-sweet chocolate chips ADVERTISEMENT",
            "1/2 cup pumpkin puree ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "3/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease an 8x8 inch baking pan. Stir the flour, baking powder, and salt together in a bowl.\nIn another bowl, stir together the melted butter, sugar, and vanilla extract; beat in the eggs one at a time with a spoon. Gradually add the flour mixture, and stir the batter until it's evenly moistened. Divide the batter in half in two separate bowls.\nInto one bowl of batter, blend the cocoa powder and chocolate chips. In the second bowl of batter, stir in the pumpkin puree, walnuts, cinnamon, cloves, and nutmeg.\nSpread 1/2 of the chocolate batter into the bottom of the prepared baking pan, and follow with 1/2 of the pumpkin batter. Repeat the layers, ending with a pumpkin layer, and drag a kitchen knife or small spatula gently through the layers in a swirling motion, to create a marbled appearance.\nBake in the preheated oven until the brownies begin to pull away from the sides of the pan, and a toothpick inserted into the center comes out clean, 40 to 45 minutes. Cool in the pan, cut into squares, and serve.\n",
        "picture_link": "5jA.ZWyexzbXhPbmeaqM1SCB.kmWELG"
    },
    {
        "title": "Jerre's Black Bean and Pork Tenderloin Slow Cooker Chili",
        "ingredients": [
            "1 1/2 pounds pork tenderloin, cut into 2 inch strips ADVERTISEMENT",
            "1 small onion, coarsely chopped ADVERTISEMENT",
            "1 small red bell pepper, coarsely chopped ADVERTISEMENT",
            "3 (15 ounce) cans black beans ADVERTISEMENT",
            "1 (16 ounce) jar salsa ADVERTISEMENT",
            "1/2 cup chicken broth ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "2 teaspoons chili powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine pork tenderloin, onion, red pepper, black beans, salsa, chicken broth, oregano, cumin, and chili powder in a slow cooker. Set to Low and cook for 8 to 10 hours.\nBreak up pieces of cooked pork to thicken the chili before serving.\n",
        "picture_link": "AmQgVxHnczfYB2EtbW7phv9uxbm4DsK"
    },
    {
        "title": "Banana Pudding Cake",
        "ingredients": [
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "1 (3.5 ounce) package instant banana pudding mix ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "3/4 cup mashed bananas ADVERTISEMENT",
            "2 cups confectioners' sugar ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "1 dash vanilla extract ADVERTISEMENT",
            "1/2 cup chopped walnuts (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 10 inch Bundt pan.\nIn a large bowl, stir together cake mix and pudding mix. Make a well in the center and pour in eggs, water, oil and mashed banana. Beat on low speed until blended. Scrape bowl, and beat 4 minutes on medium speed. Pour batter into prepared pan.\nBake in a preheated oven for 50 to 55 minutes, or until cake tests done. Let cool in pan for 10 minutes, then turn out onto a wire rack and cool completely.\nTo make glaze: In a small bowl, combine confectioners' sugar, milk and vanilla. Whisk until smooth and of a drizzling consistency. When cake is cooled, drizzle icing over cake with a zigzag motion. Sprinkle chopped nuts over wet icing if desired.\n",
        "picture_link": "Q0WgIM2X1jReyI0VOaq/EwuFVJZAXnq"
    },
    {
        "title": "Cinnamon Swirl Bread",
        "ingredients": [
            "1/3 cup white sugar ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x5 inch loaf pan. In a small bowl, mix together 1/3 cup sugar and 2 teaspoons cinnamon; set aside.\nIn large bowl combine flour, baking powder, salt and remaining 1 cup sugar. Combine egg, milk, and oil; add to flour mixture. Stir until just moistened.\nPour half of the batter into pan. Sprinkle with half the reserved cinnamon/sugar mixture. Repeat with remaining batter and cinnamon/sugar mixture. Draw a knife through batter to marble.\nBake in preheated oven for 45 to 50 minutes, or until a toothpick inserted into center of the loaf comes out clean. Let cool in pan for 10 minutes before removing to a wire rack to cool completely. Wrap in foil and let sit overnight before slicing.\n",
        "picture_link": "EwgH1oejnrgbjQX/prI.NzzgzRSAXEu"
    },
    {
        "title": "Groovy Green Smoothie",
        "ingredients": [
            "1 banana, cut in chunks ADVERTISEMENT",
            "1 cup grapes ADVERTISEMENT",
            "1 (6 ounce) tub vanilla yogurt ADVERTISEMENT",
            "1/2 apple, cored and chopped ADVERTISEMENT",
            "1 1/2 cups fresh spinach leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the banana, grapes, yogurt, apple and spinach into a blender. Cover, and blend until smooth, stopping frequently to push down anything stuck to the sides. Pour into glasses and serve.\n",
        "picture_link": "j8gU50KdzdbiQET8PJUvIxbEJNgxw/S"
    },
    {
        "title": "Apple Bundt Cake",
        "ingredients": [
            "2 cups apples - peeled, cored and diced ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "3 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "1/4 cup orange juice ADVERTISEMENT",
            "2 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "1/4 cup confectioners' sugar for dusting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 10 inch Bundt or tube pan. In a medium bowl, combine the diced apples, 1 tablespoon white sugar and 1 teaspoon cinnamon; set aside. Sift together the flour, baking powder and salt; set aside.\nIn a large bowl, combine 2 cups white sugar, oil, orange juice, vanilla and eggs. Beat at high speed until smooth. Stir in flour mixture. Fold in chopped walnuts.\nPour 1/3 of the batter into prepared pan. Sprinkle with 1/2 of the apple mixture. Alternate layers of batter and filling, ending with batter.\nBake in preheated oven for 55 to 60 minutes, or until the top springs back when lightly touched. Let cool in pan for 10 minutes, then turn out onto a wire rack and cool completely. Sprinkle with confectioners' sugar.\n",
        "picture_link": "mSmG5YWtGzM36vQ0bKdRq6C2RaOEs/u"
    },
    {
        "title": "Lemon Rosemary Salmon",
        "ingredients": [
            "1 lemon, thinly sliced ADVERTISEMENT",
            "4 sprigs fresh rosemary ADVERTISEMENT",
            "2 salmon fillets, bones and skin removed ADVERTISEMENT",
            "coarse salt to taste ADVERTISEMENT",
            "1 tablespoon olive oil, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nArrange half the lemon slices in a single layer in a baking dish. Layer with 2 sprigs rosemary, and top with salmon fillets. Sprinkle salmon with salt, layer with remaining rosemary sprigs, and top with remaining lemon slices. Drizzle with olive oil.\nBake 20 minutes in the preheated oven, or until fish is easily flaked with a fork.\n",
        "picture_link": "U9ulVWwRICgVbQXwbRbt4MBoo4s9mpa"
    },
    {
        "title": "Dash's Donair",
        "ingredients": [
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground oregano ADVERTISEMENT",
            "1 teaspoon all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon Italian seasoning ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1 (12 fluid ounce) can evaporated milk ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 teaspoons garlic powder ADVERTISEMENT",
            "4 teaspoons white vinegar, or as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). In a cup or small bowl, mix together the salt, oregano, flour, black pepper, Italian seasoning, garlic powder, onion powder, and cayenne pepper.\nPlace the ground beef in a large bowl, and use your hands to blend in the spice mixture. If you want the smooth texture of meat that you see in a real donair shop, you must do this in a steel mixing bowl and on a sturdy surface. Pick up the meat, and throw it down with force about 20 times, kneading it after each throw. This also helps the meat hold together better when you slice it.\nForm the meat into a loaf, and place it on a broiler pan. If you do not have one, a baking sheet will do.\nBake for 1 hour and 15 minutes in the preheated oven, turning the loaf over about half way through. This will ensure even cooking. Serve, or allow the meat to chill before slicing and reheating.\nTo make the donair sauce, mix together the evaporated milk, sugar and garlic powder in a medium bowl. Gradually whisk in the white vinegar, adding 1 teaspoon at a time, until thickened to your desired consistency.\n",
        "picture_link": "LOn8l2nU0CGIJaMEfr5zYBfz0Fw5UTO"
    },
    {
        "title": "Pork Chop and Potato Casserole",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "6 boneless pork chops ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "4 potatoes, thinly sliced ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nHeat oil in a large skillet over medium high-heat. Place the pork chops in the oil, and sear.\nIn a medium bowl, combine the soup and the milk. Arrange the potatoes and onions in a 9x13 inch baking dish. Place the browned chops over the potatoes and onions, then pour the soup mixture over all.\nBake 30 minutes in the preheated oven. Top with the cheese, and bake for 30 more minutes.\n",
        "picture_link": "S5Y5BEZGAojI.bWOpYJlMm8be9CIfe2"
    },
    {
        "title": "Ashley's Chocolate Chip Cookies",
        "ingredients": [
            "1 2/3 cups all-purpose flour ADVERTISEMENT",
            "3/4 teaspoon baking powder ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3/4 cup butter, softened ADVERTISEMENT",
            "3/4 cup packed brown sugar ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 cups milk chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C).\nSift together the flour, baking powder, baking soda, and salt; set aside.\nIn a medium bowl, cream together the butter, brown sugar, and white sugar until smooth. Beat in the egg and vanilla. Gradually stir in the sifted ingredients, then stir in the chocolate chips. Drop by rounded tablespoonfuls onto ungreased cookie sheets.\nBake for 8 to 10 minutes in preheated oven. Allow cookies to cool on baking sheet for 5 minutes before transferring to a wire rack to cool completely.\n",
        "picture_link": "FiS9mJPi21LSJ1MMBqSN7s4MjSuxlJm"
    },
    {
        "title": "Vegetarian Gravy",
        "ingredients": [
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1/3 cup chopped onion ADVERTISEMENT",
            "5 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "4 teaspoons nutritional yeast ADVERTISEMENT",
            "4 tablespoons light soy sauce ADVERTISEMENT",
            "2 cups vegetable broth ADVERTISEMENT",
            "1/2 teaspoon dried sage ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a medium saucepan over medium heat. Saute onion and garlic until soft and translucent, about 5 minutes. Stir in flour, nutritional yeast, and soy sauce to form a smooth paste. Gradually whisk in the broth. Season with sage, salt, and pepper. Bring to a boil. Reduce heat, and simmer, stirring constantly, for 8 to 10 minutes, or until thickened.\n",
        "picture_link": "WPr7pRLB.pSY.pCQnYreG6PZHqhEXeO"
    },
    {
        "title": "Becki's Oven Barbecue Chicken",
        "ingredients": [
            "10 chicken wings ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1 tablespoon onion powder ADVERTISEMENT",
            "5 tablespoons brown sugar ADVERTISEMENT",
            "2 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1 cup ketchup ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "2 tablespoons prepared mustard ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nIn a small saucepan, melt butter or margarine. Add onion powder, sugar, Worcestershire sauce and mustard; mix well. Dilute ketchup with water and add to saucepan mixture. Let simmer for 15 minutes.\nPlace chicken wings in a 9x13 inch baking dish. Pour saucepan mixture over chicken. Bake, uncovered, in the preheated oven for about 45 minutes.\n",
        "picture_link": "QhuAzmREj4YPgHepXoeiOQBTF2lAQr6"
    },
    {
        "title": "Bolognese Stuffed Bell Peppers",
        "ingredients": [
            "1/2 cup cooked rice ADVERTISEMENT",
            "2 tablespoons olive oil, divided ADVERTISEMENT",
            "1/8 cup minced carrots ADVERTISEMENT",
            "1/8 cup celery ADVERTISEMENT",
            "6 bell peppers (any color) stems and seeds removed, cut in half lengthwise ADVERTISEMENT",
            "1/2 pound ground beef ADVERTISEMENT",
            "1/4 pound pancetta or lightly smoked bacon, diced ADVERTISEMENT",
            "1 1/2 cups prepared marinara sauce ADVERTISEMENT",
            "1/4 cup red wine ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes ADVERTISEMENT",
            "1/3 cup heavy cream ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nHeat 1 tablespoon olive oil in a skillet over medium heat. Stir in the carrots and celery; cook and stir until the vegetables are tender, about 5 minutes.\nStir in ground beef and pancetta, and cook until browned and crumbled; drain off any excess liquid, and return to heat. Add marinara sauce, wine, and red pepper flakes, and simmer for 10 minutes. Stir in cream, half of the Parmesan cheese, and rice. Simmer 5 minutes more, or until most liquid has absorbed.\nPlace peppers in a shallow baking dish, and fill with beef mixture. Drizzle with remaining olive oil and top with remaining Parmesan cheese.\nBake, uncovered, for 30 minutes in the preheated oven. Serve hot.\n",
        "picture_link": "bwZlJXZKOaIj.9v4aAZs5ODFD3qjGjS"
    },
    {
        "title": "Pesto Cream Sauce",
        "ingredients": [
            "1 (16 ounce) package linguine pasta ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "8 cloves garlic, sliced ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 pinch pepper ADVERTISEMENT",
            "1 1/2 cups grated Romano cheese ADVERTISEMENT",
            "1 cup prepared basil pesto ADVERTISEMENT",
            "1 pound cooked shrimp, peeled and deveined ADVERTISEMENT",
            "20 mushrooms, chopped ADVERTISEMENT",
            "3 roma (plum) tomato, diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nHeat olive oil in a large skillet over medium heat. Saute onion until tender and translucent. Stir in garlic and butter, and saute until garlic is soft and fragrant, about 1 minute. Dissolve flour in milk, then stir in. Season with salt and pepper, and simmer 4 minutes, stirring constantly. Add cheese, and stir until melted. Stir in pesto. Add shrimp, mushrooms and tomatoes. Cook 4 minutes, or until heated through. Toss with pasta until evenly coated.\n",
        "picture_link": "EiKd3QgOIy32MreDpvxlJZop1I6RYrq"
    },
    {
        "title": "Chicken Chimi in the Oven",
        "ingredients": [
            "4 tablespoons olive oil, divided ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 cups salsa ADVERTISEMENT",
            "3 tablespoons water ADVERTISEMENT",
            "1/4 cup chili powder ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1 pound cooked, shredded chicken breast meat ADVERTISEMENT",
            "1 cup refried beans ADVERTISEMENT",
            "6 (10 inch) flour tortillas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Lightly grease a medium baking dish.\nHeat 2 tablespoons oil in a large saucepan over medium heat. Saute onion and garlic in oil until tender. Stir in salsa and water. Season with chili powder, cumin, and cinnamon. Transfer the mixture to a blender or food processor, and blend until smooth. Return mixture to the saucepan, stir in the chicken, and cook until heated through.\nSpoon an equal amount of refried beans down center of each tortilla, and top with equal amounts of the chicken mixture. Fold tortillas over the filling, and secure with toothpicks. Arrange seam-side down in the prepared baking dish, and brush with the remaining olive oil.\nBake 15 minutes in the preheated oven, turning every 5 minutes, until golden brown and crisp.\n",
        "picture_link": "AQE6eqfEUSKmH1CT3j/hVDdCC0K6RPW"
    },
    {
        "title": "Paprika Chicken with Mushrooms",
        "ingredients": [
            "4 skinless, boneless chicken breasts ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 pinch garlic powder ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 onion, sliced into thin rings ADVERTISEMENT",
            "1 pound fresh mushrooms, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pound chicken breasts to 1/2 inch thickness. Sprinkle both sides of each chicken breast liberally with paprika, salt, pepper, and garlic powder.\nIn a large skillet, melt the butter over medium heat. Arrange chicken breasts in the pan, cover, and cook for 10 minutes. Turn chicken breasts over, and layer the thinly sliced onions and mushrooms on top of the chicken. Cover, and cook for 10 minutes.\nRemove lid, and mix onions and mushrooms into the butter sauce. Reduce heat to low, and cook uncovered for 5 minutes.\n",
        "picture_link": "irs9vJ/fdglk04EZsULU2ILzhf9ZVei"
    },
    {
        "title": "Hawaiian Banana Nut Bread",
        "ingredients": [
            "3 cups all-purpose flour ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "2 cups mashed very ripe banana ADVERTISEMENT",
            "1 (8 ounce) can crushed pineapple, drained ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 cup flaked coconut ADVERTISEMENT",
            "1 cup maraschino cherries, diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease two 9x5 inch loaf pans.\nIn a large mixing bowl, combine the flour, salt, baking soda, sugar and cinnamon. Add the walnuts, eggs, oil, banana, pineapple, vanilla, coconut and cherries; stir just until blended. Pour batter evenly into the prepared pans.\nBake at 350 degrees F (175 degrees C) for 60 minutes, or until a tooth pick inserted into the center of a loaf comes out clean. Cool in the pan for 10 minutes, then remove to a wire rack to cool completely.\n",
        "picture_link": "5mWExXduDr27TMWpO4TXkYx1NorfmCS"
    },
    {
        "title": "Quick and Easy Pancit",
        "ingredients": [
            "1 (12 ounce) package dried rice noodles ADVERTISEMENT",
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "1 onion, finely diced ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "2 cups diced cooked chicken breast meat ADVERTISEMENT",
            "1 small head cabbage, thinly sliced ADVERTISEMENT",
            "4 carrot, thinly sliced ADVERTISEMENT",
            "1/4 cup soy sauce ADVERTISEMENT",
            "2 lemons - cut into wedges, for garnish ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the rice noodles in a large bowl, and cover with warm water. When soft, drain, and set aside.\nHeat oil in a wok or large skillet over medium heat. Saute onion and garlic until soft. Stir in chicken cabbage, carrots and soy sauce. Cook until cabbage begins to soften. Toss in noodles, and cook until heated through, stirring constantly. Transfer pancit to a serving dish and garnish with quartered lemons.\n",
        "picture_link": "ucvKmwP2GATIt/emzvE.j3jgeVMHI3a"
    },
    {
        "title": "Birthday Bones",
        "ingredients": [
            "2 cups whole wheat flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1 cup unsalted natural peanut butter ADVERTISEMENT",
            "1 cup skim milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Grease cookie sheets. Stir together the flour and baking powder; set aside.\nIn a medium bowl, mix together the peanut butter and milk. Stir in the flour mixture until well blended. Turn out dough onto a lightly floured surface and knead until smooth. Roll out to 1/4 inch thickness and cut into shapes using cookie cutters. Place 2 inches apart onto the prepared cookie sheets.\nBake for 20 minutes in the preheated oven, or until lightly brown. Remove from cookie sheets to cool on wire racks.\n",
        "picture_link": "4HHYncebAMBSBNzSur1XD9Hyxp9en5S"
    },
    {
        "title": "Slow Cooker Mongolian Beef",
        "ingredients": [
            "1 pound flank steak, cut into bite-size pieces ADVERTISEMENT",
            "1/4 cup cornstarch ADVERTISEMENT",
            "2 teaspoons olive oil ADVERTISEMENT",
            "1 onion, thinly sliced ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "3 large green onions, sliced diagonally into 1/2 inch pieces ADVERTISEMENT",
            "1/2 cup soy sauce ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/2 teaspoon minced fresh ginger root ADVERTISEMENT",
            "1/2 cup hoisin sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place flank steak and cornstarch into a resealable plastic bag. Shake the bag to evenly coat the flank steak with the cornstarch. Allow to steak rest for 10 minutes.\nHeat olive oil in a large skillet over medium-high heat. Cook and stir steak until evenly browned, 2 to 4 minutes. Place onion, garlic, flank steak, green onions, soy sauce, water, brown sugar, ginger, and hoisin sauce in a slow cooker. Cook on Low setting for about 4 hours.\n",
        "picture_link": "rVd7QAACSKkaKPmdsypIKDHvaWg/qbm"
    },
    {
        "title": "Black Forest Cake I",
        "ingredients": [
            "2 1/8 cups all-purpose flour ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "3/4 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "3/4 teaspoon baking soda ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1 tablespoon vanilla extract ADVERTISEMENT",
            "2 (20 ounce) cans pitted sour cherries ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/4 cup cornstarch ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3 cups heavy whipping cream ADVERTISEMENT",
            "1/3 cup confectioners' sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour two 9 inch, round, cake pans; cover bottoms with waxed paper.\nIn a large bowl, combine flour, 2 cups sugar, cocoa, baking powder, baking soda, and salt. Add eggs, milk, oil, and 1 tablespoon vanilla; beat until well blended. Pour batter into prepared pans.\nBake for 35 minutes, or until wooden toothpick inserted in centers comes out clean. Cool layers in pans on wire racks 10 minutes. Loosen edges, and remove to racks to cool completely.\nDrain cherries, reserving 1/2 cup juice. Combine reserved juice, cherries, 1 cup sugar and cornstarch in a 2 quart saucepan. Cook over low heat until thickened, stirring constantly. Stir in 1 teaspoon vanilla. Cool before using.\nCombine whipping cream and confectioner's sugar in a chilled medium bowl. Beat with an electric mixer at high speed until stiff peaks form.\nWith long serrated knife, split each cake layer horizontally in half. Tear one split layer into crumbs; set aside. Reserve 1 1/2 cups Frosting for decorating cake; set aside. Gently brush loose crumbs off top and side of each cake layer with pasty brush or hands. To assemble, place one cake layer on cake plate. Spread with 1 cup frosting; top with 3/4 cup cherry topping. Top with second cake layer; repeat layers of frosting and cherry topping. Top with third cake layer. Frost side of cake. Pat reserved crumbs onto frosting on side of cake. Spoon reserved frosting into pastry bag fitted with star decorator tip. Pipe around top and bottom edges of cake. Spoon remaining cherry topping onto top of cake.\n",
        "picture_link": "sdwZ2qpM3DnzMIaUzVYp.5fwhSbFjAm"
    },
    {
        "title": "Cocoa Oatmeal Cookies",
        "ingredients": [
            "1 cup butter, softened ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/3 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "3 cups rolled oats ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBeat butter or margarine and sugars until creamy. Add eggs and vanilla; beat well. Add combined flour, cocoa powder, baking soda and salt; mix well. Stir in oats and raisins, mix well.\nDrop dough by rounded tablespoonfuls onto ungreased cookie sheets. Bake 10 to 12 minutes, until cookies are almost set. Do not overbake. Cool 1 minute on cookies sheets, then move to wire racks. Cool - store tightly covered.\n",
        "picture_link": "0zUyYrItu3ZQajbqOd0qa7GZfEVv0MG"
    },
    {
        "title": "Scott Ure's Clams And Garlic",
        "ingredients": [
            "50 small clams in shell, scrubbed ADVERTISEMENT",
            "2 tablespoons extra virgin olive oil ADVERTISEMENT",
            "6 cloves garlic, minced ADVERTISEMENT",
            "1 cup white wine ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1/2 cup chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Wash clams to remove any dirt or sand.\nIn a large pot, heat oil over medium heat. Add garlic; saute for 1 minute, or until tender. Pour in the white wine. Boil until wine has reduced to half its original volume.\nAdd clams, cover, and steam till clams start to open. Add butter, cover, and cook till most or all of the clams open. Discard any that do not open. Transfer clams and juice to 2 large bowls. Sprinkle with parsley. Serve.\n",
        "picture_link": "NWv7HuKUFMdOIIdEVxYTii6Db7lel9O"
    },
    {
        "title": "Quinoa with Chickpeas and Tomatoes",
        "ingredients": [
            "1 cup quinoa ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1 3/4 cups water ADVERTISEMENT",
            "1 cup canned garbanzo beans (chickpeas), drained ADVERTISEMENT",
            "1 tomato, chopped ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "3 tablespoons lime juice ADVERTISEMENT",
            "4 teaspoons olive oil ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1 pinch salt and pepper to taste ADVERTISEMENT",
            "1/2 teaspoon chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the quinoa in a fine mesh strainer, and rinse under cold, running water until the water no longer foams. Bring the quinoa, salt, and water to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until the quinoa is tender, 20 to 25 minutes.\nOnce done, stir in the garbanzo beans, tomatoes, garlic, lime juice, and olive oil. Season with cumin, salt, and pepper. Sprinkle with chopped fresh parsley to serve.\n",
        "picture_link": "siCaEU33TQ8u1/LzLUOU7.r7ioPLHLy"
    },
    {
        "title": "Raspberry Oatmeal Bars",
        "ingredients": [
            "1 (18.25 ounce) package yellow cake mix ADVERTISEMENT",
            "2 1/2 cups quick cooking oats ADVERTISEMENT",
            "3/4 cup margarine, melted ADVERTISEMENT",
            "1 cup raspberry jam ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Grease a 9x13 inch pan.\nIn a large bowl, mix together oats, cake mix, and melted margarine so that it makes nice clumps and there is no dry mix left. Press 1/2 of the oats mixture evenly into the bottom the prepared pan. In a separate bowl, mix jam with water, and spread over the crust. Sprinkle the remaining oat mixture evenly over the top.\nBake in the preheated oven for 18 to 23 minutes, or until the top is lightly browned. Cool before cutting into bars.\n",
        "picture_link": "B64X28YE3/dE9u6ckiL2qYv33agoPNW"
    },
    {
        "title": "Cheesy Chicken Meatballs",
        "ingredients": [
            "1 pound ground chicken ADVERTISEMENT",
            "2 eggs, lightly beaten ADVERTISEMENT",
            "1/4 cup roasted garlic light cream cheese ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1 tablespoon dry bread crumbs ADVERTISEMENT",
            "1 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1 tablespoon Italian seasoning ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 1/2 tablespoons vegetable oil ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 450 degrees F (230 degrees C). Line a rimmed baking sheet with aluminum foil, and spray with cooking spray.\nCombine the chicken, eggs, cream cheese, Parmesan cheese, bread crumbs, red pepper flakes, Italian seasoning, garlic powder, vegetable oil, salt, and pepper in a large bowl; mix well. Form mixture into 20 meatballs; place on prepared pan.\nBake in center of preheated oven until juices run clear, 17 to 18 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\n",
        "picture_link": "RtYclNI81uKvKUFaAbGPgvpdaZ6XRGK"
    },
    {
        "title": "Tasty Collard Greens",
        "ingredients": [
            "1/4 cup olive oil ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "5 cups chicken stock ADVERTISEMENT",
            "1 smoked turkey drumstick ADVERTISEMENT",
            "5 bunches collard greens - rinsed, trimmed and chopped ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "1 tablespoon crushed red pepper flakes (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large pot over medium heat. Add garlic, and gently saute until light brown. Pour in the chicken stock, and add the turkey leg. Cover the pot, and simmer for 30 minutes.\nAdd the collard greens to the cooking pot, and turn the heat up to medium-high. Let the greens cook down for about 45 minutes, stirring occasionally.\nReduce heat to medium, and season with salt and pepper to taste. Continue to cook until the greens are tender and dark green, 45 to 60 minutes. Drain greens, reserving liquid. Mix in red pepper flakes if desired. Use liquid to reheat leftovers.\n",
        "picture_link": "tk4mlPgPX33UCNw96.naI1lCYpqb6VW"
    },
    {
        "title": "Mediterranean Chicken",
        "ingredients": [
            "2 teaspoons olive oil ADVERTISEMENT",
            "2 tablespoons white wine ADVERTISEMENT",
            "6 skinless, boneless chicken breast halves ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup diced onion ADVERTISEMENT",
            "3 cups tomatoes, chopped ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "2 teaspoons chopped fresh thyme ADVERTISEMENT",
            "1 tablespoon chopped fresh basil ADVERTISEMENT",
            "1/2 cup kalamata olives ADVERTISEMENT",
            "1/4 cup chopped fresh parsley ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the oil and 2 tablespoons white wine in a large skillet over medium heat. Add chicken and saute about 4 to 6 minutes each side, until golden. Remove chicken from skillet and set aside.\nSaute garlic in pan drippings for 30 seconds, then add onion and saute for 3 minutes. Add tomatoes and bring to a boil. Lower heat, add 1/2 cup white wine and simmer for 10 minutes. Add thyme and basil and simmer for 5 more minutes.\nReturn chicken to skillet and cover. Cook over low heat until the chicken is cooked through and no longer pink inside. Add olives and parsley to the skillet and cook for 1 minute. Season with salt and pepper to taste and serve.\n",
        "picture_link": "BV/mPrYiAJZQxGZig2E6ys.CRLkA/U2"
    },
    {
        "title": "Spicy Turkey Burgers",
        "ingredients": [
            "2 pounds lean ground turkey ADVERTISEMENT",
            "2 tablespoons minced garlic ADVERTISEMENT",
            "1 teaspoon minced fresh ginger root ADVERTISEMENT",
            "2 fresh green chile peppers, diced ADVERTISEMENT",
            "1 medium red onion, diced ADVERTISEMENT",
            "1/2 cup fresh cilantro, finely chopped ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 cup low sodium soy sauce ADVERTISEMENT",
            "1 tablespoon freshly ground black pepper ADVERTISEMENT",
            "3 tablespoons paprika ADVERTISEMENT",
            "1 tablespoon ground dry mustard ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "1 dash Worcestershire sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the grill for high heat.\nIn a bowl, mix the ground turkey, garlic, ginger, chile peppers, red onion, cilantro, salt, soy sauce, black pepper, paprika, mustard, cumin, and Worcestershire sauce. Form the mixture into 8 burger patties.\nLightly oil the grill grate. Place turkey burgers on the grill, and cook 5 to 10 minutes per side, until well done.\n",
        "picture_link": "ADk5qd/bpLW1n.wldGC5CvQtVeZnv2e"
    },
    {
        "title": "Linguine Pasta with Shrimp and Tomatoes",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "4 cups diced tomatoes ADVERTISEMENT",
            "1 cup dry white wine ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "salt and black pepper to taste ADVERTISEMENT",
            "1 (16 ounce) package linguine pasta ADVERTISEMENT",
            "1 pound peeled and deveined medium shrimp ADVERTISEMENT",
            "1 teaspoon Cajun seasoning ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 2 tablespoons of olive oil in a large saucepan over medium heat. Stir in the garlic; cook 2 minutes. Add the tomatoes, and wine. Bring to a simmer and cook 30 minutes, stirring frequently. Once the tomatoes have simmered into a sauce, stir in the butter and season with salt and pepper.\nFill a large pot with lightly-salted water; bring to a rolling boil; stir in the linguine and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through but is still firm to the bite, about 11 minutes. Drain well in a colander set in the sink.\nSeason the shrimp with the Cajun seasoning, salt, and pepper. Heat the remaining 2 tablespoons of olive oil in a large skillet over medium-high heat. Stir in the shrimp and cook until pink on the outside and no longer translucent in the center, about 5 minutes. Stir the shrimp into the pasta sauce, then stir the sauce into the linguine to serve.\n",
        "picture_link": "Rc.HjVa1wgvgqZk9/5D2/Al1iXMBchK"
    },
    {
        "title": "Espinacas con Garbanzos (Spinach with Garbanzo Beans)",
        "ingredients": [
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1/2 onion, diced ADVERTISEMENT",
            "1 (10 ounce) box frozen chopped spinach, thawed and drained well ADVERTISEMENT",
            "1 (12 ounce) can garbanzo beans, drained ADVERTISEMENT",
            "1/2 teaspoon cumin ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a skillet over medium-low heat. Cook the garlic and onion in the oil until translucent, about 5 minutes. Stir in the spinach, garbanzo beans, cumin, and salt. Use your stirring spoon to lightly mash the beans as the mixture cooks. Allow to cook until thoroughly heated.\n",
        "picture_link": "jmNiYL9TFP1u1K/sARxNbkG2eYoaQPK"
    },
    {
        "title": "Panna Cotta",
        "ingredients": [
            "1/3 cup skim milk ADVERTISEMENT",
            "1 (.25 ounce) envelope unflavored gelatin ADVERTISEMENT",
            "2 1/2 cups heavy cream ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 1/2 teaspoons vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour milk into a small bowl, and stir in the gelatin powder. Set aside.\nIn a saucepan, stir together the heavy cream and sugar, and set over medium heat. Bring to a full boil, watching carefully, as the cream will quickly rise to the top of the pan. Pour the gelatin and milk into the cream, stirring until completely dissolved. Cook for one minute, stirring constantly. Remove from heat, stir in the vanilla and pour into six individual ramekin dishes.\nCool the ramekins uncovered at room temperature. When cool, cover with plastic wrap, and refrigerate for at least 4 hours, but preferably overnight before serving.\n",
        "picture_link": "Xfn5BesnQ5afz8zKtquHMRaPcXbNSgW"
    },
    {
        "title": "German Potato Salad",
        "ingredients": [
            "4 potatoes ADVERTISEMENT",
            "4 slices bacon ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "1/4 cup white wine vinegar ADVERTISEMENT",
            "1/2 cup chopped green onions ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of salted water to a boil. Add potatoes; cook until tender but still firm, about 15 minutes. Drain, cool and chop.\nPlace bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble and set aside. Reserve bacon fat.\nAdd the flour, sugar, water and vinegar to skillet and cook in reserved bacon fat over medium heat until dressing is thick.\nAdd bacon, potatoes and green onions to skillet and stir until coated. Cook until heated and season with salt and pepper. Serve warm.\n",
        "picture_link": "Jbm5fAxS0DTIcD/IGBE58XGKNWferCW"
    },
    {
        "title": "Alienated Blueberry Muffins",
        "ingredients": [
            "2 cups fresh blueberries ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "4 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 cup margarine ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease muffins tins, or line cups with paper liners.\nSprinkle 1/4 cup flour over blueberries, and stir to coat berries thoroughly.\nIn a small bowl, whisk together 2 cups flour, baking powder and salt.\nIn a large bowl, cream margarine, and gradually mix in sugar. Beat eggs, and stir into creamed mixture along with vanilla. Stir in milk alternately with flour mixture, mixing well after each addition. Fold in berries. Fill muffin cups 2/3 full with batter.\nBake for 25 minutes.\n",
        "picture_link": "bvY7Tq8WHsGJbC667M2Z9wAa9wyqGai"
    },
    {
        "title": "Key Lime Cheesecake I",
        "ingredients": [
            "1 1/2 cups graham cracker crumbs ADVERTISEMENT",
            "6 tablespoons butter, melted ADVERTISEMENT",
            "24 ounces cream cheese, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 tablespoon grated lime zest ADVERTISEMENT",
            "2/3 cup key lime juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine cookie or graham cracker crumbs with butter or margarine. Press into bottom and partially up sides of 9 inch springform pan. Refrigerate.\nIn a large bowl, beat with an electric mixer the cream cheese, sugar, lime peel, and cornstarch until smooth and fluffy. Beat in eggs one at a time, blending just until smooth. Add key lime juice with mixer on low. Finish mixing by hand. Do not over beat, or cake will crack during baking. Pour batter into prepared crust.\nBake at 300 degrees F (150 degrees C) for 55 to 65 minutes, or until set. To minimize cracking, place a shallow pan half full of hot water on lower rack during baking.\nTurn oven off, and let cheesecake stand in oven 30 minutes with the door open at least 4 inches. Remove from oven. Refrigerate cake overnight, and up to three days.\n",
        "picture_link": "6oAyzHR./BdffUcfXpDobvKX8/OtRRC"
    },
    {
        "title": "Orange Pecan French Toast",
        "ingredients": [
            "1 cup packed brown sugar ADVERTISEMENT",
            "1/3 cup butter, melted ADVERTISEMENT",
            "2 tablespoons light corn syrup ADVERTISEMENT",
            "1/3 cup chopped pecans ADVERTISEMENT",
            "12 (3/4 inch thick) slices French bread ADVERTISEMENT",
            "1 teaspoon grated orange zest ADVERTISEMENT",
            "1 cup fresh orange juice ADVERTISEMENT",
            "1/2 cup 2% milk ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3 egg whites ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 tablespoon confectioners' sugar for dusting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, stir together the brown sugar, melted butter, and corn syrup. Pour into a greased 9x13 inch baking dish, and spread evenly. Sprinkle pecans over the sugar mixture. Arrange the bread slices in the bottom of the dish so they are in a snug single layer.\nIn a medium bowl, whisk together the orange zest, orange juice, milk, sugar, cinnamon, vanilla, egg whites, and eggs. Pour this mixture over the bread, pressing on the bread slices to help absorb the liquid. Cover and refrigerate for at least one hour, or overnight.\nPreheat the oven to 350 degrees F (175 degrees C ). Remove the cover from the baking dish, and let stand for 20 minutes at room temperature.\nBake for 35 minutes in the preheated oven, until golden brown. Dust with confectioners' sugar before serving.\n",
        "picture_link": "uvb0c74UXkSCThMHj4VUd1a4kcNeGzm"
    },
    {
        "title": "Grandma's Polish Perogies",
        "ingredients": [
            "4 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons salt ADVERTISEMENT",
            "2 tablespoons butter, melted ADVERTISEMENT",
            "2 cups sour cream ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "8 baking potatoes, peeled and cubed ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "2 tablespoons processed cheese sauce ADVERTISEMENT",
            "onion salt to taste (optional) ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, stir together the flour and salt. In a separate bowl, whisk together the butter, sour cream, eggs, egg yolk and oil. Stir the wet ingredients into the flour until well blended. Cover the bowl with a towel, and let stand for 15 to 20 minutes.\nPlace potatoes into a pot, and fill with enough water to cover. Bring to a boil, and cook until tender, about 15 minutes. Drain, and mash with shredded cheese and cheese sauce while still hot. Season with onion salt, salt and pepper. Set aside to cool.\nSeparate the perogie dough into two balls. Roll out one piece at a time on a lightly floured surface until it is thin enough to work with, but not too thin so that it tears. Cut into circles using a cookie cutter, perogie cutter, or a glass. Brush a little water around the edges of the circles, and spoon some filling into the center. Fold the circles over into half-circles, and press to seal the edges. Place perogies on a cookie sheet, and freeze. Once frozen, transfer to freezer storage bags or containers.\nTo cook perogies: Bring a large pot of lightly salted water to a boil. Drop perogies in one at a time. They are done when they float to the top. Do not boil too long, or they will be soggy! Remove with a slotted spoon.\n",
        "picture_link": "63aCaWMRZ.NuBSBcIQoFhbum9IKt5ZS"
    },
    {
        "title": "Baked Parmesan-Crusted Chicken",
        "ingredients": [
            "3/4 cup butter ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 cup dry bread crumbs ADVERTISEMENT",
            "1/3 cup grated Parmesan cheese ADVERTISEMENT",
            "2 tablespoons chopped fresh thyme ADVERTISEMENT",
            "2 tablespoons chopped fresh basil ADVERTISEMENT",
            "2 tablespoons chopped fresh oregano ADVERTISEMENT",
            "1/4 teaspoon pepper ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "6 (4 ounce) skinless, boneless chicken breast halves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMelt the butter with the garlic in a saucepan over medium heat. When the butter starts to bubble, remove from the heat and allow to cool slightly. Stir the breadcrumbs together with the Parmesan cheese, thyme, basil, oregano, pepper, and salt in a bowl. Dip the chicken breasts in the butter, then press into the seasoned bread crumbs. Place the chicken into a 9x13 inch baking dish.\nBake in the preheated oven until the chicken is golden brown and no longer pink in the center, 50 to 55 minutes.\n",
        "picture_link": "qBxwgABiWoPhAs2hSMvv8yAcJHXq1jS"
    },
    {
        "title": "Classic Rice Pilaf",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "2 cups long-grain white rice ADVERTISEMENT",
            "3 cups chicken stock ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 pinch saffron (optional) ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMelt butter and olive oil in a large saucepan over medium heat. Add onion; cook and stir until onion is lightly browned, 7 to 8 minutes. Remove from heat.\nCombine rice and onion mixture in a 9x13-inch casserole dish placed on a baking sheet. Stir thoroughly to coat the rice.\nCombine chicken stock, salt, saffron, and cayenne pepper in a saucepan. Bring to a boil, reduce heat to low, and simmer for 5 minutes.\nPour chicken stock mixture over rice in the casserole dish and stir to combine. Spread mixture evenly along the bottom of the pan. Cover tightly with heavy-duty aluminum foil.\nBake in the preheated oven for 35 minutes. Remove from oven and allow to rest, covered, for 10 minutes. Remove foil and fluff with a fork to separate the grains of rice.\n",
        "picture_link": "DkPsrTwcJ9FQAUs86rMMcUuMmjfXV92"
    },
    {
        "title": "Chocolate Peanut Butter Squares",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "4 cups confectioners' sugar ADVERTISEMENT",
            "2 cups peanut butter ADVERTISEMENT",
            "1 1/2 cups graham cracker crumbs ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "1 cup semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt 1 cup butter or margarine over low heat. Remove from heat and stir in confectioners' sugar, peanut butter and graham cracker crumbs. Spread mixture in a jelly roll pan. Pat down evenly.\nTo Make Topping: Melt together 1/2 cup butter or margarine with 1 cup chocolate chips. Spread this mixture over peanut butter mixture. Refrigerate 1/2 hour. Cut into squares.\n",
        "picture_link": "xQ8zA8FpfX3YeJlspHTYSnUdOxT7pMS"
    },
    {
        "title": "Cherry Pie III",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 cup shortening, chilled ADVERTISEMENT",
            "1/2 cup cold water ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "2 cups pitted sour cherries ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "10 teaspoons cornstarch ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1/4 teaspoon almond extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut the shortening into the flour and salt with the whisking blades of a stand mixer until the crumbs are pea-sized. Mix in cold water by hand just until the dough holds together. Divide the dough in half and form it into two disks. Wrap in plastic and refrigerate until chilled through, 30 minutes to 1 hour.\nRoll out one disk of dough into a 11-inch circle. Line a 9-inch pie pan with pastry. Refrigerate until needed. Roll out the dough for the top crust, transfer it to a plate or baking sheet, and refrigerate.\nPreheat the oven to 375 degrees F (190 degrees C). Place a baking tray in the oven to preheat.\nPlace the cherries, sugar, and cornstarch in a medium-sized non-aluminum saucepan. Allow the mixture to stand for 10 minutes, or until the sugar draws out the cherries' juices. Bring to a boil over medium heat, stirring constantly. Lower the heat; simmer for 1 minute, or until the juices thicken and become translucent. Remove pan from heat, and stir in butter and almond extract. Allow the filling to cool to lukewarm. Pour the filling into the pie shell. Cover with top crust, crimp the edges to seal, and cut vents for steam.\nBake in a preheated 375 degree F (190 degree C) oven on the baking tray for 45 to 55 minutes, or until the crust is golden brown. Allow to cool for several hours before slicing.\n",
        "picture_link": "DlZW7pCQdUPHYO22ogLWtuVEr4M.1ji"
    },
    {
        "title": "Tina's Shortbread Chocolate Chip Cookies",
        "ingredients": [
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 cup unsalted butter ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "3/4 cup semisweet chocolate chips ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 300 degrees F (150 degrees C).\nSift together the flour, baking powder and salt, set aside. In a medium bowl, cream the butter and sugar together until fluffy. Gradually stir in the dry ingredients, then stir in the walnuts and chocolate chips.\nRoll or scoop dough into walnut sized balls. Place them on unprepared cookie sheets 1 1/2 inches apart. Flatten cookies slightly. Bake for 15 to 20 minutes, until light golden brown. Remove from sheets to cool on racks.\n",
        "picture_link": "TTRb3CrxpIvM9A1jjpMyv2eomAHPUEG"
    },
    {
        "title": "Grandma's Homemade Banana Bread",
        "ingredients": [
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "3 bananas, mashed ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/3 cup sour milk ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease an 8x4 inch loaf pan.\nCombine sugar, butter, bananas, eggs, flour, baking soda, milk, salt and vanilla extract in a large mixing bowl; beat well. Pour batter into prepared pan.\nBake in a preheated oven for 60 minutes, or until a toothpick inserted into the center of the loaf comes out clean.\n",
        "picture_link": "/l/70IMwIn0fgqUq7SijXNPpsilYqBq"
    },
    {
        "title": "Chef John's Coq Au Vin",
        "ingredients": [
            "6 bone-in, skin-on chicken thighs ADVERTISEMENT",
            "1 pinch kosher salt and freshly ground black pepper to taste ADVERTISEMENT",
            "8 ounces bacon, sliced crosswise into 1/2-inch pieces ADVERTISEMENT",
            "10 large button mushrooms, quartered ADVERTISEMENT",
            "1/2 large yellow onion, diced ADVERTISEMENT",
            "2 shallots, sliced ADVERTISEMENT",
            "2 teaspoons all-purpose flour ADVERTISEMENT",
            "2 teaspoons butter ADVERTISEMENT",
            "1 1/2 cups red wine ADVERTISEMENT",
            "6 sprigs fresh thyme ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nSeason chicken thighs all over with salt and black pepper.\nPlace bacon in a large, oven-proof skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Transfer bacon with a slotted spoon to a paper-towel lined plate, leaving drippings in the skillet.\nIncrease heat to high and place chicken, skin-side down, into skillet. Cook in hot skillet until browned, 2 to 4 minutes per side. Transfer chicken to a plate; drain and discard all but 1 tablespoon drippings from the skillet.\nLower heat to medium-high; saute mushrooms, onion, and shallots with a pinch of salt in the hot skillet until golden and caramelized, 7 to 12 minutes.\nStir flour and butter into vegetable mixture until completely incorporated, about 1 minute.\nPour red wine into the skillet and bring to a boil while scraping browned bits of food off of the bottom of the pan with a wooden spoon. Stir bacon and thyme into red wine mixture; simmer until wine is about 1/3 reduced, 3 to 5 minutes. Pour chicken broth into wine mixture and set chicken thighs into skillet; bring wine and stock to a simmer.\nCook chicken in the preheated oven for 30 minutes. Spoon pan juices over the chicken and continue cooking until no longer pink at the bone and the juices run clear, about 30 minutes more. An instant-read thermometer inserted into the thickest part of the thigh, near the bone should read 165 degrees F (74 degrees C). Transfer chicken to a platter.\nPlace skillet over high heat and reduce pan juices, skimming fat off the top as necessary, until sauce thickens slightly, about 5 minutes. Season with salt and pepper; remove and discard thyme. Pour sauce over chicken.\n",
        "picture_link": "W4qFmVbl4NEpAuzM2KQOqeE8tXC/Qgi"
    },
    {
        "title": "Easy Chicken Satay",
        "ingredients": [
            "1/2 cup coconut milk ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 teaspoon curry powder ADVERTISEMENT",
            "1 1/2 teaspoons brown sugar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "3/4 pound skinless, boneless chicken breast halves - cut into 1 inch strips ADVERTISEMENT",
            "1 cup coconut milk ADVERTISEMENT",
            "1 tablespoon curry powder ADVERTISEMENT",
            "1/2 cup creamy peanut butter ADVERTISEMENT",
            "3/4 cup chicken stock ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "2 tablespoons lime or lemon juice ADVERTISEMENT",
            "1 teaspoon soy sauce ADVERTISEMENT",
            "Salt to taste ADVERTISEMENT",
            "10 (6 inch) wooden skewers, or as needed, soaked in water for 30 minutes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together 1/2 cup coconut milk, garlic, 1 teaspoon curry powder, brown sugar, salt, and pepper until the sugar has dissolved. Toss marinade with the chicken, cover, and marinate for at least 2 hours.\nBring 1 cup coconut milk, 1 tablespoon curry powder, peanut butter, chicken stock, and 1/4 cup brown sugar to a simmer in a saucepan over medium-high heat. Simmer for 5 minutes, stirring constantly, until smooth and thickened. Remove from heat and stir in lime juice and soy sauce; season to taste with salt.\nPreheat a grill for medium-high heat.\nThread marinated chicken onto skewers, then grill 4 to 5 minutes per side, or until cooked through. Serve with warm peanut sauce.\n",
        "picture_link": "j3/DiDiGYEUrppGMEzGC7yb1KWH7Xei"
    },
    {
        "title": "Sandy's Casserole",
        "ingredients": [
            "2 cups uncooked elbow macaroni ADVERTISEMENT",
            "2 (5 ounce) cans chunk chicken ADVERTISEMENT",
            "2 cups shredded Cheddar cheese ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed cream of chicken soup ADVERTISEMENT",
            "1 (4 ounce) can sliced mushrooms ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large bowl combine the macaroni, chicken, cheese, milk, soup, mushrooms and onion. Mix together and transfer mixture to a 9x13 inch baking dish.\nBake at 350 degrees F (175 degrees C) for about 45 minutes, or until bubbly and golden brown.\n",
        "picture_link": "HRQN/cbUBtQUkqEndoiUhFYUTqbOxlm"
    },
    {
        "title": "Hearty Hamburger Soup",
        "ingredients": [
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "1 onion, minced ADVERTISEMENT",
            "4 carrots, minced ADVERTISEMENT",
            "3 celery ribs, thinly sliced ADVERTISEMENT",
            "1/2 cup barley ADVERTISEMENT",
            "1 (28 ounce) can diced tomatoes ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "3 (10 ounce) cans beef broth ADVERTISEMENT",
            "1 (10.75 ounce) can condensed tomato soup ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1 tablespoon parsley ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "ground black pepper, to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large soup pot over medium-high heat, and crumble in the ground beef. Cook and stir until the beef is evenly browned and no longer pink. Drain, and discard any excess grease.\nStir in the onion, carrots, celery, and barley. Pour in diced tomatoes, water, broth, and tomato soup. Season with bay leaf, parsley, garlic, thyme, and pepper. Bring to a boil. Reduce heat, and cover; simmer for 2 hours, stirring frequently. Remove bay leaf before serving.\n",
        "picture_link": "izL7fqyGKFeQ.ctXQjgtlA7UpIMMzbi"
    },
    {
        "title": "Ten Minute Szechuan Chicken",
        "ingredients": [
            "4 boneless skinless chicken breasts, cut into cubes ADVERTISEMENT",
            "3 tablespoons cornstarch ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "5 tablespoons low-sodium soy sauce ADVERTISEMENT",
            "1 1/2 tablespoons white wine vinegar ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "3 green onions, sliced diagonally into 1/2 inch pieces ADVERTISEMENT",
            "1/8 teaspoon cayenne pepper, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the chicken and cornstarch into a bag or bowl, and toss to coat. Heat oil in a wok or large skillet over medium-high heat. Fry the chicken pieces and garlic, stirring constantly until lightly browned. Stir in the soy sauce, vinegar, sugar and water. Cover, and cook until the chicken pieces are no longer pink inside, 3 to 5 minutes.\nStir in the green onion, and cayenne pepper, cook uncovered for about 2 more minutes. Serve over white rice.\n",
        "picture_link": "h4CCHnqPEOwipkKnQxwifqLU.VF99PW"
    },
    {
        "title": "Chicken Piccata with Artichoke Hearts",
        "ingredients": [
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "1/8 teaspoon garlic powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon black pepper ADVERTISEMENT",
            "1/2 teaspoon Italian seasoning ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves, pounded 1/2 inch thick and cut into thirds ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 onion, minced ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "1 (14.5 ounce) can chicken broth ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "1 (13.75 ounce) can artichoke hearts, drained and chopped, liquid reserved ADVERTISEMENT",
            "1/4 cup capers, with liquid ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together the flour, garlic powder, salt, pepper, and Italian seasoning on a plate. One by one, dredge the chicken pieces lightly in the prepared flour mixture.\nHeat the olive oil in a large skillet over medium-high heat. Cook the chicken pieces for 2 minutes per side, or until nicely browned. Remove from the skillet and set aside.\nUsing the same skillet, cook and stir the garlic and onion until translucent, about 5 minutes. Pour the white wine into the skillet, turn the heat to high, and cook until the wine reduces by half, 4 to 5 minutes. Add the chicken broth, lemon juice, artichoke hearts, reserved artichoke liquid, and browned chicken to the skillet. Reduce the heat to medium and cook until the sauce thickens, about 20 minutes. Stir in the capers and butter.\n",
        "picture_link": "ZPTg/5WrKdr0eMuyOZHN1Cx5hWMLW2u"
    },
    {
        "title": "Italian Confetti  Pasta Salad",
        "ingredients": [
            "1 cup mayonnaise ADVERTISEMENT",
            "1 tablespoon red wine vinegar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 1/2 tablespoons chopped fresh basil ADVERTISEMENT",
            "2 cups colored rotini pasta ADVERTISEMENT",
            "1 cup chopped tomatoes ADVERTISEMENT",
            "1/2 cup chopped yellow bell pepper ADVERTISEMENT",
            "1/2 cup sliced black olives ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook pasta according to package directions. Rinse in cold water, and drain.\nIn a large mixing bowl, whisk together mayonnaise, vinegar, salt, black pepper, and garlic until well blended. Mix in basil. Add pasta, tomatoes, bell peppers, and olives; fold gently until mixed. Chill several hours. Stir gently before serving.\n",
        "picture_link": "OU2Tkqu3qsx6LlB68OS7ODxw/rGrUXC"
    },
    {
        "title": "Party Punch IX",
        "ingredients": [
            "3 (3 ounce) packages fruit flavored Jell-O® mix ADVERTISEMENT",
            "4 cups white sugar ADVERTISEMENT",
            "13 cups boiling water ADVERTISEMENT",
            "2 (46 fluid ounce) cans pineapple juice ADVERTISEMENT",
            "1 (16 ounce) bottle lemon juice concentrate ADVERTISEMENT",
            "2 (2 liter) bottles ginger ale, chilled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine gelatin and sugar. Stir in boiling water until mixture is dissolved. Stir in pineapple juice and lemon juice concentrate. Divide into 2 containers, and freeze until solid.\nTo serve, place gelatin mixture in punch bowl, and chop into pieces. Pour in ginger ale.\n",
        "picture_link": "CCF0wycMFbQpmAZGhV6tXuRi.V8rIPO"
    },
    {
        "title": "Cafeteria Carrot Souffle",
        "ingredients": [
            "2 pounds carrots, chopped ADVERTISEMENT",
            "1/2 cup melted butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3 eggs, beaten ADVERTISEMENT",
            "1 teaspoon confectioners' sugar for dusting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of salted water to a boil. Add carrots and cook until tender, about 15 minutes. Drain and mash. To the carrots add melted butter, white sugar, flour, baking powder, vanilla extract and eggs. Mix well and transfer to a 2 quart casserole dish. Sprinkle with confectioners' sugar.\nBake in preheated oven for 30 minutes.\n",
        "picture_link": "suahK/K7YnabdHU3Ny1uChGjEauD0P."
    },
    {
        "title": "Veronica's Apple Pancakes",
        "ingredients": [
            "1/4 cup butter, melted ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 cup shredded tart apple ADVERTISEMENT",
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 1/4 teaspoons baking powder ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine butter, egg, milk and apple. In a separate bowl, sift together flour, baking powder, cinnamon and sugar. Stir flour mixture into apple mixture, just until combined.\nHeat a lightly oiled griddle or frying pan over medium high heat. Pour or scoop the batter onto the griddle, using approximately 1/4 cup for each pancake. Brown on both sides and serve hot.\n",
        "picture_link": "F53eurQ6Ikd9ebKRFXf.u7RQZ9fwVwa"
    },
    {
        "title": "Crackle Top Molasses Cookies",
        "ingredients": [
            "2/3 cup vegetable oil ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/4 cup molasses ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking soda ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon ground cloves ADVERTISEMENT",
            "1/3 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (180 degrees C).\nIn a large bowl mix oil and 1 cup of sugar. Add egg, beat well. Stir in molasses, 2 cups flour, baking soda and spices. If necessary, add more flour to make a firm dough.\nShape dough into 1 1/4 inch balls. Roll in 1/3 cup sugar. Place 3 inches apart on an ungreased baking sheet. Bake 12 to 14 minutes or until tops crack. Remove from baking sheet and cool on rack.\n",
        "picture_link": "B6e7wLMikgIpcbMxwfOfdlOMA0NScje"
    },
    {
        "title": "Eclairs II",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 (5 ounce) package instant vanilla pudding mix ADVERTISEMENT",
            "2 1/2 cups cold milk ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "1/4 cup confectioners' sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "2 (1 ounce) squares semisweet chocolate ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 cup confectioners' sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "3 tablespoons hot water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C). Grease a cookie sheet.\nIn a medium saucepan, combine 1/2 cup butter and 1 cup water. Bring to a boil, stirring until butter melts completely. Reduce heat to low, and add flour and salt. Stir vigorously until mixture leaves the sides of the pan and begins to form a stiff ball. Remove from heat. Add eggs, one at a time, beating well to incorporate completely after each addition. With a spoon or a pastry bag fitted with a No. 10, or larger, tip, spoon or pipe dough onto cookie sheet in 1 1/2 x 4 inch strips.\nBake 15 minutes in the preheated oven, then reduce heat to 325 degrees F (165 degrees C) and bake 20 minutes more, until hollow sounding when lightly tapped on the bottom. Cool completely on a wire rack.\nFor the filling, combine pudding mix and milk in medium bowl according to package directions. In a separate bowl, beat the cream with an electric mixer until soft peaks form. Beat in 1/4 cup confectioners' sugar and 1 teaspoon vanilla. Fold whipped cream into pudding. Cut tops off of cooled pastry shells with a sharp knife. Fill shells with pudding mixture and replace tops.\nFor the icing, melt the chocolate and 2 tablespoons butter in a medium saucepan over low heat. Stir in 1 cup confectioners' sugar and 1 teaspoon vanilla. Stir in hot water, one tablespoon at a time, until icing is smooth and has reached desired consistency. Remove from heat, cool slightly, and drizzle over filled eclairs. Refrigerate until serving.\n",
        "picture_link": "Z6tmhDf0AoZHAcsMah3oqHRDEksLesi"
    },
    {
        "title": "Sweet and Sour Drumettes",
        "ingredients": [
            "8 chicken drumettes ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/4 cup all-purpose flour for coating ADVERTISEMENT",
            "SAUCE ADVERTISEMENT",
            "3 tablespoons soy sauce ADVERTISEMENT",
            "3 tablespoons water ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup vinegar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dip chicken in egg beat, then flour. Fry in a large skillet until crispy, about 15 minutes. Drain and place in a 9x13 inch baking dish.\nPreheat oven to 350 degrees F (175 degrees C).\nTo Make Sauce: In a small bowl combine the soy sauce, water, sugar and vinegar. Mix together and pour over chicken.\nBake in the preheated oven for 30 minutes, or until cooked through and juices run clear.\n",
        "picture_link": "egcMPT3mqT/OILCOrugLzZ7qVI4e1w."
    },
    {
        "title": "Quick and Easy Yorkshire Pudding",
        "ingredients": [
            "3 eggs ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nIn a medium bowl, beat eggs with milk. Stir in flour. Set aside.\nDivide butter evenly into the twelve cups of a muffin tin, about 1/2 teaspoon per cup. Place tin in oven to melt butter, 2 to 5 minutes. Remove tin from oven, and distribute batter evenly among buttery cups.\nBake in preheated oven 5 minutes. Reduce heat to 350 degrees F (175 degrees C), and bake 25 minutes more or until puffed and golden.\n",
        "picture_link": "OzDPBaCA4de342nY.DloBL3xUTwW02."
    },
    {
        "title": "Banana Chocolate Chip Cake",
        "ingredients": [
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "1 1/2 teaspoons baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 cup mashed bananas ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1/2 cup unsalted butter, melted ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "3/4 cup semisweet chocolate chips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13 inch pan.\nIn a large bowl, mix flour, sugar, baking powder and salt.\nIn a separate bowl, combine bananas, egg, melted butter and milk.\nStir banana mixture into flour mixture until blended. Be careful not to over mix.\nStir in chocolate chips.\nPour batter into 9x13 inch pan. Bake at 350 degrees F (175 degrees C) 30 to 35 minutes, or until a toothpick inserted into center of cake comes out clean. (It will have some melted chocolate, but no crumbs.)\n",
        "picture_link": "rjo25OmPmACJWnbgiQ1x3A6NWKq/O32"
    },
    {
        "title": "Butternut and Apple Harvest Soup",
        "ingredients": [
            "2 tablespoons butter ADVERTISEMENT",
            "2 large leeks (white and pale green parts only), chopped ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 large potato, peeled and cubed ADVERTISEMENT",
            "2 cups cubed butternut squash ADVERTISEMENT",
            "1 cup diced carrots ADVERTISEMENT",
            "1 Granny Smith apple, peeled, cored, and sliced 1/4-inch thick ADVERTISEMENT",
            "1 quart chicken stock ADVERTISEMENT",
            "1/4 cup dry white wine (optional) ADVERTISEMENT",
            "1/2 cup light cream ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 tablespoons chopped chives ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large pot over medium heat. Stir in leeks and onions, and cook until the onion softens and turns translucent, about 5 minutes. Add potato, squash, carrots, apple, and chicken stock. Bring to a boil, then reduce heat to medium-low, cover, and simmer until the vegetables are soft, about 20 minutes.\nCarefully puree the soup in batches in a blender, or use a stick blender to puree the soup right in the pot. Once the soup has been pureed, return it to the pot and stir in wine and cream. Season with nutmeg, salt, and pepper; simmer gently for 5 minutes. Ladle into bowls and garnish with chopped chives.\n",
        "picture_link": "S0xJCm8toPaYvd0HHqRx6LtP2CF2rXu"
    },
    {
        "title": "Amazing Butternut Squash",
        "ingredients": [
            "1 butternut squash- peeled, seeded and cubed ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/2 cup finely chopped onion ADVERTISEMENT",
            "1 egg, lightly beaten ADVERTISEMENT",
            "1 teaspoon brown sugar ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/4 cup crushed saltine crackers ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "1 tablespoon butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large pot, bring the squash to boil. Reduce to a simmer until squash is soft.\nIn a large bowl, mash the softened squash. Mix in the mayonnaise, onion, egg, brown sugar, salt and pepper. Pour the mixture into a 2 quart baking dish.\nIn a medium bowl, mix together crackers, Parmesan and butter. Sprinkle over the squash mixture.\nBake uncovered in the preheated oven for 35 to 45 minutes, until the topping is lightly brown.\n",
        "picture_link": "WExgi2zu9Xs5iZ7VrpTFvV8s3jQn4EO"
    },
    {
        "title": "Awesome Chicken Noodle Soup",
        "ingredients": [
            "1 gallon water ADVERTISEMENT",
            "1 (4 pound) whole chicken, cut into pieces ADVERTISEMENT",
            "1 large onion, peeled and halved ADVERTISEMENT",
            "3 bay leaves ADVERTISEMENT",
            "10 whole black peppercorns ADVERTISEMENT",
            "2/3 bunch celery, leaves reserved ADVERTISEMENT",
            "1 pound whole carrots ADVERTISEMENT",
            "3 tablespoons chopped lemon grass (optional) ADVERTISEMENT",
            "1/4 cup chicken bouillon powder ADVERTISEMENT",
            "1 pound carrots, peeled and sliced ADVERTISEMENT",
            "1/3 bunch celery, chopped and leaves reserved ADVERTISEMENT",
            "1 (8 ounce) package dry egg noodles ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken and water in a large pot over high heat and bring to a boil. Reduce heat, cover and simmer, skimming fat as needed, 30 minutes.\nPlace the halved onion, bay leaves, peppercorns, whole celery, whole carrots and lemon grass in the pot and simmer, covered 1 hour.\nStrain broth and reserve chicken. When chicken is cool enough to handle, remove skin and cut meat into bite-size pieces.\nReturn strained stock to pot over high heat, and stir in chicken base, chopped celery and chopped carrots. Bring to a boil, then reduce heat, cover and simmer 20 minutes, or until carrots are tender.\nChop celery leaves and stir into pot with the noodles. Simmer until noodles are cooked, about 10 minutes more. Stir in chicken and heat through.\n",
        "picture_link": "DZXuM5H20EKN1pEt6tH0pHZ4BvEUvFq"
    },
    {
        "title": "Vegan Bean Taco Filling",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 bell pepper, chopped ADVERTISEMENT",
            "2 (14.5 ounce) cans black beans, rinsed, drained, and mashed ADVERTISEMENT",
            "2 tablespoons yellow cornmeal ADVERTISEMENT",
            "1 1/2 tablespoons cumin ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 teaspoon cayenne pepper ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1 cup salsa ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a medium skillet over medium heat. Stir in onion, garlic, and bell pepper; cook until tender. Stir in mashed beans. Add the cornmeal. Mix in cumin, paprika, cayenne, chili powder, and salsa. Cover, and cook 5 minutes.\n",
        "picture_link": "axMpofmp3D8BIM6bTo6NlEvEeyjm.uK"
    },
    {
        "title": "Onion Roasted Sweet Potatoes",
        "ingredients": [
            "2 (1 ounce) packages dry onion soup mix ADVERTISEMENT",
            "2 pounds sweet potatoes, peeled and diced ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nIn a large bowl, toss the dry onion soup mix, sweet potatoes and vegetable oil until the sweet potatoes are well coated.\nArrange the mixture on a large baking sheet. Bake in the preheated oven 40 to 50 minutes, or until the sweet potatoes are tender.\n",
        "picture_link": "PBFzch3aXWz09JtqeOficQ4JJEy61TS"
    },
    {
        "title": "Stuffed Mexican Peppers",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 (1 ounce) package taco seasoning mix ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "2 teaspoons chili powder ADVERTISEMENT",
            "1/2 cup cooked rice ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon garlic salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "2 (8 ounce) cans tomato sauce, divided ADVERTISEMENT",
            "3 large red bell peppers ADVERTISEMENT",
            "6 (1 inch) cubes Colby-Jack cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish.\nPlace the ground beef into a skillet over medium heat, and brown the meat, breaking it apart into crumbles as it cooks, about 8 minutes. Drain excess fat. Stir in the taco seasoning, water, chili powder, cooked rice, salt, garlic salt, black pepper, and 1 can of tomato sauce; mix until thoroughly combined. Bring to a boil, reduce heat to low, and simmer 20 minutes.\nMeanwhile, cut the bell peppers in half lengthwise, and remove stems, membranes, cores, and seeds. Place a steamer insert into a large saucepan, and fill with water to just below the bottom of the steamer. Cover, and bring the water to a boil over high heat. Place the peppers into the steamer insert, cover the pan, and steam until just tender, 3 to 5 minutes.\nPlace the steamed peppers into the prepared baking dish, and fill lightly with the meat filling. Press 1 cube of Colby-Jack cheese into the center of the filling in each pepper, and spoon the remaining can of tomato sauce over the peppers. Cover the dish with aluminum foil.\nBake in the preheated oven until the peppers are tender and the filling is hot, 25 to 30 minutes.\n",
        "picture_link": "UFcCbKEGViNY4V.P7voplcBNopVsP1O"
    },
    {
        "title": "Chicken Chimichangas with Green Sauce",
        "ingredients": [
            "2 (10.5 ounce) cans condensed cream of chicken soup ADVERTISEMENT",
            "2 (4 ounce) cans diced green chiles ADVERTISEMENT",
            "5 pitted green olives ADVERTISEMENT",
            "1 jalapeno pepper, seeded and chopped ADVERTISEMENT",
            "2 tablespoons fresh lime juice ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "1 (8 ounce) package shredded Monterey Jack cheese ADVERTISEMENT",
            "1/2 (1 ounce) package taco seasoning ADVERTISEMENT",
            "1 pound shredded cooked chicken meat ADVERTISEMENT",
            "8 (10 inch) flour tortillas ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "1 (8 ounce) package shredded sharp Cheddar cheese ADVERTISEMENT",
            "1 cup chopped green onion ADVERTISEMENT",
            "1 (8 ounce) container sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour the cream of chicken soup into a blender along with the green chiles, olives, jalapeno, and lime juice. Puree until smooth, then pour into a saucepan, and warm over medium-low heat while proceeding with the recipe.\nIn a large bowl, stir together the cream cheese, Monterey Jack cheese, and taco seasoning until well blended. Fold in the chicken. Evenly divide mixture among the 8 tortillas. Fold each tortilla into a rectangular packet around the filling.\nHeat the vegetable oil in a large skillet over medium-high heat. Fry 4 chimichangas at a time until golden brown, then drain on a plate lined with paper towels.\nTo serve, place a chimichanga on a plate, and ladle the warm sauce overtop. Sprinkle with Cheddar cheese and green onions. Finish with a dollop of sour cream.\n",
        "picture_link": "M9/nf2HDtE7h0B48XtKlVBtca9yH8u."
    },
    {
        "title": "Braised Corned Beef Brisket",
        "ingredients": [
            "1 (5 pound) flat-cut corned beef brisket ADVERTISEMENT",
            "1 tablespoon browning sauce (such as Kitchen Bouquet®), or as desired ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "6 cloves garlic, sliced ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 275 degrees F (135 degrees C).\nDiscard any flavoring packet from corned beef. Brush brisket with browning sauce on both sides. Heat vegetable oil in a large skillet over medium-high heat and brown brisket on both sides in the hot oil, 5 to 8 minutes per side.\nPlace brisket on a rack set in a roasting pan. Scatter onion and garlic slices over brisket and add water to roasting pan. Cover pan tightly with aluminum foil.\nRoast in the preheated oven until meat is tender, about 6 hours.\n",
        "picture_link": "n6o0lPWotu7z6kVeTGZ4fNh950eEYw."
    },
    {
        "title": "Lasagna Roll Ups",
        "ingredients": [
            "1 (16 ounce) package uncooked lasagna noodles ADVERTISEMENT",
            "1 pound mozzarella cheese, shredded ADVERTISEMENT",
            "1 (15 ounce) container ricotta cheese ADVERTISEMENT",
            "1 pound firm tofu ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped spinach - thawed, drained and squeezed dry ADVERTISEMENT",
            "2 cups grated Parmesan cheese ADVERTISEMENT",
            "1 (28 ounce) jar pasta sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook lasagna noodles for 5 to 8 minutes, or until just slightly underdone; drain and rinse.\nIn a large mixing bowl, mix together grated cheese, ricotta cheese, tofu, frozen spinach, and 1 cup Parmesan cheese.\nLay out a noodle. Spread a layer of the cheese mixture on the noodle, then add a thin layer of sauce. Roll the noodle up, and place seam side down in a 13x9 pan. Repeat for other noodles. Top with remaining sauce and Parmesan cheese.\nBake in a preheated 350 degree F (175 degree C) oven for 30 min, or until hot and bubbly.\n",
        "picture_link": "/oIrU3Fo2vJ0Zli2cZC0MlE5fQryO/u"
    },
    {
        "title": "Dip For The Stars",
        "ingredients": [
            "1 cup unsalted butter ADVERTISEMENT",
            "3/4 pound feta cheese, crumbled ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, softened ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 shallot, minced ADVERTISEMENT",
            "3 tablespoons dry vermouth ADVERTISEMENT",
            "ground white pepper, to taste ADVERTISEMENT",
            "1/2 cup pine nuts, toasted ADVERTISEMENT",
            "1 cup chopped sun-dried tomatoes ADVERTISEMENT",
            "3/4 cup pesto sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a food processor, combine the butter, feta cheese, cream cheese, garlic, shallot, vermouth, and white pepper. Process until smooth.\nOil a medium bowl, or gelatin mold, and line with plastic wrap for easy removal. Layer the dip into the mold as follows: Sun-dried tomatoes, pine nuts, pesto, cheese mixture. Repeat. Pat down into the mold, and refrigerate for at least one hour.\nTurn the dip out onto a serving plate, and remove plastic wrap. Serve with crackers.\n",
        "picture_link": "S8cHlFD6xg.WL.i2c9dFdXt/LbvR34K"
    },
    {
        "title": "Smothered Filet Mignon",
        "ingredients": [
            "4 (6 ounce) filet mignon steaks ADVERTISEMENT",
            "seasoned salt to taste ADVERTISEMENT",
            "cracked black pepper to taste ADVERTISEMENT",
            "1/4 cup extra virgin olive oil ADVERTISEMENT",
            "1/4 cup balsamic vinegar ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "2 teaspoons dried rosemary ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "2 cups onion slices ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "4 ounces blue cheese, crumbled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season steaks with seasoned salt and black pepper, and arrange in a single layer in a large baking dish. In a bowl, whisk together olive oil, balsamic vinegar, mustard, and rosemary. Pour mixture over filets, and turn to coat. Marinate for up to 30 minutes.\nWhile you are marinating the meat, melt the butter in a skillet over medium heat. Cook onion slices in butter until soft, then stir in sugar. Continue cooking until onions are caramelized. Set aside.\nPreheat grill for high heat on one side, and medium heat on the other side.\nLightly oil the grill grate. Place steaks on the hot side of the grill, and cook for 10 minutes, turning once. When the steaks are almost done, move to the cooler side of the grill. Top each filet with a quarter of the caramelized onions and blue cheese. Close the lid, and continue cooking until the cheese is melted.\n",
        "picture_link": "lDZm2AglOvonCpS7XJSGEH8rY3AZ6ka"
    },
    {
        "title": "Chocolate Cakes with Liquid Centers",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "4 (1 ounce) squares bittersweet chocolate ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "2 egg yolks ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "2 teaspoons all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C). Butter and flour four 4 ounce ramekins or custard cups.\nIn the top half of a double boiler set over simmering water, heat the butter and the chocolate until chocolate is almost completely melted.\nBeat the eggs, egg yolks and sugar together until light colored and thick.\nBeat together the melted chocolate and butter. While beating, slowly pour the chocolate mixture into the egg mixture, then quickly beat in the flour and mix until just combined.\nDivide the batter between the four molds and bake at 450 degrees F (230 degrees C) for 6 to 7 minutes. The centers of the cakes will still be quite soft. Invert cakes on serving plates and let sit for about 15 seconds, then unmold. Serve immediately with fresh whipped cream, if desired.\n",
        "picture_link": "Bf2Tma.UtGrQFPWDGU5e2GM8EQL0wlC"
    },
    {
        "title": "Banana Peanut Butter Bread",
        "ingredients": [
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/2 cup peanut butter ADVERTISEMENT",
            "2 bananas, mashed ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Lightly grease a 5x9 inch loaf pan.\nIn a large mixing bowl, cream together butter and sugar. Add eggs; beat well. Stir in peanut butter, bananas, flour and baking soda until blended. Fold in walnuts. Pour into prepared pan.\nBake at 325 degrees F (165 degrees C) for 70 minutes, or until a toothpick inserted into center of the loaf comes out clean. Remove to a wire rack to cool.\n",
        "picture_link": "6QrRENOQ9I1Owwqt/PQ6BmC3haMoBRG"
    },
    {
        "title": "Simple Beef Flavored Gravy",
        "ingredients": [
            "1 1/2 cups water ADVERTISEMENT",
            "3 teaspoons beef bouillon ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water, bouillon, flour, onion and butter in a small saucepan. Bring to a boil over medium heat and cook until thickened.\n",
        "picture_link": "0YqrDKnZZi/WgkFmmQWUAcHw/IxqNny"
    },
    {
        "title": "Kosher Salt Encrusted Prime Rib Roast",
        "ingredients": [
            "2 cups coarse kosher salt ADVERTISEMENT",
            "4 pounds prime rib roast ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "1 tablespoon seasoning salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 210 degrees F (100 degrees C).\nCover the bottom of a roasting pan with a layer of kosher salt. Place the roast, bone side down, on the salt. Season the meat with the ground black pepper and seasoning salt, then cover completely with kosher salt.\nRoast in preheated oven for 4 to 5 hours, or until the internal temperature of the meat reaches 145 degrees F (63 degrees C).\nRemove from oven and let rest for 30 minutes. This sets the juices and makes the roast easier to carve. (Note: Be sure to remove all the salt from the roast before serving.)\n",
        "picture_link": "wS3JXUV/rlqYthUmVFYR4huFRzUTs8y"
    },
    {
        "title": "RamJam Chicken",
        "ingredients": [
            "1/4 cup soy sauce ADVERTISEMENT",
            "3 tablespoons dry white wine ADVERTISEMENT",
            "2 tablespoons lemon juice ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "3/4 teaspoon dried Italian-style seasoning ADVERTISEMENT",
            "1 teaspoon grated fresh ginger root ADVERTISEMENT",
            "1 clove garlic, crushed ADVERTISEMENT",
            "1/4 teaspoon onion powder ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "8 skinless, boneless chicken breast halves - cut into strips ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large, resealable plastic bag, combine the soy sauce, wine, lemon juice, oil, Italian-style seasoning, ginger, garlic, onion powder, and ground black pepper. Place chicken in the bag. Seal, and let marinate in the refrigerator for at least 3 hours, or overnight.\nPreheat an outdoor grill for medium-high heat.\nThread the chicken onto skewers, and set aside. Pour marinade into a small saucepan, and bring to a boil over high heat.\nLightly oil the grill grate. Cook chicken on the prepared grill for approximately 8 minutes per side, basting with the sauce several times. Chicken is done when juices run clear.\n",
        "picture_link": "bn3MzmFvLbB7e6.tZsf19moOxhqe2ae"
    },
    {
        "title": "Capers and Halibut",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 (8 ounce) steaks halibut ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "1 teaspoon chopped garlic ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "3 tablespoons capers, with liquid ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large skillet over medium-high heat. Fry the halibut steaks on all sides until nicely browned. Remove from pan, and set aside.\nPour the wine into the pan, and use a spatula to scrape any browned bits from the bottom. Let the wine reduce to almost nothing, then stir in the garlic, butter and capers. Season with salt and pepper to taste. Let the sauce simmer for a minute to blend the flavors.\nReturn the steaks to the pan, and coat them with sauce. Cook until fish flakes easily with a fork. Serve fish immediately with the sauce from the pan poured over it.\n",
        "picture_link": "i/VJsOFHPGrIPkHVoeF2CzVlF.cX5FG"
    },
    {
        "title": "Spiced Slow Cooker Applesauce",
        "ingredients": [
            "8 apples - peeled, cored, and thinly sliced ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "3/4 cup packed brown sugar ADVERTISEMENT",
            "1/2 teaspoon pumpkin pie spice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the apples and water in a slow cooker; cook on Low for 6 to 8 hours. Stir in the brown sugar and pumpkin pie spice; continue cooking another 30 minutes.\n",
        "picture_link": ".6pE6hHvMsr54U6LSUQbGlHYVDBw4TS"
    },
    {
        "title": "Chinese Napa Cabbage Salad",
        "ingredients": [
            "1 (3 ounce) package chicken flavored ramen noodles ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1/2 cup sesame seeds, toasted ADVERTISEMENT",
            "1/2 cup blanched slivered almonds ADVERTISEMENT",
            "1 large head napa cabbage, shredded ADVERTISEMENT",
            "6 green onions, chopped ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1/4 cup rice wine vinegar ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "1 tablespoon sesame oil ADVERTISEMENT",
            "1/8 cup white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Crush noodles, place them in a medium skillet and brown in butter over medium heat. Add almonds and sesame seeds. Stir often to prevent burning. Add seasoning mix from noodles and cool. Toss in a large bowl with cabbage and onions.\nPrepare the dressing by whisking together the vegetable oil, rice vinegar, soy sauce, sesame oil and sugar. Pour over salad, toss and serve.\n",
        "picture_link": "RxKWnU0AmpuaFRE/6B01XbuRsYQ1I2K"
    },
    {
        "title": "Italian Grilled Cheese Sandwiches",
        "ingredients": [
            "1/4 cup unsalted butter ADVERTISEMENT",
            "1/8 teaspoon garlic powder (optional) ADVERTISEMENT",
            "12 slices white bread ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 (8 ounce) package shredded mozzarella cheese ADVERTISEMENT",
            "1 (24 ounce) jar vodka marinara sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat your oven's broiler.\nPlace 6 slices of bread onto a baking sheet. Spread a small handful of the mozzarella cheese over each slice. Top with the remaining 6 slices of bread. Mix together the butter and garlic powder, brush some over the tops of the sandwiches, or spread with the back of a tablespoon. Sprinkle with dried oregano.\nPlace baking sheet under the broiler for 2 to 3 minutes, until golden brown. Remove pan from oven, flip sandwiches, and brush the other sides with butter, and sprinkle with oregano. Return to the broiler, and cook until golden, about 2 minutes.\nCut sandwiches in half diagonally, and serve immediately with vodka sauce on the side for dipping.\n",
        "picture_link": ".7uue7SkLPDbFSGTAekUp5P4ow/yaia"
    },
    {
        "title": "American Chop Suey II",
        "ingredients": [
            "1 (16 ounce) package uncooked elbow macaroni ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed tomato soup ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook macaroni according to package directions.\nMeanwhile, in a separate large skillet over medium high heat, saute the ground beef and the onion for 5 to 10 minutes, or until meat is browned and crumbly. Drain thoroughly and leave the meat and onion in the skillet. Pour the two cans of tomato soup into the skillet and stir well to combine.\nWhen noodles are done, drain thoroughly and return noodles to the pot. Add the hamburger mixture from the skillet to the pot. Mix well and season with salt and pepper to taste.\n",
        "picture_link": "WwN.MkoPWM8FH5gdjRdFrD6xLMQKbyy"
    },
    {
        "title": "Chicken and Sausage with Bowties",
        "ingredients": [
            "1 (16 ounce) package uncooked farfalle pasta ADVERTISEMENT",
            "2 skinless, boneless chicken breasts ADVERTISEMENT",
            "1 pound hot Italian turkey sausage, casings removed ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 cloves garlic, sliced ADVERTISEMENT",
            "1 (14.5 ounce) can crushed tomatoes ADVERTISEMENT",
            "1/2 cup red wine ADVERTISEMENT",
            "2 tablespoons chopped fresh basil ADVERTISEMENT",
            "1 teaspoon dried rosemary ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nWash chicken breasts and cut into large bite-size pieces. Cut sausages into large pieces. In a large, deep skillet over medium low heat, combine oil and garlic; and cook just enough to flavor the oil. Remove garlic from oil.\nAdd chicken and sausage to skillet and brown both lightly until they are opaque. Add the tomatoes and the wine. Bring to a boil and let simmer for 20 minutes. Season sauce mixture with basil, rosemary and salt and pepper to taste. Add cooked, drained pasta to the skillet mixture. Toss and serve.\n",
        "picture_link": "EHFKj.Pu7Ilgr02HI5NyMt1pgfpRbxK"
    },
    {
        "title": "Egg Drop Soup (Better than Restaurant Quality!)",
        "ingredients": [
            "1 cup chicken broth ADVERTISEMENT",
            "1/4 teaspoon soy sauce ADVERTISEMENT",
            "1/4 teaspoon sesame oil ADVERTISEMENT",
            "1 teaspoon cornstarch (optional) ADVERTISEMENT",
            "2 teaspoons water (optional) ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 drop yellow food coloring (optional) ADVERTISEMENT",
            "1 teaspoon chopped fresh chives ADVERTISEMENT",
            "1/8 teaspoon salt (optional) ADVERTISEMENT",
            "1/2 teaspoon ground white pepper (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small saucepan, combine the chicken broth, soy sauce and sesame oil. Bring to a boil. Stir together the cornstarch and water to dissolve cornstarch; pour into the boiling broth. Stir gently while you pour in the egg and yellow food coloring if using. Season with chives, salt and pepper before serving.\n",
        "picture_link": "t5Up22VNMdpcICfe/Vy2j6U46Nqilce"
    }
]