[
    {
        "title": "Hazelnut French Toast",
        "ingredients": [
            "1 cup beaten eggs ADVERTISEMENT",
            "1 cup half-and-half ADVERTISEMENT",
            "2 tablespoons hazelnut liqueur (such as Frangelico®) ADVERTISEMENT",
            "2 tablespoons butter, divided, or more as needed ADVERTISEMENT",
            "12 pieces brioche (about 1 1/2-inch thick) ADVERTISEMENT",
            "1 cup toasted hazelnuts, chopped ADVERTISEMENT",
            "1/2 cup maple syrup, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk eggs, half-and-half, and hazelnut liqueur together in a shallow bowl.\nMelt 1 teaspoon butter in a large skillet, tilting the skillet to assure complete coverage.\nDip 2 slices brioche in the egg mixture, moistening both sides.\nCook brioche in the hot skillet until golden brown, 2 to 4 minutes per side. Repeat process until all bread is cooked.\nCut each slice of brioche into half on a bias. Sprinkle hazelnuts over the halves and top with maple syrup.\n",
        "picture_link": "qzYIxGA15HVmSzGPO4PzA2/ZOMq4kE2"
    },
    {
        "title": "Pick-Me-Up Egg Drop Soup",
        "ingredients": [
            "1 (16 ounce) can chicken broth ADVERTISEMENT",
            "1/2 teaspoon soy sauce ADVERTISEMENT",
            "1/2 teaspoon sesame oil, or to taste ADVERTISEMENT",
            "1/4 cup finely broken udon noodles ADVERTISEMENT",
            "2 teaspoons water ADVERTISEMENT",
            "1 teaspoon cornstarch (optional) ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "sea salt to taste ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine chicken broth, soy sauce, and sesame oil together in a small saucepan; bring to a boil. Stir udon pieces into broth and cook, stirring occasionally, until cooked through but are still firm to the bite, 10 to 12 minutes.\nWhisk water and cornstarch together in a bowl. Whisk cornstarch mixture into broth mixture until smooth and thickened slightly. Gradually pour in eggs, stirring gently and constantly, until eggs are wispy and cooked through, 2 to 3 minutes. Season with sea salt and black pepper.\n",
        "picture_link": "ozS7YWAPmnRD5hqphPuPU50PVNYSPcu"
    },
    {
        "title": "Grilled Buffalo Chicken Pizza",
        "ingredients": [
            "1 large skinless, boneless chicken breast half ADVERTISEMENT",
            "2 pinches Montreal steak seasoning, or to taste ADVERTISEMENT",
            "1/3 cup hot pepper sauce (such as Frank's RedHot®) ADVERTISEMENT",
            "2 tablespoons hot pepper sauce (such as Frank's RedHot®) ADVERTISEMENT",
            "2 pieces tandoori naan bread ADVERTISEMENT",
            "1 teaspoon olive oil, or as needed ADVERTISEMENT",
            "1/2 cup blue cheese dressing (such as Marie's®), or to taste ADVERTISEMENT",
            "2 tablespoons diced red onion ADVERTISEMENT",
            "8 ounces shredded Cheddar cheese, or to taste ADVERTISEMENT",
            "1/2 cup shredded iceberg lettuce ADVERTISEMENT",
            "1 roma (plum) tomato, seeded and chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season chicken breast with Montreal steak seasoning. Place chicken in a resealable plastic bag and pour 1/3 cup hot pepper sauce into the bag. Seal bag and rub hot sauce into chicken. Transfer bag to the refrigerator and marinate for 12 hours or overnight.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate.\nRemove chicken from the bag and discard marinade. Cook the chicken on the preheated grill until no longer pink in the center and the juices run clear, 5 to 7 minutes per side. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Transfer chicken to a cutting board to rest for 5 to 10 minutes.\nDice cooled chicken into bite-size pieces. Toss chicken and remaining 2 tablespoons hot sauce together in a bowl.\nBrush each naan with olive oil; cook on the grill until golden and toasted on one side, 3 to 5 minutes. Reduce heat to medium-low and transfer naan pieces, toasted-side up, to a baking sheet. Spread blue cheese dressing on the toasted side of each naan. Top each with diced chicken and red onion. Sprinkle Cheddar cheese over the top.\nReturn naan to grill and cook until cheese is melted and bottom is toasted and golden, 5 to 10 minutes more. Remove from grill, slice into pieces and top with lettuce and tomato.\n",
        "picture_link": "uVNwrdGLJIswLxcDo0W9zkDkXR/SmNm"
    },
    {
        "title": "Holiday Pomegranate Mignonette",
        "ingredients": [
            "3 tablespoons champagne vinegar ADVERTISEMENT",
            "1 tablespoon pomegranate juice ADVERTISEMENT",
            "1/2 shallot, minced ADVERTISEMENT",
            "1/2 teaspoon fresh cracked pepper ADVERTISEMENT",
            "1 pinch white sugar ADVERTISEMENT",
            "1 tablespoon pomegranate seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk vinegar, pomegranate juice, shallot, pepper, and white sugar together in a bowl until sugar dissolves. Add pomegranate seeds, cover the bowl with plastic wrap, and refrigerate until chilled, about 1 hour.\n",
        "picture_link": "ydMQuYnW3nbMGfbF3IiKf82NoTxLuZO"
    },
    {
        "title": "Better-Than-Grilled Cheese Tomato Soup",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 onion, finely chopped ADVERTISEMENT",
            "1 carrot, grated ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 teaspoon kosher salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes ADVERTISEMENT",
            "1 (28 ounce) can fire-roasted crushed tomatoes ADVERTISEMENT",
            "2 cups tomato juice ADVERTISEMENT",
            "1 (15 ounce) can fire-roasted diced tomatoes, partially drained ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1/2 cup heavy whipping cream ADVERTISEMENT",
            "1 bunch fresh basil, roughly chopped, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat butter and olive oil together in a large pot over medium heat; saute onion and carrot until softened, 4 to 6 minutes. Add garlic, salt, pepper, and red pepper flakes; cook and stir until fragrant, about 2 minutes.\nStir crushed tomatoes, tomato juice, and diced tomatoes into onion mixture; bring to a simmer. Reduce heat, stir sugar into tomato mixture, and simmer until heated through, about 10 minutes. Add cream and simmer until heated through, 1 to 2 minutes. Add basil to soup and cook until wilted, about 3 minutes. Serve chunky or puree with an immersion blender.\n",
        "picture_link": "7lBHY8WY3/Uwo2hlkZGWGTg.onL4Rqq"
    },
    {
        "title": "Portabella and Artichoke Stuffed Chicken",
        "ingredients": [
            "Infused Oil: ADVERTISEMENT",
            "1 cup extra-virgin olive oil ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1/2 teaspoon ground thyme ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "5 cups ricotta cheese ADVERTISEMENT",
            "1 cup crumbled feta cheese ADVERTISEMENT",
            "6 eggs, beaten ADVERTISEMENT",
            "3 cups sliced baby portabella mushrooms ADVERTISEMENT",
            "2 (6.5 ounce) jars marinated artichoke hearts, drained and chopped ADVERTISEMENT",
            "20 cloves garlic, minced ADVERTISEMENT",
            "3 tablespoons ground black pepper ADVERTISEMENT",
            "4 teaspoons onion powder ADVERTISEMENT",
            "4 teaspoons garlic powder ADVERTISEMENT",
            "1 tablespoon dried basil ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "1 tablespoon dried thyme ADVERTISEMENT",
            "40 skinless, boneless chicken breast halves ADVERTISEMENT",
            "2 cups grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place 1 teaspoon salt, 1 teaspoon black pepper, paprika, and 1/2 teaspoon thyme together in a small bowl or bottle; pour olive oil into bowl. Cover the bowl tightly and refrigerate until oil is infused, at least 1 hour.\nPreheat oven to 350 degrees F (175 degrees C). Lightly grease enough baking dishes to fit all of the stuffed chicken breasts in a single layer.\nStir ricotta cheese, feta cheese, eggs, mushrooms, artichoke hearts, garlic, black pepper, onion powder, garlic powder, basil, cumin, and 1 tablespoon thyme together in a large bowl.\nPlace chicken breasts on a flat work surface. Use a paring or boning knife to cut from one side of a chicken breast through the middle of the breast to within 1/2-inch of the other side, creating a deep pocket. Spoon mushroom and artichoke mixture into chicken until pocket is full; use toothpick to close and secure the pocket. Repeat with remaining chicken breasts and filling. Place stuffed chicken in prepared baking dishes.\nBrush each chicken breast with about 1 teaspoon infused olive oil and sprinkle Parmesan cheese over the top.\nBake chicken in the preheated oven until no longer pink in the center and the juices run clear, about 30 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Cool slightly before serving, about 5 minutes.\n",
        "picture_link": "7Rfivx4MArrdfrQry8GH4ds.JqbYUni"
    },
    {
        "title": "Fabienne's Black Olive and Curry Deviled Eggs",
        "ingredients": [
            "6 eggs ADVERTISEMENT",
            "3 tablespoons mayonnaise ADVERTISEMENT",
            "6 pitted Kalamata olives, finely chopped ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1/2 teaspoon Madras curry powder ADVERTISEMENT",
            "1/2 teaspoon onion powder ADVERTISEMENT",
            "1/2 teaspoon red wine vinegar ADVERTISEMENT",
            "1 garlic clove, crushed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place eggs in a saucepan; cover with water. Bring to a boil, remove from heat, and let eggs stand in hot water for 15 minutes. Remove eggs from hot water, cool under cold running water, and peel.\nCut each egg in half lengthwise; place egg yolks in a bowl. Mash yolks with a fork; stir in mayonnaise, olives, mustard, lemon juice, curry powder, onion powder, vinegar, and garlic.\nPlace egg whites cut-side up on a serving platter. Spoon yolk mixture into egg white halves.\n",
        "picture_link": "lfbPCUugUhiSre34V8YOgEJvHy8MRR2"
    },
    {
        "title": "Mango Ceviche",
        "ingredients": [
            "3 mangos - peeled, seeded, and diced ADVERTISEMENT",
            "1 yellow onion, diced ADVERTISEMENT",
            "1 green bell pepper, diced ADVERTISEMENT",
            "1 red bell pepper, diced ADVERTISEMENT",
            "3 jalapeno peppers, minced ADVERTISEMENT",
            "1/2 bunch fresh cilantro, minced ADVERTISEMENT",
            "2 limes, juiced (with pulp) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix mangos, onion, green bell pepper, red bell pepper, jalapeno peppers, cilantro, and lime juice together in a bowl.\nCover bowl with plastic wrap and refrigerate until the ceviche is completely chilled, at least 1 hour.\n",
        "picture_link": "2tzi2Z.3CVORNo1R8XkvyqMZ4JNzM4C"
    },
    {
        "title": "Cajun Boudin Pizza",
        "ingredients": [
            "1 link boudin sausage ADVERTISEMENT",
            "1 tandoori naan bread ADVERTISEMENT",
            "1/4 cup prepared marinara sauce, or as needed ADVERTISEMENT",
            "1 cup grated mozzarella cheese ADVERTISEMENT",
            "1/4 onion, sliced, or to taste ADVERTISEMENT",
            "1/4 green bell pepper, sliced, or to taste ADVERTISEMENT",
            "1 pinch Cajun seasoning, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Set oven rack about 6 inches from the heat source and preheat the oven's broiler.\nPlace sausage in a baking dish and cook, rotating every 5 minutes, until no longer pink in the center, about 20 minutes. An instant-read thermometer inserted into the center should read 160 degrees F (70 degrees C). Cool to room temperature and slice. Reduce oven temperature to 350 degrees F (175 degrees C).\nPlace naan bread on a baking sheet; spread marinara sauce over naan and top with mozzarella cheese. Layer sliced sausage on top of cheese and spread onion and bell pepper slices over the sausage. Sprinkle Cajun seasoning over the top.\nBake in the oven until cheese is melted and toppings are hot, about 10 minutes. Let rest for 5 minutes before slicing.\n",
        "picture_link": "l/Z5wto7id/N2heH5dcrCQ0Q0mY.6o6"
    },
    {
        "title": "Risotto all' Amanda",
        "ingredients": [
            "2 cups vegetable broth ADVERTISEMENT",
            "1 pinch saffron ADVERTISEMENT",
            "1 ounce dried porcini mushrooms ADVERTISEMENT",
            "1/4 cup olive oil, divided ADVERTISEMENT",
            "1 red onion, chopped ADVERTISEMENT",
            "1 cup Arborio rice ADVERTISEMENT",
            "3 tablespoons chopped garlic ADVERTISEMENT",
            "1/3 cup white wine ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "8 ounces uncooked medium shrimp, peeled and deveined ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir vegetable broth and saffron together in a bowl.\nBring a pot of water to a boil; add dried porcini mushrooms and cook until mushrooms are reconstituted, about 1 1/2 minutes. Drain and finely chop the mushrooms.\nHeat 2 tablespoons olive oil in a pressure cooker over medium-high heat. Saute onion in hot oil until onion is caramelized, about 10 minutes. Add rice; saute until rice is translucent, about 2 minutes more. Add garlic and 1 tablespoon olive oil to onion and saute until fragrant, 1 to 2 minutes. Transfer rice mixture to a stainless steel bowl that can fit inside the pressure cooker. Stir vegetable broth with saffron, mushrooms, wine, and salt into rice mixture and toss to combine. Cover the bowl with aluminum foil.\nPour 2 cups of water into the bottom of the pressure cooker and place the pressure cooker's metal rack in the base for steaming. Place bowl with rice mixture on top of the metal rack in the pressure cooker.\nCover the pressure cooker with the lid, lock the lid, bring the cooker to high pressure, and cook under pressure for 6 minutes. Release pressure from the pot according to the manufacturer's instructions. Remove bowl with risotto from pressure cooker.\nHeat remaining 1 tablespoon oil in a skillet over high heat. Saute shrimp in hot oil until they are bright pink on the outside and the meat is no longer transparent in the center, 2 to 3 minutes. Stir shrimp into risotto.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Shrimp and Bacon Deviled Eggs",
        "ingredients": [
            "8 eggs ADVERTISEMENT",
            "3 slices bacon ADVERTISEMENT",
            "1/4 cup instant potato flakes ADVERTISEMENT",
            "1/4 cup fat-free mayonnaise ADVERTISEMENT",
            "1 tablespoon chopped fresh chives ADVERTISEMENT",
            "2 teaspoons Dijon mustard ADVERTISEMENT",
            "1/2 teaspoon seafood seasoning (such as Old Bay®) ADVERTISEMENT",
            "1/8 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1/8 teaspoon ground cayenne pepper ADVERTISEMENT",
            "6 ounces cooked shrimp - peeled, deveined, and chopped ADVERTISEMENT",
            "2 tablespoons chopped fresh parsley ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place eggs in a saucepan and cover with water. Bring to a boil, remove from heat, and let eggs stand in hot water for 15 minutes. Remove eggs from hot water, cool under cold running water, and peel.\nPlace bacon in a large skillet; cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon on paper towels; crumble bacon when cool enough to handle.\nCut each egg in half lengthwise; place half the egg yolks in a bowl, reserving remaining yolks for another use. Mash yolks with a fork; stir in potato flakes, mayonnaise, chives, Dijon mustard, seafood seasoning, black pepper, and red pepper until smooth. Stir shrimp, parsley, and cilantro into yolk mixture.\nArrange egg whites cut-side-up on a serving platter. Spoon about 1 rounded tablespoon yolk mixture into each egg white half; sprinkle with crumbled bacon.\n",
        "picture_link": "ztDSAwE/1bc60I1L7.fr.jk.okXDqL."
    },
    {
        "title": "Family Ties Chipotle Deviled Eggs and Bacon",
        "ingredients": [
            "3 cups water ADVERTISEMENT",
            "7 dried chipotle chiles, stemmed and seeded ADVERTISEMENT",
            "1/3 cup sliced onion ADVERTISEMENT",
            "5 tablespoons cider vinegar ADVERTISEMENT",
            "1/4 cup ketchup ADVERTISEMENT",
            "2 garlic cloves, crushed ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 cup heavy whipping cream (optional) ADVERTISEMENT",
            "12 eggs ADVERTISEMENT",
            "4 thick slices maple-cured bacon, cut into 1-inch pieces ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "2 tablespoons shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place water, chiles, onion, vinegar, ketchup, garlic, and salt in a saucepan; bring to a simmer, and cook, stirring occasionally, until reduced and very thick, about 1 hour.\nPour chile mixture into a blender no more than half full. Cover and hold lid down; pulse a few times before leaving on to blend until smooth. Stir cream into chipotle sauce; refrigerate until ready to use.\nPlace eggs in a saucepan; cover with water. Bring to a boil, remove from heat, and let eggs stand in hot water for 15 minutes. Remove eggs from hot water, cool under cold running water, and peel.\nPlace bacon in a large skillet; cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon on paper towels. Crumble half the bacon; reserve remaining bacon for garnish.\nCut each egg in half lengthwise; place egg yolks into a bowl. Mash egg yolks with a fork; stir in mayonnaise, crumbled bacon, and Cheddar cheese. Stir 1 tablespoon chipotle sauce into yolk mixture, or more to taste.\nPlace egg whites cut-side up on a serving plate. Spoon yolk mixture into egg white halves. Sprinkle remaining bacon over filling; drizzle with chipotle sauce.\n",
        "picture_link": "Uu4EiFMGOpKNLMLSiEa/6c2/M//6/Um"
    },
    {
        "title": "Little Green Eggs and Ham Devils",
        "ingredients": [
            "12 eggs ADVERTISEMENT",
            "6 slices bacon ADVERTISEMENT",
            "3 avocados - halved, pitted, and mashed ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 1/2 teaspoons cayenne pepper ADVERTISEMENT",
            "1/2 garlic clove, minced ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 1/2 teaspoons paprika ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place eggs in a saucepan; cover with water. Bring to a boil, remove from heat, and let eggs stand in hot water for 15 minutes. Remove eggs from hot water, cool under cold running water, and peel.\nPlace bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels.\nCut each egg in half lengthwise. Scoop egg yolks out; place 3 to 6 egg yolks in a bowl, reserving remaining egg yolks for another use.\nMash the 3 to 6 egg yolks with a fork; stir in avocado, lemon juice, cayenne pepper, and garlic. Season with salt and pepper.\nArrange egg whites cut-side-up on a serving platter. Spoon avocado mixture into egg whites.\nChop bacon into 1/2-inch pieces; place bacon and paprika in a small bowl and toss to coat bacon. Top deviled eggs with bacon pieces.\n",
        "picture_link": "PUd6vidjig3lFBhHwUgKR5VwPySh2tW"
    },
    {
        "title": "Spicy Grilled Stuffed Chicken Breast Sandwich",
        "ingredients": [
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "8 thin slices Monterey Jack cheese ADVERTISEMENT",
            "1 avocado - peeled, pitted, and sliced ADVERTISEMENT",
            "1 jalapeno pepper, seeded and sliced ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1/2 lime, juiced ADVERTISEMENT",
            "1 tablespoon spicy mesquite-flavored seasoning ADVERTISEMENT",
            "1 pinch sea salt ADVERTISEMENT",
            "1 cup chipotle barbeque sauce ADVERTISEMENT",
            "4 Kaiser rolls, split ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Slice a small pocket into each chicken breast with a sharp knife. Layer cheese slices, avocado slices, and sliced jalapeno inside the chicken pockets. Pinch chicken breasts closed and secure with toothpicks or skewers; place chicken into a casserole dish.\nWhisk olive oil, lime juice, mesquite seasoning, and salt together in a bowl; drizzle half of the mixture over chicken breasts. Turn chicken breasts over and drizzle with remaining olive oil mixture; cover and refrigerate for 30 minutes.\nPreheat an outdoor grill for high heat, and lightly oil the grate.\nPlace chicken breasts on preheated grill and cook for 7 minutes; turn chicken over and brush with BBQ sauce on the cooked side. Continue grilling for about 5 minutes; turn chicken over and apply BBQ sauce to the second cooked side. Cook chicken until no longer pink in the center and the juices run clear, about 2 minutes more. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nServe each chicken breast on a Kaiser roll.\n",
        "picture_link": "VwvhJCWh9unWWe1zw98ZoUADx4bruyS"
    },
    {
        "title": "Cherry Ice Cream",
        "ingredients": [
            "1 1/2 cups pitted cherries ADVERTISEMENT",
            "1 3/4 cups heavy whipping cream, divided ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "2 tablespoons amaretto liqueur (optional) ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1 teaspoon cornstarch ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat cherries, 1 cup heavy cream, milk, sugar, and salt in a saucepan over medium heat until mixture is steamy, 5 to 7 minutes. Reduce heat to medium-low and continue cooking for 15 minutes more.\nPour cherry mixture into a blender no more than half full. Cover and hold lid down; pulse a few times before leaving on to blend. Puree in batches until smooth. Transfer blended mixture to a large bowl and stir in remaining 3/4 cup heavy cream.\nChill in the refrigerator until completely cold, about 2 hours; stir in amaretto liqueur, lemon juice, and cornstarch. Pour into the container of an ice cream maker and freeze according to the manufacturer's instructions.\n",
        "picture_link": "kdqfMzYYkxapk99..SDPnq7lForaWn2"
    },
    {
        "title": "Nuclear Chocolate Ice Cream",
        "ingredients": [
            "2 cups milk ADVERTISEMENT",
            "2/3 cup white sugar ADVERTISEMENT",
            "3 tablespoons unsweetened cocoa powder ADVERTISEMENT",
            "1 teaspoon instant espresso powder ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "4 egg yolks ADVERTISEMENT",
            "3 1/2 ounces dark chocolate ADVERTISEMENT",
            "2 cups heavy whipping cream ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat milk, sugar, cocoa powder, espresso powder, and salt in a saucepan over medium heat, stirring often, until milk is barely simmering.\nBeat egg yolks in a bowl; gradually stir in about 1/2 cup hot milk mixture. Beat until smooth. Transfer egg yolk mixture back to the saucepan and continue cooking and stirring until thickened, about 5 minutes.\nMeanwhile, melt dark chocolate in a microwave-safe bowl in 30-second intervals, stirring after each melting, for 1 to 3 minutes.\nRemove saucepan from heat and stir melted chocolate into milk-egg mixture; transfer mixture to a large bowl, cover, and refrigerate until well-chilled, 4 hours to overnight.\nStir cream and vanilla extract into chilled chocolate mixture and pour into an ice cream maker. Freeze according to manufacturer's directions until it reaches \"soft-serve\" consistency. Transfer ice cream to a lidded container; cover surface with plastic wrap and seal. For best results, ice cream should be placed in the freezer at least 2 hours or overnight.\n",
        "picture_link": "ANCLjmXZcqLIDIsG6hxokQ1PegYDXVe"
    },
    {
        "title": "Easy Sweet Cream Ice Cream",
        "ingredients": [
            "2 cups whole milk ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 1/2 cups heavy whipping cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir milk and sugar in a large bowl until sugar is dissolved. Slowly stir in heavy cream.\nPour milk mixture into an ice cream maker and freeze according to the manufacturer's instructions.\n",
        "picture_link": "fXYwc0V3QPE16.2bVALoXNbGoQ17aG2"
    },
    {
        "title": "Drunk Turkey Bites",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 (16 ounce) packages turkey kielbasa, cut into bite-size pieces ADVERTISEMENT",
            "1/2 cup diced onion ADVERTISEMENT",
            "1 cup lager-style beer ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1 tablespoon Dijon mustard, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a skillet over medium heat. Cook and stir kielbasa and onion in hot oil until the onion begins to soften, about 5 minutes.\nGently whisk beer, brown sugar, and mustard together in a bowl; pour into the skillet.\nBring the mixture to a boil and cook until the volume of the liquid reduces by half, about 15 minutes. . Season with salt and pepper.\n",
        "picture_link": "Z1Ci064wkC1j1JcnXtAbuIuzxlQdKlG"
    },
    {
        "title": "Mashed Potato Stuffed Cannoli",
        "ingredients": [
            "For the Parmesan cannoli: ADVERTISEMENT",
            "2 cups shredded Parmesan cheese ADVERTISEMENT",
            "For the filling: ADVERTISEMENT",
            "1 (4 ounce) package Idahoan® Roasted Garlic Flavored Mashed Potatoes, prepared ADVERTISEMENT",
            "2 tablespoons green onion, washed and chopped fine ADVERTISEMENT",
            "1 tablespoon Italian parsley, chopped ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "For the Parmesan cannoli: In a non stick skillet on medium high heat, scatter shredded Parmesan in a 3 to 4 inch diameter, keeping the cheese loose to create a lacy effect.\nCook until golden brown on one side and gently flip over to brown on the other side - about 1-2 minutes per side.\nUsing a wooden spoon handle, quickly and carefully wrap the each warm cannoli around the handle to form a cylinder. Gently slide off and set aside. Repeat to make approximately 25 cannoli.\nFor the filling: Stir the green onion and parsley into the prepared Roasted Garlic Mashed Potatoes. Cover and cool slightly.\nWhen potatoes are cool enough to handle, but still warm, put them in a pastry bag and carefully fill the Parmesan cannoli tubes with the mashed potatoes.\nServe immediately.\n",
        "picture_link": "h7yYNaOBqzFeyMjC2nLl9wNnKJ3ZQ62"
    },
    {
        "title": "Meme's Potato Kugel",
        "ingredients": [
            "8 yellow potatoes, peeled and cut into eighths ADVERTISEMENT",
            "1 1/4 teaspoons salt, divided ADVERTISEMENT",
            "1 1/2 teaspoons garlic powder ADVERTISEMENT",
            "2 teaspoons vegetable oil, or as needed ADVERTISEMENT",
            "1 1/2 large onions, finely chopped ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "4 eggs, beaten ADVERTISEMENT",
            "2 tablespoons matzo meal ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes and 1 teaspoon salt into a large pot and cover with water; bring to a boil. Reduce heat to medium, stir in garlic powder, and simmer until tender, about 15 minutes. Drain; mash potatoes until no lumps remain.\nHeat oil in a skillet over medium-high heat. Cook and stir onion in hot oil until golden and tender, 5 to 10 minutes.\nStir onions, 1/4 teaspoon salt, and pepper into mashed potatoes. Cool.\nPreheat oven to 350 degrees F (175 degrees C). Grease a 9x9-inch baking dish.\nStir 4 eggs, matzo meal, and a pinch of salt into potato mixture. Spread potato mixture into prepared baking dish and brush top with beaten egg.\nBake in the preheated oven until a knife inserted into the center of the kugel comes out clean, about 30 minutes.\n",
        "picture_link": "OGbMGMWfx6ETWKj3b2.VyA9xkhjIMCK"
    },
    {
        "title": "Not-Too-Sweet Sweet Potato Soup",
        "ingredients": [
            "4 cups low-sodium chicken broth ADVERTISEMENT",
            "1 (15 ounce) can chickpeas, drained and rinsed ADVERTISEMENT",
            "1 pound sweet potatoes, or more to taste, cut into cubes ADVERTISEMENT",
            "6 ounces butternut squash cubes, or more to taste ADVERTISEMENT",
            "1/4 cup thinly sliced yellow onion ADVERTISEMENT",
            "2 tablespoons grated fresh ginger ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1 pinch cayenne pepper, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir chicken broth, chickpeas, sweet potatoes, butternut squash, onion, ginger, garlic, nutmeg, and cayenne pepper together in a large pot. Bring to boil and cook over medium-high heat for 20 minutes. Reduce heat to medium low and cook until squash and potatoes are soft and soup flavors have blended, about 3 hours.\nBlend soup using an immersion blender, or in batches in a food processor, until smooth.\n",
        "picture_link": "SMQL5lZ4vaXXlKLEMtWHPu.0JPq5f3W"
    },
    {
        "title": "Rustic Grain Cereal",
        "ingredients": [
            "1/2 cup water ADVERTISEMENT",
            "1/3 cup wheat berries ADVERTISEMENT",
            "1 teaspoon butter ADVERTISEMENT",
            "1 cup steel-cut oats ADVERTISEMENT",
            "1/3 cup chopped pecans ADVERTISEMENT",
            "1/3 cup slivered almonds ADVERTISEMENT",
            "3 cups boiling water ADVERTISEMENT",
            "1 cup chopped dried apples ADVERTISEMENT",
            "1/3 cup white sugar, or to taste ADVERTISEMENT",
            "1 1/2 tablespoons ground cinnamon ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine 1/2 cup water and wheat berries in a small saucepan; bring to a boil. Cover saucepan, remove from heat, and set aside for wheat berries to soak, about 10 minutes.\nMelt butter in a 2-quart saucepan over low heat; cook and stir oats, pecans, and almonds in melted butter until golden and fragrant, about 5 minutes. Carefully pour boiling water into nut mixture; add wheat berries and dried apples. Cover saucepan and cook over low heat, without stirring, until wheat berries are tender, about 20 minutes; stir in sugar, cinnamon, and salt.\n",
        "picture_link": "Q4lKD.ADStlISyYl.CAcEqC28tmCGAK"
    },
    {
        "title": "Mostly Oats Granola",
        "ingredients": [
            "6 cups rolled oats ADVERTISEMENT",
            "1 cup shredded coconut ADVERTISEMENT",
            "1 cup wheat germ ADVERTISEMENT",
            "3/4 cup peanuts ADVERTISEMENT",
            "1/2 cup raw sunflower seeds ADVERTISEMENT",
            "1/2 cup sesame seeds ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "1 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nMix oats, coconut, wheat germ, peanuts, sunflower seeds, sesame seeds, cinnamon, and ginger together in a bowl. Whisk honey, oil, and water together in a separate bowl. Drizzle honey mixture over oat mixture; toss to coat. Spread mixture in a thin layer on baking sheets.\nBake in the preheated oven for 10 minutes. Stir and bake another 5 minutes. Stir again and bake until granola is slightly browned, 3 to 5 more minutes. Cool granola and stir in raisins. Store in airtight containers.\n",
        "picture_link": "M/Ak.9TwSRohI/EfQI6LuoBTVBkMnce"
    },
    {
        "title": "Broccoli Cheddar Dip",
        "ingredients": [
            "1 (16 ounce) container sour cream ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped broccoli, thawed and water squeezed out ADVERTISEMENT",
            "1 (1 ounce) package ranch dressing mix ADVERTISEMENT",
            "1 cup shredded Cheddar cheese, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nMix sour cream, broccoli, ranch dressing mix, and 3/4 cup Cheddar cheese in a bowl; transfer to an 8x8-inch baking dish. Sprinkle remaining 1/4 cup Cheddar cheese over mixture.\nBake in the preheated oven until dip is bubbling and cheese is melted, about 30 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Baby Red Mashed Potatoes and Peas with Spring Meatloaf",
        "ingredients": [
            "Idahoan Baby Reds with Peas: ADVERTISEMENT",
            "1 (4 ounce) package Idahoan® Baby Reds Flavored Mashed Potatoes ADVERTISEMENT",
            "1/4 cup half and half ADVERTISEMENT",
            "1 tablespoon butter, softened ADVERTISEMENT",
            "Scallions, green parts, finely chopped ADVERTISEMENT",
            "1 cup fresh peas or frozen peas, thawed ADVERTISEMENT",
            "Spring Meatloaf: ADVERTISEMENT",
            "1 1/2 pounds ground lamb or ground beef ADVERTISEMENT",
            "Salt and pepper ADVERTISEMENT",
            "2 slices white bread, crusts trimmed ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 bunch scallions, white parts finely chopped ADVERTISEMENT",
            "1/4 cup fresh parsley, finely chopped ADVERTISEMENT",
            "1/4 cup fresh mint, finely chopped ADVERTISEMENT",
            "2 cloves garlic, finely chopped ADVERTISEMENT",
            "1 egg, lightly beaten ADVERTISEMENT",
            "1 tablespoon lemon zest ADVERTISEMENT",
            "Extra virgin olive oil for drizzling ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Position a rack in the middle of the oven and preheat to 400 degrees F. Line a baking sheet with parchment paper.\nPlace the meat in a large bowl and season liberally with salt and pepper. In a small bowl, soak the bread in the milk, then crumble the bread into the meat. Mix the scallion whites, parsley, mint, garlic, egg, lemon zest and a healthy drizzle of olive oil into the meat. Using your hands, form 4 mini loaves about 1 1/2-inch thick or shape into one large loaf.\nPlace the meatloaf on the prepared baking sheet and roast in the oven until cooked through, about 15-18 minutes. Prepare Idahoan Baby Reds following package instructions. Stir in half and half, butter, scallions and peas. Serve hot with meatloaf.\n",
        "picture_link": "ShBXJ.7S4MszubcXj4bpINO1nZ1f4wa"
    },
    {
        "title": "Babcha's Meat-Filled Varenyky (Perogies)",
        "ingredients": [
            "Filling: ADVERTISEMENT",
            "12 potatoes ADVERTISEMENT",
            "2 pounds lean ground beef ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1 large onion, minced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 pinch salt and ground black pepper ADVERTISEMENT",
            "Varenyky Dough: ADVERTISEMENT",
            "8 cups all-purpose flour ADVERTISEMENT",
            "4 teaspoons salt ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 tablespoon water, or as needed (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain.\nHeat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain in a sieve or colander and rinse off excess fat with hot water.\nMash potatoes with milk in a bowl until smooth; stir in onion, garlic, 1 pinch salt, and pepper. Mix ground beef into potato mixture until filling is evenly combined.\nWhisk flour and 4 teaspoons salt together in a deep bowl; stir in 1 cup water and eggs until dough is soft. Turn dough onto a floured surface and knead until smooth, 1 to 2 minutes. Divide dough into 4 equal parts and arrange on a baking sheet; cover with a damp towel or plastic wrap and let stand for 10 minutes.\nRoll each piece of dough on a floured work surface until thin; cut into rounds using the rim of a large-mouth cup or large cookie cutter.\nSpoon 1 to 2 tablespoons filling onto each round. Fold dough over filling creating a 1/2 circle; press edges together, sealing with a dash of water if needed. Arrange varenyky in a single layer on plates and cover with a clean towel.\nBring a pot of lightly salted water to a boil; cook 2 to 3 varenyky at a time in boiling water until cooked through and dough is puffed, about 4 minutes. Remove varenyky with a slotted spoon and repeat with remaining varenyky.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Mint Mojito Coffee Ice Cream",
        "ingredients": [
            "2 cups whole milk ADVERTISEMENT",
            "1/3 cup coarsely ground coffee beans ADVERTISEMENT",
            "3/4 cup brown sugar, divided ADVERTISEMENT",
            "1 bunch fresh mint leaves, crushed ADVERTISEMENT",
            "6 large egg yolks ADVERTISEMENT",
            "1 cup heavy whipping cream ADVERTISEMENT",
            "1/3 cup white rum ADVERTISEMENT",
            "1/3 cup chopped chocolate ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat milk, ground coffee, 1/4 cup brown sugar, and mint in a saucepan over low heat until warmed through, 7 to 10 minutes.\nWhisk egg yolks and remaining 1/2 cup brown sugar in a bowl; slowly whisk in about 1 cup hot milk mixture. Pour egg yolk mixture into saucepan and continue to heat until custard is thickened, about 5 minutes.\nLine a sieve with cheesecloth and strain custard into a large bowl; discard solids. Whisk heavy cream into custard. Cover and refrigerate until chilled, 4 to 5 hours.\nStir rum and chocolate into chilled custard and pour into an ice cream maker. Freeze according to manufacturer's directions.\n",
        "picture_link": "057APcj.UWWkXpZT3Xot8QAlwA33ZhO"
    },
    {
        "title": "Eggnog Fried Chicken",
        "ingredients": [
            "10 boneless chicken thighs ADVERTISEMENT",
            "1 quart eggnog ADVERTISEMENT",
            "2 cups panko bread crumbs ADVERTISEMENT",
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 teaspoon chicken bouillon ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1 teaspoon garlic salt ADVERTISEMENT",
            "1 teaspoon Italian seasoning ADVERTISEMENT",
            "1/2 teaspoon dried thyme ADVERTISEMENT",
            "1/2 teaspoon ground smoked paprika ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon ADVERTISEMENT",
            "1/8 teaspoon ground nutmeg ADVERTISEMENT",
            "oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chicken in resealable plastic bag, coat with eggnog, and refrigerate, 1 to 3 hours.\nMix together panko, flour, garlic, chicken bouillon, baking soda, garlic salt, Italian seasoning, dried thyme, paprika, ground cinnamon, and ground nutmeg in a bowl for the breading mixture.\nHeat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C).\nRemove chicken from eggnog mixture and gently press each piece into breading mixture to coat, shaking off excess. Discard the eggnog.\nFry chicken until golden brown, about 3 to 5 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).\nPlace fried chicken on cooling racks to drain over a baking sheet.\n",
        "picture_link": "AadPxCEIlO2UUF5pNwZ02gHw20zjRu6"
    },
    {
        "title": "Oat Pudding with Mango and Coconut",
        "ingredients": [
            "4 cups water ADVERTISEMENT",
            "1 cup steel cut oats ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1/2 cup cashew milk ADVERTISEMENT",
            "1/2 banana, chilled ADVERTISEMENT",
            "1 mango, diced ADVERTISEMENT",
            "1/2 cup coconut flakes ADVERTISEMENT",
            "2 teaspoons raw honey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring lightly salted water to boil in a pot. Stir oats into boiling water and reduce heat to medium-low. Cook and stir until oats soften and water is absorbed, about 15 minutes. Remove from heat and allow to cool, about 15 minutes.\nBlend oats, cashew milk, and banana in a blender until smooth.\nSpoon oat mixture into 2 bowls; top each with diced mango, coconut flakes, and honey.\n",
        "picture_link": "IcyttmfDjyZoonBv/PuQu.UaGi66BK2"
    },
    {
        "title": "Streusel Topped Cranberry Pear Tart",
        "ingredients": [
            "Tart: ADVERTISEMENT",
            "1 refrigerated pie crust, softened as directed on package ADVERTISEMENT",
            "1/2 cup Stevia In The Raw® Bakers Bag ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "3 ripe but firm pears, peeled, cored, sliced 1/4 inch thick ADVERTISEMENT",
            "1/2 cup fresh or frozen cranberries ADVERTISEMENT",
            "Streusel: ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons Stevia In The Raw® Bakers Bag ADVERTISEMENT",
            "2 tablespoons butter, cut into small cubes ADVERTISEMENT",
            "1/4 cup chopped sliced almonds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 375 degrees F. Roll crust to 11 inches. Fit in bottom and up side of 9-inch tart pan with removable bottom. Trim around edge. Bake 5 to 8 minutes or until beginning to brown. With back of wooden spoon, gently press out any bubbles.\nMeanwhile, in large bowl, mix 1/2 cup Stevia In The Raw, cornstarch and nutmeg. Add pears and cranberries; toss to coat. Spoon into partially baked crust. In small bowl, mix flour, 2 tablespoons Stevia In The Raw and butter with pastry blender or fork until crumbly. Sprinkle over pears. Sprinkle top with chopped almonds. Bake 40 to 50 minutes or until pears are tender and crust is golden brown. Cool 1 hour. Remove side of pan. Serve warm or cool.\n",
        "picture_link": "HnGHCqAsJWf2vN/UF.d8QOGgeXOuVA."
    },
    {
        "title": "Herbed Grilled Cheese and Pork Sandwiches",
        "ingredients": [
            "1 Smithfield® Rosemary & Olive Oil Seasoned Pork Tenderloin ADVERTISEMENT",
            "8 slices sandwich bread ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "4 teaspoons capers ADVERTISEMENT",
            "1/2 teaspoon lemon pepper ADVERTISEMENT",
            "2 cups baby arugula ADVERTISEMENT",
            "4 slices Havarti cheese with dill ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Roast pork according to package directions (takes approximately 30 minutes). Slice meat very thin.\nHeat panini sandwich press, waffle iron, or skillet, depending on how you will cook your sandwiches.\nIn a small bowl, stir together mayonnaise, capers and lemon pepper.\nLightly brush one side of each slice of bread with olive oil. Spread the opposite side of four slices of bread with the mayonnaise mixture.\nFor each sandwich, layer arugula leaves, sliced pork and Havarti on top of mayonnaise mixture. Top with another slice of bread without mayo. (Olive oil should be facing OUT.)\nPlace each sandwich in hot sandwich press or skillet. Cook until bread is toasted and cheese is melted, flipping if necessary. Cut in half and serve immediately.\n",
        "picture_link": "zcYDSgUjgbSwTqFj1s.Oxy6zfjCY5HS"
    },
    {
        "title": "Creamy Cashew Lime Bars (or Pie)",
        "ingredients": [
            "Crust: ADVERTISEMENT",
            "1 cup walnuts ADVERTISEMENT",
            "1 cup coconut sugar ADVERTISEMENT",
            "2 tablespoons coconut oil ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "1 1/4 cups cashews ADVERTISEMENT",
            "10 tablespoons lime juice ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "5 tablespoons coconut oil ADVERTISEMENT",
            "1 tablespoon grated lime zest ADVERTISEMENT",
            "2 pinches salt, or more to taste ADVERTISEMENT",
            "1/2 teaspoon grated lime zest ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine walnuts, coconut sugar, 2 tablespoons coconut oil, and 1 tablespoon honey in the bowl of a food processor; pulse until fine, moist crumbs form, about 3 minutes. Press the crust mixture into the bottom of a 9-inch square baking dish.\nPlace cashews, lime juice, 1/2 cup honey, 5 tablespoons coconut oil, 1 tablespoon lime zest, and salt in a blender. Blend together until very smooth, about 4 minutes. Pour filling mixture over prepared crust.\nRefrigerate until set, at least 20 minutes. Top with 1/2 teaspoon lime zest before serving.\n",
        "picture_link": "VKI.MC.V07JWEa6whElUuKtqApBlXuC"
    },
    {
        "title": "Native American Fry Bread",
        "ingredients": [
            "6 cups all-purpose flour, or more as needed ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "1 1/2 tablespoons baking powder ADVERTISEMENT",
            "1 1/2 teaspoons salt ADVERTISEMENT",
            "1 (.25 ounce) package quick-rise yeast ADVERTISEMENT",
            "2 cups warm water ADVERTISEMENT",
            "oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix flour, sugar, baking powder, and salt together in a large bowl. Make a well in the center of the mixture.\nDissolve yeast in the warm water in a small bowl. Pour into the middle of the flour mixture. Mix together lightly and rapidly until dough is moist and soft. Allow dough to rise slightly, 15 to 20 minutes.\nHeat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C).\nPinch off a 2-inch piece of dough with well-floured fingers. Stretch it into a round 5 to 6 inches in diameter, working in more flour if needed.\nDeep-fry dough until golden brown, about 2 minutes per side. Drain on paper towels. Repeat with remaining dough.\n",
        "picture_link": "N2jaqJEiu2zkDpTxiaT98Up4Nfkj5ba"
    },
    {
        "title": "Skinny Cornbread",
        "ingredients": [
            "1 cup cornmeal ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/2 cup corn kernels ADVERTISEMENT",
            "1 (8 ounce) can creamed corn ADVERTISEMENT",
            "1 (8 ounce) container reduced-fat sour cream ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 large egg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease 24 muffin cups or line with paper muffin liners.\nMix together cornmeal, flour, baking powder, baking soda, and salt in a large bowl; stir in corn kernels.\nWhisk together creamed corn, sour cream, water, and egg in a separate bowl; stir into cornmeal mixture until a smooth batter forms. Pour 1/4 cup batter into each greased muffin cup.\nBake in preheated oven, rotating muffin pan half way through to ensure even cooking, until tops spring back when lightly pressed, 25 to 30 minutes.\n",
        "picture_link": "P4hBQPB1D/uBoTCe.2yuZOW51ErbLE2"
    },
    {
        "title": "Chocolate Pumpkin Cheesecake",
        "ingredients": [
            "Crust: ADVERTISEMENT",
            "1 1/2 cups coarsely crushed graham cracker pieces ADVERTISEMENT",
            "1 1/2 cups unsweetened cocoa powder ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "1 cup chocolate chips ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "3 (8 ounce) packages cream cheese, room temperature ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon maple extract ADVERTISEMENT",
            "1 (15 ounce) can pumpkin puree ADVERTISEMENT",
            "4 eggs, at room temperature ADVERTISEMENT",
            "1 1/4 teaspoons ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Wrap the outside of a springform pan with aluminum foil.\nCombine graham crackers, cocoa powder, 1 cup sugar, and butter in a food processor and pulse to fine consistency. Press into the bottom of a 9-inch springform pan.\nBake in the preheated oven until lightly browned and toasted, about 15 minutes.\nRemove crust from oven and spread chocolate chips in a single layer over the crust bottom, leaving 1/2-inch rim at edges; cool to room temperature.\nBeat cream cheese in a large bowl with an electric mixer until light and fluffy, scraping sides frequently to ensure evenness and no lumps. Beat in 1 1/2 cup sugar, vanilla extract, and maple extract; add pumpkin puree and beat to combine. Add eggs, one at a time, mixing until incorporated and scraping the bowl each time. Add cinnamon, ginger, nutmeg, and salt; beat once more until well distributed.\nPour filling over cooled crust. Place pie pan in a baking dish and gently pour boiling water into the baking dish to come half-way up sides of the springform pan.\nBake in preheated oven until edges are puffed and surface of cheesecake is firm except for a small spot in the center that will jiggle when the pan is gently shaken, about 55 minutes. Turn off heat and allow the cheesecake to cool to room temperature in the oven with the door open, about 1 hour. Refrigerate until completely chilled, about 2 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Almond Flour Bread Loaf with Parmesan",
        "ingredients": [
            "2 1/4 cups blanched almond flour ADVERTISEMENT",
            "1 cup grated Parmesan cheese ADVERTISEMENT",
            "1/4 cup ground flax seeds ADVERTISEMENT",
            "1/2 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon fine sea salt ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "3/4 cup almond milk ADVERTISEMENT",
            "2 tablespoons apple cider vinegar ADVERTISEMENT",
            "1 tablespoon extra-virgin olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease one 9x5-inch loaf pan.\nStir almond flour, Parmesan cheese, ground flax seeds, baking soda, and salt together in a large bowl with a fork until well-combined.\nWhisk eggs, almond milk, vinegar, and olive oil together in a large bowl until well-mixed.\nPour egg mixture over flour mixture and whisk well until dough comes together, about 1 minute. Dough will be very thick. Pour dough into pan and smooth top.\nBake loaf in the preheated oven until golden and a toothpick inserted in the center comes out clean, 35 to 40 minutes.\nSet pan on a wire rack to cool for 5 minutes. Cover pan with plate or cooling rack and invert to tip loaf out. Let cool down for 20 to 30 minutes before serving.\n",
        "picture_link": "BRBgNQkywbEIhgwo2EJ29D4IvKaSL.6"
    },
    {
        "title": "Multigrain Seed Biscuits",
        "ingredients": [
            "1 1/4 cups multigrain flour ADVERTISEMENT",
            "1 cup whole wheat flour ADVERTISEMENT",
            "1/4 cup sunflower seeds ADVERTISEMENT",
            "1/4 cup flax seeds ADVERTISEMENT",
            "1/4 cup wheat germ ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 cup cold butter ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "1 egg, lightly beaten ADVERTISEMENT",
            "1/4 cup sesame seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nWhisk multi-grain flour, wheat flour, sunflower seeds, flax seeds, wheat germ, sugar, baking powder, and salt together in a large bowl.\nGrate cold butter into flour mixture using the largest holes of a cheese grater and mix with a fork until it resembles coarse crumbs. Slowly pour in milk and mix until dough begins to pull away from sides of the bowl.\nTurn dough out onto a lightly floured surface and gently knead to form a soft dough, about 10 turns. Pat into an 8-inch square, cut into quarters, and cut each quarter into 3 rectangular pieces.\nPlace each piece of dough onto an ungreased baking sheet, about 1 inch apart; brush with egg and sprinkle with sesame seeds.\nBake in the preheated oven until golden, 12 to 15 minutes.\n",
        "picture_link": "3QsiMB6Z5RH8JqT2m4HiBVP2uPHF17m"
    },
    {
        "title": "Smithfield Holiday Ham",
        "ingredients": [
            "1 Smithfield® Hickory Smoked Spiral Sliced Ham ADVERTISEMENT",
            "1 bunch asparagus ADVERTISEMENT",
            "1 cup sliced fresh strawberries ADVERTISEMENT",
            "1 cup fresh blueberries ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 275 degrees F.\nPlace ham on a rack in a foil-lined roasting pan, fat side up. Cover tightly with foil. Roast for 15 minutes per pound of ham (1 to 1 1/2 hours).\nGlaze according to directions.\nGarnish with grilled or roasted asparagus, fresh cut strawberries and fresh blueberries.\nServe and Enjoy.\n",
        "picture_link": "nNe2/jocFfXTsTOOWToggaj/3E3tIuG"
    },
    {
        "title": "Apricot Slush",
        "ingredients": [
            "1 1/2 quarts pineapple juice ADVERTISEMENT",
            "1 quart apricot nectar ADVERTISEMENT",
            "13 fluid ounces vodka ADVERTISEMENT",
            "13 fluid ounces apricot brandy ADVERTISEMENT",
            "1 (6 ounce) can frozen orange juice concentrate, thawed ADVERTISEMENT",
            "1 (6 ounce) can frozen lemonade concentrate, thawed ADVERTISEMENT",
            "1 (2 liter) bottle lemon-lime soda (such as 7-Up®), or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix pineapple juice, apricot nectar, vodka, apricot brandy, orange juice concentrate, and lemonade concentrate in a large pitcher or bowl.\nStore in freezer, stirring periodically, until a slushy consistency is achieved, 4 to 6 hours.\nLadle slush into large glasses; top with lemon-lime soda to serve.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "The Smithfield Porkinator Sandwich",
        "ingredients": [
            "1 Smithfield® Peppercorn & Garlic Seasoned Pork Tenderloin ADVERTISEMENT",
            "1/2 cup ranch salad dressing ADVERTISEMENT",
            "3 tablespoons barbecue sauce ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 medium sweet yellow onion, thinly sliced ADVERTISEMENT",
            "6 large ciabatta rolls, sliced open horizontally and toasted ADVERTISEMENT",
            "12 slices Smithfield® Deli Style Ham ADVERTISEMENT",
            "3/4 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "12 slices Smithfield® Hometown Original Hickory Smoked Bacon, cooked crisp and drained ADVERTISEMENT",
            "Arugula or baby spinach leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oven to 425 degrees F. Place tenderloin on rack in shallow roasting pan. Roast about 30 minutes until internal temperature reaches 150 degrees F. Let stand 10 minutes before slicing very thin.\nMeanwhile, mix together salad dressing and barbecue sauce; set aside. Saute onion slices in oil over medium heat until very tender and dark golden brown.\nPlace bottom half of each toasted roll on baking sheet; spread with barbecue ranch dressing. Top with ham, pork tenderloin, caramelized onions, shredded cheese and bacon. Place under broil until cheese is melted, 1 to 2 minutes.\nRemove from oven, top with arugula and crowns of rolls to serve.\n",
        "picture_link": "yUT0gfh3N660W59rBL.utcAhD1HUxgu"
    },
    {
        "title": "Pannileib",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 1/2 pounds bacon, cut crosswise into 1/2-inch pieces ADVERTISEMENT",
            "10 medium Yukon Gold potatoes ADVERTISEMENT",
            "5 onions ADVERTISEMENT",
            "5 carrots ADVERTISEMENT",
            "2 cups all-purpose flour, or more as needed ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 teaspoon fresh ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Adjust oven rack to center position and preheat oven to 400 degrees F (200 degrees C). Spray baking sheet with cooking spray and line with parchment paper.\nPlace bacon in a skillet over medium heat; cook and stir until cooked through but not browned, 6 to 8 minutes.\nGrate potatoes, onions, and carrots in a food processor; transfer to a large bowl and mix to combine.\nStir cooked bacon and bacon fat into the potato mixture.\nMix in 2 cups of flour, salt, and pepper and stir well. If filling appears too wet, gradually mix in more flour for a firmer consistency. Spread mixture evenly over lined baking sheet.\nBake at 400 degrees F (200 degrees C) for 1 hour. Reduce heat to 350 degrees F (175 degrees C) and cook until lightly browned with crispy edges, about 15 minutes longer.\nCool before slicing, about 10 minutes.\n",
        "picture_link": "4so/kp/UrN/fRpZhIkcQv5aUerMvtNe"
    },
    {
        "title": "Mom's Spiced Eggnog Pancakes",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon, or to taste ADVERTISEMENT",
            "2 cups eggnog ADVERTISEMENT",
            "2 eggs, lightly beaten ADVERTISEMENT",
            "1/4 cup vegetable oil ADVERTISEMENT",
            "1/2 teaspoon rum-flavored extract (optional) ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk flour, baking powder, salt, nutmeg, and cinnamon together in a large bowl.\nWhisk eggnog, eggs, oil, and rum extract together in a small bowl. Add to flour mixture and mix briefly to combine. Batter should be slightly lumpy.\nGrease a griddle lightly with cooking spray and heat over medium-high heat. Pour 1/4 cup batter onto the griddle and cook until bubbles form and the edges are dry, 2 to 3 minutes. Flip and cook until browned on the other side, 1 to 2 minutes. Repeat with remaining batter.\n",
        "picture_link": "nFF6KjjuDJc.f1oPGDlY8w8CpvHsxUW"
    },
    {
        "title": "One Pot Asian Braised Pork & Bacon",
        "ingredients": [
            "1/4 cup soy sauce, divided ADVERTISEMENT",
            "3 tablespoons rice wine vinegar, divided ADVERTISEMENT",
            "1 teaspoon grated fresh ginger ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1/2 Smithfield® Original Pork Loin Filet, very thinly sliced ADVERTISEMENT",
            "1 pound baby bok choy, leaves separated ADVERTISEMENT",
            "2 large carrots, cut into strips with a vegetable peeler ADVERTISEMENT",
            "9 slices Smithfield® Center Cut Hickory Smoked Bacon, cut in half ADVERTISEMENT",
            "1 tablespoon chopped fresh ginger ADVERTISEMENT",
            "1 cup chicken stock ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "Cooked rice, warm ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine 2 tablespoons soy sauce, 1 tablespoon rice wine vinegar, grated ginger and garlic in bowl; mix well. Add pork slices to bowl, tossing to coat well. Let stand 30 minutes.\nDivide bok choy and carrots into 4 equal piles. Divide marinated pork, bacon and chopped ginger in 3 equal piles.\nIn 4- to 6-quart stock pot layer 1 stack bok choy, carrots, marinated pork, bacon and chopped garlic. Repeat layers with bok choy and carrots as the final layers.\nCombine stock, remaining 2 tablespoons soy sauce and 2 tablespoons rice wine vinegar; pour over vegetables and meat in stock pot. Drizzle top with honey. Bring to a boil over high heat. Reduce heat to medium, cover and cook until meat is tender, about 15 minutes.\nDissolve cornstarch in water; add to stock pot. Reduce heat to low; cook about 5 minutes until sauce thickens slightly. Serve over hot cooked rice.\n",
        "picture_link": "9kEcA4fezEV5.u2a.fEf3otaa8IKdb."
    },
    {
        "title": "Vegan Green Smoothie",
        "ingredients": [
            "2 cups coconut water ADVERTISEMENT",
            "1 cup baby spinach ADVERTISEMENT",
            "1 banana ADVERTISEMENT",
            "6 sliced fresh strawberries ADVERTISEMENT",
            "5 dates, pitted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend coconut water, spinach, banana, strawberries, and dates together in a blender.\n",
        "picture_link": "XzD3k6EbfS6XCiL9PiKAvd/r4SXG41q"
    },
    {
        "title": "Breakfast Fried Brown Rice",
        "ingredients": [
            "3 tablespoons peanut oil, divided, or more as needed ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "2 large eggs ADVERTISEMENT",
            "1 cup diced fully cooked ham ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "3 cups cooked brown rice ADVERTISEMENT",
            "kosher salt and freshly ground black pepper to taste ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat a wok or skillet on high heat for 1 minute.\nCoat wok thoroughly with 2 tablespoons peanut oil; reduce heat to medium. Cook and stir onion until beginning to soften, about 3 minutes.\nCrack eggs directly into the wok. Stir quickly to scramble until eggs begin to set but are still fluid, about 1 1/2 minutes.\nStir ham into the wok and cook just until warmed through, about 1 minute.\nStir butter and remaining 1 tablespoon of peanut oil into the wok; let warm for 10 seconds. Add rice and stir constantly for 3 to 4 minutes, adding more oil if rice begins to stick.\nSeason fried rice with salt and pepper; top with Cheddar cheese.\n",
        "picture_link": "5ldy5YB1dYZpi4hZ17lWV/zDhi8/iUu"
    },
    {
        "title": "The Raji",
        "ingredients": [
            "1 (1.5 fluid ounce) jigger lemon-flavored rum, or to taste ADVERTISEMENT",
            "1 splash lime juice ADVERTISEMENT",
            "1 pinch white sugar ADVERTISEMENT",
            "1 cup lemon-lime soda (such as Sprite®), or as needed ADVERTISEMENT",
            "1 slice lime ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir rum, lime juice, and sugar together in a glass tumbler to dissolve the sugar. Fill glass with lemon-lime soda. Garnish with lime slice.\n",
        "picture_link": "wFGwsBr8yd9Rb7fvbPFhwi7K5xdS1f6"
    },
    {
        "title": "Hot Buttered Rum Sauce",
        "ingredients": [
            "6 tablespoons butter ADVERTISEMENT",
            "1 cup firmly packed golden brown sugar ADVERTISEMENT",
            "1/3 cup heavy whipping cream ADVERTISEMENT",
            "2 tablespoons light corn syrup ADVERTISEMENT",
            "1/2 teaspoon rum-flavored extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a heavy saucepan over medium heat; add brown sugar, cream, and corn syrup. Bring to a boil; cook and stir until sugar dissolves, about 1 minute. Remove saucepan from heat and stir in rum extract. Cool slightly before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Hawaiian-Inspired Mango Risotto",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 cup white wine vinegar ADVERTISEMENT",
            "2 tablespoons honey ADVERTISEMENT",
            "1 mango - peeled, pitted, and cut into 1/2-inch cubes ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 shallot, minced ADVERTISEMENT",
            "1/2 teaspoon minced fresh ginger root ADVERTISEMENT",
            "1 cup Arborio rice ADVERTISEMENT",
            "1 1/2 cups chicken broth ADVERTISEMENT",
            "1/2 cup coconut milk ADVERTISEMENT",
            "1/4 cup white wine, or as needed ADVERTISEMENT",
            "1 1/2 cups finely shredded fresh spinach ADVERTISEMENT",
            "3/4 cup grated Parmesan cheese ADVERTISEMENT",
            "2 slices watermelon, cut to 1/4-inch thickness ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix sugar, water, vinegar, and honey together in a bowl. Add mango cubes; stir to coat. Cover bowl with plastic wrap and refrigerate for 8 hours to overnight.\nDrain liquid from mango, reserving 1/4 cup of the liquid.\nHeat olive oil into a pot over medium heat; cook and stir shallot and ginger until slightly tender, about 5 minutes. Add rice; cook and stir until slightly toasted, 1 to 2 minutes. Pour chicken broth and coconut milk over rice; bring to a boil. Cover pot, reduce heat to medium-low, and simmer until rice is tender and liquid is absorbed, about 20 minutes.\nStir mango, 1/4 cup reserved vinegar mixture, and wine together in a skillet over medium heat; cook and stir until warmed, about 2 minutes. Add spinach and cook until wilted, about 1 minute. Stir rice mixture and Parmesan cheese into mango mixture; remove from heat and let sit until liquid absorbs and cheese melted, about 7 minutes.\nPlace 1 watermelon slice on a serving platter; top with risotto. Place the 2nd watermelon slice atop risotto to garnish.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Uncle Tim's Mole Sauce",
        "ingredients": [
            "4 red bell peppers ADVERTISEMENT",
            "4 tomatoes ADVERTISEMENT",
            "1 tablespoon corn oil ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 teaspoon ground cloves ADVERTISEMENT",
            "1 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 teaspoon cayenne pepper ADVERTISEMENT",
            "2 medium onions, chopped ADVERTISEMENT",
            "4 cloves garlic, chopped ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "1/4 cup raisins ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1/2 cup coarsely chopped Mexican dark chocolate ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Line a baking sheet with aluminum foil.\nCut the peppers in half from top to bottom. Place the peppers cut-sides down onto the prepared baking sheet.\nCook under the preheated broiler until the skin of the peppers has blackened and blistered, 5 to 8 minutes. Place the blackened peppers into a bowl and tightly seal with plastic wrap. Allow the peppers to steam as they cool, about 20 minutes. Remove and discard excess blackened skin and stems. Tear peppers with your hands and place in a bowl.\nCut the top off of each tomato around the stem. Scoop seeds and pulp out of each tomato and squeeze into a bowl to create a thick tomato 'juice'. Chop tomatoes and place in a separate bowl.\nHeat corn oil and olive oil together in a large pot over medium heat. Cook and stir black pepper, paprika, cloves, cinnamon, and cayenne pepper in hot oil until fragrant, about 30 seconds.\nStir onion and garlic into hot spiced oil; cook and stir until onion is softened, about 5 minutes. Pour tomato 'juice' into the pot and bring mixture to a boil while scraping the browned bits of food off of the bottom of the pot with a wooden spoon. Add chopped tomatoes, chicken broth, raisins, and brown sugar. Bring to a simmer.\nReduce heat to low and add the chocolate; stir until chocolate melts. Add roasted peppers and stir. Bring sauce to a simmer and cook until flavors blend, at least 1 hour.\nPour sauce into a blender no more than half full. Cover and hold lid down; pulse a few times before leaving on to blend. Puree in batches until smooth. Return sauce to the pot and season with salt.\n",
        "picture_link": "ATwLZnhLhyogDhanrtRoL.sTpZeKUsm"
    },
    {
        "title": "Short Rib Tsimmes",
        "ingredients": [
            "4 pounds beef short ribs ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "2 tablespoons olive oil, or as needed ADVERTISEMENT",
            "4 large sweet potatoes, peeled and chopped ADVERTISEMENT",
            "4 large carrots, peeled and chopped ADVERTISEMENT",
            "2 large onions, chopped ADVERTISEMENT",
            "1 1/2 pounds pitted prunes ADVERTISEMENT",
            "3/4 cup honey ADVERTISEMENT",
            "5 whole cloves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season short ribs with garlic powder, salt, and pepper.\nHeat 1 tablespoon olive oil in a large skillet over medium-high heat. Saute onions in hot oil until softened and translucent, 7 to 10 minutes; transfer to a bowl\nReduce heat to medium and add remaining tablespoon oil to the skillet. Cook short ribs in hot oil until browned on all sides, 2 to 4 minutes per side; transfer to a slow cooker.\nStir sweet potatoes, carrots, onions, prunes, honey, and cloves together in a large bowl. Pour onion mixture over short ribs into slow cooker.\nCook on Low for 8 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Fundog Hotdog Kabobs",
        "ingredients": [
            "1 package skewers ADVERTISEMENT",
            "1 (16 ounce) package hot dogs, cut into bite-size pieces ADVERTISEMENT",
            "1 red bell pepper, cut into bite-size pieces ADVERTISEMENT",
            "1 green bell pepper, cut into bite-size pieces ADVERTISEMENT",
            "12 pearl onions ADVERTISEMENT",
            "1 (8 ounce) can pineapple chunks, drained ADVERTISEMENT",
            "12 grape tomatoes ADVERTISEMENT",
            "12 miniature dill pickles ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Soak skewers in a bowl of water for about 30 minutes; drain.\nPreheat an outdoor grill for low heat and lightly oil the grate.\nThread hot dog pieces, red bell pepper pieces, green bell pepper pieces, onions, pineapple chunks, grape tomatoes, and dill pickles onto the skewers.\nGrill kabobs on the preheated grill, turning frequently, until lightly browned, about 15 minutes.\n",
        "picture_link": "Rz4Opjq3LxyjsDw7b87TqV.TwobXCiO"
    },
    {
        "title": "V's Grilling Marinade",
        "ingredients": [
            "1/4 cup boiling water ADVERTISEMENT",
            "1/2 teaspoon lapsang souchong tea leaves ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "3/4 cup pineapple juice ADVERTISEMENT",
            "1/2 cup tamari (dark soy sauce) ADVERTISEMENT",
            "1/2 cup canola oil ADVERTISEMENT",
            "1 (1 1/2 inch) piece fresh ginger root, peeled and chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons sherry ADVERTISEMENT",
            "1 tablespoon honey ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour boiling water over tea leaves in a mug and steep for 3 minutes; strain and discard tea leaves. Dissolve brown sugar into the tea and set aside to cool.\nCombine pineapple juice, tamari, canola oil, ginger, garlic, sherry, and honey in a jar; add tea mixture. Seal jar and shake until the oil emulsifies into the marinade.\n",
        "picture_link": "1pUb1LOoHTE9PsrZp6L9WOe/yEC8416"
    },
    {
        "title": "Lentil Samosas",
        "ingredients": [
            "3/4 cup dried brown lentils ADVERTISEMENT",
            "3 tablespoons olive oil, divided ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "2 teaspoons curry powder ADVERTISEMENT",
            "1 teaspoon ground cardamom ADVERTISEMENT",
            "1 teaspoon ground ginger ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 pinch cayenne pepper (optional) ADVERTISEMENT",
            "1 yam, peeled and sliced ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1/4 cup coconut milk ADVERTISEMENT",
            "6 dried apricots, chopped ADVERTISEMENT",
            "1/2 teaspoon sea salt ADVERTISEMENT",
            "1 (16 ounce) package samosa pastry (egg roll wrappers) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place lentils into a bowl and cover with several inches of cool water; let stand 8 hours to overnight. Drain and rinse.\nPreheat oven to 350 degrees F (175 degrees C).\nHeat 1 tablespoon olive oil in a wok or large skillet over medium heat; cook and stir onion until softened, 5 to 10 minutes. Add curry powder, cardamom, ginger, cumin, and cayenne pepper; stir to coat. Mix lentils, yam, water, and coconut milk into onion mixture; cook and stir over low heat until liquid is mostly reduced and lentils are tender, about 20 minutes. Remove wok from heat and lightly mash mixture.\nSpoon about 1 1/2 tablespoons lentil mixture into the center of each pastry; fold pastry over filling creating a triangle. Fold edges into the triangle to seal. Arrange samosas on a baking sheet and brush remaining olive oil over the top.\nBake in the preheated oven until golden brown, 15 to 20 minutes.\n",
        "picture_link": "xYq4HfivD/xjZpyW552JMMSqtojkOcq"
    },
    {
        "title": "Potato and Cauliflower Cakes",
        "ingredients": [
            "2 potatoes, cut into cubes ADVERTISEMENT",
            "2 cups cauliflower florets ADVERTISEMENT",
            "1/3 onion, chopped ADVERTISEMENT",
            "1 cup whole wheat flour ADVERTISEMENT",
            "1/4 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/4 cup skim milk ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 tablespoon mustard ADVERTISEMENT",
            "1 clove garlic ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 jarred roasted red pepper, drained and chopped ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add potatoes, cauliflower, and onion; cover and steam until tender, 10 to 15 minutes.\nBlend steamed vegetables, flour, Cheddar cheese, milk, eggs, mustard, garlic, salt, and pepper in a blender until batter is thick; transfer to a bowl. Stir red pepper into batter.\nSpray a hinged griddle or flat griddle with cooking spray and turn heat to medium. Spoon batter, 1 to 2 tablespoons per cake, onto the hot griddle; close griddle or flip cakes and cook until lightly browned, about 4 minutes. Repeat with remaining batter.\n",
        "picture_link": "cm6RaBBZOslR.9B1jCOOawbZVP4tYRW"
    },
    {
        "title": "Baked Sweet Potato Vegetable Samosas",
        "ingredients": [
            "3 tablespoons vegetable oil ADVERTISEMENT",
            "2 cups diced sweet potato ADVERTISEMENT",
            "1 1/2 cups diced eggplant ADVERTISEMENT",
            "1 small onion, diced small ADVERTISEMENT",
            "2 tablespoons curry powder ADVERTISEMENT",
            "1 tablespoon ground cumin ADVERTISEMENT",
            "1 tablespoon garam masala (optional) ADVERTISEMENT",
            "3 cups vegetable broth, or more if needed ADVERTISEMENT",
            "1/4 cup all-purpose flour, or as needed ADVERTISEMENT",
            "2 sheets prepared pie crust ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat vegetable oil in a large, heavy-bottomed pot over medium-high heat. Saute sweet potato, eggplant, and onion in hot oil until the onion is softened, 7 to 10 minutes; season with curry powder, cumin, and garam masala.\nPour stock into the pot. Bring liquid to a simmer, reduce heat to medium-low, and cook until vegetables are completely tender, adding more broth as needed to keep mixture moist, 10 to 15 minutes. Remove pot from heat and set aside to let mixture cool completely.\nPreheat oven to 350 degrees F (175 degrees C).\nLie each pie crust onto a lightly-floured surface. Cut each crust into 8 wedges. Spoon 2 tablespoons of the vegetable mixture into the middle of each triangle.\nBring two corners of each triangle together, pressing the dough along the edges to seal. Bring up the last corner and seal the last edge. Arrange samosas onto a baking sheet.\nBake in preheated oven until golden brown, about 45 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Green Apple and Coconut Chutney",
        "ingredients": [
            "Chutney: ADVERTISEMENT",
            "1 Granny Smith apple, cored ADVERTISEMENT",
            "1 cup Greek yogurt ADVERTISEMENT",
            "1/2 cup grated raw coconut ADVERTISEMENT",
            "2 tablespoons chopped onion ADVERTISEMENT",
            "1 green chile pepper ADVERTISEMENT",
            "1 teaspoon lemon juice, or to taste (optional) ADVERTISEMENT",
            "1/8 teaspoon fresh ginger, or more to taste ADVERTISEMENT",
            "Seasoning: ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 teaspoon mustard seed ADVERTISEMENT",
            "1 teaspoon sliced onion ADVERTISEMENT",
            "1 curry leaf ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend apple, yogurt, coconut, 2 tablespoons chopped onion, green chile pepper, lemon juice, and ginger in a blender until smooth; transfer chutney to a serving bowl.\nHeat oil in a skillet over medium-high heat. Add mustard seeds to hot oil and cook until seeds start to pop, 2 to 4 minutes. Add 1 teaspoon sliced onion and curry leaf to mustard seeds; fry until onion is golden brown, 5 to 10 minutes. Pour seasoned oil mixture over chutney; season with salt.\n",
        "picture_link": "3F9hlr3CpMace6ELSPvtuzQVzUx8fYW"
    },
    {
        "title": "Shalvie's Passover Pancakes",
        "ingredients": [
            "1/2 cup matzo meal ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/4 cup almond meal ADVERTISEMENT",
            "1/4 cup chocolate chips, or to taste (optional) ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/2 teaspoon vanilla sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir matzo meal, milk, ground almonds, chocolate chips, eggs, vanilla sugar, cinnamon, and salt together in a bowl.\nHeat a lightly oiled griddle over medium heat. Drop batter by large spoonfuls onto the griddle and cook until the edges start to dry and are browned dry, about 2 minutes. Flip and cook until browned on the other side, about 2 minutes more. Repeat with remaining batter.\n",
        "picture_link": "gj4lMI4BRh8JrT2HqQqhnFfBDv5G3oG"
    },
    {
        "title": "Cinnamon Bun Pecan Pie",
        "ingredients": [
            "2 cups pecan halves ADVERTISEMENT",
            "non-stick cooking spray ADVERTISEMENT",
            "1 (14 ounce) can refrigerated cinnamon roll dough, separated ADVERTISEMENT",
            "3/4 cup dark corn syrup ADVERTISEMENT",
            "1/2 cup packed light brown sugar ADVERTISEMENT",
            "3 tablespoons butter, melted ADVERTISEMENT",
            "3 large eggs, at room temperature ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cup cream cheese frosting ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Spread pecans onto a baking sheet.\nBake in the preheated oven until pecans are toasted and fragrant, 5 to 10 minutes.\nSpray a 9-inch pie pan with cooking spray. Line a baking sheet with parchment paper or aluminum foil.\nPress the cinnamon rolls into the bottom of the pie pan, sealing edges together to create the 'crust'.\nWhisk corn syrup and brown sugar together in a bowl until thick and sticky. Add butter and whisk until mixture is smooth. Whisks eggs, 1 at a time, into brown sugar mixture, whisking well after each addition, until eggs are fully incorporated. Stir cinnamon, vanilla extract, and salt into brown sugar mixture.\nLayer the toasted pecans over the cinnamon roll 'crust'. Pour the brown sugar mixture over pecans. Place the pie on the prepared baking sheet.\nBake in the preheated oven for 15 minutes. Cover crust with pieces of aluminum foil to avoid burning.\nReduce oven temperature to 350 degrees F (175 degrees C). Continue baking until pie is set in the middle, 20 to 25 minutes. Cool pie for 15 minutes.\nPlace cream cheese frosting in a microwave-safe bowl; heat in microwave until frosting is thinned and pourable, about 30 seconds. Drizzle frosting over pie and set aside until frosting has slightly hardened, about 20 minutes.\n",
        "picture_link": "P50X2CoO4xtDThPpTTK83jv0Hye36/i"
    },
    {
        "title": "Wok Charred Edamame 3 Ways",
        "ingredients": [
            "Edamame: ADVERTISEMENT",
            "2 tablespoons soybean oil (often labeled \"vegetable oil\") ADVERTISEMENT",
            "4 cups edamame, in-shell, thawed ADVERTISEMENT",
            "Soy Ginger Seasoning: ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "2 teaspoons minced fresh ginger root ADVERTISEMENT",
            "1 teaspoon sesame seeds ADVERTISEMENT",
            "Maple Balsamic Seasoning: ADVERTISEMENT",
            "2 tablespoons maple syrup ADVERTISEMENT",
            "1 tablespoon balsamic vinegar ADVERTISEMENT",
            "1 teaspoon sea salt ADVERTISEMENT",
            "Dukkah Spiced Seasoning: ADVERTISEMENT",
            "2 tablespoons dukkah spice blend ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat soybean oil over high heat in a wok or skillet.\nAdd edamame. Saute for 3 to 5 minutes, stirring constantly, until pods begin to lightly char.\nRemove and season as desired (see Soy Ginger, Maple Balsamic and Dukkah seasoning).\n",
        "picture_link": "D/m5wbjWNjyQq3cV9nyHb.ABCeOgcJC"
    },
    {
        "title": "Best Vodka Gummies",
        "ingredients": [
            "5 (5 ounce) bags gummy candies ADVERTISEMENT",
            "1 (750 milliliter) bottle vodka ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spread candies in a 3-quart baking dish, ensuring none of the candies are stuck together. Pour vodka over candies, spreading candies around and still ensuring none are stuck together. Cover mixture with plastic wrap and refrigerate, 4 to 6 hours.\nRemove plastic wrap from candies. Separate gummy candies from dish using a spatula or your fingers. Cover candies with a new piece of plastic wrap; refrigerate, 4 to 6 hours. Repeat process of separating candies from dish every 4 to 6 hours and replacing plastic wrap until gummies have soaked for a total of 24 hours.\n",
        "picture_link": "ZNky4cS4kcR.sgztAJlIQD0FWVW7vtK"
    },
    {
        "title": "Sesame Sweet and Sour Salad Dressing",
        "ingredients": [
            "1/2 cup white sugar, or less to taste ADVERTISEMENT",
            "1 tablespoon soy sauce ADVERTISEMENT",
            "2 teaspoons sesame seeds ADVERTISEMENT",
            "1/2 teaspoon dry mustard ADVERTISEMENT",
            "1/4 teaspoon kosher salt ADVERTISEMENT",
            "1/8 teaspoon garlic powder ADVERTISEMENT",
            "1/2 cup cider vinegar ADVERTISEMENT",
            "3 tablespoons water ADVERTISEMENT",
            "1 cup canola oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir sugar, soy sauce, sesame seeds, mustard, salt, and garlic powder together in a jar with a tight-fitting lid; add vinegar and water, seal jar, and shake until the sugar is dissolved completely.\nPour oil into the jar. Seal again and shake until the oil is emulsified into the dressing.\n",
        "picture_link": "Hd5fSFfIu5.NbMbfUsYvSpr7eLStBJ2"
    },
    {
        "title": "Capirotada ",
        "ingredients": [
            "3 cups water ADVERTISEMENT",
            "3 cups brown sugar, divided ADVERTISEMENT",
            "2 cinnamon sticks ADVERTISEMENT",
            "2 cups butter, softened ADVERTISEMENT",
            "2 loaves sliced white bread, toasted ADVERTISEMENT",
            "1/4 teaspoon ground cinnamon, or to taste ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg, or to taste ADVERTISEMENT",
            "1/8 teaspoon ground cloves, or to taste ADVERTISEMENT",
            "2 cups raisins ADVERTISEMENT",
            "2 cups peanuts ADVERTISEMENT",
            "1 pound shredded sharp Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine water, 2 cups brown sugar, and cinnamon sticks together in a saucepan; bring to a boil. Reduce heat and simmer, stirring occasionally, until sugar is dissolved and liquid has reduced into a syrup, about 15 minutes. Remove cinnamon sticks from syrup using a slotted spoon.\nSpread butter onto each toasted bread slice. Make 1 layer of buttered bread in a deep casserole dish or oven-proof stockpot. Sprinkle cinnamon, nutmeg, and cloves over bread layer. Sprinkle 1/4 the raisins, 1/4 the peanuts, 1/4 the remaining brown sugar, and 1/4 the Cheddar cheese over bread layer. Repeat layering with remaining ingredients. Pour cinnamon syrup over entire dish; cover with aluminum foil.\nBake in the preheated oven until cooked through, about 30 minutes. Cool for 20 minutes before serving.\n",
        "picture_link": ".3vDwSbC7cq.SMjxOZZZrCMuwokZG26"
    },
    {
        "title": "Peanut Butter and Jelly Burger",
        "ingredients": [
            "1 pound lean ground beef ADVERTISEMENT",
            "1/4 cup dried cranberries ADVERTISEMENT",
            "2 garlic cloves, minced ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 cup peanut butter ADVERTISEMENT",
            "4 onion Kaiser rolls, split and toasted ADVERTISEMENT",
            "1/4 cup strawberry jam ADVERTISEMENT",
            "1/4 cup crumbled goat cheese, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for medium-high heat and lightly oil the grate.\nCombine ground beef, dried cranberries, garlic, salt, and pepper together in a bowl; form into 4 patties.\nCook patties on the preheated grill until browned and cooked through, 5 to 7 minutes per side. An instant-read thermometer inserted into the center should read 160 degrees F (71 degrees C).\nSpread 1 tablespoon peanut butter onto the bottom layer of each roll; top with 1 burger. Spread 1 tablespoon strawberry jam on the top layer of each roll; sprinkle with 1 tablespoon goat cheese. Place strawberry jam-goat cheese-layered bun atop burger to make a sandwich.\n",
        "picture_link": "noO6U9oAtaD6Uh/tMWA4Ajh0fX7IoKu"
    },
    {
        "title": "Perfect Peach Cobbler",
        "ingredients": [
            "6 cups sliced peeled peaches ADVERTISEMENT",
            "1 mango - peeled, seeded, and diced ADVERTISEMENT",
            "1/4 cup rum (such as Appleton Estate®) ADVERTISEMENT",
            "1 teaspoon grated lemon zest ADVERTISEMENT",
            "1/4 teaspoon almond extract ADVERTISEMENT",
            "1/8 teaspoon ground cinnamon ADVERTISEMENT",
            "1 pinch ground nutmeg, or more to taste ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup stevia sugar substitute ADVERTISEMENT",
            "2 tablespoons stevia brown sugar substitute ADVERTISEMENT",
            "1 1/2 cups self-rising flour ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup stevia sugar substitute ADVERTISEMENT",
            "1 pinch ground cinnamon, or more to taste ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nStir peaches, mango, rum, lemon zest, almond extract, 1/8 teaspoon cinnamon, and nutmeg together in a bowl.\nStir water, 1/2 cup white sugar, 1/2 cup stevia sugar substitute, and brown sugar substitute together in a pot; bring to a simmer. Stir peach mixture into pot; cook and stir until peaches are heated through, about 5 minutes. Remove from heat.\nWhisk flour, 1/2 cup white sugar, 1/2 cup stevia sugar substitute, and a pinch of cinnamon together in a bowl; add milk and whisk to form a smooth batter.\nPour melted batter into the bottom of a Dutch oven. Pour batter over butter. Gently spread peach mixture with syrup on top of the batter.\nBake cobbler in the preheated oven until syrup is bubbling and crust is risen and golden brown, 50 to 55 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Swiss Ham Pie",
        "ingredients": [
            "1 pastry for a 9-inch single pie crust ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "1/8 teaspoon nutmeg ADVERTISEMENT",
            "1/8 teaspoon garlic salt ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 1/2 cups milk ADVERTISEMENT",
            "4 ounces shredded Swiss cheese ADVERTISEMENT",
            "3 eggs, slightly beaten ADVERTISEMENT",
            "1 cup diced ham ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Press pie crust into a 9-inch pie dish.\nMelt butter in a saucepan over medium heat. Cook and stir cornstarch, nutmeg, garlic salt, and black pepper into melted butter until cornstarch dissolves, 2 to 3 minutes. Pour milk into cornstarch mixture; cook and stir until thickened and bubbling, about 5 minutes.\nStir Swiss cheese into milk mixture; cook and stir until melted and cheese sauce is smooth, about 5 minutes.\nWhisk 1 to 2 tablespoons cheese sauce and eggs together in a bowl until eggs are warmed; pour into cheese sauce and whisk until incorporated, 1 to 2 minutes. Stir ham into cheese sauce; pour into pie shell.\nBake in the preheated oven until pie is set in the middle, 30 to 35 minutes. Let cool slightly before serving, 5 to 10 minutes.\n",
        "picture_link": "DrpwZOk4H8wXpDq9kEarCiqNEBVPkPy"
    },
    {
        "title": "Coffee-Crusted Beef Tenderloin Steak",
        "ingredients": [
            "1/4 cup finely ground espresso beans ADVERTISEMENT",
            "3 tablespoons brown sugar ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 pinch ground cayenne pepper ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 (6 ounce) beef tenderloin steaks ADVERTISEMENT",
            "1 tablespoon canola oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sift ground espresso beans, brown sugar, cinnamon, cayenne pepper, salt, and black pepper together in a bowl. Generously coat all sides of each steak with espresso mixture. Place steaks on a plate and refrigerate for flavors to blend, about 30 minutes.\nPreheat oven to 400 degrees F (200 degrees C).\nHeat a large oven-proof skillet over medium-high heat; add canola oil. Place steaks in the hot oil and cook until bottom of each steak is browned, 1 1/2 to 2 minutes. Flip steaks and place skillet in the preheated oven.\nCook the steaks in the preheated oven to your desired degree of doneness, 4 to 5 minutes for medium-rare. An instant-read thermometer inserted into the center should read 140 degrees F (60 degrees C). Cover skillet with a tented piece of aluminum foil and let steaks rest for at least 5 minutes.\n",
        "picture_link": "THD1iOGgoZscjfIudDYVrarjQFoExX6"
    },
    {
        "title": "Asian-Inspired Vegetable Noodle Bowl ",
        "ingredients": [
            "1 (8 ounce) package egg noodles ADVERTISEMENT",
            "3 1/2 cups vegetable stock ADVERTISEMENT",
            "2 tablespoons soy sauce ADVERTISEMENT",
            "1 tablespoon chopped fresh ginger ADVERTISEMENT",
            "1 teaspoon Asian chile sauce ADVERTISEMENT",
            "1 garlic clove, chopped ADVERTISEMENT",
            "5 1/2 ounces frozen spinach, thawed ADVERTISEMENT",
            "1 1/2 cups frozen green soybeans, thawed ADVERTISEMENT",
            "1 red bell pepper, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of water to a boil. Add noodles; cook until tender yet still firm to the bite, 1 to 2 minutes. Drain and divide among 4 large soup bowls.\nCombine vegetable stock, soy sauce, ginger, chile sauce, and garlic in a saucepan over medium heat; bring to a gentle simmer. Simmer until fragrant, about 5 minutes.\nSqueeze spinach to drain out excess moisture; coarsely chop. Add to stock with soybeans and red bell pepper; cook until heated through, about 1 minute. Ladle over noodles.\n",
        "picture_link": "9/G5tYQcpiIV53MdhLP/mDV3Vu4gBka"
    },
    {
        "title": "Shortcut Beef Noodle Bowl",
        "ingredients": [
            "1 (16 ounce) package linguine pasta ADVERTISEMENT",
            "3 cups broccoli florets ADVERTISEMENT",
            "3 carrots, peeled and sliced ADVERTISEMENT",
            "2 teaspoons vegetable oil ADVERTISEMENT",
            "1 pound beef sirloin steak, cut into strips ADVERTISEMENT",
            "1 1/2 cups Asian toasted sesame dressing (such as Kraft®) ADVERTISEMENT",
            "1/4 cup teriyaki sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook linguine until firm to the bite, about 9 minutes. Add broccoli and carrots; cook until linguine is tender, about 2 minutes more. Drain.\nHeat oil in a large nonstick skillet or wok. Add steak slices; cook and stir until browned on all sides, about 4 minutes. Stir in sesame dressing and teriyaki sauce. Cook until sauce is thickened, about 2 minutes.\nStir linguine, broccoli, and carrots into the sauce. Increase heat to high and cook until noodles are slightly browned, 2 to 3 minutes.\n",
        "picture_link": "OWFWum7qWtmAnZeaATz4nTAO4XyVc9G"
    },
    {
        "title": "Asiago Chicken Pasta",
        "ingredients": [
            "1 pound boneless chicken breast cutlets ADVERTISEMENT",
            "1 teaspoon kosher salt, divided ADVERTISEMENT",
            "1/2 teaspoon black pepper, divided ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 tablespoons unsalted butter ADVERTISEMENT",
            "1 (8 ounce) package sliced baby portobello mushrooms ADVERTISEMENT",
            "1 teaspoon minced garlic ADVERTISEMENT",
            "1 teaspoon fresh thyme leaves ADVERTISEMENT",
            "1 1/2 cups unsalted chicken stock or broth ADVERTISEMENT",
            "1/2 cup half-and-half ADVERTISEMENT",
            "9 ounces fresh linguine pasta ADVERTISEMENT",
            "1/3 cup grated Asiago cheese ADVERTISEMENT",
            "2 cups baby spinach leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Season chicken with 1/2 teaspoon salt and 1/4 teaspoon pepper; coat chicken with flour on both sides, shaking off any excess (wash hands).\nPreheat large saute on medium-high 2-3 minutes. Place oil and butter in pan, cook chicken 2-3 minutes on each side or until browned and 165 degrees F. Remove chicken from pan.\nPlace mushrooms, garlic, thyme, remaining 1/2 teaspoon salt, and 1/4 teaspoon pepper in pan; cook and stir 2 minutes. Cut pasta in half.\nStir in stock, half-and-half, and pasta; cook and stir 3-4 minutes or until pasta is tender. Stir in cheese and spinach; cook 1 minute or until cheese melts. Serve chicken over pasta.\n",
        "picture_link": "14pF58y1usFxA.8pSSNQdWKOCtZv2au"
    },
    {
        "title": "Taco Chili from Publix®",
        "ingredients": [
            "1 1/2 pounds ground beef ADVERTISEMENT",
            "2 (10 ounce) cans diced tomatoes and green chiles, undrained ADVERTISEMENT",
            "1 (15 ounce) can chili beans in sauce, undrained ADVERTISEMENT",
            "1 (15 ounce) can kidney beans, undrained ADVERTISEMENT",
            "1 (15.25 ounce) can southwest-style corn with peppers, drained ADVERTISEMENT",
            "1 (15.5 ounce) can hominy, drained ADVERTISEMENT",
            "1 (10 ounce) can mild enchilada sauce ADVERTISEMENT",
            "1 (1 ounce) packet taco seasoning mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat large, nonstick saute pan on medium-high 2-3 minutes. Place beef in pan (wash hands); brown 5-7 minutes, stirring to crumble meat, or until no pink remains. Stir in taco seasoning; remove meat from pan.\nCombine remaining ingredients in slow cooker; stir in meat. Cover and cook on HIGH 3-4 hours or LOW 6-8 hours. Serve.\n",
        "picture_link": "2UqWaZUWEsfz778lBzmk2DOP2Vdb/hm"
    },
    {
        "title": "Mexican Stuffed Shells",
        "ingredients": [
            "36 jumbo pasta shells ADVERTISEMENT",
            "1 pound lean ground beef ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "1 (1.25 ounce) package taco seasoning mix ADVERTISEMENT",
            "1 (16 ounce) can refried beans ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1 (4 ounce) can chopped green chiles ADVERTISEMENT",
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "3/4 cup picante sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBring a large pot of lightly salted water to a boil. Cook elbow macaroni in the boiling water, stirring occasionally until tender yet firm to the bite, 8 to 10 minutes. Drain well.\nHeat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; drain and discard grease. Add water and taco seasoning mix and simmer until thickened, about 5 minutes.\nStir refried beans, Cheddar cheese, and green chiles into ground beef; cook and stir until cheese is melted and mixture is smooth, about 5 minutes. Fill shells with beef mixture.\nCombine tomato sauce and picante sauce in a saucepan over medium-low heat; cook and stir until heated through, 5 to 7 minutes. Spread 1/2 cup sauce in the bottom of a 9x13-inch baking dish.\nArrange stuffed shells side-by-side in the baking dish and top with remaining sauce. Cover dish with aluminum foil.\nBake in the preheated oven for 40 minutes. Let stand for 5 minutes before serving.\n",
        "picture_link": "4tZfXiYSkP0IgI7T1q.j1NwKP9WsvV6"
    },
    {
        "title": "Baby Food: Plum",
        "ingredients": [
            "4 plums - peeled, pitted, and cut into small chunks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Bring water to a boil. Add plums, cover, and steam until tender, about 10 minutes.\nTransfer plums to a food processor and blend, adding water from the saucepan as needed, until desired consistency is reached. Allow pureed plums to reach room temperature before serving or freezing.\n",
        "picture_link": "cVb2aFCJ24RpdnmaCLCuDeUqDncm6rK"
    },
    {
        "title": "Superfast Asian Noodle Bowl for 1",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "1/2 jalapeno pepper, very thinly sliced ADVERTISEMENT",
            "1 (3 ounce) package chicken-flavored ramen noodles ADVERTISEMENT",
            "2 mushrooms, thinly sliced ADVERTISEMENT",
            "3 wedges lime, juiced ADVERTISEMENT",
            "1 green onion, sliced ADVERTISEMENT",
            "1 tablespoon cilantro leaves ADVERTISEMENT",
            "1/4 teaspoon garlic chile paste ADVERTISEMENT",
            "1/8 teaspoon sesame oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water to a boil in a saucepan. Stir in jalapeno; cook for 2 minutes. Add ramen noodles with seasoning packet and mushrooms. Cook until noodles are tender, about 5 minutes.\nLadle noodle mixture into a bowl; garnish with lime juice, green onion, cilantro, garlic chile paste, and sesame oil.\n",
        "picture_link": "48iCF7gc1kLeT02M27mUkmS5YrSW9sa"
    },
    {
        "title": "Elote Grilled Corn",
        "ingredients": [
            "1/3 cup mayonnaise ADVERTISEMENT",
            "1/3 cup sour cream ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1 teaspoon Archer Farms™ ancho chile powder ADVERTISEMENT",
            "8 ears corn, grilled ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir mayonnaise, sour cream, garlic and lime juice in small bowl. Combine cheese and chili powder in another small bowl.\nSpread mayo mixture onto warm ears of corn. Sprinkle with cheese mixture. Serve warm.\n",
        "picture_link": "UnSs2wnXb8pfVfKlSm9rCzNqrwTBI3a"
    },
    {
        "title": "Creamed Banana Baby Food ",
        "ingredients": [
            "1 ripe banana, sliced into small pieces ADVERTISEMENT",
            "1/4 cup heavy whipping cream ADVERTISEMENT",
            "1 pinch white sugar (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine banana, cream, and sugar in a blender; blend until creamy.\n",
        "picture_link": "hlmb99N81XljgbUKIca09pixZzTUin2"
    },
    {
        "title": "Italian Meringue Buttercream",
        "ingredients": [
            "5 egg whites ADVERTISEMENT",
            "1 pinch cream of tartar ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "2/3 cup water ADVERTISEMENT",
            "2 cups unsalted butter, chilled and cubed ADVERTISEMENT",
            "1 teaspoon pure vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour egg whites into the bowl of a stand mixer fitted with a whisk attachment; beat on low speed until foamy. Add cream of tartar, increase speed to medium-high, and beat until stiff peaks form.\nCombine sugar and water in a small saucepan over medium heat; bring to a boil. Cook until syrup reads 240 degrees F (115 degrees C) on a candy thermometer or until a small amount of syrup dropped into cold water forms a soft ball that flattens when placed on a flat surface.\nIncrease mixer speed to high and pour syrup in a slow and steady stream down the side of the bowl, beating until meringue is no longer steaming, 2 to 3 minutes. Beat in butter one cube at a time until buttercream reaches a soft and spreadable consistency, 3 to 5 minutes. Beat in vanilla extract.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Simple Herb Salad Mix",
        "ingredients": [
            "1 (5 ounce) bag mesclun lettuce salad mix ADVERTISEMENT",
            "1 (5 ounce) package baby spinach ADVERTISEMENT",
            "1 (5 ounce) package baby arugula ADVERTISEMENT",
            "1 small head endive, sliced ADVERTISEMENT",
            "1/4 cup coarsely chopped parsley ADVERTISEMENT",
            "1/4 cup coarsely chopped dill ADVERTISEMENT",
            "1/4 cup coarsely chopped tarragon (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place mesclun lettuce, baby spinach, baby arugula, endive, parsley, dill, and tarragon in a large bowl; fold gently to mix together.\nTransfer mixture to a a gallon-size resealable plastic bag and seal, pressing out as much air as possible to avoid condensation. Store in the refrigerator.\n",
        "picture_link": "kDWsqkAMNhSG3wvIvnxhwQBGhwrbvgO"
    },
    {
        "title": "Fresh Asparagus and White Bean Salad",
        "ingredients": [
            "1 1/4 cups dried Great Northern beans ADVERTISEMENT",
            "2 red bell peppers, seeded and sliced ADVERTISEMENT",
            "1 1/2 pounds fresh asparagus, trimmed and cut into 1-inch pieces ADVERTISEMENT",
            "Dressing: ADVERTISEMENT",
            "1/2 cup olive oil ADVERTISEMENT",
            "1/4 cup red wine vinegar ADVERTISEMENT",
            "1/4 cup minced fresh parsley ADVERTISEMENT",
            "2 tablespoons minced shallot ADVERTISEMENT",
            "1/4 teaspoon kosher salt ADVERTISEMENT",
            "1/8 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place Great Northern beans into a large container and cover with several inches of cool water; let stand 8 hours to overnight. Drain.\nPlace beans in a pot and cover with salted water; bring to a boil. Reduce heat and simmer until beans are tender, about 45 minutes. Drain and run beans under cold water to cool.\nCombine red bell peppers and asparagus in a pot and cover with water; bring to a boil and cook until tender, about 3 minutes. Drain and rinse under cold water.\nWhisk olive oil, vinegar, parsley, shallot, salt, and pepper together in a bowl until dressing is smooth.\nCombine beans, red bell pepper, and asparagus in a bowl; pour 2/3 of the dressing over mixture and toss gently. Add more dressing if desired.\n",
        "picture_link": "G7b4LFtJwpi.RxPacU4tMB8g6qt832y"
    },
    {
        "title": "Sunflower Cocktail",
        "ingredients": [
            "2 (1.5 fluid ounce) jiggers gin (such as Aviation® or Hendrick's®) ADVERTISEMENT",
            "2 (1.5 fluid ounce) jiggers orange-flavored liqueur (such as Cointreau®) ADVERTISEMENT",
            "2 (1.5 fluid ounce) jiggers elderflower liqueur (such as St. Germain®) ADVERTISEMENT",
            "2 (1.5 fluid ounce) jiggers lemon juice ADVERTISEMENT",
            "crushed ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine gin, orange-flavored liqueur, elderflower liqueur, and lemon juice with some crushed ice in a cocktail shaker. Cover and shake until the outside of shaker has frosted. Strain into 2 glasses.\n",
        "picture_link": "2bCZi.7RKlHZTigr5IDL4fe2wa0qbma"
    },
    {
        "title": "Apple Crostata",
        "ingredients": [
            "Crust: ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1/2 cup cold butter, cubed ADVERTISEMENT",
            "3 tablespoons water ADVERTISEMENT",
            "1/4 teaspoon vanilla extract ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "3 tablespoons all-purpose flour ADVERTISEMENT",
            "5 small apples - peeled, cored, and sliced ADVERTISEMENT",
            "Topping: ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine 1 1/2 cup flour, 2 tablespoons sugar, and salt in a large bowl. Cut in butter using 2 knives or a pastry cutter until mixture resembles coarse crumbs.\nMix water and vanilla extract together in a small bowl. Stir into flour mixture, 1 tablespoon at a time, until dough comes together. Gently roll into a ball and flatten slightly. Wrap with plastic wrap and chill until firm, about 30 minutes.\nToss apples with 1/2 cup sugar and 3 tablespoons flour in a large bowl.\nPreheat oven to 400 degrees F (200 degrees C). Line a baking sheet with parchment paper.\nRoll dough out to a 12-inch circle on a floured work surface. Transfer to the baking sheet. Arrange apple slices in the center of the circle, leaving a 2-inch border all around. Fold up border over apples, pinching together slightly.\nCombine 1 tablespoon sugar and cinnamon in a small bowl. Sprinkle over apples.\nBake crostata in the preheated oven until crust is golden brown, 30 to 40 minutes.\n",
        "picture_link": "/ZXVq806mH8laG6xp5Lye/37pO1glF."
    },
    {
        "title": "Amazing Apple Crostata",
        "ingredients": [
            "Crust: ADVERTISEMENT",
            "1 3/4 cups all-purpose flour ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "3/4 cup chilled unsalted butter, cut into small pieces ADVERTISEMENT",
            "2 tablespoons ice water, or more if needed ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "1 lemon, halved ADVERTISEMENT",
            "6 small Gala apples, peeled and thinly sliced ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix flour, 2 tablespoons sugar, and salt together with an electric mixer until combined. Mix in butter until mixture resembles coarse meal. Add ice water, 2 teaspoons at a time, while the mixer is running until dough just holds together. Test dough by pinching a small amount between your fingers; if it is crumbly, add a 1 teaspoon more ice water at a time.\nWrap dough in plastic wrap and chill until slightly firm, 20 to 30 minutes.\nPreheat oven to 350 degrees F (175 degrees C).\nSqueeze 1/2 the lemon over the apple slices to keep from browning.\nPlace a large piece of parchment paper on a flat work surface. Roll dough into a round 12 to 16 inches in diameter, 1/4 to 1/2-inch thick. Arrange apple slices in 2 layers on the dough, leaving a 1 1/2 to 2-inch border all around. Fold up the border, pleating the edge to make it fit; leave most of the apples uncovered.\nCombine 1/2 cup sugar and cinnamon in a small bowl. Sprinkle over apples. Squeeze remaining 1/2 lemon over apples. Sprinkle 2 teaspoons sugar over crust. Transfer parchment paper to a baking sheet.\nBake in the preheated oven until crust is golden brown, 50 to 60 minutes.\n",
        "picture_link": "Rvj8pLRTlKekhsz14lPEeHkUOtyRpCW"
    },
    {
        "title": "Rebellion Sauerkraut",
        "ingredients": [
            "1 (16 ounce) jar sauerkraut ADVERTISEMENT",
            "1 cup hard apple cider ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine sauerkraut and hard cider in a small slow cooker.\nCook on High until very tender, about 3 hours.\n",
        "picture_link": "GTLlNXcXYPeXaArXzpeIfyzly5PIzfK"
    },
    {
        "title": "Orange Sriracha Shrimp",
        "ingredients": [
            "1 (12 ounce) package frozen popcorn shrimp ADVERTISEMENT",
            "1/2 cup freshly squeezed orange juice ADVERTISEMENT",
            "1 tablespoon reduced-sodium soy sauce ADVERTISEMENT",
            "2 tablespoons rice vinegar ADVERTISEMENT",
            "4 tablespoons orange marmalade ADVERTISEMENT",
            "1 teaspoon sriracha hot sauce ADVERTISEMENT",
            "1/4 teaspoon finely grated ginger root ADVERTISEMENT",
            "1/2 cup sliced green onions, divided ADVERTISEMENT",
            "1 (8.8 ounce) pouch cooked basmati rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F. Line baking sheet with foil. Arrange shrimp in single layer on baking sheet. Cook shrimp following package instructions.\nCombine in medium saucepan: orange juice, soy sauce, rice vinegar, marmalade, sriracha sauce, ginger, and 1/4 cup green onions; bring to boil on medium-high. Cook 1 minute; remove pan from heat. Pour sauce into large bowl; stir in remaining 1/4 cup green onions.\nHeat rice following package instructions. Add shrimp to sauce and toss to coat. Serve with rice.\n",
        "picture_link": "k13AIl35KUglg86KgOHY8MkqYJflAG."
    },
    {
        "title": "Seaside Pasta with Vegetables",
        "ingredients": [
            "8 ounces bow tie pasta ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 (6 ounce) fillets fresh salmon ADVERTISEMENT",
            "1/2 teaspoon kosher salt ADVERTISEMENT",
            "4 cloves garlic, finely chopped ADVERTISEMENT",
            "1 pint grape tomatoes ADVERTISEMENT",
            "2 cups broccoli florets, cut into bite-size pieces ADVERTISEMENT",
            "1/2 cup chicken broth ADVERTISEMENT",
            "1 lemon, zested and juiced ADVERTISEMENT",
            "1/2 cup crumbled reduced-fat feta cheese ADVERTISEMENT",
            "2 tablespoons coarsely chopped fresh dill ADVERTISEMENT",
            "1/4 teaspoon red pepper flakes (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Prepare pasta following package instructions.\nPreheat large saute pan on medium-high 2-3 minutes. Place oil in pan. Season salmon with salt; cook 1-2 minutes on each side or until browned.\nAdd garlic, tomatoes, broccoli, and broth; cook and stir 3-4 minutes or until salmon separates easily with a fork. Cut salmon into small bite-size pieces.\nAdd pasta, lemon juice and zest, feta, dill, and red pepper flakes; toss to combine. Serve.\n",
        "picture_link": "CfTo6b6/BQle5YMyyhS4MvALNvN5jZC"
    },
    {
        "title": "Cherry Sport Drink",
        "ingredients": [
            "32 fluid ounces water ADVERTISEMENT",
            "1 teaspoon sea salt ADVERTISEMENT",
            "3 cups tart cherry juice (such as Knudsen®) ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water and salt to a boil in a pot until salt is dissolved, 3 to 4 minutes. Stir cherry juice and lemon juice into salted water. Remove pot from heat and chill in refrigerator, about 4 hours.\n",
        "picture_link": "NAIBh2/jKwLHp1d8bh9yW.c6n4Jdm7y"
    },
    {
        "title": "Lamb au Gratin",
        "ingredients": [
            "1 pound ground lamb ADVERTISEMENT",
            "2 cups sliced fresh mushrooms ADVERTISEMENT",
            "1 large onion, diced small ADVERTISEMENT",
            "2 carrots, diced small ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1 (1 ounce) package dry onion soup mix ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "2 cups milk ADVERTISEMENT",
            "1 cup shredded sharp Cheddar cheese ADVERTISEMENT",
            "1 cup shredded Havarti cheese ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "3 large potatoes, thinly sliced ADVERTISEMENT",
            "salt and ground black pepper, to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Thoroughly grease a covered baking dish.\nHeat a large skillet over medium-high heat. Cook and stir ground lamb in the hot skillet until some of the fat begins to render; add onion, carrots, and garlic. Continue to cook and stir the mixture until the lamb is completely browned and crumbly, 5 to 7 minutes. Stir soup mix into the lamb mixture; remove skillet from heat.\nMelt butter in a saucepan over medium heat. Whisk flour into butter, 1 tablespoon at a time, making sure there are no lumps between additions. Pour milk into the butter mixture while whisking; continue to whisk until the milk thickens and the mixture is smooth.\nSwitch heat below saucepan to 'off.' Stir Cheddar cheese and Havarti cheese into the milk mixture until the cheese is melted and the sauce is smooth.\nSpoon a small amount of the cheese sauce into the beaten egg in a bowl; whisk together to temper the egg. Pour the tempered egg into the cheese sauce and stir.\nArrange sliced potatoes in the bottom of the prepared baking dish, overlapping to make a layer about 1/2-inch deep; season with salt and pepper. Pour about 1/3 of the cheese sauce over the potatoes and spread into an even layer. Spread the lamb mixture evenly atop the cheese sauce layer. Layer remaining potatoes atop the lamb; season again with salt and pepper. Pour remaining cheese over the top. Cover baking dish.\nBake in preheated oven until the potatoes are tender, about 90 minutes. Remove cover and continue baking until the top browns, about 30 minutes more.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Caesar Salad Bites",
        "ingredients": [
            "2 heads romaine lettuce, ribs removed ADVERTISEMENT",
            "1/2 cup Caesar salad dressing ADVERTISEMENT",
            "1/2 cup shredded Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Arrange romaine leaves onto a serving platter. Drizzle Caesar dressing down the middle of each leaf and sprinkle Parmesan cheese over dressing.\n",
        "picture_link": "kHGzoIvWHGmWo5tEondekvooMhS2XG."
    },
    {
        "title": "Exquisite Pulled Pork",
        "ingredients": [
            "1 teaspoon extra-virgin olive oil ADVERTISEMENT",
            "1 onion, thickly sliced ADVERTISEMENT",
            "6 pounds pork butt roast ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "5 cloves garlic, minced ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes (optional) ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "1/2 cup molasses ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "3 tablespoons Worcestershire sauce ADVERTISEMENT",
            "3 tablespoons balsamic vinegar ADVERTISEMENT",
            "1/2 teaspoon sea salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour 1 teaspoon olive oil into a slow cooker and arrange sliced onion over oil. Place pork roast over onion.\nCook on Low until pork is very tender, 8 to 9 hours. Transfer roast to a platter and discard onion and liquid. Shred pork with two forks.\nHeat remaining 2 tablespoons olive oil in a stock pot over medium heat; cook and stir chopped onion, garlic, and red pepper flakes until onion is translucent, about 5 minutes. Add shredded pork, tomato paste, molasses, brown sugar, Worcestershire sauce, balsamic vinegar, salt, and black pepper; stir well. Cover and simmer until sauce is thickened, stirring occasionally, about 30 minutes.\n",
        "picture_link": "srmLhzn2GCEiJ1CC/WzezpzwzbMr5va"
    },
    {
        "title": "Walnut Rugelach",
        "ingredients": [
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "3 tablespoons unsalted butter ADVERTISEMENT",
            "3 tablespoons cream cheese, softened ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "Filling: ADVERTISEMENT",
            "1 egg white ADVERTISEMENT",
            "1 cup ground walnuts ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 tablespoon confectioners' sugar, or more as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Sift flour, baking powder, and salt together onto a sheet of waxed paper.\nBeat 1/4 cup white sugar, butter, and cream cheese together in a bowl with an electric mixer until creamy. Beat in egg yolk and vanilla.\nStir flour mixture into butter mixture until dough is just combined. Divide dough into 3 equal portions; shape each portion into a disk, wrap disks in plastic wrap, and refrigerate for at least 4 hours or overnight.\nBeat egg white in a bowl with an electric mixture until frothy. Mix walnuts and 1/2 cup white sugar into egg white.\nPreheat oven to 350 degrees F (175 degrees C).\nRemove dough from plastic wrap and roll each disk out into a 7-inch circle. Spread 1/3 the egg white mixture onto each dough circle, leaving a 1/4-inch border around the edge of each circle. Cut each circle into 12 wedges. Roll up each wedge from the edge to the point and place, point-side down, on a baking sheet.\nBake in the preheated oven until lightly browned, 12 to 14 minutes. Transfer to wire racks to cool and dust with confectioners' sugar.\n",
        "picture_link": "CEK35YNjw0etTAVbJAIgWRw64EA2ZVy"
    },
    {
        "title": "Eyeballs for Halloween Spaghetti",
        "ingredients": [
            "12 cherry tomatoes ADVERTISEMENT",
            "12 mini fresh mozzarella balls ADVERTISEMENT",
            "4 black olives ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "With a sharp paring knife, cut an oval 'rugby ball' shape into each cherry tomato and scoop out the flesh. The cherry tomato should resemble an eye socket.\nPlace a mozzarella ball (eyeball) in each of the cherry tomatoes (eye socket).\nSlice the olives so that each yields 4 'o'-shaped pieces; place 1 slice onto each mozzarella eyeball to form the 'pupil.' If the black olives do not sit very well, you may wish to use a paring knife to make a shallow round cut in the mozzarella to push the olive slice in, holding the 'pupil' in place.\n",
        "picture_link": "GagQooILC/Uz7DxVrmaD0CpfjlPWvIO"
    },
    {
        "title": "Italian Salami Appetizer Kebabs",
        "ingredients": [
            "12 fully cooked frozen meatballs (1/2-oz. each), thawed ADVERTISEMENT",
            "12 large fresh basil leaves ADVERTISEMENT",
            "12 cherry tomatoes ADVERTISEMENT",
            "12 small fresh mozzarella cheese balls* ADVERTISEMENT",
            "6 slices deli-sliced Margherita® Genoa or Hard Salami, halved ADVERTISEMENT",
            "12 (4 inch) bamboo skewers or cocktail sticks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In skillet over medium heat cook meatballs 5 to 6 minutes or until heated through; turn frequently to brown.\nTo assemble kebabs, wrap 1 basil leaf around 1 cherry tomato; thread onto skewer. Thread 1 heated meatball. Wrap 1 mozzarella ball with a halved salami slice; thread onto skewer. Repeat with remaining ingredients to form 12 skewers.\n",
        "picture_link": "3PXViEtZb0LPF41Ro203iPd105XVuAW"
    },
    {
        "title": "Grandma's Cocktail Meatballs",
        "ingredients": [
            "2 pounds ground beef ADVERTISEMENT",
            "1/4 cup crushed saltine crackers ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 (1 ounce) package dry onion soup mix ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "14 ounces apple jelly ADVERTISEMENT",
            "13 ounces ketchup ADVERTISEMENT",
            "1/2 cup red wine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix together beef, crackers, egg, and onion soup mix in a bowl; shape into about 50 1-inch balls.\nHeat oil in a non-stick skillet over medium-high heat. Brown meatballs in hot oil, about 2 minutes per side.\nStir apple jelly and ketchup together in a large pot over medium-high heat; cook and stir until the jelly melts and the mixture is smooth. Stir the wine into the jelly mixture, add the meatballs, reduce heat to medium-low, and cook at a simmer until the meatballs are cooked through, about 25 minutes.\n",
        "picture_link": "105fb7eDImahvKa1s5oQ0aVScyogoqC"
    },
    {
        "title": "Mashed Sweet Potatoes with Goat Cheese",
        "ingredients": [
            "3 pounds sweet potatoes, peeled and cubed ADVERTISEMENT",
            "1/2 cup half-and-half ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "2 ounces goat cheese ADVERTISEMENT",
            "1 tablespoon maple syrup, or more to taste (optional) ADVERTISEMENT",
            "1/2 teaspoon dried rubbed sage ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place sweet potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain and transfer sweet potatoes to a large bowl.\nMash sweet potatoes with half-and-half and butter with a potato masher until butter is melted; add goat cheese, maple syrup, sage, and paprika. Stir potatoes until evenly seasoned.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Coffee and Cream Cocktail",
        "ingredients": [
            "4 ice cubes, or as desired ADVERTISEMENT",
            "1 1/2 fluid ounces coffee-flavored liqueur ADVERTISEMENT",
            "1 1/2 fluid ounces Irish cream liqueur ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a small glass with ice cubes; pour in coffee-flavored liqueur and Irish cream liqueur. Stir well.\n",
        "picture_link": "Xt9ghM92D8zRfRyzJYUMUJi6MKNlwRi"
    },
    {
        "title": "Frozen Mango Madness",
        "ingredients": [
            "4 cups ice ADVERTISEMENT",
            "1 cup vodka, or more to taste ADVERTISEMENT",
            "1 mango, peeled and seeded ADVERTISEMENT",
            "1/2 cup triple sec, or more to taste ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend ice, vodka, mango, triple sec, and lemon juice in a blender until smooth.\n",
        "picture_link": "vEDw0lHkrdEqu/lu65pN7memY.vR/Tq"
    },
    {
        "title": "Coffee Liqueur Chiller",
        "ingredients": [
            "2 cups strong brewed coffee, room temperature ADVERTISEMENT",
            "2 cups skim milk ADVERTISEMENT",
            "2 cups ice cubes ADVERTISEMENT",
            "3 fluid ounces coffee-flavored liqueur ADVERTISEMENT",
            "2 (.55 ounce) packages hot cocoa mix ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ice cubes, for serving ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend coffee, milk, 2 cups ice cubes, coffee-flavored liqueur, cocoa mix, sugar, and vanilla extract in a blender until smooth and frothy.\nFill 6 glasses with ice cubes; pour blended coffee mixture over ice.\n",
        "picture_link": "JMZf.QaDm/JQzh6BPmfLgPGbqGthds."
    },
    {
        "title": "Cinnamon Raisin Kugel ",
        "ingredients": [
            "1 (8 ounce) package egg noodles ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "3/4 cup sour cream ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 cup butter, softened ADVERTISEMENT",
            "1/4 cup golden raisins ADVERTISEMENT",
            "3 large eggs, slightly beaten ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "Topping: ADVERTISEMENT",
            "1 cup crushed corn flakes ADVERTISEMENT",
            "2 tablespoons melted butter ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Butter an 8x8-inch baking dish.\nBring a large pot of lightly salted water to a boil. Cook egg noodles in the boiling water, stirring occasionally until cooked through but firm to the bite, about 5 minutes. Drain.\nWhisk milk, sour cream, 1/2 cup white sugar, 1/4 cup softened butter, raisins, eggs, and 1/2 teaspoon cinnamon together in a bowl. Mix noodles into the milk mixture; pour into the prepared baking dish.\nMix corn flakes, 2 tablespoons melted butter, 2 tablespoons white sugar, and 1/2 teaspoon cinnamon together in a bowl until crumbly; sprinkle over noodle mixture.\nBake in the preheated oven until kugel is set in the middle, about 1 1/2 hours. Cut into 2-inch squares.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Contadina® Mini Meatloaves with Tomato Glaze",
        "ingredients": [
            "1 1/2 pounds lean ground beef ADVERTISEMENT",
            "1/4 cup finely chopped onion ADVERTISEMENT",
            "12 saltine crackers, finely crushed ADVERTISEMENT",
            "3 tablespoons Worcestershire sauce ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 (15 ounce) can CONTADINA® Tomato Sauce ADVERTISEMENT",
            "3 tablespoons packed brown sugar ADVERTISEMENT",
            "Mashed or roasted potatoes (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine beef, onion, cracker crumbs, Worcestershire and egg in a large bowl. Mix well with hands or a spoon.\nShape meat into 6 rectangular mini meatloaves, each about the size of a deck of cards (3-1/2 by 2x1/2 by 1/2-inch thick).\nHeat oil in a wide skillet over medium-high heat; brown meatloaves 3 to 4 minutes per side. Remove from pan and set aside. Drain fat from pan.\nAdd sauce and brown sugar to pan. Bring to a boil; reduce heat and simmer over medium heat 3 minutes, stirring frequently until slightly reduced. Return meatloaves to pan and spoon sauce over tops. Simmer, uncovered, over medium heat 5 minutes or until cooked through. Serve meatloaves and sauce with mashed or roasted potatoes, if desired.\n",
        "picture_link": "VzZaK4t1g2wlWcpevWRA2Lv.QF6tcFu"
    },
    {
        "title": "Chickpea Quinoa Mock Tuna Salad",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "1/2 cup quinoa ADVERTISEMENT",
            "1 (19 ounce) can chickpeas (garbanzo beans), rinsed and drained ADVERTISEMENT",
            "1 large carrot, peeled and roughly chopped ADVERTISEMENT",
            "1 rib celery, roughly chopped ADVERTISEMENT",
            "1/2 cup sunflower seeds ADVERTISEMENT",
            "1/4 cup shredded cabbage ADVERTISEMENT",
            "1/4 onion, chopped ADVERTISEMENT",
            "1/4 cup sliced almonds ADVERTISEMENT",
            "1/4 cup raisins ADVERTISEMENT",
            "1/2 cup reduced-fat mayonnaise ADVERTISEMENT",
            "2 tablespoons honey Dijon mustard ADVERTISEMENT",
            "1 tablespoon dried kelp flakes ADVERTISEMENT",
            "1 1/2 teaspoons sweet pickle relish ADVERTISEMENT",
            "1 teaspoon lemon juice ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "freshly ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring water and quinoa to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until quinoa is tender and water has been absorbed, 15 to 20 minutes. Fluff quinoa with a fork and refrigerate until cold.\nCombine chickpeas, carrot, celery, sunflower seeds, cabbage, and onion in a food processor and pulse until everything is roughly equal in size; transfer to a large bowl.\nStir quinoa, almonds, and raisins into the chickpea mixture; add mayonnaise, mustard, kelp flakes, relish, lemon juice, salt, and pepper. Stir the mixture until evenly seasoned.\n",
        "picture_link": "n9aom0ISjRAohkGPTTG4AIRiZumP1jq"
    },
    {
        "title": "Juicy Pulled Pork",
        "ingredients": [
            "1 (18 ounce) bottle hickory flavored barbeque sauce ADVERTISEMENT",
            "1 (16 ounce) package fresh mushrooms (optional) ADVERTISEMENT",
            "1 (14.5 ounce) can stewed tomatoes ADVERTISEMENT",
            "2 large onions, coarsely chopped ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/2 head garlic, peeled ADVERTISEMENT",
            "2 tablespoons malt vinegar ADVERTISEMENT",
            "1 pinch salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 cup water, if needed ADVERTISEMENT",
            "2 pounds pork chops ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine barbeque sauce, mushrooms, tomatoes, onion, brown sugar, garlic, vinegar, salt, and black pepper in a food processor or blender; pulse until mixture is blended but still chunky. If the mixture is too thick, add water.\nArrange pork chops in a baking dish and cover with barbeque sauce mixture; cover with aluminum foil.\nBake in the preheated oven until pork is very tender, about 3 hours. Shred pork with 2 forks.\n",
        "picture_link": "7IOQDAn32TQxGpk/tc7abYopfCRWAay"
    }
]