[
    {
        "title": "Creole Rice and Kidney Beans",
        "ingredients": [
            "1 1/2 cups water ADVERTISEMENT",
            "1 cup white rice ADVERTISEMENT",
            "1/2 cup coconut milk ADVERTISEMENT",
            "1/2 cup canned kidney beans ADVERTISEMENT",
            "1 teaspoon dried thyme ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "3 whole cloves ADVERTISEMENT",
            "1 small onion ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water, rice, coconut milk, kidney beans, thyme, and salt in a large pot. Stick cloves into onion and add to the pot. Bring to a boil; simmer, covered, until most of the liquid is absorbed, about 20 minutes. Uncover and cook until remaining liquid is reduced, about 5 minutes more.\n",
        "picture_link": "EX2XkF9yOXRgthxsHJrsZ5mDINlBLBC"
    },
    {
        "title": "Arroz con Leche (Rice Pudding)",
        "ingredients": [
            "2 cups water ADVERTISEMENT",
            "1 cup uncooked white rice ADVERTISEMENT",
            "2 1/2 cups milk ADVERTISEMENT",
            "2 tablespoons white sugar, or to taste ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 cinnamon stick ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water and rice in a bowl. Let soak, at least 30 minutes.\nBring water and rice to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until rice is tender and liquid has been absorbed, 20 to 25 minutes.\nStir milk, sugar, salt, and cinnamon stick into the saucepan. Simmer until thick and the consistency of pudding, about 20 minutes. Discard cinnamon stick before serving.\n",
        "picture_link": "kiTBU/6phNMfErdzMwvr8CdnepK0vTW"
    },
    {
        "title": "Banana Blackberry Protein Shake",
        "ingredients": [
            "2 cups almond milk ADVERTISEMENT",
            "1 cup vanilla Greek yogurt ADVERTISEMENT",
            "1 cup ice cubes (optional) ADVERTISEMENT",
            "3/4 cup fresh blackberries ADVERTISEMENT",
            "1 banana ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine almond milk, yogurt, ice cubes, blackberries, and banana in a blender; blend until smooth.\n",
        "picture_link": "BVNNyQF3cbvQqLCcLbAWKtRO70Y5Mla"
    },
    {
        "title": "Overnight Slow Cooker Breakfast Casserole",
        "ingredients": [
            "12 large eggs ADVERTISEMENT",
            "1 cup heavy cream (or half-and-half) ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon black pepper ADVERTISEMENT",
            "1/4 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1 (20 ounce) package refrigerated hash brown potatoes ADVERTISEMENT",
            "4 ounces shredded Parmesan cheese, divided ADVERTISEMENT",
            "8 ounces shredded mozzarella cheese, divided ADVERTISEMENT",
            "1 (5 ounce) package Jones Dairy Farm All Natural Golden Brown® Mild Sausage Links, sliced into coins ADVERTISEMENT",
            "1/2 cup chopped sun-dried tomatoes, divided ADVERTISEMENT",
            "1/2 cup chopped fresh basil, divided ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Spray slow cooker with non-stick cooking spray.\nIn medium bowl combine eggs and cream; whisk until well combined. Sprinkle onion powder, salt and both peppers over egg mixture while whisking. Whisk until completely combined. Set aside.\nIn slow cooker, combine hash browns and about 1/2 of each of Parmesan cheese, mozzarella cheese, sausage, sun-dried tomatoes and basil. Using fingers, gently toss until combined. Pour egg mixture over top; if necessary use spatula to smooth out top.\nSet aside about 1/2 of remaining mozzarella cheese (approximately 2 ounces). Sprinkle remaining ingredients over top of casserole. Cover slow cooker and cook for 6-8 hours on low or until center is cooked through. A thermometer inserted into center should read 160 degrees F.\nSprinkle casserole with remaining cheese, serve and enjoy!\n",
        "picture_link": ".AKd2Xyl2CYx9vgkCtIBBcuIh45JJ56"
    },
    {
        "title": "Crispy Cheddar Mashed Potato Puffs",
        "ingredients": [
            "Chive Cream: ADVERTISEMENT",
            "3/4 cup sour cream, divided ADVERTISEMENT",
            "1 teaspoon finely chopped chives or green onions ADVERTISEMENT",
            "Cheddar Crisps: ADVERTISEMENT",
            "8 ounces Borden® Medium Cheddar Cheese Chunk, divided ADVERTISEMENT",
            "Potato Puffs: ADVERTISEMENT",
            "2 medium russet potatoes, peeled and chopped ADVERTISEMENT",
            "2 tablespoons Borden® Butter ADVERTISEMENT",
            "1/8 teaspoon garlic powder ADVERTISEMENT",
            "1/8 teaspoon seasoned salt ADVERTISEMENT",
            "1/8 teaspoon dry mustard ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "15 bacon strips, cooked crisp and crumbled ADVERTISEMENT",
            "1 cup beer batter dry mix ADVERTISEMENT",
            "Oil, as needed for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "MIX 1/2 cup sour cream and chopped chives together in a small bowl. Refrigerate.\nPreheat oven to 400 degrees F. Shred 1/2 of cheese to make about 1 cup of shreds. Divide shreds into 8 piles, about 2-inches apart, on a silicone baking mat or parchment paper lined cookie sheet and bake about 5 minutes or until cheese melts and becomes crisp. Let cool 5 minutes and remove from baking sheet. Reduce oven temperature to 180 degrees F.\nCut the remaining 4 oz. cheese into 8 1/2-inch cubes. Form balls of mashed potato mixture, using an ice cream scoop. Make a small hole in center of each potato ball and fill with one cube Borden® Cheese. Cover with additional mashed potato so cheese is hidden inside. Refrigerate until ready to fry.\nHeat oil in a large saucepan over medium-high heat to 375 degrees F. Prepare beer batter according to package directions; dip each mashed potato ball into batter, and deep-fry for about 5 minutes or until golden brown. Remove from oil, and drain on paper towel. Reheat oil to 375 degrees F between batches. Keep potato puffs warm in the holding oven.\nPlace potato puff on a plate; top with dollop of chive cream, a few chives and the Cheddar crisp. Serve immediately.\n",
        "picture_link": "AinkNDQJs96IcFlo79XwDHb1MpOjvOa"
    },
    {
        "title": "Silpancho from Cochabamba, Bolivia",
        "ingredients": [
            "4 cups water ADVERTISEMENT",
            "2 cups white rice ADVERTISEMENT",
            "6 potatoes, peeled ADVERTISEMENT",
            "1/2 cup vegetable oil, divided ADVERTISEMENT",
            "3 cups bread crumbs ADVERTISEMENT",
            "1 1/2 pounds beef top sirloin, thinly sliced ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "3 onions, diced ADVERTISEMENT",
            "2 tomatoes, diced ADVERTISEMENT",
            "2 red chile peppers (locoto), chopped ADVERTISEMENT",
            "3 tablespoons olive oil, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring 4 cups water and rice to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until rice is tender and liquid has been absorbed, 20 to 25 minutes.\nPlace potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain. Cool until easily handled, about 5 minutes. Cut into 1/2-inch slices.\nHeat 1/4 cup vegetable oil in a deep skillet. Cook sliced potatoes in batches until golden brown, about 2 minutes per side. Drain on paper towels.\nPour bread crumbs into a shallow bowl. Season beef with salt and press into the bread crumbs until evenly coated.\nHeat remaining 1/4 cup vegetable oil in the deep skillet. Cook beef in batches until browned, about 1 1/2 minutes per side. Drain on paper towels.\nHeat a large nonstick skillet over medium heat. Crack in eggs and cook until set, about 5 minutes.\nCombine onions, tomatoes, chile peppers, and olive oil in a bowl. Season with salt.\nLayer rice, potatoes, beef, and fried eggs on serving plates. Top with onion and tomato mixture.\n",
        "picture_link": "uxsFePxmVYfANQ3riPbhsHKR5cGt/O6"
    },
    {
        "title": "Haitian-Style Fried Chicken",
        "ingredients": [
            "3 pounds chicken legs ADVERTISEMENT",
            "1 cup lemon juice ADVERTISEMENT",
            "1/2 white onion, chopped ADVERTISEMENT",
            "1 head garlic, cloves separated and minced ADVERTISEMENT",
            "3 tablespoons seasoned salt ADVERTISEMENT",
            "3 tablespoons paprika ADVERTISEMENT",
            "3 tablespoons ground thyme ADVERTISEMENT",
            "2 tablespoons ground black pepper ADVERTISEMENT",
            "2 tablespoons whole cloves ADVERTISEMENT",
            "vegetable oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine chicken legs, lemon juice, onion, garlic, seasoned salt, paprika, thyme, pepper, and cloves in a large bowl. Cover and marinate in the refrigerator for at least 12 hours.\nHeat oil in a deep-fryer or large saucepan over medium-high heat. Fry chicken in batches until golden brown, about 8 minutes per side. Drain on paper towels.\n",
        "picture_link": "uta9eq12N1MBBD/exVl3Y.dTeLuIQaK"
    },
    {
        "title": "Breakfast Cheesesteaks",
        "ingredients": [
            "6 large eggs, divided ADVERTISEMENT",
            "2 tablespoons milk ADVERTISEMENT",
            "4 thick slices bread ADVERTISEMENT",
            "1 (5 ounce) package Jones Dairy Farm All Natural Golden Brown® Chicken Sausage Patties ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 red bell pepper, thinly sliced ADVERTISEMENT",
            "1/2 green bell pepper, thinly sliced ADVERTISEMENT",
            "1/2 small red onion, thinly sliced ADVERTISEMENT",
            "2 slices provolone cheese ADVERTISEMENT",
            "Salt and pepper, to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In medium bowl, whisk together 2 eggs and milk; dip bread into egg mixture until fully coated. Cook French toast on griddle or large skillet over medium heat until golden brown on both sides.\nCook sausage patties according to package instructions. Cut into strips.\nIn separate skillet, heat olive oil over medium heat. Add garlic, peppers and onions and saute until browned and tender.\nAdd cooked sausage strips to pepper and onion mixture; top with cheese and heat until cheese is melted.\nCook remaining eggs over easy, or as desired.\nAssemble cheesesteaks by layering french toast with eggs, and pepper, sausage and cheese mixture. Season with salt & pepper and serve open-faced.\n",
        "picture_link": "r/atVGVopLoEepbplfMn7oUdeyKmJs."
    },
    {
        "title": "Butterscotch Pudding Pancakes",
        "ingredients": [
            "2 cups pancake mix (such as Bisquick®) ADVERTISEMENT",
            "1/3 cup instant butterscotch pudding mix ADVERTISEMENT",
            "1 cup milk ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix pancake mix and pudding mix together in a bowl; add milk and eggs and stir until batter is smooth.\nHeat a lightly oiled griddle over medium-high heat. Drop batter by large spoonfuls onto the griddle and cook until bubbles form and the edges are dry, 3 to 4 minutes. Flip and cook until browned on the other side, 2 to 3 minutes. Repeat with remaining batter.\n",
        "picture_link": "DbGlGySKz6lfdEiKIAvp3w4gcqxcJyS"
    },
    {
        "title": "Mario's Coconut Lemon Curd",
        "ingredients": [
            "3 eggs ADVERTISEMENT",
            "1/2 cup coconut oil, thinly sliced ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 lemon, juiced ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a saucepan with enough water to come about 1 inch up the side. Bring to a simmer over medium-low heat.\nCombine eggs, coconut oil, sugar, lemon juice, and salt in a large bowl. Set the bowl on top of the saucepan so it is over, but not touching, the simmering water. Cook, whisking constantly, until curd is smooth and the consistency of pudding, 6 to 8 minutes.\nRemove bowl from the saucepan and continue whisking curd until slightly cooled, 2 to 3 minutes. Cover with plastic wrap and refrigerate until cold and slightly thickened, about 1 hour.\n",
        "picture_link": "kvymDmSnTkMtwSY7GTLuT4OVx5UbQMe"
    },
    {
        "title": "Zucchini Bruschetta",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 clove garlic, crushed ADVERTISEMENT",
            "1 zucchini, cubed ADVERTISEMENT",
            "1 tomato, cubed and drained ADVERTISEMENT",
            "1 dash balsamic vinegar ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "2 leaves fresh basil, chopped, or more to taste ADVERTISEMENT",
            "1 small French baguette, thinly sliced ADVERTISEMENT",
            "1/2 cup feta cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large skillet over medium heat. Add garlic; cook and stir until golden, about 2 minutes. Add zucchini; cook, stirring occasionally, until starting to soften, 5 to 7 minutes.\nRemove skillet from heat and stir in tomato, balsamic vinegar, salt, and pepper. Let cool, about 5 minutes. Stir in basil.\nLet zucchini mixture marinate in the refrigerator, 20 minutes to overnight.\nSpread zucchini mixture over baguette slices. Sprinkle feta cheese on top.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Pumpkin Bread Pudding with Crumb Topping",
        "ingredients": [
            "12 slices white sandwich bread, or as needed, cubed ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "1 (15 ounce) can pumpkin puree ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup unsalted butter, melted and cooled ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup light brown sugar ADVERTISEMENT",
            "2 tablespoons maple syrup (optional) ADVERTISEMENT",
            "1 teaspoon pumpkin pie spice ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "Crumb Topping: ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "3/4 cup light brown sugar ADVERTISEMENT",
            "1/2 cup unsalted butter, at room temperature ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 cup chopped walnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bread cubes in a bowl. Cover and let stand until stale, 8 hours to overnight.\nPreheat oven to 350 degrees F (175 degrees C). Grease a 7x11-inch baking dish with cooking spray.\nWhisk pumpkin puree, eggs, milk, 1/2 cup melted butter, white sugar, 1/2 cup brown sugar, maple syrup, pumpkin pie spice, vanilla extract, and salt together in a large bowl. Add bread cubes a few at a time, folding until mixture is moist but not soupy. Pour into the baking dish.\nCombine flour, 3/4 cup brown sugar, 1/2 cup butter, and cinnamon in a bowl; crumble together with your fingers. Stir in walnuts; sprinkle over the baking dish.\nBake in the preheated oven until center is set and crumb topping is golden brown, about 1 hour.\n",
        "picture_link": "GBCjadRZPx1rttAn2a52lO9loCkJhC6"
    },
    {
        "title": "Loaded Double Potato Bites",
        "ingredients": [
            "2 white potatoes, cut into 1/4-inch slices ADVERTISEMENT",
            "1 tablespoon olive oil, or as needed ADVERTISEMENT",
            "3 cloves garlic, smashed ADVERTISEMENT",
            "1 pinch dried thyme, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 pound bacon ADVERTISEMENT",
            "4 russet potatoes, peeled and quartered ADVERTISEMENT",
            "1 quart chicken broth ADVERTISEMENT",
            "1 cup butter ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1 tablespoon chopped fresh chives, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nPlace white potato slices on a baking sheet and drizzle olive oil over each; season with garlic, thyme, salt, and pepper.\nRoast in the preheated oven until tender, about 30 minutes.\nPlace bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels and crumble.\nPlace russet potatoes into a large pot and cover with chicken broth; bring to a boil. Reduce heat to medium-low and simmer until tender, about 20 minutes. Drain.\nMash boiled russet potatoes with butter in a bowl until evenly mixed; mix in crumbled bacon, Cheddar cheese, and milk. Transfer mashed potato mixture to a piping bag with a large star tip or plastic bag with a corner snipped. Pipe mashed potato mixture onto each roasted potato slice and top with chives.\n",
        "picture_link": "ys7CcHIE.AFPoW/FlsjTW4oJVlbPURS"
    },
    {
        "title": "Bacon Spinach Artichoke Pizza",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 cloves garlic, diced ADVERTISEMENT",
            "1 tablespoon whole wheat flour ADVERTISEMENT",
            "1 teaspoon freshly cracked black pepper ADVERTISEMENT",
            "3/4 cup 2% reduced-fat milk ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "1 (12 inch) prepared whole wheat pizza crust (such as Boboli®) ADVERTISEMENT",
            "1 cup baby spinach ADVERTISEMENT",
            "1 cup shredded reduced-fat mozzarella cheese ADVERTISEMENT",
            "1/2 cup diced cooked chicken ADVERTISEMENT",
            "1/2 cup artichoke hearts, drained ADVERTISEMENT",
            "1/2 cup crumbled reduced-fat feta cheese ADVERTISEMENT",
            "2 strips cooked bacon, crumbled ADVERTISEMENT",
            "1 teaspoon red pepper flakes (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nHeat olive oil in a large skillet over medium heat. Add garlic; cook and stir until fragrant, about 30 seconds. Sprinkle in flour and black pepper; cook, whisking constantly, for 1 minute. Pour in milk; whisk constantly until sauce thickens, about 3 minutes. Remove from heat; stir in Parmesan cheese.\nLay pizza crust on a piece of parchment paper. Spread sauce over crust. Add spinach in an even layer. Sprinkle mozzarella cheese evenly on top. Cover with chicken, artichoke hearts, feta cheese, and bacon. Sprinkle red pepper flakes on top.\nBake in the preheated oven until cheese is melted and golden, about 12 minutes.\n",
        "picture_link": "/7htv/g/2u5tNSbbUHBoSXSan7MlWOy"
    },
    {
        "title": "Potato-Stuffed Poblanos Reverse Potato Skins",
        "ingredients": [
            "Sauce: ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1/4 cup salsa verde ADVERTISEMENT",
            "1 tablespoon chopped fresh cilantro ADVERTISEMENT",
            "Potatoes: ADVERTISEMENT",
            "4 russet potatoes, peeled and chopped ADVERTISEMENT",
            "8 poblano peppers ADVERTISEMENT",
            "8 slices bacon ADVERTISEMENT",
            "1/2 red bell pepper, diced ADVERTISEMENT",
            "1/2 onion, diced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix sour cream, salsa verde, and cilantro together in a bowl until sauce is evenly mixed; refrigerate.\nPlace potatoes into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, about 10 minutes. Drain and cool in a large bowl.\nSet oven rack about 6 inches from the heat source and preheat the oven's broiler. Line a baking sheet with aluminum foil and place peppers on the baking sheet.\nCook under the preheated broiler until the skin of the peppers has blackened and blistered, 3 to 4 minutes. Place blackened peppers into a bowl and tightly seal with plastic wrap. Allow peppers to steam as they cool, about 20 minutes.\nPlace bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Reserve 1 tablespoon bacon grease in the skillet. Drain bacon slices on paper towels and chop.\nCombine red bell pepper, onion, and garlic in the skillet with reserved bacon grease; cook and stir over medium heat until vegetables are softened, 4 to 6 minutes.\nMix 1/2 of the bacon, red bell pepper mixture, Cheddar cheese, milk, and butter into the potatoes; mash until well blended.\nRemove skins from the roasted poblano peppers. Make a small cut in each pepper and scrape out seeds. Stuff peppers with potato mixture and top with remaining bacon and sauce.\n",
        "picture_link": "9BKFLlZi1iGSPACwFx.IyhgU8RwuxCG"
    },
    {
        "title": "Lettuce Wrap Tacos",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "1 clove garlic, chopped ADVERTISEMENT",
            "1 (16 ounce) garbanzo beans, drained and rinsed ADVERTISEMENT",
            "1 tablespoon taco seasoning mix ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "3/4 cup chicken broth ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 head iceberg lettuce, halved ADVERTISEMENT",
            "1 avocado, sliced ADVERTISEMENT",
            "1 tomato, chopped ADVERTISEMENT",
            "1 (3 ounce) can sliced black olives ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large skillet. Add onion; cook and stir until translucent, about 5 minutes. Add garlic; cook and stir until fragrant, about 2 minutes.\nStir garbanzo beans, taco seasoning, and cumin into the skillet. Pour in chicken broth and cover. Bring to a boil; reduce heat to low and simmer until soft, about 10 minutes. Mash mixture with potato masher. Season with salt and pepper.\nPull lettuce \"cups\" out of the center of each half. Fill with garbanzo bean mixture. Top with avocado, tomato, and olives.\n",
        "picture_link": "9BJRsvIKZIywvjih2EQFDywjBAOMXde"
    },
    {
        "title": "Prosciutto-Wrapped Stuffed Potato Bites",
        "ingredients": [
            "12 small purple potatoes, scrubbed and halved ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "3 ounces goat cheese ADVERTISEMENT",
            "1 clove garlic, chopped ADVERTISEMENT",
            "1 tablespoon chopped fresh rosemary ADVERTISEMENT",
            "1 (3 ounce) package prosciutto, cut into 5 strips per piece ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nTrim potato halves so they sit flat on a baking sheet. Scoop out flesh into a bowl.\nTransfer potato skins to a baking sheet. Drizzle olive oil on top; season with salt and pepper.\nBake in the preheated oven until lightly browned, 8 to 10 minutes.\nBring a small saucepan of water to a boil. Add potato flesh; cook until soft, about 10 minutes.\nStrain potato flesh into a bowl and mash with goat cheese, garlic, and rosemary. Fill potato skins with mashed mixture. Wrap a slice of prosciutto around each potato skin.\nBake in the preheated oven until golden brown, about 10 minutes.\n",
        "picture_link": "E8eyZ6aYqepEwzWZAEDAucCCuFDhYJW"
    },
    {
        "title": "Easy Pumpkin Bread Pudding ",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "6 cups cubed whole wheat bread ADVERTISEMENT",
            "2 cups fat free half-and-half ADVERTISEMENT",
            "1 (15 ounce) can pumpkin puree ADVERTISEMENT",
            "1 1/2 cups white sugar ADVERTISEMENT",
            "3 eggs, lightly beaten ADVERTISEMENT",
            "1/2 cup raisins ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "3 tablespoons butter, melted ADVERTISEMENT",
            "2 teaspoons pumpkin pie spice ADVERTISEMENT",
            "1 teaspoon grated orange zest ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 7x11-inch baking dish with cooking spray.\nPlace bread cubes in the greased baking dish. Pour half-and-half on top.\nMix pumpkin puree, sugar, eggs, raisins, pecans, butter, pumpkin pie spice, and orange zest together in a large bowl. Pour over the bread.\nBake in the preheated oven until middle is set and edges are golden, 50 to 60 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Southwestern Breakfast Stacks",
        "ingredients": [
            "3 russet potatoes, cut into 1/2-inch-thick rounds ADVERTISEMENT",
            "3 tablespoons canola oil, divided ADVERTISEMENT",
            "1 red bell pepper, cut into 1/2-inch slices ADVERTISEMENT",
            "1 green bell pepper, cut into 1/2-inch slices ADVERTISEMENT",
            "1 yellow onion, diced ADVERTISEMENT",
            "3 mushrooms, diced ADVERTISEMENT",
            "1 pound pork sausage ADVERTISEMENT",
            "1 (7 ounce) can canned chipotle peppers, minced ADVERTISEMENT",
            "1/2 cup shredded Monterey Jack cheese ADVERTISEMENT",
            "1 tablespoon chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nPlace potatoes in a bowl and drizzle 1 tablespoon canola oil over potatoes; toss to coat. Spread potatoes onto a baking sheet.\nBake in the preheated oven for 15 minutes; flip potatoes and continue baking until tender and lightly browned, about 15 minutes more.\nHeat 1 tablespoon canola oil in a skillet over medium-high heat; cook and stir red bell pepper and green bell pepper until softened, about 10 minutes. Transfer to a bowl.\nPour 1 tablespoon canola oil into the same skillet over medium-high heat; add onion and mushrooms. Cook and stir until onions are translucent and mushrooms are lightly browned, about 10 minutes. Transfer onion mixture to bowl with peppers.\nCook and stir sausage in the same skillet over medium heat until browned and crumbly, 5 to 7 minutes. Add chipotle peppers and cook until heated through, 2 to 3 minutes.\nLayer potato rounds in a serving dish; top with sausage, pepper and onion mixture, Monterey Jack cheese, and cilantro.\n",
        "picture_link": "jFJfL6irHWdrv3n7iCQGDwO3abVolyi"
    },
    {
        "title": "Tuscan-Herbed Roasted Potatoes",
        "ingredients": [
            "1 pound petite potatoes, quartered ADVERTISEMENT",
            "8 white mushrooms, sliced ADVERTISEMENT",
            "1/4 yellow onion, diced ADVERTISEMENT",
            "1/2 red bell pepper, diced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "2 tablespoons extra-virgin olive oil ADVERTISEMENT",
            "sea salt and ground black pepper to taste ADVERTISEMENT",
            "3 slices prosciutto ADVERTISEMENT",
            "4 fresh basil leaves, chopped ADVERTISEMENT",
            "2 teaspoons chopped fresh parsley ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C). Line a baking sheet with non-stick aluminum foil.\nCombine potatoes, mushrooms, onion, red bell pepper, garlic, olive oil, salt, and pepper in a large bowl until evenly coated. Spread potato mixture onto the prepared baking sheet.\nRoast in the preheated oven for 15 minutes. Remove baking sheet from oven, stir potato mixture, and continue roasting until potatoes are crisp, about 20 minutes more.\nPlace prosciutto in a skillet over medium-high heat; cook and stir until slightly crisp, 3 to 4 minutes. Transfer prosciutto to a cutting board and chop.\nTop potato mixture with prosciutto, basil, parsley, and Parmesan cheese.\n",
        "picture_link": "p00wFxBz2GIM7ikPiuzsaZl7nch.uCu"
    },
    {
        "title": "Riced Cauliflower",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 head cauliflower, grated ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 cup salsa ADVERTISEMENT",
            "2 green onions, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large skillet over medium heat. Add cauliflower and cook until tender, about 10 minutes; season with salt and pepper. Stir salsa and green onions into cauliflower.\n",
        "picture_link": "P8wn.Jo01rjwF4LdeyrZbwQKOfFXpAO"
    },
    {
        "title": "Avocado Greek Omelet",
        "ingredients": [
            "3 eggs ADVERTISEMENT",
            "3/4 cup feta cheese ADVERTISEMENT",
            "1/2 avocado, diced ADVERTISEMENT",
            "1/2 cup diced tomatoes ADVERTISEMENT",
            "1/4 cup chopped Kalamata olives ADVERTISEMENT",
            "1 tablespoon chopped fresh basil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk eggs in a small bowl until smooth.\nPreheat a nonstick skillet over medium heat. Pour in eggs. Scatter feta cheese, avocado, tomatoes, olives, and basil over 1 side. Cook until bottom is golden brown, about 5 minutes. Fold over; cook until center is set, about 3 minutes more.\n",
        "picture_link": "6jMpUGn0AWqNfMuvCGOUVDJYZJtWIPS"
    },
    {
        "title": "Butternut Squash and Beef Lasagna ",
        "ingredients": [
            "2 butternut squash - peeled, seeded, and thinly sliced ADVERTISEMENT",
            "2 tablespoons olive oil, or to taste ADVERTISEMENT",
            "1 tablespoon Italian seasoning, divided, or to taste ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 (28 ounce) jar pasta sauce ADVERTISEMENT",
            "2 tablespoons brown sugar ADVERTISEMENT",
            "1 tablespoon chopped fresh basil ADVERTISEMENT",
            "2 1/2 teaspoons salt, divided ADVERTISEMENT",
            "1 (16 ounce) container ricotta cheese ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "2 tablespoons dried parsley ADVERTISEMENT",
            "1 (8 ounce) ball fresh mozzarella cheese, shredded ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Line 2 baking sheets with parchment paper.\nArrange butternut squash slices in a single layer on each baking sheet. Drizzle 1 tablespoon of olive oil over each layer; season each with 1 teaspoon Italian seasoning, salt, and pepper.\nBake in the preheated oven until squash is soft but still firm to the bite, about 15 minutes.\nHeat a large skillet over medium heat; cook and stir beef and garlic until browned, about 5 minutes. Drain grease. Mix in remaining 1 teaspoon Italian seasoning, pasta sauce, brown sugar, basil, and 1 1/2 teaspoon salt. Simmer, stirring occasionally, until flavors combine, about 10 minutes.\nMix remaining 1 teaspoon salt, ricotta cheese, eggs, 1/2 cup Parmesan cheese, and parsley together in a bowl.\nLayer 1/3 of the squash slices in the bottom of a 9x13-inch baking dish. Cover squash with 1/2 of the ricotta mixture, 1/2 of the mozzarella cheese and 1/3 of the beef mixture. Repeat layers, ending with remaining squash slices and sauce. Sprinkle 2 tablespoons Parmesan cheese on top.\nBake in the preheated oven until cheeses are melted and sauce is bubbly, about 30 minutes. Let stand for 10 minutes before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Baba's Best Sorrel Soup",
        "ingredients": [
            "1/2 cup unsalted butter ADVERTISEMENT",
            "1 cup sliced onion ADVERTISEMENT",
            "5 large cloves garlic, minced ADVERTISEMENT",
            "12 cups tightly packed sorrel leaves, stems and veins removed ADVERTISEMENT",
            "4 cups chicken stock ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "3 potatoes, peeled and diced ADVERTISEMENT",
            "1 large carrot, peeled and cut into matchsticks ADVERTISEMENT",
            "1 cup chopped fresh parsley ADVERTISEMENT",
            "3 sprigs fresh dill, chopped, or to taste ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1/4 teaspoon ground cayenne pepper, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Melt butter in a large Dutch oven over medium heat. Add onion and garlic; cook and stir until soft, about 5 minutes. Add sorrel in batches, stirring well until wilted, 5 to 8 minutes in all.\nPour chicken stock and water into the Dutch oven. Stir in potatoes, carrot, parsley, dill, lemon juice, black pepper, and cayenne pepper. Simmer soup until flavors combine, about 1 hour.\nPuree soup with an immersion blender until mostly smooth before serving.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Potato Bombs",
        "ingredients": [
            "2 tablespoons olive oil, divided ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "24 baby red potatoes ADVERTISEMENT",
            "1 cup shredded smoked Gouda cheese ADVERTISEMENT",
            "1/4 teaspoon onion powder ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 pound bacon, cut into thirds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nHeat 1 tablespoon olive oil in a skillet over medium; cook and stir garlic until fragrant, about 1 minute.\nPlace potatoes in a microwave-safe bowl; add 1 tablespoon olive oil and toss to coat. Heat in the microwave until potatoes are tender enough to easily poke with a fork, about 6 minutes. Cool until easily handled.\nSlice potatoes in half and scoop filling into a bowl. Set potato skins aside.\nMash garlic, potato filling, Gouda cheese, onion powder, salt, and pepper together in a bowl. Fill potato skins with potato mixture and sandwich the potato halves together. Wrap a bacon slice around each filled potato and place on a baking sheet.\nBake in the preheated oven until bacon is cooked and crisp, 15 to 20 minutes.\n",
        "picture_link": "gBgMK6ycC7GzG4erY9xeC9EjRzGhy8S"
    },
    {
        "title": "Blonde Brownies with White Chocolate and Cranberries",
        "ingredients": [
            "1 1/4 cups all-purpose flour ADVERTISEMENT",
            "1 teaspoon baking powder ADVERTISEMENT",
            "1 1/3 cups brown sugar ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup white chocolate chips ADVERTISEMENT",
            "1 cup dried cranberries ADVERTISEMENT",
            "Reynolds Wrap® Aluminum Foil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F. Line an 8x8x2-inch baking pan with Reynolds Wrap(R) Aluminum Foil.\nWhisk together flour and baking powder.\nCombine brown sugar and butter in a large bowl. Mix until fully incorporated. Add egg, vanilla and flour mixture and continue mixing until fully incorporated. Fold in the chocolate chips and cranberries.\nPour batter into prepared pan and bake for 35 to 40 minutes or until edges are firm and starting to pull away from sides of the pan.\nCool on a wire rack for 15 minutes before serving.\n",
        "picture_link": "BDFYM/GKtFfkQedX2Sc4COoeQN5IA1a"
    },
    {
        "title": "Baked Zucchini Parmesan Fries",
        "ingredients": [
            "1/2 cup coconut flour ADVERTISEMENT",
            "2 egg whites ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 cup almond meal ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "1 teaspoon Italian seasoning ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "4 zucchini, quartered lengthwise ADVERTISEMENT",
            "1 teaspoon chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C). Line a baking sheet with parchment paper.\nPour coconut flour into a bowl.\nWhisk egg whites and water together in a bowl.\nCombine almond meal, Parmesan cheese, Italian seasoning, and pepper in another bowl.\nDredge batches of zucchini in coconut flour using tongs. Dip in beaten egg whites; toss in almond meal mixture until coated. Arrange on the lined baking sheet.\nBake in the preheated oven until slightly golden, about 20 minutes. Garnish with parsley.\n",
        "picture_link": "pDn/cKyhv9Mgyohki6pdDH/nHM8pHLu"
    },
    {
        "title": "Mom's Comforting Chicken Stew",
        "ingredients": [
            "2 potato, diced ADVERTISEMENT",
            "2 carrots, diced ADVERTISEMENT",
            "1/2 cup green peas ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 cup diced boneless chicken ADVERTISEMENT",
            "1 clove garlic, or more to taste, minced ADVERTISEMENT",
            "10 mushrooms, sliced ADVERTISEMENT",
            "1 green onion, chopped ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "1 cup chicken stock ADVERTISEMENT",
            "1/2 cup heavy whipping cream ADVERTISEMENT",
            "1/2 teaspoon mustard powder ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons chopped cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a saucepan of water to a boil. Add potatoes and carrots; cook until softened, about 8 minutes. Add peas; cook until tender, about 2 minutes. Drain.\nHeat butter in a heavy skillet until melted. Add chicken and garlic; cook and stir until lightly browned, about 5 minutes. Stir in mushrooms and green onion; cook until softened, about 2 minutes. Stir in flour and cook for 1 minute.\nStir chicken stock, heavy cream, mustard powder, salt, and pepper into the skillet. Simmer until thickened, about 5 minutes. Fold in potatoes, carrots, and peas; cook until warmed through, about 2 minutes. Remove stew from heat and garnish with cilantro.\n",
        "picture_link": "ZZ6mEah2iu1e22Afv9.gICeVJ1PhGyy"
    },
    {
        "title": "Kale, Avocado, and Black Bean Salad",
        "ingredients": [
            "Jalapeno-Lime Dressing: ADVERTISEMENT",
            "3 tablespoons olive oil ADVERTISEMENT",
            "3 tablespoons lime juice ADVERTISEMENT",
            "1 tablespoon minced jalapeno pepper (seeds and membranes removed) ADVERTISEMENT",
            "1 teaspoon honey ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/4 teaspoon ground coriander ADVERTISEMENT",
            "sea salt to taste ADVERTISEMENT",
            "Salad: ADVERTISEMENT",
            "1 large bunch kale, ribs removed and leaves thinly sliced ADVERTISEMENT",
            "1 (14 ounce) can black beans, rinsed and drained ADVERTISEMENT",
            "1 avocado, diced ADVERTISEMENT",
            "1/2 cup crumbled feta cheese ADVERTISEMENT",
            "1/3 cup pecans ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1/2 cup chopped fresh cilantro leaves ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk olive oil, lime juice, jalapeno pepper, honey, cumin, coriander, and sea salt together in a bowl until dressing is smooth.\nPlace kale in a bowl and sprinkle sea salt over kale. Massage salt into the kale until leaves are darker in color and fragrant. Drizzle enough dressing over kale to lightly coat. Gently fold in black beans, avocado, and feta cheese.\nPlace pecans into a skillet and sprinkle sugar and 1/8 teaspoon salt over pecans; cook and stir over medium-low heat until fragrant and sugar is dissolved, 3 to 5 minutes. Cool pecans and chop.\nDistribute salad among serving bowls and top with toasted pecans and cilantro.\n",
        "picture_link": "sL6t/wCBrj/wE2gHeI/Df3PehsFitIi"
    },
    {
        "title": "Pear and Almond Tart (Dairy- and Gluten-Free)",
        "ingredients": [
            "1 1/4 cups almond meal ADVERTISEMENT",
            "1/4 cup gluten-free oat flour ADVERTISEMENT",
            "1/2 teaspoon gluten-free baking powder ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1/4 cup maple syrup ADVERTISEMENT",
            "2 tablespoons coconut oil, melted ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/4 teaspoon sea salt ADVERTISEMENT",
            "1/4 teaspoon almond extract ADVERTISEMENT",
            "1 1/2 (16 ounce) cans pear halves, drained and patted dry ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease the bottom of tart pan with a removable bottom and line with parchment paper.\nMix almond meal, oat flour, and baking powder together in a bowl.\nWhisk egg, maple syrup, coconut oil, vanilla extract, salt, and almond extract together in another bowl. Fold in almond meal mixture to form a sticky dough.\nPress dough into the prepared tart pan. Arrange pears on top.\nBake in the preheated oven until golden brown, 22 to 25 minutes.\n",
        "picture_link": "JPCdm4uQxd4pw7oQeV2s35oHTRXLuYm"
    },
    {
        "title": "Cheesy Eggplant Rollatini ",
        "ingredients": [
            "kosher salt to taste ADVERTISEMENT",
            "2 eggplants, cut lengthwise into 1/4-inch slices ADVERTISEMENT",
            "1 pinch ground black pepper ADVERTISEMENT",
            "4 cups fresh spinach ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "1 clove garlic, minced, or more to taste ADVERTISEMENT",
            "1 teaspoon Italian seasoning, or to taste ADVERTISEMENT",
            "1 cup grated Parmigiano-Reggiano cheese ADVERTISEMENT",
            "1/2 cup ricotta cheese ADVERTISEMENT",
            "1 1/2 cups marinara sauce ADVERTISEMENT",
            "1 cup shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line a baking sheet with parchment paper.\nSprinkle kosher salt over eggplant slices. Let excess moisture drain from eggplant, 10 to 15 minutes. Pat dry with paper towels and transfer to baking sheet.\nBake in the preheated oven until softened, 8 to 10 minutes. Remove from oven and sprinkle with black pepper.\nCombine spinach, onion, and garlic in a saucepan over medium-low heat; cook and stir until spinach is wilted, 3 to 5 minutes. Season with Italian seasoning.\nMix Parmigiano-Reggiano cheese and ricotta cheese together in a bowl. Stir in spinach mixture until well-combined.\nSpread 2 spoonfuls of spinach mixture evenly over each eggplant slice. Roll up eggplant.\nSpread 1/4 cup marinara sauce in the bottom of a 9x13-inch baking dish. Arrange eggplant rolls seam-side down in the dish. Pour remaining marinara sauce over rolls. Cover with mozzarella cheese.\nBake in the preheated oven until bubbly and golden, about 1 hour. Cool for 5 to 10 minutes before serving.\n",
        "picture_link": "9MAsjud3FW3GT0knC7neUldIpO611kC"
    },
    {
        "title": "Marination's Korean Philly Cheese Steak",
        "ingredients": [
            "3/4 pound top round beef, thinly sliced ADVERTISEMENT",
            "1/2 cup Kalbi-style steak marinade, or as needed ADVERTISEMENT",
            "2 tablespoons oil, divided ADVERTISEMENT",
            "2 cups chopped onions ADVERTISEMENT",
            "1 cup diced jalapeno peppers ADVERTISEMENT",
            "1/2 cup chopped kimchi ADVERTISEMENT",
            "1 cup shredded American cheese ADVERTISEMENT",
            "1/4 cup mayonnaise ADVERTISEMENT",
            "4 sandwich rolls, split and toasted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix beef and marinade together in a bowl; set aside to marinate.\nHeat 1 tablespoon oil in a skillet over medium-high heat; saute onions until lightly golden but still firm, 5 to 10 minutes.\nHeat 1 tablespoon oil in a separate skillet over medium-high heat; saute jalapeno peppers until very lightly golden, about 5 minutes. Mix jalapeno peppers into onions. Add kimchi and cook until heated through, 2 to 3 minutes. Remove skillet from heat.\nHeat a separate skillet over medium-high heat and cook steak, stirring constantly, until browned and cooked through, about 5 minutes.\nReturn 3/4 cup kimchi mixture to skillet over medium heat; add 1/4 cup American cheese. Cover skillet and heat until cheese is melted, 2 to 3 minutes.\nSpread 1 tablespoon mayonnaise onto the bottom half of 1 roll and top with 1/4 of the beef. Layer kimchi-cheese mixture on top of beef and top with roll. Repeat with remaining ingredients to create 3 more sandwiches.\n",
        "picture_link": "lvbeFnITp2vVGire4EW3LXyYE7SxGX6"
    },
    {
        "title": "Rice Cooker Black Beans",
        "ingredients": [
            "1 cup dried black beans ADVERTISEMENT",
            "3 cups water, or more as needed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place black beans and cover with 3 cups water. Let sit for 5 minutes. Discard anything that floats to the surface. Drain.\nCover black beans with 3 more cups water. Let soak, 4 hours to overnight. Drain.\nCombine drained beans and 3 cups water in a rice cooker. Cook on the \"Porridge\" setting, adding more water if needed, until tender, about 2 hours. Drain.\n",
        "picture_link": "dmfcmzczyQrhSWV1OhxdZwLrZjIN4xm"
    },
    {
        "title": "Homemade Goldfish Treats",
        "ingredients": [
            "8 ounces shredded sharp Cheddar cheese ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup butter, cut into cubes ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "2 tablespoons cold water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine Cheddar cheese, flour, butter, and salt in a food processor; pulse until dough is consistency of course sand. Add water, 1 tablespoon at a time, until dough is moistened.\nWrap dough in plastic wrap and refrigerate for 20 minutes.\nPreheat oven to 350 degrees F (175 degrees C). Line a baking sheet with parchment paper.\nRoll dough onto a lightly floured work surface and cut into desired shapes using a cookie cutter. If you choose to use a fish cut-out, use a toothpick to make faces. Arrange shapes on the prepared baking sheet.\nBake in the preheated oven until golden brown and crispy, 15 to 16 minutes.\n",
        "picture_link": ".GwLQkFYvVsTVbpuy0JOw9hlzHoMd4W"
    },
    {
        "title": "Italian Artichoke Omelet",
        "ingredients": [
            "16 frozen artichoke hearts, thawed ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup extra-virgin olive oil, divided ADVERTISEMENT",
            "5 eggs ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Dust artichoke hearts with flour, shaking off any excess.\nHeat 6 tablespoons olive oil in a large skillet over high heat. Saute artichokes, stirring often, until lightly browned, about 8 minutes. Drain on paper towels. Discard oil.\nWhisk eggs lightly in a bowl; season with salt and pepper.\nHeat remaining 2 tablespoons olive oil in the skillet. Arrange artichokes in the skillet. Pour eggs over artichokes. Cook until lightly browned, 4 to 5 minutes. Flip omelet carefully and continue cooking until firm and lightly browned on second side, about 4 minutes more.\n",
        "picture_link": "i.lbaLBwNzWYqCUNzyPJV5lDV8LFZC."
    },
    {
        "title": "Grilled Lemongrass Chicken",
        "ingredients": [
            "1 shallot, minced ADVERTISEMENT",
            "2 stalks lemongrass, peeled and chopped ADVERTISEMENT",
            "1 Thai bird's eye chile pepper, seeded and chopped ADVERTISEMENT",
            "1 clove garlic, chopped ADVERTISEMENT",
            "1 teaspoon grated ginger ADVERTISEMENT",
            "1 tablespoon fish sauce ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "1 1/2 teaspoons oyster sauce ADVERTISEMENT",
            "1 pound skinless, boneless chicken breasts, cut into thin strips ADVERTISEMENT",
            "skewers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pound shallot, lemongrass, chile pepper, garlic, and ginger into a coarse paste in a mortar and pestle. Mix in fish sauce, vegetable oil, sugar, and oyster sauce.\nPlace chicken strips in a large resealable plastic bag; add paste and toss to coat. Let chicken marinate in the refrigerator, at least 1 hour.\nPreheat an outdoor grill for medium-high heat and lightly oil the grate.\nThread marinated chicken onto skewers. Grill until chicken is golden brown, 2 to 4 minutes per side.\n",
        "picture_link": "4k2f1cESRfUQMGVvhh8TC5npsJz.xEy"
    },
    {
        "title": "Spinach Artichoke Soup ",
        "ingredients": [
            "1 (32 ounce) container chicken broth ADVERTISEMENT",
            "1 1/2 cups shredded cooked chicken ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "2 large cloves garlic, chopped ADVERTISEMENT",
            "1 (10 ounce) package frozen chopped spinach, thawed ADVERTISEMENT",
            "1/2 (14 ounce) can quartered artichoke hearts, drained and chopped ADVERTISEMENT",
            "1/2 (8 ounce) package reduced-fat cream cheese (Neufchâtel) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine chicken broth, chicken, onion, and garlic in a large pot over medium heat. Bring to a boil; reduce heat and simmer until onion is tender, about 10 minutes.\nStir spinach and artichoke hearts into the pot. Bring broth back to a simmer. Drop in cream cheese in large spoonfuls, stirring continuously until melted, about 5 minutes.\n",
        "picture_link": "3.YIkXdfUPiOoGQdFZbiI/eVM95Coua"
    },
    {
        "title": "Pepperoni Monkey Bread",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "2 1/2 tablespoons olive oil ADVERTISEMENT",
            "1 (.7 ounce) package dry Italian salad dressing mix ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "24 frozen bread rolls (such as Bridgford®), thawed and cut into 3 pieces ADVERTISEMENT",
            "1 1/2 (8 ounce) packages pepperoni, sliced and quartered ADVERTISEMENT",
            "1 (8 ounce) package mozzarella cheese, cut into small cubes ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese, or to taste ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a fluted tube pan (such as Bundt(R)) with cooking spray.\nMix olive oil, Italian dressing mix, and garlic together in a large bowl.\nFlatten each dough piece with your fingers. Add 3 pieces of pepperoni and 2 cubes of mozzarella cheese; wrap dough around filling to form a ball. Transfer to the bowl with the olive oil mixture; mix until coated.\nArrange half of the dough balls around the bottom of the tube pan. Scatter pepperoni and mozzarella on top. Top with remaining dough balls. Sprinkle Parmesan cheese and oregano on top. Cover with aluminum foil.\nBake in the preheated oven until cheese melts, about 15 minutes. Uncover and continue baking until golden brown, 10 to 15 minutes. Cool in the pan for 5 minutes. Invert onto a serving plate.\n",
        "picture_link": "3syX4YgRjY.2BIDEw8pjaZR1aWGse1K"
    },
    {
        "title": "Sweet Vietnamese Coffee ",
        "ingredients": [
            "2 tablespoons sweetened condensed milk ADVERTISEMENT",
            "3 1/2 teaspoons ground coffee with chicory ADVERTISEMENT",
            "boiling water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour condensed milk into a coffee cup.\nUnscrew the top screen of the Vietnamese coffee filter. Add coffee; screw screen back on tightly. Set filter over the cup.\nFill the filter 1/4 of the way with boiling water. Wait until it passes through the filter, about 30 seconds. Loosen the top screen slightly. Fill the filter with boiling water. Cover with lid and wait until has passed through the filter, about 5 minutes. Remove filter.\n",
        "picture_link": "SwuoY9RQOpuFBLg8dYRsCuWj5xfn/E."
    },
    {
        "title": "Tomates Farcies (Stuffed Tomatoes)",
        "ingredients": [
            "4 large tomatoes ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 pound ground beef ADVERTISEMENT",
            "1/2 cup bread crumbs ADVERTISEMENT",
            "1 pinch herbes de Provence, or to taste ADVERTISEMENT",
            "1 pinch garlic powder, or to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nSlice tops off the tomatoes and reserve. Scoop out the pulp with a spoon and place, with juices, in a bowl.\nSprinkle some salt into each tomato and set upside down in a casserole dish to drain excess juice. Chop tomato flesh into smaller pieces and place in the casserole dish.\nCombine ground beef, bread crumbs, herbes de Provence, garlic powder, and black pepper in the bowl; mix together with your hands. Turn tomatoes over and stuff them with beef mixture so that a small amount rises over the top. Cover with reserved tops.\nRoll up any leftover beef mixture into small bowls and place in the casserole dish.\nBake in the preheated oven until tomatoes are tender and beef is cooked through, 40 to 45 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Farmhouse Roasted Potatoes",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 tablespoon dried parsley ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 pound petite potatoes ADVERTISEMENT",
            "1 pound bacon, cut into 1-inch pieces ADVERTISEMENT",
            "1 onion, sliced ADVERTISEMENT",
            "1 cup freshly grated Parmesan cheese ADVERTISEMENT",
            "1/2 lemon, zested ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nMix olive oil, garlic powder, parsley, and salt together in a large bowl; add potatoes and stir until coated. Mix bacon and onion into potato mixture. Spread potato mixture onto a baking sheet.\nRoast in the preheated oven until potatoes are tender and crisp, about 30 minutes. Toss potatoes with Parmesan cheese and top with lemon zest.\n",
        "picture_link": "pAxD66xXVadPzPXoyOlr2jhzIGVpK.S"
    },
    {
        "title": "Fresh Tomato, Lentil, and Chicken Bake",
        "ingredients": [
            "2 tablespoons coconut oil ADVERTISEMENT",
            "1 1/2 teaspoons ground turmeric, divided ADVERTISEMENT",
            "3/4 teaspoon salt, divided ADVERTISEMENT",
            "3/4 teaspoon ground black pepper, divided ADVERTISEMENT",
            "2 cups sprouted French green lentils, rinsed ADVERTISEMENT",
            "2 tablespoons fresh oregano, minced ADVERTISEMENT",
            "4 tomatoes, sliced 1/3-inch thick, or more to taste ADVERTISEMENT",
            "1/4 cup boiling water ADVERTISEMENT",
            "1 cooked chicken breast, cubed ADVERTISEMENT",
            "1 avocado - peeled, pitted, and cubed ADVERTISEMENT",
            "10 Kalamata olives, pitted and quartered ADVERTISEMENT",
            "1 teaspoon macadamia nut oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nPlace an 8x8-inch glass baking dish in the preheating oven to warm briefly. Remove and add coconut oil, 1 teaspoon turmeric, 1/4 teaspoon salt, and 1/4 teaspoon black pepper. Stir in lentils.\nBake in the preheated oven until lentils are warmed through, about 10 minutes.\nSprinkle 1/4 teaspoon salt, 1/4 teaspoon black pepper, and oregano over tomato slices. Remove lentils from the oven and layer tomato slices and accumulated juices on top. Pour boiling water over tomatoes.\nContinue baking until tomatoes soften, about 10 minutes.\nToss remaining 1/2 teaspoon turmeric powder, 1/4 teaspoon salt, 1/4 teaspoon black pepper, chicken, avocado, Kalamata olives, and macadamia nut oil together in a small bowl. Remove lentils from the oven and spread chicken mixture on top.\nReturn to the oven and bake until flavors combine, about 10 minutes more.\n",
        "picture_link": "CpZjsy1fpy/pVLrJKYCk1yNjsLd8I/W"
    },
    {
        "title": "Apple Cobbler Crisp",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "3 McIntosh apples, cored and sliced ADVERTISEMENT",
            "2 teaspoons ground cinnamon, divided ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "1/4 cup rolled oats ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup brown sugar, divided ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "1 tablespoon melted butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease an 8x8-inch baking dish with cooking spray.\nArrange apples in the bottom of the prepared baking dish; sprinkle with 1/2 teaspoon cinnamon.\nCombine flour, oats, white sugar, and 1/4 cup brown sugar in a bowl; mix in 1/2 teaspoon cinnamon. Stir in water and egg until smooth. Spread batter evenly over apple mixture.\nMix remaining 1/4 cup brown sugar and remaining 1 teaspoon cinnamon together in a bowl; sprinkle over batter. Dot with butter.\nBake in the preheated oven until golden, 45 to 50 minutes.\n",
        "picture_link": "XvqBhVwHOt5CaKK9UqtFbzc8nbNXmeO"
    },
    {
        "title": "Spinach Artichoke Omelet",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "1/4 cup canned artichoke hearts, rinsed and drained ADVERTISEMENT",
            "1 (9 ounce) bag fresh spinach ADVERTISEMENT",
            "1/4 cup chopped plum tomatoes ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1 dash ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Grease a nonstick skillet with cooking spray and heat over medium heat. Add onion; cook and stir until slightly softened, about 2 minutes. Add artichoke hearts and cook until heated through, 1 to 2 minutes. Stir in spinach and tomatoes; cook until spinach is wilted, about 5 minutes. Transfer to a bowl.\nWhisk eggs, water, and pepper together in a bowl.\nWipe out skillet; spray with cooking spray. Heat over medium heat. Pour in egg mixture; cook until mostly set, about 3 minutes. Gently push cooked edges into the center; tilt skillet so uncooked eggs flow underneath. Cook until set, 2 to 4 minutes. Spoon spinach mixture over 1 side of the omelet. Fold in half and serve.\n",
        "picture_link": "ckGXBVawcbPhEpIi0.0y/hKeowquh/q"
    },
    {
        "title": "Warm Italian Rice Salad with Sausage and Romaine",
        "ingredients": [
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "8 ounces ground mild Italian sausage ADVERTISEMENT",
            "5 large white button mushrooms, sliced ADVERTISEMENT",
            "1/2 teaspoon dried Italian seasoning ADVERTISEMENT",
            "1 (5.4 ounce) package Knorr® Rice Sides™ - Herb & Butter ADVERTISEMENT",
            "1/2 cup frozen peas, thawed ADVERTISEMENT",
            "1 head romaine lettuce, chopped ADVERTISEMENT",
            "5 ounces grape or cherry tomatoes, halved ADVERTISEMENT",
            "1/4 cup shredded Italian cheese blend ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in 12-inch skillet over medium heat; add sausage and cook and stir, crumbling into small pieces, until cooked through and no longer pink, 5 to 7 minutes. Remove cooked sausage from skillet with a slotted spoon; drain on paper-towel-lined plate. Pour off all but 1 tablespoon rendered fat.\nPlace mushrooms in skillet and cook over medium heat until tender, 2 to 3 minutes. Transfer from pan with slotted spoon to plate with sausage.\nPrepare Knorr(R) Rice Sides(TM) - Herb & Butter in skillet according to package directions. Stir dried Italian seasoning into the water; omit additional margarine. Three minutes before the rice is finished cooking, add the peas. When rice is done, stir in cooked sausage and mushrooms. Heat through.\nAdd romaine lettuce and tomatoes; toss lightly. Scoop into serving bowls; top each serving with desired amount of shredded cheese and serve immediately.\n",
        "picture_link": "koJNfqWNnlOVDu3wPu04Y5LXpDyVhRu"
    },
    {
        "title": "Artichoke Piccata",
        "ingredients": [
            "2 cups egg noodles ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "1 tablespoon capers with juice ADVERTISEMENT",
            "1 (14 ounce) can quartered artichoke hearts, drained ADVERTISEMENT",
            "lemon, juiced ADVERTISEMENT",
            "1/4 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1/3 cup Pinot Grigio wine ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a pot of water to a boil. Cook egg noodles in the boiling water, stirring occasionally until tender yet firm to the bite, about 6 minutes. Drain, reserving 1/2 cup cooking water.\nHeat olive oil in a 10-inch skillet. Add garlic and capers; cook and stir until fragrant, about 1 minute. Stir in artichoke hearts, lemon juice, and pepper; cook until lemon juice evaporates, about 2 minutes.\nPour wine into the skillet; cook until evaporated, about 3 minutes. Add butter and noodles; toss to combine. Stir in reserved cooking water; cook until sauce coats noodles, about 3 minutes.\n",
        "picture_link": "H5fIQ9kgWHfabN1soJs/ZTQbHqFjjWK"
    },
    {
        "title": "Gabe's Coffee-Crusted Hanger Steak with Apple, Fennel, and Herb Salad",
        "ingredients": [
            "Coffee Chile Spice Rub: ADVERTISEMENT",
            "1 tablespoon fennel seeds ADVERTISEMENT",
            "1 tablespoon cumin seeds ADVERTISEMENT",
            "1 tablespoon coriander seeds ADVERTISEMENT",
            "1/4 cup finely ground dark roast coffee beans ADVERTISEMENT",
            "1/4 cup ground ancho chile pepper ADVERTISEMENT",
            "1/4 cup brown sugar ADVERTISEMENT",
            "2 1/2 tablespoons kosher salt ADVERTISEMENT",
            "2 tablespoons hot smoked paprika ADVERTISEMENT",
            "2 teaspoons ground black pepper ADVERTISEMENT",
            "2 teaspoons red pepper flakes ADVERTISEMENT",
            "Steak: ADVERTISEMENT",
            "1 pound hanger steak ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 teaspoon olive oil ADVERTISEMENT",
            "4 shallots, halved ADVERTISEMENT",
            "3 cloves garlic, smashed ADVERTISEMENT",
            "3 sprigs fresh thyme ADVERTISEMENT",
            "1 tablespoon butter, cut in small pieces ADVERTISEMENT",
            "Salad Dressing: ADVERTISEMENT",
            "1 lemon, zested and juiced ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "2 teaspoons honey ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "Salad: ADVERTISEMENT",
            "1 bulb fennel, halved ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "1/2 apple, cut into matchstick-size pieces ADVERTISEMENT",
            "1 tablespoon fresh mint leaves, or to taste ADVERTISEMENT",
            "1 tablespoon fresh parsley leaves, or to taste ADVERTISEMENT",
            "1 tablespoon fresh cilantro leaves, or to taste ADVERTISEMENT",
            "1/4 cup pomegranate seeds ADVERTISEMENT",
            "2 tablespoons chopped hazelnuts ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook and stir fennel seeds, cumin seeds, and coriander seeds in a skillet over medium-high heat until toasted and fragrant, 1 to 2 minutes. Transfer to a spice grinder or food processor; add coffee, ancho chile pepper, brown sugar, kosher salt, paprika, black pepper, and red pepper flakes. Grind until spice rub is a medium-coarse texture.\nBreak steak down into 4-ounce pieces. Lightly score steak 1/2-inch x 1/2-inch and season with salt. Rub steak with spice rub. Heat a cast iron skillet over medium high. Pack spice rub onto all sides of the steak and place in the hot cast iron skillet; drizzle about 1 teaspoon olive oil over steak.\nCook steak in the cast iron skillet until well browned, about 4 minutes. Flip and scatter shallots, smashed garlic, thyme, and butter around steak. Cook steak until desired doneness is reached, 4 to 5 minutes more. An instant-read thermometer inserted into the center should read at least 140 degrees F (60 degrees C). Let steak rest for 5 minutes; cut into thin slices.\nWhisk juice of 1 lemon, lemon zest, olive oil, honey, salt, and pepper together in a small bowl until dressing is evenly mixed.\nThinly shave fennel and toss with juice from 1/2 lemon (to preserve color) in a bowl. Add apple, mint, parsley, and cilantro. Drizzle dressing over salad and toss gently; season with salt and pepper. Arrange steak slices on top of salad and scatter roasted shallots, pomegranate seeds, and hazelnuts on top.\n",
        "picture_link": "fIhghNWVTyDrlbFpfeBS1kzuLScHlnO"
    },
    {
        "title": "Shrimp and Tortellini Skewers",
        "ingredients": [
            "36 fresh cheese tortellini ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon minced garlic ADVERTISEMENT",
            "24 large cooked shrimp ADVERTISEMENT",
            "12 skewers ADVERTISEMENT",
            "12 cherry tomatoes ADVERTISEMENT",
            "Dip: ADVERTISEMENT",
            "1 (16 ounce) container sour cream ADVERTISEMENT",
            "1 (1 ounce) package dry ranch dressing mix (such as Hidden Valley Ranch®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook tortellini in the boiling water until tender yet firm to the bite, 2 to 3 minutes; drain.\nHeat olive oil in a skillet over medium heat; cook and stir garlic until fragrant and tender, 1 to 2 minutes. Add shrimp and cook until heated through, 2 to 3 minutes. Mix tortellini into shrimp mixture, remove skillet from heat, and cool until easily handled.\nThread tortellini, shrimp, tortellini, shrimp, and tortellini onto a skewer, ending with a tomato. Repeat with remaining ingredients.\nMix sour cream and ranch dressing mix together in a bowl; serve with skewers.\n",
        "picture_link": "vaJIz9PkOJNINrjoyBtaQnAxSNM/EEq"
    },
    {
        "title": "Hearty Vegetarian Cashew Potatoes",
        "ingredients": [
            "4 cups cubed potatoes ADVERTISEMENT",
            "1 (16 ounce) can diced tomatoes ADVERTISEMENT",
            "3/4 cup minced onion ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "1 1/2 teaspoons minced garlic ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 1/2 cups cashews ADVERTISEMENT",
            "1 1/2 ounces fresh spinach ADVERTISEMENT",
            "1 1/2 teaspoons red pepper flakes ADVERTISEMENT",
            "1 cup shredded Cheddar cheese ADVERTISEMENT",
            "1/4 cup ranch dressing ADVERTISEMENT",
            "1/4 cup hot sauce, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine potatoes, diced tomatoes, onion, butter, garlic, and salt in a stockpot; bring to a boil. Reduce heat, cover, and simmer, stirring every 10 minutes, for 25 minutes. Remove the lid and continue cooking for 10 minutes more.\nStir cashews and spinach into potato mixture; cook until spinach is lightly wilted, about 3 minutes.\nTransfer potato mixture to a serving dish; top with Cheddar cheese, ranch dressing, and hot sauce.\n",
        "picture_link": "dyoibace/XzRah8m/u4sjR1Wm4Kjjjm"
    },
    {
        "title": "Easy-Breezy Coconut and Banana Drink",
        "ingredients": [
            "1 banana, broken into chunks ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "1/2 cup Greek yogurt ADVERTISEMENT",
            "1/4 cup oats ADVERTISEMENT",
            "1/4 cup coconut milk ADVERTISEMENT",
            "1/4 cup shredded coconut ADVERTISEMENT",
            "2 tablespoons ground flax seed ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend banana, milk, yogurt, oats, coconut milk, shredded coconut, flax seed, and sugar together in a blender until smooth.\n",
        "picture_link": "7sV7rNAImAwYKufU1ZuAsHyTNDIbivq"
    },
    {
        "title": "Sweet Ketchup and Thousand Island Pasta",
        "ingredients": [
            "2 cups spiral-shaped noodles ADVERTISEMENT",
            "2 slices bacon, chopped ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1/4 teaspoon minced garlic ADVERTISEMENT",
            "1/2 cup heavy whipping cream ADVERTISEMENT",
            "1/2 cup Thousand Island salad dressing ADVERTISEMENT",
            "1/4 cup pickled jalapeno pepper juice (optional) ADVERTISEMENT",
            "1/4 cup ketchup ADVERTISEMENT",
            "3 tablespoons steak sauce ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Cook pasta at a boil until tender yet firm to the bite, about 8 minutes; drain.\nPlace the bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes; add onion and garlic to the bacon. Cook and stir the bacon mixture until the onions begin to brown, about 5 minutes more.\nStir cream, Thousand Island dressing, pepper juice, ketchup, and steak sauce with the bacon mixture; season with basil and black pepper. Bring the mixture to a simmer and cook until it thickens, about 5 minutes; add drained pasta and stir to coat.\n",
        "picture_link": "3vHym4osIOZ.GkzMlHMfsn6KAgsfRF6"
    },
    {
        "title": "Coronarita",
        "ingredients": [
            "2 (12 fluid ounce) cans or bottles lemon-lime soda, or more to taste ADVERTISEMENT",
            "1 (12 ounce) bottle Mexican beer (such as Corona®) ADVERTISEMENT",
            "1 (12 fluid ounce) can frozen limeade concentrate ADVERTISEMENT",
            "12 fluid ounces tequila ADVERTISEMENT",
            "ice ADVERTISEMENT",
            "2 leaves mint, chopped, or more to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour lemon-lime soda, Mexican beer, and frozen limeade into a large pitcher. Use empty limeade can to measure out tequila; pour into the pitcher. Mix well to combine. Server over ice garnished with chopped mint.\n",
        "picture_link": "HKf2JNk.sEg1RASlbXyRmtCJTwQaWwW"
    },
    {
        "title": "Kahlua® Brownies with Peanut Butter ",
        "ingredients": [
            "2 (4 ounce) containers applesauce ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1/2 cup peanut butter ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1 fluid ounce coffee-flavored liqueur (such as Kahlua®), or more to taste ADVERTISEMENT",
            "1 tablespoon egg replacer ADVERTISEMENT",
            "1 tablespoon honey, or more to taste ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "1 1/3 cups all-purpose flour ADVERTISEMENT",
            "3/4 cup cocoa powder ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "2/3 cup chopped walnuts (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch glass baking dish.\nCombine applesauce, sugar, peanut butter, water, coffee-flavored liqueur, egg replacer, honey, and vanilla extract in a large bowl; mix until well-blended.\nSift flour, cocoa, baking powder, and salt together in another bowl. Stir into applesauce mixture. Pour batter into the prepared baking dish. Sprinkle walnuts on top.\nBake in the preheated oven until edges are set and a toothpick inserted into the center comes out with a few moist crumbs attached, 18 to 25 minutes.\n",
        "picture_link": ".EsJNk.qTeT4L8XPmxJtZXRwpPMHfBy"
    },
    {
        "title": "Red Split Lentils (Masoor Dal)",
        "ingredients": [
            "1 cup basmati rice ADVERTISEMENT",
            "7 1/2 cups water, divided ADVERTISEMENT",
            "1 cup red lentils (masoor dal), rinsed ADVERTISEMENT",
            "1/2 cup finely chopped red onion (optional) ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 teaspoon ground coriander ADVERTISEMENT",
            "1 teaspoon salt, or to taste ADVERTISEMENT",
            "1/2 teaspoon ground black pepper (optional) ADVERTISEMENT",
            "1/2 teaspoon cayenne powder (optional) ADVERTISEMENT",
            "1/2 teaspoon ground turmeric ADVERTISEMENT",
            "1 cup broccoli florets (optional) ADVERTISEMENT",
            "1 cup diced tomatoes (optional) ADVERTISEMENT",
            "1 cup frozen peas (optional) ADVERTISEMENT",
            "1 tablespoon olive oil, or as needed ADVERTISEMENT",
            "1 cup sliced mushrooms (optional) ADVERTISEMENT",
            "1 tablespoon peeled, finely grated fresh ginger ADVERTISEMENT",
            "2 cloves garlic, finely grated ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse rice in several changes of water and transfer to a container. Cover with water and let soak at room temperature, 15 minutes to 1 hour. Drain.\nCombine 6 cups water with red lentils in a large pot over medium heat. Bring to a simmer, skimming any scum that collects on the surface. Stir in onion, cumin, coriander, salt, black pepper, cayenne, and turmeric. Reduce heat to low and simmer, partially covered, until lentils are tender, about 30 minutes.\nStir broccoli, tomatoes, peas, and salt into the pot. Continue cooking, stirring frequently, until lentils are soft, about 30 minutes more.\nCombine drained rice with remaining 1 1/2 cup water in another pot; bring to a boil. Reduce heat to very low and simmer, covered with a tight-fitting lid, until rice is tender and liquid is absorbed, about 20 minutes.\nHeat oil in a small skillet over medium heat. Add mushrooms, ginger, and garlic; cook and stir until fragrant, 3 to 5 minutes. Pour over lentils; stir to distribute. Cook lentils until flavors combine, about 5 minutes. Serve lentils with rice.\n",
        "picture_link": "Kzx7fmSZoim..5VTZ.zVRW63gatgjLi"
    },
    {
        "title": "Basil Pesto Potato Salad",
        "ingredients": [
            "10 small red potatoes, scrubbed ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 cup dry white wine ADVERTISEMENT",
            "1 1/2 tablespoons olive oil ADVERTISEMENT",
            "1 1/2 teaspoons lemon juice ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "6 tablespoons pesto, or more to taste ADVERTISEMENT",
            "1 small red onion, finely sliced, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place potatoes into a large pot and cover with lightly salted water; bring to a boil. Reduce heat to medium-low and simmer until just tender, about 10 minutes. Drain and cool until easily handled, 5 to 10 minutes.\nPeel potatoes and cut into 1/4-inch thick slices. Place in a large bowl. Sprinkle with salt. Add white wine, olive oil, and lemon juice; toss lightly to combine.\nMix mayonnaise and pesto together in a small bowl. Pour over potato salad and toss gently. Garnish with red onion. Chill until serving.\n",
        "picture_link": "oy0PxyYTdDxphb85aYFCciYGhreES6K"
    },
    {
        "title": "Banana Ice Cream Topping",
        "ingredients": [
            "2 bananas, sliced into 1/4-inch pieces ADVERTISEMENT",
            "1 tablespoon brown sugar ADVERTISEMENT",
            "1 tablespoon milk ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place bananas in a saucepan over high heat; cook and stir until bananas become a chunky paste, about 5 minutes. Turn temperature down to medium, and mix brown sugar, milk, cinnamon, and vanilla extract into saucepan. Stir until all ingredients are well combined, about 5 minutes.\n",
        "picture_link": "w4smyVUDaLVEfGVEsaS6klL.aMPFC/u"
    },
    {
        "title": "Brussels Sprouts with Toasted Almonds",
        "ingredients": [
            "1 1/2 pounds Brussels sprouts, trimmed and halved ADVERTISEMENT",
            "1/4 cup unsalted butter, softened, divided ADVERTISEMENT",
            "1/4 cup Spanish Marcona almonds ADVERTISEMENT",
            "1 clove garlic, crushed ADVERTISEMENT",
            "1/2 lemon, zested ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "3 tablespoons panko bread crumbs ADVERTISEMENT",
            "1/4 cup finely grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a saucepan with 1/2-inch water and bring to a boil. Add Brussels sprouts, cover, and cook until easily pierced with a fork, 8 to 10 minutes. Drain and transfer to a bowl.\nHeat 2 tablespoons butter in a skillet over medium-low heat until melted. Add almonds and garlic clove; cook and stir until lightly toasted, 4 to 5 minutes. Remove from heat and discard garlic clove.\nStir lemon zest, salt, and pepper into almonds; add to bowl of Brussels sprouts.\nHeat remaining 2 tablespoons butter in a small skillet over medium-low heat. Add bread crumbs; stir until evenly coated and golden, 3 to 5 minutes. Add to bowl of Brussels sprouts.\nSprinkle Parmesan cheese over Brussels sprouts; toss to combine.\n",
        "picture_link": "mmeCNlgYduvJ4HzL/Swf4H5Hbegl8Wm"
    },
    {
        "title": "Fresh Spiced Peach Jam",
        "ingredients": [
            "6 cups peeled and chopped fresh peaches ADVERTISEMENT",
            "3 cups white sugar ADVERTISEMENT",
            "3 tablespoons lemon juice ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon ground allspice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat five 12-ounce jars in simmering water until ready for use. Wash lids and rings in warm soapy water.\nMix peaches, sugar, lemon juice, cinnamon, nutmeg, and allspice in a large pot. Bring to a boil; cook, stirring occasionally, until peaches are soft, about 15 minutes. Remove from heat.\nMash peaches with an immersion blender or potato masher to desired size and texture. Return to the heat; continue cooking jam until thickened, about 10 minutes more.\nPack jam into hot jars, filling to within 1/4 inch of the top. Wipe rims with a clean, damp cloth. Top with lids and screw on rings.\nPlace a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower in jars using a holder, placing them 2 inches apart. Pour in more boiling water to cover the jars by at least 1 inch. Bring the water to a rolling boil, cover the pot, and process for 10 minutes.\nRemove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool, about 12 hours. Press the top of each lid with a finger, ensuring that lid does not move up or down and seal is tight.\n",
        "picture_link": "JEQca4qARePm.7zkyfd4fnN/ME1JzJm"
    },
    {
        "title": "Mulberry Kuchen (Cake)",
        "ingredients": [
            "Cake: ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "2 cups mulberries ADVERTISEMENT",
            "Crumb Topping: ADVERTISEMENT",
            "3/4 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "3 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease an 8x8-inch baking pan.\nBeat milk, 1/2 cup white sugar, egg, and oil in a bowl. Add 1 cup flour, baking powder, and salt; mix until smooth. Pour into baking pan; sprinkle with mulberries.\nMix 3/4 cup flour, brown sugar, and 1/4 cup white sugar in a bowl; cut in butter and stir until mixture resembles crumbs, about 2 minutes. Sprinkle over cake.\nBake in the preheated oven until a toothpick inserted in the center comes out clean, about 30 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Savory Quail Tagine",
        "ingredients": [
            "1 whole quail ADVERTISEMENT",
            "2 tablespoons ras el hanout ADVERTISEMENT",
            "2 tablespoons olive oil, or more as needed ADVERTISEMENT",
            "3 ounces carrots, cut into 1-inch rounds ADVERTISEMENT",
            "1 ounce leeks, cut into 1/2-inch rounds ADVERTISEMENT",
            "1 clove garlic, peeled and crushed ADVERTISEMENT",
            "10 dried apricots ADVERTISEMENT",
            "8 ounces potatoes, cut into 1-inch slices ADVERTISEMENT",
            "5 cherry tomatoes ADVERTISEMENT",
            "1 teaspoon loomi aswad (dried black lime seasoning) ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rub the ras el hanout onto the entire surface of the quail including beneath the wings and legs. Use all the seasoning. Allow to rest at room temperature for 30 minutes.\nPreheat oven to 375 degrees F (190 degrees C). Remove the middle rack(s) and place the lower rack on its lowest position.\nPlace a diffuser over stove burner so base of tagine is not in direct contact with it. Place the tagine base on the diffuser and heat over medium heat; add the oil. When oil is hot, add the carrots and leeks. Saute until leeks are tender, about 5 minutes. Separate the leeks into single rounds using a wooden spoon. Push the vegetables to the sides of the tagine and add the quail and garlic. Cook the quail on all sides until nicely browned, about 10 minutes. You may need to add a bit of oil occasionally, depending on the bird's fat content. Remove tagine from heat.\nArrange apricots, potatoes, and tomatoes around the edges, leaving the quail uncovered. Sprinkle all ingredients with the loomi aswad.\nCover the tagine place in preheated oven. Roast until the internal temperature of the quail has reached 150 degrees F, 35 to 40 minutes.\nUncover the tagine and, if desired, brown quail under the broiler 2 to 3 minutes.\nSprinkle with fresh coriander before serving. Serve with ice cold milk.\n",
        "picture_link": "SwNayKXW/H6wQN5oL3ph1pWFCJrJrci"
    },
    {
        "title": "Dehydrated Beet Chips",
        "ingredients": [
            "3 large beets, assorted colors ADVERTISEMENT",
            "1/4 cup water ADVERTISEMENT",
            "1/4 cup apple cider vinegar ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 tablespoon fleur de sel (sea salt flakes) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Peel and slice beets as thinly as possible with a sharp knife or mandoline.\nCombine sliced beets, water, apple cider vinegar, and olive oil in a large bowl. Let marinate, at least 10 minutes.\nArrange beets in a single layer on food dehydrator trays. Sprinkle fleur de sel over beets. Store any beets that don't fit in the refrigerator.\nDehydrate according to manufacturer's instructions, 8 to 12 hours.\n",
        "picture_link": "ReAK8lI5H3bWhvQXCxUi0DUtoaKPst."
    },
    {
        "title": "Aunt Patsi's Easy Peach Jam ",
        "ingredients": [
            "2 1/2 pounds fresh peaches ADVERTISEMENT",
            "5 cups white sugar ADVERTISEMENT",
            "3 (3 ounce) packages peach gelatin ADVERTISEMENT",
            "2 teaspoons lemon juice ADVERTISEMENT",
            "1/2 teaspoon almond extract ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat five 12-ounce jars in simmering water until ready for use. Wash lids and rings in warm soapy water.\nFill a large pot with water; bring to a boil. Add peaches; cook until skin loosens, about 20 seconds. Drain and cool until easily handled. Peel, pit, and cut the peaches into chunks.\nMeasure out 5 cups of peach chunks into the pot. Mash with a potato masher. Add sugar, peach gelatin, lemon juice, and almond extract; mix well. Bring to a rolling boil and cook jam for 1 minute. Remove from heat.\nPack jam into hot jars, filling to within 1/4 inch of the top. Wipe rims with a clean, damp cloth. Top with lids and screw on rings.\nPlace a rack in the bottom of a large stockpot and fill halfway with water. Bring to a boil and lower in jars using a holder, placing them 2 inches apart. Pour in more boiling water to cover the jars by at least 1 inch. Bring the water to a rolling boil, cover the pot, and process for 10 minutes.\nRemove the jars from the stockpot and place onto a cloth-covered or wood surface, several inches apart, until cool, about 12 hours. Press the top of each lid with a finger, ensuring that lid does not move up or down and seal is tight.\n",
        "picture_link": ".mLKjwCPSQip9pWZB2FZaLnLE02nV3C"
    },
    {
        "title": "My Kiwi Hotdog Sauce",
        "ingredients": [
            "2 tablespoons ketchup ADVERTISEMENT",
            "2 tablespoons Dijon mustard ADVERTISEMENT",
            "1 tablespoon sriracha sauce ADVERTISEMENT",
            "1 tablespoon Japanese mayonnaise (such as Kewpie®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix ketchup, Dijon mustard, sriracha sauce, and Japanese mayonnaise together in a small bowl or jar.\n",
        "picture_link": "OKnqLWYwsmA1mnggjhMdvpMU21hmKSW"
    },
    {
        "title": "Dark Chocolate Sorbet",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "2 tablespoons water ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 cup unsweetened cocoa powder ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk 1 cup plus 2 tablespoons water, sugar, cocoa powder, and salt together in a large bowl.\nRefrigerate mixture until chilled, 30 minutes to 1 hour.\nPour mixture into an ice cream maker. Freeze according to manufacturer's instructions, about 15 minutes.\n",
        "picture_link": "vi.LKrtIYuaVA4bq8I5Cnd1CK/wjDcK"
    },
    {
        "title": "RumChata® Marinated Shrimp",
        "ingredients": [
            "1 pound raw jumbo shrimp, shelled and deveined ADVERTISEMENT",
            "8 wooden skewers ADVERTISEMENT",
            "1/4 cup rum cream liqueur (such as RumChata®) ADVERTISEMENT",
            "2 tablespoons chicken seasoning (such as McCormick® Grill Mates® Montreal Chicken®), or to taste ADVERTISEMENT",
            "cooking spray ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Thread shrimp on wooden skewers. Place in a container and cover with rum cream liqueur. Let marinate in the refrigerator, 3 to 4 hours.\nPreheat an outdoor grill for high heat and lightly oil the grate.\nPour out rum cream liqueur. Sprinkle chicken seasoning over shrimp. Spray with cooking spray.\nGrill until shrimp turn pink, about 3 minutes per side.\n",
        "picture_link": "U17M0H541vOluFCPHshc4Ew4yPSM02G"
    },
    {
        "title": "Family-Friendly Watermelon Sorbet ",
        "ingredients": [
            "2 1/4 cups sliced watermelon ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "1 tablespoon white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine watermelon, lemon juice, and sugar in a blender; blend until smooth and foamy.\nPour blended mixture into a glass measuring cup through a fine-mesh strainer, pressing with a spoon to extract as much juice as possible; juice should measure about 1 3/4 cup.\nPour watermelon juice into small glass dessert bowls. Freeze until firm, about 2 hours.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Lebanese Fattoush (Bread Salad)",
        "ingredients": [
            "Salad: ADVERTISEMENT",
            "2 pita bread ADVERTISEMENT",
            "1 head romaine lettuce, chopped ADVERTISEMENT",
            "4 radishes, diced ADVERTISEMENT",
            "1 English cucumber, sliced ADVERTISEMENT",
            "1 tomato, diced ADVERTISEMENT",
            "3 green onions, chopped ADVERTISEMENT",
            "2 cloves garlic, crushed (optional) ADVERTISEMENT",
            "1/2 cup chopped fresh parsley ADVERTISEMENT",
            "1/4 cup chopped fresh mint ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "Dressing: ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 tablespoon ground sumac ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Place pita bread on a baking sheet.\nBake in the preheated oven until the bread is a light brown, 5 to 7 minutes. Remove from the oven and allow to cool, 1 to 2 minutes. Break toasted bread into bite-size pieces.\nCombine lettuce, radishes, cucumber, tomato, garlic, green onions, parsley, mint, and salt and pepper together in a bowl; toss until salad is well mixed.\nPour lemon juice, olive oil, and sumac into a salad dressing bottle with a lid; cover and shake until blended. Add dressing to salad and toss.\nGarnish salad with toasted pita.\n",
        "picture_link": "2CExd9gght1BNQwfZuL469qQjboUVjm"
    },
    {
        "title": "Strawberry Frose (Frozen Rose Slushy)",
        "ingredients": [
            "1 pound strawberries, hulled ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 (750 milliliter) bottle Malbec red wine ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place strawberries, sugar, and water into blender and blend until the mixture is smooth.\nPour mixture into a 9x13-inch baking pan; stir in the wine.\nFreeze, stirring once about halfway through, until mixture is slushy, 4 1/2 to 5 hours.\nRemove from freezer and stir to breakup the larger frozen clumps.\n",
        "picture_link": "Ghu2GdHkz1uZoCz1Ni92Wi01skSyheS"
    },
    {
        "title": "Cam's Hummus",
        "ingredients": [
            "2 cups peeled garlic cloves ADVERTISEMENT",
            "1 cup canola oil ADVERTISEMENT",
            "1 tablespoon cumin seeds ADVERTISEMENT",
            "4 cups garbanzo beans, undrained ADVERTISEMENT",
            "2/3 cup tahini ADVERTISEMENT",
            "1/2 cup fresh lemon juice ADVERTISEMENT",
            "2 teaspoons kosher salt, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place garlic cloves in a saucepan. Pour in oil to barely cover garlic. Heat over medium heat until oil bubbles. Reduce heat to low and cook, stirring every 3 to 4 minutes, until garlic turns light brown, 10 to 15 minutes. Remove from heat and strain out garlic; let infused oil cool to room temperature.\nPlace cumin seeds in a small skillet over low heat. Toast until fragrant, 1 to 2 minutes. Transfer to a spice grinder and grind into a powder.\nDrain garbanzo beans into a bowl, reserving 2 to 3 tablespoons soaking liquid.\nCombine 1/4 garlic cloves, cumin powder, garbanzo beans, tahini, lemon juice, and salt in a food processor; blend, thinning with reserved soaking liquid and 1 to 3 tablespoons garlic oil, until hummus is smooth.\n",
        "picture_link": "wUuN9HegWsOYey7T7o7./4s8hymYGNe"
    },
    {
        "title": "Brunchtime Spicy Chickpea Frittata",
        "ingredients": [
            "6 eggs ADVERTISEMENT",
            "1/4 cup finely grated Parmigiano-Reggiano cheese ADVERTISEMENT",
            "1 cup packed spinach leaves, coarsely chopped ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/4 cup diced leek ADVERTISEMENT",
            "1/4 cup minced carrot ADVERTISEMENT",
            "1 fresh cayenne peppers, chopped ADVERTISEMENT",
            "1 cup cooked garbanzo beans, drained, thoroughly dried ADVERTISEMENT",
            "2/3 cup diced tomatoes ADVERTISEMENT",
            "1/2 teaspoon red pepper flakes (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together eggs and cheese until creamy. Fold in spinach and set aside.\nHeat oil over medium heat in an oven-proof skillet. Saute leek, carrot, and cayenne peppers until the leek is translucent, 4 to 5 minutes. Add chickpeas and tomatoes. Saute until warmed through, about 3 minutes. Add egg mixture to the skillet and cover.\nCook the mixture undisturbed until the edges of the frittata have firmed and slightly browned, 4 to 5 minutes. Reduce heat to medium-low. Replace the cover but watch every so often until the whole frittata has firmed except the very middle. Take care to keep the heat source on medium-low to avoid burning bottom of frittata.\nSet oven rack about 6 inches from the heat source and preheat the oven's broiler.\nPlace the frittata under the broiler to firm and brown the top, 1 to 3 minutes.\nAllow to cool before serving. Top with red pepper flakes if desired.\nServe warm or at room temperature with an ice cold glass of milk!\n",
        "picture_link": "v2JggMF5GeOPHn47/LipUFhyO8wiaWO"
    },
    {
        "title": "Oven Roasted Stuffed Squash Blossoms",
        "ingredients": [
            "3 tablespoons olive oil, divided ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "1 bunch rainbow chard, stems removed and leaves chopped ADVERTISEMENT",
            "3 tablespoons chopped fresh basil ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "3 ounces chevre (goat cheese) ADVERTISEMENT",
            "8 zucchini blossoms, stamen removed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nHeat 1 tablespoon olive oil in a pan over medium heat; add garlic and cook for 1 minute. Stir in chard and cook until soft, about 10 minutes. Add basil, salt, and pepper, and cook until basil is soft, about 2 minutes. Remove from heat and let cool completely, about 15 minutes. Place cooled chard mixture between 2 towels and press to remove excess moisture.\nStir chevre and chard mixture together in a bowl until thoroughly combined. Fill zucchini blossoms about 3/4 full with the goat chevre mixture, and pinch the ends closed. Place filled blossoms in a roasting pan; drizzle with 2 tablespoons olive oil, and sprinkle with salt and pepper.\nRoast in the preheated oven until blossoms are hot, about 10 minutes.\n",
        "picture_link": "5YpT/AGo9r7Cb5WPJxtDUVlxzIB3VTu"
    },
    {
        "title": "Herb Braised Carrots",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "1 pound baby carrots ADVERTISEMENT",
            "1 shallot, chopped ADVERTISEMENT",
            "2 tablespoons vegetable stock ADVERTISEMENT",
            "1/2 teaspoon thyme ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg ADVERTISEMENT",
            "1/4 teaspoon ground sumac ADVERTISEMENT",
            "1/2 teaspoon chopped fresh rosemary ADVERTISEMENT",
            "1/2 teaspoon chopped fresh sage ADVERTISEMENT",
            "salt and ground white pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat butter in a large pan over medium heat until completely melted. Add carrots and shallot to pan; cook and stir until the carrots are coated in butter and shallots are slightly soft, about 5 minutes.\nStir vegetable stock, thyme, ground nutmeg, and ground sumac into the carrots; cover pan, reduce heat to low, and cook and stir until most of the liquid has disappeared, about 15 minutes.\nRemove pan from heat and garnish carrots with rosemary, sage, salt, and white pepper.\n",
        "picture_link": "PcA9/zj06MJx0A/GIN2MN.mldD/xUbW"
    },
    {
        "title": "Pesto Puff Pastry Pinwheel",
        "ingredients": [
            "2 sheets puff pastry ADVERTISEMENT",
            "2 teaspoons all-purpose flour, or as needed ADVERTISEMENT",
            "8 1/2 ounces ricotta cheese ADVERTISEMENT",
            "8 1/2 ounces pesto ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Line a baking tray with parchment paper and dust lightly with flour.\nLay puff pastry on a flat work surface; cut a 12-inch circle from each sheet. Transfer 1 circle to the prepared baking sheet.\nSpread ricotta evenly over the pastry circle. Top with an even layer of pesto. Lay the second pastry circle on top. Set a small glass upside down in the middle of the circle.\nCut the circle, away from the glass, into 4 equal quarters. Cut each quarter in half, then each eighth in half, to make 16 equal strips. Remove glass. Twist strips twice, two at a time, in the opposite direction. Pinch ends together. Repeat with remaining strips to make a pinwheel shape.\nBake in the preheated oven until pastry is browned, 25 to 30 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Vietnamese Coffee",
        "ingredients": [
            "2 tablespoons sweetened condensed milk, or more to taste ADVERTISEMENT",
            "2/3 cup strong brewed coffee ADVERTISEMENT",
            "1 teaspoon non-dairy creamer (such as Coffee-Mate®), or more to taste ADVERTISEMENT",
            "1 teaspoon hot cocoa mix (such as Godiva®), or more to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Pour some boiling water in a glass. Let sit to warm the glass, about 1 minute. Pour out water.\nPour condensed milk into the warmed glass. Top with coffee. Stir in creamer and hot cocoa mix.\n",
        "picture_link": "J9yDVpsNkGv6GYu4CNQMCXuUiWCTZIq"
    },
    {
        "title": "Tasty Shrimp Tempura and Sake Dipping Sauce",
        "ingredients": [
            "Dipping Sauce: ADVERTISEMENT",
            "2 shallots, minced ADVERTISEMENT",
            "1 cup soy sauce ADVERTISEMENT",
            "1/4 cup sake ADVERTISEMENT",
            "1 tablespoon hot pepper sauce ADVERTISEMENT",
            "1 tablespoon minced fresh cilantro ADVERTISEMENT",
            "1 tablespoon diced ginger root ADVERTISEMENT",
            "Batter: ADVERTISEMENT",
            "1 cup rice flour ADVERTISEMENT",
            "1 cup seltzer water ADVERTISEMENT",
            "1 egg yolk ADVERTISEMENT",
            "1 pound large shrimp, peeled and deveined ADVERTISEMENT",
            "1/2 cup rice flour ADVERTISEMENT",
            "2 cups vegetable oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix shallots, soy sauce, sake, hot pepper sauce, cilantro, and ginger together in a bowl; let sit, about 2 hours.\nMix 1 cup rice flour, seltzer water, and egg yolk together in a bowl.\nSplit shrimp down the center, cutting almost but not completely through, and open flat. Pat with paper towel to dry; dust with 1/2 cup rice flour. Dip shrimp in batter until thoroughly covered.\nHeat oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C). Cook shrimp in small batches in oil until golden brown, about 7 minutes. Remove shrimp from oil and place on paper towel to absorb excess oil. Serves dipping sauce alongside the shrimp.\n",
        "picture_link": "q9Sh4MzQqQtf3gdxuwyaUrNtLcrprIG"
    },
    {
        "title": "Homemade Pasta without a Pasta Machine",
        "ingredients": [
            "3 cups Italian-style tipo 00 flour ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "water, or as needed (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place flour on a marble or wooden work surface. Make a well in the center and crack in the eggs; add the salt. Gently beat eggs with a fork, incorporating the surrounding flour, until batter is runny. Bring remaining flour into the batter using a bench scraper until dough forms a ball. Mix in water, 1 tablespoon at a time, if dough feels too stiff.\nKnead dough with your hands by flattening the ball, stretching it and folding the top towards the center. Turn 45 degrees and repeat until dough is soft and smooth, about 10 minutes.\nShape dough into a ball. Place in a bowl and cover with plastic wrap. Refrigerate until firm, 30 minutes to 1 hour.\nDust work surface with flour. Divide dough into 3 equal portions. Flatten 1 piece a little and roll out 5 to 6 times with a rolling pin. Turn dough 45 degrees and roll 5 to 6 times. Continue rolling and turning until dough is 1/16-inch thick.\nCut dough into a sheet. Dust generously with flour and roll into a cylinder. Slice cylinder into 1/4-inch thick strips. Unroll strips and toss generously in flour. Let tagliatelle air-dry, about 30 minutes.\nBring a large pan of salted water to a boil. Drop in tagliatelle and cook until tender yet still firm to the bite, 3 to 5 minutes. Drain.\n",
        "picture_link": "oHktzpyuErF09Qmz/wYJ.viUXBALsB."
    },
    {
        "title": "Whiskey Sidecar",
        "ingredients": [
            "3 tablespoons superfine sugar ADVERTISEMENT",
            "1 lemon wedge ADVERTISEMENT",
            "2 fluid ounces whiskey ADVERTISEMENT",
            "1 fluid ounce orange liqueur ADVERTISEMENT",
            "3/4 fluid ounce freshly squeezed lemon juice ADVERTISEMENT",
            "ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place sugar in a shallow bowl. Run lemon wedge around the rim of a glass. Dip rim into sugar.\nCombine whiskey, orange liqueur, and lemon juice in a cocktail shaker; add ice, cover shaker, and shake for 20 seconds. Strain drink into prepared cocktail glass.\n",
        "picture_link": "venzClTp70Oe0bMojBye/s9mfozkhEu"
    },
    {
        "title": "Personal Shepherd's Pies",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 cup frozen corn ADVERTISEMENT",
            "1 tablespoon ketchup ADVERTISEMENT",
            "1/4 teaspoon black pepper ADVERTISEMENT",
            "2 cups prepared instant mashed potatoes ADVERTISEMENT",
            "3/4 cup shredded Cheddar cheese (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook and stir beef and onion in a skillet over medium-high heat until beef is browned and crumbly, about 5 minutes; drain and discard grease.\nReduce heat to low. Stir mushroom soup, corn, ketchup, and pepper into beef mixture; cook until heated through, about 2 minutes. Divide beef mixture into four 4-inch round baking pans; spread prepared mashed potatoes over beef mixture.\nBake in the preheated oven until potatoes are lightly browned, about 15 minutes.\nSet oven rack about 6 inches from the heat source and preheat the oven's broiler.\nSprinkle Cheddar cheese evenly over pies. Place pies on a baking sheet.\nBroil until cheese is melted, about 2 minutes. Allow to cool for 5 minutes before serving.\n",
        "picture_link": "Q6BH23Kkf3zXTyOB86fGP0O0QsQg/TO"
    },
    {
        "title": "Tea Sorbet",
        "ingredients": [
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 sprig fresh mint, leaves removed and stem discarded ADVERTISEMENT",
            "2 cups brewed orange pekoe tea ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine sugar, water, and mint leaves in a small pot over medium heat; cook until sugar dissolves and mixture is thick and syrupy. Remove from heat. Strain out mint leaves and discard. Cool syrup to room temperature, about 20 minutes.\nCombine brewed tea with lemon juice in a bowl with a lid. Stir in syrup. Refrigerate until temperature reaches 40 degrees F (4 degrees C), about 20 minutes.\nPour tea mixture into an ice cream maker and freeze according to manufacturer's instructions for sorbet, 10 to 15 minutes.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Whiskey Sidecar with Broiled Lemon Juice",
        "ingredients": [
            "1 lemon, halved ADVERTISEMENT",
            "3 tablespoons superfine sugar ADVERTISEMENT",
            "1 lemon wedge ADVERTISEMENT",
            "2 fluid ounces whiskey ADVERTISEMENT",
            "1 fluid ounce orange liqueur ADVERTISEMENT",
            "ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Place lemon halves, cut-side up, on a baking sheet.\nBroil until lemon halves are blackened on the cut side, about 10 minutes. Allow lemons to cool enough to handle. Squeeze juice from the lemons into a measuring cup. Measure out 3/4 fluid ounce broiled lemon juice, reserving the rest for another use.\nPour sugar into a shallow bowl. Run lemon wedge around the rim of a cocktail glass; dip into sugar.\nCombine whiskey, orange liqueur, and 3/4 fluid ounce broiled lemon juice in a cocktail shaker and add ice; cover and shake for 20 seconds. Strain drink into the prepared cocktail glass.\n",
        "picture_link": "HuU6/hocE9mwZ51J3tq1hbTpyMfapKG"
    },
    {
        "title": "Mexican Deep-Dish Pizza",
        "ingredients": [
            "1 (16 ounce) can refried beans (refritos) ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon ground paprika ADVERTISEMENT",
            "1 pinch salt ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "1 green bell pepper, sliced, or more to taste ADVERTISEMENT",
            "1 red bell pepper, sliced ADVERTISEMENT",
            "1/2 onion, chopped ADVERTISEMENT",
            "1/2 pound ground beef ADVERTISEMENT",
            "1/2 pound Mexican chorizo, crumbled ADVERTISEMENT",
            "1 (7 ounce) can chipotle peppers in adobo sauce ADVERTISEMENT",
            "1 tablespoon chili powder, divided ADVERTISEMENT",
            "2 teaspoons ground cumin, divided ADVERTISEMENT",
            "3 (10 inch) flour tortillas ADVERTISEMENT",
            "1 cup shredded sharp Cheddar cheese, divided ADVERTISEMENT",
            "1 cup shredded Monterey Jack cheese, divided ADVERTISEMENT",
            "1/4 cup salsa (optional) ADVERTISEMENT",
            "1/4 cup guacamole (optional) ADVERTISEMENT",
            "1/4 cup sour cream (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease a 3-inch deep cast iron skillet.\nHeat refried beans in a small pot until warmed through, about 5 minutes. Stir in pepper, paprika, and salt. Remove from heat.\nHeat oil in a large skillet over medium heat. Add green bell pepper, red bell pepper, and onion; cook and stir until soft, 5 to 10 minutes. Transfer to a plate.\nCombine ground beef and chorizo in the skillet; cook and stir until browned, about 5 minutes. Carefully drain excess grease. Stir in chipotle peppers with sauce, 1 1/2 teaspoon chili powder, and 1 teaspoon cumin. Simmer until flavors combine, 5 to 10 minutes. Remove from heat.\nPlace 1 tortilla in the bottom of the prepared skillet. Layer some of the refried beans, bell pepper mixture, ground beef mixture, 1/3 cup Cheddar cheese, and 1/3 cup Monterey Jack cheese on top. Repeat layers twice more, ending with remaining Cheddar cheese and Monterey Jack cheese.\nBake in the preheated oven until cheese starts to brown, 30 to 45 minutes. Remove from oven and let cool before slicing, 2 to 5 minutes. Garnish with salsa, guacamole, and sour cream.\n",
        "picture_link": "v8uQ/q5q5Bd6Q1bU3UCUOGGhM6cvfiK"
    },
    {
        "title": "Butter Popcorn With Sumac",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "2 1/2 tablespoons vegetable oil, divided ADVERTISEMENT",
            "1 teaspoon sumac powder ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "3/4 cup unpopped popcorn ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine butter and 1/2 tablespoon oil in a saucepan over medium-low heat; cook and stir until butter is just melted, 1 to 2 minutes. Stir sumac, chili powder, and salt into butter-oil mixture.\nHeat 2 tablespoons oil in a large saucepan over high heat. Add 3 popcorn kernels to the oil and cover saucepan with a lid. Once the 3 kernels have popped, the oil is ready. Add the remaining popcorn, cover saucepan, and cook popcorn, shaking saucepan constantly, until you no longer hear popping. Remove saucepan from heat.\nTransfer popcorn to a large heat-proof bowl and let sit for 2 minutes to ensure better coverage by the butter.\nPour half of the butter mixture in a second large bowl and swirl it around the bottom and sides; add popcorn and mix with a big spoon. Transfer the popcorn back in the first large bowl; stir again. Pour remaining half butter mixture into the second bowl and swirl around again; add the popcorn in and mix again.\n",
        "picture_link": "iibkJfS.jwUKH7itSWefnV.J7B5r1OW"
    },
    {
        "title": "Sake Gorgonzola Sauce",
        "ingredients": [
            "1/3 cup sake ADVERTISEMENT",
            "2 tablespoons unsalted butter ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/3 cup heavy whipping cream ADVERTISEMENT",
            "2 teaspoons basil ADVERTISEMENT",
            "2 teaspoons parsley ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 cup crumbled Gorgonzola cheese ADVERTISEMENT",
            "1 tablespoon grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine sake, butter, and garlic into a saucepan over medium heat. Cook and stir until the mixture has thickened and reduced in volume by one half, about 3 minutes. Add cream to the sake mixture; stir until reduced by one fourth, about 3 minutes. Season with basil, parsley, and salt and pepper.\nStir Gorgonzola cheese and Parmesan cheese slowly into the sake mixture; simmer and stir continuously until smooth, about 3 minutes. Simmer until flavors combine, about 5 minutes.\n",
        "picture_link": "jbP3a9SgPHAlnHMZyHoCVNCH6RQve16"
    },
    {
        "title": "Frijoles Refritos (Refried Beans)",
        "ingredients": [
            "5 quarts water, or as needed ADVERTISEMENT",
            "1 pound pinto beans, washed ADVERTISEMENT",
            "2 cloves garlic, peeled and smashed ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "canola oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine water, pinto beans, and garlic into a large pot and cover; Cook over low heat for 5 1/2 hours; stir salt into beans and continue cooking until beans are very soft, about 30 minutes more.\nHeat canola oil in a skillet over high heat. Spoon the beans into the skillet without draining excess water; mash beans using a potato masher until they begin to lose their shape, about 3 minutes.\n",
        "picture_link": "lgaixWVwo32aagQs7BAas2e1RH7ZKQ6"
    },
    {
        "title": "Chipotle Hummus ",
        "ingredients": [
            "1 (16 ounce) can garbanzo beans, undrained ADVERTISEMENT",
            "3 tablespoons lemon juice ADVERTISEMENT",
            "2 canned chipotle peppers in adobo sauce ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1 1/2 tablespoons tahini ADVERTISEMENT",
            "2 cloves garlic, crushed ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Drain garbanzo beans, reserving 1/4 cup soaking liquid.\nCombine garbanzo beans, reserved liquid, lemon juice, chipotle peppers, olive oil, tahini, garlic, and salt in a blender or food processor; blend until smooth.\n",
        "picture_link": "CfFzzdcB.d23bHGHgJM49QuxyxdzT1K"
    },
    {
        "title": "Gluten-Free Stuffed Zucchini Blossoms (Fior di Zucca Ripieni)",
        "ingredients": [
            "1 cup mozzarella cheese, fresh ADVERTISEMENT",
            "3 tablespoons grated Parmesan-Reggiano cheese ADVERTISEMENT",
            "10 zucchini blossoms ADVERTISEMENT",
            "7 tablespoons rice flour ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1/4 cup sparkling water ADVERTISEMENT",
            "2 tablespoons sweet rice flour ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 cup oil for frying ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix mozzarella cheese and Parmesan-Reggiano cheese together in a bowl until smooth. Stuff 1 tablespoon cheese mixture into each zucchini blossom and pinch the ends closed.\nMix rice flour, eggs, milk, sparkling water, sweet rice flour, salt, and pepper together in a bowl. Place stuffed blossoms in flour mixture; toss gently until covered.\nHeat oil in a saucepan over medium heat. Fry blossoms in oil until crisp and pale golden brown, about 2 minutes. Rest blossoms on paper towels to absorb excess oil.\n",
        "picture_link": "AuhnFT0I8P5.mRphHIigof0zl5Psz1."
    },
    {
        "title": "Japanese Sweet Omelet ",
        "ingredients": [
            "2 eggs ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "1 teaspoon soy sauce ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix eggs, water, soy sauce, and sugar in a bowl with a fork until combined.\nHeat a skillet over medium heat. Pour egg mixture into skillet and stir with a fork. Cook until omelet begins to set and liquid is no longer visible, 3 to 5 minutes. Fold in half twice.\n",
        "picture_link": "qn7O/WW6SiVEWbTrmMLAOiAq9sexX7a"
    },
    {
        "title": "Easy Frozen Hot Chocolate",
        "ingredients": [
            "3 ounces semisweet chocolate, chopped ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "2 teaspoons unsweetened cocoa powder ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups milk, divided ADVERTISEMENT",
            "3 cups ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Microwave chocolate in a small microwave-safe bowl, stirring every 30 seconds until melted, 5 to 7 minutes. Stir in sugar, cocoa powder, and vanilla extract until blended. Whisk in 1/2 cup milk until combined; set aside to cool, about 5 minutes.\nPour chocolate mixture, remaining milk, and ice into a blender; blend on high speed until mixture is creamy, about 1 to 3 minutes.\n",
        "picture_link": "NEd9xUJK0u5yLKlsPfbG9LPKU7RUrAK"
    },
    {
        "title": "Chorizo con Huevos (Spicy Mexican Sausage with Eggs)",
        "ingredients": [
            "3 chorizo sausage links, casing removed and meat crumbled ADVERTISEMENT",
            "9 eggs, beaten ADVERTISEMENT",
            "5 (6 inch) corn tortillas ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place chorizo sausage in a skillet over medium-high heat; cook and stir until sausage is browned and cooked through, about 5 minutes.\nStir eggs into the sausage; cook and stir until eggs are set and scrambled with the chorizo, 3 to 5 minutes.\nWarm corn tortillas on an electric skillet until they are heated through, about 2 minutes.\nPlace egg and chorizo into corn tortillas.\n",
        "picture_link": "daV8/S8z3EfMmQtiNVdiDlCveh99CW6"
    },
    {
        "title": "Hot Chocolate Truffles",
        "ingredients": [
            "50 NILLA® waters ADVERTISEMENT",
            "3 (.96 ounce) envelopes Swiss Miss® Simply Cocoa Dark Chocolate Hot Cocoa Mix ADVERTISEMENT",
            "1 (3.25 ounce) cup Snack Pack® Chocolate Pudding ADVERTISEMENT",
            "1/2 cup Reddi-wip® Original Dairy Whipped Topping ADVERTISEMENT",
            "1/2 cup miniature marshmallows ADVERTISEMENT",
            "1 cup premier white morsels ADVERTISEMENT",
            "1 tablespoon Pure Wesson® Vegetable Oil ADVERTISEMENT",
            "Coarse colored sugar (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line shallow baking pan with parchment paper; set aside. Place wafers and cocoa mix in food processor bowl; pulse wafers into fine crumbs. Add pudding and Reddi-wip; pulse until mixture comes together and forms a ball. Add marshmallows; pulse until marshmallows are cut into small pieces.\nRoll wafer mixture into 1-inch balls; place on pan. Freeze 30 minutes or until set.\nPlace morsels and oil in small microwave-safe bowl. Microwave on HIGH 30 seconds; stir. Microwave on HIGH 30 seconds more or until softened; stir until mixture is melted completely. Roll a truffle in mixture until evenly coated. Remove with fork, letting excess drip off. Place on pan. Immediately sprinkle with some colored sugar, if desired. Repeat with remaining truffles. Refrigerate 1 hour or until firm. Store in airtight container in refrigerator.\n",
        "picture_link": "J6wF4gGBRu85uXF8EIPmEUIdLBS299i"
    },
    {
        "title": "Chef John's Cheater Demi-Glace",
        "ingredients": [
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "3 ribs celery, chopped ADVERTISEMENT",
            "2 onions, chopped (including skins) ADVERTISEMENT",
            "2 carrots, chopped ADVERTISEMENT",
            "3 tablespoons tomato paste ADVERTISEMENT",
            "5 pounds whole chicken wings ADVERTISEMENT",
            "3 (1 inch thick) slices beef shank ADVERTISEMENT",
            "6 quarts cold water ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1/2 teaspoon whole black peppercorns ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nOil a large roasting pan with vegetable oil. Place celery, onions, and carrots in the pan. Drizzle tomato paste over the vegetables; toss together. Arrange chicken wings and beef shanks on the vegetables.\nBake in preheated oven 45 minutes. Turn chicken and beef pieces. Continue roasting until mixture is very well browned and even a bit charred here and there, another 30 to 40 minutes.\nTransfer mixture to a large stock pot along with pan juices. Add 6 quarts cold fresh water, bay leaf, and peppercorns. Bring to a simmer over high heat; reduce heat to low to maintain a gentle simmer with small bubbles and very little movement. Simmer until meat is falling off the bone and flavor is extracted from the chicken and beef, 12 to 14 hours. Remove from heat.\nStrain out all solids. Return pot to heat and bring to a simmer over medium-high heat. Reduce to about 2 quarts, or by 50 percent. Strain liquid though a strainer into a container; press down solids in strainer to extract all the liquid.\nBring to room temperature before covering; refrigerate. When demi-glace has solidified, gently use a spatula to scrape off any fat that has collected at the top.\n",
        "picture_link": "5yGlznPrVZv.5hev457MGCU7iyXVIWG"
    },
    {
        "title": "3-Ingredient Frozen Hot Chocolate",
        "ingredients": [
            "3 cups ice cubes ADVERTISEMENT",
            "3 cups milk ADVERTISEMENT",
            "3 cups hot cocoa mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine ice cubes, milk, and hot cocoa mix in a blender; blend to milkshake consistency.\n",
        "picture_link": "tgCnFqGCq1KHd8SklVJCQ3ep4n/nFre"
    },
    {
        "title": "Banana Pudding Cupcakes",
        "ingredients": [
            "24 vanilla wafers (such as Nilla®) ADVERTISEMENT",
            "1 (18.25 ounce) package vanilla cake mix (such as Duncan Hines®) ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "1 cup mashed ripe bananas ADVERTISEMENT",
            "1 2/3 cups crushed vanilla wafers (such as Nilla®), divided ADVERTISEMENT",
            "1 cup vanilla pudding ADVERTISEMENT",
            "1/2 cup thinly sliced ripe banana ADVERTISEMENT",
            "1 cup sweetened whipped cream, or more to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line 2 muffin tins with cupcake liners.\nPlace 1 vanilla wafer flat-side down in the bottom of each cupcake liner.\nBlend vanilla cake mix, water, eggs, and vegetable oil in a large bowl with an electric mixer on low speed until moistened, about 30 seconds. Beat at medium speed until smooth, about 2 minutes. Fold in mashed bananas and 1 cup crushed wafers. Scoop batter into prepared tins.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, 18 to 20 minutes. Transfer cupcakes to a wire rack to cool, about 30 minutes.\nCombine vanilla pudding and sliced banana in a small bowl.\nScoop out tops of cooled cupcakes, leaving a small hole in the middle of each. Fill holes with pudding mixture. Place a heaping spoonful of whipped cream on each cupcake; garnish with remaining 2/3 cup crushed vanilla wafers.\n",
        "picture_link": "M1VWMgWhvS4VH5FVws./K3Hf1wOyOjq"
    },
    {
        "title": "Greek Sorghum Bowl with Artichokes and Olives",
        "ingredients": [
            "1 cup whole grain sorghum, uncooked ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "1 cup marinated artichoke hearts, quartered ADVERTISEMENT",
            "1 cup pitted Kalamata olives, halved ADVERTISEMENT",
            "1 cup cucumbers, halved and sliced ADVERTISEMENT",
            "1 cup cherry or grape tomatoes, halved ADVERTISEMENT",
            "1/2 cup crumbled feta cheese ADVERTISEMENT",
            "1/2 cup red onion, thinly sliced ADVERTISEMENT",
            "Dressing: ADVERTISEMENT",
            "1/4 cup extra virgin olive oil ADVERTISEMENT",
            "1/4 cup lemon juice ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small saucepan, boil 4 cups of water and add 1 cup of whole grain sorghum to make 3 cups of cooked sorghum. Cover with a tight-fitting lid, reduce heat to medium and simmer for 45 minutes or until tender. Fluff with a fork.\nCombine all salad ingredients, including cooked sorghum, in a large bowl.\nWhisk together all dressing ingredients. Drizzle dressing over salad and toss to coat. Serve with lemon wedges.\n",
        "picture_link": "a3t1xbQzJocLZZTwLadKUtn2pY5Ooxy"
    },
    {
        "title": "Chocolate Banana Brownies",
        "ingredients": [
            "1 pound dark chocolate chips ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "1 dash vanilla extract ADVERTISEMENT",
            "3 ripe bananas, or more to taste ADVERTISEMENT",
            "1 cup all purpose flour ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1 tablespoon unsweetened cocoa powder ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C). Grease a deep baking pan.\nMelt chocolate and butter in top of a double boiler over simmering water, stirring frequently and scraping down the sides with a rubber spatula to avoid scorching.\nMix eggs and vanilla extract together in a large bowl; mash bananas into egg mixture until well mixed.\nCombine flour, sugar, cocoa powder, and baking powder in a separate bowl.\nMix chocolate mixture into the banana mixture; add flour mixture and stir until smooth. Pour mixture into the greased baking pan.\nBake in preheated oven until top is dry and edges have started to pull away from the sides of the pan, about 60 minutes.\n",
        "picture_link": "7biLlnuImD1qw5w2xJedC9IRajjpeEa"
    },
    {
        "title": "Red Velvet Mug Cakes",
        "ingredients": [
            "PAM® Original No-Stick Cooking Spray ADVERTISEMENT",
            "2 cups Reddi-wip® Original Dairy Whipped Topping ADVERTISEMENT",
            "1/4 cup Egg Beaters® Original ADVERTISEMENT",
            "1/2 cup dry red velvet cake mix ADVERTISEMENT",
            "3 tablespoons reduced-fat cream cheese spread ADVERTISEMENT",
            "4 tablespoons Reddi-wip® Original Dairy Whipped Topping ADVERTISEMENT",
            "1 tablespoon granulated sugar ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "For cakes, spray insides of 2 large microwave-safe mugs with cooking spray. Whisk together 2 cups Reddi-wip, Egg Beaters, and cake mix in medium bowl. Place half of batter in each mug. Microwave each mug individually on HIGH 1 minute to 1 minute 15 seconds or until set.\nFor frosting, stir together cream cheese spread, 2 servings Reddi-wip and sugar in small bowl until blended. Invert each cake onto a plate; top each with half of the frosting.\n",
        "picture_link": "j.36uXelYbkJ0YuPGd3Ssd9OYTzgkA."
    },
    {
        "title": "Mini Berry Trifles in a Jar",
        "ingredients": [
            "2 (6 ounce) containers raspberry nonfat yogurt ADVERTISEMENT",
            "2 (3.25 ounce) cups Snack Pack® Vanilla Pudding ADVERTISEMENT",
            "1 1/2 cups Reddi-wip® Fat Free Dairy Whipped Topping ADVERTISEMENT",
            "1 (9 inch) prepared angel food cake, cut into 1-inch pieces ADVERTISEMENT",
            "4 cups assorted fresh berries (such as blueberries, raspberries and blackberries) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together yogurt and pudding in medium bowl until blended. Fold in Reddi-wip.\nPlace about 8 cake pieces each in 8 small jars or glasses. Top each with 2 tablespoons pudding mixture and 6 berries. Repeat cake and pudding mixture layers. Cover; refrigerate at least 2 hours.\nTop with additional Reddi-wip and remaining berries just before serving.\n",
        "picture_link": ".wy6H7FHZm.rutHJDisZpsVMwjNLNiy"
    },
    {
        "title": "Tamagoyaki with Mushroom and Mozzarella Cheese",
        "ingredients": [
            "2 teaspoons olive oil ADVERTISEMENT",
            "6 button mushrooms, sliced very thin ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "2 1/2 tablespoons white sugar ADVERTISEMENT",
            "1 pinch salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 teaspoon red chile powder, or to taste ADVERTISEMENT",
            "2 tablespoons vegetable oil, divided ADVERTISEMENT",
            "1 ounce mozzarella cheese, sliced very thin ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat olive oil in a large skillet over medium heat. Add mushrooms; cook and stir until mushrooms are browned and release their moisture, about 5 minutes. Remove from heat, drain, and pat dry.\nBeat eggs, sugar, salt, pepper, and red chile powder together in a bowl.\nCoat the skillet with some vegetable oil; set over medium heat. Pour in some of the beaten eggs, tilting skillet to spread into a thin layer. Cook until almost set, 1 to 2 minutes. Run a heatproof rubber spatula around the edges to loosen. Cover with some mushrooms; roll up egg and move to the side of the skillet.\nGrease skillet with some more vegetable oil. Pour in more eggs to create a second layer. Lift the first roll up to get raw egg underneath. Sprinkle mozzarella cheese on top; roll second layer up over the first.\nRepeat layering and rolling process with remaining oil, eggs, mushrooms, and mozzarella cheese. Cook finished tamagoyaki until lightly browned, about 30 seconds per side.\nTransfer tamagoyaki to a cutting board. Let cool for 5 to 10 minutes before slicing.\n",
        "picture_link": "qE58a7Z1Au0GXvPO188iHZZVqna9hLa"
    },
    {
        "title": "Tuna Stroganoff Casserole",
        "ingredients": [
            "1 (10.75 ounce) can condensed cream of celery soup ADVERTISEMENT",
            "1 cup grated Cheddar cheese ADVERTISEMENT",
            "3/4 cup milk ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1 (7 ounce) can tuna, drained ADVERTISEMENT",
            "2 tablespoons chopped parsley ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1 pound cooked pasta ADVERTISEMENT",
            "1 1/2 cups bread crumbs, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nCombine cream of celery soup, Cheddar cheese, milk, sour cream, mayonnaise, tuna, parsley, lemon juice, salt, and ground black pepper in a 9x5-inch loaf pan; stir until sauce is well mixed.\nToss the pasta into the sauce until thoroughly coated. Spread the bread crumbs over the top of the pasta mixture.\nBake in the preheated oven until bread crumbs are golden brown and sauce is bubbly, about 45 minutes.\n",
        "picture_link": "sU5u/RmmRDkWlzZke9lKL9plaDAJftW"
    },
    {
        "title": "Tamagoyaki (Japanese Sweet Omelet)",
        "ingredients": [
            "1 tablespoon water ADVERTISEMENT",
            "1 teaspoon soy sauce, or to taste (optional) ADVERTISEMENT",
            "1/2 teaspoon white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix water, soy sauce, and sugar together in a small bowl until sugar is dissolved. Add egg and beat until egg mixture is combined.\nHeat skillet over medium heat until a drop of water evaporates almost immediately. Pour egg mixture into pan. Cook until the bottom of the omelet has solidified, 3 to 5 minutes. Flip and fold omelet into a square and transfer to a plate.\n",
        "picture_link": "y3c.YwzAKdeJPqS22oLnhQCH6S3HicW"
    }
]