[
    {
        "title": "My Hoppin' John",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 large meaty ham bone ADVERTISEMENT",
            "1 1/2 cups chopped onion ADVERTISEMENT",
            "3 stalks celery, chopped ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "3 (15 ounce) cans black-eyed peas, rinsed and drained ADVERTISEMENT",
            "2 cups water ADVERTISEMENT",
            "1 1/4 cups chicken broth, or more as needed ADVERTISEMENT",
            "1 cup dry white wine ADVERTISEMENT",
            "1 cup chopped ham ADVERTISEMENT",
            "2 bay leaves ADVERTISEMENT",
            "1/4 teaspoon dried thyme ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "2 cups uncooked white rice ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a large Dutch oven or soup pot over medium-high heat and brown the ham bone on all sides, about 15 minutes. Reduce heat to medium and stir in the onion, celery, and garlic, and cook until the onion is translucent, stirring often, about 5 minutes. Add the black-eyed peas, 2 cups of water, chicken broth, wine, ham, bay leaves, thyme, salt, and pepper; stir. Bring the mixture to a boil. Reduce heat and simmer until the mixture is thickened and the flavors have blended, 30 to 60 minutes. Add more chicken stock if the mixture is too thick.\nAbout 30 minutes before serving, bring the rice and 4 cups of water to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until the rice is tender and the liquid has been absorbed, 20 to 25 minutes. Let the rice stand covered for about 10 minutes to absorb steam.\nRemove the ham bone from the soup, cutting any extra ham off the bone and returning it to the pot. Discard the bone. Stir the cooked rice into the black-eyed pea mixture until well combined and serve.\n",
        "picture_link": "5YmLLA8cLhsLD9Ox3M0PvCN/uJY.oRm"
    },
    {
        "title": "Chicken Pot Pie on the Run",
        "ingredients": [
            "1/4 cup butter ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt (optional) ADVERTISEMENT",
            "1/4 teaspoon black pepper ADVERTISEMENT",
            "1 (10.75 ounce) can reduced-fat, reduced-sodium condensed cream of chicken soup, undiluted ADVERTISEMENT",
            "1 (10.75 ounce) can 2% low-fat milk ADVERTISEMENT",
            "1 1/2 cups meat from rotisserie chicken, skinned and cubed ADVERTISEMENT",
            "1 (29 ounce) can mixed vegetables (such as Veg-All®), drained ADVERTISEMENT",
            "1 (9 inch) refrigerated pie crust (such as Pillsbury®) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nMelt the butter in a saucepan over medium-low heat, and cook and stir the onion with butter until translucent, about 5 minutes. Stir in the flour, salt, and pepper to make a paste. Whisk in the chicken soup and milk, and cook and stir the sauce until smooth and thickened, about 5 minutes. Lightly mix in the cooked chicken and mixed vegetables, and pour the chicken and sauce into a 2-quart deep casserole dish.\nUnroll the pie crust, lay it on the casserole dish, and fold and press the edges of the crust down to seal the crust to the dish. Cut several small slits in the crust.\nBake in the preheated oven until the crust is golden brown and the filling is bubbling, 35 to 40 minutes. Cool 10 minutes before serving.\n",
        "picture_link": "oL4wqHvtgwi5oNhhrX4cYs5zNgzMvny"
    },
    {
        "title": "Moroccan Fig Pork Roast",
        "ingredients": [
            "1 (5 pound) boneless pork loin roast ADVERTISEMENT",
            "1 tablespoon curry powder ADVERTISEMENT",
            "1 tablespoon ground turmeric ADVERTISEMENT",
            "1 tablespoon garam masala ADVERTISEMENT",
            "2 teaspoons ground ginger ADVERTISEMENT",
            "2 teaspoons chili powder ADVERTISEMENT",
            "1 teaspoon ground cumin ADVERTISEMENT",
            "1 pinch ground cayenne pepper ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "3 cloves garlic, roughly chopped ADVERTISEMENT",
            "1 onion, roughly chopped ADVERTISEMENT",
            "2 tablespoons fig compote ADVERTISEMENT",
            "1 (14.5 ounce) can whole peeled tomatoes ADVERTISEMENT",
            "1 cup chicken broth ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Pat pork roast dry with a clean towel. Mix curry powder, turmeric, garam masala, ground ginger, chili powder, cumin, cayenne, salt, and pepper in a small bowl. Rub spice mixture all over the pork roast.\nHeat the olive oil and butter in a large, heavy bottom pot or Dutch oven over medium-high heat. Place the seasoned pork roast into the pot and cook until evenly browned, about 2 minutes on each side. Remove pork and set aside. Stir in the garlic and onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Stir in the fig compote, until well blended. Return pork to the pot, coating it with the fig mixture. Pour in the tomatoes and chicken broth. Cover, and bring to a boil.\nPlace covered pot in the preheated oven. Cook until the pork is no longer pink in the center, about 2 hours. An instant-read thermometer inserted into the center should read 145 degrees F (63 degrees C).\n",
        "picture_link": "Tpdu9bBKYiKXaN9HSNShPVi2kRLihci"
    },
    {
        "title": "Jazzed Up Couscous",
        "ingredients": [
            "1 (10 ounce) box couscous ADVERTISEMENT",
            "1 1/2 cups boiling water ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/2 onion, diced ADVERTISEMENT",
            "2 cloves garlic, minced ADVERTISEMENT",
            "3 Roma (plum) tomatoes, diced ADVERTISEMENT",
            "1/2 cup shredded Cheddar-Monterey Jack cheese blend ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together couscous and boiling water in a large, heatproof bowl. Cover with plastic wrap, and set aside for 10 minutes.\nMeanwhile, heat olive oil in a skillet over medium heat. Stir in onions and garlic, and cook until the onion has softened and turned translucent, about 5 minutes. Add the diced Roma tomatoes, and cook until the tomatoes release their juice and the mixture begins to thicken.\nFluff the couscous with a fork, then fold in the tomato mixture and cheese. Serve immediately as the cheese is melting.\n",
        "picture_link": "fyJgGz0goo2CrHBN6psBJ/b9HzVC2xe"
    },
    {
        "title": "Cucumber Lemonade",
        "ingredients": [
            "1 cucumber, thinly sliced ADVERTISEMENT",
            "1 (12 ounce) can frozen lemonade concentrate ADVERTISEMENT",
            "1 (2 liter) bottle lemon-lime flavored carbonated beverage ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the cucumber slices into a large pitcher. Pour the lemonade concentrate over the cucumber and let stand for 10 minutes. Pour in the lemon-lime soda and pour into glasses to serve.\n",
        "picture_link": "zEOtR3N6yjHu5vbqlhN3MkXe43WjJq."
    },
    {
        "title": "White Turkey Chili",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 1/2 cups chopped onion ADVERTISEMENT",
            "3 cloves garlic, minced ADVERTISEMENT",
            "2 teaspoons dried oregano ADVERTISEMENT",
            "1 1/2 teaspoons ground cumin ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "1/2 cup low-sodium chicken broth ADVERTISEMENT",
            "1/2 cup dry white wine ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "2 cups shredded cooked turkey ADVERTISEMENT",
            "2 cups white kidney beans (cannellini), undrained ADVERTISEMENT",
            "2 fresh jalapeno peppers, chopped ADVERTISEMENT",
            "1 1/2 cups shredded Monterey Jack cheese ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon coarsely ground black pepper ADVERTISEMENT",
            "2 tablespoons lime juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a skillet over medium heat. Cook onion in oil until the onion has softened and turned translucent, about 5 minutes. Stir in garlic, oregano, cumin, and ginger; cook for another minute. Pour in chicken broth and white wine, and then add the bay leaf. Cook uncovered until slightly reduced, about 5 to 8 minutes.\nStir in turkey, beans, and jalapeno. Simmer uncovered for 10 minutes, stirring occasionally.\nUsing back of spoon, mash 1/4 of beans to thicken sauce. Reduce heat to low, and begin stirring in cheese 1/2 cup at a time. Stir until cheese is completely melted. Season with salt and pepper. Remove from heat, and stir in lime juice. Serve hot.\n",
        "picture_link": "wUjF0QhJFm/eFkNEuQQtMUiy6.1rtay"
    },
    {
        "title": "The Original Donair From the East Coast of Canada ",
        "ingredients": [
            "1 pound ground beef ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "2 teaspoons cayenne pepper ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 (12 ounce) can evaporated milk ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1/4 cup white vinegar, or to taste ADVERTISEMENT",
            "6 large pita bread rounds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a bowl, thoroughly mix together the ground beef, black pepper, onion powder, garlic powder, salt, paprika, cayenne pepper, and oregano. Pack the spiced meat into a thick loaf shape, cover, and let rest in the refrigerator overnight.\nPreheat oven to 350 degrees F (175 degrees C).\nPlace the meat loaf onto a baking sheet, and bake for 1 hour, flipping the loaf over halfway through cooking. Allow the meat loaf to cool so it holds together for slicing.\nMix together the evaporated milk and white sugar in a bowl, stirring until the sugar is dissolved, and then add the vinegar by teaspoons, mixing together after each addition, to taste. Refrigerate the sauce until serving.\nSlice the meat loaf into 1/4-inch thick slices, and brown the slices in a skillet over medium heat until both sides are brown and crisp, about 5 minutes per side.\nSprinkle the pita bread rounds with a little water, and press each onto a heated skillet to warm up.\nTo serve, place several slices of meat into a warmed pita bread, and spoon about 2 tablespoons of sauce over the meat. Roll the pita bread into a cone shape, wrap in aluminum foil to keep the sauce from dripping out, and serve.\n",
        "picture_link": "I1Q5S/1shVV.dtirKBIuRMP8TFTy.gW"
    },
    {
        "title": "Fresh Green Beans, Fennel, and Feta Cheese",
        "ingredients": [
            "1 pound fresh green beans, trimmed ADVERTISEMENT",
            "1 fennel bulb, cut into thin slices ADVERTISEMENT",
            "1/4 cup extra-virgin olive oil ADVERTISEMENT",
            "2 tablespoons chopped fresh basil leaves ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/4 cup crumbled feta cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Fill a saucepan half full with water and bring to a boil. Add the green beans and fennel slices; cook until just beginning to become tender, about 4 minutes. Pour into a colander to drain and run under cold water to stop the cooking process.\nReturn the empty pan to the stove and set heat to medium. Pour in the olive oil and let it heat for a minute. Return the green beans and fennel to the pan. Season with basil, salt, and pepper; cook and stir until coated and warm. Transfer to a serving dish and toss with feta cheese.\n",
        "picture_link": "etRHJ7KXqb.ushRfVFvwhPnQ5Vei21e"
    },
    {
        "title": "Asparagus, Potato, and Onion Frittata",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 potatoes, shredded ADVERTISEMENT",
            "1/4 cup chopped onion ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon fresh ground black pepper ADVERTISEMENT",
            "1 pound asparagus, trimmed and cut into 2-inch pieces ADVERTISEMENT",
            "1 cup diced ham ADVERTISEMENT",
            "6 eggs ADVERTISEMENT",
            "1 tablespoon milk ADVERTISEMENT",
            "1/2 cup shredded mozzarella cheese ADVERTISEMENT",
            "1/2 cup shredded white Cheddar cheese ADVERTISEMENT",
            "1 tablespoon chopped fresh basil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking dish.\nHeat the olive oil in a large skillet over medium heat; cook and stir the shredded potato and onion in the hot oil until the potatoes begin to brown, about 5 minutes.. Season with salt and pepper. Add the asparagus and ham and continue cooking until the asparagus is tender, another 5 to 7 minutes; transfer to the prepared baking dish. Whisk the eggs and milk together in a small bowl; pour evenly over the dish. Scatter the mozzarella and white Cheddar cheeses over the top of the potato mixture.\nBake in the preheated oven until set in the middle, 20 to 25 minutes. Garnish with the basil to serve.\n",
        "picture_link": "gbQ6xKU98RkkwkwZEdMDP/KRFfFY0KG"
    },
    {
        "title": "Red Pepper Cream Sauce",
        "ingredients": [
            "2 red bell peppers, cut into chunks ADVERTISEMENT",
            "2 cups heavy cream ADVERTISEMENT",
            "1 teaspoon paprika ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1/8 teaspoon ground white pepper ADVERTISEMENT",
            "1 pinch cayenne pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the bell peppers and heavy cream in a pot and bring to boil over medium heat; reduce heat to medium-low and continue simmering, stirring occasionally, until the cream reduces to about 1 cup, about 30 minutes. Remove from heat and stir in the paprika, lemon juice, salt, white pepper, and cayenne pepper.\nPour the sauce into a blender. Hold the lid firmly with a towel while blending, using a few quick pulses to get the sauce moving before leaving it on to blend until smooth. Serve hot.\n",
        "picture_link": "GNj4DydgpxPLUf61CoTI81GsGL7gjhy"
    },
    {
        "title": "Earthquake Pie Crust",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "3/4 cup shortening ADVERTISEMENT",
            "3/4 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon baking powder ADVERTISEMENT",
            "5 tablespoons cold water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place flour, shortening, salt, baking powder, and water in a 2 quart bowl with a form fitting lid. Place lid on securely. Shake for 45 seconds, or until it sounds mixed. Turn bowl on its side, and shake up and down for 15 seconds to form a ball. Open bowl, and scrape dough out. Form into two balls. Chill while preparing filling. Roll out and use as directed in your favorite recipe.\n",
        "picture_link": "pT1L.3lAHhv6XBoNHYkFU8QFHINHTi6"
    },
    {
        "title": "Lobster de Jonghe",
        "ingredients": [
            "24 ounces cooked and cubed lobster meat ADVERTISEMENT",
            "1/2 cup bread crumbs ADVERTISEMENT",
            "2 tablespoons thinly sliced green onion ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1/2 cup butter, melted ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1/4 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a small bowl, mix together bread crumbs, cheese, green onions, 1/4 cup melted margarine, and lemon juice. Set aside.\nPlace lobster meat into 6 ramekins. Pour 1/2 cup melted butter or margarine over lobster, and top with bread crumb mixture.\nBake for 25 minutes, or until topping is browned.\n",
        "picture_link": "/UjwuFtwHCZ1o4M3K5cIC4FqhoLS9je"
    },
    {
        "title": "Ellen's Lemon Zucchini Bread",
        "ingredients": [
            "1 teaspoon white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "1 cup vegetable oil ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 teaspoon lemon extract ADVERTISEMENT",
            "1 lemon, zested ADVERTISEMENT",
            "3 cups flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon baking powder ADVERTISEMENT",
            "2 cups grated zucchini ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Grease 2 loaf pans; sprinkle sugar into the bottom and on the sides of the greased pans.\nBeat the eggs, 2 cups sugar, vegetable oil, vanilla extract, lemon extract, and lemon zest together in a large bowl.\nMix the flour, salt, baking soda, and baking powder together in a separate bowl; add to the egg mixture and stir until the batter is thick. Fold the zucchini into the batter. Pour the batter into the prepared loaf pans.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 1 hour. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.\n",
        "picture_link": "1CqIl/gMPs5BWl5IqXnY/GKmiXUT03G"
    },
    {
        "title": "Pasta Salad I",
        "ingredients": [
            "3 cups fusilli pasta ADVERTISEMENT",
            "3/4 cup broccoli florets ADVERTISEMENT",
            "3/4 cup cauliflower florets ADVERTISEMENT",
            "1/2 cup red onion, sliced ADVERTISEMENT",
            "1/2 cup thinly sliced carrots ADVERTISEMENT",
            "1/2 cup red bell pepper, chopped ADVERTISEMENT",
            "1/2 cup chopped green bell pepper ADVERTISEMENT",
            "1/2 cup chopped mushrooms ADVERTISEMENT",
            "1/2 cup chopped celery ADVERTISEMENT",
            "3/4 cup light mayonnaise ADVERTISEMENT",
            "1/4 cup distilled white vinegar ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cook pasta according to package directions. Drain and rinse pasta under cold water.\nPlace pasta in a large serving bowl add the all the vegetables and toss to combine.\nCombine the mayonnaise, vinegar and sugar together, whisk until smooth. Pour over salad and mix well. Season to taste with salt and pepper and serve.\n",
        "picture_link": "EVYVaulSXHGz5uvT/n9q8zlQFiFwXqe"
    },
    {
        "title": "Creamy Mango Smoothie",
        "ingredients": [
            "3/4 cup cold milk ADVERTISEMENT",
            "1/4 cup vanilla yogurt ADVERTISEMENT",
            "3/4 teaspoon vanilla extract ADVERTISEMENT",
            "1 1/2 cups chopped fresh mango ADVERTISEMENT",
            "3 ice cubes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Blend the milk, yogurt, vanilla extract, mango, and ice cubes in a blender until smooth and creamy.\n",
        "picture_link": "zSH/FBCQzPfmHi0POZ.9WCtMpsaKTa."
    },
    {
        "title": "Stuffed Sole",
        "ingredients": [
            "1 tablespoon lemon juice ADVERTISEMENT",
            "2 tablespoons thinly sliced green onion ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/4 cup dry white wine ADVERTISEMENT",
            "4 (6 ounce) fillets sole ADVERTISEMENT",
            "1/4 pound cooked salad shrimp ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1/4 teaspoon paprika ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "1 tablespoon all-purpose flour ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a small bowl, combine lemon juice, green onion, garlic, and wine. Set aside.\nLay filets flat, and divide shrimp evenly among them in a band across one end of each fillet. Roll up around shrimp, and secure with toothpick. Place in a baking dish. Season to taste with salt, pepper, and paprika. Pour lemon juice mixture over the fish. Cover.\nBake at 350 degrees F (175 degrees C) for 25 minutes.\nWhen fillets are nearly done, prepare sauce. In a small saucepan, melt butter over medium heat. Stir in flour. Transfer fish to serving platter ,and keep warm. Pour pan juices into butter/flour mixture; cook and stir until thickened. Pour over sole, and serve.\n",
        "picture_link": "y5bfwsfiAjnd9AKDV6ylva/XWRjFZDi"
    },
    {
        "title": "Devils on Horseback",
        "ingredients": [
            "20 wooden toothpicks ADVERTISEMENT",
            "1/4 cup reduced-sodium soy sauce ADVERTISEMENT",
            "1/2 teaspoon ground ginger ADVERTISEMENT",
            "3/4 cup dark brown sugar ADVERTISEMENT",
            "20 dates, pitted and left whole ADVERTISEMENT",
            "20 whole smoked almonds ADVERTISEMENT",
            "10 bacon slices, cut in half crosswise ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Soak the toothpicks in a bowl of water. Grease a 9x13-inch baking dish.\nIn a bowl, mix together the soy sauce and ground ginger. Place the brown sugar into a shallow bowl. Spread open a pitted date, then stuff it with a smoked almond. Wrap the date with half a bacon slice, secure it with a toothpick, dip the bundle in soy sauce mixture, and then dip it into brown sugar. Place the wrapped dates into the prepared baking dish. If desired, sprinkle a little more brown sugar over the bundles.\nBake in the preheated oven until the bacon is brown and crisp, 15 to 25 minutes. Allow to cool for about 15 minutes before serving; serve warm or at room temperature.\n",
        "picture_link": "vKdka0w7i3yfnWYTly0.HZRpMRMZxgO"
    },
    {
        "title": "Azteca Soup",
        "ingredients": [
            "10 (6 inch) corn tortillas, cut into 1/2 inch strips ADVERTISEMENT",
            "1 1/2 cups vegetable oil for frying ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "4 cups chicken broth ADVERTISEMENT",
            "1 cup fresh cilantro leaves ADVERTISEMENT",
            "2 large tomatoes ADVERTISEMENT",
            "1 large onion ADVERTISEMENT",
            "1 tablespoon chipotle peppers in adobo sauce ADVERTISEMENT",
            "1 teaspoon salt, or to taste ADVERTISEMENT",
            "2 avocados - peeled, pitted and diced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in large skillet and carefully drop in half the tortilla strips. Fry in batches until golden brown and crunchy. Place fried tortilla strips on a paper towel-lined plate and pat dry. Sprinkle salt on tortillas, tossing to coat both sides.\nUsing a blender or food processor, blend tomatoes, onion and cilantro until completely pureed.\nIn a saucepan, heat chicken broth, chipotle chili, and pureed vegetables. Bring to a boil; remove from heat. Ladle soup into serving bowls. Prior to serving, add tortilla strips and avocado. Buen provecho!\n",
        "picture_link": "uyUHwYhmR8g17ihL03mmbczbKVtNSg2"
    },
    {
        "title": "Stuffed Jalapenos",
        "ingredients": [
            "2 (7 ounce) cans jalapeno peppers ADVERTISEMENT",
            "6 ounces shredded Mexican-style cheese blend ADVERTISEMENT",
            "1 pound pork sausage, hot ADVERTISEMENT",
            "1 (5.5 ounce) package spicy seasoning coating mix ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Slice peppers lengthwise, remove seeds and core; fill with cheese.\nRoll out sausage with rolling pin, between two layers of plastic wrap. Remove plastic from sausage, and wrap a thin coating of sausage around each jalapeno.\nRoll peppers in spicy seasoned coating mix.\nBake at 350 degrees F (175 degrees C) for 15 to 25 minutes or until brown and sizzling and cheese is melted.\n",
        "picture_link": "Y9h3duC2kONfwvM55LV3SPAOpawuufq"
    },
    {
        "title": "Grilled Tuna",
        "ingredients": [
            "4 (6 ounce) albacore tuna steaks, 1 inch thick ADVERTISEMENT",
            "3 tablespoons extra virgin olive oil ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1 lime, juiced ADVERTISEMENT",
            "1/2 cup hickory wood chips, soaked ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place tuna steaks and olive oil in a large resealable plastic bag. Seal, and refrigerate for 1 hour.\nPreheat the grill for medium heat. When coals are very hot, scatter a handful of hickory or mesquite wood chips over them for flavor.\nLightly oil grill grate. Season tuna with salt and pepper, and cook on the preheated grill approximately 6 minutes, turning once. Transfer to a serving platter, and drizzle with freshly squeezed lime juice. Serve immediately.\n",
        "picture_link": "EaQy7ygwQteZ/7lAOOfxMoBHRmTEt1a"
    },
    {
        "title": "Carolina Fish Cakes",
        "ingredients": [
            "3 cups water ADVERTISEMENT",
            "2 potatoes, peeled ADVERTISEMENT",
            "1/3 cup minced onion ADVERTISEMENT",
            "1/3 cup chopped green bell pepper ADVERTISEMENT",
            "1/3 cup red bell pepper, chopped ADVERTISEMENT",
            "1/3 cup chopped celery ADVERTISEMENT",
            "2 tablespoons butter ADVERTISEMENT",
            "3 1/2 cups cooked cod, boned and flaked ADVERTISEMENT",
            "4 tablespoons all-purpose flour ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "1 teaspoon Old Bay Seasoning TM ADVERTISEMENT",
            "1/4 teaspoon mustard powder ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1/2 cup milk ADVERTISEMENT",
            "1/2 cup dry bread crumbs ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Grease two baking sheets. Bring 3 cups of water to a boil. Add potatoes and cook until tender but still firm, about 15 minutes. Drain and mash. Reserve 1 cup mashed potatoes; discard remainder.\nIn a large saucepan, saute onion, green and red bell pepper and celery in butter over medium high heat until tender. Turn heat to low and fold in flaked fish. Slowly mix in flour, cheese, Old Bay seasoning, dry mustard, salt, pepper, mashed potatoes and milk. Mix gently but thoroughly. Remove pan from heat.\nWith floured hands shape batter into cakes 1/2 inch by 3 inches. Coat with breadcrumbs.\nIf you are baking the fish cakes bake them for 10 minutes, flip the cakes and bake another 15 minutes until golden brown.\n",
        "picture_link": "3YHBoaBpVzzdFIa5/6.wr467dHEzZqC"
    },
    {
        "title": "Four Cheese Baked Ziti",
        "ingredients": [
            "2 cups half-and-half ADVERTISEMENT",
            "1/2 teaspoon dried basil ADVERTISEMENT",
            "1/4 teaspoon crushed red pepper flakes ADVERTISEMENT",
            "1 1/4 cups shredded provolone cheese ADVERTISEMENT",
            "1 1/4 cups shredded mozzarella cheese ADVERTISEMENT",
            "1 1/4 cups shredded Swiss cheese ADVERTISEMENT",
            "2 tablespoons grated Parmesan cheese ADVERTISEMENT",
            "2 egg yolks, beaten ADVERTISEMENT",
            "8 ounces ziti pasta ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Butter a 2 quart ovenproof casserole dish; set aside.\nCook pasta in a large pot of boiling salted water until al dente. Drain.\nMeanwhile, bring half-and-half, basil, and crushed red pepper to a simmer in a heavy, large saucepan over medium high heat. Add cheeses 1 handful at a time, stirring constantly until cheeses are melted and smooth. Remove from heat, and stir in egg yolks. Season with salt and black pepper to taste. Mix in pasta. Spoon into prepared dish.\nBake until heated through, approximately 10 minutes. Serve hot.\n",
        "picture_link": "veJnn2.XsUPrHxnJC3T5Aa9l9OIzS3q"
    },
    {
        "title": "Bing Cherry Gelatin Mold",
        "ingredients": [
            "1 (16.5 ounce) can pitted Bing cherries, drained, juice reserved ADVERTISEMENT",
            "1 (12 fluid ounce) can cola-flavored carbonated beverage ADVERTISEMENT",
            "1 (6 ounce) package black cherry flavored Jell-O® mix ADVERTISEMENT",
            "1 (15.25 ounce) can crushed pineapple, drained ADVERTISEMENT",
            "1 cup chopped pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan, combine the reserved cherry juice with the cola. Bring to a boil, and stir in the gelatin until dissolved. Remove from the heat, and mix in the drained cherries, drained pineapple, and chopped pecans. Pour mixture into a mold sprayed with non-stick cooking spray, and refrigerate for at least 24 hours before serving.\n",
        "picture_link": "0qX9JF1X/Kxdw1sp5OnrgwBzXHFbYq."
    },
    {
        "title": "Shieldzini",
        "ingredients": [
            "3 cucumbers ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "2 teaspoons white sugar ADVERTISEMENT",
            "3 tablespoons rice wine vinegar ADVERTISEMENT",
            "3 tablespoons soy sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Cut cucumbers lengthwise, scoop out seeds with a spoon, and slice cucumbers into bite-sized pieces. Transfer to a salad bowl.\nIn a small bowl, mix together salt, oil, sugar, rice wine vinegar, and soy sauce. Pour over cucumbers, and gently toss. Refrigerate several hours before serving, tossing every now and then.\n",
        "picture_link": "gPSgi1WfM2HHtrtSLlEF7Y8KKLoXZFC"
    },
    {
        "title": "Italian White Bean and Pancetta Soup",
        "ingredients": [
            "6 ounces pancetta bacon, finely diced ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 cup red onion, chopped ADVERTISEMENT",
            "1 cup chopped celery ADVERTISEMENT",
            "1 tablespoon chopped fresh sage ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon ground black pepper ADVERTISEMENT",
            "6 cups chicken stock ADVERTISEMENT",
            "4 (19 ounce) cans cannellini beans, drained and rinsed ADVERTISEMENT",
            "2 cups seashell pasta ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "2 tablespoons finely chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In an 8-quart pot, saute pancetta in the olive oil until soft, about 10 minutes. Add onion and celery; cook and stir until the onion has softened and turned translucent, about 5 minutes. Sprinkle with sage, 1 teaspoon salt, and black pepper. Pour in the chicken stock, cover, and bring to a boil. Stir in the drained beans, cover, and reduce the heat to low. Simmer for 30 minutes.\nMeanwhile, cook the pasta in 4 quarts boiling water with 1 teaspoon salt until al dente, about 10 minutes. Drain and add to the soup.\nStir in minced parsley before serving, and sprinkle with grated cheese.\n",
        "picture_link": "wCE8dLhWc.Tgu434nGXG9SNXo4PNDpy"
    },
    {
        "title": "Bohemian Pork Roast",
        "ingredients": [
            "3 pounds bone-in pork roast ADVERTISEMENT",
            "2 tablespoons dried marjoram ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "3 tablespoons caraway seed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 325 degrees F (165 degrees C).\nHeat a roasting pan over medium high heat until hot. Rub the roast with the marjoram, salt and pepper. Brown all sides of the roast in the hot roasting pan. Sprinkle caraway seeds over all and pour in enough water to come halfway up the sides of the roast.\nCover and place roast in the preheated oven. Bake for 1 1/2 hours, or until an internal temperature of 145 degrees F (63 degrees C) is reached, about 30 minutes per pound. Remove from oven and let sit for 10 minutes before carving.\n",
        "picture_link": "3wF1ZT3Wa3PXA.36Q/hbnRFgLrvgqC2"
    },
    {
        "title": "Green Chile Stew with Pork",
        "ingredients": [
            "3 pounds boneless pork loin, cubed ADVERTISEMENT",
            "3 tablespoons peanut oil ADVERTISEMENT",
            "3 stalks celery, chopped ADVERTISEMENT",
            "2 tomatoes, chopped ADVERTISEMENT",
            "7 green chile peppers, chopped ADVERTISEMENT",
            "4 cloves crushed garlic ADVERTISEMENT",
            "4 cups chicken broth ADVERTISEMENT",
            "1 (10 ounce) jar prepared green chile salsa ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large skillet over medium high heat, brown the pork in oil, doing so in 2 to 3 batches.\nPlace the meat in 3 to 4-quart covered casserole and add celery, tomatoes, chilies, and garlic.\nAdd about 1 cup chicken broth or water to skillet pork was cooked in, stirring over high heat to scrape up browned bits on bottom and bring to boil. Add to pot with enough additional water or broth to barely cover the ingredients. Cover and simmer until stew is thick and meat very tender, about 1 1/2 hours. Add salt to taste before serving. If stew is not hot enough, add a bit of jalapeno salsa.\n",
        "picture_link": "30E5MNE0JS/VE/BeBkbchg1RESchRBq"
    },
    {
        "title": "Easy Elegant Skillet Chicken Supreme",
        "ingredients": [
            "1/2 cup dried bread crumbs ADVERTISEMENT",
            "4 tablespoons all-purpose flour, divided ADVERTISEMENT",
            "1 cup ice water ADVERTISEMENT",
            "1 pound skinless, boneless chicken breasts ADVERTISEMENT",
            "1/4 cup olive oil ADVERTISEMENT",
            "1 cup fresh sliced mushrooms ADVERTISEMENT",
            "1/2 cup chicken broth ADVERTISEMENT",
            "1/2 cup white wine ADVERTISEMENT",
            "2 ounces shredded mozzarella cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a shallow dish or bowl, combine bread crumbs and 3 tablespoons flour. Dip chicken into ice water, then dredge through crumb mixture. In a medium skillet, heat oil over medium high heat. Add chicken and saute until both sides are lightly browned and chicken is cooked through (juices run clear). Remove chicken from skillet and set aside, keeping warm.\nTo same skillet add mushrooms and saute. Sprinkle with remaining 1 tablespoon flour and stir quickly to mix together. Add broth and wine and let simmer, stirring, until thickened (about 2 minutes).\nReturn reserved chicken to skillet. Top with cheese. Cover and cook until cheese is melted.\n",
        "picture_link": "fgnBKuglkqY4DqIXsZEn.vn.wlrKk6y"
    },
    {
        "title": "Tomato Salsa",
        "ingredients": [
            "5 pounds Roma tomatoes ADVERTISEMENT",
            "3 green bell peppers, diced ADVERTISEMENT",
            "8 stalks celery, chopped ADVERTISEMENT",
            "8 jalapeno peppers, seeded and minced ADVERTISEMENT",
            "2 tablespoons white sugar ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "4 (4 ounce) cans diced green chiles ADVERTISEMENT",
            "3 tablespoons salt ADVERTISEMENT",
            "2 tablespoons dried oregano ADVERTISEMENT",
            "1 tablespoon ground black pepper ADVERTISEMENT",
            "3 onions, chopped ADVERTISEMENT",
            "3 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a six-quart pot of boiling water, blanch tomatoes, drain and cool under cold water. Peel and coarsely chop. Return chopped tomatoes to pot, bring to boil and reduce heat. Skim juice from top of tomatoes and reserve, if you'd like, for another use. Do not overcook and allow tomatoes to remain chunky.\nIn two quarts of boiling salted water, add chopped bell peppers, celery, jalapenos, garlic, green chilies and cook until all ingredients are tender. Drain and add vegetables to tomatoes.\nAdd salt, oregano, black pepper and cilantro. Simmer gently for 15 minutes.\nHot pack the salsa in clean pint jars. Follow manufactures suggestions on preparing the lids and jars for proper sealing.\n",
        "picture_link": "C/oaHuZ91YskYdVZwH/IDeUa9UPwgX."
    },
    {
        "title": "Coleslaw with a Difference!",
        "ingredients": [
            "1/2 (16 ounce) package shredded coleslaw mix ADVERTISEMENT",
            "1/2 teaspoon seasoning salt ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "2 tablespoons olive oil ADVERTISEMENT",
            "1/2 cup mayonnaise ADVERTISEMENT",
            "1/2 cup salsa ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, combine coleslaw, seasoning salt, lemon juice, olive oil, mayonnaise and salsa. Toss well and serve.\n",
        "picture_link": "yWm83e5qeJYuxSB6xMppXk7EI7biqFm"
    },
    {
        "title": "Five Cup Salad",
        "ingredients": [
            "1 cup fruit cocktail, drained ADVERTISEMENT",
            "1 cup mandarin orange segments, drained ADVERTISEMENT",
            "1 cup pineapple chunks, drained ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1/2 cup shredded coconut ADVERTISEMENT",
            "1 cup rainbow colored miniature marshmallows ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine the fruit cocktail, mandarin oranges and pineapple chunks in a large bowl. Fold in the sour cream and coconut. Chill. Just before serving, stir in the marshmallows and serve.\n",
        "picture_link": "OA.wLdb9OwSRZhRM9zWeVwlUs75nj1m"
    },
    {
        "title": "Mexican Corn Salad",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "2 cups whole corn kernels, cooked ADVERTISEMENT",
            "1 red bell pepper, diced ADVERTISEMENT",
            "1 cup chopped zucchini ADVERTISEMENT",
            "2 green onions, chopped ADVERTISEMENT",
            "1 jalapeno pepper, seeded and minced ADVERTISEMENT",
            "1/2 cup salsa ADVERTISEMENT",
            "2 tablespoons chopped fresh cilantro ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a heavy large skillet, melt the butter over medium-high heat. Add the corn, bell pepper, zucchini, green onions and jalapeno pepper. Saute until vegetables are tender, about 6 minutes. Remove from heat and refrigerate vegetables until chilled.\nAdd salsa and chopped cilantro to vegetable mixture. Stir and season with salt and pepper to taste.\n",
        "picture_link": "3AjVofCr6pFKltEmRsv09r./VcTmWXG"
    },
    {
        "title": "Cheesy Corn",
        "ingredients": [
            "1 (16 ounce) package frozen corn kernels ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "1 teaspoon chopped garlic ADVERTISEMENT",
            "1/2 teaspoon Creole-style seasoning ADVERTISEMENT",
            "4 tablespoons butter ADVERTISEMENT",
            "1/3 cup diced onion ADVERTISEMENT",
            "1 (8 ounce) package cream cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan over medium heat, combine the corn, parsley, garlic, Creole seasoning. Add enough water to cover, bring to a boil and cook until tender. Drain and set aside.\nIn a large skillet over medium heat, add the butter and onion; saute until onion softens. Add corn and cream cheese. Cook over low heat for 10 minutes. Remove from heat, chill completely and serve cold.\n",
        "picture_link": "QU.KuLVoKUTMcrmvjqciH7rV1h8zNsK"
    },
    {
        "title": "Oven Baked Herb Chicken",
        "ingredients": [
            "6 skinless, boneless chicken breasts ADVERTISEMENT",
            "1 (1 ounce) package cheese and garlic dry salad dressing mix ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nPlace chicken in a lightly greased 9x13 inch baking dish. In a small bowl, combine the dry salad dressing mix, flour, salt, butter or margarine and lemon juice. Mix together, then brush mixture evenly over the top of the chicken breasts. Bake in the preheated oven for 60 minutes or until tender.\n",
        "picture_link": "7ffpJtBn5Vh/oIxDorJ02xkQm4yhmy2"
    },
    {
        "title": "Beef Stew I",
        "ingredients": [
            "2 tablespoons olive oil ADVERTISEMENT",
            "2 pounds cubed beef stew meat ADVERTISEMENT",
            "2 tablespoons all-purpose flour ADVERTISEMENT",
            "6 cups water ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "4 cups cubed potatoes ADVERTISEMENT",
            "2 cups chopped carrots ADVERTISEMENT",
            "1/2 teaspoon browning sauce ADVERTISEMENT",
            "2 teaspoons dried rosemary ADVERTISEMENT",
            "1 cup fresh corn kernels ADVERTISEMENT",
            "1 cup fresh green beans, cut into 1 inch pieces ADVERTISEMENT",
            "1/4 cup instant rice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in large pot. Add beef and flour, stirring to coat beef; brown.\nAdd water, salt, and pepper. Heat to boiling; reduce heat, and simmer 1 hour.\nStir in potatoes, carrots (or turnips), browning sauce, and rosemary. Simmer 1-2 hours.\nAdd corn, green beans, and rice; simmer for 30 minutes longer.\n",
        "picture_link": "TXzeL4mpvT.aazVo0eJoy8eFm2e53X2"
    },
    {
        "title": "Aunt Shirley's Dietetic Pie",
        "ingredients": [
            "2 (9 inch) pie shell ADVERTISEMENT",
            "3/4 cup water ADVERTISEMENT",
            "1 tablespoon cornstarch ADVERTISEMENT",
            "1/4 cup cold water ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "20 packets aspartame sweetener ADVERTISEMENT",
            "4 apples - peeled, cored and diced ADVERTISEMENT",
            "1 teaspoon ground cinnamon (optional) ADVERTISEMENT",
            "1/4 teaspoon ground nutmeg (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nBring 3/4 cup water to a boil. In a small bowl, whisk together cornstarch and 1/4 cup cold water. Whisk this mixture into the boiling water. Reduce heat and stir until mixture is thickened, about 2 minutes. Remove from heat.\nStir butter or margarine and aspartame into cornstarch mixture. Add cinnamon and nutmeg if desired. Mix well. Place fruit in a large bowl and pour aspartame mixture over fruit. Toss until fruit is thoroughly coated.\nPour fruit into pastry lined pie pan. Cover with second pastry shell. Seal edges and cut steam vents in top.\nBake in preheated oven for 45 minutes, until crust is golden brown.\n",
        "picture_link": "jpXhv.yW1Z.rFx.e6h5skDM7RaJh6im"
    },
    {
        "title": "Shrimp Fra Diavolo",
        "ingredients": [
            "1 (16 ounce) package linguini pasta ADVERTISEMENT",
            "1 pound cooked and peeled shrimp ADVERTISEMENT",
            "8 cloves crushed garlic ADVERTISEMENT",
            "2 (14.5 ounce) cans diced tomatoes ADVERTISEMENT",
            "1 (28 ounce) can crushed tomatoes with garlic ADVERTISEMENT",
            "2 teaspoons crushed red pepper flakes ADVERTISEMENT",
            "2 fluid ounces red wine (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Peel and cook shrimp if necessary, and place in a bowl of cold water.\nPlace tomatoes, crushed garlic, red pepper flakes, and wine in a 3 quart sauce pan. Simmer over low heat for 30 minutes, stirring occasionally.\nWhile sauce is simmering, cook linguini according to package directions. When pasta is almost done, drain shrimp and place in the bottom of a large colander. Drain the pasta over the shrimp. Transfer pasta with shrimp to a large serving bowl, and toss together with some sauce. Serve remaining sauce on the side.\n",
        "picture_link": "AH1qdzdbo/1s84rGe7C64ZBAOVmOBPO"
    },
    {
        "title": "Rainbow Roasted Pepper Soup",
        "ingredients": [
            "1 green bell pepper ADVERTISEMENT",
            "1 large red bell pepper ADVERTISEMENT",
            "1 large orange bell pepper ADVERTISEMENT",
            "1 yellow bell pepper ADVERTISEMENT",
            "8 cloves garlic ADVERTISEMENT",
            "1/2 lemon ADVERTISEMENT",
            "3 cups vegetable broth ADVERTISEMENT",
            "1/4 teaspoon garlic salt ADVERTISEMENT",
            "ground black pepper to taste ADVERTISEMENT",
            "1 teaspoon fennel seed ADVERTISEMENT",
            "1/4 teaspoon dried thyme ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C) , halve all peppers (remove seeds) and peel garlic.\nPlace halved peppers, cut side up in shallow baking dish. Place one garlic clove in each half and squeeze lemon juice generously over peppers. Roast for 1 hour.\nMeanwhile pour vegetable broth into a 2 quart sauce pan and add fennel seeds. Bring to boil, cover and simmer.\nWhen peppers are done, remove from oven and set aside to cool. When cool enough to touch peel skin from peppers.\nStrain fennel seeds from broth and return to a boil. Add thyme and simmer 15 minutes, reducing amount of broth.\nSlice a 1 inch section from each color of pepper and cut into pieces. Set aside for later garnishing.\nIn a blender, place remaining peppers, garlic and a 1/2 cup broth on blend just long enough to shred the peppers, but not puree them. You want to see the different colors. Pour the blended peppers into the broth and stir well. Add garlic salt and black pepper to taste, then add garnishing pepper pieces and enjoy. Do not boil or cook any longer as the colors will fade.\n",
        "picture_link": "MQmVQkb9Fd45JrCp8rSD.nG.jz4Ydlq"
    },
    {
        "title": "Boston Brown Bread I",
        "ingredients": [
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 cups whole wheat flour ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "1 cup molasses ADVERTISEMENT",
            "1 1/2 cups buttermilk ADVERTISEMENT",
            "2/3 cup raisins ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Grease a 9x5 inch loaf pan.\nIn a large bowl, stir together all-purpose flour, whole wheat flour, baking soda and salt. Mix in molasses and buttermilk. Stir in raisins or currants. Pour batter into prepared loaf pan.\nBake for 1 hour in the preheated oven, or until a tester inserted into the center of the loaf comes out clean.\n",
        "picture_link": "P/.fZmQwQ0Kgi7uWhM3gwDfJ3PiZaAq"
    },
    {
        "title": "Strawberry Whip",
        "ingredients": [
            "2 (6 ounce) packages strawberry flavored Jell-O® ADVERTISEMENT",
            "4 cups water ADVERTISEMENT",
            "1 cup frozen strawberries, thawed ADVERTISEMENT",
            "1 (8 ounce) container frozen whipped topping, thawed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Combine gelatin with 2 cups boiling water; mix well. When dissolved, add 2 cups cold water, mix and refrigerate.\nBefore gelatin is completely firm, stir in strawberries and thawed whipped topping. Refrigerate until completely chilled.\n",
        "picture_link": "jnq.Ldw96RDQkKo0eQ9qKEJsY2kJlvW"
    },
    {
        "title": "Clam Chowder II",
        "ingredients": [
            "1/2 cup margarine ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "3 (19 ounce) cans New England clam chowder ADVERTISEMENT",
            "4 (6.5 ounce) cans minced clams ADVERTISEMENT",
            "5 (10.75 ounce) cans condensed cream of potato soup ADVERTISEMENT",
            "4 pints half-and-half cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 200 Degrees F (105 Degrees C).\nSaute the onion in butter. Combine the clam chowder, minced clams, cream of potato soup and half and half in a large roasting pan. Bake for 4 hours.\n",
        "picture_link": "PzP6S/tVd3gp.tK9L.Mn3XikyHhoO86"
    },
    {
        "title": "KJ's Mushroom Chicken",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "8 skinless, boneless chicken breasts ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/4 cup all-purpose flour ADVERTISEMENT",
            "2 1/2 cups chicken broth ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "1 pound fresh mushrooms, sliced ADVERTISEMENT",
            "1 (14 ounce) can artichoke hearts in water ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In large skillet melt butter or margarine. Season chicken with salt and pepper to taste. Add chicken to skillet and brown on both sides. Remove from platter and keep warm in oven.\nReduce heat under skillet to medium low. Add flour to pan drippings, stirring constantly for 2 minutes to form a roux that is golden brown. Stir in broth gradually; continue to stir until thickened. Stir in the lemon juice, mushrooms, artichoke hearts with liquid, and Worcestershire sauce. Let simmer for several minutes. Return chicken to skillet. Cover and simmer for another 20 minutes, spooning the sauce over the chicken occasionally.\n",
        "picture_link": "0t/nyKSIo4Gn6YvCljQ1Cfp1TFhboTq"
    },
    {
        "title": "Lemon Pepper Peas",
        "ingredients": [
            "1 (10 ounce) package frozen green peas, thawed ADVERTISEMENT",
            "1 tablespoon water ADVERTISEMENT",
            "2 tablespoons butter or margarine ADVERTISEMENT",
            "1 pinch lemon pepper ADVERTISEMENT",
            "1 pinch dried dill weed ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the peas and water into a microwave-safe bowl. Cover loosely, and microwave for 3 to 4 minutes, or until peas are tender. Stir in butter, and sprinkle with lemon pepper and dill. Serve warm.\n",
        "picture_link": "AlGNJNyixY3sv/C77499fQjczx7AgjK"
    },
    {
        "title": "Willy's Juicy Steak",
        "ingredients": [
            "2 cups orange juice ADVERTISEMENT",
            "1 cup thousand island salad dressing ADVERTISEMENT",
            "1 cup Worcestershire sauce ADVERTISEMENT",
            "2 tablespoons vinegar-based hot pepper sauce ADVERTISEMENT",
            "2 tablespoons minced fresh garlic ADVERTISEMENT",
            "4 (1/2 pound) 1 1/2 inch thick rib-eye steaks ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large resealable plastic bag, combine the orange juice, salad dressing, Worcestershire sauce, hot pepper sauce, and garlic. Squeeze the bag to mix well. You should have a nice brown marinade. Place steaks into the bag with the marinade, and seal. Refrigerate for 2 to 5 hours, turning over occasionally.\nPreheat an outdoor grill for high heat. When the grill is hot, lightly oil the grate.\nPlace steaks onto the grill and season the tops with salt and pepper to taste. Baste with marinade. Cook for about 5 to 7 minutes, then flip over and salt, pepper and baste again. Grill for about 7 or 8 more minutes, or to desired doneness. Do not flip the steaks again. The internal temperature should be at least 145 degrees F (63 degrees C). Let steaks stand for 5 minutes before cutting, to prevent juices from running out.\nHeat the remaining marinade to a boil in a small saucepan. Use as steak sauce.\n",
        "picture_link": "QctsNEsxHgfu1CWBpj9rCyRQeay3zwm"
    },
    {
        "title": "Pasta with Tuna, Sun-Dried Tomatoes, Artichoke Hearts, Lemon, and White Wine",
        "ingredients": [
            "1 (16 ounce) package linguine pasta ADVERTISEMENT",
            "1/4 cup olive oil, divided ADVERTISEMENT",
            "1/2 cup diced onion ADVERTISEMENT",
            "2 tablespoons chopped fresh thyme ADVERTISEMENT",
            "1 1/2 pounds fresh tuna steaks, cubed ADVERTISEMENT",
            "1/2 cup dry white wine ADVERTISEMENT",
            "2 cups chicken stock ADVERTISEMENT",
            "1/4 cup fresh lemon juice ADVERTISEMENT",
            "1 tablespoon lemon zest ADVERTISEMENT",
            "1/2 cup chopped oil-packed sun-dried tomatoes ADVERTISEMENT",
            "3/4 cup sliced marinated artichoke hearts ADVERTISEMENT",
            "salt and freshly ground black pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add linguine pasta, cook for 8 to 10 minutes, until al dente, and drain.\nHeat 2 tablespoons olive oil in a large saucepan over medium-high heat, and cook the onion 4 minutes, until tender. Mix in the thyme, and continue cooking 2 minutes, until onion is golden brown. Set aside onion and thyme. Place the tuna in the saucepan, and cook 2 to 3 minutes, until browned. Set aside, and keep warm.\nHeat the remaining oil in the saucepan. Return the onion and thyme to saucepan, and stir in the white wine. Cook until reduced by about 1 tablespoon. Mix in the chicken stock, lemon juice, and lemon zest. Reduce heat to medium, and continue cooking 10 minutes, until reduced to about 3/4 cup.\nMix the sun-dried tomatoes and artichoke hearts into the saucepan, and cook just until heated through. Return tuna to the saucepan, and cook to desired doneness. Toss the cooked pasta into the saucepan. Season with salt and pepper.\n",
        "picture_link": "rPKNndmmzQHpMJCFuabLuzGGuYKt6dO"
    },
    {
        "title": "Texas Pralines",
        "ingredients": [
            "nonstick cooking spray ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 cups light corn syrup ADVERTISEMENT",
            "1 pound butter ADVERTISEMENT",
            "2 cups heavy cream ADVERTISEMENT",
            "2 teaspoons vanilla extract ADVERTISEMENT",
            "8 cups pecans ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Line 2 baking sheets with aluminum foil. Coat with nonstick cooking spray.\nIn a large saucepan over medium heat, combine sugar and corn syrup. Heat to 250 degrees F (120 degrees C). Remove from heat, and stir in butter until melted. Gradually stir in cream. Return to heat. Cook, stirring constantly, until temperature reaches 242 degrees F (116 degrees C). Remove from heat, and stir in vanilla and pecans.\nDrop by spoonful onto prepared pans. Cool completely, then wrap with plastic.\n",
        "picture_link": "oCVWT7JD3SQNlWSDDCDHS2jpdp/FBqO"
    },
    {
        "title": "Chuck and Potato Bake",
        "ingredients": [
            "3 1/2 pounds boneless beef chuck roast ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup ADVERTISEMENT",
            "1 (10.75 ounce) can condensed cream of mushroom soup with roasted garlic ADVERTISEMENT",
            "3 tablespoons chopped fresh chives ADVERTISEMENT",
            "6 potatoes, quartered ADVERTISEMENT",
            "1 pound carrots, peeled and cut into chunks ADVERTISEMENT",
            "1 pound fresh mushrooms, quartered ADVERTISEMENT",
            "1/2 cup shredded Cheddar cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Place chuck roast in a 9x13 inch baking dish with high sides. Roast for 1 hour in preheated oven. Spoon off any fat that has accumulated.\nCombine the 2 cans of mushroom soup and the chives in a large bowl. Remove roast from oven, and scatter the potatoes, carrots, and mushrooms around the roast. Pour the soup mixture over the meat and vegetables. Cover with aluminum foil.\nReturn the baking dish to the oven to roast for 2 additional hours. Uncover, and sprinkle with the grated Cheddar cheese. Return to the oven until the cheese melts, about 5 minutes.\n",
        "picture_link": "Lug0D/vH6o56Sy6MN.Fp8fp9dRIjwn2"
    },
    {
        "title": "Baked Creamed Corn II",
        "ingredients": [
            "1/2 cup butter ADVERTISEMENT",
            "1 (8 ounce) package whipped cream cheese ADVERTISEMENT",
            "1 cube chicken bouillon ADVERTISEMENT",
            "1 (10 ounce) package frozen corn kernels, thawed ADVERTISEMENT",
            "1/4 teaspoon white pepper ADVERTISEMENT",
            "1/8 teaspoon ground nutmeg ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1/2 cup heavy cream ADVERTISEMENT",
            "1/2 cup shredded mozzarella cheese ADVERTISEMENT",
            "1/2 cup crushed buttery round crackers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease an 8x8 inch casserole dish.\nIn a saucepan over medium heat, melt the butter and cream cheese, and dissolve the chicken bouillon. Mix in the corn. Season with pepper, nutmeg, and salt. Stir in the cream. Transfer the mixture to the prepared casserole dish. Sprinkle with cheese, and top with crackers.\nBake 20 minutes in the preheated oven, or until lightly browned.\n",
        "picture_link": "YYUKl9XyBr/U/eEpNMsmL2XS6AJThPC"
    },
    {
        "title": "Grilled Swordfish",
        "ingredients": [
            "4 (8 ounce) swordfish steaks ADVERTISEMENT",
            "1/2 cup teriyaki sauce ADVERTISEMENT",
            "2 tablespoons margarine, softened ADVERTISEMENT",
            "1 teaspoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat outdoor grill for medium heat.\nMarinate swordfish in teriyaki sauce for 5 minutes per side.\nLightly oil grill grate. Grill steaks, basting frequently with melted margarine, for 5 to 6 minutes per side, or until fish flakes easily with a fork. Season with garlic powder, and serve.\n",
        "picture_link": "UxBSQpBWVxS5UfLD0.oPdNwInKIyQHW"
    },
    {
        "title": "Split Pea Soup with Tofu",
        "ingredients": [
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 white onion, finely chopped ADVERTISEMENT",
            "3 cloves garlic, pressed ADVERTISEMENT",
            "4 small red potatoes, diced ADVERTISEMENT",
            "1 cup peeled, diced carrots ADVERTISEMENT",
            "1 pound dry green split peas ADVERTISEMENT",
            "4 cups vegetable broth ADVERTISEMENT",
            "1 (16 ounce) package soft tofu ADVERTISEMENT",
            "1 (6 ounce) bag fresh spinach, finely chopped ADVERTISEMENT",
            "1 tablespoon dried basil ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat the olive oil in a skillet over medium heat, and saute the onion and garlic until tender.\nIn a large pot, mix the onion mixture, potatoes, carrots, and split peas. Pour in the vegetable broth. Bring to a boil, reduce heat to low, and simmer 1 hour.\nIn a blender or food processor, blend the tofu and spinach until creamy, and mix into the pot. Season with basil, salt, and pepper. Continue cooking 1 hour. If the soup becomes too thick, add water. Serve hot and enjoy.\n",
        "picture_link": "6AIixL9/v5ttdi4Vzt87ibUL9uskVL2"
    },
    {
        "title": "Berry Bread Pudding with Brown Sugar Sauce",
        "ingredients": [
            "3 tablespoons butter ADVERTISEMENT",
            "1 1/2 (1 pound) loaves stale French bread, sliced ADVERTISEMENT",
            "4 eggs ADVERTISEMENT",
            "6 cups whole milk ADVERTISEMENT",
            "2 cups white sugar ADVERTISEMENT",
            "2 1/2 tablespoons vanilla extract ADVERTISEMENT",
            "2 1/2 teaspoons ground cinnamon ADVERTISEMENT",
            "1 cup chopped strawberries ADVERTISEMENT",
            "1 cup blackberries ADVERTISEMENT",
            "1/2 cup unsalted butter ADVERTISEMENT",
            "1 cup packed brown sugar ADVERTISEMENT",
            "1/3 cup water ADVERTISEMENT",
            "1/4 teaspoon pumpkin pie spice ADVERTISEMENT",
            "1/8 teaspoon salt ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Generously butter a 9x13 inch baking dish. Arrange the bread slices in the dish so they are packed in a little bit tight. In a medium bowl, whisk together the 4 eggs, milk, white sugar, vanilla, and cinnamon. Pour the liquid over the bread, and let it sit for an hour in the refrigerator. Press down the top with a spatula occasionally to help the bread absorb the liquid. After about 30 minutes, sprinkle the berries over the pudding, and press them down inside a bit to distribute.\nPreheat the oven to 350 degrees F (175 degrees C). Bake the bread pudding for 45 to 50 minutes in the preheated oven, or until the top is golden, and the middle is firm. While the pudding is baking, make the brown sugar sauce.\nMelt the unsalted butter in a saucepan over medium heat. Stir in the brown sugar, water, pumpkin pie spice, and salt. Cook, stirring constantly for about 2 minutes. Remove from heat, and whisk in the egg. Return to the burner, and cook stirring constantly until thickened, about 1 minute. Serve hot over the hot bread pudding.\n",
        "picture_link": "9LHGR1XWwGREZccxTelqllu1GiHpfX2"
    },
    {
        "title": "Frozen Summer Slush",
        "ingredients": [
            "2 cups white sugar ADVERTISEMENT",
            "7 cups water ADVERTISEMENT",
            "4 tea bags ADVERTISEMENT",
            "2 cups boiling water ADVERTISEMENT",
            "1 (12 fluid ounce) can frozen lemonade concentrate ADVERTISEMENT",
            "1 (12 fluid ounce) can frozen orange juice concentrate ADVERTISEMENT",
            "2 cups gin ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Put 7 cups water in large saucepan, and heat on high until boiling. Add sugar and stir until dissolved; set aside to cool. Place tea bags in 2 cups boiling water, and let steep until desired strength is acquired.\nIn a large bowl, mix together sugar water, tea, lemonade concentrate and orange juice concentrate. Stir in gin. Place in freezer container and freeze overnight.\nTo serve, Place several scoops into a tall glass, and fill with any clear carbonated beverage.\n",
        "picture_link": "Y3VfQTWYCykct62O6ln8c6OtXDOU2Gi"
    },
    {
        "title": "Flip Flop Grilled Chicken",
        "ingredients": [
            "3/4 cup butter ADVERTISEMENT",
            "2 (12 fluid ounce) cans or bottles beer ADVERTISEMENT",
            "1 tablespoon steak seasoning ADVERTISEMENT",
            "1 1/2 teaspoons seasoning salt ADVERTISEMENT",
            "1 dash black pepper ADVERTISEMENT",
            "8 boneless, skinless chicken breast halves ADVERTISEMENT",
            "3 medium green bell peppers, thinly sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for high heat.\nMelt the butter in a saucepan over medium heat. Mix in the beer, steak seasoning, seasoning salt, and black pepper. Coat the chicken with this mixture.\nLightly oil the grill grate. Arrange chicken breasts on the grill. Cook for about 20 minutes, brushing frequently with the beer mixture during the last 10 minutes, until chicken is no longer pink and juices run clear. Discard any remaining beer mixture. Top chicken with green bell pepper slices to serve.\n",
        "picture_link": "L.B3hIRMkgjqXjSgyllh3Zrbaud6MW2"
    },
    {
        "title": "Smoked Turkey",
        "ingredients": [
            "1 (12 pound) whole turkey, neck and giblets removed ADVERTISEMENT",
            "1 (20 pound) bag high quality charcoal briquettes ADVERTISEMENT",
            "hickory chips or chunks ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the charcoal into the bottom pan of the smoker. Light the coals and wait for the temperature of the smoker to come to 240 degrees F (115 degrees C). Lightly oil grate.\nRinse turkey under cold water, and pat dry. Place hickory chips into a pan with water to cover.\nPlace turkey onto the prepared grate. Add 2 handfuls damp chips at start of cooking, then a handful every couple of hours during the cooking process. Leave the lid on - DO NOT keep looking at the turkey, or you will let the heat out! Continue smoking until the internal temperature of the turkey reaches 165 degrees F (74 degrees C), or keep going until the coals die out.\n",
        "picture_link": "mpzyuuxDPGkgD4h6um/GKCaRGKCPf5C"
    },
    {
        "title": "Iced Tea III",
        "ingredients": [
            "6 black tea bags ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "1 gallon boiling water ADVERTISEMENT",
            "1 (6 ounce) can frozen lemonade concentrate ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the tea bags and sugar into a 1 gallon glass jar. Fill with boiling water. Let steep for 2 hours at room temperature. Remove and discard tea bags. Stir in lemonade concentrate. Refrigerate until cool.\n",
        "picture_link": "Nz6sn.uV4AaQJ9Ne5yDvHNOXy8Y8iXS"
    },
    {
        "title": "Whole Wheat Seed Bread",
        "ingredients": [
            "1/2 cup warm water ADVERTISEMENT",
            "1/3 cup unsweetened applesauce ADVERTISEMENT",
            "3 tablespoons active dry yeast ADVERTISEMENT",
            "3 1/2 cups warm water ADVERTISEMENT",
            "1/2 cup honey ADVERTISEMENT",
            "1/2 cup molasses ADVERTISEMENT",
            "1/2 cup vegetable oil ADVERTISEMENT",
            "3 tablespoons lemon juice ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "9 cups sifted whole wheat flour ADVERTISEMENT",
            "1/2 cup ground flax seed ADVERTISEMENT",
            "1 cup quick cooking oats ADVERTISEMENT",
            "1/2 cup sunflower seeds ADVERTISEMENT",
            "3/4 cup cracked wheat ADVERTISEMENT",
            "1 tablespoon sea salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Stir together the 1/2 cup water and applesauce in a small bowl. Dissolve the yeast in the mixture, let stand until creamy, about 5 minutes. Pour the yeast mixture into a large bowl with 3 1/2 cups of warm water, honey, molasses, vegetable oil, lemon juice, and eggs; stir together to combine well.\nIn a separate bowl, combine the whole wheat flour, flax seed, sunflower seeds, cracked wheat, and salt. Stir the flour mixture into the yeast mixture until a smooth dough forms. Knead on a lightly floured surface until smooth and elastic, about 10 minutes. Place in a lightly oiled bowl and cover; let rise in a warm place until doubled in volume, about 1 hour.\nLightly grease four 9x5 inch loaf pans. Punch down dough, shape into loaves, and place in the pans. Allow to rise in pans until doubled in bulk, about 1 hour.\nPreheat oven to 375 degrees F (190 degrees C).\nBake 40 to 50 minutes, or until the loaves sound hollow when removed from the pan and tapped on the bottom.\n",
        "picture_link": "mfhBSmeBa3k.pHP4wjGLz2Qzmmn7Of."
    },
    {
        "title": "Classic Cherries Jubilee",
        "ingredients": [
            "1/2 cup white sugar ADVERTISEMENT",
            "2 tablespoons cornstarch ADVERTISEMENT",
            "1/4 cup cold water ADVERTISEMENT",
            "1/4 cup orange juice ADVERTISEMENT",
            "1 pound Bing or other dark, sweet cherries, rinsed and pitted (or use frozen pitted cherries) ADVERTISEMENT",
            "1/2 teaspoon finely grated orange zest ADVERTISEMENT",
            "1/4 teaspoon cherry extract ADVERTISEMENT",
            "1/4 cup brandy ADVERTISEMENT",
            "3 cups vanilla bean ice cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Whisk together the sugar and cornstarch in a wide saucepan. Stir in the water and orange juice; bring to a boil over medium-high heat, whisking until thickened. Stir in the cherries and orange zest, return to a boil, then reduce heat, and simmer for 10 minutes. While the cherries are cooking, spoon the ice cream into serving bowls.\nRemove the cherries from the heat, and stir in the cherry extract. Pour in the brandy, and ignite with a long lighter. Gently shake the pan until the blue flame has extinguished itself. Spoon the cherries over the bowls of ice cream.\n",
        "picture_link": "TjeIg1TBiwd.KfRYAsml6zOMr4EIhHO"
    },
    {
        "title": "Southwestern Caesar Salad",
        "ingredients": [
            "4 skinless, boneless chicken breast halves ADVERTISEMENT",
            "1 (1.27 ounce) packet dry fajita seasoning ADVERTISEMENT",
            "1 cup mayonnaise ADVERTISEMENT",
            "2/3 cup grated Parmesan cheese ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "2 anchovy fillets ADVERTISEMENT",
            "4 green onions, chopped ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "1 tablespoon Dijon mustard ADVERTISEMENT",
            "1 canned chipotle pepper ADVERTISEMENT",
            "1 1/2 teaspoons minced garlic ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "8 cups romaine lettuce, torn into bite-size pieces ADVERTISEMENT",
            "1/2 cup garlic flavored croutons ADVERTISEMENT",
            "1/4 cup shredded Parmesan cheese ADVERTISEMENT",
            "1 red bell pepper, sliced into thin rings ADVERTISEMENT",
            "1 yellow bell pepper, sliced into thin rings ADVERTISEMENT",
            "1 orange bell pepper, sliced into thin rings ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat an outdoor grill for high heat and lightly oil grate.\nSprinkle chicken breasts with fajita seasoning, and grill for about 4 minutes on each side, or until no longer pink and juices run clear. Allow to cool, then slice into bite-size strips.\nIn a blender or food processor, combine mayonnaise, grated Parmesan cheese, sour cream, anchovies, green onions, parsley, Dijon mustard, chipotle pepper, garlic, and Worcestershire sauce. Blend until smooth.\nPlace romaine lettuce in a large bowl, and top with croutons, shredded Parmesan, and red, yellow, and orange pepper rings. Arrange chicken on top, then pour on the dressing.\n",
        "picture_link": "Q7ML7QwjYLPsyq07unszNu8asmxd3zq"
    },
    {
        "title": "Mango-Pineapple Smoothie",
        "ingredients": [
            "1 cup vanilla yogurt ADVERTISEMENT",
            "1 cup unsweetened pineapple juice ADVERTISEMENT",
            "1/2 banana, sliced ADVERTISEMENT",
            "1 mango - peeled, seeded, and chopped ADVERTISEMENT",
            "1/2 cup nonfat milk ADVERTISEMENT",
            "2 tablespoons cream of coconut ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender, blend the vanilla yogurt, pineapple juice, banana, mango, milk, and cream of coconut until smooth.\n",
        "picture_link": "yKy6AKt7vjkoh0fzYacjk64mQ/33aD2"
    },
    {
        "title": "Orange Chocolate Muffins",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "4 (1 ounce) squares semisweet chocolate, grated ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "6 tablespoons margarine, softened ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1 tablespoon orange zest ADVERTISEMENT",
            "1/4 cup orange juice ADVERTISEMENT",
            "1/2 cup buttermilk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Lightly grease a 12 cup muffin pan, or line with paper liners.\nIn a medium bowl, mix flour, semisweet chocolate, baking powder, baking soda, and salt.\nIn a separate medium bowl, cream together margarine and sugar until smooth. Beat in the eggs one at a time then stir in the orange zest, orange juice, and buttermilk. Pour into the flour mixture, and mix just until evenly moist. Spoon batter into muffin cups.\nBake for 15 to 20 minutes in the preheated oven, or until a toothpick inserted into the center of a muffin comes out clean. Let muffins cool in the pan on a wire rack for at least 10 minutes before removing from the pan.\n",
        "picture_link": "2Y7aiRtXJIBDH5pojNkBXvcCPtW4FLy"
    },
    {
        "title": "Chestnut Stuffing",
        "ingredients": [
            "2 cups chestnuts ADVERTISEMENT",
            "1 1/2 cups margarine ADVERTISEMENT",
            "1/2 cup chopped onion ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/4 teaspoon pepper ADVERTISEMENT",
            "2 teaspoons poultry seasoning ADVERTISEMENT",
            "2 (1 pound) loaves day-old bread, cubed ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "With a sharp knife, cut slits in the surface of the chestnuts. Place chestnuts in a medium saucepan with enough water to cover, and bring to a boil. Cook 25 minutes, or until tender. Drain, peel, and chop.\nPreheat oven to 350 degrees F (175 degrees C).\nMelt margarine in a medium saucepan over medium heat. Stir in chestnuts, onion, salt, pepper, and poultry seasoning, and cook until onions are tender, about 3 minutes. Transfer to a medium baking dish, and mix with the cubed bread.\nIn a small bowl, beat together eggs and milk, and drizzle over the cubed bread mixture.\nBake 30 to 45 minutes in the preheated oven, until surface is crisp and lightly browned.\n",
        "picture_link": "XNLJwE2JIk0rucOJf/pq8LBZUQ90Wk6"
    },
    {
        "title": "Czech Stuffed Green Peppers",
        "ingredients": [
            "8 green bell peppers ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "2 pounds lean ground beef ADVERTISEMENT",
            "1 cup cooked rice ADVERTISEMENT",
            "1 eggs ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "2 large onions, chopped ADVERTISEMENT",
            "2 (28 ounce) cans whole peeled tomatoes ADVERTISEMENT",
            "3 whole peppercorns ADVERTISEMENT",
            "3 whole allspice berries ADVERTISEMENT",
            "1/2 teaspoon ground allspice ADVERTISEMENT",
            "1 teaspoon dried oregano ADVERTISEMENT",
            "1 teaspoon dried marjoram ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Cut tops off of peppers, and remove seeds and membranes from inside.\nIn a skillet over medium heat, saute 1 chopped onion until tender. In a large bowl, combine ground beef, sauteed onion, cooked rice and eggs. Season with parsley, salt and pepper. Mix well, and stuff into peppers. Place in a large roasting pan.\nHeat oil in a large saucepan over medium heat, Saute 2 chopped onions until soft and translucent. Stir in tomatoes. Season with peppercorns, allspice berries, ground allspice, oregano, marjoram, salt and pepper. Cook on medium heat for 15 to 20 minutes. Pour over peppers in roasting pan.\nCover, and bake in preheated oven for 1 1/2 hours. Remove peppers, and transfer sauce to a blender, or use a hand blender. Puree sauce until smooth. Pour sauce back into pan, and reheat. Whisk in sour cream just before serving.\n",
        "picture_link": "vuoD9KagJaOfD6b3usmaZ3WMTEC54xG"
    },
    {
        "title": "Pasta with Chicken Mushroom Cream Sauce",
        "ingredients": [
            "1 (16 ounce) package farfalle (bow tie) pasta ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "4 boneless, skinless chicken breast halves ADVERTISEMENT",
            "1/2 cup onion, diced ADVERTISEMENT",
            "12 shiitake mushrooms ADVERTISEMENT",
            "1 cup heavy cream ADVERTISEMENT",
            "salt to taste ADVERTISEMENT",
            "1 tablespoon coarsely ground black pepper ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nMelt butter in a large skillet over medium heat. Cook chicken until no longer pink, and juices run clear. Transfer chicken to a cutting board, and thinly slice; set aside. Saute onion until tender and translucent. Add mushrooms, and gradually stir in cream. Cook, stirring constantly, for 7 to 10 minutes, or until sauce is thickened. Stir in chicken, and season with salt and pepper. Cook 5 minutes, or until heated through. Toss with cooked pasta until evenly coated.\n",
        "picture_link": "VXZ6nAPnVbssVt66jqdGzUbaXtRrzVW"
    },
    {
        "title": "Pesto Pasta with Green Beans and Potatoes",
        "ingredients": [
            "1/2 pound dry penne pasta ADVERTISEMENT",
            "4 red potatoes, cut into 1/4 inch slices ADVERTISEMENT",
            "1/4 pound fresh green beans, cut into 2 inch pieces ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/2 cup plain yogurt ADVERTISEMENT",
            "1/3 cup pesto ADVERTISEMENT",
            "1/4 cup grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil, and cook the penne pasta for 8 to 10 minutes, until al dente. Remove from heat, drain, and return to the pot.\nBring a medium saucepan of water to a boil, and cook the potatoes about 7 minutes. Place the green beans in the saucepan with the potatoes. Continue cooking about 3 minutes. Drain the partially cooked potatoes and green beans, and set aside.\nHeat the olive oil in a large skillet over medium heat, and saute the garlic about 1 minute. Stir in the potatoes and green beans. Season with salt and pepper. Cook and stir until potatoes and beans are tender and lightly browned.\nToss the potato mixture into the pot with the drained pasta. Mix in the yogurt, pesto, and Parmesan cheese. Reserve a little Parmesan to sprinkle on top when serving.\n",
        "picture_link": "ibNAYNlxCVGM/LvAgAYpOmI0pTD6996"
    },
    {
        "title": "Kerry's French Toast",
        "ingredients": [
            "1 cup softened cream cheese ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1/4 teaspoon ground allspice ADVERTISEMENT",
            "1/2 teaspoon ground nutmeg ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "8 (1/2 inch) slices egg bread ADVERTISEMENT",
            "6 extra large eggs, beaten ADVERTISEMENT",
            "1/4 cup milk ADVERTISEMENT",
            "1/4 cup butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a medium bowl, blend the cream cheese with brown sugar, allspice, nutmeg and cinnamon\nSpread 4 slices bread with the cream cheese mixture, and top with remaining bread slices, creating sandwiches.\nMix eggs and milk in a shallow bowl. Dip bread into the egg and milk to coat thoroughly.\nMelt butter in a medium skillet over medium high heat. Cook coated bread slices 2 to 4 minutes on each side, or until golden brown.\n",
        "picture_link": "bld/ShMkr6ykY.ZLDNOoNOJD1uWc/6W"
    },
    {
        "title": "Crescent Pastry Puff",
        "ingredients": [
            "1/3 cup white sugar ADVERTISEMENT",
            "1 egg ADVERTISEMENT",
            "1 (8 ounce) package cream cheese, room temperature ADVERTISEMENT",
            "1/2 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 teaspoon ground cinnamon ADVERTISEMENT",
            "1/4 cup white sugar ADVERTISEMENT",
            "3 Granny Smith apples - peeled, cored and chopped ADVERTISEMENT",
            "2 (10 ounce) cans refrigerated crescent roll dough ADVERTISEMENT",
            "1 tablespoon butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Mix together the cinnamon and 1/4 cup sugar in a cup or small bowl, sprinkle about 1 tablespoon of this mixture over the apples, and set aside.\nIn a medium bowl, mix together 1/3 cup of sugar with cream cheese until smooth. Beat in the egg until light and fluffy, and then stir in vanilla. Set aside.\nUnroll the crescent roll dough, and place the pieces side by side on a large cookie sheet. Pinch seams together to form one big sheet. Place the apples lengthwise down the center. Use scissors to snip the edges into a fringe with strips about 1 inch wide. Pour the cream cheese filling over the apples, and bring the strips from the side up over the apples in an alternating fashion to cover the filling. Pinch ends closed.\nBake for 35 minutes in the preheated oven, or until golden brown. While still hot, brush the top with butter, and sprinkle the remaining cinnamon sugar over the top.\n",
        "picture_link": "SgwliwatOTMdtaXz4Nfd0fPcQ2TM/om"
    },
    {
        "title": "Pickled Asparagus",
        "ingredients": [
            "30 asparagus spears ADVERTISEMENT",
            "1/3 cup coarse salt ADVERTISEMENT",
            "2 quarts cold water ADVERTISEMENT",
            "1 2/3 cups distilled white vinegar ADVERTISEMENT",
            "2/3 cup sugar ADVERTISEMENT",
            "1 teaspoon coarse salt ADVERTISEMENT",
            "1 teaspoon mustard seed ADVERTISEMENT",
            "1 1/2 teaspoons dill seed ADVERTISEMENT",
            "1 white onion, sliced into rings ADVERTISEMENT",
            "1/2 teaspoon chili pepper flakes ADVERTISEMENT",
            "2 sprigs fresh dill ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Trim the cut end of the asparagus spears, and cut them into 3 inch lengths. Place them in a large bowl with 1/3 cup salt, and cover with water. Let stand for 2 hours. Drain and rinse under cool water, and pat dry.\nSterilize two pint size wide mouth jars in simmering water for 5 minutes.\nIn a saucepan over medium heat, combine the vinegar, sugar, 1 teaspoon of salt, mustard seed, dill seed and onion rings. Bring to a boil, and boil for one minute.\nPack the asparagus spears, tips up, in the hot jars leaving 1/2 of space from the rim. Tuck one dill sprig into each jar, and sprinkle in 1/4 teaspoon of red pepper flakes. Pour hot pickling liquid into the jars, filling to within 1/4 inch of the rim. Wipe rims with a clean damp cloth, and seal with lids. Process in a boiling water bath for 10 minutes.\nCool to room temperature. Check seals when cool by pressing the center of the lid. It should not move. Label and date; store in a cool dark place. If any jars have not sealed properly, refrigerate and eat within two weeks.\n",
        "picture_link": "ECbtaHbUunZDDZVI0JUUzaLg1JwXFke"
    },
    {
        "title": "Old Fashioned Beef Stew",
        "ingredients": [
            "2 pounds cubed beef stew meat ADVERTISEMENT",
            "4 cups boiling water ADVERTISEMENT",
            "1 tablespoon lemon juice ADVERTISEMENT",
            "1 teaspoon Worcestershire sauce ADVERTISEMENT",
            "1 clove garlic, crushed ADVERTISEMENT",
            "1 onion, diced ADVERTISEMENT",
            "1 bay leaf ADVERTISEMENT",
            "1 tablespoon salt ADVERTISEMENT",
            "1 teaspoon sugar ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "1/8 teaspoon ground allspice ADVERTISEMENT",
            "6 potatoes, cubed ADVERTISEMENT",
            "2 carrots, sliced ADVERTISEMENT",
            "1/2 cup whole kernel corn ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a slow cooker, combine the stew meat, boiling water, lemon juice, Worcestershire sauce and garlic. Stir in the onion, bay leaf, salt, sugar, ground pepper, paprika and allspice. Add the potatoes, carrots and corn.\nCook on HIGH for 2 hours.\nSwitch the slow cooker to LOW and cook for another 3 1/2 hours. Remove bay leaves before serving.\n",
        "picture_link": "gOa3nFss95QT2zMD7Q38lhI4QZld3y."
    },
    {
        "title": "Ricotta Eggplant Rolls",
        "ingredients": [
            "1/2 cup vegetable oil, divided ADVERTISEMENT",
            "4 cloves garlic, minced ADVERTISEMENT",
            "1 (28 ounce) can crushed tomatoes in puree ADVERTISEMENT",
            "1 (10 ounce) can tomato sauce ADVERTISEMENT",
            "2 tablespoons Italian seasoning ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/2 teaspoon ground black pepper ADVERTISEMENT",
            "2 cups plain dried bread crumbs ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "2 eggs ADVERTISEMENT",
            "1/4 cup heavy cream ADVERTISEMENT",
            "2 large eggplants, peeled and sliced lengthwise into 1/4 inch slices ADVERTISEMENT",
            "1 (15 ounce) container ricotta cheese ADVERTISEMENT",
            "2 cups shredded mozzarella cheese ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "3/4 cup chopped fresh parsley ADVERTISEMENT",
            "fresh parsley, for garnish (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat 1 tablespoon of the olive oil in a large saucepan over medium heat. Add garlic, and cook until fragrant and lightly browned. Pour in the crushed tomatoes and tomato sauce. Season with Italian seasoning, salt, sugar, and pepper. Simmer covered over medium-low heat for 30 minutes, stirring occasionally. Remove from heat and set aside.\nPreheat the oven to 400 degrees F (200 degrees C). In a large shallow dish, stir together the bread crumbs and flour. In a separate dish, whisk together the eggs and cream with a fork.\nHeat the remaining olive oil in a large skillet over medium-high heat. Dip each eggplant slice into the egg mixture, then coat with breadcrumbs. Fry each slice until golden brown in the hot oil, turning once. Drain on paper towels.\nSpread a thin layer of the marinara sauce in the bottom of a 9x13 inch baking dish. In a large bowl, stir together the ricotta cheese, mozzarella cheese, Parmesan cheese and parsley. Spread 2 to 3 tablespoons of the cheese mixture onto one side of each slice of eggplant. Roll up, and place in the baking dish seam side down. Spoon the remaining tomato sauce over the rolls. Cover the baking dish with a lid or aluminum foil.\nBake for 30 minutes in the preheated oven. Garnish with additional chopped parsley before serving if desired.\n",
        "picture_link": "fF1sM3DGYmi/4J2pCEafdDm9OdzwbH6"
    },
    {
        "title": "Hot Chicken Sandwiches II",
        "ingredients": [
            "1 (50 ounce) can whole cooked chicken, drained, bones and skin removed ADVERTISEMENT",
            "2 (10.75 ounce) cans condensed cream of chicken soup ADVERTISEMENT",
            "1 1/8 cups water ADVERTISEMENT",
            "1 (8 ounce) package dry bread stuffing mix ADVERTISEMENT",
            "6 hamburger buns, split ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Shred chicken, and place in a large pot or slow cooker. Stir in soup and water. Stir in the seasoning mix from the stuffing, and then stir in the dry stuffing mix. Cook over medium heat until heated through. Spoon onto buns, and serve.\n",
        "picture_link": "pbUJco53RfPOzSaA6r0I7zFCPrLXE7K"
    },
    {
        "title": "Grated Potato Dumplings",
        "ingredients": [
            "4 large potatoes ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat a large pot of water to boiling.\nPeel potatoes, and keep submerged in cold water to prevent browning. Grate potatoes, by hand or with a food processor, into a large bowl. Drain any excess water. Stir in flour and salt. With a teaspoon, form a test dumpling. If it doesn't hold together, Stir in more flour.\nForm dumplings with a teaspoon, and gently drop into boiling water. Allow dumplings to float freely. Gently stir with wooden spoon so dumplings don't stick together. Reduce heat to slow boil. Boil for 40 minutes.\nDrain in colander. Rinse with hot water. Serve with gravy or melted butter.\n",
        "picture_link": "SG2GrF0DSZNYOGhr81vfmbXTtzIrwLu"
    },
    {
        "title": "Creamy Mango Sorbet",
        "ingredients": [
            "2 mangos - peeled, seeded, and cubed ADVERTISEMENT",
            "1 cup sugar ADVERTISEMENT",
            "1 cup cream ADVERTISEMENT",
            "1 cup ice ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place cubed mangos, sugar, cream, and ice into a blender; puree until smooth.\nPour mixture into a large resealable plastic freezer bag. Seal, and freeze for 45 minutes to an hour. Move the contents around in the bag every 15 minutes while freezing.\n",
        "picture_link": "MKgbSv.YAnPCTdM3TFIb5NLtoaS8RHC"
    },
    {
        "title": "Lamb Stew with Green Beans",
        "ingredients": [
            "3 tablespoons olive oil ADVERTISEMENT",
            "1 large onion, chopped ADVERTISEMENT",
            "1 stalk celery, chopped ADVERTISEMENT",
            "3 pounds boneless lamb shoulder, cut into 2 inch pieces ADVERTISEMENT",
            "1 (8 ounce) can tomato sauce ADVERTISEMENT",
            "3 cups hot water ADVERTISEMENT",
            "2 pounds fresh green beans, trimmed ADVERTISEMENT",
            "1 tablespoon chopped fresh parsley ADVERTISEMENT",
            "1/2 teaspoon dried mint ADVERTISEMENT",
            "1/2 teaspoon dried dill weed ADVERTISEMENT",
            "1 pinch ground cinnamon ADVERTISEMENT",
            "1 pinch white sugar ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Heat oil in a large pot over medium heat. Saute onion and celery until golden. Stir in lamb, and cook until evenly brown. Stir in tomato sauce and water. Reduce heat, and simmer for about 1 hour.\nStir in green beans. Season with parsley, mint, dill, cinnamon, sugar, salt and pepper. Continue cooking until beans are tender.\n",
        "picture_link": "Gvk92k2ScUr9iNgtSz0UyO4nB2T4MXO"
    },
    {
        "title": "Grilled Hot Turkey Sandwiches",
        "ingredients": [
            "4 tablespoons mayonnaise ADVERTISEMENT",
            "2 tablespoons salsa ADVERTISEMENT",
            "2 green onions, chopped ADVERTISEMENT",
            "8 slices sourdough bread ADVERTISEMENT",
            "1/2 pound deli-sliced turkey ADVERTISEMENT",
            "4 slices pepperjack cheese ADVERTISEMENT",
            "4 tablespoons butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Mix the mayonnaise, salsa, and green onions in a small bowl. Spread the seasoned mayonnaise evenly on each slice of bread. Layer the turkey and cheese on 4 of the slices. Top with remaining bread to make 4 sandwiches.\nMelt 2 tablespoons butter in a large skillet over medium heat. Fry sandwiches in butter until lightly toasted. Add remaining butter to skillet, turn sandwiches over. Cook until the cheese is melted, and the bread is browned.\n",
        "picture_link": "2lWTc.DubhovLllSsUKAn7pEsW0Iksa"
    },
    {
        "title": "Delicious Pancakes",
        "ingredients": [
            "1 cup quick cooking oats ADVERTISEMENT",
            "1/2 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup whole wheat flour ADVERTISEMENT",
            "1/4 cup packed brown sugar ADVERTISEMENT",
            "3/4 tablespoon baking powder ADVERTISEMENT",
            "1/4 cup dry non-fat milk powder ADVERTISEMENT",
            "1 1/4 teaspoons salt, divided ADVERTISEMENT",
            "1/2 tablespoon ground cinnamon ADVERTISEMENT",
            "1/8 teaspoon cream of tartar ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "2 eggs, beaten ADVERTISEMENT",
            "1 cup water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat a lightly greased griddle over medium low heat.\nIn a large bowl, mix quick cooking oats, flour, whole wheat flour, brown sugar, baking powder, dry milk powder, salt, cinnamon and cream of tartar.\nIn a small bowl, beat together vegetable oil and eggs. Pour into the oats mixture, alternating with water, and mix thoroughly, creating a batter.\nPour batter, 1/4 cup at a time, onto the prepared griddle. Cook on both sides until golden brown, flipping when the surface begins to bubble.\n",
        "picture_link": "biQ.ifIFJKy5yujrWnKjDzM5oqzr856"
    },
    {
        "title": "Rico's Passionate Pink Honey Lemonade",
        "ingredients": [
            "1 cup water ADVERTISEMENT",
            "3 fresh strawberries, sliced ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "1/2 cup brown sugar ADVERTISEMENT",
            "1 teaspoon honey ADVERTISEMENT",
            "7 cups water ADVERTISEMENT",
            "1 3/4 cups fresh lemon juice ADVERTISEMENT",
            "2 slices orange ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a saucepan, combine 1 cup water, strawberries, white sugar, brown sugar, and honey. Bring to a boil, and simmer 10 minutes, stirring occasionally. Cool to room temperature, cover, and chill.\nIn a large pitcher, mix together water, lemon juice, and orange slices. Stir in cooled syrup; chill. Serve in a tall glass over ice.\n",
        "picture_link": "OlHcwz6Qhy1Eunxnt3Qmzhlr9RbuH9m"
    },
    {
        "title": "Mexican Pinto Beans",
        "ingredients": [
            "1 pound dry pinto beans ADVERTISEMENT",
            "1/2 pound bacon ADVERTISEMENT",
            "4 serrano peppers ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Place the beans in a large pot with enough water to cover by 3 to 4 inches, and bring to a boil. Remove from heat, and let sit 1 hour. Drain water. Pour in enough fresh water to cover beans by 3 to 4 inches, and bring to a boil. Reduce heat, cover, and simmer 1 hour.\nPlace bacon in a skillet, and cook over medium high heat until evenly brown. Crumble bacon, and transfer, along with grease, to the pot with the beans. Continue to cook beans on low heat for 30 minutes.\nPlace the whole chile peppers into the pot, and continue cooking beans 1 hour, or until tender.\n",
        "picture_link": "3keH0U84blJ0KCAAkYYXyXWAZ6lKRXW"
    },
    {
        "title": "Cranberry Glop",
        "ingredients": [
            "3 cups fresh cranberries ADVERTISEMENT",
            "3 cups coarsely chopped, peeled apples ADVERTISEMENT",
            "3/4 cup white sugar ADVERTISEMENT",
            "1 cup rolled oats ADVERTISEMENT",
            "1/3 cup all-purpose flour ADVERTISEMENT",
            "1/2 cup chopped pecans ADVERTISEMENT",
            "1/2 cup dark brown sugar ADVERTISEMENT",
            "1/2 cup butter ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a 3 quart casserole dish.\nIn a medium bowl, toss together the cranberries, apples and white sugar. Pour into the prepared casserole. Mix together the oats, flour, pecans and brown sugar in the same bowl. Spread evenly over the fruit in the dish. Pinch off small pieces of butter and arrange them on top of the oat mixture.\nBake, covered, for 50 minutes in the preheated oven. Remove the lid and bake for an additional 10 minutes, or until the top is toasted.\n",
        "picture_link": "hYz1GMvqS9ec16VVX/Iypy5NwLCP5wK"
    },
    {
        "title": "Zippy-Zoo Marinade",
        "ingredients": [
            "3 tablespoons soy sauce ADVERTISEMENT",
            "2 tablespoons barbecue sauce ADVERTISEMENT",
            "2 tablespoons vegetable oil ADVERTISEMENT",
            "1 teaspoon white wine ADVERTISEMENT",
            "1 teaspoon smooth peanut butter ADVERTISEMENT",
            "1 teaspoon corn syrup ADVERTISEMENT",
            "1/2 teaspoon Worcestershire sauce ADVERTISEMENT",
            "2 teaspoons black pepper ADVERTISEMENT",
            "1 teaspoon minced fresh ginger root ADVERTISEMENT",
            "1 teaspoon chili powder ADVERTISEMENT",
            "1 teaspoon onion powder ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a shallow dish, combine soy sauce, barbecue sauce, oil, wine, peanut butter, corn syrup, and Worcestershire sauce. Season with black pepper, ginger, chili powder, onion powder, and garlic powder. Mix until smooth. Marinate meat for 2 to 6 hours.\n",
        "picture_link": "TkiAxAda04lFd.IL0H8zpJq9prhFWga"
    },
    {
        "title": "Awesome Easy Pasta",
        "ingredients": [
            "2 cups chicken broth ADVERTISEMENT",
            "2 cups heavy cream ADVERTISEMENT",
            "8 ounces linguine pasta ADVERTISEMENT",
            "6 slices bacon ADVERTISEMENT",
            "2 cups chopped cooked chicken ADVERTISEMENT",
            "1 cup frozen English peas, thawed ADVERTISEMENT",
            "1 cup freshly grated Parmesan cheese ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring chicken broth and cream to a boil in a heavy saucepan over high heat. Reduce heat to medium-low and simmer until reduced by half, about 30 minutes.\nBring a large pot of lightly salted water to a boil. Add linguine and cook 8 to 10 minutes or until al dente; drain and set aside in a large serving bowl.\nMeanwhile, place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble and set aside.\nOnce the cream has reduced, stir in crumbled bacon, chicken, peas, and Parmesan cheese; cook for a few minutes until hot. Pour sauce over pasta to serve.\n",
        "picture_link": "uFGDHwJUY6QXMe6q7BHhWfLuJJhO1Gu"
    },
    {
        "title": "Basque Salad",
        "ingredients": [
            "1 green bell pepper, thinly sliced ADVERTISEMENT",
            "1 red bell pepper, thinly sliced ADVERTISEMENT",
            "1 yellow bell pepper, thinly sliced ADVERTISEMENT",
            "3 medium fresh tomatoes - cored, quartered, and sliced as thin as possible ADVERTISEMENT",
            "1 large cucumber - peeled, seeded, and thinly sliced ADVERTISEMENT",
            "1 Spanish onion - peeled, cut in half, and thinly sliced ADVERTISEMENT",
            "Dressing: ADVERTISEMENT",
            "1/3 cup red wine vinegar ADVERTISEMENT",
            "3/4 cup extra-virgin olive oil ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/2 teaspoon freshly ground black pepper ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1/4 teaspoon dried oregano ADVERTISEMENT",
            "1/4 teaspoon dried basil ADVERTISEMENT",
            "1/4 teaspoon dried marjoram ADVERTISEMENT",
            "chopped fresh parsley ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large bowl, toss together the green, red, and yellow peppers with the tomatoes, cucumber, and onion.\nIn a medium bowl, whisk together the vinegar and olive oil. Season with salt, pepper, and sugar. Whisk in oregano, basil, and marjoram. Continue whisking until ingredients are well blended and the oil and vinegar are emulsified.\nPour dressing over vegetables, and toss gently with a wooden spoon. Cover, and marinate at room temperature for 1 to 2 hours, stirring frequently. Refrigerate until 1 hour before serving; then remove from the refrigerator, and let sit at room temperature. Garnish with chopped parsley.\n",
        "picture_link": "I3QXIw1eGEBIKkO8CVsHZY7shlFk9bO"
    },
    {
        "title": "Slow Cooker Chicken Chili",
        "ingredients": [
            "1 teaspoon vegetable oil ADVERTISEMENT",
            "2 skinless, boneless chicken breast halves ADVERTISEMENT",
            "2 cups chicken broth ADVERTISEMENT",
            "1 (15 ounce) can black beans, rinsed and drained ADVERTISEMENT",
            "1 (15 ounce) can cannellini beans, drained and rinsed ADVERTISEMENT",
            "1 (14.5 ounce) can diced tomatoes, drained and rinsed ADVERTISEMENT",
            "1/2 yellow onion, chopped ADVERTISEMENT",
            "1 1/2 tablespoons chili powder, or more to taste ADVERTISEMENT",
            "1 clove garlic, minced ADVERTISEMENT",
            "1/2 teaspoon ground cumin ADVERTISEMENT",
            "1/2 teaspoon paprika ADVERTISEMENT",
            "1/2 teaspoon mustard powder ADVERTISEMENT",
            "1/2 teaspoon garlic powder ADVERTISEMENT",
            "1 dash hot sauce (such as Cholula®), or to taste ADVERTISEMENT",
            "1 pinch salt and ground black pepper to taste ADVERTISEMENT",
            "1/2 cup sour cream ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Lightly grease the crock of your slow cooker with vegetable oil.\nPut chicken breasts into the bottom of the slow cooker crock; add chicken broth, black beans, cannellini beans, diced tomatoes, yellow onion, chili powder, garlic, cumin, paprika, garlic powder, hot sauce, salt, and black pepper.\nCook on Low for 6 hours (or on High for 3 hours).\nRemove chicken breasts from the crock to a cutting board. Shred chicken into strands with a pair of forks and return it to the mixture in the crock; add sour cream and stir.\nContinue cooking on Low for 30 minutes more.\n",
        "picture_link": "KHA5dXhnXxHHnXUW3SoQo/2BK7rCFgC"
    },
    {
        "title": "Cowboy Macaroni",
        "ingredients": [
            "1 (14 ounce) package macaroni and cheese ADVERTISEMENT",
            "1 pound extra-lean ground beef ADVERTISEMENT",
            "1 (10 ounce) can canned whole kernel corn ADVERTISEMENT",
            "1 (6 ounce) can tomato paste ADVERTISEMENT",
            "1 (10 ounce) can tomato sauce ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "3 tablespoons grated Parmesan cheese (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 450 degrees F (220 degrees C). Prepare the macaroni and cheese according to the directions on the package.\nBrown the ground beef and onion in a skillet over medium heat until the meat is no longer pink. Drain excess grease.\nIn a 2 quart casserole dish, combine the macaroni and cheese, ground beef, onion, tomato paste, tomato sauce, and corn with its liquid. Mix well.\nBake for 20 to 25 minutes in the preheated oven, or until heated through. Top with grated Parmesan cheese, if desired.\n",
        "picture_link": "cm2BmYx7.t8JFco8ukNGR7se7MyTU.O"
    },
    {
        "title": "Lemon-Basil Quinoa Salad",
        "ingredients": [
            "2 cups low-sodium chicken broth ADVERTISEMENT",
            "1 cup quinoa ADVERTISEMENT",
            "1 large lemon, zested and juiced ADVERTISEMENT",
            "1/2 cup roasted red peppers, drained and diced ADVERTISEMENT",
            "1/4 cup dried cranberries ADVERTISEMENT",
            "2 tablespoons minced red onion ADVERTISEMENT",
            "2 tablespoons chopped fresh basil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring chicken broth and quinoa to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until quinoa is tender and broth has been absorbed, 15 to 20 minutes.\nStir quinoa, lemon zest, and lemon juice together in a bowl. Add red peppers, cranberries, onion, and basil to quinoa; toss to combine.\n",
        "picture_link": "yE36xkr4cb.NpZmWWlRNIWhW9V9Yzy2"
    },
    {
        "title": "Zucchini Summer Pasta",
        "ingredients": [
            "3 cloves garlic, chopped ADVERTISEMENT",
            "1 white onion, chopped ADVERTISEMENT",
            "1 tablespoon butter ADVERTISEMENT",
            "1 tablespoon vegetable oil ADVERTISEMENT",
            "2 zucchinis, thickly sliced ADVERTISEMENT",
            "2 yellow squash, thickly sliced ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 pound angel hair pasta ADVERTISEMENT",
            "1 (28 ounce) can crushed tomatoes ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In large skillet, over medium heat, saute garlic and onion in butter and oil about 2 minutes. Reduce heat, and layer zucchini and yellow squash slices on top of onion and garlic. Add salt and pepper, cover and steam 10 minutes, or until squash is tender.\nWhile vegetables are steaming, bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain. Add the crushed tomatoes to the zucchini mixture, stir and heat slightly, but do not cook the tomatoes. Serve the zucchini sauce over the pasta.\n",
        "picture_link": "E/k96PKNlsd7Q2bhCQqL80TCuNgYspO"
    },
    {
        "title": "Roast Duck with Apple Dressing",
        "ingredients": [
            "1 (4 pound) whole duck ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 teaspoon poultry seasoning ADVERTISEMENT",
            "1/2 tablespoon butter ADVERTISEMENT",
            "3 tablespoons chopped onion ADVERTISEMENT",
            "5 stalks celery, chopped ADVERTISEMENT",
            "3 cups peeled, cored and chopped apple ADVERTISEMENT",
            "3 cups cornbread crumbs ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Rinse duck and pat dry; rub with salt, pepper, and poultry seasoning.\nMelt butter in a small skillet over medium heat. Saute onion and celery in butter until tender. In a medium bowl, combine with apple and cornbread crumbs. Mix together to make dressing (if necessary, add a little water to moisten).\nPreheat oven to 350 degrees F (175 degrees C).\nFill the duck's cavity with dressing, and sew shut with kitchen twine. Rub outside of bird lightly with olive oil, and place in a shallow roasting pan or 9x13 inch baking dish.\nBake in preheated oven for 60 to 80 minutes, or until internal temperature reaches 180 degrees F (80 degrees C.)\n",
        "picture_link": "tX5s9iRpq5pmPl2P9jZQhNd9nHbH31u"
    },
    {
        "title": "Chinese Lemon Chicken",
        "ingredients": [
            "3 skinless, boneless chicken thighs ADVERTISEMENT",
            "3 tablespoons oyster sauce ADVERTISEMENT",
            "1 teaspoon sesame oil ADVERTISEMENT",
            "1 teaspoon white sugar ADVERTISEMENT",
            "1 egg, beaten ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1/8 cup corn flour ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "3 tablespoons white sugar ADVERTISEMENT",
            "1/2 lemon, juiced ADVERTISEMENT",
            "1 (3.4 ounce) package instant lemon pudding mix ADVERTISEMENT",
            "water as needed ADVERTISEMENT",
            "2 tablespoons toasted sesame seeds ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "To Marinate: Place chicken in a nonporous glass dish or bowl. In a small bowl mix together oyster sauce, sesame oil, sugar, egg, salt and pepper; pour mixture over chicken, cover dish and marinate for at least 1 hour.\nDip marinated chicken in cornflour and sautee in a large skillet until cooked through (juices run clear) and color is a nice, golden brown.\nTo Make Sauce: Bring 1/2 cup water to boil in a small saucepan; dissolve sugar in boiling water, then add lemon juice and thicken liquid with pudding mix.\nCut chicken into bite size pieces and pour sauce over all; sprinkle with toasted sesame seeds and serve.\n",
        "picture_link": "ss5SgGoLNUU6vV86Yb95TXayI9JBwv2"
    },
    {
        "title": "Turkey and Provolone Sandwiches",
        "ingredients": [
            "1 tablespoon butter ADVERTISEMENT",
            "6 large mushrooms, sliced ADVERTISEMENT",
            "1 small onion, chopped ADVERTISEMENT",
            "6 hoagie rolls, split lengthwise ADVERTISEMENT",
            "1 pound sliced deli turkey meat ADVERTISEMENT",
            "1 pound sliced provolone cheese ADVERTISEMENT",
            "1/4 cup sliced black olives ADVERTISEMENT",
            "6 slices tomato ADVERTISEMENT",
            "6 leaves iceberg lettuce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C).\nMelt butter in a small skillet over medium heat. Saute mushrooms and onion until tender; set aside. Place bottom halves of bread on a lined cookie sheet. Top each with 1 to 2 slices turkey, mushroom/onion mixture, and 1 to 2 slices cheese.\nBake in preheated oven for about 5 minutes, or until cheese is melted. Remove from oven and top each sandwich with olives, tomato and lettuce. Place top half of bread on each sandwich and serve.\n",
        "picture_link": "5.Ci6nxLaNnjJva4HrNQoc7TJvgTRGq"
    },
    {
        "title": "Chicken Riggies I",
        "ingredients": [
            "1 (8 ounce) package uncooked rigatoni pasta ADVERTISEMENT",
            "4 skinless, boneless chicken breast halves, cubed ADVERTISEMENT",
            "2 cups red spaghetti sauce ADVERTISEMENT",
            "1 green bell pepper, chopped ADVERTISEMENT",
            "1 red bell pepper, chopped ADVERTISEMENT",
            "1 onion, chopped ADVERTISEMENT",
            "1 (8 ounce) package sliced fresh mushrooms ADVERTISEMENT",
            "1 (15 ounce) can sliced black olives, drained ADVERTISEMENT",
            "1 (8 ounce) jar hot cherry peppers, drained ADVERTISEMENT",
            "2 cups Alfredo sauce ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.\nIn a large skillet over medium high heat, saute chicken for 5 to 7 minutes, until well browned. Add spaghetti sauce, reduce heat to low, and simmer for 20 minutes.\nAdd green bell pepper, red bell pepper, onion, mushrooms, olives, and hot peppers. Stir all together and simmer for 40 minutes.\nAdd Alfredo sauce, stir until blended, and simmer for another 10 minutes. Spoon over hot, cooked pasta and serve.\n",
        "picture_link": "3EPw8DnKlhLiAuKoCw1pWZfDVrh9Axm"
    },
    {
        "title": "Yummy Margaritas",
        "ingredients": [
            "1 (12 fluid ounce) can frozen limeade concentrate ADVERTISEMENT",
            "6 fluid ounces beer ADVERTISEMENT",
            "6 fluid ounces tequila ADVERTISEMENT",
            "4 cups ice ADVERTISEMENT",
            "1 lime, sliced ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a blender combine limeade, beer and tequila. Fill blender to the top with ice. Blend until thick and smooth.\nSalt the rims of 2 large margarita glasses. To do so, pour salt onto a small plate, moisten the rims of the glasses on a damp towel and press them into the salt.\nServe the margaritas in the salted glasses and garnish with slices of lime.\n",
        "picture_link": "1NQMsJgSLHvx4obTbpNlr.Z5EnzuHmm"
    },
    {
        "title": "Baked Stuffed Brie with Cranberries & Walnuts",
        "ingredients": [
            "1 small wheel of brie (about 6 to 8 inches), chilled ADVERTISEMENT",
            "1/4 cup dried cranberries ADVERTISEMENT",
            "1/4 cup chopped walnuts ADVERTISEMENT",
            "1 sheet frozen puff pastry, thawed, plus extra for (optional) design ADVERTISEMENT",
            "1 egg, beaten with ADVERTISEMENT",
            "1 teaspoon water ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Score the side of a wheel of brie all the way around with a sharp paring knife. Cut directly on the \"equator\" through the rind. Using a long piece of string or dental floss, wrap the string around the brie on the newly made cut. Loop one end of the string over the other (a half knot). Then pulling the ends of the string in opposite directions, cut the brie in half.\nPress the dried cranberries on one cut side of the brie, and the walnuts on the other. Quickly put the 2 sides back together with the cranberries on top of the walnuts. Press together and stuff back in any cranberries or walnuts that fell out.\nRoll out a thawed sheet of puff pastry on a floured surface to about 1/8-inch thickness. Place brie in center of pastry. Gently pull up edges to ensure you have enough dough to entirely wrap the brie. You can trim off the corners if there is too much dough. Brush the dough with the egg wash. Fold one edge of the dough over the brie and then the opposite side. Fold over the remaining edges and complexly encase the brie. You can trim off excess pieces of dough, if necessary. Flip the brie over so the seam is at the bottom; gently press in the sides to snug the dough against the brie. Brush the top and sides of the wrapped brie with egg wash.\nIf you choose to decorate the brie with cut-out shapes of additional puff pastry, use very cold (almost still frozen) dough to ensure sharp lines. Lightly brush the decorative pieces with egg wash. Place the brie in the freezer for one hour (this is a crucial step; see note below).\nPreheat oven to 425 degrees F (220 degrees C). Line a rimmed baking sheet with parchment paper.\nPlace the brie on the prepared baking sheet. Bake on the center rack in preheated oven until it is browned and leaking cheese, about 20 minutes. (Only rarely does the brie not leak through, but 20 to 25 minutes is about how long it takes to melt the cheese and brown the pastry.)\n",
        "picture_link": "RawaXNQRIahMf0pwUy4BAc0gHcvvoQq"
    },
    {
        "title": "Baking Powder Biscuits II",
        "ingredients": [
            "2 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1 teaspoon salt ADVERTISEMENT",
            "1/3 cup vegetable oil ADVERTISEMENT",
            "2/3 cup buttermilk ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease a baking sheet.\nIn a large bowl, mix together flour, baking powder and salt. Use a fork to blend in the oil. Add buttermilk and stir until the dough comes together.\nRoll dough out on a lightly floured surface. Cut dough into biscuits.\nBake in preheated oven for 15 minutes, or until golden brown.\n",
        "picture_link": "OdcdUK.wxE/9EpF8Sa9glSw4AZFUeSK"
    },
    {
        "title": "Simple Cheese Straws",
        "ingredients": [
            "1 (8 ounce) package shredded Cheddar cheese ADVERTISEMENT",
            "1/2 cup butter, softened ADVERTISEMENT",
            "1 cup all-purpose flour ADVERTISEMENT",
            "1/4 teaspoon salt ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 450 degrees F (230 degrees C).\nIn a mixing bowl, combine the cheese and butter. Blend in the flour and salt. Form the mixture into 6 balls. Roll the balls into slender \"snakes.\" Cut each \"snake\" into 4 straws. Bake the straws for about 8 minutes, or until golden brown.\n",
        "picture_link": "DV5Ls8EaA4dI5mcj6vBn1K1nwq11laK"
    },
    {
        "title": "Holland Butter Cookies",
        "ingredients": [
            "2 cups butter ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 1/4 cups white sugar ADVERTISEMENT",
            "1/8 teaspoon baking soda ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat the oven to 375 degrees F (190 degrees C). Grease cookie sheets.\nIn a medium bowl, cream butter to soften. Combine the flour, sugar and baking soda, stir into the softened butter. Drop by rounded spoonfuls onto the prepared cookie sheet. Press down sightly with a cold fork.\nBake for 8 to 10 minutes in the preheated oven. Allow cookies to cool on baking sheet for 5 minutes before removing to a wire rack to cool completely.\n",
        "picture_link": "/Jz7lsc/p5LdJeui32a7O0YgjQDyWeS"
    },
    {
        "title": "Coffee Cake Supreme",
        "ingredients": [
            "1 cup butter ADVERTISEMENT",
            "1 cup white sugar ADVERTISEMENT",
            "3 eggs ADVERTISEMENT",
            "3 cups all-purpose flour ADVERTISEMENT",
            "1 tablespoon baking powder ADVERTISEMENT",
            "1 teaspoon baking soda ADVERTISEMENT",
            "1/2 teaspoon salt ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1/2 cup water ADVERTISEMENT",
            "1 cup sour cream ADVERTISEMENT",
            "1 cup chopped walnuts ADVERTISEMENT",
            "1/2 cup white sugar ADVERTISEMENT",
            "2 teaspoons ground cinnamon ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9 inch tube pan.\nIn a large bowl, cream together the 1 cup of sugar and butter. Beat in the eggs, one at a time. Combine the flour, baking powder, baking soda, and salt, stir into the creamed mixture. Finally, stir in the water, vanilla and sour cream. In a small bowl, combine the walnuts, remaining sugar and cinnamon. Pour half of the cake batter into the prepared pan. Sprinkle half of the nut mixture over it, then top with the remaining batter, and sprinkle with remaining nut mixture.\nBake for 50 to 60 minutes in the preheated oven. Cool in pan for 10 minutes, then invert onto a wire rack to cool completely.\n",
        "picture_link": "ptncHUh4H616toDox2/KFvYfcleHG2u"
    },
    {
        "title": "Catfish Saint James",
        "ingredients": [
            "4 (8 ounce) fillets catfish ADVERTISEMENT",
            "1 (12 fluid ounce) can evaporated milk ADVERTISEMENT",
            "1 1/2 cups all-purpose flour ADVERTISEMENT",
            "1/2 cup grated Parmesan cheese ADVERTISEMENT",
            "1 tablespoon Italian seasoning ADVERTISEMENT",
            "2 teaspoons baking powder ADVERTISEMENT",
            "1 tablespoon garlic powder ADVERTISEMENT",
            "1 tablespoon ground dry mustard ADVERTISEMENT",
            "1 tablespoon onion powder ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "1 cup butter, melted ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Wash and dry catfish filets. Place filets in a shallow dish and pour milk over them. Cover and refrigerate for 6 hours or overnight.\nPreheat oven to 400 degrees F (200 degrees C). In a large mixing bowl, combine flour, cheese, Italian seasoning, baking powder, garlic powder, dry mustard, onion powder, salt and pepper. Dredge filets in flour mixture.\nLightly grease a rimmed baking sheet and place coated filets in pan. Drizzle melted butter over filets.\nBake in preheated oven for 25 minutes, or until firm and flaky. Serve hot.\n",
        "picture_link": "7NS8JEqFUOTwuSEDK6wkw8NT671z5Qm"
    },
    {
        "title": "Lasagna Cupcakes",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1/3 pound ground beef ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "24 wonton wrappers ADVERTISEMENT",
            "1 3/4 cups grated Parmesan cheese ADVERTISEMENT",
            "1 3/4 cups shredded mozzarella cheese ADVERTISEMENT",
            "3/4 cup ricotta cheese ADVERTISEMENT",
            "1 cup pasta sauce (such as Muir Glen®) ADVERTISEMENT",
            "1/4 cup chopped fresh basil, or to taste (optional) ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C). Prepare muffin cups with cooking spray.\nHeat a large skillet over medium-high heat. Cook and stir beef in the hot skillet until browned and crumbly, 5 to 7 minutes; season with salt and pepper. Drain and discard grease from the beef.\nCut wonton wrappers into 2 1/4-inch circles with a biscuit cutter. Press one wonton into the bottom of each muffin cup. Sprinkle even amounts of Parmesan cheese, mozzarella cheese, and ricotta cheese into each muffin cup; top each portion with even amounts of ground beef and pasta sauce.\nDivide 1/2 cup Parmesan cheese, 1/2 cup mozzarella cheese, half the ricotta cheese, 1/2 the ground beef mixture, and 1/2 cup pasta sauce, between the muffin cups and layer, respectively, atop the wonton wrapper; repeat layering with remaining wonton wrappers, 1/2 cup Parmesan cheese, 1/2 cup mozzarella cheese, remaining ricotta cheese, remaining ground beef, and remaining pasta sauce. Top the 'cupcakes' with remaining Parmesan cheese and mozzarella cheese.\nBake in preheated oven until edges of 'cupcakes' are browned, 18 to 20 minutes; let cook in tins for 5 minutes before running a knife around the edges of the cupcakes to loosen the edges to remove. Garnish with fresh basil to serve.\n",
        "picture_link": "udR.aKupaAK4bh5CFRhcMwlXm9GbxFK"
    },
    {
        "title": "Peanut Butter Bars VI",
        "ingredients": [
            "1/4 cup brown sugar ADVERTISEMENT",
            "1/2 cup corn syrup ADVERTISEMENT",
            "1 teaspoon vanilla extract ADVERTISEMENT",
            "1 cup peanut butter ADVERTISEMENT",
            "3 cups crushed cornflakes cereal ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "In a large saucepan stir together the brown sugar and corn syrup. Cook over medium heat until the mixture comes to a boil. Remove from heat and stir in the peanut butter and vanilla until smooth. Fold in the cornflakes until they are all evenly coated. Press evenly into a 9x13 inch pan, chill and cut into squares.\n",
        "picture_link": "O6dPG2BWoYH2L5Rx48zAU/sHEF9U.n."
    },
    {
        "title": "Super Simple Oven Barbequed Chicken",
        "ingredients": [
            "6 bone-in chicken breast halves, with skin ADVERTISEMENT",
            "1 tablespoon Worcestershire sauce ADVERTISEMENT",
            "1 tablespoon hickory-flavored liquid smoke ADVERTISEMENT",
            "2 teaspoons chili powder ADVERTISEMENT",
            "2 teaspoons ground cumin ADVERTISEMENT",
            "2 teaspoons garlic powder ADVERTISEMENT",
            "2 teaspoons dried thyme ADVERTISEMENT",
            "2 teaspoons dried oregano ADVERTISEMENT",
            "salt and pepper to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 375 degrees F (190 degrees C).\nArrange chicken pieces in a lightly greased 9x13 inch baking dish, allowing room between pieces. Drizzle with Worcestershire sauce and liquid smoke, then sprinkle with chili powder, cumin, garlic powder, thyme, oregano and salt and pepper to taste.\nCover dish with aluminum foil and bake for 1 to 1 1/2 hours, or until chicken is cooked through and juices run clear.\n",
        "picture_link": "ZOCdKnzHfL2qWNj7KlVppaZXP3DhCF."
    },
    {
        "title": "Momma's Healthy Meatloaf",
        "ingredients": [
            "cooking spray ADVERTISEMENT",
            "1 tablespoon olive oil ADVERTISEMENT",
            "1 green bell pepper, diced ADVERTISEMENT",
            "1/2 cup diced sweet onion ADVERTISEMENT",
            "1/2 teaspoon minced garlic ADVERTISEMENT",
            "1 pound extra-lean (95%) ground beef ADVERTISEMENT",
            "1 cup whole wheat bread crumbs ADVERTISEMENT",
            "2 large eggs ADVERTISEMENT",
            "3/4 cup shredded carrot ADVERTISEMENT",
            "3/4 cup shredded zucchini ADVERTISEMENT",
            "salt and ground black pepper to taste ADVERTISEMENT",
            "1/4 cup ketchup, or to taste ADVERTISEMENT",
            "ADVERTISEMENT"
        ],
        "instructions": "Preheat oven to 400 degrees F (200 degrees C). Spray a 9x5-inch loaf pan with cooking spray.\nHeat olive oil in a skillet over medium heat; cook and stir green bell pepper and onion in the hot oil until onion is transparent and bell pepper is softened, 5 to 10 minutes. Add garlic and cook until fragrant, 1 to 2 minutes.\nCombine ground beef, bread crumbs, eggs, carrot, zucchini, salt, pepper, and bell pepper mixture in a large bowl; mix well using your hands. Press meat mixture into the prepared loaf pan.\nBake in the preheated oven until no longer pink in the center, 35 to 40 minutes. An instant-read thermometer inserted into the center should read at least 160 degrees F (70 degrees C). Spread ketchup on the top of the meatloaf and continue baking until bubbling, about 5 minutes more.\n",
        "picture_link": "RwsMwWmH8xmUYk/RxAkBO3Kkt9uUj32"
    }
]